{"text":"Craig and his staff know what they are doing!  This place has seen some changes and although I'd never been there before I heard the stories from the older generations who were skeptical that no one would be able to do homage to what once was while being sustainable to the never generations. Well I'm here to tell you they have!   Good wine - lots of local beers and cocktails looked good two. ( bars upstairs and down ) the menu was classic with upscale dining worthy of going for more than just fish fry. And great service!  I imagine you might want to make a reservation if you are arriving during peak dining times and the weekend - however with the bars there is also ample seating near the front doors to hang if you had to wait a few minutes for your table.   Oh and my mom who had seen it it's Orignal state said they did a good job of keeping the vibe of old school supper club but updated. Exposed stone and wood everywhere with modern fixture was warm welcoming and cozy.   Highly recommend you try it for the first time or try it again if you knew it in another incarnation."}
{"text":"Went in for starters and drinks before a movie. There was a wait so we sat at the full service bar. Starters were fantastic! We ordered cheese and charcuterie tray, beef tartare, warm autumnal vegetable salad, and the parker house rolls. Usually there's a miss but essentially everything was great minus the chicken gallantine on the charcuterie tray (they were out of the rabbit terrine :-( ) I would order the beef tartare and rolls every time and would love to try the other salads if they are as good as the one we got. I can't wait to go back and check out the entrees!  Only quibble was the bartender was pretty slow even when we were the only ones at the bar and wasn't especially friendly compared to the other wait staff which was surprising as a bartender. Interested to see how service is when we go and are seated at a table."}
{"text":"Stamm House reopening a big success!   The Stamm House has reopened with a new menu, chef and manager.  The walleye and roasted potatoes was the best meal I have had for a long time.  The steaks looked great too.  The menu has something for everyone.  Craig, the manager, was very helpful and spent time with us talking about his vision for the restaurant.  The new Stamm House will be a big hit for the Middleton area."}
{"text":"So happy with what they have done with historic building! Just beautiful! It's a gem you have to experience for yourself! Our experience was so delightful. I loved it all. My husband and I were blown away and can't wait to return!!  We made reservations and were seated right away. It was loud, but everything else was so perfect, from the pleasant, upbeat bearded gentleman who waited on us, to the amazing cocktails, decor, presentation, quality...you can tell that a lot of thought went to everything. It made me very happy and still does just thinking about it.   We ordered the Gran Marnier Sour cocktail which was delicious! It was the best cocktail I've ever had. All of their specialty cocktails look divine and I can't wait to try more. If you go, I highly recommend this drink! It's a nice alternative to the Brandy old fashioned.   Our fish came out ten minutes after we ordered. Super Fast! The fish was so fresh! Right from Bayfield, WI. Lightly breaded, so good! Best fish fry we've ever had! The potatoes were delicious. Wow. They had these jam jars filled with pickled vegetables-freshly pickled-just amazing. And the tarter sauce which was so fresh and homemade...best ever. Cute presentation! We were just so blown away with the quality and uniqueness. Mouth watering as I type.   This is my new happy place."}
{"text":"I see that 1847 is closing to \"retool,\" which I don't oppose because I really want to see this place work in my community. It's got some great things going for it: an historic building on a well-traveled street, a beautiful outdoor patio and ample parking. But I have to say, after 5 visits, it's still missing a few things.   1) SEATING THE GUESTS. The first time we went, our wait was 30 minutes. To be fair, the place had only recently opened but here were empty tables everywhere. Everything appeared poorly run. The next time we made a reservation, but still were asked to wait 10 minutes for our table to be prepared. The following two visits were great, which we chalked up to early bugs working themselves out. But last night we went again. Seated immediately (nice!), but the hostess didn't tell the wait staff! We sat for 20 minutes until I went back in and reminded them we were there and finally got a server.   2). COCKTAIL SERVICE. I love a good craft-made cocktail. The \"Scarlet Letter\" is noteworthy! But you've got to streamline that as well. A 10-minute wait for a drink is too long in the thirsty suburbs.  3) NOISE. I know that noise is trendy in the modern dining scene, but people get tired of yelling at each other. The beautiful stone building is an acoustic nightmare, especially if someone in your party is hard of hearing.   So these thoughts if a \"supper club\" is going to work: sit people down, don't forget about them, and bring them drinks right away. They will be happier, kinder to your hardworking staff, and will probably be more open to your interesting menu Then present an environment where they can sit comfortably, converse with their friends, and enjoy a long evening without getting hoarse.   I'd hate to see creative dishes with locally sourced food go away. I'd be willing to pay similar prices (and tip nicely!) if I was impressed AS SOON  AS I WALKED THROUGH THE DOOR by more than just the awesome building renovation."}
{"text":"I've been to 1847 at the Stamm House five times. I kept returning because, while none of the meals was perfect, each time there was something that I really liked: the crispy, golden frites; the warm bread served with homemade butter; the fish fry (the first time I had it, not the second). I kept hoping that the disappointing aspects would be ironed out or improved over time. My fifth visit was this past weekend, and I'm disappointed to report that it was the worst one yet. Where was the delicious bread and butter? And what happened to the frites--these ones weren't golden or crispy at all; they were gray and soggy. I was optimistic about the fish fry because there was now the option of ordering baked or fried, but the baked whitefish was weird. My husband's Lamb Bolognese had an ice-cold pocket in the middle, as if it had been (poorly) microwaved. Our meal overall wasn't remotely worth the $100+ it set us back. We left wishing we had gone to the Free House instead, and spent half the money for better food.  With news of the upcoming \"retooling,\" I will probably try the Stamm House one more time. I would love to have a go-to restaurant in the neighborhood, and perhaps a revamped menu (and price point) could make it work."}
{"text":"We've been waiting for 1847 Stamm House to open. Glad to miss the opening kinks being worked out some reviews mentioned. Went last night, and it was fabulous!! The fish fry was a new take on a Wisconsin fav, a whole piece of whitefish with delicious cole slaw and picked sides. All amazing! Can't wait to return to try the rest of the menu. Maybe on a night that's quiet, if there is one. Glad to see the place was hopping!"}
{"text":"Sunday Brunch.  Really good food, service, and ambiance.  Will definitely be back soon.  I had the Chicken Fried Steak.  The breading was light and crispy and the steak tender.  Needed more gravy though (of course).  The hash browns are ridiculous good.  I would go back just for those.  She had the Benedict.  Big fan of the Hollandaise and the eggs were poached perfectly.  We sat at the bar and enjoyed good, friendly service.  Overall, a great brunch experience and one we'll add to our Sunday rotation."}
{"text":"Big fan of 1847 at the Stamm Haus. Great food, excellent drink selection... happy hour makes even the more expensive items very reasonable, family friendly and welcoming. Great place for dinner, check the menu as it does change seasonally - which in my opinion is nice. The chief does have a great sense of flavor and it tends to be a bit more modern than is usually found in Madison. I remember some excellent lamb meatballs from last fall that were seasoned beautifully with all sorts of spices (yum! I often find food in the mid-west bland).  the servers and bartenders are great - they definitely measure out your drinks, but then often they'll add a tiny bit extra so you don't feel like they are too stingy.  In short, a great place to hang out, the only improvement I could make would be to reverse the parking and the patio (move parking to the front and patio to the back), but overall, a great place, worth the money (yes it is on the upper end of the Middleton dining scale), and a generally enjoyable experience."}
{"text":"Went to the upstairs bar on a Saturday night -- got a seat immediately and had drinks and appetizers and stayed for close to a couple of hours. Kevin the bartender was the best -- the Finn's #7 drink was amazing and you could tell he cared when putting it together and knew what he was doing.  Had the \"Cheeses & Charcuterie\" appetizer and the Red Wine Beef Stew -- the price to value/quality/quantity seemed right in the ball park of where an upper scale dinner restaurant would be.  The remodel of the building had a lot of care put into it -- quality fixtures and design throughout.  All in all, a great experience. I am definitely going back."}
{"text":"Great food, great service and great atmosphere."}
{"text":"The food was very good. I hadn't been there in 20 year or so and the new owners have created a beautiful space. The acoustics aren't very good though and after a rather boisterous large group arrived it was difficult to hear my dinner companions."}
{"text":"Although we've had two good meals here in the last few months, our latest visit was very disappointing. We had a reservation, and were seated promptly but that's about all that went well. It took 2 hours to get dinner served. Most of our drinks were comped and the chef sent a plate of macaron as an apology. But honestly, that doesn't make up for such lousy service. Granted there was a large wedding rehearsal dinner in the next room. But don't assign that server to other tables (ours ) and in fact if you can't handle the party and your regular service don't take the reservation. Most of the food, when finally served was very good. I hope they turn this continuing problem around. Middleton deserves to have a great restaurant in this beautifully restored venue."}
{"text":"Very happy with the food and the service! Will absolutely go back. Great outside seating in summer and the inside looks gorgeous and cozy."}
{"text":"To start, the wine pour was very skimpy. For food, I ordered the prime rib special.  I was \"warned' it comes medium rare, which is how I like it.  It came very well done.  The vegetable that came with it was Brussel sprouts.  I literally received 1.5 sprouts.  The others at my table did not get the special, and were very pleased with theirs.  So order wine by the bottle, and do not order the special!"}
{"text":"friday fish fry was very good. steak was very good. i would not recommend the kids menu. $10 burgers and buttered noodles...... kinda boring for kids.   beautiful location but i think we expected more . french fries were not very special and the coleslaw was pretty boring ."}
{"text":"I really like the updated atmosphere and bar area.  However, I was a little disappointed with the limited menu options and food quality.  We were served bread that appeared to be sesame hamburger buns.  We were hoping for a few more salad and sandwich, and entree options.  I also would have liked to see a couple of the old Stamm House regulars, (e.g. Fried Chicken and Walleye)."}
{"text":"Great food, great service. The ambiance is super cool as well."}
{"text":"Don't understand all the negative response?  Sure it's not your grandmother's Stamm House, but times change.  Place is beautiful, sure it's a bit loud, but the historic ambience can't be beat.  Drinks awesome, service great, the food is amazing! ( best chicken dish I have ever had.) The menu is all local, seasonal and sustainable,so it's clear they care and it's clear they want to share.  You can't find a restaurant like this in Middleton.  Downtown restaurant flare in a rural setting awesome!"}
{"text":"We tried the relaunched Stamm House last night for the first time. They were recently closed for several months to redo their menu, and they've transitioned to more of a supper club concept. The building is charming and historic. We were seated upstairs. It was fairly busy, but not too noisy. We were given a wine and beer list, and I looked for cocktails. None were listed, so I asked our server if they had any special cocktails. He said \"not until next week,\" which I found kind of odd. They have their liquor license, and I saw other customers with drinks. I was hoping he could recommend something to me, but I ended up just getting a beer. As we waited for our food, I noticed other tables around us all had bread baskets. I asked our server if bread baskets were available, and he said \"yes,\" then there was a long pause, and he asked \"did you want one?\" Well, yes, that's why I was asking about it. It was not delivered until our entrees came out. We had two pepper shakers on the table and no salt shaker, and our candle was unlit until the end of our meal (other tables all had lit candles). Despite the iffy service and mysterious lack of cocktails, the food was a true highlight. I ordered the hashbrown encrusted walleye, which came with delightfully seasoned and fresh green beans. I also had the side of brussel sprouts and bacon, which was both sweet and savory. My husband had the burger, which he enjoyed. I would definitely order the walleye again. Overall, this restaurant shows real promise, despite the kinks in service. We'll visit again for the food (and hopefully cocktails!), and I hope in the mean time they'll work on smooth service. I would definitely recommend that anyone in the Madison area give this unique restaurant a try."}
{"text":"Very noisy.... wood and brick interior results in poor noise absorption. Menu was EXTREMELY limited. I had a burger -- small but good. My wife had the strogonoff  which was under-cooked. The third possible main dish was trout and I forget the fourth. That's is. No other main dishes. The desert had no prices. I don't care less about posting prices other that the \"principle.\" We eat out too often --- in and around Middleton. Trust me, this place is a bust.  I can name 4 or 5 Middleton restaurants nearby which beat this place by a country mile."}
{"text":"By far one of the better restaurants in the area. Prices are fair and the food was prepared exactly as ordered.  Order the trout. It's fantastic. And the service was not only friendly but efficient and attentive. A wonderful dining experience."}
{"text":"patio is great and I really liked the new atmosphere they've created.  Food is good but not great."}
{"text":"My wife and I ate here last night. The atmosphere was very nice, along with the service.   We started off with an order of the perogies, which were fabulous! I ordered the walleye with green beans and a side of brussel sprouts. The walleye and green beans were amazing. This was the best fried fish I have ever eaten! The brussel sprouts were good, but a little too much balsamic vinegar on them.   My wife had the burger with fries. The burger had flattened fried cheese curds as the cheese, which is a varsity move. The burger was also very good, along with the fries.   Overall, this is probably the best restaurant I've been to in the Madison area since I moved here two years ago. Great food and atmosphere, large portions, and good prices. Give it a try."}
{"text":"I give this 2 stars because the entrées were tasty, full of flavor, we were seated right away on the large patio on a Su day evening at the dinner hour and the decor i side is cool. Now for why the 3 missing stars. it will be easier to list them: 1) table water was tepid and no ice and never refilled. I see other comments about this. If you can't get this right it doesn't bode well. 2) one drink menu for 3 adults and then waitress  (middle aged and I swear didn't crack a smile to save her life) rushed us on our order even when I said we hadn't  had a chance to pass the menu around. It's an extensive beer menu you want to review. 3) drinks took forever to arrive. My sangria seemed almost sour or like watered down wine with a swizzle stick of fruit and floating apple slices, I never finished it it was so bad. 4) the  bread starter was ok but took forever to come.5) when my greens arrived I had to go in search of salt and pepper. apparently the tables are so small there's  no room for them on the table. 6)while in search of salt I ordered another beer for my dinner companion who was out-no clue where waitress was.7)by the time the entrees arrived ( easily over and hour plus) one of them was wrong. No red wine beef stew but a second order of beef stroganoff.  We took it because the offer to get what was ordered, well god only knows how long that would take. So 2 orders of stroganoff and the poppy seed tagliatelle took 90 min. 8) the beef was really flavorful but there was not enough pasta- like there was a shortage or something.  I'm  not looking for a buffet size serving but really? 9)  we took the check in  to pay. I was done  waiting on this crew/person. For $70+  I don't have expectations of  5* but christ get the basics down. Hire friendly staff who understand service and get some communication with the kitchen.  We won't be back. My husband has no tolerance for second chances -not when there are so many choices in town. I don't know how long they  have been open but if you are going to charge full price then deliver a decent experience."}
{"text":"Great food and atmosphere.  The nostalgic look and feel of the place was great.  I had the hashbrown encrusted walleye, which was delicious."}
{"text":"Excellent meal in a unique historic setting. While heading home towards Chicago area, discovered this gem on Yelp. The building has s lot of history, and beautifully refurbished. We sat upstairs, very quiet ion a weeknight. The lighting was very well done. Now about the food...shared the homemade pierogi appetizer, which was great. Also ordered appetizers as dinner, the crab cakes and Brussels sprout side dish really stood out. Generous portion sizes!  Would definitely visit again if we are in the area."}
{"text":"We went here last night for dinner- I was a little bit hesitant based on previous reviews and we rarely get date nights so I wasn't sure I wanted to risk it. I am so glad we did. The building is gorgeous, the food incredible. We started with cocktails which were small but great, reasonably priced. Then we shared the beef tartar which was melt in your mouth divine. For entrees we had the king salmon and the spring vegetable risotto. I am a salmon fan and have eaten it all over the world. This was hands down the best I have ever had. The risotto was great too. The wine excellent. For dessert we had a tawny port and fresh loose leaf early gray tea which you don't find many places. Most use a tea bag. Profiteroles and Creme brûlée were amazing. Our server was very nice, clearly he was new but he tried hard. I have no problem with servers who are learning as long as they have the right attitude and ours did! Kudos to the chef- we will definitely be going back!"}
{"text":"Spectacular!  Was here for New Year's Eve dinner, now back for my daughter's birthday and it was even better!  Had the crab cerviche, incredibly fresh, restrained prep so it was all about the crab.  Sirloin steak for dinner, quality outstanding, flawlessly cooked (medium rare), served with a greens salad, lightly and perfectly dressed.  Even the salted baked potato and rolls were melt in your mouth good.  Dessert was sublime, rave reviews for the Rum Raisin Brioche Bread Pudding!  See you again soon Stamm House!"}
{"text":"To start with, we were seated at a table right next to the door, where I had specifically requested not to sit since it was 30 degrees outside. The table ended up being tolerable only because there was a heater next to us. I ordered the sirloin medium rare, which came out and was not even rare (almost raw). I sent it back and surprisingly received a fresh plate of food (rather than them just throwing it back on the grill), but again it wasn't cooked. Finally, the third sirloin came out cooked enough to eat and the flavor was good, but I'm pretty sure it was the same 1st dish I had sent back and it had less meat on it. We also both had the coconut squash bisque, which was essentially a thick puree but tasty. My boyfriend had the fish fry and didn't have any complaints. The waiter took my sirloin off the check since I had to send it back twice, which was nice. I'd be willing to give this place another try."}
{"text":"Excellent food and beautifully redone. Service was very good and we enjoyed the creative menu. Homemade pasta was tender and full of flavor, my date thought the duck was one of the best dishes he's had lately. We are looking forward to eating outside again once the weather improves."}
{"text":"I've been to the Stamm house a few times now and felt like I could give it a fair rating at this point.  Located on the west side, the Stamm house offers a woody, cozy, and semi formal atmosphere for patrons to dine. There are two floors with an outdoor seating component for warmer nights.  The parking lot is a little awkward and there are conspicuous speed bumps without warning. One enters through the back of the house and walk to front in order to get service. Tables are too small for parties and makes comfortable dining difficult. Service is a hit or miss.  First look at the menu suggests up scale options with a price tag to match it. Examples of what one should expect include fried cheese curds, crab cakes, french onion soup,  Angus brand steaks, pasta dishes, and fried, baked, or seared fish options. Food quality and costs simply do not align.   Last time we visited, we ordered cheese curds, fried perch dinner, and the steak and shrimp entree. The cheese curds were good: warm, gooey, and freshly breaded and fried. We found, however, that there were many pieces of fried breading the basket without any corresponding cheese, almost like the scraps that should be filtered from the deep fryer were not cleaned up. The steak and shrimp were a let down as well from the start, with a sloppy presentation at its immediate delivery to the table (see pic) and a piece of shrimp that had a black spot on it, implying it's need to have been not used and rather thrown into the trash.  While the Angus brand does imply a certain level of quality per the website, the general texture, doneness, and seasoning were all a let down as well.   I highlight a number of the downsides of the Stamm house but still give it three stars. It has a unique location and a nice atmosphere but overall in need of work. There are better places on the west side for less of a hit on the wallet."}
{"text":"This is a beautiful place. The oven roasted chicken was delicious and the service was warm and inviting. It's worth checking out and I would definitely go back."}
{"text":"Bottom Line (at the top): We were pleasantly surprised with our visit to 1847 tonight.  I've never left a Yelp review before, but I thought the current average  \"star\" rating did not reflect the experience we had, so here we go:  We called at 4:30 for a 6:15 reservation and were told there was nothing available at that time, but they would take our name anyway.  The host said they couldn't guarantee us a table, but odds were good that they could fit us in since it was early in the night.  We showed up and, even though the place was busy, the host remembered our name and sat us upstairs right away.  My wife ordered a Finn's #7 cocktail which was a great drink and I had a Triple Karmeliet (yes, they had it on tap). Both drinks were served in a timely manner and our waters were refreshed regularly.   We both ordered the Cod/Fried Fish Fry.  Both showed up promptly and were delicious.  The dishes were more like elevated fish and chips (with perfectly roasted rosemary potatoes instead of fries) than a standard fish fry.  The meal came with warm, fresh rolls.  The service throughout was on point.  My theory: the locals are not reviewing here on purpose to keep this restaurant a hidden gem.  Whatever kinks existed at the beginning have been worked out...this place is legit.  -Ben"}
{"text":"Love   There  fish fry    There food  is worth  the wait and  the  place  is really nice inside  and out  restrooms  are very clean  I would recommend  it to any one  visiting middleton"}
{"text":"Food was great. Friendly staff. Dinning area could have been quieter, or had background music."}
{"text":"Very good food (probably the best in Middleton). Jose is a great server.  The prices are a bit high, especially for the somewhat small portions. Their burger is my favorite - delicious!. The cocktails are the top notch."}
{"text":"Update-we've returned to the Stamm House 4 times in the last year and the food and service have been consistently good. Tonight we ordered take-out with items from the summer menu-spaghetti with shrimp, Patrice salad and trout dinner. All were excellent and portions were generous. Glad to have this restaurant in our neighborhood."}
{"text":"Simply marvelous. This is such a gorgeous building and they did a wonderful job at making it comfortable and spacious. I had the burger and you will need to pay attention to the cheese curd melted on it. Yum.  Enjoyed the mac and cheese and try the pierogi appetizer. Thats how you make pierogis. My husband had the steak and inhaled the Brussel sprouts. Good drinks and lovely lighting all around. Looking forward to the fish fry!!"}
{"text":"The charm of the old stone, new wood and light fixtures makes for a beautiful atmosphere that is very inviting and welcoming.  We were seated for dinner and ordered a bottle of California wine and Chop salads which were very good as was the sour dough bread.  Our entrees, however, were a totally different story.  We ordered: two Lake Perch dinners (one battered and fried and one pan sautéed), one loaded baked potato and an order of hash browns and two orders of crispy Brussels sprouts with bacon. BOTH of our Lake Perch orders were served BARELY WARM-COOL and VERY fish tasting.  The Mgr. indicated that the Perch had arrived earlier in the day.  The loaded baked potato was lacking with toppings and definitely NOT loaded.  Our Brussels sprouts were way undercooked, they weren't even al dente (Brussels sprouts should be cooked longer than the al dente stage).   Our server was very good and apologized...  but the kitchen was the problem tonight.  This was our first dining experience at 1847 At the Stamm House and unfortunately, probably our last.  :("}
{"text":"Wow!! Our family has spent many dinners at the Stamm House over the years but the new and improved Stamm House is amazing! The exposed original building stone with modern lighting added had us  relaxed and comfortable. Great ambience, perfect for a couple or a family, even a business meeting. Thanks so much for a very delicious, drama free dinner (we've had a couple at other restaurants recently that were subpar) with all we expected plus a scoop of awesome service! Our very friendly and precise server Jeffrey was on point! The bartender served great looking and better tasting cocktails & wines. We ate upstairs and the bar/ booze presentation is a nice backdrop also looked as though they have a considerable collection of bourbon whiskey... Etc.  We ordered prime rib as it's Sat., came with creamy potatoes, steamed broccoli & the best roasted brussel sprouts, great fresh bread and we shared a French onion soup! Finished with homemade crème brûlée and cheesecake!! Yum!  We will definitely be back with friends!"}
{"text":"What a wonderful place.  The interior is beautiful and rustic.  The service is excellent.  I tried the Stamm Burger - topped with cheese curds and bacon aioli.  It was amazing.  My boyfriend had the Friday fish fry special.  They are very generous with the servings - he ended up with so much extra he had to bring some home, which they happily allowed.  We are absolutely coming back."}
{"text":"My sister is here for her yearly visit from NYC.  We always go to dinner with a few of my friends. Last year we had a sub-par experience at Wonder Bar. I had to up my game.  We planned to go to Tornado Room but they were closed for their Super Bowl employee dinner.  I decided to give 1847 at the Stamm a try. The reviews were mixed but the building looked beautiful. So 6 of us bundled up and headed out.  We arrived at 6 pm and there were a few people at the bar and just a handful of folks at a table. It was the evening of the Super Bowl and we cherished the fact that the restaurant was quiet. The building is just beautiful, a wonderful restoration indeed. We were seated upstairs and were very comfortable at the  roomy rectangular table. A couple of folks had a glass of wine and I had a Sazerac, straight up. It was delicious, cold and packed a punch.  We all were more than satisfied with our meals. The Roasted Half Chicken was very moist and flavorful. It was served with spaetzle and a red eye gravy. I got to eat my sisters' leftovers and I certainly would consider ordering this the next time I go. The serving was quite generous. Two people had the Lake Trout which was served with wild rice, cauliflower, mustard greens and squash. They both found the fish and accompaniments to be perfectly prepared and seasoned.   I ordered the mussels and frites. I am really picky about my mussels. Although the mussels were somewhat small, they were prepared with love. The mussels were cooked in a luscious broth of absinthe, charred leeks, chilies, garlic and sherry butter. Nestled in the good sized bucket of mussels was a lovely piece of toasted baguette which I used for dipping. The frites were \"to die for\". I salivate thinking about them.  The group split some yummy profiteroles and the rest of us shared a little apple flan that didn't seem like a flan at all. Whatever is was, it was tasty, light and lovely.  I know that there have been quite a few damning reviews of 1847 at the Stamm House. I was hesitant to give it a try. I think we were lucky to be there on Super Bowl evening. We had excellent service and the food pleased all 6 of us, no small feat. We were given a little tour and got to see the \"cave\" which a windowless stone room. I thought it was charming and might increase the chances of a big group (up to 10) being able to hear each other on a busy night.  I hope the restaurant will find a way to control the din when they are full. They need to provide the excellent food and service we received, each and every night. They could be one of the standout restaurants in a very crowded Madison field. I look forward to my next visit."}
{"text":"As our server approached our table for the first time, about 5-7 minutes after we were seated, the first thing out of the server's mouth was a personal anecdote about his son rather than asking how we were and whether we wanted to start with anything to drink.   We waited 20+ minutes after ordering for the soup and salad course. The prime rib was dry, horseradish sauce was bland, the burger I ordered medium-well came to the table well-done.  Brussels sprouts were undercooked. Each time he approached our table after the food was served, our server made comments about how his \"mouth was watering,\" and how our food \"looked very good.\"  When I'm at a restaurant, I don't want to be told how my food looks when it is served, or how much the person serving my food wants to eat it. Very unappetizing and unprofessional, and we will not be back."}
{"text":"I was looking forward to trying this place out since the review in the paper sounded promising.  I was sadly disappointed.  First off, the reservation system needs work.  If you reserve online, you may need to call to make sure they record it.  Second, the upstairs back room is cold and loud.  There are many stairs, so if you have limitations be sure to remain on the main level.  Third, the bar area is very small.  Don't plan on having a drink before dinner.  And lastly, the Friday fish fry was a bit bland and everything was room temperature.  The fish was no where near the temperature it should be.   On the plus side, our server was extremely nice and accomodating.  She was attentive and tried to correct any issues we had.  However, only one piece of fish out of twelve managed to be hot.  In an area where fish fry's are abundant and well done they really miss the mark.  At the price point they're at I expect much better.  Unfortunately I cannot put Stamm House on my list of places to return to."}
{"text":"We went here for brunch during a Green Bay game, so it wasn't very crowded. The building itself is a great setting for brunch or dinner. The brunch menu wasn't brimming with options, but the choices offered were what our 'brunch hungry' group was looking for. The waffle was delicious, and the home fries/potatoes were very tasty. Our group of 8 was handled well, and I'd definitely head back to check out the dinner menu or get a solid brunch."}
{"text":"We came here for Friday Fish Fry about a month ago. The inside is beautiful, and the overall experience was pleasant. The all you can eat cod was just OK. The batter was soggy, so in terms of the FFF experience, it was sort of a downer.  The sauteed spinach and the brussel sprouts were on point. I think this place is worth a try, but I'd need a different reason to come back."}
{"text":"We decided to try 1847 at The Stamm House for dinner Saturday night. The building itself is striking and beautiful. Stone walls, gorgeous wood flooring, it's been elegantly restored. As much as I love the renovation work, I found it lacking in two areas. First, we were near the windows and as the sun went down it became increasingly dark inside. There are lights on the inside but they need to add lighting near the tables by the walls. I had a difficult time reading the menu. Second, it was incredibly loud in the dining area. Although I enjoyed seeing the restored ceiling, it was very difficult to hear, so some sort of noise dampening technology would be helpful.  To drink we ordered Haven on Earth which was rum, lime, elder-flower liquor and soda and a Maple Bourbon Old Fashioned. The Haven on Earth was light and slightly sweet. The bourbon in the Old Fashioned shined.  Our appetizers were the Shrimp Cocktail with Hot Spicy Cocktail Sauce and the Meat and Cheese Plate. There were five shrimp, all very sweet with good texture. The cocktail sauce was tasty but not particularly hot nor spicy despite what the menu claimed. The meat and cheese plate included four cheeses. All very good and one even had crystals. There were three sausages plus prosciutto. Three slices of grilled crostini, stone-ground mustard, and a sweet fruit marmalade. The menu said it includes pickled vegetables but there were none. I would order both of these appetizers again although I would like to see the pickled vegetables and a spicy cocktail sauce. For entrees we had the beef tenderloin with whipped potato and Brussels sprouts and the fried smelt basket. The smelt was lightly breaded, perfectly cooked and not greasy. The flavor and texture of the tartar sauce was excellent. The fries were crispy, crunchy, and yummy. The smelt basket was everything I hoped it would be. The tenderloin, potatoes, and vegetables were also perfectly cooked and very tasty.  The bread and butter were a bit disappointing. Although the butter looked creamy, it was nearly frozen solid and thus hard to spread. The bread without butter was underwhelming.  Other than the bread and butter, I thought the food was all very well done. I do wish the appetizers would have matched the descriptions in the menu better, BUT they were very good so just updating the menu to match the food would be fine.  Our server was friendly and fairly prompt. They were pretty busy while we were there so it did seem a little slow at times.  I would go back and I would order the Smelt Basket again."}
{"text":"We had a great dinner at the Stamm house four of us went for dinner and every meal was great. The hash brown crusted walleye was amazing so flavorful and delicious, the New York strip fantastic tender flavorful you get 2 sides so I had the macaroni and cheese and Brussel sprouts with bacon. AWESOME!! My husband had the pasta special with shrimp he said it was very good, but the temperature could have been warmer the same with my steak other than that I give this a 5. We will be back to try something else on their new menu. The atmosphere is great old world charm with great coctail's and service.  GG"}
{"text":"We had high hopes for this place. We took 7 people to dinner. Liked the look of the redone building.   The presentation of most of our orders was nice on the plate. But Unfortunately the food itself and the service was not up to speed.  Of the 7 of us we had trout, smelt, chopped salad, Brussels sprouts, Mac and cheese and onion soup.   We were disappointed  with the over all quality of the food.  And left our plates half full.   We did enjoy the cheese curds.  One of our guests asked the server to explain what a supper club was.  She had no idea but did go ask and same back to explain what a Supper Club beer was like.  Honest mistake.  But seems spot on given our experience. Sadly we likely will not return anytime soon."}
{"text":"Great experience at Friday night fish fry. Beautiful interior, very good service and tasty food. The kids menu was great, but would like to see a drink included in the price (my daughter ordered a soda that cost almost as much as her meal). Speaking of prices, I would also like to see prices for fish fry lowered -- the restaurant says the fish is \"all you can eat,\" but the amount served was plenty for me and my husband. I would prefer variable pricing where a diner could choose a smaller or larger serving.  But overall, we had a great time and will return."}
{"text":"Absolutely amazing food. Had the lamb bolognese the other night and it was phenomenal. Also tried the tarragon Manhattan and it was quite superb. Definitely will be returning to this fine establishment!"}
{"text":"We're rooting for you 1847!  Keep in mind they've only been open a week so they're still ironing out the kinks.  Great interior renovation though the parking lot is still vintage Stamm House.  Limited menu which I assume will either rotate or expand slightly.  When you only offer four entrees you don't have any room for duds. Sunday's four offerings were steak, trout, burger & frites or tagliatelle with mushrooms & asparagus. We opted for the burger, tagliatelle and started with the onion tart & lamb meatballs.  I assume the onion tart was intentionally served cold though it would have been better warm. As the other reviewer stated the lamb meatballs were indeed over cooked and on the cold side.  The burger was decent though messy to the point of requiring a fork and knife. This was mainly due to the perfectly poached egg on top. The gentleman sitting across the room from us learned the hard way and wound up taking a shot of egg sploosh to the chest. The frites were okay but not on par with Brasserie V.  The tagliatelle had some decent mushroom flavor but it was cooked somewhere between al dente and raw.  The staff were all great though appeared a bit shell-shocked from from what appears to have been a crazy, busy week for them.  I plan to go back in a month or two in hopes that things settle and they hit their stride."}
{"text":"The Stamm House is an absolutely charming venue. The food is pretty good as well. The chef does a fantastic job. The green and apple salad was nice. I did get a bite that was very salty but otherwise an interesting flavor profile. The prime rib dinner was very good. The prime rib was tender and flavorful. The accompanying potatoes and vegetables were light on the vegetables. Wanted to get dessert but the service precluded this...  Which brings me to why I can only give this place two stars for now...  At a restaurant of this caliber, I do expect a minimal level of competency in the service. The wait staff are the face and personality of the establishment. I think the best way to sum up our waitress was \"bless her heart.\"  The first clue was after she described the specials for the night. She immediately and awkwardly and silently just walked away. A reasonable interaction would have been to ask if we needed a moment or to ask for a drink order. Even a \"I'll be right back\" would have sufficed.   She returned a while later and asked for drink orders. While my friend was telling her her order she was clearly not paying any attention - looking at another table - and had to ask for the order to be repeated. Seriously?  She did get the orders correct which I guess was a positive. During the dinner, when we were finished with the plates mostly, she would walk by, look at us, not say anything and disappear. Head scratching... Maybe interpersonal interaction was not her forte? She seemed perfectly nice just completely awkward and aloof. It bothered me that there wasn't better screening and that there was not better training.  The final straw was when she brought out a check without asking if we needed anything else or if we would like to order dessert. I had overheard another waitress describing the profiteroles and was completely craving them. I could only shake my head.  The food was good enough to warrant a second chance but the service completely dampened the experience. I would even go as far to say that if I were seated with the same waitress I would ask to have another server or leave..."}
{"text":"Excellent meal last night. Party of four,we were seated at once. Waitress was also very good. Great meals all around. One trout,one perch,one filet and one strip steak all done to perfection. The hash browns were very tasty."}
{"text":"So disappointed. My wedge salad was literally a head of iceberg lettuce with a garnish of topping. Fish fry tasted like grease; tarter sauce had no flavor. I ordered a Tito's martini; i questioned whether it was Tito's, the waitress confirmed. It was either extremely poorly made or not Tito's.. it was a martini!  Will not be back, heard this place was 'one of Madison's  best'. So glad I didn't bring clients here, I would have been totally embarrassed."}
{"text":"My girlfriends and I went for dinner and cocktails. We decided to go with appetizers since the dinner menu only offered 4 options. Lamb meatballs were over cooked and cold. The Artisanal meet and cheese platter only offered 4 small pieces of crostini !! We asked for more bread..how were we supposed eat what was offered. A basket of bread cost us $4...really? Don't even think about taking your kids...there's no kid menu. Overall experience was not great, really hope they can turn it around. The plus side...great renovation with nice fixtures."}
{"text":"So I really want to give this place 5 stars. The food was extremely good, the drinks were perfect, the atmosphere is great. The service is the only thing that held this place back. It wasn't as if the service wasn't good, it was just pressed. They didn't have enough people on hand to truly make this experience top notch.  Having stated the only negative thing about that quiet Tuesday night, I will go into the reasons I will be back. The food here was perfect. I had the Cheeseburger which was perfectly cooked, and is still on my mind almost two weeks later. They had, and knew, the whiskey's that they had on hand, which while sounding simple is often screwed up by many places. My wife also ordered a heavily modified Wedge salad, and even though the waiter was pressed for time, it came out just as ordered. Our other guests also found the food to be memorable. I'll no doubt be back, and am so happy we stumbled upon it."}
{"text":"I had high hopes that these guys would do right on their recent do-over.  Sadly this is not the case.  We went on a typical mid-week night - they had a good crowd but were far from crowded.  We were told we could sit at the upstairs bar, but when we went there, \"no there's no bartender up here\".  Ok so we found a seat at the downstairs bar we were immediately told by the bartender that he would be right back - before he even said hello or here is a bar menu.  He gave us the latter when he returned, them disappeared again, suffice it to say he was overworked by an average sized crowd.  A good bartender could have managed it.  He could not. We asked for a cocktail menu, \"we aren't doing that yet\".  Ok.  The one good thing about the previous rendition was they had good drinks and good 'tenders.  On to dinner. The place is still pricey though they added a cheap burger and a spendy brat ($8!). The hash brown crusted walleye was very good.  The ribeye (that is more like a filet) was slightly more rare than it should have been and tough.  The lack of marbling made it less than flavorable....so why not dress it up with the brandy peppercorn topper?  It was awful.  Tasted like a brown sauce from Perkins with the added dimension of too many whole peppercorns to make it a serious problem to eat without gagging.  Come on guys, I wish you the best, but you started slow last time as well and this just won't cut it.  The Madison Sourdough bread is a winner, I'll give you that!"}
{"text":"We've been here a few times and keep coming back to give it a try in part because we love the patio. We stopped for their Sunday brunch today and were very impressed. I had a perfectly prepared roasted beet salad with delicious blue cheese, thinly sliced pears, and walnuts that were fresh and flavorful but not candied, thank goodness. My husband's eggs Benedict with slices of roasted tomatoes was delicious. In retrospect, he would have asked to swap the hash browns for mixed greens. We will definitely make a date to stop back soon to sample the lunch and dinner menus. Highly recommended!"}
{"text":"Loved this place...delicious beef stroganoff with a ton of food for $18. The happy hour 1/2 off taps is wonderful. The service at he bar was spot on and gracious. Enjoyed myself and will be back to eat more..."}
{"text":"Could be the most comfortable atmosphere for a November dinner. Great Walleye!  Looks like a patio for summer, but we just found this place. We'll be back."}
{"text":"Better, but not great. One bartender for the whole place this night. Very slow until the crowd thinned out, a Friday. The place is beautiful but we came to eat. The fish fry is perch either fried or pan fried. It was good but the tartar sauce and shrimp sauce was terrible. The white stuff was mayo with some pickle relish in it and the shrimp sauce nothing more than catchup with some horseradish mixed in. What is so hard about making these two things like they do at all of the good fish places? It makes the meal. There was no love in the making of these. A side of brussels sprouts was five bucks but very good. Perfectly cooked with some bacon which made it very tasty. Mashed potatoes, if you order it instead of fries was cold but eatable. It was pricy. Either 21 or 25 bucks, I can't remember,  makes it a fish fry I won't be coming back to. Another pet peeve of mine is the table water. It had that old potato taste that comes from either a dirty ice machine or dirty water filters. Lots of people don't notice this like my wife but I sure do. The service this night was excellent and the two deserts that were ordered were very good I was told. I did not eat any. The other two choices for fish was a smelt basket and hash brown crusted Walleye which didn't appeal to me. All in all the place looks nice and I hope they make it this time with the new chef and better service. For the price of the fish fry it was not worth it to me. Maybe some of the other choices would show what this chef can do but those two sauces with the fish really turned me off. It should have been better."}
{"text":"I'm not going to dress this up at all. The experience was so poor from the get-go that I started taking notes. I've eaten at the Stamm House over the past 30 years. No, I'm not a professional (or amateur) critic. Yes, I've eaten at cheap places with great food, expensive places with incredible food, expensive places that serve heaps of pretentiousness and little else and holes in the wall that only a rat would eat at. I've multiple decades working in the restaurant industry both directly and indirectly and know what works, what doesn't, what is good and what isn't. All this being said; here are my notes... verbatim:  Inconvenienced by our presence Overpriced plates Had to walk by a table of people eating upon entering Sat by a generator Chairs in stacks in the seating  Kerosene smell from table \"candle\" Felt like we were annoying our waitress by ordering Driveway/parking lot need a resurfacing/reworking desperately Rolls appear to be hand made Rolls were stiff and chewy Outdoor tables are  flimsy, loud , small The table we sat  at was bent and nearly dumped a glass of water on the floor When we addressed or waitress we were told \"yeah,some of them are bent. \" Did not appear to be one bit of concern or care about the issue Salt is in a grinder but appears to absolutely pour out Steak overdone. Closer to well than medium Weird pink butter on top Ribeye was neither cut well or flavorful The schnitzel was tough Schnitzel breading was very nice Spatzel was just plain weird/wrong Potatoes were ok Manager made excuses when showed the list Manager asked us to give them another try  And now some additional notes to clarify the above.  When entering the restaurant you immediately walk into a dining area and after navigating through tables you arrive at the rear of the host's stand. Huh? Who designed that? If the prices were approximately 2/3rds of what we paid a lot of the food complaints could be forgiven. The prices aren't so the forgiveness is not forthcoming. The manager attempted to explain the generator next to the table by saying that it must have been the only table left on the patio because it's the last table they seat. I don't know if it was the last table but I would recommend that never seat anyone there until they fix the noise issue. He stated that they were going to put up a nice trellis, I suggested they put up a 4x8 sheet of plywood in the meantime. Having a jumble of chairs in a dining area is just goofy. For the prices on the menu and the \"special experience\" I shouldn't be visually assaulted by a \"storage area.\" While it was still plenty light out the busboy/runner came out and lit the \"candle\" on our table. It put out a horrendous kerosene odor which immediately fouled the flavor of anything in our mouths. The waitress had a sour attitude from the moment we met her. Most of the other employees seemed pleasant enough but it was obvious that none had ever worked in an expensive/high-class environment as they made small but obvious mistakes in courtesy and manners. Getting into the driveway is confusing as there is a divider of sorts that makes you feel like you are either on the wrong side of the entrance or about to drive onto/through the patio. The parking area itself needs to be completely resurfaced. It's exactly as I remember it from more than 20 years ago (yes, really). While the first thing we received was rolls and they appeared to be hand-made at first they were quite hard and chewy. There was nothing \"hand made\" about them. After reading another review they seemed very close to the kind I've had from Copps bakery. I like the Copps bakery rolls, just not with my $50 dinner. The patio tables are abysmal. Truly an awful choice for a classy, experiential place. They are far too small for a pleasant dining experience. They are flimsy inasmuch as the move too easily. They are loud because they are pure metal and had no tablecloth on them. Every time a glass, silverware, plate, salt shaker, etc, was set down it was a clanging sound which subtracted from a nice meal. Worse yet was the fact that our table was bent on one portion and nearly dumped a water glass onto the ground. I have no idea how my mother was able to catch it but I'm glad she did. We mentioned the bend in the table (which was plainly obvious once you knew where to look) and we were greeted with \"oh, yeah, a lot of them are bent.\" Seriously? Time for some new tables, new help and new attitude."}
{"text":"After writing a not-so-hot review recently of the Stamm House, I was contacted by owner Craig, who apologized for the service we had that night and invited us in for a meal on the house. My husband and I went back and had a lovely dinner on the patio. Our waiter Brandon was quite attentive and professional. We ordered the whitefish chowder and French onion soup to start--both really great--then the trout and NY Strip for entrees. The steak was perfectly done and was well-seasoned with a nice peppery flavor. The trout, in my opinion, could have used a bit more seasoning. It was cooked well, fresh, and had a nice creamy sauce; however, I was expecting a bit more piquancy considering that it was a lemon caper sauce. The drink menu is impressive, with a great selection of beers on tap, cocktails, and wines; I got a beer and hubby tried a couple of cocktails, both very good. We very much enjoyed the patio setting; it's probably one of the nicest places to eat outside in the Madison/Middleton area.   I'm impressed by the Stamm House's owner's efforts to please his customers and, given the quality of the food and lovely atmosphere tonight, I'm willing to think that our rocky experience the first time was a fluke. Would definitely recommend."}
{"text":"I've been waiting for a while to try 1847 and the opportunity presented itself when I was going to meet a girlfriend for drinks and she lives in Middleton so perfect!  It was too cold to sit outside so we headed to the upstairs bar.  I immediately liked the atmosphere...the old farmhouse vibe and decor was very welcoming.  We had some drinks- I stuck with beer and they had good choices on tap.  My friend opted for a few types of mixed drinks which she said were just ok.  I saw a lot of good looking dishes come out of the kitchen but opted for the burger.  It was delicious- one of the best I've had since moving to Madison.  I would definitely recommend this place and will def be back!"}
{"text":"A big thank you to the owners who kept the original building in your decor plans.  Very well done. \"The Stamm House\" has been an icon in Middleton for many decades.  It is so great to see it back in business again.  It has been several weeks since you have opened, and tonight showed you have no \"opening kinks\" remaining.  There was a group of 7 of us(w/o reservations) and we were accommodated right away and outside. The cocktails were very good, but a bit pricey at almost $8 for a mojito. I ordered the \"Beet Carpaccio\" for $10, and very tasty.  The beef stroganoff was the special and looked awesome as well.  The menu offers slightly different versions of the typical restaurant fare and many original dishes too. The service was awesome, our waitress was more than accommodating and friendly."}
{"text":"I've been to the Stamm House a dozen plus Times over the years, and something has changed, not for the better. The $25 Friday night perch meal was overpriced, underwhelming and a disappointment.  With two of us topping the bill over $85 with a beer each, an app and a fish fry, I'd call it the most money I've spent for less than average food in 27 years of Madison dining. In other words, when people ask where the worst fish fry is in Madison, this will be my answer. Go anyplace else, pay $10 to $15 less, and enjoy the food more.  I posted my original review one month ago, with more details, and the owner used my phone number from the reservation to call me and dispute it. The perch is not the fish fry. Noted. And uncomfortable.   He could narrow down the review to me in particular, because frankly, there were only three or four people left in the empty restaurant at 8:20 on a Friday night. If a place is selling out, raise the prices...but opposite goes for a near empty restaurant.  The owner offered to make it right, which seemed like code for free dinner to take down my review. I declined, and asked him to lower his prices. It would be a 3 star meal for $12.50.  He said he would remove perch from the menu. A month later, it's still there...now I'm re posting a much less helpful review about process than mediocre food at a high price.  TDLR: You pay a lot for 'ambiance', not for good food. Share a bad review on Yelp, owner will call you directly and lie to get you to change it."}
{"text":"We tried Stamm House again Friday for the first time since it reopened.  Close, but no cigar.  The food was good (except for the walleye) and the menu has been reworked so that it is much better.  However, the cocktails were weak (no discernible alcohol).  Service was terrible.  Server forgot our salads, and the fish fry was all you could eat; however, good luck getting a refill.  We had trouble getting refills of anything actually and of course the extremely loud acoustics has not been dealt with and should be.  My ears are still ringing. I hope the owners can pull this together because it is a beautiful location but they are not there yet."}
{"text":"Went for my birthday dinner tonight. We both had the sirloin, mine was perfect, cooked well and very tasty, whereas Linda's was tough and very chewy. Her wedge salad was good, about 1/2 a head of lettuce. Surprised they didn't offer me dessert on my birthday. Will probably give them 1 more try.  The rework on the inside is very nice but the tables for two are very small and congested."}
{"text":"Everything was good, but they don't cook their steaks sous vide so half the steak ends up overcooked, and the brownie came with kool whip instead of real fresh whipped cream.  The fries are now normal fries instead of the floppy garbage they used to pass off as frites.   The old fashioned was one of the best I've had."}
{"text":"Stopped in for dinner twice now. Both times we've had excellent experiences. Their extensive renovations to this historic building are gorgeous! Great re-purposed details like the light fixtures in the upstairs dining area. The Moroccan Meatballs are a great little bite. Also, the grass fed burger might just be the most amazing bacon cheeseburger I have ever had! The bacon and onion marmalade in combination with the mornay sauce really make this burger something special. Still need to come back to try the chicken and dumplings, which are apparently prepared just like the Stamm House would have served back in the day."}
{"text":"Great steak, great service and such a unique part of history! Will be back! The owner came up after and made sure we happy with our meal and greeted us!"}
{"text":"This place is gorgeous. They've redone it so nicely, and the dining areas really add to the meal (which is FANTASTIC anyway).  I had the trout dinner and some hibiscus lemonade--yum!  The staff are very attentive, and I love that almost everything is local farm-to-table.  There's lots of parking in the lot behind, but beware the exit--there are potholes the size of Montana!"}
{"text":"Came by on a Sunday morning. Made a reservation but discovered it's not busy at all which is nice for a quiet bunch spot. Service was fast and the waitress was very friendly. Got the eggs Benedict and chicken fried steak. Both were delicious. Poached eggs were just a touch over (didn't ooze over the rest of the English muffin but also not solid yet).   The interior is very nicely renovated. I believe they were closed for a few months to get that done. This is definitely a place to try again for brunch/dinner."}
{"text":"I too am hoping that this unique and beautiful restaurant works out the kinks and begins to perform up to the high expectations.  My wife and I experienced the same problems during week #1 that the other reviewers have described (e.g. the relatively expensive burger and not-so-good white fish). We loved the atmosphere, albeit a bit too noisy, but the food and the service didn't measure up to the competition that day.  I suggest the chef and servers visit Brasserie V to experience another way of doing things! Their best burger is actually worth $12!    We are looking forward to our next meal at the Stamm House and are sure we will experience a marked improvement in all aspects of the dining experience!"}
{"text":"I'm so impressed with the look of the place...but that was about it.  It wasn't worth the higher price tags on the small menu.  And it was LOUD.  We left after drinks and 4 apps to go have dinner somewhere we could talk.  None of the 4 we chose was memorable or even good, to be honest.  Our server was not suited to a place this pricy either.  Again, beautiful job with the building.  I would definitely return for drinks and maybe dessert but never again for dinner."}
{"text":"We had a great sampling of the menu. The beef stew was a great value at $10 and really good and well seasoned. We had plenty to take home. The nightly special, chicken and dumplings was exceptional. I was stuffed but couldn't bring myself to put my fork down.   Why were we so stuffed? We started with an order of  farmer's vegetables and an order of spaetzle. The vegetables were $5 and really good - a sautéed medley of cauliflower, Brussel spouts, beets, zucchini, and onions. The Spartzle was really good - as good or better than anything I had on a recent trip  to Germany. The rolled were crusty with a hint of sourdough.   A bonus here is that The Stamm House is open until 10pm including Sunday's. Our waitress said they source locally whenever they can and you won't see a Sysco truck in their parking lot."}
{"text":"Went early on a Friday night (5:45pm-ish) and got right in.  They seated us in the upstairs dining room, which is GORGEOUS!!  This place has so much character.  There's not much on the first floor, except a few tables and a cute and cozy little bar (which I probably could've sat at all night). The service was quick and excellent.  I had the crusted walleye, which was outstanding.  It came with green beans (accompanied by some very tasty bacon pieces).  My date had the fish fry, which he thought was really good as well.  Will definitely be trying this place again.  It just has such a cool ambience!"}
{"text":"We had a really nice dinner here the other day. The building is lovely; we asked to be seated upstairs and got a great corner table by the bar.  The drink prices were so good I might come back for that alone. There are some great bargains in the bottled beer selection.  The food was great, we all got the prime rib special, and the server was very friendly and attentive. Thanks for a lovely dinner."}
{"text":"Held back on trying this place until any new restaurant kinks were worked out, and can now report that whatever the issues were in the past, this place is pretty nice now!  Portions were generous, quality was high, and prices were in line with what you would expect for what was delivered!"}
{"text":"We went out to dinner as a party of four with a two week old infant.  Although the restaurant was very busy, they were extremely accommodating in finding a table for us that was a little more secluded and baby friendly. Overall their service was outstanding.  Two people in our party had their chicken, one had the Friday night fish fry, and one had their house cheeseburger. All food was served with an extremely appetizing presentation and was served hot and delicious.   We believe that we were treated extremely well.  Our overall opinion was that this restaurant is a class act and we would definitely go there again."}
{"text":"We had the breakfast sandwich, the beet salad and the eggs Benedict, and I really enjoyed every one of these dishes. I however would have loved to see more beets in the salad. The building was gorgeous, and the atmosphere of the place was great!! It took a while to get our food, but overall I had a great experience with great service."}
{"text":"I brought my Mom here when she was visiting. We both had burgers and fries, which were delicious. My burger was cooked perfectly. They have a great selection of microbrews. The interior of the restaurant was beautiful, with a lot of original architecture from when the building was built. I can't wait to come back and try some of their wines."}
{"text":"We had been waiting for the opening of the restaurant with great anticipation and high hopes. Sadly our expectations were met with a very disappointing evening. When a restaurant presents a very limited menu with only four mains, they better be outstanding. In this case they weren't even average.  The salad that we received was quite good and the dressing was tasty. The rolls that came to the table were anything but impressive. They looked and tasted like they had come out of a plastic bag from the local Copp's grocery store.  The special of the evening was wiener schnitzel. As this is one of my favorite dishes, I quickly decided that would be my choice. Expecting to get a kitchen breaded and pan fried tender piece of meat, I was greatly disappointed when a deep fried heavily breaded chunk of crusty previously frozen entree appeared. After cutting into it, I determined that I had gotten better pork tenderloin sandwiches at a truck stop, and for a better price.  My wife ordered to pasta dish from the main menu. It basically consisted of mushrooms and noodles in a sauce. She enjoyed it, but it was certainly nothing special.  The service was ordinary and not up to the standards of a place that is billing itself as a \"special\" experience. They seemed to be way overstaffed, with two bartenders and six servers for an upper level that only has about 20 tables.   The wine and cocktail was very good - about the best thing that can be said for the place. That and the remodeling has been a vast improvement over what the old Stamm House looked like.  Sorry, I doubt that we will ever go back unless they get a new chef and a new menu..."}
{"text":"My wife, son, and I really enjoyed our visit. My son had the Stamm Burger and really enjoyed it. My wife had the Walleye and loved it. I had the perch. I like my perch without any taste of oil to the batter and this had a very slightly oily batter; but I enjoyed it none-the-less. The building has been restored to an amazing beauty. The service was excellent. My wife and I do not drink alcohol and the bartender put a lot of effort into producing an excellent N.A. Old Fashioned and N.A. Mojito for my wife and me. The manager/owner stopped by twice to touch base. All-in-all, very well done. Applause, applause Stamm House! Thank you!"}
{"text":"After a long, hard day at work, this was a wonderful respite.  My server was terrific in just letting me idle and unwind.  There was no hurry to rush and get out for the next guests.   My cheese plate was a delicious starter and enjoyed on the porch.  The sun was going down and it was slightly too chilly to sit outside.  My server kindly moved me inside.  He knew I had a stressful day and suggested sitting on the main level since the 2nd level was getting busier and louder.  My dessert of the Chocolate Crisp was to die for, especial for us chocoholics."}
{"text":"I was visiting from out of state and had this place recommended for a Friday night fish fry. What a mistake.   I was told over the phone that the Cod fish fry was $15.  In person we were told the Cod cost $16 and the Bluegill was $18.  When the bill came I was informed that the Cod was $18. For one lousy piece of Cod.  Outrageously overpriced.  I also ordered a Moscow Mule. That was served in a glass, instead of the customary copper mug."}
{"text":"We have enjoyed our 4th visit to the new Stamm House this evening. Wonderful fish each time. The slaw was good opening day and even better today. We are so lucky to have Chef Nick leading this new kitchen staff. I think in a few months we will see an extraordinary menu.  Reservations are a really good idea. Let's give the staff a chance to serve you the way you expect them to."}
{"text":"We had an excellent dinner on a snowy Tuesday night. I have the broiled Lake Superior whitefish with an excellent side of roasted potatoes, coleslaw and relishes. My mother-in-law had the deep-fried  Lake Superior whitefish that was just as excellent.  This is a great atmosphere with friendly staff and excellent food and drinks."}
{"text":"Had Prime Rib tonight and now we will be regulars! Sooooo good! Best in area!!! I ordered medium he ordered medium rare, perfection! Green Beans and bacon, awesome!"}
{"text":"Yes, I am a fan. I was hesitant after reading the mixed reviews but took the leap. I was very happy with my choice. It was a bit of a drive from downtown and in traffic but I was quickly seated upstairs with the graduation crowds. The place smelled of fresh cut wood and added to the homey feel. I ordered a scotch ale and enjoyed the happy alcohol content. For starters, I was given some bread that was nothing to write about but my salad was fresh and delicious. I would definitely get the green bean and artichoke salad again. The main point of coming here was to get the hashbrown crusted walleye. I was very happy with my choice. It was crispy outside and juicy in the middle on a heaping pile of more green beans. Love it. I wanted a chocolate dessert but was saving room for pie.  Came back for the roast chicken and brussel sprouts and loved it. The only place I have come back to on one trip. Will definitely come back again."}
{"text":"Heard this place had new owners or something so we decided to try it, especially since it has such a large outdoor eating space.  Fantastic dinner.  Ordered a bottle of wine, which was pricey, but our meal was not lacking at all.  Everyone was trying to eat my side dish of brussel sprouts they were that good.  Good-sized portions, excellent and timely service, very lovely and unusual setting.  A bevy of choices to fit any budget, but again, the wine was not cheap.  Everyone at our table was extremely happy with their dinners.  I'd like to try it for lunch now.  I hope this place is successful because Middleton is due for a place like this where you can get either fine dining or just soup and salad."}
{"text":"Love this place! Reminds me of Quivey's stable but more upscale. This was my first time so I'm not sure how it has changed since the remodel. I absolutely love the decor and ambiance. The place is beautiful.     We met the in-laws there for a Friday night fish fry. My husband had the smelt fry, I had the trout which was served with fresh spinach and a lemon caper sauce (yum!) and everyone else had the fried cod. The food was perfect!! And the Brandy Ol Fashioneds were delicious!   I am excited to go back and try some other dishes."}
{"text":"I would like to give this another try.  Our party of 4 had the beef stroganoff for $14.  It was pretty darn good.  I would eat it again.  My husband stated it was the best he had ever had.  I apologized to him for not making my mom's recipe with homemade noodles, so now I will have to do that and compare.  I have a lighter appetite than the others and they felt it was not a big portion.  I usually have a box of left over but in this case I did not.  The warm dinner rolls that were served before the main course was appreciated.  Service was good, would have liked the waiter to return with more water earlier than after we had finished dessert.  The desserts we ordered were exceptional.  That was when I remembered to take my camera out.  The building is a cool place to look around.  They had a patio that was full.  They have a full service bar with a few tables at that level and we were lead upstairs to another dining area with another bar.  They have weekly specials and we plan on going back to try them out.  One thing that I thought was a little weird was when you first enter there are two tables on either side inside of the door.  They were two tables for two that I thought would be a little off putting right next to the entry."}
{"text":"Friday fish fry is solid, service is above-par, kitchen has an expediting issue and the upstairs dining area is oppressively loud.  Their website doesn't indicate a Friday fish fry, but there is one...evidently a secret only for those in the know. Lots of great options for fish lovers including an all-you-can-eat fried cod, smelt basket and \"hash brown encrusted\" walleye. Our table tried each and all were pleased. You'll pay a premium price for the fish fry, but it's worth it if you're not in the mood for a typical \"sports-bar-with-Busch-beer-special-while-you-shout-at-your-server\" experience.  The staff are polite and very hard working, which is overshadowed by a kitchen who still seems to be working out the kinks despite being open for a year. Our entrees were brought to our table an hour after our order was placed. We watched 2 and 4-tops being seated and served their meals as we grew languid and ordered our second and third round of drinks to fill the pit in our stomachs. At one point our server said, \"The kitchen had run out of fish batter,\" as an excuse for the delay.   That's a first.  Management did come by after our entrees were devoured and attempted to correct the situation with complementary desserts and the table was appreciative. The creme brûlée was tasty but the brûléed sugar wasn't set. The chocolate cake and cheese cake hit the spot.  Note to future diners, ask NOT to be seated upstairs during prime dining hours as the domed plaster ceiling of the second floor carries sound so aggressively that it feels as you're listening to a Seinfeld laugh track on loop while sitting inside a cathedral pipe organ that has been placed in the middle of Ho-Chunk casino."}
{"text":"Finally made it here for brunch and had the to-die-for gnocchi carbonara. Service was nice but unobtrusive (that's good) with only one observation--server had a disgustingly dirty apron on that looked like it had served through several shifts. When you're seated and all you see of a server is a dirty bib apron it's kind of off-putting, yes? Oh, and the bloody mary was bitter, not zesty. Was looking forward to a good bloody and this was not it. But overall, a nice brunch and will go back."}
{"text":"To be honest I was hoping for more from our first visit to 1847 at the Stamm House. We've driven past a great location and awesome, historic building throughout the remodeling process and for the last several months. tonight we were thinking of heading elsewhere, but unexpected crawling traffic led us to stop in here instead.   We arrive quite early on a Thursday which may have accounted for the notably advanced age of nearly every other patron. We had our two young children in tow and they were certainly the only kids in the house. All in all i would not consider 1847 a kid friendly venue (but that's not inherently a bad thing).   I've heard great things about the drinks, but this wasn't really a cocktail sort of night so I enjoyed a Central Water's porter on nitro, which was quite good. We sat out on the patio, which was pretty nice, but by the end our table was pretty crowded and there were really only three of us (and only one with a single drink in addition to water). Be prepared to shuffle dishes extensively if you're enjoying the patio with more than 2 people.   We started with the pickled veg appetizer, which was actually quite nice. A nice blend of tastes and textures spanning sweet, bitter, salty, earthy, and pleasantly vegetative. The goat cheese paired nicely with most everything on the plate and was quite good mopped up with the pickling juices using the complimentary bread an sweet cream butter.   My wife ordered the tagliatelle, which was far and away the highlight of the evening. The house made pasta is delicious with a perfect texture! The sauce accented the freshness of the pasta and the mushrooms added a ton of earthiness and umami decadence. I'd order this again in a heartbeat!   My thursday night special of schnitzel and spatezel was more hit and miss. The pork was a little dull and a little tough and may have benefited TREMENDOUSLY from a nice slice of lemon on the side to add a bit of brightness. The spatezel was quite good and the accompanying auce had a subtle hint of mustard that shone through.   My son's burger was frankly very bad. We requested it medium and it showed up raw and cold in the center. there was not seared crust on the burger at all and it seemed to have not even been seasoned. This was a HUGE miss. $10 for a plain burger (literally meat and bun) is far too much to ask, especially if it's not cooked correctly. Yes I could have sent it back and no I did not bring it up during dinner (probably should have) but he wasn't really giving the strong hungry signals anyway so he just made do with pickled veg, bread, and french fries. The fries were good, but not great, really nothing special.   All told our meal for two adults and one child (with one beer) was $70, which is just too pricey for this overall experience. It was by no means bad enough to say we'll never be back, but we're certainly not in any kind of hurry to return. There are undoubtedly better dining experiences to be had in Madison..."}
{"text":"I want to love this place, but I'm underwhelmed. The menu is promising. The cons: our tenderloin seemed to be an imposter cut of meat, it felt all wrong in texture and shape. Not to mention it came out as a med/med well, not the Med rare we ordered. The \"fingerling\" potatoes were not actually fingerlings. Instead they were likely golden potatoes cut into bigger chunks and dry and flavorless. My perch was cold and although fried it was not crispy.  Pros: the service staff was understanding and accommodating. They made us feel comfortable and remedied our issues as soon as we brought them to our attention. Their sautéed spinach was out of sight-a flavorful bunch of warm, crisp, raw spinach that seemed like an impossible feat but yet there it was on our plates like the miracle it was. I'd order that as a stand-alone.  I want to like this place, I'll give it another shot but the meat quality has to change, the chefs temp awareness has to improve and their potato recipe has to change."}
{"text":"The restaurant is very beautiful, you see the stone cave and wood furnitures perfectly organized together with the lights in this place, and immediately feel classy and cozy at the same time. The service is very nice.  Started with the smoked beef tartar, which I was so eager to try when I first saw it through their website. It's like an egg yolk over smoked raw grounded beef with a taste of mushrooms and mustard on the side. It turned out to be the most wonderful experience I've ever tried with starters! Everything is mixed so well together. We also ordered the Friday night fish fry and sirloin. The fish fry was very crispy on the outside but juicy and tender in the inside. The medium rare sirloin was also very delicious, with its wonderful flavor and texture."}
{"text":"I have nothing but good things to say about The Stamm House and I was disappointed to see such terrible reviews below. If they were mediocre when they first opened, they have made great strides in the past few months.  The space is absolutely gorgeous and the menu has a small paragraph about the history of the building. We ended up sitting downstairs in the bar area for dinner, but I toured the upstairs space and it was equally beautiful.   To drink, my friend got the \"autumn special,\" which tasted like a pumpkin spice tea with booze in it, really tasty. I got white wine, which was also really good.  For dinner, I got the fish fry special and was blown away with the portion and side dishes that came with it. I opted for the Wisconsin fish (there was also an Alaskan option) and the portion didn't fit on the plate. It came with 3 sides: coleslaw, pickled veggies, and roasted potatoes. Everything was really good and I ate it all, despite being a huge portion.  Overall service was great, food was delicious, and the space was enchanting. What more can you ask for on a romantic date night?"}
{"text":"Everyone has been waiting so long for this place to open!    Decor:  I just love all of that beautiful old stone and exposed wooden lintels. The place is surprisingly not dank and it has lots of natural light streaming in. I wasn't sure where else they were going with the decor though.  They maintained that wood feel throughout and mixed up different wood types and stain shades to keep it interesting, but they have a contemporary restroom, which doesn't exactly meld.  It's as if the owner/designer was so in love with slope sinks that they just had to have it.  It IS a cool sink and it's just a bathroom, so no big deal.  The restroom was so freezing cold, that I had to wait outside of it while my child used it. Brrrr Plus, I could hardly see anything-not enough lighting in there at all.  Service:  They need to fine tune their service. I went with a party of 5 and 2 of us were still trying to get to our seats while the hostess was already rattling off the specials for the day. Out of respect for her, we remained standing to give her our attention, but it was pretty awkward. I felt like just saying, \"Everybody, just relax!\" (so I can).  We had a drink menu in our hands for only about 6 seconds when the waitress came up and asked us for our order.  We asked her if she could please come back in just two quick minutes, because by then we would surely know what we wanted.  Eight minutes later she took our order. 20 minutes after that, we received our drinks. Ugh.  The drinks were tasty and they had a pretty good selection of unique cocktails.   Food:  We ordered the Onion Tarte Tatin to start. When we asked the waitress about it (the menu wasn't very descriptive), she said something like, \"Well, it's a tart...... with onions in it.\"  I was surprised to find that is was more of a free-formed array of ingredients, which didn't have any sort of crust, so I'm surprised they still call it a Tarte Tatin (upside down pastry), but whatever.  The Beef Stroganoff didn't appeal to one of my dining companions at all.  So I ate it!  It was one of the better items, though the menu states it is served with Pappardelle pasta (appropriately), yet what we got was Rigatoni. What?  The Forest Mushrooms and Fettuccine dish was tasty, but you've gotta love mushrooms if you order this dish (which I do). Yet, even still, I felt like it was overwhelmingly mushroomy tasting, with nothing much else going on with it-nothing complex.   We enjoyed the Beef shoulder special.  It was pretty good. The glaze was the best part and quite flavorful.   To summarize, I wasn't in love with any of their food items. They were decent to just good.  More on service: As I eluded to above, the staff needs to become well acquainted with every food item and should be able to speak eloquently and confidently about them.  There were several times where I looked up trying to see where our server was.  She could have/should have come back more frequently than she did.  It's sooo not relaxing when you spend half of your meal looking up, hoping for help.  There was a robust outdoor drinking crowd on this particular weekday night. Everyone seemed to be enjoying themselves. They have two large bars; one up, one down.   If you plan to go on a weekend, they book about a week and a half out. Also, they only answer their phone between Noon-4:00? On certain days.  This place is so new, that I'm confident they will work out many of these kinks.  I look forward to going back again in a few months."}
{"text":"I love the look and feel of this place. We sat upstairs where there is a rustic cool light fixture and bar. The stone walls are gorgeous. Saturday night prime rib was enjoyed by my hubby...Was above average and he liked the option of choosing from several vegetable choices (sauteed spinach, for him) in addition to the mashed potatoes it also included. I started with a wedge salad, which was delicious and quite large. For my entree I had the hamburger with fries. The burger was nicely dressed with the standard lettuce, tomato and onion, but was also topped with smashed fried cheese curds! Nice touch! The fries do have a batter, which the server did mention when I ordered. Not a huge fan of the fries. The server was attentive and efficient. Was shocked at how quickly the soup and salad arrived. The entree timing was not shabby either.  Glad I checked out The Stamm House!"}
{"text":"Always a combination of good-to-really good, combined with misses.  On a recent visit, for dinner, the good: The cheese curds were excellent.  The tenderloin tips were very good, the seasoning and quality were just right, and they were cooked just right at a true medium.  The misses: The signature Stamm burger should have been better, but taking a burger ordered medium and serving it well done just took too much away.  Which brings me to the next miss: The service.  Very nice, very helpful, but it was far too long between visits or availability (even to flag down our server).  We were hungry, so we didn't send the burger back because we knew it would have taken another 30 minutes for that process.  The last miss was the wedge salad, and that was a big miss.  That lettuce should not have left the kitchen.  Yellow, kind of wilted, kind of disappointing.  Combine that with blue cheese dressing that had really just one little piece of blue cheese in it, and just a little bit of bacon, and it just wasn't good.  And I don't know that you can rely on my review for any of these dishes. My wife has had the tenderloin tips here several times. Sometimes really good, sometimes not so good.  So ultimately, maybe  don't have high expectations here, but you might have a great experience. Or you might not. That kind of sums up 1847 At The Stamm House for me."}
{"text":"The latest incarnation of the Stamm House succeeds. Good menu, nice drink menu as well. Excellent staples and good side dishes as well. A better hangout than many other places in the area."}
{"text":"If you're looking for a beautiful rustic dining setting, you'll get it here, but that's where this restaurant peaks. We visited on a Monday night, so things were rather quiet, which made it a total mystery why the service moved at a seemingly glacial pace. It took a long time to even get our orders taken. So just keep this in mind if you have less than 2+ hours for dinner.   Now on to the food. We had the cheese curds as an appetizer because if your in Wisconsin, you're the oldest tavern in Madison, and you have these on your relatively small menu, you should be pretty good. And they were nice. No complaints here. For mains we had the walleye, stamm burger, and the special which was chicken and dumplings. I had read great reviews of the walleye, so it was an obvious choice for us. The hash brown crust wasn't greasy, had a good crisp to it, and the fish was nicely done. But it honestly didn't blow me away, and it was all of our least favorite of the entrees. It just wasn't memorable (the beans on the side were more interesting). The stamm burger came with mashed cheese curds, so who's not going to give that a second look? And...the description was the most exciting part of the dish. We ordered it medium rare, and it came at least well done, but besides that, it was still kinda uneventful. Then the chicken and dumpling. This was shocking compared to the other dishes because there was lots of flavor. Whaaaaa?! I tried this last, so I was expecting complete milk toast, especially since the appearance looked meh. But I was tricked! I enjoyed this quite a bit, however, if there was a grain more of salt in it, I swear it would've said it was too salty. You'll definitely need some water with this one, but i still enjoyed it. Oh, which reminds me, at this point, the whole table of ten was out of water, and I think we all regretted not asking for two full glasses at the beginning of the glacial service.   Once we got to desserts, I think we all were either not impressed enough to try deserts, or just not willing to invest another hour to get it, so none of us ordered anything. But they surprised the birthday boy with us with a free brownie dessert. I think it's near impossible to make a bad brownie, and theirs was good.   All in all, we all pretty much concluded that it was fine, but that none of us would ever go back. Kind of a bummer because it seems like it has so much potential, but the food was just lifeless."}
{"text":"Great space and ambience. Attentive and informative waiter- interesting margarita caliente that packed a nice spicy punch- onion tart was disgusting...tasted like cat food-overly salty and the texture was like dry sand with little evidence of any onions or onion flavor. The beet carpaccio was equally weird- lacking and robust roasted flavor the raw beer slices filled the plate and played host to curried farro!! Who came up with that pairing- lacked any acidity to give it any interest. The whitefish fry was one long spear of batter fried fish that felt like it had been bathed in oil vs fried in it- the waiter told us the remoulade was on its way when it was delivered by another staffer he plopped it on the table and announced \"here's the tartar sauce\" weird chunks of wet oily potatoes and a small bowl of slaw.... Had to ask for lemon. The \"to die for cream puffs\" weren't! Rectangular Pieces of puff pastry layered with whipped cream and toasted macadamia nuts with currants on top? Blehhhh! Maybe pastry cream and blackberries would have killed me but not currants! The staff seemed eager and well informed and the ambience worked- the food...not so much."}
{"text":"This was a weird dining experience. We were seated upstairs, and the place is gorgeous, but the noise level is so high we were literally yelling at each other to be heard. It was exhausting trying to have a conversation. The menu is very limited as others have mentioned. We started with drinks - for me a vodka gimlet with olives and my date had a Spotted Cow. To their credit, the beer is ice cold. My gimlet was weird. The waitress asked if I wanted it in the rocks and I said yes please, with olives. Twice I said with olives. It came with one giant ice cube in the glass and the olives arrived separately a little later? It tasted OK but just wondering what the deal was with one ice cube? I saw other people with normal amounts of ice in their glasses.  We both ordered the fish fry. The menu said \"white fish from Bayfield, Wi, potatoes, cole slaw, pickles and tartar sauce.\" We received a basket of four rather non descript rolls before our dinner arrived. When the food runner brought our dinner the tartar and pickles (3 tiny pickled items for the two of us) and a squeeze bottle of a brown liquid (vinegar?) were on a separate plate. I asked the runner what it was and she said \"it is my first night, but let me find out for you\" that would have been great but she never came back. The fish was delicious! Piping hot, lightly breaded, and a large piece. No choice of potato, the meal came with some type of roasted cubed potatoes. I did not care for them. The tiny pickled items are a mystery to me. Not sure why they were there or why there were 3 tiny ones for 2 people to share? Cole slaw was very tasty. Fish fry dinner = $16. Thought that was a bit pricey but at least the fish was really tasty.  Our waitress was mediocre. Don't think she ever cracked a smile. She did not give us bad service, just not real personable. She failed the water test. I had to ask for my water to be refilled and it never got refilled after that. Water had barely any ice in it either. Not sure why we were denied our ice in our beverages, but it was 90 degrees the night we were there!  We decided on the way out we would not return. The noise level is way too loud to have an enjoyable evening out and the menu is so limited. The remodel is very pretty to their credit."}
{"text":"Amended review: Craig followed up and took care of us by refunding our bill and inviting us back again. We will be giving it a second go, thank you!  We went to the 1847 for brunch on a Sunday morning and while the decor and ambiance were very pleasant and the restaurant was virtually empty save for two small families, I'm sad to say the rest of the experience was quite a disappointment. Our waitress came upstairs and proceeded to lounge at the bar chatting with her co-worker for five minutes or so before finally coming over to take our order for drinks, then proceeded to give the most lackadaisical performance I have ever seen in a service setting. I think she might have taken some kind of tranquilizer before her shift, because she reminded me of my cat when it went to the vet to get fixed and came home stumbling about and then slept most of the day. The bloody mary and mimosas were decent, though nothing to write home about. Had to ask for a beer chaser and even pay for it, but not a huge deal. When our food finally came it was also not bad, but on my breakfast sandwich I found that my avocado was brown and quite past it's prime to the point of being inedible, which I pointed out to our waitress only to have her reply with \"oh, yeah, okay, sorry\" which was halfhearted at best and she made no offer to replace it with a fresh one or take it off the bill. It was only a 3 or 4 ingredient sandwich, so that really made up the majority of the dish and I would have thought some reparations would have been made, but I guess not. The food otherwise was okay, but given the lack of attentiveness from our near comatose server and that it took almost an hour for us to get in and out of a nearly empty restaurant with a tab much too large for what we got, I can safely say we'll be returning to our usual brunch spot at Oliver's Public House."}
{"text":"This restaurant is amazing!  Michael was our server and gave perfect service.  Attentive but not overbearing.  We were with my parents who can be very picky about eating out and even they were impressed!  Two of the five people in our party ordered the hash browns encrusted walleye and could not say enough about it.  My mom and I had the lake perch dinner and basket respectively and it was delicious.  Initially, I received the pan sautéed perch dinner-which I did not order.  We split the pan sautéed at the table while we waited for a new order(5 minutes tops).  It was so delicious I offered to eat the plate brought to me but the waiter insisted that they bring what I initially had wanted.  I also had the roasted Brussels sprouts on the side.  I could eat a whole meal of just those.  We are from the Chicago area but will definitely be back next time we're in Madison.  Atmosphere, food, service-second to none."}
{"text":"Really people...you go the first week then jump on Yelp with each criticism.  NEWS FLASH....opening a new restaurant is a big endeavor...if you want perfect come back in a few months!  Now on to my review!  FABULOUS PLACE!  We stopped in just intending to have a cocktail and stayed for dinner after we saw the food that was coming out of the kitchen!  Yes the menu is brief but honestly had a great variety!  The people next to us had the evening special which was beef stroganoff and they raved over it.  I had the burger and it was perfection (I'm not sure how someone claimed that they squirted egg all over their shirt...FYI you're eating too fast!).  The fries were also perfectly cooked, hot, and salted!    The best part were the drinks though!  The Margarita Caliente was superbly spiced and not too sweet...my favorite!  The Gran Mariner Sour was also spectacular, sweet and syrupy but well balanced.  The North Woods Sazerac was also delish...more wintery but still amazing.  Amanda the bartender was as great as the drinks she produced...kudos!  Great restaurant, great bar, great food...welcome back to Middleton Stamm House!"}
{"text":"Dinner here tonight was simply divine. I'm visiting here from Hawaii to see my mom, so we were looking for something local and nice, but not pretentious. As soon as we entered, we were stoked at our choice and cooed at the charming and comfy decor. The host was charming, friendly, and cute too!  We were seated by a window on the second floor, and our waitress was attentive and kind. Great service the whole way through.  We started the meal out with a cheese plate. Now, not to sound too fancy, but I spend every summer in the south of France, so cheese plates are something that rarely impress me in the states. But this cheese plate was something different.  The chef must understand something spectacular about the chemistry of taste. Not only did they select fresh and flavorful local cheeses, but everything was paired perfectly with whole grain mustard, homemade chutney, and fresh ginger. While most restaurants will skimp at this point and serve water crackers, the plate also came with delicious crisp bread crackers that were a perfect palate for the varying tastes on the plate to come together. My mom and I couldn't help but exclaim after every bite--HOLY CRAP GINGER/MUSTARD/CHUTNEY/LOCAL CHEDDAR IS SO GOOD WHO DID THIS THEY DESERVE A NOBEL PEACE PRIZE. Luckily we were there early enough so there weren't too many people around to judge us as we exclaimed over and over again. Dang, it was just that good.  Sipping a local Middleton beer I was in heaven. My mushroom and kale entree was also carefully and skillfully balanced by what I can only imagine is some mad genius chef with an extra million tastebuds to create something so PERFECT. You know the chef knows their stuff when there's no need for salt or pepper at the table--the roasted heirloom veggies, rice, and cream basically had a fiesta in my mouth. Who would have thought a mushroom and kale tart would have rocked my world so hard?  Chef--whoever you are--you are a mad genius. I myself am an amateur chef of sorts, and your cooking made me want to never cook again because I could never make something so delicious. By the time the dessert came around in all of its creme brulee and chocolate tart glory I was already so mind blown I decided to box it up and save it for later. I savored the last moments of the meal with a decadent tawny port and left feeling so content and pleased with the dining experience I want to write the restaurant a love letter. I guess this is the next best thing.  Amazing service. Beautiful decor.  Delicious drinks. MAD GENIUS chef. I don't live here, but if I did, I'd be back all the time. This is world-class food. I'll be dreaming of it for a long time."}
