{"text":"One of the worst meals I have ever had. Meat that has been showered with a creamy/mayo based sauce. Absolutely disgusting. Huge portions of rice were provided with the meal - no flavor at all. Not sure if they're trying to show value by providing what appears to be 4 cups of rice, half with beans and half with potatoes. Never going back."}
{"text":"If you are into middle eastern food avoid this place. They have a lot of work to do. I went because I saw a blogTO article on it boasting that it was one of Toronto's top shwarma places. Definitely not the case."}
{"text":"Best schwarma plate I've had in a long time, especially from a fast food take out spot. The mixed plate with a fattoush salad is my guilty pleasure. The garlic sauce is creamy as all hell. Ask for extra! The staff is very gracious as it's a relatively new spot. I'll definitely be back."}
{"text":"Love this place, it's become the go-to for fast food/quick meal nights for us. Absolutely amazing food and cheap prices. Most of the employees make decent wraps but the owner hooks it up."}
{"text":"~ This place is a 4.5 star! all the way  ~  This a small little hidden place in a corner plaza. There isn't any proper seating except a few high stools and thats where it lost half of the star. This location is good for take aways and busy during lunch with school kids. The server was very friendly and knew how to make a good shawarma.  There menu is great and plenty of options to choose from, I went with large mixed shawarma wrap. The shawarma was definitely large as I could not finish it. The wrap was made with 2 pitas; the topping and meat was mixed and put in good quantity. They make their own garlic sauce and it does stink. Over all the shawarma wrap was one of the best I have had in Canada.   For my Muslim Folks - they serve halal meat and it states on their door as well."}
{"text":"Really great food, had the mixed plate both chicken and beef very tasty.  The rice was delicious and the garlic sauce and hot sauce both homeade and perfect as well. Salad was great too.   Only lost 1 star because they serve it in Styrofoam and plastic utensils. That's that shit I don't like. Can't blame em too much as they have a counter with 3 random shit stools to dine in. Place could use a renovation, throw a couple tables in the mix.(they have room)"}
{"text":"Tried this place yesterday for the first time and it definitely won't be the last! We got the mixed grill plate, a shawarma  wrap and the samosas and everything was fantastic!"}
{"text":"We had the gyro, dynamite shawarma wrap, poutine.  All very delicious.  I have had better donairs, but it will do, as I want to stay local for some Mediterranean food. The service was extremely slow as I think the person was new.  We weren't in a rush so it was fine, but cannot imagine what happens during a lunch rush or something. Overall, it is good for the neighbourhood."}
{"text":"I'm very rarely in this end of the city, but when I am and I'm hungry there isn't really too much selection in the surrounding area. Fortunately, for me, this little shawarma take out restaurant is only about 5 minutes away from where I usually stay.   Today I got my chicken shawarma plate, delivered. Served with a large portion of rice, some potatoes, key word here is some as in usually one or too pieces ( y'all gotta up your potato game! ) and salad. 2 bros, unlike your typical shawarma place, doesn't just offer tahini and hummus as the sauces available for either your plate or sandwich; they put a delicious 'special sauce' which really makes the dish a whole lot better. I really have zero complaints about the food or the pricing. For only 10$ you can have yourself a meal enough for 2. The only bothersome fact is the portion of the potato and ultimately why this restaurant isn't getting 5 stars. If you're ever in the west end and are in the mood for some downtown quality shawarma, with terrific service, give this place a shot!"}
{"text":"A great addition to Etobicoke! Finally a non-chain restaurant that serves up tasty healthy options. The guy behind the counter is very kind. I hope this place takes off! The gyro is quite tasty and I devoured the pita crutons on my salad. I also enjoyed the oil/vinegar type dressing they use - it had the perfect zing to it.  I am a repeat customer here."}
{"text":"Don't bother. Really! I didn't heed the poor ratings and was disgusted by the rude and impatient woman at the counter than grossed out by their food. Greek salad was overpriced with wilted iceberg lettuce and soggy tomatoes. Gyro was fired out like jerky but you'd have to find them in your wrap- cheap portions. My bill was $42 and had to throw out most of the food. Really. Don't bother!"}
{"text":"The best chicken shawarma I have ever tasted, they have excellent sized portions great value for the money. There is a excellent selection of food to choose from, the food is all made from scratch even the sauces(there garlic is the best!!!). Food is consitently fresh and hot never had a bad experince in the countless times ive been there. The boss is a pleasure to talk and the staff also are very courteous, you will always leave here happy!"}
{"text":"Such great home-made Mediterranean. Te falafel is amazing an the chicken shwarma is deliscious too. The hot sauces are house-made and the medium has a perfect bite. Very inexpensive an very yummy. Definitely the best food in the area."}
{"text":"Definitely falls short of the best I've ever had. Popped in based on a quick glance at the Yelp rating and was a little disappointed. I just found that the place fell short on quality. I ordered a shawarma salad and the lettuce was wilting, the tomatoes were soggy, and the chicken shawarma was diced on a flat top. The garlic sauce was just tangy mayonnaise and the overall execution just lacked refinement. I can't complain because the prices were indicative of what I was expecting but I don't see another visit in the near future."}
