{"text":"Was there on a Sunday for dinner date. The place is very cozy and clean. We got around 730pm- it was still empty at the time, then the place was starting to get busy around 9pm.
 
The food were AMAZING. We had the papad and mango chutney (complimentary) and samosa platter for starters (lentil, avocado, potato and I foget the other one) it was made really good. Not greasy at all. For our main, we had lobster tail with spinach sauce (which was cooked to perfection) and black tiger shimps ( seasoned very well). And Naan. I decided to have rice instead of the bread, but the waiter forgot to change my order, so he gave me complimentary rice instead. :) we also had the traditional indian tea (a must try)
 
For staff and service, I've only seen two male servers in that restaurant. The 2 basically does everything, from answering the phone, sitting guest, and serving the plate, etc, ect. But it was still a prompt service.
 
Overall, its an upscale indian resto that serves good food at a justifiable price. 
I would highly recommend it to my friends. :)"}
{"text":"Went for my second time on friday night with friends. We arrived at about 8:00 and were the only customers in the place, surprising because in feb there was a lineup and the food was great. My guess is they're victims of the bluejays fans pushing the regulars out. The Yankees were in town and only a block away. 

Anyways. Service wad great. Super friendly and helpful. Food was as good as last time the stuffed naan appy was phenomenal. Simple but I could have eaten 3 servings. 
The mains seem to be much less adventurous than the appetizers but are all very nice, and the wait staff makes a point to ensure you understand what you're getting into if you're unsure. 

Will definitely be back, maybe next time when the jays are away."}
{"text":"Went for summerlicious and thought the food was average. Not bad but nothing special at all. I guess it's pretty good food considering the area in Toronto. Not sure why it's so hard to find decent food in this area (I've tried over 45 restaurants downtown Toronto already...)"}
{"text":"Was really shocked at how poor this restaurant was after reading the other yelp reviews. I'll break it down the best I can, but the overwhelming feeling is that I wished I'd never eaten there.

Service - 1 out of 5

After we waited to be seated, the server did not come back to take a drink order for 15 minutes.  We were ready to order food as well by that time so we placed our entire order. 15 minutes later we still didn't have our drinks (2 glasses of wine) and we only received them when I reminded the server. They forgot to bring water even though my wife asked for it with her wine. At one point they brought out the wrong dish and were snotty when we asked them to take it back.

Food - 2 out 5

I'm trying hard to describe what was wrong with it but it honestly tasted like it was cooked by someone who didn't have any training. The IDEA of the food is great and the menu describes all these amazing combinations but the execution on those ideas was terrible. The Samosa sampler is great in theory but in practice, the dough was flavourless, the proportion of filling was way off. There was a lot of spice which i like but very little flavour. The lentil salad was ok but had terrible presentation and was all spice and little flavour. The crab cakes were deep fried and incredibly garlicy. To top it all off my wife ordered white wine and it was warm when it (finally) arrived.

Decor - 3 out of 5

Was only ok, nothing special. It's 3 levels i think and makes the room feel very small. Also makes it impossible for servers to be able to see if you need anything.

Cleanliness - 0 out of 5

What's your worst nightmare when eating at a restaurant? How about using the washroom before you leave only to find that it's completely disgusting and dirty. filthy. And you know if the washroom is dirty, something that the patrons will see, what do you think that means for the kitchen.

I love indian food. It's supposed to be flavourful, it's supposed to be lovingly prepared. Such a disappointment."}
{"text":"Okay food not bad not extraordinary- kid playing video games next to us most the meal sorta ruined the vibe."}
{"text":"Great service. I loved our server who gave us great advice when she thought we had 2 dishes that were similar. I thing the 2 rooms are weird and broken up but that may be just me. Everything we ate was delicious and beautifully presented. Musts are the shrimp and crab cakes filled with mint, coriander and figs, spinach paneer, Chaat salad, Green chicken and a stewy lamb."}
{"text":"Knew the Host in Yorkville days for 20 years -- great then and this is its equal although the setting is newer and better in many respects. Glad to find it down here!!"}
{"text":"A fantastic dining experience - the service is exquisite, the food creative and delicious, and the attention of the host and restaurant on your dining experience unmatched. We thoroughly enjoyed this wonderful Indian cuisine and we just walked in without reservations but were treated most royally from start to finish. You cannot go wrong. Loved it!"}
{"text":"Terrific food!  Service kinda slow.  Drinks pricey. $12 for  plain margherita?   Go for the food."}
{"text":"the best place for indian food.i have tried all the big restaurants around in toronto brampton mississauga but no other place like 259 the host.
p.s  Dont miss the paan kulfi."}
{"text":"So the bf and I have been trying to look for a new Indian restaurant to try out and went with this one. Their summerlicious menu looked pretty good, and after double checking with online reviews - which gave it an average of 4 stars and browsing their menu posted online, we decided to check this place out. 


The ambience - lighting, furniture, decorations, fengshui crap was actually pretty commendable, worth 4 stars on its own. But everything went downhill after we first ordered..


Our appetizers: the cheese croquettes and samosas were very average. They tried to beef up the samosas a bit by adding avocado and whatnot, but it turned out bland in taste and not too appealing. I've had better samosas for 5/$1 from Samosa King. The cheese croquettes were 4 pieces of fried dough with a tiny ball of cheese inside with some kind of ineffective sauce drizzled on top. Not even comparable to the common cheese sticks you get in sports bars. Honestly, I expected better from 4 star restaurants with $9 appetizers. 


Oh, and while clearing our appetizers, the waiter said that he hoped we enjoyed our desserts. At the time we weren't sure to blame it on inattentiveness, sloppiness, or just a slight lack of professionalism, but either way, it definitely didn't impress.


On to the main courses: I got the sea bass and he got the beef tenderloin in curry. My fish dish was slightly overcooked and bland. Had to ask for salt, which is really something that shouldn't have happened. His beef tenderloin was basically a loaf of meat in curry sauce. There was literally nothing else on that plate - no veggies, no visible herbs, nothing to suggest that the chef took the time out to put effort into the food. 


Another point of contention was the saffron rice and the parantha. I've had saffron rice before in numerous other restaurants and at home too. But the saffron rice that was given to us was literally nothing more than a bowl of bleached white rice with a bit of saffron sauce. Why the hell did I just pay $5.50 for a bowl of plain white rice with a dash of saffron when I can get much much more else for the same price. And the parantha.. When I asked our waiter what a parantha is, which I'm sure if not an uncommon question, he couldn't give me a straight answer and resorted to telling me that it's really good and I really should try it. I assumed that he had a working knowledge of the foods his workplace served so I agreed to try it. Guess what parantha turned out to be. Naan - simple plain naan. No garlic, no herbs, no spices, no extra dipping sauce. Simple plain 3 pieces of naan. 


All in all, we paid about $165 for a bottle of wine, 2 appetizers, 2 mains, 2 bowls of fake saffron rice, and an order of plain naan. I would not have had any issues if the food had lived up to the 4 star standard that online reviews had led me to expect. The food was unexpectedly bland across the board, which implies that either they weren't dedicated to serving authentic Indian cuisine, or at least that they don't cater to people who appreciate authentic Indian cuisine - anyone who's had real Indian food and enjoys it probably wouldn't have a great experience here. 


Lastly, their online menu does not reflect their actual in-restaurant menu. The sea bass I ordered doesn't appear in the online menu, and much of the food we ordered were actually priced more in the restaurant menu than the online version. These discrepancies can be explained by a failure to appropriately update their online site, and that just shows a lack of professionalism in keeping potential dining patrons properly informed. Would not recommend to (Indian) food lovers."}
{"text":"Good indian food. Ambiance cold in there in the middle of the week. Service was nice and fast."}
{"text":"Service was slow on a Monday. AppetiZers took a long while to reach out table.  The wait was over 35 mins for just appetiZers. The food was not good quality as well. Horrible service. The manager did not apologize and had bad attitude as well. Avoid this place at all costs."}
{"text":"So, the ambiance is good.  Being from the States, this restaurant has pretty good Indian food.  A little spicy for kids.  Service is a little so so.  Great location and if there is ever a convention or an event in Toronto (anytime between May-Sept) then book it in advance for a group over 2.  Place the order if you are waiting for a table and food will be served as soon as you sit down.  Overall, great food and fantastic location!"}
{"text":"We stopped by 259 Host after a film at the Bell Lightbox (just a few minutes' walk away) for a friend's birthday. Even though we sat down just an hour before closing, we were treated very well - the host was attentive and friendly, giving us a little background on the Host restaurants and the style of their dishes (\"Everything is handcrafted - even the spices are all ground in house!\"). The service was very prompt - our glasses were never empty and no table crumb went unbrushed.

The food was presented quite beautifully, with fresh (tasty!) garnishes and delicious sauces for the croquettes, kebabs, and crab cakes. They whipped up an off-menu salty lassi for the birthday boy.

We shared four mains among four people, plus a huge basket of fresh, garlicky naan. The portions were perfect; the lamb tender and uniquely spiced, the tenderloin extremely flavorful sitting atop a pool of some of the best red curry I've ever tasted. The chicken and panir cheese tikka were also balanced and delicious.

We will definitely be back - the service was fantastic and the food memorable - the fresh ingredients really shone through. I'd really like to try their less traditional dishes, like the jackfruit masala to get a better sense of the creativity of the chef.

The prices were lower than I was expecting - the main dishes were all around $15.

I'm still sore about the disappearance of Chakra at Yonge and Eglinton last year, but this could be our new go-to Indian spot downtown."}
{"text":"Very good place to visit, great presentation of indian food, very friendly team, taste super, rightly priced."}
{"text":"Excellent service and very nice food with an original twist and flair, very enjoyable and nice Argentinean red Malbec!"}
{"text":"Very nice ambiance, terrific food, amazing service, all at great prices."}
{"text":"I'd eat here again. Butter chicken and chicken tikka were both quite flavorful. The naan and rice were both good."}
{"text":"phoned for reservation for lunch because I have mobility scooter had the most delicious lunch the service was excellent  and the lunch menu was excellent  fresh just the right amount of spices this place is a must go"}
{"text":"The service was prompt. I had ordered Chicken labbadar with one butter paratha and one with sun-dried tomatoes. The curry was flavorful, aromatic, pleasantly spicy and I could taste those well mixed spices. There were some whole spices like cardamom as well that adds to the taste. The paratha was good. I enjoyed my food. I ate half the next day. I recommend this place if someone is looking for good Indian food. Then why only 4 stars you ask me. I think the service could be improved like serving water right after being seated? 

I also liked the menu which was sufficiently detailed to know what to order what with what."}
{"text":"The service at 259Host (or rather, lack thereof) was ABSOLUTELY HORRID. My party of six was ignored over and again--despite being seated centrally on the main floor within a stone's throw of the kitchen. I had to ask for utensils and our beverages were not refilled at all throughout dinner. After nearly an hour before getting our meals (the party of 6 behind us seemed to receive prompter service despite arriving after us), the food was mediocre, inadequately spiced and overpriced. 

As a group of physicians seeking a nice dinner in what appeared to be a classy restaurant, we were quickly disappointed at  the rude and condescending waitress who aptly made us to feel like a bunch of paupers.

Take your business elsewhere. There are far better Indian restaurants in Toronto offering authentic cuisine without pretentious attitude more deserving of your patronage."}
{"text":"Back to Toronto one year later.  And of course I went back to 259 host.  Food, service, and everything was still top notch.  (I actually got it twice in one week: Once dine in, once take-out).

Anyhow, keep up the good work."}
{"text":"Good food.  Lovely ambiance.

Another Sagittarius Yelper and I  decided to have a joint belated birthday celebration here.  259 Host was the perfect place to whoop it up!  I loved the clean lines and modern décor.  Very classy.

In terms of food, I appreciated the use of  fresh spices and herbs.  Kudos to 259 Host for not holding back on the heat.  I loved that they stay mostly true to the authenticity of Indian cuisine.   The presentation was delightful to look at and everything we ordered was quite tasty, however none of the dishes really stood out for me.

Between the two appetizers, Samosa Sampler and Tangy Chaat, I enjoyed the Samosa Sampler the most.  Each piece was very unique and tasty.

For the main entrée, we ordered Pan Fried Halibut with dark chick pea curry sauce, Grain-fed Chicken Kebab and Chicken Xacuti.  My favorite was the Chicken Xacuti, which had the most flavorful sauce.

The vegetable dish, Fresh Squash Bhaji, was surprisingly delicious as well.

Overall, it was a good dinning experience.  Staff were very polite although there is definitely room for improvement on attentiveness."}
{"text":"Food like a fusion of Indian and Mexican.  Some of the fried items were a little too greasy - still tasty (Samosa sampler).  Spinach and cheese Naan (I forget the name) was a bit limp and like a quesadilla.  Jackfruit dish was nice - savory, chili-like.  Tandoor Paneer cheese (I forget the name) came on a skewer.   They were large chunks of cheese on the skewer - a little dry inside.  However the dipping sauce that came with it may the dish good.  Perhaps, I'm not used to the cost of glasses of wine in Toronto - but they were particularly costly.  Service was professional, business-like, a little cold.  Nice ambience.  Restaurant is on 3 relatively small levels - main level has cozy nook round table.  2 level has view of cooks through a screen (not certain that this is that great).  3rd level has some seats with view of street."}
{"text":"Don't get fooled by the exterior- this is a genuine Indian place. The food tastes just like Indian food should taste-spicy and rich. I tried the chicken lababdar and palak paneer which brought to mind the real recipes that I must have had at authentic Indian restaurants in India. The naans were made and cooked perfectly. Take your non Indian friends there and they are sure to become fans!!"}
{"text":"Honestly after a whole day of walking around in Toronto, we were dead tired and reluctantly decided to eat at this place as it was convenient. The interior was nice and menu seemed to be kind of different than other Indian restaurants. I generally never order non veg when with my wife, but this time gave in my taste buds and went for chicken kebab and my wife for samosa sampler. Man the chicken kebab was awesome, next only to what I had tasted in Bukhara in New Delhi. Samosa sampler was amazing, was made of stuffing like avocado, lentils, all healthy stuff. Main course was great with cauliflower and paneer. The restaurant is on expensive side, but I feel it was every dollar worth it. Wish we had chosen this on first day of our trip so could have tried the kebab again. Next if we visit Toronto, we sure to visit it again. Keep it up."}
{"text":"I was at 259 Host last night for a business networking dinner.  When I walked in I was taken back by how upscale the restaurant was.  I liked the upscale Indian resto feel ambiance that they were trying to pull off.  I arrived a bit early and was seated at the reserved table immediately.  Our server was kind enough to bring menus and water before everyone arrived.

Food

Appetizers

Samosa Platter - nice variety of different types of samosas, I tried two different types, could not really tell the difference between the two unfortunately.  The chutney was lovely, wish they had more to offer.

Chicken Tikka - perfectly cooked and seasoned, not overtly spicy.  I liked the sun dried tomato sauce that was accompanied with, it had a hint of sweetness

Entrees

Sea Bass with a fennel seed sauce - great sauce to fish ratio, the fish was not over cooked.  I was surprised how small the portion was though, it was literally a fillet of sea bass and some veggies.  For $22 it was rather pricey.  Luckily, the appetizers were fulling

Sides

Naan - you can always tell how good an Indian restaurant is by their naan, 259 Host did not disappoint.  I preferred the regular naan to the garlic Naan

Service

Attentive and a bit awkward at times; when pouring our wine our server spilled multiple times.  The white table cloth was covered in red wine splotches.  There was minimal wait for our food between courses.

Overall, 259 Host was an upscale Indian restaurant dining experience.  I would recommend it to those in the area."}
{"text":"Coworkers took me here. One of them is Indian and said this is the most authentic cuisine he can find in the city.

I'm not indian, but the food sure tasted like it would be the standard of authentic cuisine. It was amazingly delicious. On the pricy side, but to me,  all the worth it because the quality and taste is just top-notch. Ordered the Seafood Thali for $18, which comes with tandoori chicken, shrimp in coconut curry, chick peas, salad, naan, and a dessert, and we also got rice and yogurt to share. I think i got extremely good value for the price. I am definitely coming back with my bf for lunch."}
{"text":"I'm shocked by many of the average to harsh reviews here.  This place honestly is one of the best Indian restaurants and clearly better than any that I've been to in NYC.  Yes the portions may be on the smaller side, but I found the preparation to be extremely sophisticated and the ingredients fresh.  The highlights were tandori salmon and chicken.  The flavors and texture of the fish and chicken were perfect.  I'm not an Indian and never traveled there but I go to quite a few Indian restaurants in NYC and elsewhere, but I was really blown away by this place.  I must go back there in my next visit to Toronto."}
{"text":"Sometimes you want fancy. Think of buying McDonalds and bringing it home to put on fancy China, candles, expensive wine and classical music. That was what 259 was for me. I knew it was going to be more expensive than the average Indian restaurant, considering it was located on Wellington (rent high), and that the restaurant was marketing itself as a high-end restaurant. 

Despite the atmosphere though, I found the food to be 'meh' and the service average. My bf and I decided to pop in for a Saturday night dinner and we had no reservations. We got a great, romantic corner for two. My bf and I ordered: Lentil Sprout Salad, Lentil Soup for appetizers and then the Boneless Chicken Tikka and Chicken Xouta (white pieces of Chicken with a spicy sauce) for our mains.

Let's start with my Lentil Salad. It was so big I couldn't finish it and my bf couldn't help me because he was busy trying to finish his soup which basically tasted like warm curry. My salad was very healthy I'll give it that but I don't think it's right to charge $9 for basically a can of beans and small pieces of cucumber?!?! 

My Chicken Tikka came in 4 pieces. Literally 4 pieces of white meat and a sprig of parsley. My bf's chicken dish came in 4 pieces as well and it was floating in this dark spicy sauce. Nan bread and rice were extra of course. 

Total dinner with tax and tip, including a bottle of red turned out to be $160 and change for two people, which is very expensive. I was the one that wanted to come here, knowing full well that it was going to be expensive compared to most Indian restaurants but that being said, I still wanted the food to taste wow!

I felt this restaurant was charging high \"Western\" prices for food that most realize can be cheaper and more delicious elsewhere. And for that, I felt almost \"jipped.\" I won't be coming back here again for my \"fancy\" Indian fix. It literally is not worth it."}
{"text":"Had a good meal here, though they did give me some slight attitude for coming in 20 mins before closing- OK, I get it, you want to go home- but then, just close earlier? I asked you if you were open, once you decide you want my money, then serve me right. That being said, food was good, and didn't take long to come out. I had the butter chicken (very good), rice (so-so) and onion kulcha (excellent). Worth going back and trying some different food."}
{"text":"Loved it. Been to many Indian food restaurant in Toronto as  well as other major north American cities, and host is by far one of the best I've ever been to.

What did i liked about it?
1. small and quiet. Somewhat upscale, but not really.
2. great location in the entertainment district, but discrete.
3. friendly
4. the food.... it was great. I wouldn't call it 100% Indian, as it is prepared in a very north American palate friendly fashion. Don't get me wrong, spice was encouraged, but it wasn't so overwhelming or foreign that I couldn't enjoy the food.
5. the food... was clean. Everything was cooked to exactly what it should have been and not aided along by grease and fats and MSGs.
6. the menu... was limited in a good way. Not like some places that offer you everything Indian even if it compromises integrity. Their cook(s) cooked everything i had on the menu as if it was their specialty. 
7. Service was great.
8. If you're looking for another decent place in Toronto, but without as nice an ambiance.... Nataraj.... Bloor and Spadina. 

So I'd say this place fulfilled my every expectation and i got what i paid for, reasonable."}
{"text":"BEST INDIAN FOOD EVER!!! Heads up, it's a bit spicy but explodes with flavor. Many dishes have a smokey flavor which is fantastic. The Aloo Gobi is a must and black lentils. 

I like the ambiance, it's very romantic. It does get busy and the waiters seem a little short staffed, but the food is so incredible, nothing would stop me from going back.
Go with a group so you can try everything!"}
{"text":"High quality! The food is obviously cooked with love and the service is exceptional. This is a repeat!"}
{"text":"Arrived without a reservation seemed a bit disorganized with people waiting in the entrance. Questioned if we should look for an alternative but we waited and it was worth it. Once seated service was good ordered Shrimp Malai between 2 of us great plump shrimp cook in garlic in the tandoori oven. Then we ordered green chicken tikka, Panir masala garlic naan bread, washed down with a couple of kingfisher beers This was ample for 2 persons. Very relaxed atmosphere no rush to move us out as the evening went by the place became really busy."}
{"text":"The hostess girl was very friendly, and really made our experience.   The food is pretty good, especially the Tikka Masala."}
{"text":"I bought one of those Entertainment savings books this year. I've become my mother. Inside was a coupon for 259 Host, which I had passed by a thousand times but never tried.

Some of the best Indian food we've had, with incredibly personable, attentive service. The place was packed on a freezing Saturday night, so it was a good thing we made a reservation. Looks like there's some regulars, but also a lot of people from nearby hotels. The portions are so big that we had to take some home (a real rarity for us).

We had: 
Samosa Sampler - fried but not greasy, great flavours
Tangy Chaat - nothing to compare it with, definitely different than anything I've had 
Green Chicken Tikka - slow burning spice, standout dish
Chicken Xacuti - mild curry, very saucy 
Roti 
Basmati Rice"}
{"text":"Having several close friends whose moms had restaurants back home in India, and although I'm a Canadian born in \"white boy\", I've developed quite an amazing pallet for Indian food... And these are- so far -the best flavor and mix of authentic spices I have found anywhere in the city. Please check them out! It's worth a visit."}
{"text":"I ordered dinner from here, in bread I ordered onion kulcha, palak cheese stuffed naan and Stuffed with sun dried tomato garlic and chilli, breads were fine not something out of the world. Paneer tikka was bland even though I asked for spicy. The vegetable biryani was disappointing, it was not flavourful. I expected something really mouthwatering with all the reviews. Being a vegan I don't know about the Non veg food served here. However, the veg food that I ordered did not delight me for what I paid. I have eaten better Indian food for lesser price."}
{"text":"Although Toronto is known for its restaurants, and especially its Indian fare, the meals that I've had in the city's Indian restaurants have so far been pretty \"meh\".  However, I finally broke my culinary drought when I found 259 Host via Yelp during a stay at the nearby Intercontinental Hotel on Front Street. 

The decor, a refreshing change from the typical travel posters, worried me a bit - it was nice enough to look like $30 entreés were  - but we didn't see any over $20. So we settled in.

I tend to default to an order of pakoras, tikka masla, and naan, but the menu's creativity won me over and I plunged into the chef's universe. Our server hit just the right note between description and encouragement, and the food was indescribable. 

I will have to come back later and discuss the food. About $100 for dinner for two with wine. Well worth five stars."}
{"text":"My husband who had been eating Indian food because of me for the past 9 years said this is his favorite Indian food of all time. Which says a lot. The chicken breast in the masala was not overdone which is commonplace at Indian restaurants (if it's not burnt it's not done!) 

The service leaves a lot to be desired - but expect that going in and you'll be fine. Super slow and the guys kept forgetting the water or a fork or something else. But expect that at an Indian or Chinese restaurant and you won't be disappointed. Rating this place on food alone will prop up the reviews. 

Came here on recommendation from hotel concierge because it was within walking distance from the aquarium. They accommodated our double stroller, two year old and 6 month baby in the front of the house. We were happy customers when we walked away."}
{"text":"We came here to try their Summerlicious lunch menu, and we were seriously impressed!! 

The food:

The papdi chaat was amazing and a must have! It is a layered dish with crispy wafers at the base, potatoes and chickpeas in the middle, and a mix of yogurt and tamarind chutney at the top. It was tangy and crunchy. I'll be thinking about this one, and I hope to see it on the regular menu. 

The nan stuffed with tandoori chicken tikka was also quite good. It's not as good as the papdi chaat but still a solid choice.

Our mains came with a side of lentils, rice, and two pieces of naan. Very filling!! I had to take the lentils to go. 

I had the butter chicken, it was good. My partner had the lamb, also good. I'm not being too detailed here because although the mains were delicious, they weren't as memorable as our appetizers and desserts.

The dessert was phenomenal. The gulab jamun is your usual Indian dessert: a cheese ball in syrup. Very good and a solid choice. 

But if you want to cap off your lunch with something airy, delicate, and interesting, go for the rasmalai, a cottage cheese dumpling soaked in thick milk. It tasted like the slightest hint of Rose, and maybe pistachio. An absolute dream. 

The service:

Perfect. They were very attentive and friendly. We got our food and drinks quickly. 

Overall impression: 

Come here to eat well in style. Don't make any plans post-lunch, as you'll need to go home to take a nap after eating all of this delicious food."}
{"text":"Excellent Indian Food, a cut above most Toronto Indian restaurants.
Service was very good, only glitch was their on-line reservation system.  Didn't receive a confirmation, so called the day I had reserved for and sorted out...lucky as we wanted an early, 5:00 PM reservation.  

Samosa Sampler, Grilled Shrimp, Butter Chicken and Grilled Chicken were a hit with the family.  Had a groupon, so was able to have a great Indian meal (4 people, no alcohol) for under $100 with tip."}
{"text":"I'll make this short. I've eaten here a few times. This is arguably the best North Indian food you'll find in the downtown area and I would even say Toronto. 

However, the service and atmosphere keeps me coming from visiting often and spending my hard earned money. I know they're trying to be a 'fine dining' restaurant. But that doesn't mean that the ambience and decor should mimic that of a funeral house. Eating at the host is a dreadfully boring experience. Times have changed guys - the Host doesn't have to be the New Delhi Imperial Gymkhanna club and resemble the bygone era of British Aristocracy. 

The servers are at times rude, arrogant, and lethargic. They don't make any effort in being friendly or providing recommendations. I've been seated at the lower section of the restaurant. As soon as the food is served, the servers are MIA. No water refills or even someone to ask you how the food is. Last time I had to walk up to the 'upper deck' and plead for a sever's attention in an half empty restaurant. These guys have the serious potential to break the stereotypical traits of an Indian restaurant in North America if they bring the service level up a notch and provide a modern ambience. I suggest the owners hop on a flight to Delhi and visit restaurants such as 'Dhabha by Claridges' or 'Punjabi by Nature' for inspiration. Damn I miss home :(. And I guess that wasn't short after all!"}
{"text":"Here's an update... Went for winterlicious.

Soup: lentils. For once not carrot ginger. It was good but SO salty
Main: butter chicken, can't go wrong. Really. Sill the best naan.
Dessert: mango kulfi. Frozen and rock solid but tasty once I stabbed at it. My lunch guest was less impressed.

Not crazy about the service. We ordered wine and had the larger glasses. It was NOT 6oz. Disappointing! Also new wait staff needed more training.

BREAK! Bread! *clap*"}
{"text":"Food is average compared to dinner Indian restaurants in suburbs like Avani. I didn't liked there service as when we went there was no one to even greet customers! They didn't give any papad or chips as complementary like most Indian restaurants do. I found that price was high for the service and food. Not a place I would bother to go again. When we eat Indian food outside India we don't expect the disc taste to match what we get in India but then we expect the service to be polished and welcoming like other normal restaurants in USA and Canada."}
{"text":"Walking in, it's apparent that 259 Host has a nice, clean, modern atmosphere.
However, we went for a Summerlicious lunch, which probably contributed to the busyness of the restaurant. There was no record of our online reservation and the head waiter/server (?) mumbled something under his breath about it, but thankfully, a party of four had just finished their lunch when we arrived, so we were seated promptly on the second level. And even though all but two, two-tops were occupied, each table and party had a fair amount of space, without worrying about neighboring tables and their conversations.

As for the food, I started with the nan stuffed with tandoori chicken tikka. I wasn't quite sure how this would turn out, as I tend to stick with regular nan or garlic nan. This nan had (minced?) bits of the chicken and was quite delicious. For my main course, I went with the tilapia fillet. I tend to order chicken or lamb entrees, so this was my first time getting fish at an indian restaurant. This was a nice and light alternative to the more heavy, filling chicken and lamb items I'm used to. The plating didn't do wonders for me though. The tilapia was placed on the edge of a massive plate, in a half-crescent shape. But I guess I needed the space for the rice and accompanying nan. Finally, for dessert, I tried the gulab jamun, which was described to us as a doughnut-like dessert drenched in a syrup. Me, being a sucker for doughnuts, had to give this a try. As much as I wanted to like it, there was too much syrup for my liking and was too sweet for me.

Overall, it was a fine experience for a $15 for a three-course $15 lunch with generous portions, despite the reservation snafu. I didn't leave with major itis, which is what I tend to feel after eating Indian, but this is because the portions were reasonable for lunch. It's hard to say if and when I'd be back. It's kind of snuck away on Wellington Street, but would be a nice alternative to the often-packed restaurants on King Street or for a pre-show dinner at the Princess of Wales Theatre."}
{"text":"What's not to like? The food was awesome, the service was warm and friendly, and the atmosphere was modern and casual. The samosa sample is amazing and is a must get for an appetizer. I had the sea bass and garlic
Naan as an entree. The flavor was off the charts delicious. I finished with Indian ice cream, again, yum. Everything was so flavorful. I can't say enough great things about this place!"}
{"text":"I am not of Indian descent (can you tell?). I can't speak to its authenticity or proper level of spiciness. But in my non-professional opinion, 259 Host is the Host with the most...average tasting food. I've been to the Host in Markham (same owner) for dinner, and I still find some of the dishes memorably delicious. Lunch at 259 Host will probably be forgotten. 

We were off to a good start with the Samosas from the regular menu, which were crispy, slightly sweet, and very tasty. Then, most of us progressed to ordering off the set menu, which was made up of different \"Thali\" ($15-$17) - lunch sets with various dishes. I had the Chicken Thali, which included: 

1) Tandoori Chicken - deliciously cooked and was a good size. 
2) Curry Chicken or Chicken Tikka Masala - Chicken Tikka Masala was kind of watery and not very flavourful. 
3) Chana Masala - cooked chickpeas in some sort of thick sauce. Wasn't a fan.
4) Naan and a thin crispy flatbread - delicious without being too salty (which was my experience with the crispy flatbread in other restaurants). 
5) Salad and rice - Salad had no sauce, just a pile of greens. Rice was ordinary Jasmine rice. 
6) Gulab Jamun - really really sweet dough soaked in syrup. It wasn't a big piece so it ended up being an enjoyable end to a hearty meal. 

It could be a lunch vs. dinner thing and it could be a set menu vs. regular menu thing, but nothing really stood out to me. Some of the items were great, others were meh. However, eating average food in a beautiful space definitely elevated the experience. I guess the $$$ they charge is being spent on superior decor, which I can't blame them for. I didn't feel the heat of the high prices as much as some other reviewers, but I also agree that this is definitely a Westernized and fancy...fied (to be made fancy?) version of a cuisine that is otherwise very casual. 

Disclaimer, my coworker who is of the proper descent says this place isn't very good in the flavour department. If a spice-averse person like me thinks some of the food wasn't that flavourful, then it's really not a surprise. Just FYI.

(85/100) - 2016"}
{"text":"Invited to dinner by friends here, so I had no say in the matter (and was not paying). The food was mediocre and rather expensive, but the service was good and friendly. I think there is better to be had, though if ambience is important, then this is an acceptable option."}
{"text":"To give you a frame of reference...  I've been traveling the world for the past 2 or 3 years.  Indian is \"comfort\" food for me, so I've been to at least 20 different Indian restaurants in recent memory.

To my surprise, 259 Host was one of the best.  The service, the food, and the atmosphere exceeded all expectations.  Maybe I was really hungry - I don't know :)  The naan, the appetizers, the vegetable samosas, and the main dish were great.  Unless it's a fluke, this is one of my favorite 3 places in the world for Indian food.

I spent at least 10 minutes chatting with the waiters because I came early, and they were free to talk.  The place seems to be well-managed, and I'm pretty sure that it'll rank high on Yelp as more people check it out.

If you're in Toronto, please try it, and write about your experience.  Am I the only one who thought it was great?"}
{"text":"I came here with a friend for dinner because he recommended it and I honestly recommend to everyone else. It was my first time ever experiencing Authentic Indian food and I've grown to love it so much after this one visit. High quality, great ambience, and delicious food. Definitely try out their Samosa you won't be disappointed. Oh, and their chicken xacuti and garlic naan bread! (I'm currently having cravings for these while I'm writing this review lol)."}
{"text":"I faintly remember The Host of Richmond Hill which has it's own Fine Dining experience suitable for the Hotel patrons next door.  259 Host provides this company the Downtown location with even more creative Menu flexibility in an upscale schmooze setting near the Entertainment & Financial District.  Overall, quite Business Lunch/Dinner Friendly as well as Date Friendly prior to the office or club scene or BOTH.

For some reason, our service seemed sparse even from the door.  I was kind of expecting a HOST to greet us when we come to the 259 Host.  When the staff did come by, they were excellent so my tip is to ask them whatever you need if you ever get a hold of them.

Samosa Sampler($7.00) is quite Fusion to say the least.  When Samosas remind me of Chinese Dumplings or Greek Spanakopita, I think Fusion.  I didn't realize until now that Samosa is more suitable as a casual Finger Food while I massacred and deconstructed each one while trying to share with another Friend.  A-OK

Tangy Chaat($7.00) used a bowl with 3 distinct spaces which seems more suitable for the Samosa Sampler simply because the 3 spaces was now using the same Tangy Chaat therefore looking at 3 of the same things on 1 dish.  I like the texture of this dish which has crispy crunch while contrast by Yogurt.  A-OK

Chicken Kebab($17.00) had a nice Tandoor Char on it and cooked with larger pieces than your typical Tandoori Chicken except for Chicken Legs.  It's fine in flavour but the plating presentation seems slightly less exciting and using the same Garnish as the prior Samosa Sampler became repetitive.  Meh

Squash Bhaji($12.00) is pretty good because it was like a Chunky Vegetarian Stew with some delicious Spices.  Squash makes it a perfect dish in the Fall/Winter months.  Fan'd

Chicken Xacuti was a thicken Curry Sauce that was very Naan accessible.  I didn't like the Chicken as much in the dish but the protein here is an afterthought as there's plenty of Xacuti for you to be satisfied already.  A-OK"}
{"text":"Really nice Indian restaurant. The complimentary chutney is a great way to start. Highly recommend the butter chicken with Naan.  This is a great place if you are looking for a date night and a meal you can enjoy without being rushed."}
{"text":"Food- 4.5/5. Strongly recommend the jackfruit masala (vegetarian)! It was our first time having this dish here and I loved the spice mix, tomato-based sauce, and meat-like jackfruit (I've been craving animal protein lately). The chana pindi (spicy chickpeas - also vegetarian) was aromatic and delicious too. It had subtle notes of ginger and herbs, and I appreciated how the sauce was not heavy or cream-based as the lightness balanced out the thicker starchiness of the chickpeas. Both mains were very filling and my partner and I actually had a hard time finishing despite arriving hungry!

I would not recommend the tangy chaat appetizer (vegetarian). It's an Indian street food favorite and features crunchy rice crackers soaked in yogurt and other sweet and sour sauces. The flavors came from the various sauces (chutney, yogurt, etc), which are found in many of the other crispy appetizers as dips, so was pretty basic. The last time I've had chaat was in Philadelphia and I appreciated the fresh fruit toppings and rice cracker strips over whole crackers.

Service- 4/5. Really, really neat experience to be personally checked on at our table by one of the chefs! It's always so cool to finally be able to meet the real master of the show = all the hardworking and super talented kitchen staff! Service lost 1 star for being very slow in terms of getting seated, water, food, and our bill. Tip- make a reservation on high demand evenings (i.e. Friday nights) since we dropped in at 8:15PM and had to wait around 40 minutes for a table. 

Value- $41 for 2 people pre-tip tonight, which is pretty good! We left full."}
{"text":"Excellent food, upscale atmosphere, friendly service.  It's a bit pricey but I had a groupon that cut the check in half.  

Had the cheese naan, panir tikka (soft and not overly seasoned), goan chicken curry which was spicy but not too hot - a good change from the butter chicken that I often get.

Would have given it 5-stars but they forgot to pack some of the food that that we had left over and asked them to pack. So we weren't too happy when we got late-night cravings for the leftovers and half the food was missing."}
{"text":"When you're in the market for something a little more special than your umpteenth Banjara meal, and want Indian cuisine that is more upscale and dish centric than a buffet style pig-out, then 259 Host pretty much can't be beat.

I've been here twice, and both times have been excellent. Our first trip was close to their opening, and we received extra special attention in the still-empty restaurant. I happily remember my tipsy self, declaring my meal \"very special\" to the chef who came by our table to see how we were enjoying our meal. Embarrassing.

Indian cuisine with taste, imagination, presentation, flavour and great service. Not the most economical experience one could have, but if you enjoy Indian food, it's worth a special visit."}
{"text":"Came here for lunch and there were a good number of people dining but we did not have to wait and were seated promptly. I ordered the chicken thali and asked for the butter chicken.  On the menu it seemed to give you choices for item a or item b but the server did not ask me to choose between the items so other than the butter chicken I'm not sure what else I had. Regardless the food was fairly good. The butter chicken was flavourful, the Naan bread that came in the meal was so soft and fluffy, and the dessert was really good. The portions were fairly decent as it left me in a good place between being hungry and stuffed.

The chef came by several times to check on us and even brought us some complimentary chicken which was awesome.

Overall it was a pretty good experience and I will definitely be back for some more of that naan bread."}
{"text":"Great indian food. Chicken tikka - loved the sauce. Best I've had in TO. Naan and rice really good too."}
{"text":"Very nice atmosphere. Service was excellent.  We had to  move our reservation back 30 minutes and they accommodated us nicely.

The food was good--but westernized quite a bit.  The butter chicken was excellent, moist and tender--but there were only three pieces of chicken in it.  Garlic naan was standard naan and good. Same with basmati rice.

Beef and chili was good (beef a bit tough) and we liked the jackfruit.

Frankly, I hovered between three and four stars. I really liked the place, but just can't get near \"as good as it gets.\""}
{"text":"Came here to try out their Summerlicious menu with a couple of friends. For $18, we got a lot of food and were all quite full. I ordered the chaat papri without yogurt as my appetizer. This is a very simple dish, nothing too special about it. Common Indian street food, and you can probably get much better on Gerrard street or Brampton. But still good for what I expected. 

For my main, I ordered the 'bhindi'. This is curried okra and potato. A little bland, but still good! The naan was soft and hot. This also came with lentils and rice, so it was very very filling. The dessert was very simple - gulab jamun. Nothing special here. 

The service was a little lacking. Nothing great, waiter seemed tired and service was slow. I didn't expect much anyway."}
{"text":"Lots of seating, flavourful food, great staff. 

Came here for summerlicious with a group of coworkers. We set reservations for 10 and was greeted immediately upon entry. The place is a bit small but there are 3 floors so in total, there's quite a bit of seating! Lots of windows, great lighting. Ambience was perfect. 

It was my first time having Indian cuisine so of course, I went for the butter chicken. It was great! The naan and the chicken were great. The rice and the yellow side dish was a bit spicy for my tasting but nonetheless, great. 

Wonderful experience!"}
{"text":"Good, fresh and authentic indian food! Loved their dal and baingan bharta! Reminds me of home.. definitely comfort indian food. The butter nan is amazing you can taste how fresh and delicious it is!! Their kebabs are great too. All in all one of my go to indian places."}
{"text":"The food was very tasty!!  Quantity of the food was generous. However, the waiter who greeted us and handled our order could have been more engaging and friendly.The music was weird. The decor was rather boring, nothing memorable about it. Slightly overpriced for the overall experience."}
{"text":"Had a fabulous evening at The Host.  Food was excellent.  Warm plates, delicious naan, sauces were tasty and rich.

What really stood out was the warm friendly welcome and service.  Shita (hope I got that correct) was friendly accommodating and fun! Made the evening extra special.  Thank you!"}
{"text":"The worst Indian food I have ever had. I ordered through order it.ca. Terrible. With all the amazing Indian restaurants that we have in this city, don't waste your time and money on this one."}
{"text":"Absolutely outstanding food and service. Visiting Toronto, and looking forward to return trip. We will eat here again."}
{"text":"For those of you who want the butter chicken-type dishes, I highly recommend the Chicken Lababdar. It's a little spicy but totally worth it..

The Chicken Xacuti is delicious as well (if you prefer the spicy side of things)... Although; I would ask if they could sub in lamb for the chicken if I were you. 

Plus they give you a healthy portion of naan and rice - one order is more than enough for two people."}
{"text":"when you are in the mood for something a little more special than fast-food indian, this upscale and sophisticated restaurant offers great indian/fusion cuisine at around $20 for main entrees.

we were seated on the upper level of the restaurant (there are three levels i believe). the interior is decorated with earthy tones and the dim lighting added tranquility to the atmosphere.

papad and mango chutney was served as a complimentary appetizer. another type of bread was given as complimentary which i am not quite sure what is was called. 

Samosa Sampler ($8) comes with four different types of samosas: potato, lentil, avocado and spinach and two dipping sauces: coriander and date chutney. the potato samosa is very close to what i am used to. spicy and potatoey. the lentil was bit hard to eat because the stuffing kept falling out spilling all other the plate. it tasted similar to the potato stuffing but milder. the avocado samosa was presented in a chinese dumpling style. not much flavour in this one though. the spinach samosa was creamier and saltier compared to other three, kind of like the spinach dip. in general, the samosas were fun to eat and tasty. i found that the deep fried skins were bit thicker for avocado and lentil variety.

Chicken Xacuti ($19) is prepared with 25 different spices and coconut. it is on the spicier note and the thick sauce is great for dipping the naan. lot of spices enriched the flavour which made this dish more enjoyable.

Butter Chicken ($19) was made with rich tomato sauce. by far, was the best i've had. it is creamy, well balanced between sweet and savoury. the chicken is moist and tender, plus plenty of sauces for dipping.

Garlic Naan ($5) tasted just as good without any sauces. it's always great that they make the naans in the kitchen instead of serving ready-made store-bought kinds.

Plain Rice ($5) was bit pricier for what it was though. it was really plain, no flavour. i now regret not ordering the saffron rice for extra two dollars. 

after enjoying the appetizers, our server came with a little metal stick and scooped all the bits and pieces off our table, leaving our white linen clean.

my experience at 259 host was excellent. the food was great, the atmosphere was perfect for a romantic-casual dining and the service was prompt and friendly. i am grateful that my boyfriend surprised me with this fine indian dining experience.


note: the prices listed on the web are different than the prices of the physical menu (web prices are couple dollars cheaper). few dishes are not listed on the web as well. they should update the web menu to avoid any confusion."}
{"text":"I was taken here by Indian work colleagues, including individuals from India, and the food passed the grade. Service was casual but friendly, the food came quickly and was tasty. It looks like it can do romantic, casual and business. Looks like a reliable 'go to' for Indian when in the neighbourhood."}
{"text":"The curries and the Mango Lassi here turn me Naan!

One of the best (and few) Indian Fine Dining restaurants in Downtown Toronto! In addition to a menu that caters well to people with varying taste buds, the dishes can be further customized with different levels of spiciness for the customer! (my parents are on the extreme ends of this spectrum so they loved the fact that their food was spicy while I appreciated that it was not too hot to eat)

The entrées have everything from a safe bet butter chicken to a relatively daring lamb roganjosh and the menu wraps up nicely with options for Gulab Jamun, Kulfi or Mango Phirni for Dessert!
My recommendation - Try the Seekh Kabab! It's a little on the spicy end but definitely worth a shot, especially if you're a fan of mutton/lamb dishes. 
The place tends to be a little on the expensive end, however that's to be expected with the level of cuisine being provided.

The servers are fairly nice, there are times when they will favour certain customers over others, and I was a little disappointed at not being accommodated according to my wishes (wanted a table on the higher floor as requested) even though I had a reservation.
All in all, great food, friendly staff, and I didn't have to wait long for my food (Which is always a plus in my books for fine dining!)"}
{"text":"This restaurant is one of the best restaurants in downtown. It's a very nice, quite and cozy place for a relaxing for dinner. The food was great! The naan was perfect and fluffy. The roganjosh was cooked to perfection. The staff were very courteous and the chef came out and personally asked if everything was fine, which was such a kind gesture. I really enjoyed the experience."}
{"text":"This is one of my most favorite restaurants to take friends within the downtown core. The service is excellent and the wines they offer are perfect for the food (try their Reisling). The dessert selection is my favorite along with the curried eggplant.   

Overall, one of the best Indian restaurants Toronto has to offer."}
{"text":"I do not have Indian food often, but this place was really good.  Every dish was very enjoyable.

For appetizers we had
Tricolour peppercorn tandoori BBQ shrimps with fresh peppers

And for our main meal we had
Beef tenderloin in a red curry of chilli, cumin and roasted spices, a delicacy from north west region of India -Rajasthan and
Chicken Xacuti

The restaurant is a little pricey as we ran about $45 a plate and I was surprised we were the only table being served."}
{"text":"This restaurant was conveniently located right next door to the Residence Inn, where we stayed during our visit to Toronto.

For appetizers, we tried the Samosa Sampler and Chicken Kebab.  Both tasted great and had a unique presentation.  

For main, we tried the Rack of Lamb and Gobhi Masala accompanied with Saffron Rice, Chana Pindi and Garlic Nan. The Lamb was excellent, tender and flavorful. The Gobhi was OK. We took a chance on the Chana Pindi and unfortunately didn't like it. Comparatively, we prefer the cousin dish that is tomato-based, Chana Masala. Rice and Nan were also good. 

Service was very friendly and top of it.  You could see the open kitchen through a glass window, which we thought was cool.  To us, that meant \"nothing to hide\".

Overall food and experience was great, but the price point was a bit high.  You are paying more for the service and atmosphere.  I've had comparable food in less fancier places."}
{"text":"Where do I even begin? 

Firstly, whenever my fiancé and I eat out, we always try and be friendly and engaging towards our servers. We try to keep an open mind if we receive terrible service, and give them the benefit of the doubt. The service we received at 259 Host was the worst I've ever experienced in Toronto. 

We had made a reservation for my birthday. When my fiancé made the reservation he stated that it was my birthday and that we were hoping to do the Summerlicious menu. 

When we arrived we stated that we had a reservation for 6pm. The male server asked, 'Are you with the party of 4?' and I said, 'no, there's only 2 of us'. At which point his expression changed and he gestured towards a table near the front window telling us to sit there. He didn't even ask us for a name for our existing reservation or anything.

The wine glasses at our table were filthy. A waitress came by and dropped off two Summerlicious menus at our table and asked us if we wanted anything to drink. My fiancê doesn't drink and I was on meds at the time that didn't allow me to drink so we just ordered water which initiated some eye rolls from the waitress.  

We noticed that another couple that arrived after us were seated at a nicer booth, and were also given the full menus and not just Summerlicious ones. We were offended by this as we felt as though we were judged based solely on appearance or attitude. We were dressed well and were very polite which was extra upsetting because it wasn't reciprocated. 

When the waitress came to take our order, I had trouble pronouncing something on the menu which just prompted more eye rolling. If I wasn't starving I would have left right then. 

Turns out we ordered the same things that the couple seated after us did, and despite the fact that we were seated first, ordered first, the male server brought them our food! Thankfully we didn't have to wait long until our meals came, but still. It was just another fault against them in my books. 

The food was mediocre at best. We're huge fans of Indian Food and have tried loads of places around the city and this place ranks lowest for us. Also, because we have a lot of allergies between us, we read all descriptions thoroughly and they didn't specify nuts being in one of the dessert options we ordered. A close call which really settled that we would never dine here again."}
{"text":"Ordered their food off uber. The best part of the food was their chaat Papri and chicken 65 and their naan were amazing. Now the average was their chicken tikka masala. It definitely lacked the spice it was too sweet for my liking and the malai kofta was too bland. All in all a average experience but I am very sure that their food would taste even better if it is hot and served fresh instead of a take out. Would definitely go back."}
{"text":"(This review pertains to summerlicious from August) 
Prior to dining at this restaurant I told a friend of mine whose family is from India that I was going to 259 Host for dinner. 

\"Oh, that overpriced place on Wellington?\" I weakly nodded a yes. \"You know what the restaurant is? It's like they put a bunch of Indian street food and throw it on some nice French platters and  it's suddenly \"fine dining\" with European elements. Voila, now they can charge you three times the normal price\". 

I was determined to prove her wrong, so I adamantly decided to still go to 259 Host. 

I am saddened to say that there were no culinary fireworks combusting into gastronomic heavenliness. What I did have however, was a slightly confused stomach, a hefty bill and admittance that my friend was right. 

Let me give 259 Host this though- the decor is very lovely. It's quiet, private and very romantic. I really liked the dim lights, dark furniture and gold railings. This is exactly what I would think a \"fine dining\" restaurant should look like. 

Unfortunately, the food does not live up to the decor. 
The Chicken Mirch Tikka was assembled very well, but the boneless chicken was flavoured in a weird proportion of chilli and coriander.  
The Lamb Roganjosh was a bit overwhelming, once again seasoned too heavily. The portion was too large for my size. I would rather see them cut down on the amount of food and pay the same price to be honest. 

The food is not bad but honestly not worth the price. 
Off to Yorkville for Indian it is."}
{"text":"Omfg amazing, excellent bar raising indian food served with class."}
{"text":"This is a pretty good Indian restaurant in the Entertainment District of central Toronto. The food is good, the service is decent and the atmosphere is relatively nice. The Mulligatawny Soup is particularly good and I also like the Chicken Xacuti. The prices are a little expensive but not out of line for the quality of the fare. With tip and tax, you can expect to pay about $30 - $35 CAD per person. This is an OK deal for the quality of the experience."}
{"text":"Like others mentioned, this place has serious issues with their reservations system. I called 5 days in advance to book an important birthday dinner reservation. When we arrived, they had absolutely no record of my reservation and the place was packed. They suggested I had called their other location but I'm sure that was not the case. Anyway, they did manage to find us a table but it was a bit of a mess.

We went for a Winterlicious dinner for a $25 set menu. The food quality was good but the portions were extremely small. Not disappointing for me but if you were a hungry guy you would have definitely still left hungry.

I had a tandoori salad for a starter (various grilled veg and fruits assembled nicely on a plate) and the chicken kebab entree. The kebab was really only two small bites of chicken - maybe 3-4 oz in total, served with rice, naan and some chana massala. Flavour was excellent but I feel like we were given small portions because they were offering the $25 set menu for Winterlicious - not fair! The dessert was a half cup serving of ice cream or a single piece of gulab jamun, so they skimped there too.

The staff here were all very polite but quite untrained and flustered. We had a few quirks - one guy trying to give us our entrees before clearing our appetizer plates, and they brought out 2 of our entrees and made us wait 5 minutes before the final 3rd one appeared. It took a bit of time flagging them for the bill too.

Overall a mediocre dining experience, I doubt I'd go back."}
{"text":"Very nice restaurant. Candlelight. The staff was very attentive. Though gave us less naan than ordered. Felt cozy but the food was very high priced. I felt like I didn't get what I paid for."}
{"text":"I've been looking for good and authentic Indian food in Toronto with not much success, but  this place comes close. It's upmarket and like the good Indian restaurants you find in India, but the portions are too small for the price - which is why I take the one star off.

We went for summerlicious. Service was ok. Authentic Indian drinks like nibu pani (fresh lime) were missing so you have to stick with the western favourite of mango/plain lassi.

Starters - really good. We all enjoyed what we ordered - chicken tikka stuffed naan (yeah people there's nothing called \"naan bread\" - nann is a kind of bread. It's like \"chai tea\" - chai is tea. Ok I digress). The paapri chaat was the most authentic I've had in North America so far - takes you back to Delhi streets.

Mains - really good lamb roganjosh, achari lamb, madras chicken. Butter chicken was more westernized - less spicy and too sweet (I asked them to make it spicy but that didn't work). The vegetarian jackfruit curry was the icing on the cake - this is the kind of dish you find in upscale restaurants in India, and the fact that 259 sourced the jackfruit and had it on the menu - really impressed. We've been looking for jackfruit in Toronto with no luck. The portions were right for the ladies' lunch, but the men in our group were hungry soon after we ate. Three pieces of meet in curry was too little for them - they should have 5.

Dessert - mango kulfi was authentic and great, as was the kheer/payasam (rice pudding) and gulab jamun.

I'll be back when winterlicious/summericious is on, or I'm feeling loaded."}
{"text":"259 Host is a nice change to all those other Indian Restaurants I been to before. 

More Upscale 
- with white linen which is so unfriendly to all the curry and dark sauces 
- nicely decorated, modern and comfortable. Just like one of the European restaurants 
- Nice and quiet environment... dim lighting and tables not cramped together 

More Westernized 
- in both presentation and the ingredients used... 
- prices! not my usual Indian stuffed my face full with a low price... but really inline with most other Western restaurants. 
- All the food we ordered are all tasty...(we finished everything!) Love that they use a lot of spices in the dishes... 

Services? 
- seems lacking or they were understaffed the night we were there! 
- the 3 storeys set up of the restaurants makes it hard for the staffs to realized that \"someone\" us been standing around at the front for almost 10 minutes! We checked our jackets in ourselves (maybe I should tip my friend) and almost want to sit ourselves! 
- Wait staffs not in sight most of the time.. but quite accommodating when they are presented (thanks for bring that mega hot sauce!) 

Thanks for our fellow yelpers for making 259 Host a great experience! And thanks for sharing everything!!!"}
{"text":"We recently ate at 259 host and were in hurry so had to pick something very quickly to go. We ordered Dal Makhani and I must say it was very delicious. Would highly recommend this place to everyone. If I had more time in Toronto, I would have visited it again."}
{"text":"I guess Im catching up on my reviews. This is about a year late. 
I believe I was here for last winterlicious? 
I can say I would def be back and would recommend.

Great portions and great selection and tasted yummy!
Im not Indian though but a couple of my friends that went with me are and they liked it (not sure how much they raved about it but they liked it) 

From the Naan to the main to the desert and service. All very good. 
The place is also well ventilated and has a closet to store your jacket. 
As most know but maybe dont want to say that sometimes a night out for Indian food makes you come home smelling like the delicious food - which isnt so great. (Just like going out for Korean BBQ) Not so much in this place. 

Classy ambiance for a romantic dinner. 

I'd be back for any of the --licious events!"}
{"text":"Don't order delivery. I called the restaurant after my order had not arrived after nearly 1.5 hours. I was told the driver was on the way. When I called back, I was told they never received the online order. So what was it?? Five minutes later, I received an email that my order was accepted. I called the restaurant back who seemed surprised that I then wanted to cancel it nearly two hours later! The next hassle will be see whether my credit card (which has been charged) is refunded. Really frustrating experience."}
{"text":"Was in the mood for Indian food but wanted to stay close to my hotel (Marriott Eaton Center). 

Ordered: butter chicken, saag paneer, garlic naan and a mango lassi.

Server brought out my entrees before my naan..

 I asked to have my food packed up but then after a while (after I had my to-go bag), I had to explicitly ask to get my check...

Food is good but service could use some improvement for an overall better experience."}
{"text":"Had dinner at 259 Host last night, as recommended by our hotel concierge. Frankly, this was a terrible recommendation.

First off, the restaurant was freezing cold. The hostess kindly said she'd adjust the A/C but I literally shivered during our entire meal. The restaurant itself is fine, nothing special in terms of decor but it was clean and modern-ish.

Service was perfunctory at best. The gentleman who took our order wasn't friendly in the least. He became even less friendly and unapologetic as our meal went on.

Food was definitely the main problem at this restaurant.
-- Lentil salad. I don't know how this was because they ran out of lentils and I came back to let me know I had to order something else.
-- Crab / shrimp cakes. I don't know how these were either because I ordered these in lieu of the lentil salad, clearly stating that I don't eat cheese. I was about to take a big bite when the aforementioned gentleman came by to tell me they contained goat cheese. So I'm obviously glad he let me know but seriously, what not prior to bringing them to our table when I ordered them?
-- Potato / Avocado samosas. Again, confusion. When I inquired why there was no avocado to be found on the plate the gentleman stated that the appetizer was now squash and potato. So why not revise your menu or at least let us know while we're ordering? The potato samosas were fine, the squash was a mushy mess.
-- Tadka dal. I finally had to order this because there was nothing else that didn't contain milk or cream or cheese. It was spicy. It wasn't very good.
-- Plain rice was good.
-- Husband and daughter liked the chicken tikka.
-- Naan, both plain and garlic, were well received.
-- Raita also went over well with the husband and daughter.

When the bill came I noticed that it included the crab / shrimp cakes. When I pointed this out to the gentleman he stated he didn't charge us for the dal, that it was an even exchange. Umm...actually no, the dal was $5 cheaper. So he reluctantly reduced the bill by $5.

Overall this was a very disorganized meal, from a disorganized kitchen, by an unfriendly server, while I nearly froze to death (sorry for the drama).

There's no way we'd ever return."}
{"text":"I've never dined in. Only ordered through Ubereats. I freaking love this place. When I order it, my whole family gets excited. I just reheated the bhindi, spinach, biriyani and tadka dal and it was orgasmic. All slopped together. Real Indian style lol the Amritsari fish, mirch chicken, chicken 65, and everything I listed above are REALLY GOOD. Some GREAT. I'm actually intrigued to dine in now looking the pics. Perhaps I'm only privy to a delivery menu. And I simply can't have that lol This place has never let me down. And I'm Indian"}
