{"text":"Great food, and amazing service! We had catering from 3 Amigos for an event, and the food was exceptional and was very well received. Would recommend if you want to try out some tasty, and affordable Mexican food in the area!"}
{"text":"Une envie de voyager direction le Mexique , excellent et très bon, à tester et j'encourage tout le monde à le tester rue Saint-Denis Montréal."}
{"text":"I'd recommend the restaurant for their great cocktails; they're great on their patio on a hot summer night! As for the food, I've had better Mexican food elsewhere.  Pros: (+) Great cocktails (+) Affordable (+) Tasty complimentary salsa and nachos  Cons: (-) Too greasy (-) Inconsistent food quality"}
{"text":"This was an alright tex-mex place in Montreal. We stopped because we were hungry and heard a lot of french speakers, so assumed it was a neighborhood place despite the decor.   The food and drinks were pretty average, I would say even on the side of below average. Service was a bit slow and the prices were extremely high - our bill came out to $80 for meh Mexican food and service.   Find a better Tex Mex place."}
{"text":"Really, really, really bad food. Please don't go here with someone you like because you'll constantly be distracted by how bland and soggy your plate is.  On a positive note, our $13 lichee sangria was pretty good. Thumbs up. Go to Carlos & Pepes instead."}
{"text":"I go for lunch with my friend. The food is good, affordable and the service from our regular waiter (Dave) is amazing. We always sit near the bar area since the service is more speedy."}
{"text":"best experience being served by gleb--a true charmer. witty, kind and really understands mexican cuisine. he made fajitas wednesdays something to look forward to... sadly, he now solely works on friday after four pm, but to quote rebecca black, \"friday... friday, gotta get down on friday!\". this waiter needs to become manager asap. 3 amigos? more like gleb amigos."}
{"text":"It isn't my first time coming to this restaurant. We absolutely love the food, especially the fried calamari, the best I've ever had.  The reason why I am giving it only 3 stars, is because of the service with the noticeable new staff. We enjoyed the previous same waiters we would usually get. Today, we noticed all the waiters were new, and we always go there during the week at lunch time. Our waiter wasn't so great. It took him so much time to  bring us water and give the complimentary chips, salsa and soups. Also, when we were done eating, we were waiting almost 15 minutes for him to take our plates off and give us the bill, and he kept passing around our table at least 10 times, like he sees nothing.   We will surely come back, for the food, but without expecting a minimum of good service."}
{"text":"This was my third and last time at a poor attempt at expanding a franchise. On a weekend evening the wait time is excessively long. Weekdays is the opposite, you get your table right away but your service is extremely slow. It took 15 min just to be served a glass of water and a simple hello. The waiter was totally out if his realm. He was confused, impolite, bad breath and couldn't even crack a smile. The food was served quickly as if it had been prepared in advanced and sitting under a heat lamp. Very bland chicken fajitas. Dry chicken with very small portions of condiments. All 4 of us did not like the service that evening and I for one will never be returning again. P.s. I heard there is a Carlos and Pepe's near by. I will give them a try instead."}
{"text":"I don't know why there is so much hate on 3 Amigos. The atmosphere is a lot of fun, especially on cold winter nights! I've been here with both with my 20-something friends where we get fun drinks and sit at the windows, and with my family for a quick Wednesday night $7 fajita special. Can honestly say I've tried almost everything here, and the mex burger and linguini avocado verde are awesome! You get free cake and a sombrero on your birthday!"}
{"text":"This was the worst Mexican food ever, they don't know any better! I suggest to take a trip anywhere to U.S. to learn what good Mexican food looks like. I don't recommend it at all!"}
{"text":"If a restaurant is willing to serve rare meat, then it's a good sign, its also another good sign if they actually cook it nicely, which they did.  I usually go here for the Fajita night which is on Wednesdays. For less than $10.00 you eat like a king. They start you off with unlimited complimentary tortillas chips with sauce. On Fajita night, for under $10 you get beef cooked to your liking - rare in my case, plus you get a plate of fajita wrap and the trimmings.   The ambiance is noisy since it's always packed, and the tables are tiny. My mate and I always want the bigger tables but they always refuse, then we order for a family of 4 and they always move us to bigger tables.  L. John Dory Twitter: @LJohnDory"}
{"text":"3 amigos is definitely my favourite mexican restaurant. The food is simply delicious ( the drinks are pretty good too!) and the price is fine.  I didnt give 5 stars because the place is quite small and noisy. The service is okay."}
{"text":"We thought the place would be decent- but we were blown away! Meyranie gave prompt and excellent service and was very sweet and patient when we attempted to speak french. The beef burrito and veggie quesadilla were very tasty, filling, and presented wonderfully. What a great first meal in Montreal!!!!"}
{"text":"Here on vacation and popped in hoping that my experience would be better than many of the ratings on here.  Sadly, it wasn't.  The food is just ok, nothing spectacular and the service is terrible.  The restaurant was clearly short staffed and our waiter was running around like a lunatic.  He was nice enough, but the blame should be put on the management for not getting someone else in to cover.  A dinner that should have taken 45 mins. took almost 2 hours because half of it was spent sitting there waiting for service."}
{"text":"the food was better than i though and it was cheap. come here of you are not picky, if you know real mexican food you are going to be dissapointed but for the price what the heck"}
{"text":"HORRIBLE restaurante que se hace llamar \"de comida mexicana\" . Las bebidas son asquerosas con sabor artificial y hasta me supo el polvo con las que las preparan. Definitivamente si eres mexicano ni te acerques a este lugar si no quieres decepcionarte"}
{"text":"Jaime bien .. Bonne ambiance et la bouffe est delicieuse ;)"}
{"text":"This place is not the best mexican restaurant. The food is not tasty at all, but its really cheap, so I go there once in a while. Their cocktails are great tho, the ladies love them. Probably go there more for the drinks than food, I would look elsewhere if you're looking for good mexican food."}
{"text":"Nous y sommes allés hier soir et vraiment mis à part les énormes drink double, le reste du repas laissait à désirer. Le poulet était brûlé et sec (ils disent que c'est la spécialité du chef pourtant) et le shish kebad était presque immangeable. C'est le deuxième fois que nous y allons et ce sera la dernière. Dommage, les drink vont nous manquer."}
{"text":"Armed with reasonably low expectations and looking for pina coladas on a hot day, a group of us unfortunately chose to come here, only to leave all but the smallest quantities of our beverages still on the tables. Horrific. Honestly. Couldn't even drink it, and I don't know that I've ever left a frozen drink on a table before, much less when I'd opted for a \"yarda\". Nachos also significantly subpar. Avoid at all costs."}
{"text":"Waited 15 mins to even get served after sitting down. The beef in my fajita looked like it was chewed by a dog before being put on my plate. Guacamole was just crushed avocado.   No apologies. Terrible experience overall."}
{"text":"I can't stop farting. It's bad. I must retain my farts since I'm on my workplace right now, so I'm kind of farting from the INSIDE. Something there must have been rotten. I feel like poop. Thanks."}
{"text":"I'm aware that is not authentic Mexican food but I've been to other Tex- Mex which are amazingly good, I think the overall experience is very lame, I've been there a couple of times but I go with super low expectations so I don't get disappointed... I wouldn't recommend this place or other 3 amigos branch."}
{"text":"This place has plenty of seating and can accommodate large groups. The decor was interesting! It's located conveniently on St-Catherine.  There was plenty on the menu to choose from. My friend got the Mexican Flag Enchiladas (I think that's what it was called), and I got the Enchiladas con Mole. The food was pretty decent. Prices were within the $11 to $20 range.  Service was friendly and fast, especially considering how extremely packed and busy they were and how big of a group we were. Being an exchange student from southern California, I had been craving some Mexican food when I got to Montreal. I wasn't too disappointed.  EDIT: My friend from Spain and I came back for their $0.69 Taco Sundays. All day Sunday, you can choose between chicken, beef, chili, or veggie hard-shell tacos but can only order 4 of the same kind at a time. The catch is that you have to buy a drink. You also have to dine in to take advantage of the deal. My friend from Spain loved the tacos. Our favorite was the chili. The meats for the other kinds were hardly there and not very flavorful. Their apple in fried flour (forgot what it was called) dessert was amazing!  The food is average and somewhat pricey, but I'd definitely come back for the apple dessert!"}
{"text":"Great little place to get some good food but don't expect to leave anytime soon since the service is really slow. the wifi is meh do to the amount of people there but all in all OK"}
{"text":"I decided to try this place out despite the bad reviews because it was packed.  This was probably due to it being 69 cent taco night (Sunday).  It was a mistake.  The chips and salsa were both bland,  my diet coke was watered down,  and the 69 cent tacos were also very bland.  My girlfriend ordered a margarita with no salt,  which arrived with salt.  We told the waiter she asked for no salt and he argued with us,  saying she never said that.  She just settled for what was brought to her.  After we asked for the check the waiter walked by several times serving other tables until we had to ask for the check a second time.  The service sucked and so did the food.  The only good thing about the experience was the price.  I don't recommend it."}
{"text":"Seriously, Mexican, that wasn't near even to be real food If there was 1/4 star then it would be even to much for this place. I stayed in Montreal for 3 days only, hoping I can find a competitor to the great authentic food that we have in Boston. And this place has ruined it. 1st of all the place design from inside was horrible. Usually in a Mexican place u would love to have a good view from inside to the whole restaurant and the bar area, to feel the vibes of the Mexican music. The seating area near the windows is horrible with very narrow weird design.   Anyways let's get to the food (or what was supposed to be food), I think everybody would agree that the front face of any Mexican restaurant is its chips and salsa. OK good, I had a chips which was completely fake, and picked out from a grocery store, the salsa was a complete disaster, it wasn't spicy to the right level and it has APPLES AND CARROTS IN IT. And when I asked the waiter, is that apples inside the salsa? He replied : yes. I told him: why do u put apples inside a salsa ? He said : it's the chief's recipe. I'm sure that there wasn't even a clown cooking in that place.  Anyways let's go to the menu, Very torturing long menu which left me more confused than the taste of an apple and carrots with tomato and chili. So I figured out I should keep it simple and try their fajitas.  And it probably was the biggest mistake of my life.  Meet was burned, vegis were carbonized, and again there is a weird ingredient on the hot plate (TOMATO). I don't know of any place in the world that put tomato in a near 100 degrees Celsius plate. Because the tomatoes contain a lot of water it simple burned my tongue. Complete disaster and never ever get into this place if you know what food means."}
{"text":"So...it's obviously not authentic mexican. The inside of the restaurant may as well be a nightclub, for the dark, crowded, music-blaring atmosphere it has. But if you can grab dinner (preferrably by the window or outdoors), here's the deal:  Good nachos - borderline great, even. Great margaritas. Smart staff.  And that's the whole of it. I didn't like the rest of the food; the quesadilla's were a mess. It's Tex-mex through and through.   But really, if you can do Nachos and drinks right, it's worth a shot. Just expect more of a Sports Bar and less of a restaurant."}
{"text":"Just not very good. Cold food. Tortilla soup was blah. Would not recommend.  Drinks were pretty good which is why this is a 2 star not a one"}
{"text":"Un bon restaurant Tex-Mex, accueil correct, carte trésor diversifiée, prix raisonnable"}
{"text":"We went there on a friday night, the whole place was jam packed. We were able to find a table and we ordered our food. We ordered a nachos platter as an entrée, and we got the 4 chicken taco build-your-own (18$) and 3 hard shell tacos with rice (8$) First of all the nachos platter was very disappointing, almost no cheese, no salsa on the chips and barely any toppings. Plate came quite hot at least. Then maybe 40min later came our main course, my hard shell tacos were ok but my friend complained that his chicken was under-cooked and mediocre. This place is way overpriced for what you get and the service is very average."}
{"text":"Super tacky, gross, and dirty on multiple levels.    I also have a strong suspicion that this place must make Mexicans cringe.  It seems the type of place where North Americans can enjoy some watered-down version of Tex-Mex food and get drunk.    If it weren't in such a good location (plenty of Concordia students), I'm pretty sure this place would end up on Gordon Ramsay's Kitchen Nightmares."}
{"text":"We stopped in just for a drink but were told we had to order food too because their license requires it. No problem, we ordered guacamole with our double margaritas. Drinks arrived without ice but PLENTY of Margarita mix. Even with the extra shot of tequila the drinks tasted like nothing but sour acid mix. Nasty. Guac was about the same quality with mysterious olives and a chunk of cantaloupe in it. Weird and awful. Avoid at all costs."}
{"text":"I wasn't too impressed by 3 Amigos - the servers were uninterested and lacked politeness and friendliness. The food was typical generic Mexican; my burrito was fine, but it lacked flavour and was quite bland.  It's a pity my trip to Montreal ended with a meal here - there are much better places around."}
{"text":"If you want a fun American style \"mexican\" ambiance, you'll get it at 3 amigos but man...the food was brutal.   Underwhelming, poor excuse for Mexican food. Save your money if you're looking for good food and head to Fortuna in little Italy for amazing and authentic tacos!  HOWEVER, if you are looking for a place to knock back some drinks with friends in a cool, upbeat atmosphere, this is a fun place for that."}
{"text":"Worst margaritas cocktails. When we complaint the waitress said she couldn't give us anything else and left"}
{"text":"I love this place always, food is simply delicious( a bit on the greasy side) but aside from that great service and ambiance!!"}
{"text":"We had the special Fajitas Wednesday, I had the beef, although it ended up a bit dry sitting on the hotplate for too long, overall it tasted quite good!  It had beans, guacamole, salsa, and sourcream on the side. And the meat of your choice/vegetarian with grilled vegetables and cheese on a bowl-shaped tortilla, of course with the soft tortillas too.  Place was packed and buzzing!"}
{"text":"Two of us were poisoned by the margarita gold yards... Very sour and just led to sickness. Started throwing up in the bathroom.. The food is below avg.. Being from NY with great Mexican everywhere I can tell you this place is not somewhere you go to for the food .. Maybe a different choice of drinks and a buzz will let you enjoy the food they offer... Its popular and I'm not sure if Montreal has a place with a similar vibe with better food but look elsewhere... On the other hand... Service is great and friendly."}
{"text":"PROS:  It can be cheap; taco platter for $8, burrito platter for $9.  Plenty of vegetarian selection.  Food is reasonably edible.  CONS:  Average americo-mexican food, a horrible beer selection (especially considering what Montreal has to offer), and staff who can't even act like they care.  Don't bother asking for even the simplest substitution."}
{"text":"This is the type of place you go to when you want tex-mex but with 10 times the queso and all of the makings of a tacky mexican commericial.  I was surprised the waiters weren't wearing sombreros.  I am not sure what makes this place Mexican, but I have to say that the margaritas are hilarious, 24 oz of sugar can't be authentic to any culture.  However, if you are looking for some cheese melted with cream and some salsa with chips, this is the place."}
{"text":"Goodness gracious me!  Karma is as karma does, and I hope fellow Yelpers send me some good karma to offset the one I'm about to gather through this review.  I'm torn. 3 Amigos is, for the more experienced Montrealer and visitor, a sort of stable reference point - when other options are exhausted (or it's too cold to walk anywhere else, often the case north of the 45th parallel), you know there's ALWAYS 3 Amigos. Just like your weird relative in another town, because everybody has one - you know you might not want to, but you can always crash at their place if needs be.  Well, critical reviews are best done quickly, just like tooth extractions. Yes, it is crowded, loud; the service can be very slow and can feel inattentive at times, and the food justifies the price but not the points mentioned just prior.  One gimmick some will appreciate consists of the margaritas. A cocktail served in a glass as big as your head is sure to start a conversation! However tempting this course of action may be, player be warned: you better be a good talker and a good listener, coz even a double margarita won't make you any more attractive to your date. Science tells us two shots of tequila in a bucket of water equal water tasting funny.  Well, at least after a double margarita and food at 3 Amigos at the end of the night you could very probably be legal to drive - and it better be a Lamborghini in order to impress your unimpressed (so far) date. Low-rider + Montreal's potholes = romantic stargazing while you're being towed. No, there is no winning.   Just come as you are - chilled-out, cold and hungry - knowing what you're getting into. I can enjoy it and I will return. And, whatever you do, TIP. Your waiter is over-taxed, eardrums bleeding and is probably either over-qualified for his job by a mile and dreaming of saving up for moving out West, or a hopelessly unappreciated artist who appears to his landlord in his worst nightmare."}
{"text":"We stepped into Three Amigos after being at a huge metal festival near mid-night. The staff member who sat us down and served us was Thomas. He brought water, chips and salsa within 5 minutes, he took orders and we got them about 10 minutes later. Thomas was great he was working several tables and the place was full because of the concert.   The Shrimp Taco Special had a decent amount of shrimp, it wasn't greasy just a nice combo of Mexican spices/sauce, shrimp, cabbage, and cheese.  Other things on the plate: rice, black beans (very small amount) and a small mixed salad. Overall it was a good meal and service."}
{"text":"Parfait pour les dîners la semaine. Abordable aussi."}
{"text":"J'ai pris un ceviche dans un \"bol\" (j'ai adoré la texture de friture maison) et un gros pina colada aux fraises. Ce n'est pas de la grande cuisine mais le service était rapide et amical."}
{"text":"Perfectly passable Tex-Mex atmosphere.  If you're looking for muy auténtico Mexican fare, then you should probably move on. But if wanna eat cheap tacos and drink giant margaritas with your friends, then stop on in.  This spot is great for Lunch, a 5a7, or dinner out with the family. The service sometimes leaves something to be desired, but you can usually chalk that to the place being busy."}
{"text":"Guys, this place was awesome!  First, the service: I can't, for the life of me, remember the name of our waiter but that guy was fantastic! Not only was he consistent on the check ups, he was also a great conversationalist and he was very knowledgeable about the menu.  The food: we started off with two platters of calamari on top of the complimentary chips and salsa. I was pleasantly surprised with the calamari--  it's a rare commodity to have good calamari in Montréal. The jalapeños in the calamari were also really good. We also absolutely loved the chips and salsa, damn that's good salsa. I can't remember what all my friends ordered for their main but I ordered ribs (don't ask, I don't know why) and it was really good, especially considering it's a Mexican food joint and not a smokehouse.  I haven't been back since then but I thoroughly enjoyed the experience and hopefully I'll be back."}
{"text":"The WORST slush margarita we ever tasted! A chemical green color and a bad taste that remained long after that first sip. We learned they used artificial lime in it. How can anyone sabotage a margarita with artificial lime?   Good service, it is a pity the quality was not there."}
{"text":"This place is really getting a bad rap on here..  This establishment is really a cool spot in my book... I love coming here...I've never had a probem at all... I prefer this locale at Sainte Catherine.  The margaritas are nice.... The sangria lacks that wine punch to it, but its still decent... Some nachos, some salsa.... A great people-watch spot if you sit by the window....  A lot of the Canadian locals come here on their lunch break..  Its clean, affordable and a nice atmosphere....  A lot of people are complaining that this is not authentic Mexican food. ARE YOU SERIOUS? This place was never intended to be a 5-star restaurant with a famous chef in the kitchen... Its a cafe with good finger food, espc if you're on the run with plans for the day.   3.5 stars in my book....ignore the negative comments"}
{"text":"I've been craving ribs for a while LOL, but didn't feel like paying 40$+ on a fancy restaurant. I remembered that 3 Amigos had some meaty meal options, so we give it a try.  Festive environment. It's a Monday afternoon. There wasn't too many customers, so fast service lol. I ordered a full rack of baby ribs. fck yeah !  I forgot they serve free salsa and chips, which is pretty cool. My friend told me it tastes better than the one from grocery store. Good stuff. We asked for another free salsa and chips. They kindly give us a round 2. Thumbs up!  HUGE PLATE! My sexy rack of baby ribs~ Delicious :D  My craving for meat, especially when they cook it with the bone. The part of meat that touches the bone is super tender. Makes me happy The fries are unusually super good and crispy. Good thing ketchup was nearby.  Good ambiance. Had a good talk. I didn't feel rush at all.  I've been to 3 amigos many times for party or group chilling. I'd say Friday and weekends night, there are lots of people, so prepare to wait or reserve in advance.  I tried the Fajitas before. Awesome idea, the \"Do-it-yourself\" type of plate.  Last thing, the dim light is super nice. It gives a romantic and relaxing atmosphere. Good job!"}
{"text":"Mediocre service and dishes. Good atmosphere. A bit slow.  I recommend its fajitas specially on Wednesdays. It is good place regarding the price.  It is a good choice for students."}
{"text":"This place is dirty and disgusting,  I should have taken a picture of the menu it was dirty and falling apart. Avoid"}
{"text":"Je voulais faire part de mon expérience aux Trois Amigos. J'avais eu de bons échos de ce restaurant et c'est la raison pour laquelle je souhaitais organiser mon anniversaire dans ce lieu, moi qui adore la cuisine mexicaine.   Les plats étaient correct mais sans plus et les cocktails chers et presque sans alcool (bien trop sucrés et limite écurants). J'ai testé un Mojito comme une majorité des invités (nous étions 25) et c'est l'avis général qui en est ressorti. Pour ce qui est de l'ambiance rien était fait ni mis en place pour accroître la convivialité (dur à croire qu'ils organisent des anniversaires de groupe pouvant aller jusqu'à 100 personnes).   Le service laissait vraiment à désirer, l'ambiance chaleureuse et festive typique du Mexique ne s'est ressenti à aucun moment et ils avaient juste l'air stressé et pressé que l'événement se finisse. Au final le \"gâteau\" est une pauvre part de flan mexicain à moitié écrasée avec une bougie plantée à la va vite dessus et allumé juste avant de me le déposer à la table. Les serveurs n'ont pas chanté \"Joyeux Anniversaire\" et ils se sont contentés de me mette un Sombrero sur la tête et ils sont partis.   L'ambiance à été insufflée par mes invités et seulement par eux. Donc peut être que pour manger à la carte en petit comité ça peut valoir le coup mais pour un anniversaire je vous déconseille ce lieu qui a réussi à plomber un peu l'ambiance globalement, ce qui m'a beaucoup déçu."}
{"text":"i don't know what these other people are expecting but you definitely get what you pay for. It's a cheap Mexican place that caters to a younger crowd, not Chicanos straight out of Mexico. It's in DT Montreal and not a cantina in Cabo San Lucas. So loosen up a little.  I was recommended this place by a friend and I go here every time I'm in Montreal and always have a great time. The salsa is second to none (they give you a complimentary bowl of nachos and salsa while you're awaiting your meal) and I always end up buying a jar and bring it back to Ontario with me. I get the beef tacos and chicken burrito and it's pretty cheap. I will admit that the chicken can sometimes be a bit dry but other than that it is palatable. They're also famous for their daiquiris and margaritas which are giant, quite tasty and worth a slurp.  Although it's probably not the best Mexican restaurant in Montreal it's definitely a fun and cheap place to go. So if you're not anal about everything beyond your control, chances are you'll have a great time."}
{"text":"I understand why you might be lured in. The food is cheap, they have those huge margaritas, and birthday-ers come out wearing a ridiculous sombrero. But the truth is, it's not worth it.   If you have a group going, you won't be able to make a reservation unless you're 20 people. You also won't be able to hear each other or even yourself. This place is incredibly noisy, since it packs in a lot of people who are trying to talk over the unnecessarily loud music. The best part of the meal is the chips and salsa you get for free as an appetizer. That salsa is like crack! After that, you get a very meh main course (though I do enjoy their salads, which are a good size and come in a tortilla bowl). Might as well get one of their big drinks to make it worthwhile.   I'd say if you're around here at lunchtime with a few friends, at least you'll get a cheap meal and it won't be as noisy. Otherwise, skip it."}
{"text":"I have been to this restaurant about 3 times.  I like the name and it satisfies the basic craving for Mexican food. Last visit we ordered fajitas, chicken enchiladas and chicken chimichanga. Everything was satisfactory not oily or greasy. The chimichanga was not crispy, however and I think they should replace the chicken filling with shredded instead of cubed chicken. I liked the enchiladas. The margaritas are also good. I would go back because the location is also very convenient."}
{"text":"Bon service mais on a attendu longtemps avant d'avoir le check et les tacos etaient fades..."}
{"text":"Margarita and chips is good,but food is just so so, I maybe back to try margarita. Goooooodddddddd"}
{"text":"Great food, awesome portions, clean, nice window seating four our trip. I had a great experience when I went midday. We didn't have to wait and we had a great time. Good food and fast service. The atmosphere was great, too. If you're looking for good Mexican food in Montréal, I suggest this place!"}
{"text":"This is the worst experience I have ever had in a restaurant. I am appalled at the staff behaviour. I was visiting from Toronto and on a trip for my friend's birthday so we had a reservation. One of the members in our party is deathly allergic to tomatoes. We waited 45 minutes to even order a drink, and then we all finally ordered. I understand a restaurant business is very busy at night, however the member allergic to tomatoes was brought food with tomatoes in it. (Even though she had said when she ordered that she had an allergy). The staff were very rude and took the food to the back and brought it back two seconds later- clearly the tomatoes had just been picked out. The manager came over and swore at us about how we need to not f***ing complain because it's just tomatoes. I am disgusted at the service and the manager swearing at us. Do not go here, save yourself the trouble."}
{"text":"I have never had such a terrible dining experience my entire life. First I get there an hour and a half before it closes on a Saturday night. The manger tells me I have to leave in 45 minutes and if thats cool with me...... I agree. Next the hostess decides to seat me way in the back by the kitchen, which I then got upset and asked to be seated where everyone else was seated on the patio. Next I ordered a double Margarita......which took 20 minutes to get even though there were barely any people. Then when the waiter brought me my drink he says he accidentally already put the extra tequila in my margarita. I guess so. The food was great , but at the end I even tippped 20 percent to the waiter and asked to bring home my fajitas. He then tells me that he cant bring me a take out box for my food because the fajitas are on special that day. Even after all the terrible service and 20% tip!! I had to wrap my fajitas up in napkins!!!!!!!!!!!!!!!! By far the WORST restaurant Ive ever been too. Wish there were more options for mexican food in Montreal!!!!!!!!!!!!!!!!!!!!!!!!!!!"}
{"text":"I liked the little bowl of soup and salsa with nachos that were brought as complimentary appetizers.    I had fajitas with beef - the beef was hard to chew.   The service was a bit slow and the host wasn't friendly."}
{"text":"My wife and I have eaten here in the past and the food was \"meh\". Last night we had a fantastic meal. Everything was full of flavor and tasted fantastic!  Sat down with the owner and he said they were in the process of a revamp! Well if the food gets any better... Wow!  If you have been here in the past and didn't enjoy it give it another try!"}
{"text":"We were very surprised by this place. At first, it was irritable to wait for a while just for a glass of water or drinks. However, when the food arrived and how much arrived I was in shock. Usually, Mexican restaurants have high price points for their foods, but here it was affordable. I ordered the enchiladas and ended up getting a taco bowl salad, rice, beans, and many extras. Alongside the 89 cent tacos since it was a Sunday special, did not disappoint nor was it skimped. Eating half of my meal already left me full. However, the sangria we got could use a bit more alcohol"}
{"text":"I'm not too fond of the food but I love this drinks and ambience! $5 giant margaritas on thursday and complementary chips and salsa! Ill go back to hang out!"}
{"text":"Friendly service, great menu selection and an excellent variety of very well priced food await at the Saint-Denis St. 3 amigos  The margaritas and daiquiris are HUGE! We had the ceviche appetizer ($8) which was excellent but needed to be a little more citrus/vinegary.   The main courses of flame broiled salmon with tiger shrimp and flame broiled salmon with mango salsa and side of chicken were amazing and super healthy.  The tomato rice and steamed vegetables that came with them were extremely tasty too!  If it is your birthday, they will give you a huge sombrero, #Andale!!!!  Definitely a great spot when in the St-Denis area; sit by the window for great people watching on the busy street #willBeback"}
{"text":"We went to 3 Amigos in Laval. I understand that it's a long weekend and its busy.  But there is no excuse for bad service. People in the restaurant business are aware of how busy their establishment can get. They should have experienced staff working during busy hours. Our hostess was lost when she was trying to seat us. The waiter came and immediately told us he was going to give us a few minutes. I had to interrupt him to give our drink order. We got our drinks 25 minutes later and they STILL didn't take our food order. IT'S AS IF WE'RE INVISIBLE TO THE STAFF!  I was so upset I just left the restaurant."}
{"text":"Ambiance sympathique Boisson très bonne Menu : beaucoup de choix ! Essayer le burrito bowl !  Pas cher surtout les menus express du midi en semaine Personnel : professionnels jamais eu d'erreur, manque un peu de sourire. .."}
{"text":"the 69 cent Sunday taco situation is one thing , but don't even git me started on the dill-sauce salade and the roast beef jagr bombs ! You will be stinging out your sour end for a week, DO RECOMMEND"}
{"text":"I was fairly shocked seeing this rating! I went last Thursday for dinner around 8pm while on a business trip and it was packed! My co-worker was on a mission to take me here and I understand why. It is a very American/student friendly type place with regular specials.  The portions themselves are gigantic. I'm a fairly big eater and could only finish half my plate.  The salsa was the best part of the dinner! It tasted great with chunks of tomato and cilantro. It definitely had some kick to it!  Now my main point of contention that made my review a 3 not 4 are the drinks and service. My Co-worker ordered a strawberry margarita which was actually a lime margarita with strawberry syrup coating the bottom. Even after she mixed it together it still tasted like margarita. I ordered the lychee sangria which was fantastic and actually came with two fresh lychees. It tasted great and I've never seen it offered anywhere before! My main issue was 1. Ice- the mason jar I had was filled with Ice to the top. 2. the price- I read on the menu that a glass of sangria was in the 6$ range and when I got my bill it said 12$ which was shocking. When taking it up with my waitress she merely shrugged at me. Which brings me to my next point- the terrible service. Its basically non existent and takes a while to track anyone down to take your order.  All in all I'd return for the food but be more weary of the drinks."}
{"text":"Had veggie fajitas with spicy salsa and mango mojito - ah bliss!!  Our first time here. We are used to the one at St. Catherine. But this one did not disappoint."}
{"text":"If I could select a zero star rating I would. Sitting right now on the patio and it's blistering hot out, our server comes around. We ask politely for a shaded area or if we could move to another table where we aren't in direct sun. He goes \"no we can't move it because it doesn't work for us\" we order our food and one of my gfs asks to substitute fries instead of rice and salad he goes \"no we can't I have to charge you extra\" I order my food and I ask if I can just add shrimp to my chicken tacos he goes \"no we can't, or if we can I have to charge you 7 dollars for 3 pieces of shrimp\" I don't mind paying extra but if the side order cost basically the same amount as my main no I will fucking not order the shrimp. WORST FUCKING SERVICE EVER. I won't be coming back here and my friends and I eat out everyday."}
{"text":"Je suis allée plusieurs fois au 3 Amigos. La nourriture est très bonne mais le service n'est pas toujours top. Les prix sont bons et l'ambiance agréable."}
{"text":"I don't really want to waste my time writing a review for this place, given lots of people have already voiced their opinions. I just want to address couple of points:  1. Please wash your salad before serving it to me. 2. Anything that have chicken in it is completely dry, tasteless, and disgusting. 3. Tortillas are actually pretty good. 4. Cocktails taste like some 4th grader's chemistry project, absolutely horrible.  That being said, there are many other Mexican restaurants in Montreal one can try."}
{"text":"If you are searchin for cheap good food with good ambiance or maybe to only have a couple of drinks, this is the place. Its not the true mexican food ( go to el rey del taco ) but its okay."}
{"text":"Went there for drinks and got some complimentary chips and salsa. We went there because the restaurant was very crowded, so we assumed it would be great without checking yelp (which was a mistake). It took the waiter around 20 minutes to get us seated and get us a menu, even though there was an empty table all along. The chips and salsa were mediocre, and the water had white things floating in it. Overall a meh experience and I don't see myself returning."}
{"text":"Ma place favorite pour un repas peu cher et des margaritas slochy ! On sort toujours de la un peu pompette, surtout quand on prend les margaritas double. C'est traitre ces bébelles-la !  Jamais déçue de la bouffe. C'est sur qu'on parle de Fast Food, faut pas s'attendre a de la grande gastronomie...  Y'a du gras qui coule, mais y'a aussi de l'excellent riz mexicain et beaucoup de fromage (lire en boîte, mais moi j'aime ça).  HAsta la Proxima !!"}
{"text":"I'm giving 3 Amigos a 5 start rating just to annoy my sister... That being said I would give them a 5 star for free sombrero giveaways and daiquiris."}
{"text":"Been there many time and been a great experience every time. Last year I even celebrated my birthday there and I also got a sombrero that I got to take home.  The service is always fast even if they are super busy all the time and they are friendly. The DJ make the experience even better and they always play good music.  The food is great and my all time favorite is the salmon with the mango salsa it is to die for.  The Sunday specials are very good and I love the fact that you can buy the salsa they have on site.  Drinks are ok but a few times I went there and they tasted a little like plastic nit sure why but I advise them and they made me another one right away.  Another downfall is that the bathroom is in the basement so if you're on the 2nd floor and u had a few drinks make sure to hang on to the railing.  All around food and service is awesome and I am super excited about the new one opening in Laval soon"}
{"text":"My chicken in my taco was undercooked. But Service was great, we got rained on outside and easily got seats inside."}
{"text":"This is a good place to go with friends for drinks. The food is definitely mediocre, and the service was slow. However, the atmosphere is fun and i'll be back for sure!"}
{"text":"tequila ! (le seul point extrêmement positif)  3 amigos c'est comme le McDo du mexicain. C'est cheap (qualité & prix), les assiettes sont grosses, y'a ben du gras qui coule, c'est salé, pis c'est surtout BON.  On se fera pas d'accroires la ! On aime ça le gras ! ( de temps en temps...)"}
{"text":"Drinks are so watered down...u taste no alcohol.  Beware!!!  I'm a lightweight and wanted one good drink.  It would take me 10 more to feel buzz'd...maybe that's the catch to their selling more drinks.  Could be an ultra-bottom shelf alcohol also.    Food was eh....fajitas were blah.  Could have been better. I'm visiting.  Won't be back when I come back."}
{"text":"Was there last week for 5$ Margaritas night and figured I would grab dinner.  I love the downtown located for the ambiance but this location is nothing like downtown. It's more like a family restaurant that serve tacos.   The only good thing was the service and this is the only reason why I give it 2 stars.  The margaritas were very watery and I am pretty sure they forgot the alcohol in it. I also ordered a mojitos and this one was straight up alcohol. No middle ground on the drinks.  I wanted a chicken breast with mango salsa and 5 minutes after I placed the order the waitress came back to advise me that they were out of ingredients for this meal and that I had to picked something else. I believe I ordered the Santa Fe chicken with veggies instead and the plate came and it was very hot but the veggies and fries were cold.  Cheap drinks or not I will not be going back. I will stick to the downtown location."}
{"text":"Not really a good place for the family, more of a meeting place for friends or just to have a drink after work. The food is average at best. I know some friends who like it but also gotten sick. But in my opinion i had better food still enjoyable than a taco bell."}
{"text":"Food is great, service is great and music is entertaining. I really like their salsa and guacamole."}
{"text":"Oh lord. First of all, 90% of that menu is mostly just a good try but not even close... and I'm from Mexico. The most disappointing thing though was that I couldn't taste the tequila in my margarita and when I ordered two more shots to add the bartender got offended. Would never recommend"}
{"text":"I was expecting 3Amigos Downtown and I was soooo wrong ! It's not even Mexican food. I was extremely disappointed with the food. The service was good as well as the decor but what's the point of the food was bad."}
{"text":"3 Amigos is one of those places you go to when you don't really have time to cook, don't care for anything fancy, and just want something quick. It's just OK...  Food is hit and miss - the safest thing to order are the fajitas..I also like the creamy enchiladas. Mexican rice is good. Drinks are pretty good. All other plates I've tried have been pretty mediocre to downright terrible.  Ambience is nice though, and it's a decent place to come to for some fun drinks. Service is usually very fast and prices are ok!"}
{"text":"It is a very nice and warm environment Though you cannot expect a romantic ambiance Noisy and most of the time packed! The staff are friendly The fajita I chose with lamb was tasteful and more than enough for an average dinner I expected chillier sauce of course The price is reasonable and you are not pushed to leave tips!"}
{"text":"We ate here twice during our stay in Montreal. They have nice outdoor seating on a happening street. The food is decent. If you are coming from the USA and use to really amazing Mexican food you might be disappointed. But this is Montreal, and so comparing it to that is unfair. They serve fun drinks (we had sangria which was ok). The fajitas are good. The atmosphere is nice and it's always crowded. Decent food and a good time. Service is fine."}
{"text":"Typical lively Mexican dining place. Not our first choice but we had a friend meeting here. Our waiter seemed pressed most of the time, not paying attention, constantly requiring to be flagged down for water.Their frozen drinks were probably the highlight of the whole dining experience. Had the strawberry mango pina colada. Though not strong twell mixed. I ordered the taco dish, which came out with a large amount of bland rice and salad."}
{"text":"Le burrito vege est super bon, je le prend à chaque fois, les nachos à valonté aussi. Les cocktails sont super, surtout la piña colada. Assez sympa pour les annif. La propreté laisse à désirer. Le menu est souvent tâché de sauce. Les tables pour 2 sont super petites (à peine de la place pour 2 assiettes) et sont instables. Le service est boff."}
{"text":"Was in town for a conference, wandering through the neighborhood, and decided to stop in for dinner. What a mistake. This was a terrible dining experience.   Everything was a hassle. I don't eat meat, and wanted to get avocado on my salad, which I was told was not possible. My friend is allergic to dairy and asked several times whether her food would have cheese. After she was told no dairy would be in her food, she started to eat and the waitress came running back, saying there was cheese in the main dish.  The waitress then took the plate back to managers sitting at a back table, who proceeded to poke through the food, ostensibly looking for cheese (???). The waitress then returned with the plate (gross!), telling my friend that everything, from the rice, to the beans, to the salad, had dairy in it, shrugging her shoulders in despair. My friend did not eat. And she was hungry.    The margaritas were definitely sub par. Watery, and too sweet, I did not finish mine.   I've never given a restaurant one star, but if I could give less, I would. Montreal is a fabulous place to eat, why waste it on terrible food and rude service?"}
{"text":"Stick to drinks. The food is disgusting. I returned my plate; they charged me anyway. It's not even bad texmex; it's just bad all together. It's nearby work so crew likes to go there; I stick to drinks."}
{"text":"I've been to this restaurant about 20 times, but unfortunately every time my experience has been worse than the previous one. This time the food was cooold, full of grease. I understand it's a tex-mex and not typical Mexican, but they might as well just turn it into a fast food because the quality has gone dooooown."}
{"text":"Nous étions un groupe et le service a été excellent sauf que nous avions besoin de redemander de l'eau très  souvent  Par contre la nourriture était super chaque personne a aimer le repas choisi j'avais pris des crevettes a la sauce chipottle avec riz et légumes excellent et de très grosses crevettes vraiment bonnes"}
{"text":"Good food, very Americanized. Definitely not Mexican food that you would eat in Mexico.  Service is ok, slow when busy but that is just like anywhere else.  I have eaten there multiple times as it is a nice change from regular restaurants.  It can get really loud really fast, do NOT sit upstairs. One or two (delicious) margaritas should make it better though!"}
{"text":"Ate here twice in one weekend. The shrimp tacos are fantastic and the shrimp Diabla is too! Even the house salsa is very flavorful. Get the jalapeño cilantro margarita! Everyone enjoyed their meals. Great outdoor seating too."}
{"text":"Great place with great food. Very accommodating for English speakers, friendly staff, and the food comes out quickly. They have free wifi as well."}
{"text":"Friends and I came here for dinner on a Saturday night. Pretty packed but the line moved fairly quick, so it wasn't so bad. I can tell the place is catered to families as it brings out a pretty festive mood. However the lighting was quite dim so I really couldn't read the menu ; rather, my friend told me what she liked here and I ordered from her suggestion.   My partner and I split a beef and shrimp fajita . I really like how they give you nachos, kind of fills you up a little. Portions were decent, but food was a bit average. For the fajita, I liked how they gave you the food in a customizable way (assemble your own type of thing). I also tried my friends dishes and drink as well: quesadilla, chicken fajita and the bull dog margarita. I didn't like any of those three. We were waiting for water for quite some time as well. It was only when we were about to leave that they gave us more water. Overall, I think I would come back if we had large group with last minute dinner plans."}
{"text":"I go there often and had some great times there. Food is good, music is great, staff are nice! Fun when its your birthday and they give you cake and a sombrero hat"}
{"text":"Leave your car and walk. This is a great part of town.  The Camarones ala Diabla was better than dishes prepared by Mexican's in California."}
{"text":"J'ai été pour la première fois au 3 Amigos et je vais y retourner à coup sur. J'ai très bien mangé, fajitas à l'agneau, et les gens avec qui j'ai été ont été aussi agréablement surpris. L'ambiance était très bien, la musique juste assez forte, le décors très joli. Les margaritas étaient super bons ! Bref pour soirée style mexicaine entre amis c'est l'idéal. Boissons alcoolisées un peu cher mais le reste assez abordable."}
{"text":"I haven't had a quesadilla that can compare to the one I've had at 3 amigos. Love the vibe in the restaurant, staff was always very polite, helpful and attentive. Sangria's are amazing as well! Not one bad thing to say about this place. We travel from cornwall every so many months just for 3 amigos, very worth the drive."}
{"text":"Service was not good. Food average. Margaritas nothing special. Ew."}
{"text":"You know this is not a place for the food, but for the party ambiance.  So I won't complain much about the food.  However, the poor management will ruin your experience.  1. The place is severly understaffed.  Staffs look extremely unhappy and will make you unhappy. 2. Any chicken dishes are dry and tasteless. 3. You can party as hard as a Mexican but you need to be as patient as a monk until you get your first dish."}
{"text":"They now have vegetarian fajitas, $10, not a bad price but you don't get much tofu at all and the ones at Jack Astor's are better in every way.  Over all they're not bad, but I don't think I'd order them again."}
{"text":"Fun place!  Is the food great?  No, but it's decent enough.  Nothing was wrong with my chips & salsa, and quesadilla.  I thought the margaritas were really good though - go with the mango-strawberry.  Fun, lively athmosphere, and no, you don't stay here the whole night, but you might start here."}
{"text":"I went here in September 2015. I really wish they had this restaurant in Toronto. Best authentic Mexican food I've had and it's very reasonably priced. Service was great. Our server made a very useful recommendation to us in order to have the authentic Mexican experience. By the way, the true Mexican experience is VERY HOT! I will be coming back."}
{"text":"Tout était parfait, la nourriture est délicieuse, le service était impeccable...  Je recommande fortement ce restaurant familial. Nous reviendrons !"}
{"text":"I am Mexican born and raised in LA and this place is very confused, not authentic at all. The chips and salsa are gross, no one should put carrots or fruit in their salsa, it appears they add this to cover up their canned tomato taste. The drinks were weak. The chicken wings were okay but they use bottled sauce as their fuego sauce bleh. I would never come back here unless it was to teach the chef or cooks how real mexican food is made. 2 stars for the nice waiter."}
{"text":"If you want traditional Mexican food, this is not the place to go! It's an Americanized, over-hyped, tourist trap. It's conveniently located, decently priced, and spacious, so I guess it keeps people coming for average food. That's all it is, average. Your safest bet is probably their Fajitas.  What I DO really like are their Margaritas, nothing quenches your thirst on a hot summer day any better! Lime being my favourite, with an extra shot of tequila. Some nachos with their spicy salsa too. Yum."}
{"text":"great service good music good food and good drinks. affordable and efficient. the portions are big and tasty. Got the chicken chimichangas and couple double pins coladas and a drink called the bulldog (margarita mix with a beer on top)"}
{"text":"Ce n'est pas le meilleur restaurant mexicain que j'ai essayé, mais la nourriture est bonne et l'ambiance aussi. C'est un bon endroit où aller avec des amis pour siroter des pina colada et manger des enchilladas. La musique mexicaine est juste assez forte et il y a des spéciaux chaque mercredi et dimanche. L'emplacement est bon, mais c'est très difficile de trouver un stationnement. Le service n'est pas constant... Des fois j'ai du bon service, des fois c'est assez médiocre."}
{"text":"Went here for drinks on a Sunday afternoon around 3 PM. Was absolutely shocked by the horrible service. Chose a table outside, and even though the place wasn't busy, and it was a time in between the lunch and dinner crowds, our waiter was extremely rude.  Seemed disgruntled that we just wanted drinks. And this is with them each being $15!!!  Drinks came and were awful. Sangria was basically cranberry juice, and the margarita was to be desired. Very little alcohol in both.  Avoid this place unless you want to be overcharged only to be treated like trash and drink juice."}
{"text":"I've only been to 3 Amigos once... I got a Taco Platter. It's pretty standard for a no frills Mexican restaurant. Nothing to write home about, but good enough that I'd return if I'm in the mood for tacos when I'm up in Montreal again. The service was quick and friendly, they had chips with (the staple of any respectable Mexican restaurant) home made salsa, and the prices were very inexpensive. Good for mid-drinking-day food fill up..."}
{"text":"Je tiens à m'excuser d'avance de ne pas avoir pris de photo...j'avais oublié mon téléphone sur mon bureau bref..passons à la critique..  Dîner de groupe entre collègues. Nous étions environs 25. Oui 25 c'est vraiment beaucoup...mais quand le restaurant n'a que 8 autres clients....Ils ont un menu très variées le midi, incluant soupe et café. La plupart des plats viennent avec salade et frites ou riz.  Quand je suis arrivé il y avait une dizaine de personne qui étaient déjà assi à notre table. Nous sommes arrivés (nous etions 5) et ensuite deux autres groupes de 5 qui sont arrivée, environs 5-10 minutes plus tard..Imaginez-vous que le serveur a été voir ceux qui sont arrivé après nous. Ils ont même eu leur soupe avant de venir de voir, et les gens qui étaient déjà la se fesait servir le repas principal. Je comprends ils sont arrivés avant, mais au moins nous dire que ce ne sera pas long ou qu'il s'en vient...mais non..  Le serveur est finalement arrivé, nous et un autre collegue avons commandé une bière. Nous l'avons reçu après la soupe en entrée. Un oeu long pour une simple bière, nous avons même du lui repéter. J'ai commandé un wrap au poulet avec du riz mexicain, j'ai bien aimé. Par contre, il fallait fouillé dans la salade pour trouver la vinaigrette. Le service de nourriture à quand même été rapide. Faut préciser qu'il y a comme 5 bussboy qui aide le serveur...  Les autres collègues on reçu leur café et les gens avec qui j'étais assis,  nous avons encore été oublié. On a attendu 10 min pour recevoir la facture, sans qu'il vienne nous voir. Une madame a même été payé au bar, car elle était tanné d'attendre. Je le voulais ce café, car manger du mexicain ça bourre!!! Mais non pas de café....la facture est arrivé. Un de mes collègues m'a dit: \"ils nous ont même pas offert de café... \"  Le serveur a entendue et me dit: \"Vous aviez d'l'air pressée\" Je me suis permis de lui dire...Quand nous attendons 10 min pour une facture, oui on est pressé car notre pause est terminé...  Bref, un 3 amigos à éviter."}
{"text":"This place isn't completely terrible. Me and a few friends came here spontaneously for lunch and I shared some chicken chimichangas with my boyfriend and got a piña colada as a drink. Food was good and drink was delicious, however our waiter was rarely ever around when we needed him. One of my friends ordered a mojito that took 10 minutes to arrive after the rest of us had our drinks for some time. We also asked him for water and he never returned with any for almost 20 minutes. Service could have been better better but my meal was good."}
{"text":"Don't know where to begin.  Drinks are good... Food not so much.  I get it they've been around for ages but why not spruce up the menu with some quality ingredients. If you're messing up tacos you know you're doomed."}
{"text":"Un mexicain un peu quétaine mais bon et bien situé! Pas loin du métro Berri, très coloré et ambiancé Bonne musique Service ok Prix normaux pour le quartier La terrasse l'été est cool mais se remplit vite!"}
{"text":"Monday's are no fun for some but I love them and at 3 amigos you get 89 cent tacos to beat your Monday blues.  After driving around for a few hours we decided we wanted something to eat as we both skipped breakfast so at 3 pm I made the call of wanting tacos and that's exactly what I got.  This location is HUGE! And 1000x better than the two downtown. It's clean the staff is friendly and the decor is beautiful you gotta try the swings at the bar they are so cool and first time seeing this at a restaurant.   Since it was beautiful today we grabbed a seat outside in the shade and ordered two double bull dogs and ate some complimentary corn chips and salsa and planned out the rest of our day on the gorgeous large patio.  I didn't know they had a special on Monday's but I'm glad they did as we ended up getting 8 beef tacos and on our second basket we decided it was missing sour cream and some salsa, they do put the spicy one inside but when you order more you have the option of either the spicy or the one you get when you walk in with the warm corn chips ( go with that one )  We got one salad with the shrimp $13.95, pretty good shrimp seasoned well and not small either our waitress really hyped them up so we chose that. Salad isn't very big for two so we ended up getting a second with chicken which was great. The dressing is very creamy and there's lots of it so don't worry you won't be missing out on any dressing if that's what you're worried about. They have great pickled peppers as well and corn chips in the salad which helps add some texture to the salad as well as color.  Our waitress who was tall and blonde was super nice and complimented me on my nails and was over all in a great Mood and it made our dining experience better than I've ever had at 3 amigos. I swore to myself I would never go back to a 3 amigos again as I wasn't a fan because the locations Downtown are terrible. They did a great job and I will make sure to come back to this location and this location only."}
{"text":"Belle terrasse plein soleil et aménagée de plantes, c'est le principal attrait de ce resto familial grande surface. L'intérieur a été conçu pour les groupes. Une salle aménagée comme la terrasse pour les couples et gens seuls serait le bienvenue pour les 3 autres saisons. Le menu a plusieurs options végés mais les assiettes sont calculés au gramme près et ont un look un peu aseptisé. Ma déception est d'y retrouvé si peu de fèves. Il me semble que si les options de viandes sont bien garnis de viandes, je ne vois pas pourquoi les options végés n'offriraient pas des fèves multicolores en abondance. L'hôtesse et les serveurs sont sympathiques et les cuisines sont rapides. Saveurs, terrasse et le personnel sont les atouts mais le bruits des groupes à l'intérieur est incompatible avec l'intimité des couples."}
{"text":"My friends and I stopped here after going to watch a movie. We decided to share the Bandeja de Botana 3 Amigos as an entree. Everything was delicious and would have been enough food itself after all the popcorn eating. I also had the Tacos de Camerones Al Pastor, if I wasn't so full I would have definitely enjoyed this more because it was fantastic. I chose the mojito peche out of their long list of drinks and it was also delicious. My friends had the chimichangas and the enchiladas and also thought their plates were good. The decorations are super over the top and are great for conversation starters while you wait for your food. There were tons of staff waiting around but we had very minimal service at our table. All in all, a good restaurant to go if you are a big group or if you are looking for a little something different."}
{"text":"Yummy food and cozy place Worth it to give it a try good food friendly staff... The quality of the food has a room for improvement"}
{"text":"Not sure why this place is popular amongst some people. The food is average but why I give it one star is for the horrible service given there. I've been here quite a number of times and I remember spilling a drink and one of the waiters threw me a napkin and told me to clean it up. Um, how rude? First of all, I'm not diva but i am a customer and you should be the one cleaning up the mess.  Also, the waiters, yes mostly wait men, were incredibly unhappy and unpleasant. They don't seem to want to work there and are not attentive at all. Never been back since and it's been more then 3 years."}
{"text":"I've only ever had the nachos but they are amazing. The Pina colada's are pricey but tasty. Service is pretty slow because it's always packed. The tables and the menus are often sticky. The only reason this is a four is because of their nachos."}
{"text":"So authentically inauthentic that you'd almost think it's real. 3 Amigos is fake Mexican that puts the Tex back into Tex-Mex. Strictly for people who when they hear the word Mexican, the first thing that crosses their minds is \"tequila shots\". Going there is the equivalent of a spring break trip to Cancun without leaving Montreal. The decor is unappealing in its forced festive atmosphere that strains to shove the words \"let's party\" down your throat.  But despite appearances, it's not even welcoming: the service is inattentive, if not altogether absent. What can I say? The loud and obnoxious crowds of people who go there seem to dig it. To each their own.  But, on a more serious note, 3 Amigos deserves a boycott for running the most offensively stupid television commercials featuring the worst Mexican caricature I've seen this side of Speedy Gonzalez. But that just goes to show how deliberately inauthentic the food is - the three Amigos are not, as in the film of the same name, Steve Martin, Martin Short, and Chevy Chase; they are three fat, short dark men with big bushy mustaches and even bigger sombreros."}
{"text":"I was really surprised to find this place so packed! I knew what I was coming in for; tex mex food. But why were so many other people interested in it too? I mean, my experience here was pretty bad.   You have to have to have to make reservations. Otherwise you will wait in line for an hour like I did. The good thing was our server was fast and efficient. But there really is nothing quite like standing in a cramped space while the door opens and closes letting in cold air, waiting to be seated for below average mexican food.  Sure, their giant margaritas are pretty refreshing. Everyone obsessed about how big they are...well they should be that big for the fat price you're paying for them!  It's loud, and fast-foody with tacky decorations. I guess people also go there for free dessert if it's their birthday. Pssst..it's not worth it!"}
{"text":"En plein milieu du quartier latin, c'est un des restaurants plein en permanence mais où le service reste efficace.  Leur carte est vraiment varié et pour tout les goûts, burgers, tacos, fajitas, steaks, etc Et tout est relativement bon.  Juste un bémol la dernière fois où j'y suis allé, le steak du burger beaucoup trop cuit presque noir, mais ce n'est qu'une fois sur les multiples fois où j'y suis allé.  La carte des cocktails est toute aussi variée.  Après c'est toujours plein donc bruyant, si vous cherchez un endroit calme ce n'est pas l'endroit, mais c'est le cas dans tout les restaurants du quartier latin."}
{"text":"Horrible. This is not Mexican food, and it' way overpriced.  It's food court quality IF. It's very hard to find authentic quality Mexican food here, but please try to raise the bar...just a little??"}
{"text":"Cheapish.  Greasy Tex-Mex.  Decent service.  Weird smell that permeates the entire restaurant.  Very dark inside."}
{"text":"Worst experience ever! First, we called to see if there was seating available during a hockey game and they stated a wait time of 15 mins. Once we arrived there was a fairly sizeable lineup extending out the door. This turned into a 45 minute wait, but we just sucked it up being we were already there. After being seated we weren't served for another 10 mins after. At this point the waitress finally showed up and took our drink order in a rush, she basically took our orders and ran off without giving us an option to add anything else. When we received our drinks my wife tasted her sangria and about vomited, it tasted like vinegar. One we got the waitress to come over to replace it with a mojito she was very apologetic. That mojito tasted like soda water with lime (drinks are horrible here!) Finally we ordered our food, everyone's dish was complete garbage. My chicken mole tasted like bland chicken with chocolate syrup, my wife's steak was practically raw (she ordered it medium) and our friends both meals were one overcooked and the other cold. After we explained our dissatisfaction with pretty much everything to the waitress, it was nothing but apologies and blaming. She offered us a round of tequila shots to smooth it over and we felt this was not enough, we really felt we shouldn't have to pay for the disgusting food they served us. In the end we had only a couple meals removed from the bill and an embarrassing argument in the middle of the dining room with the manager. In short I do not recommend this place and would not be surprised they go under within the next year."}
{"text":"If you've been a patron of the downtown franchise, well this is carefully synonymous barring for the sad view of suburbia. Agreeing in food and being one the same service, this place is just ok."}
{"text":"Although the place was a bit pricey, it actually wasn't that bad. The portions of food were huge and I love their margaritas! The margarita was delicious and even though I doubled up on the alcohol, I couldn't even actually taste the alcohol. My boyfriend and I were given some free nachos with salsa while we were waiting for our meals, which was nice to snack on during the wait. The food itself though, was decent and they did have an extensive menu. However their service wasn't really up to par, but the atmosphere was okay.   To summarize: Service: Not the best Atmosphere: Good Food: Okay Price: Expensive Worth it? Not really  Although it wasn't horrible, the restaurant wasn't very outstanding for its price either. I'm glad for the experience but it's not a place I would recommend to anymore or return to again."}
{"text":"Sub par Tex-mex, along the lines of a Chevy's. Bland flavors, limited beer menu. In a mall."}
{"text":"My god , I can't even describe to you how bad this meal was. Feta cheese on a Mexican style taco? Flan that had the consistency of cheesecake ? A mojito that tastes as if toothpaste was poured in ? A taco slathered in salad dressing ? If that's your pallet then this is the place for you!"}
{"text":"I like to go on a Wednesday for the special fajita's.  It cost like 8bux and its sooo good.  I like both the steak and chicken.  The restaurant is pretty big in there and good for groups.  They are always busy.  The strawberry daquiri is pretty good too."}
{"text":"Everything about the place is pretty mediocre (sub-par tacos and weak drinks) but the nachos and salsa were ok."}
{"text":"I've been to this restaurant over the years.  Back in the days, it was rated as the best mexican (tex-mex) restaurant in all of montreal. Today - I dont know what happened, but it was no where close to what it was like years ago.  The menu might be the same, but the food was just wrong.  Ordered: 1. Cactus App - Was soggy, and out of a can..  I didnt even know that Cactus came in a can!!.  I've had it before at other restaurants, fresh, but why???  Why do you have to make it taste like the brine in a can?  2. Pasta with Avacado - Soggy pasta, lots of water on the plate, not tasty sauce, and the only good fresh thing in the meal was the actual avocado.  I do hope and pray that you guys really change your menu, reduce the number of items, and specialize in a smaller number of dishes.. So that your food tastes a lot better in the future."}
{"text":"3 Amigos is meh. It is so meh that I think it defines meh. I think meh should be added to the dictionary with this restaurant as its description.  The hostess and the two waiters we interacted with were very rude. Suffice to say, they did not seem like our three amigos. Maybe our three frenemies, at best. They didn't really seem to want to seat us or take our order, and I just KNOW that our main waiter avoided our eye-contact whenever possible. It hurt - right in the feelings.  The food is alright. Little things - would have traded more guacamole for less  chips. And calling it the best guacamole in town is definitely a stretch. It's alright. It's guac. Margaritas were super sweet and tasted synthetic. Will this green concoction turn me into the Green Lantern? Only time will tell.  There are so many great restaurants to explore in Montreal! Don't let this one steal your fun away, no matter how festive those sombreros look from across the street."}
{"text":"My favourite place to eat Mexican food! The ambiance and the service were great. Maybe not the best place to order some beef. Definitely go for chicken or vegetarian plates.  I really really like their spicy sauce too. The price is really reasonable."}
{"text":"They serve a great shrimp tortilla ! The shrimps are grilled perfectly. The piña colada needs a little tweaking though (lacks pineapple and coconut flavours )"}
{"text":"C'est la première et dernière fois que je mets les pieds aux 3 Amigos. Pour faire simple : - presque une heure à attendre nos plats (en même temps, c'était la fin du service, c'est-à-dire le soir). Les serveurs étaient lents et n'accordaient aucune importance aux clients. - Un serveur nonchalant, lunatique et peu à l'écoute, mais qui vous rappelle bien qu'à la fin, on \"doit\" lui donner des tips. - Une nourriture froide et compacte. J'avais pris une tostada végétarienne, et autant vous dire que j'étais bien déçu : l'avocat n'avait pas le goût de l'avocat.. - Musique trop forte, impossible de se parler  Mais un point positif pour les nachos en guise \"d'entrée\". La garniture était excellente.  Une mauvaise expérience dont je m'en souviendrai pendant longtemps."}
{"text":"My favourite place to eat in Montreal and one of the best burgers I've ever had! In the past 2 times I've visited Montreal, I've been there 3 times. The atmosphere is a lot of fun, but try to avoid the dinner hours when it gets very busy. This is my must-go place to eat whenever I visit Montreal!"}
{"text":"It was my first time at 3 amigos and i liked it. The food was delicious. Their portions are huge. It can get busy on a Friday evening but the service is good too. I had my Mexican fix and with their spicy sauces, everything is better!"}
{"text":"Dunno why so much hate for this place on Yelp.  My gf and I thought the food was delicious, maybe Montreal residents don't like Spanish food? This is coming from someone that lives 10 min away from the most ethnic Mexican neighborhoods in Queens.  The servings were very generous and delicious. It wasn't that crowded on a cold  Montreal night but the servers were very nice. I would totally go back to this place when I return to Montreal."}
{"text":"I strongly advise not to go to this location. The service is mediocre in general, it's rushed and it can be sometimes unprofessional. The drinks are watery and poorly made. The mint leaves used for the mojito was black and not fresh. The food takes a long time to arrive and the menu is just a combination of hardshell and soft tortilla with different meats and placed differently but after all they are all the same. The sandwiches are dry and stale and the ribs feel like drum sticks.   I think it's disrespectful to the Mexican culture because the food doesn't represent it well. This restaurant is just a bunch of processed food put together and it feels like they didn't even try......"}
{"text":"Horrible service. Starts from the managerial staff down. I've been sitting for 30 min and still haven't gotten water."}
{"text":"Very generic mexican food but the portions and accompaniments do the job of satisfying cravings for Mexican food in Montreal. A very busy restaurant especially during the two days of specials."}
{"text":"Great Mexican food. One of the best I've had in Canada.  The service is also great and a lot of menu choices. I've been to this a couple of times and it was good every time.  The chimichangas and burritos are the best.  The dish with the tortilla shell was very delicious. Their spicy sauce is worth a try."}
{"text":"Very noisy and decor is too busy but their fajita isn't bad. I only went on Wednesday special but now I moved from downtown so fajita no more :("}
{"text":"For muslims I recommend: Veggie burito, vegie tacos, and shrimp fajita Drinks for muslims: Virgin lime margarita (for two is good), virgin pinacolada  They have special fajita wednesdays, and sunday tacos( you can order coke as drink for sunday tacos because they asks you to order it)  They are also very friendly for groups. We were 18 and stayed for long on Sunday. they were closing at 11 and they did not even bothered us and we had really good time."}
{"text":"I have a confession to make: this was the first restaurant I ate at in Montreal. Yes, it is shameful. Let me explain...  I had driven 7 hours from Toronto. Yes I know the drive should take about 5, but thanks to roadwork around Kingston, it took longer. And for the last 2 years I lived in Socal, where I habitually had Mexican food. It had been over 2 weeks since I had Mexican, so I was going through withdrawal.   Put all that together, and you got a dangerous combo.  When my companion and I walked past a place called freaking 3 amigos (even the name kinda sucks), it sounded parfait. So that is why I ended up at a goddamn Chevy's. I know, the name isn't really Chevy's, but that is basically what this restaurant is. Super Americanized, fairly bland \"Mexican\" food. I even got the fajitas, which is like the supposed highlight of Chevy's right?   So if you like Chevy's, you'll like this place. If you can't stand Chevy's, run away fast. And if you're in withdrawal like I was, it will help a small bit."}
{"text":"I'm always down for a bite to eat (or a lime margarita!) at 3 Amigos!!!  If you're looking for the best Tex-Mex/Mexican food on the planet, it's not going to be here, but I enjoy their food enough to keep going back.  I generally have the standard fare (fajitas, tacos, mex-burger, nachos, etc) and find that it is fairly priced for the most part, and the atmosphere is cool and laid-back. It's an enjoyable place to have dinner, take advantage of weekly specials when you can.  Service is a hit or miss kinda deal, but the atmosphere makes you not care so much."}
{"text":"I like the cocktails in 3 amigos. It is nicely mixed. I ordered the Cuba libre. Food and cocktails are inexpensive. Traditional Mexican food."}
{"text":"Always a place to go whenever iam in Montreal. Best mexican family restaurant. They serve free nachos with their special sauce till u got your food. Fajitas their are decent and the burritos are one of a kind. Even though this place is a hit or miss but i was lucky today it was on point."}
{"text":"Generic Mexican food. Very Americanized.  My family and I have come since I was a child the service... Never mind. Service doesn't exist in the place any more. The waiters are miserable. The bus boys slave for the waiters and bar tender. No one has a clue what is going on. The wait at the entrance takes for ever even with a reservation but please plan for an extra 30 minute wait at your table before you ever see your waiter. If you need a tortilla refill chances are you won't get it. If your starving don't come here as you will just become agitated. The portions have become very small and cheap. Even down to the deserts! The banana flambee used to be floating in a bowl of hot caramel... Not anymore. Your lucky to get a table spoon sprinkled on your banana. The restaurant is very crowded forget any personal space. You better hope the guest seated beside you smells good or talks with an indoor voice. It always come back to the service, the wait and the confusion of bills! Always check your bill!   It's a shame that this place has gone to the garbage. The will still succeed as it is popular amongst Uni students but realistically it is not appropriate for anyone else. We have watched it crumble for years and it's a shame! We never contemplated visiting after a downtown day.... Now we negotiate if we can handle it along side the level of our hunger.   Loyal customers for close to 17 year.  What a shame. We always give them a second chance but they are looking not too shabby."}
{"text":"Fun and fairly enxpensive place to meet-up with friends. Although dont expect great mexican food beyond the price you pay."}
{"text":"Not so great, more of your average tex-mex place.  Good for a corona and nachos though, and good for families as well!  If you want an authentic Mexican restaurant, this isn't the one."}
{"text":"-Worst service.  -Never got my water after asking twice.  -Never got utensils.  -Waitress Maely is TERRIBLE.  -taco shells were state.  -1/4 cup of oil at the bottom of plate, for 3 tacos!  Don't go! They deserve to close."}
{"text":"It's better than Taco Bell.  If you're looking for an American's take on Mexican food, 3 Amigos is a winner. If you're looking for authentic Mexican food... Keep looking... You won't find any of it here."}
{"text":"Are you serious ?!?!? Je me suis rendu à cet endroit pour un surprise birthday. Je dis bien cet endroit, car à mon avis ce genre d'endroit ne devrait même pas avoir le privilège d'être appelé ´un restaurant '!!! Les planchers sont tellement graisseux que je me pensais derrière le comptoir de chez Macdo! J'ai mangé... ou plutôt goûté le burritos au poulet. Je me disais que le burritos a pas le choix d'être bon dans ce genre de place! OMG... y'a ZÉRO amour là-dedans et je reste polie... c'est malheureux de voir autant de gens aller perdre son temps et surtout son argent dans des endroits sans passion pour ce qu'ils vendent. Je suis pas du genre princesse je suis capable de trouver du confort dans des places vraiment guetto mais quand ton plancher de toilettes est trempe de je veux pas savoir quoi et que ton plancher de resto est huileux de même, c'est que tu n'as aucun soucis de comment tes clients doivent se sentir... ptit conseil les amis le p'tit Québec coin Rosemont et St-Michel a plus d'atouts que cet endroit . Je n'ai pas de photos car je suis certaine que tout l'monde est capable de s'imaginer un tas de bouette dans une assiette! 85$ aux poubelles"}
{"text":"It's kind of disgraceful to call this place a restaurant with the horrible service. My boyfriend and I were not greeted upon our arrival and it took the waitress approx. 15 min to ask us for our order. The table next to us waited 35 min to flag down someone to take theirs. The food prep wasn't particularly fast either. As for taste, both of our burgers were decent but nothing out of the ordinary. I would not come back here unless they dramatically improved their service. There is way better Mexican food in Montreal!"}
{"text":"awesome margaritas, basically the size of your head and go down SO smooth. I went with a large group while vacationing, and were seated immediately. little wait for our food, and never refilled our tortilla chips, but overall very good. great for vegetarians."}
{"text":"The food is delicious and cheap. Such a nice place to have cheap tacos."}
{"text":"Sometimes good and sometimes not. But I love their fajitas. I tried their piña colada and it is really very good. Their guacamole that comes with the fajitas is one of the best I've ever tried."}
{"text":"Ce restaurant est sympathique dans l'ensemble, bonne musique, les plats notamment les burritos sont correcte.   Par contre en ce qui concerne le niveau sonor... On se croirait plus dans un pub que dans un restau. Les gens hurlent pour se parler.  Lorsque nous somme arrivés nous avons été placé à l'étage et nous avons dû attendre une vingtaine de minutes avant que l'on vienne prendre notre commande. Nous n'avons pas eu d'eau également de toute la soirée. J'ai trouvé cela moyen.  Et puis vers 22h, 22h30 on nous dit gentillement qu'ils ferment l'étage ce qui nous incite à partir..  A éviter si vous êtes en date ou si vous voulez avoir une discussion avec vos amis.  Correcte si vous voulez manger mexicain et si le bruit ne vous dérange pas."}
{"text":"Nourriture plus que moyenne! Je ne comprends pas pourquoi ce restaurant est toujours plein. Ça paraissait que nos assiettes étaient sur le réchaud depuis un bon moment. Tout était tiède et fade. Très décevant. Je ne vois aucune raison de retourner a cet endroit."}
{"text":"The music was too loud, we couldn't hear anything. The food was good for the price, but it took forever to pay. Plus there was a lot of people watting in line to get in. Maybe i'll go back in a less busy one (brossard) on a less busy day."}
{"text":"Came into 3 Amigos for some drinks and nachos. The service was not good, as we waited with empty glasses for quite some time. The sinks in the bathroom are also very low, making washing your hands uncomfortable"}
{"text":"If I could give lower than one star, I would. We came here during the beginning of the week... The service was extremely slow, although there wasn't that many people inside the restaurant. Their drinks don't even seem to have one ounce of alcohol in them. We had to request double shots, which we repeated to our waiter 3 times and it only came 20-25 minutes later. Their food was bland in taste. We all ordered something different and yet all of our dishes were subpar. Beef tacos, chimichangas, enchiladas and a buffet plater and two out of us got a stomach bug afterwards that lasted a couple of days. I do not recommend at all."}
{"text":"Stay away!   Unless, like me, you are on a very tight budget, and once in a while dare to endure its horribleness (blasting bad \"Latin\" music, mediocre-at-best food, tacky, tacky, tacky) for the lure of 69¢ tacos on Sundays, and cheap fajitas on Wednesdays...only to vow never to return...until the next time."}
{"text":"I tried back to back Mexican and that is probably why I didn't enjoy this place as much. I had heard a lot about this place and the authentic Mexican food, I wasn't too impressed though.   The service was rather poor, our waiter kept disappearing for prolonged periods and didn't even smile. The drinks were good (I'd recommend going here for a few drinks but not actual dinner), I got myself the lycée sangria which I thoroughly enjoyed.   I ordered the chicken burrito, the portions were absolutely enormous. It wasn't as flavourful as expected. My husband ordered the enchiladas which were better. I would give this place another try and maybe order something different but I would not recommend this to anyone looking for good Mexican food and in Montreal for a shirt visit.   The decor is too flamboyant from the outside, but the inside I find poorly lit and a bit run down.   Must mention their spicy sauce is extra strong but it is very different from the regular and I would suggest to try it for sure."}
{"text":"I do not know why this venue has such low ratings. Walked past by twice today and everyone looked like they were enjoying huge cup of cocktail drinks, so tried out for a dinner. Our server was super attentive and cute! Food was solid, my sister and brother agreed that their fajitas were delicious. I had Loco tacos salad, which had salad greens in a taco bowl filled with rice, chicken, and cheese. At first though, we were taken aback by the funky smell as we entered the restaurant, not sure if its the spices. Also, I'm not feeling the crazy deco inside and the bathroom could use some help...but overall pleasant experience. Affordable good food. Bulldogs cocktail was yum!"}
{"text":"A good experience during lunch time it wasn't busy so the service was good and prompt, Willy our waiter was knowledgeable and full of recommendations it not all suited our taste. Good portion on the plates and love their complimentary ships and salsa but they need to work on their drinks as my margarita was watery. But in all good value."}
{"text":"The night my friend and I decided to go to 3 Amigos was a very good case of simple curiosity, high hopes, and then the sobering and crashing reality. I don't have my qualms with bad Mexican food, hell I eat at Taco Bell at least once a month and that is about as shitty as it gets but when I go to a sit down Mexican restaurant I expect a higher standard. Now, don't get me wrong 3 Amigos was not Taco Bell quality, it was higher quality food but prepared hastily served by an unhappy waiter who was practically chewing his nails to get out of work.    When walking into the faux-fiesta lit restaurant I really wanted to enjoy myself but the poor quality food and lack-luster waiter who paid most attention to us when it came time to tip than he did the rest of the evening, did not meet my standards for a good dining experience. The waiter unfortunately was moody the whole time he was serving us but I chose to ignore the fact and plot my revenge later on Yelp. I ordered sangria which was more water than wine and an enchilada that was served with poor cuts of chicken breast topped in a very dismal green sauce. I wanted kick and spice, hadn't any of these people seen Speedy Gonzalez? Mexican food should always strive to get that kind of reaction out of people. Perhaps the Canadians are too far away from Mexico to understand the treats of a quality enchilada but I was less than impressed with the dish (If you wanted a witty remark like \"Fiesta? More like Siesta!\" unfortunately you won't find it here).    In the end the price was definitely not worth it. St. Denis is a large street with many options, you want good booze? Try the Microbrewery, Les 3 Brasseurs, across the street. You want ethnic food? Try Zyng right up the block. Both will do food and booze much more justice than this place. The waiter, the loud overwhelming atmosphere, and the poor excuse for ethnic food, to me were not worth the near $50 I spent when there are plenty of other better and cheaper options on such an active street."}
{"text":"I've been too three amigos in downtown a few times and I found that it was a lot different then the one in Laval. The ambiance is very different of course the one in Laval was recently built and everything is new. As for food, I didn't order the same things as the one in downtown and I don't wanna compare too much. Overall the food was good, I ordered vegetarian tacos and it was delicious but the salad was just some kind of lettuce with 3 strips of carrots and one olive. It was so disappointing. I also got non alcoholic drinks and they were very good. My friends daiquiri tasted better then the one I had (margarita).   The waiter looked like he hated his job. He was not communicated at all with us. I asked him for nachos at the beginning and he said okay and left then I later discovered that in the menu there are several kinds of nachos.. Which one did he think I want? so I had to chase him and tell him before he gets me any kind of nachos. As I was paying, I told him thank you have a nice day and he responded k thanks. Very very dry and honestly that really makes me not wanna go back."}
{"text":"If you are in the mood for some REALLY bad Mexican food you may have found your place! Wow- what a horrible way to spend 80 bucks on dinner. I don't think anyone finished more than a quarter of their meal. Pretty sure that they used old el paso taco seasoning and taco shells like you buy at the grocery store. I have honestly never had worse tex mex food ever.  It seems the place has seen much better days in the past as the decor was pretty tired and it seemed depressing to be in there."}
{"text":"i wish i had read the reviews before wasting money and my healthy stomach on the bad food and horrid drink.  A big slushy messy 'marquirita' that had no taste, and disgusting tacos with old tasting shells. Flacid salad and rice that looked like it came from a prison serving line. TOTAL regret, then after I ate i began to feel very hot, and had extremely bad runny yes....get ready...diarrhea... DO NOT EAT HERE."}
{"text":"WOW!!!  Worst service and food in Montreal!!!!!  What the hell!!! Where is my service??!?!? I can't even get water, napkins or even a menu!  Sat down and ate the dog shit that they served me and left the hell out!!!  DO NOT, repeat DO NOT go to this place. Waste of money and waste of time.  I will tell everyone that travels to Montreal to never, eve, ever visit this place.  If you are the owner reading this, EAT SHIIIIT AND DIE."}
{"text":"Tres Amigos is excellent if you're going there for tacos. On sunday evenings, they have a taco special, where each taco only costs 79 cents, provided you also buy a drink. (If you're really tight on money, you can get a can of sprite)  I've been there a number of times, both for their a la Carte, as well as for their Taco special.  Their nachos were decent, but not so different from the Doritos you can buy from the convenience store.  Their ribs were rather expensive for the amount of food.  Their tacos, however, are the perfect, cheap casual dinner with friends and family. (On average I spend 15 dollars for over 12 tacos)"}
{"text":"After spending what felt like an eternity trying to find an open spot on a patio - on a Thursday night, no less - we finally found ourselves seated at 3 Amigos.  Before I get into the food, I have to just say that the service was nothing short of atrocious. Our waiter would disappear for long stretches of time, and I do believe we waited a good half hour to order our food. (Another couple wasn't quite as patient as us, as they left before even receiving complimentary water.)  But I digress. We started out with free nachos and salsa, and I'll admit I was extremely surprised by their quality. Though the salsa was almost totally lacking in spice, it's clearly homemade and boasts a healthy assortment of finely chopped ingredients. It's actually rather addictive, especially when coupled with the crunchy nachos.  For my main, I went with the Chicken Enchiladas (\"Two soft corn tortillas with melted cheese and red sauce. Served with mexican rice, refried beans and salad.\")  It's fine. The quality is slightly higher than Taco Bell, but not by much. The whole thing is a kind of flavorless mush of cheese and refried beans and meat, and on that level it's perfectly edible. (It would have been nice if it had arrived to the table hot, though.) The rice tastes like a generic mix and the salad was almost entirely lacking in any kind of dressing.  3 Amigos is definitely the kind of place where you go to hang out with friends and chill on the patio. The food is an afterthought, it seems."}
{"text":"Quit complaining that it's a cheap restaurant, judge it for what it is. Sundays are my favourite with 69 cent tacos. The trick is to order the guacamole entree and tortillas with your tacos, spread some guac on the tortilla and wrap it around the taco. VOILA - deliciousness.  Food:  7/10 Service:  7/10 Price:  8/10 Atmosphere:  8/10"}
{"text":"I lower my standards when it's on a \"specials\" night but this one takes the cake.   Our waitress was nice, but she shouldn't be working as a waitress. Couldn't remember anything, forgot to bring certain things that were ordered, no personality, made excuses blablabla. She even tried to take away an appetizer 3 times despite the fact that we were clearly still eating off the plate, chip in hand, and had told her not to take it away. Speaking of the appetizer, for $8.50 that was a laughable \"guacamole\". I have frequented the 3 Amigos downtown so I knew what I was getting into, but this place doesn't make the cut. OH! AND SPEAKING OF CUTS.  A pitcher of a beer was ordered for my mom and her +1. The first glass she received, broken. We ask to have it replaced when we noticed; no \"oh sorry about that\" or other comment that could be used to display ownership of the problem. She gets another glass, a few minutes later, this one cuts the palm of her hand. She excused herself and I pointed it out to the \"manager\" who yet again, didn't take ownership, only taking the glass away and bringing back another having poured her beer from the first glass to another. YOU DON'T DO THAT. THATS A 101 LEVEL ERROR. ANY decent manager or bartender would know that if the glass is broken, inside our out, you toss the drink. So this third glass comes right? And we're like \"wow these people don't know what they're doing\". So we're looking at this glass and notice not one, but TWO places that this glass is broken and can cut someone. THIRD TIME FOR THE SAME PERSON. Not one of you was bright enough to LOOK at the glass first? Real promising that the broken glass that was handed back to the bartender was put right back in the dishes with the others.  All in all, the food was lackluster (but to be fair we knew that going in), but the complete lack of service, ownership and restaurant common sense was mind boggling. The birthday girl left with a cut on her hand and not a single staff member showed a sign of giving a f***. We didn't even bother going for the cake/sombrero despite having 2 people at the table celebrating their birthdays, we just wanted to get out of there."}
{"text":"I came here with some friends, and was utterly disappointed. I ordered the fajitas, and the meat was limited. I had 15 pitas but 8 pieces of meat, a little cup of guacamole, and lots of onions. What is that?   The service was slow, it took 10 minutes for the waiter to collect payment, but took less then a minute to bring the bill."}
{"text":"You need to try the frozen Lime Margarita at this place!  We were sitting next to the girl that made them and she was pumping them out non-stop, it looked like that might have been her only job so I guess they're so good because she has it down to a science.   The food was also better then I was expecting especially for a Mexican restaurant in Montreal.  The tacos I had had great flavor and the chicken was juicy and tender, the rice had a nice little kick to it, and the salsa they gave with the chips was very tasty.  The waitress we had was super nice.  I didn't get her name (sorry) but she was a cute blonde with an adorable french accent."}
{"text":"Nourriture mexicaine américanisé. Restaurant sale. Cocktail moyen. Nourriture sans goût."}
{"text":"The only reason why I went back recently was because my friend wanted to go.  Since it was her birthday, I didn't want to be a party pooper, so I went hoping it wouldn't be so bad.  But then I remembered once I sat down why I had promised not to go.  The waiters couldn't be found and when they did come around didn't know anything.  The other guests were very rude (took the glasses off our table without asking).  The place is noisy, the food was average and definitely not the place to go if you want to feel special."}
{"text":"Nous avons mangé dans ce restaurant un jeudi soir, avec un couple d'amis. La terrasse était remplie, alors nous avons pris place à l'intérieur, un peu en retrait des autres tables.  Il n'y avait pas de tables de 4, alors nous avons rapproché deux tables de 2. Le responsable de salle nous a dit que ça n'allait pas car on lui faisait perdre une place, alors nous avons replacé les tables, pour qu'il refasse exactement la même manoeuvre quelques minutes après... Bref.  Mon chum et moi avons commandé les fajitas boeuf poulet. La viande était bonne mais la quantité était assez ridicule, même pour les garnitures. Nos amis ont choisi le Mango Salsa et un plat de poulet (le nom m'échappe), et ils ont été satisfaits.  J'ai pris un flan mexicain en dessert, là encore j'ai trouvé la portion un peu maigre...  Je n'ai pas vraiment été convaincue par ce restaurant. C'est très bruyant et la nourriture servie est quelconque. Je n'y retournerais pas."}
{"text":"The service was quite slow and the food was nothing \"wow\" like, it wasn't good enough for the price you pay for. I wouldn't suggest anyone to go there to be honest. Save your money and go to a real Mexican restaurant ,  it's cheaper and it tastes better.  I gave two stars, at least the coca cola didn't disappoint me."}
{"text":"They don't speak spanish!! it's not supposed to be a mexican restaurant?? food it's ok."}
{"text":"Wow... What a great restaurant. This place is located at the same restaurant as Swiss chalet and Hot&Spicy buffet. Both of the previous restaurants have failed to stay for the long term. This 3 Amigos has hit the mark of long term stay and I believe it will continue to stay for a very long time.   Here is the deal, the place has a decent range of customers on a Monday night, the price are reasonable and the service is good. I ordered a hamburger, guacamole and fries while my boyfriend orders a hamburger and fries. The food portions we received were big enough to fill us up. My boyfriend added another dollar for extra sauce. The total of our bills came in at 25.12$. The price we paid is reasonable for two. The decor of the place is really nice, it almost feels like I am in a Mexico fiesta. Someone's birthday was happening and the waiters all sang in Spanish. Most of the customers ate at the terrace outside. While it is nice to be sitting outside, the balcony was so well decorated that I totally forgot we were right next to the parking lot.   Overall, I love the place and I understand why it gets almost full. Something both of the previous restaurants cannot get on a Monday night. I guess the Quebecers customers love a great Spanish restaurant and this fit the bills."}
{"text":"Usually people from Ottawa go to Montreal and rave about the food.  However, if this is on your list of places you visit I bet that won't happen.  I enjoy a few Mexican restaurants in Ottawa and none of them compare to this joint.  I don't say that as a compliment to this restaurant I say that because I've not had Mexican food this bland.  I wasn't allowed to mix and match enchiladas which I found to be a bit strange.  I wanted a cheese one and a chicken one but was told I can only get two of the same so I ordered two chicken.   The dish came with a large serving of Mexican rice which was OK and also a garden type salad which was not very good.  The enchiladas themselves were very, very dry and the cheese was burnt.  The service was fast but the staff didn't seem to be all that attentive after they brought the food and instead I had to flag one down for more beverages.    The patio is just the sidewalk with chairs and tables on it and nothing separates you from some of the more colourful characters who can be found on Saint Denis street so be prepared for interruptions!"}
{"text":"I had a great experience at 3 Amigos. I went on a Saturday evening around 6 pm and the place was busy but not yet full. The rush and door lineups came at around 7 pm. The atmosphere is super fun, lots of colors, hats, and decor hanging on the walls and ceiling, not in a tacky way but in a Let's ParTay!!! kinda way. Definitely a place to go with friends. They also have one fairly big screen tv at the back and it was playing football.   The service was super fast. I ordered a beef taco and a mojito. The complimentary chips and salsa and water came first, immediately after I sat down and got the menu at the same time. I ordered a beef taco $7 which came with rice and a salad that came in a tortilla bowl. The presentation was lovely and my mojito arrived shortly after, also $7.   Taste wise, the mojito was strong and delicious. The taco was good, I got full about halfway... must be because I had already ate half of the chips and salsa by then. The salad was light and refreshing. I really liked it.   Overall, this place is a good choice for groups, very casual, chill and fun environment. Just as good for those looking for a good Mexican meal in the Concordia area. Not good for a romantic date, and not good for you to go out of your way to get here."}
{"text":"I've been here a few times, I've ordered a chicken burrito before it was ok but I prefer their chicken fajitas so that's usually what I order now. As for the drinks, Pina colada is my favorite and definitely worth getting ( I get mango/strawberry)  Although, the food is OK, last time I came here... Service was horrible. We we're a big group as it was a friend's birthday, and everytime we had to ask another waiter to get proper service as our waiter was no where to be found. Plus, the waiting time to get our food was wayy too long. Overall, it's a good place for groups or couples, but I would recommend to call for reservations before."}
{"text":"Je ne comprends pas pourquoi il y a une file d'attente pour manger dans ce restaurant, ou devrais-je dire, cette chaîne de restaurants. L'accueil est souriant et c'est pas mal tout ce qu'il y a de bien. Le serveur nous informe que nous devons prendre un plat si nous souhaitons prendre un verre, sauf sur la terrasse, qui à cette heure là est remplie, donc attention, ils n'ont pas la licence complète d'alcool. Nous avons attendu 30 mins pour 2 margaritas et 1 plat de jalapenos avec, pour patienter, un panier de nachos salés à souhait et j'ai dû demandé des verres d'eau au bout de 20 mins car personne ne nous en a servi. Les (demi) jalapenos de qualité moyenne sont arrivés avant les drinks, qui en passant sont très sucrés avec peu d'alcool.  Je suis venue au 3 Amigos plusieurs fois mais la qualité des plats et du service est de pire en pire, je n'y retournerai pas."}
{"text":"Went to the 3 Amigos today based off of a recommendation from a friend. Honestly the drinks were the only good part of my meal here. I ordered a veggie burrito and it was terrible. The burrito had carrots and celery inside? The black beans weren't cooked at all, they were hard and cold. Honestly a very disappointing meal. Recommend the BAR not restaurant."}
{"text":"No refills? But my drink is 2.50. Can someone please explain to me why there was green beans in my quesadilla and zucchini in my fajitas ?? Isn't this Mexican?   The service was pretty bad. Like one of the worst I've ever had. Thank god I had a cute date to keep me occupied . Oh wait? We have a check coming? Um we have pay for this? Who knew ..."}
{"text":"Average tex-mex. No complaints, but nothing all that memorable either. This street is full of other restaurants, so I'd recommend avoiding this place and trying something else. The margaritas are quite large, but interestingly, they don't do the slush style. Maybe it's a regional variation. It was fun seeing the menu in 3 languages."}
{"text":"Très bonne nourriture, services A1 mais! Très bruyant . Bonne ambiance. Mon fils a reçu un sombrero, un dessert et on lui a chanté \"Bonne fête en Espagnol \" resto très abordable $$"}
{"text":"This was a fun surprise for us, specially being new in the Canada. This place was really cute. We went there for lunch mid-week and it was practically empty. Located in the heart of Palais des Congrès, it was the perfect spot to get some food. The decor is so colorful and fun, and the staff was friendly. We got seated right away and our food came out quickly too. I had their lamb burrito and that came with rice, salad. It was super hot but soooo delicious. Portions are big there and I couldn't finish my meal! I love that they also give you the option to seat at the bar which is right by the entrance (good for people watching) or come in the restaurant. Overall for something quick, delicious and with some nice kick to it, this is a great spot to get some Mexican food. Enjoy your meal there!"}
{"text":"Food is no where near mexican, neither is the decorations. Waiters kept swearing around the tables. Ridiculous."}
{"text":"3 amigos is an okay joint. I personally go because it's right next to my office and it offers a very affordable (under $10 taxes inc.) lunch menu which is a great alternative to a fast food or sandwich place! On the other hand, it's not the fanciest nor the most authentic. It's definitely not the best restaurant in town but the quality is pretty good considering what you're paying, e.g. the chilli platter is $5.95 during lunch time.   Not a place I would take my family to when they're in town but a good remedy when you forget to pack a lunch."}
{"text":"Don't be fooled by the great patio and full seating area. This is the worst Mexican food ever. Everything tasted store bought. Not even 1 star per Amigo"}
{"text":"The lamb that I had was good and to be fair, it was a generous portion for the base price. If you're not going to have any alcoholic drinks, just order water as the soda glasses are smaller than what you might desire and refills are not free. I give this place two stars because of the extremely inattentive and sparse waiter service.   Although we were seated in a reasonable amount of time, the long time that it took for a server to come to our table was unacceptable. It got to the point where I suggested that everyone close their menus to give the hint that we were ready to order. After our food was delivered (which did not take too long), any and all concept of service just evaporated from the air. A server was impossible to track down or call, almost as if they were purposely ignoring our table. I had to get up and go to what looked like a bar to ask for a simple glass of water. I ran into my waiter at that point and asked for the glass sternly as I knew that he wouldn't have come to our table again except to bring us the bill. When it did come time to pay, I gave a measly one dollar tip only because I had to cough up something. If you're crazy about Mexican food, go somewhere else. There are better restaurants in Montreal, especially in this neck of the woods!"}
{"text":"Horrible Restaurant!!! I showed up with friends for their $.69 tacos and ordered a quesadilla and margarita. There was no room for our group to wait while our table was prepared so we all ended up standing along a long, skinny hallway at the entrance till we could be seated. The Restaurant is full of outdated tables and chair and is clearly in desperate need of a renovation. The margarita was bland and my quesadilla took forever to make it's way out of the kitchen. When it did arrive, it was the worst quesadilla I've ever had! I've only ever sent back one other dish in my live, and I found myself forced to sent it back. Ingredients weren't cooked properly and it had pieces of food not listed on the menu, that I've never even remotely heard of being in a quesadilla. In summary, I would never go their again, and would advise my friends not to go there either, unless they made drastic changes!"}
{"text":"When we arrived, we stood in the door for a good five-six minutes while we waited for anyone to even acknowledge us - this should have been our first sign to leave.  We had eaten here before, some five or six years ago and we vaguely remembered a reasonable experience.  Regardless for some reason we decided to stay.  The waiter was no better than the person who seated us - slow, unresponsive, and curt.  It took a while for him to take our order,  a while for our food to arrive, and what seemed like forever to get a bill (even after he had taken our plates away).  Simply put, the food was not that good, and the service was even worse."}
{"text":"This place doesn't deserve the low star rating. More people need to leave positive reviews on this place. Great food. No over powering tastes everything balances well. Had the calamari really good and the taco and burrito platter. Shared with my wife. Great amount of food for value. Server was from Georgia great southern hospitality!  Great experience."}
{"text":"The server was adorable and tried her best to give us a great experience. The food was good and I would definitely go there again next time I'm in Montreal. Even the Margarita we got was delicious. Not a huge fan of the salsa that came with the chips though."}
{"text":"The food is not expensive, the sizes are humongous (for drinks and food). The service was very good too. Their food tastes very good. The management  seated  us outside quickly, and quickly was the server too.  I love the place, but unlike  to come back, we live in new york..."}
{"text":"Souper un vendredi soir. Service courtois. Portions très généreuses. Belle ambiance. Le paiement de l'addition a été un peu trop long, mais dans l'ensemble une très belle expérience."}
{"text":"This place is effing N-A-S-T-Y! Disgusting. Even the jumbo drinks were nasty. The tacos had a POOL of oil at the bottom of the tray (I even took and posted a picture as proof) not to mention that the taco shell was stale and tasteless. I ordered a strawberry-mango margarita and it was just as disgusting. There was a pool of syrup at the bottom of my glass that would just NOT mix in with the rest of my drink and it also came with a heaping mountain of whipped cream. Eh what does whipped cream have to do with Tequila? All in all, disgusting. I will never set foot in there again."}
{"text":"I agree with Katya P. I don't know why everyone is hating. I wouldn't expect the worlds best Mexican food in French Canada so drop that idea. They have good specials and the normal prices aren't bad. Lots of vegetarian options or as with any Mexican place you can usually just replace meat with beans. Try it for yourself."}
{"text":"I have been to many restaurants, but this is by far the worst food and service experience I have ever had. The server had something against English people as she was being so kind towards other customers that spoke French ordered 2 burritos for me and my girlfriend the restaurant had around 10 to 15 people and we waited 30 minutes for our shrimp burito to arrive. My girlfriends plate was fine but as I start eating my burito it was disgustingly burnt inside. I had to order another one but the server never asked if everything was OK. After 20 minutes I had to get up from my seat and call her. I told her my burito was burnt she gave me a attitude and took my plate showed it to the manager telling him it was burnt. I can read lips well, he said that's Bullshit and said make a new one without ever apologising to us. My second plate came after 30 minutes burnt again I couldn't eat it I payed and got out. The location and theme is great but for service and food will never ever go there again."}
{"text":"Touristy relic from the 80s that serves decent flavorful Mexican type foods and on the really cheap for lunches. The place needs to be madeover, the menu as well. But hey, its a good spot when you're jonesing for a tasty Burrito."}
{"text":"Absolutely fantastic food. The mole was delicious and our waiter was nice. The ambiance was cozy yet felt like a fun night out. The tortillas tasted homemade and authentic."}
{"text":"Guacamole is brilliant here, but Im really comparing to the one I normally had in the UK - which doesn't say much. We really came here for the Crazy drinks! Must try their bulldog! Spectacular!!' Order a side in order to drink here ;)"}
{"text":"Except the margarita, I didn't like it at all...  I ordered a salad and the chicken wasn't fresh, it was a frozen chicken...   My friend had a beef burrito and didn't like it either. Just not tasty ..."}
{"text":"It was a beautiful day (I don't remember which day, sorry, but I know it was during the week. They all run together now.) so I went to have lunch on a terrace at 3 Amigos. The place looks like a cheesy chain but it's really big and at night it's usually pretty packed so I had high hopes. Of course, I wanted the Margarita Deluxe, and the menu said you can get a double for an extra $2. However, because it was Deluxe, I paid an extra $4 for the extra shooter. Whatever, that's not too bad.  So the waiter brings me my margarita filled to the brim, already spilling over as he's carrying it. He has the extra shooter with him and when he sets the drink down, he pours the shooter on top and it becomes a tequila waterfall running down on the table. What a waste of $4! Not to mention, the drink tasted pretty watery. Margarita FAIL.  I ordered the chicken enchiladas and those were pretty disappointing too. I'm a huge fan of mixing dark meat in with the white, but it seemed like this was basically all dark meat, and the texture was pretty rough, almost grisly. There wasn't enough sauce (for me, the enchiladas should be almost covered, if not completely) and it tasted like bitter tomato paste. They really scrimped on the cheese (but hey, cheese is ridiculously expensive in Canada). The rice was pretty good but they should just leave out the salad all together. It was just a handful of lettuce with 3 large carrot sticks. Next post will compare the enchiladas and margaritas at 4 restaurants across Montreal :)"}
{"text":"Good service. Fast service. Bad food. I don't know who tells people north of Mexico what Mexican food is, but Fajitas, burritos, hard tortilla tacos, are NOT Mexican, and what they serve is not good."}
{"text":"With 3 Amigos I dont know what to say. Needless to say this place is very popular and I have come to this place countless times because everyone in my friends circle will either host their birthdays/ bachelorettes/ ( ..) night out or whatever the event be. *sighh* I used to hate this place before, because the food never impressed me and the drinks just tasted average and only bigger then what you get at some bars. However after coming here everytime I am kind of getting used to this place now. I like their nacho compliments with salsa and most of their food their food never gave me any upset stomach. The staff and service is commendable and the decor is a fab. Plus they always give the hats for birthday folks. So yes its a big hit on group activities as everyone gets served happy with big portions for the meal deals within budget. Hurray :)"}
{"text":"This was my first time going to this location although im alway at their downtown one. It was a quick in and out this time. Place is set great with plenty of parking right on Taschereau. The decor looked great from outside and in. Loved their bigger bar, and the cute terrace. Inside the decor is a little less fancy then the downtown one, but they still went crazy with pinata and all. It was nice. The great part here was that the food tasted really better then the downtown location. i tried the shrimp entree and veggie nachos. It was great. The chips were nice hot and crispy, and they went generous on my cheese. Huge great thumbs up! As always my daquiri tasted sweet and big enough to last after the meal to have more chit chats over. Service was right on. Overall very happy and will definitely return."}
{"text":"I have been there with my friends last night. We have 5 people. I ordered a Mango Salsa and they ordered 4 Fajita. The food were nice. Two reasons I'm giving it a 2 stars were because of the bathroom and waiting time. This was the first time that I used their bathroom. It was disgusting, dirty and smelling. There were paper everywhere on the floor. Hope you guys can clean it on time. As for the waiting time, we were waiting for the food served for about 30mins. But there were not so many customers there."}
{"text":"A very busy restaurant. The service is not satisfying since the waiter attending to our table is always in a rush or something, probably they are lack of hands.  The food was OK. I had a broth and my husband had a burger. We both love our food. No surprise nor disappointment.  I have also tried their specials. Tacos on Sunday is only 89. Worth the price. They also offer margarita special on Thursday for 5$. Guacamole was pretty bland. We don't like it."}
{"text":"Festive little tex-mex place near Concordia University. I've heard that it isn't the cleanest of places but I've never had a bad experience there personally. The prices are good & so are the margaritas.It's a bit off the beaten path for most tourists who stay in the centreville section, or old Montreal. It's very close to the Guy-Concordia stop."}
{"text":"Came here for cinco de mayo for some drinks and food. It was super crowded and a line to get in, which is expected because it was cinco de mayo.   The host did not take reservations so my party of 5 had to wait for a bit. The drinks were extremely watered down. Tasted like the generic cocktail drinks you buy at the supermarket.   The food was OK nothing really special from the food. I had the chicken nachos and a pina colada. Nothing really life changing."}
{"text":"I went there last year; my sis wanted to go to a mexican restaurant where she'd been and liked. So, when it comes to food, i'm always open. I'm not a fan of Mexican music and frankly, working in a musicstore for quite some time with some World Music fan in the place definietly helped my hate that darn music. Good enough we were on a corner with no light from outside and luckly no loud music. As soon as i sat and look at this old plastified menu i was aware it wasn't fine cuisine from Mexico. Oh well, I got a kind of menu with some salad in those fried corn flour bowl (that tasted aweful). The Salad was ok but you know, not incredible either. It's a fun place but a makeover wouldn't hurt. Not my kind of place."}
{"text":"Whatever you do, don't go to this Mexican restaurant.  I once went to this place and I will never go to it again. My friends and I once came here and ordered our meals but throughout the whole time, the waitress only came to our table just once. We were thirsty and wanted refills which practically never happened. On top of that, the waitress was not friendly at all and gave all of us the evil eye. After it was all said and done, the damn waitress had the nerve to ask for a 15 percent tip. Because of her bad service, I did not give a tip but she demanded it anyways. Claiming 15 percent tips are automatic in Quebec and then when I asked why waitresses only come to the table only once, she says in Quebec culture to do that. WTF....when I said I was against that, she asked what my nationality was and I refused to tell her and said it was none of her business!  So not only was the waitress lousy but she was prejudice and a bitch! All my friends are not going there anymore. We refuse!"}
{"text":"Gave it one star as there was no lower rating. We went there Friday evening May 8. restaurant was half full. Limited waitstaff, took us 20 minutes to get 2 drinks, 30 minutes after ordering our waitress comes to tell us we cannot get our appetizer because they have no ceviche (isn't this a mexican restaurant?). O.K. fine. One hour later I flag down another waiter asking \"where is our food\" after all we've waited an hour? Manager was at the bar hammering the drinks for the entire time we were there. Finally got our food which was a Caesar Salad and their 2 Taco Platter (yeah 1 hour for that?) Before we got a chance to pay and leave the drunken manager came to our table because we had complained to the waitress. We tell him first one hour for our food, no ceviche which meant no appetizer, and on top of that I said: You are DRUNK! He said yeah why do you think I am drunk. I said because we been watching you hammer drinks and harass the female waitstaff for the entire  2 hours we have been sitting here! He asked us to leave immediately and not return. No problem I said we had no intention of EVER returning! That drunken fool saved us a $50.00 bill for bad food and even worse service !!"}
{"text":"It's shockingly difficult to find tacos around here, so we decided to try out 3 Amigos. Sitting out on the terrace was nice, but inside, it is dim and loud and crowded. It's very, very heavily themed. Certainly don't expect \"authentic\" Mexican food--I don't think they claim to serve it, but if they do, don't believe it. Go if you want to see every available surface inch covered in a tropical theme. It appeals to some, but not to me personally.  The drinks are very, very weak. Honestly, don't bother. They're dressed up as big, fanciful affairs but they just taste like fruity sugar. You could ask for more alcohol, but at that point, you could just walk across the street to the SAQ and buy a nice bottle of tequila.  The food isn't terrible. 89 cent (used to be 69 cent) tacos on Sundays are adequate--definitely a step up from fast food, but maybe not two steps.  My personal recommendation is the taco salad. You have to mix it up a bit yourself so you don't end up with plain rice and beef at the bottom, but I think it's tasty. It has a nice mix of crunchy veggies (bell and jalapeño peppers, etc), and the shell is nice and crispy. It's not super greasy, which you would expect of a taco bowl.   Most importantly, we've never gotten sick here. Low/medium-grade restaurant Mexican food is always 50/50 for me in terms of feeling bad afterwards, but 3 Amigos has never made us feel even a little bad. The service is hit or miss. They always seem to be packed, somehow, so the servers always seem rushed. I've had both good and bad servers.  Overall, it satisfies a taco craving, but I'd pick a better option if it was available."}
{"text":"I wanted to like this place, even with all the mediocre and poor reviews, however I can't do better than 3 stars and that's being kind because there is no half star.  Our visit started ok. Nice street appeal to the place. The manager was great and seated us exactly where we wanted to be.  Then we met our waiter Dominique (male). Friendly guy but not service oriented. When I tell you I'm the easiest customer on earth to get a 20% or more tip from I mean it, but Dominique was able to earn my lowest tip In years- about 12%. I can't remember the last place I left less than 18%  After making our select we sat Almost 15 mins with our menus closed hoping Dominique would notice us so we could order drinks (how about offering us water?) We finally got his attention and place a drink and entrée order at the same time. Again nice guy but that's all he is.  The food came out timely and unlike some of the reviews I thought it was reasonably good (about a 6.5 out of 10). We asked for water but never got it. Asked for more napkins but never got them. I wanted another drink but decided to spend that money somewhere else. I guess Dominique knows he sucks because when we finally settled the bill he knew not to ask \"How was everything\"... To the management at 3 Amigos I have 3 words that will fix your restaurants  ratings and appeal- service service service....great service will always improve the taste of average food.."}
{"text":"How should I say this?   Not sure what happened to this place, it used to be a very popular Mexican restaurant in Montreal with great reputation, great food quality with better than average service. But today I'm very disappointed, Well the food is okay, not spectacular... The service... I have had better experience before."}
{"text":"A lot of the reviews on here are outdated. I don't find this place gross or dirty like others may have mentioned.  This is a definitely a fun place, always popular for groups and parties. I've been at least a dozen times or more for their 69cent sunday taco specials which do not disappoint. The service was always fast, they always draw in a big crowd so the tables turnover quickly. Certain things are really worth it, because it's rare to eat a full meal in a sit down restaurant for less than ten dollars. I've tried their beef, chicken and chili tacos which are always flavorful albeit the beef is greasy. I ask for a small side of refried beans which actually comes free of charge. Ordering a full plate of it is less than 2 $ anyways. With that, I get a side of their fried rice which is also less than 2$ and there's enough of it to share. For cheap eats, this is the place. They have such an expansive menu, I can't comment on it all. I've tried their quesadillas, fajitas, enchiladas which were all good.  However, one not so good aspect is their melted cheese which can taste a little plasticy the way they reheat it.  As for drinks, I'm personally not a big fan of their margaritas, they're watered down, lots of slushy ice and very sweet artificial flavors.  I would recommend this place for a casual and inexpensive dinner or lunch. There's plenty of choices that can accommodate to all budgets and taste. I've always had a good time. Don't expect high class or authentic mexican cuisine and you'll enjoy it."}
{"text":"Odd to find a better Mexican restaurant in Canada than in the Northeast USA.  The waiter was very inattentive and was extremely slow on taking our orders.  The food was very good and tasted fresh. The drinks were VERY watered down, so I would suggest saving your money if you think you're going to get alcohol."}
{"text":"Worst Mexican restaurant I have ever been to in my life, and I have been to many.  Will write more when I get to a full size keyboard."}
{"text":"Alrighty- so only about a year ago have I known about 3 amigos (from ottawa with no location as of yet- soon to be one in gatineau!)  First time I was there was fantastic! Great ambiance and fajitas were crazy xD (veggie/tofu) was definitely pleased by that plate for sure. It was relatively quiet for around lunch time so it was pretty pleasant :).  The second time I had been, I went to the location near rue Berri (by uqam) and ordered a salad. Was slightly disappointed- wasn't a bad salad but just wasn't that great either . It was a bit louder and we managed to get in quickly before they closed. Great service given it was within the half hour before close and everything was being cleaned up.  Either time I've been- the tortillas and salsa that they serve to you unlimited (as far as I'm aware) were epic :) (love a warm tortilla).    Mexican is great either way :)! You have to go there at least once- lunch time is best for walk-ins."}
{"text":"I went to this place few times.   What i like :  Burritos Nachos Drinks Environment Good with friends   What I don't like : Quantity of the food,  just not enough,  I have to order 2 plats, like at least one entré  and then main dish. Not all the dish are great. You have to go there few times to find the goodies."}
{"text":"I used to love this place before 4 years now I dont find my cheesy enchiladas in their menu anymore and the quality is not it used to be. I still like their jalapenos cheesy fried ones"}
{"text":"What a joke!  We were 3 people during lunch.  It took 20 minutes before a server spoke to us, 45minutes to get our drinks (two of which were wrong) and after an hour of sitting there with no food, we decided to get up and leave.  The hostess had a horrible attitude, the wait staff was inexperienced and wouldn't even look at us as we tried to flag them down.  Not recommended!  Stay away!"}
{"text":"Gives you free salsa chip when you order, good service, decent speed, Nice halloween decors. Sunday special taco $0.89 around 2016 Oct: Dine in only; you have to order 4 at time, and you have to order 1 drink with it. I feel the taco fills you up nicely & taste fairly fresh."}
{"text":"I have never experienced such terrible service in my entire life. I am visiting from California and walked by 3 amigos because it looked like a cool place to grab a margarita. The second I sit down, the lady who sat us dropped our menus on the table so rudely and did not say a single word. Next they took forever to serve us and bring us our drinks and water. When the waters got to our table they were half way full with no ice and the glass was dirty(in photo). After 30 mins my margarita came and it was 95% margarita mix and 5% tequila. At this point my friend and I were running late so it would take too long for them to bring me a new one so I said for him to just take it and cancel it. The waiter starts mimicking me and tells me with such a rude tone that this is how they make their drinks and that it's not on him who brings out dirty or clean cups/dishes. I ask to speak to the manager who is standing 5 feet away from me yet refused to come speak to me. Long story short the waiter is fighting with me and instead of offering to fix the drink or see how else he can help his costumer, he fights with me and makes fun of me. I am lost for words and I hope they go out of business. I usually do not write Yelp reviews or say anything to the waiter if I am unhappy about my food/drinks but this place made so many mistakes and the employees were speaking to me in such a rude manner that I had to say something, and I'm glad I did. They don't even deserve 1 star."}
{"text":"Went couple of times to this place. Last time was end of august they changed the big cups they used to have for smaller ones which was one of the nice things they had....huge cocktails while now they were smaller and barely any alcohol in them. The waiter didn't even care..he kept touching me while talking and it took him more than 40 minutes to get our food. When I complained he said sorry they had a problem In the grill in the kitchen...the food looked really nice but had diarrhea for the next 3 days. Last time am eating there"}
{"text":"I'm not a big fan of chain restaurants, but the experience overall was okay. I like their yarda's of margaritas and that \"cheesy but in a way kind of cute decor\".   Yes, it may not be the real Mexican food experience, but it can be a pretty fun place to spend with friends on a Saturday night."}
{"text":"I would say to skip the margaritas and just stick to beer. They were very sweet and weak. It's a bit kitchy as well."}
{"text":"Contentez-vous des tacos à 89 cents le dimanche et tout ira bien! La terrasse en été est un plus puisque qu'elles sont rares sur la rue St-Catherine!"}
{"text":"We decided to come to this place for a fun Friday night on our trip to Montreal. I thought the decor was good as it reflected their \"fiesta\" vibe.  We started the night off by ordering drinks while enjoying the complimentary salsa and nachos. My friends ordered the strawberry daiquiris which I tried and was not too fond of. I order 1/2 litre of white wine sangria, there was not much fruit and lots of ice. It didn't taste bad but it wasn't great either. Looking around everyone seemed to have the same drink, if you could figure that out I'm sure it's a customer favourite for a reason... Literally 75% of people were sipping on one.   Our food came out fast! I opted for the chicken enchilada which came with salad, refrained beans and Mexican rice. My enchilada was not bad, the salad came in a tortilla shell which was a nice touch, but all of our rice sides were extremely dry.   My biggest disappointment of the night was the service. Our waiter seemed clueless and forgot about our table a few times. When I ordered I asked if I was able to get double the portion of salad instead of refried beans, he claimed he wasn't sure and would ask the other staff. Without consulting me again he brought my plate with one side of salad and no beans.. I asked him if I could have the other side and his response was \"Oh now you want the beans?\".   Other then the service I would still recommend this place for a mediocre meal with a great atmosphere.  Next time I'm in Montreal I will probably re visit just for drinks and the complimentary salsa!!"}
{"text":"J'ai mangé sur la terrasse avec une amie pendant l'heure du midi, en semaine. C'était cool, on a été vite servi. J'ai pu manger en 1h. Le repas était vraiment pas cher et on a bien mangé. On a commandé des fajitas poulet et buf. Simple mais bien assaisonné. La nourriture arrive toute chaude devant toi. Mon mojito était pas mal aussi :). Bon moment."}
{"text":"My partner and I were very hungry after happy hour at St. Elisabeth's Pub so we headed north on Saint Denis. This was the first restaurant we saw and they had a poster advertising $6.95 fajitas on Wednesdays. It was a Wednesday. And we miss Tex-Mex desperately after moving to New England. So guess where we had dinner?  The place was packed and jamming Latin tunes. We snagged a table for two right by the front windows which made for great people-watching. They complementarily provided a small basket of chips and salsa. The basket was laughably small (well, everything IS bigger in Texas) and the salsa was....sweet...a little off...I think it had carrots.   The margaritas were huge and flavorful, better than anything I've had in Boston. And my beef fajitas were pretty good. Also better than anything I've had in Boston. I suppose those are low standards. I would've loved it more if it came with rice (just lettuce, cheese, sour cream, salsa without carrots) and a little more guacamole. My partner had the spinach enchiladas which were probably the healthiest spinach enchiladas I've ever tasted. They had tons of spinach and not too much cheese.   Overall, the place was loud and rowdy. Service attentive, but not hovering. And it's a chain."}
{"text":"Alright so I met up with some family for a birthday and I have been to other 3 amigos.  The first thing I noticed is this place is really narrow in some places so anyone on a wheelchair will have a hard time, even the rope that seperates the people coming in and out was so narrow I had to move it twice so one of my family member can go on through as he is on a wheel chair. Decor was your 3 amigos affair so I always like to look around at all the artwork, it's great.  Now the waitress had holes on her shirt and so did another serving us as we were about 4 tables full. Like Mr boss man can you please replace some of their shirts because it's embarrassing and makes you look cheap.  I had a beef fajitas that come in on a hot plate and I had them many times at other places and honestly it was a meh, just tasted a bit lackluster compared to the other 3 amigos I have been to.  I will come back here if there is another event but if it's the same with the shirts with the holes and the narrowness of some of the areas I don't think I'll come back here but the experience was not 100% ruined."}
{"text":"Had a great meal tonight after exploring the Latin Quarter! Busy restaurant always attracts us! Would definitely recommend!"}
{"text":"So I went back to give a chance for a better experience. Finally we spent really nice time there. I brought my bro and my mom, both they loved the plates. (Recommend the tacos specially) After all my time here I give 3*. Hopefully in the future is raising up...  I know I'm going back soon."}
{"text":"This place is just OK. Spending alot of time in Florida it makes it hard to find any decent mexican food in Montreal. The reason I came back here is due to lamb on the menu. I love lamb which is rare to see on the menu."}
{"text":"Ok ok I know people rag on thise place, but its cheap, big portions and decent food. Is it authentic? Absolutely not. Is it worth it for their tacos under a dollar deal? Yes! I forget which day of the week it it, but you get tacos for under 1$ each! They have a nice selection of beer too. Will continue going back !"}
{"text":"Came here with a group of about 50 people. We got the room upstairs.   It was incredibly loud, because it wasn't a closed room. It was more like a big balcony. As a result, it was difficult to hear what people were presenting and I'm sure that the people downstairs were annoyed by how loud we were as well.   Before I talk about the meal, I'd like to take the time to address the bathroom issue. The bathroom is in the basement, which usually isn't a problem. However, the stairs going down were really... Scary? They were narrow and very steep. The toilets were dirty and when I went, it wasn't well maintained. One of the faucets didn't work, another one exploded water the third one was functional. My friend and I both have up on the handdryer and used our pants instead.   Now, on to the meal! Everyone was supposed to get a plate of nachos, a main, a dessert and coffee/tea.   Not everyone got nachos, in fact, by the time they got to the last couple of tables, 3-4 people had to share a plate meant for one person. Also, there was a 30-40min difference between the time the first and last table were served. It was kind of ridiculous.   The mains also came out unbelievably slowly, which I find a little ridiculous, since we only had 6 options for the main. I got enchiladas. They were ok. A little bland and a little cold.   The dessert (chocolate cake) was good, but same thing as with the nachos, a lot of people were stuck without dessert/had to share. (I'd like to specify that we were the correct number of people. No one showed up unexpectedly.)   When it came time to pay, we each had to pay about 40$ for the nachos, the main, the dessert and coffee/tea. It didn't matter whether or not you actually ordered/received the items. If you were there, you had to pay it. The tip was already included in the 40$, but when the waiter handed people the machine, it was on the screen where they asked how much you wanted to tip. As a result, most of the people in my party tipped twice.   Overall, it was a pretty bad experience."}
{"text":"Si vous prenez le Copa de Cameron Calypso, assurez-vous qu'il y a bel et bien de la coriandre et que les crevettes sont bien nettoyées.  Les enchiladas sont ok, sans plus. On vient ici pour les cocktails. Je me demande pourquoi il y a des écrans branchés sur le réseau des sports et de la musique pas mexicaine du tout."}
{"text":"for some reason, even after seeing this place had 2.5 stars, we still decided to go.......... I will never make this mistake again  do yourself a favor and trust yelp"}
{"text":"Came here with my hubby and almost 2 year old.  It was so ideal to get a booth so my kid can have space. They have high chairs but they're pretty small. My kid was also very stimulated my the funky Mexican decor. There is good Latino music playing.  They serve chips and salsa on the table.  We ordered the guacamole appetizer. It's small (see pic) but good. I got the chicken enchiladas. It was quite delicious, and a world of difference from the ones at Carlos and Pepe's. But then again, it's not quite authentic Mexican, somewhat Americanized.  My hubby had the Polo Santa Fe and said it was was good and the sweet potatoes and sauce were nice touch. But next time he will stick to something more typical Mexican.  Very decently priced restaurant. Service was great. But they could do better on the water refills."}
{"text":"3 Amigos well I don't find it that great honestly, Always very disappointed or I just don't know what to order I don't hate it but for what I pay I find I should be loving my food and instead of thinking it's OK. At least I got good service and I liked my mango daiquiri .  On Mondays they have 89cents tacos maybe that's worth a try but I think you have to order a drink to get that price. Over all from my experience with the food and the cost can't give it more than 3 stars"}
{"text":"Didn't like the place the first time I went but this time the food were so good. I'm impressed. Will definitely go back and try more varieties"}
