{"text":"I Want to love this place every time I come; because it is so convenient. However,  every single time I come, the service is awful. There is a table in the back where servers wait until they're told they are needed?! I was in there tonight and it was a very very slow night. It took over 15 minutes for somebody to come up and even acknowledge me. This was after I went up to the bar to order my drink? The servers are not friendly, no hello how are you,  nothing. Every single time. The food is mediocre and overpriced. I'd rather pay more and go somewhere where  I am greeted with a smile and served in a friendly manner."}
{"text":"This beer & pub food house is doing well with high customer traffic primarily due to location. The food I found to be average (sweet Thai sauce on halibut tacos?). No veggie burger option. Overall, menu selection was predictable pub fare-- nothing unique to tell you about. My first two beer selections were out of stock. Yawn.  The wait staff was attractive and our table was checked regularly, so overall customer service pretty good."}
{"text":"Great beer selection, very poor service. On a Saturday night my wife and I sat at the bar and the bartender not only gave us attitude and slow service but other patrons as well. He was more worried about talking to and serving his friends and off shift co-workers at the far end of the bar than the patrons paying full price! The manager did nothing to recognize the challenge and or correct it when brought up. My glass will never be empty at 722 again as my wallet will never be opened there!"}
{"text":"We reluctantly revisited this restaurant for a friend's birthday. My husband had the Louisiana chicken dish and enjoyed it. I wanted roasted seasonal veggies (a side) warm potato salad (side) and chicken wings (appetizer) as a meal, but the only veggie they had was bok choy  - so I had a caesar salad (side) and wings instead. The wings were on sale, and were a great deal. My salad was fast-food quality, the wings - teriyaki - were too saucy and didn't taste like teriyaki at all. The salt and pepper chicken wings the 6 of us shared were good - hot, crispy, not too greasy, well seasoned. The other meals looked good to me, with the exception of the chicken pasta - it looked watery. We shared a piece of chocolate mousse cake, and that was very tasty and not too sweet.   The service was good, but the server could have done a better job of keeping the drinks coming, etc.   I know it's a pub, but the overpowering smell of beer outside the restaurant, and inside was a bit too much for me. I hate the music. My husband can't sit in booths, so the only option both times we've been there is high bar stools. These are incredibly uncomfortable.   Overall, I would say the restaurant has improved somewhat over the previous visit, but I would never choose this for myself.  Food ** Service *** Atmosphere *"}
{"text":"My husband had the beef stew in pastry that was raw. He sent it back and ordered a burger which was good but there was no adjustment for the fact that he ate by himself. I had the chili chicken sliders. The chicken pieces were flattened and about an 1/8\" thick and didn't even cover the whole bun. Service was mediocre. Won't go back."}
{"text":"Overpriced pub food trying to pose as finer dining. Tiny portions. There is not a single innovative item on the entire menu. Beer specials when I went in were $7 pints of London pride. $7?! What a deal!! Not. Save yourself some money and disappointment and pick another pub. Also the beer selection is what you would expect at a Boston Pizza. I have no idea how a place like this generates return customers..."}
{"text":"Been here 15+ times. Usually prompt service, with decent food. However, the last time was horrible. The restaurant wasn't overly busy. Our drinks were left empty throughout our meal. A steak sandwich, that took well over 45min to come to our table, was over cooked when it did arrive. During which this time the 2 burgers that were delivered in under 20min, got cold. The server was polite, but did nothing until asked. The manager decided to pull the sandwich off the bill, but did nothing to rectify the 2 cold burgers. Go have a beer here, but stay away from the steak sandwich."}
{"text":"This restaurant and the 933 Group are NOT family friendly. We arrived here on a Monday evening at 6:20pm were seated by a hostess and just being given menus by the waitress when the on duty manager walked up and started explaining their no minors after 7pm policy as was on the website. When I protested it was before 6:30pm (the time of their last seating) and that there were many other families here he still proceeded to take the menus away and tell us we could not stay citing licensing etc. I got irate and admittedly used profanity as he was being completely unreasonable and made my 2.5 year old daughter feel like she was unwelcome despite all the other children eating their dinner. When I escalated the matter I got a pathetic one sentence apology then a paragraph saying they determined their manager followed policy despite directly stating in the same email that he did no follow policy as their last minor seating was at 6:30pm. I then escalated further on the phone to operations manager Jamie Mansour who did nothing but adamantly defend his lying night manager who apparently indicated he was going to allow us to stay but did not because of my use of profanity. This is a bald faced lie as I only got upset after he forced us to get up from our table, why should I have just left quietly? I can see the operations manager is of the same breed as his on duty manager. He referred to me as sweetheart and missy and young lady multiple times in our phone conversation, completely inappropriate things to call a woman and a mother. He never once focuses on the fact that they as a service industry had failed miserably but instead berated me for my use of profanity. Well in my books calling me \"sweatheart\" is 10 times more insulting then calling a ahole an ahole. Please do not give these family unfriendly pigs your business."}
{"text":"Heard about 722 from a friend and what an awesome place.  Went for a meal and drink with an old friend. Flames hockey and NFL were both playing, with screens everywhere!  Server was great, prompt and friendly.  Food took a little longer than we expected, but they were also very busy. Awesome hot wings and Classic Burger was tops. Good portion sizes too.  Clean.  I will come back for sure."}
{"text":"Gave them a second and third chance. WOW was that a mistake it was even worse. Save your money or go to a fast food joint. Even though I hate greasy fast food the food at 722 is terrible. They offered me to come back and free dinner but I didn't take the offer as I wanted to see if anything changed. It did it is worse!!!! Run away this place is  horrible .   Unfortunate this was a great restaurant we actually went once a week at least but the last 3 visits just sucked. I have a 3 strike rule so I don't think I will go back. There cooking standards have just gone down hill one visit after another. Today the French fries I received what I would call the bottom of the deep fryer they were bits of hard over cooked crap not even resembling fries. They are served in a small bucket that was not even a quarter filled my husbands were fine and his bucket was at least half full and resembled fries. The visits before this was it took forever to be served and receive our food and the food that time was not that great. Over cook slow service I would highly recommend finding somewhere else. Too bad they slid down so fast. Hopefully the management read this so they can fix their issues."}
{"text":"Stopped in on a Friday afternoon at about 2:00pm. 8 tables were occupied,saw at least 4 wait staff mulling around. Numerous dirty tables were there not being bused. Waited 20 minutes without having a person aknowledge us, they did notice we were there. Walked out.  Who is managing this place?"}
{"text":"If you want shit service over priced food and the smell of second hand smoke while you eat your at the right place. The siding doors at the front allow for smoke to come in as everyone smokes at the front door and don't bother telling the male manager because he is out there with them. Ask the server for some more ice and she says oh let me get your server. Are you not a team ? I recommend a better gm who knows what their doing."}
{"text":"This place is great. We had Lexy as our server. We recognized her from another place we often go to for food. She was nice and prompt with our orders. The manager checked up on our experience and wished us a good night in our way out. The Nachos were fantastic. Tons of toppings and cheese! We also ordered the salt and pepper wings. They were actually juicy (unlike others I've had in the area)! Highly recommend this place to anyone who wants a good pub fare experience. The prices are a little steep but they have so much on tap and make everything in house... so if you are complaining about price, there's a lot of second rate pub experiences in the area. Head there. :)"}
{"text":"Prices are exorbitant, chicken wings are tiny, food came out cold. The mushroom soup is great though."}
{"text":"Nice decor, when you enter, wait to be seated at the hostess station.  Started off with the beverages, of course!  Lone tree ciders, Sommersby cider on tap, a Canadian 100% gluten free beer - Whistler Forager!  Mongozo for everyone else.  They offer Care bakery gluten free pizza crusts & buns - YAY! $3 up charge.  Loud. Loud loud. Concrete floors. Careful - don't slip! Cozy decor, the music was bass-y but not enough to generate this amount of loud loud talking!!!! Can't hear person sitting next to you at the table. Table spacing is challenging. Might have something to do with noise.   I'm not 100 pounds, but I'm not extra either. Baby got back!! Sit at a booth. Easier to navigate around than squeezing between tables.  Patio looks nice, and there are heaters, but a storm was coming in and it was chilly.   Many TVs running all different sports ...and Fox?! Fine. No audio. Can't hear what's going on anyway. Bright and flashing. Was very distracting.   Not a place to linger and enjoy, and I was hoarse the next day.  Food was satisfactory, service was a bit inattentive, lots of staff checking their phones on the floor, getting the bill and paying it was painful.  But the noise... unfortunately can't enjoy my meal, company or even linger when you can't hear or be heard."}
{"text":"Horrible ! First time we went for brunch all our food was cold, and one of the dishes was wrong. Second time we went the server took my boyfriends beer away when it still had 1/3 left and didn't ask him if he wanted another. For the tacos/wraps you have to pay for extra salsa wtf is with that !? They are way over priced for their food and drinks ! Never again will I go there !"}
{"text":"I have to agree with many of the other reviews about 722. It has become a real disappointment.  At first, we were pretty excited to have a cool new restaurant/bar so close to home..... But then we actually went inside.  The concept is cool - big garage style doors that open so you can sit inside, but still get the patio feel. The cool factor stops there. It is crowded. I don't mean with people, I mean with tables. So. Many. Tables. You actually have to shimmy and dance to get around all the freakin' tables just to get to the bathroom. It has a very chaotic feel to it. And it's loud. Very very loud. Irritatingly loud.  But enough about the crappy atmosphere. Let's talk about the crappy food. The menu appears to offer a good variety of pub fare and a little more exotic options as well. But the food is so sub-par. It tastes like any other place that offers the same. You might as well go to Boston Pizza. It's all very mediocre. And pricey too! Let me tell you, that $18 burger is not worth it. At all. Just don't do it.  Their one saving grace is that they have good servers who do a great job and lots of different beers to choose from. They will also happily let you sample the beer before you commit to a whole pint, which is nice. But that's pretty much it.  Crappy atmosphere, crappy food, crappy prices.  We still prefer to go to Schooners down the hill. It's a hole in the wall that trumps 722 any day of the week.  722 should call 911, because they are hurtin'."}
{"text":"In regards to a local watering hole, it's this or Fergus and Bix. Both are good options. 722 has a good patio to go for a drink after hiking in paskapoo slopes or activities at WinSport. Or to go for a couple drinks and walk home."}
{"text":"Came here for a quick drink with a few friends during Stampede.  They don't have an actual patio on the main floor, but the windows are massive and open up all the way, making the entire main floor feel open and breezy - it was really nice.  They had a lot of staff on, and the service was prompt and friendly.   Fridays they had some good beer specials, they had a ginger cider on for $6, it was delicious!     I didn't order any food while there, but the food around me at other tables looked pretty tasty - standard pub fare, but smelled great.    Will definitely be going back since it is just a hop, skip, and a jump from my house :)"}
