{"text":"This place was great, I stopped in after its renovation. For an all-you-can-eat sushi restaurant this one is really good, the selection ranges by price point, which is good if you want sushi but don't feel like going all out for sashimi. 

The deep fried wontons (cheese filled) are to die for. The shrimp, pumpkin and broccoli tempura are as good as you can get anywhere else. Their selection of non sushi items is quite broad so it's fun to try some cool things like the enoki beef and bacon wrapped asparagus. My favourite rolls have to be the 'dragon on fire' and 'black dragon'. 

The waitress was super friendly and by paying cash got a free pop. Overall a good restaurant."}
{"text":"Easily one of the worst places I've eaten in this city. You'd expect less from a place with a name like that but not quite as bad as it really is. The cheap lunch AYCE special includes about half to less than half of the menu. And very little of it is good. 

The spicy sauce/mayo is terrible. The quality is mostly terrible. The service was painfully slow and the server was rude. The sushi rice was over vinegard and cooked to a paste. The tempura was delicious though.


Will never return."}
{"text":"I recently moved to the area and noticed this place was always packed, thought it might be worth checking out... DO NOT BE FOOLED this was by far the worst sushi I've ever had, and I've had sushi in Mexico.

The service was horrible, didn't even get a menu until sitting for 10 minutes. The food was even worse. I thought I'd be safe by getting a spicy salmon roll. I was sadly mistaken. This thing did not even look like a roll. It had a huge chunk of what seemed like a few days old raw salmon in a horrible cream sauce. I had to make a big effort not to spit it out when I was chewing it. The other rolls were just okay, but the spicy salmon ruined my entire meal. 

It took another 20 minutes for us to get the bill, and left one of us quite sick after our lunch.

Please, please do not go to 99 cent sushi!"}
{"text":"I had heard that this place was such a great deal. 99 cents for sushi from the a la carte sounds pretty cheap but they didn't mention that it was for 1pc so really its not that cheap. But the sushi itself was quite good. It was nice and fresh. However, they do have all you can eat for $9.99 which is a pretty good deal."}
{"text":"I suppose my first big red flag should have been that I was ordering from a venue called \"99 Cent Sushi\". 

Although delivery was prompt, this was hands down the worst sushi I have ever had - far below the worst grocery store sushi you could purchase. 

I just remember the fish seeming less-than-fresh, and far too many tempura bits. Everything also had a bizarre warm temperature and mushy texture. 

Never again."}
