{"text":"Very nice staff and great food.  Not sure what some these other folks are griping about.  What difference does it make if there is a Bojangles in the same food court.  It's a food court.  This place is fine, and family friendly!"}
{"text":"My husband and I have eaten here 3 times in the past month and have yet to experience a bad meal. Last night we had the pork loin and it was tender, moist and flavorful. The macaroni and cheese is terrific and the glazed baby carrots are delicious. I agree it seems strange for a cafeteria to be located in a food court but get past it and enjoy! They never seem that busy when we're there in the evenings - maybe they're busier at lunch time. I wish them well as I agree we need a good cafeteria in the South Park area."}
{"text":"was excited about a cafeteria in the area until I ate there.  green beans were mush, collards tough, mash potatoes dry.  biggest complaint no selection of breads and deserts like a cafeteria always has.

try it soon, shouldn't be there long"}
{"text":"This cafeteria is located in the same building as the Bojangles across from Southpark Mall. 

I got a takeout dinner last weekend. The pork barbeque was o.k. They asked me if I wanted a bun (which I did) but put the barbeque on top of the bun in my takeout container - when I got home the bun was basically mush....

I also got the mashed potatoes and gravy (very good!!!!) and the blackeyed peas (tasted right out of the can).  The to-go cup was one of those too small clear plastic cups with no top - very hard to take out!

The price for the meal (entree, 2 sides and a drink) was $9.95. I doubt this place will stay in business with these prices. If the food was really good it would have a chance but with mediocre food not a chance. Sad, because a good cafeteria is really needed in this area!"}
{"text":"When are you returning?  Or backing another group to run a good place to get fresh vegetables?    The cafeteria was quick, reasonable and tasty.. ..meatloaf and Mac&Cheese, squash casserole and fried okra to be specific.  Southpark used to have S&W, then Barclay's at Belks. then Morrison's at the mall.   All lasted for years but lost out to commercial/retail growth.  Local workers and residents (lots more moving in the SP area this year) would LOVE to welcome you back...in this location or one close by.  Maybe next time a little more variety and a LOT more marketing!!!"}
{"text":"I've been twice for lunch and it was amazing both times.  I had the chicken and peppers the first time and today I had the baked ziti, green beans, and a lemon bar, which was all amazing.  Sweet tea is sweet and good.  I highly recommend trying Morrison Farms Cafeteria!  :-)  It's great."}
