{"text":"Hands down our favorite stroll to place!   I used to love the old ABC and I was sad when I heard it had been sold. Not anymore. The food here is consistently great and the servers are always friendly. We like to sit outside and people watch and sip a cold \"fancy beer\". The food always comes too soon!  Their menu items and beer list are always changing, so we are never bored!"}
{"text":"Love there happy hour pricing and the appetizers aren't bad. Great fried food I guess."}
{"text":"Someone needs to address the customer service issues at this place.  Went here last night with a coworker after work around 11pm.  When we asked the bartender if he could make a drink tasting like apple pie, he said it wasn't \"rocket science.\"  After paying for the drink, and giving him a tip, we tasted the drink.  Well the drink tasted nothing like apple pie (maybe it is rocket science).  It tasted like red hot cinnamon candy.  When the bartender finally came near us again, we told him the drink wasn't good.  He said, \"uhhh, okayyyy\" -- smirking, and walking away -- never to return.  He has a dark beard, dark hair, and glasses.  Rude & arrogant.  We told the other bartender and he replaced the drink.  Never been treated this way before."}
{"text":"The best thing about this bar is the staff.  Very friendly.    Now the meat and potatoes:  Don't order the jerk nachos or the BLT.  What ever you read on yelp as good about these are lies!  The bacon on the blt is a 1/2 inch thick cut of raw fat and meat. And the jerk nachos simple taste awful.  Now the restaurant.  For a bar that is amongst several middle scale restaurant, this place is the dumps.  1 old bowling game, no darts, or pool tables.  For some reason they had QVC playing on 3 TVs.  The bathroom was littered with racial slurs scribed into the walls.  I paid $5 a beer here.  Hopefully that money will go towards a remodel and revamp of the menu.    Lastly to hold a tab open they hold your credit card in a cup at the register, with 25 other credit cards.  They own an upscale point of sale system but apparently may not have the availability to hold a card number safely.  But I give the staff 5 stars for there hard work.  Honesty and constantly cleaning.  The cook brings you the meal."}
{"text":"The new owners have brightened the place up.  I think it has one of the longest bars in Cleveland.   They now have food. Try the cheeseburger with super thin cut fries or the lamb quesadilla with ground lamb from the West Side Market.  It will be a good place to either start the night or to finish it."}
{"text":"Maybe it's because it has only been open a week, but the Uptown ABC didn't seem ready for customers quite yet.  We went over earlyish on a Saturday night and the place was about a third full and stayed that way until we left.  The TVs were not working the entire night.  We sat at a table.  Over the course of the night, we had about three different waitresses, which was great - I wasn't expecting table service for a group just ordering beers.  The first two waitresses we had seemed unaware that the other one was serving us.  Neither of them asked us how we were going to be paying, and when the third clocked in, she had to figure everything out.  Almost everything we tried to order on the extensive beer list was out.  One of my friends tried to order about four different beers before she finally ordered one that they actually had - and then she didn't even like it.  After striking out a few times myself, I just stuck to what was on tap, which isn't what I came to a bar like ABC to do.  We didn't get a price list, and at the end of the night all beers cost $5, regardless of what it was.  Since I was drinking what was on draft, that price made sense to me, but I'm sure that if somebody ends up paying $5 for a can of Genny that there will be some complaints later on.  Our receipts did not have a price breakdown of what was charged per a drink.  Don't sit near the kitchen.  Every time food is ready, they hit a gong, which is obnoxious and startles you when you're trying to have a conversation or enjoy your beverage.  Overall, I'll come back - I LOVE the Ohio City ABC.  I just think this place needs to be a little more customer-ready and have a few more weeks to find its feet."}
{"text":"I come here mainly for the atomic dogs......plus they also have over 200 beer on tap. Music got it, friendly staff? Done it. What else is there to love a out this place?!!!"}
{"text":"This is my favorite bar in Ohio City. Good prices on the drinks, always good people there, and the food is AWESOME and its always made fresh to order. I've never had a bad experience here once."}
{"text":"Fun place and great drink selection. Staff is fast and polite for a hipster meca. But why do people ignore the horribly dirty kitchen ?!?!  I have worked both behind the bar and in the kitchen, and I can say I will not eat there. ( maybe fries) the grill and stove , by the looks, get scrubbed down maybe once a week. The walls are probably never cleaned. Maybe my standards are high, but please pay attention to the dirtieness next time. Or it might be the hip thing to do, what do I know.   Otherwise the place is cool!"}
{"text":"Great place for a drink and lunch . Burger and fries , hush puppies , and calamari is the best of them all."}
{"text":"My go-to on west 25th. The happy hours are killer. Colorful and random crowd, despite the uniformed cop that hangs out occasionally. The servers are great and don't waste your time.   Good beer selection, running the gamut from the very cheap to the fancy. The bar food is actually surprisingly good and pretty affordable; I've had the: - jerk chicken nachos, which were searing hot and delicious (though my friend was unimpressed, but she's had \"real\" jerk before). - the calamari, which was great. - the BBQ sandwich, not on the site but was definitely on their menu as of april 2013. Banging.   The jukebox is a welcome addition, seriously.   You will be irritated here if you despise potentially loud people with unnecessary tattoos and piercings and require clean bar bathrooms."}
{"text":"ABC Tavern was a happy mistake. I was in Cleveland for the holidays visiting my family and friends at the Garage Bar across the street. I had bought gloves and shanghaied someone's scarf and wondered what part of spending winter in Cleveland was a good idea. After drinking at the Garage Bar, my friend said, \"I'm hungry.\" She and I dumped our friends and texted them to meet us across the street at the ABC Tavern.  I won't go into the 1950 nudes in the back, the bowling machine, the upper area private area, or how my friend and I played \"Can You Spot the Lesbian,\" which I won, because the bi girl I spotted was used as the tie breaker.   What I will talk about was how my friends and I discovered two key things there. The first one was called Kentucky Bourbon Ale. I stopped drinking Christmas Ale that night (and who was the moron who started this lacing the rim with cinnamon? This is coming from a California guy and we're the ones who shove oranges into our beers), but I've digressed, and made new friends with the Kentucky Bourbon Ale and it gave me its number. I'm waiting three days to call, but I want to call it now. I texted Christmas Ale and said we have to see new people.   The second thing I discovered there was the Atomic Dog. I was drunk and hungry. If I smoked weed, I can only imagine how much tastier it would be. I even went back the next day sober to see if I was right and you know what, I was. Now close your eyes. Actually don't, you can't read the rest of it if you. Get someone to read the rest to you. Make it your mom. I'll wait.  Still waiting.  All right, close your eyes and imagine the best hot dog that you'll ever taste. It's big and juicy. It is the gayest experience in your mouth next to that one and only time your uncle babysat you and let you drink all those tasty wine coolers all night long. The hot dog is wrapped with bacon and the dogs are sliced, and inside are jalapeño peppers. I believe there is a hollandaise sauce on the hot dog. It's not just food, it's an explosion in your mouth."}
{"text":"DIVE BAR HEAVEN!  Jerk Chicken Nachos cravings are a real thing!"}
{"text":"Service was very slow and the waiter did not seem happy to be there. Came in for dinner with my parents and siblings while staying nearby. Food was okay, but menu left much to be desired."}
{"text":"A slow start. While waiting for someone to acknowledge our presence my expectations were not high.  Thankfully, we waited.  Once they got going the experience improve exponentially.Nick was our waiter/bartender.  The drinks were perfectly mixed and the food was surprisingly superb!  We're from out-of-town and only here due to a family member having surgery  @ UH. We'd like to find another opportunity to visit ABC before our departure! Job well done!"}
{"text":"Good venue if you just want to get a casual drink. The food though was nothing special, typical bar food. Ordered a hummus sandwich, not the best choice. The hummus was going every where. I should just go with hummus and pita bread rather than the sandwich."}
{"text":"Matt Rolin has a bad attitude and he can't cook a quesadilla for shit. He needs to go back to clown school. Also the tuba tartar here tastes like an old salty shoe. There's one bartender here who has a dreadlock for a beard, the magic beans you buy from him don't work.  ttfn"}
{"text":"This is by far one of my favorite places to hang out at when I'm in Ohio City.  I've yet to try the food, but have been here plenty of times for evening and late night drinks and it always has me coming back for more.    So it's just a bar that serves drinks - why do I like it so much you ask?  It's the vibe you get from this place.  The music, the people, the decor - it's all so eclectic and inviting that you can't help but love it.  Oh, and they have one of those old school bowling machines too.  Again - what's not to love?    Check out the tiny patio out front (if you're lucky enough to snag a seat!) or head out back for patio part 2, or just hang inside - either way you'll be totally content in this dive-y, yet super cool spot."}
{"text":"Good beer, food, smart lighting and volume management. Bathroom smelled like summer camp and not in a nostalgic sort of sense."}
{"text":"great bar to go to and the staff (bartenders) know their stock very well I asked what to do if I wanted to drink.beer with more flavor, and he knew exactly what I would like based off the first beer I had. And the owners are very friendly and blend in well with the crowd and excellent bar food"}
{"text":"This is my favorite bar in Cleveland. Black Label and PBR cheap. Great jukebox. Bar bowling. Diverse crowd. But what puts it head and shoulders above every other bar is the service. I've never been in this bar on a weekend when they did not have four bartenders working. On a crowded night, this makes all the difference. A credit to the owner and the staff. I've actually seen the bartenders flagging down patrons to get them a fresh drink. Unheard of."}
{"text":"I love this place and I wish I had come here sooner! This is a dark little bar with an amazing beer selection and a sweet happy hour (all day Wednesday I think) with great drink deals and food specials. The food is the best bar food I've ever had! I had the pork belly sandwich (yum), the shark bites (yum yum), and the chicken soup (yum). Apparently their chef was trained as a saucier so the soups and sauces are a must-try!!  The service is great here and full of personality! Really, nothing beats the price and selection of this place for beer. I can't wait till the new location opens. I'll probably be there everyday so I'll see you there!"}
{"text":"The interior is a bit bizarre and intentionally divey/old-looking for a new place. The beer specials and happy hours are great though and the bartenders are all friendly and helpful.  The burger is pretty solid, I always like to get the house chips with their sour cream dip. The shark bites are always a bit too salty for me."}
{"text":"This bar is like Cheers for the hipsters of Ohio City and it is awesome. I have never seen such beautiful, flowing hairstyles (and fantastic beards) in one establishment at one time. The bar staff is efficient and professional too. This is my new favorite hang out on W. 25th and I will be back!!  My review may seem overzealous, but is nonetheless sincere. ABC is great!"}
{"text":"A great \"local bar\" in Ohio City.   Great beer selection, great happy hour prices and the bartenders were very friendly. They were attentive and when asked to recommend a beer, they knew what they were talking about.   Did not try the food (that is the only reason for 4 stars and not 5), but it looked and smelled good.   Will definitely be back on our next trip to Ohio City."}
{"text":"Went here on a Friday night because Soho was too crowded.  Crowns and ginger were normal.  Hush puppies were bland but the sriracha aioli made up for it.  Jerk chicken nachos were too spicy for me to eat but my bf loved them.  This crowd is not my style.  Most people were under 26 and wearing clothes from Urban Outfitters.  It has a pretty good vibe despite the uniformed police officer on duty."}
{"text":"Are you allowed to say \"assholes\" on here? Most overrated hipster shithole in Cleveland. Food is considered \"edgy\" thanks to salt. Lots of it. Bartenders think they're in Williamsburg serving Ben affleck, when in fact they're just massive jerks on a power trip over your $3 in change."}
{"text":"Had fun! Good music! Good value for money!! The bartender was a nice guy but it was tough to get hold of him, they could do with more bartenders!"}
{"text":"Unlike it's more pretentious neighbors on West 25th, where people's goal is to go and be seen, ABC makes no apologies for being the rebel bar where young, old, black, white, gay and straight can leave their home with whatever they have on to go have a great time without breaking the bank.  Dive bar distractions like pool, bowling, smoking patios and an old school jukebox are here to siphon away the dollar bills and quarters but the star of the show is the beer selection.  If they don't have something you like, then you probably don't like beer.    About the highest compliment I can give is how impressed I am by the bartenders.  As a bartender myself, I know how stressful it can be when your bar is crammed five deep and everyone of them is competing to see if they can be more obnoxious than the next.  Despite this, I've never had a problem getting a drink in a timely fashion and I've rarely, if ever, seen the staff show any signs of stress.  I personally have been joined at ABC by friends whom I thought could hang with my drinking ability, only for them to turn into \"that guy\" who causes embarrassing situations.  Despite their buffoonery the staff remains patient and dare I say amused when other bars wouldn't hesitate to kick them out."}
{"text":"The last place on w 25th where on a Thursday you won't be over run by the people who got bored of w 6th/9th but think they are still there.   they have a pretty damn good beer list, limited on draft but good stuff in bottles. the prices are average to high ($3.50-7.00+ depending). the lamb quesadilla is fantastic and a great value at $6.75. happy hour twice a night, i think 4-7 and then 10-12 mon-fri. a cheap pool table, free darts, old school bowling, flat screens with sports, and super friendly bartenders who are more than willing to chat with you. overall a great bar."}
{"text":"I was looking for a spot in Cleveland to host a party for my husbands 30th and every place just wanted me to rent a table. It was a small group, like 15 people max and I didn't want it to cost an arm and a leg. ABC taverns upstairs space was perfect for a surprise - private with a pool table, tv, seating & even a nook where I made a homemade photo booth. The staff was attentive all night, we ordered a bunch of delicious appetizers and watched the buckeye game all evening. Can't thank them enough!"}
{"text":"good beer selection, awesome staff, nice interior. wish it had a bigger patio type jam because it's summer and i want to be outside, but that's no detriment really.   we stole someone's nachos that they invited us to share, they were delicious. i highly recommend those.   crazy clientele the night we were there - a lot of may december romances and really dressed up babes, but that just made it funnier to be there so that's probably a plus to me.   i'd go back."}
{"text":"Love this spot. It always rocking. A nice mixture of people, showing what a melting pot Cleveland is. If you want a little bit of privacy they have an upstairs area that overlooks the whole bar with a pool table, pin ball machine and TVs to watch all you Cleveland sports. Bartenders are all very attentive and courteous. They offer a great happy hour mon thru friday until 9pm! Fresh cut french fries are always a plus and you definitely have to order the jamaican jerk chicken nachos. The only reason im deducting one star is because the pricing changed. I stopped up twice in one week. First time when I ordered a shot of jack it was rung up at $4 but then my next visit it was $5.50 Maybe it was new staff?...  Regardless, it won't stop me from coming up to devour those nachos."}
{"text":"I had been wanting to come here ever since I saw them on a food network show and even moreso once I got online and saw they had shark on the menu. I was not disappointed one single bit. I started off with the shark bites and they were absolutely delicious. The tarter sauce they came with was good enough to drink even though it had capers in it. Which I'm not a big fan of. For my meal I got the pork belly blt. Again, it was delicious. My friend got the atomic dog and it was hands down, the best dog I've ever had. The hand made fries are like a drug you can't get enough of either. Needless to say I will definitely be coming back and can't wait to try the blackened  shark sandwich and eat some more of the fries."}
{"text":"I have never written a yelp review before. In fact, I don't have a yelp account. I'm currently utilizing a friend's account to express some praise. ABC Tavern has some incredible limes. I'm talking 10/10 rating limes. I really appreciate it.     2/23/18 Here again, limes are still fantastic. It's not even lime season, but here we are, thriving and surviving."}
{"text":"Bartenders on point. Fantastic food if your looking for a quick bite. Hands down a great bar to go to. Definitely a break from all the fo hawks at the rest of the 25th street joints. Worth the visit"}
{"text":"great bartenders amazing food (try the abc burger) always a great beer selection sometimes a very different/inconsistent crowd  still my favorite in Ohio City!! 4.5 stars"}
{"text":"I love Ohio City but this bar can be extremely busy at night. The atmosphere is fun because the bar is so big but often times its hard to get a drink or move around. They have a unique basement and fun patio so I recommend going there. Overall, lots of fun just make sure you get a good spot or else you'll be the one saying \"excuse me\" \"sorry, trying to get through\"."}
{"text":"Was there with a group during the Brite Winter festival.  Bartenders less than friendly.  Long line for the bathroom.  Mediocre beer selection.  Hopefully I'll never be back."}
{"text":"I really enjoyed this dive. Cara hosted a great happy hour (and I got me some fingerless gloves, woohoo!). They have a really long bottled beer list and I got my favorite (Left Hand Milk Stout). As per the other reviews, the staff is incredibly nice and helpful.  They have an old-school bowling game at the front and a pretty large area upstairs for gatherings. The main area is spacious and was adorned nicely with Christmas lights and a cute tree.  I have heard great things about the food and I hope that I will get an opportunity to try it next time!"}
{"text":"For bar food, ABC is amongst the elite. Seriously, the best nachos I've ever had. Pineapple, parsley fraische, absolutely deliscious. Calamari ranks about the same. Service is on point too."}
{"text":"Hi I like this bar it's nice when I go in the atmosphere is great I don't drink but I go in there for the food and the hamburgers are fantastic fish on Fridays are real good the people here that work there are very nice I'm in a wheelchair and take good care of me thank you"}
{"text":"I'd only ever been here for late night drinks until a few weeks ago. As far as the bar and its service goes, this place is pretty average and gets incredibly packed, so be careful. They quit serving PBR for whatever reason. Perhaps not having PBR is the new hipster? (kidding, folks. PBR will continue to be the hipster standard, I'm sure.)   Now, the food. My boyfriend likes the atomic dogs, which sounded good to me, until I realized how massive it is and got scared. Instead, I got a burger, which was incredible! This burger was cooked on par with B Spot's and the greasiness made it even better! Fries were delicious and much like \"fair fries\" (grease), and when covered in malt vinegar, they are even better! Overall, it was a surprisingly superb meal, grease and all.   I must say, when ordering I was torn between the burger and pretty much everything else. The menu is diverse and tantalizing, though small."}
{"text":"Made up to look like an old dive bar, this place has and impressive beer selection and the menu,  though small, boasts some pretty good eats!"}
{"text":"I couldn't be more excited about this place opening! It's a VERY short walk from my apartment which could bode well for them, but not so much for me...  Everything is consistent with what I've experienced at the W. 25th location, but better (because it's in walking distance and I don't feel the need to hold back...wow, I'm sounding like a lush now). I really prefer the open space and the windows all around. It just feels like a great summer spot, with the doors open and the friendly bartenders.   The food is good. I really like the burger and that's what I get every time I go to W. 25th, so I went for it at this location. Consistent, though I must say, there seemed to be less grease here, which is overall a good thing because I got a little more burger \"crunch\" on those thinner edges. Also worth checking out are the homemade potato chips. They're quite the treat and a nice starchy snack that's a welcome change from the typical bar fries.   The beer selection is fantastic (no surprise, considering the loads of options they have at the original location) and I'm always happy to find some of my favorite brews on their lengthy list. This is also a good place to try something new (happy hours run long and the specials are worth it). The staff is usually pretty helpful and happy to aid in decisions. Worth noting, as well, is that they run specials on different beer combos and amounts, as well as unique food selections--just ask and you shall receive the rundown with a little backstory, too, if you're nice enough!   Overall, GO HERE. Have a good time and chat it up with the staff. They're good people and this is a great establishment."}
{"text":"One of the cheapest places to drink on 25th. I almost always stop in here to begin my night out in OC. Great drink prices and Sundays are all-day happy hours I believe. Has that dive-bar feel too it which there is nothing wrong with in my book.  The food is tasty too. Had a shark sandwich here once and my, was it good."}
{"text":"I REALLY liked this place.  The area (street) has a few good place, but this was definitely my style.  Laid back, cool and good conversation.  Little nooks to enjoy yourself.  I would love to visit again!  (I visited last Aug, 2013, just cleaning up my draft reviews, I reckon I had hoped to ad photos)."}
{"text":"This was my first experience with a Cleveland bar, and it did not disappoint. I have been back countless times, and I will continue to go back.   To start, ABC is in a great area, surrounded by Case Western housing, Chipotle, Mitchells, and a ton of other food places. (University Circle has apparently come a long, long way in the past couple years.) But the great part about it is ABC is good even without its neighbors. I'll drive across town just to go to ABC. Hell, I have a friend that does drive from the west side just to go to ABC!  One of the things I appreciate the most is the authenticity of the bartenders here. They're all chill, nice, talkative people that know how to have fun and aren't afraid to give you a hard time either.   The drinks are delicious, many of the bartenders like to create their own concoctions for you to try, and the food is actually pretty fantastic for pub food. The atomic dog is my favorite, and I have been known to order it even after I've already had a full dinner. Oops."}
{"text":"I have to give 2 stars because of the food. They do have great bartenders and great beer but the food is just terrible. I went to the place yesterday to grab something to eat before I went out saturday night and ended up getting food poisoning.  Tried their greasy homemade chips and the extremely greasy pork blt and half an hour later, i had to rush home because I knew something was wrong. I started throwing up nonstop. The worst food I have ever tasted and the first time I ever had to throw up all night because of food. Ruined my saturday night and I mean I don't want nobody to go through what I had to go through to get this nasty food out of my system.  Hands down, the worst greasy food ever..."}
{"text":"Stopped into ABC the Tavern while staying at the Courtyard Marriott around the corner while in Cleveland on business.  Immediately upon sitting at the bar I was greeted by a very friendly bartender that made an awesome recommendation for an IPA.  Although no IPAs are on tap, the canned IPA from New York was superb.  Great beer selection overall.  Bartender also recommended the Atomic Dog which was \"off the charts\" delicious.  Will definitely stop in again when I am in town."}
{"text":"Excellent bottled beer selection -- the best in the area. The food menu is a bit limited, but the chicken nachos and the pulled chicken sandwich are excellent."}
{"text":"ABC is an awesome local bar. They have great food, cheap beer and an upstairs pool table.  I love their burgers, currently their special burger is a roman burger knock off which is even better than Mr. Hero's. It has a fresh made patty, grilled salami, cheese and veggies. Its served with fresh cut 'frites' AKA thin fries."}
{"text":"ABC is my favorite dive bar in the area!  First of all the service is on point.The bartenders and servers are always eager to help you no matter how busy they might be.  The drink prices are unbeatable!  We are always surprisingly happy when our bill comes because it's so cheap.  You can easily get drunk here for under $20 lol.  They also have a great selection for happy hour which is Mon-Fri 4-9 and Sunday 12-9.  I was also pleasantly surprised how good the food is here.  Most dive bars have really crappy frozen food they just throw in the frier, but not ABC!  I ordered the Pork belly BLT which came with fries, and man was it delish!  The pork belly was perfectly salty and cooked to perfection and only $9!  All sandwiches are served with a nice helping of hand cut fries.  Yes they actually make there own fries which are some of the best in the area!  One of my friends had the lamb quesadilla and he raved about how tasty it was.  I believed him because his food was gone when I was just starting to eat mine lol.  BTW the kitchen is open till 2am which is great for when you get those late night drunkin munchies lol.  ABC is also great for people watching because they attract people from all walks of life!   If you're looking for a place to chill, have some cheap drinks and decent food, go check this place out!  You and your wallet will thank me later :D"}
{"text":"Been here a few times, most recently last week. I was contemplating a review and a question arose: is this really a dive bar? It's kinda dirty and dark, some of the barkeeps and patrons look like they don't have great hygiene(people like this can be found in any of the trendy areas), but do dive bars serve semi- eclectic food and have a vast beer list? Well, I grew up on the mean streets of Parma, and know what a dive bar is and isn't. Check out The Last Stop Inn, Red Circle, Alimony Jack's, Characters, Lincoln Inn, Bamboozles... pretty much any corner in Parma. Those are real, true dives. ABC is a quasi- dive and far too pretentious to really qualify. That said, I like the place for what it is... a bar with a good selection of craft beer that I visit when bored with the other local haunts."}
{"text":"Nice neighborhood bar, but on a really trendy street. Always a friendly staff. The crowd is laid back and nice too, always easy to socialize with ppl. A little heavy on the pour though ;)"}
{"text":"Can you day Atomic Dog? Wrapped in bacon, stuffed with jalapeño peppers- a must try.  Had my first recenlty and I am hooked.  Thanks to Linda and Randy for the rebirth.  What was a nothing special neighborhood bar is now a trendy vibrant little hang out."}
{"text":"excellent selection of beers and the jerk nachos were terrific. We sat at the bar and the bartender dude was really funny and nice. I would go back in a second. This place is a cool spot."}
{"text":"Okay, let me start by saying I'm not a \"bar guy\". I don't drink regularly, but when I do go for a beer and some conversation, I like a place that feels...comfy.  ABC the Tavern near Case Western Reserve University  is that old, semi-worn couch of a bar that you love to go to just relax a bit, talk, and have a drink and some solid food that will definitely satisfy. The place  has personality to spare. I'm not sure where they got the actual, physical bar at, but it looks to be quite old and classic looking. The place has a worn look to it already, even though it has not, as far as I know, physically been there that long.   HOWEVER, you'd never know it hadn't been there forever. It is a bit loud, but the company and the conversation are good all around.   The drinks are decent and diverse, and the food, which is anything but typical, includes a Shark Sandwich, The bacon wrapped, jalapeno-stuffed Atomic Dog, and there's even selections for the vegetarian like the Hummus/Cucumber club sandwich and a Filet of Tofu.   Another funny element; when your order is up at the kitchen window, the cook, who appeared to be one of the toughest ladies I've ever seen, rings a full gong...so if you have a nervous condition, eh, you might want to sit as far from that as possible:) For everyone else, you will be VERY AWAKE when your food comes:)  (BTW, let me qualify this; the cooks at this place are awesome, toughness and all. This is not just bar food, it's EXCEPTIONAL bar food! :)  Another difficulty, which is found ALL OVER University Circle, is the parking...or lack thereof. There are numerous garages in the area, including a close one on Ford and some parking behind the buildings on Euclid, but  it's still tight no matter where you try to bivouac your vehicle.   I'm also sure that, due to proximity, this place was created to cater a lot to the CWRU populace, but if you care to come down, it's a nice little spot for some animated conversation, some good food, and a great place to re-learn your A-B-C's:)"}
{"text":"Awesome hole in the wall in a great location.  The staff is cool and sociable.  Jukebox is killer.  Drinks are great.  If you have $5 Bloody Mary's, then I'm a fan!  Nothing bad to say about this place."}
{"text":"The bartenders here are hipster AF and don't know how to run a real business. They're oblivious to all things around them and could care less that your trying to order a drink. That being said the bowling game alone is worth going here."}
{"text":"This place is divey, has a good selection, and has good food at a great price. What more can you ask for in Ohio City?  They'll have any type of beer you're looking for. A smaller menu with standard and not-so-standard bar foods on it. The staff was very friendly and attentive.   Outside of the pinball machine not working, I will definitely be going again!"}
{"text":"Stopped into ABC Tavern in an attempt to satisfy a nacho craving that had developed.  At the suggestion from a fellow yelper I decided to try the Jerk Chicken Nachos.  Final verdict on the nachos - interesting.  The \"nachos\" at ABC start off as any plate of nachos should with house made tortilla chips fried to crispy crunchy perfection.  The jerk chicken was tender and moist, but there was a certain sweetness to the spice that was a bit off-putting.    When the word \"jerk\" appears in the description I expect there to be some heat behind it because....that's what jerk seasoning is supposed to do.  These nachos are also topped off with creme fraiche.  Maybe it's just me, but I'd rather have REAL sour cream.  Again, back to my verdict of \"interesting\".  I didn't hate this dish, but I didn't fall in love with it.  It's one of those things that I would be happy to eat a bite or two, and then move on to something else.  As far as the rest of the bar goes....I really like this place.  It has a real \"old bar\" feeling to it.  The woodwork has been around for a while, and probably has seem some amazing things during its days.  There is a decent amount of craft beers available include Bell's Two-Hearted Ale.  The service was fast and attentive, and was quick to make suggestions when and where needed.  Final verdict as a neighborhood bar - Great!"}
{"text":"I have some pros and cons with this bar, but the biggest pro is the 4-9 happy hour! Not many places have a five hour happy hour and the drinks were just the right ratio. The bartender was nice and we never had to wait at the bar too long. I tried the burger and fries and the fries were delicious, burger was fine - nothing amazing but satisfied a craving! They also have bar bowling, a pool table, etc so it's nice if you have people who want something to do besides stand and drink.  The cons are the size - it's long but pretty narrow so it feels crowded quickly. It also has a crowd that could be both a pro and a con depending on what you like, ie there's a combo of hipsters, \"bros\", older people, etc so if you like a variety it's nice but if you're anti hipster, it might not be the place for you.  Overall, good local bar with nicely priced, tasty drinks!"}
{"text":"Ok. So my first time here. Local \"shot and a beer\" kind of place. Good friends with me. 15 minutes after eating, it became a \"shit and a barf\" kind of place. Food poisoning never hit me so fast. And I got to pay $20.00 for the experience. BONUS: Only 1 restroom for each gender; both filthy. Toilets barely flush!!  Guess I'll take my business elsewhere ."}
{"text":"was craving a burger so dropped by. no frills, solid burger. having sriracha was helpful. great beer selection in cans and bottles."}
{"text":"After eating elsewhere on 25th we all decided to come here for more of the bar atmosphere rather than a restaurant with a bar kinda deal. They have a pool table upstairs and a south park pinball machine that works. I'd like to go back sometime and try some food."}
{"text":"Looking for a not crowded place to watch Sunday football? And want happy hour while you watch? And a delicious BBQ pulled chicken sandwich? And bowling when you're done? Well, you've found your place. If you're on campus and looking for an alternative to the Scholar, you definitely want to check out ABC. Go for street parking on Sunday's if you're watching the game, or there's a metered lot in back."}
{"text":"This hole in the wall makes for a good escape...  THE UP-SIDE: No pretensions here.  Just a corner bar type place.  A nice place to pop into when you're tired of the craziness of the  \"Garage\" across the street.  THE DOWN-SIDE:  This place is a hole.  You only come here to sit and have cheap beer.  THE SUM-IT-UP:  At times, this place beats the other Ohio City bars, hands down.  Go here to escape."}
{"text":"Pretty average bar.  Good, solid drinks and interesting \"decor\".  Seems to me like ABC is a good place to grab a few drinks (for cheap) before moving on to whatever your main destination is for the night."}
{"text":"Pretty solid bar.   I'm a fan of older bars with character and ABC Tavern definitely has plenty of it. Great atmosphere. Nice beer selection. Amazingly fast and friendly service. Last Friday evening it was packed and you never waited more than a few minutes for a drink.   Food is okay. I had shark bites on my first visit. I don't think I'm a fan of shark -- too fishy tasting.   I like the upstairs thing they have going on.... although when you're downstairs it can feel a bit awkward and you think that the dudes up there are looking down your shirt."}
{"text":"My first endeavor to a Cleveland dive. Pretty average looking place. Cheap beer. That kept us happy. I ordered the pork belly BLT from the kitchen. Pretty good, greasy sandwich. Went perfect with the cheap beer. Staff was OK. It took a while for my food to come out because they were really busy and the guy I ordered from looked flustered. People were getting food before me even though they ordered well after I did. All in all, good place to chill."}
{"text":"I visited abc on a Wednesday night for happy hour. The atmosphere is incredibly relaxed. We sat ourselves on the back patio, and I was delighted that I wasn't assaulted by overly loud music. The place was peaceful despite being busy.   The happy hour specials were excellent, and the staff, though I didn't interact extensively with them, were pleasant and helpful. Our group also got some French fries which were crispy and delicious.  I must add: I love the casual patio ambience; it's set up with mainly picnic tables, which goes a long way in encouraging that \"sit wherever you like\" atmosphere that I find very welcoming.   I would gladly return here for a cocktail or beer, and I look forward to seeing changes in the menu as this place evolves. We had a great time."}
{"text":"What a cool place! I'm not a huge beer-person, but when I told the bartender I wanted one that \"didn't already taste like I'd thrown it up,\" he knew exactly what I meant and brought me one that I really liked! And even better, it was during happy hour so it was only $1.50! Then it really tasted like the perfect beer!   They also have shark on the menu, so now I can check that off from my bucket list. The outside seating is also really nice and you get a great view of the MOCA."}
{"text":"Service was inept. We sat outside on the patio and no one noticed us, and it took me going inside 3 separate times to ask the bartender to send a server before someone came out. Then after we ordered, the server came back 5 minutes later and asked everyone to confirm their order because he clearly forgot and had not yet put it in.  They had a happy hour beer menu but more than half the beers were sold out...so cross it off or reprint the menu.  Food was typical bar fare, nothing special. Atomic Dog was really good. Tacos were weak."}
{"text":"Large selection of beer/booze, great menu, friendly staff--they have it all. Prices are very reasonable as well.  Try: - Lamb quesadilla  - Chicken quesadilla  - Any of the specials (they're always awesome)"}
{"text":"Waaay too crowded but if you hit it at the right time and get a table pick up a couple IPAs and the jerk chicken nachos."}
{"text":"If you are looking for a casual environment to enjoy Happy Hour, look no further.   ABC has some really good deals on beers, and even well drinks during their extended happy hour...hours. Personally I will get either the $2.50 Labatt Blue, or a $3 well drink. For the adventurous, they offer $1.50 beers, but they are not really my speed (Stroh's, etc.).  The bartenders are really laid back and friendly which caters to the crowd of students. They are always helpful and are prompt to take your order.  Be sure to play the arcade bowling \"alley\" they have. Its pretty fun and can accommodate up to 6 players, which makes for some good friendly competition.  They have a broad range of food to order from as well. Staples of my friend's and my diets include the surprisingly sweet and juicy Jamaican Jerk chicken nachos, and the zesty lamb quesadilla. I've heard great things about the spicy Atomic Dog and for the SUPER BOLD customers: Try one of the 2 shark dishes. Yes, I said Shark....in Cleveland!"}
{"text":"It's not exactly dark and dank anymore, but definitely not West 6th Sleek. They are armed with a pool table, a dart board, and a bowling machine.  And possibly the best jukebox in Cleveland.   The food is...well, food. It's not bad, not exactly earth shattering...BUT, it's kind of fun to watch the guy make it for you, which he does, enthusiastically (there's an old serving window from which you can spy). He'll even talk to you while busy with his work. And it's all well-priced. Saves you money for the beer and drinks.  And they have a lot of beer and drinks. They have the Brooklyn-ish buck fifty PBR in a can, all the way to the Christmas ales and several other imports and exports.  Given the crowds that I've seen there, this place isn't exactly a secret...but the crowd is fun and diverse. I got into a fun conversation with the gal who owns the building (and the previous owner of the bar). Nice gal.  4 stars for the great beer selection at good prices, the pool table, jukebox and bowling machine."}
{"text":"i haven't been here much but i am fond of it. large selection of beer. good selection of vegetarian options. dogfish head battered tofu sandwich? uh yeah i'm totally in on that.. hush puppies are yummy too. this place is a relief from the ridiculous crowd across the street at the yuppy hipster places."}
{"text":"The best fish tacos I have ever had. Nice staff. Jason and the female bartender were great. If you are on the west side you should drop in."}
{"text":"I've been going to ABC tavern for three years now it's a small nice little bar to hang out at. I work across the street at the hospital so when I get off me and the buddies will go have a few drinks sometimes it's very convenient for us guys. Staff is very nice and friendly. Sometime they run out of drinks so you have to just go with what that have. I give Abc 4 stars"}
{"text":"Got the atomic dog (upon recommendation) and a sierra nevada Fairly priced meal and drink (a great selection too!) Hot dog was decent, spicy, but nothing to die for.  Service was friendly and helpful Pretty typical college bar  drink selection/price: 4.5/5 food: 3/5 decor: 2/5 service: 4/5 atmosphere: 3/5  Could use some more wall decor or something, with the relatively barren black walls, it felt a little dead. We came here on a Friday night because Washington Place and their friday burger deal was too packed. At least the drinks are cheaper here, will be back to try more menu items and drinks"}
{"text":"All night happy hour on Wednesdays!  The beer list is huge, sometimes you can get an expensive beer for really cheap if they are trying to deplete stock, and the food is usually spot on for a dive bar. The food is not greasy fried fare and microwaved snacks from--this stuff is a cut above.  It's no Lolita, but it's damn good for a divey bar.  Also, they have a bowling machine.  A bowling machine!  The service don't suck either.  Actually, the service is great.  This is the kind of place one could make their home base.  It's got a good and comfortable crowd through the week, and the weekends are packed with all sorts of folks.  The crowd is always a mix of many different types.  I've seen business folk, hipsters, hip-hop dudes, and so on.  That makes the jukebox play the perfect mix of everything awesome.  ABC is full of awesome."}
{"text":"i normally have a decent time here but the one bartender with the ring in her nose had a bad attitude and didn't want to wait on my party."}
{"text":"I gave up long ago the notion that I was hip, cool or otherwise part of the \"in crowd\" and when I turned 40 I finally started to feel comfortable in my adult skin. So what does this mean for a review of ABC the Tavern? For me, this place is an adult bar, designed by adults for adults and for grown-up enjoyment. This review marks my first visit and, based on my inaugural experience, will lead to many more.  I don't recall the exact date or time of our visit, but it was probably on a Thursday sometime around 6pm. Only a few folks were there, mostly at the bar, with the perfectly volume-appropriate background music filling the rest of the space.  ABC is dark, dank and dive-y in just the proper proportions. Our seats at the bar seemed made for us and the bartender, friendly but not artificially so, quickly took our drink orders and brought us menus. That's right, they serve food, too.  Speaking of food, it's good, cheap bar food. No pretention, no frills. We're talking food that goes great with beer - fries, burger, hot dog, nachos - but we're also talking some food items you might not expect from a place of ABC's ilk - tofu sandwich, red pepper hummus, lamb quesadilla.  The hush puppies, hell yes. A basket of fried-to-golden cornbread balls and a side of Sriracha mayo for dipping. I could eat these all day. And the burger was simple and delicious. It reminded me of a 4th of July picnic. The toppings were fresh and crispy and the meat cooked a perfect medium. Their fries are those thick-cut, skin on variety that go perfectly with a side of malt vinager mayo for dipping.  The beer list here is pretty damn impressive as well. As a certified beer geek (no, really, cicerone.org says so) I love to see a solid craft beer offering from little joints like ABC. They may not have a huge draught selection - 8, if memory serves - but what they do have is solid. Troegs, Oskar Blues, Breckenridge, Southern Tier, Left Hand and a couple locals (Fat Head's and GLBC) complemented by a large bottled/canned selection. I had no trouble finding something both interesting and delicious.  I'm not sure if the way I experienced ABC was typical or if it was the result of some perfect confluence of space-time rift phenomena, but I really liked it. It wasn't too loud, I could actually have a conversation with my wife without leaving inflamed vocal chords, the bartender was friendly and knowledgable, the food was tasty and very reasonably priced and the beer list was right up my alley...hell, for me it was the full package."}
{"text":"We wanted to grab lunch quickly somewhere and we decided to give ABC Tavern in Upton a try!   I ordered the Atomic Dog, and was hesitant at first to how spicy it was going to be, but upon asking the server, he reassured me that it wasn't as spicy as I had in mind. My food out came out quickly and after taking the first bite of my hotdog, it was indeed spicy but that was the spiciest part throughout my whole meal. The bacon wrapped around the hotdog was a genius idea and with a kick from the cut up jalapeño stuffed in the hotdog, it was perfect!! So many textures coming together, it was delicious. The French fries which came as a side were fresh and paired well with the Atomic Dog!   Aside from all the positive comments above, I only reviewed ABC Tavern with 3 stars as it was a typical bar and had nothing super special about it. However, it also wasn't a bad spot for food."}
{"text":"Some of the worst service. Came in at 12 am, bar was dead and had two bartenders that were the absolute worst. Waited 20 mins for a drink and got an attitude from the girl bartender with purple hair. Def won't be back again."}
{"text":"Fun bar with a hipster vibe. Weird,cramped bathroom that feels like a trailer."}
{"text":"Oh, baby give me one more chance. Won't you please let me back in ABC - the Tavern.  I don't like giving a mediocre review to a place that has hosted Yelp events, but I have to be honest, and I always am. It's not as easy as 1, 2, 3 to decide what to rate them, so I'll give them a 3 for effort and the young cute people that hang out here, and hosting Yelp events. But I've found the drinks to be overpriced, the coke (I usually just drink coke) was really weird and watered down, and the food was mediocre. I've been here 3 times now (once for a Yelp event), and I have yet to be see anything that allows me to give it more than a 3.  Now you'd better stop, the love you save may be your own."}
{"text":"Very fun place. The Jerk Chicken Nachos are the best. Surprisingly good!  Atmosphere is very fun and VERY casual. If you like dive bars and good food, this is your place."}
{"text":"This is a great little dive bar. It's not cute or clean looking really (it may be clean though). The best and most important thing you need to know is that happy hour it $3 shots till 9pm. If that wasn't enough info about a dive bar I don't know what your looking for. They sell shark or something like that."}
{"text":"I'm starting to think that divey pubs with unexpectedly divine bar food is a Cleveland's expertise.   No, I'm serious. ABC Tavern nails bar food. Not just any old greasy grub though. This is borderline gastropub faire with unique, delicious twists and a hot-damn-that's-cheap price tag.   For instance, you can grab something traditional like a fresh, juicy hamburger or something a little different like a lamb quesadilla with cucumber sauce. All of the menu is made from ingredients fresh from the West Side Market too, which is just the icing on the cake (or the ketchup on the fries).  A large and vast brew selection doesn't hurt my love for ABC either. From cheap domestics and throwbacks to pricey imports and micros, they'll most likely have whatever you're looking for. And with fast, friendly and talkative service to boot? Someone calls Wayne's World 'cause I feel a \"schwing\" coming on!   Lastly, like many other bars in C-Town, ABC Tavern certainly isn't lacking in the atmosphere department. You can tell it's got history coming out its butt, plus some to spare. Old-school bar bowling? Check! Room for a private party upstairs? Oh yeah, they've got that too. My only issue came from not realizing how loud those damn bowling machines actually are-- especially when played by drunk people who are trying to throw the ball through the thing. Yikes.  Added bonus? This bar runs on a jukebox, people! I love that kind of vibe in a smaller bar, so don't forget to bring your dolla-dolla bills, y'all!"}
{"text":"Hate on the \"crowd\" if you will, but really--are you there to scope the people around you or enjoy some drinks and delicious food?   If you'd answered \"to scope the people\", you're doing it wrong.   So... why 5 stars?   Well, reason #1: the burger.   Reason #2: We came in on a Monday night after a Yelp event at MOCA Cleveland. It was a slow night at ABC and we wanted to sit on the patio, with service. They were limited with their servers and about to transition from one shift to another. Instead of giving us a hard time about serving us outside, the gent at the bar made it work. He came out to serve us, which he wasn't really supposed to do, plus he joked and laughed with us. That's right... he even chuckled at my Dad's silly puns and uncomfortable comments.   The food was great, just like the original location. No complaints whatsoever.   Get over the crowd difference and just enjoy this place for what it is: unpretentious great food and drink."}
{"text":"Jerk nachos are unbelievable! Get them. This place has a lot of beer choices and is a solid place."}
{"text":"This is my go to bar. They have amazing jerk nachos. I like to ask to sub the chips for French fries. It is an extremely hearty portion and is definitely worth the price. Happy hour goes until 8pm every day of the week. Well drinks 3bucks and servers and cooks work together to make the best experience.  Daily specials change but all are worthy for a sample."}
{"text":"Very average place, but what gave it the extra star... The nachos... Ugh I'd sell my best friends sister for those nachos"}
{"text":"Once the ABC was revamped and remodeled, we loved it... it was a fun little spot with decent service and with an overall good vibe.  That quickly changed on one night... long story short, someone slipped stuff into drinks... and thankfully knowing I was not feeling well, I took a cab home...   Ladies, beware if you are in this place and if you are there, guard your drinks like a hawk!  You can have a much better and safer experience elsewhere."}
{"text":"Went here on a Saturday night. Great selection of beer and a cool menu. Just got an appetizer and a couple beers. The service was great. Nice, friendly and attentive. The hush puppies were amazing, the sriracha dipping sauce on the side was really good too. Will be back for sure."}
{"text":"Happy hour is for drinks only had lasts the majority of the day.  They have certain beer at 1.50.  The fries are over cooked, soggy and oily not crispy.  The lamb quesadilla was just ground lamb pita sandwich.  Its bar food done average.  But they have a great patio and being so conveniently located in University circle I'll probably be back.  They don't have free parking.  Its an easy walk though for students and Uh employees.  Others enjoyed the atomic dog and chicken nachos."}
{"text":"Really great drinks, friendly bar tenders. Didn't have any food but it looked pretty amazing. The bathrooms were a little crazy but that seemed hipster purposeful. If I lived in Ohio city I would make that my go to bar. Super interesting atmosphere."}
{"text":"I don't get to Cleveland much, but I'm glad I got to ABC the Tavern last time I was there.  Our group of four enjoyed a pre-dinner drink and some shared apps before visiting the Black Pig (another Ohio City gem), then two of us went back after dinner for another drink.  It was bloody Marys all around for us, and they were spicy-licious - best I've had in a while.   Service was fine, especially considering how packed the place was. And the people watching was great."}
{"text":"I had never been in the ABC tavern before it was redone.  But I love this new not-so-dark and dank interior.  They have a good beer selection (although to be honest I usually stick with the cheap wimpy beers such as PBR or Miller Lite).   The food, though, is a step up above normal dive food.  With all their ingredients coming from the Westside market, they have some pretty solid food items.  The pork belly sandwich contains thick cuts of crispy bacon and comes with thin delicious fries.  My friends and I shared an atomic dog.  A huge jumbo hot dog stuffed with jalepenos and then wrapped in bacon.  Wow.  It was ridiculously good but there was no way I could have eaten the whole thing without a guilt trip following. The decor is bordering on dive but is still very comfortable and well-lit.  The music comes from Pandora and has varied from 80's ballads to 90's pop rock the times I have been there.  The clientele is nice, if not bordering on too nice as we had more than one person feel it was appropriate join in our conversation without being asked.  Overall, the place is comfortable and a great place to just chill."}
{"text":"Cool place. Nice beer selection, although you should definitely go for one of their happy hour times as they were a bit pricey outside of those time slots. Didn't get any food this time, but plan to go back and try the tofu fillet sandwich and the hummus (both of which are reportedly vegan). The bar bowling was pretty fun also, only a quarter to play. The back patio was smokey as I walked through it, but I guess you'll have that."}
{"text":"The atomic dog, is legit off the charts delicious! Everything you could possibly want, wrapped into one bacon wrapped stuffed hotdog. What?!! The hush puppies were incredible as well.   The bar itself was awesome! It was exactly what I expected, hidden, loud and a bit rough.   The bar staff was super nice and on point with everything. I can't wait to go back for another atomic dog."}
{"text":"This place is still full of sweaty shitty hipsters. For all the \"change\" and \"revitalization\" Cleveland \"has been going through\", ABC hasn't changed one bit. The guy with the beard dread is still here but IDK why, he obviously doesn't work here and he is SO LOUD. Also they only play ska but that's okay because my favorite band is Reel Big Fish.   Anyways, I'm super down with their Italian fusion menu. Three meat Italian quesadilla was DOPE."}
{"text":"Best gotdamn burger I've ever eaten. Forgot all about toppings until tha last bite. Omg, damn. That Burger was good. Gorgeous Bartender too. 100. Must have."}
{"text":"I have to give this unpretentious tavern a hearty thumb's-up, and have enjoyed its many benefits over the past year.  This is the most recent addition to a trio of similarly-structured local establishments: ABC the Tavern on West 25th (Original), the XYZ Tavern in the Detroit-Shoreway Neighborhood, and now 'ABC II: Uptown', if you will.    Why do I appreciate this place?  I love the 'dive bar' feel with a true 'inside' that harbors an excellent kitchen serving up affordable yet tasty fare.  This qualifies it as a true gastropub - and yet it never touts such a moniker.  The staff here is another bonus.  From manager-bartenders Trace and Nick to bartenders Jessica, Monset, Rob, Eric, Zach, and Miles - everyone is friendly and attentive.  Franco, Chris and Joe keep it real and authentic in terms of very affordable, high quality grub that goes far beyond the typical tavern.   Case in point:  one can select from everything from Shark Sandwich to Pork Belly BLT to Lamb Quesadilla to the infamous Atomic Dog - one heck of hot dog stuffed with Jalapeno and stuffed with bacon - here at the ABC.  Franco's soups - from tomato bisque to gumbo to even a vegetarian Ethiopian are savory and part of the fun here is catching new specials posted on their chalkboard.  When a food order is ready you hear the splash of a drum cymbal hit - appropriately - with a drumstick.  This is another touch that has seemed to irk some Yelpers but I feel it is all part of the unique signature of ABC.  The beer selection here is impressive and for those who may complain about the occasional $8 entry - you have to appreciate the quality and rarity of some of these craft beers.  Key craft mainstays like Two Brothers, Dogfish Head, Rogue and Stone are all present in full force - and yet there is robust representation from local up-and-comers like Hoppin' Frog (Akron) as well.  The bar features two happy hours (4-7 and 10-12) on Monday, Tuesday, and Thursday as well as an all-day (til 2 PM) happy hour on Wednesday and Sunday.  Finally there is a noon-to-9 happy hour on Friday and Saturday.  This enables a visitor to enjoy $3 cocktails and a select list of craft and other beers at a discount. Example - Two Brothers Outlaw for $3.50.  A nice gated patio has been a welcome recent addition.  Some are put off by the intentionally dim lighting at night, but I like it.  Little touches like the mini-bowling lane and old-fashioned jukebox (where you actually get three tracks for a buck) add to the unique feel and vibe of the place."}
{"text":"Black Label and Ginger Beer - LOVE!! The eclectic staff and unreal juke box make this place one of the best gems of W. 25th. I can't stand the \"yuck\" that hangs out at Townhall and when I want to hang in the area, this is my place of choice. Don't ever change ABC, ever."}
{"text":"Dude, it's hands down the best 'fast food' burger in Northeast Ohio (sorry Swenson's it's the truth). Sure it doesn't hurt that it comes with a load of hand cut fries. But it's even harder to argue against when they charge a mere $8. Throw in a beer at happy hour and you're walking away with the smile of a full belly and the satisfaction of not getting ripped off. Forget the fancy burgers dripping with excess toppings and flavors that only slop out from your bun after one bite.   ABC has reached perfection inside four corners of greased wax paper.  Shark bites are good, but you sound like a dork unless you call them what they are - 'fish sticks.'   Nachos are great and if you can't handle the heat of the Jamaican  jerk sauce, sub it out for bbq."}
{"text":"I find it hilarious that ABC is located smack dab the middle of the \"newest, trendiest\" part of town - and it does not give a shit. It's a dark dingy-dive that is slinging juicy burgs and that's all there is too it.    We heard that this unassuming place had some of the best burgers in town - as far as classic burgers go - and it did not disappoint. I also loved that they had hand cut fries!   Cheap. Delicious. Don't miss this spot for your late night burger craving."}
{"text":"Finally University Circle is getting some neighborhood bars.  This is a great neighborhood bar that I'd like to label as a \"dive bar\", but it's got such great food, beer selection and vibe that I feel bad labeling it with a potentially derogatory term.  This place is great!  Happy hour has great deals (and it lasts ALL DAY on Wednesdays) and this place is just full of great deals anytime of the day.  Their ABC burger ($6.75) is delicious reminds me of a tasty, meaty diner style burger and comes with yummy, perfectly salted fries.  I love their Jamaican Jerk Chicken nachos.  Think nachos, but instead of that mystery taco meat, it's delicously season shredded Jamaican Jerk Chicken.  Its topped with cheese and a deliciously sweet pineapple salsa which helps to balance the heat of the chicken.  Oh and did I mention they have beers for $1.50 during happy hour?  Yep, a buck fifty.  Give me a Genessee Cream Ale and an ABC Burger and I'm leaving with a bill $10 and a full belly!"}
{"text":"I haven't eaten at the original ABC, so maybe it's normal to wait 15 minutes to be given menus or asked about drinks. Once our waiter did come over he was pretty attentive and helpful with beer suggestions. He mentioned how patient we had been so maybe it was some sort of test? Who knows. They changed shifts after we got our food, and the girl that took over also acted like we were invisible. That being said, I loved my pork belly BLT - the portions were perfect and pork so tender. The pulled chicken was also tender but beware, the jerk seasoning is pretty spicy. Overall decent food and some interesting beer options but service was bizarrely slow and/or too cool for school."}
{"text":"Service deserved a 5, the Jamaican jerk nachos were on point.  The house made potato chips with roasted onion dip were tasty.  BUT, the reason it wasn't 5 stars across the board is the fish and chips.  The fish were a shade before being burned. Crispy and tolerable.  If they had been golden brown, different story.  The 'chips' french fries were perfect.   Happy hour runs until 9pm which suit us fine.  Found a few new favorites on the beer list. Good place to watch the game."}
{"text":"One of my favorite CLE bars. Good place to people watch just about every kind of Clevelander has dropped in on this spot. 2 patios are a plus. Awesome beer selection with the most knowledgeable and down to earth bartenders with an obvious passion for microbrews and food. Downside? Pretty pricey. But for all the right reasons!"}
{"text":"We visited on a Monday night so maybe didn't see the place at its best in terms of atmosphere & unfortunately the jukebox was out of order.  Pleasant service though, along with a large range of beers, so a decent option for starting your night in."}
{"text":"With the disclaimer that I live really close to this place, ABC the Tavern offers something that was severely lacking in the neighborhood. It's amazing to have a place with large selection of beers, pub food and friendly staff that is open 7-days a week till 2.30AM. Perfect for whoever lives or works around and wants to grab a drink or two after work and also perfect when you dine in Little Italy and don't feel like driving too far to get a drink afterwards."}
{"text":"After walking the best part of 15 miles from downtown Cleveland along the lakeside, up Rockefeller Park, through Little Italy, up to the James A Garfield Memorial in Lake View Cemetery, and back down to Little Italy, I was in need of some liquid refreshment.  I'd read a review of ABC the Tavern downtown, and when I saw the uptown version I thought that it would be an idea place to stop.  I didn't have the opportunity to stay long.  It was a Sunday afternoon, so the bar was quite quiet.  I walked up to the bar, pulled out a barstool and sat on it.  The barman was busy doing something on the till, so I waited a little longer.  I stood up, which meant the stool making another dragging noise, but still no reaction.  I repeated the process a few times, not being all that quiet, but the barman was still intently looking a the till and not even turning around to acknowledge my presence.  Eventually I took the hint and left.  I won't bother with the downtown branch."}
{"text":"Management (which seems not present) needs to figure out the wait staff and bartender situation stat.  Had to ask the bald bartender 3 times for a to-go box when there were 10 total patrons.  The server Jessica had her act together but no one else did.  Slow service, but the food was good.  No music on the patio?"}
{"text":"Sometimes it's the unexpected, unanticipated events and experiences, ones without any preconceived spoilers that make for the most pure moments in ones life. The latest discovery? ABC Tavern.   Located along the main drag of West 25th in Ohio City, ABC Tavern was a rare and welcoming accident. Last Saturday evening started out with my attempt to use up a Great Lakes Brewing Co. gift certificate that had been burning a hole in my pocket for quite some time. As I would later find out, it wasn't meant to be. At 7:30pm, the wait was close to an hour. Forget it.   A quick brainstorming of a Plan B resulted in my suggestion of a sleepy ol' Tavern with a generic title further on down W. 25th that I've been hearing whispers about. \"ABC the Tavern\" it was, as proudly and eloquently announced from the vintage art deco-ish marquee above it's entrance.   Inside, my first impressions of the dimly lit dive were of airy comfort in a relaxed atmosphere, all leading to a welcoming place of hospitality, spirit and soul. The space is long and somewhat narrow with tall ceilings. A long stool lined bar runs along the left side wall. A few high tops along the right. A pool table overlooking the entire bar sits a top a loft space.   Throughout our time here, the jukebox continued to pump out timeless classics and groovy tunes. Any man with a lot on his mind shouldn't have to sit alone with his thoughts and a head full of booze. The jukebox was a welcomed friend.   After browsing the extensive list of brews, ranging from the thrifty PBR tall-boy to a near endless list of craft beers that even the most snobbish brew-master would find adequate, I settled on a Dogfish Pêche. My accomplice, an Abita Purple Haze.   The menu was concise, yet well varied and adventurous compared to any other typical dive. Said to be under new ownership (as of last fall) by the same group that owns the nearby West Side Market Cafe, I could tell the menu items were heavily influenced by fresh WSM ingredients. Instead of ordering entrées, we settled on apps of Nacho's & Hummus. Again, both considerably better than what you'd expect from a typical dive bar.   Throughout the meal and my experience at ABC, I'd soon find out this place was anything but \"typical\". Friendly and accommodating service along with an inventive and inspired menu all in a no-frills, unpretentious space... well this my friends was an unexpected, yet welcome thing. ABC the Tavern, I look forward to my return."}
{"text":"Weird crowd.  Can't tell if they're hippies, just dirty homeless, gay or straight.  Also, spilled my full drink on a weird ledge like 2 seconds after I got it and the sleeze ball bartender with a gross deadlock beard charged me for a new one.  That should have been on the house.  Also, it's smells a little like pot - which I guess is the best thing about this place."}
{"text":"Friendly bartenders, great food, and always a cool specials selection. Plus you can't beat the neighborhood!"}
{"text":"Let's get one thing clear: I like dive bars.  Low-key, relaxed ambiance, modest decor, unpretentious people minding their own business.  Often equipped with a small but solid, inexpensive beer selection and amusements like a jukebox, dartboard, etc.  A place where locals and friends can sit back and have a good conversation.  That said, I do not like bars that pretend to be dive bars, and unfortunately, ABC Tavern classifies as such.  Sure, it's got a decent beer selection (what OC bar can hold its own without one?), ping pong table lurking in a too-dim room, tagged-up pool table complete with felt-less cue sticks and mismatched balls, and dartboard as pitted as a kid's face going through some rough puberty.  All of which could have been almost charming, except for the other desperately deliberate attempts at dive-ifying what could've, should've been a comfortable watering hole: tiles randomly chipped off of counters.  Every touchable surface, grimy, sticky and pointedly unwiped.  Gritty floors.  And worst of all, a permeating stench of urine, strongest at the back of the bar and concentrated around the bathrooms.  I mean, good god.  We get it, you're so hip and divey, your bar is almost indistinguishable from a neglected public urinal.    Maybe it's just me, but I prefer to drink without having to smell some stranger's piss, leaning on counters that aren't sticky with old beer and other unidentifiable secretions.  Sorry OC hipsters, I tend to love your hotspots but this one's a definite miss.  On to the next."}
{"text":"Four hipster morons literally picking their noses and trying to figure out how to serve a 15 top and a handful of bar patrons. Wait the fifth hipster just showed up... Maybe he knows what he's doing"}
{"text":"The best beer bar in Ohio City. You'd think they only serve high life, but they secretly have the best craft beer selection of any place in the neighborhood. Plus: pool table."}
{"text":"I love this place. It smells like fries and good beer (I don't know if that's real but the fry thing is 100). This place is exactly what u need after spending too much money at every other place in this street. I stopped here for a shot called a flue shot and it was a triple shot of Jameson...... I feel like that should cover it. What else do u need. It's kinda cramped but it worth it, and it doesn't take forever to get a beer. I love this place"}
{"text":"My experiences with this ABC Tavern location have been almost consistently mediocre. I was very excited that it was opening in University Circle, and am still glad to have another option so close to my apartment and school. But...  The ambiance is nearly nonexistent... It's dark inside, but that's about it. The only way I can think of to describe it is that something doesn't feel right--as if all of the pieces of the puzzle didn't quite fit right. Y'know? (I'm hesitant to give it 4 stars for this reason, but I don't think I could quite justify giving it 3.) It doesn't seem to keep the drunk college students away, however (some of whom are clearly too drunk to be at the Jolly Scholar down the street, or seem to have come here after the Scholar closed). The crowd doesn't get very rowdy, though.  As far as the beer selection is concerned, the place seems to focus much more on bottles than drafts. I'm glad to see another location serving my favourite (Brooklyn Lager), but I'm not sure how I feel about the severely limited tap selection. The (bottled) beer list is pretty impressive, though. Since I'm totally clueless when it comes to liqueurs/mixed drinks, I'll just say that some are served here... Moving on.  The food is decent. I find myself going for one of the daily specials rather than a \"regular\" menu item. But I've tried most of their typical bar food offerings too, and they won't disappoint.  The service ranges from massive confusion to decent, welcoming service, and it's been consistently fluctuating every time I've been here. I suspect they could use a revamp of the system here--for example, some tables are served by multiple servers simultaneously (who don't seem aware of each other also serving the same tables) while others are often overlooked or even downright neglected... But no complaints on my side so far that amount to a major issue that would keep me from returning.  It's a good addition to the neighbourhood, for sure, but not without some kinks to be ironed out."}
{"text":"ABC is dive central for University Circle. The bar itself is rather lived-in, but has great happy hour specials, a nice environment, uncharacteristically friendly bartenders, and remarkably good calamari. On weekend afternoons, this is a very nice place to get a drink and a quick bite.  The only reason why I have mixed feelings about ABC is because it's in University Circle. Droves of CWRU kids come here on weekend evenings, and it often becomes crowded, sweaty, and some inexperienced drinkers end up having miserable nights here, which directly impacts everyone else's enjoyment. I can't blame the tavern for their clientele, but evenings here end up being very hectic."}
{"text":"I don't think ABC can fall under the \"Dive Bar\" category anymore. The menu is well-done and affordable, the beer selection is awesome, and they have bar bowling (need I say more?).  We had a pulled chicken sandwich, a cucumber-red pepper hummus club (there are two layers to the sandwich, hence the \"club\" moniker) and some very tasty fries. I don't think anything on the menu is over $8.  Service was quick and friendly. I'd go back in a heartbeat."}
{"text":"Only gets four stars because having a band play on that upper deck is like some kind of alternate universe where bands perform like air shows. I felt like an idiot standing and staring up the singers shirt.   And damn, that dude was hairy.   Excellent beer selection and the service was friendly, quick, and solid. Never had to stand at the bar and wait for more than a minute, and the place was packed.   So far, this is the only bar on W. 25th that doesn't make me seriously consider opening fire on crowds as a career option."}
{"text":"Atomic Dogs and basically over 200 choices to pick from of craft beer!!! I absolutely love this place and keep coming back for more! The atomic dogs are so full of flavor in every bite and even though there are jalapeños inside them, the bacon evens out the spice and keeps me satisfied! Love it!!!!"}
{"text":"The Jamaican jerk chicken nachos are amazing and creative.  Accustomed to nachos with ground meat and cheese, the nachos at ABC tavern were a welcome change to my typical order.  There is a very large beer selection as well and the bar was quickly filled on a Friday evening after work.  The patio is a great place to hang out during the warmer months in Cleveland.  Fries are pretty good.  Burgers are okay.  I noticed two items with shark on the menu - didn't try them, but would be curious to see how these taste the next time I go."}
{"text":"fried tofu sandwich was pretty tasty. lots of good beer options. we did have about a bajillion different servers come over and check on us about every 5 minutes throughout the night though that was more funny than annoying really."}
{"text":"nice addition to the limited bar scene close to Case's campus. fine if you're just lookin to have a beer or two with friends. bigger inside than I expected too.   the gong that they hit when an order is ready is pretty annoying though, made me jump everytime!"}
{"text":"Great place to hang out, play some bar bowling and drink some great beers! Highly recommend abc for all your drinking needs in the Ohio City neighborhood."}
{"text":"So, I came here primarily to get hammered. And they did not disappoint! But I did eat here, so I feel like I can review that, real quick. My friend and I came up at ~9:30 tonight. Service: outstanding. Beers: decently priced, and an excellent selection, with several very good local beers. We got the lamb quesadillas and the \"shark bites\" for our \"soak up the booze\" meal. The quesadillas were very good, although they were not strictly \"quesadillas\". They were actually ground curried lamb wrapped in naan, and they were subtly spiced and, with the accompanying fries,very substantial. The shark, on the other hand...hmm. The shark was overcooked and too chewy, and the breading tasted overwhelmingly of Old Bay. That isn't bad, necessarily, but when it overwhelms the flavor of the fish to such a degree, well, not good. Now, it was a Monday, and shark (presumably Mako? The menu was not specific) is a fairly exotic fish, so part of the responsibility for the iffy meal lies upon me, but still: it was not good shark, not at all.. Nonetheless, this is a good bar to drink at and I will definitely be returning (since it's like RIGHT up my street)."}
{"text":"In Cleveland on business and staying at the Courtyard around the corner from ABC. I was looking for a sports bar that was close and where I could get a good burger and the front desk clerk said that I had to go to the ABC. Here is a rundown of my time there: 1. Made my way back to the bar and the tvs, sat down at a high top near the bar and next to another full high top. 2. Bartender, who was nowhere to be found for five minutes, made eye contact with me as he waited on the table next to me (it was not his first visit to their tablle, he asked what else they needed.)  3. He went back behind the bar and walked to the other end and waited on other people seated at the bar and came back to the middle to pour drinks. I then got up and went to the bar and stood in front of him. He mumbled something about how shitty the beer was coming out of the tap, took the beers back to that customer, came back past me and then went who knows where for five minutes. 4. I asked a guy seated at the bar if I could borrow his menu and decided on the burger and a Fat Tire, then went back to my high top. 5. Dude comes back, waits again on the table next to me, then as he walks by me on hi s way to another table, I ask if there is any way I could place an order. He says sure, I'll be right back. 6. He goes off and waits on the other tables, walks by me again (all I need is a f'ing beer at this point) with no acknowledgment, and goes behind the bar and pours drinks. He then comes by me with them, makes eye contact, so I'm thinking \"he's finally going to wait on me.\" 7. I was wrong. As soon as he delivers the drinks, he walks behind me to go outside and talk to a bus boy. 8. He comes back in, blows right by me, looks at me from behind the bar, and I say \"sorry, I am out of here, this has been incredible.\" His response was 'sorry man.\" He couldn't have cared less.  The employee in question is a late 20 something bald male with a Duck Dynasty wannabe beard. Absolutely, without question, the worst service I have ever received. Actually, I can't even say that because I received NO SERVICE!!! (The only justice is I am on an expense account and appreciate good service and tip at least 25% for it.) Sorry dude!! Only one star because I can't do 0! The menu looked great and the draft beer list did as well. Would have been nice to explore them."}
{"text":"Easily my favorite bar in Cleveland..  They have a great selection of beer and definitely the best happy hour in the area as well as some of the best bar food I've come across (ask for the sriracha aioli no matter what you get).   Really laid back environment with friendly staff and great music."}
{"text":"Extremely rude. Prices not great. Very loud. Very cluttered. Very \"college\". That is either good or bad depending on what you are looking for.   My friends and I were there around closing time. They turn on the lights (pretty standard sign for us to finish), and then the bartenders go around the room collecting people's UNFINISHED beers right out of their hands. I saw one bartender grab a beer from my friend's hand who I was talking to, and rudely said \"yoink\" and threw it in the garbage in one motion.   They survive on location. If you have a car, go to the Winking Lizard, Cave du Vin, The Rib Cage on Lee, or basically any other bar besides this one!"}
{"text":"your body cries out -  cheeseburger! I desire!  relief on two-five.   Clean and divey, my new West 25th street fave. Fun menu, great food, jukebox full of fun, bowling machine, pool table, an assortment of interesting characters, hot soup, shark sandwiches (really!) sweet bartenders. I gotta say, the burgers rock. All killer - no filler at the ABC!  Carry on."}
{"text":"It was great when it first open. Only a one good employee. Was nearly done eating by the time I got water. The server was rude and the bar tender that took our order was rude. All 6 of us were not happy with the service and the food is simple so you really can't mess up. But shitty services really ruins an experience. I ask an employee about something on the menu and he said \" I don't eat this food because it is nasty a** f**k\" I asked him if he was joking and he said he was serious. He hated everything on the menu. In my opinion that's not very professional and kind of odd to talk so lowly of a place you work. I won't be back unless they get new staffing."}
{"text":"A group of friends and I all came here this past Saturday night. When we walked in (probably around 11:30) the place was decently crowded, but not overly so. We were able to walk right up to the bar and we're served right away. None of us ordered anything more than bud light, so I can't speak for the quality of any other drinks.       There is definitely an interesting mix of people here. The bartenders all seemed to have tattoos and piercings and were very nice, then there were hipster looking people as well as people who were dressed business casual. I do think they need to keep a closer eye on overserving people, because right when we walked in until we left around 1, a guy that was sitting at the bar would not stop harassing my friend and our group. He seemed to barely be able to talk or have any idea what he was doing.       Overall it was an okay experience. I'm not dying to go back, but I also wouldn't avoid the place either."}
{"text":"Place primarily for beer, you can get drinks but that's not their specialty. Their food is very good, especially for a bar. It is a bit noisy however, that's expected for a casual bar. The service is decent. I would definitely recommend this place for a weekday drink."}
{"text":"Came in after work with a few friends. Bar was moderately busy, but the bartenders were standing idly by. Waited about 10 minutes for a bartender to come take our order. When he came over, he made his proclamation that he was \"drunk\" and \"going off shift soon.\" He took our drink orders, but stood there for a movement with a blank stare and couldn't remember the drink order because he was drunk. He left the table, came back and asked a 3rd time what we ordered.  Not good!  Came back with the drinks and took our food orders after he chatted incessantly for 10 minutes. He forgot the food orders (surprise!) and asked is 2 more times for the food order. It was so bad that my friend offered to give the order directly to the kitchen. While waiting for our food, watched the bartenders take a few shots and then watched our food sit in the window for 5 minutes until he got to it to bring it to the table.  I want to love this place. It's convenient to the hospital and it's easy to grab a few drinks after a hard day's work, but after this last visit, we'll be scoping out other places in Uptown or Little Italy to use as a new watering hole.  Damn shame! Would've been 1 star, but I love the food and they have a decent craft beer selection."}
{"text":"Great eccentric staff, excellent service and delicious food for a \"dive\" bar.  This is my home base."}
{"text":"Unassuming and accepting place. This is an anchor of w25th for all of history. Never left here a loser. Beer selection is best in class for the divier bars, food is encroaching on some of the more expensive joints. I prefer a weeknight, but often find myself here on the average weekend."}
{"text":"When I say you HAVE NOT LIVED UNTIL YOUVE TRIED THE JERK CHICKEN NACHOS!! It's freakin huge. Kinda spicy tho, not sure if you're into that. Anyway other favs are the lamb quesadilla and surprisingly the burger is pretty good too. If you're into trying new stuff I'd recommend the shark sandwich. It's fresh and tasty, don't let the pineapple salsa scare you away!"}
{"text":"I like this place! The drinks, food and prices are wonderful. I also like the tattooed up staff. They're cool and treat old dudes like me with kindness."}
{"text":"Looks can be deceiving, and when you walk in it's exactly what you expect of a dive bar but this place is awesome. The drink specials are great and believe it or not the food is amazing. I had a jalapeño stuffed hotdog wrapped in bacon with a spicy aoli and in a nice toasted bun. It was so so good!! My friend got the pulled chicken sandwich with jerk seasoning and I wish I had got what he had! It was so good! A bunch of craft beers were $3 and $3 wells drinks too. Which is really nice. I had a nice IPA and a huge hot dog and fries order for $10! You can't beat that for a lunch. The staff was great too and checked in on us several times. As a Chicago local who was visiting the area, I approve this hot dog."}
{"text":"Big fan of ABC. Great bar and always great service. The ABC/XYZ/V team members are all friendly and know how to bartend ...the way it should be done. They take care of me every time I'm in.   The drink and beer selection is vast.  A few beers they have are even as cheap as 1.50$! As well as their impressive list of bourbons (ranging a wide span of price points).. one of the best in town. The food is always good and consistent.  The jukebox is usually playing something good. There is a nice patio area out front and a outdoor area in back as well as the upstairs balcony that has a pool table and small party room. And nice big TVs with the major games always on.   One of my favorite meet up spots, bars to go out with a group or just a friend or two. Very mixed crowd and you will always run into people you know.   The crown jewel of Ohio City casual night life."}
{"text":"I like ABC Tavern in Ohio City, and XYZ Tavern in Detroit-Shoreway. Their service isn't always top-notch, but it's not terrible. Unfortunately, I found the ABC Uptown to be extremely disappointing when I visited there on Sunday, September 13th. The place was pretty empty, and our service reflected the staff's boredom. Our server rarely checked on our table, which caused a couple of folks in our party to go to the bar to buy their drinks, where they saw our server on her phone several times. We had a double order come out from the kitchen and of course one order missing because of what was obviously a mix-up. I had the burger, and it was just ok. It lacked flavor and the tomatoes were sliced ridiculously thick. I'll stick to the west side locations, where at least I get half-way decent service sometimes."}
{"text":"This place is the epitome of a Cleveland dive bar.  A solid, rotating selection of craft beers as well as gunny, Stroh, and black label if you prefer that. The food is very good for a dive bar. You gotta try the Atomic Dog, I won't spoil it for you but eating it an experience you tell all your friends about. It really rocks after midnight and it's a full kitchen till 2am"}
{"text":"ABC Tavern is a great old-school neighborhood bar with a nice drink selection and delicious, reasonably priced upscale bar food.  Fans of old-school bowling can get their fix at ABC's hilariously low-tech bowling lane."}
{"text":"Still one of my favorite places to go, even though it's getting a bit overcrowded.  The atomic dog is the best wiener to put in your mouth after midnight.  Injected with jalapeno? Si, por favor.  Always where I end up to get a bunch of drinks, or after having a bunch of drinks.  No judging here.  At least to my face."}
{"text":"Best fries in Cleveland. Best happy hour in Cleveland. Been coming here for years and never leave disappointed."}
{"text":"I stopped into ABC late night on Friday on my way home around midnight for some food.  Everything except for fast food was closed on the East side and university circle, so I looked up ABC and thought I would stop in to see what they had. I actually was pleasantly surprised at their menu considering it a college bar that's aimed at drinking and I'd didn't think it wasn't too crowded for a Friday night.   I looked over their menu and ABC does not serve typical bar food. They have all the late night options, but with a little bit for a gourmet twist. I decided to try the Caribbean Jerk Nachos with pineapple and creme fraiche to go. I also grabbed a drink while waiting and found the staff was very attentive and friendly. I got my food within 10 minutes and headed home.  Nachos were excellent and they gave a huge portion size for the price. I actually was able to eat half that night and save the other half for lunch on Saturday. The ingredients were a nice mix of sweet and spicy and the nachos were not drenched in cheese and oil.  Since they are open late I have a feeling this will start to become a late night stop for me. Will definitely be back to try some more food off their late night menu."}
{"text":"Todd Rundgren played here-- or at least he tried. Apparently Liv's stepfather knows someone there, so he \"sat-in\" with some affiliated craptastic white-boy blues cover band.   Dear craptastic white-boy blues cover band,  When a rock god like Todd Rundgren is playing within 10 miles of your pathetic little band, shave your heads, don saffron robes and meditate in silence. Please don't sing, play lead or, God forbid, solo.  Signed,  The Universe   Otherwise, this is a great bar. The food is unreal. I had a \"lamb quesadilla\", lamb from the West Side Market sauteed with spinach and feta on a pita. Huge, reasonably priced and utterly delicious. Others in my group had the burger, jerk chicken sammy and shark bites. All finished every crumb!   The service is excellent. The staff knows all about the dishes on the menu and all the offerings on their well rounded beer menu. They are friendly, cool and very competent.   Don't be off put by the uber-hipster crowd. A few American Apparelled hipsters may stare at those who don't rock skinny jeans, but the staff definitely makes everyone welcome."}
{"text":"This is a dive bar with an upscale mind.  Sure, you can get $1.50 cans of beer but you can also get higher end beers and drinks.  They also have a menu that is pretty dynamite, putting out more than just standard pub fare.  You haven't lived until you've had the Atomic Dog!!  Their servers are always on the ball, even when they are super busy.  It's definitely one of my favorite places to hang out in Ohio City."}
{"text":"This place is cool if wanna kick back. It's never to crowded the atmosphere reminds me of a local college dive bar.... Sidenote:(  Kinda is/near on a college campus). The food is really good not to expensive. The worst part of the place is trying to find parking. Happy ends at 9!!! That is rare. 9o'clock is best thing ever when u wanna have a evening cocktail with college kids lol"}
{"text":"They have a good selection of beers, and some decent happy hour specials. Expect a lot of beers in cans. I've become quite a snob over the years, but really just pour it into a glass and it's fine.   Last night it was really hot in there, so we didn't stay long, but during my last visit, we had a great time. They have a mini bowling machine - that's at least 30 minutes of fun right there. Also, I recall the bartender not charging me for one of the beers I ordered because it was disgusting (this may be obvious, but pineapple flavored beer is not a good idea).  I recommend for a casual night - it's a super relaxed place to grab a drink."}
{"text":"In the spirit of Dan Gilbert removing his letter to the city of Cleveland about LeBron, I have removed my hateful review of the ABC. I have regretted my negative review for quite some time and have been working diligently at bettering my attitude and not being removed from bars. I had too many great times at ABC to talk bad about it. One weird experience does not negate all the good memories. Sorry to have written that mean and nasty review."}
{"text":"I have been going here since I started working in the area around a year ago and ABC is a good place to get a drink after work. ABC is a dive bar/restaurant which has good service, and good prices. This is one of those places where the bartenders remember you and what \"give me the usual\" means. Also, the fries here are some of the best around. Often times people come here and order just a large basket of fries to munch on while getting their drink-on. Though personally I do also recommend the BLT in addition to the fries."}
{"text":"I have to say I was disappointed. I first noticed ABC on W25th St but decided to wait to try the new location as the W25th St one looked a bit...worn out.   The newest location, this one in Uptown, is pretty bare bones inside. It is definitely more bar than restaurant with a large cement floor. I can only guess that easy cleanup was on the forefront of the designer's mind more so than anything resembling decor. Along with the lack of decor goes a noticeable absence of the maximum number of tables possible.   We sat at the bar, since there was no waiter service on a Saturday afternoon. I ordered a burger and my friend the pulled chicken. Both of these sandwiches were good. My burger was super basic - a stark contrast to the likes of B Spot and Dynomite. I liked the simplicity actually though - it was a bit refreshing to go out and get a classic burger with that flame grilled taste. The good taste ended there however. The fries (also basic) that my friend I got were both not all the way cooked. Random fries were still too hard and had clearly spent too long in the freezer and not long enough in the deep fry bath.   I won't be back here for food, but if you want a college bar atmosphere, come later and only drink."}
{"text":"Waited 20 mins and couldn't get a drink. Was totally disappointed since I have wanted to try this place out for ever!!!"}
{"text":"Well my boy PW is tossin money here like hes in an ATL strip club, im not too impressed. 9$ draft beer, hood but no good, ya know?   I dont wanna be biased bc 25th ABC is my spot and I feel this is a knock off. It may ne cool, it is Monday evening,lol.   Maybe ill write back when i have had a better perspective of the establishment.   Finna PAX.  Updated: PAXd' it up!!!"}
{"text":"As an adult with a car, I'm not bound to the university area, and thus have access to any number of superior alcohol establishments in the city.  Please keep in mind as this may be in stark contrast to many of the other reviewers.   Interior looked barren upon entry, complete with uncomfortable high tables / chairs.  The overall feel was a little drab, certainly not a warm tavern feel one can grow accustomed to in Cleveland.  ABC tavern has an unacceptable amount of beers on draft, a grand total of four (4) on my visit, of which most were overpriced and mediocre in quality.  Compared to the massive draft lists of quality beer boasted at the winking lizard, Melt, or even the nearby jolly scholar, such a draft list is laughable.  The bottled selection is admittedly large, but for being a tavern that seems to have an emphasis on alcohol, the alcohol diversity is poor.  Certainly the quality of drafts available is more important than quantity (ie Wine Cave), but a lack of both is concerning.  Food selection was quite limited, taste and value of the entrees received were fair.  Service was speedy, and the waitstaff seemed pleasant.  Late hours seem great.     Unless out of options or already drunk and in walking distance, I see no reason to go out of my way to attend the ABC Tavern."}
{"text":"(Forgot to review this place when I was here over the summer...)  ABC Tavern, I love everything about you and I'm so glad that I met you.  8 hours away and I'm still thinking about you.  If I could clone you and bring you back to my little town in north Jersey, I guarantee you'd be a star."}
{"text":"Sometimes you wanna go... where everybody knows your name....  This is that neighborhood joint that anyone is welcome. You're bound to find business people, hipsters, and college kids on any given night at the same time. Prices are right - and the food is amazing. In fact, you would never expect food in such an obscure place to taste SO good - but its a dream for a foodie like me.   Don't let the outside of ABC fool you. This is the place you want to be seen."}
{"text":"All I can say is, major disappointment.   Food was terrible. Staff was rude. Atmosphere?  What atmosphere?  Would not recommend, even if it is only in walking distance. Stay home!"}
{"text":"Good beers on tap.  Friendly.  Sporty theme. Pub fare with a few twists.  Tavern salad is excellent. Fried fish and seafood specials. Yummy fries."}
{"text":"I have never tried the food here but I can say they have a nice bar and lots of options.  W 25th continues to get more and more popular which explains why this place was so crazy busy on my last visit.  I think there are some pretty decent waits for food here and the bar was a few people deep so be sure to come with patience!"}
{"text":"only went once, not going back. the bartender and owner looked at us like we didn't belong. also, the bartender didn't know what went in a apple martini. not impressed at all. defiantly the last time I'm spending my money there..."}
{"text":"What I ordered: Some kind of pear cider Shark Bites with fries  Now when I first walked in, the server (don't remember his name) came off to me as...I don't know how to put it...not rude but...it was like: \"What do you want?\"  \"Anything else?\" \"Are you sure?\" \"That's all?\"  I asked if they had pear cider and the way he answered was like I should just know their inventory.  I'm always searching for something that I have never had before. Honestly, I have no idea how I came across ABC the Tavern. Now, I looked over the menu and they had something that caught my eye, Shark Bites. Freaking shark meat...really? I have to try this and now! Lol, I was actually kind of excited about it. It was presented to me like fried nugget bites, it also came with fries which I did not know.   I thought the shark meat and fries were extremely bland. Even with the dipping sauce it did it no justice. I was kind of forcing myself to eat it and played around with it a little...felt like a little kid who couldn't leave the table until everything on the plate was gone.   No second visit here..."}
