{"text":"Everything, I meant everything were good.  Were there for week day breakfast. Service was quick and exactly what I asked for.  The fresh from the over egg tart, OMG, sooooo good.  Services are good. Very nice owner and accommodating."}
{"text":"I came here to check out the egg tarts. I was a bit disappointed. I do love the custard but not the pastry.  The pastry was very thick and I didn't like it at all. I doubt I will be returning for the egg tarts.  I also bought some buns, and they weren't soft .. it was very thick and hard.  After trying several items, I will not be coming back here."}
{"text":"I love this place! Their weekday lunch specials are around 5 bucks and a lot of food! Each time I went, none of my friends have finished their meal. It tastes great and the boss lady was really nice.  Um... Two friend who went there and got diarrhoea after eating. Not sure if it was their food.   Egg tarts are really really good!"}
{"text":"Decided to check this place out after reading such wonderful reviews their egg tarts received.  The reviews were right. The tarts were nice and silky.   Also, the elderly lady behind the counter was quite warm and friendly as well. Service with a smile is not common in other bakeries of this type I've been to."}
{"text":"Excellent egg tarts! Light flaky crust, and delicious custard. I always order a dozen or more each visit, my family loves these things! They make them fresh often, since this place is well known for egg tarts.  I did not like their other baked goods, and have never tried their lunch items. Their catering menu looks quite the good value, I may consider them for parties."}
{"text":"This place got to have the best Hong Kong style egg tarts in town.  The egg custard is warm and silky smooth and the pastry is flaky like puff pastry.  The combination is just a perfect marriage.  So thankful for the one who invented this tart for a afternoon snack favourite for many people from Hong Kong.  The milk tea is also really creamy with rich black tea taste.  I always come here just for the egg tarts.  I had to wait 20 minutes for the freshly baked egg tarts. For $0.95 a tart is a wonderful price with a large milk tea for $1.60 is really nice to my wallet. lol!    The decor is a little dated, but I like the newly renovated washroom.    T"}
{"text":"I've been on the hunt for the best egg tarts in Toronto... and this place is my new favorite (so far at least).   The tart is really tasty, and seemed freshly baked when we got them. They are massive as well... and really cheap (85c). Amazing value given how good these things taste.   My only complaint is that the pastry itself is a little too crumbly, and also I'd prefer the top to be more burnt (Macau style). But these are very minor complaints.   Cash only. Ample parking. No tax if you buy 6."}
{"text":"Egg tarts.  Made in batches so they're fresh out of the oven throughout the day.  I've never eaten any of their other baked goods nor their noodle or rice dishes.  I just come for the egg tarts.  YUMMY."}
{"text":"The only reason why I went to this out-of-the-way Chinese bakery in an older strip plaza with free parking is based on the strength of the recommendations by various friends on its Cantonese-style egg custard tarts.  I love custard tarts!  Yummy!  The custard tarts had just the right amount of straight-from-the-oven warm jiggly, sweet custard goodness deep in the middle, with a delicious outer crust.  I had three as soon as I bought them - and regardless of whether or not that was a good idea, I don't regret it a bit!  The strange thing is that while others have told me that the crust is supposed to be the flakey version, mine was less flakey and more solid.  Doesn't detract from me inhaling them all though.  This bakery has been around for a long time and I can't believe I've only gone there now.  It also serves other Chinese cafe style foods as well as other Chinese pastries with seating.  However, given the prominence that the custard tarts receive in its own heated baking tray by the counter rather than with the rest of the pastries, I'd say that this place knows what it's good at."}
{"text":"I was so excited to dig in. The sausages and omelette were steaming hot and fresh! This meal definitely filled me up. :D Did I mention that all this was only $3.99 too?! What a steal for a really good breakfast!  Before I left, I also ordered two of their well-known egg tarts. After I posted my photo on instagram, a lot of fellow foodies mentioned their egg tarts so I was glad that I had bought some to take home with me. Apparently they are so well known that this is a huge favourite that some people have been coming back for many years."}
{"text":"My husband works near here and has never been inside, until I told him to go today. I read the Yelp reviews and thought I'd give it a try. We usually go somewhere else to buy egg tarts but their pastry cases have been getting hard, so we need a new place to get them from now. He brought back 6 and they were still hot when he got them home, wish he'd not let them sweat in the plastic bag. They were a tad sweet for my liking but they were delicious. The cases were flaky but not too crumbly, like most places, that just disintegrate, when you bite or touch them. Only negative was the really orange colour of the shell and filling. My 11 year old gave them a big thumbs up, but she likes any dessert. My 9 year old daughter, who doesn't normally eat egg tarts, period, ate one and said it was ok. We will be getting our egg tarts from here in future and giving Les Chateau a miss."}
{"text":"I slowly backed my ass out of Crown Prince Fine Dining & Banquet as soon as I realized my net asset near my rear asset only had a $5.00 paper currency.  ABC Bakery a few doors down sounded more within my current Net Present Value so I went in more confidently.  Chinese Bakery also doing HK Cafe food.  Not exactly the biggest selection of Baked Breads or Pastries but enough on offer for the blue/white collars working nearby.  Standard priced Noodle/Rice dishes on offer.   2.5 *Star*  Egg Tart & Milk Tea($2.10)  Fresh still warm-from-oven Egg Tart was flakey however it was the DENSE flakey variety rather than airy.  Not sure if it's due to the warm status of the Egg Tart but the custard within had pockets of separation which looked less appealing but I didn't taste any difference.  Milk Tea was quite nice and enjoyable.  Best part was getting the $2.90 in coins back in my pocket.  The environment atmosphere was a bit awkward.  The customers were either single individuals or even when in multiples they were freaky quiet compare to any HK Bakery Cafes.  That combined with no focal point of either Televsion/Radio or decor made this place feel stale/boring/depressing!  A spot where you eat, mind your own business and \"clap flies\"."}
{"text":"FYI, Closed Monday's  New ownership for about 10 weeks, new menu's, the classic egg tart is not the same as it was before, it was hot but not cook long enough in the oven or something as the egg tart is stuck to the aluminum holder and as you try to pry the egg tart off, it literally fell apart, NOT GOOD. Nice try by the new owners but not enough for me to come back. Unfortunately the previous owners has retired. It was a great institution for so long as I will find another place before they become all extinct."}
{"text":"Good egg tarts and dishes here.  My step dad likes the curry chicken while I like the noodles. I've tried three different noodles they offered and liked all of them."}
{"text":"As a Chinese who spent most of his childhood in Hong Kong, there is one Chinese traditional snack that every child would love eating from young to even when they are a full adult like me!  Can you guess what that snack is?  You can find it in almost every Chinese Bakery.  Yes it's the EGG TARTS!!  I have been searching for great Egg Tarts and I was always a fan of Les Chateaux's Egg Tarts because they make very consistent good egg tarts, but I am happy and surprised I found somewhere that makes even better ones!  ABC Bakery Coffee Shop probably bakes the BEST Egg Tarts in Markham area.  They are always in high demand and last time I came, I had to wait 15 minutes for their new batch as the old were sold out.  Even then, I had 3 people in front of me waiting for the new batch too!  And everyone grabbed half dozen so they run out VERY fast!  If you are a big Egg Tart person, I highly recommend coming here to grab some!"}
{"text":"The inside may not look like much but they make a mean egg tart and have very good BBQ pork buns.  This place is very old school and has that charm, reminds me of the bakery cafes I grew up with....their lunch menu items are also very good, I tend to order the rice noodles when I am in the hood."}
{"text":"Chinese bakery south of VP and Steeles Ave. In the same plaza as the popular Chinese dim sum restaurant, ABC is a local bakery that's been serving the community for years. From the popular egg custard and buns, they also serve hot foods, or what most of us call, traditional Hong Kong style set meals. The insides of the place could use some updates, but we all know this might increase the prices since their prices are affordable.  They've got a small bakery section for those on-the-go and seating area for all.  Their breakfast and lunch/dinner menu has a range of selections typical of a HK Cafe which includes tea.  Coming here for breakfast we tried the following. Beef satay macaroni soup with tea Beef brisket noodle soup overall both dishes were great, as for the beef brisket they added a lot of meat which was a plus.  To top it off we had their popular egg custard.   Glad I can add this as another go-to place for HK style of food.   also to note, their washrooms are clean!"}
{"text":"Heard about the great egg tarts here and went up there specifically to try them. They were soooooo good. The pastry is what a HK egg tart should be and the filling is perfect (so silky and perfectly eggy). The decor is terrible but as long as egg tarts stay good I will keep going."}
{"text":"Nice little place if you are really hungry and dont want to experiment."}
{"text":"This unassuming bakery tucked in the corner of a Scarborough strip mall is not the place you'd consider as having the best egg tarts in the city; however, after reading such positive reviews from other yelpers I had to give them a try.  I bought one for myself and one for another yelper. The total was under $2 (impressive!) and were still warm as they sat in their special case by the counter. After a 40 minute trip to my friend's home, I couldn't believe they were still warm! The middle is very silky; and in contrary to some other reviewers, my crust was nice and flaky.  As mentioned in other reviews, they have an extensive menu aside from the tarts and all prices appear reasonable for the portion size. I would definitely consider returning again if I had a craving for egg tarts and would encourage others to go and try this place."}
{"text":"It's more like 3 and a 1/2 stars, but if value is your thing, and a $5 lunch wins the game for you, then it's a 4 and a 1/2 stars.  The hot kitchen menu is CHEAP AF, and consistently good. Simple, but good. I usually order the Beef Brisket on Rice, as I admire the cheap meat's tenderness to price ratio, which is seemingly earned from hours of cooking. A bit fatty, even for brisket, and there's not much to it except the beef over rice. Good enough for a quick lunch."}
{"text":"This place is know of it's egg tarts and rightly so.  The tart crust is light, flaky and buttery, while the custard is perfectly smooth with the right amount of sweetness. I'm never disappointed by the quality of the egg tarts here and like to pick up some for the family as a treat. They are even good reheated in the oven the next day. The service and the atmosphere isn't the best but it's easy to just point to the egg tarts, pay and run off with the goods.  Recently came on a Sunday afternoon to see two glorious trays of egg tarts on the counter. Unfortunately, they were all ordered as take out (I would have liked an invite to that party) and we had to wait 20 minutes for a new tray to come out.  Doesn't matter. This is one of the few things I'm willing to wait for, especially if there are hot out of the oven little golden pools of deliciousness at the end."}
{"text":"They have the best Hong Kong Style Egg Tart in Toronto~!  It's a MUST-HAVE!!!"}
{"text":"Make a quick stop here while waiting for dim sum next door. We got the toast and milk tea, both were good. My favorite thing about this place is the decor though, it kind of reminds me of the chacanting in hk :)"}
{"text":"Ordered the lunch take out special \"D\", BBQ pork with rice and bok choy. Very fresh, hot and flavorful. The pork is tender and lean. The rice is fresh and steamed nicely. The bok choy is tender yet crisp. All this for $4.95 plus tax. Staff are very friendly and the food took no time to get ready. Highly recommend it for someone looking for fresh food in a timely manner. A wise choice for the value conscious."}
{"text":"Their egg tart is the best in town. I always loved their egg tart as a kid. My mom would bring me there after school and I will order an egg tart for snack. Yummm~~~"}
{"text":"Pros: Lots of items you would not expect from a Chinese bakery Friendly owners Great Value  Cons: Service can be slow when it's busy  Having read the previous reviews, apparently the owners of this place changed recently.  I never experienced this place with the previous owners so I can only base my reviews on how they are now.    ABC is your standard Chinese bakery with a lot of hot food you can order as well.  I have always seen this place whenever I come to same plaza for dim sum.  It looks very small on the outside but there's a large amount of tables and space when you come inside.  ABC has all the items you would expect from a Chinese bakery and then some.  For breakfast, they have a couple of combos that of great value ion my opinion.  I got a combo which included a beef brisket noodle, egg sandwich and a very large cold milk tea for $6.50.  The beef brisket noodle had a great amount of brisket and a good amount of veggies to boot.  Normally you get no veggies at all!  I love the owners.  It seems to be a ma and pa type of ownership.  They were very nice and friendly.  Their English could use some work but they try very hard to get an understanding with you if you don't speak Chinese.   It seems though, that it's only them working the front with some kitchen staff in the back.  When it get super busy, you can expect some wait times.    I'm really glad I decided to try this place out.  I can so see myself coming here instead if I don't want to wait for dim sum.  I love supporting a local business and this is straight up one of the businesses we should be supporting."}
{"text":"I'd give this place a 3.5. I'd usually come for the egg tarts, which has flaky pastry and silky egg custard, what you'd expect from a Hong Kong style egg tart. Although their quality is consistent and great bang for the buck, I never find it to be something that blows your mind...it is just an egg tart, nothing to really hype about. I could be biased, since I generally prefer my egg tarts with a cookie base and not a puff pastry base (only option here) which dries up after it cools down. Staff aren't the super friendly mom and pop kind, but you don't come with high hopes when you see the dated, dingy decor. Other than the egg tarts, everything is what you'd find anywhere else at a Chinese bakery, nothing to write home about other than dirt cheap lunches."}
{"text":"Walked in just by coincidence of being there (and posters of the Chinese boy bands on the door) and was surprised to find:  the cheapest & the most delicious egg tarts ever.   They are like 80 cents each, fresh and delicious. In fact, they are so fresh it will crumble in your hand at the slightest pressure so handle with care. The store also has lunch combos, pastry and other baked goods I have to go back and enjoy. The décor is rundown, seating limited and old and the premise not the cleanest, but I enjoyed the egg tarts. I also liked the lack of customers. I am not into crowds and waiting. I also liked the elderly man and woman behind the counter. They were full of smiles and looked kind. They are probably the owners, right? I bought less than $2 of egg tarts and got so many smiles."}
{"text":"if u like egg tart, this is the place u should go.  Usually u will find ppl waiting in front of the counter for the freshly baked egg tarts.  All gone in a sec.  I think their deep fried stuff is ok, but I can't think up any drink is good from this bakery.  So I will only grab half or a dozen egg tarts and go."}
{"text":"I've been to ABC Bakery a few times since I read they were one of the top places for egg tarts. Nothing beat the first time I went though, I'd have given it 5 stars for those egg tarts. Unfortunately, the experience has been worse and worse with each time I've went. The fact that it's under new ownership explains a lot. On my most recent visit, I ordered a bowl of wonton noodles, a slice of Chinese White Honeycomb Cake (???), and an egg tart for $10 flat.   The wonton noodles are okay, you get six (smaller-than-average) wontons in the bowl and a lot of noodles with some chopped scallions. The white honeycomb cake is decent and you get a fairly large slice. The supposed star of the show, the egg tart, was extremely disappointing. The egg tart looked like the biscuit ones, instead of with the flaky crust (????). When we asked, the lady (who doesn't speak any English) said it is a new low-fat recipe. The more health-conscious decision is not worth it because there wasn't much rise in the pastry itself and it became more dense to eat. The egg custard was also bland and lacked flavour and sweetness. I've never really had bad egg tarts before but this was by far the worst in my experience. The mini dim sum egg tarts are better, even ones from Chinese buffets I'd say are better.   While everything was cheap, I was left with an unsatisfying experience from a longtime favourite. I might give it one more try, though not for many months. I'd have given it a 1-star rating, but I'll give it an extra star based on its history and for the previous owners."}
{"text":"It appears that management has changed recently.  Some of the regular servers are no longer there and the pastry quality seems to have also been updated... And not for the better unfortunately.  Many regular items are not stocked and the once consistently good egg tarts have lost its shine ( this is after trying it 3 times and ensuring it was not just a one off event).  I hope the new management reads this and addresses the QC issue."}
{"text":"Best egg-tarts in town!   There's really not much to say about a hong kong style fastfood restaurant. You don't come here for the customer service, you don't come here for the luxurious architecture, and you don't come here on a first date. What you do come here for is cheap and authentic hong kong dishes, the bakery, and the FRESH EGG TARTS."}
{"text":"I usually come for the egg tart and it is one of the best Hong Kong style Egg Tart!!   They always bake it so always fresh for egg tart.   so custard is warm and silky smooth."}
{"text":"My search for my favorite egg tarts continued!  I love that old school vibe at ABC Bakery. This cafe has been around for over 20 years and I did have high expectations for their egg tart.  Egg Tart & Milk Tea ($2.45)  Just maybe because of my personal preference, I love the egg custard which has this sweet and aromatic smell of eggs and the texture is smooth. But the crust itself was heavy and doughy even when the tart was still warm to touch.   The Milk Tea was meh. Not hot enough, not smooth enough and just not up to par.  While I was there, most people were here buying egg tarts and egg tarts only as there was only some stale uninteresting offerings on the display.   I doubt I will be back.  I should have read my Yelp Friend's review before coming :)"}
{"text":"They have changed ownership!! (For 4 months now) Inside of the restaurant is updated with a POS and electronic menu display. It looks brighter and cleaner. Service are not as good or quick though and food  somehow dose not taste the same.  Will give it another chance in a few weeks and see if service will improve. Also we will try the egg tart to see if it's still the same."}
