{"text":"Incredible food. Had the taster menu and tried a few of their own cocktails and it was spectacular. It's pricey but worth every cent. Service was great, the guy knew his stuff."}
{"text":"Great meal with friends here.  I had a few items that i had never tried in my life and everything was cooked to perfection.  I am not sure i would rush back here, i am not sure why, but i would recommend that everyone try this place once.

They should also get their patio open.  What is going on with that?"}
{"text":"Went to Acadia the other night for dinner after having read several good reviews.  To make a long story short...similar to what other reviewers have posted, the food was inventive and quite tasty.  I enjoyed everything I tried, from the Boudin Balls to the bread to the stuffed quail to the fish.  I also enjoyed the Southern cocktails that the restaurant has concocted.  My one issue - which puts a bit of a damper on the meal but would probably not prevent me from returning - was the small portion sizes (as mentioned by a few others).  The piece of fish I was served was tiny, as was the quail.  After finishing 2 sides (shared), an appetizer and an entree, I was still hungry! (I'm not a big person).  We ended up going down the street for an ice cream after dinner.

There are plenty of good restaurants in Toronto now that are serving interesting food.  I may give Acadia another shot as I really did enjoy the food and the drinks, but may wait awhile hoping that the portion sizes improve."}
{"text":"Over thought. Under portioned.  Way too expensive. 

Too top it off.  They are so cool it hurts.

One the most disappointing nights out in a long time.

Good cocktails.  Bad wine selection."}
{"text":"Had a pleasant experience here.
Ambiance was great, service was great.  They took our coats as we entered the restaurant, pushed our seats in whenever we got out of them, and folded up our napkins.

The server suggested the tasting menu since it was our first time there, but we decided to order a la carte.  I think the tasting menu may be the cause of other yelpers saying portion sizes were too small. 

We ordered the following dishes:
- snack: cornbread
- appetizer: grits
- appetizer: quail ballentine
- main: poached chicken
- main: sweetbreads

All the dishes were prepared very well, extremely flavourful, and portion sizing was just right. 

Cornbread served was a hefty portion; this is a savoury cornbread, with a pork butter spread.
Grits is amazing - cheesy, with prawns.
Quail Ballantine was delicious, good sized appetizer
Poached chicken was a bit rich for me but packed a lot of flavour.  It came with a hen-egg 'sauce' which was almost a meal on its own.
Sweetbreads were delicious, except it was my first time trying sweetbreads and i did not enjoy the texture.

I would definitely go back again."}
{"text":"....The cocktail list at Acadia is sophisticated and creative.  I tried the Corpse Reviver No 2 (Gin, Lillet Blanc, Cointreau, Lemon), which was tart but refreshing, and the Maple Shack (Bourbon, Maple, Peychauds and egg white) which had a hint of sweetness that was not at all overwhelming. Both were delicious.  For my still-nursing-a-hangover partner, they were gracious enough to whip up an entire pitcher of house brewed Earl Grey iced tea, American style- no sugar. Ordinarily, I would have done the wine pairings ($36), but I had an early morning photo shoot the next day and I didn't want to be too dehydrated or bloated.

We did, however, both opt for the $69 five course tasting menu, composed predominately of tasting-sized portions of existing menu items.  Over the evening, we each received different courses (which is definitely my preference- because we share food anyways).  This is what we had:

Chicken Cracklin' with Hot Sauce and Blue Cheese
Deliciously salty and crispy crackling with a perfect amount of heat, balanced out by the creamy foam.  For those who usually find blue cheese offensive, I found the use of a foam to really temper its pungency, so that you still got that characteristic flavour, without it overwhelming the dish.


Acadia's Cornbread with Pork Butter and Mesquite
Everyone loves the cornbread, and after one bite, it's obvious why. I loved it my first visit, and loved it even more this time around.  The bread had a spongy interior, and a buttery crisp edge, with lots of microscopic pores for soaking in all of the aromatic butter.  And oh, that damn butter. With all of it's savoury, smoky flavour, I cannot imagine a more delicious spread....."}
{"text":"I returned to Acadia for a second meal after a particularly bad first experience.The second experience was stellar and worthy of a five star rating. The food and service were outstanding. I am going to give them the benefit of the doubt that they simply had a bad night the first time I visited. Give the restaurant a shot, they make some amazing food. Original review below. 


Worst Service Experience in 20 Years of Eating in Toronto
* Had dinner for four on the patio at Acadia last night
* Ordered the five course tasting menu with wine pairing
* Sat down at 8 PM and had been served 2 courses by 10:15 PM. I am glad I didn't order the 9 course meal! We would have finished up at 5 AM. A third course was delivered at 10:20 at which point we called it quits. 
* Have I mentioned the portions? Tiny. To say we left the restaurant hungry is an understatement. Should have ordered take out pizza from Cafe Diplomatico across the street and had it delivered to our table on the patio at Acadia. 
* Our waiter, Charlie, was apologetic and tried to make up for the lack of food by overdosing on the wine pairing. While nice of him, we had about 10 glasses of wine sitting on the table by the end of the evening. 
* Our evening was capped off by being delivered a bill where Charlie graciously took off 40% of the food bill. Unfortunately, there was no concession for the ridiculous length of time it took to be delivered our three courses. 
* It was $200 dinner for my wife and I that needed to be supplemented with a bowl of cereal when we got home. 
* Clearly Matt Blondin leaving Momufuku has left the kitchen in disarray. 
* Charlie - thanks for the laughs. We will see you at your next restaurant."}
{"text":"Acadia is a buzzworthy new restaurant.  The hype around it is about equal to the frenzy around Woodlot, last year.  And like Woodlot, it continues the just-off-College St. trend, and probably the I-tried-it-too-soon personal trend, for me.

The Southern inspired cocktails are fantastic.  Try one, try all.  They are carefully concocted and exceptionally executed.  

Acadia's actual food fare ranges from mildly acceptable to absolutely outstanding.  

Boudin Balls with Red Pepper Honey are fried dirty rice balls with a hickory-tinged deep-red sweet-sour dipping sauce.  They are life changing.  You must try them.  

The other game changer is Anson Mills Grits & Shrimp.  This take on a traditional southern comfort dish will literally blow your mind.  It's like nothing you've ever tasted before.  The grits are smooth, the shrimp are perfectly cooked and the presence of oyster mushrooms and pimento cheese is subtle but definitely felt.  A pool of ham hock consommé floats atop, with a soft and subdued salty and porky flavour.  I had one bite when we ordered it in an array of appetizers, and knew I needed it as my main dish. 

Back to the beginning now, to summarize the entire experience.  

The complimentary starter plate, with a variety of lightly pickled vegetables like okra, green beans, potatoes and beets, was nice.  So were the boiled peanuts it came with.

Northumberland Straight Scallops were tasty.  The chicken crackling was a nice touch, since it's impossible not to love crispy skin. Chesapeake Bay Crab was just okay.  I thought the crab tasted a bit fishy though.  Neither are particularly memorable dishes.

I had some tastes of other mains off my friends' plates.  Red Grouper and Nagano Farms Pork Ribs bites were amazing - especially the ribs.  But, it was really hard to get past the portions sizes once the (beautifully presented) plates are put in front of you.  They were ridiculously small for the price.  It was borderline laughable.  It actually left a bad taste in our party of 10's collective mouth.  No matter how good the food was, it was hard to get past this.

There are a few kinks that need to be ironed out.  I suppose that's to be expected for a newly opened restaurant.  The room needs some life injected into it, and the service, while friendly, needs some polishing when it comes to things like pacing and dealing with a couple credit cards on one bill.

Acadia is good, sure, but it has the ability to become great.  I'm looking forward to seeing what their Fall menu has to offer."}
{"text":"I must say this is one of the best restaurants in Toronto. I want to give it 4.5 stars but alas Yelp does not allow this. But this place truly deserves 4.5 stars. 

First off, the staff is great. Very attentive and detail oriented. One of the things that I always appreciate with restaurants is when the staff changes the cutlery with each dish. 

I did not take the 5 course tasting menu the first time I came here since I was told that the tasting menu is basically off the regular menu and I prefer to have control. I like tasting menus but I need to know what's on it...if not the full dish details at least the ingredients. 

Out of all the dishes, I would say 3 were fantastic 1 was good and 1 was ok. This is something that only really good chefs can achieve. To be fair, the one that was ok just didn't work for me. The effort was there, the skill was there in terms of putting the dish together. How it was prepared was perfect, it was just not to my taste buds. I think it is important when reviewing restaurants to make this distinction. Just because I did not like a dish does not mean the dish didn't work. The key is was it prepared correctly. One thing I must say, all the dishes were prepared well with great presentation. 

One of the best things I like about this place is price to quality. It is the price and the quality that is delivered that places this as one of the top places for me. The portions are nice and the pricing reasonable. I have been to countless restaurants that price similar dishes higher with less portions...see my review of Ursa. 

All in all I think everyone should try this place. My favorite dishes here were the beef three different ways, the smoked sweetbreads, and the grits. I have been back 4 times now and satisfied every time. 

Sometimes Chefs have off days and on days, in my case it has been consistent and excellent every time. I highly recommend this place."}
{"text":"My husband and I had an amazing dining experience at Acadia tonight!  Service was outstanding and  the food was delicious. We had their five course testing dinner, and it was fantastic!!  We can tell that they put lots of thought and love into every dish they served.  We highly recommend this place and we will be coming back. Thank you!"}
{"text":"Acadia refers to a francophone region that covers Eastern Quebec and the Maritimes in Canada, spreading itself through Maine, the Carolinas and event as south as Louisiana.  The cuisine is classified as 'lowcountry' and has already made an impact as a restaurant in an Acadian region of the US was selected as the best new restaurant of the year. 
Here in Toronto, Acadia is the latest addition to the College and Clinton block, non descript, homey restaurant slightly tucked away from the busy corner. 

The immediate warmth felt is met by the hospitality as we walk in and we are told about the secret tasting menu which both my sis and I cannot resist so we don't even look at the menu and charge ahead with the tasting.  3 appetizers, 2 mains, 2 sides and 2 desserts OMG!! 
Chef Matt Blondin formerly of Colborne Lane, created a small menu but of dishes, seafood heavy, with ingredients that seemed foreign to me and thus started our culinary adventures through Acadia!

The first thing to arrive at our table is a bunch of pickled snacks including okra, string beans and bell peppers.  We are told to use our hands and dig in which we do and already are satisfied and anxiously anticipating our dishes.
The presentation of our first starter is interesting and attention grabbing.  Served in a clear glass bubble shapped bowl was our Chesapeake Bay crab.  Served in a broth with dollops of bright yellow chow chow, to a whipped white buttermilk and foam; it is a gorgeous dish to observe as it is sophisticated to eat.
Next up is the Northumberland Strait scallop - one sliced thinly in half with crunchy chicken crackling, shavings of parmesan, watermelon rind and arugula served up on a grey plate.  It looks like a painters palette with one paint colour which is the scallop.   It was a delicious dish, clean flavours and nice textures.  It made me want much more!   This was actually a bonus dish for us as it usually isn't placed on the 'secret' menu.

The big highlight for me was  Anson Mills Grits and Shrimp. The flavours were absolutely amazing.  The grits are velvety and smooth, sitting in a delicious consomme packed with flavour from the ham hock it was made with.  The shrimp is done well and oyster mushrooms and  pimento cheese round out the flavour.  This dish is a stand out and a must have! 3 down... 2 more mains and sides and dessert to go!
Albacore tuna comes out as one of our mains with chickpeas and plated with brown butter hollandaise.  This was a lighter main which was appreciated.  The Nagano Farms pork ribs are our second main and they are amazing.  Sticky with a sweet and smoky flavour served with thinly sliced leeks. 

But it doesn't end there - we are presented with rectangles of sweet potato corn bread that was hot and freshly baked.  I have such an affection for corn bread so it was such a bonus and there was some spice in them.  What a great surprise.   
Then our small plates came out... 3 Boudin balls were were insanely good - like dirty rice balls - served with a side of smoky roasted-pepper honey.  They were de-lish-ious!!! 
I can't wait to come back and try more!"}
{"text":"Excellent southern style short ribs.  The portions are perfect for sharing. A great find close to the College St strip, but not your ordinary College St grub."}
{"text":"Service was good...Attentive, food service came out at the right time.
Food: the lowdown was that it was mediocre. Overall poshed up with very standard ingredients...I'll give credit to the chef who I believe is young, and trying to do his/her own thing...You eat with your eyes, but most importantly you eat with your mouth....taste was lacking.
Maryland shrimp: above average, well cook, and delicate seasoning
Cornbread: Maybe it's not my thing, but the bourbon butter tasted more like pumpkin baby food...not very appetizing with very gritty cornbread, too sweet for my palette.
Cured trout appetizer: too pretty and not easy to eat. Interesting combination of raw yolk with smoke trout...but over all the balance was missng.
Steelhead Main: ok, small in portion, fish cooked well but condiments did not go too well with it. Individually tasting the sauces had a very bad aftertaste. eg. Almond mayo just doesn't work!

Warning: $6 dollar charge for tap water!!!"}
{"text":"After I head news that Matt Blondin was leaving I coudln't procrastinate any longer and decided to try one of the hottest restaurants in Toronto this past year. 

The service is impeccable, when I made the reservation I mentioned a couple of dietary restrictions my SO had and upon being presented the menu they remembered and mentioned wihch dishes we would not want due to those restrictions. The whole night our server was attentive and very easy to deal with as we enjoyed our evening. 

The food was pretty amazing, the style and taste had the caliber of a highend Michilin star restaurant without any pretentious attitude given at the restaurant. I know a lot of people complain about the portion sizes but if you do an appy, entree, sides, and dessert you'll be just fine. Just don't expect to go here and dine out a budget because you will need to order enough for yourself to truly enjoy the experience. 

We tried the famed Shrimp and grits and although I never like grits when i travelled down south this version made me wanting more. Another appy we tried were the quail which again was spot on and very tasty. For entres we did both fish dishes and both were cooked with perfection and presented in such a haute couture manner. I really was confused and had to think where I was again. We did a side of their cornbread and yes they are absolutely delicious. Dessert we did the Lemongrass pudding which was light, sweet, and exotic that really helped finished off the night nicely. 

Sad to see the chemistry change at this restuarant but I hope they keep everything together after Matt Blondin leaves. I would certainly be back."}
{"text":"Phenomenal experience, hope they can keep up the quality once Andrew leaves. I almost ordered a second helping of the grits, couldn't get enough. The pickerel was perfectly cooked and had very nice sides. Service was enthusiastic and helpful."}
{"text":"I've been dying to go to Acadia for ages and finally made it there with my family last weekend. Service is warm and friendly, just like their cozy space!

Our party of 5 started out with some cocktails which were fantastic. Among other things, if not almost everything, they also make their own sodas! I tried the ginger beer  with a nice bourbon - YUM.

We started out with their cornbread which came with a pork butter (I think?) anyway, it was delicious. Don't miss it.

For mains we ordered the duck x 2 (AMAZING!), beef cheek (was so moist and tender!), the clam bake (great),  and the blackened white fish (my dad wouldn't share it so I guess it must've been good). 

We also ordered sides and shared with the table - shrimp and grits (so good, so creamy!), collard greens (really good as they come with thick bacon), a lobster rice dish with squid ink (so flavourful and rich!!!) and scalloped potatoes (was okay, presentation was fun and different but standard dish). 

We were also celebrating two birthdays so one of each dessert seemed necessary - lemon curd tart - outstanding, a peanut butter and chocolate ganache - so freaking good, and an apple tart - was like apple pie, standard. 

Can't wait to go back!"}
{"text":"I was curious to find out what a restaurant that specializes in Southern food was doing in Toronto and so I headed down to Acadia with two of my friends. I walked away feeling as if this place could easily get 5 stars with a few adjustments but it missed the mark a few too many times to be anywhere close right now. 

Atmosphere/service - I really like the look of this place. Many of the recent restaurants opened by young chefs have overdone the hipster look - exposed brick walls, dim lighting, chalkboard menu and the feeling like you are sitting in the kitchen. This place does things a bit differently. It is spacious and brightly lit, the menus are presented to you at the table and the kitchen, while exposed for viewing, is off to the side, away from the main dining area. On the service side, I was very impressed. Both the waitress who took our drink order and the waiter who helped us with our food were incredibly polite, knowledgable and efficient. 5/5 stars

Food - This is where the restaurant is more of a mixed bag. 

Starters
Whitefish Boudin Balls - I had high expectations given the glowing reviews the sausage version of this dish received but it completely missed the mark. They were way too fishy and one note - it was like I was eating an unseasoned fish. I would never order these again.

Grits - Holy shit these were incredible. The creamy texture of the grits mixed with the perfectly cooked shrimp was a little bit of heaven in my mouth. 

Quail- Like the whitefish balls, this was entirely unimpressive. The quail was a bit overcooked and was rather bland. The accompanying grapes and other random stuff on the plate added nothing to the dish and was in fact, quite a distraction given its disparate flavour profile. 

Cornbread - As with the grits, holy shit this was good. I have always thought of cornbread as this dried out toast but my mind has now been changed. These were fantastically fluffy and I wanted to eat many more pieces after we had finished them.

Mains
Veal cheek - Impressively tender given the cut of meat but incredibly one note. The dish was far too sweet and was begging for something to cut the richness. Once again, a big miss. 

Albacore - Fortunately, my friends ordered this dish and let me try some. Now that was impressive. In fact, I don't think I've ever had such perfectly seasoned and cooked tuna anywhere before.

Now given how high the highs were and the impressive service, I would be inclined to give this place 4 stars even given the three misses. However, I can't do it for one reason - portion size. For the prices we paid, everything should have been 25%-50% bigger. After finishing this meal, I was still hungry and that is never a good feeling. I would go back again just for the grits and cornbread alone but I will never be fully satisfied with this place until they give me more food."}
{"text":"I had dinner here last week and have to say I was very disappointed. Having read about this place many times and all the great reviews I thought I was in for something special - this was not the case.  The place wasn't very busy and yet we were seated at the back of the restaurant right next to a very loud table. It also took a while to get our drinks and our actual order in, it seemed as though they were deliberately delaying taking it in order to give the kitchen some time perhaps. The food was ok with the exception of the chicken which was delicious (although I didn't need all that waffle) and the one thing I wanted to try for dessert they didn't have. Even though there were only two selections to begin with. Biggest complaint by far is the noise level. I couldn't hear a single thing all night and was actually exhausted leaving the restaurant from yelling. Glad I checked it out but I don't need to go back."}
{"text":"Yet another place I've been to where the first time was 5 stars, the second time 3, so they end up with a 4.

Food is good, but really small portions so don't expect to walk away full.  This is almost like a grazing-restaurant.  First time, drinks off the cocktail list were great; second time, they were - I hate to write this - too boozy.  It was basically not a cocktail but just straight up alcohol.  I like the ambience but I find the service too friendly and a little intrusive."}
{"text":"Sequels have never been my favourite because they are generally cheesier, a money-grab, or worse than the original.  The only exception was probably the sequel to Rush Hour and now, Acadia version 2.0.  While ownership has not changed, in a game of chef's musical chairs former executive chef Matt Blondin left to join David Chang's Momofuku outpost in Toronto and Patrick Kriss (formerly of Splendido) would be directing from here on out.  Lights, camera, action!

Before I delve into the details I will divulge that my first experience was à la carte versus this second time where I splurged and went for the tasting menu.  At $69 for 5 courses, I simply could not resist.  If you want to go over the top, you can add the wine pairings for an additional $36.

The service here was very attentive and the staff were very knowledgeable and helpful in answering questions about the dishes, drinks and making suggestions.

Of the many drinks we consumed that night, I particularly enjoyed the Maple Shack composed of Bourbon, maple, Peychaud's and egg whites.  Not overly sweet with hints of vanilla.  The Ain't No Sunshine came in a close second (Gin, Strega, lavender honey, lemon + thyme).

We started off with a plate of Chicken Cracklin' (hot sauce, blue cheese) and Crispy Pork Belly (rosemary, black peppers).  While I do love me some melt-in-your-mouth pork belly, I enjoyed the cracklin' a lot more because of its crispiness and the bit of zing from the hot sauce and blue cheese combo.  It's like having fried chicken but eating only the tastiest part - the skin!

The good thing about getting the tasting menu at Acadia is that they mix things up so you're not all stuck eating the same thing; this also means you get to sample more.   For the rest of the evening we would compete to see who got the best dish from each course.  For our first course we feasted on the Pickled Mackarel and Pork Rillette.  The award for best cinematography definitely went to the mackarel served with a southern mirepoix, yogurt, fried smelt, Carolina gold rice and pork vinaigrette.   The piping of yogurt made for a very fancy presentation - like a string of pearls alternating between white and Tahitian black pearls.  Texturally, I found the skin to be a bit chewy and some may even say it was a very fishy fish.  The rillette composed of a duo of pork (head and smoked loin), horseradish, mustard and cornichons with crunch slices of crouton.  The various textures of the pork made every bite interesting.

While waiting for our second course we were brought a plate of Acadia's famous Cornbread with whipped pork butter and mesquite.  Why stop at just plain butter right?  

Next up were the Ricotta Dumplings and Anson Mills Grits.  The grits were something I was looking forward to (having had it the first time I dined at Acadia).  While I always thought that Cantonese congee was a delight in a bowl, they don't hold a flame to these cheesy, creamy grits cooked in a pork hock consommé with chunks of gulf prawns.  We couldn't keep our spoons down!  The dumplings lost the race for the leading role and got casted off for a weaker supporting role.  The flavours of the ricotta dumpling were very mild and subtle and just faded into the background once we spooned into the grits.  As the critics would say...the performance was forgettable.

\"Third time's a charm?\"  Well Acadia certainly charmed me with their Charred Octopus with pickled side striped prawn, orange, chili, Belgian endive and peanut dish.  The octopus had a nice crust to it without compromising the integrity of tenderness.  Presentation-wise this was my favourite dish of the night with it's bright oranges and yellows.  The other dish brought out during this course was the Smoked Sturgeon, a steak-like fish served with cuttlefish, sunchoke, Volte Face, grapes + mustard seeds.

This course proved to be the toughest one to judge in terms of a clear winner as both dishes were delicious - so we ended up with a tie.  The Roasted Veal Sweetbreads were served with tender slices of tongue, corned cheek, red cabbage, pumpernickel + Russian dressing.  I am always happy when offals grace my plate because they are so delicious when done right and so terribly gross if you overcook them.  The Beef Striploin made for a sturdy meal with spinach purée, creamed mushrooms and pickled Cippolini to match it's boldness.

I can tell you that we enjoyed both the Pear Sorbet served with brown butter cake and the decadent Dark Chocolate Ganache made perfect with peanut butter and Maldon salt. Watch out Reese's!

While Acadia wouldn't win Picture of the Year for me, it definitely tops the list of nominees for my food memoirs for 2012.  The food is all well-executed and flavours and textures are considered in the grand scheme of things to create the masterpieces that are put forth before you.  In the word's of Arnold Schwarzenegger \"I'll be back.\" *Cue exit music*"}
{"text":"So much hype, so little in return.  I was looking forward to trying one of \"Toronto's Alleged Best\", I was disappointed, leaving the restaurant thinking - what did I just eat?

Upon their recommendation, we had the Tasting Menu, which had a little bit of everything.  Considering the little portions, they did serve up a little bit of everything, which was nice and was filling enough towards the end.  

Flavours were nothing too special, STEAK, ROASTED VEAL SWEET BREAD (this was actually my favourite), RICOTTA DUMPLING (this was weird, frothy and like a blown up rice kernel), \"ACCLAIMED\" CORNBREAD (was dry, flavourless, and coarse), CORN GRITS (this was the other tolerable dish, good in flavour but very small in serving)...

They served a whole bunch of forgettable stuff.  I love the culinary experience in Toronto, but this should definitely not be voted one of the best restaurants and must try's in Toronto.  I heard they changed up their chef - maybe they should change it back?"}
{"text":"I'm going to try to make this short and sweet.  Otherwise I'm just going to have good intentions of writing a review that never happens. My fiance and I went to Acadia while on a trip to Toronto based on the Yelp reviews.  We couldn't have been happier.

One of the highlights was our hostess/waitress.  She was a great blend of smartass, informative, passionate, and professional.  

I'm a fan of bitter drinks. I ordered the \"Baselines\" drink: Kentucky rye, amaro nonino, charred pineapple, mint.  Really good, and very smooth.  A bit too smooth for my taste; I like a little more bite. My second drink had something to do with Sazerac. Nice and bitter.  Both were great, though.

We got the cornbread and bacon butter.  Both of us loved it.  We're from the south (in the US), and they did a good job.  We got the chilled almond and grape soup as an appetizer and the flat iron steak for the entree. I loved the soup.  My fiance liked the taste but wasn't big on the texture. The flatiron steak with eggplant purée was amazing. 

All in all a fantastic meal with great wait staff. They replaced our silverware a couple of different times, and when I got up they refolded my napkin.  Nice touches. FWIW, we like lots of different foods and consider ourselves \"foodies\" (more or less).  The food here was cooked really well, and the flavorings were subtle and succulent.  We would definitely come here again."}
{"text":"I took my brother to Acadia on his Birthday, we had a great time.
The atmosphere was like a country kitchen, just a tad bit dimmer. 
The open kitchen invited us to watch the chef's scramble as they made our food. It was great to see them hustle and bustle, and it was evident in the dishes they offered.

The menu was seafood heavy, nothing wrong with that. Meat lovers had their choice in ribs, veal, and quail, so there was choice! 


Pre App:
We were first given an assortment of house pickles with roasted peanuts. I thought it was a nice touch, who doesn't like free food?

Then we had our cornbread which were sliced into triangular wedges and served with sweet potato butter. It was fine, nothing special and the butter didn't have the potato flavour I expected. 

App:
I had a stuffed quail for my appetizer, it was tasty, but small. The greens sitting under the quail were delicious. I also tried the scallops which were cooked to perfection and plated nicely.

Main:
My entree was the rainbow trout. It was artwork served on a wooden plank  and it reminded me the Canadian outdoors. The looks matched the taste and flavours. The trout was incredibly fresh and moist. The Grouper and Veal were also good, but weren't as interesting as the trout. I was happy with my choice.

Dessert:
For dessert, we had the sugarpie. It's like a butter tart with ice cream on top, dee-licious.

Overall I had an enjoyable time at Acadia. The food was good but pricey for the portion sizes. The servers were very helpful and polite. The pacing between each course was good and allowed us discuss about what we just ate. A great experience, warm atmosphere but a bit pricey (even distilled water was $3.00 a pop)."}
{"text":"Acadia is a breath of fresh air amidst a backdrop of so-so Italian cuisine and some Jersey Shore-esque martini bars. 

Situated steps from the legendary Cafe Diplomatico (I saw Paul Giamatti there once and I don't lie), Acadia has a vibe that it owns. Despite a really complex menu that should come with a thesaurus for those of us who are not well-versed in \"foodie\" language and drink concoctions you'll quite literally never see anywhere else that run about $14 per cocktail, Acadia is not snobby (ahem....Pizzeria Libretto....ahem...), the service is fantastic and the food....well, oh.my.God. 

You know what the food was like? You know when someone tells you something shocking and you say \"Shut Up!\" even if you want them to keep talking? It's kind of like that. You bring a forkful of those delicious grits (which one can only assume are made of rainbows, happiness and the love of a good churchgoing woman who volunteers a lot) and you swirl them around in your mouth a bit and you swallow them and you go \"Shut Up!\" Or, you bring a mouthful of sweet potato ice cream to your mouth, just below your nose where you inhale it's intoxicating scent, which I assume is a combination of \"always being right\", \"winning every arm wrestling match, ever\" and \"all of your dreams coming true\" and you're just shocked. I've really never tasted anything like it.  

In my case, at my first taste of grits, I actually uttered an expletive which I won't repeat here, but in the nicest possible way, of course. 

If you're in the mood to step out of the too-comfortable pizza/wings/nachos rotation many of us find ourselves on, check it out. It's really, really amazing. You'll also sleep really well after, on account of the fairy dust I assume they sprinkle on you on the way out. Dreamy & out of this world."}
{"text":"Unexpectedly delightful. We ordered corn bread with butter which was good but not as good as the grits- holy ****. Pimento cheese- who knew? Order the grits. Also ordered octopus as appetizer which was excellent. Mains were: pasta- sublime and complex. The beef was excellent. Dessert- Acadia's version of a grown up Reese's PB Cup was plate licking good. I don't know how often I will return as the menu is small,  but the grits were tasty enought that there is a strong chance."}
{"text":"Going to churn this review out, even though Acadia is now closed, since it has been sitting in my drafts for some time.

Came here as a group for a birthday party and loved it. Sad to hear the place seemingly went downhill from then.

We contacted the restaurant in advance and they gave us three-course and five-course prix fixe menu options ($49 and $69 respectively). Each menu had roughly three options per course (two options for dessert).

We went with the three-course and I had the following:

First Course: 
Charred Octopus, Crispy Pork Belly, Tomatillo, New Potato, Spicy Collards, Black Vinaigrette

Second Course:
Beef short rib (didn't take good notes here...)

Third Course: 
Dark Chocolate Cremeaux, White Nectarine, Milk Sorbet, Pistachio

Everything was AMAZING. Also tried the \"celery stalker\" and \"blackberry sour\" cocktails which were super tasty.

Also tried the cornbread with pork butter, the grits and the ricotta dumplings, which were also delicious. They were also awesomely accommodating for vegetarians by offering a vegetarian version of every menu item (e.g., mushroom consomme with the grits instead of the ham hock version and a separate sweet potato butter in place of the pork butter).

Uber friendly service all evening - the only minor hiccup was plates were served to the wrong people a couple of times. 

The resto automatically charges an 18% gratuity for groups of 6 or more, which we didn't notice, but then the server very kindly pointed out that we had overpaid.

Kinda sad to hear the restaurant has closed. Hopefully whatever replaces it will be just as good."}
{"text":"This is the four star restaurant you will never visit twice, if you make it the first time. Here's the low down on why I had to give it three stars...

1. The food is very good and artfully prepared.  The seafood dishes have more creativity than the beef dishes. The desserts are similar to other places in town.

2. The portions, as have been mentioned, are small. In fact, my 69$ five course tasting menu would not have filled me up, were it not for a serving of cornbread in the middle of the courses that was all out of proportion to everything else served. The cornbread was delicious, but two pieces of the stuff exceeded any two of the courses in size.

3. The cocktails are very good. They range from 11-15$. The Southern Mule was a good starter.

4. The ambiance is terrible. The dining area looks like they had less than a week to set up shop. Aside from low lighting, the place looked like a bare room that had some tables put in it. The tables and metal chairs look cheap, and the chairs are very uncomfortable. Nothing about the dining room matches the food or the prices thereof. The place does not invite you back.

5. The service is good, but not spectacular.

The conclusion for this place is that it misses on value. For the same money, you can have a white tablecloth meal and five star food and service at the best restaurants in town, and all of this while leaving full."}
{"text":"Amazing!    BF and I decided to visit Acadia last minute on a Thirstday and although they were fully booked, they worked things around to accommodate us at the bar.   


BF and I decided on the tasting menu and were glad we did.  Unlike most other tasting menus, we each received different dishes essentially doubling the tasting options.  Fantastic idea.  Every dish was perfectly presented with the flavours to match.   Became my BF's favourite all-time meal, superseding his previous from four years ago at now closed, Harvest, in Prince Edward County.   

Service was attentive and professional without being stuffy and it has a great atmosphere.  

It is expensive but worth it.   Go."}
{"text":"Steps away from the traffic of the College Street strip, the drunkish, university students out on the prowl and (arguably) mediocre Italian food, lays a gem of extraordinary proportions.  I can now see why Acadia made number 2 on the Toronto Life Best New Restaurants list in 2012.... Commence kicking of oneself that I waited so long to try this place.

On our way in, Dinner Stud and I were instructed by smokers outside to get the Shrimp and Grits, actually we were commanded to.... I guess we're the obedient types because once we had be greeted and sat by the friendly host, we settled on sharing the app.  We also agreed to share the Barbeque Beef Cheek and the Buttermilk Fried Quail with sides of Collards and a Lobster/Rice/Squid ink concoction. 

The grits were luxuriously creamy with well-seasoned shrimp and oyster mushrooms.  My only complaint is that there wasn't more of it... Guess sharing wasn't the way to go on that dish.

The Beef Cheek was so tender it basically fell apart as soon as my fork touched it. Knife rendered utterly useless, I was speechless as it hit my lips.  Buttermilk Fried Quail on waffles was an excellent introduction to quail for me, there really is something about deep fried poultry. The spicy maple syrup was a zingy, sweet touch.  Collards were hardy and delicious, was that because of the greens or the bacon?  Who's to say?  The Lobster/Squid ink/rice whatever it was... honestly, wasn't my favourite. Dinner Stud and I agreed, the ink was distracting. But I think for others it would be an excellent choice as it came highly recommended but just missed the mark for us.

We sipped away on our Kensington brewed Baldwin FishEYE PA and left happy and eager to return.  This place is a must for foodies that love them some American soulfood.  Also worth noting is that the patio would be quite lovely in the summer months.  Ah summer, come back soon!"}
{"text":"I came here with a large group and Acadia managed to win over the pickiest and least \"foodie\" member with ease. We all really loved our food!

I didn't think the portions were that small. Although the plates were a bit expensive, I wasn't expecting a cheap meal.

Every bite of food I had was amazing. We ended up ordering most of the items on the menu given that the group was so big. Every item, from the mains to the sides, was exceptional and there was no dish that we wish we had skipped.

The dishes are presented beautifully with true devotion to detail. 

Highly recommended for a special occasion dinner!"}
{"text":"When we heard they were closing doors for good, we decided to pay a visit to a once considered toronto institution for innovation. It seems like they have been through a few chef changes over the 3 year run and they finally decided that now is the time to try something more approachable and in line with the neighborhood they are in. 

We were very keen on the tasting menu but decided against it at the last minute since we were not too hungry. Apparently they serve you different dishes if the table opts for the tasting menu. The place is very unassuming and has an easy going vibe. We ordered the shrimp and grits and some cornbread with pork butter. The grits were nothing memorable but I liked the addition of the mushrooms. The cornbread was a huge portion and took some time since they bake it on demand. I was thrown off by the smoky taste of the pork butter and the heaviness of the corn bread. 

For our main course we had the mushroom and hominy dish with generous shavings of black truffle and farm egg. I loved the earthiness of the mushrooms  but it wasn't something I have not had before. 

Our service was top notch all through. For dessert we were in a dilemma between the apple crisp and the lemon tart. Our meal had been so rich that we opted for the lemon tart to cut the richness. To our surprise we were also served a small tasting of the apple crisp which was a nice touch. 

It's sad to see them close but I wish them well in their next venture."}
{"text":"We went to this restaurant on October 27, 2011 

VIBE 
For some reason, I thought this restaurant would be way down on Clinton for that \"unassuming\" vibe.  That said, it's just a wee bit north on Clinton across from Café Diplimatico's patio. Acadia's location is a pleasant surprise and a much needed addition to the dying College St. scene.  I felt like I was going to a friend's house for a dinner party. We were immediately greeted by a hostess and had no problem waiting for a little bit. She got our jackets and immediately seated us. Additionally, she was knowledgeable about the menu.  The place is very simple. Wooden tables, blue and white checkered napkins and a very low key crowd (we did go on a Thursday). The crowd was a bit older. Gray haired groups of friends came but young couples and friends hanging out were also dining here.  We had a friendly, funny waiter. When we asked about how something was rated on the menu, he said \"above average.\" I love that.  And ladies:  if you want to flirt with a cute waiter, this is your place. The staff is 98% men in their twenties.  You can bet your French Canadian heritage I'm coming back! That said, all staff were very professional and there were about four different waiters helping us with our menu but not in an annoying over your shoulder the way. I'm not complaining! They were so attentive. For instance, when we were out of our seat they made sure that they folded up the napkin; it was also nice to have someone to talk to while waiting for our dining companion to return to the seat.  Brava! 

WE ATE 
So the menu changes on the regular. No boudin balls for me. I like that Chef Matt Blondin wants to mix it up. It keeps the menu fresh and the diners on their toes.  .  We ordered all sides, one appetizer and one main. We got the pickle dish to start, complimentary.  That was a nice surprise. We were then handed our side order of the cornbread with sweet potato butter. It was a refreshing bread dish and my friend loved the sweetness of the butter, but it wasn't for me.  For an appetizer we had the Northumberland Strait Scallops - chicken crackling, parmesan crisp, watermelon rind, basil. The scallops were cooked perfectly, but we both noted there were a bit salty.  
Our main course was the Vidalia Onion Tart - lightly smoked gruyere, caramelized hops, green apple, assorted lettuces.  I could not get enough of this dish!  And it's fantastic as a vegetarian option (I'm not veg by the way).  We both noticed that there was a bit of an absence of the gruyere but we could smell it on the dish.  The pastry was perfectly baked, not too flaky but flaky enough. And it was hot out of the oven. Such a comfort dish. I could have ordered two of these! 
Back to the sides. Chris Nuttal Smith (restaurant critic for Toronto Life) raved about the Collard Greens - pancetta, licorice cream - and they're great! Five a day right? The cream doesn't take away from the greens.  My favourite side was the Farro \"Succotash\" - wild mushroom, truffle oil- it's no surprise I love my truffle oil and it did not disappoint! A great rice dish. Seconds please! 
Acadia also has a great drinks list. The malbec was strong and was a great companion to our meal. I also opted for the \"To Dew List\" cocktail, with gin and honeydew. It was absolutely dew-licious! 
This is a big contender for the birthday dinner.  Excited to come back here. The waiter said that the shrimp and grits was a popular dish and I'll be trying this next.  Compliments to Matt and his team for a great meal. 

OBLIGATORY CATCHY REMARK
Any restaurant with cute, single wait staff has my attention. But you have a return customer when you have the whole experience, French Canadian and cute wait staff or not. But French Canadian doesn't hurt.  Big winks.  If Acadia isn't on En Routes top Canadian restaurants next year (if they can keep up their game), I'll be surprised."}
{"text":"I loved the shrimp and grits appetizer.  It was awesome.
I hated the Boudin Balls and there's WAY too much truffle oil in the Farro. Service was great, but they should have asked why we left the Farro untouched."}
{"text":"Not being from Toronto, I hadn't heard anything about this place. The first thing that struck me was the size of the kitchen, (which is open) compared to the amount of seating. My first thought was - not a good place to come to when really packed, I can imagine the line cooks getting in the weeds pretty quickly. The decor was nice however a bit generic. Some nice photos on the walls and pleasant interior lighting. We sat outside as it was a perfect night however I found the generic garden furniture a bit low brow for the menu.

For appetizers we all shared the charcuterie, gazpacho and pickled mackerel 
The flavors in each of these was very good but was a bit off put by the slate plates that 2 of the apps were served on. My first thought was old roofing, maybe some people go for the rustic thing. The gazpacho was served in an oversized glass mixing bowl which simply boggled me and really detracted from the beautiful red color of the soup. The next thing I noticed was the portion size which I found to be a bit light.

For entrees we had The flat iron steak, tomato tart, trout - I had the pork loin and confit pork belly. There was not much sharing at this point because we were all really hungry having waited over 45 mins for the entree to come out. I believe the kitchen was having technincal issues. I tried the steak which was good but quite rare. Note that the person who took the order never asked what preference to cooking the orderee had. My pork loin was good but a bit more rare than I like it. The pork belly would have done well being in the confit for a couple more hours as the fat was a bit chewy and the meat was tough. The flavor was nice but the portion was under 5 oz total with an artful but skimpy garnish. The person who had the trout complained it was cold by the time it had reached our table.

We ordered desert, I had a bourbon, which I might add they have a good selection of. Again the oversized glass bowl came out for a strawberry shortcake and I was like....really?

Overall we spent 3 hours here, they struggled to produce an order of cornbread, but it did finally come in between the entree and desert. I felt the price point was too high for what we had however I could tell the chef is talented and creative. One of our waitstaff never smiled, the other was really stiff but professional. The FoH manager was really great and kept a good facade going, thanks. Over all I think if you're looking for a great scratch meal you could do better maybe someplace else? I could see this place being great for a very light snack and cocktails. The bar options were pretty cool (house made tonics) maybe it was a bad night for them, I understand all about bad nights in this industry but 3 hours is just too epic for a full meal when the restaurant is about 1/3 capacity."}
{"text":"Had a great meal at Acadia. The food was flavourful and well presented. The portions are a bit small though. 
We ordered the grits, ricotta dumplings and the pork. Cocktails were yummy, and the service was great. 
Only problem with this place is the decor. It's very basic. They should spruce it up to match the food."}
{"text":"I came here with my fiance and parents a couple of months ago, and we got sold on the tasting menu when we sat down.  I'd probably give Acadia 4 stars if we had ordered a la carte.  Overall the food was solid.  While few dishes were outstandingly memorable, all were good.  I particularly enjoyed the the quail and sweetbreads.  The cocktails are worth trying too.

Now as to the tasting menu.  I understand 'tasting menu' dinners to be something special.  The tasting menu here is essentially smaller portions of almost everything on their menu, but there isn't anything you can't order on the menu.  It comes as two 'sets', where each set contains roughly half the menu.  It's not a bad way for 2 people to try the entire menu; assuming you're willing to share food.

With 4 people, each set gets duplicated.  Assuming you're willing to share food, with 4 people you can almost order everything on the menu anyways for less than $70 a person that it costs for the tasting menu.  It's really not worthwhile.

Now the really big complaints:

1. Like other fancy 'tasting menus' I've tried, the server asked about dietary restrictions.  3/4 of my family are lactose intolerant, the server understood this clearly.  While they made an effort to remove the dairy on some of the mains, the two deserts were both cream heavy, and were served as is.  Had we not gone for the tasting menu, we could have not ordered 3 $10 desserts that we wouldn't have eaten.

2. I'm not sure if they were trying to compensate for us not being able to have dessert, but the next party arrived at the door shortly after we got our dessert.  This is the only time I've been hurried out the door in a tasting menu meal."}
{"text":"I walked into Acadia Restaurant and I felt right at home. Even as a single diner, I was welcomed with open arms ... and even I only ordered an appetizer and a side.. the waiter still really accommodating and offers me excellent services! He even worried that I was bored by letting me read a foodie magazine about Ramens :)

Acadia's menu is simple and unique, blending Maritime seafood with a Cajun flair. They also offers a 4 courses Chef's Choice menu! With the help of my waiter, I decided on: 

Cornbread with Sweet Potato Butter ($5) soft with great texture and has this fresh out of the oven fluffiness...and sweet potato butter?!!! I wondering can I get this anywhere else?!! 

Boudin Balls ($6) hmm hmmm... deep fried pork sausage with rice was sinfully delicious. The red pepper honey dipping sauce was sweet and with a sour after taste. 

Chesapeake Bay Crab ($12) is a cold appetizer that has a delicately balanced taste. But I probably would skip that next time and try out their Northumberland Strait Scallops instead! 

Great selection of crafted cocktails with most of them with a southern twist! I definitely need to come back just for some cocktails! 

The complimentary appetizer with the different pickles vegetables was a nice touch.. but I love complimentary things, especially if they are that tasty and refreshing!!! 

The deco is simple and rustic... and love the open kitchen setting as you can see the chef busy preparing my meals!!

I highly recommended trying out Acadia if you looking for a different dining experience!!"}
{"text":"I was here a few months ago (with Patrick as chef). Acadia featured some of the best food I've eaten in Toronto: complex, well-executed, and above all, tasty. That said, portions are absolutely TINY, especially considering the price point. I'm not exaggerating; in 39 other Yelp reviews, I don't think I've ever complained about portion sizes anywhere. We left hungry after eating three courses each, plus a \"snack.\" Patio out front was nice but the dining room looked like a miserable place to eat. Mint julep cocktail was okay but was served in a dinky plastic imitation of a real mint julep class. Quirky service and extremely slow.

All in all, the food saves Acadia from being forgettable. Not in a rush to go back, though."}
{"text":"I really enjoyed the cornbread and the grits to start, and for my main I had an app, the Maryland Prawn. It was really tasty with pickles and rye bread crumbs, but was tiny and overpriced. 

They had propeller beer by the bottle. A Nova Scotian treat. The best bitter of all time. If you haven't tried it, you should get on that.

My beef with this place is that the menu is hard to understand. The language used is pretentious, and at times does not aptly describe the food. The food is decent, let it speak for itself without all of these flowery words, friends. If something is a soup - you should call it a soup. Ya feel me?! 

The wait staff was friendly, and they have a great smoke-free open-air patio.

I think the company I was with and the propeller beer really made the night, though, and it likely won't be my first choice in this hood, but I get the appeal."}
