{"text":"We've dined here three times, and each has been an outstanding experience in terms of flavor and variety, in large part due to the Robata grill and the Josper Oven preparations which impart a charred/grilled character to the food, yet sears in the juices to keep it succulent. The Compressed Watermelon Salad with Jalepe?o Sauce is a knockout--you must try it. We love all of the Robata appetizers, but give high praise to the King Oyster Mushroom and Turkey Rib. For dinner, the Robata Pan Seared Salmon Nambanyaki is probably the best preparation of that fish that I've had anywhere. My only negative about this place is that it seems it hasn't quite caught on. We were there on a Friday night and there was just one other table of diners in the entire place. Location? It's worth seeking out, believe me. C'mon Yelpers, this place deserves your attention--it offers a food experience you won't find anywhere else in Cleveland, or in most cities for that matter. We are lucky to have it."}
{"text":"This was a very cool restaurant and bar, but almost too cool for me.

Food - Food was good, but I guess I'm not into the whole Asian fusion concept.

Service - It was very good.  No complaints.  They were very helpful in explaining the menu.

Ambiance - The word \"Accent\" was burned into my retina.  It's everywhere.  It is very cool and clean.

Value - It's a fair value."}
{"text":"First time at Accent -- I really wanted it to be good. 

Went with a group of 6 and they sat us at a booth -- three on each side. Very awkward seating. 

Upon walking in, the indoor ambiance sets you up for some great food. Lots of dark red and black. Rather industrial.

We got the three apps that were recommended by our server: SASA fries, edamame humus, and zucchini rolls. The zucchini rolls were bland to okay, the edamame humus was really boring, and the sasa fries were way over fried -- very heavy.

Side salads were mediocre -- nothing special.

The server talked up their special ovens that are supposedly one of only 7 in the world. I can see why. The entrees we got were veggie ravioli -- extremely disappointing especially after the server said it's one of their best veggie entries. The tomato sauce was basically tomato paste, the ravioli filling was tasteless, and the raviolis themselves were chewy and oversized. Speaking of oversized, the portions were not. Generally quite small, especially by Cleveland standards. Not much bang for your buck. I don't mind a small portion if it's delicious but this was not the case.

Other entrees included the salmon cake -- over seasoned -- and flatbread with meat -- basically a pizza -- which was quite good but really just a pizza. The skewered meats and veggies were really mediocre. No special flavor. No special cooking style. 

I give this restaurant 9 months unless they can figure out how to make good food. Over and over it was bland or over seasoned. 

The special drink called Au Currant was delicious. Everyone liked it. The wines were disappointing. We did not try dessert.

I'd skip it unless the reviews change."}
{"text":"Great service, great ambiance, great wine list.

The Celebration of Nine was a mix of some very tasty things and some that were a bit bland.

The Salmon was perfectly prepared.

The Creme Brulee was delightful & not too sweet.

Next time I'll be sure to try some of the Robata Grill offerings."}
{"text":"I'd give no stars for bar service if I could. The girls just giggle with one another and don't pay attention. It has, on more than one occasion during more than one visit, taken 10+ minutes to order a drink."}
{"text":"A few Fridays ago the bf surprised me with a little low key date night and picked Accent as the backdrop to our evening.  He had heard good things from a co-worker of his and decided to give this place a go.  

Located in the vastly growing university circle area of downtown, the decor of this restaurant does not disappoint.  Incredibly dark and sexy, the red lit walls and dark leather booths definitely set the mood.  Tucked away in one of these booths our server greeted us quickly and got us started with our order of hot sake and gave us time to look over the interesting menu.  Neither of us were crazy hungry, so we opted to go for some treats from the raw bar and I'm going to say that's kind of where I went wrong.  

Bf ordered oysters, and for not being an oyster lover myself I have to say that they were pretty good (I gave one a shot).  I, on the other hand, ordered the House Cured Korean Celebration Box.  I have to say I was not a fan.  The box comes with pita/flat bread, kimchi, cured/picked veggies, and the fish.  What got me was that the fish came all chopped up and wasn't easy to eat and the smoked salmon was really just lox all diced up (at least that's what it tasted like).  It wasn't terrible, but it wasn't great and definitely not worth the $18.  

All of this being said, I'm will definitely give this place another go but will most likely stick to the grill & oven menus next time.  I think Accent has a lot of potential and you can't really beat the vibe but I think there is some room for improvement in the raw bar selection.  Overall, for sure a great pick for a sexy date night with your boo."}
{"text":"Ambiance: the atmosphere of the restaurant is very modern and stylish; it's a great ambiance for a dinner date or dare I say a girl's night out? Ladies? They have two sides of the restaurant. The bar side has a different menu with a lot of tapas options as well as selection from their yakitori menu. The dining side has a smaller menu with more entree-like options. 
Menu: There are a lot of fusion options on both menus that reflect korean influences on the japanese cuisine. There is also a good selection of steaks, some burgers and some pasta dishes. 

Now for the food: My friend and I ordered the seaweed salad, spicy tuna onigiri (rice ball), tacos, bulgogi and kimchi flatbread, and the pork belly from the yakitori. The best item was probably the sea weed salad, surprisingly. I'm normally more of a steak girl than a salad girl, but it was bright and flavorful with a lot of different textures. Something I'd order again. The next best thing was the pork belly. Whenever i see the words pork and belly next to each other, I cannot say no. It was flavorful and tender, and something that I'll be tempted to eat all the time. The portions are a little small as is normal with yakitori. Unfortunately the rest of the items we ordered were unremarkable. The presentation of each dish was fantastic and warrants at least half a star, but the flavors were a little dull. The spicy tuna onigiri was mostly rice, and the salmon had very little flavor and was not noticeably spicy. The flatbread and the tacos were both mediocre. The flatbreak was slightly more flavorful with the beef bulgogi on top, but the pairing with goat cheese maybe was not as harmonious as I'd hoped it be. 

I did notice that they have a chocolate lava cake for dessert. I didn't order it this time, but it is one of my true loves in life. I'll definitely get it next time!

I had high hopes for accent since I live so close and have been longing for some more diversity in University Circle. I'm hoping the kitchen will make some adjustments before their grand opening because this place definitely has a lot of potential for being both beautiful and delicious!"}
{"text":"I've given this place three chances to impress me, but in the end I was greatly disappointed with their food. The first time I ordered the kimchi flatbread with goat cheese, but I found out that goat cheese with kimchi is a \"no-no.\" The kimchi wasn't very spicy and the bulgogi didn't taste like bulgogi.

The robata donburi, pork belly ramen and black bean udon were all bland (and black bean noodles is my favorite Asian comfort food). The fries didn't impress me either.

Pros:
- Great ambiance and awesome interior
- Great service

Cons:
- The food.
- It's expensive.

For the price I paid for my meal, I probably could have ordered a tastier meal someplace else. I've definitely had better Asian Fusion for half their price. It gets two stars because this place has great service and ambiance."}
{"text":"Until things become consistent here, I can't bring myself to go above average on this rating. Our first visit was actually a really good experience, though most of the food didn't live up to the great service that we had. Our server answered all of our crazy questions and was very informative--in a word, he was great! The food on the other hand, was a little lacking. We decided to try a bunch of things and see how we felt before ordering the next round of things. We went with some of the robata skewers to get a feel for what they were all about. In the end, we tried the shrimp, meatball and beef. The beef the first time we came was amazing! The robata really added a nice crisp on the outside and the inside was incredibly tender. During our second visit, it was cooked all the way through and pretty tough. There wasn't too much special about the shrimp and the meatball was, though strangely shaped, pretty tasty. 

We also decided to try the kimchee and bulgogi flatbread and house pickles. These were the highlights of the meal for me. The pickles were actually a variety of pickled things that I absolutely loved trying and continuing to taste. But the absolute star of the meal and what brought us back for another visit was the flatbread. The flavors are delicate and pronounced at the same time. Such a great balance and delicious dish! 

Really, the only particularly exciting things about this restaurant are the location and the flatbread for me. I'd recommend the flatbread to anyone coming here--get it in addition to anything else, just in case you run the risk of getting disappointed with your other selection, because that flatbread will save the experience.

As for the atmosphere, I hate the walls. I know that's a strong statement, but it's not inaccurate. I hate them. They're dark, the red letters don't make sense to me; it's like a gigantic insolvable word search. My brain won't stop trying to find words and make sense of it all. Very disconcerting."}
{"text":"If you'd want an amazing culinary experience, please spend some time at Accent. The appetizers are fantastic and I have never had a better hanger steak in this city. Everything is beautiful.... Colors, ambiance, service. It's perfect."}
{"text":"Awesome meal.  We were lucky enough to get our table to do all small plates to start and had close to one of each of their specialty items.  Wings, chicken lollipops, all of it amazing.  I would go back just to do the small plates again and was not disappointed with one item. Moved onto hanger steak which honestly I had before and was not impressed.  This time, the steak was perfect and the chimichurri was spot on.  It was nicely spiced and made the steak.  Honestly, I will likely crave this now and plan to head back this week.  The service was great and we never felt unattended to.  This place has finally found its mojo."}
{"text":"Awesome atmosphere, tasty food, and SASA fries!"}
{"text":"Accent is an Asian fusion restaurant that focuses on Japanese robata grilling and izakaya (small plates/tapas). It's located in a new, trendy building in University Circle, and the decor is going for modern, trendy, urban. However, it was pretty empty when we got there at 6pm. Overall, I was content with the happy hour selections, but I wouldn't come here for the entrees.

Came here with 4 other girlfriends, and we happily ordered 2 small plates each.  We ordered everything except the meatballs, pickles, turkey rib, and a chicken dish. Our favorites were:

SASA fries, shishito peppers (sweet peppers), edamame hummus and chips, and the pork belly (I think. I didn't try it.) 

They had some ok average dishes like salmon croquettes, king oyster mushroom, and a fusion tuna sushi. They had eggplant, but it was just ok. Everything had a sweet flavor to it. 

Service was just ok too - it seems like they're still figuring out how to relate to customers. the servers had a hard time getting all the dishes onto the table properly (and we had to do a lot of the passing)."}
{"text":"This place is great if you are on a diet. The food is good, there is just not enough of it. In a world where every other restaurant gives WAY too much food, they decided to do the opposite. My wife had the $29 Korean Celebration. Nothing to celebrate: 8 tiny tastings. I had the $32 Snapper. Tasty, just small. I would have stopped at Presti's on the way home if I could have found a parking spot. The waitress was barely visible. I can't tell you how many times I was just looking for a refill on my water with no one even close to my table. As for the decor, I felt like I was in The Matrix. Finally - they should offer to run out your valet ticket when it is 24 degrees with 20 mph winds and no shelter and valet service is $5."}
{"text":"Sasa is one of our favorite restaurants in Cleveland, so of course we were excited to try Accent. Though both Japanese-inspired, these are very different beasts. I am happy to report that my wife and I (with friends) had a great first experience at Accent.

The atmosphere is fantastic. Elegant, upscale (but not pretentious), just a bit cozy. The place has a sleek modern look, but is still comfortable. I love the booths. It can hold a large number of people without being overly loud--not sure how they do that. 

I ordered the whole snapper entree, and I loved it. It was simply prepared: The entire fish is served on a large plate, with some vegetables, potatoes, and a bit of sauce just to the side. I was simple, fresh and delicious. I also really liked the pickled vegetables included on the side. Add some sake to the meal and I was in heaven. 

My wife had a steak, and while she said it was delicious, it wasn't particularly different from a very good steak elsewhere. Appetizers, especially the yakitori, were great. Get the pork belly.

We'll be back."}
{"text":"Great service and, to some degree, great ambiance, but the restaurant fails in terms of value and flavor.  The portions are small but the costs are still high, the flavors are mild across the board, and the menu itself is a little confused.

The restaurant greets you with dark walls displaying red, backlit letter designs that mimic the restaurant's sign font.  The overall theme is very modern and industrial--bare concrete floors and minimally designed furniture gives an impression that this place serves something new and different.  

We arrived a tad earlier than our reservation, but they still seated us right away.  We were seated in a booth, which was comfortable to a point.  The legroom is very slim.  If guests seated across from each other with perfect posture, there's about two inches of space between each person's feet.  This is super annoying and I recommend you request a table and avoid the booth unless you're looking for some footsie action.  The server was very attentive and helpful.  He took all our orders, made good recommendations, and he was quite friendly.  I'm very happy with service.

We ordered a couple beers and cocktails to start.  The draft menu doesn't provide any sizing information--just the price.  Both beers were $5, but one was a pint glass while the other was a much smaller glass.  I would appreciate the menu noting serving size.  The cocktails were good; no complaints.

We then ordered the Accent Crudo (Tuna, Hamachi, Salmon) $8, and the Edamame Hummus with Chips  $6.  The crudo was just a tiny 2oz looking pile of cubed raw fish on some greens.  There was zero flavor or skill in this dish.  They could have at least seasoned the fish.  This was the most boring of all the food.  The Hummus was ok.  It tasted fine and I did like that it included potato, taro, and lotus root chips.  But I've had better hummus.  This, like the crudo, tasted bland.

For dinner, the four of us shared the Korean Celebration of Nine  $29, and a number of Yakitori items.  I was admittadly excited to try out the food from their fancy robata yakitori grill, and the Josper oven.  The Korean Celebration of Nine is a platter of different vegetables and meat/seafood items with raw diakon slicens and korean pancakes.  The idea is that one can use the daikon and pancakes to make small tacos.  The amount of food on the platter was small--this is not something you would share even though it's billed as a dish served at celebratory events.  It's a celebration of one, for sure.  Each platter item gave you about one bite worth of food at best--this was a platter of amuse bouche.  The pancakes and daikon were a little too stiff/dry to use for mini tacos, but even so, these would have been microscopic tacos.  The food on the dish was very bland.  Even the kimchi tasted bland.  It was a sad bevy of food.  This also contained the crudo, which again was not seasoned at all.  The smoked salmon at least had a little flavor, but it came with a pin bone and it was a little dry.

The yakitori items were cooked perfectly--the robata grill offers some great char and smoke flavor.  Unfortunately, that was the only source of flavor.  The meat didn't taste seasoned at all, or barely seasoned in some cases.  The turkey rib was my absolute favorite, but it wasn't enough to to rescue the entire meal.  Thankfully, the dipping sauces saved things a bit.  The chimichuri was delicious, the korean BBQ wasn't bad but it wasn't anything to write home about, and the \"teriyaki\" was a mess.  It wasn't teriyaki at all.  Rather, it was a small amount of thick sweet soy sauce.  If you're not familiar, it's the soy sauce version of molasses.   What really bothered me was how each yakitori item was $5, but the plate only provided a double size amuse bouche amount of food.  

I looked at other plates as I walked to the restroom and it did look like some of the entrees were of a larger size, but I don't know if I can say they would be worth the price.  Accent is charging Lola prices for a flavor experience that's just not up to that level.

With that said, I was also confused by the menu.  I understand that it wants to be a Pan-Asian restaurant fusing modern cooking across a variety of Asian food items.  However, it just didn't make sense. Goat cheese and kimchi sounds disgusting, and ginger gravy seems a little odd to me as well.  I'm pretty liberal when it comes to cooking, but it just seems odd.  Then again, the pretty weak kimchi probably works goat cheese, but for all the wrong reasons.  Every so often, the addition of Italian elements also seems off. 

Overall, this is a brand new restaurant that just wasn't ready to roll.  I've never been a huge fan of SASA, but it worked well enough. Their new venture Accent is just lost.  It's only been open for a week, so I'll be returning in a month or so to check it out again.  I hope they can get their act together because this section of town could really use a new and exciting fine dining establishment."}
{"text":"Nice ambiance, very good service. I generally sit at the bar; they make excellent cocktails and have a decent beer selection. A bit pricey, but ultimately worth it. The food doesn't quite live up to expectations, as others have noted; the burger is quite good, and the robata grill items are also tasty, but portions are very small for the price.

Check it out for happy hour drinks and grill selections, and come back in a few months to see if they've sorted out their menu."}
{"text":"This was especially difficult to write because I loved EVERYTHING but the food.
I ordered the hangar steak with chimichurri and the steak was perfectly cooked but incredibly chewy.  Any time this happens, you know that the quality of meat is bad.
My server on this evening - 6/4 at 10:20 PM, sitting at the bar - was incredible.  Super impressed with his treatment of customers.  Granted, it's dead, but he was a great guy and very personable and genuinely cared about the customer.
Robata mushroom and brisket just wasn't good quality.  Meat didn't have much taste and the mushroom was dried out.
Ordered the most expensive cabernet glass on the menu and it was warm.  Had to ask for it to be put into the cooler.

Service:  A - PLUS
Quality:  D  - especially at the price point

I really did want to love Accent, but the quality of food and beverage brought me down."}
{"text":"Lets start off with the Good:
Ambiance. Very cool place. Nice place to get a drink. I saw an old boss of mine and he bought me a mini pitcher of beer.   Sapporo on draft, I like it!  The service was really great. Our server was super friendly!

They had appetizers for 5$ so I ordered the most primal thing and it was the meatballs.  Very tasty and perfectly prepared.  They were pork and beef  They were five bucks, about the size of 2 sausage links.  I  could have smashed 3 orders without any issues!

From here it pretty much took a dive.  I ordered the ox-tail soup.  The server described it as more of a chili with ox-tails and veggies.  It was more like a beef barley and rice soup with a little kick. Had it been properly labeled and explained I would not have ordered it.  I did not feel this soup was worth 7$! The lady ordered the Sasa Fries.  They were crispy on the outside soft and creamy on the inside with a slight crispy batter.  The dipping sauces were pretty meh. Spicy mayo- Meh!Then some sort of cold gelatinous brown mix of barbecue and ketchup? 
The lady's sister ordered a Salmon Cake dinner. She said it was good but was not very wowed!  

The Lady's brother in law ordered the pepper steak.  It was a Petite fillet, and they were not joking when they . No more than 4 ounces at the very most! The presentation was fantastic. 

Side note - the entrees come with  banchan, which consisted mostly of  Japanese pickles.   

Man, Uptown can really use another great higher-end place. I really hope management will  consider adding some value to their menu!"}
{"text":"Service - awful. Waited an hour to place an order & it was not busy. Food - mediocre. Ambience - cool. Will not return."}
{"text":"Okay, I have a confession to make.  I used to equate \"Asian Fusion\" with \"Asian Expensive.\"  But Accent.... well, Accent was Asian Expensive.

The menu really harped on the fact that they had a Robata grill and a Josper oven (basically, a charcoal grill and a charcoal oven).  So, I ordered the Josper Roasted Korean short ribs, and my girlfriend got the Robata pan seared salmon.  We also got a Robata grilled squid appetizer.  The grilled squid was overcooked but had good flavor.  The short ribs tasted okay, but were not tender or juicy as I hoped.  The salmon skin was seared well but the rest of the salmon was bland.  The dishes were supposed to come with banchan (Korean side dishes), but the two bites of kimchi that they gave us really did not qualify as banchan to me.  

All in all okay food, but nothing really jumped out at me.  So it wasn't worth the hefty bill of $80.  We also waited a very long time for our food - I'm guessing because these two methods of preparation take a look time in general."}
{"text":"Sat in the bar this time - had the bar menu. Really enjoyed just getting a bunch of items off the Robata Grill Yakitori section of the menu. I had chicken, meat\"balls\", shrimp, and the veggie medley. I wasn't a huge fan of the chicken - not the best quality of meat was selected I don't think. The meat\"balls\" however (really logs) were great though and I ended up ordering a second set of those. Each of the plates come with two skewers of the selection, the shrimp was 4 pieces. I also started with a great Miso Soup. I like a menu of this style where you can just pick the protein selection you want. I'd do this again for sure. Happy hour in the bar 1430-1830."}
