{"text":"Avoid this place and choose one of the many other burger places in Toronto. The service was very curt. The steak burger was bland and overcooked. The bread was stale. My wife found a piece of red onion SKIN in her burger. We opted for adding bacon to our burgers but the employee failed to mentioned that they didn't have real bacon - only TURKEY bacon. What terrible service and food."}
{"text":"Honestly, I just feel really sad for a burger joint that doesn't carry bacon. I mean, wtf is 'turkey bacon' anyway? Halal failal.  I do appreciate the fact that my customer service representative didn't look at me like a three headed dragon when I asked for a lettuce bun and that she made a valiant effort to construct one, however, why did my poutine gravy taste like that three headed dragon had breathed fire on it? Seriously.   The last thing I'll say about my visit is that if I wanted a dry burger that tasted like cardboard, I would have fired up my BBQ and let one fry to death with less effort."}
{"text":"This place has great high quality burgers and the other food is very fresh.  Portions are generous and service is exceptional. It gets my vote as an A1 Cheap and Cheerful spot for a quick meal."}
{"text":"Good clean burger but I find the burger too bun-y; I usually pick away at the top of the bun until it's half it's size and then I like it a lot better. Too bad they didn't have a \"half-size bun\" option."}
{"text":"I love a good burger and have tried all the new burger franchises that have been opening up in the Toronto area the last few years.  I ordered the 8 oz burger, it was good, but not outstanding, nothing set's Acme Burger apart from any other premium burger joint.  One of the previous posters said their burger was over cooked, well mine was medium rare. I ate but was a little worried after I finished.  The staff were pleasant, but not overly friendly.  Would I come back, probably not, it's not that unique to me.  One of my favorite burgers is at 'The Patty Shack' in Oshawa."}
{"text":"This place is great, seem to hit it every weekend, its convenient for me living on lakeshore i just stop in and then down royal york i go. I always get the Angus Burger and top it with bacon and cheese. Then i put my topping on and always have acme sauce which i also ask for more of for my fries. Fries are excellent to taste like real freshly cut fries. All around great place to eat."}
{"text":"Best BURGER EVER!!!!!!! so good very disappointed that the one on Queensway closed soo sad  I don't think I will ever find another burger like these one's again. .....the place is called acme burger people not salmon or steak!!!  Must SAY BEST BURGER I HAVE  HAD IN YEARS! !!!!!!!!!!"}
{"text":"Burgers are okay, but the employees are very rude. I might have gone back because the $5 daily burgers are alright, but we've had two occasions with the rudest service I've ever had at a restaurant. Tip for Acme Burger employees: don't yell at customer's for asking questions. Don't talk about customers badly where they can obviously hear you. It's really not that hard."}
{"text":"Had the roast beef sandwich. Not nearly enough meat for the size of the bun meant that after three bites all I was left with was a hand full of bun and toppings. Pretty lame considering the $17 price tag with fries and a drink. Fries weren't anything to write home about and were undercooked. Maybe the burger is better, I don't know and probably won't ever bother to find out."}
{"text":"I ran into Acme Burger while I was waiting for the staff at Sonic Boom to go over some used CDs I was hoping to sell them. The menu and general concept reminded me a lot of Hero Certified Burgers, but after trying what they had to offer I realized this wouldn't carry through to the actual meal. They follow suit with your typical combo, but split into 4oz, 6oz and 8oz with some vegetarian and options other than beef.  It's great that they cook your burger on the spot and you get a solid choice for toppings with a few that are outside the standard selection. While they were of fairly good quality, there was nothing that stood out and I left with a burger I felt I could make at home. I love a great burger, but I'm starting to believe the angus beef stamp is just for show and an unnecessary label.  The fries were of good size and the staff was pleasant enough, but I'm left comparing this place to Hero Certified Burger because of how similar they are and Acme falls short in my books."}
{"text":"I dropped by this place, just to try it out. The lady working was extremely nice. I ordered the 4oz Acme burger. It was delish. It was honestly better than i was expecting for such a good price. I also ordered a side order of Onion rings, the best onion rings I have had since Harveys. Hands down a great place to eat. Kind worker and great atmosphere. I am planning to go back, for sure."}
{"text":"many a time ive stumbled out of crews & tangos here, too drunk, too loud and too hungry. still treated with respect and patience! i think comparing this place to hero burger is a mistake. hero burger has the illusion of quality, whereas acme burger actually HAS it. everything ive had here (yes, even in sobriety!) has been delicious and fresh  great vegetarian options too! sometimes you want a greasy heavy meal that doesn't contain any of our animal friends haha. I could drink their veggie gravy on it's own. in fact, a friend and i love to have our \"cheat' treat here which is just two orders of fries and veggie gravy. spread them all out on one giant napkin. and just graze. heaven.  i love the staff here! each person is cuter and friendlier than the last. my heart goes out to the gentleman who is from new zealand and has EVERY customer asking if he's from australia. my friend if you ever read this, stay strong!  I just love this place!"}
{"text":"Went for lunch there today and had a chicken souvlaki ($5.99) w/ a garden salad.  The chicken souvlaki was on a tiny pita and doused w/ tzakiki.  It was super messy to eat and didn't taste very well at all.  The customer service wasn't great and the server seemed reluctant to answer questions about toppings and just generally unhappy to be there.  My partner wasn't impressed w/ the 6 oz burger either.  There are tons of cheaper (and likely better tasting) lunch options in this area, we'll be trying those next time."}
{"text":"I saw the advertisement for poutine in the window and I loves me some poutine. So I went in. How bad could it be?  -------------------------------  The Positive: The food is fast.  -------------------------------  The Negative: My first visit I read the plaque on the wall that promised fresh ingredients and a rockstar staff. Encouraged by the prominently placed plaque I ordered an original/plain poutine and a small burger. The guy working there took my order, but there was no charm to his approach, no smile, no enthusiasm. He was the poster child for the \"What do you want?\" style of service. While I waited I looked around the dining area and notice all the chairs had rips in them, the floor looked dirty and the decor was really bad. Not the type of place you want to eat in. When my food came, the fries in the poutine were soggy and the gravy was unremarkable. But the burger was the real issue. The bun was stale to the point that it must have been sitting out, the flavour of the meat just tasted weird and while I asked for it to be cooked well, it was still a little pink in the centre. Over all, a let down.  I always try to give places a second or even third chance because sometimes that one troublesome employee just mucks things up. So I went in again and ordered the sweet potato poutine. The man who took my order was coughing everywhere. Coughing while taking my order, while taking my money, while preparing my food. It takes a lot to put me off my appetite, but he did it.   Here is a hint to all restaurant workers (especially kitchen staff), STAY HOME WHEN YOU'RE SICK! You turn customers off, you might get them sick, and you risk infecting all the other employees. The fact that there was no management to tell this idiot to go home speaks volumes about how little they care about the customer.   This time I ordered the food to go because I did not want to eat in their dirty looking diner. When I got home I was still thinking of him coughing all over the kitchen and really wondering if I wanted to eat the food. Unfortunately, my childhood up bringing rarely allows me to throw out food and waste money. So I opened the poutine and what a sad sight. I had seen the worker taking fries out of my take-away box so I expected a pretty good portion, but the box was half empty. The fries were once again soggy. And while eating I noticed a pretty large piece of styrofoam that must have come from the cup he used to scoop the curd cheese on top of the fries. How do you miss your cup breaking?   -------------------------------  The Conclusion: If they ever choose to fix up their outdated and bland decor I hope they rip that plaque off the wall and give it to a restaurant that actually cares about the ideals listed within. The food is just bad and there is no charm anywhere within to get you coming back.  Avoid at all costs!"}
{"text":"Like some of the others, I'd say 3 1/2 stars.  I keep going back...  The burgers and fries are big, meaty (100% Angus Beef), have a great bun, and there are a ton of toppings.  Yes, the Angus beef really makes a difference.  The burgers are great!!!  It's way above the typical fast food.  There are plenty of tables and seating at counters over looking the street, The only downside is the bathrooms (they're not so nice)."}
{"text":"The last time I visited this place it was around 2010 and I was working in the area and my colleagues and I walked over for a burger. At that time I recall the portion sizes to be huge, the meat thick and juicy and the venue, clean and welcoming.  Looking back at reviews from 2009, 2010, and 2011, I can safely say that my experience in 2010 was inline with that of others back then.  Fast forward May of 2014 and a later evening stop in based on fond memories of burgers past, found me pulling in completely famished. Sadly the experience I remembered was not what I received and I as sorely disappointed.  Keeping to the facts, here is what I can tell you:  1. Venue, what was bright and vibrant, clean and polished - now appears to be run down, dingy, and dim. Almost like the entire place has a grey cast to it now.  2. Prices, tended to be higher than I recall. I will award them a star for offering different sandwiches each day at a $5 special. But from a buger shop, they're now serving anything they can on a bun  3. Quality, While they still use fresh not frozen beef (which is what I award their second star for), I found the bacon used to be overdone and the toppings to be on the verge of turning (soft tomato, wilted lettuce, etc)  4. Value, i found my burger to not be the behemoth it once was. My previous visit had me gasping for air by the end of my burger. This time the 6oz burger I ate appeared small-ish and unfulfilling (see my picture). I felt it was mostly bun.  Not sure what's caused the decline of this place or if my memories have given me away? Eitherway, there needs to be some immediate change if they're to survive the flurry of new burger joints and restaurants popping up on the Queensway.  Eatcrest Out"}
{"text":"Not sure how anyone can give this place a good review.    I walked into Acme Burger on the Queensway this afternoon and ordered a 6oz bacon and cheese burger with fries.  Waiting for the burger I started noticing all the houseflys buzzing around this messy place.  Garbage is overflowing, ketchup stains on counters, random holes in the wall, etc.  I told myself not to let the look of the place influence my opinion of the food.  As I'm waiting I see the guy pushing down on the burger (tsk tsk) and turning the burger several times and lifting it high and looking underneath it??? Thanks for squeezing out all the flavor rookie.  Fries - tastes of old oil, they cover it in alot of salt to hide the bad taste.  A little soggy.  Burger - The bun is thick and firm, way too much bun-to-meat ratio.  And it tastes stale.  Meat is dry as hell.  There is absolutely no juice in the burger.  Toppings - I got lettuce, tomato, mayo, bacon, pickles, mushrooms.  Hard to screw that up, but the mushrooms are not fresh...they're straight from a can.  Bacon is disgusting!! It's not even REAL bacon - its like some imitation non-crispy bacon.    Overall:  Worst buger place I've been to in Toronto.  If you're in the area, go to Sliders across the street and 2 blocks east."}
{"text":"Right acros the street from Hero Burger on Church, Acme Burger Co. adds another player to the newly popular market for takeout burgers that harken back to a pre-Ronaldian era and hope to offer something a little more grown-up and refined to the burger hounds out there. I have a feeling that the two shops are going to be engaged in some competition, and this review reflects that.  If Acme Burger were a computer program it would get super big points for its user interface - the place looks really good, it's classy and clean, and the grill and Subway-style choose your own ingredients are all right in front of you on the main counter. The meals come on shiny metal platters rather than dinky trays. There's even a patio space inherited from the former Zelda's.  Much like at Hero, you can choose your patty size from 4, 6 and 8-ounce offerings, but where the Hero meat is served in a thick patty that arrives medium-rare, Acme serves a thinner burger, cooked more toward well-done, that's not as greasy (visibly or, most importantly, on the palate) but sacrifices the Hero's satisfying juiciness and big meaty flavour - it felt like there was a lot of bun. I'm more of a thin-burger guy and I don't like the taste of grease, so I was happy enough.  The toppings available are pretty standard, but there are some notably interesting exceptions like mango chutney and guacamole. Hero has a more eclectic selection of toppings and sauces (and more burger configurations in general) but the basics at Acme are tasty and I didn't really feel like I was missing out on anything. Again, I liked being able to see the toppings *before* they went into the finished burger.  Fries? Not so good here in my opinion. Thick-cut style, but too starchy. Onion rings? Better, but still \"meh\" - chubby with batter, and greasy instead of being crisp. It's a shame that a solid burger should come with lackluster sides.   Service was on the slow/forgetful side even though I was one of only two people placing orders in a quiet moment before the lunch rush. As a previous review mentioned, it feels like the staff are still going through some growing pains. They did add fries to one of the orders on the house, though... thanks guys!   In conclusion - snazzy presentation and good quality but still working out the kinks. Try them if you're not a big fan of the Hero angle but still want something tastier than the big chain burgers."}
{"text":"Acme has delicious food for a late night snack  before heading home (open till 4am on weekends). Their burgers are thick and juice and grilled right in front of you. They have a wide selection of toppings to chose from so you can load it up with whatever you like.  Acme's poutine uses actual real curd cheese, not shredded cheddar, which is an insult to this wonderful delight.  Overall a good place fro late late night grub but be prepared to pay a little more than your typical fast food place (2 burgers & 2 poutines set us back $30!)."}
{"text":"I've been by for burgers a couple times now.  The first couple of times were great, but the last time was a poor experience.  I'll probably stop by at least once more for good measure."}
{"text":"I went back a couple of days later and had the burger combo; I upgraded my drink to a milkshake and the fries to poutine. I'm sad to report the burger was a huge disappointment! No better the a McD's patty!!! Seriously! I asked for extra gravy this time and they did so the poutine was better this time.   I'll be going back to Hero burger.. for a burger!"}
{"text":"crap veggie burger. bun was tasteless. Not the cleanest dining area. Not pleasant. Not going back."}
{"text":"I'm writing this as a reminder to myself never to go there again.  I've been to ACME's locations a few times and I've never been impressed. But this time I was disgusted. The burger, lettuce, bread etc was bland, but the bacon was just one degree away from cardboard. I'm not sure it was from anything that had ever been alive. It tasted so bad the entire burger was ruined by it. And this is BACON we're talking about! Bacon is NEVER bad! This bacon was.   We're talking bacon here that has no flavour, no texture, no juicy, no crispyness. Just burnt marks and a slight tinge of rubber. Disgusting.  Having awful bacon is an unforgivable crime. You do NOT mess with bacon!"}
{"text":"Decided to come in and try their poutine as they made it look really great with their advertisements. Upon entering, I could see no one at the counter or anywhere in the place. I stood around waiting. 5 minutes passed--still no one. Eventually after about 8 minutes a guy came to the counter and seemed a little out of it. I placed my order and waited another 5-7 minutes for the poutine. The poutine was not good and definitely not worth the wait or the cost. I will never come back here. It's unacceptable to leave a customer waiting for anything over than a minute in my opinion. I have worked years in customer service and the food and beverage industry and would never do that!"}
{"text":"I was trying to kill time again before rehearsal after work and I found myself at Acme Burger on Bloor Street West. Remember Acme Acres where Bugs Bunny and friends would merrily prance around all day, having fun and sharing jokes? Well this burger joint has nothing to do with them. Remember Acme Inc that made explosives for Wile E Coyote and Road Runner? Well, same as the former, there's no connection between this fast food restaurant and the dynamites either. Now that we're clear about that, let's talk about the burger...  Veggie Burger @ Acme Burger  -Toppings: There was a very good selection of fresh, vegan friendly condiments available. For my burger I topped it with: ketchup, mustard, Dijon mustard, guacamole, mushrooms, red onions, pickles, tomatoes, green lettuce, and hot peppers. -Patty: It was a colorful patty, mostly brown but there were visible bits of orange (carrots), yellow (corn or yellow bell peppers), red (bell peppers) and even green (bell peppers). It was thin, a bit dry and not very memorable. It was also abit burnt, hence the 2 stars, I would actually give it 2.5 stars, but we don't do half stars on Yelp.  -Bun: Whole Wheat baby! -Price: $5.49 (burger only) before taxes -Verdict: The awesome condiments made up for the shortcomings of the veggie burger patty. The only reason why the burger was juicy was the excellent toppings. I'm actually quite amazed that they topped my burger with guacamole and mushrooms free of charge, when other places would be glad to charge you a dollar extra for each.  I'm not sure if I'll go back, the burger was ok, and I liked how the burger was served on a silver platter, but mediocrity served on a silver platter isn't very tempting."}
{"text":"I don't know what is going on with this place. They seem to screw up the order all the time. They asked if i want bacon and cheese on my burger. I said \"YES!\"  When they made it they didn't put on the cheese. He said I didn't ask for it. I told him i did and he started to get mad at me, i just told him, then charge me for it. Then argues with me about it. Tables where dirty. He asked his co worker to mop the tables.  Forgot the drinks. I think the owner is away. This is not the first time this has happened that the service has been bad. No more chances."}
{"text":"Lots of Pros and Cons to this Burger joint;  Toppings, Fresh and loads to pick from, the bun is also really good, however the sauces cannot be seen so well and are only pointed out when you ask what they have. Staff communication is poor and on a recent visit my burger sat for about 5 minutes awaiting the other turkey burger to be prepared, nothing worse than opening up a burger and the toppings have now cooled off your food, and the girl who was dishing out toppings was very unfriendly and couldve just smiled and not made a big deal about me asking for it.  The patty was good, not the best but I enjoyed it and have before. I would come back here ad they have a great menu and offer a quality burger with lots to pick from, which I cant say for many burger places in TO."}
{"text":"Decided to eat here after walking around the neighborhood before a class. Good deal, lots of food and the burger was perfectly cooked and delicious. Nice thick cut fries as well. The bacon wasn't the best but over all pretty decent."}
{"text":"Would not recommend this place. Opted to try the wild salmon burger (on special). Was very dried out and tough. The fries were soaked in grease and barely edible.. Tough and not fresh despite just coming out of the deep frier. Im guessing the oil needed to be changed.. Left feeling pretty gross and queezy after throwing half the meal in the garbage."}
{"text":"A perfect example of big business gone wrong on Church St.  Its clear by the staff and the environment that this is the kind of place imported right from a strip mall in the suburbs. And I don't have anything against those kind of places-- nor does every business on Church need a rainbow flag draped over it. But entrepreneurs need to be in tune with their market when rolling out a product and they really missed the mark here.  Not only did the overall ambiance leave me wanting, but the staff was complacent and didn't really seem to care about customers.  Given Hero and Acme, I'd choose Hero any day. There's a little more hominess and personability to the athosphere, perhaps being fronted onto a sidewalk helps, rather than Acme's location, which is very set back from the street.  In terms of the food, I had the Greek Wrap, it was good and took a long time to prepare, the chicken needed to be cooked well and the grill wasn't very hot. Just a feeling-- but I felt the low-temperature grill was an attempt to save on gas costs, since this place probably has huge overhead already."}
{"text":"I have been here a few times, burgers are not bad, but as others have reported the tables are often dirty, so I stick to take out. Service seems to depend a lot on the cook/manager who asks some customers how they want their burgers cooked, but not others. I was watching my burger getting to well cooked and tried to get his attention. He became very rude, waved the burger at me, and then started to insult my family for some reason which I never did understand. When I suggested that he needs to work on his customer service skills he started shouting at me. I have never been treated so poorly in a burger place, I won't be back until its under new management"}
{"text":"I'd been here before for the veggie burger and didn't care much for it. I got a burger craving though and went back recently. I got the turkey burger which was on sale. The patty is soooo small. It is also very dry. I know people for some stupid reason think the best burger is made out of just meat but this poor thing was just begging for help. It's called panade, people, look it up. The bun was also too big for the burger which added to the dryness. At least you get to pick your own toppings. The saving grace is that they make something called ringtine. It's poutine with onion rings instead of fries. As a french fry hater and cheese curd lover this is the answer to my clogged-artery prayers. I will probably go back one day for onion rings but I won't be bothered with the burgers again."}
{"text":"I think you'll hear this a lot about Acme Burger... \"Its not Great, Its not Awful... but i've had better.\"  Service isn't bad.  A problem for this location is that a Hero Burger opened up near by... so when i compare the two, I don't have any strong preference for me to say \"ACME burger ... that is what i want.\""}
{"text":"Well not going there again... Upon greeting the guy there and saying \"hey how are you\" he goes on a tangent badmouthing the previous customer... Whatever.. Just ordered a burger, took over 15 minutes to make, had to listen how he hates the job. Bun was cold, beef burnt, bacon dry as hell.. Guy using the phone with the gloves."}
{"text":"There's a reason you don't see Onion Ring poutine around town. You can dip your onion rings in gravy and there will BE no problem, but if you go overboard and turn it into a poutine, you're GONNA HAVE A BAD TIME.  This bad time can be located at ACME burger. Once you get in the door you'll have to convince yourself that you don't smell traces of urine.  Diluted urine, but urine none the less...The guy there really hates his job.  I asked him if he likes burgers and he said \"its all garbage!\" then he asked what toppings he should put on the burgers...no fudges given.  I ordered the \"Ringtine\" and it was like 6 onion rings floating in a pool of non-delicious gravy and non-delicious cheese goo.  The batter from the onion rings homogenized in the gravy quite quickly and everything turned to goo within 5 minutes...had to grab a spoon.  A SPOON.  disgusting.    oh and the seats in the booth have major stab wounds. DONT sit on em   2 stars."}
{"text":"Did I read below that a hamburger fresh off the grill was dripping grease? I wont even waste my time going further on that one...ok i had the 8oz when i went combo it was not busy so it was too long a wait for our food, it was a good hamburger I will say that..but my cousin who shares similar taste with me says I need to check out Craft burger..so I will do so eventually...I have no problem with this spot here..as I did not have to deal with large crowd issues that frustrated the server....but what dripps out of a burger that comes off the grill is the juices...hence why they always say let the meat sit for a few mins after cooking..."}
{"text":"A decent fast food option before a show at the Bloor. You can choose which size you want -- 4, 6, or 8 oz -- in addition to your toppings. Not sure why it's gotten such poor reviews, but everything was great when we went. And the bathroom was clean, which is always key. Great fries, too. You can also choose which toppings you'd like and you can watch the news channel while you eat."}
{"text":"The service was friendly but the poutine was pretty gross. Should've known better, ordering poutine at a non-poutine-specialised restaurant in Toronto is asking to be disappointed. It's not hard to cook decent fries, buy proper cheese curds and prepare a decent gravy...I don't get why so many restaurants get it wrong."}
{"text":"The staff is friendly and the place is reasonably clean, but the food is a nightmare. Hands-down, one of the greasiest burgers I've ever had in my life; I had to force myself to finish it and spent the next hour why I did that to myself."}
{"text":"The service was decent enough, and the burger came out pretty fast. The toppings for the burger were reasonably fresh and there was a good variety. Plenty of seats in the restaurant, and the place looked really clean.  The quality of the beef is (supposedly) very good, but it was a little too overcooked for my personal taste. There's really no one specific reason to come to this place. Nothing really stands out. The burger itself wasn't anything phenomenal, but I guess it was okay for $5.00. I probably won't be coming back here to be completely honest."}
{"text":"Stumbled across this burger joint during World Pride as we were all starving and wanted to eat some food where we could sit in the shade.  I got the 4oz burger which was a great size for me, it was delicious! Great seasonings on the patty and great condiments.  My only complaint about the burger was that they have 3 sizes of burgers, 4oz, 6oz and 8oz, but all the same size of bun for all 3 burgers, so a good chunk of my burger was bun. Fries were delicious, drinks were kinda small but refreshing.  The place was crowded being world pride and all but I was able to nab a booth just as a group of people were leaving.  I'd definitely come back again!"}
{"text":"Two & a half stars.  I was holed up at the Etobicoke School of the Arts for a few days auditioning divas for our 2010 spring production. http://www.youtube.com/watch?v=T4ZVkrpUDaY  Ain't nothing like being in a room full of 16 year old Divas in Waiting singing their little hearts out.   By noon our ears had had a yaffle full of warbling wannabes so my Diva Auditioning Committee headed off for some lunch.  We hit up Acme Burger on the corner of Royal York & Queensway.  It was that or Pizza Pizza.  You can tell this is a corner that caters to highschool students (there are three highschools on Royal York just north of the Queensway).    Acme, Hero, Harvey's, Lick's....different names, same damn burgers.  Acme's claim to burger goodness is that they use Angus beef.  Whatever.  Grind that beef to a pulp, form it into one of those flat patties and flash freeze it.  They turn that Angus beef into the Soylent Green of hamburgers.  As usual I order up my Cheeseburger combo and for $9.75 I got a 6 ounce frisbee of beef, fries and a fountain drink.  What is it with these signature sauces?  Hero does that rancid Ranch crap and Acme has something similar with a dill/garlicky taste.  If you ask me it's just glorified mayo with some dried up herbs tossed in, hence trying to appear to be gourmet.  Uh huh.  I ain't buying that.  Personally I think it is just their way of trying to hide how average and mediocre that meat is.    The dividing line between Acme and the other Stepford wife hamburger chains is that the fries are fresh cut which is good.  The downside to it was that either the oil needed to be changed or the heat needed to be turned up.  The fries had great potential but they were soggy and somewhat oily.  Being able to taste the oil on fries is the kiss of death to them.   Complaints among my Diva posse were that the burgers were inconsistently cooked.  While mine was cooked my Diva sista and Musical Director, Danica gagged on her semi raw burger.   Not good.  The onion rings got good reviews and interestingly one comment was that the fries didn't taste like the rings which got me to thinking they cook them in separate fryers.    All in all, Acme Burger, you get no R-E-S-P-E-C-T from this burger Diva."}
{"text":"So-so burger, mediocre fries. Very little reason to stop here when there's so much great, cheap food in the neighborhood."}
{"text":"Hero Burger better clean up their act since ACME burger is across the street at Church & Wellesley great fries onion rings and the burgers are nice and big their salads also look really good the staff are doing the best they can seeing it has only opened a week now and I was treated very nicely and efficiently  just updating this to say I had a greek salad yesterday and it was terrible brown lettuce and no flavour their burgers are great the salads ain't"}
{"text":"I'm surprised that this hasn't been yelped as much as I have expected. Upon entering the restaurant Acme gets straight to business and welcomes you with a back-splashes wall leading towards small ordering counter made of wood surrounded by pictures of food and a drink display. Here you place your order and make your way over to the seating area.   There isn't much interaction with the employees here as they are usually too busy taking orders while cooking but who needs interactions when you've got some burgers coming, right?  Acme has one of the nicer seating areas I've seen for a burger joint. White walls, white leather booths with wood trim, light wood tables, white leather wrapped chairs, a slew of pot lights throughout the length of the area, a condiment station that doubles as a waste bin, and funky hanging light fixtures.   The cook yells out your order number, you walk up to the counter and pick your toppings and sit back down to eat. The burgers here good but I wouldn't say good enough to come running for. You can't specify how cooked you want your burger and I think they may even be frozen? They are akin to the burgers at Hero's Certified Burgers. The buns are great because they have BOTH poppy and sesame seeds. The toppings are fresh but the burger as a whole is just okay. Onion rings on the other hand are fantastic as they are perfectly cooked so when you bite them the onion doesn't slide out, they aren't oil drenched and are perfectly crisp. The onion rings were by far the star of the show.   Overall, the burger was average but the onion rings were stellar. The prices aren't bad and I would say you get what you are paying for. I wouldn't go out of my way to come here but if you're in the area and are hankerin' for a burger and some really tasty onion rings, Acme hits the spot.  PS They have ice cream and milkshakes!"}
{"text":"First sign this new \"hip burger joint\" may be more style than substance? The person cooking the burger presses down on the patty when it ison the grill. I'm no grilling expert, but I know pushing down on a burger squeezes out the juices and leaves you with a dry chewy burger.  And, lo and behold, the burger was dry and chewy. It's a shame too, as the toppings were really great and of a good variety.   The fries were hot and fresh - decent but not amazing.  Overall, if you need something to soak up some excess booze at 3 in the morning, ACME Burger isn't bad and it's open late. But if you're looking for a decent burger, this isn't the place."}
{"text":"This place was on my radar for two reasons. They are open until 3 or 4am on Fridays and Saturdays and they have developed new ways of serving poutine. I agree that overall this place deserves 3 stars except that I can see this being a new favourite place of mine, so I'm upgrading it to a 4.  Service is not fantastic, the servers I met weren't overly personable. The wait for the food is about double the time of most fast food joints but if you \"dine in\" they do serve your food on a silver-coloured platter. That was a nice touch.  I ordered the sweet potato poutine and a shake. My company complained that the food was warm at most, and I must agree with that; however, it was a perfect temperature for me (I'm strange that way). The poutine had such a unique taste but savory. I can't wait to return to try some of their other variations. The shakes were creamy and made with real ice cream. The portion of both were a reasonable size.  Price point was reasonable and they met, if not exceeded my expectations. I can see issues that others might have if they 'walked in my shoes' for the night. However, I will definitely be returning and encourage those who want a new twist on everyday food to give this place a try.  Bon appetite!"}
{"text":"Horrible place.  Overcooked burger brown lettuce and dried out onions... add that to the surly server and general unclean feel to the place.  I won't be back."}
{"text":"Really rad drunk food. My friends and I always make a point to stop in after the bars to mow down on some veggie burgers. The staff is either really friendly or extremely rude but in all fairness this place can be PACKED with stupidly drunk people.   It's always pretty clean, nothing special. I would only stop here for drunk food to be honest. The prices are pretty average for a for a burger joint. The food is amazing when you've had a couple shots of tequila. They have good toppings, sauces. Nothing to complain about."}
{"text":"Yet another burger chain I've never heard of - this one just opened their newest location, in the gay village.  I visited this weekend for my first time.  Lots of little issues.  Their debit machine wasn't working properly and was taking about 5 minutes per customer. There is absolutely no organization and the counter staff just couldn't keep track of my (one) burger and almost gave it to someone else - twice!  When she finally put it up on the tray, she kept pulling it down the line, instead of just giving to me. I had to point out that a) it was my burger and b) there was nothing else to add to the tray.  I don't think they've been open long at all, so maybe these are just growing pains.  The burger itself though was pretty plain. The topping choices are generic - lettuce, tomato, pickles, olives, etc.  Even the sauces are just BBQ, ketchup, mustard, etc. With competing burger chains offering interesting choices like mango chutney and hot pepper relish, you'd think they'd have come up with something fresh.  Or at least copied some of those places great options.  They do have sweet potato fries, which I think is great, and even sweet potato fry poutine, which i don't think I would ever eat, but it sounds interesting.  We'll see how many of these places can keep popping up. I would think that Toronto's appetite for the \"gourmet\" burger should be mostly exhausted by now."}
{"text":"This place is way better then Hero Burger, and has the same style of food.   They are open late - bonus for all the bars in the area.  The burgers are grilled fresh to order, but I find they are sometimes over cooked.  Due to everything being fresh to order, the chicken breast burgers, or salads, take a long time.  If you're in a hurry, go to McDonald's.  The staff is friendly, but can be slow.  They also sometimes forget to change their gloves, so watch them carefully.  Their bacon is not bacon, it's turkey bacon just as an FYI....this is how they get around being Halal.    Over all good in a pinch, and their Poutine is pretty decent."}
{"text":"Ate lunch there today.  The fries are just OK.  The burger had a rancid taste to it - which usually means that they don't scrape the grill often enough and the old burger grease goes bad.  It makes me question the overall cleanliness of the place.  Harvey's is a block away.  Go there.    Won't go back."}
{"text":"I had a meeting this morning in Mississauga.  Heading back to Toronto, I stopped at Acme Burger in Etobicoke (Queensway/Royal York) for lunch. I'd heard they had a good burger so thought I'd check it out.  I ordered the 6 ounce burger combo ... burger, fries and pop. $9 including tax.  There were two people ahead of me and we had to wait about ten minutes after an unfriendly fella took our orders. He poured our pops right away. I hate that because they get warm and/or the ice melts.  There are lots of condiments to choose from ... the fella dressing the burgers was friendly.  The fries were really good ... they are hand cut and apparently not frozen. They were hot. The burger was so-so. The meat was warm, not hot ... no doubt the hold-up was getting the fries cooked so the burger had to sit and wait. They toast the bun. I had a whole wheat bun which was lightly toasted. I could have also had a white bun but it was way overtoasted.  I'm glad I stopped in and tried this restaurant ... I won't be rushing back, though, as it was just an okay, not great, experience."}
{"text":"I've eaten at this place a few times and I always found it to be a decent burger. A burger worth repeating and a burger that had a good taste. I never thought it to be the best in the city but it definitely wasn't the worst, not by a long shot.  Now their burger menu is quite large. 4 ounce burgers, 6 ounce burgers and 8 ounce burgers. Then they have specialty burgers and they have a whole slew of toppings. Guacamole, mushrooms and olives are a few of the ones I can remember. They also have a variety of cheeses and they make their fries fresh.  This time though I was in need (for consistency) of a double. So I stepped to the counter and perused my options. A double 8 ounce or 6 ounce was to much; a single 8 ounce would be perfect. So I asked the guy behind the counter for an 8 ounce burger but with two 4 ounce patties. He was more than happy to oblige. I ordered the combo with the fries and a coke.  I ordered, I payed and my total was ten and change. As I was paying I saw the burgers hit the grill. They seemed fresh, not frozen, which is always a plus. After about 5 minutes I was called up to pick my toppings. I picked the usual: pickles, lettuce, tomato, onion, mustard, ketchup. These toppings were placed on a perfectly toasted sesame seed bun. About two minutes later my food was ready and I was about to dig in.  Before I get to the burger here is a quick note about the fries. I remember not liking the fries at Acme. I remember them being to thick and not cooked enough, not crispy enough, not fry like enough. They tasted more like potato, or baked potato. This time though they were delicious. Cooked perfectly, crispy, tasty, hot, yummy. So good that I ate a bunch (it was only supposed to be one) before I even tasted the burger.  So the burger how was it this time? As per the other times I have eaten here it is decent enough. You can taste the freshness of the beef and it tastes rather good. It's grilled, not smashed or griddled or flat topped. Maybe, just maybe it is a little blander than most fresh beef patties but it'll do the job in a pinch. I'm pretty sure the bun is the same for all 3 size burgers and the 4 ounce patty seems to fit nicely on the bun. I guess the bun could be smaller but I'm talking millimetres here. I also thought the patty to be a little on the dry side. It worked fine with ketchup and mustard but it could of been a tad more juicy.  So the patty and the bun work, what about the toppings? At first, and by that I mean the way they look, I thought the pickles would suck. They looked way to vinegary. Well I was wrong. They were delicious (at least in conjunction with everything else on the burger). The tomatoes were tasty, the lettuce was a full crisp piece (not shredded) and the right amount of ketchup and mustard was placed on one side of the bun making the slightly dry patty go unnoticed unless you think about it. Sadly though the onions were lacking. They weren't crisp and they looked rather old and soggy when he placed them on my burger. They were red onions though and they tasted okay (as onions generally do).  Overall The Acme Burger Company is a pleasant eating experience and one that I would recommend if you are in the area. It's not the best burger put it passes the test and it's worth eating at least once. Plus their options for sizes and toppings are rather appealing for a variety of appetites.  Great fries too...  Out of 7 The Acme Burger Company scores 4"}
{"text":"Good burgers, fresh toppings, beef a little overcooked for my tastes.  I'd go back more often if the fries weren't so thick, I prefer my fries French bistro style.  Just wish I could find an in-n-out style burger in Toronto.  Gets expensive having to fly to California or Vegas everytime I get a double double craving."}
{"text":"The paddy was large and that's as much positive feedback as I can give this place. The joint looked dirty, the tables were sticky, the place seemed run down.  The toppings looked so old, and it was only 5:30 pm - I mean - they looked like they had been there for at least 3 days. Lettuce was wilted and dark, the tomatoes looked so gross and were mushy and old looking (like when you forget you left cut up tomatoes in the fridge for a week), there were flies landing all around the toppings.   My fiancee was really craving a burger and we had already paid by the time we noticed the gross toppings, so we decided to go with it, pick the items that looked the least old, and PRAYED FOR NO STOMACH FLU.  The burger was alright, the toppings were SCARY AND NOT OKAY. Whoever owns this franchise, please please care for your business. UGH."}
{"text":"This place isreally good, i suggest people check this place out. the burgers are juicy and delicious and come in 4oz, 6oz, and 8oz for the people who love big burgers :) I'm not a big fan of onion rings but these are quite enjoyable and not over powered by onions. The chicken burger is good as well, it's a nice place and a beautiful place to eat."}
{"text":"Where is the passion?  The guy flipping the burger back there had his headphones on while screaming at his co-workers. Poor communication skills between the staff as well. The grill the burgers are cooked on is tiny. The burgers are so close to each other, that when he puts a raw burger next to a cooked one, they almost touch. I was scared. Didn't end up finishing the burger.   Also, whats with this guy in pressing down the burgers? It was like a dry piece of coal with lettuce and tomatoes on it severed in a bun. But, the price wasn't steep. (I guess you can say it was worth it)."}
{"text":"I was craving a burger and I have passed this establishment on my way home many times. So on one evening this week I walked in to check out their menu. As I was browsing through their menu, someone who I assume was the manager, suggested that I get their special of the day; the steak burger. Mmm I love steak! Sure, why not. And for $5, it sounded like a great deal. As I was paying for my burger the manager asked me how I would like my steak done, and I said medium. I then stepped back and waited for my burger to be made. At the counter you can see the food being cooked and I could see that my burger had been on the grill for too long. I told the guy cooking the meat to put the steak aside (the mini steak by the way--the piece was pretty small) because it was becoming well done. He rolled his eyes and put the piece of meat on the side of the grill, but still ON the grill! Then he proceeded to put onions on it and placing it on a bun. \"STOP!\" I said. What is that? \"I did not ask for onions.\" \"It comes with them\" they said. Then I looked at the menu description again and could not find onions as being an automatic ingredient that was supposed to come with the burger. \"Where does it say that?\" I asked. \"It doesn't say it anywhere.\" They said. \"It just comes with it.\" \" What???? \"I hate onions! Take them off!\" And again, with a clear attitude he removed the onions. What the heck? As the customer, and as per their advertizing, WE are supposed to choose the toppings. By this point I was becoming really annoyed and disenchanted by the whole experience. I finally chose my toppings that were the average toppings that you would find at Harvey's and I sat down to eat my burger.  Come on, who does not love to eat meat that tastes like leather? If you are going to ask me how I want my meat cooked, the assumption is that you know how to cook meat.   I ate half the burger and trashed the rest.. Worst $6.50 I ever spent (I spent more because I asked for cheese)!  I highly recommend you go to Harvey's instead."}
{"text":"This is pure evilness. But GOOD evil.   I had the tuna sandwich one of their pseudo healthy meal together with ultra healthy vegetable - potato fries. I asked the server if she would recommend cheese on tuna and her response was \"I don't know\". See he difference between fast food and sit down dinners?  The tuna burger was great but like any tuna sandwich, it leaves a gross after taste. Thankfully, I am not meeting anyone after. I smell like a mermaid.   The patio seating is cool but there are plenty of comfortable seats inside. My visit exceeded my expectation only because I thought it would be crappy. I was wrong. It was adequate. Three star for ACME!   Oh... what's the difference between sit down and fast food?   Server to you conversation:   Fast food = I don't care.  Sit down = order more so I can get more tip.   Oy!"}
{"text":"I put Acme a cut above your typical fast food joint, but not as good as boutique places like Craft Burger.  This is really a 3.5 star review but I'll give them a bump up because the service was good.  They have lots of great toppings including their \"Acme Sauce\" which is like a garlic mayo.  Other non-traditional toppings include banana peppers, jalapeños, and 3 choices of cheese.  The traditional Acme burger is available in a 4, 6 and 8 oz. size and they also offer chicken and veggie burgers.  Your choice of sides are fries, sweet potato fries, and onion rings.  I had the sweet potato fries which were nice and crispy but nothing else really stood out about them.  Overall this is a good lunch choice if your in Etobicoke and looking for something off the beaten path."}
{"text":"This is the best of the the Acme Burger locations I've been to.  I'd still rather go across the street to Hero, but Acme will do in a pinch.  I'm not sure if it was a new opening glitch as I came here not long after they opened, but they rafters were filling with smoke from the grill. If it wasn't a nice day and if they didn't have all the doors open they would have been smoking everyone out of the place."}
{"text":"My first experience at Acme Burger Co was quite OK.  $9.99 Combo that includes 6 oz Burger, Home Fries and Ice Cream Milkshake.  Fresh thickly cut home fries served right off the fryer! That's always a winner. Freshly made Chocolate Milkshake one of my favourite sinfully liquid dessert...  How's the burger? Whole Wheat Bun is really a tad too healthy for my taste. Beef patties a little char coaled, a little bland... But my friend just wolfed that down in record speed.. Was he hungry or the burger just too yummy?  The deco and furniture looks a little tired.. But the patio does look quite inviting!"}
{"text":"I came here one night because nothing else was open - i guess because it was so late. I went in and ordered a vanilla milkshake and a poutine it came to around 13$ which is crazy expensive..  The milkshake wasn't sweet. It tasted like milk and vanilla icecream mixed together.. and it was small for the price i paid!  The poutine was REALLY small and was only 1 size.. it was gross...  I think they are only meant for burgers.. dont try anything else! :( I am going to go back and taste their burgers and give them 1 more change.. but other than that im pretty dissapointed.  WASTE OF MONEY!"}
{"text":"Good burger tastes like dads off the BBQ and the gravy on the poutine is hot enough to melt the curds. The staff were friendly too.  This was also a very quiet time for the restaurant.  I'll be back."}
{"text":"This review is for the sweet potato fries and the chocolate milkshake.  YUM."}
{"text":"I wandered around Toronto looking for poutine.  Wasn't sure if it was only a Quebecois thing but found it at Acme Burger.  The burger was frickin' good.  Basically, you pick your own toppings, as much as you want, and it's made to order.  If you get the combo, you get a drink and fries.  I upgraded and got the poutine instead of fries.   Gut bomb, oh yeah, but so, so, worth it.  I love poutine: gravy, cheese, fries. Yay!"}
