{"text":"We came here with a party of 8 to celebrate my buddy's last day as a single man. We came here before we went \"bowling\". 

The decor was warm and has a lot of character. It gives you a very homey and comfortable feeling. 

Our server was very accommodating as we decided last minute to try the chef's tasting menu without making prior reservations for it. 

The server gave us no fuss and congratulated the groom to be. If I remember correctly, we had 7-8 courses and everything was delicious. 

The only reason I gave this review 4/5 stars is not because of the quality or tastiness of the food. It was during a couple of our courses we were served polarizing dishes.

For example I was given a dish that was lighter in flavours while my friend was offered a more robust and heartier dish. I'm not certain if that was by design, or that they ran out of food to serve all 8 of us. It just makes you want to try the other dishes you weren't served.

I found the price to be fair for the quality of food and portion size. 

The chef came out as each course was being brought to our table. He took the time to explain what we were eating and how it was prepared. It was very informative and a good way to pick the brain of this talented chef.  

We all had a great dinning experience and I will definitely return.  I have no problem at all in recommending this place for a special occasion."}
{"text":"i really wanted to like this place. i'd been staring at it for months and had my reservation planned since July. I was completely disappointed. while the ambiance was breathtaking, the food and service were not. as i waited for my friend to arrive i was greeted by the server and given a drinks and food menu. after my friend arrived we both ordered wine - delicious.
i then ordered the \"scallops\" appetizer, which ended up being ONE. MINUSCULE scallop with a small spoonful of unseasoned puree. my friend had the mushroom soup which she enjoyed but i found to be OD'd with truffle oil.
the mains came... with some table bread .. ( which i would have preferred while i was waiting or as we were drinking our wine or with the apps... anything but with the mains!)
i ordered the \"ontario lamb rack\" $28. may i emphasize the word RACK.
it was TWO tiny tiny lamb chops.. literally about 2cm wide.. with some soffrito and some quenelles of again unseasoned puree of something...
my friend ordered the pork dish which she enjoyed and seemed to be in better portion.
i personally was completely disappointed.

as i payed my share of the $185 bill my stomach grumbled and i felt completely robbed and disappointed!

the service , although our server was very friendly and smiley... was extremely extremely slow. even when we asked for our bill i watched her folding napkins for next day's service at an empty table... sorry but i expected more for the prices they are charging. 

the dessert was also terrible. an apple upsidedown cake..tasted burnt. and my friend ordered an americano which was filled so full it spilled all over the saucer while the server carried it over to which she mentioned \" sorry its a little full\" but then spilled all over the table and my friend's blouse as she tried to sip it. why not just pour a new one??? major points off.

siiigh.....

good luck actinolite. i really wanted to like you!"}
{"text":"Had a great dinner here! Some very interesting plates, the two duck courses were exquisite. The highlight was definitely the wine pairing, I felt this was very well executed - the various delectable wines perfectly complimented each course. Excellent attention to detail!"}
{"text":"DON'T COMPLAIN OR ELSE THE CHEF WILL COME AND BE RUDE TO YOUR ENTIRE TABLE AND RUIN YOUR EXPERIENCE

I frequent a lot of great restaurants in Toronto with my wife and our friends and we had a terrible experience at Actinolite this weekend. As locals of the Christie Pits neighborhood we were really hoping that this would be a gem, it wasn't, we are really lucky that we have so many other amazing places around us.  

We went to Raw Bar the next night on Dundas and it blew Actinolite out of the water in food and in service. This may be a long review, but it is a good story, so hang in there readers.  

Six of us went out for dinner and we all ordered apps, mains and a few bottles of wine.  Three of us ordered steaks and when they came to the table two of them were definitely done medium, when we had asked for them to be done medium rare. There was no pink inside the steaks and my steak was literally half the size of the streak my friend ordered who was sitting in front of me.  I wondered if mine was thicker, so i cut a middle piece and compared it and it was exactly the same height.  We told our waitress that we had a few issues, she agreed with us and told us she would see what she could do about it.  The next thing we know the chef comes out and wonders why there were so many issues with our table.  My friends wife said that her steak was medium and he rudely told her that \"this is how i do medium rare\" (with no pink) and stared her down. Then he asked the table what the other issues were, my friend said that his streak was covered in garlic and that wasn't stated on the menu. The chef said that there wasn't any garlic on the plate, but there was a lot of roasted garlic cloves (which were pretty good if you ask me), then i said that my steak was half the size of my friend's and he looked at me and said \"oh, well that's the way i cut it\" and then walked away from us.  We were all stunned by what happened.  We all came to spend $75-$80 a person on dinner and none of the staff in the restaurant seemed to care that the chef completely disrespected us.  He acted as though we weren't good enough to eat his food, which is a terrible attitude to have.  

About 10 minutes later the owner was staring at us, and I waved her over to our table, we told her what happened, but i am sure she already knew as she is married to the chef.  She apologized to us and said she didn't know what was wrong with him and nothing was done by her to make us feel better. At the end of dinner the owner came back and apologized again and we asked her what we did to deserve being scolded by the chef. We asked her to go to the chef  and ask what we did to upset him and she refused to ask him, saying the kitchen was too busy. We said that there was only one other table there and they were finished their meal, so we didn't see why she couldn't talk to the chef, but she refused and told us they were going to comp us desserts and \"we should call it a day\".  They brought out two desserts for the six of us and actually charged us for them on our bill.  We had to get that fixed as well.  They think they don't have to serve their locals well and i hope they know that without us they won't survive.  They should stick to being food stylists and stay out of my neighborhood."}
{"text":"Tried Actinolite for dinner based on all the very good reviews and came away completely unimpressed. The food, at best, was competent - ok, somewhat mediocre. For the prices charged ($14 for the shrimp appetizer, $26 for a veal chop), you should get food that has alot more flavor and is better than what I can cook myself at home. 

The veal chop for $26 was bland. The calamari appetizer was similarly tasteless. The white fish entree was the best of the food and even that was on the bland side. None of the food had \"oomph\" to it nor was memorable in anyway. 

The so-called bar had hardly any liquor to choose from. It had 1 vodka, 1 scotch and no bourbon. Very surprising given how restaurants earn their biggest margins from drinks. 

Best part of the meal were the cappuccinos. Service was decent also. 

All in all, a very disappointing experience and one that won't be repeated."}
{"text":"Service was very good, ambience was nice, but food, sadly, was B+ -- they really should have done better for this price range. 

It's a shame, we had been to Actinolite under its old bistro formula and the food was significantly better and less expensive. The new format is a tasting menu, obviously designed to up the bill (you walk out paying at least $150 for 2 instead of $90), and to take advantage of the latest foodie trends. Don't get me wrong -- I like foodie trends, but here, it's all form over substance.  Despite having interesting-sounding ingredients, nothing was a stand-out dish. For example, dessert (mushroom something with chocolate fudge) sounded interesting, but didn't pan out."}
{"text":"Just remind one thing: Bugey wine is not a \"vin d'Alsace\" but a wine from the french Alps. Otherwise: great food, stylish atmosphere.  A bit expensive."}
{"text":"I'll start with the conclusion - I love the place.  My only quibble is that I wish their wine list was bit more extensive.  However, they offer BYOW and thus I can drink my own wine there, so that is no big deal.

The food is exceptional, delicious, interesting and weird - crickets anyone?  FYI - they taste/texture was similar to crispy rice.  However, the chef/owner states, it is not for everyone.  However, if you are open minded and willing to be a tad adventurous, I think you will be rewarded as I am every time I eat there. 

Their menu changes often, so I don't see any point in discussing individual dishes.  If you want to see details of the food for one our meals there, you can see it at 

http://www.wineberserkers.com/forum/viewtopic.php?f=1&t=129369&hilit=Actinolite#p2041317

Their mission is to only use ingredients from local farms, and at most, ingredients available in Canada.  There is no Lime/Lemon or any acid components in the dishes that are not derived from either pickling or fermenting local ingredients.

This focus leads some interesting flavours, as noted - hence my \"weird\" adjective :) 

It took me a little of bit of time to appreciate their approach - as a person of East Indian extraction, I love my food when the flavours smack me upside the head, and are acid-forward.  Subtlety is not an attribute that I possess in any form :)  The savoury and subtle flavours really need to be well integrated and even then I have to think about it to really enjoy it.  

I have taken a giant step in food appreciation due to what I have enjoyed and learned from this kitchen and their food.

The service is excellent and very informed.  Wine pairings are well chosen and recommended.  

Since they offer BYOW, when we had a group of 9, we brought about 12 bottles.  We also brought our own glassware because otherwise, we would be hogging all their glassware.  They washed, polished all the glasses before and after dinner. That is beyond the call of duty and we appreciated it very much.

If you are an un-adventurous soul as some of my friends are, do not go there.  Otherwise, you will be rewarded."}
{"text":"Surprisingly nice restaurant in kind of an out of the way spot. We just happened upon it, but I was impressed. A bit expensive, but the food is prepared with a lot of care. Started with the calamari which was nice and plated beautifully.  I got the veal t-bone. They didn't ask how I wanted it cooked weirdly, but it came perfectly medium/medium-rare. A nice hearty piece of meat. On the other hand, my girlfriend got the steamed fish, which was nice, but not all that filling."}
{"text":"Had the seven course tasting menu. The whole experience was wonderful. Each dish was prepared with such care and artistically beautiful. The favors were fresh and crisp, to savory and rich, to sweet and delicate, depending on the plate. For me, I was satisfied at the end, but given much of the meal was freshly foraged by the staff, my boyfriend would have preferred some of the portions to be larger. Nonetheless, it was perfect for a special occasion."}
{"text":"Really don't understand what the all the rave reviews are about. I've been driving by this place everyday and read great reviews so naturally I had to try it. Booked my reservation and already had it in mind to go with the chef's tasting menu with wine pairing. 

Now, let me just say, I have a great appreciation for chefs that are passionate about local ingredients and convey and share that passion with their customers. From the ownership to the kitchen to the wait staff. That passion is shared. And for that, I will give a 2 star rating. 

But seriously. About $100 per person with drinks and the serving size is a joke. Spin it however you want, apple 3 ways, cooked and raw locally sourced..you gave me cubed apples. About a spoonful. And that was the theme for the entire menu. Cabbage and Halibut? It was a shred of protein. Squid? Less then an ounce. And this beautiful wine to go 
with it? Barely 2 sips. If your going to charge $65 for wine pairing at least pour a generous glass once during the course. After 7 courses, we hopped in an Uber and went right to Harry's charbroiled for some substance. 

Waste of money. Great staff, waste of money on something I can't even consider a snack. Would I ever go back? Nope. Would I recommend? Not a chance. Do yourself a favour and book a reso at a place like Skippa. It's just down the street and over 1000 times better."}
{"text":"Actinolite was recommended to me by a co-worker which can mean anything from greasy late night eats to a 9 course odyssey. Actinolite was much closer to the latter rather than the former! Its menu advertises a seven course  tasting menu which when in practice ends up being much more when you account that the \"snack\" course actually included 5 different plates. My girlfriend and I are pretty adventurous eaters so I really didn't take too much time to read the menu - I mean it's not like we had a choice what we were getting! This ended up not being an issue because the chef was kind enough to come out and explain some the dishes himself as they were served, and the remaining ones were brought out and explained by his lovely and competent entourage of staff. It seems like the menu changes frequently as a premium is put on local produce and seasonal vegetables so I wouldn't necessarily think my menu would be the same as the one served next week, but suffice it to say we were both very impressed and completely stuffed by our visit.  When we were there our menu included a couple different types of meat and I would be interested to know whether vegetarians could be accommodated. I would highly recommend Actinolite to anyone looking for a venu for a special occasion."}
{"text":"Simply amazing! Great staff, exquisite food. Love it. Great addition to anyone's restaurant list!!!!"}
{"text":"I dined here recently and had the 7 course tasting menu. The service was attentive and friendly, the space is warm and inviting, but for the price, the food was underwhelming. The dishes were mostly good, but nothing more. Some of the food was under-seasoned and the presentations eventually felt monotonous (grey plates, food on one side). Some of the dishes felt a bit gimmicky, a rather bland squid skewered, but not cooked on a twig comes to mind. The carrot dish and a dish of fish and beets were the highlights of the meal.

I found it to be somewhat unclear from the website, but they only have a choice of two tasting menus, which must be ordered for the whole table. Dinner took about 3 hours in total, which considering the mediocre food felt somewhat tedious.

Unfortunately, at $75 just for food, I feel you can do much better in this city. I think you can actually spend a quarter of the price and eat better."}
{"text":"I'd like to describe my first and only visit to Actinolite and you can judge for yourself.

Actinolite was suggested as a good restaurant to take my girlfriend for her birthday. I called to speak to the restaurant to inform them it was for a birthday and that I would like something special for the dessert. For example; for my birthday we went to Ici Bistro and my girlfriend mentioned it was my birthday and dessert came out with candles and \"Happy Birthday\" written in chocolate. Chef Justin called me back quickly and we spoke about the possibility of a candle. He told me that he has worked really hard to create the textures and food experience and that he doesn't really like the idea of putting a candle in it. I was open to any sort of special birthday acknowledgement. Chef Justin was friendly and said that they have candles and that he would do that for us. I was happy, excited for dinner, and looking forward to the surprise at the end of the meal.

* Arrival - Friendly greeting and told we can sit anywhere
* Seated and selected the 7 course meal ($75/pp) and a glass of red (server appeared knowledgeable)
* Staff member came over and introduced himself (\"Cal\") welcoming experience. (servers alternated)
* Dishes arrived quickly and the server introduced each item.
* Some portions of the menu are served without silverware for patrons to eat with fingers.
* Towards the end of the meal a glass or cup fell off the bar counter and struck my girlfriends chair and broke. Accidents happen. However, at no point did any staff member acknowledge or apologize.
* As each meal came I was impressed with the effort that went into it but left underwhelmed. The most substantial dish was the carrot dish (served three ways), served without silverware.
* Dessert arrived. Plenty of delicious sauce that could have been used to write \"Happy Birthday.\" Unfortunately all I can say is that it arrived. No birthday candle was in the dessert as agreed upon, and my girlfriend did not have any birthday acknowledgement at all. 
* Dessert was finished and then we were asked if we wanted tea or coffee AFTER dessert was finished (odd). We declined the coffee/tea. I paid over $200 including the 15% tip and left. 

* It is important to note: we returned home and had to eat pizza because we left hungry. The bottom line is that Chef Justin has created very different and unique tasting dishes. However, the portions are small. In my experience it is not normal to spend over $200, eat 7 courses, and leave a restaurant hungry."}
{"text":"So amazing. So refreshing to have great service finally. The food was delicious and so intelligently put together. Loved that they foraged the herbs the day before! Must try and try again."}
{"text":"The service was amazing, dishes were creative and well balanced. We learned a few new vegetables during this meal. You can feel their passion and love for food and beauty in nature through the dishes. Only suggestion would be to maybe diversify the protein more, we had two fish dishes. 

Portion size is typical of fine dining spots and we were stuffed after the 7 course with additional of 3-4 snacks on the house. The rock shaped chocolates at the end were AMAZERS."}
{"text":"Very expensive.  We had the four course tasting menu.  I am usually outraged at how much food even high end restaurants serve, but at this restaurants the portions were so tiny that it was ridiculous.  Particularly for me because I can't eat gluten and thus bread.  The good had little flavor although everybody was deeply earnest and very pleasant.  The wine pairing was 2oz precisely for every course but served before the food came and so it was gone before you could pair it.
I think the chef needs to rethink.  A tiny bit more food would be helpful here.  Plus a bit more flavor.  If that were changed, the place would be great."}
{"text":"Ok, here's the deal with Actinolite (in my estimation, anyway, and I eat out a lot). It's a case of the Emperor's New Clothes: everyone is wildly raving about something that just isn't there, namely tasty food. I don't give a hoot if you've foraged on all fours for those berries; they had better taste excellent for the price you're charging.

I dined there about a year and half ago and I had the tasting menu with a friend. The server was lovely and the chef was friendly, but that doth not make the food good. Sorry, folks. Let's start with the lowest point: dessert. I spit it out into my napkin. It was chocolate mixed with cepe (a mushroom). Imagine dousing delicious chocolate ice cream with a sauce that tastes like mushrooms? No, really, think of that combination. It was honestly revolting. Nearly liverish. My friend had the same reaction. There's a reason fungus-y shroom isn't a flavour at Baskin-Robbins, ya know? 

The squid on the twig made me laugh. While the texture of said celphalopod was nice, being forced to eat it pretentiously off a tiny branch instead of with cutlery means that your fingers smell fishy for the next course -- great! Fishy fingers to go with weirdo mushroom dessert. And unlike other reviewers, I did not find the famed carrot dish all that. It's essentially carrot lopped off into different shapes on a plate. Ok-tasting, but pretentious to the max. I was glad I wasn't paying because it was expensive and not good at all. I've heard that not ordering prix fixe is the way to go. Maybe one day, but for now, no thanks."}
{"text":"I've been a few times, and not just the menu but also the style of food changes a lot by season, as the chef sources things locally (in winter a lot more pickled, fermented, and preserved things, in summer more fresh veggies).  

The presentation of the food is spectacular.  Beautifully arranged on pieces of slate, rock, wood.  The 7 course menu is preceded by a few snacks/amuse bouche.  Each new item coming to the table is a surprise, because the ingredients are combined in such unique ways that it's difficult to predict what's coming out based on the menu.  Of the various foods and wines we tried last night (did the full menu with pairings) there were one or two items that we  didn't love, but we were still impressed enough with the creativity and audacity of the preparation.  

This is the kind of place to linger over a meal for hours, and to talk about food and wine.  The chef tries to come out and introduce himself to each table and chat about his philosophies, and the servers are all very knowledgeable too, so it really is a feast for mind as much as it is for the senses!  One of the best restaurants in Toronto by far.  The 7-course dinner with wine pairings came to $350 for two people, before tip.  So, it isn't a cheap place to eat, but it is definitely fair value for the wonderful experience you get."}
{"text":"Love it!

Reading some of the reviews.. People complaint that it's too expensive for the amount of food. I personally think that you get what you pay for. The dishes were creative, fresh and delicious. There was a lot of attention put into preparing the food. I Love the idea that they only offer tasting menu. Let the kitchen be creative, sit back and enjoy!

The service was great. Food was amazing. Enough said."}
{"text":"After watching Actinolite transfer from a (don't even know what it was before) to a restaurant during my morning commute, I had always wanted to try it. Having 2 young kids, means I never get out. FINALLY this weekend we had our opportunity. 

I was not disappointed!. The food was delicious! They change their food often, but what we had was very very tasty. I had the mussels, mackerel and pork shoulder, while my wife had the beets, potatoes and mackerel. Our favorite by far was the mackerel. The skin was perfectly crisp, the buttermilk added a nice acidic zest to the whole thing. 

Now my 2 observations.
1) Portion size - I wish they would have served me the whole dam fish it was that tasty. The food was so good, and so tasty, but just not enough!
2) The service  - now let me explain, the service was top notch. The waiter was excellent and knew the dishes and truly helped. However, speaking to him (and i guess the whole aura of the establishment) reminded me of a Portlandia sketch, where they go to a restaurant, and wanted the linage of the chicken, to the point where  they went to the chicken farm, prior to ordering their meal. I wanted to know who caught my mackerel!.  

The pride of how they prepare their food bordered between true love of food to douchiness. I will definitely be back (in about 3 years when we can afford a baby sitter again) and as their menu changes constantly I would love to try other options. But next time, I want to know what my fishes name was. I like to know who I am eating:)"}
{"text":"Actinolite brings to light a question: should one feel awkward asking for a doggie bag at a fancy restaurant? 

The answer is, I didn't have to, because my lovely boyfriend finished both our plates. Thankfully we live right across the street so he could stumble home. Seriously though, the servings are huge, which is a good thing. 

Their seasonal drink menu was nice: I liked the drink with the whisky and cinammon and apple. 

I can't really remember because I got too high off the food, but we had red meat and pork chops and they were awesome. If you are willing to go for a ~$120 meal, it is great food. 

What others say is true about the wait: Even though we had reservations (which we could only get at 9), we had to wait for about 10-15 minutes to be seated. Take someone you want to impress there, like your dad if he's not paying."}
{"text":"Had an amazing night @ Actinolite restaurant with great food and a bottle of vino. 

The shrimp app was succulent and my main - whitefish - simply melted in my mouth. My husband's lamb was also outstanding. Even though meat is not my thing, I tried it and liked it. The food has been prepared with great attention to detail. 

Really excited about the opening as we needed a good restaurant in the hood. I just wish there was one more veg main beside pasta. But the menu is seasonal so I'm sure something is coming. 

Keep up the good work and congratulations!"}
{"text":"Stopped in to check out Actinolite on opening night and I think they've accomplished what they've set out to do. 

Which is (I assume): to provide a neighborhood (seriously lacking quality dining options) go-to spot, with regionally sourced items, a welcoming and intimate atmosphere, with high quality food choices.

The menu is divided up into 5 apps and 5 mains, 3 sides, and a couple of deserts. A larger than you'd expect wine list was also a pleasant surprise.

Since Actinolite is named after the Eastern Ontario town the chef of the restaurant is from, we chose a pinot noir from Prince Edward County to accompany the meat heavy mains selected. 

Favorites of the night were the pork shoulder appetizer, the roasted chicken , and veal t-bone with creamed spinach. 

The plan is for the menu to rotate, so I guess there's not a lot of use going into detail about each dish - but what's important is they were all well balanced, made with the utmost attention to detail, and served professionally. 

The price point may be a little higher than you'd expect but everyone we saw in the restaurant (including ourselves) left very satisfied.

Bonus:  the most hottest of all hottest food celebs was also dining (Lisa Ray from Top Chef Canada)...so like...that bumps this place up a few notches, as well."}
{"text":"I've eaten at Actinolite many times. The food is awesome and the service is excellent. The food is sophisticated (in a good way) and often daring, but always very tasty."}
{"text":"Absolutely Fantastic Meal and Experience. 

My recent trip to Actinolite was hands down one the best dinners I have had in Toronto for a long while. Every course on the tasting menu was phenomenal and complimented each other tremendously. 

If you are looking for a fine dining experience, this should be the top of your list."}
{"text":"I wanted to like this place when it opened in our neighbourhood.  However, it's overpriced and...um...sufficient (sure...tasty too).  The one thing that completely turned me off was the scallops dish.  2 medium sized scallops for $17.  The waitress said they were amazing.  I would hope they were the best goddamn scallops I'd ever eaten served with flaked gold.

They appear to have removed them from their menu, but look at this: http://actinoliterestaurant.com/menu/

Also, really bloody loud.

Pro-tip: bring your own snacks to top up after you've dropped $75 on the smallest portions in the GTA."}
{"text":"Amazing dishes, put together very nicely. Service was top notch, I almost felt like we were friends by the time I finished. It is expense, so go with the intention of spending."}
{"text":"Everything was delicate and expertly cooked. We had some vegetables I never would have even thought of eating, chrysanthemum leaves for example. The mint cucumber martini was excellent.

We had the Chef's Picks, which was a lot of fun. We got 6 courses and for most the chef came out to explain them to us. Some of the items were a bit strange, lots of things cooked in, on, or with hay. 

Dessert was excellent. 

It's definitely worth a try if you're looking to spend some money."}
{"text":"I was excited when I saw construction happening in the neighborhood...and a good restaurant would have been very welcome...unfortunately we got Actinolite.
Probably the best thing about this place is the decor.  The wait staff was very confused and really had no idea what they were serving.  The wine selection was poor.  The worst was the price!!!!  I have no problem dropping cash on a good meal but left there feeling out of pocket with no fulfilment.
Would never return and strongly hope to see something new and actually good take over that lovely space soon."}
{"text":"Actinolite is small, comfortable, and unassuming. I felt at ease dining there with my partner. The atmosphere struck the right balance to make our meal feel like the special event that it was without getting lost in pomp.

Our meal was fantastic! Each dish emphasized the beauty of the local agriculture. We visited in May and almost every dish encorperated fresh flowers. They weren't just a lovely garnish; the buds were an essential component to the plate, often adding a lightness and slight bittering agent. A couple stand out plates were the raw radish starter with charred lily greens and the snow crab in hay butter. One could feel the chef's passion to share Canadian cuisine with his guests. Utilizing local, seasonal, fresh ingredients really put his point across to diners - local isn't just better for the environment, it is a better way to eat."}
{"text":"What a great place.

If you're feeling adventurous, want to learn about new ideas in cooking and localism, then this place is for you. You might not love every dish, but you will love something in every dish.

Great staff, chefs, and really tasty food.

Thanks guys n gals..."}
{"text":"Actinolite was delicious!  There is a really nice feel to the restaurant the minute you walk inside.  I love the idea of old world inspired food... with a personal touch.  We started off with cocktails which were delicious!  There is something for everyone.  The wine list was exceptionally well thought out with delicious selections.  I agree, I was surprised at their offerings despite it being a small restaurant.  Everything on the menu was really good.  Some of my favorites were the pork shoulder appetizer, the country soup was delicious! Such a unique style of soup to get at a restaurant.  All the main courses were so well thought out.  You could taste the attention to detail.  Our table shared everything Including the mains and the sides.  I absolutely crave the blue cheese potato side dish.  The main course fish was phenomenal and that veal steak was perfectly seasoned.  The grapefruit dessert was so refreshing and the olive oil sponge cake was also tasty.  We topped the night off with a couple of  Amaro.  A perfect end to the perfect meal.  I cannot wait to go back!"}
{"text":"AMUSE BOUCHE:
Onion tart type thing with duck confit inside. Took me on a one-way train to flavour-town but I do wish the fried outer layer adhered to what was inside - the whole thing came out during the first bite. There was some sort of sauce under it too... maybe something buttermilk-y, which was underwhelming and unnecessary.

BEET: 
Char-roasted beet halves were accompanied by a plum sorbet. Nasturtium leaves added a little extra somethin'. Very pretty. Not the best dish on the menu, but very good. Almost wished there was something savoury to cut the sweetness, but my dining partner disagreed. 

OYSTER:
The oyster itself was fantastic -smoky and rich and decently sized. The slaw on top which I believe was fermented apple and turnip was nearly flavourless and lacked any sort of crunch. Whomp. 

FOIE GRAS:
Best dish, hands down. Rutabaga was served three ways: chopped into wands dusted in some sort of tasty coating, then thinly sliced, folded around roasted chestnuts, and finally as a foam, which sat as a crowning achievement atop the assemblage. The foie gras portion was appropriate, and surprisingly smoky. 

KOHLRABI:
My dining partner considered that the whitefish roe broth would make a fantastic broth for a matzo-ball soup. 

JERUSALEM ARTICHOKE:
The cheddar sauce was one of the strongest elements we'd had all night. This was a bold, punchy flavour. The artichoke itself was perfectly cooked, and the pine mushrooms were a nice touch. Great dish, overall. 

QUAIL:
Each serving contained about half a quail, including the breast and a leg (claw still attached - a heads-up for those who might be squeamish). Served in an almond-milk sauce with a cozy pile of grains and seeds underneath. The breast may have been cooked sous-vide and was just the right amount of pink in the middle. 

JUNIPER:
I usually don't like anything which tastes like a tree. Exceptions can be made, however, and this dish was definitely the exception. I almost wish it had been served either in a deeper dish, or piled higher, so that the chocolate sheets were easier to access and the flavours more blended. I understand the idea behind deconstruction, but I did find it a little tedious. 

The service could have been a bit more attentive and on top of things. A chef promised more bread which never arrived. Additionally, I think for this type of restaurant and price point, plating could have been a little more differentiated. Not saying a restaurant needs to have custom plates for each dish, or anything, but the creativity in dishware could have been amped up."}
{"text":"Don't know how anyone would have anything bad to say about this place. Small and cozy atmosphere. The food was amazing. Service was amazing. Definitely go for the 7 course with wine pairing- it's worth it. Was a little loud in the dining room but there was a large group in there so I'm sure that isn't always the case. Worth every penny."}
{"text":"It's my new favorite restaurant in town! Service was great and the food was excellent.  Each course was beautifully presented and the wine pairing was absolutely perfect. This menu was great for the summer, my palate was so refreshed after each course. Great job!!!"}
{"text":"I last wrote a review about this restaurant over two years ago. It is still outstanding. It is also still unique and worthwhile going out of your way to visit.
The full tasting menu has gone up from $75 per person to $90 and is still good value. 
Of the seven items, four were excellent - the summer farm gatherings, essentially raw vegetables with different dips were fun, the green peas with Hyssop were the best peas that we have tasted, the heart was nothing to write home about, the pork was outstanding, and the strawberry/ginger/rose desert was superb.
I no longer give it five stars, because the service has deteriorated; now more brusque and indifferent. (The owner, Justin, was not on the premises our evening).
The wine list is a bit of a struggle, but we did manage to find a good Oregon Pinot Noir"}
{"text":"First impressions: well they didn't call us back when we left a message on their answering machine to book a table for 2 on Wednesday night. Not cool, but they're new so maybe things are hectic as hell and they just didn't get to it. 

So we call them back the day of and get a \"yeah that's cool, we should a have a table for you, just walk in, you don't need to make a reso\".. sounds legit? 

So I get there and the hostess has a totally confused look on her face, tells me that they're completely booked and even though we called ahead, we're shit outta luck because some unexpected walk-ins just were just seated. Looking around the restaurant, it was barely half-filledl. Those other tables are reserved for 8pm she tells me without a shred of giving a fuck. I'd be willing to give this a pass if they seemed sincerely apologetic about the mix up and put some effort into finding a way to fit us in, but no, it was stone cold.

Since there is absolutely nothing around the area and I had to kill time before my guest arrived, I sat at the bar nursing a drink while I waited. This is when I noticed a few couples were nearing the end of their meals.

Eventually after some cajoling I convinced them that it made more sense to give us one of the many unoccupied tables now and hold one of the almost finished tables for a reso after they had finished rather than turning their back to new customers.

Okay cool, so we're seated and I'm pretty excited about the meal 'cuz at this point I'm starved and everything coming out of the kitchen looks and smells pretty good.

We start off with the Apple Cider Glazed Pork shoulder and the Kalapese Spring Trout.  Both were pretty mediocre. The shoulder was a little chewy and the while the trout itself was good, the accompanying artichokes, carrots and what not tasted really bland.

For the mains we ordered the Veal T-Bone and the Tagliatelle. Immediately we noticed something off with the pasta. It had an overpowering bitter taste that masked everything else on the plate. It was all we could taste and though we tried to enjoy it, we couldn't and sent it back exchanging it for the Roasted Chicken Breast.

My T-Bone was was cooked at medium, and while I prefer my meat on the rarer side, they didn't ask how I wanted it. Regardless, it was pretty tender so I didn't mind, except that some bites had an incredibly strong burnt flavour. I did my best to mask this with the creamed spinach which was delicious.

Overall it was a very disappointing meal, from the way they handle their customers to the actual food that was served. Maybe we were just unlucky?"}
{"text":"Amazing!

Located in a rather residential neighbourhood, actinolite is quite different from other restaurants on Ossington. It's quiet, sleek, and very community focused. The restaurant is actually the first floor of chefs own house, and the mood they are trying to set for you is like you are invited to dine at chefs house. The chef will prepare the food for you and bring the dishes out to every table and introduce his thoughts, ideas, concepts behind the dishes. The ingredients are all locally farmed or foraged.  I have to say not many restaurants in Toronto are able to do the same, not even Antler, not even Alo. 

Flavour wise - super super yum and refreshing. I came in thinking it's all going to be vegetables but we actually had a quite a few meat dishes too including snow crab, halibut, and beef. The dishes are well thought of and executed, balanced,nutritious, and creative. We were absolutely swept off the feet! One of the highlights we had is the charred spinach with some green dipping sauce. We were not served any utensils as the chef explained this dish was encouraged to be consumed with hand. We tried and I've never had any other spinach that's better than this! It's so delicious. 

We didn't have the wine pairings they offered but the a few drinks we ordered were all amazing. 

Will definitely come back!"}
{"text":"Actinolite is tucked away in a not-so-foot-heavy-traffic spot on a residential corner.  I had read some reviews about it and had been excited to check it out.  So I grabbed my partner in dine and we headed over for a Tuesday evening dinner.

The place was relatively full for a Tuesday.  The vibe reminded me of a rustic, high-end cottage with it's dark green walls and wooden decor.  The restaurant is so-named for the chef's hometown.  So with that said, an overall homey feeling as opposed to a trendy/hip spot to hang out.

As usual, we opted to share several of the dishes.  

I started with the Leather Jacket, a cocktail composed of Calvados, rum, lemon juice and simple syrup.  When I saw the size of the cocktail, I was a little miffed, but when I sipped it I realized that if it were any larger I'd need to call a taxi.  This was served with a slice of apple as garnish.

My partner in dine had a glass of white wine.  I must say that the wine menu is a bit scant (if you're ordering by the glass) and it didn't feature a whole lot of Ontario wines either.

I must say that the kitchen was very nice to bring most of the dishes out in separate plates (e.g. they split them for us) so that we didn't have to cut anything thereby ruining the presentation of the dishes.  

At one point the chef personally came out to speak to us as he saw us snapping photos and took an interest in finding more about where it'd be posted (if at all, this was probably around our 3rd course). 

Housemade bread was brought out for the table and it was delicious.  It was a traditional Italian loaf and a very crusty bread.  The earlier you come, the warmer the bread FYI.  I devoured the entire bread basket by myself (just to give you an idea as to how good the bread was). 

To start we had the Chantarelle Mushroom Soup with truffle oil and parsley.  This was a very flavourful soup and the truffle oil was definitely the dominant flavour.  A great way to start off the meal.

Next came the Winter Pear Salad, with winter greens, pear, and oyster mushrooms.  The salad was beautifully presented and the pear was very crisp.

The third appetizer we opted to share was the Slow Roasted Shrimp + Chicken with smoked pepper sauce.  This was probably my favourite dish as it was extremely flavourful.  

We opted to share the Grilled Ontario Skirt Steak with broccoli + potato leek purée.  I must say the cut was not my favourite as it was a tough cut of beef (relatively).  The potato leek purée however was rich and creamy.

We decided to skip dessert as none of the offerings (Sticky Toffee Pudding, Chocolate Mousse nor Cheese Board) appealed to us.

The damage at the end of the day was about $60 each.  I didn't leave feeling particularly full but my appetite was satiated because the food was prepared well.  

I left with a feeling of indifference.  I dine out not infrequently as a food blogger and the dishes were not technically flawed, nor off in terms of flavour but there was just nothing that particularly wowed me in terms of creativity."}
{"text":"The whole experience was delightful. We had the 7 course menu which is only available by reservation. Yes, it's expensive but worth every penny. I also get the impression it's expensive because there is so much time and energy that goes into these dishes and not just expensive for the sake of seeming fancy. This place is the real deal, with the chef coming to the table to explain some of the dishes. Professional but unpretentious service. Well done. Will return as the menus change with the season."}
{"text":"After reading strong positive review from Globe & Mail which touted it as \"One of the most essential places to eat in Ontario, if not in Canada\" we just can't wait to dine here and had high expectations.

One way to describe the food at Actinolite is 'fringe'. The aim is to please and surprise your palate with nothing like anything you've tasted before. This is delivered primarily through the story of the ingredients / how the dish is cooked and that unique combinations (i.e jelly and flower as first dish). Although the experience is certainly unique, the same cannot be said about the food which falls short for restaurant at this price point. 

One of the starters for instance is a 'Summer gathering' which is basically a plate of raw vegetables from the garden with dipping sauce - other than saying that the vegetable tasted fresh, I'm not sure what else to say, the dipping sauce is nothing to write home about. The last protein, the pork was perfectly cooked (tender and moist) but is particularly very bland and under seasoned.  Dishes after dishes, we kept waiting for the 'ace card' but that dish just never came through. After the fifth or sixth dishes that is served in micro platter (or nano), we simply started to get very restless. 

In the end - Actinolite is a great story teller - the story about fresh tuna from Nova Scotia or the responsibly raised pork or the array of vegetables from their garden or the ingredients they prepared in-house. Those are fascinating stories for sure, but restaurant should be ultimately rated on its food. The execution is nowhere near where it should be at this price point. Those aspects combined with an unforgivably small portion size for each platter definitely leaves your palate a lot to be desired at the end of the nearly 3 hours dining saga at Actinolite."}
{"text":"Amazing cuisine, especially great vegetable 
creativeness.  Very local materials with right choice. Chef's menu,$105 is highly recommendable. I could feel chef owner's passion on all details. Amazing dinner again
Thanks chef"}
{"text":"I can't believe we waiting so long - nearly 5 years.  A must try.  Truly a great Canadian dinning experience. 

The chef's tasting was well composed and generated several talking points.  It stimulated the conversation with \"ooh's\" and \"ahh's\" followed by \"no I now like this dish best\" after every course.  We grew giddy with anticipation.  The menu is seasonal so we look forward to returning in the summer months to see how it's evolved.

The service was fantastic.  A rarity in the city seemingly being content with mediocrity. 

The space itself was relaxed yet elegant.  You felt at home as soon as you sat down.

One last point.  The whole place was spotless!  I literally went looking for dirt and could not find any.  Even the bathroom was spotless.  The only little bit of dust I could find was on the heating vent.  Impressive for a place that's been around for 5 years."}
{"text":"While the restaurant is lovely inside and has extremely friendly and attentive staff, the food is a different story. 

Don't get me wrong, it's reasonably tasty food, but the portions are minuscule. I recognize we had the \"neighbourhood option\" (which is two of the seven possible courses and a glass of wine for $30), but four fiddle heads in a gigantic bowl with a couple tablespoons of oily broth is not an acceptable value for money. The mackerel was also small and unsatisfactory. Asking for bread for the table was an additional amount of money - though the bread was amazing with whey butter. With the bill, they gave us toffee-like sweets that were topped with \"green lichen that was hand picked by the chef himself on a recent hike\". It was disgusting, weird and all kinds of wrong.

At least the wine glass was full - it helped numb my senses and made us all laugh about this place (though the wine had a vague smell of something more acidic). 

Don't waste your money."}
{"text":"Typical Ossington resto. Nothing really stands out but good to try...(I didn't have everything on menu) I love toronto and its cute little spots like this."}
{"text":"Actinolite is not for everyone. It is both unusual and rather expensive. You can opt for a $60 or $90 tasting menu on a stretch of Ossington that is definitely not restaurant row.

Without breaking down every bite, here is what to expect...

1. Local or hyper-local ingredients in season. 
2. Those ingredients may be moss, leaves, or something you or I never saw on the Swiss Chalet menu. And.... it works.
3. Surprise! The food is delicious. It manages to be healthy and tasty. If you are looking for granny's Thanksgiving meal pig out, you won't find it. However, you will leave full. More than that, you will have a meal that is uniquely different from every other place in town. Actinolite is distinctive.
4. I agree with reviewer Jay in that I wish the wine list were more elaborate. I also wish they had a couple of beers on draft. 

All things considered, this is simply a warm, unique experience. Toronto's restaurant scene is much better with Actinolite."}
{"text":"I hate it when restaurants are hyped up, so I'm reluctant to set expectations high, but this meal was the best I've had in a long time.

We head here for date night. I am exhausted and cranky due to the new challenges of parenthood. I try to convince my husband to cancel. Nope! Off we went.

We arrive at the tiny restaurant and are told our reserved table was still occupied (\"you're supposed to HOLD the reservation! Anyone can just take reservations!\" -- Seinfeld reference off the top of my head. Probably not verbatim. Sorry, fellow fans). They ask if we would mind waiting at the bar.. Uh oh.. I look at The Husband. He's not happy. We're horribly picky people with obnoxious personalities who get annoyed easily (uhh see my other reviews). Bad start.

Ohhhhh wait! What's this? Complimentary champers at the bar (or maybe prosecco or a sparkling wine. whatever! Free!). After a short wait we are seated at our table.

Surprise! The Husband wants to order the longer tasting menu.  I reluctantly agree. I order a delicious bourbon sour and the meal gets started. Plate after beautiful plate arrives.

A few plates in we look at each other in confusion. The plates do not match the menu. The server let's us know that these are surprise plates and the tasting menu hasn't even begun. 

 I'm not going to describe the meal because the menu changes often... Besides, I won't be able to do it justice. I'll just say that the smells and tastes evoke memories from my childhood around Ontario. I loved it. I'm pretty sure I could taste the province in every plate. I'm sure I sound a little nutty but that's the best I can describe it.

The icing on the cake was the chef, Justin Cournoyer, coming out with every plate. He also checked in after we were done. I asked him the story behind the name and it turns out it's the small town where he grew up. As someone who also grew up in a small town this tugged at my heart strings. What a lovely place."}
{"text":"Incredible evening ! Wonderful 7 course meal paired with incredible wines. Every course was unusual and delicious. Service was top-notch. Chefs bring dishes and explain them. I can't think of a thing to change."}
{"text":"Continues to be fabulous!! Delicious food and great service.  As good as it gets!!"}
{"text":"In the age of $300 restaurant dinners, it's rare to go out to a place where you actually feel that what you're getting is worth the money. 

This is one of those spots.  

Absurdly fresh farm-to-table cuisine.    Where the 'farm' in question appears to be quite literally the immediate surroundings.   The first few courses of the tasting menu seemed to be straight out of the restaurant's garden.  

They're beautiful.   An incredible array of fresh vegetables and herbs.  Carefully selected, lovingly combined and delicately prepared.    

And it's just the beginning.  What followed was a multicourse meal that was well thought out, well timed in it's delivery and paired with an interesting selection of non-run-of-the-mill hand picked wines.   Would you like some Juracon with that Asparagus?   Yes, please.    

A bunny rabbit that was clearly sacrificed for our own personal pleasure because he was the undoubtedly the most delicious animal in the forest.   

Outstanding service and non-rushed ambiance.   A cool-dad-rock soundtrack that seemed perfectly picked for the great vibe. 

The best part.  It's a small, warm room that makes you feel a part of the neighbourhood and not just a number on a proverbial meal ticket. 

Being a few blocks north of Bloor does wonders for removing the douchey sensibilities that plagues many of the restaurants in this part of town.  

A great find.   Strongly recommended."}
{"text":"Tucked in a residential strip of Ossington (just south of Dupont), Actinolite is not the kind of place you just happen to stumble upon. I had wanted to try it after reading some good reviews (both on Yelp and in print). It makes sense that they take reservations, since it does get busy even on weeknights, and there are really no other options in the area. 

My first impression was that I was gonna like this place. It's not too big so it feels home-y and personable. It's quiet enough to have a real conversation. The decor is quirky (think vintage signs, an old map of the town of Actinolite where the chef is from, blue walls, and an old-fashioned ice box serving as a reservations desk) without trying too hard. 

The menu is small: around 4 appetizers, a few salads, 4 or 5 mains, 2 desserts to choose from. It changed frequently depending on what's in season (the current menu is not the same as what is up on their website). 

I had the albacore tuna appetizer which was served with zucchini and squash slices, artichoke and tiny diced carrots, chives and a small dollop of sour cream. Delcious and refreshing. DC's had the cantaloupe salad and the buttermilk fried chicken, which comes with a huge prawn and salsa -- amazing and not too greasy. 

For the main course, I had the skirt steak (medium-rare as skirt steak should be so that it doesn't get tough) which was full of flavour and accompanied with mushrooms and fingerling potatoes. DC's had the smoked white fish with lentils (very healthy, but maybe a bit bland) and the lamb chops - nicely done and served with lots of carrots and sweet peas. The portion sizes are good -- not too big, not too small. 

I was pretty full though and not sure about dessert... SO glad I got dessert because that was maybe the best part of the meal, surprisingly enough! I am a huge fan of panna cotta. Pretty much if it's on the menu, that's what I'm getting. I've eaten a lot of panna cotta, and Actinolite's lemon thyme version with blueberries is one of the best. Delicate flavours don't overpower and the texture is just right - creamy, yet light. I also tried a bite of my DC's dessert - almond cake with poached peaches and almond cream. Again, out of this world delicious! 

It's a bit pricey, but the quality of the food and service were excellent. A nice place for a special occasion!"}
{"text":"As many reviewers have mentioned, Actinolite is not for everybody, but I decided to take my parents here - so it had to be, at the very least, for my folks. And me, of course. 

We had a total of 11 courses, 2 of which were remarkable. A spinach salad which, with the first bite, exploded with umami, and a grilled perch which incited much joy from Chef Justin Cournoyer (we were the first guests of the evening, and as we finished the dish, Chef Cournoyer excitedly came over to us to ask how the dish was, and told us a story about his own childhood)

Actinolite locally sources many of their ingredients, including the seafood - which is important, because Toronto seafood can disappoint. Seafood is certainly not one of our comparative advantages, for a litany of reasons. 

No, Actinolite is not cheap - and neither is the food traditional. Even so, the food pulls from a variety of influences, a diversity which makes this city so great. 

A real experience, and one of the great Toronto restaurants."}
{"text":"After reading all the rave reviews, I have to say I was disappointed.  The food is unique (chickpea tofu, water with flowers and jelly cubes, locally foraged greens such as burdock and moss, to name a few) but nothing wowed me.  The service was excellent, which almost makes me want to rate this 4 stars but the food just wasn't that spectacular, especially considering the price.  We paid $95 each for the chef's menu.  For that price, I can think of so many other restaurants in Toronto that would have been far better."}
{"text":"It's not cheap, but it's very very good: 

great atmosphere (if you like it quiet go early, but even when it filled up it wasn't too loud), 

great service (lots of it and very friendly), 

and the food, yes, the food, well that was amazing. We had the full menu and wine parings and it was all heaven from start to finish. Great experience.

This kind of thing doesn't come cheap, and nor should it--I'd actually be surprised if you could get the ingredients they used at a low cost, and given the calibre of the staff (kitchen and floor) I wouldn't expect to pay less.

And if you do the full menu you will not be hungry."}
{"text":"Very creative and memorable meal. My beau and I ate here for my birthday and I have no idea where else to book for my next birthday that would top it. The service was excellent, and they really took to heart my very long list of dislikes. Even the bread and butter was exceptional. For Christ's sake, they gave us lichen to eat. Imagine that!"}
{"text":"I have first heard about Actinolite from a foodie friend of mine. We were sharing stories about memorable gastronomical experience, and Actinolite Restaurant came up in our conversation! I had no idea the restaurant was located in my home city, Toronto, and it was certainly a very memorable meal.

My date and I were seated at the window seat, and it was the perfect spot for photos to catch all that natural sunlight. We each ordered the 7-course Chef's Menu (includes snacks, appetizers, entrees, and desserts), and shared a delicious wine pairing from local Ontario vineyards.

It is true about what other Yelpers have mentioned: It is not for everyone. I know some people might not see its true value or are turned off by the raw and cooked plant-based ingredients. But what made this meal memorable for me:

1. The hyper-fresh, foraged ingredients. The colours are so vibrant, it looked almost surreal! I never thought the greens and flowers I see can be edible! #goingvegan lol. The chefs at Actinolite are 'obsessed with freshness and quality that came with picking produce and presenting it on the plate moments later'. Fresh ingredients used were harvested from the restaurant's very own garden, and foraged from the fields around the actual town of Actinolite, Ontario!

2. The creativity and unpredictability of each dish. You don't know what ingredient is going to pair with what, which makes this meal very exciting! The plating is often clean and simple, but I know there is a lot of work and details put into it :) A couple of my favourites were the Halibut with watercrest, mint and kelp, also, the Enoki mushrooms with hemp seed and onion cress! Ooo and the cured salmon... that was fantastic!

I would highly recommend this for adventurous, open-minded foodies. Every dish speaks character. It is definitely worth a try :)
.
.
.

The All-Ontario, Road Trip-Worthy, farm-to-table Restaurant Series (6 of 17)"}
{"text":"Have you ever heard of Actinolite on Ossington in the undeveloped strip south of DuPont. Ellen and I thought it was one of the best tasting menus and best meals we've ever had in TO. @chrisnutsmith was 100% on target in his Globe review: http://tinyurl.com/pv5zwkb. Lamb sweetbreads, a first for me, were a revelation. Foraged ingredients and a measured confident pace. Chef Justin Cournoyer has perfect pitch: unusual combinations that work--pictured here is fresher than fresh asparagus wrapped in seaweed with egg foam. Excellent progression and not overly large portions, also a veal carpaccio, and two fish courses, with an ending halibut that left the palate clean and pure, ready for the rhubarb and vanilla ice cream dessert. Able and friendly server Teddy and unusual wine maven Marin rounded out this excellent experience. There were wines I'd never seen--orange instead of rosé--and it just added greatly to the experience. We just loved it,"}
{"text":"I love Actinolite.

This restaurant is an experience. If restaurants are to be likened to forms of media, a typical restaurant is a trip to the movie theatre, and Actinolite is to experience fine art in a lovely gallery. The latter may not be everyone's cup of tea, especially if \"portion size\" and \"getting super full\" are among your priorities for going to a restaurant. (And if you do, there's nothing wrong with that!) But for those who are looking for an experience; something to challenge their perception of what food is, and what it can be, Actinolite is worth a visit (or five).

Actinolite's focus on fresh, local, and high quality ingredients means many of their flavours are evocative of nostalgia and intense Canadiana. I've had many dishes here that have evoked strong memories of my childhood, reminding me of aromas and flavours I haven't experienced in decades. This probably makes me sound crazy, but I've had meals here that have brought me to tears.

They are absolutely fantastic with dietary restrictions. I have celiac disease and always do a perfect job of adapting dishes for gluten-free diets and avoiding cross-contamination.

The courses are beautiful, the wine is perfectly selected, and if you're looking to have a cozy drink or two, their cocktails are surprisingly unique and among the best in the city.

Service is warm and personable on a level I personally didn't expect for a place with such refined, artful food.

This is not an inexpensive place to eat, but the experience is worth every penny if you can afford it. I've been several times and plan on returning as much as I can.

Actinolite is a special place, and our city is lucky to have it."}
{"text":"This is the restaurant where natural food flavours come to life. The passion for food that grows locally and organically is shared among all the staff and spread to the patrons. It's the first restaurant in years that truly gave us a unique taste sensation. 

You need to be into real food to enjoy this place. One of my favourite dishes was a raw turnip where the taste was enhanced by a little pear vinegar and salt."}
{"text":"Came here with my parents, boyfriend and brother on Saturday - lots of wine, lots of laughs. Hats off to the impeccably cheerful service and the good vibes. 

This isn't a great place to go with a tight budget and an empty stomach, but it's interesting and elegant plates throughout. The apps were all fresh and wonderful ingredients - little radishes, a gently smoked ham on sugar snap peas, a light herb soup - all a bit precious, but I get the fresh local ingredient worship and they really are good.
We had the Domaine de Lanes white which is fairly dry, mineral and clean - a perfect balance with almost everything. A borgogne was the other choice I believe - went well with my boyfriend's steak (which was small but extremely good) nice and earthy but stands up well. I had the smoked mackerel which was simple, not too smoked and warm(!) then the mushrooms, which were a huge highlight for me. Chanterelles are the steak of the mushroom world for those who question getting mushrooms as a whole course. I loved it it deeply. A blend of regional mushers in a light butter sauce with sea buckthorn thrown into the flavouring. Hot damn, fungi deluxe! 

The dessert, \"a deconstructed cheesecake\" was ricotta and..I forget. To be honest we were all drunk and full at that point, but I remember finding it a bit salty, which was weird. So I guess I don't recommend it, but taste is taste.

Ultimately, this is a perfect place to take visitors - a true blue modern Toronto resto doing it right. Makes me love my neighbourhood just a little bit more, too."}
{"text":"????????????????????????????????2??????????????
???????????????????
??????????"}
{"text":"I was here for their 7-course dinner with wine pairing and the experience was sublime.

Anyone who is familiar with the legendary Noma restaurant would truly appreciate the inventive and progressive cuisine served here. The ingredients are local, seasonal, foraged and sometimes unexpected. Some of the highlights include Raindeer Moss, and mussels in a broth which was both savory and refreshing (highlighted with juniper oil). The presentation is artful but not overdone. I wouldn't go into detail about each dish as their menu changes often and frankly they were all so good and I can't seem to remember all the details of everything I ate.

The restaurant itself felt very comfortable, modern, casual and unpretentious. The art and artifacts on the wall describes the small town of Actinolite which the chef is from and has a farm there.

The service was very attentive and I highly recommend the wine pairing which featured some unusual varieties and lesser known wineries.
If you want to go somewhere on a special occasion or just want to treat yourself, this is the restaurant I would highly recommend.
I don't think the food was very expensive given that you can't find dishes like this anywhere else in the city, the food was very fresh and beautifully prepared and presented, and the service was excellent without being stuffy.
Going with the 7-course with wine pairing is the way to go for a magical culinary experience -- it's well worth it!
Definitely on my list of favorite restaurants."}
{"text":"Some weeks ago a restaurant search around Ossington and Dupont would have yielded scant and disappointing results. No longer. Helmed by a Food Network producer and a chef that worked under Susur Lee, Actinolite adds much needed culinary cred to this neighbourhood. 

Named after a town on the Skootamatta River in the Municipality of Tweed (can't make this stuff up); Actinolite (pronounced: act-IN-oh-light) is apparently the chef's hometown. It's also a mineral similar to asbestos. Now you know. 

The small restaurant is well decorated. Lots of natural wood and Canadiana (Ontariana?) on the walls. Our group of four sat crowned beneath a swelling fixture which is why it probably felt a little bright in here for me. That said, it's a swell spot for an intimate dinner or date. It didn't feel too crowded in here, even though every table was occupied. I like that. Service was friendly and down-to-earth.

The menu is a single card divided into first and second courses. There were a lot of tantalizing options, but I HAD to start with the pork shoulder appetizer glazed in apple cider, and chose a marinated veal T-bone served on creamed spinach puree as my main. Except for my failure to get the table to call me T-bone, the whole meal was a delight. Everyone else at the table seemed happy too.

A bit too expensive for me to become a regular, but this place is a must-visit next time I'm in the hood.

Obligatory Title Pun: It'll AMPHIBOLE you over.[1]

Menu Readability: I don't normally abide script typefaces, but this was acceptable.

Need to mention: Solid wine list features selections from Prince Edward County.

What this place teaches me about myself: I'm not likely to be called T-bone anytime soon. Perhaps V-bone?




_____
[1] Geology humour. I could also have said, \"This place ROCKS!\""}
{"text":"Quaint and cozy feel - that's the only good thing I can say. We did the 7 course chef's menu (so can't blame this on poor selections) and with the exception of dessert, everything was bland and lacked flavour. Way too many similarities in several of the courses. The idea of using local ingredients is great, but one would expect some flavour! We dropped close to $300 and left totally dissatisfied and even worse, hungry."}
{"text":"Lovely decor and great service. We got the 7 course menu and appreciated the care put into making the food and also the presentation. The chef also came out most of the time to give us a detail breakdown of each dish. In those aspects it was a great dining experience.

However, despite the creative dishes, the flavour of each dish was too muted for my palette. But I'm used to Thai and other Asian food and I think this restaurant is more about very few ingredients per dish and letting the flavour of the ingredients shine but they didn't shine enough. The menu changes though so perhaps a different combo would be different. However personally I won't go back because of the flavour of the dishes (they're not bad, just too muted and not good enough for me to pay this amount again). also if you want to substitute any dish (from the 4 course menu) it's $10 extra!"}
{"text":"Dined here with a group of friends and didn't receive the friendliest of service. I don't think they knew how to service a large group. The waitress kept bumping into my friend during service. She did not ask us whether the bill would all be on one or separated according to guests.

Seeming annoyed, after separating the bill, she messed up one of the guest's bills, and was very rude about it. Also, she did not give a couple of my guests their change... Gratuity is already 20%. When one of our guests asked for change, the waitress asked how much change she wanted back... and forgot how much our friend had given her.

Too bad about the service because the food overall was half okay! Dishes are changed frequently, which is nice variation. Portion size is very small so if you have a large appetite, you'll still be hungry after. One of my friends didn't like her dish and voiced it. The waitress tried her best to remedy the situation, which was much appreciated. Good job on that one!

Nonetheless, I wouldn't recommend this restaurant to anyone just because of how they treated all my guests. It left a sour note in my mouth. I feel this is not a good restaurant to bring people to because I fear they would also be treated badly.

I had high hopes for this place, and felt they were too stuck up to receive the average joe. Go somewhere else if you want to be treated with respect."}
