{"text":"Good food but way overpriced for the amount of what you get. Small portions, my hubby was still hungry when we left."}
{"text":"If I could give a zero I would ten times. I drove from McDowell and dysert all the way over here because my 3 year old son wanted shrimp. Services started great, we got our drinks right away and then we just sat there waiting for our order to get taken.  The owner never came back to take our order. Saw three workers on the back and we were the only table. No one from the back acknowledged us or said sorry for the wait.  We had to go.  Bad service and communication with staff."}
{"text":"AMAZING eat at least 1 a week. fresh and awesome.  my tastebuds are dancing.
The fish is so tasty and so clean tasting. No old oil ever used....staff are all fantastic"}
{"text":"Stopped here for lunch for the first time today. Our server was so welcoming and friendly. She walked us through the menu and was so efficient and sweet. We ordered the fried haddock and fried shrimp entrees. Both came out fresh and hot! The portions were good for the price, everything was tasty. I know where to go when I have another craving for fried shrimp. I like to support mom & pop places especially when you can tell they are passionate about what they serve. Give them a try! You won't be disappointed!"}
{"text":"This place is very good. Great scallops, clams. Very friendly and a nice portion of food. To bad not open on Sundays"}
{"text":"My husband and I have been eating at Ada's Fish Fry with relative regularity (once or twice a week on average) for three years now and we have been impressed with every single meal and visit to this remarkable seafood restaurant.  The food is always perfectly prepared, our special requests have always been met with warm welcome, and the owner and staff provide exemplary customer service in addition to friendly conversation when customer demand allows for it.  We absolutely love this place and look forward to each and every visit.  For those of you old enough to remember the series, my husband and I affectionately refer to Ada's Fish Fry as \"Our Cheers\".  This place is great for a meal on the fly and even better for a leisurely yet engaging \"date night\"!

Becky & Arthur"}
{"text":"Everything was great.  In town to see spring training.  Will return at some in future"}
{"text":"Really good scallops, good fried fish, and AMAZING French fries. I loved the food and the service was great; but, just too pricey for me. We will go back because it is fresh fish... Just not as often as we would like because of the cost."}
{"text":"I visited Ada's for lunch today. I opted for the fried fish and shrimp platter with fries and Cole slaw. First off the fries were either fresh cut or the best frozen fries I've ever had. The fish was beer battered Haddock. It was tender, delicate and flaky. The batter is light and crispy. The shrimp were wild caught 16/20s fried in the same batter as the fish. The shrimp was among the best fried shrimp I've had in the valley. I'm a bit of a fried shrimp aficionado because I grew up on the Texas Louisiana border where shrimp is a  staple. The platter was served with cocktail sauce, tar tar sauce, ketchup, malt vinegar, and hot sauce. Everything one needs for an enjoyable complete fried seafood lunch. I look forward to returning and trying other menu items such as the lobster role and clam chowder."}
{"text":"Absolutely fantastic. It really is like they \"beamed\" a top-notch Boston fish fry straight to Litchfield Park. This is 100% legit THE BEST FISH you'll find for hundreds of miles."}
{"text":"While staying at the Wigwam Resort in Litchfield Park, AZ, I was looking online to find a local restaurant when I came upon Ada's Fish Fry.  The reviews looked pretty good and decided to give them a shot.  I was NOT disappointed.  Traveling from the Seattle area I have had many opportunities to eat at various fish restaurants in the Pacific Northwest including Ivar's, Steamers and others.  I ordered the Fish and Shrimp combo basket with Onion Rings.   The shrimp was outstanding...three jumbo shrimp dipped in their light and tasty batter.   The fish was also fried just right and the onion rings were fantastic.  I left full and satisfied and would highly recommend Ada's for anyone looking for a fresh fish fry.  One note is that it's a little tricky to find, especially for an out of towner. It's in a little plaza in the back corner.  The restaurant faces the corner of Wigwam and Indian School Rd but entrance is inside the plaza.  ENJOY!!!"}
{"text":"So nice to finally find a good fish fry in the Phoenix area. Fresh haddock tasted great and the homemade french fries  were so tasty (not the typical...not frozen food!). Loved the coleslaw which was a vinegar/mayo based kind with celery seeds...just like Grandmas :) We will be back soon to try the scallops!!!"}
{"text":"Stumbled into Ada's today when my car broke down in the parking lot.  Wonderful, welcoming  owners and staff.  I live 45 miles away, but I wish I had these friendly folks in my neighborhood.  Now that I see all the great reviews, I'm going to tell all my west-side friends to head over to Ada's."}
{"text":"My family and I went to Ada's last night.  The fish, shrimp, scallops and clams were all super fresh and super crispy! Ada's knows how to deliver simple yet  exceptional seafood. The fries and onion rings were also crunchy and delicious."}
{"text":"Eaten there three times, first time okay although nothing special, second and third time food disagreed with my stomach so planning on never returning."}
{"text":"10/10 would eat again. Awesome fish. Awesome service.

The fish is phenomenal. The batter used really seals the deal. Tasty, flaky, and crunchy. The shrimp is HUGE and is definitely worth trying. 

Give this place a go!"}
{"text":"Ate at Ada's for the first time tonight.  Great food and a very friendly staff.  We had the fish and chips, the shrimp and the onion rings.  It was all great.  The fish was light and flaky and the batter was just right.  The onion rings were fantastic.  The shrimp was great also.  While all of the seafood tasted very fresh, I think the batter made it really very good.

I brought my father here for his birthday.  He is a picky old buzzard, and he loved it.

We'll be back for sure."}
{"text":"Adas was my favorite fish restaurant but now its my favorite Rib place. Fish is as good as ever but the BBQ Ribs are great. Flavorful, Meaty and the portion size is great. Only problem I have is that I now have to eat here twice a week. Staff is always friendly and fast. Try it you'll love it."}
{"text":"Finally talked my wife into trying a \"fried\" fish restaurant (that also happens to be the closest restaurant to our home... We do miss Dino's having moved a few miles from us).  We have spent much of our short but happy lives on both the West and East Coasts and 4 years in the Caribbean as well as a few trips to Hawaii and I am happy to report that right here in Goodyear we have fried seafood as good as/better than anything we have previously enjoyed.  Ada's scallops literally melt in your mouth.  Their fish and clams are fresh and nothing is greasy; everything we had is nothing less than excellent.  Fries and onion rings are much too good.  The folks working at Ada's are most amiable, informative and helpful.  My cardiologist may not be thrilled but we are adding Ada's to our frequent, Goodyear and surrounding area, restaurant list."}
{"text":"Friendly staff and excellent food.  We especially loved the scallops.  Can't wait to go back again."}
{"text":"Ok...i hate to write a second review on a place that I thought was good the first time around. Today was not so pleasant. Granted we came in late(8:20pm) when they close at 9pm...talk about being rushed out the door...no bueno! Imagine eating and smelling  cleaning material from an employee mopping the floor.....and \"do you need anything else questions\" ... Just not pleasant"}
{"text":"Finally decided to give this place a try. We are from New England and were esp. excited to try the clam strips. We ordered the Cabin Boy so we could try a little of three things. Unlike another reviewer, it was enough food for the two of us. The clams were good, as were the scallops. The haddock was a very skinny piece and fried to within an inch if its life. Not very good-
The cole slaw was eh-
It was disappointing that EVERYTHING is fried. It would have been nice to have at least one offering that was broiled or baked. The place was almost empty on a Saturday night at dinner time. Hmmm - not sure we'll go back. New England it isn't."}
{"text":"Stopped in today at the height of the lunch hour (12:20pm).  Only two customers were seated and eating lunch.  No staff visable anywhere.  Waited more than 5 minutes for someone to show up at the counter to take my order before giving up and leaving."}
{"text":"Amazing!!  We ordered the Fish and chips and it was amaaazing!  They use high quality fish, cut it, bread it and fry it to perfection!

We've been looking for a fish n'chips, and wow, did we find it.

Great service too!"}
{"text":"I love this place so much! Being from Upstate New York like the owner I felt at home! Ordinarily I have to wait till I go to New York to get good claims! But they sure provided! They also have Hoffman hot dogs which can only be gotten on the east coast! I will absolutely be back!"}
{"text":"This place is off the hook!!! Great food and friendly customer service. Took my family from California here and they enjoyed it."}
{"text":"What an absolute gem! Fresh fresh fresh!!! My fiancé is having me write this review because he's savoring the last of the deliciousness! We are thrilled to have discovered the coral reef of Goodyear; the proverbial pearl! This weekend, we are toes in the sand, enjoying every morsel of this getaway!!"}
{"text":"I really hope Ada's does well but one does have to wonder as they're tucked back in a corner of a newer shopping center. Right down the street from Centennial High School so I'd think they'd get some lunch business from teachers and such to sustain them until the general public finds out about them. The sad part is once they are \"found\" I'm afraid it may be a challenge to get a table.

The first thing after walking in and being acknowledged we were asked if we'd like to sample the Seafood Chowder... I highly suggest you say YES! Very tasty, but I was there on a mission for fish & chips so I'll do the chowder another day.

Staff was very nice and helpful and since we were there between lunch and dinner hours the chef/owner-partner came out and chatted with us. 

He was telling us about how when we came in he was right in the middle of breaking down (filleting) the fresh fish that was delivered and explained what fresh seafood they order in.

I can't say enough about the seafood. Being born and raised in the SF bay area and working/playing in San Francisco and Half Moon Bay I've had some really great seafood. The food here rivals what I was used to eating at Hazels Seafood in Half Moon Bay, right off the boat!

Fish fillet was thinly coated then flash fried crisp, inside was flakey and perfectly done and served with two types of tartar sauce. My wife and I both preferred the spicy one. 
I highly suggest the Onion Rings instead of the fries or do a combo as they're  very,very good!
Pricing was fair considering the portion size and that it's FRESH fish. We ended up taking most of the fries/rings home as we couldn't stop eating the fish and it filled us up. 
Yes, it's that good!"}
{"text":"Excellent food excellent service good people. A little hard to find the first time but so worth looking for.  Already planning our nect visit.....bringing people with us.  Be sure to introduce yourself to the cook, he's a goid guy.  Onion rings are so good.  Yum yum."}
{"text":"I'm from massachustts and hands down this is the best seafood in Arizona. We are so impressed and will be back many times. Thank you so much :) keep up the amazing work!"}
{"text":"Looking for good SeaFood in the Goodyear area,
Very casual atmosphere, outstanding taste,
Ada's Fish Fry is where You want to go."}
{"text":"First I have to give up to our server, Robin. Absolute sweetheart and really knows the food. Service was fantastic and her bright personality was a highlight.

But good service ain't nothing if the food sucks! Am I right? 

Well the food does not suck. One of our dinner companions identified it as southern style that was like his Dad used to make. The fish was tasty and I like their sauces. The coleslaw was tangy.

So what you get is an unpretentious dining experience with great people serving good food at a fair price. 

We will be back."}
{"text":"My wife and I went couple days ago for dinner. The cook was very polite and helpful.  We had a couples meal which include 6shrimp 1fish 6 scallops f/f and slaw which we shared and was plenty of food. Everything was fried of course (except the slaw) and was very greasy. We ate off paper plates and even our drinks were paper. I love fried food but not greasy. Our meal was thirty something dollars for a place that reminded me of long John silvers.  Sorry but two thumbs down for me folks."}
{"text":"Very friendly staff. Fresh cut French fries were very good. Fish was fresh and tasted great. Highly recommend!"}
{"text":"We have come here several times and enjoyed each experience.  Tonight we came in 5 minutes before closing and the service was amazing.  They greeted us warmly and provided a relaxing atmosphere.  We enjoyed the evening. Thanks for a great night!"}
{"text":"Great food! Fish is so fresh and the hand battered coating is one of the best I have experienced. Fries cut fresh and slaw is awesome. When they have Beer than I'll give them a 5 star. Service is friendly and that's another reason we will be a regular."}
{"text":"The fish was hot crispy the fries were the bomb oh ig you like onion rings make sure you get some onion rings not a fan of the coleslaw but everything else was delicious"}
{"text":"Finally a great seafood experience without a flight to the coast!!!  They're flying the fish to us and what a difference from the typical Phoenix seafood experience.   The fish, scallops and fried clams all were all just amazing.   They have a very simple menu and I hope they keep it that way.  They even make their fries and onion rings from scratch! 

   Dinners are reasonably priced and they do have a lunch special that's a bargain for awesome seafood.  It's a smaller open environment casual restaurant that skips the frills and just does seafood right for those of us that have the experience of real seafood on the coast.

   You'll need a place to nap after an entree and yell at the cook to give you some fries for a laugh after you've placed your order!!!  He may yell back but it's worth it :)"}
{"text":"Finally a REAL fish/seafood place in Arizona!  Those of us from the Northeast know good seafood and Ada's has brought it here - fresh.  If you've never had clam strips, try these.  They are among the best I've ever had (and that's really saying something).  Tender, delicious.  My mother-in-law loved the fish and chips and we both thought the breading they use is outstanding.  Definitely a winner.  It is tucked away, so you may have to search for it, but do it."}
{"text":"Delicious fish and chips. The breading could use a bit more flavor, and the absence of tartar sauce was noticed (by me at least); but everything else was fantastic. They fly their fish out from Boston bi-weekly, so it is very fresh. Then they fry it to flaky perfection and serve it right up with some amazing french fries. Definitely ask for some fresh lemons, but other than that, get the fish!"}
{"text":"I give Ada's five stars because it's the best Eastern Seaboard style fried fish in the West Valley. It's especially good on Tuesday's and Friday's when the fish is super fresh.  It's a simple place,  but that's It's with me."}
{"text":"Thought the fries were stale & the fried fish didn't have any flavor. Had clam chowder & while the clams weren't gritty, it also lacked flavor, & wasn't thick like normal chowder (at least the kind I like). Also, way too expensive & no lunch prices.The server was great though!"}
{"text":"This is a fine and satisfactory place to enjoy a fabulous fish meal. Always a pleasure to eat here."}
{"text":"Had both the fish and chicken strips and it was perfect! Perfect golden brown, they have a nice outside patio and everyone is very friendly."}
{"text":"Straight off, I gave this restaurant three stars, because \"four\" is \"I'm a fan\" and I'm not.  Now having said that, it's not because there's anything wrong with the place.  On the contrary:  it's been open for about a year in a rather isolated locale and within this isolated locale (a strip mall), it's almost hidden on the side.  In other words, people who come in here to eat didn't discover the place by accident; it's well hidden.  When we came in to eat tonight, you could tell that the restaurant has its devoted fans ... and they come in groups.  Is what is written in other reviews accurate?  Pretty much.  If you're a fan of fried foods (and of fish fry in particular), this place will be everything you want it to be.  It's obvious the fish is fresh and not frozen:  after frying them, it's tender and tasty.  

So what's my problem?  

Simple:  I'm just not used to eating fried foods anymore and so this food sat on me and sat hard.  Also, I rarely use salt and frying very frequently brings out the saltiness in food.  But these are MY problems; I'm not going to be idiotic enough to complain, like someone on here did, that the food is greasy.  What were you expecting from a place that has the word \"fry\" in its name?  But I can't honestly claim to be a fan or, for that matter, to give this place the review it probably deserves because of my eating habits.  It's sort of like giving a very expensive French wine to someone who likes wine, but is no connoisseur:  sure, the wine will taste wonderful, but, most likely, so will the $14.95 Cold Duck champagne. 

Portions here match the prices and the service is friendly; the owners even come around to make sure you're doing fine and enjoying the food.  I did like the cole slaw a lot.  

So, in conclusion, if an out-of-the-way restaurant can manage to earn so many fans, there must be a reason.  Restaurants that have opened in this location before have not done well and it's mainly been because of being buried in the back of the mall.  This isn't fine dining; it's not meant to be.  You will, however, be full afterwards and the food was tasty and I can readily say that, even if I'm not a fan of fried foods (though I would say, I like my onion rings thick and heavily breaded; theirs is thin cut and lightly coated).

So, to sum up:

Good and friendly service;
Attentive concern from management;
Reasonably priced;
Fresh and tender fish, criminally covered with deep-fried breading
Yabba dabba doo cole slaw

This place may not be for me, but if you get excited over Black Bear Diner's all you can eat fish fry on Friday's, do yourself a favor and spend a few more bucks and have real fish.  Just don't ask me back until you start baking :-)"}
{"text":"Came here today for some fried fish and there were a couple of people in front of me waiting.  The waitress totally ignored me even though I was next in line to put my name down.  She went straight to the woman behind me and then walked away.  Really?  I wanted to support local businesses but Ada prob didn't need it."}
{"text":"This place was recommended to me by a friend who had been there.  I made my second trip there last night for pick up and have to say, i was very dissappointed.  

The food is excellent!  So far I've had one dine in  and one to go experience at this restaurant.  So I've had the fish, scallops, clams, fries, and onion rings.  All are great, except the fries which are average.

My issue is with the customer service, or lack thereof.  I figured they might be busy, so i called them beforehand and placed a to go order for pickup.  The girl on the phone asked how long before we'd be there and I said \"10-15 minutes.\"  her reply was, \"That's good as we are busy.\"  We get there later, and a fair mount of people are seated, but no one is in line to order.  I tell the girl (that answered the phone/running the register) that we have a to go order and give her my name.  Her response is \"Oh, sorry, but we lost your ticket and it's been busy, so it'll be another 15 minutes before your order is ready.\"  Essentially telling me that \"you're not as important of a customer since you planned ahead, called in, and expected to pick your food up to go.  The people that were standing in line when you ordered are more of a priority for us to serve before you.\"  

At that point, we were hungry, and didn't want to have to go elsewhere to get food, so we decided to wait.  She, nor the owner who was (I think) behind the counter cooking had the thought or courtesy to offer something like \"would you like  a free drink while you are waiting due to the delay, or let me take a $1 off your meals due to the additional wait time\" to help correct the shortcoming.  I don't even think they realized they screwed up.  IMHO, the right thing to do would have been to offer some sort of spiff to help make up for them losing my ticket, since it was their fault.  I'm not asking for a free meal or anything, but i do think them not recognizing that they screwed up and should attempt to make up for it was a HUGE customer service mistake.

And to top the whole experience off, the girl that answered the phone and ran the register berated the shit out of me from the time we walked in the door until the time I finally got my credit card back from her!  She was an absolute smart-ass the whole time we had to deal with her!  I can appreciate a friendly banter with customers giving them \"a bit\" of a hard time about something, but this girl was boom, boom, boom non stop smart-ass comments out of her mouth.  Totally oblivious to the fact they \"lost my ticket\" so I got bumped to the back of the line as a result.  She either needs a new job in the place, or needs to learn how to be friendly without being a smart-ass!

Again, i like the food here, but in all honesty, I may not come back based on the crappy customer service experience of last night!  If their service continues to be somewhat slow, and they treat customers the way I was treated, then I doubt if they are open for long as there are enough other choices in the area to not spend your $$ here."}
{"text":"Finally, a place that serves good quality seafood in West Valley! I thought it'd never existed until we went to Ada's. Their fried fish just melts in your mouth and I'm a huge fan of their homemade coleslaw. Their breading is light, crunchy and nicely seasoned. Ada's is bringing the typical fish and chips to another level. Now they just need to get some beers in there and they're all set. I didn't give them the full 5-star because our fries were a little soggy. No biggie! We can tell they care and have huge passion for their food and service. Keep that up and the place could survive in the volatile West Valley restaurant industry. We'll be back!"}
{"text":"Fresh, prepared on site.  Yummy.  Not the same 'ole, same 'ole frozen fish & chips."}
{"text":"First visit, but not my last vist. This place is simply the best fry house I have had the pleasure of imbibing in for a long time.  The food is FRESH. As fresh as it comes in AZ. They pride themselves on quality. It ain't bragging, if it is fact!  I had the jumbo shrimps.  They were hand breaded in house.  Any one else out there that hand breads their shrimp? Even the big name fish houses usually bring them in breaded. Let's focus on the breading; taaaa.sty! Very tasty.  Made-to-order onion rings (with the same beautiful breading) are a nice touch. If you are looking for the best deep fried seafood and fish, give them a try. (Have some scallops - you won't be disappointed.)"}
{"text":"Adas fish fry is a good seafood place for AZ. Wish they served Pacific Silver, Red or King Salmon though. I wouldn't mind paying more for real Alaskan salmon!"}
{"text":"Great fish got the regular was super hot and crispy got the 50/50 fries/onion rings.  The rings were great but the fries were subpar. The wife got the grilled shrimp salad was very good . On a side note the coleslaw was a bit to tart for me."}
{"text":"Gave it one star because the server was very friendly. The fish, haddock was like eating greasy mush. I ordered shrimp and scallops. The shrimp were good and I thought the scallops were going to be great as they were very tender. But after a couple of chews realized they were so salty, thought they must have been cooked in brine. Didn't care for the Cole slaw  but there are many different variations so that really isn't a big deal. Spent Just over $36 for food that wasn't edible and got to eat it with a plastic fork!"}
{"text":"Oh my food. This place is good. The fish is amazing, prices are on point, and is worth your money. I've been craving fish since I moved to AZ from the east coast. So finding this place is great. Yes they have their fish flown in twice weekly and it's GREAT. 4 stars because of the decor of the establishment. They really need to do an upgrade on it. Doesn't need to be fancy just the worn out booths were very uncomfortable. Some upgrades plus the food would make it 5 stars!"}
{"text":"WOW!! That was delicious!! Everyone super nice and food was Great too! We ordered the fish and chips dinner, one with shrimp, very very good. we'll be back for more."}
{"text":"Visited for second time whilst in the area again and we were very pleased to find out that Ada's Fish Fry is consistent - it's still great!   :D
 
On another note, in case there are local business owners looking for a creative way to advertise, a postcard at the table said that Ada's is going to be getting new, custom tables.  They're looking for advertisers to display on their new laminated tables (featured for 2 years, it says).  Call Ada's, if interested.  *I'm not associated with Ada's at all....just passing along an opportunity.

Cheers!  :D"}
{"text":"First of all I'd like to send a shout out to Gabe......Don't go changing. This place is the epitomy of good mom and pop restaurants, even though this is Arizona the seafood taste fresh. This is just what Goodyear needs, and the food is not the best part..... the customer service is even better...... Try the dinner special, you won't regret it."}
{"text":"Friday night Fish-Fry and make no mistake, Ada's knows a thing or two about frying up some fish.  This was the first of what I expect to be many visits to this west valley, Goodyear to be exact, restaurant. Located just passed Bullard on Indian School road and directly across rom Millennium HS I can feel safe saying the hottest animal in the area is definitely not a tiger but rather, a fish.  Save your time and invest your money wisely on Friday nights, steer right and step into Ada's, skip the Football game at Millennium.  Unlike those purple tigers, the cornmeal battered, golden fried fish won't disappoint you."}
{"text":"I am from WI, and I have to say I am very impressed with the quality of Ada's fish fry. Fresh haddock done right!  I generally don't like fried fish because it is alway's oily.  Ada's fish n' chips are done well, and done right.  Who knew I'ld have to come to AZ to get a really good fish fry!  Kudos to our waitress, Sky.  She is a great server... give that lady a raise!"}
{"text":"I'm super pregnant and was in the mood for fish and chips.  This place came highly recommend so we stopped by.... I'm telling you THE BEST FISH AND CHIPS in Arizona. So freaking good. I can not wait to go back ... you will not be disappointed"}
{"text":"We've been into Ada's twice already. When we walked in the first time I was a little hesitant because it's dark and it doesn't look like anything spectacular. There was maybe one other customer in the  restuarant. And there was an older couple hanging around they probably were the owners I think.

Before I tell you that what I thought of the food let me preface this by saying I've lived in Arizona most of my life and I've gotten most of my fish and chips from Pete's. So that has been my standard for for a while. Pete's quality jn food has dropped drastically in the last couple years so I've been looking for a new fish and chips place.

We saw all the good reviews on Yelp for Ada's and thought what the heck. So we went in and tried Ada's. I ordered the fried clams and shrimp with chips my wife and son both got the shrimp and fish with chips. My shrimp was  great the shrimp were big and the batter was awesome the clams were very good as well. But I must say the star of the show was the fish it is absolutely incredible. It is probably the best fried fish I've ever had.

I always like to try a restaurant twice because you never know it might have been a bad day or might have been an exceptional day. So the second time you usually get a better idea of the place when we went back the second time it was still amazing.

The only negative thing I have to say is the way the drinks are served. I do not like those little tiny Dixie Cups they give you that you finish in about 30 seconds. Other than that this restaurant is outstanding"}
{"text":"3 1/2. Odd location for a restaurant but I found it and sat at the bar. Pretty sure I was served by the owner himself as he works behind the bar. Honestly? Food was ok. Got the fried fish and fried shrimp and half/half the onion rings and fries. Thought that was cool that you could split the fries and rings. Tartar sauce made there. Cocktail sauce, made there. Was given a small sample of the clam chowder and actually really liked it. Should have ordered a bowl of that instead. 

So in all honesty I didn't think the food was amazing. But what I did think was amazing was the hospitality. The owner is so nice and welcoming. Somewhat of an assuming man  but just so honest that I really liked him a lot. If it wasn't for that, a place like this would bat a 3 rating for me tbh. But with hospitality like that, I really do hope the best for them. Also got a military discount!"}
{"text":"Decided to give this place a shot. The food is okay, very very greasy and lacking flavor. However the clam chowder was ok. Our waitress was not very attentive nor friendly and even though our drinks were empty, didn't keep up with refills. Probably won't come back."}
{"text":"By far, the best fish fry in Arizona! I grew up in Boston, and I'm very particular about the quality of the fish I eat. The fish is always fresh, and the batter is crispy and delicious. I highly recommend this restaurant."}
{"text":"Our family loved it both times we came. The regular fish plates are great, so is the shrimp cocktail and the scallops were delicious! The staff is welcoming! Highly recommend!"}
{"text":"I seriously love this place but sadly have only eaten here a few times.  Every time I get a chance I go here and get their basic fish and chips and it has always been AWESOME!  I'm happy it has stuck around since it seems like this location has had some bad luck.  Here's to hoping it lasts a lot longer."}
{"text":"I have put off trying this place, but felt it was time. The restaurant is clean, the waitress was very pleasant. I don't mind spending more money for good food. The prices were high for what seems like a greasy spoon. The portions of fish are less then what I would expect for the price. Nothing spectacular. I did love the salad that came with the fish. Ada, time to reinvent this place. Either go greasy and plentiful our remodel and go upscale."}
{"text":"I'm usually not a fan of fried food, but the fish and seafood here have a light batter that isn't heavy or greasy at all. The Scallops are the BEST I've ever had!! Everything is very fresh, including the Haddock, which is amazing! The service is fast and friendly. Someone mentioned they thought it was a little pricey, but they give you generous portions and high quality fish and seafood, so I feel the prices are very reasonable."}
{"text":"Visiting from Memphis and had Ada's on my list of \"to-do\", and I'm so glad I did.
Fish sandwich was excellent.  Not greasy, more than a bunful, and just wonderful.
Onion rings also excellent.
You can definitely taste the freshness of the fish.
Prices are very reasonable.
As others have noted, the whole staff is super friendly.  They greet you at the door and check on you throughout your meal.
I wish we had them in Memphis!
I highly recommend Ada's."}
{"text":"My husband was craving good fried fish, and boy did we find the right spot! The fried calamari that they now offer was delicious! The fish was so yummy and cooked great! Great service as well! Definitely will be back!!! :)"}
{"text":"Went back to give Ada's another try. The food is really good and my only complaint is that I wish they had a combo with 8oz of fish and then some shrimp.  The 4oz just isn't enough fish if you get the fish and shrimp combo (4oz fish and 3 shrimp).

I did have the fish and shrimp and both were outstanding. What made the meal better is the excellent waitress Robyn. She is a joy and so friendly and helpful. The owners really found a gem in Robyn. 

Highly recommend Ada's and will definitely be back."}
{"text":"Was down in Phoenix visiting my parents for a weekend & was craving a fish fry. Being a Catholic from the Midwest during lent I do get a hankering for a good fish fry. :-) Searched Yelp & this place looked the most promising that wasn't too far away from the house. Was looking forward to trying the clam chowder which they were out of. So disappointing. Opted for the Shrimp & fish plate with french fries & cole slaw. I wanted to like it more but the fried fish was just too greasy. My stomach cannot handle too much grease. The shrimp was good. Cole slaw was good. The fish actually was light & flaky (when you removed the greasy batter.) Wishing I had actually gotten just a plate of shrimp. My Mom had gotten onion rings (add $1 more) instead of fries & they were just absolutely greasy as well. French fries seemed like they were possibly cut to order but I think they came from a bag as well. Ended up with all the tiny ends & no real length to any fry. They were good for a while but then again the grease factor got to me. Sadly I cannot give it 3 stars because I would not likely come back. Wanted to give it more stars & hoped I had found a great fish fry place for when I visit the folks but I guess the search is still on."}
{"text":"Nice local place, love to try to support local businesses. Special tonight is Shrimp Scampi Friendly staff and received a warm welcome.  Will certainly be back! Sandwiches and Entrees come with sides."}
{"text":"The food was amazing... Shrimp and onion rings are a must and the fish fry was awesome!  I will be coming back!"}
{"text":"We loved this place.  Everything comes fried unless you ask for it otherwise.   I got the fish and shrimp with onion rings.   Husband got fish and chips.  They also have kid's meals.  All meals came with large portions.  Owner is very nice.  We will definitely be  coming back in the future."}
{"text":"I absolutely was impressed by this place! Not only is the fish super fresh and perfectly prepared in a yummy batter but the service I received was FANTASTIC! The manner and my server were extremely nice! I will be returning!"}
{"text":"Excellent food, the staff was very friendly!  We had the fish and chips it was fresh and made to order.  The hush puppies were great :)."}
{"text":"Fresh fish.  Delicious awesomeness.  A bit on the expensive side so I wouldn't come here frequently but it was pretty yummy.  Great service, too."}
{"text":"Ada's has great fish meals. Highly recommend the fish and chips and the onion rings are awesome!!

A very great family owned and run business.

Make sure to ask for Ada, she is the best waitress we have had in many years."}
{"text":"This is the best place in all of Maricopa County for fresh fish. My boys love coming here as well. My four year old will only eat Macaroni and cheese- and Ada's fish! You won't be disappointed!"}
{"text":"Service was great, food was excellent! Had the Fish and shrimp combo, perfect! Highly recommend this place, we will be back!"}
{"text":"The server was such a sweetheart and gave us an excellent overview of the menu. Food was excellent, I had the scallop/fish combo with onion rings and a great side salad. The main entree wasn't overly fried and greasy, and the batter was great. The place was super clean, and had a great overall experience. We will come back again!"}
{"text":"We have been looking for good family restaurants that are no chains. We came to Ada's and found a gem. The food was really good. And the service was great . The only thing I found fault with had nothing to do with Ada's. My stomach was not up to the challenge that my eyes put forward. We will be making this restaurant a regular."}
{"text":"Always nervous ordering fish in the desert.  Had the combo fish and shrimp.  Was very good. Batter was just right. Shrimp were more like jumbo prawns. But the 5 stars comes from friendly staff. The chef found out I was going to be in and out of town for the next 4 months on business and came out, sat at the table and gave me 6 other restaurants in the area to try to round out my eating out.  I appreciate the help. Of course coming back here would be a must."}
{"text":"3.5 Stars, but I believe it has the potential to increase.

I really really like fried fish, so when I came across this hidden gem on Yelp, of course I had to give it a try.  I've been here twice now, once on my own, and then another time to introduce my Hubby to it.  The first time I went I had to search for the spot, because I didn't see the lit up sign facing the street (it's kinda small)...once you're in the strip mall, it's kindof hidden off at the end.  Anyhow, I ordered the fried fish and fried scallops with fries and coleslaw - to go.  The nice guys told me it's better to eat it there, so it wouldn't get soggy on the way home, but I was only going about 1 minute down the street, so I said it should be fine...They wrapped it up nicely for me and I hurried home!  Let's start with the flavor...which is spot on!  The flavor of the batter is so good.  This is not a southern fried fish with a super crispy cornmeal batter, it's different, more of a flaky batter, but it's good!  I really enjoyed the flavor of the batter and on the scallops it was very delectable :)  I don't even eat scallops like that, and I really enjoyed these.  My only complaint was that the batter comes off the fish and scallops super easy...I wish there was a way to fry it on there harder...Oh, and it's a bit pricey...I wanna say it was around 20 bucks for what I ordered, but from what I could tell, it's good quality fish and scallops and I think the owner has it flown in.

The second time I went, I took the Husband and we dined in.  He ordered the fish and chicken strips, which he enjoyed.  I ordered the same thing I had the first time, fried fish and scallops.  This time we ate there.  The owner is really nice and personable and asked us if we wanted to taste a soup he and his chef were working on.  It was a fish soup and it was quite tasty!  When our meals came out everything looked great.  But again, the batter isn't crispy enough and falls off the scallops and fish... :(  I wish they could come up with a way to fix that.  I love the texture of a crispy batter and perfectly cooked fish/scallop....Ada's, please fix that!!!  Next time I go I plan on trying the fried shrimp, they look amazing.

Sidenote, I love the fact that this is a small local business that actually cares and makes quality food.  It's just what this neighborhood needs!!! Because Im sure Im not the only one tired of all these lack luster chains in Goodyear."}
{"text":"It didn't take me long to find the restaurant.  I was a little surprised that the place was almost empty at lunchtime on a Saturday.  Maybe they have more business at night.  I was impressed with the quality of the fish.  Onion rings are the real deal.  Server was nice.  Cook was nice.  Coleslaw was good.  Shrimp was amazing.  I will definitely go back.  I hope they stay in business because the prices seemed a little steep."}
{"text":"Had a wonderful time at Ada's! We started with some fried calamari and a shrimp cocktail. Our meal consisted of the fried fish special with French fries, the kids fish fry and fish and chicken, fried, with onion rings. Our meals also came with some tasty coleslaw and house dipping sauce. We ended our meal with a root beer float! Food and service was excellent! We will definitely be coming back."}
{"text":"Best fish fry I've had since Alaska.
I understand the fish is flown in FRESH. Absolutely delicious. Give this place a try. You won't be disappointed. Service is good too."}
{"text":"Authentic fish fry! Nice and super friendly, the fish is delivered fresh from Boston twice a week! The hubs had the FishFry and liked it, it was huge, he didn't even finish! I had the chicken and onion rings both of which were excellent, and cooked perfectly! The place is clean, and the \"wait staff\" checked on us constantly offering refills and checking on our satisfaction! A bit of an older crowd, but it is December in Palm valley, so welcome snowbirds! We'll definitely be back!!"}
{"text":"The food is delicious but the customer service is outstanding. Our waitress was so kind and really interacted with my two kiddos which made them enjoy dinner so much more. The fish was very good, an interesting batter that was very crispy! Their special dipping sauce was also very good. Kids meals were perfect. Definitely will be back, not just for the food,but the good service as well!"}
{"text":"It's a new small place, clean, order at the counter fresh fish fry. They had several types of dips and the french frys were good. No beer :( sad hope that's too come soon. There was plenty served in one serving didn't need more. Husband wished his was crisper and wanted Texas toast.  Fish was white and very good. Coleslaw ok.  Hope they stay and grow - we'll be back."}
{"text":"Very friendly people.  Haddock fried fish is fantastic, well seasoned, and flaky. Best fish around."}
{"text":"I reviewed Ada's last week and the only thing I complained about was their lack of flavor in both the batter and the cole slaw.

Well I ate at one of their competitors today (Pete's Fish & Chips in Tolleson) and what a disappointment that was.  Ada's has good-sized, REAL fish fillets.  Pete's has these little rectangular, previously frozen, breaded things about the size of a deck of cards giving a person flashbacks of Friday school lunches.  You'd be better off getting them in the frozen section of Albertson's and cooking them yourself than eating at Pete's.  You know there's a problem when you order at an empty drive thru and your food is handed to you less than 2 minutes later having sat under a heat lamp for who knows how long before you got there.

Stick with Ada's if you want good fish and chips on this side of town.  It may be a few bucks more but it's LOADS better than Pete's institutional cafeteria-style fish squares."}
{"text":"This place is amazing. The owners and staffs here are super nice and will make you feel welcomed! The food is a great. I'll definitely become a regular customer here"}
{"text":"I am so disappointed. I just drove from Laveen to get fish. Well first I was shocked that the piece of haddock was so  small compared to the huge filet we had in the past. Second the batter was greasy and falling off the fish. It didn't appear as fresh as previous ones.  The French fries were also greasy and seemed like they were old and had been refried. It was like eating the crumbs of chips on the bottom of a potato chip bag. The fries were just bits and pieces of potatoes. I'm just disgusted. I just threw the $15 crap in the garbage where it belonged. Shame on you for not striving to keep up your quality. Yet your prices go up!  This is the problem and the reason why small mom and pop shops don't make it. The quality begins to become less important. I was willing to drive this far because of the great food I once enjoyed there but I wont ever come here again and to think that I brought someone with me and ranted about how great the food would be. Well instead of gaining a customer you lost two because of your lack of pride in what you do. Shame shame shame on you!"}
{"text":"My husband and I are thoroughly enjoying the fish plate. The French fries have a perfect amount of seasoning. The fish is light and delicious dipped in both sauces that they provide. They have fish flown in twice a week from Boston. I definitely recommend this restaurant. The owners are also very friendly. We've enjoyed eating outside in their patio!"}
{"text":"I walked in here at 2:00 today (Sat. June 3rd 2017) for a late lunch.  I ordered the Haddock.  EVERYTHING was throw away.  Starting with the Haddock, cooked in too old oil like the fries, nasty underflavor, from whatever process was used to get these prepared, too thick breading disguising the obligatory too small portions of fish, disgusting overall, but I was hungry and all too many places these days think this kind of thing passes for food.  The fries, WAY over cooked, a cross between a well cooked French fry and a matchstick potato, AND with the added benefit of having been cooked in the same rancid oil as the fish apparently was with a similarly disgusting underflavor.  Even Ketchup didn't improve on them!  Somehow they even screwed up the Tartare Sauce as well, cheap, ugly tasting, and detracting from already disgusting fish.  Even the Coleslaw was throwaway, obviously scrimped on dressing and quality ingredients!  But hey, the Diet Coke wasn't too bad!"}
{"text":"This place is a hidden gem!  I had the fish and chips and the fish was breaded with a very delicious cornmeal coating.  Fish was succulent and fresh.  The restaurant was clean and our waiter was friendly and attentive.  I will be back!"}
{"text":"Went for the first time and was not disappointed.  It was AWESOME!  The fish was crispy and delicious.  The owner was really friendly. Definately going back with friends and family. Price was good as the food tasted fresh."}
{"text":"As good as it gets in Arizona.  The quality of the fried fish, scallops, and seafood chowder are just as good as what we get back in Maine.  The fish is fresh, the batter is light and not greasy.  The quantity is also very good.  We found them after Christmas and have been back 2 times since.  Our son loves scallops and he said they were equal to what he used to get back on the Maine coast.  Nothing fancy, but if you want fish and chips or fried scallops, you should check 'em out."}
{"text":"One of the best fish frys I have ever had. Our waitress was great. I will definitely be back!"}
{"text":"Little tricky to find and not a lot of parking but once you do some great food. Customer service was AWESOME everyone in the place was super friendly and helpful. We sat close to the door and if any of their employees saw someone leaving they would run and grab the door for them and thank them for coming in. Not something you see all the time. Food was great had the fish/shrimp combo w/ fries and coleslaw. Shrimp were huge and everything tasted so good and fresh food arrived at our table piping hot!!! Our waitress was very friendly they really know what customer service is all about!!!!"}
{"text":"Stopped in at 6pm for dinner  The Haddock was out of this world and the Scallops and Shrimp my wife had were great . Just wish you could by it by the pound cooked."}
{"text":"Hands down one of the worst dinning experiences I have ever had. Understandably it was very busy being a Friday night. The wait to be seated was not terrible at all about 5 mins. We were seated and we ordered quickly,  2 orders of shrimp and fries and an order of chicken tenders. After ordering our waitress never checked us. We waited approximately 45 mins and had a enough. (During this same time another family of 4 had enough as well and walked out. They were seated before us.) We asked for our check for our drinks. The busser went to retrieve the check. He came back and explained our order was about ready. And explained It takes a little longer due to the orders being made to order. It being all fried food I would think it would be a fairly quick cooking process. So we waited a few more minutes. Our food was brought out by another waitress and we began to eat. The shrimp and fries were hot and tasty. The cocktail sauce that came with the food... terrible! It literally tasted like paint thinner. After the terrible service and wait time I think we were just done. We ate half our food and requested the check. Again not our waitress asked if we needed anything. She was great to us even though we weren't her table. We only again saw our waitress when the check was brought out. For terrible service and average food a $40 check was totally not worth it. But for the bad service they did give us a cup of ice cream. I really wanted to like this place but it just didn't happen."}
{"text":"Best fish and chips in the valley. Onion rings are fantastic. Go to Ada's, you won't be disappointed."}
{"text":"We looked this place up on Yelp, every week we try to find a new place to eat! Was apprehensive when we entered, no customers and it was lunch hour! Was greeted immediately, waitress was very helpful, explained menu, took drink order, brought them right back! Ordered fish and clams, alas no clams, but as she explained, they didn't buy any because they were not up to standard, we get that, understood!! So got shrimp instead! Did not take long to prepare our meal, and it was better than expected! It came really hot (always a plus)! We both loved the batter and fish was very delicate and tasty! Shrimp were large and great, lots of french fries  too! The only drawback was paper plate and plastic forks! When I pay that much for a meal, I would prefer it not be picnic style! Less I forget the sauces were good too, tartar sauce and cocktail sauce! And I'm a bit picky about sauces! Don't know why we remained the only customers unless it is in such of an out of the way location or prices a bit high for lunch so folks come for dinner! But you know I'm sure we will be back to have more!!!!"}
{"text":"Finally a fish fry in Glendale!!! 
Their food is soooo good! They only use fresh fish and everything else is made from scratch. Love their tartar sauce too! I'm so grateful someone finally decided to open up a fish fry.  I was so tired of the commercial seafood restaurants and fast food places. 

The owner is also a really nice man. I hope he's there when y'all go. Service is amazing!"}
{"text":"Fantastic food and friendly service. Fresh. Delicious. Passionate about their food and you can taste the difference!"}
{"text":"This hidden place has amazing food.  I absolutely enjoyed everything I tried; lobster rolls, scallops, fish, coleslaw, fries and chips.  The biggest downfall was the service.  The waitress wasn't attentive at all.  She brought us our food and asked us once how everything taste.  She never refilled our drinks until she brought us the check and I asked for refills.  We had to get out of our seat to ask for tarter sauce.  There was really no excuse for poor service considering there were hardly any other customers.  I hope the owner sees this review and discusses proper customer service with his staff because the food here makes eating here worth it."}
{"text":"Finally stopped in to give Ada's a try.. it was delicious!! I have four kids and all of loved the fish and the fries! Their favorite was the hush puppies!!! Everything was awesome including the service! Definitely recommended!"}
{"text":"I have had a lot of fish and chips in my day so when I saw Ada's I knew I had to try it. Overall Ada's is pretty decent, although out of clams when I was there the Fish and Chicken were pretty decent. I thought the breading was pretty tasty, and for being in the phoenix area this would meet your fish and chips fix. Overall a middle of the road fish joint. Not to shabby."}
{"text":"Good food....The owner Vince came out to meet me. I love fish and chips. I used to work in a seafood restaurant, and the fish and chips here are some of the best I've had. I highly recommend this restaurant."}
{"text":"Excellent family run restaurant with great seafood. Had grilled shrimp & scallops. So good. Husband had haddock deep fried with homemade French fries and coleslaw. The chef, William, came to our table and brought a sample of clam chowder soup. Also excellent. We meet Ada and her very friendly parents. Great place to spend Friday evening: good food, beer,friendly atmosphere. They even have lobster rolls!"}
{"text":"Great service! First time I have been here and the cook gave a run down of the menu. I couldn't remember if I had ever had a scallop. The cook quickly prepared a piece to sample before I ordered. They even threw in extra fries for my 1 year old at no additional cost. 

The fish and scallops are delicious. I ordered the onion rings and they had a light batter. I would definitely order this again.

Great little mom and pop fish fry restaurant!"}
{"text":"Amazing flavor!  Been looking for a good seafood place in the area and I struck gold with this one.  Fresh taste from the shrimp down to the homemade batter and sauces.  Seafood is flown in every week from Boston.  Staff is friendly.  I was told there are several things in the making to be added to the menu.  I can't wait!"}
{"text":"This is a wonderful almost hole in the wall joint.  I found the service to be quite cheery/playful and easily able to drop recommendations for the group and throw out other unique dishes the place had to offer for the day.

By the recommendation of the waitress we tried the clam chowder fries (which also comes with cheese on top).  We were slightly taken aback hearing about the combo but chose to live on the wild side, and what a great move it was!  This combo was quite flavorful and did not last long between the four of us at our table!  The majority of us ordered the fried fish which was Haddock with various sides ranging from chips, fries, hush puppies, and onion rings.  The homemade tartar sauce with the fish and malt vinegar is lovely, the batter on the fish is thin yet crunchy with a great texture.  They also have a red pepper sauce they brought us to dip our sides into which was also nice, overall the feel for the place is great and is definitely worth a stop in if you like fish and chips!"}
{"text":"Amazing place for seafood!!!  Owner and our server was very personable!!  We will definitely be back!!"}
{"text":"I was told that there weren't any good seafood restaurants in this area. Well, they obviously haven't been to Ada's! The staff was very welcoming and suggested some things on the menu since it was my first visit. I ended up with a fish & chip combo that was cooked to perfection! I also mentioned that I just moved to the area days before and he sat with me to write down all the other places I should check out. I was tremendously impressed with my whole experience and I'll definitely come back! Great food, great service? You can't go wrong with that!


P.S. I never write reviews, but I had to write one for this place. :)"}
{"text":"There was a time when I was a real fan of Fish Fry places. 

However, after having visited many that were just dreadful, I gave up on trying to search for any specialty shops that focused on this primarily.

We were on our way to a dine at a Thai restaurant in the west valley, and as we were pulling into the parking lot we spotted Ada's Fish Fry, just next door.

Mind you, we weren't that committed to Thai today, and perhaps venturing into the next door establishment may prove noteworthy. 

A quick check on the Yelp ratings yielded a fair amount of great reviews, so we deduced that we really had nothing to lose. 

Worst thing that could happen is that we would regret changing our minds, and we would then never come back to eating in this isolated plaza - ever again!

We were promptly seated as we entered the establishment, our drink orders were taken, and ultimately our dinner orders as well. 

Nothing too complicated in the menu. After all, it is a Fish Fry place. However, it is important to note that they also serve Hamburgers, Hotdogs, and even a small variety of desserts. 

Quite a nice addition to the standard fare.

My wife ordered the Fish and Shrimp Combo, and I had the Fish and Chicken Combo. The only addition was that I upgraded to Onion Rings, instead of sticking with just the Fries.

One thing that we did notice immediately when we took a bite of our meals was that the Fish was quite fresh and not overburdened with batter. It was nice and flaky. A commendable departure from the standard preparation that we have grown accustomed to at lesser places. The batter is so thick that it masks the flavor of the fish. Not at Ada's. 

The fish is well coated, but not overly coated as to detract from the overall flavor.

The shrimp was delicious. And the chicken that I had was also excellent.

Everything had very generous portions (including the Onion Rings), and were piping hot.

The service was very good, and prompt.

Definitely not your typical, run of the mill Fish Fry restaurant, and worth the drive. 

We'll be back at another time to sample their All-You-Can-Eat Friday Fish Fry's. 

That should be a treat!"}
{"text":"Great breading on the fish and frys really worked.   The service was great!  Wish this place was closer."}
{"text":"Great spot! The calamari is tender, not chewy and the batter was great!  Highly recommend this spot!"}
{"text":"Skeptic at first, because the restaurant was empty and the service was slow. However, the food was great!!! Really enjoyed the Veggie Panini and the house made chips"}
{"text":"Food poisoning!!!! My husband and I went to this place and placed an order to go over the phone. The lady was really nice her name was robin she answered all the questions I asked. We were on our way to pick up our food, the food was good/satisfying. The very next day my husband and I were vomiting and had diarrhea non stop because of this I do not recommend it to anyone. I really hope they can fix that and maybe someone else that I know will give them a chance and then maybe I will but as of right now I'm terrified to try this place again. I hope someone else can make a better review then this because the people seemed really nice there and I'm sure it wasn't intentional."}
{"text":"Food was amazing.  Got the fish and scallop combo with onion rings.  It came out hot and fresh.  The owner said he gets the fish twice a week.  Great food great service."}
{"text":"Love this place! It's a great local spot for great food and service. Everyone that works there is great, we especially love Robin. She is so attentive and super friendly. As for the food I've never had a miss. The haddock is crispy, fries crunchy, chicken panini flavorful, and side salad is so much more than an average salad. I also love the pet friendly patio.

So nice to have a neighborhood place to hang with amazing food."}
{"text":"Stopped and ate there few nights ago. Sat down right away  checked out menu.  Ordered food and couple drinks . Thought service was good food was very good but think it could use little ore TLC. Table could use a little more  care and floor also. Would go back for food but needs a little house keeping ."}
{"text":"We stopped in one day late in afternoon and had lunch. Restaurant was really clean and service was great. I had the fried fish with fries and hubby got chicken tenders and fries. Everything was delicious. We will definitely be back"}
{"text":"I've been waiting to try Ada's Fish Fry for a while. Ever since it opened, word of mouth recommendations told me to check it out. However, knowing how much I like seafood (and everything is better when fried), I didn't need a recommendation.

Tonight I was in the area and I had an opportunity to order some takeout. I was only five minutes away, so I called in the order and figured it would be ready and waiting. When I arrived, I paid for my order and was informed by (I presume) the owner that it was just being cooked. I was okay with this cause it was made fresh and would be more enjoyable at my destination.

The take out orders are wrapped in paper to make a clever carrying parcel. Normally, I would prefer to sample the food in the restaurant for a better first impression. It didn't matter tonight. My Fish and Shrimp Combo was delicious! It was still nice and hot and the portion was just right. It included fries and cole slaw.

I'm not sure what the white fish was, but it was flaky and delicate. You can tell it was freshly breaded and fried the way the coating fell off. It was just the right amount of breading and delicious by itself (with a little lemon). You can tell the product is fresh and prepared to order. And the devil is in the details. The tartar sauce and coleslaw are both very good. But the cocktail sauce was outstanding!

Ada's deserves the reputation it has earned because the staff I interacted with were very friendly and the food was delicious! I've seen the restaurants in this quirky location come and go. I'm hoping Ada's is here for the long haul."}
{"text":"Fresh Haddock from Boston twice per week, so they claim - and it tastes like it! The batter is crunchy crisp without being heavy or greasy. Good chips and tasty vinegar dressed coleslaw. 
The lady that waited on us, not an owner, was so proud of the food and so personable it made the experience all the better. And they know how to do take out. The fish and chips were wrapped in butcher paper so they stayed warm and crisp."}
{"text":"We came in on a Wednesday night and the place was dead, so we got the VIP treatment. We tried a little bit of everything, I had the shrimp and scallops, my buddy and his lady had the lobster roll and the fish and shrimp. Their white fish was Haddock which has great flavor and texture. Everything was cooked perfectly, I was blown away, not often does this happen with a fish joint.

4 stars for being out of clam strips, the lobster roll not being on a special artisan bun, and not having more side options."}
{"text":"Who says you can't find fresh fish in the valley.

If you're a fan of Fish & Chips, then ADA 's should be your next stop.  I went to ADA'S Fish Fry  on the recommendation of of  my fellow \"yelpers\" and I am so glad I did.

ADA'S is a wonderful, family-owned fish & chips restaurant. The fish is fresh, delicious and served with a smile.  On my first visit I selected the lunch combo. The lunch combo came with 2 big pieces of fish, a large portion of homemade fries, coleslaw, sauce, and a drink. 

The fish is a delicious flaky,meaty, white fish, and the breading is a light tasty mix of flour, cornmeal, and seasoning.   The fish is light, crunchy, cooked perfectly, served hot with the best homemade French fries in town.   The lunch combos run about $8.50 and the portions are absolutely huge.  

I am excited  to have finally found a fresh seafood restaurant in the West Valley. The guys behind the counter were very welcoming and accomdating. The quality of the food is top notch. I will definitely be back soon."}
{"text":"Ok first of all, they come up under a search for all you can eat friday fish fry.NOT TRUE YELP. They dont have.we decided we would give them a second chance, food was really greasy the first time. We waited as table after table that came in after us got their food. We asked for our waitress. Twice, but she was too busy. Another waistres came over 45 minutes later and said our order got mixed up. We left. Thats it for ada's. Their seats are terribly uncomfortable stack chairs, plastic forks. Geez."}
{"text":"Omg omg omg my inner fat girl screams I LOVE THIS PLACE!!!

Food was fresh and simply devine...we will def be back"}
{"text":"We were looking forward to some good fish and were disappointed.  They batter the food with the same batter on everything, it was light and crispy but everything tasted the same.  My husbands scallops were watery and tasteless, to pay 16.49 for shrimp and scallops is very high priced since he got 4 shrimp and 3 scallops, cole slaw, and some fries.  Nothing special.  I will say the chowder fries were interesting and different but not sure i would order them again.  The server was very nice and sweet and she was very attentive, she was the highlight of our visit as the food was mediocre at best."}
{"text":"As good as most others said!!  This coming from someone visiting from Seattle, where fish and chips are good.  Definitely recommend !!"}
{"text":"Seafood was fresh that was a plus! I don't think I've ever had haddock before must be an east coast thing. You can definitely tell that the seafood are fresh. I wish the breading/batter stuck on better though seems like every bite I take the batter falls off. Overall I am grateful for fresh seafood especially being that we live in the middle of the desert."}
{"text":"Quality of food is good as is the selection of fish choices. We ordered take out on the occasion we visited Ada's. Only complaint is the lack of family meals and the portion size for the money. I will probably choose another restaurant next time we want seafood."}
{"text":"Okay here goes neither my wife or I like breaded fish.  That being said I'm rating on the fish and place in general.  The restrauant was very tidy and the staff friendly.  They give you plenty for the price.  I had the haddock fish fry, my wife the fish and shrimp.  We also did the calamari appetizer.  The fish inside the breading is done perfectly not raw, nor dry cooked just right still moist.  It was the same with the shrimp, not rubbery at all they know how long to cook in fryer and keep tender.  The calamari was the same, no chew very soft, done perfectly.  The coleslaw and sides that come with the meal are standard and nothing special.  Why did we eat here we had a bogo so it was a good deal.  We will not go back but for anyone that likes cornmesl breaded fish snd sides this place is very good."}
{"text":"Wow! Fresh, flaky, moist, delicious haddock in a light dusting of cornmeal in the desert! 

I actually wound up getting my order to go and it gets wrapped in butcher paper in such a way that it creates a handle --too cool! 

Brought it back to my desk to eat and got pulled into meetings after just a few bites, but you know what? Even when it was cold, it tasted good. It did not get gummy or soggy. Of course, I do not recommend eating it cold. I'm just saying that's the quality we're talking about here. 

Ordinarily, I douse my \"fish n chips\" in vinegar but it just didn't feel right with ADA's. No vinegar or lemon required. :)

This place is destination worthy! Two-thumbs up!!

(it's tucked away in the corner. don't miss it!)"}
{"text":"Very average, they have service prices but you order at desk, and food is brought to you at table. Could have been fast food except for a added price up they had a nice salad to go with deep fried fish. Do not know how they received a 4 plus not in my book."}
{"text":"Great friendly staff that is attentive.  Parents and kids loved the fish.  We sampled the Chowder and will be ordering when we return!"}
{"text":"Another wonderful meal at Ada's with the family. Today, only new item tried was their shrimp salad. All agreed that it was great. The shrimp had a nice hint of spice that we asked for and the salad was full of flavor. Ada's never disappoints!!! On the side note, the staff at Ada's are great. They always check on you and make you really feel like they truly value your satisfaction when it comes to the food. We are very blessed to have such a nice spot near our home."}
{"text":"During Spring Training my buddies and I were looking for a quick food fix. This place came up as worth the money and time to check out. Fish was good and so were the fries. Wish that they gave you more cole slaw. Would definitely try it again when in town next March."}
{"text":"The peeps I came with gave this place 5 stars...
I don't really like seafood, so I'll defer to their judgement. The shrimp were apparently really good, as was the salmon. I had the chicken tenders, which were tasty & actually tender! Yummy fries for sure."}
{"text":"This place was really good, the food was super hot and fresh. my boyfriend got the lobster roll and I got the fish and shrimp combo. All in all id give this place a 4.5. My only complaint is that it took a long time to get our food which was weird since the restaurant was pretty empty. Other than that yeah it was ok."}
{"text":"I use to eat here almost once a week when it first open but I hadn't been here in a while. Use to sit and talk to owner all the time as it never was very busy. I got the haddock fish fry and a bottle of water. End up costing me $16 not including tip. Prices definitely have gone up. The fish and fries were definitely not as good as I remember but still better than most places. Seems like they are skimping on quality of food and the service. I guess I'm going to try and find a more reasonable place to spend my money. For $16 I should have had a better experience."}
{"text":"I wish we had more quality places like this around town. Yes it costs more than Long John Silvers. If you like eating at Long John Silvers and think it's a classy place I wouldn't recommend Ada's. 

If you're into casual dining with good food and you're willing to pay more than absolute minimum, try this place."}
{"text":"Well another great find, right next to Royal Jasmine Thai. Let me tell you folks, the wafts of exquisite odor of fried seafood filled the parking lot and drew us into  this establishment! Service was sublime, seafood is flown in daily and never over a day old! Now to the taste! Only two words matter here, SIMPLY SUBLIME!!! 

I would do this weekly but my lovely partner in crime advised me that it would be better to do twice a month to minimize my fried food intake.  Honestly, I foresee a couple of trips on the down low... Lol

Seriously, great food, great people and excellent prices! 

Come and enjoy!"}
{"text":"I have been looking for really great fish and chips in the valley for nearly two decades.  Almost everything I have had in the past has been awful.  I have had \"okay\" fish and chips at Friday's and Culver's but really....

Today stumbled upon Ada's.  Finally a fish fry home."}
{"text":"We have been going there over the last 2 years.  Today's visit was very meh! The fish changed a lot.  It used to be fresh fish.  Today it looked and tasted like frozen rectangular fish.  What happened???  Very disappointed.  The fries were hard and tasted like they were cooked yesterday and reheated.  Such a same.  We raved about this place in the past.  Expected the homemade chips to be freshly made and warm.  Served cold and tasted like chips from a bag.  What happened Ada's?????"}
{"text":"Really good fish and shrimp.  Great onion rings.  Faster service and alcohol would make it a five.  Worth the wait."}
{"text":"Delicious! Best fish & chips I ever tasted here in Arizona. A tab pricy but all worth it. The seafood chowder is out of this world. Kudos to the chef. Highly recommend!! ;)
#jumboshrimp #onionrings #fish #fries #seafoodchowder #happycostumer"}
{"text":"Ada's Fish and Chips is the real deal. I give 5 stars!

Positives:
The batter they use to coat their fish in is delicious. Actually it's the same coating on all of their food.  It looks like a cornmeal based batter which gives it a yummy crunch! It doesn't get soggy like some. I would say this is what will keep me coming back for more. 

The fish was cooked perfectly, as well as the scallops. I loved their dipping sauce, it it was very unique. They of course have the usual tartar sauce as well. The fries were also tasty. My daughter said it's the best chicken strips ever. 

The portions were large and satisfying. I hear they get fresh fish brought in on a regular basis.  And if that isn't enough to sell you.. this is a family owned place and they certainly are welcoming!  Enjoyable! This place couldn't be any cleaner. Actually she was pulling the entire booths out out to sweep!   We are happy to have found a neighborhood family owned fish fry!

Negatives:
I have none!

Tips:
I would ask for an extra side of their special dipping sauce !  We went on a Saturday at 3pm and it was empty (which was nice)  I hear it gets extremely busy in there (duh the food is amazing).  If you want to avoid this.. maybe try going when we did :)"}
{"text":"First timers here.  Staff is very friendly!  We wanted to dine outdoors and they wiped the chairs down for us and brought us a high chair.  

Husband had the chicken strips and onion which which were flavorful and crisp.  

I ordered the scallops which were not only delicious but bariatric-friendly as well.  We will be returning!"}
{"text":"Great fish and scallop !!!! Great addition to the Goodyear neighborhood. Family owed."}
{"text":"Tough one, I'm hard on fish folks. I hate batter and AZ loves it. Adas does cornmeal but it needed a little more zing. It wast not bad but Ada, stop by Papa Joes fish and Que, he's the best in the valley. Location is a little strange and that might be what threw me off. 

I will return and I have no major complaints just not the best."}
{"text":"The lobster rolls are to die for! We enjoy them cold with French fries. Yum! Such a great family run place too. Very personable and great customer service."}
{"text":"This place is awesome!

* food is great
* family owned is lost and this place keeps it alive!
* fresh fish I believe weekly
* make you feel at home
* price is not bad

Our favorite fish fry joint"}
{"text":"Tonight was the first time our family ate here & we will definitely be back! We started with the hush puppies- soft warm center, crunchy outside served with honey it was so good! My husband and I had the fish/shrimp & fries with coleslaw, perfectly done not too greasy. Our girls had the fish/fries & grilled cheese- they loved it. Such great service as well. Thank you for making family dinner great."}
{"text":"I was craving some seafood on a Sunday and decided to try Ada's.  I ordered their fish and chips and was not disappointed.  The food came out hot, the batter on the fish was delicious, and the fish itself was flaky and fresh.  The service was great as well.  Will be returning!"}
{"text":"Ah.ma.zing. Fresh and delicious, with very friendly service! Come at dinner time on a Friday and you'll stand in line for a little while, but it's worth the wait. I've only tried Ada's for carry-out, and haven't experienced dine-in. That said, the dining room is clean and looks comfortable; outdoor seating is available. 

I can't believe I can get this fish in the desert!"}
{"text":"It was excellent. Fresh and perfectly cooked fish, shrimp and calamari. The service was excellent too! Will definitely return. 
Can't leave the cole slaw out, it was one of the best I've had, not too much mayo, just perfeft!"}
{"text":"Stopped in a few weeks ago because of a yelp review and it was closed due to vacation and cleaning. You can't  blame a place for wanting to be clean, right. Returned tonight and the place was amazing. Small quaint place with super delicious food. Salad was amazing as well as the haddock fried fish. The pinot grigio wasn't  bad either. We will definately be make quite a few return trips here."}
{"text":"Fantastic taste. The customer service is great. My mother is from the east coast and we are always on the look out for good fish fry. We just happened to be in the area and tried a fish and scallop combo meal. Everything tasted wonderful but the scallops where by far the best. If I'm in the area again I will definitely stop by again. Hopefully they won't be out of seafood chowder next time."}
{"text":"Really good! Best fry batter. Had the fish, clams, and I onion rings. Huge portions.  Pricey but worth it"}
{"text":"I came here with high expectations because of yelp reviews, boy was i disappointed. I brought my whole family so we tried lots of things on the menu and everything lacked flavor. No clams that day and i made the mistake of getting the clam chowder big surprise it had no clams and a bad flavor. The fish fry was ok. Didn't care for the onion rings the portions or the prices. Never going back"}
{"text":"Ada's Fish Fry is a restaurant that NEEDS to go on your list of regular restaurant spots! The food is authentic and top notch. The fish (grilled and fried) were cooked to perfection; flaky and not greasy. The only regret I have is not coming here sooner! The owner was incredibly welcoming and more than willing to make our visit a great experience."}
{"text":"I was waiting for Lab Corp to come back from lunch so I went to Yelp to see what was good to eat in the area. When I seen there was an actual Seafood Place that didn't cost an arm and a leg I hurry up and go there. The atmosphere was excellent. It was quiet (minus the normal table chatter)..very clean with a Back East Feel to it!! I love how the menu is on the board and what I really love is how they wrap your food up in Butcher paper yet it looks like an average to go box. Now the food.... I ordered the Lunch Special and that was 2 pieces of fish some homemade coleslaw and a large drink. They make homemade tarter sauce and Slaw and that tarter was so good I could drink it by itself!! The Onion Rings are freaking amazing and the batter they use is something out of this world. To be honest..it taste like some old family recipe from Wales, London...lmaoooo I am totally hooked and the staff was so cool it feels like I have known them for years. This is a really great place and its worth driving out of the way to taste their Fish or Clams....or hell, they can deep fry my house-shoes if it means I can have more of that batter and Tarter sauce.
Also I met a really Wonderful Man while I was having lunch...I think he said his name was Bo Olsen but I could not find him on FB!!  If you see this Bo, Please leave a message about this place!! You never know...We may have our Wedding here..LMAOOOO
-KK"}
{"text":"Unfortunate experience.  Horrible customer service from waitress Robin. This was our first time coming and was excited to try the great food we heard so much about.  Never experienced such blatant hostility from an establishment as we did from this server, it was almost like we were not welcomed and she did not want to serve us. She hovered over our table when food was brought and immediately asked are we ready to pay. Huh? We just got our food!!!! Then when we were leaving, we wanted to take it to go and asked for a to go container--the \"lovely\" Robin snapped,  \"For what?\" We replied for our food. She then says, \"it's  already in a paper boat\"(the boat she referred to was the little paper like bowls that are used to serve food--not the closed typical to go container.  AND to top it off,  we watched her hand that \"typical closed to go container to another patron!!!!!! OMG!!! I can make many \"assumptions\" about dear Robin's behavior towards us, however,  I choose not to. At least the chicken was good,  too bad Robin's service was not."}
{"text":"Excellent fish fry. The Haddock was fresh and fried to perfection. The onion rings were lightly breaded and hit the spot. Locally owned. Worthy of more visits to try the scallops and clams. Seafood is flown in from Boston twice a week!"}
{"text":"I thought the fish was quite good.  Hubby loved it.  The onion rings were great.  My only complaint is that the two offered sauces were mayonnaise-based as was the coleslaw.  I don't like mayonnaise, so I would have appreciated having the ability to choose another offering, or at least cocktail sauce.  Overall, quite good and I'm sure we will be back.  There were plant of other diners, all of whom looked quite content.  The servers seemed a bit unpolished, but were quite pleasant.  Just found out they do have cocktail sauce!!  Yummy!!"}
{"text":"The menu is... Interesting.  Foods that they don't have are listed with N/A in the price area. Why even list items you don't have?  They have listed some beverages that they evidently haven't had in a while. The \"batter\" is more like cheap cornmeal. Not tempura. The shrimp was so thick with it that it has no taste and was dry. There fish also had little to no taste. The tartar sauce was pretty good. The fries are natural potatoes but were more in little dry pieces than any fries. Decor is light and nice. Bathroom was clean. The prices for what we got were not good. $11 for 3 shrimp and 2 squares of fish with a bunch of mini fries. $2.50 for a soda. The Cole slaw was evidently pretty \"aged\" as the red cabbage has bled the purple all in where it was and was pretty limp. The poppy seed dressing in it was nice but not on aged cabbage. Not impressive."}
{"text":"Three of us were in the mood for fish and chips, so we searched yelp! and found Ada's. What a treat! Our party was seated quickly in a booth as we requested. Very clean tables and overall throughout the restaurant. We started off with a large order of onion rings to share, and we loved them; would definitely order again. We each got something a bit different with a variation on the fish 'n chips. The haddock was nicely battered and fried, scallops were good too. Enjoyed the French fries!! A good choice for a Monday night out. We all agreed that we will return."}
{"text":"Had a wonderful meal at Ada's last night.  If you are looking for fancy, this isn't it.  They serve on paper plates and provide plastic utensils.  Beverages served in Ball jars.  Give me good food over fancy any day.  Three of the four of us had the fish fry.  They use Haddock.  It was white, flaky and fresh, fresh, fresh.  The coating is light, crispy and has some cornmeal and southwestern spices in it.  The chef came out of the kitchen and I had the opportunity to tell him that I enjoyed this meal more than the fish and chips I've had in London.   The fourth member in our group had a grilled chicken sandwich.  Frankly, never bothered to ask him how it was.  He finished it all.  Must have been ok.  Big portions, a server who was lovely and efficient...we will be back...minus chicken eater."}
{"text":"Food is great. Their ice tea is really good, which sounds weird but a lot of places you can taste when they don't clean their tea containers, but their tea is great. Also I adore Robin,the server, she is super sweet, funny and very attentive."}
{"text":"Let me start off by saying ask for Robyn!!! She is a great waitress, and will keep you laughing. The hush puppies are bomb, the shrimp are big and cooked just right too! I will definitely be back!"}
{"text":"Just Okay haven't gone back, They need to serve Dinner Rolls with a meal like this, everytime you ask about bread or dinner rolls they say they don't serve them.. I can get rolls at my fish n chips place but they aren't a nice sit down place. Arizona lacks a good restaurant for Fish and its one of my favorite meals. My generation grew up with bread or rolls included at meals. Most restaurants I go to serve rolls..not a great expense.

Someone else mentioned bathroom was not very clean, I've not had that problem."}
{"text":"Outstanding food and service! Fish is all flown in fresh and cooked perfectly and the scallops were awesome! They now serve beer and wine. Best fish and chips I've ever had! Don't let the unassuming outside turn you away - it's definitely worth the trip!"}
{"text":"Every thing is fresh and cooked to order. Our waitress recommended fish and shrimp so we tried it. I also tried the chicken and fish.   The owner let us try some hush puppies before we ordered them.  Our order came with honey and he recommended to try it with one of their other sauces.  

The owner was very nice, he  explained how he gets specific salmon and how they make their own crab cakes. He even mentioned how they will be making peach cobbler soon.  After speaking to him, I look forward to coming again and I must try their salmon and their crab cakes.  He even mentioned about possibly making brownies! 

This place is not a place to come drink like draft beer. They do carry wine and beer bottles and even cream soda."}
{"text":"The food and staff are incredible. The food is always fresh, hot, and delicious. The staff is courteous, to say the least, and surprisingly quick for such fresh food. Do not let the price deter you as it is well worth it for both quality and quantity."}
{"text":"Me and my husband came here because I had a huge craving for fried seafood and Az (especially the west valley) really lacks seafood joints. Petes is an Az classic...but I was in the mood for fish that isn't formed into a square lol. We were happy to find adas not too far away. The entire time we were there we were the only guests which made me sad for the owner. He was the nicest guy and was our waiter...I hope that was a fluke and that he gets more traffic because I would love to see him make it. My husband got the lobster roll and while it could have used a bit more seasoning it was pretty good. A squeeze of lemon helped for sure. I got the basic fried fish and the batter was crispy and delicious. Again...could have used some salt but it was under seasoned enough to be a deal breaker for me. The fries were fresh and good. The prices are kinda high for the portion size but that's how it goes with seafood. Oh and he uses a dr Seuss \"one fish two fish red fish blue fish\" book as the check book. That was a cute little detail that I loved. Hope this place works out!"}
{"text":"I stopped in and it happened to be happy hour. I ordered the calamari and it was okay. It had a slight burnt flavor possibly from the grease or maybe being slightly over fried, but what made it good is that it was real calamari. It didn't come from a box out of the freezer section. Also, try it with their tartar sauce it helped with that slight burnt flavor. 

Also the portion size was pretty sad. $7 for 7 calamari rings... I can get a whole pound of great tasting calamari from Oregano's or Angry Crab for $7. It just wasn't a good deal even with happy hour prices. 

There is one waitress and one cook and that's it. The waitress is spread so thin and she shows her stress. I came in after one customer and she was rushing me. A couple came in after me and she rushed to help them obviously because she was counting on a tip and to-go order don't normally include tips, so I understand. Also the bathroom was a little dirty so it was a little off putting.

All in all The experience was okay and I will try to go back and try another meal, I would say at least give them a try."}
{"text":"Just stopped back to my favorite area restaurant and had the tastiest haddock I have ever had. Super sweet tasting. Try the homemade onion rings for a real treat!!!  They are handmade and go great with the fish. 

   Super friendly staff and good sized portions make this place the choice for those who appreciate the fact that all the fish and seafood is flown in twice a week from Boston. Never frozen, always FRESH

        It just doesn't get any better than this...."}
{"text":"This place is a must-try. I ordered their fish and chicken strips and it was delish. Third fish and chicken were both breaded with corn meal and surprisingly it was super good. Definitely a first for me. Also, for appetizer the chowder cheese fries are a MUST! Very different but also very good. They give you a basket of fries, pour the chowder over it and sprinkle some cheese."}
{"text":"Delicious food. We'll be back many times. I expected the diver scallops to be overcooked since they're fried but they were perfect."}
{"text":"I went to Ada's Fish Fry last night with a few friends and we were all pleasantly surprised. Everything was delicious!!! The scallops were my favorite, but the others loved the shrimp! The prices are on the higher side but the seafood is so fresh and good that it is worth every penny! The chef even came out and asked how everything was and chatted for a minute...that was a great ending to the night. If there was one thing I would change it would be the water cup size...it is given in child size to-go cups...we went through tons of it. Oh...and a better beer selection. Overall, a great place for some fried, fresh seafood!"}
{"text":"This was my second time in and I enjoyed it as much as the first time. I ordered grilled salmon and breaded shrimp. My entree came with french fries and coleslaw. The fries were good and the coleslaw is not mayo based and packed a lot of flavor. The fish was grilled nicely and was a decent portion. I got 4 huge shrimp with a side of homemade cocktail sauce, very good. My husband doesn't really eat fish and ordered the chicken strips. He much preferred this over the cheeseburger he ordered the last time we came. The service is super friendly and quick. They offer adult beverages, which is a plus. If you are looking to get your seafood on in the west valley, this is the place for you!"}
{"text":"Fish fry was okay. Originally stopped in based off previous reviews and pictures that showed fried clams. I haven't had fried clams since I moved from the east coast 14 years ago. I was highly anticipating eating fried clams even if they wouldn't be as fresh as clams right from the ocean.
Unfortunately although their menu showed fried clams, we were told they no longer sell fried clams. Without fried clams, it's just another AZ fish & chips joint. Don't be fooled by the old pictures of fried clams I guess."}
{"text":"Well I went there for dinner after seeing a recommendation online and honestly it was ok. Now I love fried foods but in this case, it is a little breading heavy. Fries and coleslaw were perfect along with the clams I had. My only problems was the fish and the price. To me halibut, even though it's fresh, just isn't a frying fish. Couple that with heavy breading and it just wasn't good. The spices used in the breading are good though. As for the price you get a few clam strips and one strip of fish for $13. Service was amazing though. I'll most likely be back in to try this place again in a few months"}
{"text":"Had to try this place this morning after dropping a friend off at the airport. Had read all the rave reviews and figured it was time to check it out. Arrived right when they opened at 11am. Ordered the special fish fry plate and upgraded to onion rings for $2. Fish was excellent. Approx. 8oz haddock that was lightly battered and deep fried to perfection. Delicate, tender and moist. Onion rings were crispy and loaded with flavor although they seemed somewhat on the greasy side. Overall, a very pleasant and quiet lunch. Waitress was friendly, courteous, and efficient. Will definitely go again."}
{"text":"We had a fantastic dinner here. Friendly owner and great food.The seafood was fresh and the batter crispy but not greasy. We tried a bit of everything but my favorite were the scallops. They were cooked PERFECTLY! The best fried scallops I have ever had. Not even 2 seconds over cooked. Not an easy task! They were large and juicy. Wish we would have checked out this place sooner! We will be back."}
{"text":"Very good.  I have never had fried scallops, they are really good and cooked perfect.  I will definitely be back. I'm willing to pay the higher price for fresh fish. Very good!!"}
{"text":"Customer service was excellent. I had the fish and chips and it was was delicious. The batter is corn meal based and fried crispy. Frys were also fried to a nice crispiness. I will try to get here once a week. Coleslaw was delightful. Simple balance between fresh crisp cabbage and carrot and a tangy sweet sauce. Omg did I forget to mention the seafood chowder!!! Ridiculous. Left me speechless."}
{"text":"Ordered a combo of fish,  scallops and clams.   The scallops were cooked perfectly and they were  just fricken fabulous!   I am not usually a fan of clams,  but they serve a nice meaty claim strip,  so I was very pleasantly surprised at how good they were.  The fish is very good nicely seasoned and moist.   The owners and staff are very friendly and the place is very clean and decorated very cute.  They are a great addition to the West Valley,  I will definitely  return."}
{"text":"Pretty Good!  I have to admit that I am not a fan of \"fried everything\", but when you get the urge for fish/clam strips/shrimp/onion rings/fries, and you will be clogging up an artery anyway you really should eat the best, and this is it.  Quality food, that is fresh, not frozen, cooked in high quality oil.  Quality at the expense of economy, this is a dangerous combination for a young restaurant to attempt.  We hope they can pull it off.

The fries are crispy and light, the onion rings taste great and don't leave behind a puddle of oil.  We had the haddock, which is served with a couple of different dipping sauces.  It was great!, white, lightly breaded with a very nice batter, and not greasy.  You actually taste the freshness of the fish.  The slaw was good, but not special, but lowly coleslaw would have to do a Tasmanian tap dance on your taste buds to stand out from the flavor of the fish.  There are numerous other items and combinations of items on the menu board, and to be fair I did notice that there are grilled items (non fried) being added to the mix.  

We got the feeling that this is a family affair.  Ada was visiting with the guests, the kids (obviously quite young) were helping out and mingling with the diners, the cook, (Mr. Ada?) was also visiting and checking on the guests and helping refill drinks.  Pretty refreshing and small townish in their approach to customer service.  We liked it.

No pirate hats for the kids, you won't use coupons for free hush puppies or an extra \"plank\" of fish, no fish tacos, (oh please Ada, never do that, it just isn't natural).    It's a little hard to find, tucked into a strip mall sort of location on Indian School road at the end of Wigwam Road in Goodyear, Arizona, but well worth the trip."}
{"text":"Lobster  roll needs more lobster more mayo celery.  Clans to large tuff. Fish is best choice fried wonderful. Liked the place. Go for fried cod again"}
{"text":"The food wasn't very well seasoned. Wasn't the worst I've ever had, but not the best and we won't be going back. The lobster roll is $25 for rather bland lobster on a buttered hot dog bun. Wouldn't recommend it."}
{"text":"Service was good as well as the clam chowder. Although fish & shrimp were fresh they were heavily battered, same type of batter as well, this took away from the freshness of the seafood."}
{"text":"Yum!!! Great tasting food. Doesn't look like too much but don't let it fool you.  And you have to have dessert! Say hi to Max"}
{"text":"Very fresh seafood, good portions, but can bankrupt a small family. I know that good food, freshly prepared, is not cheap. I'm just saying most folks will have to treat Ada's as a treat. 

The owner was our cashier and cook. Nice guy. I hope this place makes it, it's nice to have family owned restaurants in Goodyear. We were the only people in there during dinner time on a weeknight."}
{"text":"A couple of people pointed out that the \"batter\" is actually cornmeal, not beer batter so I'm upping this to 3 stars as it wasn't Ada's fault! I did ask when we ate there and the lady must have misunderstood me cos she assured me it was beer batter! Still wouldn't go back as I obviously don't like the cornmeal batter! For local beer battered fish it's got to be Culver's or SunUp! But if you like cornmeal, give this place a try."}
{"text":"Very good food and service, the salmon wrap is very flavorful and fresh.  Highly recommended!"}
{"text":"We had the admirals feast which is not on the menu but is a very large combo plater. Haddock, clams, scallops, fries, onion rings (all fried) 2 sauces and slaw. Cost was roughly $50 with 2 drinks. We had plenty of leftovers for our son and lunch the next day minus the scallops, there were only 10 and none made it home. This is a very odd strip mall, had I not seen this place on yelp I would of never noticed this place. Signage is horrible. Such a shame because the food is great. I will go back for sure. I love good scallops and will go back just for them. They also serve NY hotdogs which I will also try. -- Owner is super invested and offers great service. I hope they stick around because the food is really good. I recommend you try it out."}
{"text":"Not only was the food EXCELLENT!!! So was the customer service. From the moment we walked in the door we felt welcomed. We weren't sure what we were going to order so we sat down with a menu to decide and a gentleman came over after giving us a moment to look over the menu and helped us to decide what we would like to order. I had the fish sandwich, my husband had the fish and clams and my daughter ordered the shrimp. She loved her food too and she is super picky. This is definitely a place we will be returning to over and over as a favorite."}
{"text":"I have to say that the fish was the best I've ever had. Cooked to perfection! I was just as impressed with the scallops. The french fries are home made and they blow any fast food fries out of the water. Also got to sample there onion rings. The best! Vince the owner and his son (Will) were supper friendly and helpful."}
{"text":"They fly all of their fish & seafood in fresh from the Easy Coast! It's hard to find Lobstah rolls in the Phoenix area but Ada's serves them. Locally owned and operated by a very friendly, customer service oriented couple."}
{"text":"Went their after winning a gift certificate and was so
Impressed with the friendliness of staff as well as the amazing food. Had the crab cakes and chowder (delicious) then had the shrimp, fish and onion rings. All came steaming hot and fresh. Will return!"}
{"text":"It takes a lot for me to give anywhere a five, but with Ada's, the food is definitely the star of the show. I have found that in the desert, fresh fish is hard to come by, but Ada's is great. Comparable to a great fish and chips in London. Made me crave some mashed peas. Definitely get the clam chowder!"}
{"text":"The only reason it's not 5 star is because the portions are proportional to the price. I'm not able to finish this combo and the price matched it. Cheap eats? No. Good food on a full paper plate? Eat here!"}
{"text":"Oh my goodness what a surprise.  My husband stopped here to bring dinner home.  When he got home he had the most amazing smelling fish fry.  It is my new favorite place"}
{"text":"French fries were dried out and hard
Fish was okay
Waited over 40 minutes after placing our order to get our food 
Beer was warm
Will not go back"}
{"text":"Best Seafood place in AZ. Food is fresh not like that re-fried frozen stuff you get at Long John's. Great portion. You won't go away hungry. Service is the greatest. All the staff are friendly and do everything they can to make you comfortable. As a bonus if you come on Tue or Friday's they have a seafood chowder to die for."}
{"text":"We were looking for a place to eat on a Friday evening and decided to give this place a go as I discovered it was on my bookmarks!

Location & Aesthetics - located on W Indian School Road & the corner of W Wigwam Blvd.  The place was almost a little difficult to miss using the GPS as it told me to go further up W Indian School Road and make a U-turn to come back to the restaurant.  I found there wasn't any need to do that as all one had to do is turn into W Wigwam Blvd then turn into the strip mall area with the businesses.  
The restaurant is nestled in a corner, of the strip mall, next to Royal Jasmine Thai, and it can be a little difficult to miss because their signage is a bit small (-0.5).
The restaurant has lots of seating - indoors and out.  Very clean, with lots of space to walk between tables/chairs.  They have booths for dining or table and chairs and enough space for large parties/crowds/families.  Good lighting and low noise levels.  There was one TV in the corner, tuned to sports and wasn't loud.

Menus - were very simple - one menu with easy to read/understand dishes, beverages, etc. on either side.  I believe there's also a menu posted on the wall in case you're a walk-in and wish to place an order to go.  

Service - Staff was very warm and welcoming.  We were greeted when we came in, asked if we've ever dined at the restaurant before, and asked if we wished for a booth or table/chair set-up.
Our waitress showed up immediately after being seated and gave us a warm welcome as well.  Got our drink orders, wasn't pushy to get us to order something, but gave us enough time to decide what we wanted.  
She answered any questions we had about menu items, and even made suggestions which was welcomed by some in our party.
During our dining, the owner came by our table, greeted us, and asked how was the food, and made sure we were doing okay.
Truly a warm feeling!

Food - For me, I had the pick two - pick any two items (fish, chicken, clam, shrimp) and it comes with fries and coleslaw.  
I picked the fried haddock fish with fried shrimp.  The plate came with 2 large pieces of haddock fish, and 3 large pieces of jumpo shrimp.  
The fish was lighted breaded and fried - wasn't very greasy and the fried batter wasn't too thick but seasoned just right.  In fact, it broke apart easily/flaky, was very crunchy, and the fish was fresh and well seasoned.  The fish was tender and moist too, and not too dry.
The shrimp was the same - batter was light but made it very crunchy, and seasoned well enough that I consumed even the tail!  The shrimp was also fresh.
The meal came with tartar sauce for the fish and shrimp sauce for the shrimp (2 small containers).  I didn't require more than that, but I'm sure if I did, I would've been provided with more if asked.
The coleslaw was fresh, crunchy, well seasoned, and not too sweet and not too tangy, but just in-between which was perfect for me.  
The coleslaw is served in a small cup/lid but I thought it could've been served in a small bowl, like the one you get at restaurants when you order a side of beans with your ribs.  In my opinion, I think the small plastic cup with lid is best for occasions when placing an order to go, and not necessarily for dining in.
The fries was good - fresh, hot, but unfortunately on the salty side for me (-0.5).

If you check in with your Yelp app, there's a $5 off coupon for orders $30 or more.
Also, when they bring the bill to you, you will discover, the bill is placed within the book 'One Fish Two Fish Red Fish Blue Fish by Dr. Seuss.  Be sure to sign it and put any compliments you may have within the book prior to leaving!  It was really great to see, on all the pages, compliments, names, dates, etc. from all the folks who previously dined there!

I like the fact that this is a small, family owned business, and coupled with the great atmosphere, welcoming family staff, and great food, I will definitely recommend to try this place out.  I know, for me, I will be back to either dine in or for takeout."}
{"text":"Probably the best fish and chips I've had since living in the west valley area (10+ years). Great food, good service, will definitely go back!"}
{"text":"We've returned to eat here several times. We've even brought friends! All of us agree....Good food!  The fish is on point! The onion rings are the best in the valley. The coleslaw is not a creamy coleslaw, but a vinaigrette based slaw. It is delicious (and I'm a picky slaw eater). Don't forget to order the hush puppies.i know it's a fish place, but his chicken is really good too! And I must say, the servers are always pleasant and easy going. Each return has been a pleasant experience! Wish I was going there right now:)"}
{"text":"Fish fry was great!  Love the fries.  The fish was extremely fresh and tasty!  Shania was a great server!"}
{"text":"Fish in the desert!  We love this place.  The food is great and we love the sauce they serve with the fish.  They are always super friendly too.  We are happy we found this little gem at a fundraiser.  They support the local community as well.  We always prefer to support local businesses, and this is one we keep going back to."}
{"text":"first time visit, we were looking for a good Fish n Chips place and gave this one a try based on reviews, was surprised that they used Haddock vs Cod like most places and have to say that was a nice variance, had the fish and shrimp combo and at first thought it was not enough food, however it was plenty and very good, will go back for sure."}
{"text":"What a treat! First time here and we'll definitely be coming back! Staff is friendly, food was delicious and worth the price! We ordered two combos with fish, one with scallops and the other with shrimp, both were very tasty. Ordered the special, clam chowder and burger for the five year old. All of the food was eaten and settled nicely in our tummies! Worth the visit!"}
{"text":"i could have made this myself with corn meal and oil. not worth the money at all. im from NY, and im used to real fish fry. this was nothing but corn meal. not good."}
{"text":"Stopped in to get take-out lunch Friday.  Very nice gentleman behind the counter took my order and also prepared the food.  We ordered 2 of the fish lunch specials.  The food quality was very evident despite suffering slightly from the 15 minute drive home (we hit EVERY traffic light!  Grrr...).  We thoroughly enjoyed the product once we got home, so I look forward to eating in in the future, to truly get the food at its freshest, blazing hot straight from the fryer!

The lunch special featured a nicely sized piece of fried haddock with a crisp cornmeal crust, a plentiful portion of fries or onion rings (we got one of each, the onion rings cost $1.00 more, a very reasonable upcharge, given the generous portion) and a small tub of coleslaw.  The coleslaw was made in house and tasty, there was no chemical preservative laden gloppiness of some coleslaw you might get elsewhere.  There were also two sauces, one a traditional tartar sauce and the other a flavorful if slightly spicy remoulade type sauce.  Both sauces tasted good on everything, the fish, fries and rings.  They advertise the fact their fish is flown in twice weekly from Boston.  The haddock was very good quality.

We look forward to going back and trying their other items such as fried clams or scallops and the seafood chowder.  I give them kudos for keeping the menu limited, it allows them to perfect their offerings!"}
{"text":"Amazing fresh seafood! Yes it's a little pricier than Culver's, but it's fresh and you get a larger portion than normal. The fish, scallops and shrimp are huge. The sauces are amazing. You won't be disappointed at Ada's."}
{"text":"great fish, hush puppies & fries!  i am an onion ring girl and these were only ok...guess i did not want everything on the plate to have the same batter.  service was awesome, fast and friendly.  we definitely will be back for more visits."}
{"text":"Ammmmaaaazzzziiinnnggg! I don't even like breaded or fried anything but this place has got me hooked! The scallops are so delicious...in fact everything is SO delicious and the staff is super friendly. Try it..you wont regret it! And if you do, it's cause you have poor taste in food!"}
{"text":"Great stop! Our waitress Robyn was very helpful and efficient. Had sampler of calamari, hush puppies and crab cake - it was great! For meals we had shrimp plate and fish sandwich - hot and fresh! Prices were very reasonable and many options!!"}
{"text":"3.5 stars.

My mom was craving some type of seafood and she also didn't want to stray too far from home.  Looked up some fish and chips here on Yelp and this place sounded pretty good.  We got in the car and headed on down.

I saw the place from the road but passed it and had to pull a U turn in order to get into the shopping plaza.  This place is tucked away in the corner, right on Indian School Rd.  We walked in and there was one other man eating lunch.  He said hello to us and seemed like he was enjoying his meal.  You walk up to the counter, place your order and they deliver your food to your table.  We ordered a few things....we got a Haddock and Fries lunch special, a Scallops and Fries lunch special and an order of Onion Rings.  The lunch specials came with a fountain drink (Coke products).  The drink machine is behind the counter so the guy working the front filled up our beverages and then we took a seat.  A few minutes later, the food was out.  Here is how it was......................

Haddock and Fries Lunch Special ($8.95)-  This platter looked very delicious.  It contained two good sized pieces of fish, a nice amount of fries, a small thing of coleslaw and tartar sauce/fry sauce.  The fish was super moist and tasted great.  They fly in their fish twice a week from the Boston area and you could definitely tell it was fresh.  The batter was very light and was a typical \"fish fry\" batter.  The fries were natural cut fries and they were delicious.  They reminded me of Phils BBQ fries in SD but not as crisp/good.  The coleslaw was tasty.  I couldn't really tell if it was a mayo based or vinegar base.  I saw some white sauce sitting on the bottom of it but it didn't taste mayoish at all.  It had a hint of apple cider vinegar? to it.  It was pretty tasty and refreshing.

Scallops and Fries Lunch Special ($10.95)-  This platter was identical to the fish platter minus the fish ;-) lol.  This platter came with 8 or so nice sized scallops that were breaded in the same \"fish fry\" breading.  The breading fell off of these kind of easily but they were still delicious.  They were cooked perfect and tasted great!

Onion Rings ($4.95)-  Totally fresh and hand battered!  The batter was similar to the fish fry batter but it had added pepper to it.  The batter was very light and kind of crumbled off easily, but the taste of these were great.  Reminded me a bit of a Teds onion rings...kind of like an onion string almost but in ring shape lol.  These were excellent!

Overall I was impressed for the most part.  Service was excellent and the food was very good.  It is just a tad steep though for what you get.  Our bill was $28.00 for two pieces of fish, 8 scallops, fries, slaw and onion rings.  The drinks come with the lunch special or else they would have been an additional $2.25 each.  That would have put us at close to $35.00 for lunch.  If they were $5.00 less or tacked on an additional piece of fish and 2 or 3 more scallops, the value would be better.  The only other slight complaint is about the flies.  They opened the side door while we were there and we had some flies buzzing around our table most of our meal.  Slightly annoying and nasty.  Will I be back?  Probably....this was one of the better fried seafood joints I have been to in awhile.  Just bring your $$ and maybe a flyswatter  and you will be good to go ;-)!"}
{"text":"Decided to drive all the way out here to try their fish fry since I was really in the mood for it! We arrive and get seated and I order the haddock plate with a side salad instead of coleslaw and with fries. First came out my salad which I was ready to eat!! But than come to my surprise after I have taken a couple bites I find something moving... the waitress did come as I called her over in a hurry and was very sorry and the manager came as well to apologize.. so finally my haddock and fries come out and they ask if I would like another salad or anything to substitute but I decided the haddock  and fries alone were just fine.... so after I do get done with my meal which took a bit too eat... the haddock and French fries and sauces were very delicious!! And as the dinner came to an end they did subtract my salad off the bill and the server was very nice and attentive and very apologetic but would I make the trip again for some of their fish fry..? Probably not..."}
{"text":"So so good!! 
The young lady was so nice she even walked out side  bit(it was empty because it was almost close) to make sure we were in the right place .
Very patient also! I had the Haddock with fries (kids meal ) because I was not starving and it was just enough. 
I'm a pescatarian so fish is a staple for me and honestly the crispiness and the freshness just wow I'm about to eat this peach cobbler and I  have no pictures because I destroyed the food! Lol"}
{"text":"Food still outstanding but menu changed around again and seems like the portions got smaller and prices higher. I don't mind paying because the food is so good but smaller portions. Miss the platters of a little of everything now it's pick two options."}
{"text":"Really great fish and chips, the fish was very fresh and the fries were hand cut.  My husband had the scallops and he thought they were delicious.  My only gripe would be that it is a bit pricey."}
{"text":"What an amazing dinner we had. Family focused to provide all fresh, yes I  said all fresh food from the imported sea fish to shrimp and don't forget about the onion rings omg amazing. The hospitality was amazing, made you feel right at home. I highly recommend this place if you are a sea food lover and miss the East coast. This place has it all under one roof. Great job guys!"}
{"text":"Holy Haddock! We loved Ada's. It will become a new restaurant for us. Everyone was great! So kind and just genuine. The fish was delicious. Not greasy just crunchy and flavorful. We really enjoyed it."}
{"text":"Excellent service and food. Staff is friendly and makes you feel welcome. The food was delicious. Fresh fish fry with fresh onion rings and fries. The \"side salad\" came with cranberries, feta cheese and sunflower seeds! The raspberry vinaigrette was the highlight of the salad! The claim chowder was also very good and fresh with ingredients you can see! Not like what you get in any large market chain! 

We will definitely be back again soon!"}
{"text":"Judging by the positive reviews, I really wanted to like this place. I won't go back though and here's why:
*The fish and clam entree with fries and coleslaw was meh. Long John Silver's fish is better. The coleslaw had some awful seasoning, I threw it away after one bite. The clams were hard. 
*My intentention was to dine-in but the hot temps inside were too uncomfortable. I don't like sweat dripping off my forehead while I'm eating so I left my table and opted for take-out instead.
*I requested and was assured extra tartar sauce but when I got home realized my request wasn't granted, thus had to go back out in the 107 degree heat and drive to a grocery store to get more sauce.
*I was there about 4pm and quickly realized this was THE hangout for junior high kids who appeared to be just loitering inside and causing trouble as evidenced by the manager scolding them. Classy.
*The service was ok considering the obvious lack of customer service training. Think \"lemonade stand\" caliber of service. Most likely their first jobs.

One star because they serve bottled beer and it was ice cold."}
{"text":"Fish wasvery good quality. Wasn't a huge fan of the onion rings. A bit pricey, but we will be back."}
{"text":"Outstanding fish, friendly service and fair prices. If you love haddock, you have to try Ada's!"}
{"text":"Good size portions, couldn't eat it all. Husband doesn't like seafood, had the burger and said it was good. 

We went at 1:30, they were out if relish and Coke Zero. Two potential customers came in asked for menus to take with them. They don't have any. I would recommend to owner to display copy of menu in window, like many other establishments."}
{"text":"Fish was very fresh and good. No real flavor in the batter for the breading. Bland. 
The wait time was ridiculously excessive. Customer service was awesome, very nice and professional."}
{"text":"Pros:  Pretty Good fried fish and sides. My wife had some fried shrimp and t was not that good. 

Cons:  kind of like a fast food joint with plastic fork and plate. The ice tea glass is for a little kid. 2 sips and I wanted more. Hey, August in Arizona, I'm thirsty. 1 waitress. She was nice but busy. A little pricey for plastic fork and knife place. 

Overall about a 3 out of 5. We may or may not go back."}
{"text":"Cute place, great service.  Basic choices, fish,shrimp,clams,and scallops. I can attest to the first two. Take top shelf fresh seafood flown in from east coast weekly and cooked as well as any pro chef.  Do only 4 entrees, 2 hand made sides and do them unbelievably well.  When you pick up the filet and it just falls apart, you can tell it's so moist and fresh and cooked to perfection.  The shrimp are pretty large but the minute you take a bite you go oh. You will know what perfectly cooked, top shelf shrimp tastes like. It's unlikely you've had it in a while. You will most likely pass one over to your spouse and say, omg, you gotta try this. Then you both just look at each other and nod.

Fried shrimp are usually ehh.. Over-cooked, flattened prior to freezing, all look exactly the same,taste the same in 90%of the restaurants in town. The other 10% have amazing pictures of shrimp on their menu, but when you get them they look a lot smaller, or perfect arraigned and still taste half.way from ehh to good.

 I know food pretty well and these were amazing. The fries were a 7/10, they cut them fresh and I expected them to have the taste of oil, but they didn't, surprising me they were pretty good. I'll go for onion rings next time.  The cole slaw is well cole slaw. I'd much prefer a monster drop  biscuit.

This will be on our regular list.
Little pricey, but aren't most things that are worth having?"}
