{"text":"Pizza is good and wings are just right!.  2 stars for great pizza and wings. Minus 3 stars for being so filthy and dirty this place is super dirty . Get your pizza and wings to Go"}
{"text":"The pizza is just okay. My one complaint about it is that every time we order it is always cold!!!!! We live 5 minutes away. If we order and the say 20, 15, 10, etc  minutes until it is ready, no matter what time or how early we get there, it is always cold!!!!! This worries me. The wings are just okay also."}
{"text":"First and last time never acceptable to find a roach in your pizzabox I called with no regard for staff"}
{"text":"Delicious.  Great prices.  Love the mango habanero wings!  Yum!!!"}
{"text":"The place is plain, but everyone in town knows about it. The pizza is crazy greasy and the taste is dull. They deliver, but it makes no sense since it is really gross."}
{"text":"Had a \"deal of the day\" coupon for $20 worth of food so decided to investigate. They don't have a website. They don't have take out menus you can keep at home. I had to drive there and memorize the menu then go home to come up with a plan on what to order. We got the XL pizza and 40 wing special for $23.  The pizza was so-so. Not much sauce or flavor. It was also not very hot. The crust was airy and light, though.  The wings were big and juicy but i like them a little more cooked so they are crispy. But that's just me.  Kudos for offering the proper bleu cheese dressing. Most places just have ranch.  Also bonus points for offering 2 kinds of BBQ sauce.  The medium wings had just the right heat level.  The counter worker was friendly yet clueless about the coupon/voucher. I had to explain how it worked. There seemed to be no manager to help.   I've had better."}
{"text":"By far the best pizza that I have ever tasted outside New York City!"}
{"text":"Their pizza is the BEST!!!! Not greasy like the other pizza joints. However, their wings are just like the other pizza joints. Definitely my go-to place for pizza. You will love it! Tasty and delicious. Their crust is moist too."}
{"text":"Decided to try this place last Friday, 04/27/12.    Ordered the special, XL pizza & 40 wings for take out.  Young man at the counter let me try the medium & hot sauce 1st.    I went with the medium sauce for wings and they where really good.  Pizza was yummy, very soft & HOT!!  Not burnt or crispy like others.  Wings where PERFECT, BIG & Juicy. Asked for them sloppy and they where not greedy with sauce.  This is my new take out place on Friday nights for pizza & wings!  Very good and inexpensive!!"}
{"text":"If you're looking for just some basic pizza and wings, this is the place. Nothing fancy or outstanding but good for the price. Definitely ask for extra sauce on the wings."}
{"text":"Called and they said they didn't have drivers????? Wth!!! Idc about the good reviews I just read. The fact that I call and they don't even have a driver to bring me these \"amazing wings\" is ridiculous. Don't waste your time. Order pizza Hut or dominos."}
{"text":"Stay away from this place.  Upon entering there were 3 kids camped out with toys, etc scattered all over the floor near the entrance (kids belong to him or someone else who was seen in the kitchen - because there were no customers in the place).   We went in to take out pizza using an entertainment.com coupon that was printed at website.  Man at cash register said we don't take coupon...we didn't sign up with this.  BS,  I have used same coupon there before.  But glad he refused us, because while we were talking to him 2 of kids were running around the place squealing and he was busy killing flies with his bare hands on the counter and squishing them between his fingers.   You were warned!"}
{"text":"Good pizza even better wings. Usually a 45 min wait for delivery so if you are starving I suggest you pick up you're order. Employees are always very kind."}
{"text":"I would love to give Adam's a 5 star but the overall experience would be a lie at 5 stars. their pizza is great... if you get it warm. One day I decided to try a slice of their pizza, and I was shocked to find out how great it was. I lived in Italy for some time and have become quite the pizza snob, so that says a lot. A few weeks later I called and ordered ahead and was told 15 minutes. I arrived about 20 minutes after the call and was told by the boy at the front counter that my order would be ready in 5 more minutes so I took a seat and waited. While waiting I watched this kid sit and play on his cell phone, ignored customers while on his phone, not answer the work phone, and to top it all off, the entire family decided to come in and EVERYONE, including the children went behind the counter and into the back where my pizza was being made. I know health codes and having 7 extra people back there who did not wash their hand and are picking at things is not sanitary. 20 more minutes go by when finally I was beyond peeved and I went back up to the counter, (mind you there wasn't but maybe 4 people who came in during this time) and they kid says \"hey, what can I get you?\" I was like, are you for real? I already paid for my pizza, and you told me 20 minutes ago that my pizza would be ready in 5 minutes. All he said was \"oh\", then walks into the back and grab my pizza which was now cold. I do not recommend this place only because of the lack of care they put into their business. This place would be great if it had proper management and rules instead of entitled children running around."}
{"text":"This hidden gem is my favorite pizza place on the whole planet! I've tried many kinds up to the fanciest places, and this place makes me the happiest! Great crust - soft, chewy, and crispy all in one, not too much sauce, and, yes they have ranch!"}
{"text":"Not too bad.  When I heard that a pizza place was opening up in the old Subway spot I immediately had doubts.  The results have been good from Adam's, the pizza is good, the wings are good.  Just found out last night that they have churros, and they are very good...  was thinking about giving them an extra star just for the fresh hot churro but nahhh."}
{"text":"Me and My Girlfriend have searched for the best pizza all over the valley for over a year now . We have paid high dollar at several fancy spots and she was not impressed with any of these popular suggested places .I said what the hell were picking up a sack in Tolleson anyway we should try it and what do you know it is her favorite place .We drive 15 minutes out of our way Flipping off Pomo  Red Devil and all the other spots we had tried in the past .The Dough is crispy yet chewy inside .Sauce and cheese on point to compliment the righteous  crust .Wings are slightly crispy and drenched in a legit sauce...Dip those bad boys in buttermilk Ranch and you're set ."}
{"text":"The pizza here is a joke. We ordered a large one topping with chicken. It looked and tasted like they took an old pizza and re heated it. Even a Little Caesar's pizza has more flavor. I will never come back to this place."}
{"text":"Decided to try Adam's when looking for good wings close to Ak-Chin Pavilion, and we didn't really want to go to a busy chain restaurant.  We loved it!  The service is quick and friendly, and the cashier answered our questions honestly about what to order and what not to order.  We ordered wings and breadsticks, and my date and I both loved the wings because they came with a ton of sauce, The flavor was great too. We had the sweet chili and the hot.  The breadsticks were basic, but they were great, and they also had a lot of seasoning on them.    We also ordered churros, and we thought they were pretty good.  There was ample parking, and prices were fair.  I did not give this place 4 stars for a few reasons. First of all, I reserve those for like a gourmet situation where I feel like the food is unique and I can't get it anywhere else.  Second, you can't order a beer with your wings. They do not have a liquor license. Third, the service was not the quickest, and the restaurant was relatively empty. I can imagine if you got there at a busy time that you would wait a long time for your food. All of this being said, I would definitely go back!"}
{"text":"This could be classified as hole in the wall by some. Chairs need cleaning and it he tables don't really fit the building. The picky person probably wouldn't like the atmosphere. However the pizza and wings are pretty good, wings are nice and big a little tangy for my taste but not bad. The pizza is fresh and flavorful. Nice bite to the crust and light on the inside. Sauce is not overdone and toppings are nice.  If you don't want to eat there get it to go and you won't go wrong. Helpful and friendly staff, but nick jr on the tv was turned up way too loud to entertain one of their young daughters. A nicer and cleaner interior would have gotten the place 4 stars."}
{"text":"4 stars because it's been consistently good , it's not brick oven there is better out there but if you want a decent pie and some wings at a good price then this is the spot!! great for after baseball with the whole team ,the kids are always happy"}
{"text":"Was told about this place from people on my son's baseball team after tryouts a couple of weeks ago so we decided to give it a try. The first time the pizza and wings were super hot and tasted great. The second time we ordered the other night it was pretty terrible. The place is also about as gross as it gets with one adult working and what appears to be a few \"High\" school kids (if you get my drift). They are not exactly welcoming or friendly but that is not a concern, I would certainly never eat at the restaurant and they do not deliver so you need to go in and pick it up. They have some great prices and the orange wings are awesome! It is what it is, a dive style pizza joint with cheap pizza. I would lie if I said I wouldn't eat here again because I will just because of the price and the food is just good enough."}
{"text":"Okay, here's the deal... I have been going to Adams Pizza for over a year now... Their pepperoni pizza is on point! \"Especially when I ask for xtra sauce and pepperoni\"... Their perfectly flavored \"medium\" wings, were by far the best amongst other nearby pizza joints. They were perfectly cooked, crunchy and about the right size. Adams only deserves 3 stars now because the owners have decided to save some $$$ and now buy some CHEAP, crappy, chicken wings! These \"cheaper\" wings are noticeably smaller, mostly dark meat... MESSAGE TO OWNER: Cut back on spending by watching your finances! Don't change your menu up or change what has been going great for you! I NO LONGER CRAVE their wings due to this change, and therefore don't plan on visiting again, unless I am starving for pizza... Adams, if you decide to go back to your \"old\" wings and get the budget straight, I will definitely be back! Thanks, A Moody former loyal customer..."}
{"text":"Location is close by; I really like their wings- I usually order medium & they are good. The sauce is what I like & their ranch dressing compliments them. As for the pizza, I always get pepperoni & their pizza is good. They have pizza & wing deals, & lunch specials that really sweeten the deal. Customer service is great- they are always friendly & the wait is usually 15-20 minutes which is average. I have not tried their delivery service so my rating is based on the food, cost & customer service."}
{"text":"A couple years ago this place was great and the wings were huge and tasty, the pizza is still good and I like the thick crust, but the wings are awful now, they are so small and when I ordered some they were all burnt, I was very disappointed in the quality in the wings, the place looks decent and I probably will only return for the pizza but not the wings."}
{"text":"this place is close to work so i ordered pizza for work and a salad for me.  the pizza is fine and the salad just ok.  they deliver so thats a plus.  price is reasonable."}
{"text":"Only giving this place a 2 because they offered a good deal. Aside from that I ordered 1/2 honey hot and 1/2 spicy barbecue... honestly couldn't notice even the slightest difference between the flavors so either they messed up my order or they flavors are just that similar that you can't tell. The pizza wasn't as large as we'd hoped but it tasted good. I ordered take out and the food was cold by the tim I got there, and I had no clue what was even happening because the person who greeted me didn't really greet me. No hello, or anything. He literally just stood there for a minute or two staring at me before I said \"is this is?\", then I finally got a reaction and he told me the total. Unless I'm feeding a crowd of teenagers and don't want to spend a lot on Pizza and wings I won't be going back again."}
{"text":"First time here. Best wings ever. Meaty and cooked perfectly. Prices are great too! We will be back for sure."}
