{"text":"There is olny one reason to go there and its to drink. The ribs are amazing but good luck trying to find a seat where you can eat. It is a very tiny bar. The noise level was way to loud so forget about talking to the person next to you, so the olny real option was to drink.  I think if i go agin it wont be on a friday night."}
{"text":"Menu was not extensive, but it's a pub so no big deal. Food quality was not bad though, but a $14 for a mini-pita lamb-burger is outrageous. Worst thing about it was the service. Went for lunch with our work team, and took over an hour and a half for a single item of food to appear. With no apologies or reasons for the wait, or any update during the hour and half of wait time. Manager came in at the end and took of the last couple items to show up off our bill, but the damage is done. Almost 2 hours total to hang out at this place in the sun with terrible service pretty much guarantees we will never pick this place again for any team events or recommend to friends."}
{"text":"There's only one reason to be here, and that's the patio. The drinks are average, but the bartenders are pleasant and attentive, which is refreshing to see.

The sound system is subpar, resulting in generally poor sound quality. The music is awful up until around midnight, at which point it turns into 90s hiphop which is the staple of the joint.

The food is surprisingly good. It's not great, but for pub food, it definitely holds it own. Still, the menu is tiny, and the sweet potato fries are not worth munching on.

The smoker bother me a lot, as the walls around the patio don't allow for much airflow. Still, it's a decent place to hangout with your friends."}
{"text":"I don't like loud bars. Adelaide Street Pub is a loud bar. 

The music was so loud, the waitress misheard my order and served me a pint of Molson instead of the Mill Street I asked for. At first I thought they just ran out of Mill St. glasses but the skunky aftertaste of Molson was unmistakeable.

It was so loud I had to yell my observations about the well-endowed servers to my table mates; comments I would normally keep to a low whisper. If you like boobs, you'll love this place. The sweet waitresses wear skimpy tank tops to show off their spectacular chesticles. Even if you don't intend to look, you can't help but follow them around the room like a pair of bouncy beach balls bobbing along the water.

The \"sexy pizza\" and fries were pretty good. The antipasto platter was abysmal. The ingredients seemed to have come from a college dorm fridge: questionable salami, limp pitted olives, hummus jacked up on garlic steroids. I didn't dare touch the shrimp.

This bar is probably among the least offensive for the area but I can't in good conscience say it's A-OK. The only reason I'd go back would be to show someone what a really good boob job looks like."}
{"text":"I've been to Adelaide St. Pub twice and I have to admit there are some highs and some lows. My perspective of the joint is based on after-work drinks/dinner on the 2nd-floor rooftop patio.

First of all, it's Adelaide *Street* Pub, not Adelaide *Saint* Pub, however the idea of a Saint Pub excites me more than it should.

The highs:
-- Very comfortable patio with a mix of sun and shade, which is great when your group ranges from \"Lightbulbs give me a burn\" to \"sunlight makes me stronger!\"
-- The food is pretty good. I had the jerk wings and enjoyed the Jamaican flavour

The lows:
-- We tried to reserve one of their lounge areas and they said there was a minimum $1,000 tab. I saw some of the groups enjoying the VIP zones and there's no way they were reaching $1,000.
-- Along the same lines the waitresses can be quite bitchy. I don't really blame them, though, I blame the fact that there aren't enough bartenders or servers working the Friday evening crowd. Although the server we had last time lied about her system not being able to split the bill, but later split out a few people who were leaving early. I think she was just too lazy/busy to keep track.

Overall it's a decent place to get a pint or mixed drink while enjoying some rays, but there are many other options in the city that I prefer. I doubt I'll be returning too often."}
{"text":"Was walking around looking for a place to sit and relax and this place had a sign outside that their rooftop patio open, so we figured we'd go here. We paid the cover, went in, went through to the back, rounded the corner to the stairs...and IT WAS CLOSED. Wasn't very impressed with that. Bartender was taking regular shots for himself and not really filling orders. DJ wasn't great. Nothing special here."}
{"text":"Atmosphere and ambiance were great!! Everyone (servers/patrons) were relaxed, friendly, 

I had one of the pizzas (might have been the Yorkville) it was a little on the rich side, I'm thinking too much of the truffle oil, but it was still enjoyable. 

Definitely a great place to for a few drinks, and can't wait for the weather to warm up a bit more to take advantage of the patio."}
{"text":"I went here for my birthday on a friday night and the food was absolutely awesome! I have a the jerked chicken which wasn't spicy but still delicious! It's super crispy on the outside and juicy/tender inside. My friend that the braised short ribs and they are melt in your mouth delicious, pizzas are also damn good. Service was pretty slow but all the beer on tap passes the time nicely! Great atmosphere, music, and beautifully designed inside. I will definitely go back just keep the groups small because it's not a big place."}
{"text":"I always enjoy a visit to the Adelaide Street Pub. Love that it is it's own experience and not part of some big chain. Always find the staff very friendly and unpretentious. The menu is small but I like the focus and the pizza is fantastic (I dare you to eat just one). The decor is warm and the roof top patio is a little oasis in the city. Definitely worth a visit."}
{"text":"I was late getting into town so I walked across the street from the Hilton Garden Inn to Adelaide Street Pub.  It's a tiny pub, so it seemed like it was pretty crowded, however, I didn't have any trouble finding a seat.

The bartender, Chris, was extremely friendly.  He asked my name and remembered it the whole time.  That type of service, though a simple thing to do, is very often taken for granted.  This simple act made me feel very welcomed.  Overall, that atmosphere was exactly what I was looking for.

I ordered the burger and it was terrific.  Great flavor and very juicy.  The fries were very oily, so I probably won't order those next time.

If you're in the area, this is well worth a visit.  I know I'll go again, probably tomorrow night."}
{"text":"I am so happy that this bar is so close to my work! The menu is a bit limited but what is on there is terrific. (I had the Yorkville Pizza... a blonde delicious veggie pizza) We sat on the roof top patio which is going to be to brilliant in the summer. It's a little bit of isolation within a big city.

They take reservations too which is gold. It will become key in the summer months when people find this hidden gem. 

One thing of note, the bartenders / waitresses are fabulous. Even when one of the bartender's was done his shift and relaxing, he still made a point of asking us how our food / drinks were.  

This place should definitely be on everyone's radar. It's a location that transformed from shabby to chic."}
{"text":"If Revenue Canada comes looking for me, tell them I'm on the rooftop.

I've been a few times for lunch and was really happy with the menu, the price, the service and, of course, the beer, so I decided to pop in with some friends after work yesterday for a few pints on the rooftop patio.

Maybe it was the cool breeze, but there was something arousing about that place. The style is really similar to that of Globe's rooftop, but the vibe is definitely more chill and the beer selection significantly better.

Be forewarned: it's not cheap. I dropped $7.40 on a 20'ish oz import pint and, because I checked my self-control at the door, I dropped another $7.40 on a delicious second. 

So, if you're in the core and looking for a cool place to quaff in the sun, get down with the ASP."}
{"text":"Awesome place, AWESOME owner, (Hi Cris, Kisses!!!) Love love love the patio etc... nothing wrong with this place at all..."}
{"text":"I'm not a typical pub goer.  I went here on a Monday night to visit friends and have some good food.  It was pretty deserted so we had the patio all to ourselves and they were really nice to bring us an umbrella cause it started spitting while we were there.  The food was AMAZING.  I am a big fan of poutine and had their poutine with pulled duck and cranberries.  It was the best poutine I've ever had!  Everyone else enjoyed their pizzas and drinks too.  As someone who doesn't live here, I thought it was great and am totally oblivious to the type of neighbourhood it's in."}
{"text":"A 2.5 star pub with a 3.5 star patio.

Surrounded by the excellent options in this part of the city, the kitchen has its work cut out for it. I have to say, the initial impressions were not great ones: my sweet potato fries were soggy and limp, and there was very little jerk to my jerk wings.

A 3-star experience CAN be crafted, though. Their burgers are compact little handmade numbers served on an English muffin (as was hip a few years ago) with smoked provolone. The herbed frites are much better than the sweet potato fries. What's more, beside their regrettable Coors light and Molson taps are Mill street (!) and Beau's (!!).

Then there's the patio. Inside seating is maybe 15 seats worth of bar seating, but stairs at the back of the pub take you up to a rooftop patio with great light and comfortable seating.

If you put the kitchen from the Harbord House or Grindhouse into this building, you'd have a 5-star joint. As it is, the menu is anemic and has some definite pitfalls. Still, on a warm day, a rooftop patio with a pint of beau's and one of the well-executed items on their menu makes this a perfectly acceptable choice.

Pro-tip: they have a \"burger+frites+domestic pint\" special that includes (rather inexplicably) the Mill St taps, but not the Beau's. We didn't get out a map to point to the patent domesticity of the Beau's brewery, but our server did agree to let us sneak it in for an extra buck."}
{"text":"Haven't eaten here so can't comment on the food but I gather it's upscale take on pub fare given the decor. The interior is indeed nice but kind of small. The drinks are a little expensive but it's a nice casual hangout if you happen to be in the area. Probably wouldn't make it a destination point."}
{"text":"I'm going to balance Renata's and Kat's reviews with a three star.

I normally avoid this part of the city like the plague on the weekend so that should provide you with a pair of glasses through which to read this. I was down here for a Kat appreciation event. Successful appreciation was accomplished.

One thing I liked about it here was the fact that despite the area it is in, this place did not become a shit-show (shitshow? shit show?) around 11. People were pretty relaxed. People were kind of pretty but not ostentatiously so. Silliness was kept to a minimum. This could not be said for the surrounding area. 

The main space on ground level is nice with a bunch of TVs and a wooden bar. A nice place to watch a game if you are looking for something in the area. The patio up top is a little cramped but has a nice view of the buildings and intersection below.

Food was fine. Good pub fair but I can only admit to trying the cheese and meat (antipasto?) platter and the sweet potato frities. Beer selection was a little lacking: Keith's, Red Stripe, Creemore, Mill St. Organic. No cocktails were consumed although a good gin and tonic would have hit the spot up there.

Staff was super attentive, sweet, and quick.

Finally, also in reference to Kat and Renata, the music was not that bad. I didn't feel like they were playing all of my favorite songs but I also didn't feel like I was being forced to listen to \"Sweet Caroline\" repeatedly. For some reason, they were playing a bunch of Sade and, what can I say, I don't mind a little Sweetest Taboo to start my weekend on a warm Friday evening."}
{"text":"I'm not a fan of this type of... public. Sometimes I have fun just analyzing the orange people (you know, fake tan?)  with dyed blonde hair and wearing giant sunglasses even indoors and looooots of hair mousse. I had some fun yesterday doing this. 

The food is good, but not as well served as one would expect from a pub. They didn't have assorted greens for my salad and offered spinach. HOW IS IT POSSIBLE. But ok, I can live with spinach. Prices are not  great also. I've had better Caesars, and better music (OMG THE MUSIC WAS SOOOO AWFUL)

I can actually have fun on places like this, what I dislike is to spend a lot of money and have so-so service, small servings, not-so-good drinks. I don't plan to come back."}
{"text":"A very modern bar with a limited but modern menu.  The menu being so small, running out of steak seemed unforegiveable and in the mood for dead cow, I went for a burger.  The Adelaide burger was superb, a description I wouldn't normally use about a burger, it came in an English muffin and I asked the staff if they had mayonaise.  What they had, was chipotle mayonaise (woohoo!) which they brought in a little ramikin.  It turned what was an OK burger experience into  a superb one.  If you order the Adelaide burger ask for some of this stuff, it works wonders.  I also seem to remember the fries as good too.  I only mention it because I find the chips in Toronto very depressing, they are such simple things to do right and it is so rarely achieved here.  Still feeling peckish I had the Panko Calamari, they had spent far too long in the frier, were a little oily and could have been far more plentiful, but for all that they tasted spicy and quite pleasant.  I washed these down with an organic beer from Beaus, which was nice.  

This is a great place to spend an evening and quite different from the run of the mill places that surround it.  If you haven't been, you should definitely give it a go, if you've been there already, go again."}
{"text":"We didn't have a whole lot of time before last call so when the cabby dropped us off, we darted in here because it didn't look too crowded or have a huge line running out the door.  I would have plopped down at the (practically empty) bar but the girls found stairs to the outside deck which was perfect.  

Drinks were served up pretty fast though it seemed like they had a limited selection of call liquor.  I recall liking the music and enjoying sitting outside without having to wear a parka, gloves and a hat.  Summer evenings in Toronto are charming made even more so by a fight that broke out on the street corner right outside this bar.  The cops arrived on bikes and horses ... which well, isn't something I see everyday."}
{"text":"A local pub that is better focused on the hip entertainment district clientele and locals. The space is intimate and modern, the food more upscale and interesting than the nearby Firkins, Foxes, Hooters, and As(tor)s's. The kitchen is practically part of the bar.

They're also open for weekday lunches and weekend brunch."}
{"text":"*** CLOSED ***
The place was just torn down to make way for condos.

I am going to miss this place."}
{"text":"Surprisingly decent for the Douche District! 

Hated the crowd (except for the people I came with, naturally) and the music was even worse, but the food options were great (a selection of pizzas, sandwiches, killer herbed frites - skip the sweet potato fries - and shared plates) and the rooftop patio with full view of friendly, beautiful, buxom servers was the icing on the cake."}
