{"text":"Honestly, the best Afghan food I ever had. I never knew what Bolini was until I tried all three kinds, pumpkin, leek and potato. OMG soooo good! The owner made salmon for me specially and it was amazing. You may have to wait a little while but trust me it is truly worth the wait. Such huge portions and such flavor, I am totally a fan. Please check it out they are open till 9 pm."}
{"text":"I found this place coincidentally and it's a hidden gem. They have really great food. Never tried authentic afghani food before..always had either kabob or kabuli polao. But this place have impressed me enough. Their mantoo is the best mantoo I've ever had! People are very friendly. And a great place for take out."}
{"text":"My mom has been recommending this restaurant to me for a long time now and I have been putting it off because I associate Afghan food with being extremely heavy.  But I have been proven wrong! the food was delicious, the service was great. Even though we went late at night, the family run restaurant had an extremely welcoming environment. everything we ordered was fresh. I definitely recommend trying out this place!"}
{"text":"Ohhh God. I don't know?where to start. First of all there customer service is awesome. The moment you walk in there is a lovely smile on servers face. Then your order is taken with such good manners. Then you get to enjoy a meal made at home. Fresh crisp hot and unforgettable experience. Definitely recommend it. And a bonus is that this place is all halal. 100 percent"}
{"text":"I have never had afghani food before and tried this place when I was at an indian grocer nearby. Looks like a family run operation. I ordered a beef bolani and some kebab and kabli rice. The bolani tasted excellent and so did the rice and kebab. Orders usually take some time, however, the food makes up for it. Good food and very friendly family owned place."}
{"text":"I found Afghani Kitchen out of good luck I have to say, I was driving down on Dundas St. and I just spotted the sign, as I am a sucker for Kabobs so I was like I am going to stop by sometime So yesterday, I did end up stopping for a quick bite, and I was very pleasantly surprised, I ordered Beef Tikka Kabob over rice $ 9.99, the owner recommended a lesser amount item on the menu, and it was called Qabli Rice for $5.99 with a drink (daily special) It was a meat and rice dish, the rice was slowly cooked in the beef broth from the meat (beef) with carrots and raisins (you could call it Afghani style Biriyani I guess)  I love that style it adds so much flavor to the dish. It was just an amazing and a simple dish done right (not dry)   I also order the Bolani, $4.99, Flat bread stuffed with potatoes and herb, again was absolutely amazing. (4pcs)   It is a hole in the wall kind of restaurant, very simple with very little seating, I saw some bar stools, but I think it is mostly a take out place but it is so Worth It.  Overall:  The customer service was great, (polite, prompt and helpful)  The food was amazing for my taste, and I am told that I am a very picky eater   The price was exceptionally reasonable for the quality and the quaintly of food they serve here It is located in a strip plaza and has parking The location is kind of hidden, so look it up first before you head down  I will definitely return to this place.    P.S. The kitchen is CLEAN!!!"}
{"text":"amazing restaurant with delicious Kabli rice and beef."}
{"text":"This place is one of the hidden gems of Mississauga-- it is honestly perfection despite its hole-in-the-wall appearance. Prices are extremely reasonable, the food is always fresh and delicious (I literally see the owners making fresh rice in front of me), and the staff are so friendly it's adorable.  I love their bolanee, mantoo, chicken skewers, and their rice dishes. I've tried their kofta and that is delicious as well, but there's nothing better than their hot sauce, chicken and rice together for dinner. I just tried their pizza today, as well, and it is LEAGUES better than any major chain's work.   I really love this place and the people are so nice, so it's always a pleasure to stop in. The food is honestly amazing, so much more flavourful than other similar places (and so much cheaper!)-- they really do deserve your business."}
