{"text":"Food is awful. Fish tacos are so soggy and the fish was really cranned tasting.

The actual restaurant is is nice, bar is good."}
{"text":"Very spacious place with a beautiful decor. Nice selection of beers. Cocktails are good (if a bit pricey). If you enjoy watching sports on TV in a place that serves something else than nachos and wings, this is a spot to consider. A few members of the waiting staff could not tell the difference between east coast and west coast oysters, but on the plus side the fish tacos and nazi goreng are very tasty. We like the place."}
{"text":"Excellent!  Went there yesterday with my family and friends for a thanksgiving dinner.  Excellent food and service. The only reason for four stars and not five it because our potatoes were cold when served, but otherwise great everything including atmosphere. 
Definitely going back there soon."}
{"text":"It's a little disappointibg with a name like 'against the grain' food's not that great! We had over priced Fish n Chips which was not impressive nor tasty. Good they do serve some local beer. Service was friendly. But it needs more love on food and re-adjust price. There are other places around the same area with much better deals with yummy food."}
{"text":"Really liked this place. Second time here. Decent selection of beer an good service. Food was very good. Definitely above average for a pub/sports bar style restaurant. Had the vegetarian burger and it was fresh made and excellent. It's a family friendly place so that may not appeal to everyone."}
{"text":"I thought it was ok. The service at the front entrance could be a lot better. My husband and I put our names on the waiting list for a seat on the patio and then decided to grab a drink by the bar. For over an hour, we waited for a table and no one called on us. After a while, we decided to ask about our table - apparently the hostess skipped over our name and started seating other people. We complained to management and no one came out to even apologize!

The bartender who served us was great - service by the hostess/ reception need to be greatly improved!

I don't think I would go back - this is the second time that Against The Grain has overlooked us as customers and I would prefer to go to another restaurant where I know that eventually I will get seated!"}
{"text":"This place has great food and is a great location, however I have never been treated so poorly in a restaurant/bar in my entire life. I waited for about 25 minutes to be served by a bartender up on the second level, while everyone around me was being served. Finally a stranger who arrived and was served only seconds prior suggested to the bartender that he serve me first, and his response was \"absolutely not\". I had not said a word the entire time I was there nor done anything, and have never been made to feel so embarrassed in a public place. I don't mean to call anyone out, but to the bald, short bartender in the newsboy cap, I have never felt so uncomfortable and so offended for absolutely zero reason in my entire life. I'm not sure what power you think you have back there behind your small bar, but to belittle people for again, doing nothing to you, makes me seriously question how you have a job and how this great restaurant employs you and gives byou any sense of control. Me, and the people around me tonight were incredibly put off and will not return."}
{"text":"Pretty weak place. A kind of generic cookie cutter spot. Our server was kind enough at the bar, but the food was pretty bad. The burger was clearly a frozen patty. Bun wasn't good at all. The half club sandwich had two miniscule and pitifully small slices (wedges? mini triangles?) of ham and it was pretty pathetic to call that a sandwich. Salad side came doused in far too much dressing. Won't be coming back. Ever, and already steered local friends away from this place. Adamson BBQ around the corner, or Olde Yorke fish and chips across the street are far better options. Don't waste money here."}
{"text":"First time I came was when they first opened -horrible service and food was meh. Kinda expected this so came a second time -horribly slow service and food was meh. It was a busy afternoon so decided to give them a 3rd try one evening. There were only Three tables at the upstairs patio and had the worst service EVER! Waiting staff were hanging out at the bar chatting with the bartenders. Decided to get the bill and head over to Joey's. NEVER AGAIN!"}
{"text":"Good for Sunday brunch, food portion is smaller but quality isn't so bad. Their second floor patio is the place to go, well, in the summer... $4 Mimosa is great for a breezy sunny weekend brunch on that patio."}
{"text":"I really wanted to like this place, and in a way I still do. 

Pros: nice big space, takes resos for brunch on the weekend and is a good place for groups. Also friendly staff.

Cons: I was there with a group on Saturday around noon and while the place wasn't super busy, our order (for 5 people) took forever (close to an hour). And none of us ordered anything unique or off-menu. I had the huevos rancheros, which was forgettable. Others at my table had eggs bennie and similar type breakfast fare, which were apparently nothing to write home about either.

Maybe it was a one-off, who knows but I'm not itching to go back by any means."}
{"text":"4 stars for the beer, including a fine selection of Mill Street's best. Nice ambience and great terrace in an area with very few options.  But man, the food needs work.  A casual place like this doesn't really need to deliver gourmet fare but most of these items are barely edible with the exception of the flatbreads which are actually pretty good - especially the mushroom one.  Hoist a couple, have a slice and you'll be happy."}
{"text":"Went for dinner with several friends. We were the only people upstairs for duration (7:15 to 9:15) - surprising for a Saturday evening. Downstairs was prob ~ 50 to 60 % full.  

Overall a mixed experience:

Barkeep (upstairs (Seamus)) was warm and friendly. Made a minor error on drink order, he made good right away.

One food order error - steak explicitly asked to be cooked 'medium', clarified that was pink but no blood. Steak arrived well done. Seamus offered to make it right, but after an hour at the table, wasn't worth the wait. Steak was good despite the overcooking.  Other food was OK - not remarkable by any stretch. 

Service was generally slow (Seamus was an exception), food somewhat overpriced for what it was. Portions were reasonable, but a pricey for the food served. 

Will try them again in the summer to see how their patio is, and will be interesting to see if the kitchen comes up to expectations.

It is located in an affluent neighbourhood where people should (but maybe don't) understand and appreciate good food. If nothing else changes about the restaurant, it may survive due to the locals. 

The neighbourhood needs one or more places like this is attempting to be, but , they have to deliver on the good food. 

Urban tavern, maybe, but that calls for Tavern prices. I sense an intention to be upscale, and wish them luck getting there. 

1.5 Stars"}
{"text":"Good food, good service--we were in for brunch and our meals came promptly and our waitress was attentive without being overwhelming.  The food was good but not amazing, and the portions were large enough that I actually packed up some of my brunch to eat later.  If you're in the area, it's a safe place for a good meal."}
{"text":"A little over priced for what you get.  Good food and reliable, friendly service.  The restaurant is beautiful and the set up is great (especially the upstairs patio).  A great place to gather with a large group for drinks and a bite.  Although there is a children's menu, it is not an ideal family restaurant because the bill is too large at the end."}
{"text":"This place is so pretty, indoors and outside. We sat on the patio for lunch on a Saturday. There are lots of seats out there. My boyfriend had the crispy chicken sandwich and said it was probably one of the best chicken sandwiches he has ever had. I had the mushroom flatbread which was just the way I liked it - thin and crispy. There were several bees buzzing around our table, but the flowers were gorgeous."}
{"text":"Went for the second one last night with a friend.  The service was incredibly slow from the kitchen.  Our server was attentive but stuck with the kitchen flow.  AC dripped on me from the ceiling, server was responsive when I flagged the issue but management said it was because AC was running fully force, nothing was wrong and anyway the water dripping was clean.  Will think twice about going back."}
{"text":"I ordered the turkey club, which was pretty good. I really liked the sauce (I think it was like a raspberry mayonnaise if I recall). The flatbread was also very good.

But I got food poisoning, and according to the reviews I read, so did a few others!"}
{"text":"I came for a quick lunch yesterday and asked if I could be seated outside since the weather was great. The server notified me that it was still a little wet due to the rain from earlier, but I was fine with it as long as it wasnt terribly wet on the chair. She brought me out and at first I was a little skeptical because I was seat in a little corner with no view to the inside and worried if I will be forgotten, however, the server was great at checking up on me every once in a while.

I ordered the personal pizza from the light lunch section, and man was it literal. When the plate came, I was shocked. There was barely any sauce on the pizza. I understand what a thin pizza should be like, but this was so thin it was actually see through. The crust was about an inch and a half thick...I kid you not. I tried to comfort myself by thinking maybe this would be better than it looks, so I took a bite and yup. Taste like dough. What's worst is, this little piece of lazy pizza costed me $10! Ended up having to go to Tim Hortons right after to get a bagel.

Definitely would NOT come back."}
{"text":"We went here as a party of 4 for a late lunch to celebrate my daughter's final Business Management exam as we'd been here before and enjoyed great food /service. The Hostess was a downer to our party by seating us at a table covered in wet rings from previous customers' beer mugs (I assume). Understandable error as it was mid-afternoon and brighter outside than inside, but when asked twice to wipe the table, she snapped at me and proceeded to shove menus at us. Although she apologized when returning with a rag, it did cause conflicting opinions within our group and dampened some spirits. The actual server, however, made up for it in leaps and bounds! She was amazing by picking up on little details of our celebration and joining in, encouraging our fun. The food itself was great as usual, although the club sandwich alone would bring us back weekly if only they used real roast turkey instead of processed slices. The gravy was to-die-for, and we are gourmets!"}
{"text":"The service was poor (they didn't check on us once during the meal) and the food is pretty mediocre considering the price. About diner quality. I won't be going back."}
{"text":"Great selection of beers. As a beer guy, this place has a lot of variety which I like. There is a nice rooftop patio, perfect for warm summer nights. They have outdoor couches and patio furniture where you can sit and enjoy a beer. I would recommend coming for a few drinks on a summer night and sitting in the patio. 

On the food side, it is not very good. All of the menu items sound great, but they do not taste as good as they sound. I have ordered many different items and have always been unimpressed with the taste of the food. 

Good place for drinks, not so much for food."}
{"text":"Second time back and I am very pleased! New menu looks great and am excited to journey through the world with there wide variety. From a Bulgogi Burger to a Pulled Pork Poutine. Don't forget their Entrees or Pizza!"}
{"text":"The wings looked good, but I didn't order the wings. I ordered the pulled pork tacos, and the French onion soup. Just to warn you, when they say shareables, it means there are two tacos which I thought was pricey for $11. 

I wasn't really impressed by this restaurant but the Leaside area is missing a continental cuisine establishment. I was hoping for pasta, but none on the menu. Oh well, restaurant by attrition; will probably go back when I forget my disappointment, although that's why I write reviews so I remember if I like the restaurant or not."}
{"text":"I was very eager to see this restaurant open up. Leaside lacks a decent pub - the only downside this neighbourhood has for me.

I've tried twice to go here. Both times I went alone and was told there would be a 25-minute wait in a way that made me feel less than welcome by the hostess. I would have been very happy at the bar, but the way in which I was told no made me not want to ask.

Also, this is going to be of use to few, the menu offers very few options for vegetarians. The only veggie-friendly main courses are a mushroom and flax burger or a pasta with vegetables. Sucks if you hate mushrooms and I don't opt for a tavern or pub to eat pasta...

Perhaps one day Leaside will get a fun and good pub like the Rebel House (even with its draconic seating policy) or the Caledonian. Not yet, though. Not yet.

I'm not fond of writing negative reviews because I realise that many people have worked very hard to open this restaurant, but there you have it. It's how I feel."}
{"text":"To sum up my experience here: Mediocre food with mediocre service.

Our server messed up our drink orders a few times and finally brought us water after our meals actually came even though I asked for it when we were seated. She even gave my pregnant friend an alcoholic mojito when we asked for a virgin mojito. Then she blames it on the bar - Apparently the bartender was in training. 

I ordered veal chops with gai lan and potatoes, without the option of how I would like my steak cooked.. So my veal chops came out over cooked with no sign of pinkness.. I really would've preferred medium rare. 

She also ordered the wrong burger for my friend so we ended up having to wait another 15 minutes before she got her food. 

So maybe it was our luck with the server but the food did not impress either. Would I come back? Most certainly not."}
{"text":"Excellent beer and just ok food.  I would happily go back because I love a good beer list, but I am not terribly enthusiastic about the food.

I thought the service was fine. I think the outfits they make the girls wear are kind of ridiculous.  I am happy enough with anyone who brings me a beer, I don't need them to do it in a miniskirt."}
{"text":"I've had a couple great meals here, such as the house burger and the club sandwich. The house smoked bacon and turkey are delicious. Unfortunately the menu is diluted by a few huge misses. The veggie burger is slimy, tasteless and not appetizing at all. My wife couldn't finish it. The Kale salad is also a huge disappointment. $13 for a handful of kale, a few slices of grapefruit and to top it off, canned Parmesan cheese. For 13 bucks you'd expect shavings of Parmigiano-Reggiano (like in the photo upload) at the very least to spruce up that stingy dish. On the plus side, the staff is great and the beer selection is fantastic. If they fix a couple of mistakes on the menu, it'd be pretty darn good."}
{"text":"They currently have a great 3 course menu for $15 for winterlicious! I had the a great salad and pasta but the dessert wasn't amazing."}
{"text":"My wife and I thought we would give this establishment a try because they have two beautiful outdoor patios. We asked to be seated in the patio area. Within minutes of getting out drinks there were three or four wasps flying around us and them. It got so bad that we moved inside. 

Once inside the wasp problem was gone but now we had to deal with two other flying bugs zinging around us. The roof was leaking and dripping and splashing on us. Food was less than horrible. My wife ordered the pull pork nachos and it was dryer than dust. I had the club sandwich with their in house bacon which made the roof of my mouth nasty all night. Either one of us finished our meals. I've been to the Against the Grain on the lakeshore a few times and every time it has been amazing, sorry this one is not equal. It's to bad because its right in my neighbourhood."}
{"text":"Yay food poisoning!  I came in for a view of the lake, a few drinks and some food with family while being in the area. When staff greeted us to take our table number, they informed us of a 30 minute wait and that they prefer we waited at a packed bar while the inside restaurant was empty. When we inquired about taking a seat inside and being moved out when a table became available,  the hostess repeated that she preferred we stand at the bar and proceeded to whisper to her otherwise blank faced mute co-worker. Fine, no prob...bar it was. The wait time was quick  and the patio was lovely and lively at sunset. The wait staff though attentive, could have been friendlier and could have known the contents of the menu better. Menu questions were often answered by handing us a menu and walking away while no suggestions were given. Reviews about this place are mixed so it seems that it's hit or miss. The hardest part about the night were the muscles. I just finished puking them up. After receiving a heaping and steaming late of muscles I brought the odd odor to the attention of the waitress. 

There was an odd fishy barn yard smell to the muscles. They offered to bring a fresh plate out and they were cold and smelled the same.  Not entirely sure that what I recieved was actually a fresh plate because now Im writing this review from my bed after puking my guts out for the last 15 minutes. 

The kitchens I've worked in would never have allowed food to go out smelling that way. Stupid of me to trust that the meal was safe...but you tend to trust establishments that have been in a spot for a while and who's wait staff offer to help fix the issue. 

Needles to say I won't be returning to this restaurant and I urge you to consider other spots too. Where the food prep is safer."}
{"text":"Very very average. Great decor, nice patio but the food sucks. 

Got the fish tacos and they were awful. Especially for $5 a pop. Service was lacklustre and I definitely won't return. 

Great patio for the summer but seriously, if the food sucks, why would you come?"}
{"text":"Definitely worth going to even though it's a bit on the pricey side. They support local farmers and everything is really fresh.

My first time there I ordered the Lamb burger with sweet potato fries. The first lamb burger had lettuce that wasn't washed properly (there was still a bit of dirt left on it). I told the waiter and she immediately took it back and gave me a new plate that had even more sweet potato fries (great service!). The lamb meat was filled with yummy cheese and the lamb itself was moist and flavourful. The bun was made to PERFECTION. I have never seen such a perfectly made bun before. 

They have daily specials you should look in to before heading there because the only work at certain times. The design of the place is really neat too. My first experience there was great. I'm going there again for a friend's birthday this week (and will be trying out the Cornish hen) and will be observing how their service is with a large group."}
{"text":"I would like to write a review about the food but the staff never seated us at a table. We went on a Wednesday evening and the restaurant didn't appear busy. One couple was ahead of us and had been waiting to be seated for a while. 2 staff members walked by us and ignored us. The maître d sat the couple, and ignored us. Waited for another 2 minutes, still on ignore, then left. Brutal."}
{"text":"Good food. Menu has something for everyone. 
Hostess was lovely and friendly. She was accommodating to move us to outside on a nice evening. 
We are a picky group (of 10) and the servers were helpful with substitutions. 
All the food was brought out in a timely manner and everything was correct. 
Amazing rooftop patio and vast beer selection. 
A really great find!"}
{"text":"Ordered the tuna tartar. It's presented deconstructed. It was bland at best and horribly under seasoned. Waiter did not check to see if everything was alright and did not ask if we enjoyed our food at the end. The view is nice but not wow! But the beer was on special."}
{"text":"This place has a great layout inside. Very chique and modern. Good variety of drinks and beers on tap. Food is good here however it can be expensive so I tend to stick to  apps when I go here. Has one of the best waterfront patios in my book!"}
{"text":"Went with the family,  all of us like the decor and atmosphere. My mom ordered the Winterlicous menu which was fair and good...  I ordered the eggs Benedict without the pork, it was OK.  Great helpful staff,  my family wants to go back.   The only reason I am giving it 4 stars it took the food a bit longer the expected."}
{"text":"This is a really classy place, but on the pricy side.

Their patio is hard to beat.. .or should I say... PATIOS. One on the second floor and a one on the main floor. 

Service is extremely friendly. We had the wings and the fish tacos. Both were fine, but not impressive, especially considering the price. We might be back if we were in the area, but probably only for drinks. GREAT selection of beers."}
{"text":"Had the spaghetti carbonara today.  Flavour was good, very nice dish, but portion was a bit small for dinner.   Would have been nice if it came with some bread.  People at my table who ordered fish tacos were impressed by them.

Food came out a bit slow, but worth the wait."}
{"text":"Great patio! Good service too. Came here with a big group and everything went smoothly.

I ordered the veggie burger with half salad half fries as the side. Veggie burger wasn't good at all - there was too much bun and it was a bit dry, and the veggie patty itself was kind of bland. I ended up removing the top bun part and cutting up the pickle to eat on top of the half-burger. That gave it a bit more flavour.

However, the sides are a totally different story. The caesar salad was amazing. Fresh, with parmesan shavings and pork bits. Fries were really tasty too."}
{"text":"I got the Wild Mushroom Pizza as my main. It's not often that I go for the vegetarian choice of a meal but I think I should do it more often to vary things up and include more veggies in my diet this way. The Wild Mushroom Pizza was a lot bigger than I had anticipated with its round shape covering the entire plate.

I really liked its thin crust and it tasted light for a pizza with lots of roasted mushrooms on it. The mozzarella was perfectly cheesy too."}
{"text":"Patio and atmosphere is amazing. Ordered nachos, fish tacos, and Asian calamari. Nachos were ok not the city's best. Most of the toppings were in top with empty chips below, good serving of avocado, not guacamole at all. Hated the red nacho chips. Why the exist is beyond me. Fish tacos were ok, lack flavor and some zing like other places. Calamari was a mistake never to be ordered again. Very processed looked like fried so not even real. We ate it, but weren't impressed. The overall experience might have gone better if our waitress didn't have such an attitude . When you ask, what is the best dessert in your opinion, you don't expect \"I don't eat dessert so I couldn't tell you\". So we decided to order the ice cream sandwich and then questioned, \"chocolate?\". One if us asked what other flavours, and get a puzzled look back from the waitress, like what else \"vanilla\". So yeah service and food is was not worth a return visit. Sorry ATG other pubs in Leaside are better."}
{"text":"Visited Sat April 8 - Private party for 40 people. 
This place deserves a much higher rating! 

The service is amazing! Our server Aaron and bartender Shane were amazing as well as Alison the events coordinator. We booked the space 1 month in advance and Alison was able to accommodate everything we wanted. Projector and screen? No problem! Custom room setup? No problem! AV check? No problem! I've planned events for years and she is a true professional. Responds in a timely and detailed manner to emails. 

Pros
2nd floor can fit 70 people, perfect for large parties! They have had many weddings and corporate events here.  
Wifi - As expected, you have to ask the server for the password. 
Fish and chips - Beautifully presented and crispy. 
Tavern burger - Fresh and delicious!
To reserve the private space you put down a deposit, which may vary based on the size of the group. Ours was a $200 min spend.  

Cons
There is a cake cutting charge, this is a somewhat sticky issue. I personally feel that restaurants should provide plates and cutlery for birthday cakes, it's a small expense to keep birthday parties happy. It takes 5 min to cut up any cake and some water to wash the dishes. When you try and charge $2 per person it looks cheap. For a party of 40 it would cost $80 to cut a cake!
Menu is a bit limited with 20 to 30 items, check the daily specials.
Location is a bit out of the way, not TTC subway accessible. 

Protip - Upstairs patio opens in May."}
{"text":"I went here for lunch and it was pretty good. I got the beet salad and it was just too....beety. I love beets but maybe not a whole bowl of it. Thought it would have been nice to mix it up a little!

The location is great and the patio/beer list is impressive! I think next time I go here it'll be for drinks!"}
{"text":"It was ok, but really not blown away by service/restaurant experience. I would give 2 stars, but I do think the food was prepared well and presented beautifully so I'll give an extra star for the food alone. 

As a restaurant chain focused on guest service (nowadays, who isn't?) I expected a lot more from ATG Leaside - I've been once before and service and atmosphere was fantastic, but this time I was underwhelmed. 

Our server seemed to just be there to \"do his job\" and follow very basic training - as in being there to greet us within the first couple minutes of arrival, getting us to try a sample first before committing to a beer, but then showed no attention to when our guests showed up 5 minutes later - did not come over to greet them, or even to take our actual drink order, for 10 minutes. I had to flag him down - I just wanted to have a beer! I also had to flag him down again to get a food order in because we were starving. We did come in around 8pm, so I understand that it's not typically \"dinner\" time, but if he got to know us and ask us questions about why we were there (as a good server should do) he would have known we were there for dinner, actually to celebrate my birthday, which I would expect such a customer-driven environment to be attentive and aware about. 

In terms of the restaurant itself, I think the beer list was poorly displayed on the ground floor at least (which is where we were) unless I missed a chalkboard, but it seemed there were only 2 chalkboards to the right of the bar that had the draught list - sitting on the other side, you had to get up to see what was on tap - I could only see one chalkboard of the two. I understand the rotating taps change too often to put in a menu every time, but some more signage (or again, a more attentive server) would solve this issue. 

Honestly, in an industry that is so cut throat to attract and maintain a customer base, I am disappointed with what ATG brought to the plate. There are so, so many restaurants in Toronto - with all the competition, I'd think ATG would be on top of their game with fantastic service, restaurant atmosphere, and comparable prices. Although the food was good, it was a little on the pricey side of the spectrum. I don't think that we would go here again, especially over Local up the street which has the same vibe but a much better atmosphere and service level."}
{"text":"I liked this place! I had the brisket and it was yummy. Good beer selection, nice ambience, service was meh."}
{"text":"Went in for lunch with no expectations, but was glad that I decided to dine here. This location is the second Against the Grain in the city in the new Leaside Village complex. The philosophy is to use local ingredients in their recipes - not a really original concept these days, but it's still great to see restaurants supporting our community.

As mentioned by other Yelp'ers, their patios are great when meeting up with friends during the summer months. The décor inside is really nice as well. Everything looks, well, n e w ! It's a very casual atmosphere with what seems to be locals coming in for lunch. Pricing is a little expensive so I wouldn't recommend coming here everyday; however, there are also daily specials, which might be friendly to the wallet.

I had the following for lunch:
- Kale and Citrus Salad + Shrimp Add-on (very light and great for a humid day)
- Gluten Free PB Brownie Cheesecake (I have gluten tolerance, but love PB so decided to order it; I would recommend that you share it like I did as it is so H E A V Y)

The drink menu is very extensive; I was very impressed with all the beers they had on tap! 

The only downside (and this could be due to the staff being new) was the service; our server was quite slow, but besides that, I'm a fan of this place.

Good for: drinks, lunch, dinner, casual dining, patio"}
{"text":"2nd time here, and this time, it's for Winterlicious Lunch!

So this review is strictly about the Winterlicious Menu...

Came here today at 11:45AM, just in time before busy lunch hours. Place is spacious, clean, and nice as always..

For $18, here's what I picked from the Winterlicious menu:
Appetizer: Tequila & Roasted Chicken Soup - was disappointed at the lack of chicken in the soup. Too salty for my taste. Wasn't so good. Tip: Don't get this. Get the tater tots or chicken tacos instead.

Main course: Cast-Iron Meatballs - this one's a good choice, as I find the meatballs are big and very tasty. Quite filling. But it felt like I am missing some pasta or something. I guess I'm not used to just eating meatballs only.. Could've been nice if it came with something else.

Dessert: Angel Food Cake - funny how it might be the best choice I've made in the menu, which is messed up, as it is the dessert, but I love the Angel Food Cake, it's rich, and fresh. Just perfect!


Review 11 of 100"}
{"text":"Came here for dinner with a group of 10. Decent food and pretty good service. We were asked to relocate to the bar area when we were finished eating, which was a bit eyebrow raising."}
{"text":"I came here on a weekday evening, expecting a nice meal but was pleasantly surprised by the range on the menu and the atmosphere. 

They had a special summer menu, and we ordered the peach soup off of that. The peach soup was a bit too sweet for my liking as it was an appetizer though it was very unique. It was topped with some roasted peaches which was novel. We also ordered the fish tacos as an appetizer, and they were flavorful, with a mix of fruity - from mango and pineapple - and savoury and spicy. 

For mains, we ordered the tagliatelle and the Nicoise salad. The salad was presented very delicately, with a range of ingredients. I particularly enjoyed the beets, which had been pickled with some sort of vinegar base. The boiled egg was a bit hard for my liking. The tagliatelle was served with pancetta, cheese, tomatoes, asparagus, and a poached egg. The serving looked quite large at first but once I started eating, I realized that it was quite generous. I got
some of it to go. I thought the tagliatelle was seasoned delicately and not too salty, though it was a little bit on the oily side. 

We ended off the meal with the raspberry bread pudding, which was delicious. It was bathed in caramel sauce and topped with vanilla ice cream. It was crisp and buttery around the edges and soft on the inside, and warm throughout. 

The restaurant wasn't too loud, and the atmosphere was relaxing. The staff were very helpful, friendly and courteous, and the manager checked in with us during the meal. Although this meal errs on the expensive, it was definitely worth the food and the experience. I look forward to returning to try out some of the other items on their menu."}
{"text":"I really wanted to like it, as the setting is great, the service is friendly, and the selection of food and drinks is rather large. 

Unfortunately that is where the exciting part ends, as the food is rather mediocre. 

I had maple chipotle chicken wings and fish pie, with the wings being meh at best (not exactly sure how does chipotle come into the picture - seems like there was a bit of maple syrup based sauce and that's it). The fish pie looked great, but that's about it - it tasted like an overly hot chowder style soup. 

The only great part of the meal was the chocolate cupcake with salted caramel, mascarpone and berries. 

May return for a quick beer, when it gets warmer outside."}
{"text":"Love the food but not the service. Their flatbreads are awesome! It's close to my work place so that's a plus.. 

Only thing is that the waiter keep mixing up our orders and some people are not getting what they ordered.. Food is great though!"}
{"text":"Made a visit to ATG on a weekend with some friends and some babies.  A great place to take the family, as there is a kid's menu but also good options for the adults.

I wanted to try multiple menu items but decided on the turkey burger (with brie and bacon jam).  I could see the bacon jam and the cheese, but could not taste it.  Definitely a letdown.  The sweet potato fries were delicious, perfectly cooked.  The caesar salad was nothing special.  

My companions ate: the steak salad (it was small), the carbonara pasta (also quite small), the ribs (said to be delicious).  The kids' sliders were like a leather boot.  SO DRY.  And that comment is coming from someone who likes her meat well done!  The ice cream sandwiches were great.  

The service was just OK.  The waitress was all up in our shizz for the first 30 minutes and then disappeared towards the end.  

So, all in all, I may have just ordered wrong.  I will give this place another chance.  There is free parking and some interesting things on the menu.  A-OK indeed."}
{"text":"I was recently invited to a private party at this location of Against the Grain. I wasn't sure what to expect because quite honestly i had never heard of this restaurant. It was fairly easy to find, parking was a breeze because it's in a large plaza with several other big name stores & businesses. We walked and were greeted immediately, we let them know we were there for a private function. First impression on walking in - clean, nicely decorated modern & trendy tavern. 

The led us up to the 2nd floor. There are booths, counter height tables & chairs and standard height tables/chairs. The 2nd floor event space has it's own bar & washrooms which is very convenient. Best part of all - rooftop patio, which is one of 2 patios they have. Can't wait to go back in the Spring & Summer to enjoy that! 

We were with a party of 45 adults & kids. Everyone was taken care of very well! The servers were very attentive and easily took care of everyone's orders for hot & cold beverages and bringing everyone's food to the table at the same time. They were especially patient with the kids while they ordered and made several trips back to their table to ask if they needed anything else. Kudos to our server for taking care of 6-8 kids ages 6-10 so well! 

Kids were offered either pasta, tenders & fries or burgers & fries. Adults had the choice of herb & citrus glazed chicken, grilled flat iron steak or Nasi Goreng (Indonesian fried rice). Dessert was cake provided by the hosts of the party.

I ordered the Grilled Flat Iron Steak, frites, & spicy ketchup - steak was seasoned and grilled very well. Juicy, cooked to a perfect medium temp. It seemed to be the popular choice amongst the guests because the majority had ordered it. Guests that ordered the chicken & Nasi Goreng also enjoyed their food very much.

Everyone was very happy with the food & the service. On the way out i had a chance to look at their dining menu. I will definitely be back to try out more of their menu and enjoy their rooftop patio when the weather gets warmer."}
{"text":"This establishment has mediocre and expensive food. The food was uninspired and rather bland. Service was slow and inaccurate. Our waitress was \"nice\" enough but got something wrong at every step. The menu is the same old, same old. Did I mention expensive for what you don't get."}
{"text":"A party of 5 descended upon the restaurant one breezy, very cool summer evening.

My first impression, great heated patio on the lower floor as well as on the second floor.  Instead of the usual heat shades they utilized open concept gas fireplaces.  The interiors utilized a lot of wood in the decor, giving it a very cottage tavern feeling.  It reminded me of a more brighter Joeys/Moxies/Milestones without the lounge atmosphere that most are accustomed to. 

We had the rack of ribs, a chicken caesar salad, steaks one striploin and one filet mignon, and a \"chop and pop\" salad.  

Food surprisingly took awhile to arrive, despite the restaurant not being overly busy for a Friday evening.  We had to remind our server past the 30 minutes mark since placing our order that we had not received anything yet.  He apologized for the delay and as well as the manager came along and passed us his sympathies.  He indicated it would be exactly one minute from now that we would receive our food. That minute however, became another 5 minutes. A total of 35 minutes from placing our order the food being served... 

Ribs were very saucy with plenty of BBQ sauce on top, but flavorful and smoky. Just the way I like it.  The  beans came with a bit of pull pork, very delicious. Where it fails is the sad attempt at coleslaw. It was very bland and not memorable, it was hardly pickled and it consisted of what I think was salad dressing over diced carrot strips?

As for the steaks, the striploin came medium well when it was asked for medium rare.  We had to send it back.  It would be another 10 minutes before we received a properly cooked striploin.  My friend was a bit upset as he was very hungry, and he had to wait even longer now for his food.

The filet mignon however was cooked perfectly rare as it was asked.  The chicken in the Caesar salad was dry and disappointing.  For the $5 extra we expected better. The salad by itself was great though, but it would be very hard to screw up a Caesar.  Lastly, the \"pop and chop\" salad while interesting on paper, was stale in its ingredients. Particularly the popcorn that was used as well as the smoked salmon.  My friend who ordered it was not impressed.

On a personal side, their scotch whisky selection was pretty good, and surprised me.  They had a chance to impress me when I wanted to order a dram of The Highlander 12 year, had it still been in stock.  Disappointed, I fell back to my usual Glenfiddich and picked out the 18 year instead.  

Overall, a mix of positives and negatives prevents me from giving this place more than a satisfactory review.  It would have been nice to receive a little bit more compensation in the form of a complimentary dessert or a 10% off for the long time it took for our food to arrive, and the improperly cooked steak.  Things that mind you, we had brought to the restaurant's attention.

I wouldn't go out of my way to come back to this particular location, but I hear that they have another location down on Corus Quay with a fantastic patio that faces the lake.. I may give Against The Grain another try if its convenient."}
{"text":"I had the steak and blue cheese salad with was delish.  My friend got a gluten free burger. They have a decent gluten free menu too. I loved the decor of this place and will definitley return for patio season!"}
{"text":"Great staff, great patio, good oysters, good beer.  The food was only so so, not sure I would go back to eat anything but the oysters."}
{"text":"Very different menu offerings.

I passed this place on a sunny Thursday afternoon and based on the ambiance of the patio alone, I thought \"I have to try this place out!\". Therefore, the next day a friend suggested after work drinks and I thought \"woohoo! I know just the place!\".

The patio lived up to its first impression. Comfortable chairs and the music at a decent volume that you can actually have a conversation. There is a bar both inside the restaurant and on the patio itself.

The menu is not your average pub fair. It offers a wide array of dishes that you wouldn't find on other menus. Their accompanying drink menu requires its own table of contents. I ordered a 'Tommy's Margarita' which they describe as a margarita that is sweetened by Agave nectar made especially for Tommy who was a diabetic. It was delicious and had just the perfect amount of sweetness.

For a food partner, I initially ordered the mushroom flatbread not quite sure what to expect (flatbread = pizza, don't ask me why I couldn't remember that!). The flatbread comes overflowing with toppings, it had about 5-6 layers of mushrooms and drizzled with a delicious balsamic vinaigrette. 

Still hungry (and really, my friend didn't get much of the flat bread), we continued our food journey by ordering their beet salad. Which comes with four chunks of two different types of beets (I particularly liked the light pink one) and four chunks of zucchini (which I wasn't as fond of) drizzled with delicious dressings.

Price point is on the high side: approx. 14 for a drink; 16 for an app. But the atmosphere is inviting. They don't rush you out and the portions are a fairly reasonable size. I would definitely return in the future if I'm looking for a place to relax on a patio with a drink."}
{"text":"Came here because I was in neighbourhood and because it looked different from other pubs / restaurants.
The place looks nice until we were seated in a booth where the seat was ripped. 
Then when served with water, the glass had lipstick stain on it. And not sure why all their glasses are all \"wet\", do they not have a dryer for the dishes? We saw the waiters using napkins to wipe down the cutlery. Tip, they should do the glasses. And then, we got served our food but our waiter never came to ask how the food taste. If he did, I would have said my burger was dried. 
Would not go again. There's a five guys down the street with a better burger and cheaper."}
{"text":"Came here for lunch the other day with some friends and we were all very happy. 

Although it is a little bit on the expensive side, I thought everything was great. I had a pork rind caesar to drink. Our table shared the nachos with chicken and they were really good. My main was the ATG burger which was juicy and delicious. 

I will definitely be back."}
{"text":"This place has terrible food - the worst ever! The fish tacos? Save $5, grab a can of old pineapple chunks and dump it on your Subway Tuna sandwich - probably would taste BETTER! Flatbreads are more than a gourmet pizza at $14 - but often burnt and lacking in ingredients. 

The pluses:
1) A Smoke-free patio with umbrellas and couches. An absolute must for the non-smoker who enjoys clean air and cold booze.
2) The decor: A beautiful wood interior with lots of screens for watching the game, beautiful patio with an open-fireplace and heat lamps.
3) The drink specials: Mon-Thursday they feature decent $5 drink specials.
4) The servers: Hip, young and fun people who will chat with you if you want or leave you alone and will work to get your food and drinsk right (not their fault the menu sucks).

The bad and the ugly: The food! This is the worst pub food, and particularly gastro-pub food I've ever had. To those who enjoy the Fish tacos - Why not save yourself $5 and hit Subway for their Tuna salad sandwich and add some canned pineapple on top for that vomit-luscious flavour of dried, stinky fish and overly sweet canned pineapple.  DISGUSTING. I sent it back after one bite. Get your taste-buds checked if you like this dish. I'm a big fan of fish tacos (Burrito boys/ la Cucina) and considering they don't even NAME what fish you're eating at $11 for two tini-taco-titas, you know it's bad. Tasted exactly like dried out tuna that had been drained from the can and left in  the fridge for two days with chunks of  canned pineapple (and I asked for the pineapple slaw on the side). Absolutely inedible. Gordon Ramsey probably would have spit it out and thrown the plate against the wall. i did half of that (just the spitting out part).

My friend ordered the breakfast ($13) and said, I quote: \"The bacon doesn't taste like bacon. I had to eat it with something else.\" The sausages looked like deep-fried bread balls and he didn't even eat them - and he eats everything.   I've been here before and had a flatbread - very cheap ingredients. Kraft-bbq sauce and very un-flavourful pulled pork on a BUNRED flatbread - not impressive at $14 for an appetizer.

The only passable item were the nachos - which were an astounding $15 without meat. And the chocolate brownie, which was only good because they accidentally brought me ice cream instead and then I got to eat both together. 

My advice: skip the food (unless you consider KD and Subway on your gourmet list), only grab the drink specials and enjoy the smoke free patio.

If this place wants to stay in business, they'd better lower the prices of their food and improve on the taste. I'd rather have delicious chicken-breast tacos and a smaller, decently priced burger (hello - $18?). You can't expect people to stay long when you're serving food that's more likely to induce vomiting than a round of a dozen tequila shots."}
{"text":"We checked out Summerlicious at AGT today,

The lunch at $15 was a great deal and wonderful.

We both had the fish tacos, then my hubby had the pulled pork Flat bread and I had the Beef brisket sandwich with fries!
Both were great - meat tender and flavorful!  Fries were perfect - thick and hot and not coated. 

We both ended with the 3 layer cake.  It was not what we expected but was very good,  it was chocolate with chocolate mousse for icing (not buttercream).  We noticed this was the fav dessert - with many not finishing it as the size was generous.

They have a great selection of beers and some unusual cocktails made with beer in them.
Very enjoyable! We'll be back!"}
{"text":"Disappointing food and service. Server disappeared after ordering food. I ate half my meal with no water and no beer. I had to go to the bar and grabbed my own decanter refill of water. 

Food was very substandard. Burger dry and overlooked. Fish and chips clearly fried in old oil. Oysters were not fresh. 

Place was not busy. Thankfully another server had to step in and save what was left of this miserable experience."}
{"text":"Truth be told when I first heard the name of this place I thought it was a barbershop based on the name. Obviously upon waking in I was proven wrong (thankfully). 

As many have stated the decorations are very overstated, and doesn't really correlate with the food served. While I did experience somewhat good service the biggest downfall for me had to be the food. I had the Chicken Sandwich (Hand breaded chicken breast with the usual suspect toppings). While I was hoping for something different and good, I was vastly disappointed with the quality and taste of the food. The sandwich has virtually no taste and was just a fried chicken breast on a bun so to speak. I had a side of fries and they were alright; but it is pretty hard to screw up fries. 

For dessert I had the Cinnamon Bun that was part of their special seasonal menu, and to keep it short, I'd say it was the worst Cinnamon Bun I've ever had. 

I'd skip this place as I found the food to be very cheap tasting and rather overpriced for the quality and taste of food."}
{"text":"Visited for Sunday Brunch on two occasions.  First visit - had a great server, super friendly.  Food was ok.  Had the eggs benedict.  Nothing special.  Felt a little 'odd' after eating in terms of wellness, but didn't think it was related to the food.  Place wasn't crowded.  Very nice atmosphere in terms of decor. 

Second visit -food took ages to arrive despite the place being EMPTY.  The kicker is....after eating my breakfast...of which I had the eggs benedict ( what can I say, creature of habit), I was ill two hours after for about 3 days.  It can't be a coincidence that TWICE I was ill from eating here.

Lesson learned

Will not return."}
{"text":"I am surprised I haven't written a review for this restaurant yet as I have dined here numerous times. 

Firstly, I really like the beer flights option you can choose 6oz or 9oz I believe. Correct me if I'm wrong but it's a nice change to have a taste of a couple of beers. My favorite is the Leffe Blonde and they change up the beers every so often. 

My food favorites are the flatbreads! Delicious and a good portion for sharing as well! The best flatbread is the mushroom one! Or maybe I especially love mushrooms! I have tried their poutine as well however it is not rave worthy. But they have a good variety and vegetarian options as well. Their menu is well rounded and they have a kids menu too so it is pretty accommodating. 

The service is also very friendly and they will accommodate you as best as they can. I do recommend making reservations on weekends as they seem pretty busy.

I enjoy coming to this place for its good atmosphere and friendly people. Of course, a good beer selection and food is a definite plus! I will be back!"}
{"text":"Went for summerlicious today and food was mediocre. Our table sampled three of the summerlicious mains. Brisket sandwich was pretty bland. Fish and Chips was ok but nothing special. Hickory Ribs were good but again nothing mind blowing. However, Mill Street Stout Espresso and Mint Cocktail was amazing and beer selection was good. The fish tacos were good. Desserts were pretty bad, especially the cheesecake. They tasted like the prepackaged cakes you buy from the grocery store. Atmosphere and service was good. Really great patio. Not the best experience this time but  will try again because of the patio and beer. Will stick to just appetizers next time."}
{"text":"I have been to this place twice now and its very quiet for a weekend brunch. I love the view of the lake and they have a really nice patio to enjoy the sun. Probably one if the very few places where the veggie burger is really good."}
{"text":"Excellent beer menu and a few menu items that are very well done - my favourite was the fried chicken."}
{"text":"I really wanted to love this place as they have awesome patio area for summer time with free parking however, i tried their food once and never have been back since. Had to send back steak 2 times and my son definitely didn't enjoy dry and hard chicken fingers."}
{"text":"What a hidden gem inside Leaside Village! My ultimate frisbee team decided to stop by for a drink after a night of throwing around the disc. We sat on the beautiful patio which as equipped with heaters for the unseasonably chilly July night. It's also on a quiet enough street that you aren't yelling at each other the whole time. 

There is an extensive beer and wine list and the waitress was very knowledge and able to give suggestions. I was only up for an appetizer after the long game and decided on the whitefish tacos with avocado, pineapple and mango. I was pleasantly surprised that the fish wasn't fried, but came perfectly cooked and flaked in the tortilla, however it was slightly salty. There was a very generous amount of fish. I'm usually one to complain about having too much of the main protein, but I wish there was more cabbage and mango to balance out the whitefish. I barely noticed the avocado in the taco which could have added a nice creaminess to the whole dish. 

Overall, I'd love to go back and try more delicious food, especially on Wednesday which is an All Night Sausage Fest. (My inner child laughs!) But I hope the other dishes I will try in the future have more of a balance touch."}
{"text":"Had hesitation to come to this place with a group due to mixed reviews here and the fear from some of our party that this was a trying to be trendy place that is really going to be a flash in the pan. Was pleasantly surprised as expectations were greatly exceeded. Our food was delicious (we had the 3 little pigs flatbread and the lemon sea salt wings), and the service was excellent. Also found the decor and environment wonderfully modern and attractive (but you can certainly wear casual clothes here). Parking is easy because it is in a mixed commercial shopping plaza/center."}
{"text":"Food was pedestrian. If they spent as much time on the food as they did on overstated decor, maybe they would have come up ahead."}
{"text":"Food is good if you can get it. I hate they tuck the barstool so so tight you can't pull them out. That's restaurant 101, make your guests feel welcome. 1 day free of charge me working In this restaurant  I am 100% sure I could increase sales at least 10%. 

I sat at bar with an empty beer pint for 25 mins. I would have 2 in that time. My food order took over an hour. No sound for the Jays game in the bar. Torontorians luv the Jays, hello do you want to make a profit on cheap draft beer. It's sooooo simple."}
{"text":"Have you ever been to the bar before? A place where there's tv's, a bar, good food, some seats, some benches, and if you're lucky a good vibe? Well, that's not this place. This place is better, and a Tavern! A restaurant with spirits, beer, wine, great food, good staff and a very nice comfortable vibe. Unfortunately the two times I've dined here with my wife have been in the colder months of the year (Feb and Oct 2015). It appears they have a great outdoor patio, I'm thinking I'll come in the Spring and have a nice party sized party on what I like to call the party patio! This place seems ideal for a double date, a family outing whether it's with little ones or not, or a fun Friday or Saturday night out. You'd think this place was part of a chain. Maybe it should be. Between the decor, the food, the beer and the atmosphere this place is spot on. My only only small wee little complaint, was that my wife and I both felt our turkey and veggie burgers (respectively) were a bit dry. Otherwise, the food is friggin the cats bomb!"}
{"text":"Went for brunch. Decent atmosphere. Food was just ok. Won't rush back. 

I'm a connoisseur of greasy spoon breakfasts, and their bacon-and-eggs was nothing too special - no better than your average Sunset Grill or Good Bites. 

The patio was nice, but the entire upstairs had a slightly off odor that was to me barely noticeable, but to one of our dining mates, was a real turn-off."}
{"text":"First thing you'll notice about the place is the ambience. Place lookc classy and they have a pretty decent patio. Very nice to just sit and have a beer on good weather days. Place looks inviting, it wasn't as busy though considering it was a saturday when we went. The menu is pretty simple, nothing unique and very limited. I ordered the fish and chips and upgraded my fries to sweet potato. I didn't make a big deal about it anymore but the fish was garbage. Considering it was a fish they should cook it really properly and fresh because you can easily tell if they just reheated it or something. It was so oily and not hot which is why you can easily tell that the fish was already cooked long time before and when someone ordered it, they just decided to dip it in the oil again. I am clearly not impressed, it was my first time in this place and would probably be my last. I never expected that this kind of really nice pub would do this thing. Good thing my friend paid for the food ,otherwise I wouldn't even give a single cent for the tip. Really not happy with my food, I barely touched the fish."}
{"text":"I had gone for winterlicious. I had gotten the oysters for appetizers, the chicken  for the main, and the sponge cake for dessert. it was good for the price. The chicken looked like mush but it tasted pretty good. the servers weren't that friendly. The inside looked beautiful however we were seated in a very dark far away corner. From the lighting. Wasn't very welcoming."}
{"text":"After several years I decided to give Against the Grain another try because of the fab patio.  The restaurant is fashionable, trendy and located in the heart of Leaside.  They have completely revamped the menu from the upscale bistro fare to more traditional pub grub unfortunately it is still terrible quality.  The food is bland, flavourless and uninspired compared to the new restaurants showing up in the area.  I got the Tavern burger and I could have made a better burger at home.  It was burned and I sent it back for a replacement which was marginality better.  The Tavern salad is yummy but lacks consistency in quality.  My partner ordered the same meal and his Tavern salad was missing ingredients mine had.  Sadly, I will not return here again unless they get a different menu, new executive chef and better beer tap menu."}
{"text":"Bad service and got incredibly small salad for $16. Quality of the salad was bad too (welted kale, watered down mashed yams and avocado)...disappointing especially since they claim the ingredients are local fresh.  Safe to say we won't be back."}
{"text":"Food is way over price and eatable but far from enjoyable. We will never come back. Ambiance is ok but definitely not worth it."}
{"text":"We went to this place for some good food and watch the raptors game.  

The menu selection is small but it's been just revamped to include a few new items. We tried the pot pie, ribs and of course the burgers.  

Great atmosphere and vibe in a great part of the city. 

Would highly recommend anyone trying this place out. The food and service combine makes for a great night out!"}
{"text":"It was well past dinner time, we were starving and we were driving on Laird.  Those are the three reasons we ended up at Against The Grain.

Nice patio but a little too chilly to sit outside.  So, we sat indoors where the air conditioning was blowing air just about as cold as the temperature outdoors.

We were looked after by a pleasant waitress who knew when to come by our table and when to allow us to chat and eat.

My husband and I shared a chopped salad minus the chorizo to start since we were informed by our waitress that our meals would take at least 20 minutes to arrive.  Not quite sure whey they call this salad chopped - the pieces of lettuce were large making it too difficult to place in our mouths.  The chick peas were much too dry.  The dressing had an odd smokey taste although it was advertised as ranch flavour.

My husband had the steak frites and I had the pickerel.  Both entrees came nicely displayed on the plates with yummy accompaniments.  The steak and the fish were done to our liking and we gobbled it all up.

Although the food was tasty, the ambiance and decor was not worth the almost $100 bill (including tax and tip). 

I'm not a fan of paper napkins rolled around silverware and sealed with a sticker.  The booth we sat in had crumbs on the seat that I sat on.  The hostess watched as I brushed them with my hand when she seated us.  The faux leather seats were also quite tacky.

We won't be returning to Against the Grain because we would much prefer to head to King Street or College and have a fun atmosphere for the same price.

This restaurant is definitely good for families but not for \"date night\" and couples wanting to have quiet conversation."}
{"text":"Had dinner here with coworkers on the second floor. The food was good and the place itself is cool and trendy. I also like that they use local ingredients in their dishes. I would probably go back."}
{"text":"The food here is amazing! All freshly made and to their own recipe, not some frozen junk reheated.

There is a great selection of beers, including many on draft from small breweries I've not heard of before.

They were very good with our son, bringing his food out quickly so that he wasn't getting impatient. He ordered a cheese pizza, and loved that it came served on a wooden plank. Sadly he didn't like the taste. I liked it, but one of the cheeses was an aged cheddar, which I could understand being strong for a young one. No problem though! We were happy to pay for another meal as there was nothing actually wrong, but the waitress let him order something different at no extra charge. He went for the chicken fingers, which were delicious! Probably the best we've ever tasted.

I had a veggie burger, which is not something I normally go for, but wanted to try something different. Beautiful, cooked to perfection. All of us left very satisfied and vowed to come back again."}
{"text":"Well I'd love to write a long review about what I ate and how the service was but I can't!!!!! The website says it closes at 11pm I walk in the doors at 9:40 and the host informs  me they are closed.  Highly disappointed.  Won't go back"}
{"text":"Server Jacqueline was awesome! 5 stars for her! My Tavern Burger was okay... 3 stars - was a little dry, flavour was mediocre, side of fries 3.5 stars - a tad on the overcooked and mushy side... Atmosphere 4 stars, price 3.5 stars... Will come back to give this place another try in a couple weeks, but undecided on whether it will be a regular restaurant of mine..."}
{"text":"I really like this place because it consistently delivers what I expect from it. Good quality food,  a few neat specials and events,  friendly staff. Would I go here on my anniversary?  Of course not but it's the best restaurant in this neighborhood. My only complaint is pure choices on the wine list by the glass. Italian Pinot Grigio??? Add 3-4 Ontario wines and you'll hit the mark."}
