{"text":"I was apprehensive about going to Agio for dinner but agreed since we did not have a dinner destination and I hate driving around looking for a random restaurant. As we walked in, I was immediately doubtful of my agreeableness. Not only was the restaurant empty, there was an Asian man mopping, and he looked to be the chef. He quickly greeted us, told us to sit anywhere and brought us some hot green tea. At this point I was confused - green tea with pasta? But we went on anyway because he was actually very friendly, and I felt like I just walked into my uncle's house. 

We ordered the butternut squash ravioli and the osso bucco. After ordering, the chef disappeared a while. When he returned, he had two bowls of butternut squash soup and some garlic bread. While it was a little bland, I enjoyed the warm soup on a cold day, and appreciated the complimentary amuse-bouche while we waited. 

Not long after, our mains were served and I must say I was impressed. My SO's osso bucco was accompanied with vegetables and some penne pasta, while my bowl had 4 large ravioli in a rosé sauce, which was perfectly cooked. While I am not a pasta expert, I believe that the ravioli was made fresh and in house. The pasta itself was slightly chewy, with a generous amount of butternut squash in between. The sauce was a little overwhelming but I swept some of it to the side, which the bf gladly soaked up with the garlic bread. The osso bucco was also delicious; the veggies were cooked well, as was the pasta. But the star of the dish was the veal. The marrow was a nice treat to spread on the garlic toast (and on its own), and the meat itself was soft, tender, and well-seasoned. We ended the meal with complimentary tiramisu, which was excellent. 

Overall, Agio has a homey atmosphere, with delicious food. While small and easily missed, it is worth it to give it a try. Don't let the ethnicity of the chef deter you; as others have mentioned, he lived and was trained in Italy for many years."}
{"text":"Ate at Agio tonight and was pleasantly surprised at how delicious the food was! I was also taken aback that a Korean chef would be cooking Italian cuisine. This was very judgmental and offensive on my part and I learned my lesson. Having been trained in Italy, Chef Marino may appear to be Korean but he speaks fluent Italian and cooks some of the best and authentic food I have ever had in my life. My SO and I had the bruschetta and the frutti de mare pasta. He also served us a complimentary melon and prosciutto appetizer as well as a delicious tiramisu dessert. It was our first time here and will certainly not be the last. Many thanks to the other Yelpers for this recommendation and I would highly recommend this spot to anyone who loves authentic Italian cuisine!"}
{"text":"Epic spaghetti and meatballs. Had to try this place from the reviews on here and it did not disappoint. Nice to meet Marino (owner/chef). I'll be back!"}
{"text":"Wonderful service and decent food. We were offered free appetizer and dessert on the house =). Definitely worth to come back"}
{"text":"I arranged a reservation from Royal Oak , MI to celebrate my son's birthday with his girlfriend and her parents whom we had not yet met. This was a wonderful place for such a meeting and celebration. It is small, cozy and eccentric and we were so warmly greeted and served by the waitress who is the wife of the chef. The chef treated us to several free \"samples\" of soup and appetizers. The presentation of the food was elegant, and the food was delicious and my husband raved over the Korean salad. There is an full page of vegetarian options  which was good as one of our company is a vegan.  We were not rushed and the atmosphere was relaxed and happy. The artwork is most interesting. The chef came out and visited us and told us about his way of preparing tiramisu which was excellant.... he treated the birthday person to one of these. The chef is passionate about the high quality of his creations . although intially uncertain, we  were not disappointed by our choice of this restuarant. Personally, I liked the decor . It added to the experience for me. I liked knowing that it was a place where there was a following of regular customers who are like \"family\". It was a fun and quite different. I would like to eat there again when I  return to Toronto."}
{"text":"The pasta and dessert here is amazing!  High quality ingredients coupled with top notch execution makes this a foodie goto for Italian cuisine.  I can't think of any Italian restaurant in Toronto that can match this place at their price point.

This is not your usual restaurant so there are some caveats.  First, the owner tries to be creative.  Often times, the end result is absolutely delightful but there is always a chance for a miss.  Second, this is basically a one-man show.  Hence, don't expect on-point service, instead, expect home-style service where there can be periods where you don't see anyone because the owner is busy prepping your food.  In my opinion, the quality of food at Agio more than overcomes these weaknesses."}
{"text":"When the lowest rating in the current reviews is 4 stars for a restaurant, the bar is set very high, and Agio does not disappoint (EDIT: Upon reviewing my review, I really haven't provided any new info to Yelpers reading the other reviews.  I'm not deleting it because I figure that the more people who give this place 5 stars, the longer it will stay open, and it needs to stay open a long time).

The two of us arrived to the empty Agio at 6:30pm on Saturday.  The place is ... cozy.  It was set with 3 4 person tables, and one 10 person banquet.   we were greeted at the door by the chef, who immediately launched into some incredible descriptions of the specials.  

We started with the Bruschetta Trio, which was a perfect appetizer for two (the chef complimented my pronunciation of BROO-SKET-TA.  I told him that since I've dropped enough of it on my lap, I felt it necessary to know how it's pronounced).  The Trio consists of two \"standard\" pieces of tomato/onion/herb bruschetta, two pieces piled high with  roasted peppers, and two pieces with shitake mushrooms.  Each piece was a delight.  

Free garlic bread followed the Bruschetta, followed by the Lobster Ravioli special.  The ravioli was truly amazing, with lobster meat filling in a tender pasta covered by a wonderful cream sauce. A pretty standard lettuce salad followed the pasta, but the ravioli was so filling that neither of us could finish the greens.  The chef finished the meal by bringing each of us a small glass of cold, delicious almond milk.     

Amazing food, amazing service, amazing evening.  Will definitely return."}
{"text":"Went here on a whim. I found some great reviews on Yelp, and the place is within walking distance from me so I figured why not. Walking into the place, I found it to be very unassuming. It's not a fancy date restaurant that's for sure, but it's not ugly by any stretch. When our group of 4 entered we were promptly seated by the only man working there, a fellow we'd find out was Korean and lived in Italy for 7 years.

We ordered fried calamari and bruschetta to start. After a 10 minutes of waiting, we were told he had no calamari left. A bit disappointed, but I wasn't bothered. I ordered the mussels and clams. I'm quite glad I did when they came. A huge portion (easily enough for 2-3 people to share) of mussels and clams came out in a beautiful tomatoe sauce. i was drinking the sauce with a spoon. My table mates said the bruschetta (three kinds, portobello mushroom, tomatoe, and red pepper) was good, but I didn't try it.

Entrees were great too. I had the sirloin with vegetables, fantastic. Cooked how perfectly, and the veggies reminded me of how my nonna makes them. Very good. My girlfriend had the lobster ravioli, and was very happy with it. I tried a bit and enjoyed it. You could tell the pasta was fresh, and the chunks of lobster were generous. Chef Marino also brought out some garlic bread for us to have with our meal.

I was filled, but I did want some dessert. I didn't even have to ask, as soon as our plates were cleared Marino brought us Tirimasu for our table to share. It was beautiful, some of the best I've had. There was a tang of citrus, and it was the perfect end of the meal. Before we left, Marino brought us out 4 shot glasses with pink liquid in it. I asked \"what's this?\" he said \"just drink it\". No problems here! Turned out to be Sambuca mixed with aguave juice. Never had I enjoyed sambuca that much. i will always mix it with aguave juice now!

In short, the food is good, the atmosphere, not so much, the washrooms are a bit dingy. The chef makes the experience though. It feels as if someone as invited you to their house for dinner. Great time, and would recommend it to anyone."}
{"text":"First off I'd like to thank previous reviewers as this restaurant lived up to expectations. The level of service by Marino who takes the time to get to know you is very genuine and welcoming. If you're in the mood for a terrific meal that's home made Italian cuisine while being served by an owner that cares about you the customer having a good time then this is the place to go. 

Will go back again!"}
{"text":"It may look like a hole in the wall, but don't judge a book by its cover. Admittedly the chicken (I love the chicken Alfredo) can sometimes be a tad overcooked, but it's still my go to. The bruschetta is definitely worth it too. The value for money is also excellent.

The food aside, the service is second to none. Chef Marino is quite a character, and even though I've only been a handful of times over the past 3 or so years, he will remember you."}
{"text":"Went for a casual date after a workout and really didn't know what to expect. All I can say is wow, this place is truly a dining experience. From the quality of the food to Chef Marino and his personable touch, it really made our night. You can tell he really takes pride in his food and prepares everything himself. Definitely worth the wait. He even served us up some of his fantastic bruschetta on the house! The complimentary guava-sambucca at the end of our meal was the icing on the cake. We had the ricotta-spinach ravioli and the gnocchi ala primavera with Italian sausage with the fried fritter cauliflower to start. Simply fantastic !"}
{"text":"Just like all the other reviews we were a bit weary when we saw the Asian Chef. However so glad we found this place. Chef Marino is such a delight. He has such a passion for food, especially Italian food and he is an awesome cook. (Trained and worked in Italy for several years, speaks fluent Italian) All the food we ate was delicious!  We went 2 days in a row. Great dishes to try out: the grilled Calamari on a salad bed, Mussels and Clam appetizer, the Lobster Ravioli, Butter nut squash Ravioli, Frutti de Mare Spaghetti. I think you can't go wrong with anything on the menu. Marino's Tiramisu and Creme Brûlée, so good!  Highly recommend this little place. Hope he fulfills his dream of going back to Itay to open a restaurant."}
{"text":"Good place to spend some time over some good food and a chat with the chef, Marino .
We were there on a Friday evening and had a memorable time.
There are some regular customers here at this place which explains the service and food. 
We only had what the chef advised us and it didn't go wrong .. Lobster ravioli was a hit and the tiramisu :)"}
{"text":"A+ for service D for food. The host/owner/chef/waiter is very nice, the service was delayed because he was running the place by himself but that gives you time to enjoy the place so no biggie here. The food was very disappointing, soups were bland and the meat in the main dishes tasted bad, with the sausage being non edible. We were taken care of and had we complained, I'm sure the issue would've been addressed. We were given free dessert and a free appetizer for no reason at all. So the opening sums it up great service. Bad food. That was my experience."}
{"text":"The first thing you'll notice about this little comfy hole in the wall in the Corso Italia is the delicious smells upon entering.  I went with an actual Italian, a visiting friend who had asked me to show him Toronto's version of \"authentic\" Italian (the way he said it, you could actually hear the quotation marks around the word authentic, like he was not expecting to be impressed). Based on the other Yelp reviews and our proximity to the location, I decided to give Agio a go. I wasn't disappointed, and my Italian friend was actually very impressed.  

I had the gnocchi with sausage which was perfect and utterly delicious, and my friend went with the pumpkin ravioli, apparently a speciality of the area of Italy that he's from, and from the look of joy and nods of grudging respect that I saw on his face, it was quite up to snuff. 

He was especially impressed, when the chef came out speaking the same Italian dialect of the part of the country where my friend was from, and the chef turned out to be a Korean man!  Since it wasn't busy (we were early, before the dinner rush), chef Marino spent some time telling us about how he had gone from his home in Korea as a young man, to Italy to study to be a chef, and had decided he loved it there too much to leave, at least for the next 10 years, during which time he apprenticed at a prestigious restaurant that my visiting friend knew well.  We had a hilarious and lively chat, topped of with a shared shot of some amazing fruity cognac from the region, compliments of the house. 

This place is seriously wonderful. Great food. Wonderful warm and welcoming staff, and a truly inspiring story behind it all. Five stars aren't enough. 

P.S.: in the couple of months since the visit described above, I've taken other colleagues and friends to Agio and everything has been perfect, every time. Dangerously, I also discovered they will do take-out, so now I'm picking up dinner from there with alarming regularity!"}
{"text":"Best Italian restaurant in Toronto HANDS DOWN! The atmosphere is so cozy and the chef is just the sweetest. Can't wait to go again :)"}
{"text":"Hands down, the best Italian food in the hood.

The food is always made fresh, and guaranteed to be delicious, every time. 

It takes a while sometimes, probably because everything is so fresh and made with care, but its worth the wait and the money.

I've had the pumpkin soup (it was fall at the time) and it was made, in house with freshly roasted pumpkin. I have had the handmade lobster ravioli, and it was delightful. I have recently had grilled calamari with fresh made rosemary bread... oh man, oh man.

Just go!"}
{"text":"Really great food. Chef Marino was hospitable and defintely passionate about his craft. He shared tid bits about every dish, and every dish was delicious. 
Will definitely return!"}
{"text":"Went with my wife,son and mother for mother's day lunch. Everything was delicious and we were pleasantly surprised with complementary appetizer and dessert.Will definitely return in the future."}
{"text":"Personally, I really need to like a restaurant's aesthetic to completely enjoy a meal somewhere. So when it comes to this place, the decor isn't really my cup of tea and it was one of the main reasons I avoided trying this place despite living around the corner from it. 

I have to say though, that I was really disappointed I hadn't eaten there sooner after I finally did. 

The chef is a very nice guy and his cooking is fantastic. The gnocchi was delicious and the spaghetti just as much. 

I don't think I've eaten that many meatballs in one sitting before."}
{"text":"Service was great, food pretty good. Staff really worked hard to please. Zucchini Appetizer and mini creme brûlée on the house."}
{"text":"The review regarding the \"spartan\" decor is one of the reasons I picked this spot for a recent lunch with an old co-worker/friend (we both agree that these no-frills establishments can yield the tastiest food!). Of course, there were also the stellar food reviews here, and something I must have read on their Facebook page about catering to those with allergies (I skimmed through here but didn't see it). 

I have a gluten intolerance, so I phoned ahead to see if there would be any food I could eat during the lunch hour. Marino, the chef, answered the phone and said it would be absolutely no problem, and asked me what day I would be coming in. 

Let me tell you, I have never felt so SPOILED by a dining establishment before! Marino is the one that greeted us, and took our orders. We were the only ones there, but I think the place next door must have ordered some grub, as he kept popping out with plates of food. Mind you: my friend and I were catching up, so we weren't in any rush, nor did we ever feel not attended to. 

I didn't even look at the menu on my end. He'd let me know that he had made some sweet potato and corn flour gnocchi for me, so I was sold! Even though my friend didn't have any allergies, we both felt like we were given a LOT of choice in what we wanted or didn't want in our dishes. My friend also wanted to order bruschetta, but felt guilty that I couldn't have some. I told her to go ahead anyway, she could always take some home. Imagine my surprise when the bruschetta came out and he'd separated out some of it, putting it on top of some lightly cooked zucchini for me! What!!!

Though we didn't order it, we also got a free creme brulee to share, which was so lovely. 

Two reasons why it didn't get a full 5 stars: 1) Although the food was so flavourful, it was a TAD oily for my usual tastes. 2) There was ONE piece of my friend's penne in my dish, right on the top. Now, I do not have celiac disease, and I certainly can't ingest a ton of bread/pasta, but I was able to still eat my glorious meal just by picking out the penne piece in question. Others with greater sensitivities are not so lucky, so just make sure you double check with the kitchen for any chances of cross-contamination (as you always do, I am sure). 

My friend and I both left knowing we'd be back, probably with our significant others in tow!"}
{"text":"Picked this place for dinner, based on the few but excellent reviews.  Like others reviewers mentioned, the decor etc was underwhelming, on a friday evening 8 pm, we were the only people. Began to wonder if all the reviews were posted by \"near and dear ones\" . BUT we were so pleasantly surprised. The chef is so warm and welcoming, he obviously knows his stuff, everything seemed prepared from scratch and pretty delicious.
We tried the bruschetta and zucchini stuffed chicken - yum !  Lobster ravioli and the other pasta with gnocchi and sausage etc was great. Dessert was pretty good too ( just the right Amt of sugar)

Wonder why it isn't as often visited as compared to some other restaurants in the vicinity. I'm pretty lazy typically and never really post reviews - but seriously felt I should write about this place... Would highly recommend it. I would give it 4 stars, but the extra star is ONLY for the warm and courteous chef !!!!"}
{"text":"Loved this little gem in the city! We had the lobster risotto and mushroom gnocchi as our mains. Absolutely delicious!! You can really taste the quality ingredients and love that went into the dish. Chef was very kind, young gentleman serving was pleasant and very attentive. Can't wait to go back!"}
{"text":"High end Italian food, in an unassuming tratorria style hideaway.  You'll feel at home whether in jeans or business casual.

The korean born, italian trained chef, was totally hands on; from the welcome, right through to the finish. 

We had the five course prix fixe meal for two; which for $45/person, had an abundance of choices and substance to tease the tastbuds and satiate our appetites.

Recommend you check it out, before word of mouth makes desireable reservations difficult to obtain."}
{"text":"We had a wonderful experience at this hidden Toronto gem and highly recommend it. 

We were greeted by the cheerful Chef Marino.  He happily engages customers in conversation and you will come to know he is a delightful soul with talent to backup his culinary education.  In a lovely European fashion, we ordered in succession with ample time to savour and enjoy both food and conversation.

The food was fresh and divine - and that perfectly so is all - why spoil such with redundant words?  We had the bruschetta, I the butternut squash agnolotti, and he the seafood pasta (he is a well-traveled foodie and commented it was one of the better meals of his life). To conclude we shared a tiramisu (heads up - it's heavy on the mascarpone if you prefer a cakey tiramisu).

The restaurant is (principally) adorned by the art of Clara (Marino's wife and partner in crime).  While in totality the collection is a little overwhelming for the small space, it reinforces Agio is a labour of Marino and Clara's love.

The cliental at Agio were friendly and conversations are held restaurant wide. 

Overall a wonderful evening marked by great company, food, and laughter."}
{"text":"The food is very delicious!!!!!!! Thank you Yelpers!!! The Chef/Owner is an awesome guy!! He makes you feel at home. I can go on and on, please go try this place out! Awesome!!"}
{"text":"I passed by this place a few times, without ever entering, due to the way it looked ( small little place indeed). The time me and my roommate decided to enter, what a surprise it was! Let me start off by saying that chef Marino, is the owner & he is passionate about food, you can clearly see this by the way he talks, acts & serves, as he excitedly shown us his home made gnocchi that he made.  
  We ordered our dishes, but to our surprise he brought us bruchetta to try. Not only was it kind, but the tomato bruchetta was clearly made fresh & not packaged. Our dishes came (we had the seafood pasta ) But although we asked for rosee sauce instead of regular, and linguini noodles, he gave us the exact one on the menu, when previously stating that he could accommodate our changes (which is why a star was lost). Other than that, the flavour was amazing! and the portion was large, with lots of seafood in my dish. We asked for our bill after being completely stuffer & satisfied, but chef Marino surprised us once again with a delightful teramissu, which I must say, was creamy & delicious. ! I will be returning here again for sure!"}
{"text":"Merino's food is always amazing. My partner had the butternut squash ravioli and it was rich beyond belief. I had the porcini mushroom risotto and love the deep earthy rich flavours. Was served by the chef himself. Had a really great time!"}
{"text":"Great food! I was with 4 other people and we all ordered something different. After trying butternut squash ravioli, ricotta spinach stuffed cannelloni (it had different Italian name that I can't remember), and 3 different gnocchi's, I am fully convinced that this place will be my regular Italian restaurant. From the flavour to texture, the food was perfect and I was totally in love with every bite of my butternut squash ravioli. You can even ask for different sauce and the chef will be more than glad to adjust to your style.
It is true that it's not the best looking restaurant, but once you realize all those paintings on the wall are done by his wife and majority of faces on the wall are actually the customers of the restaurant, you will be impressed!
The chef is friendly and very passionate about cooking for sure!"}
{"text":"Best pasta I have had in a long time. Probably the most interesting and welcoming host as well. The restaurant walls were covered with his wife's artwork which is simply beautiful. Prices are amazing considering Marino will throw in salads and desserts for free! Coming back very soon."}
{"text":"It's amazing how the last time I checked out reviews for Agio, that the number grew from a single digit to the 20s--hardly surprising! 

Thank you to the Yelpers who led me to Agio! I wanted to check it out for a while but never got around to it--but then I DID! And now I can't stop! I've been there four times in the last six weeks, it's that good!! I've no idea how the one-star-giver came up with that rating, as the quality has been consistent each time, though there have been slight variances with each visit (nothing bad, just new or unexpected). (How is it that some reviews go filtred while others don't?)

Enough talk about \"authenticity,\" blahblahblah. I want to choke someone whenever I see this in reviews or hear it being thrown around the way people call themselves \"foodies\" because they think 'someone who eats food' is its definition. Please, enough already. I believe authenticity comes from the way in which food is prepared (methods, etc) in that it stays true to its traditional way of being made, including the ingredients being used, quality and specificity being factors too, etc. Contemporary takes on traditional dishes/cuisines is something else altogether, and that's great too. But because a Korean is making Italian food doesn't make it any less \"authentic\". *NEWS FLASH* If you've ever looked into the kitchen of many restaurants, you'll find that a lot of the cooks are Sri Lankan (or at least that used to be the trend a few years ago). That's right, folks: Sri Lankan! In the US, you'll find Mexicans in the kitchens of many restos--I've had some amazing Korean BBQ in the US made by a Mexican, just as good as my mom's! People go to Rome and eat at some tourist hell and think they ate authentic because they ate it in the food's country of origin--not so! To put it simply, I go out of my way to avoid tourist traps and I've been to Italy which DOESN'T MAKE ME AN EXPERT, but I will say that Chef Marino makes some fine-ass food and he clearly LOVES what he does; he doesn't cut corners and everything is fresh and delicious! He puts things together that one may not expect yet it's always good! The décor is a real mish-mash of stuff but once you learn their significance, you'll come to appreciate and understand its charm.

I've had the following dishes:

- bruschetta: COVERED in the usual diced tomato w/hints of basil and garlic undertone, sometimes roasted red peppers smothered in olive oil and pesto. The bread is always the right crispness. I don't get how Chef Marino does this working solo in a busy kitchen! How does he not burn the bread?? None of the flavours overpower one another and you can taste the freshness in every bite.
- mixed green salad w/grilled calamari: two huge calamari on a heap of mixed greens in citrus balsamic dressing. The citrus rounds out the tartness of the balsamic and it's oh so good~
- gnocchi: I've had this almost each time, always with a different sauce. I don't like tomato sauce in this dish so I usually ask for something pesto-y or with butter/olive oil/garlic. Perfectly cooked each time!
- spaghetti with meatballs: tomato sauce; this dish tastes different each time, meatballs have a nice flavor to them.
- lobster ravioli: I've had this every which way as well. My fave was the creamy pesto-y sauce. I should mention that chef Marino's pesto rivals one that I can only find in Montreal. Other pestos are too pasty.
- sea bass: MMMMM, love seabass. This is one of their specials so it's not always available but if it is, try it! Comes with sides that are also great.
- desserts are made in-house. I've had both tiramisu and the crème brule. I love them they're not too sweet and as for the crème brule, where other crème brules fail, somehow Chef Marino manages to get it right and then some!

I don't want to encourage people to go to Agio expecting freebies as some people are really tacky like that, but do go to enjoy the food. If you catch Marino on a less-busy day, have a chat with him. He is SUCH an interesting character and if you've traveled and love food, you'll gain a much deeper appreciation for what he does, and this restaurant is obviously a labour of love for him. It's evident in the way he presents his food, the time and care he puts into each dish which is on a very rare level for this price-point, and the fact that he is able to handle a full restaurant all by himself during the sweltering heat on some days tells me he's a real pro.
 
If you haven't been, do check this place out; if you have, I'm sure you understand some of the cravings I get. I've taken many friends and family who know food to Agio and they all love it. Portions are big but do try different things. When you come across a well-trained chef who loves his craft this much, you can't go wrong. Now run along! It's on St. Clair West, a few doors west of Lansdowne."}
{"text":"The food is delicious and the service impeccable. Chef Marino is a great host! 

Cheers!"}
{"text":"Relaxed feeling , great service. The ravioli was amazing ! Chef Mariano was pretty funny. Don't forget to get dessert"}
{"text":"My boyfriend & I just moved to the neighborhood & have been meaning to check out the restaurants on StClair.  A couple of weeks ago we both had a craving for spaghetti & meatballs & decided to go exploring.  We headed out with another Italian restaurant (located around the corner) in mind. Boy, am I glad we chose Agio instead. We went in for take out & were greeted by the chef. He seated us and brought us a complimentary pot of green tea while we waited, which was perfect as it was quite chilly out. He mentioned that the wait might be longer than expected as he makes the pasta from scratch (!!!). When done he put the meal together in a takeaway bag & included half a dozen slices of garlic bread for free. He is such a nice guy & obviously has passion for the food he produces. We hurried home & couldn't get into it quick enough. The pasta is amazing (love that its from scratch) and the sauce, incredible. One thing I really don't like is acidic tomato sauce,This one was far from it & full of flavor. I definitely recommend this restaurant & will be going back again & again."}
{"text":"Just like other reviewers have mentioned, the decor and ambience is a little bit underwhelming. Add to that that the restaurant was completely empty on a Friday night when we walked in, and we seriously questioned the Yelp reviews.

Wouldn't say the food is 'amazing' but it's good to very good. The ingredients are fresh, and it's clear that the chef has put some thought and effort into constructing the meal. The dishes are simple, but there isn't a lot of inspiration to the menu -- don't expect menu items that are incredibly creative or out there.

Had the grilled portobello mushroom appetizer which was delicious because of the balsamic reduction. The jumbo pasta shells filled with tomato, chicken and mushrooms were fresh and fairly tasty. 

Avoid the house wine. Tasted like grape juice...and we made the mistake of ordering a whole bottle of it. Probably in the top 5 for worst red wines I've tasted...ever.

The chef and his wife are probably the most hospitable restaurant owners I've ever met. The chef came out with free salad and free creme brulee and was extremely attentive to our dining needs. His wife was equally welcoming. Overall, I would have probably given this place 3 stars but the owners are just so nice and with all the freebies, had to give this place an extra star!"}
{"text":"I was curious to try the lobster ravioli that is posted on the black board outside in front of the restaurant. Chef Marino was great in recommending something for my husband. He ordered the carbonara. While we waited for our main meal chef Marino made us breaded cauliflower with a tasty home made dipping  sauce for us to try. He is very passionate about food and keeping the traditional Italian cooking. I should also mention Marino is Korean. He lived and worked in Italy for many years and speaks fluently Italian. The food was delicious and Marino's company was very entertaining. We finished the night with homemade creme brulee and a tasty drink of samboca and guava juice. It was a great night and will be back soon with some friends."}
{"text":"Both food and service are great, complimentary appetizer and dessert. Even though it may not look fancy from outside but the food is very delicious, will go back for sure!"}
{"text":"We had a wonderful meal here. The chef was personable and friendly, the food was delicious and he was very generous. The four of us got an appetizer that came with 6 portions- he gave us two extra so it would be even. Then after dinner and drinks, he came out with some fresh honeydew melon drizzled in honey as a dessert, free of charge! I didn't even think I liked melon, but this was delicious.

My pasta was wonderful, full of flavour. We all really enjoyed the food, and will be coming back."}
{"text":"Went there on a friday night before 6pm.  We were greeted by the very friendly chef and owner (waitress comes after 6pm).   Saw photos of him on the walls back from the early 90's, looking young and training/working with various Italian chefs.  Food is rustic Italian, reminiscent to some of the meals we had in the Italian countryside many years back.  Don't expect much from the decor though.  The caesar was ok, but the fried cauliflower dough was a bit limp (creamy dipping sauce was good though).  For mains my wife had the grilled whole seabass which was very nicely done.  I had the lobster ravioli with tomato sauce which was very tasty.  Kids had the beet gnocchi with mushrooms which was moist and tender, reminding me of the gorgeous Mario Battali gnocchi that I had in NYC.  We also got free raspberry and pommegranite gelato, which was perfectly tart and not overly sweet.  Free parking on Landsdowne ave too.  Definitely a place worth trying."}
{"text":"Wow 5/5. Best Italian food I've ever had. Marino the chef is a nice guy who has pride and confidence of his food. Everything we tasted was amazing. I wish this place was closer to home! if your in Toronto and want Italian food this is the best place to go. Thank you Marino."}
{"text":"The food here is amazing!!  We had the spaghetti carbonara (special of the day), grilled calamari and seafood pasta.  All very savory and tasty!  They also gave us grilled zucchini with sweet potato as an app and tiramisu on the house!  Great dinner overall.  My only complaint is that the food took a really long time to arrive - but probably because it was quite busy and its a small family owned business with limited kitchen staff.  I was also really hungry and tired so maybe that made it seem longer than usual!  Still yummy and would recommend!  :)"}
{"text":"Found it by chance (by yelp, actually)  and very glad I did it.  Excellent food, I don't know if it was because we went on a Thursday, but the chef was doing everything, he managed to take care of us though. Best pasta in Toronto! And he offered a desert for free at the end of the dinner. Can't ask for more."}
{"text":"Chef Marino is a very interesting person and he worked in Italy for 7 years. The small Restaurante delivers authentic Italian seafood dishes. We tried the seafood soup, linguini alle Vongole and lobster spaghetti. The seafood is very fresh and proper cooked. When I tasted the bread dipped into the seafood soup, I knew we came to the right place. It is authentic. Lobster spaghetti is a must try. The lobster is fresh, delicious and not over cooked at all. The spaghetti absorbed all the flavour of the lobster.  I think this dish beats all the Italian restaurants in downtown Toronto, including terroni , Buca and Mercatto. Agio is a small and welcome restaurant just like any local restaurants we went to Italy. It's def a hidden gem in Toronto. I highly recommend it if you're looking for some authentic Italian cuisine dining experience."}
{"text":"Wow, blown away by service and food! Will 100% be back, everything about this place was so great!"}
{"text":"BLOWN away! 

Why would anyone have something negative to say! Sure the chef runs the front of the house, serving you and cooking your meal but boy was I in awe of how he danced around managing to do so with such effectiveness! 

One can certainly appreciate the skill that requires! So of course service could he a tad slow, but way beyond acceptable! Service was impeccable considering. 

What's more important is the food - everything was fantastic was beautifully prepared! Flavours spot on, pasta cooked perfectly. HIGHLY recommend the grilled King mushroom appetizer... So simple and yet so full of depth, meatiness (though vegetarian) and smokiness! Mushroom ravioli was the daily special, it was delish.  The butternut squash ravioli was amazeballs! In a deliciously unconventional Alfredo sauce. Lobster spaghetti in tomato sauce was also great, tons of seafood brothy flavour in the sauce. 

Lastly the creme brulee was impeccable (much preferred over the tiramisu) - such a perfect velvety texture. 

Only complaint, or recommendation rather, is that the washroom needs a facelift.  Low ceilings with cobwebs and toilets that look 100 years old. It's very claustrophobic in there, but wouldn't stop me from coming back! 

Highly recommended! A glowing 5 stars."}
{"text":"This restaurant is literally one of a kind. Chef Marino is quite the character and runs the entire restaurant himself (cashier, server, bartender, cook, dishwasher). One must appreciate the fact that he can run a well-reviewed establishment himself. Occasionally, his wife helps him out on the weekends. My family and I went here to celebrate my sister's graduation from college. The restaurant is very small and in the Corso Italia area.  We were one of the only two tables to eat at the restaurant on a Tuesday night. We ordered a variety of dishes including the lobster ravioli, gnocchi, spaghetti and meatballs and penne a la vodka.  Chef Marino started us off with a few appetizers on the house: baked zucchini topped with crushed squash and drizzled with balsamic vinegar & a plate of bruschetta. This helped suppress some of our appetite since we had to wait a long time for our main entrees to be prepared since he was the only person working. When our entrees were ready, only three came out at first and the two lobster ravioli dishes came out almost 15 minutes later so we could not all eat at the same time. 

The gnocchi had the perfect level of chewiness with the sauce adding maximum flavour to the dish. The spaghetti and meatballs dish was standard, but the kicker was that it came with 10 HUGE meatballs. However, the winners of the night were the two lobster ravioli dishes.  Nothing is better than freshly made pasta with sweet lobster tucked away inside. The rose and peso sauce were perfect for the dish. 

For the cherry on top, he gave us 3 creme brulees on the house.  

Overall, food was great, Chef Marino was one of the most interesting restaurant owners that I have talked and the restaurant ambiance was very interesting.

PS - Just be a little patient when it comes to your meal as Chef Marino does everything."}
{"text":"I came here for dinner after exercising looking for some pasta. Amazing food and experience one of the best places I have been highly recommend it. Not busy on weekdays great for days."}
{"text":"Ok so I admit I was confused when I walked in and saw a Korean chef.  But this guy is solid.  Trained in Italy and used to cook for the Pope (or his staff maybe?), allegedly, in his summer retreat (not the Vatican).  He spoke fluent Italian and was very proud of his Italian training as a chef.  

The dishes were all made with the utmost care and there is indeed a sublime quality to his cooking that stands up to my need to eat at Angolino (which is presently shut down for renovations at the time of this writing).  It didn't disappoint.  I'm not sure which is better and I might have to do a blind taste taste of 5 or so dishes before I could truly say, but it's close enough to at last be a real close second, at worst.  

There is a richness and purpose to his flavours and he comes across as a bit of a mad scientist (in all the good ways) and he's a fun and sympathetic character who will talk both of your ears off if you let him.  Great guy, great food and he really takes pride in what he does.  This is cooking with love.  

I give 5 stars because there's no 4.5 option and if I had to round, I'd feel bad rounding down.  Yelp should allow half star ratings to get clearer averages imho.  Get your isht together already, Yelp!"}
{"text":"Delicious and authentic Italian food for a very reasonable price. The chef was extremely friendly and everything served to us was incredibly fresh. The portions were more than sufficient and the pricing was affordable. 

The only negative was that when my sister and I went the restaurant was completely empty, so you might have a quiet atmosphere. But the food is definitely worth a visit!"}
{"text":"I've lived in the junction for several years and just made my way to Agio this evening. After my meal I only have one question: what the hell took you so long, man? This place is fantastic. You should feel bad for your poor life and restaurant choices. 

I had the gnocchi, cauliflower fritters, spaghetti ai frutti di mare and seafood soup. I went wife my wife and no I'm not some eating machine. The dishes were all perfectly seasoned. By that I mean they didn't leave my mouth dry because of too much salt. The gnocchi in particular was excellent. Nice and light without any starchiness. 

The chef is a real character and I encourage any potential diners to get to know him. His story is fascinating and I won't ruin it for you. 

There are a few hundred Italian restaurant options in the city. That's a fact. This Italian restaurant is the bees knees. Also a fact."}
{"text":"Chef Marino is the best. An insane part of the dining experience - first time this has happened in all two decades of life. The man came up to me and said don't look at the menu, tell me what u want to eat and I can make it. Of course many things on the house - zucchini, and the amazing creme brûlée. Torching it in front of us and having us crack through the caramel to reveal fluffy cream eggs underneath. Blew my mind. 

He made great conversation about his learnings and opinions on random things. Be prepared to talk with the chef - I had the best Alfredo fettuccine ever. He said his tomato sauce was better so I'll be back for that."}
{"text":"Really, really excellent food - pasta and appetizers are so very tasty. Some of the best fresh pasta and sauces I've had. The owner is hospitable and goes above and beyond to please his customers. The atmosphere is quirky, but for a neighbourhood restaurant on the St Clair strip, this place is among the best."}
{"text":"Best Italian food I've ever had. Don't think twice, just go to this place now!

P.S the Chef and staff are awesome"}
{"text":"I FOUND MY GO TO ITALIAN RESTAURANT FINALLYYYYY!!! PEOPLE! LISTEN UP! If you are a fan of pasta/italian cuisine, DO NOT hesitate to hit this place up for some tasty goodness!!!

I came here on an evening with one of my good friends and despite us having some food a bit beforehand we realized we should probably get a proper meal in at the appropriate time. It was completely quiet on a Monday evening but the owner, Marino, told us usually this was the case so we were like oh....ok? Meh, quietness while enjoying a meal is nice too :) furniture seemed to be a bit...old school-ish? But that entire restaurant kind of exhibited that feel when we first walked in and of course we saw the Yelp pictures so it matched.

Now onwards to the FOOD! I SOMETIMES have trouble deciding when I'm caught between 2 things that sound good so I resort to asking the server usually, in this case, the owner. It was between an eggplant appetizer and the caprese salad cuz I was craving some greens too (and not gonna lie, I've heard of caprese salad but actually don't know what it was or how it looks like...I KNOW! My excuse is im no hardcore foodie? :P) anyway Marino suggested the caprese salad and it was yummy! Refreshing if you will! Marino was even generous enough to make us a taste tester for the eggplant app and MY MY it was gooood! I'd def get that next time I'm back! Next I ended up ordering the seafood spaghetti and my friend ordered the gnocci dish (I don't want to say the names haha and plus I forget but I'll include the name in the photos). Needless to say THEY WERE DEEEELISH!!! LIKE I SAY DEEEELISH DEEEELISH DELISH! Not some ordinary pasta you'd expect to find in let's just say East Side Marios. You could TASTE QUALITY AND FRESHNESS! On top of that, Marino told us he makes everything fresh and uses fresh ingredients everyday and I actually saw him making part of the meal from scratch. No pre-made business here! So freshness and yummyness guaranteed! Lol if you can wait. But the wait is worth it! In fact, for my meal there, he was pretty good with timing the food coming out for us. We weren't waiting too long for each order. But then again, we were the only ones there so can't say how it is when it gets busy. But I would still wait if it was busy because I know I'm getting the good stuff. We were stuffed when we finished (probably cuz we ate a bit beforehand) but I told my friend I couldn't stop eating until I was finished because it was THAT delicious for me! It's like one of those times where you are full but the food is so good you want more...this was one of THOSE times for me haha! That yummyness HAD TO BE IN MY TUMMY OR ELSE...!!! LOL

Lastly, the service was superb. Not because of the complimentary taste tester or the creme brulee we got at the end but because of how honest and friendly Marino was. We held friendly conversations and he cares about his customers and how they feel about their experience and food. On top of that, he ALWAYS asks about any food restrictions or allergies because he understands how impactful it can be in someone's life! Rarely do any waiters or waitresses in bigger restaurants ask that and the customers would have to mention it because it's \"expected\" they figure out what food on the menu works for them. It's the little things that go a long way especially with service. This question may be a small move for some but to others it's that big of a difference in whether you will enjoy your experience there at all or even moreso because of that. Needless to say, service was a 5/5 in our eyes.

To end, this place is an awesome little restaurant in Toronto and I urge others to try this restaurant if you are looking for italian food. It won't be a disappointment!"}
{"text":"Quaint and quirky place. Food, service and overall experience was very non-pretentious and enjoyable. Appetizers were excellent, especially the king mushrooms. Calamari a little rubbery but still enjoyable and the vegetables super fresh. Lobster pasta and risotto were very generously portioned with the lobster super fresh and tasty. Would like to go back and try the homemade gnocchi--looked like a standout."}
{"text":"Disappointed... especially since this is a highly regarded restaurant. I also wasn't impressed of the crumbs that encrusted the tables and seats...

The spaghetti bolognese was decent but it lacked flavor; minced garlic would have been a nice addition to the dish. The dessert was too sweet for me... After eating the creme brulee, I can say that I do not like creme brulee. 

However, the service from the chef was nice, along with the appetizers which were on the house.  

Overall, Agio is adequate but it's pale in comparison to other Italian restaurants."}
{"text":"This was excellent food. A hidden gem :)"}
{"text":"I don't have enough good things to say about Agio! Just be careful not to miss it, since it is a bit small. 

The bread that is first served is very, very good.  The first time I dined here, we received a zucchini/squash appetizer. The second time, we had grilled asparagus.  Though I usually would pass on zucchini, both appetizers were so delicious!  Marino's chicken alfredo linguine is amazing. His alfredo sauce is the best I've had! They tend to be heavier, but Marino's alfredo sauce is creamy yet much lighter than many alfredo sauces.  The pasta is also freshly made, and it definitely contributed to how tasty the dish was. 

My favorite part of both meals I've had at Agio was the crème brûlée.  The layer of sugar was thicker than I was used to and was never burnt, and it paired very well with the lightly sweet custard!  

Marino, aside from being an amazing chef, is such a sweet man!  We came at rather late hours of the day, and he still was so accommodating.  If you're the kind to love conversation and stories, he'll be there to humor you!"}
{"text":"Access
Someone pat me on the back, I successfully parallel parked on the streets of St. Clair Avenue lols. This street isn't super busy on a weeknight, but I can imagine it being a nightmare on weekends. *Wipes sweat*, my boyfriend didn't care that I got to the restaurant on time and with amazing parking skills. Download your Green P app before coming down =)

Service
It's not very common that you see Japanese (?) waitresses at an Italian restaurant. Not trying to be racist here, but they usually work at places like Guu or some other Asian shop. I have a thing for Japanese servers, they are genuinely interested in serving you and are super polite. Even in Japan, they really care about your dining experience but if you tick them off, they do get angry lols (this happened with my dad). The waitress can speak English without any issues, but might need prompting here and there. For example, she didn't understand what draft beer meant or why some customers asked for the prices on their 'special' menu lols. Anyways, no harm, moving on. Of course restaurants will rip you apart on Valentine's Day, it was a whopping $45 per person. I actually looked up the menu for this restaurant before coming and noticed it was fairly priced...but not today my friend. Almost everyone who came in that day asked about their regular menu, but the nice waitresses just kindly said \"no\" and moved on lols.

Food
ORDER THE CREME BRULEE. I've never seen my boyfriend not share desserts, but he did this time. That creme brulee is heaven topped with MORE HEAVEN lols. It is super smooth, flavour is not too strong, the sugar crust is crisp and tasty..WHAT MORE CAN I SAY?! The Tiramisu sucked in comparison. I gave this thing a solid 9.4/10 - that is the best praise I can ever give a creme brulee, so let the world know that Agio has one of the best.

Soup - The lobster bisque was too salty, but that piece of meat (well seafood) was yum!
Bread - Soft, but could be better
Gnocchi - Impressed.  It was all kinds of flavours blended into one.  I love the sauce, it had a tint of sweetness - almost like it was asian-fied.  Difficult to explain, just eat it.
Calamari - A little tough but taste was good
Lobster Ravioli - Was crunchy on the inside, sauce was super duper, but unimpressed that I found pieces of cartilage.  Given that I only got 2 pieces, I don't like how 15% was not edible fun."}
{"text":"UPDATE: I received a phone call from the chef of the restaurant. He saw my review on Yelp and left me a heartfelt apology about my experience at his restaurant. I appreciated the gesture very much.
-------------------
Very disappointed! I was so excited to eat here with 3 of my friends especially after reading these very positive and enthusiastic reviews. The food was mediocre 2.5/5 but what was worst was the service. The chef doubled as a server and I'm sure although he meant well was incredibly disruptive to our dining experience. He would not stop talking, be unaware of the social cues of our table and was at times offensive. At the end of our meal the group of us sat and talked and he just stood a few feet away reading a magazine hovering over us. His presence and conversation made us uncomfortable. I would not suggest going here."}
{"text":"Owner is fantastic. Very honest and humble guy. Food took longer to make, but it was was all fresh. Lobster ravioli... Just try it.. For the price you are paying, it's worth it. For the same quality of food at a different resturant, you will be paying upward to $80-$100. Definitely recommend."}
{"text":"Worth a visit.
This is an unprepossessing little restaurant on St Clair near Dufferin. The room is small and slightly haphazardly decorated.
The wine list is very limited, but we found an Italian Merlot to be okay.
The service is enthusiastic rather than professional.
The food we found to be excellent.
We were given an Amuse-bouche of zucchini and squash to start which was a pleasant surprise.
The cauliflower frittatas were excellent, crisp and not oily, as was the eggplant grilled with spinach and ricotta - very tasty.
The lobster risotto was spectacular; be prepared to take the meat out of its shell, the broth and rice were lovely.
The chicken linguine Alfredo was excellent, good taste, fresh pasta and well assembled.
Although it is rather out of the way, it is still worth the trip."}
{"text":"I don't know if they had an off night but...some food was not cooked, overall experience was terrible. Everyone in the restaurant was complaining they weren't getting their food. Or one person at the table wouldn't get their food and everyone else did. The service was atrocious. Came for a bday so sorry we did. Sorry to the restaurant for this awful review but this was brutal. Waiter didn't even know the menu or the basics."}
{"text":"The legend is true... Chef Marino really does it all himself! I've never met a more engaging and personable chef. He's just as much a part of the experience as the food, which was amazing. He cuts no corners and has respect for his customers and his craft. It's not upscale but really who cares - go for the food and hospitality!"}
{"text":"What an absolutely delightful spot!

We came in on an incredibly blizzardy night, because when the rest of the world stays indoors, we like to brave the snow and... not cook. We were welcomed by Marino, the owner/chef/server. As soon as we sat down, he brought a teapot full of hot green tea to us and I was instantly in love. I don't know if this is a usual thing to do, but nothing says lovin' like a hot cup of green tea after a 15 minute walk through a cold snowy evening.

He was very friendly and wonderful all evening, and despite the fact that he was also cooking and serving another table, we never felt neglected. We got the bruschetta (tomato only), which was excellent. The Hubster got the chicken alfredo, which he loved, and I got the spaghetti bolognese. The sauce was a bit on the sweet side but the pasta was cooked perfectly. The servings were perfect.

At the end, he asked me if I was certain that I couldn't have dairy, then apologized as he presented a creme brulee, on the house, to the Hubster. DAMMIT. 

Everything was very fresh and service was excellent. Prices were quite good, very comparable to the more popular Marcello's down the street, but the food was MUCH better. We'll definitely be back!"}
{"text":"Chef Marino and his wife run this local restaurant and If you can ignore the decor of this tiny little restaurant with 10 or so tables -you will be amazed at the quality of the food served.  This is italian food!!!   The warm spinach salad with olive oil, garlic and white wine is delicious, caprese salad with or without buffalo mozarella ...mmmmm.  Pumpkin or potato gnocchi - fresh and the perfect consistency.  Grilled whole fish with tasty crisp veggies...  decided to go all out and try the rabbit stew with polenta - and I was not disappointed and ended with tiramisu... prices are great. Like the previous reviewer, Marino is Korean and his training and living in Italy  (see the pictures on the wall of him with other famous chefs) comes through in his dishes....  he also speaks fluent Italian..."}
{"text":"Whoa! You won't believe it until you experience it. Seriously. Just go here.

One of the best dining experiences I've ever had. 

So much has been said about the awesome food. But what I'd like to share with you is how warm and friendly the service is here. Chef Mario treats you like family. Eating here feels like you are eating at your childhood home. Chef kept surprising us with complementary appetizers, and dessert, and allowing us to change our dish in any way we wished. He was accommodating in the way a parent would be to their child. It was incredible. He was personable, and engaging. He talked to us about many interesting things, that made it feel like I was talking to an old wise uncle.   

I wish more restaurants treated their customers like this.  

The food is awesome(well portioned, and tons of meat). The experience is at an unprecedented level of friendliness. I am definitely coming back."}
{"text":"We visited Toronto from Colorado and this was our first stop after getting off the plane. It was a blessing and a curse as it was the best place we ate at during our trip so every time we got a mediocre meal, we swooned about missing Agio's dishes. We had to come back on our last day of the trip. 

The restaurant is quaint with paintings of regular customers done by the chef's wife. And what a great chef! I haven't had amazing food like this in ages! Pasta was perfect al dente and everything was at the perfect temperature. He brought us out some sort of complimentary zucchini and mushroom appetizer we didn't order but we delightfully devoured. Personally, I do not like zucchini or mushrooms but we had two dishes including them and they were delicious! That's how you know you have a great chef. They can make something you usually hate, taste amazing. Hell, I even learned the correct way to pronounce the dishes. I had no idea I had been saying everything wrong all this time haha"}
{"text":"I would select half a star if it was possible. I came here today with my boyfriend and sister and at first I was hesitant about going inside but from the reviews I decided not to judge a book by its cover. 

THE FOOD WAS HORRIBLE. Worst meal I have ever had to day. We got two lobster raviolis and a chicken Alfredo. That restaurant should under no circumstances be labeled as italian, the inside of our lobster raviolis tasted like EGGROLL!! 

Please save yourself the time and don't bother. 

You're welcome."}
{"text":"An plain restaurant from the outside but all the positive reviews from yelp drew us to this homey restaurant. The food was phenomenal! I am pretty sensitive to overseasoning and salty food but everything was just right and served piping hot. 
Chef Marino is very personable and came by to make sure everything was taken care of. 
Will definitely come back and try other dishes!! 
Make sure you ask about the portrait wall!"}
{"text":"Absolutely spectacular Italian food. Solid 5 stars. Walking into this restaurant feels like cottage, where it's a little run down, door is open, and washroom, I am short and the ceiling is low( never felt that tall before) Took me awhile to figure out the washroom as I was so focused on the bears hanging on the door.

The chef's wife paints really well. There were paintings on the wall done by his wife and the portraits on the side are the frequent customers, painted by his wife.

Table cloth was kind of like ones that your friend doesn't want but during university years, you will take it because you will take whatever is free. 

Having said all of that, the food was worth the lack of decor in the restaurant. It speaks for itself.

Appetizer: The oyster mushroom has a beef/steak taste to it. It was smoky and flavourful. 

The lobster ravioli (I selected the one with alfredo sauce) was around $42 but the pasta was cooked al dente. Big chucks of lobster inside. Worth every penny. 

The clam pasta, you really have to eat it with the clams otherwise the pasta does not have enough flavours. 

I came in feeling not hungry but walking out wanting another plate of lobster pasta!!!!

Tip: call to make reservations in advance, limited spots and chef is particular on that!"}
{"text":"Chef Marino is a unique story that has lead to great food and a very personal experience - something that seems to be disappearing in Toronto. My family will definitely be back."}
{"text":"We were house sitting for a friend in this area and got recommended this place. We went for dinner on Friday and had one of the best dining experiences in Toronto. We live in the financial so all the restaurants are very fast paced and we are usually in and out of dinner in an hour. This was more of a slow and enjoy every moment dining and it was amazing!! Chef Marino made it so welcoming and you could tell he loved what he did. We got the grilled eggplants with ricotta cheese 5/5, gnocchi special 5/5, spaghetti with meatballs 5/5 and he made up this amazing app that came out right after the bread and oil. He kept saying slow down... slow down! We had to pause because we were enjoying it so much and not taking our time. We had a bottle of wine with dinner as well. At the end of dinner we brought over crème brule which was SO GOOD!..... after dinner he sat near us and we had a great chat. All I have to say is EAT HERE! We will be making the trip a couple times a month... probably more :) 

THANKS CHEF MARINO!"}
{"text":"Excellent and fresh food. The owner/chef is a great character, and makes you feel at home. I had the calamari fritti, bruchetta trio, gnocchi alla boscaiola, and tiramisu - all of which where great. Love the small intimate interior as well."}
{"text":"Such a cute place! There is only a capacity for maybe 50 people here, but it makes it a very intimate atmosphere. There were only two staff on site, the lovely lady serving us, and the very friendly and kind chef. I had a mushroom pasta and it was really good, while my dining companion had a penne a la vodka dish and was impressed. They gave us a free appetizer (zucchini stuffed with squash - AMAZING), and that was actually my favourite part of the meal! The chef came out to speak with us as the restaurant wasn't too full, and he was super friendly and nice. He told us about how he was trained in Italy and lived there for many years, really cool. I would recommend this place if you are on St. Clair and looking for a low-key meal :)."}
{"text":"The food is very tasty and fresh. My boyfriend and I went for my birthday recently and the whole experience is great!!! :) quality food, the owner is very funny and nice, he offered us cream brûlée  on house also lit a cute little candle for me  definitely would recommend this place for close group of friends or family dinners!

Make sure you reserve in advance and come at the exact time tho, because it could get super busy and you'd be waiting."}
{"text":"Don't be put off by the kinda-strange appearance, Agio is as good as any Italian restaurant in Toronto. The prices are good and chef always gives you a little extra.

Went there for dinner for my birthday, gave us an extra appetizer to share as well as deserts. Everyone enjoyed their meal- the lobster ravioli was fantastic. I have always had great luck with the specials here and this was no exception. This place is definitely a hidden gem."}
{"text":"This is a nice little place run by a lovely man. He so obviously cares about every dish he makes and that all his customers are happy. My boyfriend and I have been for dinner and, most recently, lunch. Both times the owner/chef/server (the same person) has been friendly and attentive, and both times he's brought us a free appetizer and free garlic bread. At dinner he brought us free creme brulees. 

The pasta is really good. We ordered the spaghetti meatballs at lunch and instead of coming with three meatballs, as with a lot of places, our dish came with more like 10. 

A guy who truly cares about his food and restaurant, reasonable prices and delicious food (plus freebies)--what more could you ask for?"}
{"text":"Amazing food!!  I would only recommend eating here if you have time to enjoy the food since at times it's a one-man show and it may take a while to get your meal.  I truly enjoyed all the things I tried here starting with the complimentary bread.  It was warm, crunchy on the outside and chewy in the middle...simple exquisite. 

Straciatella Soup$7.50  - This Italian egg drop soup is addictive and I had it every time I came here.

The chef brought out a complimentary zucchini bite appetizer while we waited for dinner and it was finger licking good.  The zucchini is grilled and topped with butternut squash and sauce.

Lobster pasta $38 - Daaaamn, this dish was hella delicious.  The lobster was fresh and meaty.  The pasta was perfectly cooked and covered in delicious tomato sauce.

Cauliflower Fritter $10.50 - These lightly breaded and deep fried cauliflowers were so good on their own that I didn't eat much of the 2 different dipping sauce that accompanied them.

Spaghetti Carbonara $18 - Loved it!  The sauce was creamy and flavorful.  The pasta was cooked just right.  Simple dish, but very satisfying. 

The dessert game here is not as strong as the rest of the food.  They offer tiramisu and crème brulee for $8.

Street parking right on St Clair was free and easy to find on a weekday.

....| \      _  , , , - - , ,  _  ,      
.../  , ` . - ' ` '             . _   \ -  ;  ;  ;  , _    
..| ,  a  -   )   ) _         . ; .  (   ` - ` -  ' - '   
'  - - - ' ' ( _ / . _ ) - ' ( _ \ _ )   2018"}
{"text":"I had dinner here last night with my dad to celebrate my birthday, and there aren't enough words to describe how amazing this dining experience was. The interior of the restaurant looks like it could use a little of a refresher, but don't let that stop you from enjoying the food here. I had a delicious,
homemade beet gnocchi, and my dad had a steak cooked to a perfect medium rare with fresh vegetables and a small side of penne noodles in a marinara sauce. There weren't many of us there, but the chef kept us entertained and happy all night, ensuring everything was perfect, and keeping up conversation with the dining guests. I wouldn't hesitate to eat dinner here again and my dad already can't wait to take the rest of my family when they visit Toronto again."}
{"text":"To my surprise actually pretty amazing.  The owner and his wife are also very nice people.  I used to live down the street and would love to constantly order their spaghetti meat sauce pasta.  My oh my, I do miss it there since Ive moved.  It hits the spot, the taste is delicious.  
The place is a little outdated, bathroom could use a little renovation love.  a tad run down, but the food makes up for it, and thats a rarity, when the food is so good that you still give 4.5 stars...even though the place is....well you know."}
{"text":"If I can describe Agio in one word, it will be \"flavor\". 

Agio is a small and unsuspecting Italian restaurant solely run by Chef Marino. Chef Marino has an intense commitment to freshness, quality and technique, which translates into immaculate execution of flavors in all of his dishes. These were some of the best traditional Italian dishes I have had. 5 Stars. 

For dessert, Chef Marino prepared a beautiful creme brulee that ignited our food senses. The texture of the fluffy underside combined with Marino's perfectly caramelized top forces your brain to try and make sense of all the delightful sensations going on in your mouth. This was a dessert that certainly made you think. 5 Stars. 

Through and through, Chef Marino has an elite command of Italian gastronomy. 

I also discovered that Chef Marino is a graduate of the prestigious Italian Culinary Institute and trained for over 7 years with top Italian chefs at restaurants including the Four Seasons in Milan. This was on top of a 6 year cooking tenure focused on Italian cuisine.  To say the least, Chef Marino is as technically grounded in Italian cuisine as any great chef can be."}
{"text":"Never judge a book by it's cover. While wandering the Corso Italia on a Monday evening a sandwich board sign advertising Lobster Ravioli caught our eye. When we walked into Agio our first impression was: \"Uh Oh, the place is empty and the guy in the chef's duds is Asian.\" Despite our apprehension we decided to stay, and thank goodness we did!!

The owner/chef - Marino -  greeted us warmly and immediately engaged us in conversation. This was the next twist in the visit. The man's accent is very unusual, we just couldn't place it. Upon asking we learned that he had studied cooking and worked in Italy (for nine years), that his first language was Korean, his second was Japanese, and his third is Italian and his fourth is English. And that certainly explained why we couldn't place his accent.

Now on to the next twist. This Korean chef is a master of Italian cuisine. Upon his recommendation we ordered the Trio of Bruschetta, which included Grilled King Mushroom, Roasted Peppers and a traditional Tomato Bruschetta. Each and every iteration of this classic Italian appetizer was marvelous. We could have sat there and eaten plate after plate accompanied by delicious pinot grigio all night long. 
Mushroom lovers will love the giant King Oyster mushrooms in a reduced balsamic sauce, the sweet peppers are drizzled in a fantastic olive oil and the tomato bruschetta was wonderfully balanced (not too soggy), all of this served on crunchy garlic infused crostini.

Then the star dish came out: the Lobster Ravioli. What can we say? There were five big pieces of ravioli generously stuffed with tender and sweet lobster meat, in a lovely cream sauce with pesto lightly drizzled on top and some fresh tomatoes. It was a symphony of perfectly balanced flavours.

Marino treated us at the end of our meal with a free Tiramisu for us to share, and it was one of the best we've ever had. Perfect lady fingers in coffee liqueur and heavenly mascarpone were matched perfectly by a delicious coffee to complete the dessert.

We loved it so much we had to return. Upon returning we enjoyed the sauteed mussels and clams as well as the seafood spaghetti. All his seafood is fresh and delicious, perfectly cooked so as never to be rubbery, and the tomato sauce is always balanced with no acidity and gently spiced to give it some body.
This spot is a hidden gem in the neighbourhood, one not to be missed by food lovers. ENJOY!"}
{"text":"Place is dirty and old. Service is excellent. Food is really good and you can see that the chef is really passionate by Italian cooking. However, the place need a serious good clean and adding A/C would be great"}
{"text":"I usually don't go for Italian food in restaurants because I am Italian and most places don't compare to Moms cooking.  Had the gnocchi here and asked for a red sauce and it was excellent, my wife had spaghetti bolognese and she loved it.  Go here if you want great Italian home cooking and friendly service."}
{"text":"We had a great time at Agio. Chef Marino was witty and funny. His food was all fresh, incredibly flavorful, and portioned perfectly. We learned a lot about Italian dining and about his life in general. He is serious about all things Italy and good food, in all the right ways. As if it couldn't get any better, this place is very reasonably priced.

I recommend this place, and even more so Chef Marino, whole heartedly!"}
{"text":"This place is very shabby with plastic table clothes and cluttered surfaces.  It's expensive for such poor atmosphere and food is average.  I had lobster risotto and it was a massive pile of rice that resembled paella on a whole cut up lobster with a whole chilli mixed in with lobster shells.  The chef is nice. Server was unfamiliar with menu and not experienced.  We took another couple here last week because we read positive reviews but I'm perplexed at how our experience was so different."}
{"text":"I wanted to give this pace 5* because of their great service and freebies. I mean, it's a cute, tiny place, the 2 people who were staffing (older Asian man and youngish Asian girl) were nice, and they gave us a free app (squash on zucchini with some type of sauce) and a free crème brûlée at the end: 1 for 2 to share. 

So service-wise, it was a definite 5/5. I felt like a real VIP here. 

Carbonaras ($17) looked great and so did the coffees. However, they had run out of Italian coffee, so that was a tad odd. 

I had the lobster pasta in red sauce (that's actually its description, and the price of $38 was not disclosed in the menu). Man, that was a GIANT plate. Getting the meat was a real workout but worth. They gave a whole lobster with the proper equipment and lemon water so I didn't smell like PEI after. 

Lobster was good, I'm sure, but the sauce was too overwhelming to get the taste of lobster. Then again, lobster is generally mild but still. Pasta texture and all was great. Sauce was a little spicy but I think I should have mixed it all up first so the spice wasn't just on the top. 

Crème brûlée was great! The caramel was a little thick but I guess some like it thick. The custard was very smooth, no lumps, and it wasn't cold. I know that's a weird expectation but I've had cold, liquid custard before... as a crème brûlée. I def recommend this dessert. The portion was just right for 2 people. 

Would I recommend? Yes, because it's at an average price (maybe $1 pricier than other places) but with spectacular service."}
{"text":"What a great little find! My husband and I had a lovely dinner here tonight. The grilled calamari was done to perfection and the warm bread a treat. The chef was super friendly and the food was fantastic. Perfectly al dente fresh pasta with delicious tomato sauce. My husband had the lobster pasta and I had the seafood pasta. Portions were large so plenty to take home for lunch. Lots of extra goodies such as an amuse bouche and tiramisu on the house to end the night. We'll be back!"}
{"text":"Awesome is the one word that describes this marvellous little restaurant, totally worth every cent you spend. Treated like royalty, the best tiramisu we have ever had. I left a huge tip as the prices are way lower than the quality of the dishes  demand. Our new favourite place for Italian."}
{"text":"One of my favorite spots! Their pasta and desserts are amazing. The owner was really friendly"}
{"text":"I never give out 5/5. Wow was with three people and they all said it was the best pasta meal of their lives. These are 30 year olds. Wow!!!"}
{"text":"W-O-W.  A 1-man show that really can do it all!  

I am just so floored from last night's dinner...you walk in, and this Asian man is speaking to the table of 3 already seated in Italian!  Then, he breaks out in other languages -- he knows 5 in total.  Then, my own party of 5 gets seated, and I'm thinking to myself -- this is going to be one helluva gong-show with only 1 guy working the front.  Then, we find out he not only works the front, he answers the phone, he pours the water, and drumroll please...he's the CHEF!  At this point, I'm really thinking \"what have I done now?\"  

THANK YOU, to fellow Yelpers who recommended this place.  For without you all, we would never have found this AMAZING gem of a place.  Don't let anything fool you.  This guy, Marino, runs a tight ship all on his own but that's not the only reason why you come, you come because the food is just amazing.  We all had great dishes last night.

He started us off with some on the house bruschetta, bread and oil/balsamico.  Then all our entrees were all delicious -- the tagliatelle with meatballs, the spaghetti bolognese, gluten-free penne a la vodka, and the sirloin steak with potatos and veggies.  All were just fantastic.  Then he gave us some beautiful tiramisu and creme brulee at the end and it left us all wanting to come back again tonight, and we will come back...again and again!  And his company -- priceless.  Marino is a joy and his wife did all the art in the restaurant.  We all felt right at home there.  Next time, we're trying the lobster ravioli -- just call it in a day in advance and he says it is the best in all of Toronto.  Can't wait!"}
{"text":"We were a little skeptical after seeing only 3 reviews, but we took a leap of faith and tried out the place. We were so glad we did!! Like others mentioned, the decor is not the best and the restaurant is tiny. But the food was delicious and fresh. We had the gnocchi and the lobster ravioli. WOW. The gnocchi was good, but the lobster ravioli was amazing! Stuffed with lots of fresh lobster chunks in a creamy alfredo sauce. Chef Marino also threw in some extra appetizers for us in the beginning for free which was an awesome touch. The tiramisu was a great end to the meal and it wasn't too sweet like other places.

p.s. marino was a chef in italy and learned all his skills there so it should be authentic (although i've never been to italy myself so can't really say if it is or not)"}
{"text":"The owner is from Korea but he lived in Italy around 7 years. The food is indeed very good. He prepares it fresh and you can immediately taste it that he also does everything from scratch, no grocery ready sauce or pasta or no frozen vegetables... Real good quality ingredients used by a quality cocker!
Honest price, excellent food and great service! I recommend!"}
{"text":"I felt at home instantly. The food was delicious, with a lovely presentation and portions were just right. Chef Marino was attentive, hospitable and happy to make sure we had everything we wanted to enjoy our dinner. Not pushy in any way. Will definitely be back!! Also enjoyed the authentic Italian background music :)"}
{"text":"Lovely little restaurant. Don't judge a book by its cover believe me. I had the lobster risotto which was to die for. The chef will make you anything you want from scratch. Marino makes the pasta himself. My husband had a veal chop which was flavorful just needed to be a little more tender. An ambulance of comfort causal and family. I would definitely go back."}
{"text":"Excellent.  Close to home.  Great carbonara.  Creme brulee to die for!  Bolognese, yum!"}
{"text":"It's a small, unsuspecting Italian place with a remarkable chef. Everything Marino cooks is excellent. The restaurant is rather small, with only about 10 tables or so, but he can accommodate large parties with a reservation. 

Decor features portraits of the regular diners painted by Marino's wife. Marino is usually waiting on tables and serving guests, but his wife, Clara, is also present on really busy nights. 

The first thing you need to know is that Marino sets you up for a nice dining experience. He'll bring both fresh bread and bruschetta. One day when I came in looking rather cold without a coat, he brought me hot tea before I even said anything! 

Everything I've had there has been great, but the specials are usually the best way to go. They are especially fresh and vary regularly. I think my favourite thing that I've had so far has been the Gorgonzola and mushroom gnocchi. 

For dessert, I highly recommend the creme brûlée. The best I've ever had. One night they were out of brûlée, so Marino brought us some mango Italian ice cream, which was tasty as well. 

Definitely try this gem of a restaurant!"}
{"text":"1 start because we drove an hour to get to this restaurant and they wernt open yet it says its open from 11am to 10pm. We came at 3pm.

We were really hungry and didn't have a back up plan so were forced to walk up and down the street and settled for tacos."}
{"text":"After reading reviews (lots of five stars from people who did not review much), I decided to make the trek over here to see what was going on.

Here's the lowdown...

1. The decor is spartan. In fact, the whole place is the anti-hipster.
2. The prices are very good.  For $15, you can eat most any entree. Most wines by the glass are between $7 and $10.  My pinot gri worked perfectly with my pasta.
3. The food is quite good.  As mentioned in other reviews, the bruschetta is excellent.  They also do a really good job with gnocchi and chicken alfredo.  
4. The service is kind and helpful, if a bit unpolished.

Check it out.  Go between 6-9 p.m. or at lunch.  There is no late night scene here (or any scene), just good food."}
{"text":"Excellent food with an innovative flourish, served by the personable and interesting chef himself!"}
{"text":"Food here is amazing!!! Best gnocchi! No fancy decor, but simple, authentic, and flavourful food."}
{"text":"At first, we just didn't know what to make of this place: it's a bit eccentric inside. Once we met the chef and his wife, however, I thought we might be in for something special. Turns out we were. This is a totally refreshing restaurant. They are passionate about food, and they are charming, quirky hosts. The meal was fantastic. We had some eggplant roll as an appetizer and delicious tiramisu for dessert. I had the lobster ravioli as a main, and it was awesome. We left with huge, bemused grins on our faces."}
{"text":"It has been almost a year since I last dined with Chef Marino, and I have to say.. after last night's meal, I will never let that happen again. You know when the food is so good you just can't stop eating, even though you were full ten minutes ago? Indeed.

Came with three other friends and we had a fantastic meal. I ordered the chestnut soup to start, the lobster risotto for my main and the crème brûlée for dessert. The soup was very interesting and flavourful with a subtle sweetness to it.. I didn't know you could make soup out of chestnuts! The lobster risotto was amazing.. I am generally a very slow eater and while my dish was probably the largest portion-wise, I managed to finish before all of my friends. THAT'S how you know it's good! My holy grail crème brûlée up until now was the one served at Café La Gaffe, but this one that Marino makes easily took the crown. Sugar layer with the perfect thickness, cream layer with the perfect consistency and NOT TOO SWEET. The dessert has balance and it's just wonderful.

Marino being Marino came over to talk to us and entertain us with stories in between courses. He spoiled us so much as usual with extra goodies: two plates of a great zucchini appetizer, four bowls of soup even though we only ordered two, extra mini-portions of entrees other people at our table were having so that we could all sample everything, a bowl of legit white sweet potato for us to try just because, two extra desserts for us to sample (one of which was an amazing espresso panna cotta) and finally, a round of Grand Marnier/orange juice shots as a farewell toast for our friend Tiffany who will be flying back to Japan on Sunday.

If you haven't checked this place out yet, please do. Truly a hidden gem."}
{"text":"Great tasting Italian food, house made gnocchi are truly amazing . Great service , the chef/owner is quite the character. We received a complimentary fig creme brûlée courtesy of the chef, he had just made them a couple hours prior and wanted us to try it, needless to say it was delicious. Would definitely go back."}
{"text":"This place is so good. I would give it 5 stars if it wasn't so utterly charmless in its atmosphere but the food is excellent. The price point is good too. We were the only ones in there for an early dinner. We were served with charm and grace by the chef. The pasta had a lovely texture, the sauce fresh and sweet. The bruschetta trio, as others have mentioned, was brilliant. So delicious. I hope this place stays for a while I want to go again. The owner should hire a professional to decorate and renovate though. It feels like a place you go to for a great meal but if I was on a date and wanted atmosphere as well as food it wouldn't be high on my list. Yummy!"}
{"text":"Marino knows how to cook really well. I have had 5 or 6 different meals here and am always satisfied. Informal atmosphere and good wine."}
{"text":"I hate having to write 1-Star reviews, but after eating here last night I am seriously wondering if ill ever be able to trust a yelp review again. I'm not sure who these other people are that reviewed this place and if these accounts are even real but there is NO WAY this place could ever get a 5-Star review.

Anyway, I decided to take my girlfriend here after reading all the reviews on here. When we arrived there was only one other table with people on the place and I knew this was a bad sign and even considered leaving, but decided to trust the yelp community.

Upon entering we were greeted by the chef/waiter who was very nice. We decided to order the calamari and mussels to start and both had the gnocchi. We both had a glass of wine to start, and my girlfriends had a bug in it so she had to wait for the server to cook something in the kitchen before she could get a new glass (which the server happily exchanged). The server started us with some bruschetta on the house which was fine then we got our apps.

The seafood in both dishes was DEFINITELY not fresh and very tough. The calamari was some of the toughest I've ever had and my gf couldn't even finish it. My clams and mussels were also quite tough and did not look like they had been purchased that day. They were actually pretty gross but I tried to give this place the benefit of the doubt still (possibly in denial from the reviews on here).

Next the gnocchi was extremely oily. Again my gf couldn't eat it but I managed to get through it. The mushrooms in it were pretty awful and tasted like something you'd get in Chinatown. In fact, much of the meal tasted like they were using subpar ingredients from Chinatown.

The server brought us the bill and gave us a free dessert which we both didn't like. In total our bill came to $88 and I was embarrassed to have paid as much as I did for the food.

We both felt kinda sick after and I don't think anyone should be subjected to eating here again.

I hate to do 1-star as the server definitely seemed to be trying his best and was very nice but the food is gross and there are WAY BETTER places to eat in this city."}
{"text":"This hidden gem on St Clair west is really some place everyone should check out!

The chef is super nice & wants you to really know what well made, fresh pasta is all about. 

The classic spaghetti & meatballs dish seems such a simple thing but he gets it so right with the pasta cooked perfectly & the seasoning of the sauce & meatballs expertly done, you'd think you'd died & gone to Italy! 

Do yourself a favour & try it out!"}
{"text":"My husband and I was here on our 1st wedding anniversary.  It was on Monday night, so the restaurant was quite empty,  However, the foods were pretty good.  The waitress didn't seem to know how to take order for wines, but she was polite and pleasant."}
{"text":"I love this place. I think my only wish is for them to have much success! When we arrived I was a little skeptical because no one was there, but this place far exceeded my expectations.

Staff: We were very politely greeted by their one and only server. Our water was constantly filled and they checked up on us often. 

Ambience: It definitely has character. I like the paintings all around the place and it's a very small and intimate place. Music was play overhead on speakers, it was nice. Don't get me wrong, it's not luxury fine dining, but something about this place has that charm that you just got to appreciate.

Food: The highlight the restaurant is definitely the food. I can't really get over the food. I want more gnocchi from this place. We started with the daily soup (Cold Tomato Soup). It was packed with flavour and great acidity. Next we had the Bruschetta Trio. Each one was unique and simple in elegance but all very delicious. Then I had the Gnocchi Alla Boscaiola which was so delicious. It was freshly made gnocchi with a sweet and spicy sausage (I'm salivating just thinking about it again). So good!

Thank goodness that I have friend who lives near by so I can come back often! Million thumbs up to this place."}
{"text":"When coming in most tables were reserved but no one sat in them throughout our meal. Luckily we were seated without a reservation and there was a server instead of the expected one-man service as expected by previous reviews. We received complimentary grilled zucchini appetizer and ordered the eggplant with ricotta cheese appetizer which was delicious as well as the gnocchi primavera (tastes homemade and not those store bought gnocchi), and spaghetti ai fruitti de mere (seafood was sandy and mediocre). The creme brûlée was amazing and was the only dessert at the time so you can tell that it was made daily. Overall good experience and would come back again"}
{"text":"Utterly amazed at the quality and authenticity of the Italian food made by Chef Mario!!

We decided to tryout Agio last night (Thursday) after reading many reviews about the excellent Italian food Agio has to offer. The restaurant is located in old little Italy near St Clair and Landsdowne - very easy to find and ample street parking. When we walked in, we were greeted by Mario (restaurant owner). Suffice to say, it was a little bit surprising at first given that he's a Korean and the head chef of a Italian restaurant. But if you're able to keep an open mind, the food will not disappoint and quite frankly a ton better than a lot of the 'authentic' Italian restaurants in the city!! 

Mario trained in Italy and have worked there as a chef for many years before coming to Canada. After we had our meal, there was no doubt in our minds about his abilities in Italian cuisine. In fact, he even spoke Italian colloquially with another Italian customer at the restaurant. 

Now more details about the food:

Restaurant: 
comfortable, mom and pop feel, quaint and full of beautiful art painted by his wife Clara.

Food:
Mario gave us complementary tea as he noticed we were cold coming from outside. He also gave us complementary appetizer of grilled zucchini with butternut squash on top!
For the entrees,
We ordered the lobster linguine with spicy tomato sauce and the spaghetti Bolognese. It was absolutely amazing. The lobster linguine came with a whole 2 lb lobster and the sauce was perfect! It reminded me of the very authentic lobster linguine I had in Boston's famous little Italy. The spaghetti also definitely satisfied my craving - very very flavorful with the perfect balance of saltiness and sweetness of the tomatoes. Noodles were perfectly al dente. 
Portions were very sizable and we were so full but still wanted to get the full experience by trying dessert: ordered creme brûlée and glad we did! The sugar topping was perfectly caramelized and filling was soft and creamy. 

Agio will now be in our regular rotation and can't wait for the next visit to try other authentic Italian dishes!! Highly recommended for those with an open mind :)"}
{"text":"Excellent food (fresh & authentic & delicious), cozy atmosphere and a great chef and a happy polite waiter.  We had grill sea bass & grilled vegetables & gnocchi and chicken linguni alfredo. The dinner was amazing & grilled zucchini mashed pumpkin amuse Bouche on the house. Super reasonable prices too. Thank you chef Marino, we will be back!"}
{"text":"I came back to Agio last night (a year later) from my last review. Most of my previous review still stands, but I definitely had a wonderful experience which is why I give this 5/5. This is not your typical, fast paced restaurant. The chef really makes each meal from scratch and alone, so yes, your meal in a bigger group or depending what you order may come out first before the others. It's definitely a homey feel. You really need to have patience if you want to eat here. For my experience, I thought the pace was great since we ordered lots!

I made a 7pm reservation for Friday, and when I arrived only a table of 6 were in the restaurant. The server was really kind, and she gave us her recommendations. I had called in advance to ask for 2 orders of the lobster risotto, since I had a few colleagues rave about it recently and thought I just had to try. We also ordered caprese salad, fried calamari, linguine alla vongole - clams in white wine pesto sauce, spaghetti and meatballs, as well as the mushroom gnocchi. Yes - this many dishes shared between 4 people. We started with bread, as well as an app on the house (grilled zucchini with squash on top). Everything was delicious. I would prefer to try the grilled calamari next time though. In terms of the lobster risotto, it's not a traditional risotto but made in tomato sauce. If you love lobster, this dish or the lobster pasta is your ideal meal. It comes with a whole lobster! I would also recommend the linguine with clams, and the mushroom gnocchi was so delicious. Tasted fresh, and full of flavour.

At the end of our meal, the Chef also gave us creme brulee on the house - also the best creme brulee I've ever had. Just the perfect crust, and the dessert itself wasn't overly sweet. I'll definitely be back and hopefully it would take me a year to do so. This place is a gem!"}
{"text":"This place is truly a hidden gem and the chef was amazing.  Had a great meal here for my anniversary and we've been coming back ever since.  My girlfriend loved the steak and I personally think the lobster ravioli is to die for. I'm a huge fan of creme brulee and the twist that chef puts on creme brulee is amazing."}
{"text":"Went there for my daughters birthday.  The decor was one of a kind.  The  paintings were made by a relative of the restaurant which was remarkable.  Very nice painting indeed.   What can I say the the service was friendly.  The appetisers were delicious.  We ordered the plain spaghetti and meatballs.  My daughter loved it and while I did love it I felt the sauce was a little to sweet for my taste.   I added some extra spice to my plate to blend the sweetness with some spice.   But overall a great cosy place to celebrate a birthday."}
{"text":"Read about, then sent my family one night when I couldn't join them and they loved it, and I got to try it tonight. Excellent!! Delicious strazzatella soup followed by a fresh, tender, delicious ravioli with spinach and ricotta in a creamy pesto sauce. And the host/chef made it all feel like I'd come to a friends for dinner. Will definitely be back!"}
{"text":"Very great and accommodating, chef is very talkative and knowlegable cooking in over 5 countries and very relaxing atmosphere."}
{"text":"Amazing spinach/ricotta ravioli and bruschetta! Great service and excellent price point. But the beet gnocchi was the best my wife and I have ever had - including any we had Italy! We will be coming back may times over."}
{"text":"Honestly so so good! I read the reviews before I went but was still surprised but how good the food was. The interior is... Well... Not the most glamorous space but everything this place lacks in style, it more than makes up for in taste. Great specials with large portions. Friendly staff! Lovely experience all around."}
{"text":"Oh my goodness. 

Oh my damn.

All the reviews are so true. It's insanity. Marino runs the kitchen and the front of house all by his lonesome but does an outstanding job.

The food. My DAMN. The FOOD. Delicious. Fresh. Incredibly priced for the value of what you are getting.

We did the bruschetta. Gnocchi. Butternut squash ravioli. T-Bone.

I just can't say enough how wonderful this place was. This place is what five stars is all about. Great service. Great food. Great value."}
{"text":"This little gem of a place is amazing. I actually adore the intimate decor, filled with artwork done by the chef's wife. Although not on the regular menu, the lobster pasta special is to die for.  Every single bite of food is prepared with love and care, down to the garlic bread slices served with our pasta. Marino clearly cares about real food. I also recommend the tiramisu, a velvety and creamy concoction - the perfect end to a great meal."}
{"text":"Passionate chef, delicious pasta from scratch

Date of visit: 03/24/2012

*Photos of the restaurant, menu, and some dishes are added*

Ambience: 2/5
Quiet and cozy, the restaurant is filled with beautiful paintings by Clara, Chef Marino's wife.  There is a wall full of drawings of the restaurants' regulars, which gives a welcoming touch.  The decor seems a bit outdated since there is still a Christmas wreath hanging, a horseshoe by the door, and candleholders from Valentine's Day.  The chairs need to be replaced, as they look stained and out of place.

Food: 4/5
Bruschetta Trio - tomato, roasted pepper, and shitake mushroom. 
Warm and aromatic mushroom, my favourite out of the three. The roasted pepper is flavorful, it would be better if it was served warm as well. The tomato's taste is overpowered by excessive presence of onions.

Linguine Chicken Alfredo
Delicious homemade alfredo sauce, linguine is cooked perfectly, generous amount.

Lobster Ravioli
Not on the menu, one of the specials of the day.  Five big pieces covered in mouthwatering mixture of alfredo and pesto sauce.  Although each piece is packed, the distribution of lobster is not even, resulting in some having more veggies mixture and tasting more bland.

Complimentary Garlic Bread
Toasted and seasoned to perfection, great for dipping into the pasta sauce.

Complimentary Tiramisu
Served in a wine glass, a sophisticated and well-made dessert.

Complimentary Horchata
A shot of ground almond, cinnamon and lemon juice. Nutty, sweet and tangy, goes well with the dessert.

Service: 5/5
Clara is soft-spoken and attentive, refilling water and changing plates and napkins constantly. Chef Marino is friendly and funny, who would gladly share his stories and cooking tips.

Price: 4/5
Moderately priced for such great food and service. Definitely will visit again to try other dishes."}
{"text":"Went with friends, and I'm glad they made reservations, because the place is small and on a Saturday night, several tables were turned away for not having a reservation... which is understandable when you realize this is literally, a one man show.  He takes the orders, he cooks the food, he serves the food, he brings the bill (after you ask for it) and he brings you free food, like amuse bouche and a dessert to share.

Everyone loved their food, I enjoyed mine too.  

The guy who runs the place is a real character, and you feel like a guest in his home, rather than eating at a restaurant.  Nothing fancy, just good food at amazingly low prices.

Just don't forget to make a reservation, or you might get turned away."}
{"text":"Can't complain.  

First time visiting and wasn't disappointed

Had the ceaser salad and the chicken Alfredo pasta

Everything was fresh. the place was like a hidden gem. You'd never think walking by what a great restaurant this really is 


We met the owner Marino. He was a gracious host and great cook

Nice crowd. More couples 

Will come back for sure with a Bigger appetite"}
{"text":"We went around a odd time between lunch and dinner, so there was no one else in the restaurant except us. The chef was very friendly and nice. The food was simply delicious. We started with the complimentary zucchini app. Then we had the lobster ravioli and lobster rissoto. The flavours of both dishes were amazing, the rissoto was cooked nicely not too soft. We ended our meal with a complimentary creme brulee. Not one of the best decorated place but tasty food."}
{"text":"I wanted to like this place.  After all, the owner is a really nice guy.  But it really wasn't very good.  

I know you don't look a gift horse in the mouth, but the complimentary zucchini appetizer was bitter.  You know how they say you should always taste a zucchini before cooking because some are bitter, well this zucchini had that distinction.

The kid's pasta with meatball was tasty.  But the sauce was on the sweet side.  Another pasta dish was OK, but nothing to write home about.  The shrimp dish was somewhat sad, with two skewers of tiny shrimp that were totally overcooked.  They were served with some vegetables very lightly grilled, and completely uninspired.  

I feel bad for the guy.  He means well.  But perhaps that's the price you pay for being the only one working at the restaurant, working the front of the house and the kitchen.

The meal wasn't cheap either.  For one pasta plate, one shrimp plate, a kid's plate, and two glasses of wine, we paid $65.  Plus, the ambiance was not great.  The place was unkempt.  Sorry, I had to keep it real."}
{"text":"The food was fantastic,  I'm serious you might not expect much from the looks of the location or when you find out its a 1 man show and he's Korean but it's really good"}
{"text":"My goodness this place is great. The chef, owner, and waiter is a guy named Marino who is super friendly and welcoming. We went for lunch and had the homemade potato gnocchi and the lobster pasta. The gnocchi were fantastic and the sauce was an incredible tomato and basil sauce. The lobster was equally fabulous. We finished it off with the best creme brûlée I've had. Goodnight nurse. Definitely worth the trip and best meal I had in Toronto."}
{"text":"Pasta is fantastic, fresh and so tasty! The chef himself does everything and that's great-- but he can use some help. I will continue to support this local business as the food was superb. As some people mentioned in other reviews it can be a slow process (you can't rush perfection like this) and the waiter is not too knowledgeable (that's ok-- everyone has to learn at their own pace!). Love that they ask if you have any food allergies and that the chef provides little goodies (apps) while you wait.  The lobster ravioli is to die for, real lobster chunks and the sauce is licking plate worthy.  Special of the day: gnocchi was delicious too a very nice creamy mushroom Alfredo. We got the clams and muscles in the a red sauce and if you like a little spice in your life-- these are to die for!!! 
Desert was on the house, creme brûlée with two spoons. I love creme brûlée and would have paid for  second one! Nothing fancy about this place just GREAT food. Definitely a hidden gem, you will not be disappointed but you must be patient. 
Bom apetite"}
{"text":"The chef is so friendly and the food is amazing! I really like the Lobster Spaghetti:)
I went there with my 3 friends n they really liked this place, so we'll go back again.
What is better, he gave us 2 cups of cream brûlée for free
Next time, I wanna come here for dinner."}
{"text":"Although we walked by many times, my wife and I finally stopped into this little place to try it out.  We were not disappointed.  Great Italian food, although I am not sure how I feel about the decor. 

Chef Marino was extremely friendly and hospitable and as he explained, Agio means to make yourself at home, which he definitely did.  Great place."}
{"text":"Absolutely amazing meal! My wife and I took my mom here for her birthday and we were not disappointed! Fresh flavors perfectly combined with a family feel, we highly recommend this restaurant. Chef Marino made an effort to speak with us and explain his dishes and provide us with additional appetizers and complimentary dessert at the end. We ordered an array of Seafood and pasta, not one dish was below par. Will be going back! Highly recommend the Lobster (when on the menu), and the zuppa di pesce!"}
{"text":"After a decidedly awful Indian dining experience in Mississauga, Agio in Toronto's Corso Italia reassures me that GTA cuisine is indeed world class. It was fun practicing my Italian with Chef Marino, while dining on Insalata di Calamari and the most amazing fresh Bruschetta. Get this... $25 with a glass of wine. When I return to GTA in October, Marino is making me Baccala (Salt Cod) alla Romana. Love this place!!!"}
{"text":"I had previously bookmarked this place so I was super excited when we went. 
We were NOT let down.
Firstly I genuinely want to congratulate chef / owner Marino - on stellar customer service. You will walk in as a patron but leave feeling as if you are a friend. 

Ambiance: this is by no means a pretentious place..come her for great authentic Italian food, not for the experience of dressing up for it.
What we ordered:
Bruschetta trio - very tasty and fresh, next time though I will stick with the original tomato bruschetta as it was my fav.
Mussels and Clams - OMG so yummy and very clean tasting. Simplicity at it's best!
Grilled Calamari.....this was almost my favorite dish there, I could and I will one day order this alone for lunch. Grilled to perfection - not at all chewy. 
King Mushrooms - In all honesty I would not order these again. They tasted good, with the balsamic glaze - just nothing wowed me and I would rather go double on the calamari order.
Lobster Ravioli - my reason for coming I will admit so my expectations were very high. I was not expecting all of the other veggies mixed in with the lobster filling - I will admit that i did not think it was necessary to add all of the other ingredients. This dish was still great - I think I just walked in with higher than reasonable expectations. 
GNOCCI AMAZING loved it and I so wish I had ordered this ( so did my friend because I ate some of hers)
Dessert spectacular - I will be back and highly recommend this place!"}
{"text":"This is a cute Italian place that my wife and I discovered recently. We came in on a Friday evening and were lucky to get a table; all the tables were reserved but there happened to be a cancellation. The owner/chef is apparently amazingly accomplished; don't be confused by the fact that he's not italian (he's asian), but he used to cook for the Vatican at one point. He made us fresh gnocchi that was absolutely delicious, and we also had a butternut squash pasta. Highly recommended -- but be sure to make a reservation before hand!"}
{"text":"Best pasta in TO. He actually did the gnocchi right there. Super Fresh. The chef even gave us a complimentary starter and a creme brulee. We will definitely go back."}
