{"text":"good food, good service, good prices match per serving size, enjoyed the environment and pretty solid overall, terrace makes the ambiance that much better"}
{"text":"Great food! Get the plantains. I haven't liked plantains I've eaten before and yet these were amazing. Perfectly crispy, great taste. My sister and I went yesterday and instead of getting two main courses and an entree we shared four of their \"little plates.\" Do that too. That way you get to try a bunch of little things. We had mac and cheese, griot (which came with plantains), rice with bens and avocado salad. Next time, I'm going to order plantains instead of the rice which was fine by not totally worth it. And just a little tip: the avocado salad is light and tasty but be sure you get the avocado which is at the bottom of the plate. I ate half the salad and then noticed that the avocado was hidden. Overall, a great experience. Get there for 7 when first service starts. Great waiters. Super cool yet really friendly. Loved it."}
{"text":"L'organisation reste à désirer...on réserve deux heures en avance et en arrivant on nous dit qu'on a été enlevé de la liste de réservation."}
{"text":"Amazing cozy welcoming, beautiful atmosphere, awesome staff and excellent service. Food is great too but portions are small for the price. We had a sweet potato/eggplant salad as an entree (it was the special of the day) and it was just spectacular. The griot is also amazing.  We will be back again for more cocktails and bites!"}
{"text":"This place is really pretty. It's small, but there are lot of things to look at. They food menu is small, but the food is good. However, they have a good selection of Rum. The service was good and the people were very friendly. My first time to a Haitian restaurant/bar."}
{"text":"This new Haitian restaurant on Amherst is definitely heating things up. Everything here from the music, the vibe, the food to the cocktails will transport you straight to Haiti for the night. The fried fish itself deserves a visit and yes the cocktails are delicious & the patio looks lovely. Only negative for me was how loud it was inside. Nearly too loud to have a conversation...  To find out more, check out my article: https://delifeed.ca/2016/08/07/tropical-night-at-agrikol/"}
{"text":"One Saturday night craving some Haitian food, I make my way to Agrikol. As I arrived a waiting list welcomed me to the door. Gave my name and decided to stick it out for another hour, boy was it worth it.  Stepping inside, the decor. the music, and the ambiance all provided for a nice dining experience. Seated at the bar section, I kicked things off with a an entree of Griot with Banane Pesée. The griot plate is as good as it gets, toppped off with a side of coleslaw.  For the main course, the queue de boeuf was perfectly tenderized and done spot on with the Caribbean taste.  I abstained from the cocktails but the impressive selection of rum deserves another visit, not to mention the variety of dishes the menu offers is worth another trip.  One of the best discoveries in the city."}
{"text":"This is defiantly the best Caribbean restaurant this city has to offer. Hands down the best Griot I've ever experienced. Not to mention the great music, and service many restaurants lack, the decor is very original and tropic here. Me and my girlfriend truly love the ambience. I'd defiantly recommend you come and dine here, a Montreal Gem"}
{"text":"Yelping in Montreal I came across this establishment. Just a few blocks away from Gay Village, as you walk up to the location, you are drawn by the architecture of the restaurant. It looks very colonial and purple lights from the windows. You just gravitate towards the entrance and the music playing. You literally feel transported to a warm Caribbean vibe. The food is fresh and the menu is basic but full of flavor.   It was great to end our last night dinning here and enjoying Haitian food and music.   I'm very content and would visit again!"}
{"text":"Had the accras, the plantain, the avocado salad, and the mac and cheese. Everything was impeccable, the servers were super helpful and the drinks ( a dark and stormy, ti punch, and the house ginger beer) was super flavourful and potent."}
{"text":"Found this restaurant on one of the many lists/blogs/articles that I read through and I was intrigued by their association with Arcade Fire. We decided to try the place out while visiting Montreal and were not disappointed.  Luckily for us, we came in on the day of their soft opening for the new patio section (see picture). It was an extremely charming back patio that had a very homey feel to it, as if someone invited you over for a BBQ and served up their fresh home cookings. We had the rice and beans, the plantains, short ribs, and pork and goat patty, no complaints about any of it. The plantains were better then I imagined they would be and the meat was cooked to perfection. If I was a resident of Montreal, I would certainly plan on coming back to try the other delicious looking dishes.  The only slight source of confusion was the difference between the patio and the interior restaurant, however since I do not speak the native language and this was the first night they opened, I am not going to hold that against them.  I would definitely recommend this place to any friends and family and make sure to sit in the patio section for that good home cookings feel."}
{"text":"The ambiance, decor, and food were fantastic. My friends & I visited Montreal from California and I couldn't imagine a better place to have our first dinner.   I particularly enjoyed watching the bartender make fresh cane juice. The avocado salad was dressed exceptionally well and is probably the best salad I've ever had. The Accras, Mac & Cheese,  and Oxtails were equally great. Agrikol is perfect as far as we're concerned."}
{"text":"Pretty unique decor and atmosphere. Pikliz is free regardless of what you order, and it tastes great. The griot serving is tiny considering its hefty price tag. Definitely a spot where you can end up with a huge bill if you're not careful, but fun time is guaranteed nonetheless."}
{"text":"Okay.  When it comes to restaurants, there's the good solid local places (Gracia Afrika is one, Mango Bay is another, Rotisserie Romados does a great job as well) and then there are the places that are transformative - it makes you forget where you are.    Take for instance, Agrikol.  Win Butler and Regine Chassagne from Arcade Fire are partial owners, and the other partners are well-known restauranteurs in Toronto.  The menu is Haitian - Chassagne's former homeland.  The menu is expensive for the rather small portion size.  The cocktails are just as pricey as the entrees.  Yet, I will have no issues recommending this place for Montreal visitors.  Why?  It's -2C outside and there is a pile of snow on Amherst street.  Across the street is a tired looking casse-croute serving the same old shit.  This place looks like a shabby pink and white townhouse.  It's 5:56p and there is already a crowd forming up.  Walk inside at 6p, there's merengue music, a gorgeous bar with carnival motifs all over, dual floor seating over a skylight, and the place looks like a townhouse in Port-au-Prince (or Havana) which allows you to have a conversation while the music plays on.  The skylight allows natural light to flow in, and the white curtains cover any traces of the outside.  Not that many restaurants in Montreal gives you the courtesy of not reminding you that you are here during the winter, where the price of 24 Stanley Cups is that you get to live in Father Winter's taint three months in a year.    How about the food?  The cuisine here is pretty decent.  If you go to ParkEx (or Flatbush in Brooklyn) and gun for the cheap Haitian you will get a large takeout container of something scooped off a steam table, and who knows how long ago it was made.  Here, everything tastes freshly made.  The Lambi (conch) is tender without being mushy, and the shrimp is just right (not rubbery) with a bit of veggies tossed in.  Good plantains as well.  The Mais moulu is a decent short rib stew with a polenta corn cake on the bottom, and lovely hass avocado on the side.  The accras are familiar to anyone who ever had a hush puppy or an acaraje.  It's a chickpea based fritter with some onions and spices inside, and goes well with their homemade mayo.  The mayo also receive some of the bang-and-lift from the house relish.    Ah, that container of relish - it's basically cabbage and carrots pickled in a delicious jar of clear napalm - the Haitians calls it Pikliz,  but restaurants in NYC simply call it \"sauce\".  It's pure tropical fire - the product of shallots, thyme, cloves, lime and a few scotch bonnet peppers, and made in-house.  Me and my wife polished off half a jar, and frankly, if we can bring it across the border back to NYC, we will.  As for the service, it's fast paced but warm and courteous, which you won't get in most Haitian joints.   The drinks are fairly expensive, but they do use top-shelf mixers.  When my wife ordered the Coconut cocktail it was made with Appleton estates 12, coconut cream, passion fruit and Mandarin orange juice.  Quite a nice smooth combination and rather deadly as well.    Yes it's expensive, yes the portions are small,  but I'll totally go back again."}
{"text":"Dans une atmosphère conviviale quasi festive, je suis reçu avec le sourire dans cette petite et charmante \"maison blanche\". Je m'y suis immédiatement senti confortable. Cocktails qui rappellent le Kon-tiki, accras végétariens, salade d'avocats avec vinaigrette aux agrumes de même que le maïs moulu aux légumes on fait mon bonheur. Pour dessert, n'ayez pas peur du pain patate. Avec sa touche de rhum, il vous laissera un bon souvenir. En somme, chez Agrikol, le soleil brille toujours, sans flaflas ni attrapes. J'y retourne, juré."}
{"text":"went there for a birthday diner, we were here at the opening hour so had no problem to get a table. it is so beautiful, there is so much stuff to look at! it is a bit small tho.  it is a rhum bar so you better like rhum! the staff was amazing, excellent service! i only give 4 stars because of how small the menus is. i wished they had more and more! we tasted everything on it, and everything was good. i  wish i had someone at my house to cook me their plantains, so freaking gooooood!"}
{"text":"Fun summer vibes all around!   Next time you're looking for a great terrace on a summers night, think Agrikol. Or you want a tasty Haitian meal, go to Agrikol. Even when you just want a good place to have a rhum cocktail and chill with friends, Agrikol won't disappoint.   We stumbled in on a random Monday night, and the place was packed. We sat at the bar, right next to Will Butler, who happened to be hanging out and having a beer with friends. Such a Montréal, chill vibe.   I tried the ti punch, which was very strong and my husband had the Haitian beer, which he enjoyed.   We shared two mains, including the maïs with legumes, surprisingly not vegetarian, and the oxtail. Both filled with deep, bold flavours. They also serve grilled meats outside (it's a separate menu), but the terrace fills up very quickly on a summers night and closes at 11. The restaurant on the other hand is open quite late.   My only words of caution would be, the wait for a table can be rough. And the servers are unforgiving, in fact they won't seat you at your table until your entire party has arrived. So plan ahead and make sure your party arrives together!"}
{"text":"Don't waste your time going. We were all very disappointed by the experience at Agrikol. After reading the reviews and seeing the photos we all decided this would be a fun place to check out. We knew they do NOT take reservations, so we arrived on Saturday evening at 8 PM cause we knew the place gets crowded after 9pm. We were told the wait would be 1.5Hr and there was no room at the bar either. There were about 20 groups of people ahead of us - all leaving their names & numbers, so we left ours as well. The other people in line were also disappointed because they were turned away as well.  I asked the hostess how can we avoid this from happening again? She basically told me there's no way cause they are always packed with lineups even on Monday nights when they open at 6 PM there is already a line up outside. In the end, they never even called us at all that night. Clearly this restaurant needs to take reservations. People might be willing to wait in line now that it's August and 32°C outside but what will happen in the winter? Who will wait outside then?"}
{"text":"This is my favourite restaurant in Montreal. Being from Toronto, I've been to Rhum Corner and the rest of the restaurants that were established by the owner of Agrikol.   The drinks here are so damn good. My favourite is Kokonut, and my boyfriend loves Ponch Oloffson. We also had a Zanana (2 person cocktail) to begin our night.  The food is awesome, with the fried plantains being a good snack. The decor is Haitian/Tropical, and although the music is loud it's very nice, not overwhelming. The staff here are super friendly, and the place just has a great hip atmosphere. Cocktails are expensive $12-14 but they're worth it. The food is around the same price but also really good."}
{"text":"Ambiance et deco extra! Est-ce que ça valait le 1h d'attente? Pas sure, peut être attendre que le hype diminué un peu pour y aller. Les plats étaient savoureux mais je suis tombée malade en pleine nuit avec le plat de fruits de mer. Ça arrive n'importe où, mais je vous suggère d'essayer les autres plats. Les cocktails sont délicieux, à l'image des bons cocktails du resto à Toronto. Jolie place mais mis à part La terrasse exceptionnelle j'ai préféré Habanera."}
{"text":"Loved the quaint and intimate vibe of this restaurant.  My friends and I originally were seated upstairs since it was packed downstairs when we got there. I don't believe they take reservations either, but it was nice upstairs since the group that was there was heading out and we had it to ourselves for a bit before having to move back downstairs. They were playing really nice music which was Haitian, I assume, and there was great artwork throughout.   The food, itself, was great. I haven't eaten Haitian food before so was excited to try it. My friends and I had plantains with pork and peppers. There was some sort of spiced cabbage condiment to accompany our dishes and that was probably my favorite thing I ate all night. In addition to this, I ordered oxtails which was a first for me. The meat was so tender and well seasoned and went well with the rice and bean sauce that came along with it.  To top off, my friends and I all ordered a coconut cocktail (can't remember the name) and it was really creamy, sweet, and smooth if you appreciate tropical and fruity drinks."}
{"text":"This is probably the most original restaurant decor I have seen in a while! The moment you arrive in front of this little White House, you are already in another country, one of the sunny ones. Once I opened the door, the inside confirmed how I felt about the outside appearance of the building, I felt like travelling without leaving town. It is to be noted that this restaurant is very tiny, as we arrived early we were seated very quickly, I ordered a glass of ti Punch, my friend ordered a cocktail with no alcohol. My friend enjoyed her drink, I wasn't impressed by mine, I felt there was too much ice and not much rum. I then ordered a beer, the choice was made quickly because they only have one, the Jamaican beer Red Stride. I then had the conch and banana meals, my friend had their chicken patty. Unfortunately, once again both of us weren't impressed by the taste. We then ordered their chicken and cashew dish as well as their accras. It all tasted good but to be honest, I already had much better Haitian food.   Overall, being of Caribbean origins myself (although not Haitian, but our cuisine do have similarities), I was a bit disappointed by their food. I really wanted to get a taste of Caribbean flavours. However, I have to give them major credits for the decor, the service and the atmosphere which was on point. Perhaps, they might want to refocus a little bit on the flavour of their food, then it would be an A+ for me."}
{"text":"Ate here today after my boyfriend highly recommended it. The food was good. HOWEVER. The service was awful. I was asked by my server if I was sure I had asked her for the drink that I had ordered nearly 30 minutes ago. My friend ordered a drink that took nearly 45- an hour to get to her. When I asked for it (the second time) we were given some excuse about the bar being swamped. Her drink came as our food (which also took way too long) came.  Apparently the bar (and kitchen?) were swamped. But the tables around us who clearly were friends with their servers had no problem.  We spent a total of 2 hours here. Of which we spent about 1.5 waiting for food/drinks.  It's unfortunate because my boyfriend is an executive sous chef who recommended my girlfriends and I eat here. I will not be doing so."}
{"text":"Très très déçues nous sommes ce soir après cet essai au Agrikol. Nous avons gouté au menu overpriced de la terrasse avec deux petites cuisses de poulet, quelques morceaux de porc plein de gras, du riz ben ordinaire et une  très mauvaise ratatouille de légumes. Petites portions avec prix élevés qui passent moins quand c'est pas bon. Les serveuses ont le sourire oui mais personne nous a demandé si nous étions satisfaites du repas. Étonnant de voir les files d'attente pour ce resto et de lire Eve Dumas de la Presse qui encense cet endroit dans sa critique de juin dernier."}
{"text":"Un endroit parfait pour essayer des plats haitien ! Les prix sont tres raisonable et le service etait parfait !   L'ambiance du resto est vraiment plaisante , on dirait que tu es le temps d'un repas dans le restaurant dun super beau resort dans le sud !   De plus , la bouffe est incroyable nous avons mangé comme des rois !"}
{"text":"I'd been following the saga surrounding Agrikol's conception and birth from the outset, each setback and delay only stoking my anticipation.   All I can say is thank goodness it's finally here! The wait was totally worth it.   We came early on a Saturday evening and managed to squeeze ourselves onto some bar stools upstairs. This was awesome, because we got a great view of the whole place and there is no shortage of things to look at! The decor is as eclectic and fun as you'd expect from a restaurant dreamed up by Arcade Fire.   We ordered a quarter bottle of rum which came with freshly squeezed (!!!) sugar cane juice, sugar cane syrup, and limes. It was perfect. We were also told that we needed to order some plates with our drinks, which was no problem because the menu offers some pretty interesting options! We settled on sharing a few appetizers, all of which were pretty good.   The service was quick and very friendly. All around we had a great time and left pretty happy! We'll definitely be coming back!  Just a tip- they don't really take reservations and it started to get pretty packed around 9ish/10 Saturday night. So plan accordingly if you want a seat!"}
{"text":"This place serves Haitian food on par with what my mom makes, which is just about the highest compliment I can give. We had the Griot, Plantain, Ox Tail, rice and beans, and a bunch of cocktails. Everything was amazing. Can't wait to come back to Montreal and eat here again!"}
{"text":"les meilleurs.... ambiance et nourriture excellente !!!!!!! merci ralph pour tout"}
{"text":"Second time around I went around opening time at 6 pm, not anticipating a huge line up. We decided to sit in the terasse, this time being placed at one of two picnic tables. It felt crammed with 5 other ppl at our table. The menu seems like it has been updated since my last year's visit.  I ordered (rating  out of 5 Stars): Goat and beef sausages** (more like kebabs on a stick, served as 2 pieces), chicken*(too salty! Cooked medium rare- I didn't like the texture- too expensive for a drumstick and red meat) ; pork ribs ****(perfectly seasoned, served as 3 pieces pure goodness). Meats ranged from 11-13$. Each meat was served with a side of picklee- aka pickled coleslaw. For sides I ordered plantains****(they tasted different this time around - I liked the spice, and the  chutney sauce it was served with- came as 5 pieces), pickled Salad ****(so pretty and flavoured). I had a dark and stormy for 11$ to drink - to my astonishment- I found a strand of hair in my drink. Although the waitress was nice to replace the for free. Service was prompt and good. I don't know if i would come back for the food, I'm hoping my future is inside dining experience inside will be more positive  (as it's different from the terasse grilled menu)."}
{"text":"The best Caribbean cuisine I have ever tried in Montreal , the fried fish was amazing and the Griot was to die for! come hungry leave happy!  excellent night on the town!"}
{"text":"Restaurant à la décoration très originale et colorée! Pensez à réserver votre table...sinon vous vous retrouverez sur des tabourets, à manger sur un mini bar! Bref pas très agréable.... De plus la musique est très forte et à tendance à couvrir toute tentative de communication! Malgré tout cela la nourriture est originale et nous fait découvrir les bases de la cuisine haïtienne!  Les petits plats/entrées peuvent être partagés à plusieurs et sont très abordables, quand aux grands plats ils ne sont pas très copieux et aux alentours de 17 à 23 dollars, voir plus avec le poisson entier frit! Le dessert unique, le pain patate est très parfumé! Il ne faudra pas passer à côté de leurs magnifiques cocktails faits devant vous au bar!"}
{"text":"Un nouveau venu que je souhaitais découvrir. Sans être une experte de la bouffe haïtienne, ce resto se rapproche beaucoup de la bouffe traditionnelle  Les côtes de porc sont délicieuses, tendres et justes assez relevées, assaisonnées de cannelle, cumin et clou de girofle . L'assiette d'accras est généreuse (5, de mémoire) avec une sauce et une salade fraîche en bouche.  Le gâteau aux patates douces avec sirop de rhum et raisins m'a réconcilié avec les raisins...c'est tout dire"}
{"text":"Très bonne cuisine haïtienne, dans un cadre très très sympa et festif. C'est bruyant dans la salle principale, mais nous étions à l'étage où l'on domine la salle et le niveau sonore est plus correct. Terrasse très sympa à côté des BBQ. Et personnel dynamique et sympa."}
{"text":"I'll admit i came here because I am an Arcade Fire fan but i was definitely in the mood to try something new. the food here is amazing to say the least, so unique in flavour and nothing i've really had before. also i had one rum and coke and felt really tipsy after it lol (idk if that was because i hadn't drank in a while or because they added a good amount of booze). the only flaw they had was the service was a bit slow and it was kind of expensive *$12 for a rum and coke* but the staff was SUPER friendly and helpful with explaining the dishes since we didnt speak french. overall i'd definitely come back here and would recommend to anyone visiting montreal and want to dine in a beautifully decorated restaurant !!"}
{"text":"J'adore cette place. Le griot et la banane plantain est fait a perfection.   Le seul hic; la place est trop petite et on ne peux pas faire de réservation."}
{"text":"A great eat in Montreal.  I never had Créole food before and I loved it, every bite felt authentic.  This place is welcoming for créole newbies. The staff is warm and easygoing.  The menu is different inside the restaurant and on the terrace. Authentic inside and bbq outside.  I did try the inside menu, loved and enjoyed every bite.  I did arrive at 6pm to get a table. The pro was that I had a place easily but I could feel that I missed the real ambiance. (I saw Jean Leloup sneak (wearing one of his enormous hats) toward the terrace.)  I recommend this place with two thumbs up."}
{"text":"Very disappointing. Gorgeous place, and overall very nice staff. However It's unimaginable to have a haitian restaurant not having griot at 9pm a saturday night....It took us 2h to get our food, one of the reason being that they ran out of rice...Again a haitian restaurant without rice or griot is like a sushi place only serving seaweed salad and tempura shimp...I say the staff was very nice, the waiters did the best of a very embarrassing situation, on the other hand the owner was completely out of it... never once he came to see us during the meal and let the waiters  amend for the situation. But when one of my friend when to compliment our main waitress on her service he appeared out of nowhere asking her aggressively what was her problem...He then went on to say that we were very rude to the englishspeaking-only-staff, which to me was more a problem of communication rather than rudeness... Anyway: Great décor, Great drinks, food ok if you never tasted REAL haitian food and they need to get organised (have a cook that can cook haitian food, be ready for the amount of client coming on a saturday night, have at least 1 staff that can read the menu...) I had high hopes for this place...I think it need another 6 mo... we'll see"}
{"text":"One of the few times I've had Haitian food. Loved it. The decor is spot on. The service is on point. We showed up right when they opened for dinner and I'm glad we did because about ten minutes after we sat down, a line formed and it was well over an hour before anyone could get seated."}
{"text":"This hip caribbean-soul-food spot has a regular lineup so prepare to wait. The atmosphere is always vibrant, the tunes are masterly curated by serious caribbean DJ's. The starters are all really good, I heratly recommend the plantains and the avocado salade. The rum selection is impressive and it is meticulously blended into delicious traditional and original cocktails. Montreal has such a rich caribbean community & culture and It's great to see it become a part of the city's culinary/bar scene. During summer the beautiful terrace has it's own caribbean BBQ menu. Tip: If you like your liquor neat like I do, forget the cocktails and try different aged rums. It's a whole words of tastes and undertones."}
{"text":"It's cool, nice atmosphere and good drinks. Was a bit though getting a table, which was annoying considering there were 3 open, did not feel very welcome at first. The food is OK."}
{"text":"L'accueil est excellent et chaleureux, par contre pour les connaisseurs de la nourriture haïtienne, leurs plats sont un peu sec et c'est très décevant de voir que les cuisiniers sont tout sauf haïtiens .."}
{"text":"First time trying Haitian food and I couldn't be happier! My boyfriend and I shared ceviche, griot and ox tail. Each meal was accompanied with plantain, so I wouldn't recommend ordering just a plate of plantain. My favourite dish would have to be the ox tail, it was tender and tasty! Would recommend :)"}
{"text":"I'm so glad we found this place, it's the cutest restaurant in Montreal by far for me. There are two parts to this restaurant, the inside has its own menu and the outside has its own grill-oriented menu. Inside seems more accurately Haitian themed, the outside is filled with a lot of gorgeous lights and patio chairs and tables, with a grill sizzling nearby. The atmosphere just chill, romantic, perfect for a third date time of place.  We chose a table right next to this huge tree with lights hanging everywhere, it was so picturesque. Even their cutlery were wooden and adorable.   For drinks, my friends ordered Dark 'N' Stormy which is a cocktail made with ginger beer and dark rum with some limes, as well as Ti' Punch which is a rum drink with lime and cane syrup. I had a bit of both. If you're big on alcohol, you'd like Ti' Punch but it was too strong for me. I really liked Dark 'N' Stormy, the ginger flavor was just enough.   For food, we ordered pressed plantain, rice with beans, beet salad, smoked herring, sausages, chicken and beef cheek. Everything was just really good haha. Fried plantains came with mayo and the spicy sauce was especially  delicious. Beef cheek was super tender, the spicy pickles that came with it complimented it really well. Chicken was smoky and tender.  After the meal, we tried their soursop and passion fruit popsicle, and it was the best popsicle I've had in my life, not exaggerating.   Service was super, the waiter explained every detail of the menu and checked on us often.   I'll definitely be coming back to try the inside food!"}
{"text":"Must try! Go at 545 and wait outside for them to open so you don't have to wait in line too long. We sat outside where they had a open flame grill with all kinds of veggies and meats cooking with a island vibe - will be back next time in town."}
{"text":"They just opened 2 days ago but we got the feeling they've been around for a while. The service was great and super friendly. The food... Well... Pure Caribbean deliciousness... Do ask for their hot sauce and order the fish by all means. Honest, down to earth food. We felt like in a mini vacation in the middle of the winter. Cocktails were fabulous but we found them a bit pricey. I know they're starting, so I guess their Menu (which needs to be printed in a bigger font desperately) will grow in mixology. Try the plantains and the rice and beans as appetizers... Really delish. Music was exquisite. Kudos to the selector. The atmosphere was relaxed and laid back. No pretentiousness (although you can tell they spared no expenses... The place is really pretty)"}
{"text":"Visited Montreal this past summer and I am so happy we found this place.Pretty cozy restaurant serving Haitian Caribbean food.  We were there on a Saturday night, the ambiance, food, and drinks was nothing short of amazing.  For food, we ordered Oxtail, Lambi, and chicken, all with rice and salad.   Its definitely worth visiting. Definitely will come back."}
{"text":"Great cocktails and food! Beautiful place with great atmosphere. Highly recommend! Plantains and kokonut cocktail were my highlights."}
{"text":"I'm glad to finally see a Haitian restaurant worth going out to. Food is good but i mut say that portions are minuscule. Specially for haitian food who's always served generously. The legumes is also very salty. I absolutely loved the avocado salad with popped rice. Soooo good! The griot is good but i can't understand how they can charge $18 for 4 pieces of griot and a few pieces of plantain. That's beyond me. Check your markups."}
{"text":"I was attending Montreal Jazz festival and found this place under late night dining.  I decided to go at about 7:00 pm prior to attending a concert. There are 2 dining experiences. You can sit outside to have the Grill food or inside for the regular menu. Of course we did both. The Patio grill food was delicious! Jerk chicken fresh off the grill. The order of plantains is huge but we over ordered and get the rice and beans. Once we finished they accommodated us immediately to a table inside. The fish was amazing. They do not take reservations. Very cool atmosphere as well."}
{"text":"Wow!! Everything was fabulous!! He had the ox tail and I had a pumpkin dish with rice that was delectable.  Prior to our main course, we, of course, had to have the griot that came with fried plantains and the pate chaud which is a cod empanada. Delicious, but I had to share it because it's only one  Food came out hot and really delicious. Afro Caribbean/Cuban music is playing Really adding to the ambiance If you like a party atmosphere, which I do. Wait staff was super. Drinks were different and strong. Thoroughly enjoyed and highly recommend, but get here early, it fills up fast. We thought we wanted to sit outside in the patio but there is a different menu outside (everything grilled on the Barbie) and he had to have the of ox tail so we stayed in. Looks like we'll have to come back."}
{"text":"Hipster haitian restaurant with amazing food, great service and nice background music. A true gem"}
{"text":"TO MY FOODIES: If you want a cool and trendy experience in a good area, Agrikol is the place for you. Small plates and appetizers and drinks were alright but if you want actually want to eat a good main course DO NOT COME HERE. The food is neither fresh or authentic. They bring out a small plate with a few pieces of meat, we were still hungry afterwards... Go else where for good food. We were highly disappointed in this restaurant."}
{"text":"Nous n'avons pas pu tester la terrasse mais nous étions bien placés et dominions le restaurant dans la mezzanine. Il est conseillé de réserver à l'avance. Les cocktails y sont bons, les plats typiques aussi. Le goût épicé des plats est un délice pour les papilles.   Le personnel est sympathique et agréable.   Je recommande ce restaurant !"}
{"text":"Awesome little Haitian joint in Montreal. This place is cute as heck, it's like a gutted former home? Looks like one at least. There's not a lot of room but you're not too cramped either, which is a bit of a relief after the wait to get in.   We sat at the upstairs stool seating while we waited and had some drinks and some appetizers. Both were super great - all of the drinks are rum and from what we tried all excellent. That Coconut thing is super fantastic. We also had the plantains which had a kick of paprika spice to them!  We didn't have to wait too long to be seated, and once the food came out it was certainly worth the wait. Considering all I had was chicken, rice and beans it was all cooked surprisingly well. Really tender, juicy and flavorful chicken! The whole menu looked good, I'd definitely be down to try this place out again next time I'm in town."}
{"text":"Agrikol has been one of the hottest place in 2016 and I finally go to try it recently and it wasn't as amazing as I had to come to expect.   I am giving it 3 stars because the decor is really nice and their terrace is perfect in the summer, but the food and drinks are good but not worth the prices."}
{"text":"Disappointed (today) to say the least.  I have been coming here every time i visit Montreal since Agrikol opened. I m from Boston and i used to talk about how good the food is etc... My husband and i went back today. Everything tasted different. The Pikliz was dry and has this weird acidic taste. I used to rave about their pikliz!! The griot was chewy. And just when I thought  it couldn't get worse, i was served a water that tasted like it was mixed with a teaspoon of bleach.  I dont know what has changed recently, but i don't like it."}
{"text":"Not the best Haitian food I've tried, it is a little pricy for the portion they give BUT it has a really great atmosphere, specially for a date night or for groups. The place is so well decorated and they play good music. Definitely a place to go at least once."}
{"text":"Slipped in here tonight following their soft launch two nights ago. This beautiful restaurant and bar is finally open and worth the wait, a partnership between Jen Agg and Roland Jean of popular Toronto spots Rhum Corner, the Black Hoof and Cocktail Bar with Win Butler and Régine Chassagne of hometown heroes Arcade Fire. It's a lovely bit of late night in the Caribbean tucked off Amherst in the Gay Village, with a record player and a box of beautiful Haitian records by the door. The room is gorgeous, we felt comfortable and dreamy immediately. The staff were super welcoming and chill and professional, though still clearly figuring things out, they managed to make everyone around us feel cared for and the Haitian-inspired food seemed to come out quickly and to much delight around both the main floor and the mezzanine. I tried the potato cake dessert, drench in rhum raisin sauce and topped with lovely whipped cream, alongside a rum sazerac and another twist on a classic cocktail called the Suburban with rye and porto - both really excellently done, and both a relief to see on the menu alongside some fun big dreamy summery sweet drinks. There's also local Ghost Farm IPA on tap, and Prestige, a Haitian beer in bottles. I can't wait to come back and try the full fried fish, or any of the totally affordable main meals like the chevre and vegetables and rice at $15.   But mostly I can't wait to see how this place will continue to build and create connections between this neighbourhood and Montreal and Haiti. Plans include a next door cafe that will also stay open late, and a big terrasse for eating outside, both on track to be open by the Summer."}
{"text":"This place has an awesome vibe, great music and ambiance. Also, apparently Arcade Fire owns the place, so maybe if you go at the right time the owners could be hanging around. Other than that, you get seated right away, but the service is a little slow. Enjoy the ambiance for what it is, the food is worth the wait. We got the Mac and cheese, I don't know if it's a Haitian thing, but my goodness it was creamy and just the right amount of salty, delicious. We also got the ceviche, which people raved about, but I could take it or leave it finally we topped it off with her chicken, that was almost as good as the Mac and cheese, tons of flavor and very moist. FYI all the actual dishes come with plantains, so no need for dessert lol. The cabbage that they put on the table is spicy, which.i loved so, open up the jar and try it. Definitely recommend this place, if the service were quicker I'd give it 5 s."}
{"text":"The ambience is very upbeat but romantic and the same time. Loud music with bar and good choice of alcoholic beverages also dimmed light and lit candle at table. Food was good ! Plantains, rice and beans, beef, griot were my fave things I tried . The fried shrimp was also very good but kind of hard to eat because they leave the skin on.    It's worth the try!"}
{"text":"Ça faisait longtemps qu'on voulait essayer ce restaurant et nous n'avons pas été déçu! Déjà en entrant du saisi bien la vibe haïtienne et elle ne te lâche plus de la soirée! Les serveurs sont super gentils et te conseillent au besoin, le menu est parfait et les plats sont DÉBILES! Vraiment, on goûte à autre chose de nouveau et c'est génial! Et quoi dire du prix? Tellement raisonnables pour toute la bouffe que tu manges!   Je le suggère à tout le monde, honnêtement, c'est parfait."}
{"text":"I went to Agrikol on a Friday night for late dinner. The place was full and we didn't have a reservation but they were able to accommodate us at the bar. The interior is like a house with colonial touch, and low lighting, very nice and sets a cozy ambiance. Food was good as well, i had the chicken and my friends got some appetizers. Everything was tasty. We also enjoyed a couple of cocktails."}
{"text":"This was by far my favorite restaurant during our stay in Montreal. Definitely come earlier because they don't take reservations. We ended up waiting an hour and ended up sitting at the bar. While we waited we ended up trying The Lab, a cocktail bar near by.  The dinner menu is different if you sit outside, so if you want more barbecue style food opt to sit outside. We were interested in that other food inside. The ceviche is amazing and comes with tostones. Then we shared some fish empanada, I can't recall the name but it was amazing.   We both order cocktails, mine was similar to a mojitio and I think my bf ordered an old fashion of some sort.   For dinner we were planning to get fish or beef but the bartender recommended the cashew chicken, it was so tender. It was nice to have a recommendation based on what he thought was good rather than the pricier item on the menu.  I love this place, definitely try it, you won't be disappointed with anything you order."}
{"text":"Super ambiance et déco. Nourriture et cocktails très bons aussi.  Il y avait de l'attente pour avoir une table alors nous sommes allé au Petit Agrikole juste à côté pour prendre un verre."}
{"text":"Agrikol is one of those places that proves my rule: I can overlook the most atrocious service as long as the food and drink are good.  The entire experience here was funny and \"c'est la vie\"- servers totally overwhelmed, forgot to put in our orders, very slow bar, kitchen totally backed up, etc....but the bottom line is, 80% of the food we ordered was delicious and unique.    Agrikol kind of transports you to another time and space where you just have to chill out and go with the flow.  Down a couple drinks and relax because -- your food? It's going to take a while.  The kitchen may even lose your order for hour...more than once.  But somehow everyone you interact with is so damn charming, sweet, and good-natured that you can't hold the service snafus against them.  And as the manager evidently knows, it's nothing a little rum shot on the house won't smooth over.  Tips: there is a separate patio \"grill\" menu. If you want to try griot (deep-fried chunks of braised pork shoulder - think Haitian carnitas served with habanero cabbage slaw and fried green plantains) - get a seat inside.  Then talk your way into a table outside and order a grapey bottle of Haitian lager and some grilled chicken. Skip the fish; it's fishy.  Dark 'n stormies are made with homemade ginger beer and excellent.  Pretend you're in the Caribbean and relax. Aaah.  Be sure to reserve ahead.  This place is slammed."}
{"text":"I heard so many great things about Agrikol, so I finally decided to give it a try! I was NOT disappointed. Unfortunately, the terrasse was packed, but we were able to get a seat inside, and were served by a nice young man.   I ordered the chicken with the rice and peas, which were out of this world... so incredibly flavourful and tender. My boyfriend had the lamb, which was also delicious. My only complaints would be a) the portion sizes were too small, and b) the pricing. Though our meals were delicious, the prices still were a bit nuts considering the type of cuisine and portions. Aside from that, I will still go back. Hope they reconsider those two things."}
{"text":"Super cool Haitian bar/restaurant in the plateau. The music and decor takes you on an instant vacation, and the food just makes it even better. All the main dishes are amazing, and you wish you could come here everyday even just for a plate of their rice and black bean sauce. If it is your first time here and you are not too familiar with Haitian cuisine, the waiters are very helpful in giving you great recommendations. There is also a terrasse outside, which we didn't get to try. So I am looking forward to coming here again before summer ends!"}
{"text":"They don't take reservations.We arrived at 8:00 PM. There were more than 20 groups on the waiting list... More than 1.5 hours to get a table. The staff was not nice and a bit condescending. We decided to leave. To bad, the atmosphere was great!"}
{"text":"Great food, start to finish. We sat on the upstairs rail and had 3 starters. One favorite was the Griot, which was a wise pork dish with a long memory. The hot doughnuts with hot quava sauce was great, but so hot I burned my finger. Definitely worth the visit."}
{"text":"Came in here on a Saturday night with my boyfriend to eat a little something and have a beer or two.   There was a wait so we gave our name and number to the hostess and popped over to Ti Agrikol upon her recommendation. We waited for about half an hour, then decided to check back in and were seated right away.   The place was packed and we were led upstairs to sit at the bar overlooking the first floor of the restaurant. I have to applaud our waiter, a young Haitian guy, who was working so hard and remained really attentive even through all the rush.   Food was great - we had the plantains (bananas pesées) and the Haitian beignets (Accras) and I loved the Prestige beer (even thought at $7 I found it overpriced).   Overall, I had a great time, there was a great ambiance and I can't wait to come back in the warmer months to sit outside."}
{"text":"Première visite de ce resto trouvé sur Yelp.  On commence avec des acras, qui étaient vraiment excellent l'assiette était un peu petite même pour une entrée. J'ai pris le poulet jerk, qui était bien cuit et bon. Encore une fois, la portion était un peu petite. Mon ami a pris de la queue de bufs: assez moyen, et un seul morceau de queue. Je ne sais pas si vous savez mais il n'y a pas beaucoup de viande dans un morceau de queue de buf, en donner seulement un est vraiment ridicule.  Bref, les plats sont inégaux et pour le prix on voudrait au moins des portions convenables. Un autre resto trop cher pour ce qu'il est."}
{"text":"I had a lot of fun at this restaurant, the service was great, the food was delicious. We shared a ceviche, it came with plantains. We had the corn and vegetables as a main dish, I thought it was vegetarian but it has meat in it so if you are vegetarian make sure to clarify with your water. We ordered the potato desert, I was very skeptical about it but it won me over. It is very similar to pain chomeur."}
{"text":"This place is so fun! I felt like I was on vacation because of the music and the fruity drinks!! The drinks are good!! My favorite was the kokonut (appleton rum, passion fruit, coconut and mandarin).  I also tried the zanana cocktail which is similar to a pina colada. The Haitian beer is an IPA. I also tried the ti ponch which is rum with sugarcane and it is pretty strong!   FYI the outside menu differs from the inside menu. I dont know why they do it that way. I think it would be better if they had the same menu but I guess they want people to come back and try their other menu. The terrace menu has grilled meats like sausage, chicken , pork etc. We didn't get around to trying the food outside because by the time we got to the terrace we were so full from our meal inside. It  took a couple of hours before we could get seated outside so we ate inside and then drank some more outside. I think in the end it worked out because we were told that we could not get the accras (Haitian beignets) and the griot (pork shoulder) on the terrace and they were both very good! The accras came with a mayo sauce and the griot came with plantains. The oxtail was good but didn't have very much meat on it. We also had the lambi plate which I found out is what is inside a conch! I never had conch before but it was good! I expected it to be chewy but it wasn't and it was cooked in a tomato sauce.   The terrace is very cute! There were large picnic tables and also white round tables with matching chairs. There's also big tree with lights! It's a cute date place or even just a fun place to go with your friends! I definitely recommend it! ;)"}
{"text":"Super resto, surtout la terrasse avec une senteur de bbq, win butler est souvent présent. Le porc sur le grill et le rhum à conseiller. Super resto"}
{"text":"Une nouvelle terrasse à Montréal est arrivée en 2016, celle d'Agrikol sur Amherst ! Jolie petite maison blanche, ambiance tropicale à l'intérieur, grand bar et salle sur 2 étages et puis vous avez la terrasse extérieur. Vraiment cool comme place. Les co-propriétaires sont Régine Chassagne et Win Butler d'Arcade Fire. Vous allez peut-être les voir là-bas, boire un drink. Passons à la bouffe, le menu terrasse est différent que celui de l'intérieur, c'est essentiellement des grillades. Nous avons pris mon amie et moi, le poulet (10$), les ribs (13$) et les bananes pesées (4$) et pour arroser le tout, on a pris  ¼ de ti-ponch (35$). Tout était délicieux et grillés à point et juteux. Les portions sont grosseurs tapas, parfait pour partager. On a passés une magnifique soirée sur cette terrasse, mais seul bémol, on a trouvé le prix un peu cher. Le  ¼ de rhum pour le ti-ponch était un peu cher pour le peu qu'on a eu, à notre avis. Sinon, vous pouvez prendre, une bouteille au complet à 120$, oui du rhum Barbancourt, pas du champagne. Donc, facture totale de 81,30$ avec taxes/pourboires. Je reviendrai quand même pour essayer le menu intérieur, par contre, le service était bien, les serveurs/ves étaient toujours là et attentifs pour nous.   4/5 visité en juin 2016"}
{"text":"Bel endroit. La cuisine haïtienne était bonne tout comme les ti punch. Cependant les quantités restent insuffisantes comparés aux prix! Il y a clairement un réajustement à faire à ce niveau la. C est pour cette raison que je ne mets que 3/5"}
{"text":"This place definitely has cool vibes as soon as you enter the place. The atmosphere is warm and welcoming. The drinks are cold enough and the food is  delicious. If you looking for a place to bring a date, finding a table on second floor would be just perfect. In fact, this place is perfect almost for any occasion: birthday dinners, friendly drinks or first date choice. The only downside would be small portions, but overall, it's still a good place to discover."}
{"text":"Super décor et super ambiance! Le resto se situe dans un ancien duplex aménagé avec soin! le menu en général est bon mais sans plus....très abordable et idéal pour les budgets serrés! La musique est au couleur du resto et peut être un peu cacophonique pour les oreilles sensibles....ce qui n'est pas un problème pour moi.....il faut se mettre dans le \"beat des îles\" pour apprécier le tout!!!"}
{"text":"This is a really solid spot. Great Haitian comfort food at reasonable prices and portions. Solid cocktails. The Griot and plantains were delicious as were the Haitian hush puppies.  Mac and Cheese was good.  The whole fried fish that flew by our table looked incredible.  If I lived in Montreal, this would a regular mid-range dinner and drinks spot for me, similar to a few Caribbean spots in Brooklyn.  As a visitor, this a fun spot to check-out, especially if you need a break from the more traditional Québécois food or want some tropical cocktails.  Not really a must visit, but for a lengthy stay it's a super fun, great choice in between the richer and more expensive dinners."}
{"text":"Very much enjoyed this place. But the highlight is not the food. It's the atmosphere and the people. So much fun, stylish, very nice and entertaining staff. Inexpensive. This is what gets the place 5 stars in my book for an affordable night out w friends.  By the way, the food is solid - I enjoyed it. The place does NOT take reservations so, if you don't arrive at open, you may need to wait. However, there's a great solution! Agrikol has a sister bar next door, also w a cool look, and a nice curated menu of cocktails and bites.  Very fun experience overall. Thank you!"}
{"text":"I probably should have given it a 4 star as the goat curry is more on the salty side. However, the most authentic Haiti food probably comes with huge amount of rice & beans rather than a small fun plate with 'almost only meat'!  This place satisfies your guilty pleasure of tasting small plates of authentic flavors with a little extra salt on your food or sugar in your cocktails. Yes, that's why the cocktails taste so good (besides, it has fresh sugar cane juice machine)!! The service is excellent and the decoration is so creative- many many beautiful objects and quotes in washrooms, staircases and roofs that will inspire you whether you're artists or lawyers!! PS: a huge terrace will open during summer!"}
{"text":"It's about time I write a review for my most favourite restaurant in the city... It's the place I immediately blurt out when someone wants a Montreal restaurant suggestion, and even though I've been upwards of a dozen times, I still want to go back for more.  I walk in the door and instantly feel like I am on vacation.  It's unlike any other restaurant in the city, the food is delicious, and in summer, their patio is one of the best.  The move for 2 people: Share 2-3 apps, 1-2 mains, and 1/2 bottle of rhum for 'ti punches. You won't be disappointed."}
{"text":"Music a little too loud, food interesting  Beautiful terrace though .!!!  I like the BBQ menu at the terrace ... but a bit pricy. Not best service ... i ordered a beer and never got it."}
{"text":"Ok. Ok. I was expecting a bit more... After reading a couple critics in the net, i had high hopes on coming to this restaurant. Needless to say that i was disappointed. First it is impossible to reserve and they had no way of communication. Perhaps in the near future? So a couple friends of ours, my husband and myself arrived at 7 pm and had been told that they would be a 45 minutes wait but that we could sit upstairs have a drink and an appetizer while we waited. We HAD to order something due to alcohol permits. So far so good! I was expecting a wait because this restaurant has been long awaited! Our friends ordered bananes pesées (fried plantains) and we ordered acras. The plantains were really crispy and good but needed a sauce! The acras came out crispy as well but really dark and tasted bitter. Was is the oil that needed changing?   So after only 25 minutes, we were seated at our table and ordered more drinks. Their cocktails are really good especially the fact that they use Barbancourt! They didn't have bottled beer though. That was weird because they have been only opened about a week. I guess it takes some adjustments...  Ok, so here is what we ordered: griots, two plates of oxtail with rice and a plate of cashew chicken. They all fell flat! The oxtail were the end parts and we barely had any meat to eat from. The rice was overcooked, watery and pasty. The two tiny pieces of chicken had no flavour and you had to dig for the cashews. I was also expecting the Chef and co-owner in the kitchen cooking but instead saw him walking around in clean clothes all night! Did i mention that by the time the waitress had came to our table to take our order, we had waited 1 hour for her? We were drunk before even ordering our food   I used to date this Haitian guy (now my best friend) and had a lot of real authentic creole food cooked by him and his family. This place on the other hand fell short on impressing me.   So there you go... My rant about this so called delicious new Arcade Fire-restaurant-creole-food-long-waited-restaurant-that-serves-super-good-dishes! A plus side and maybe the only good thing (well three...) great service, great cocktails and great ambiance! I came for the food but left hungry. Not a well 175$ spent!"}
{"text":"Jolie ambiance, choix limité des assiettes mais la terrasse sur la cour arriere est tres belle le soir. Je recommande le poisson entier frit, le reste que j'ai essayé juste correct."}
{"text":"Great ambiance and good food, but the service tends to be slow and the portions are not big for the price (the ingredients are nothing fancy..). We were two and spent $120-$150 on 1 app, 2 mains and cocktail for 2. The mac and cheese is very good."}
{"text":"We had an absolute blast at Agrikol. After hearing all the hype from my resto peers I was ready to have a critical eye on the place, but it seriously lived up to all the great talk. The music, atmosphere, space and staff were absolutely wonderful but nothing compared to the food. We tried the beignets, the plantain, the avocado salad and the pumpkin curry and there wasn't a bust plate in the whole spread.   I'm not a rum drinker so I didn't dabble in the cocktails this visit, but given how delicious the food is I'm thinking I'll be giving their bar menu a try next time. I'm firmly convinced this place is rapidly becoming a Montreal staple. GO!"}
{"text":"Very good food. From the front it was quite inconspicuous.. Almost all past it without knowing. Luckily for Yelp, we found this great awesome place for Haitian food. We tried literally be m everything on the menu. Mind you the menu is small. Very good food.. Something different."}
