{"text":"If you are looking for a perfect spot for date night, this is it! It has a great relaxing atmosphere, friendly staff, and a very diverse beer and wine selection! The food was AMAZING!!!! We started off with the bruschetta and it was so good we almost didn't save room for the main course! The Cubano panini is hand's down the best!!! Where else can you find pork belly in the valley? Great new addition to fountain hills! This is definitely a new favorite spot! We will be back!"}
{"text":"I don't know where to start! It's a small beer and wine bar that has such a warm and inviting atmosphere! The owner Broc set up his place for my family to have an amazing meal, great drinks, and lots of laughs after my husband and I got married. We kept our wedding small and intimate at the court house and wanted to keep dinner the same. Any restaurant would have rushed us in and out but the owner made us feel so welcome! He created a custom menu for us and had them printed up and waiting on the table for all 20 guests! I was able to have my cake delivered to them early and they had the whole place set up with beautiful decorations by the time we got there! The food was amazing and we had a huge variety of drinks to choose from! They also sell wine buy the bottle so at the end of the night we picked out a bottle of wine that we plan to save and drink on our 1 year anniversary. Everything was perfect and we will definitely be going again! Go check this place out you won't be disappointed!"}
{"text":"Delightful new restaurant in Fountain Hills.  Had an enjoyable dinner here last evening with my husband.  Intimate atmosphere without be stuffy.  Food was excellent.  We shared the charcuterie platter which was more than enough for two people when you are ordering other items.  My husband had the Cuban panini and I had the Apple, Brie, and Avocado salad. Nice wine selection offered.  We will definitely return when we visit Arizona again in the fall."}
{"text":"Terrific upscale spot for happy hour and light dinner in Fountain Hills.  Only open 4-9 Tuesday - Saturday.  Daily happy hour specials on their website.  Very tasty paninis, sandwiches and salads.  Had a nice AZ produced Cochise County Shiraz on \"wine Wednesday\" when full bottles are half priced."}
{"text":"Last day of Arizona to go back to Michigan. Saw that they opened recently and went. Loved the sandwiches? and salad. Will come for the sandwiches when I come back out!"}
{"text":"A relaxing late lunch, early dinner Friday at Aguamenti. The appetizer, salad and sandwich selections all looked great. Our choices were excellent. A nice beer and wine selection as well as some great cocktails. A nice change of pace for Fountain Hills. Check it out!"}
{"text":"This is a classy, unique place newly opened in Fountain Hills. Very pleasant interior and I really enjoyed my Cubano sandwich with delicious  homemade coleslaw. Definitely check it out for something fresh on date night !"}
{"text":"Hands down THE most amazing food...especially the panini's and cole slaw...and who could turn down 1/2 price wine Wednesday?!? Love this place...and Broc and Ashley are such amazing hosts"}
{"text":"My long-standing ladies happy hour was surprised and delighted by our recent Wednesday dates at Aguamenti. The atmosphere is perfectly suited for friends to gather for great food, wine, beer, spirits, and conversation. Just what FH needs! Thank you Broc and wonderful host Ashley!"}
{"text":"I was excited to check this place out. From the moment I walked in I felt comfortable. The staff is friendly and knows their product. They've got a good assortment of both beer and wine - I'm a beer person. I told the bartender, Ashley, what kind of beer I generally drink and she made a fantastic recommendation. My husband and I both ordered paninis, mine was apple & cheese and I totally forgot what my husband ordered. We were both VERY happy, VERRRRY happy. We both ordered the chips with our sandwiches, which were super good. I highly suggest you give it a try. It's a terrific alternative to the 'regular' spots you frequent in town."}
{"text":"I ordered take out through their website and it was quick and easy.   Their charcuterie board is legit! (picture attached)I ordered it to go and still impressive. I also ordered two of the crostinis and they were both AWESOME (#1 & 3)   If you forget about date night just swing through Aguamenti, stock up on nomnoms and vino and you'll be a hero. Better yet, go pick up your date and bring them here!  I wasn't able to dine in but the staff seemed friendly and knowledgeable. They had a strong beer and wine list. Looks like they have daily specials that repeat every week too like \"BOGO Bottles\" one night and a date night special on Saturday's. I'll definitely be back with friends to enjoy more of this hidden gem!"}
