{"text":"Good food and quick service. Great prices and food is delicious. Kinda hidden and a locals spot"}
{"text":"Breakfast is fantastic. It my go to place in this area.  Friendly staff. Clean place.  Try it Mikey, you'll like it!"}
{"text":"Was at a conference and this place was nice and close. They have all day breakfast, burgers and Greek food. Prices were very reasonable.

You walk up to the counter, order and take a number to put on your table. When your food is ready, they bring it over. It's not table service except that. No one will come by to check on you. 

The seating area is bright and clean. Went there twice and once they lost my dad's order. Soon as he asked for it, they made it right away.

Good food for the price and location!"}
{"text":"If I could give a zero that's what it would be.  Ordered bacon and eggs was told no coffee because they were to busy?  No line and half empty.  The burgers were gross.  Avoid this place like the plague!"}
{"text":"I walked from the Sandman hotel and approached the outside with some trepidation.   The exterior is not well kept and the street has a lot of litter.   Upon entering I found a clean,  friendly and modern restaurant.   I ordered the eggs, home potatoes and toast.  The order was fast and delivered to the table in a very friendly manner.   The potatoes were superb. I will definitely go again."}
{"text":"Nice interior and a large selection of dishes at affordable prices. 
Unfortunately I decided to order the $20 12oz steak and it was lacking any flavor whatsoever (aside from the burnt bits)."}
{"text":"Most things on the menu seem pretty decent. Tradidional breafast and the burgers are good. The Souvlaki dinners are also decent but the salad dressing is far too bitter and the rice is completely flavourless. Otherwise its a clean and fresh place. Price is about average."}
{"text":"L'extérieur n'est pas très glamour mais l'intérieur est bien. Le déjeuner proposé toute la journée me plaît, ça m'arrange de pas devoir super tôt après un vol. Les prix sont très raisonnables. Il y a une diversité de plats: du petit déjeuner classique, au steak, aux burgers. Ils offrent des petits desserts différents des cupcakes aux baklavas, selon la journée.  Le service est agréable et rapide."}
{"text":"I recently had lunch here with two of my colleagues. We arrived at about 12:15 p.m., ordered and paid for the meals at the cash and we were served within five minutes.

The portion sizes were fairly decent but I found the prices a tad bit high, especially for soft drinks. My colleague that ordered the fish and chips ($16+) really enjoyed her meal. I had a Greek salad with grilled chicken ($16+) and I had no complaints. However, my other colleague did not like his steak sandwich as it had no flavour and the steak was too thin. He has, however, eaten breakfast there a few times and enjoyed it. I noticed the breakfast prices were more competitive.

The restaurant itself was bright and clean and I found the service to be friendly. It also has a drive-thru should you prefer not to eat in.

It's nothing really to write home about but, in you're in the mood for all-day breakfast, burgers, fries, salads, etc., I can't see how it would disappoint. NOTE that the prices on the website have not been updated as of the date of this review.

Rating: 3.5 stars."}
{"text":"I placed an order on UberEATS because I was stuck at work and really hungry. I was really hoping the food would be good and plentiful, as breakfast foods always seem to come in smaller portions. 

Anyway, so I get my food delivered promptly, and I am impressed at how much they put in each plate. More than that, the food was generally fresh, tasty, and well made. They could work on presentation a little, though! 

Overall, you can't wrong with this place. Portion sizes are generous, the food is decent, and the prices are competitive! Highly recommended!"}
{"text":"I have visited this place many times for dinner and ordered variety of items (fish n chips, steaks, wrap and souvlaki) because my business trips sometimes require me to stay around the airport. Don't expect too much. It's a step up from subway and Timmy as food is made fresh and has better quality (not by a lot tho) than fast food. However, the good thing about this place is that it's never busy and the seating is somewhat comfortable. Perfect for people to come and chat or do some work while having a bite."}
{"text":"I must say I wasn't expecting much from the exterior of the place, but I had only noticed it a few weeks back, so thought I'd stop in. 

The service was friendly, I had a double bacon cheese burger, and could barely fit it in my yap to eat it. It was juicy and tasty. My mouth was happy I got that burger in, and after that meal I couldn't have eaten another bite, nor could I even look at those tempting pastries on the other end of the service area. 

The cook even asked me how the burger was, which impressed me that he obviously cared about his work."}
