{"text":"I am a huge, huge fan of Korean fried chicken and was honestly a little disappointed by the quality at Ajuker. We ordered a large half and half chicken (half fried, half sauced) and were disappointed to find mostly tiny, bony pieces in our meal. The texture was also too soft/doughy and not crispy like I expected. The passable pieces were okay to be fair, but for the price (I think it was around $25?) there are better Korean chicken places in Toronto in my opinion, though most of them are uptown. Decor and atmosphere are pretty much what you'd expect from a Christie Korean restaurant and the service was decent."}
{"text":"Like most Korean places, Ajuker is open late. They are known for their fried chicken, and I enjoy it for what it is - cheap, tasty, and simple. It comes plain or with sauce. I prefer the chicken without the sauce and with a bowl of rice.

Most times, I like the buldak (chicken pieces in sweet/hot sauce) - which isn't really spicy - but it ranges from \"it tastes like it was nuked\" to \"really good.\" Most recently, it's been on the \"really good\" side of things, so buldak with a steaming bowl of rice is nice with the cooler nights.

There are the usual suspects on the menu like bulgogi and kam ja tang, but it's the fried chicken and buldak that do it for me here. Another dish of note: a simple, but interesting, egg soup that's nice for when you don't fee like fried or spicy.

This place is usually pretty quiet and Korean shows play in the background. I prefer it to the more raucous noise of busier Korean eateries."}
{"text":"Ive been here multiple times with groups of friends of 4-6 and always got the beer and chicken combo. The chicken tastes really good but is really overpriced for the amount you get. Me and my friends never get full and usually order a second helping or just find somewhere else cheap near by to get full. Hopefully they can either change the price or give more chicken."}
{"text":"Went with several friends, service was friendly enough.  We love fried chicken, and we each ordered small half & half (meaning half original flavour and half sweet/spicy sauced).  The chicken was certainly hot, crunchy and delicious.  However, a couple of observations:

- We each ordered a small.  Instead, they brought our orders dumped all together on the same plate.  This is NOT professional - we each ordered separately, so give us our separate plates of chicken.  We had no way of telling how much each of us should have gotten.  Also, they charged us individually for small, when in reality the plate was the equivalent to what neighbouring tables had ordered as a medium (which costs $4 less than the sum of our orders).  Not cool.

- The place looks like a dive.  It was really dirty and beat up, like the kind of dark place you'd visit after getting drunk at the local pub.  The interior of McDonald's is high class compared to this.

Good chicken, but definitely get it to GO."}
{"text":"Food is satisfying but nothing to brag about. My partner and I, like to pop in every now and then, when we're in the area for chicken/beer. It's deep fried and the special sauce is flavorful. I don't recommend the green onion sauce for an extra $2.50. Not worth it, IMO. Expect to get a little messy when eating. Vegetable pancake is good."}
{"text":"Ajuker Fried is apparently Korean fried chicken, little chunks of meat battered and fried in oil, topped with a sweet & pepper sauce (more sweet than hot). 

What I like about this place is: 

a) it is relatively cheap. 
b) they have combos which give you beer/soju plus chicken, fries, diakon, soup and salad. 

Ajuker is by no means gourmet, but if you're looking for fried chicken morsels and soju late at night - consider stopping by.

PS - I think this place is called \"Ajuker Fried\" (not \"Anjunka\")."}
{"text":"Food isn't really outstanding but it's definitely no disappointment. The prices are what  I appreciated the most because for less than $10 you can definitely get a decent meal.

The chicken was a very pleasant change to the typical chicken wings you get in pubs and other wing places. Different batter, different sauce, different texture, I enjoyed it. The presentation was pretty sloppy but other than that, not much to complain about."}
{"text":"Chicken was really nice!!!
Soju is 12.99 Cheap
The restaurant is my favorite. 
I had one fry chicken and soju. 
I loved that chicken.... But customers was not too much. 
Staff were kind . But shy.."}
{"text":"I went here on a Sunday with my friend for lunch. We both ordered the pork bone soup. The meat was super tender but the broth was just ok. The kimchi was disappointing because it was really salty but the rest of the sides were fine. Overall, this place has a great menu and the prices are really affordable for all the food you get."}
{"text":"OK so I'm actually going to this restaurant because I'm still on this mission to find better or the same quality of Korean fried chicken that I had in NYC at Turntable.  In reality every place I've gone to so far besides Turntable by definition could have been \"Meh, I've had better\" but the others here so far (My wife's homemade version, The Fry, K-Pocha) are all deserving of some sort of consolation respect for at least making something decent or better.

I admit I had much higher hopes for Ajuker because the business name has chicken in their name!  Jennifer K once said to me, \"Good luck finding good KFC in TO\".  Well I'm not giving up yet because there is an entire city out there (and adjacent cities) who I'm sure have some respectable KFC out there but that I just haven't found it yet.  Ajuker is sadly the lowest on the totem pole to date in my search for KFC like NYC's.  

I arrived at this business who had their OPEN sign lit up but when I went to pull the door open it was locked!  I looked inside like a stalker with my hands to the side of my head to cover the glare to peek in to see if there was anybody there.  This place has no sign for hours of business.  Did I come here for nothing?  I saw somebody inside sweeping the floor so I knocked on the door.  I saw them coming over.

She opened the door and I had asked if they were open and she said yes and let me inside.  Now if you are open and you want customers I'd say open that dang door!  Giving people the impression that you maybe closed is a good way to have people leave.  Anyway I do get in so it's all good.

I'm looking at the menu and instead of getting a cut up bird like my previous experiences and since I was by myself I decided to change up the parameters a bit.  I had gone with a pound of wings and also asked if I could get them with soy.  The wings were 15 bucks for a pound and an additional charge for the sauce.  It seems a little pricey but I was anticipating they'd be great so no issues there. 

While I'm waiting I get what seems to be a Korean standard of a particular shaped clear plastic water carafe as well as rather generous bowl of that pickled radish or whatever that stuff is... honestly I eat it but I have no clue.  They even gave me bowl of not so great popcorn too.

The wings came and I my mouth was watering.  I waited as they had to cool down as they came basically steaming hot.  Eventually I helped myself and so sadly I was disappointed.  The wings although they looked good were not as good as they looked.  They were not as crispy probably not as fresh as they looked either.  I really can't say why but they just didn't overwhelm or even satisfy.  The taste seemed bland.  While they were juicy it was almost as if they were too watery.  The skin seemed to lose the crunch if they honestly even had any to begin with.  Although they looked like they didn't have that much sauce on them because they really did not, they just didn't seem worthy of being 15 dollars.  I can't say they were worthy of being 10 dollars or 8.  

The bottom line, the wings were not crispy or crunchy as I've come to expect even though I could see the thin layer of batter.  The wings overall were too wet inside and out to the point that the bowl had a collection of juices at the bottom.  By the time I got to the wings at the bottom of the bowl they were practically submerged in juice and obviously no crunch there.

I was VERY disappointed in this meal I'm really sad to say.  This place as I've said IMO at least ranks 3rd so far in restaurants in the Toronto area so far out of 3 places (K-Pocha, The Fry and Ajuker 3rd). 

I honestly cannot recommend this place nor do I really see a need to return as far as the chicken goes."}
{"text":"In August I went to new york city with a friend. After a 12 hour bus trip, we went directly to Bon Chon, the Korean fried Chicken near 35 st. It was a blessing for who was eating chips for last few hours, please see the review I wrote before.

After that trip, we were searching everywhere in Toronto hoping to find some places serves Korean Chicken. Nth, we saw sth in the Korean Super Market, but doesn't look the same.

I might need to explain what is a big deal of Korean fried chicken wings. It is just..very crunchy outside and juicy inside.. only fans understands that ~

I found Ajuker Chicken accidentally, while walking from finch to steels. I texted my friend, we went right away.

We order all the flavors on the menu, (have to say the service is very warm, waitress is helpful and nice). The transitional is just deep fried, as crunchy as we had in NYC, the spicy one,, is not really spicy.. that is the only thing we were not very satisfied. (altho the sauce is kinda sticky to my taste) We also ordered sweet soy sauce and a special one covered with green onion. Friend loves the sweet soy sauce, but I considered it too sweet, I love the green onion with a mustard touch. Anyhow, All the chicken wings are crispy outside and juicy inside. We were so happy~

I was debating giving a 3 or 4, so that I asked my friend, he insist i post a 4 star,~ so there~"}
{"text":"The restaurant was almost empty when I came in. It was dark, kind of dinghy and smelled very faintly of urine. Staff were accommodating. Not the most friendly but they were nice enough to provide me with the password for their wifi! Fried chicken tasted good but could have been better - there wasn't a lot of meat. Mostly bones. Rice and sauce were good but there just wasn't enough rice. Price was good though - for $5, you get just enough to fill you up for lunch. Would I come here again? Probably not. Overall rating? 2.5 stars."}
{"text":"This is not authentic kfc (Korean fried chicken). In Korea, chicken is fried in extra virgin olive oil. Ajunka uses regular frying grease. The batter is not flaky like the authentic fried chicken, and the spicy sauce  over the chicken is not spicy enough. You get better chicken at Popeye's."}
{"text":"Very dim inside, empty ( but don't be alarmed), mom & pop feel, accepts debit, cute Korean girl working the cash register, great flavors in the beef bulgogi.
This location is worth a visit."}
{"text":"Fried chicken is alrighttt. It's not super crunchy as I prefer it to be. Pieces are also too big which makes it unfair when sharing a plate with friends. Either that, or you have to portion it equally yourselves with fork and knife (super messy tho). The side dishes that it comes with are plentiful though. 

Don't think I'd come back for chicken! Nothing super special here."}
{"text":"This place never had the best Korean Fried chicken, but even then, it was always alright. That is until my most recent visit. I don't know what they've done, but it definitely isn't for the better. I got a mixed order of the soy sauce, and the special sauce, and both were not good. the special sauce had a weird taste, and even worse the texture was terrible. whatever batter they're using now was doughy and not crispy. Bad sauce and bad batter, is just unforgiveable. I didn't even finish it, and had no desire to take the rest home. If you know me, that's a very very rare thing. I hate to say it, but I probably won't be returning to ajuker ever again. sad times."}
{"text":"I think this place is known more for its fried chicken which we didn't have. We had daktoritang (chicken and potato soup) and (my favourite Korean food) dakgalbi. I'd never had daktoritang before and enjoyed it very much. The dakgalbi was good but a little disappointing (not very spicy). The staff were very nice and let us sit chatting long after finishing. I probably wouldn't bother to go back but I enjoyed my meal."}
{"text":"Somebody PLEASE tell me what \"Ajuker\" means - I've been trying to figure this out. 

I came here yesterday for my friend's birthday to Ajuker Chicken.  It's a small little restaurant -- was easy to miss.  We went in, and requested for 8.  We had to add a table to the end of one of the booths.

Service was great -- the waiter was friendly and joked around with us.  We ordered SIX (yes, SIX dishes) among us 8.  We had two half & half chickens, spicy boneless chicken, fried boneless chicken, french fries, and spicy squid.  The half & half chickens were good - I really enjoyed that.  Plain chicken and then another side of saucey chicken.  The boneless chicken was okay - but I really prefer chicken with bones (there's just something about it that makes it so much better).  The spicy chicken was good too; however I didn't enjoy it THAT much.  The French fries were mediocre.  Spicy squid was good - however, I found more vegetables than squid, which was slightly disappointing.

As side dishes, they provided us with daikon - which I snacked on continuously throughout the night; an interesting coleslaw with mayo and ketchup on top; and a refreshing bowl of soup that is shared among everyone.  The soup was delicious because it offset the fried greasiness of everything else."}
{"text":"I'd say it's my FAVOURITE fried chicken place of all time! 

The yamyam sauce is incredible. Please get the half half(half original, half yamyam). It will definitely blow your mind. It is heaven for a heavy late night snack!

But except for the fried chicken, everything else is a meh, nothing impressing.

5 stars for the fried chicken, 3 stars at max for everything else.

One more thing to notice, idk if its just me, but it feels like they are giving a bit less with the same price."}
{"text":"The fried chicken with special sauce is so good. I usually don't enjoy sweet gooey sauces but this one is to die for. I especially love the little pickled radishes (?) that they come with."}
{"text":"The only Korean chicken joint in Christie K-town!

My friends and I came here looking to enjoy some \"Chi-maek\" (Chicken and beer). We ordered a large chicken, half fried half marinated, and a spicy fire chicken. The marinated half was delicious. Not such a big fan of the fried chicken though. As for the fire chicken, it could've been sweeter, but the spiciness covered for that. 

Atmosphere and interior were a little underwhelming compared to other \"chi-maek\" places I've been to. However, they do have live k-pop on TV for those k-pop lovers.

Will be back when in this area and craving chicken and beer. Do get the pint of beer with your chicken! It's a modern Korean tradition."}
{"text":"I went to Ajuker Chicken after a long day at work.  My colleagues and I decided to get some fried chicken and beer.  We ended up getting two medium half/half (special sauce/crispy fried and green onion/crispy fried).  My favourite one is the green onion.  We were given free appetizers which was a bowl of radish, tofu skin and salad to share.  The food tasted alright, however, my colleague prefers to go to \"The Fry\" down the street from this place.  To me, I have no preference which one to go to.  However, if you're looking for more authentic Korean fried chicken, I would stick to Ajuker Chicken. 

I would actually give this 3.5 stars."}
{"text":"Actually the worst fried chicken of my LIFE. Tasted awful, oily, and made me feel sick soon after eating it. 
Nooooo thank you, never again."}
{"text":"Read about it in the Globe.  Yum!
  Small hole in the wall.  Decent service not the \"hi\" I'm your server today which is too much.  Lunch was great.  Bulgogi tasty not salty and came with rice.
  The KFC, Korean Fried Chicken was superb.  Had the half/half special sauce and green onions.  You may want to order rice since it comes a la carte.
 Will go back again and again."}
{"text":"Was pretty disappointed with this first (and likely last visit to Ajuker). I was excited to go mostly  for the dak galbi, which I have not had since being in Korea 6 years ago. The decor is what you'd expect so not much more to say on that. The place was completely dead at about 8:30 on a Thursday which was a little bit surprising. 

The banchan to start was pretty sparse. A bit of kimchi, seaweed and pickled radish and not much else.

Between 3 of us we ordered the large dak galbi and the \"chicken wings\" at the recommendation of the server. Dak galbi was decent - nothing to write home about, and mostly dark meat (unsurprisingly). The chicken \"wings\" probably consisted of about half or less of wings and the other half of legs and thighs. In addition, their \"special sauce\" basically tasted like plum sauce and honey with sesame seeds. Super sticky, super sweet, and not to my liking (though clearly subjective).

Overall not impressed with the quality nor flavour of the food. It wasn't terrible, but the main reason for knocking them to a 2 was for trying to pass legs and thighs as wings."}
{"text":"I was kind of excited when I see the Bright Red Sauce on our half and half chicken...

Usually Red = Spicy specially in a Korean restaurant? But disappointingly the sauce is a sweet sauce... or is it sweet? or sour? or just some colouring? I just could not pin point the taste...

The plain fried chicken is quite crispy though..

Medium Size is good as a snack for 2 people to share... as an afternoon snack? Some beer or Soju would have made the experience more enjoyable... 

Ajuker Chicken is kind of homey..simple with no decoration. Service is warm and friendly."}
