{"text":"I was very excited to try this place after reading the reviews, too bad that it looks like the place is closed down now."}
{"text":"So what else would I be looking to do on a Saturday afternoon but meander down to Kensington Market for a relaxing day and perhaps replenish the za'atar supply in my home which had completely run out!  I was really looking to buy only that one item, but oops, I kind of went overboard when I wandered into this place.  I decided I was also in desperate need of tahini, labane and some baklawa, so I got all of those to go and enjoyed them over the next few days with a few family and friends (but mostly myself).    However, I also got hungry standing there, watching others ordering a falafel sandwich and ordered a chicken shawarma in a laffa bread.  Luckily I had a magazine, so I sat down and enjoyed it.  This is the first place I have been to in Toronto where they load the sandwiches with an incredible (and colourful) amount of vegetables.  Bright red tomatoes, spinach, onions, spices, tahini...it was delicious!  And cheap.  I cannot wait to go back and try the falafel."}
{"text":"Great food, great prices! I'm vegan, so it's always nice to find new places that offer lots of options for me (especially clearly-labeled and well informed ones). The sandwiches are awesome and so fast and cheap, especially compared to the other vegan-friendly places in the area like King's Cafe and Urban Herbivore (which I also love, don't get me wrong!).   Akram - I'll change my review to a 5 if you go 100% vegetarian!"}
{"text":"Overall a very good dining experience for the money. You really can't go wrong with their lunch specials at approx $ 6.00 or so.  They typically have a chicken, beef or vegetarian dish with rice and salad. The dips on sale are also very good including the Labneh."}
{"text":"What a rip off.  This place may have good food, but they rip you off when  you buy a take out platter.  We specifically asked the staff how many people a platter would feed.  They showed us the plate and said \"3 people\".  We had guests at home, so we ordered 3 platters, thinking that it would feed 6 adults, for sure.  We take the food home, open the boxes and found out that each platter would have barely fed 2 adults.  The amount of meat given was laughable, and the size of the salad was small and by the time we got home, all the hummus, garlic dip, etc. had spilled all over the salad because they did not put any plastic covers over the sauces.  We hurriedly went out and bought additional food for our guests.  What a waste of money.  Lesson learned.  Will not come here for anything except for the ultra cheap special sandwiches, which I am guessing will at least feed ONE person.  2 stars for being ripped off.  Would be one star, except the food was decent."}
{"text":"So this place has been here for nearly 20 years, and it looks like their prices have barely changed since they opened.  Hot plates for $5 and falafel and shawarma sandwiches for $2 and $3 respectively?  Amazing.  I had the falafel sandwich, and while it doesn't come with much in the way of toppings, it's a tasty, messy sandwich (FOR TWO DOLLARS HELLO)."}
{"text":"I loved this place years ago, before they had to close....and so I was thrilled to find that they had reopened for business. I had their lentil soup (meh) and falafel sandwich (double-meh) and my partner in crime had their chicken kebab sandwich (triple-meh). Disappointed!  In short, they take such amazing care to make a fresh-to-order wrap, filled with all sorts of wonderful fresh veggies, and yet the final product was almost completely tasteless.  I don't really understand how they do it.  Or maybe I do: add a little salt and a little garlic, and perhaps...just perhaps...the problem may be solved."}
{"text":"I bought the price dodger coupon for this place, $10 for a $20 platter. There is no way the platter I got would normally be $20, it was the size of a food court take out dish for lunch.  Small amounts of rice, cabbage, lettuce, a cabbage roll or 2...  I said it was a lot smaller than the ad led me to believe and the counter lady (who was the owner) said she would give me another of the same size for $10 as I got the $5 for $10 deal. I told her no, I got the bigger size, the $10 for $20 size but  she said that apparently was the same size as the cheaper deal and would cost me another 20...huh?  The prices seemed to change as I was there, ie go higher and the lady was very confusing - she charged me $10 for a serving spoonful of rice with some soup poured on it, but I thought she had said it was $5 at first.   Also I was supposed to get 10% off on the rest of my order with this coupon and while I spent an extra $23 she took 60 cents off a can of artichokes I was buying and said that was my 10% off.  Fast talking. Felt like I was being had but wasn't sure how to deal with her. Too bad as I am moving to the hood and would have liked to have the vegan cuisine.  Bottom line: they lost me as a customer.  edit:  I have sent a note to the online company from whom I bought the deal, will update when I get a response."}
{"text":"I've never written a yelp review before, but I'm so bummed out by this experience that I actually went ahead and made an account.  So, after reading a bunch of reviews about this place I was really excited to go and try the falafel wrap, but once I got there I was really disappointed.  The store front was really dirty and looked really vacant and uninviting and I'd have totally overlooked that if the customer service was good, or at least average.  The woman at the counter (who I'm assuming is one of the co-owners from the pictures) was kind of discourteous from the start. For one, she started the transaction while on her cell phone, and then after taking my order (while on her cell phone) she made my wrap (while on her cell phone.) When she went to charge me, the cost was higher than what I'd expected for a falafel wrap. When I double checked with her, she insisted that I'd ordered a shawarma wrap. While it's possible I misspoke, it's also pretty likely that she wasn't listening properly (as she was pretty invested in her phone call...)  The thing is, I offered to pay for the shawarma she had made and just get the falafel instead and pay the difference for the meat I didn't want. It'd have been really easy to just take the meat out of the wrap she'd made and put in falafel instead. She refused to do this and insisted I pay for TWO wraps because as she put it \"I'm doing this for you, here.\"   Look, I work in food service as well, and I understand that mistakes happen and the customer isn't really always right, but even if it had been me who'd made the mistake, she really didn't need to be rude and speak to me as though I'm an idiot.   I wish I'd just asked for my money back and left and gone to literally any of the other places in the city that serve falafel instead of paying 4.50 for a shawarma I didn't ask for and didn't want."}
{"text":"Best, no surprise, $5.00 lunch in the city!! Wholesome, basic, tasty dishes. Can't go wrong."}
{"text":"Tasty shawarma sandwich. Couldn't help myself from ordering fresh all wheat pitas as a to go. They however charge a buck extra if you pay with the magnetic strip but with a 2.99 shawarma sandwich I am always happy to oblige"}
{"text":"Such a fun little place in Kensington! The food is no frills mediterranean, they have some great lunch specials for 5 bucks, we got the chicken stew and lamb kabob with rice and salad. We also tried the chicken shawarma which was moist and tasty! All the food tastes like its fresh and homemade. We got some hummus and harissa paste (super spicy!) to go. The lady at the counter said she prepares most of the food herself! Will definitely be back for more!"}
{"text":"Akram's is an oasis of Middle-Eastern goodness in Kensington Market.  They are back better than ever having recovered from a devastating fire.  The new location features both a splendid market and an excellent menu of freshly prepared foods for dine in or take out.  This a family run place and it shows; from the friendly helpful nature of the staff to the selection of top quality grocery items and ingredients in their hot food items. Akram's not skimp to keep price points low - you know who I'm talking about!  One of the best aspects of Akram's is their commitment to providing high quality, supremely delicious vegetarian and vegan items on their menu regularly and affordably.  I dare say that their vegan blue plate special is the most affordable full meal (protein, starch, salad) meal deal in the GTA at a whopping $4.99!  Otherwise, great falafel, excellent hummous wrap, and superb soups for winter dining.  If you're in the market for an inexpensive healthy lunch while shopping in the market area you probably won't do much better the Akram's - if you're price conscious - meaning that money matters really matter, then you've found a new favourite."}
{"text":"This was the cheapest place in the Kensington Market - or even Toronto to get a falafel! Then it closed down unexpectedly and was shut down for more than a year.  It reopened and it was larger, cleaner and had more options. The food is still good value, tasty and the staff are all very friendly!"}
{"text":"I discovered a love of Labneh a few years back and took a few trips to Akram's, the only place south of the 401 that sells it apparantly.  Then, it looked like it had burned down- totally shuttered. No notice, nothing!  So, I moved on, I tried to forget about the Zaatar and the pita from the grocery part of the market. And now it's back and way bigger and better than ever. seats in the front for noshing your hot veggies or other Lebanese specialties. Same odd assortment of yogurts, cheeses, dips, yogurt-cheese (labneh) and pita as before.  I try to pop in for groceries. I have not tried the hot food, but for the same price as Subway's footlong, you can have home-cooked food. Very student-friendly."}
{"text":"This was the first time trying the Falafel out. The Falafel itself was really delicious, but it was a tiny portion. Given the low price (around $2), I would not much complain about the small portion.   The Halva was not that good though. I will have to try it out again, but I didn't like it much. I have had much, much better Halvas. Overall, I would recommend Akram's Shoppe to everyone! Next time I am going to try the Chicken Shawarma."}
{"text":"Having walked by Akram's probably a few dozen times but never noticing it was there, I popped in finally this past weekend to try the vegan-friendly menu.  Their menu is well labelled as far as what is available for vegans - a staff member saw us checking out the menu and started to tell us about the daily special, but she did more to confuse us in the end than help us make our decisions. She was also not so great at paying attention to the questions we were asking, or the specifics of the order (a friend ordered two sandwiches and ended up with one). I got  a small lentil soup (delicious and warming) and one felafel sandwich. While the sandwich was cheap, I felt that it could've been a bit better made with more fillings for the size; I also found the felafel to be a little bitter - i've definitely had nicer elsewhere.  Their grocery and deli section seems well stocked with speciality products, but as my aim was to get a snack I was left feeling a bit lukewarm; I think had the service been better, I could happily give Akram's the third star. Maybe another time."}
{"text":"How can you not be a fan of Akram's? They have one of the most inviting store fronts anywhere with a gorgeous couch, coffee table and hutch inviting you to come inside and set a spell. Stairs lead up to a long L-shaped counter where you can order all kinds of middle-eastern snack food. They also specialize in all kinds of imported food stuffs from that part of the world and they line the shelves on your way in.  Since they've been in business for many years, as long as I can remember, you know they have the right formula for hitting the spot with a nice shawarma or falafal. One of the features of their menu is that you can get smaller portions if you aren't as hungry and just need to top up. Falafals can be had for a pittance and my shawarma was only $3.99 since it was a small one - perfect for that day!"}
{"text":"Went here a few days ago as part of the Yelp Elite Tasty Tour.   The owner (I feel like an ass for not remember her name), is the warmest, sweetest woman ever. Totally recreated the sensation of being over at your friend's house and her mom is the mom that takes care of everyone. Super welcoming.   Got a bit of background on the restaurant/venue and the types of foods available and she let us pick what we wanted to try. I grabbed a chocolate halawa which was so good but so rich! (In a good way)   They also have $1.99 full size shawarma/falafel sandwiches - I didn't try any as I was planning on going out to dinner after the tour but everyone who got one was raving!   Ambiance was a little on the cool/cluttered side but not awful, could be cozy with the right attitude."}
{"text":"AKRAM'S IS ACE.  A delicious meal for $4.99. You think Ghazales is good cheap counter eats? Bitch, please!!! Okay I'm sorry, no disrespect Ghazales (I've certainly given you a lot of business over the years) Akram's just rocks my little world.  This isn't a sandwich for 4.99, folks--but FYI their falafel sandwich is 1.99 (!!)-- this is saffron, turmeric and lentil rice, a delicious grilled and spiced chicken kebab (and 7 other options to choose from),  2 different kinds of salad, homemade hot sauce and tahini. You can take it to go or sit like a proper mensch and eat it on a real plate with silverware. Tons of interesting drink options too.  They have a lot to offer:  http://www.youtube.com/watch?feature=player_embedded&v=h0hDscejvJg  I love buying their fresh and fluffy pita breads (so cheap and good $1.75), fresh hummus (small for $2.99, large for $4.99), zataar spice mix ($2.29) and others, stuffed grape leaves (75 cents each for fresh ones and you can also buy them in cans) and random stuff like rosewater and middle eastern treats (e.g. halva, nougat-based sweets).  ACE!"}
{"text":"My mom took me here recently.  I've read about this place so much, about how cheap and delicious the food is.  When I told my mom about it, she was like \"oh yeah, I've been there, it's good.\"  I was like \"why have you never mentioned it to me?  And why haven't you taken me there yet?\"  LOL.    So on the day we went, there was a handwritten sign that said \"Today's Special\" was $2.99 for a chicken shawarma sandwich and $1.99 for a falafel Sandwich.  Not sure what the regular prices are.  My mom said she hadn't been there for over a year and she thinks the last time she was there the falafel sandwiches were at least $2.99.  Anyway, I had the falafel and my mom had the shawarma.  You get your choice of white or whole wheat pita, and the usual toppings.  I liked the fact that I got 3 pieces of falafel in my sandwich.  Many places only put 2 pieces.  The falafel was really tasty and had a nice spice blend to it.  I had a taste of the chicken shawarma and it was also good.  There was a decent amount of meat in the sandwich (not overly generous, but not skimpy either).  They also have the middle eastern dessert that's like Turkish Delight with pistachio nuts in it.  They have it in pomegranate flavour here that I've never seen before.  It's $0.65 a piece.  It was awesome!"}
{"text":"I love this place. I was visiting Toronto, and I stayed in Kensington Market. During my walk around the neighborhood, I stumbled upon this hole-in-the-wall place. They are known for their falafels, so that's what I ordered. I wish I was in Toronto longer, so that I could have tried other items on the menu. The falafel is made-to-order and the ingredients were fresh. The owner is really nice. My only qualm about what I had here was the Arabic yogurt drink. I guess it's an acquired-taste. To me, it tasted like a salty yogurt drink. Not everyone is going to love this drink. Overall, I would come here again the next time I'm in Toronto."}
{"text":"This place was a lot of fun; it was one of the stops on a sweet treats tour of Toronto and we tried a few treats I would never have choose on my own. They were great! We also left with samples of a different type of sweetener that I had also never heard of before - the shop is famous for it, so I'm sure if you ask, they will know what you are looking for. The Turkish Delight was also wonderful!  The shop also had all sorts of spices and other wonderful imported goods. Had we more time, I'm sure I would have stocked up on all sorts of goodies!"}
{"text":"$4.20 for two delicious falafel sandwichs. FOUR DOLLARS AND TWENTY CENTS FOR TWO DELICIOUS FALAFEL SANDWICHES. Seriously.   What impressed me most (and what sets it apart from nearly every other falafel sanny in T.O) is their pita - they toast it and fill it with an appropriate amount of sauce which does not leave it soggy or chewy. It's a great meal and I;m looking forward to seeing how good an indicator it is of the care they put into their other dishes."}
{"text":"Akram Shoppe is located in the wonderful Kensington market. They specialize in Syrian cuisine from the Druze region.  They are part super market and part take out restaurant. There is a small seating area that can be busy during peak times.  The owners are a couple that came to Canada in the mid 90s  The portions may be a bit smaller than other places but you can be rest assured that these proud owners are really focused on quality before quantity, while offering one of the cheapest meals in town.  Falafel is $2 and each is fried to order. She makes them using mung and fava beans with cumin, garlic, and coriander. They are nor premade then heated up  The Tabouleh salad is the freshest I have ever had and its prepared to order so its not soggy.  Ful is something I have not tried yet but its a fava bean stew served with tahini, parsley, onions and a splash of olive oil.  People really seem to come here for the combo plate special which at $5 is a steal. Saffron Basamati rice, black lentils, salad with lemony tahini sauce and a choice of  an item from the hot table. I had the lamb kebab that is spiced up , grilled and sits in a tomato sauce. You cannot believe how moist and flavorful it is.  They offer an impressive desert section with sesame cookies being a favorite.  On the way out grab some packages of nuts, hummus, and couscous for your lunch the next day.  Healthy and Fresh and served up with a smile by people who treat their customers like family.  if you come for a $5 lunch then bring a $20 for the extras to take home"}
{"text":"Went here for the first time yesterday on the Yelp Elite Tasty Tour and really enjoyed the experience. The owners are very sweet and proud of their fresh foods.  I tried a delicious little flaky pastry with pistachio and cashew - so yummy! I also picked up a little bag of freshly roasted lemon and salt pistachios, which were awesome.   Definitely want to come back and try their $1.99 felafel sandwich, looked delish!"}
{"text":"I was pretty satisfied with my flavourful felafel sandwich from Akram's, particularly because they were very generous with the pickled turnip. As people have said, ordering is slightly confusing as you have to go all the way to the back however that just lets you walk by and inspect the full range of food."}
{"text":"A hot and hearty meal for $5, what more could you want?  Upon witnessing an (extremely) indecisive young girl struggling to decide between the chicken or vegan, the sweet lady behind the counter who I believe was Ms. Falafel, was kind enough to give me a taste of both options. She then handed me a plate with an extremely generous helping of rice, salad, stew and a spoonful of hot sauce that was almost a paste - super delicious and not your typical Frank's or Sriracha.  Next time I visit I will be sure to try the falafel and their sweets!"}
{"text":"oh Akram's is open for business people! You need to go... although I wouldn't drive an hour for it like previous reviewer kavitha k did. I think it has recently reopened. I don't understand how they can sell their food for so little. A huge falafel stuffed pita with all the fixings you could ask for plus a bottle of water was only $5 and change. WTF! All the ingredients are fresh, nearly everything is vegetarian or vegan, which is great for me. But they do sell shwarma and broasters chicken as well. Those items will run you $5.99. Still, a hot deal! I want to eat here everyday. I definitely would if I lived in the area. I love middle eastern food and ingredients so this a gem of a place to know about. You can buy all kinds of hummus' and other dips to go as well as other authentic items. Akram's is a must see!! Apparently it even stays open until 11:30 pm after everything else on the strip has closed (not yet determined)."}
{"text":"I also got wind of this place from that Sun TV show. I checked it out for lunch today. I ordered a couple of falafels. They are super cheap at $3 a pop. Two was probably a little too much food. Ordering here is a little confusing. You come in and the menu is at the very back and so is the server who actually makes the food, but you are supposed to order in the front. It can be disorienting if you go at a busy time, and with a bunch of people as I did.  The falafel is pretty tasty. They make it with mung beans instead of the usual chick pea and fava bean mixture. Its a little lighter tasting. My one criticism is that they do not put in enough tahini! they just dab a bit on the top and then flip it over in the bag so it starts leaking out!  I will be back though. I'll have to try their \"steamed\" shawarma's. Not sure it will be good, but it must be tried. 3.5 stars."}
{"text":"The falafel was ok. Nothing special. However its pretty darn cheap. There are few places to sit. The place dosnt have much seating.  Its also a store witj lots of things for sale."}
{"text":"As a former dweller and permanent lover of the Levant, one day in Toronto I decided that this long-distance relationship wasn't working out and that I was slowly crumbling inside without some spice in my life. A friend sent me to Akram's and...let's just say that it was really good.  I was specifically looking for sumac, which is that dark spice you normally encounter in Lebanese food, and if they had zaatar, it was just an added bonus. It turns out they had both and I managed to buy a container of each plus some fresh grave leaves, all for less than $10. This is almost as good as any souk or shuk I've been to.  One of the women that works there is from Syria and she gave me an in-depth insight and wonderful impression of her country. She also encouraged me to buy pomegranate molasses next time I come in, and you know, I think she might have won me over on both accounts.  This review is simply for the experience. I left off one star because I haven't tested any of their foods, but I cannot wait to go back!"}
{"text":"I got a falafel wrap that was fresh, flavourful and filling for $1.99 here.   The above could be my entire review, like that is enough to give anywhere 5 stars. I ate dinner for a twoonie. Think about that. I am kicking myself for not knowing about this place when I lived in the hood in uni. I mean. What.   Akram himself is behind the counter, and people go nuts for their sweets. But let's stick to what's important: You can buy a good dinner for $1.99. The world is still a great place."}
{"text":"I really love this place, I'm so happy to have a place like this so close to my work. I will admit that I haven't tried a huge variety of their selection as I always get the lunch special for $4.99 but from the selection they have for that special I have always been so pleased. I would rate this place as my # 1 spot for lunch in the market. Great place and a must try"}
