{"text":"Great food. Pizza is much better than other popular chains like pizza pizza. Owner is friendly. All halal."}
{"text":"I've been here a few times. I've had the pizza and chicken wings and would rate everything that I've had 5/5.   The service however, could be better... I've called to place orders and sometimes they aren't ready when they should be. One time I called in and ordered, arrived 20 minutes later, and when I got there he just started the order.   It is a small family owned business but the food is quite good (highly recommend the wings).   Parking is not the best for this area... can be tough to find a spot.   There is seating available but it is limited and nothing fancy.   100% halal restaurant."}
{"text":"It is a hole in the wall but the chicken burgers are amazing.  Good mostly for takeout.  Big portions,  good price and very tasty.  Especially wings,  cheese steak and my favorite is the chicken burger."}
{"text":"Ordered the classic chicken pizza (tandoori chicken, green peppers, mushrooms, and onions) and Hawaiian (ground beef and pineapple) and chicken wings. The chicken wings were amazing I had them naked with the sauce on the side as my daughter doesn't eat flavoured wings. The wings were crisp to perfection and I was happy with the pizzas. I would defiantly be going back!"}
{"text":"Was excited to try out the place based on previous reviews but was truly disappointed. Not the best pizza and not the best wings I've had in Ajax. Ordered the deluxe pizza and it was very similar to stuff you'd get at Pizza Pizza but with a slightly better crust. The wings weren't bad, but over drenched in the sauce. We asked for hot wings and the were HOT! The sauce smells and feels like BBQ sauce but there is a lingering kick for sure. Good thing we didn't order the suicide wings. Service is questionable. When I called to order, the guy puts me on hold then when he came back he asked me what I ordered - but we didn't even get that far to start with. He seemed a little distracted with the background conversation than taking orders. Then he tells me cash only at delivery so I cancelled and miraculously he's able to take credit card now - but tells me to call back because he had to use the other phone to take my info. Delivery guy is less than enthused and tells me I need an open to sign the credit card slip."}
{"text":"This place may look a little run down from the outside but they make really flavourful and thick-doughed pizzas for a great price. A friendly family-owned business with great service."}
{"text":"Best halal pizza and wings in the area!  The prices are amazing and the food is delicious! Would deff recommend. Fresh great tasting food. My go to place for pizza, wings and burgers."}
{"text":"Great chicken and wings and amazing pizza!!!! These guys have that amazing balance between offering halal ingredients but still making awesome west style yummy food.  Order ahead as they can get backed up and delayed a little as they will get big party orders.  Also their chicken and philly cheese are amazing!"}
