{"text":"Al dente  I was skeptical as I walked into a restaurant on the bottom floor of an office building.  My preconceived thought was there is no way this is for me, but since others picked it I thought I better not be a party pooper.  From the moment we walked in we were greeted warmly & seated in seconds.  We had a cute table right beside the fireplace.  As I'm from the states, I am very unfamiliar with Canadian wines & their list.  Our server was extremely patient & happily offered to bring 2 tastes of Italian pinot grigio.  Prices very respectable.  If i lived here I would definatley go again and/or reccommend.  Very close to highways & shopping."}
{"text":"This was always one of our favorites before we lived in florida nice to see the standards are still high, the roasted tomatoe soup is to die for. Highest quality ingredience. Did not care for the table bread so tough almost like a big crouton!  I have never attended an event here but I imagine they go all out. The building - whatever always lots of parking and a beautiful little patio. Looks like they could update the bathrooms a little. For my personal preference when you have beautiful chandaliers, use the same light bulbs or it cheapens them.   Staff is always attentive, some more energy then others. I have ordered the sunday prime rib special, my honey ordered steak.   Prime rib eh! Horse radish not hot yorkshire amazing but cold, carrots over cooked mashed potaoes fresh but bland. Great for a banquet. Honeys steak cooked proper, quality of meat meh.   Will give them one more try!"}
{"text":"Had dinner at Al Dente with a high school English teacher of mine last week.  Although I have been much spoiled by the variety of choices that Toronto has to offer, Al Dente met my expectations.  It is a fine-dining restaurant located in the business district of Pickering.  It's located in an office building, but was easy enough to find.  Our waitress was very attentive and down to Earth, and the service was great.  For $24.95 we got a choice of appetizer salad or soup and main course.  Dessert was not included.  I found this kind of strange, as it wasn't quite a prix-fixe menu.  I wouldn't have minded paying a little more if they included dessert, but that is just a minor detail.  I had the Baked Tilapia which was served in a tomato cream sauce over a bed of Pesto Angel Hair Pasta and vegetables.  The pasta tasted light, and fresh, although a bit heavy on the salt.  The fish was done just right - very tender, and the sauce was not too overbearing, but added a nice touch to the fish.  Their caesar salad was nothing spectacular.  My dining companion had the chicken marsala and she had no complaints.  We ended the night sharing a dessert, a Chocolate Mint Cake.  I am usually not a fan of this combination, but it was really good!  Not too heavy!  I also had a cappuccino, and I like stronger cappuccinos, and Al Dente served it up with just the right level of caffeine.  I would definitely go back."}
{"text":"If you want a nice Italian dinner try somewhere else. The wait staff tries, they really do, but the food is average. Nothing special at all. Best part of our meal was the desert."}
{"text":"Great place to eat around the area. Too bad they are closing. The pasta is to die for. I would recommend it if you are in the area; before they close"}
{"text":"Note, now Amici, the restaurant is under new management and has recently been renovated. This review is for the new location.  I had liked Al Dente but was in need of a face lift.   The interior hadn't been changed in a very long time and was beginning to be dated.  The changes made are dramatic and welcome.  The space is open, bright and had nice touches that bring it to life.  There is a large stone oven, a glass room at the entrance filled with various meats and a new bar with a huge wine rack that covers the wall it faces.  The space is unique and inviting but not particularly formal (if that is what you are looking for).  There is large spaces that can be rented for events that are clearly separated from the rest of the venue.  The quality of the food is excellent.  I've tried a number of their appetizers and mains and have been impressed.  My favorite was the lobster and shrimp tortellini which was on special.  It was rich and exceptionally flavourful."}
{"text":"We have been going to this restaurant for years.  I am Italian and when no one can make red pasta sauce like your mother, this place is pretty good.  We have tried a variety of meals here and have never been disappointed.  We love salmon, and they serve up one of the best.  There is always fresh bread on the table, the ambiance is intimate and classy, and the portions and prices are good.  One of my favorite restaurants."}
