{"text":"This place is really wonderful and everyone is super nice. Some of the best hummus I've had, and the tea was nice and strong. The desserts are WONDERFUL and everything is made fresh in-house. We got a box of one of each to go, and were even given one extra so my husband and I wouldn't fight over the sweets :)"}
{"text":"Takes all night to get service, still waiting for the water I ordered 30 minutes ago. Friends say hookah is alright. Total bro run biz"}
{"text":"Authentic Middle Eastern breakfast! Haven't tried lunch or dinner but breakfast was yummy!! Very friendly service too!"}
{"text":"This place kicks butt.  Sea of pastries and sweets.  Will definitely go back to this place."}
{"text":"Honestly, great place!
I usually order always the same things manakish and iraqi stuffed bread. I also sometimes take some baklavas.
Service is always nice and the guys smiling. It can be a little longer sometimes but this is how it gets when your food is made for you on the spot.
Overall good food, average price and good service!
PS. They also have a seating area upstairs when they serve argileh/shisha but never tried it there."}
{"text":"A hidden gem on Lincoln st. Loved the food, cleanliness, and the spacious seating area"}
{"text":"Absolutely amazing hummus and falafel, and fresh bread to go with it. The food was amazing and the people working there were friendly and accommodating. We came during the evening and it wasn't busy, and our food (2 hummus orders and a salad) was prepared quickly."}
{"text":"Visiting from Toronto, we decided to come here for breakfast after reading the great reviews.  First impression was not great.  The place was empty when we walked on around 10 am - the employee at the oven barely glanced at us, much less greeted us. The next employee had to be called from the back and again was not friendly.  It felt like we were inconveniencing them.  We asked if they had kunaife and was told it wasn't ready so we ordered an assortment of manakeesh (zaatar, cheese, meat and Nutella) which was decent but nothing to write home about.  We also ordered ful madamas which came with one pita bread and absolutely no sides, not one onion or a sprig of mint or a sliver of pickle.  That was very surprising - even in Toronto at the Paramount chain they offer these sides with your ful as standard.  The ful was average, not very garlicky and more heavy on the cumin.  Overall a disappointing experience.  Expected more warmth and hospitality - in my books good customer service could have compensated for the  mediocre food."}
{"text":"Been meaning to get around to re-review this place. I have been coming here a lot more since the first time I had walked in here months ago.

Ill begin with the staff. They are all very friendly and really make you feel welcomed.

The food is still as amazing as it has always been. The fresh baked breads in their oven really make a difference. I highly recommend their calzones.

The hookah area upstairs is great. Nice and cozy. I especially like that they provide us with natural coals as opposed to quick light coals. A must for any true lover of shisha.

I have tried many shisha places around Montreal and this one is always my go to. If only you could order a beer ;)"}
{"text":"Sweetness: This places rates on all 3 measures of Atmosphere, Service, & Food :O)

Atmosphere:  Al-Baghdadi Pastry (ou Patisserie Al-Patisserie en Français) is located on Lincoln Avenue, a relatively quiet street just off Guy Street (near the Sherbrook intersection).  Since place is run by an Iraqi family (hence the name) - and it run very much as a family business.  The place itself if well lit, clean, and spaciously designed with a stone hearth welcoming patrons as they enter, and an elevated inner section where the full menu of freshly baked Arabic desserts is on display.  The place is not exactly designed for sit-down dinning, given that the menu itself is constructed of items often take-out to eat rather than enjoyed at a dining table (more on that below)

Service: If Al-Baghdadi fails in anything - slightly - it's the service.  Not because it's bad mind you! Given that it's a family business, the staff seems a little undermanned and as such the serivce may be a little slow or rushed at times.  If you know how to speak Arabic (even a little) you'll find that the staff if very friendly and talkative - being very proud of what they do.  Good people.

Food: Ah - you'll love to eat here.  This isn't a \"slam, bam, thank you mam - type of place\" (a good example of that is \"Al-Taib\" on Guy just a few steps away).  The wait may be longer but the food is always made in front of you, and is served piping hot.  From Zahtar (thyme) to cheese Manoushe, to spinach and meat triangles (Sambousek) etc.  Typical Arabic bakery food at its best (a little more pricey than the competition but worth it).  Al-Baghdadi, REALLY excels however is giving you the best (and I stand by that) Arabic sweets in down-town Montreal (if not all of the city).  They may they best \"knafeh\" (baked cheese sweet with warm sugar syrup), as well as other Cheese and Cream (Kashta) Filled Sweets in addition to Gourmet Baklava (many types) and Mamoul.

You'll love the authenticity! Go!"}
{"text":"Très bonne nourriture, autant salé pour le déjeuner que sucré pour le dessert ou le thé ! Je recommande la patisserie kounafa naboulsie, c'est un \"hit\" de la boutique. 
Concernant les pizza et autres plats sur pain, tout est cuit dans un four à pierre, c'est délicieux."}
{"text":"Great falafel and soujook. Unfortunately, baba ghanoush never seems to be available."}
{"text":"We came on Saturday, and now here we are back on Sunday.

Delicious manakish, one of a kind.
The best I've tasted in town.
I got a hummus manakish with a cheese wrap. My husband got the kefta manakish and chicken wrap. 
The bread is so good and fresh, the taste is just amazing. 

To finish off this amazing meal, we got a sort of creamy dessert. Sugary but not so much that it would hurt my stomach. Meals are so cheap too so if you're on a budget and you need a tasty filling dinner, you're at the right place."}
{"text":"The wood fired oven baked mergez pizza and the make to order pita bread with homemade hummus were delicious!"}
{"text":"I've been there for several times. Every time, the service was fantastic, they are truly polite and friendly and they help you to choose the thing that you really want. Even when you don't have any idea about the food, they describe it in an understandable way. Shisha is a good part and don't miss the sweets which you never forget their tastes."}
{"text":"I've only had the cookies from here so I can't comment on the savoury foods. If you need to bring small cookies for a gathering (workplace or fun) this is the perfect place to get lovely bite-sized cookies at a very reasonable price. I'm not sure of the price calculation, but the only comparable cookies in presentation sold nearby is nocochi near the museum on Sherbrooke, or the bakery at Adonis on ste cath, but this place is easily less than half the cost of nocochi, and looks nicer than a box of cookies from the grocery store."}
{"text":"Al Baghdadi has perfected the mana'eesh like no other in Montreal.. It's done perfectly in brick fire .. Love this place for weekend brunches and late night hunger strikes .. Satisfying every time.. And luckily .. I live half a block from it.."}
{"text":"We went for lunch. Atmosphere is not all that but oh my...the food. Amazing. We had pockets, pizza and wraps. Super impressive.  About 5 each. Very affordable. Drinks were more expensive. Desserts. Must have!  Great place. Probably really perfect for take out!"}
{"text":"They had good food, but the service was slow. We waited an hour, only to get the wrong order."}
{"text":"Delicious manaeesh, pizza pies, calzones and fatayer, I tried lots of things and everything was super tasty. The dough is cooked fresh in a brick oven and it's perfect....I ordered the lahmajoun (meat pie), Zaatar manaeesh, the chicken manaeesh and the cheese ones, I also had the mergez cheese calzone and it everything was amazing. As side dishes I had hummus, labneh, the spicy potatoes and everything was fresh and delicious. The staff are friendly and service is fast. Highly recommended."}
{"text":"I have written a review on a seperate page for this place where you can see all the photos.

This is one of the best places in downtown montreal for a delicious affordable fresh meal.

They also have shisha in a seperate room upstairs.

You are an idiot if you go to Al-Taib for a flatbread instead.  You have no excuse unless you have 4 minutes to get food into a bag."}
{"text":"Un petit restaurant - traiteur qui vaut le détour ! Avec son entrée au 1er étage, sans Yelp nous ne l'aurions sans doute pas remarqué. Accueillis gentiment dès l'entrée, nous nous sommes laissés conseillés. La pizza arménienne (Manakish) au Sujouk (boeuf épicé), et celle au poulet étaient délicieuses et légères. Nous avons aussi dégusté de l'houmous avec une petite salade et du pain. Puis nous avons fait le plein de patisseries orientales aux pistaches et noix de cajou. 

Un restaurant qui allie simplicité, qualité, gentillesse à un prix incroyablement abordable. Bravo !"}
{"text":"This place is gold. We had lebne (creamy and delicious), manakeesh (highly recommend half cheese and half zaatar!) potatoes dail (literally melted in my mouth). Fantastic place- come here and you won't be disappointed!"}
{"text":"Great food and nice people. Try their Baklava! Lots of choices on the menu for a good price, and central location :) very happy I came here! :D"}
{"text":"Really delightful restaurant tucked away a block from Rue Sherbrooke.  Fresh warm bread.  Delicious kenefeh.  Lovingly prepared Moroccan mint tea.  The manager was a lovely man from Baghdad who also lived in Morocco.  He made us feel welcome."}
{"text":"I do not recommend this restaurant to anyone with nut allergies. Based on previous reviews, we came to this place for breakfast and had to go elsewhere because the owner informed us that all items on their menu contained nuts. So disappointing"}
{"text":"Love the laid back atmosphere here...if you didn't find this place online you'd probably never know it existed as it's kind off the beaten path. That being said, it's totally worth the trip.

They have the best manakesh pizzas that are made in a wood burning oven, the smell just lingers around this 2 floor joint. Not only can you enjoy some amazing and authentic middle eastern food as well as drool worthy desserts, you can also just hang out with friends and smoke shisha for a few hours. The best part is that the prices are so low. I mean, the pizzas are like 3$

The staff  and owner are really inviting and kind as well, a definite place to check out if youre around concordia!"}
{"text":"Stopped here twice now: once for one of their delectably ultra-sweet sweets and another time for their pizza-like manakish, which has no right to be so delicious for so cheap. The chicken was great, but the spinach was divine (had both with cheese at the suggestion of the waiter/person at the counter). Anyway: sweets, yes, manakish, very yes."}
{"text":"This review is based solely on their desserts. The first day I went there, with the intention of getting kanafe. I knew they would probably run out quickly, so I decided to give them a call. Their phone is constantly busy or they just don't want to provide proper service to their customers. It is probably the later. When I arrived to the restaurant, they did not have any kanafe, so I opted for the baklava. Their phyllo pastry tasted old. Their sugar syrup was lacking. The whole baklava was rather soggy. Definitely not the worst, but not best. Would not go for just baklava. The next day, I came for kanafe. I would give it an 8 out of 10. They serviced it cold, but maybe that was my fault, because I told them I wanted it as takeout. As for the customer service, it was horrible. I had to stand around waiting for someone to give me eye contact. I stood at the counter for 5 minutes. All in all, go for the kanafe, but be prepared for the bad customer service."}
{"text":"Food is not very original, but also not bad. The hospitality in the restaurant is very bad and food for two people took a whole hour despite the fact that there aren't many people in the restaurant. Would not go to this place again!"}
{"text":"Cheap, quick, tasty! I didn't expect to have such a fresh pizza dough by paying just like 3-4$ for each plate. I liked the atmosphere too, with not perfect but warm-hearted service. They don't do their job for getting tips. We get more than what we pay and I definitely come back there."}
{"text":"A fourth experience and still as excellent
The service perfect
Polite and very friendly staff
Do not forget to order The mix sheesha :)"}
{"text":"Not sure if we went there in their not favorite day or not.... They have a menu with hugeee selection of desserts.. We were so excited to order.. But the guy told us there is only one type of desert are available! So we ordered it was so old and taste bad.. We had a tea too.. Supposed to be Iraqi style but it was burned too much!...  The location is not suitable for people with wheelchair/stroller/disabled... 
No I don't recommend this place to anyone.. I was so embarrassed with my friends there ;("}
{"text":"This place has awesome desserts and awesome \"pizzas\". We loved the food and have been back couple of times. A great place for a snack or a meal. I absolutely recommend it. 

P.s. Their special tea is pretty yummy too. I generally ask for a bit of honey on the side to sweeten it."}
{"text":"Delicious 'usmaliya'...dessert made with vermicelli noodles and a sweet yummy cream on the inside which is just the right amount of sweet :) their mango smoothie was fresh and delicious too! It was a little on the quiet side when we visited but the freezing cold weather outside meant that not many people would want to go out anyway, I can imagine this place being an amazing get together place in the Summer! Would definitely come here in the Summer and looking forward to trying their Baghdadi drink which seems to be a heavenly combination of all things good and calorific :)"}
{"text":"The Al Baghdadi shake was super good.  We also had a couple of pizzas and a spicy beef wrap.  The wrap was excellent"}
{"text":"Excellent flat breads, especially the zaatar plus cheese. Fresh salads. All of it was supremely satisfying. All of it is freshly made. Good service. Decent ambience."}
{"text":"This is an up and coming Middle Eastern bakery that hasn't lost its touch just yet, hopefully it never will! Every single restaurant that has attempted to run in that particular location has always shut down, but so far... this one has stuck around the longest and seems to be gaining popularity. It has definitely won me over.

The interior is quite large, spacious, and looks great - making it worth it to sit and eat there too. Al-Baghdadi has a beautiful brick oven and you get to see them do everything from scratch, from the making of the dough until it is ready to be served! They have a variety of options, add-ons, and desserts to satisfy your palate, and the staff are welcoming, funny, and will always recognize you.

Perhaps a part of me expects more because I, myself, am Arab, but I think I just appreciate and expect tradition and quality more than anything. It's hard to find an Arabic restaurant that gets everything down right, and I have never been disappointed in all my visits here. I definitely recommend it over Al-Taib, hands down."}
{"text":"To be honest when I first came here with a friend I was not very tempted to try any of their desserts. They looked so strange and foreign. 

Tried some sort of dessert in a huge pan and it was soo good. They microwaved it and i still have no idea what it was but it tasted like melted cheese and sugary rose syrup."}
{"text":"Best jordanian kenafeh in montreal i think its the only place that have it... and prices are very reasonable"}
{"text":"My husband and I went here for lunch recently when we were in Montreal.  I thought it was ok, but my husband really liked it.

We ordered 3 Armenian Pizzas: the Chicken ($3.95), the Lahmbajeen ($2.75), and the Sujouk ($3.50).  The pizzas are 9\" each, so they are a good size.  The crust is super thin, so one person can definitely eat 1 pizza.  I was able to eat 1 1/2 pizzas no problem.

They make the pizzas to order, so you do have to wait a bit for them, but it's worth it because they are fresh.  The pizzas are more like Middle-Eastern meat pies (Lahmajouns) and not Italian pizzas.  The Chicken Pizza was probably my favourite.  It was topped with finely diced chicken and spices.  The Lahmbajeen Pizza was like a traditional Middle-Eastern meat pie, it was topped with a thin layer of ground beef with tomatoes and spices.  I found this pizza a little bland.  The Sujouk was similar to the Lahmbajeen except it was spicy (hot) and for some odd reason very oily.  I found the topping was too oily and I didn't like it for that reason.  My husband really liked the Sujouk Pizza.

The staff there are very nice.  The place is deceptively big inside.  If you are looking for some fresh Manakish, you can come here."}
{"text":"Have an early Chem class and this is the only place open when it's done, total life saver. Kookoo spicy beef is"}
{"text":"I don't have a sweet tooth but every now and then when the craving hits i come here and they never disappoint , great place if you want to try real Arabic sweets"}
{"text":"I really love the food here. Cheap, fresh, and delicious. Order a Zataar and cheese all dressed, or the egg and cheese. Desserts are also super amazing. This place is the real deal, and the food is awesome. I even like their fruit cocktail drink, which is like a guava and assorted fruits smoothie. Amazing!"}
{"text":"Cheap, freshly baked yumminess a hop away from Concordia! The \"pizzas\" are very well priced...basically you can make your own toppings. I had a pizza with spiced ground meat, cheese, onions, some veggies...We also tried a chicken topped one which was very tasty. My only issue was that the spicy meat was not spicy at all and pretty \"meh\". The winner here is the crust that they bake on demand when you order. There is a small wait due to this, but nothing atrocious. Employees were very nice. We were the only girls in there haha. Seems to be frequented by younger Arab men. The sweets we tried (baklava and some other pistachio ones) were not the best. Shisha is available as well upstairs. Cheap eats!"}
{"text":"We waited almost an hour for some appetizers and tea. The food was cold when we got it too. The shisha was great. I don't think I will come back because of the wait and the cold food. The waiters were really nice and apologized for the wait though. We paid almost $60 for a few appetizers and shisha, a little pricey I thought."}
{"text":"The wrap I got was superb--the bread/wrap was baked on-order, and the half-spinach half-cheese base cooked into the bread thereafter.  Stuffed with olives and tomato (you get to choose), tasted great, and cost close to $5.

I got 6 baklava to go (one of each flavor available) for $5--really all good, and so many other sweets to try--I would if I could!

Only downside was that the service was uneven.  The restaurant was quiet for early lunch; I got my wrap ordered and cooked immediately.  Nobody was servicing pastries, and I had to wait a while for that.  I wasn't in a rush, so it was OK, but ... not very organized service.

As an added bonus, however, because of the slow service, the waiter insisted that I receive my baklava \"on the house\".  The food was too good for me to accept, so I wound up tipping extra to make up for the difference."}
{"text":"Absolutely amazing!! Had cheese Mannakeesh with tomato and olive folded as a sandwich! The dough is light and delicious. The bill very affordable."}
{"text":"This place was a relief to me and my wife, we missed Iraqi restaurant since we moved from Dubai to Canada, perfect taste and very original. We tried more than 10 different items. Dont miss Kanafa, Falafal and Zatar and cheese."}
{"text":"Loved it. Huge brick oven, super-fresh bread and yummy pastries. And cheap for the high quality -- probably the best value for food during our time in MTL. Not sure how or when it gets used but there are two more floors of seating upstairs."}
{"text":"After my manicure and pedicure, I got hungry and came across this place. It was quiet on the afternoon. I was greeted by the sweet girl who told me to go upstairs and place my order. To my surprise, I saw the variety of cakes and pastries they had; I was fascinated! I decided to stay in and eat my food. I ordered the bread with cheese. 

Once my order was placed, the other person made it fresh and saw it in their oven which is great! After 5-10 minutes, my food arrived to my table and I decided to dig in without taking a picture lol. The bread was so good and fresh as well as crunchy which made me fall in love with this place. I also asked for hot sauce on the side and it was delicious to dip in the bread and eat! I'd keep coming to this place as I also want to try their pizzas and other food menu which all tempted me. I also tried some of the sweets, they were sweet and had the amazing taste. The place is very clean and the people that serve you definitely put so much efforts as I'm assuming that it's a family business and you can see that they go above and beyond and for very cheap, you can leave with a happy and full tummy!"}
{"text":"Super  Arabic- style chicken pizza, as well as others, served fresh out of the wood burning oven. Piping hot,lovely crisp crust,tender chunks of roasted chicken,and not at all salty. I had a side platter of tabouli which paired beautifully with the pizza. I decided to hell with the calories and to just live a little, and ordered a good slice of cream-filled pastry,freshly made, for dessert, with a cup of tea to wash it down,and it was excellent. The restauarant is divided into 2 sections, the front preoccupies itself with  lunch/dinner items, and has only 4 tables, the large back section, is Mid-Eastern  pastries galore, but you  can order and sit where you like. There is also an upstairs, with waiter/ress service. Glad I came here instead of that \"other\" place,wish I'd only made the trip here sooner, will definitely be back!"}
{"text":"Thursday,Aug18-2016
1:15 PM

Came here for the third time today. Every Time i visit Montreal i make sure i come here for breakfast.  Surprisingly this year alot changed in this place. First it was two floors before and now its just the bottom floor. Second they dont serve shisha anymore like before which is really sad as this place would be perfect for a breakfast and morning shisha. 

Now about the restaurant in general everytime i come its only us or 1-2 tables max. Their staff are hit or miss either really nice or miserable. 

Last but not least. The FOOD. We got cheese manakesh and lahm ajin and hummus with beef.
The manakesh (pizzaz) are really really good like usual. Hummus with beef is okay beef is flavourful but the hummus you can tell its canned or prepared poorly but overall it tasted good. 

Would recommend if you feel like having a middle-eastern breakfast around the downtown area in Montreal."}
{"text":"If you're the kind of person who loves bread, in and of itself, you should definitely visit Al-Baghdadi.

I remember making a list of bookmarks before my Montréal trip and seeing this place come up very highly. As i scanned through the pictures, quickly swiping left on most of the ones for cookies and middle eastern desserts, I saw one for the airy bread and paused and thought: whoa! What happened here?!

Luckily, whenever I visited Al-Baghdadi, I had already consumed my share of sugar for the week, and so I wasn't tempted by the Baklavas, Katayefs and Maamouls, though the Kunafa tasted just fine after heating. On my first visit, I tried one of the Manakeesh they are famous for with a separate order of the garlic bread. The garlic bread was fantastic, but I thought the strengths of the bread were minimized in the Manakeesh (Mergez) wrap with the amount of oil that ran down my hand and upper arm. The next time I ordered the plain bread (Khubbuz) with Hummus and beef, and a separate order of the Garlic bread. The garlic bread was as consistent as the first time I'd eaten here. I didn't think much of the Hummus itself, could easily have been store bought (or not), but the minced beef was simply delicious and spiced just right. The plain bread was delightfully fluffy.

So, basically the lovely brick oven lends itself to magical breads and pair those separately with anything beef. I'd think it's better to go with the pizza than the Manakeesh (wrap). Service was polite and helpful, with no language barriers."}
{"text":"During the entire winter, whenever we went for a walk downtown, we had to finish the evening with hot fresh mint tea! And of course, being foodies, we order a wrap and desserts alongside our tea as a real midnight treat! Their wraps are baked in a stone oven, the outside being crispy whilst the inside just melts in your mouth! When you're done with it, you literally crave for your next visit to have that experience again!

Their desserts are of a high quality, homemade traditional arabic delights such as kunefe and baklava, prepared with love and passion. Before serving, they drizzle a homemade honey syrup over the dessert which is amazing!! 

The interior is basic - cosy and warm but they need to step up their heating system. It is a great place for takeaways especially desserts which they are popular for. 
The staff are always welcoming and at your service."}
{"text":"A well-kept establishment on an almost hidden street (at least during the night), Al-Baghdadi Pastry serves up delightful Arab cuisine at pretty decent prices. Although I was relatively lost on what to order, the friendly staff were very patient and helpful in terms of describing the food and pastries at my disposal.

I ordered a kofta manakesh wrap with cheese, tomato, and lettuce, as well as a mint tea and a square of knafeh divided into four squares. The wrap was the perfect combination of gooey, cheesy goodness, the fresh and bursting flavors of the vegetables, meaty texture and juiciness of the lamb, and the soft, almost pillowy, bread that was an absolute delight into which I sunk my teeth. The knafeh, which was described to me as melted cheese with what appeared to be orange-colored pastry shreds on top with simple syrup to garnish, seemed like an oddity to me at first, but upon tasting it, there was no going back. The saltiness of the cheese combined with the sweetness of the syrup and pastry on top complemented each other in a sublime way so that the cheese and sugar weren't overbearing on their own. The only thing that I wish were better was the mint tea, as I found it a bit dull for my liking, but that's probably because I'm used to drinking Moroccan-style mint tea, which contains A LOT of sugar. Perhaps this is just a particular regional spin with which I'm not that familiar.

I would definitely come back to try more of the pastries, as they also had a wide variety of cookies and baklava on display. Also, there's shisha on the upper floor, so it's a good place to bring your friends for recreation and great food all in one!"}
{"text":"We came here after reading all the great reviews and I'm really suprised it got more then one star. And honestly, I would actually give 0 stars!

First of all this place is nasty! The tables where dirty.... Everything was really worn out looking and filthy.

We ordered Zaatar and Halloumi manakeesh. They are ok. The Halloumi had maybe 3 very tiny slices of Halloumi, that didn't taste like anything. The zaatar was mostly dough with a little Zaatar sprinkled on top. 

So if you like Lebanese/ Middle Eastern food DON'T come here!"}
{"text":"i arrived here on a random wednesday around 10AM - a little hard to find since lincoln ave is kinda like a one-way alley and isn't the cleanest street. you gotta go up a few stairs and are greeted by their giant kiln. go up more steps and you'll see the menu and cash register. i ordered the half cheese, half thyme manakeesh (a great deal at $3.50) and was surprised that it took 5-10 minutes to get my order since they make it fresh and it comes out burning hot from the kiln. it's an easy item to eat to go but there is a technique (as demonstrated by the chef to me) - fold it in half, wrap your wax paper around it, and keep most of it in the paper bag so the oil will end up in the bag. the cheese and thyme combo was perfect - creamy and salty - but the beef and vegetarian flavors looked delicious too! gorgeous desserts, entrees available too"}
{"text":"Best oriental pastries in Montreal. They are simply the best. 

They have the basbousa (Namoura) and they have the cheese pastry. (7alawt eljobn) 

Also their oven baked bread is he best, we always order bread from them. Highly recommended for oriental pasteries"}
{"text":"Excellent flat breads, especially the zaatar plus cheese."}
{"text":"What the hell with this place?  I mean could it be true?  I sure as hell am not in the middle of a the dessert experiencing a mirage!  
This is frankly a place with a whole bunch dudes running around making GREAT pastries and my favorite Middle-Eastern desserts.  I swooned!  Granted, they didn't have Katayef but I will get over it because I ordered the Osmalieh bel Ashta and it was astronomically delicious; I didn't even pour the sugar syrup on.  There was no need to.  

Also ordered the Soujok wrap which was good but didn't knock my socks off like the dessert but then again, anything with ashta steals my heart.  I want to lay in it!  


Don't miss out on this place.  Not the warmest but by far one of the best dessert spots."}
{"text":"So so good. My boyfriend and I came here for breakfast to have an authentic middle eastern feast and this place did not disappoint. Food was fresh and delicious and they make their own pita bread. Only downside was that their prices seem out of whack and their pastry is overpriced but still good. They're worth a visit for sure."}
{"text":"A nice and friendly place to have a quick bite. All the food was delicious and reasonably priced. More of a relaxing atmosphere, and the service is not necessarily attentive so if you need anything just ask."}
{"text":"Place is nice 
Owner is a good guy 
Amazing Lahm b'ajeen 
Great pastry 
I'd come again if I ever went back to Montreal"}
{"text":"The best Arabic food 
The best service ever
And the costumer service is the unique 
Try it once you will come back again"}
{"text":"This place is a hidden patisserie/ shisha bar that's tough to find.I didnt try the food, but it looked delicious. As for the shisha we got grape/lemon/mint and it was really really good. I would come back here for the shisha but my only complaint would be that they dont really have many options. Other places usually have tons of options and are able to mix flavours, but in this place they dont really know how to. But still, its a nice place to chill with friends, smoke shisha and enjoy the conversation.

As for the service, it was amazing. The waiter was very friendly, made tons of jokes and made us laugh even till the second we left."}
{"text":"Une belle pâtisserie du Moyen-Orient (Irak, je crois...), bien située au centre-ville près du métro Guy.

On peut manger sur place, prendre un thé à la menthe et un petit gâteau ou pour emporter. 

Essayez les pâtisseries: mini baklavas, namourra et petits biscuits, ils sont délicieux et c'est super pour offrir en cadeau. Et les prix sont vraiment abordables. Quoi de mieux?"}
{"text":"Says open on yelp but is is closed. Update your hours if you are going to close or you lose business."}
{"text":"Très déçu , j'ai vu beaucoup d'avis sur yelp concernant ce lieu , je suis passé aujourd'hui avec ma fiancé mais j'ai vite refais demi tour ! Le parterre était sale , les tables et les chaises aussi ! Seul point positif l'accueil du serveur qui nous a bien expliqué le contenu du menu, bref je ne reviendrai pas."}
{"text":"Delicious makaneesh thing.  Ask for spinach and cheese, it's amazing!! Also I ordered a small cheese pizza, its adorable and good for one person.  The desserts..didn't try But they must be good! :)"}
{"text":"I write all my reviews based on a student budget:

Got the nutella and chicken pizzas for about $8 total for two people, absolutely delicious! I would say it's a light dinner if you have 1 or 1.5 of them (which I did). Told the manager I combined a nutella and chicken slice and it was scrumptious, he didn't respond too kindly (but multiple friends have done the same so maybe the world just isn't ready), other than that he and the staff were very hospitable and welcoming. I'll be going back soon."}
{"text":"Summer or Winter Al Baghdadi has on their menu what you need from hot tea to cold smoothies ! Amazing mediteranian pizza, and wraps their sandiwich are very filling and in a bite you there is abundance of fresh ingredients and flavors ! All heated/cooked in a brique oven the wrap pita bread is crispy on the outside and moist on the inside ! I love to visit al-baghdadi for its amazing sweets of high quality, the staff is welcoming and always willing to serve you like a champ ! Definately needs to be visited for a full meal, for coffee/tea/smoothies or for dessert only :)!"}
{"text":"There is plenty of seating..and we were starving but the food took over an hour to come. Even though it was the middle of the day and the restaurant was otherwise empty.  However the food was delicious and fresh and hot. But not sure if I can sit through a wait like that again..brutal"}
{"text":"Great place! Very inexpensive, and the food is consistent! The spicy meat calzone is a bit greasy, but by far one of the better pizzas in Montreal! Their dessert selection is extensive, and delicious. Pretty good bread overall, fast delivery."}
{"text":"Only 4 flavored at 10pm on a Saturday.  No coal exchange after an hour of smoking and ordered water bottles...about an hr ago...not sure how hard it is to bring water bottles.  AND it's not that busy.  Need more help or better customer service"}
{"text":"Very nice place! I read about this place on yelp and found some good reviews about it. So I though I would try it. The place is really nice. They have freshly baked pizzas with bread baked right there in their oven. 
They have a section for pastries! Really delicious and fresh ones. They have a place to sit (on the upper level) specially for smoking shisha, but fortunately it is not too crowded nor it is full of smoke. I do not smoke shisha but like the smell as long as the environment is not full of smoke. I really enjoyed this place. You should give it a try.
I ordered a turkish coffee here. Really liked the taste. It was different and after asking the owner he said it is a blend of different coffees plus a touch of cardamom. I really loved it."}
{"text":"I was in Montréal with my husband and we were trying to celebrate our anniversary.
Sunday night and almost all places were closed, just a few were open, but the prices (especially in Villa-Marie) made us feel as though we were being robbed.
So we quick searched on Yelp \"turkish open\" and we found this place. Thankfully we found this place.
The food is delicious and the price is unbelivable. I felt that I was stealing from the place because we paid so little for the amazing quality and taste.
The owner is a very attentive person and treats you kindly.

We had:
Manakeesh (ground beef): it has a complex flavor, hints of cinnamon made it an amazing flavor with great smell.
Fatayer (cheese): simply amazing. Seriously, try it.
Pita with hummus: smooth, good creamy consistency and flavor is nice. The taste is simply a very great hummus, with no other mixed tastes.
Their pastries: we tried all of them and, no exception, all were exceptional.

This place should have a 5+ on reviews. It definitely saved our night celebration.
Plus: they have brick oven that's wood burning.

This is a real must try in Montréal."}
{"text":"Lovely. Great food.
Made fresh right in front of you.
Warm and flavorful.

Very friendly also.

You can't go wrong when there are pictures on the menu. They help with the difficult choices. So many choices so little time."}
{"text":"After attempting to eat at Qing Hua just down the road and rudley told no close to closing time we stopped here and wow what a great find. I am not sure if we ever did this but we started with dessert. It blew our minds away how good it was!! WTF they put in there. I never had anything close to this but on the island of crete. then the food came which was all excellent. We tried as much as we can or the body can. I will be back and Qing Hua lost us as a customer...,.avoid very rude but good food."}
{"text":"The service is sooooooo slow! Like food will come an hour after u order slow!!
And after waiting that long, the food will never be worth it! Also, I tried to add something to the order, the waiter told me to wait cause they are backed up in the kitchen, lol never have I ever been in a restaurant and been told to wait to place my order!
Also, a guy comes in and gets in a fight with the owner with yelling and name calling... Talk about a scary dining experience!"}
{"text":"Arabian style food but not the best quality. They used to have shisha which was a nice addition to the hangout but not anymore. What a loss to be honest. It's overpriced too. Would not recommend it without shisha."}
{"text":"excellent kunafa, baklava and other treats. Special Turkish coffee. And service with a smile. Can't wait to come back again!"}
{"text":"Great service!!!! And the manakeesh is super cheap! It is $5 for the egg and cheese, and it is thin and crispy. It's baked in the wonderful brick oven.

Now they make LOTS of desserts too but they are not insanely sweet. I've had these kinds of desserts before but very artificially sweet, it's weird. I never liked these kinds of desserts. But here at Al-Baghdadi, they are quite delicious!! I love the sesame one the most."}
{"text":"I could only comment on their sweets. Came by on a Sunday afternoon for take out. Staff/owner was busy prepping food and we waited more than 5 minutes before he was willing to greet us. The pastries turned out to be delightful and not overly sweet. Two piece of square pastries cost about 10 dollars."}
