{"text":"Christmas Day in Montreal, my daughter and I find this little brasserie open! Huge disappointment! I order Mussels and french fries which when served are barely warm, chewy and with no flavor.
Greatly over priced with poor servers; we had three different servers.
Beware locals and travelers, do not recommend this dining experience to anyone!"}
{"text":"I received friendly and attentive service - I had 3 different servers who took turns coming by every 10 minutes to say \"bon appetit\" or ask how everything was.

I ordered the lobster lunch special for $38 plus tax - a bargain based on how big the meal was. They start you off with bread - it's fresh and the inside is soft as can be. They also give you olives, flatbread crackers and a little bit of olive oil for dipping. It was so good, I couldn't stop eating and started to feel full before even receiving my appetizer. 

The vegetable soup I ordered was placed before me about 5 minutes after my bread bonanza. Yes, service here is extremely fast. The soup is fairly tasty - a smooth, creamy emulsion of vegetables and herbs. A hint of lemon adds a pleasing \"zinginess\". I broke a few crackers in the soup for the crunch factor and lapped everything up fairly quickly. 

While waiting for my main course, I glanced around the room - It's a large space, but designed to make people feel at home. The warm colour scheme, soft lighting and French-inspired paintings add to the concept. I felt settled and comfortable. 

The lobster is served cold and with (oddly enough) unmelted butter. Some pieces of lobster were grainy and tasted slightly stale. There is a small salad served with it that comprises of chopped lobster, onion, celery, light tartar sauce and plenty of lemon juice. I found it refreshing but not particularly impressive. 

On the side were some fries that were the best part of the meal. They were a medium cut of some wonderfully fresh potatoes and had the perfect level of crispness and saltiness. For the first time ever, I had no desire to dip my fries in ketchup - They tasted wonderful just as they were. 

No matter how full I am, I always have room for dessert. I was served a large mound of soft meringue floating like an iceberg in a sea of milky sauce that tasted like créme caramel and vanilla bean. I enjoyed every bit of it along with my coffee that complimented the rich, sweet dish beautifully. I was also served 2 bite-sized hard meringues with smiley faces on them, which I found adorable. Overall, my experience was pleasant, but not outstanding."}
{"text":"This place is pretty awful.,  The service is appalling and the food is mediocre.  I asked the waitress if I could have a napkin.  She said yes and walked away and then sat another table to chat with another guest.  I asked for the fondant with vanilla ice cream.  The fondant tasted as though it had been stored for some time in a closet.  It also arrived with raspberry sorbet.   When I asked what happened to the vanilla ice cream, the waitress said it tastes better with raspberry sorbet.  Unbelievable!!"}
{"text":"Awaful place .The waitress is rude and slow. If you speak French, they come quickly else they will avoid you and food is ridiculously bad. Drinks are stupid and layout is congested . Avoid this place."}
{"text":"Stay away from this place! We ended up paying almost 200 canadian dollars for very Average cafeteria food. 

Service was generally good tho."}
{"text":"Wow was this disappointing. My husband and I each got a prix fixe menu. My salad was under seasoned; his did not arrive. My steak frites, when it arrived, was a close relative of shoe leather. I sent it back, and received a hunk of grease that was somehow both rare and flavorless, and was accompanied by pretty yet taste-free fries. My daughter had the mussels, which were good - but a shocking number of empty shells in her bowl. My son's burger was fine, and my husband's entree, the lamb, was also fine - but at these prices fine doesn't cut it. The service was absent-minded to negligent; no water glasses were refilled during out visit. Avoid, avoid, avoid!  We didn't even stay for our included dessert. And I love dessert. They did take off my meal when I complained, but it still came to $150 for three sub-par meals."}
{"text":"Slow apathetic service.  Overpriced.  Avoid this place.

Server did not bring drinks until asked for the third time.  Food took forever to come.  Dish-ware was dirty.  Staff did not seem to care.  

There are so many wonderful places to eat in Montreal, do yourself a favor and don't waste your time here."}
{"text":"\"Tourist trap\" pretty much sums up this restaurant with mediocre food, service and atmosphere. I don't mind paying more money for quality, but things were far from exceptional. A 12oz beer was $10, and steak and fries was $30. The girls were nice to look at, but nothing more."}
{"text":"I am a bit surprised by all of the recent negative reviews.  Yes, this place is pricey, but it also serves really good French bistro food and wine.  Even the mayonnaise is homemade.  We ate here with our family while visiting Montreal last week.  The staff was very friendly and attentive as well as super with our kids.  My wife and I had an excellent and also elegantly presented trout almondine with a very nice glass of wine, and several of our kids enjoyed the steak frites.  The restaurant had some nice bistro tables out on the street, but we sat in the bright interior--lots of mirrors!--with other tourists, business groups, and others who I assumed were locals out for the evening.  So the place seems to cater to everybody.  My only complaint is that they had a huge t.v. in the bar area, which apparently you can't avoid nowadays. Except for the t.v., Alexandre et Fils has a classic French bistro vibe and very good food."}
{"text":"I would like to give this restaurant more stars but I simply can't. The server \"forgot\" to write down our order. She didn't bring the right drinks. She brought one of our friends the wrong sandwich. And then she did not put my order in at all. It's a shame. Food quality is mediocre but service is very, very disappointing."}
{"text":"Tres bon bistro Français. Très bien servi. Plat excellent et très bien présenté. Je reviendrai de toute façon."}
{"text":"Even for a drink, still pricey. $12.00 for a small glass of wine?? Neat spot but they need to look at their pricing.  Lots of other neat bars in the area.


On a side note.....lots of comments about my Blackhawks because of the ball hat. Montreal.... a hockey town."}
{"text":"The service was slow, not friendly at all, seemed kind of bored to me. It was  Friday the day I went there, so I asked for Pasta Arrabbiata, and instead of that I got a plate of dried pasta, covered with a ready-made sauce, that had absolutely no connection with the real arrabbiata I know. I asked for seasoning, and by that I meant hot pepper and basil leaves (that are a main seasoning in arrabbiata!!) but the waiter said they have no basil, and for such an expensive place that its considered posh, I find it quite odd. The waiter also admits that the sauce for pasta was a ready-made one, which is offending in the first place. I must add that I needed to explain to the waiter over and over again what basil is, she was keep on bringing me the balsamic vinegar. So I presume that training of the staff is out of question for the owners, as well.
Overpriced too, of course.
As an European, I found that this restaurant is a poor imitation of a brasserie, and I won't probably go there again, unless someone is using force for that :)))"}
{"text":"Meh at its best... For the level of good food places in Montreal, this place is pretty disappointing, expensive also... Din't waste your money here given the great number of choices and places in this city..."}
{"text":"Although highly recommended by our hotel concierge, this place should have had us running for the door soon after entering. Greeted by a gaggle of micro-mini-skirted sweet young things, we were told to find a seat on our own. The front room with the TV: no. The tiny, flourescent-lit bar area: no. The area festooned with disco mirrors and murals depicting 14 century French peasants: okay. At this point we should be asking ourselves, why stay? Hungry and tired, we proceeded. I was dying for a cassoulet, and that's what I ordered. My friend had a salade Nicoise. The cassoulet was tired and bland; the salad was missing dressing and was just tasteless. Thank god for a big pour of wine. We needed it.  

We went next door to Ferreir's (Portuguese) where we'd eaten the night before to remind ourselves how enjoyable a meal could be.   Obe grilled calamari and a sorbet (and another glass of wine) later, we were happy."}
{"text":"The cuisine here is 4-stars, but the atmosphere was 2 stars. I ordered steak tartare which was excellent. The server asked if I would like it \"spicy\" which was an intriguing question for steak tartare. I went for it and was not disappointed. Excellent mustard bite and texture - a real winner of a dish. 

The letdown was the first row of smoking tables in the restaurant. The cigar and cigarette smoke permeated the whole restaurant and was difficult to escape. The smoky atmosphere ruined the experience for me. It has been a long time since I felt the need to run to the shower after a meal (in an ostensibly non-smoking restaurant)"}
{"text":"This is a 0 star review. $10 for a beer and $4 for a Pepsi? Plus the servers assumed that we didn't speak French! ALLEZ VOUS FAIRE ENCULER."}
{"text":"Went around 1030 pm after a concert at Centre Bell. The best thing about this place was the bread that came with our meal. We were slow to be sat, slow to be waited on, and pretty much ignored for the night after asking for 2 waters instead of drinks. French onion soup was ok, but not worth $14. I had the lamb shoulder, meat was tangy and dry. The cous cous it was served on was tasteless and textured as if it was left over or sat under a heat lamp for too long. The duck left something to be desired, served with fried potatoes that were again tasteless (theme here) and a salad with olive oil. The waiter slow, and exceptionally slow for only having 3 tables in the whole place. The only thing he was quick to do was pick up the check, walking away without checking it or asking if we needed change. Once told we did indeed want change, he hovered around our table only to inform us on our way out that the tip we left wasn't what he usually gets. We politely informed him that his service was lackluster and the food was not good, resulting in a tip below his apparently hefty standards. If only the restaurant's food standards were as  high as his tipping expectations. Long story short: subpar food & bad service, coupled with an expensive price tag = 1 star. We won't be coming back. I recommend venturing out of downtown and avoiding this place. There a much better places to eat in Montreal, avoid this one."}
{"text":"Came in tonight, a Friday. Visiting Montreal and enjoying our stay. Everyone is very friendly. 

The waiter took our drink order. Then we waited over 30 minutes for someone to take our food order. It wasn't THAT busy. The manager ended up taking our order. They seemed to think we didn't understand French. There were words between the manager and our server. Another long wait. People were being served around us. Our food finally arrived.

My moulles frites were cold. And the mayo served had a crust. I didn't know if they were from the lunch serving or what. I asked the waiter to take it back with no replacement. But they still brought it back. The manager brought it to me and again, less than luke warm. I didn't eat any of it. 

My wife's meal was fine. She had the salad nicoise and enjoyed it. 

I take issue with the service. I didn't trust my food. It was seafood, after all. Who wants to eat cold mussels?? Who would trust that? We were ignored as well. 

I went to pay my bill and informed the manager of my complaint. To his credit, he offered to remove my order from the bill. I declined. I'm not looking for compensation. I'm looking for good service. They should have re made my meal or offered something else off of the menu. 

As I said, I didn't eat anything from my main. I ate some bread and some fries. $80 bucks. 

That's why I am posting here. Go somewhere else."}
{"text":"The food tastes amazing but the portions are tiny and the price is ridiculously high!"}
{"text":"This place is a little noisy, and food served there didn't worth its price. I don't know how it became one of the top ten restaurants in Montreal, I personally don't recommend you to go there."}
{"text":"dans un cadre de brasserie parisienne, un restaurant cher mais où l'on mange très bien !
le service est de bonne qualité , à deux pas du quartier d'affaires. Idéal pour un repas d'affaires le midi ou pour entamer une soirée dans de bonnes conditions"}
{"text":"My friend and I went for drinks and appetizers Tuesday from 5-7 Dec 5, 2017. Place was quite empty. It was clear that we were both English speakers (info relevant later on) Beers ordered and served promptly by Asian waitress (mentioning this as I want the owner to be able to identify who was serving us) who subsequently took our food order: steak tartare and French onion soup. My friend ordered his tartare spicy and we were impressed that she came back with a sample for him to taste before serving him his actual plate. He indicated that spicier would be appreciated. So far so good. Complimentary olives were good too. Pretzels, meh. 

Anyway, here's where things go downhill. Tartare and soup arrive. Tartare is fresh and plentiful but virtually tasteless and definitely not spicy. French onion soup was thin, watery and tasteless, even after adding salt and pepper! And, the soup costs $16! Not a lobster bisque, folks, but hot water, some onions and cheap, bland cheese! French fries were good. Could have been hotter but good. Mayo tasty too.
Friend and I finished our first beers and glasses sat empty for several minutes while waitress was nowhere to be found. 

Finally, we caught her eye and got more drinks. Friend ran out of bread for his $30 tartare and again waitress nowhere to be found! She was busy chatting with the other servers, (5-6 working the bar area with the same number of customers) and we finally distracted her enough to call her over. She brought more bread and then we never saw her again. Another girl came by the table and asked us in French if we wanted anything else. In English, we ordered one last round of drinks, which were promptly served. 

Time for the bill, trying to get anyone's attention, another waitress comes over and again in French, despite the fact that we are conversing in English, asks if we want anything. Not sure what happened to our original waitress or how this establishment divvies up its sections, but the service was inconsistent and inattentive. Again, the place was almost empty, so it should have been easy for one server to take care of us and to know that we speak English. Anyway, the place is comfy and esthetically neat. Great dining room upstairs. A nice throwback look. However, the food is bland, service is inconsistent, and prices are too high. Repeat visit not in the cards.
Value"}
{"text":"Recently had dinner here with a group of friends and found the food to be ok. The portions are small, the atmosphere was ok, but the the staff was very helpful. I had better French food but it wasn't bad so that is why I give it 3 stars."}
{"text":"We originally walked into this restaurant because we liked the design of the bar. However, after being seated we waited over 15 minutes to be acknowledged by the servers. It was not a busy evening and the establishment was well staffed. When we watched everyone around us being served attentively we realized that they were prejudiced towards US citizens. At that point we decided to leave and take our money elsewhere. The servers actually never came to our table. The treatment at this restaurant slightly tarnished our impression of French Canadians. As we were not served, I cannot comment on the food. US citizens should probably avoid this restaurant."}
{"text":"What I get for not having the energy to check Yelp before dining somewhere is a mediocre meal like we had here.  We just walked by and randomly decided to dine here.  The hostess and our waitress were very kind - but the service was SLOW and the food bland.  Dressing up all the ladies in skimpy clothes does not make the food taste any better.  Their kitchen also needs to learn how to marinate foods or use sauces to their advantage.  Here's a quick breakdown: 

- bone marrow - so bland and not worth it.  The bones are not cut lengthwise, so the unseasoned marrow is deep and hard to get to.  
- chicken panini - the chicken was dry from being over cooked and it was under seasoned.  The panini could have used some spread or sauce inside since it was very dry and bland.
- fish and chips - the fish was okay but the fries were all little bits in both my husband and brother's order of it - it looked like they got the very bottom of the bag of frozen fries.

My recommendation is to move onto another restaurant...sorry Alexandre Restaurant."}
{"text":"No disappointment here. The food and service was very good. Followed our waiters recommendations. Lobster for me, mixed seafood for hubby. Empty plates full stomachs!"}
{"text":"This is one of my favourite restaurants in Montreal.  It is an authentic French Brasserie.  We were seated promptly at a nice table in the front.  We had a delicious meal of steak frites and black cod. And finished off with some lovely Quebec cheeses.  All married with a nice Cote du Rhone by the glass.  We will be back."}
{"text":"Our meal was fair - nothing exceptional. Our waiter was rather abrupt. We ordered the \"Montreal Plate\", but after we ate we were told that it was only available on Saturdays (therefore we were charged for 3 items ala carte - seems like he would have told us when we ordered it). My warm goat cheese salad was okay. For the amount of money we paid I'm sure we could have gotten a better meal elsewhere."}
{"text":"The wait staff was friendly but the food was awful. My mom and I ordered the mussels, they were rubbery. My dad's fish was too salty. Would not recommend this place. Very disappointed."}
{"text":"DONT GO THERE. This place fucking sucks. Fucking bastards don't have a menu for beer and charged us over $10 for a pint of some non fancy local beer on tap. So let me repeat, do not go there."}
{"text":"Shame to Tilda P., you came on an off-day methinks. They consistently serve the best Tartare and best Magret de Canard in town."}
{"text":"I would never go here again, the wait staff is rude, the food (while genuinely French) is definitely not worth the cost, and this place feels like an everyday pub. Definitely nothing special, don't bother."}
{"text":"Not bad of a place but nothing to special,  considering the fact a pint is 11$. May as well just go to McLean's down the street much better prices. Haven't checked out the cigar lounge yet but maybe I'll come back to check it out."}
{"text":"Excellent food and great staff! highlight of our trip to Montreal. The only area of improvement... guys, please help me pay for dinner quicker!"}
{"text":"Was visiting Montreal for work walking the street and popped in here for dinner. Thought it had a great vibe, good staff and food and wine was great, had the duck confit with salad and it was excellent. A little slow for the food to come out but wasn't that bad."}
{"text":"Very overpriced average food- definitely a tourist trap. 
The wines were ridiculously expensive. $14 for a glass of bordeaux? 
C'mon!

The best thing we got from the restaurant servers were recommendations for bars and lounges on Crescent St."}
{"text":"If you love Paris, you will feel right at home here! Very French! We had a delightful lunch on the patio, well protected from a brief rain. I had the lobster special, pre-shelled and served cold with a light dijonaise  on the side, with points flutes. The salad too was crisp with a light vinaigrette. Well worth it!"}
{"text":"Terrible. From the warm glass of cheap white wine to the cold asparagus soup in a martini glass to the half raw shrimp that came with the fish terrine to smell of cigars wafting pass my table, there is very little to recommend here other than to go somewhere else, far away. Dressing the young wait staff in LBDs is not going to save this mediocre restaurant apparently leveraging some celebrity French Chef I've never heard of. Only one emoji can sum up the experience for me.."}
{"text":"Très bon resto français, avec un décor un peu fou et original! 
Il y a beaucoup de place, beaucoup de tables
Très bon service, on vous place avec le sourire et prend soin de vous tout au long du repas
Le proprio est très sympa aussi, il se balade aux tables pour discuter avec le monde
Repas excellents, nous avions goûté le gratin de homard et le couscous, qui valaient vraiment la peine. Les entrées et dessert était également délicieux.
On nous avait aussi très bien conseillé pour le vin
Un peu cher mais ça vaut la peine, et bien situé au centre ville pour aller prendre un verre après par exemple"}
{"text":"Oh my... I ordered the shrimp and scallops with risotto. Two pieces of each came out. Nothing special about either. Although the shrimp was CHEWY and definitely overcooked. The risotto was a tablespoon's worth, spread over the plate as a bed for the two shrimps and two scallops... unimpressed. Totally disappointed. (Was totally still hungry after the $30 dinner.) Wine was good. Dessert was nothing special. A friend order the sausage and duck confit stew, and that was pretty good. But there was a flavor that resonated with every bite... Will not go there again, and would not recommend it. The server was quite rude. Not helpful. Gave dirty looks and just looked annoyed most of the time. Didn't even refill our glasses. Don't go here!!!"}
{"text":"We had an office across the street from this restaurant and I had a funny experience I wanted to share.  The restaurant looks like it hasn't been renovated since it was built in the 70's so there's an interesting old school vibe here.  That night there was a \"celebrity\" chef on duty who was this little only man (probably all of 4' tall, 5' with the hat) came to our table to present his menu.  Being the only non-French speaker at the table, I relied on my colleague to assist me in my entree selection.  All sounded good until I asked why the chef emphatically suggested his Boeuf Bourguignon...

She was in mid-conversation (are the French ever not? I love that.) and simply motioned to me by tugging on the side of her mouth, smiling and saying \"oh, la, la\".  - all suggesting to me that either she wanted to dance or that this dish was the most succulent beef this side of the Rhone.

So it would appear that I'd be a complete fool, a dumb American, perhaps even the dreaded horse's ass to not order the Boeuf Bourguignon.   So I did (for myself AND the honor of my country).

Being an American, I typically enjoy looking at my beef in either hockey puck patty or steak format (anyone with me?).  Upon first examination, what arrived on my plate was pretty close so I dug in....and it was indeed d-e-l-i-c-i-o-u-s.

About half way through my dinner, I observed my two French colleagues (from Paris actually) giggling and looking in my direction.  Typically this means that I've either something sinister hanging from my chin or they have a plan to stick me with the bill.  However, when I inquired, they responded \"we're just proud of you for being so adventurous\".  

Adventurous?  I asked. 

Adventurous.  The chef's specialty was in utilizing lesser known \"parts\" such as the neck, cheek and, um, jewels.  

...and so my adventure began."}
{"text":"I noticed many of the reviews complained about the prices... I stopped by for lunch and had a great meal on the patio/sidewalk... Had the lunch menu, tomato salad and bocconcini to stars followed by the grilled salmon - it was excellent in portion size and taste.  Had a pint and a half of beer to accompany the meal and all was good - this is an \"in\" spot so you are going to pay more for everything - as long as you know that before you sit down - your good!"}
{"text":"Not bad, but overpriced. 
Appetizer: Bone Marrow - Disapointing, average at best $13
Main: Calf Liver - seared with onion which was good. vegetable was overcooked. $25
The atmosphere is a bit strange. Mixture of Bistro and Hooters ( female waiters running around in black miniskirts)."}
{"text":"A little overpriced, but twice I've had good food here. The duck confit could have been more tender but it was good enough. The outdoor seating gives it a Euro feel, but the American music kinda kills it."}
{"text":"Stopped in here for a cocktail with friends as there was a storm and we simply wanted a drink. Was guided by a waitress with no menus to a dirty table. We asked for a cocktail menu and she replied that there wasn't one and that she knew all the cocktails and we could just verbally order. Very strange for such a large establishment but we assumed maybe this was for the bar area. I ordered a glass of prosecco along with one of my friends and my other friend ordered a cocktail. The waitress left. About 5 min later another waitress arrives and asks if we've been served. We say yes. Another 5min and another different waitress returns and states my friends cocktail wasn't available. Disappointed she's settled for our prosecco. After another 5 minutes a completely different waitress returns and says the prosecco is not available either and offers to bring us champagne. At this point we were under the assumption that after all our drinks were unavailable we would get some kind of comp or discount but as we sit drinking a drink we were not fond of we decided to get out of there and find another spot that actually served cocktails. Again another completely different waitress gives us our bills. Emphasizing the fact that there was probably 10 active waitresses in this empty place. The bill was for $27 for a glass of champagne we didn't even want nor were informed of the level of shelf it was (come on $27 champagne after no availability of our original orders!!). The waitress who offered and served the champagne was angry when we spoke about the issue and she had a very heated conversation with who I'd assume was a manager. He approached us and offered to cut the bill at 50% at least (which should've been completely comped after this fiasco!). We were also informed there was in fact a cocktail menu when we stated our anger with the pricing and misinformation which the waitress responded as if if was our fault. What a horribly managed establishment, with a terrible sense of ethics and poorly trained staff. Avoid this place at all costs and have a glass of $27 champagne at a much classier establishment. Terrible."}
{"text":"A French style bistro with great (fantastic!) steak tar tar....as for the other items, it's okay.

Come here for steak tartar, otherwise try somewhere else."}
{"text":"Alexandre Restaurant Francais is a charming example of a classic Parisian cafe. We were seated outdoors on the sidewalk under the awning for dinner on 23 July 2014. The waitress was very polite yet efficient with her duties. I had a glass of Moet and a classic caesar salad. My Darling had a croque monsieur with a green salad. It was absolutely charming. My salad was exquisitely flavored and was really something special. The salty, nutty parmesan cheese shaved on top was a real treat. The sandwich was classically prepared and equally delicious! Although very pricey, this place is worth it!"}
{"text":"great food,  amazing atmosphere, amazing  service, friendly and funny owner. Great cigar room . love it"}
{"text":"The worst waitress and 105 CAD for small Dinner and 2 Beer. Never again."}
{"text":"i didn't have any food but the wine was okay. a little pricey (but it's in the downtown area so i shouldn't be surprised). best part is the outdoor seating and super convenient location."}
{"text":"Excellent ambience and service. I felt like I was walking into a brasserie in Paris. 

Had mussels which was plentiful in a 'just right broth'. Really attentive service. Other guests all liked their meals. Highly recommend!"}
{"text":"What the? It's like I walked into a Star Trek holodeck version of a desperately middle aged casino lounge, complete with patterned overkill on the decor and a smothering, velvety feel. Woah, what happened? 
Stinking of shampooed carpet that reeks of two decades of cigar smoke, this place is rich on entertainment value. And who was Joe Mafia on his phone in the corner with all the loose leaf paperwork? 
I dunno, but one scotch down and I'm outta here. The lonely hearts club ogling me at the bar is too much."}
{"text":"I should have read other reviews before we stopped by for dinner... but after a show at Bell Centre, we were hungry and cold, looking for a warm place to sit down and eat. Coming up the Peel, we found this place on our way back to our hotel. Food and service was okay, but same as all other reviews, price was very expensive for what we got. This was the most expensive meal we had in Montreal, and the quality was disappointing. 

Try other places before you stop here, unless you want to pay a lot of money for mediocre food."}
{"text":"From the outside this bar is listed as a cigar and champagne bar, but one we were inside, the cigars available were pricey and the bartender even suggested we head down the street and purchase cheaper ones. Additionally, they only had two glasses of champagne for purchase, cheapest was $24. Then all the rest was in bottles and the cheapest was $60. I'm not sure how a place can advertise themselves as a champagne bar but not have more choices. Needless to say we enjoyed one drink there and left."}
{"text":"http://www.chezalexandre.com/eng/index.html
Tel. (514) 288-5105 ~ 1454 Peel street, Montreal (Quebec) H3A 1S8 

For a delicious and affordable lunch - you can't go wrong. The onion soup is a winter must-have and their lunch offerings are a generous portion! Last year when I stopped in for my annual trip to the winter Highlights festival we were delighted to find that the service and food were still top notch! 

Looking forward to visiting Montreal in October  for a work conference and can't wait to stop in for lunch or maybe try them for dinner this time since I don't have to plan for a special Highlights dinner this trip."}
{"text":"This restaurant has old classic French ambiance. A great spot for a business lunch with great food and excellent service. I had the cold lobster. It was cooked to perfection, very tender and sweet with just the right amount of seasoning. It was so good that I came back at dinner. Unfortunately, no more cold lobster but they did have Lobster au gratin with mashed potatoes. Also very delicious and succulent. In the evening, I sat close to the patio but still indoor. The smoke was so unbearable that I asked to sit further back. It was better but the smoke was still strong. I suggest sitting inside to avoid all that. Overall, a must if you're looking for excellent French cuisine in Montreal."}
{"text":"2.5

Over priced which brings it down a lot. French onion soup was too watery. Salad was eh. 

Filet was good to great. Friend gave it 4.5/5 higher than I would for the steak but good. Deserts were ok. 

The service was excellent. The bartender (initially out waitress) was funny and a pleasure. 

The fact they are open late night was obviously the reason we were there.

Loved the music from the past. Good blend of oldies."}
{"text":"Food was mediocre and over priced .  This is a tourist trap.  The wait staff was inexperienced and not professional.  One of the items ordered was french onion soup, the price was 3 times higher than a bowl I had the day before at a nearby location and the soup at Alexandre's was inferior to the less expensive version.  Try Beaver Hall, professional wait staff, attentive and efficient, the food was very good and the price comparable."}
{"text":"I was brought to this place by a good friend that had been coming here since he was a child.  The ambiance is nice, and the staff was very attentive and ready to serve.  But, my issue with this place wasn't the taste of the food or service of the staff.  It was the pricing of the food...I admit, the food was good but the pricing of the dishes were WAY OVER PRICED!!!  This is the reason why I'm giving it 3 stars.  I just don't think that the pricing of the food is adequate for the type of food that they serve.

Note:  I had way better food at cheaper pricing around the same area of this restaurant's location."}
{"text":"I had a very lovely lunch at this restaurant. Did you know it was the first the serve draft beer back in 1982? 

The owner Monsieur Alain welcomed us at our arrival and he was extremely friendly and helpful. In fact, all the staff was. There seemed to be a lot of regulars which is always a good sign. I guessed this happens when the owner is there for more than 40 years.
The décor: It's a french brasserie and does look like any one in Paris. Even the chairs in the front section are the exact same rattan-like you'd find on a French terrace. Extremely traditional and kitsch, in a comfortable way. The attention to detail is put on what matters. Tablecloth are impeccable, glassware is top quality especially for champagne, silver cutlery. The owner told us there would be some renovation soon to freshen up the place.

Food: Simple but very pleasant. I started with a duck and foie gras terrine with lentils. It was tasty and soft. My friend had the fish quenelle. It was even more flavorsome. For the main course I took the duck confit. Obviously! (I'm in love with duck) it was very classic but well prepared. The salad missed vinaigrette but the potatoes were crispy and good. My friend took the fish of the day, a bar filet. It was simply put in the plate, without any side dish. Even by itself, it was the best dish of the whole meal. Tasty, fresh, and just lovely.  
Wine: We were told Alexandre is the place to drink Champagne. And so we did. We had a piper-Heidseick by the glass and then a bottle of Charles Heidseick. They have an agreement with this champagne so they put it forward even if they have great other choices. It is an underrated champagne which a always enjoy a lot. The prices were very reasonable. They don't have a sommelier on site but the wine card was built up by Jessica Harnois, herself. 
Other little detail, they have Badoit for sparkling water instead of the usual Eska. I like it better, but that's some personal choice.

Overall, I'd say it's an old-fashioned place with a lot of history and stories. It has a lot to say and offer."}
{"text":"This is a little gem in downtown Montreal, they have excellent customer service with courteous, bilingual staff. The food was a bit pricey but it was very good and well-presented, my lobster was delicious, the side order of fries was crispy and fresh and the mussels were steamy. The place has a sort of decadent aura, it looks very Dynasty or Falcon Crest, very disco, very 80's. There is a bar upstairs but I did not check it out."}
{"text":"Went here for a late night meal. It was okay, not great. I would suggest it if no other place was open, but definitely not take a date here. It's not a well run restaurant. But since the food didn't kill me (but certainly wasn't worth mentioning) I'll give it three stars..."}
{"text":"I went in to eat solo, and asked to sit at the bar.   On walking over to the bar, I noticed a call girl, drinking a martini and waiting for her date.   In so many ways, this bar feels like Vegas.   The food is very expensive.   The clientele like to smoke cigars.   Ther service is great, which is why they get 3 stars.   However as a woman traveling alone for business, I didn't feel great here."}
{"text":"The reason why I'm not giving this place 3 stars + is because of the prices. Let's be clear m! I'm not cheap when I go out to eat but if I'm ordering basic food that comes with no sides I shouldn't be Paying that much money. Prices don't match up to the place. 

Moving along. I ordered the steak with home fries but instead got French fries.. whatever.. I was starving and ended up eating it anyway. The steak was really good and the fries average as any fries would be. I ordered my daughter chicken wings with fries (an order of 6 small wings was $16 & the fries came separate at an extra cost!! My cousin got French onion soup which she said tasted sour. The waiter was nice so thumbs up to him. 

Besides that I wouldn't go back here when I do make a trip out to Montreal again."}
{"text":"When I go to a French restaurant with such prices, I'm expecting excellent service and gourmet, or at least, good food. In a few words, food was boring...bland and no taste...& low quality. The server wasn't even able to answer questions about the dish I ordered, but I took the risk. 

Some details:

* I ordered the Choucroute de Mer, one serving each of salmon, haddock, shrimp, scallop and a potato, served on cooked shredded cabbage and juices. Cooked OK but nothing was seasoned, food was sitting on warm cabbage and a lot of water which I thought were juices, wouldn't even call it jus. I only finished it because I was hungry and it cost 30$. 

Steak: cooked well but served with poorly cut fries, on some plates hot and crisp, on others small warm leftovers from the previous batch. Some ordered a side salad with the steak which was a few leaves with a dressing that also has no taste.

Presentation: nothing eye catching; no colour, no arrangement, no elevation... Cheep portions was the first impression. 

What the heck is their chef doing and what is their quality control? The best part of the meal was my beer. 

I'm never going there again"}
{"text":"This place was recommended by the valet.  I think they are getting paid to recommend this place.  I have no idea why.. it sucks.  We were starving and it was 9 pm.. we just arrived. We weren't sure if anything else was open as there isn't too much late night food available in many cities in the middle of the week.  It has a disco theme mixed with a French bistro.

This place is WAY pricier than it's worth.   Our bill was the highest than all of our meals the entire weekend.  We had the bone marrow which was pretty tasteless.  Then we had the main dish.. small portions.. which is good although for how much it costs you would expect a little more.. and not that great.  The pork knuckle was just mediocre.. 

The wine is the most expensive.. for mediocre wine selection.  The dessert is also pricey.

I definitely would skip."}
{"text":"Our visit to this restaurant has been the only black smudge on our trip to Montreal. We had been recommended this place by our hotel. 

The food was extremely low quality. I got a steak which was so clearly frozen and of poor quality that I could I gotten it at a diner in Florida for $6.50. Everything seemed to have been frozen at some point and was way way way overpriced for the poor quality. There was weird techno music playing in the background. 

On top of it, I had ordered off a set menu, but then was charged regular menu price. When I pointed it out to the waiter, he claimed I had said the wrong thing in French. I had clearly pointed to the set menu on the English side of the menu when I ordered. But the way he responded to me when I raised it to him left me somehow apologizing to him for the mistake. The waiter served to make me embarrassed and then bitter that I was overcharged. This is the only time I've been made to feel unwelcome as a tourist during my time in Montreal. 

The only redeeming quality was the small glass of kir and champagne they offered women upon being seated. 

Our bill came to $90 and was the quality of a $15 diner. 

Definitely avoid it here."}
{"text":"Bistro français situé au coeur du centre ville sur la rue Peel. Le homard était délicieux et mon ami qui a pris le canard n'a pas été déçu accompagné de pomme de terre cuites dans le gras de canard. Nous avons deguesté le tout accompagné de champagne vraiment bon doux en bouche et bien pétillant et nous avons terminé avec une crème caramel et un fondant au chocolat. Le fondant était un peu sec mais ma crème bien sucrée et goûteuse :) décoration originale comme un petit bistro français très coloré et lumineux. Ambiance plus animée durant la fin de semaine nous avons pu profiter du calme de la semaine et du service prévenant. On vous détaille le menu avec soin et vous propose les spécialités de la maison. À essayer!"}
{"text":"Cute little French-style wine bar. Decent wines and food at reasonable prices next to the best shops."}
{"text":"We had a great meal here. The service was top notch- friendly wait staff and frequent check ins.

My wife had the fish and chips and I had the steak and fries. Both were great. 

This place was recommended by our concierge and deservedly so as the experience was great."}
{"text":"Me and a colleague stopped there because the place was full with locals and vibrant.  The service was excellent and so was the authentic French food.  The wine and drinks were very good, although by no means top shelf; however, the staff was attentive and suggested an excellent food-wine pairing.  

Note, that if you are looking for a good place to enjoy the food, drinks and cigars on the patio with the locals this is a great place to go.  On the other hand, if you cannot stand people smoking around you this may not be the best choice."}
{"text":"My friend and I tried the brunch plate. We were both disappointed in that the eggs Benedict were not runny, and the service was not great (had to ask the waitress many times for a few things). Ordering the brunch plate comes with a dessert (don't remember the name) that was better than the main meal I find."}
{"text":"Service Lacking, food ok. Not worth going in unless you are caught in a downpour.  Servers seemed bored with helping us and taking our order- we waited quite sometime-"}
{"text":"This restaurant was recommended by numerous websites prior to my arrival here in Montreal, so I thought it would be great to take my girlfriend there.  The short answer is that we had a very pleasant time.

In detail:  When we arrived we found that the menu was a little pricier than we'd had anticipated, and though not a HUGE selection of foods, some very nice selections anyhow.  My girlfriend at the Warm Goat Cheese Salad and I had a \"Super\" Burger with Blue Cheese on it and a side of fries.  Everything tasted SUPERB!  The only reason I gave it one less star was because of the service.  It wasn't BAD by any means, but at the time we went (around 6pm on a weekday evening) there were four girls in VERY short skirts serving everyone.  Seems weird for such a place.  They were all very friendly, but also tended to hover and watch us eat.  Being a server myself, I know that you can watch your table without making it obvious.  It was quite obvious.

Otherwise, everything was great... just wanted to point that out and that's why I gave it 4 stars.  I think it's a great place for businessmen after work!"}
{"text":"Excellent lunch on a rainy day in Montréal. We had classic Croque Monsieur and Salade Niçoise, both very fresh and tasty. The CM had a perfect 'crunch' to it. Atmosphere and decor were cliché French but why not!  Service was prompt, efficient and friendly. After a very foamy cappuccino it was back the wet streets. Yes a bit pricey but on balance not a big issue. We'll be back when the terrace is open."}
{"text":"The place looks like it needs a refresh but the food made up for it. We had a slightly longer wait than normal for a table of 6. I really enjoyed the trout with almonds,
Buttery mashed potatoes (server said it's 1:1 butter to potatoes which was believable) and spinach. The trout was a touch salty but still good and perfectly cooked! One of the top trout dishes. 

Server was friendly and funny. He spoke English to us which was great. Everyone enjoyed their meal at our table - from lobster to risotto with scallops. I would highly recommend the trout.

They were able to serve gluten free options."}
{"text":"Too pricey for the quality of food.  Do not order the onion soup; it is too expensive and its consistency is very low (very watery).  The only dish that was well prepared was cassoulet Toulousain."}
{"text":"Very expensive drinks, and bad attitude from staff, there are other bars on Peel, pick any of them and you will get a better value and a better time."}
{"text":"Jolie decoration, dejeuner agreable et tranquile, bon service, bonnes assietes. Clientele touristique , il servent du jus d'orange frais pressé inclus dans le dejeuner :))"}
{"text":"Horrendous Food! Lacks any quality or innovation and is atrociously overpriced.

My boyfriend and I were in town for the Grand Prix weekend and decided to find a restaurant on Peel Street to enjoy our last evening. The restaurant was pretty empty which should have been our first indicator as an empty restaurant on Peel St during Grand Prix weekend is unlikely. We ordered wine, shrimp cocktail ($23.00) and fried calamari to start. The appetizers came out and we were horrified. The shrimp was completely yellow/grey - obviously not fresh and the martini serving glass had cocktail sauce with a comical mountain of arugula over top. The shrimp smelled awful and were chewy with a concerning overly fishy taste. The presentation with very 80's and laughable for the price. The shrimp were so tiny and not even remotely worth the $23.00 price tag. The calamari were obviously frozen and from a bag. The squid looked like onion rings and were very chewy. 

After the appetizers we immediately paid our bill and went directly next door to the sushi restaurant called RYU which was absolutely incredible!

I cannot believe that they're getting away with serving such grotesque food. It's such a shame because the location is great and with a more educated owner and qualified chef this place could be great. This owner needs a sincere wake up call. DO BETTER."}
{"text":"Bonne ambiance, bonne assiette et bon service... Au passage: cassoulet toulousain + vin = excellente choix."}
