{"text":"I've eaten breakfast here three times. Each time I wish I went somewhere else. The food is OK, if a little tasteless and bland. The omelets are disappointing. Not much is added to the eggs and the sauce in the Italian Omlet is weak and runny.

Each time I ate here I was with friends. The last two times my friends check had something added to the bill that was not ordered and not brought to the table. The waitress fixed it when it was brought to her attention, but it should not have been there in the first place.

The area around Alexandrias has several restaurants. If given a choice, chose somewhere else."}
{"text":"Outstanding service and food they actually cook, not frozen stuff heated up. Great spot for breakfast through dinner. Clam chowder every Friday is worth a stop in."}
{"text":"My reason for the two stars was the S-l-o-w service.  We waited about an hour for our dinners. I ordered an appetizer when we first arrived and it was served about five minutes before the dinners.  The children had ordered from kids menu which included the salad bar. Without the salad bar, the kids would have been overly hungry by the time food arrived. I probably would not return to this restaurant due to our experience with service."}
{"text":"Very good service staff. Average diner food. Corned beef hash should be potatoes flavored with corned beef. Home fries had no flavor, the good thing they are cooked on the grill. Coffee is cheap and from a distributor. Another good thing the fruit is fresh and not canned. Looking around, most of the guest are about 30 years older than me and I am 50. 
But once again the server was outstanding and should be working at a higher quality restaurant. She was friendly and very attentive."}
{"text":"Made my stomach smile! Great find off the highway reasonably priced and kid friendly. Old diner feel and has a small soup and salad bar.  The all you can eat fish was very good and the best part is they also served beer which was appreciated after a long drive."}
{"text":"I have been to this restaurant a few times. On my last visit they served my wife some roast beef that was pretty bad. It was obvious the stuff was too old and needed to be thrown out. The wait staff is excellent, but the food needs help."}
{"text":"This is a great restaurant to grab a quick hot meal with family. Service was kind and attentive, you can tell it's a family place. Prices are very reasonable. It's kept clean.  

The salad bar was fresh. I had steak with rice and veggies, it tasted fine and it was hot and filled me up. 

I have to give this restaurant 3 stars because the food is not any better than I could make at home.  I would highly recommend this restaurant if you want to feed your family, but I would not recommend it for an exciting or super tasty meal."}
{"text":"Went solely for the fish fry, Friday night, all you can eat for 8.99.  Service was great, fish and chips were standard deep fried, salad bar lacked selection and they only had one kind of soup.  Overall cleanliness was par with other family style restaurants,  little grimy but that's Medina for ya.  I would come back."}
{"text":"This restaurant is outstanding. Excellent food & service. The food is always hot & they bring u a whole lot of food that u sometimes cant even finish. For their omelettes they give u 3 EXTRA LARGE eggs with outstanding hash browns, or fruit or tomatoes if u don't want the extra starch, then they give u toast or english muffin & coffee or whatever u prefer to drink. This restaurant is fantastic & very nice place to just enjoy your meals with someone or by yourself. Their dinners & lunch menus are awesome also. I would highly recommend this restaurant to anyone who loves home made meals that makes u feel like your mother made for u. they are not expensive either"}
{"text":"I've driven by Alexandris for probably 25 years (including their old location), and I don't know why I never stopped in for a meal.  They are now where the old Perkins used to be.  Anyway, we just got back from a meal with my two little ones, the wife, and the grandparents.  Helpful waitress, nice clean location, and really good food.  We were really surprised at how reasonable the prices were.  It was all around a great meal.  We'll recommend to friends and be back.  Thanks"}
{"text":"Soup/salad bar is pretty standard. They have lettuce and a few toppings with 5 dressings to choose from, no complaint there. The lunch I had was horrible, it tasted like it had been frozen solid for a decade then thawed out and froze again with serious frost bite. After all that is was microwaved on high heat until it was lava hot to insure the ice melted... the taste was similar to cardboard with bland gravy and plastic mushrooms on top and named \"Chicken Marsala\"."}
{"text":"It's the kind family restaurant I remember as a kid, before all of the franchise restaurants took over.  Food was pretty good and the waiter I had was excellent.  I will be going here again, I can't wait to try there breakfast"}
{"text":"My sister and I both found hairs in our food, which was gross. I usually dont make a big fuss about things like that,  but hair in noth meas was a luttle much. We were offered new meals, but I don't trust anything goes from that kitchen. The coffee tasted horrible, basically brown water. Needless to say I will not be returning and do not recommend eating here."}
{"text":"One of the few non-chain places for breakfast. I have only had breakfast here, so I can't attest to any other times of day, but as far as eggs, waffles, and French toast go...I've had them all here, and they've all been good. 

The prices are reasonable, and to ice the cake, kids eat free on Saturdays with an adult meal. It's become a regular stop for us! (Note: if you live in the area, watch for coupons in the local mailers). If you're looking for ambiance, it's not the place. Think local diner. But the food is definitely up to par!"}
{"text":"Jason was our server and he was awesome, the only thing awesome about this place. Food didn't taste fresh, more like frozen and the salad bar was horrible. We had got the all you can eat fish and it was subpar. I will not be eating there again."}
{"text":"4 stars because service was so good and food was good- deducted 1 star for cleanliness and dated/worn decor.  We ended up here around 7:40 am on a Saturday waiting for our sons' baseball game to start after we dropped them off for warmups.  From the outside and entryway, I was worried we had made a mistake- worn decor in/out, cracked floor tiles, etc.- but service was exceptional by attentive server and meal arrived in a timely manner.  I had the Greek omelet with tomatoes, ham, gyro meat and feta; it was different but yummy.  My husband had the Denver omelet on special and he like that too. The home fries were simple without any onions or peppers added and not greasy- we liked them.  Coffee was hot and server kept our cups filled often.

This must be the place for breakfast because shortly after we arrived, many locals started to arrive in both small and large groups.  We would definitely come here again if in the area."}
{"text":"Excellent prices and better than average quality American style food. Portion sizes were big, service was fast and will definitely be back."}
{"text":"This is our favorite little eating place. Nothing fancy but the food is great and the service even better. It's a family restaurant and you can tell they care about their patrons.
I love going there for breakfast. They'll serve most of their breakfast entrees all day, which is nice. We rarely have to wait but they're almost always busy- another good sign of a good restaurant."}
{"text":"Came in for a quick breakfast and was not disappointed.  It's a pretty nice, family-style restaurant.  The breakfast menu has all the usual suspects, plus a Greek skillet, which I tried.  Eggs (done just how I wanted,) home fries, gyro meat, feta, tomatoes, olives, etc.  Perfectly done, great combination.  Service was good, prices are low, and I would not hesitate to come back next time I'm nearby."}
{"text":"When I stepped into this place I almost walked out. However, knowing I should not judge a book by its cover I decided to continue on.  Unfortunately I should have gone with my 1st instinct. 

For the price I would consider this place maybe 1 step up from your typical fast food restaurant - comparable to a Bob Evans chain.

The food was mediocre at best. The cooks over seasoned everything.  The rice was terrible. The salad bar contained barely recognizable dressings. The only saving grace was that the chicken seemed fresh and tender, although poorly seasoned with too much paprika.  

The atmosphere looks like a poorly modified restaurant from the 70's. 

The two stars are 1st, because it's clear this is a low budget place so your expectations should be low and 2nd because in my one and only visit to this place, at chicken was at least fresh.  

 I will not be back again."}
{"text":"Super friendly service. Salad bar was good. The only issue is you have to really stretch to get to items in the back. Sausage and pepper pasta special was good. I would put a list of specials in the menu instead of just on a chalkboard."}
{"text":"I'm starting to make my way around the Medina food scene. Alexandris is very near my home, inexpensive, and it has a salad and soup bar. For these reasons, we will be visiting often. 

Our waiter was friendly and attentive. I ordered a lemonade and then the salad and soup bar. Because I'm impatient, I really like that I can begin eating immediately.

My mom ordered broiled cod with onion rings and green beans. The fish looked and tasted awesome. My wife had a pulled pork sandwich, which she really liked. The french fries were tasty as were the chicken tenders.

We'll be back for more soon!"}
{"text":"Had dinner at Alexandris, would not recommend.  Fish was very bland, if I had to guess it was a heated frozen fillet then sprinkled with paprika, the carrots tasted like canned veggies, and the rice - probably a processed product too.  Greek salad - no kalamata olives, only a few slices of canned black olives, and the gyro meat was chopped pieces of cold meat - like a lunch meat (bologna), the feta cheese had little flavor - just a total disappointment all around.  I only saw 1 cook in the kitchen, so if I had to guess, they're not serving fresh food - just warming up pre-processed food, that is NOT my idea of dining out - I can do that at home."}
{"text":"Newly remodeled nice decor. Great prices!! Staff Andy service are really good! You are seated and served promptly. Breakfast is wonderful and served all day. Daily specials are usually my choice! As close to a diner as you can get in Medina!!  I'm a local & recommend highly!also has full bar!"}
