{"text":"Alice Fazooli's hovers somewhere above Jack Astor's et. al but below the level of fine dining. Not to say that the dining isn't fine. The food is very well prepared and there is clearly a lot of effort put in to create a certain ambiance.   It's the kind of place that would make a great date with your significant other."}
{"text":"When I order salmon I generally prefer that it not arrive with a long hair in it. There was a long strand of black hair wrapped around the salmon and laying across the plate and it was completely obvious - I showed the server before she even put the plate down. The response? \"Oh, yeah, there is a hair.\" And she took it back. No apology, no offer to comp it and then it took another 20 minutes for a hair free replacement to be brought out....by which time my dinner companions had almost finished their meals after waiting till their food got stone cold waiting for my meal to be brought out."}
{"text":"My husband and I came here for our wedding anniversary. It wasn't busy, and there was only one waitress working, but the waitress we had was quite abrupt with us and we felt incredibly rushed. I thought it would be a nice Italian setting, however when we walked in, the TV was playing Jerry Springer. So I went about my meal, watching some women dancing on a stripper pole, and making out with each other, and fist fighting on the 4 TV screens - happy anniversary to us...anyway, the special for the day was $3 off cocktails, and when I ordered my cocktail, I was told this deal was only for Mojitos (which I don't drink). I felt like it was a bit of false advertising, but oh well. I had to ask for water (none was brought to us), and when we ordered our meal, it was not impressive to say the least. My husband had a chicken fettuccine and the chicken was dry and it felt like it was leftover chicken from the night before.   I was hoping for a nicer experience coming here. When paying $20+ for a pasta dish, you would think a small side salad would be included, or at least some bread/butter, but nothing (including water) was provided in addition of the meal.   I was considering hosting a party of 30 people here, after reviewing their group booking menu online, but after coming here and experiencing the restaurant myself, I will definitely not be coming back."}
{"text":"This restaurant is the very definition of \"A-OK.\"  There is nothing that stands out about this place--average flavours, average portions, average service and average ambiance (for the price range)... all tied together by above average prices.  I cannot fault anything about this place, but I also never have any cravings for this place either.  It is one of those places you end up going because it is someone's birthday, or a work function.    The dish I had was the angel hair pasta with shrimp, in garlic/herb/oil sauce.. with some basil & tomatoes thrown in.  The pasta was a bit over cooked, so was the shrimp--not so great texture, but the flavours were pretty good.  Canadian operated Italian chain restaurants are so bad compared to the American ones... what more can I say?  It is better than East Side Mario's--but much much worse than Maggiano's. or Carrabba's."}
{"text":"I went to Alice Fazoolis with some co-workers for dinner. This restaurant is a bit on the expensive side for what they offer but the food was not bad tasting at all. The decor is very good and the service is efficient. The seating/dining area is spacious and is partitioned to suit the taste of clientele. There are big-screen TVs for those who want to follow a game and then quite nooks for those who'd like to be more cozy. I ordered some ravioli and it was very tasty but a price tag of $23 is not quiet justified. A good restaurant to go for the ambiance and decor if you don't mind spending around $55 per person (entree, dessert, wine, espresso, tip, taxes)."}
{"text":"So my minimum expectation for an Italian joint is to at least make a simple Cesar and Margarita zaa. These folks can't even do that. Stay home, mix some canned sauce with parma on bread, it might just taste better."}
{"text":"Came here with my girlfriend, the atmosphere was a bit confusing. Kitchen looks a bit dated, hippie chandeliers in the dining area.. But seating and walls have more of a contemporary feel.   Staff was pleasant - but nothing special.   We ordered a pitcher of sangria which was great! Calamari to start, chicken Marsala with a side of linguine Alfredo & a small atomica pizza with side Caesar salad. All I could say is: GARLIC! Alls I know is, if any vampires come around; I'm safe. Don't go to Alice fazoolies before a job interview or social gathering!"}
{"text":"Stopped by for late night (after 10pm) eats with a group of friends. Pretty conveniently located off the 400 with lots of sister restaurants near by  Service was fast and portion sizes were average. Solid overall,  but not spectacular"}
{"text":"This place has expensive and solidly mediocre food ...if not blah. Went here with a large group of people and I don't think anyone in the group would have raved about their meal. The consensus was that the food was \"ok\". I had a pizza and a ceasar salad. This place manages to make ceasar salad more boring than normal if you can imagine that! Given that, the service was quite acceptable."}
{"text":"Easily the worst place in Mississauga, the quality of food vs the price is NOT there, trust me."}
{"text":"WORST restaurant ever. Do yourself a favor and do not come here. I've been several times (not by choice) and each time the food was worse than the last time, if that's even possible.   I came for a bday and we waited for over 30 mins to order and another hr before the appetizers came out. The bruschettas came out, which I had ordered and they were confused who the 3rd one was for and brought it back to the kitchen. I had to complain after 30 mins that I hadn't received it while everyone else was finished theirs. After informing them that I hadn't received my bruschetta the waitress came back with an excuse that because I hadn't ordered a main course they were going to bring it with the main courses. This was obviously an excuse as they had originally brought it out and therefore made it as an appetizer. Not once did I or anyone receive an apology for having to wait to order, receive our food or for any of the countless mix ups.   The birthday girl's appetizer was brought and left in an empty seat at the table and we had to ask around to find out it was hers. There were several more mix ups and the service continued to be slow with some people finished their main courses before others even received theirs.   I have never in my life had such terrible service. If the food had been amazing, I would be more forgiving but the food was atrocious. My boyfriend's salad had almost no dressing and consisted of 2 pieces of lettuce. The chicken bites were clearly frozen and were soggy like they were microwaved. My friends pizza was burnt and extremely salty. My bruschetta was rock hard and the tomatoes had no flavor. It tasted like a garlicky brick.  We were lucky enough to get separate receipts, however the tip was already added very discreetly on people's individual receipts, which I and everyone else had never seen before (parties of 6+ ppl on one receipt usually have tip added). As a result, many people tipped on top of their receipt and weren't given back the extra money they unknowingly tipped.   I have never in my life had such terrible service. If the food had been amazing, I would be more forgiving but the food was atrocious. Any of the other restaurants in the plaza would be infinitely better. Do not waste your time or money."}
{"text":"Visited one week ago on the holiday Monday, after seeing a film at the theatre nearby and then asking Yelp for where to eat nearby. As it was too late for lunch and too early for dinner, it wasn't busy (or else everyone was on the patio) and definitely not loud (as I'd feared that rating). Though we weren't dressed for any occasion, the linen tablecloth (covered with paper) and napkins were a welcome touch. What I also appreciated was how easily the armchair slid over the slate-like floor, so that I could push myself closer to the table without exertion. A small detail, but very important for my comfort.  My companion ordered a Bloody Mary and the Butternut Squash Ravioli and pronounced both to be very good. I decided on the Chianti Sirloin with sauteed mushrooms on top, fingerling potatoes and extremely crisp slender asparagus spears on the side. But there was NO bread so I had to hope that the meat and potatoes would soak up the sauce. Luckily they did. I accompanied my meal with a flask (two small glasses' worth) of Chianti. The wine was very mellow (even though I prefer white).  We spent about two hours lingering over our meals and one benefit of the lull was actually being able to HEAR the music in the background. To my shock, I identified the Carpenters from decades ago.  It was a bit pricier than I would have hoped (I guess that was the wine?) and I do wish there had been bread, considering there were plates laid out for it. But I enjoyed myself."}
{"text":"I usually don't like eating at Chain restaurants, because I don't find them usually that good like Milestone, The Keg, Canyon Creek or this place. I find that they just charge premium price but the food is definitely not worth it.  I would say here the food price is standard price compared to a jack astor or milestone, but becuz of location this place stands out more.  The hostess there look nice, and our server looks like a young high school kid. We waited a while before receiving bread which is a small baguette dinner roll shape where you can dip with olive oil roasted garlic (nice).  Started off with their Fritto Misto which has fried mushroom, calamari, shrimp. Although indicating good for sharing, I felt the portion was not that big, and its not that good. But the sauce was nice which was like sweet chili sauce. My bro got the meatball which is tasty and you get 2 good sized balls!  Their Pina Colada is not that good. I got their Pappadelle Bolognese. The pasta was cooked good, but the bolognese look and probably tasted like dog food. I can make something like this dish better at home. I was informed that the Chicken Marsala is good, but it looked okay only.  Next time, I will not come to these joints!"}
{"text":"An all-purpose place for any occasion with good value if you catch their specials. Nothing that blew me away, but nothing fell short of expectations either. Gotta say, the bartender who doubled as the host did a great job.  I came here Thursday after a day of work and joined my mother and brother for an early dinner - we arrived before 5pm - so the place was pretty empty and relaxed.   Since they have $7 apps on Thursdays, and neither my mum nor my brother were hungry, they took advantage of the promotion and went ahead with a half margarita pizza, Parmesan chicken bites, and crispy ravioli. All of them were decent.  For myself I ordered the butternut squash ravioli ($19) which doesn't look like much, but have the server go crazy on the parm and you're in for a pleasant surprise. Super rich, with a good balance of funk from the cheese, warmly spiced pumpkin filling, fresh sage, and crunchy bits of hazelnut, in a nutshell? Get this dish.  The bread was also freshly baked, and I appreciated the huge bubbles in it, but it would have been better if they had balsamic vinegar and olive oil for dipping instead of just olive oil.  We had everything in the photos, and the bill came in at $45 including tax. Packed up the leftovers too.  Overall, well valued, in terms of service, atmosphere, taste if you take advantage of the promos. Good hangout location."}
{"text":"Was somewhat surprised to realize that Alice Fazooli's was a SIR Restaurant. Not that there's anything necessarily wrong with that, but it doesn't measure up to its loftier siblings (Canyon Creek, JackAstors, etc.)  Food was workmanlife,  but not particularly spectacular.  Had a Caesar salad which had bacon in it. Interesting touch, but only adequate salad.  Had the lamb chops for dinner, and, again, while the presentation was superb, the actual chops were only okay. Canyon Creek's chops blow the doors off Alice's.  Friendly atmosphere, would go again, but would scale down my expectations and order a burger and a beer ..."}
{"text":"Summary: My friends and I waited about 45 minutes for somewhat pricey, sub par food that I could not finish eating despite being very hungry.  My friend already wrote a review, but I made a yelp account just to write this review, so please excuse the similarities. I came to this restaurant for dinner on Saturday because my friends and I were in the area and we all like Italian food. Stepping inside, the venue was nice enough, although I couldn't help notice that it wasn't quite as full as some other restaurants in the area. Not giving this much concern, we proceeded to make our order. I ordered the chicken Fettuccini, something that I like to order at any new Italian restaurants I visit as I expect it to be a fairly safe dish. It was about $20, which was more expensive than most other chain restaurants.  About 40 minutes later, all we had was water (my glass was empty for a good while now). It wasn't until I got really tired and started to lie down on the table before our waitress came over to apologize for the wait and explain that it was very busy in the kitchen. No offer of bread or anything though to help us with the wait.   The food arrived just as we stood up ready to leave. We decided to give it a chance as we were all very hungry. That and we had some positive expectations for a place that specializes in Italian food and which was charging as much as they did for even the simple dishes. Unfortunately, the food was disappointing. The pasta was dry and hard to chew and the chicken was bland and overcooked (also hard to chew). The only thing that tasted okay was the sun dried tomatoes. The serving size was as small as what you get at fine Italian restaurants (ie. Not enough to get full on alone for many people, need full course meal). While the food wasn't to the point I'd call disgusting, I could not stand to finish it despite how much I usually hate wasting food.   Ultimately, neither the food nor the service were the worst I've had, but the combined overall experience was close to it. Essentially I spent $20 and 1.5 hours for nothing but disappointment."}
{"text":"Nothing left but bland entrées. The first time I eat here I enjoyed the 3 squash ravioli with a side order of meatballs but they removed it from the menu. It was the only plate that actually had a twist and character compared to their ordinary processed dishes like cheap italian imitations. A laughable attempt to appear mondaine.  Quite frustrating is the feeling of being gouged when looking at this place which spent so much money redecorating to look good but lacks in food quality and the service is less than passable with excessive prices.  Such a hype for nothing; go see for yourself how \"meh\" it really is if this doesn't put you off already."}
{"text":"STAY AWAY FROM THE PIZZA, TAKE UR MONEY AND RUN TO Mamma's pizza or pizza pizza or something !!!!!!!! The pizza was basicaly a large cracker with no sauce no cheese and very little toppings and half the pizza is crust!!!! I dont know why every place that calls it self a italian resturant decided to put no cheese and sauce or toppings on the pizza, trying to be fancy or something.  14 dollers for a personal pizza which half of it had no cheese or sauce or toppings, basically crust!!! Call me crazy  but u can get way way better pizza at local fast food pizza places which charge much less and put toppings on there pizza.   I would not recommend this place to anyone!!!!"}
{"text":"Sadly, this place barely deserves a 1 star rating.  I've been to this location a few times over the years for birthdays and let me just say that each visit was more disappointing than the last and I really wish people would stop planning their birthdays here.  The one good thing I can say about this location is the decor and ambience.  They also have a separate dining area which is ideal for large gatherings.  As for as positive things I have to say about this restaurant,  that's about it.  Now onto why I don't like this restaurant.:  1. Food: Limited choices. Apps, Salads, Sandwiches, Pasta, Pizza, Entrees.  The Pastas and Pizzas probably have the most variety amongst those.  I ordered the Chicken Goat Cheese Pizza.  I like thin crust but this crust was absolutely awful in my opinion.  It was so dry and the edges were burnt.  The toppings weren't distributed evenly and the pizza was cut into 4 slices.  I cut each of the four into halves on my own.  Some slices would have so much goat cheese while some have barely any or none.  Pizza is pretty simple - this place failed at making it.  2. Service.   The importance of good service ina  restaurant goes hand in hand with good food.  If you don't have amazing food, then make your service fantastic.  You cannot fail at both and still expect happy guests.  Service was slow and almost non - existent.   Yet the tip is included automatically on your bill - perhaps that is why there was no incentive to provide good service.   I also have to point out that a few friends unknowingly tipped on top of the tip-inclusive bill."}
{"text":"Great atmosphere go here with the girls. Staff was amazing. Food has been great everytime. Had the chicken marsala was great!"}
{"text":"I'm giving three stars because ya gotta compare places to their rightful competitors: Alice Fazooli's is definitely better than the regular chain restaurants like Jack Astor's, Boston Pizza, Pickle Barrel, etc. albeit a little bit pricier than those places, too.   The atmosphere was also much nicer and this location had really friendly servers, who were accommodating when we wanted to move to a booth instead of an open table!   My friend ordered:  1) Chicken Arrostito  - I don't remember what it tasted like much, but my friend seemed to really enjoy it. The chicken seemed well-prepared (for a chicken dish..) and presented nicely. Only complaint was portion too small!  and I ordered:  2) Shrimp and calamari Puttanesca - I wasn't too hungry to just ordered an app. The shrimp was just gorgeous: plump, juicy and so flavourful, especially bathed in that piri-piri sauce. But I'm not big on cheese so too much feta for me, and the pizza crostini was basically baked mozzerella :( Overall yummy, but probably best for people who like tons of cheese.   Dessert: best dish of the night  3) Pecan pie  - Originally I got tiramisu but it came in such a tiny dish and looked like it was falling everywhere... so I asked to change and they happily obliged :D The pecan pie was delicious and oh-so-sinful. Big chunks of pecans, salty and sweet, good pie-crust ratio, mmmm... I would come back just for this again.   A really nice place to go for a casual dinner out! :)"}
{"text":"Drinks were good once we got them.  SLOW  service.  Did I say SLOW. Waitress was far from great. But YUM the ravioli fritti was great!!!!!Decent experience.  By no means great though."}
{"text":"This is the second time I went to this restaurant, the first time being years ago, and I remember the food being really tasty. Unfortunately this time around the food was just ok, and we all felt it was not worth the price. 6 of us went to dinner, and only one friend who ordered the chicken Marsala said it was good. Our drink orders were not up to par, don't order the margarita- not sure what exactly the bar tender put in there, but def could not call it a margarita. Two friends had the snapper, one order was gluten free which totally lacked any flavour, it was literally unseasoned fish with blanched vegetables, the other order was just ok. Two other friends ordered a pizza and chicken risotto- the pizza again didn't have any flavour, and it looked like the chef was skimpy on the toppings, my friend said the free bread was better then the pizza :( The chicken risotto was good, but the chicken was burnt and chewy. I ordered the gluten free margarita pizza with extra sauce and well done. The first order came with no sauce, the manager apologized and quickly got me a new pizza. However I ended up eating by myself as all my friends were finished their meals by the time my pizza came, and I guess during the rush, the pizza was soggy and completely tasteless. I ended up pouring chili flakes on it in order to eat it. For dessert, everyone said the chocolate cake was good, but was very dry at the bottom of the bowl. My friend and I who are gluten free could not enjoy anything, as there were no gluten free option. We were very disappointed, as I called the restaurant a day prior and was assured that almost anything on the menu could be made gluten free- but we quickly learned this was not the case. It's a shame that such a big restaurant has limited gf options :("}
{"text":"Its more than just another franchise restaurant. Its a nice looking place with an extensive menu and good food. The best part is that its very big and seating is plentiful so u rarely have to wait. We usually go here for mothers day brunch and its just the right amount of busy (not empty, but not overcrowded and loud).   I likez it."}
{"text":"Location is great...back patio is cool...food is ok...SERVICE SUCKS.  I am by no means picky at all, but server dude...how many times do i need to ask for my glass of wine which you hung around uncomfortably for what seemed like hours as I arrived and proceeded to ask me over and over...\"drink from the bar...?  Drink from the bar...?\")      So then, a few later, as you clearly see that my glass is bone dry, you stare and walk by smiling...Holy F*%k!!!!!!!!!  The I order another glass finally and ask for the check as well...Well, the check shows up, with the second glass of wine on it...but hence, the glass of wine is nowhere to be found.  I scan the table nervously...\"could it be over there, I ask?\"   \"Could it be under the table, I wonder????\"  Ahhhh, so as you come by to take my credit card as payment for this wonderful service, you also bring the missing glass of wine, which I am now forced to guzzle down (was a fan of the wine guzzle once...now, mmm notsomuch...)    Anyway, check this place out but by all means avoid the Friday lunch patio and this particular server as you will need to learn the wine guzzle too!"}
{"text":"I love the atmosphere of Alice Fazooli's, there are immense chandeliers covered in semi transparent cloth giving it a whimsical feel. There is also pipe decor on the walls, playing on classic and industrial themes. The food is delishous; you can choose between light(puttanesca) or heavy(ravioli) dishes depending on your diet. They also give you at the begining their fresh house made bread with vinegar and olive oil dip. The prices are good and service is prompt. I come quite often with my family or friends. It's good for small parties (came once as a birthday party-10 people). They also play black and white movies in the right area when you enter. Alice Fazooli's is one of my favorite restaurants and I recommend the butternut squash ravioli."}
{"text":"Took a client here because I've always found the one downtown not amazing but always good but was very disappointed here. Food was blech - just not good. I could tell others felt the same. And the service? \"Oh sorry forgot about your wine. We had to go find some new wine glasses because all the others were dirty. Really? On a not very busy Monday. Bummer."}
{"text":"A fun, easy family restaurant that's got a wide selection of good food with relatively quick service, for take-out or dining in.  Our kids love it!"}
{"text":"Just had a fabulous lunch! The service was exceptional. They made a special meal for my four year old bez what he wanted wasn't on the kids menu. I had the beet salad and it was delicious..the chicken was tender, salad crisp...can't say enough. My husband had the chicken alfredo and said it was very good..best he's had in a long time. My adult sons had the pizza-procuitto, arugula...said it was light and tasty..just would have preferred a little more cheese. We will definitely be returning!"}
{"text":"My wife and I used to dine there often. We moved from the area 2 years ago and returned to Richmond Hill last Saturday to have a nice dinner with a good friend. When we entered the restaurant we were greeted by \"Attila The Hun\". She informed us that they were booked and we would have to eat in the bar which we did not want to do. I pushed back and asked to speak with the \"maître d\". She looked on the sheet and said \"no problem; follow me\".  My wife ordered the veal paramagan and I ordered the seafood pasta. My wife's veal was way over cooked and my seafood pasta was missing seafood except for mussels. The music was so loud that we could hardly talk to one another and the management was not interested in turning it down.  The service was just OK. Whatever happened to the once good eating establishment. We felt it was run by a bunch of teenagers. Won't be going back"}
{"text":"Well I changed my usual Saturday brunch place and decided to go this place.   I was greated by a waitress and she directly took me to the bar area. She didn't even ask me where I would Iike to be seated. Probally coz I had a 2 Yr old and she didn't want us sit in the dining room because of that. Not cool. News for you.. I am not coming back to you guys and non of my friends after this.  At the table the other sever was nice and friendly. And I really appreciate the fact that she acknowledged my special request for making sure that food doesn't have any meat content. However the pizza she got me was dead cold and the pasta was okay too.  Two stars only for the server...food was below average I have had better pizza at Pizza Pizza.  For that price I expected a little more."}
{"text":"I went there on a Wednesday evening with some friends from work. The food we had was good, but, for the price, I would have expected a little more quality and taste. The desert was what disappointed me the most. I had their caneloni and they were not the best I ever had. On the other hand, one of my friend had a cheese cake (for 8$) that was really good. The place was really clean and I liked the decor. In the end, I felt that this place was slightly overpriced, but it can be a good place to meet people or organize an office party."}
{"text":"Pizza was below average, we ordered three pastas and all of them were tasteless. The mushroom rissotto qas really good, it was the best plate. Service is great and decoration is nice as well."}
{"text":"I wanted to try out this place so I went for a family birthday dinner,  Started with the appetizers, the garlic bread balls and grilled calamari, as per another review on yelp, yes the calmari was VERY rubbery, the garlic bread bread balls were swimming in a plate of grease, overall nasty. ~$15 for the two appetizers  For my main course I ordered the beef ravioli, for $18 you basically get 5 pieces of ravioli, the ravioli was nice but for $18 you get what amounts to a morsel of food. Do not go here if you are hungry. To the waitresses credit she heard me mention this and offered to bring the manager over but I declined.    For a fraction of the cost you can go to Swiss Chalet and get similar [ if not better IMO ]  food.  This was my first and last time at this place and would not recommend it."}
{"text":"Not bad, food is good. Nothing special. I had a salad to start and it wasn't that good actually. The bruschetta was good. The pasta was standard fare so nothing stood out to me about my experience there."}
{"text":"Good food and ambiance. The linguini primavera I'd very good. Portions are fair, not huge. I like that; I would eat more I'd there was more. Bread is good and drink selection is ok; they have Malbec by the glass. I eat here about 5 times a year when I travel for work. One of my favorite places to eat in Mississauga."}
{"text":"Not bad food. Had the pene pasta meal. Service was good, food was good and the price of the food was resonable too.  Would go back for sure."}
{"text":"2 stars only for atmosphere and mediocre food. Wayy overpriced, service is below average. After eating a quarter of my meal I began feeling sick. Would not go again. Nothing special!"}
{"text":"Came here for a friend's birthday dinner.  1) No one was in the front to greet us, we had to wander into the serving area to find someone to take us to our reservation  2) The service was terrible, very awkward and unpleasant interactions with the waiter. Anytime the waiter came by it was very cringe-worthy and abrupt. I'm not even sure how to explain it. However, the food didn't take too long to come. The waiter was asking us what we wanted for dessert without even offering us the dessert menu to look at. The waiter also dropped the cake in front of my friend said happy birthday quickly and walked away... very awkward.  3) The food was bland, a lot of my friend's complained about their meals as well. The portions are small for what you pay for, and very dry. The pasta was undercooked for most of us and was crusty and dry due to the lack of sauce in the meal.  I haven't been here in years because I remember not liking it the first time, but the service was poor, the food is overpriced, and the it tastes bland, dry, and undercooked. I'd recommend Jack Astor's or Mucho Burrito if you're in the area. Or Marcello's near Vaughan mills if you want Italian."}
{"text":"No respect for this restaurant. The female manager is rude. They always would make my grilled cheese with avocado and goat chesse for me. Now all of a sudden they are not going to for no reason at all. The manager was rude when she told me and said she doesnt care If I dont come back. Thats not how you treat a customer.  They do not care about the customers at all. Do NOT waste or time. Go to another location like Richmond Hill."}
{"text":"I have went multiple times since December 2009 now. They have greatly improved the service here. The waitresses/waiters  were dressed appropriately and I have had amazing service the past 4-5 times I have went.   You might be wondering why I have been here so frequently, but they have a great drinks special. Who can argue with $4 stellas and $6.50 martinis on Thursdays? As well as $4.50 for Heineken on Saturday nights? Good predrink for a Saturday night imo."}
{"text":"I've been here twice and both times were good! I especially love their angel hair dish. The bread that they served the first time came with a mind- blowing dip. A little pricey for me, which is why I cannot frequent this place, but once in a long while I would like to come here!"}
{"text":"Came here for lunch; ordered from the Savour York menu. ($15 prix fixe menu)  started with Mushroom and Sherry Zuppa - very nice mushroom soup. I would highly recommend it to people who like mushroom soup (this is the right amount of creamy-ness)  Entrée: Salmon Panino: Bacon, Cucumber, Radish, White Balsamic Vinegar, Dill,  Tomato, Salsa Verde Aioli  it was ok; different take on fishburger - fish was fairly fresh. I would`ve tried the pasta instead though.  Dessert: Tiramisu  I didn`t really like the deconstructed version - very strong coffee taste (which was refreshing) but i wouldn`t have minded if it was a bit sweeter. Raspberries as garnish, with a bit of chocolate syrup on the plate.   Service:   Server recommended pinot grigio from italy - white wine, which was ok. Except she served it in the same glass they use for water (looked like a candle holder). I didn`t say anything because i didn`t want to be mean (but next time, i`ll definitely say something) The wrong glass really put me off - even if i don`t look like a person who would know wines, servers should still make the effort to use the right glass.  Also, I asked to have my panino packed to go. The server took out the toothpick that was holding the sandwich together and now i have a fallen-apart sandwich. It's the small things that count when it comes to service. This server has definitely fallen short.   I`ll come back - the other time i was there  = 4 star (i went for dinner). pasta is amazing there so next time i`m definitely choosing one of those."}
{"text":"large spacious, dark atmosphere but nice expensive decor.  Food was pricey to obtain the 4 food groups.  Decline to spend $$$$, just arriving via Princess of Wales Prisscella, so opted for a simple multi leaf, blk olives, artichoke hearts salad with salad dressing switch of lemony/olive dressing instd. Of cheese and garlic dressing.  Actually, I asked for it custom made because I couldn't afford to eat anything else.  Pieces needed to be cut to bite size, because I was the last person to finish.  When I looked up everyone was staring at me, I embarrassingly responded alot of chewing, and do \"I look like an oriental rabbit yet.\"   A group of 5 theatre goers, out of 12 Roarred out laughing.  Breaking some silence.  Tea was nice and welcoming ~ $2.  T/t = $16.  Restrooms were dark and bit tight, clean & well maintained.  Needed to get some gut sticking wholesome food to fight winter frigid cold of that night.  Went straight home for hot tea!!!  Would not go again, even if someone else treats.  Other reviews not promising enough, not surprized if this business fails.  They better get a good chef or greater cooks ASAP!?!? Before it's way too late!!!"}
{"text":"Used the yelp check in offer!   Came here on a Thursday night with 3 others and we took advantage of their daily special which was $7 on select appetizers.   They were out of the crispy ravioli which was the yelp offer but the manager was kind enough to let us choose another appetizer of our choice. We got the calamari fritti ($11.58) instead which was really crispy and light and we all loved it. My cousin and I split the proscuitto arugula pizza ($16.24), cousin got the deluxe pizza ($14.83), my brother got a margherita pizza ($7) from the apps and we all shared an order of mussels piccante ($11.02). The tender mussels were complemented very nicely with their spicy, creamy tomato sauce. The pizzas looked and tasted really good especially the simplistic combination of fresh arugula and thin slices of proscuitto on a thin crispy crust. However, my cousin's deluxe pizza was dripping with grease and looked very unappetizing.   Our server was forgetful as she forgot to bring my cousin's drink and another bottle of water when we asked but was very friendly. We also requested for the food to come all at once instead of apps first which they were able to accomodate.   We did really enjoy the food we ordered overall but for what it's worth, this place really doesn't stand out to me with their food or drink menu."}
{"text":"Didn't come to this chain for years.    The Garden salad is fresh. The Seafood Fettuccine has shrimp, scallops, mussels, roasted red peppers, spinach, green onions, tomato sauce at $20.28.  The sauce mixed with all the seafood makes it a delightful dish.  The Chicken Penne Alla Vodka with Basil in tomato vodka cream sauce is good but I still like the Seafood Fettuccine.  We did not order the pizza but is very tempted next time when we visit as it has a very nice fire oven.  The dish size is large.  One of the daily special catches our eyes.  It is a wonderful deal for $60 Family Feast for Four. Includes: 2 Apps, 2 Entrees, 2 Kids Meals & Desserts, 1 Dessert.  You can choose from the followings: APPS: Large Caeser, Parmesan Chicken Bites, Crispy Ravioli, Classic Bruschetta ENTRÉES: Penne Arrabiatta, Baked Penne Carbonara, Chicken Parmesan, Tuscan Salad with chicken, Italian Burger, Tilapia DESSERT: Cannoli and any 2 kids meals including dessert."}
{"text":"Good food and reasonable service.  Ideal location for luncheon / business meting.  Liked thir lobster pizza :)."}
{"text":"We went to Alice Fazouli's not far from our home because we kept hearing that it was a great restaurant. Well it wasn't bad but it was also not that great a place for italian food. Maybe it is because I am half Italian and know how to make a decent spaghetti sauce and this makes me so picky. The food was rather bland in seasoning even though it was generally okay but there was  really nothing fantastic or out of the ordinary here.The service was friendly and efficient so no complaints there. As well to feed so many mouths (we are a family of five) it was really reasonably priced. So there are some definite pluses but I would not say that it is worth a visit because it is such a great italian place."}
{"text":"It is now called Scaddabush. Fresh pasta and mozzarella made in house!  The pasta and mozzarella were delicious!  My partner had a meatball sandwich that was fantastic. The meat was very well seasoned. We will return!"}
{"text":"My husband and I have gone here quite a few times. We did enjoy the food for the most part but over time we basically learned not a lot is made in house. Sauces for pasta, bread, desserts, and more, were not made in house. If I wanted preheated food, I could go to the store.  For the cost the food it should be made in house. My husband has food allergies and each time we went we would try something new to find out each time that they dont actually make it and that the box from the factory states \"may contain...\" warnings."}
{"text":"Service was great.   Appetizer was quite good. Dinner was quite alright.  Butternut Squash, as well as a salad. Desserts were great (Pecan Pie, and Cannolis) as well as fresh.  Definitely recommend going with App/Entree/Dessert.  For people that just go for an entree, you won't be happy because they're proper portions and you may not be filled.  Value isn't the best ($65 for dinner + tip) in the minds of some, but both of us were content with it."}
{"text":"I'm glad I came here, the servers are super friendly and welcoming. Our meals were amazing and we were also able to receive the complimentary fried Spinach Ravioli, which was so good!"}
{"text":"Mississauga is not a city for fine dining, but Alice Fazooli's was a good getaway.  I was here on business for a few weeks and I found most of the venues in the area kind of... boring.  AF was a nice break from bland.  The restaurant was very accommodating when I somewhat \"customized\" my pasta, adding some meat to the pasta arrabiata.  I would also recommend you listen out the waiters/waitresses for the specials (which are written around the restaurant).  I've tried the specials twice (I think) and I've been fond of the specials.  I'd definitely recommend coming here if you're in the area."}
{"text":"We went here as my SD's choice, I probably would have pulled out my trusty yelp app and chosen an Indy place.  The  Calamari was a little mushy, not so good for my preferences, so I  wouldn't do that one again.  I liked my  pizza ( no sauce, sausage, local artisan mozzarella, arugula, and a dash of lemon) I would have preferred a bit more lemon, but not a bad pizza.  My husband thought his pasta was just so-so and didn't have enough sauce.  The space is very Big, airy, open, but dark. You get the same service and menu in the lounge/bar as the restaurant, so what's the difference? The LOUD music.  I think the place gets a very average average, but I keep reading here about the good bread that comes with the meal, and we weren't given any so -1 star."}
{"text":"I hate when restaurants try to over inflate their own value. After going to the early show tonight my wife and I decided to go to Alice Fazooli's as we hadn't been in years. When we walked in we had to search for a hostess to get a table. We where asked if we had a reservation and of course as this was a last minute decision we didn't. We where a advised by the hostess there was a 30-40 minute wait to get a table (because they where too busy). I'm confused because there where multiple open tables in both the bar and restaurant.   I guess it will be another ten years before I go back!"}
{"text":"Ate here twice in the last month. They have a very delicious Chicken Risotto. Once we went was on a weekend and ate in the lounge area which was very noisy but we ate in the dining area on a week day and the atmosphere was really nice. Prices are reasonable and the taste of the food is quite good. Customer service is friendly as well. The restaurant is also very clean and modern looking."}
{"text":"It was a quiet Saturday when we checked in. The service was attentive. Both of our ravioli dishes were perfectly al dente and tasty."}
{"text":"Have eaten here before and been relatively happy with things.  But tonight, ordered the chicken risotto and got a soupy, drippy, soggy mess.  Ate a bit of it because I was famished and didn't want to wait 20 min for another risotto while my gf was finishing her meal, and expected a visit from the manager and/or to have it removed from my bill.  But alas, we were offered (and respectfully declined) free dessert, and were charged full pop for everything else.  Oh, and no manager visit whatsoever.  I expect better customer service for a downtown restaurant."}
{"text":"***2.5 Stars***  I met up with friends on Friday night for dinner.  This Alice Fazooli's location has been renovated and it is more bar-like dining experience.  The 5 of us where seated in a round table in one of the corners of the restaurant.  Food  Appetizer - Calamari - excellent, not greasy and side sauces.  Only downside that it could be a bigger portion to share.  Mains - Large Caesar salad - sub par, the croutons were nonexistent, the salad could have used a bit more dressing.  Fettuccine Di Mare - the seafood was abundant but the sauce was very watery.  An ok pasta dish, fresh pasta was not used.  Service  Unfortunately, we did not have great service that evening.  It felt like our server did not want to be at work.  He forgot to bring a bowl for our mussels for our seafood pasta.  He cleared plates while there was still food that we were consuming.  Side note - you can learn Italian when you head to the washroom.  I thought was neat.  Overall, the place is an ok night out.  Like all chains, food is ok as is the service."}
{"text":"Wow, Alize Fazooli's has really grown up. My impression of this chain was less casual then the décor and ambiance of this location let me to believe. This AF is all about warmth with the pizza oven blazing through, walls of Italian wines and rustic interior. But, this isn't some place to have a pizza and tutto bene. Dinner time, especially on the weekends, can be a zoo. This AF is in the same plaza as Moxie's and Marlowe's and Honest Lawyers so parking can be insane.   Interestingly enough, I have been to this location more often than not for lunch. It's quiet and just the way I like it. Space is large with tables, booths, high tables...seating preferences for everyone. There is a separate bar/lounge area which quickly becomes a waiting room at night if the place gets busy. Wines are extremely reasonable with the cheapest bottle being $28.   For lunch, they always give you a separate piece of paper listing the specials. I had the Squash soup which was warm and filling (great for a cold day!) For my main, I really felt like something hearty so I opted for the Chicken and Avocado sandwich...chicken, avocado, bacon, cheese wedged between soft Ciabatta bun. Yes please!   Our waiter was en pointe and even brought us a warm bread basket, which from my mom I heard, isn't something that always happens. Furthermore, when we asked for lime wedges, we expected only one or two, but we practically got two whole limes! Not stingy for sure. My mom, aunt and grandmother all had the Tilapia which was a good size. Two big pieces of fish covered in a cream-like sauce, served with Rapini and noodles. A filling lunch for sure!  In any event, I have been here once for dinner on Friday and it's like being in a zoo. Part of the reason why I'm giving this a 4 star most likely has to do with me being here on lunch time: not many people (when we went it was 3 other tables), attentive service, and great food (probably because the chefs had lots of time to perfect our dish). Would my review be different if I went here on the weekends? Most likely. In any event, loved this location. Great food and service.  14/30"}
{"text":"I came here during lunch and the place was pretty empty. The place is huge and offers a verity of seating. Over server provided good service and was quite friend as well as knew the menu.   I ordered their Pacific Red Snapper - Pan-seared Pacific red snapper filet with red chili butter, roasted potatoes, seasonal vegetables. The meal was great the portion size was a little small.   Overall decent experience."}
{"text":"It feels odd to review a chain restaurant... and I will start off by saying that I'm not reviewing the food (which is okay).  This review is strictly for the patio! You might not expect it from the entrance which is off busy Adelaide in the middle of the entertainment district, but it is a little oasis - full of plants, a stone courtyard and high walls.  A great spot for afterwork drinks... once the snow melts!   Not only do they have daily drink specials... Another bonus is going online and signing up for their e-mails to get extra offers."}
{"text":"was in the area and came here as an option.   was happy to celebrate a birthday here, and was content with the service.  it was pretty dead so the service was great, not sure how it would be if it's busy.  I was happy with the food, and I am not a big fan of fast food restaurants. would return again here but not anytime soon."}
{"text":"while this chain had never made an impression on me before (i.e. I completely forgot i'd been before), I was rather surprised this time at the number of options available and caliber of food. or, perhaps I was just famished at everything smelled AMAZING.  the FAZOOLI'S CAESER ($8) came suuuper spicy. I didn't even need to ask for it that way! it almost too intrusive as a drink with my meal, and the pickled green bean was weird as a garnish. the ice melted way too quickly, and ended up turning my drink way too watery. bleh!  the SHORT RIB RAVIOLI ($17.88) came with about 5 or 6 pieces but ended up being rather filling. there was a good flavor, but the meat was awkwardly pulverized. Not bad, but I think the concept it sounds a lot better than was executed.  the pizza looked amazing and the osso bucco appetizer smelled bomb.  we had a large group of 20+ people (how annoying, haha) and for our table of about 8, they managed to get the bills all correct, though I think our other tables experienced some mix ups. service is as expected, I would say for such a large group."}
{"text":"Came here on a Monday night so it wasn't that busy. I ordered the Seafood Fettuccine and it was so DRY! It felt like they assembled it ages ago and it was just sitting there until someone ordered it."}
{"text":"The food was really good - had the pumpkin ravioli. Delicious. Staff were inattentive and non responsive. Had to ask for the bill 3 times. Not cool."}
{"text":"The Service is a major issue at this establishment. After exchanging the pleasantries the server disappeared for quite a while (on our part we were still waiting for 2 guests but not even having water served to us after repeated attempts to get attention is unacceptable). The ordeal didn't end here and after our friends came over and ordered their drinks it took another half an hour to get our drinks!! Finally we order and then the wait begins and it goes on and on and on (45 minutes to get our mains!!!)  The portions were OK but the service is horrendous.  They have a special on drinks here which is a pretty good value considering the location i.e. pretty much all wines are 5$ for a 6 oz and with a flight of 3 for 10.95 (3 oz servings) and they had a decent selection to choose from all over the places (Italy, Australia etc. ) My friend had the pasta as mains and I had the pear salad (small serving) and rack of lamb. The food is pretty decent and a notch above the regular chain fare but the service really let us down. The place is huge and the decor is pretty good but all the money can't save your place if the service is sub par IMO. Dessert was OK as well we had the sorbets and Tartufo. Nothing exceptional but above average for sure.  The need to get their act together But rumor has it a condo is being built here so this company might meet its own demise."}
{"text":"I managed to drop $90 at this place last night for a very unsatisfactory meal. It says a lot when the free bread is the best part of the meal. The service was really slow and when they brought out our meals, they neglected to offer cheese and pepper.  I ordered the pasta primavera which was the most uninspiring pasta. I swear, pasta at the olive garden even had more flavour than this. It was in a soupy, thin vegetable broth which doesn't stick to the noodles at all so often, I was getting mouthfuls of plain fettucine noodles. I even used the dipping sauce that came with the bread to make my own concoction with flavour.  I had a bite of my partner's margherita pizza which was too thin and droopy.  After complaining about the lack of flavour, one of my last bites was a large chunk of garlic. I love garlic but usually when it's blended into the food.  As punishment for whining, I had to offend all those that came into contact with me with my horrible breath.  So the highlights of the meal was the beer, bread and the candy I took at the end of the meal to mask my awful breath."}
{"text":"We had to wait 30 mins more than our reservation time, so defeats the purpose of reserving the table. The food and ambiance is just average. \"We ran out of hot sauce/tabasco\" is the first time I ever heard in the restaurant of this size.  The service was really slow, and overall had an average experience."}
{"text":"The ambiance was nice and moderately upscale and the service was above average, but I was disappointed by the main dish (tilapia).  I'd consider returning, but if I do I'll definitely avoid the fish and just stick to pasta and/or chicken."}
{"text":"One of the best Fazooli's location. I work nearby and i go there for regular lunches and sometimes dinners. Great food! I customize my food to my taste and they always get it right! Service is good!"}
{"text":"I went here with my family the other night. We got parmesan chicken bites for a starter, and they were quite good. I would love to make them myself at home! For my main meal, I got the red snapper and it was a bit dry. I normally get salmon when I get fish at a restaurant, so it was just different for me getting the snapper. My husband got the sirloin steak and it was also overdone - he ordered medium-rare but got medium-well done. My son got the kids menu raviolis and he really liked them. He also loved that they have little Italian words to learn on the menu and wants to learn Italian now :-)"}
{"text":"What a let down !!!   I give it a two because of the calamari and fried ravioli but read to find out why....not because of the taste.   The whole night the server was missing. Maybe he was too busy fixing his man bun or something???? Our drink order was taken sooo late. My apps took forever. He was missing in between drinks and food and was too busy disappearing....like a magician performing the same boring act again and again.   First of all be sure to check in: you get a treat....hint Hint it starts with 'fried ravioli'.   That is always a nice surprise. My friend wanted fried calamari so the chef was nice to make that for us. Thank you for that.   Food was ok in the end but lacked in mouth watering flavours. But the extensive wait the entire night was too much.  We were thirsty and hungry too often.  We didn't even bother with main dishes.    Service makes a world of a difference"}
{"text":"We ordered Chicken Fettuccini and Sausage Pasta. I am a big fan of Pasta. The Fettuccini is pretty good, as creamy as I want but the Sausage Pasta is just so so even through it is one of the chef's choice. Generally, it is a nice place for light lunch or dinner and friends' gathering."}
{"text":"PAINFULLY  slow service ! Under cooked pasta, and a very average pizza - won't be going back !"}
{"text":"I came here with a group of people last night and it was really great.  1st:  We didn't have to wait in line and were seated immediately (we first tried going to Milestones and the wait was too long)  2nd: Our server was wonderful.  We were all ordering desserts and/or drinks and we had a lovely time.  We could hear each other speak and had a wonderful server.  If you are in the area and need a place that will accommodate a large group I highly recommend checking out this restaurant.  I just had a drink so I can't rate the food but everyone had a good time :)"}
{"text":"I don't frequent Alice Fazoolis as often as I used to, but things are pretty much as good as they used to be.  The prices have gone up slightly (inflation) and some things on the menu have changed over the years, but overall, its still quite good!  One of the best things about Alice is that the bread they give you is some of the best. Ever. I dont even like bread that much usually, and I will hands down eat this bread. Unfortunately, the server didn't bring us any, and we forgot to ask as well, so we missed out on some last night . Learn from my mistakes!!!  As for wine, Alice has a bottle of Pinot Grigio that is quite good for only $26. (Used to be cheaper, but still worth it with a couple friends!)   For the food, we had Spinach & Artichoke Dip, Veal Parmesan, and Prosciutto Arugula Pizza. These are dishes we hadn't tried on previous visits and were all very good. The dip was flavourful without being heavy, which is wuitw a feat when making a dip that includes cheese! Veal was cooked just right, with pasta and beans on the side. The pixza was flawless, as the two ingredients mingled together well on a super thin crust to make it gourmet!  Service is always pretty good with attentive staff who are friendly and super quick. Minus the lack of bread (last night), a good night out!"}
{"text":"Went to Alice Fazooli's with my bestfriend after getting our nails did. Since it was a lovely night, we headed to the patio lounge area. It was live with great music with beautiful baskets of flowers surrounding us. We had a very kind server who never rushed us the whole time and I found her gorgeous because she had this brilliant smile across her face all night. To start we had the grilled calamari putannesca it was light and delicious. My friend decided to have a glass of Lamberti red wine and she loved it! Even though I personally love Italian wines, I decided to get there Pesca Bellini instead and it was totally worth it. For my main I had the butternut squash ravioli and it was slightly too a la dante for me but for future I may ask them to cook my pasta a bit more. Personally I love my local Italian cuisines in Woodbridge area but this place wasn't too bad at all ;)"}
{"text":"Good place for an event, has a separate area for a group of 30-50, good for showers, birthdays etc. Nice atmosphere, a rustic feel, really good service. Came here for baby shower. Friendly greeter at reception, excellent attentive servers, got us tea and coffee before the food came.   For appetizer had bruschetta, it got a bit cold when it came, but the presentation is really nice and it's tasty. Main entree I got is a grilled chicken and beets salad. Fresh salad greens with walnuts and dried cranberries. Goat cheese was creamy and delicious even though I don't usually like goat cheese. Came with pickled beets and fried beets, I'm not a fan of beets so naturally I didn't like the pickled ones. The grilled chicken was a bit dry and cold. Overall the food was okay, nothing special, seems like fresh ingredients but just not freshly prepared. The service was okay but servers were sometimes awkward. Washrooms are nice and super clean!"}
{"text":"This place was okay.  I think I'd stick to drinks and appz, and go somewhere else for the mains.  I had the ravioli, my friends had the arrabbiata, veal parm, and penne alla vodka.  All so-so, particularly for $15+ for each.  And i wasn't particularly full after that. The service was excellent, attentive, friendly, and up for some banter, which I always enjoy. I had a few of the \"lust\" martini's, which had tasty mango juice, among some other stuff.  And, you just can't beat the cheap pints on Thursdays and Fridays."}
{"text":"This location is a lot better then the one they had in Mississauga (which shut down). Although it was not busy on the day I went (Maybe because it was a Monday) the overall atmosphere of this restaurant was welcoming. The serving staff took into consideration my friends food restrictions and offered her great choices from their menu. This showed me they were knowledgeable of their menu and the ingredients being used. The server brought out our food in a timely fashion and came back several times to ask if we needed anything. I can say this was one of the best customer  experiences I have ever had at a restaurant. If your going out with a group of friends or on a date this is a great place to go."}
{"text":"Very average restaurant and really just overpriced for the quality.  They give you free bread to start which comes out hot so that's nice.  I had the Calamari Fritti as an app which wasn't bad.  For my main I had the Mediterranean pizza - Grilled zucchini, eggplant, mozzarella, roasted red pepper, tomato, red onion, olives, San Marzano tomato sauce, fresh oregano.  Nothing special, just a regular thin crust pizza and it came out kind of cold.  On the plus side it came with a side salad :)  Ended with Ciambelle -Deep fried dough, sugar dusted, chocolate hazelnut sauce.  The sauce was really good for dipping the donuts, i basically cleaned the small cup it came in.  Also had the Cheesecake -Mascarpone, Amaretto, hazelnut crust, mixed berry compote.  This was a bit dense for my liking.  Note that it is MASSIVE and I would recommend sharing it with at least 2 other people!"}
{"text":"Went for a family birthday dinner.  The waiter was quite enthusiastic and they were able to seat us at a table which was nice when they originally told us we might have to sit in the tall chairs in the bar area (with younger kids in our group).  At the recommendation of the waiter, he suggested to order the Shrimp & Calamari Puttanesca which I think was the worst thing we ordered.  It was just seafood with a watered down tomato sauce on a dried piece of bread.  The main meal of sirloin steak also felt disappointing considering it wasn't much of anything special.  The desert of an apple dumpling was alright, again sold a bit too much, and was a bit messy when shown how to eaten properly.  It was what I expected from a chain like this, so I mean you know what you're getting into when you eat out."}
{"text":"Ate dinner here.  I think the menu is cutesy and they had plenty of options I was debating over.  I asked for the steak on the menu and they were out of that but had a another cut for the same price.  I really wanted the mushroom topping.  In retrospect I probably could have ordered the mushrooms on top of the special steak, but I got the seafood linguini instead.  I enjoyed it. Service was good, but I keep forgetting that iced tea in Canada is that Nestea from a fountain.  I like just plain brewed iced tea, but that was also my fault for not clarifying.  We asked for more bread and olive oil and asked for butter and received in all promptly."}
{"text":"Hit up this place for Summerlicious this year with my family. The food was great but a little bland, no real flavour. The atmosphere was amazing though so it kind of made up for it.  The server was nice but it was obvious he was striking up random conversation for tips. He started to talk to us about Toy Story 3... just because we were the typical 4 person family. Kinda got awkward.  Aside from that, the alcohol prices are UP there, and the quality of the house wine is not too well.  Overall, I only liked the atmosphere of the place. Everything else can change for the better."}
{"text":"Took my wife here for valentines day.  They had a special valentine's day menu starting with champagne and calamari taster. Next course was a delicious mushroom and sherry soup or choice of two salads.  Entree choice was a prosciutto wrapped halibut with veggies and potatoes or ricotta and spinach ravioli or a stripping with red chili butter, potatoes and studios salad.  We had the halibut and steak.  Both were cooked and seasoned perfectly.  For dessert we had some very nice cannoli  Overall it was a very nice meal with great service at a great price. $29.99 each. The only bad part was a bachelorette party coming in and being seated next to us who were very loud and ruined the atmosphere."}
{"text":"Been here a handful of times, I don't have much to say.  Every time I come here, it's just okay.  The ambience of the restaurant is nice, dimly lit, and it's an open concept kitchen so you get to see your food cooked in front of you.  For the most part, if they aren't too busy, you are greeted and usually seated right away.  I am usually seated in the booth seats, which are more comfortable and my preferred preference anyway.  I came here for lunch one time with a friend and had one of their sandwiches, which I thought was okay. Nothing special or spectacular about it.  I've also tried their Shrimp Angel Hair (Sautéed shrimp, roasted grape tomatoes and garlic, white wine, salsa verde).  I was actually a fan of this dish, surprisingly.  I've also come here another time for drinks and had their Rosso Sangria which is probably one of the best Sangria's I've had.  The first time I got the pitcher of Sangria, we had fresh fruits and ice in our cups.  But the second time we got the pitcher, we had a couple cubes of ice and little to none fresh fruits.  This is a big no-no for me as I like to have consistency.  I was thoroughly disappointed the second time around and did not want to be a prude and as for more ice and some more fresh fruits.  The only reason why I give Alice Fazooli's a 3-star is because the service here is not particularly the greatest and the food and drinks are pretty expensive.  If you're thinking of coming here for a full 3 course meal (drinks, appetizer, main course and dessert), be prepared to pay a good amount from your wallet.  The pitcher of Sangria was $26.. And as good as it tastes, that's all I'm saying. I might come back here from time to time for the drinks and POSSIBLY the food, but that's a big maybe."}
{"text":"Went with the family the other night.. reasonably priced dinner.   In terms of the ambiance, it was the same with all Italian restaurants...Nothing good to write home about. But that wasn't what I was there for.   Service was average. Forgot some of our orders of drinks and what not so had to order again, not a big deal. nothing really special   In terms of the appetizer, we order the spinach and artichoke dip. This came with a slight difference. They didn't provide any chips, but thinly toasted bread. It wasn't my favorite combination, but it wasn't that bad. I would give the appetizer an average grade.   The main course was pasta, what did you expect at an Italian restaurant. We ordered something that had some spice to it. It was pretty good. I can't remember the name of it, but it has chicken or some other type of meat in it....As you can tell, it wasn't that amazing or I would have remembered.   The item that I really liked was the bread to start. They provided the bread with an olive oil and spice dip. I liked it so much that I had seconds, and I never have seconds of bread. We were lucky , according to our waitress, because they just finished baking/heating the bread. It was very soft and warm when it arrived. I should have just ordered a drink and ate the free bread....would have saved me some money.   Overall, it was just an average experience.   Pro  Free warm, and delicious bread  Olive oil and spiced dipping sauce  Con  No chips with the dip just bland, like every other cookie cutter Italian restaurants out there."}
{"text":"First and foremost.... I hadn't been to this restaurant for a few years now... And it has gotten a lot worst than i had imagine.... I ordered chicken penne a la vodka... The chicken was not cut in proper portions, it looked as it it was hand shredded.... It was dry... The sauce was flavorless... There were spaghetti in my plate even though its chicken penne. Thats just sloppiness. I don't mean to  fuss but I'm paying 20 dollar for this simple dish, the least I expect is a little care in my food....  Plus, I saw one of the chef making salad out of a plastic bag, I'm old fashion, I cant say I am extremely comfortable having my salad shaken in a plastic bag.... Even fast fresh don't do that....  I'm never coming back"}
{"text":"I'm not sure if it was the -20 degrees that was keeping people away when I went, but don't let the emptiness on a cold day fool you, Alice has beautiful interior design, spacious seating in the dinning room and bar area, and decent food for a franchise. What's I remember most from my visit about he establishment is the awesome service I received: the waitress was friendly, cool and kind. She gave us the time we need to decide on the menu and brought the food out in a timely manner. The hostess was awesome too, she let me pick where I want to sit: I didn't want to sit in the dinning room with everyone else, I preferred a booth in the bar area with a window. There wasn't many people in the bar area, which gave me and my friend the privacy and peace we wanted at a public restaurant.  What amuses me is Alice's dedication to it's Italian origins: instead of music, they have a tape that teaches you Italian playing in the washroom.  I would most def come back to this Alice location for more fun times and ok food. They have a good variety in their menu, some even vegan friendly, I was more or less satisfied, but I wasn't too impressed with their pizza, but that was probably my fault for asking them to make it cheeseless: it was a tad too dry for me. BUT their house salad was good: fresh and crisp, AND washed, just the way salads are supposed to be!"}
{"text":"The service was excellent, our server was very attentive and great sense of humour!  The atmosphere and decor is beautiful.  The food was alright, nothing too special.  We had few appetizers, pasta, burgers, meat dishes and they were all mediocre.  The BEST though ironically is the free bread and dip, it is absolutely delicious we always ask for more and they keep bringing more and more!  It's a place I would go back but maybe once or twice a year."}
{"text":"I liked it. Service was fast and friendly. Great for a quick classy lunch.  My only complaint is that there wasn't a lot in terms of variety for a pasta - I was looking for a creamy carbonara type thing and couldn't find one.    They also make gluten free pasta substitution at no cost. It was cooked al dente with some tomato sauce and a spicy pork that was a perfect addition to the flavour.   We also got a thin crust pizza to share - it was a white pizza with no tomato sauce and just olive oil, cheese and some toppings. It was very good, and crunchy.   If you sign up for their mailing list, you'll get $10 off your first meal! So with all of that , $20 for two people at lunch was a pretty good deal."}
{"text":"This place was pretty good. Pasta cooked perfectly. I had the seafood fettuccini and asked for no mussels so they have me more shrimp and scallops instead! Great service, free wifi. My family is happy and full!"}
{"text":"One of my Favorite Italian restaurant. Seafood pasta is very delicious."}
{"text":"For the longest time I would see Alice Fazooli's as any other Italian franchise. However I was proved wrong last night when we decided to try them for the first time ever. Our server Paul was very friendly and he went the extra mile to make sure his customers are comfortable and well looked after.  We ordered Chicken Panini with fries, baked carbonara and ended it with canolis. Food was delicious with perfect flavours and portions. Being an Italian franchise I found Alice Fazooli's to be more of an authentic Italian restaurant than the ones that claim to be. I know for sure they'll be seeing us more often from now on and I recommend all you foodies to do the same."}
{"text":"This franchise is a hit or miss.  Quality has never been what the original was in its first years.  However if you order the right dish, it can turn out.  I had the chicken Marsala.  I almost never order chicken at restaurants, but this dish is prepared well, rich sauce and a proper companion of pasta Alfredo."}
{"text":"Sad to see that they're now closed because I really loved this restaurant. I loved the hot bread brought out to you in the beginning with their olive oil dip. It was so tasty and addicting. Every single pasta dish that I've had here was amazing. They have the BEST cannoli's I've ever tasted. Surprising since I've been to many Italian bakeries. Looks like I'll have to venture out to either Oakville or Vaughan if I want a taste of this goodness again."}
{"text":"Went for New Years twice in a row. I liked the food a lot, including the antipasto platter. I came back though because of the Bloody Cesar. So good."}
{"text":"Very bad customer service at the door The lady asked us to wait , I tried to talk to her, for the first time in my life I got the hand \"wait\" Then finally when she turned to me she said ( though half of the restaurant was empty) we are overwhelmed and YOU HAVE TO WAIT the worst ever costumer service I have seen they should at least learn how to deal with costumers before-working there"}
{"text":"We can here as a large birthday party as Dave and Buster's were unable to honour our reservation.   The ambiance is casual and fun, and the food was good. I call it Jack Astors with an Italian twist.  My friend made a reservation ahead of time, but they wouldn't seat us until we had more people*.  Not really sure way, it's not like they would give our table away.   However, when we requested to seat a few more, they were really accommodating, and tried their best to squeeze folks in.   Our server was really friendly. He joked around with us, and was really helpful in making this night a smooth one.   I ordered a Sangria pitcher to star ($22.95) and serves around 6 glasses. It was sweet and dry at the same time with a fruity taste.   I was disappointed to hear that today was the first day they will not be serving martini's anymore. But what I don't get is the huge promotion about $4 martini's on their website, and they hadn't changed the menu yet!*  Really unprofessional of them.   The menu is extensive, with lots to choose from.  They also offer Gluten Free pasta for no extra charge!*  For an app, I got the Crispy Ravoli. It was really good and good enough for 2-3 people to share.   For my main, I got the Parpadelle Bolognese with gluten free pasta.  All was good until when our meals were served, a bunch of waiters came out with dishes and just asked who had what.  No one specified anything, and 3 people around me also ordered the same thing.  So my friends got my gluten free pasta and already started working on it, when I got mine.  The funny thing was, they liked my gluten free pasta version better than their own!  For dessert, I had asked the waiter to help me out by giving the birthday boy a candle and a dessert.  Way to be discrete! He went up to him at the beginning of the meal and wished him happy b-day!  What I really liked was no fuss separate bills we requested.  It's done by seat, and he was more than happy to do it! Saved us from mass chaos and thinking at the end of the night.   Tip: go on the website and sign up for their mailing list to get $10 off your next meal  I was really happy that we had good food and smooth service for the night.  It was a stress free experience, and would love to come back! ----- *probably applies to all other locations"}
{"text":"Alice Fazoolis has been hit and miss since they ventured from downtown and hit the big box scene.  The consistency of quality is sometimes an issue.  At this location I have had mostly good experiences.  I particularly like the chicken Marsala and the Alfredo linguine.  Someone with us got a butternut squash soup to start.  I tried it and it shocked me how good it was.  Diverse flavour profile and just a enough cream.  I was also able to take advantage of Yelps check in deal.  My wife also used hers and our table got two orders of crispy ravioli."}
{"text":"My wife , kids and myself had a great dining experience here.  My wife loved the gluten free penne arrabbiata. My daughters loved the children's menu pepperoni pizza with drink and dessert. My son and I split the Italian butchers pizza   It was thin crust and tasted good.  And to top it all was the free appetizer after yelping Alice Fazooli's   We initially ordered crispy ravioli and then received a free order message on Yelp after my first time checking in at Vaughan location   All said with the coupon and non alcoholic drinks for everyone without tip came to just under $65.  We would definitely  eat here again"}
{"text":"We came here for date night, absolutely disappointing. We waited for almost an hour for our food. The server forgot to put in the order for our appetizer and she was missing the majority of the time, i had to go look for her and ask about my order. My chicken marsala was terrible, the chicken was rubber, the linguine was dry, and the \"vegetables\" is just green beans nothing else, at least add some salt to it. My boyfriend order the spaghetti and meatballs, not enough sauce, and for $20 the potion is way too small. he also got a mojito, it definitely sucked. All i gotta say is i'm never coming back here."}
{"text":"It is not my intention to give a poor review but my last experience to Alice Fazooli's was not something that was worth the value. We know that going out for dinner whatever the occasion is suppose to be an enjoyable experience that see exceptional food or at least decent food. As a family we come to AF's once and a while maybe 5 times a year for dinner to get together. The atmosphere is great and I like the feel of the decor of the restaurant. We had 3 different starters to share 5 orders in total: 2 calamari, 2 muscles and 1 Shrimp & Calamari Puttanesca. They were all very good, with the calamari I would have preferred a marina sauce but that is just a personal preference.  For dinner I had a pizza as I was facing the open kitchen and all I could see was the stone oven! I had the Mediterranean pizza with added spicy peppers. Overall, the pizza was bland and have very little taste or spice to it; very disappointing. The people who ordered 2 steaks at our table had to send them back as they were not cooked to order (undercooked). The two stand out dishes were ordered at our table was the Italian Butcher and the Chicken Panini.  The service at the table was top and that is something that half of the experience; unfortunately the food was not leaving us with a feeling of wanting to comeback anytime soon. For our next outing I will be suggesting another option other than Alice Fazooli's; they need to improve on taste and details."}
{"text":"The ambiance is cozy and elegant and the food is great.they bring you a basket of warm bread to dip in a plate of olive oil, italian herbs and balsamic vinegar. The pasta was great!I would definitely go back and recommend this place."}
{"text":"Had a horrid experience last week when I was there. The server's attitude wasn't professional, dropped our plates and glass hard onto our table. It just felt like he didn't care at all. I ordered the chicken fettuccine and it was sub par. Never going back here again."}
{"text":"This restaurant is a pretty good Italian restaurant.  Ambiance - I liked the Ambiance, it was a little bit loud, but we managed to get a booth which a little bit off in a corner - even though the restaurant was full.  Service - The Service was pretty decent, the wait staff was friendly, decently attentive without being overbearing  Food - The food was ok, it was not stand out in a way which would make it receive a higher score. In terms of food it was pretty much your run of the mill Italian restaurant, no better than say - Olive Garden. I went here because I wanted Gnocchi and they didn't have it. I was disappointed :(  I would suggest this as a place to go with your family, however, I wouldn't go very far out of my way to go to this establishment again."}
{"text":"I went here last night with a friend for some drinks and appetizers. The patio out back is gorgeous - very big with nice tables and a great ambiance - a nice oasis from the bustling downtown core.    We split the calamari and the bruschetta. The flour dusted calamari came with two sauces - a cream based sauce and a balsamic cocktail sauce and it was delicious. The bruschetta came in a bowl and you had to put it on the bread yourself. I found the bread very tough and bland and putting on the bruschetta myself was kind of annoying and there definitely wasn't enough for all the bread they gave us.   The food was pretty expensive for what it was as well. The one saving grace was the service. Our waitress Rebecca was great. She refilled our beer constantly and was always coming around to check up on us. Granted it wasn't busy but it was still nice to be doted on.   I would recommend this place for a cold beer on a hot day but not for food.   Also, if you want to learn Italian, they play introductory lessons over the loud speaker in the bathrooms!"}
{"text":"Went here for a little last minute outing with my co-workers. It's not bad. The hostess was very polite and friendly. Our waiter was really funny and helpful/knowledgeable.  I ordered a sangria and to my surprise it was actually good. I wanted to try something different and normally I don't prefer red wine, but this wasn't bad. I also ordered the chicken with avocado sandwich. It sounded good when I was reading it on the menu, but it was pretty bland. There wasn't salt and pepper shakers to sprinkle on my sandwich, but whatevs. I still ate it just cause I was hungry.  Atmosphere is nice. It wasn't that loud to the point where my co-workers and I couldn't hear. It's a nice hangout for an after work special with co-workers."}
{"text":"Well we definitely  left  with mixed emotions! We can honestly say that we are regulars here. We usually like the food the service and that they have gluten free options.... This time was such a different and not so positive experience.   The night began with us make reservations for a table Of 10!   Of course 2 of us automatically 'checked inn' into our Yelp accounts! To our pleasant surprise we were offered a 'free crispy ravioli' appetizer!  'Yeyy' we thought.... Not so fast..... After placing the order, the waitress came back a while later with some bad news... It appears though the offer is available, BUT only 1 per table... Although we had separate bills?  Yup!! Weird!! And it seemed none negotiable... Although we did our best to try and understand the thought process behind that idea... And did not see any fine print about that what so ever! 2 separate people. 2 separate accounts. 2 separate bills. (We might as well have been 'deprecate tables) after much negotiations, and the servers bringing us 2 anyways.....by mistake!!! we were all left stumped! And later the deal Was honoured! As a favour !!! Not because they messed up and had brought to our table Well thank goodness we don't have to pay for what was supposed to be free as a thanks?!?! For checking inn regularly  or wait... Was that a mistake? Ok who cares.... Wasn't that good anyways I was told! ( not gluten free)  Later on the children were served, well 2 out of 4... Hhmm what happened there? 'Oh never mind heres your food hunny,' don't be sad that ur friends are eating and you not! Wait pizza? No we ordered pasta! Ok, that's ok, it'll take 2 minutes to make! The waitress said, after my husband asked her, did u punch in pizza or pasta? Cuz he was the only one who wanted the pasta! 'Pizza' she said..... Well 2 minutes ok, we will wait...  And no kidding! It really took 2 minutes! So why the heck were the kids sitting around for 20 minutes earlier?   Oh here's your pasta hunny! Wait, it has red sauce, but we never asked for RED sauce!  uugghh ok just eat It since your starving!.......good thing we aren't allergic or anything ..... Later everyone's food arrived, it was nothing above average!  Or mediocre. Especially the gluten free pizza... Well it was supposed to be pizza... It was a long flat bread with literally a FEW veggies spread across it and cheese that needed a Magnifying Glass to find, and some chicken which I requested and paid an extra $5 for, on top of the fact that that bread, I mean 'pizza' cost $16, well that the base price, plus gluten free charges... Anyways it was tasteless! Cheep! And really embarrassing for something that was over $20.....(see pic)  The waitress offers to have the kitchen add more cheese and tried to accommodate us, especially since we mentioned were big fans of Yelp, earlier during the ridiculous crispy ravioli fiasco, and that ofcourse we will review our experience.... Yes they added more cheese, but was it melted!?? That is a whole other argument... So I ate me cold cheesy bread, with such disappointment!   Once the bill arrived, our waitress was 'kind enough' to point out that the gratuity has been added,  since this was a table More then 8, even though we had separate bills, and 4 were kids... Oh and also, she of course  did not fail to point out that the tip Was only 13% and not the usual 15%_18%..... Yeh:... Well.  The service was meh The food was cold tasteless and well wrong Our drinks arrived maybe 20 minutes after arrival. Maybe items are o we prices. And are not cooked well enough to hit the desired standards.  This visit was a fail! And the wine... Was cheep."}
{"text":"Our server was Casey and we were treated like royalty. He came by numerous times to make sure everything was okay. We ordered shrimp pasta and the margharita pizza, along with the newest salad they had on the menu. The food was amazing and all thanks to our server we were able to order the best items.   Would definitely come back."}
{"text":"I had a business dinner here a couple weeks ago. I can't say it's the best Italian I've ever had, but the food was good (although a bit expensive) and the service was fantastic. The decor is cool - we sat out on the patio on a beautiful evening - and the bar serves up some interesting chips with your drink.  I was totally annoyed by the live music - it was WAY too loud and would have been great if it was quiet enough to be \"background music\". I hate having to shout at my dining companions. I would've bumped them up to 4 stars had this not been the case.  We didn't do dessert, but I did enjoy a great grappa, which is a rare find in any North American restaurant."}
{"text":"I'm so sad that Alice Fazooli's at this location is closed and they stated on their website it would be called Scaddabush - Italian Kitchen and Bar (which hopefully is the same thing). Nevertheless, I want to give Alice Fazoolis (though closed) a review because it gave me a lot of memories.   Alice Fazoolis brings back a lot of memories for me. I grew up eating Chinese food all the time and Alice Fazoolis was one of the first restaurants where I was exposed to \"Western culture\" that's not a Swiss Chalet and basically GROW UP. Located in the East Beaver Creek plaza, you should come earlier or closer to night time because parking is ALWAYS difficult when you go around 7pm - 8:30pm.   The ambiance of the restaurant is really nice, it's kind of in the middle between casual and classy. But none the less, it's pretty good for date night. The lobby area is pretty large, and I like to go around 6pm, which is when all the seats are still available.   One of my favourite dishes are their Angle Hair Pasta. Did I mention you get oven-warmed bread, complimentary to your meal when you sit down. Yea, I know a lot of places do this, bu for bread to be oven-warmed?! Now that's rare. Mmmmmm. It literally comes in a basket with a cloth and delicious olive oil for dipping"}
{"text":"Waited an hour for our food. When it did come out, it was cold and mine had clearly been sitting in a warming drawer for a while, as my chicken marsala was incredibly dry. Waiter was very clearly new and had no idea what he was doing."}
{"text":"You walk into the restaurant, and you feel like a boss. When you sit down, you feel you need a flashlight cause it's dark. When you eat, you feel like you're finally happy. It's Alice Fazooli's...you're expecting a great time with friends and fam."}
{"text":"The atmosphere is warm and spacious and the staff is friendly and accommodating. We were off to a good start and with my appetite,  we were ready to eat.  However,  the food wasn't very fulfilling and big franchise restaurants like this one tend to offer quantity over quality style dinners.   My pint of beer was flat and had a strange smell, the calamari fritti was stale and dry,  offering a tiny slice of lemon and a small portion of boring dipping sauce, the baked Carbonara was decent and had a nice presentation.  I then ordered the Tiramisu which came in a jar type of serving.  At first glance,  I thought they brought me a pudding and you'll really need to dig to get to any of the actual Tiramisu cake portion which is a tiny layer near the bottom and was bland in taste.  All in all,  the food here is simply not worth the price and if you're feeling Italian,  put your money into something more authentic."}
{"text":"First and last thing you need to know: alice fazooli's has the best bread of life. It's freshly baked from the oven, stretches as you pull it apart and when it's dipped into the olive oil/herb dip they provide.. it's heaven.  The other stuff is pretty good as well - definitely a carb filled meal, if you ask me. I like the pasta. The sauce is good and it's super filling. The reason I like it is because it has gluten free options that don't taste differently from regular pasta. I had the carbonara, and I was full when I was not even 3/4 done.  The chicken panini is also grilled to perfection, you must try!  Service is alright, they're always smiley and happy to serve you- that is, if they can be found. One thing I love about alice is the interior, it's very dark and vampy with old fashioned lighting and seats. I'm into that.  I would recommend this for an italian meal!"}
{"text":"I really enjoyed the ambiance at Alice Fazooli's! We felt as if we were eating in Italy at the patio. The inside of the restaurant is very woody and full of wine racks. There are also lots of large tables that are perfect for parties! The bathrooms were a bit weird though. For some reason, they were broadcasting some Italian language speaking lesson...in a bathroom of all places.   One of the many things that I liked about Alice Fazooli's was their menus - the back of their menus featured photographs Vogue Italia photoshoots. Very chic. Service was good - our server was friendly and accommodating. As for the food themselves, we really enjoyed our pasta dishes. The chicken fettucine and baked carbonara that we ordered had great presentation! The baked carbonara was somewhat lacking in sauce but still tasted really good! The chicken fettuccine was also delicious. We finished off our meals with a nice bowl of vanilla gelato.   I'm looking forward to coming back here again to try out more of their dishes!"}
{"text":"Came here on a recommendation from a coworker. Pizza was disappointing but the wine was very good! We got starters of the egglant dish, artichoke, and tomato and mozerella. Nothing special. Our waitress Emily Ann was awesome! I'll return and try another dish."}
{"text":"The restaurant is going threw a change however, I really do appreciate the quiet environment it had to offer.   The food is great but the desserts are just to die for. Our table always orders the cheese cakes with lots of sauce and the cannolis!   The Caesar salad is full of garlic so watch out if your on a date night...   Servers are amazing!   Take advantage of their deals during the week and sign up to their loyalty program for 10$ off and a birthday 10$ off as well! Overall great place!"}
{"text":"Wonderful lunch ravioli, great price and location.  Service was okay but they were very busy."}
{"text":"Came here with a good friend a couple days ago. Spilt a butternut squash ravioli and the cheese and spinach dip. Really nice ravioli with sweet filling and well seasoned dough; cheese and spinach dip was salty and cheesy, but the toast that it came with was too hard to bite. Ask for extra bread to eat it with.   Waitress was nice and checked up on us but her manager asked us to dump out our Starbucks drinks in the middle of our meal."}
{"text":"Went with a large group. Waitress promptly served up the free crispy raviolis after yelp check-in. A few pieces were under-baked. Very slim fillings inside the raviolis, but it tasted like an addictive snack, with a tomato based dipping sauce on the side.  I haven't had alice fazooli's in at least 5 years because my first impression of the restaurant was that it was overpriced and the food was meh. This recent experience reaffirmed my previous experience. Minus the bread because they didn't serve bread this time.  They charge 17% gratuity for large groups."}
{"text":"I am giving this 2.5 stars.  I REALLY wanted to like it, I really did. I was so excited to try Alice Fazooli's when I first saw an advertisement for it in Jack Astor's. I love Jack Astor's, who doesn't? And a place like Jack Astor's that specialized in pasta? I was really excited.  When we got there it was packed and I didn't make reservations but I was seated immediately when we opted for a table in the bar. The waiter was very knowledgable and helpful and I liked the cups that the water came in, they were the wine glasses without the stems!  Our waiter told us how the pasta was shipped from Niagara Region and how there was a famous chef there that night (I'm not a big enough foodie to know who it was). Anyways, that got me even more pumped for my meal.  My boyfriend ordered a sausage pasta and I got a chicken linguini on the menu. His honestly tasted like an overpriced can of beefaroni, only a little worse, and I disliked mine so much I didn't even take it home.  It was disappointing but our server was really great and although I didn't try the drinks, I think I would revisit for dessert and drinks in the summer. He said the patio was really fun and I'm willing to give that a try in the future."}
{"text":"Alice Fazooli's is overpriced.  There.  I said it.  Even if the food was amazing (which it's not, it's just average) I'd still say the place is overpriced.   The staff was friendly.  At first our waitress seemed to have trouble understanding what we were asking, but maybe it was her first day.  Eventually, once we got rolling, she did as well and everything after our initial confusion went smoothly.  The atmosphere was ok.  Not great.  Not awful.  I think I just felt a bit cramped in my seat.  Oh, and there's one of those awesome projections in the bar where you touch it and stuff flits towards your hand.  It's onto the lounge table.  You'll know what I mean when you see it.  And those rumours about Italian on tape in the washroom?  All true."}
{"text":"I've been to a couple other Alice Fazooli's locations they were excellent. When I was asked to pick an Italian restaurant for a group of friends to go, I unfortunately didn't know many places in the area. When I found out there was an Alice Fazooli's downtown, I thought I was all set!  I think most of my party enjoyed their meal, but I was disappointed paying $20+ for a fairly small portion of mediocre food. Still worth a shot, as I was probably just unlucky this night. However, I won't be back any time soon.  If you decide to check it out, keep an eye on their Twitter account (http://twitter.com/alice_fazoolis) before you go, because they occasionally give you some deals. (We got a free appetizer :)"}
{"text":"I went here with my sister and my brother-in-law for his birthday and ordered the chicken risotto amongst other items. The chicken was very bland and had zero flavor so I took all of it off the risotto. The waitress noticed it and notified the manager who immediately came over to our table, apologized and took it off our bill for the night.  Though the food was just about OK for me, the music (I think they stole a playlist off my ipod) and the customer service made me give Alice Fazooli's an extra star."}
{"text":"Good food with a good bar & very good drink specials. Since this place is overlooking Mississauga's downtown they do a bustling business with a young crowd and high noise level. Overall the service was solid and professional, food quality and presentation was very good. If you like the 'scene' and being seen it's a easily four stars, I am not looking for that but can still appreciate it for what it is."}
{"text":"For the price, this joint is definitely not worthy. I HAD been there a few times and what I had found consistently was that their food (especially their steaks) were really a little overly plain. Talking about underwhelming dinning experience, take their steak for example, they basically serve a plain steak with some real lackluster sides without any sauce of any kind for the steak; everyone can make steaks, it is the sauce that sets one restaurant from another. Their service was also horrendous. On short, I expect more for what I paid for."}
{"text":"Alice doesn't live here anymore... and neither does the good chef, I suppose.  Stopped in for a business lunch for the first time in a long time.  I was looking forward to a good meal at a good price.  Today was not going to be my day.  I ordered the Seafood Fettucine for around $20.  I asked to substitute the fettucine for linguine, and the request was cheerfully granted.  The mussels were tender and fresh, but that's where it ended.  The shrimp and scallops were small, chewy and flavourless.    An overall good experience was marred by a poorly executed dish.  At $12 I couldn't gripe, but at $20?  That is a premium lunch price so the disconnect is large. I still give Alice an extra  star for past successes--I don't recall having a bad meal there before this."}
{"text":"We really enjoyed our Saturday lunch at this establishment. We sat in the bar area. We ordered calamari and shrimp puttanesca which came with nice grilled bread. It was delicious. Our mains were a whole wheat penne with meat sauce and meat balls as well as the Atomica pizza. Both were excellent. The atmosphere is very pleasant as was the service."}
{"text":"My co-workers took me out to celebrate my professional achievement one day on a Friday afternoon. It was a beautiful hot summer day and the light spray mist on the patio came in handy and so did $4 heinikein pints!!  I LOVED the food! I had Seafood Campania - it was a HUGE dish and when i first saw it i thought theres no way i will finish it. But it was SO GOOD that i emptied the plate in about 7 minutes!!!  Ok, PROMISE you'll have their Strawberry & Chocolate Tartufo!!! It's to die for!!! Im not even kidding! Im not big on desserts but that thing was so darn good!  Service was super friendly! When our waitress found out that we're celebrating my promotion, she brought me a glass of champagne at the end on the house!!! It was soo sweet! :)   LOVE Alice Fazooli's and will DEFINATELY be back!"}
{"text":"Went there on August 24th, 2012.  It was just my wife and I for dinner.  I ordered the quattro formaggi and to my surprise didn't contain any cheese. I don't know if they are pre-made however, it lacked to say the least.  My wife ordered a talapia with some angel hair pasta which was very nice and tasty.    Our waiter and waitress disappeared for approximately 30-40 mins while there were another three tables out on the patio.  I Wasn't to impressed by this point as I wanted another drink and  my bill.  Upon his Highness' arrival (waiter), he inquired how our meal was as he was clearing our table. Had he been around during our meal to check in I would have sent it back, but seeing as we had a movie to catch, I thought I would let him know that it was the worst pizza I have ever had.  To which he responded with a very ``dumb and ignorant`` sounding ``OH was it and shrugged off my complaint.    Since my visit to Alice Fazooli`s in Vaughan, I have sent in a formal complaint to their costumer service department who has assured me that the manager would be in contact with me.  Standby for further update!!"}
{"text":"My friends and I decided to check out this restaurant because we had made plans to see a movie in the same plaza a few hours later. After calling ahead and securing a reservation (to ensure we would make the movie) we got to the restaurant promptly. We were seated quickly and given menus and that's where the visit went downhill. Our waitress was so impersonal and absent, not concerned in the least about checking up on  us, refilling drinks or even clearing dishes.  We ordered apps about 10 minutes after sitting down. about 15 minutes after asking for a few more minutes to look at the menu she finally came back to take our entree orders.  Our dirty appetizer dishes sat on the table for a good 15 minutes after we were done before she came back and said.. oh you're done the apps.,, okay,, and removed them.  We waited 50 minutes to get our food... almost an entire hour. No apologies, no sorry the kitchen's backed up, nothing. We finally started our entrees, My chicken caesar salad was just okay, way too much dressing. My party wasn't overly impressed with the food either. One in particular said her streak tasted like it had been sitting in a warming drawer for 10 minutes.  After finishing we waited another 10 minutes before she realized oops they aren't happy let's give them some luke warm/cold desserts. While I appreciate the gesture, it was much too late. Because she started giving us desserts, we couldn't ask for the bill promptly.  We had to wait till she came back again to ask, and because of all that.. we missed our movie. Super glad we didn't pre-purchase tickets as they would have been useless.  LESS than impressed with this sub par visit.. will definitely not visit again.  .5/5"}
{"text":"We had two private events at this location on the same day. One lunch for about 45 and one dinner for about 30. The private room they have seats about 40 comfortably.   The management team was great to work with. Prices were very reasonable. Food selection and quality was great.   There are a few items for improvement. The waitress for the lunch seemed pretty stressed. She was excellent and worked really hard for us but I was worried she was going to quit.   For the dinner - the waiter started taking orders in the middle of the presentation. That was kind of a pain and distracting for both the presenter and the audience.   Overall - if you're running an event - highly recommend."}
{"text":"I'm not a huge fan of Italian food... I don't see the big deal about it all. I do know good pasta, I've had it home made, home cooked, delivered, taken out, etc etc. I went here for lunch with my firm's partners (after passing the UFE. everyone should know. I'm a big deal! hehe) around 1230 and we ordered the calamari and bruschetta appetizers and I had the Veal Parmigiana. It came with two LONG pieces of boiled carrot, two LONG pieces of boiled broccoli (where do you even get such long pieces...), some linguini and the veal with cheese and sauce on top obviously. Nothing impressed me... the veggies weren't salty at all, no flavor. At least boil it with a chicken cube or something! The veal was slightly dry and not juicy inside AT ALL. The pasta was very very very bland. MEH.   The bruschetta was ok but the bread was a little dry and there wasn't enough cheese! and you have to make it yourself....so I have to be purposely \"modest\" with how much I put on my piece. Tsk tsk... the calamari were pretty good! The dipping sauce was delish.  I don't think I would come here again, unless someone is paying for me. Again."}
{"text":"Great Service, pleasant waiter, and good food. We will return again.:)"}
{"text":"I have come here three times and my most craving item is their house-made bread with their house-made sour olive oil dip.  I hope I could just simply go there for their bread and dip only.  I tried their pasta, pizza and the entree items.  I would stick with the pasta and pizza from now on.  I went there on recent Mother's Day.  Both chicken and fish were made too dry and flavor was a little bland.  Green salad was really meh but healthy enough.  Our service was a bit too slow but our server was always wearing a smile and she made up for the slow service :)  I like that they provide kids menu.  Kids are given drawing paper and crayons to kill time.  I will bring my nephews here for their pasta and pizza and of course mainly for their bread myself :p"}
{"text":"Alice Fazooli's is what Milestones, Jack Astors, Tipsy McStaggers, et al should be; a chain sit-down restaurant that actually services food you're not eating merely because you're here with 8 coworkers or it's some place that won't offend your parents but menu prices are high enough your parents feel like they're treating you to something special.  I had the Italian meatball sandwich with fries. Considering you get a nice bread basket to start, the $8 price tag was an amazing deal. The calamari, while not the best I've ever had, certainly rates for those looking to get their dose of fried goodness.  Decor is earthy. Booths are great for intimate conversations with your neighbor about leaking condo penthouse units but not so isolating that you don't feel removed from a lively downtown eatery.  Service was good if a bit uneven. Nothing major, really.  They do soak you a bit for the draft. $8 for half a pint?   This would probably be a 3 star review if it weren't a chain but it manages to rise above chain blandness, pulling off a PF Chang's in the world of Italian.  Okay that said, I need to get this story into the official history. It was roughly 1991. I was working as a DTP person at SunLife downtown. It was my first job out of university. My coworkers and I heard about this new restaurant called Alice Fazooli's. It was going to take the downtown dining community by storm. Toronto was also still in the grips of the 1991 recession. Downtown restaurants had seen their lunch crowds melt away and a new player on the scene was not welcome.   The Investments Systems Support crew took in lunch at Alice Fazooli's during its opening week. The food was great. They had aligator on the menu back then. The meal was rounded out with some pans of buttery garlic bread. Even after a nice meal we were ready to tuck into these pans of bread. As we broke the bread, hundreds of live red ants came pouring out of the bread and crawled all over our table and food.  WTF?  We couldn't believe what we were seeing. We called a waitress over. She seemed at a loss as to what to do. A suggestion to maybe, at least, remove the ant infested bread seemed ignored.  A manager took charge. Here's what he was going to do. We would have to pay for our meals. But, for our trouble, he gave us all coupons for a free dessert upon our next visit and purchase of a meal. And the coupon had to be used within a few weeks.  Errr...  Like good Canadians circa 1991 we paid our bill and graciously accepted the nearly worthless coupons.  Clearly another restaurant tried to sabotage AF's opening week. But I still think back to that day and wonder how we could have been so meek and complacent that we wouldn't have pointed out half our table was ready to vomit and they still wanted to charge us? For serving us living ants?   That said, I'm happy to see Alice Fazooli's, a decade on, is no longer plagued by ant bread."}
{"text":"Well, that was a first. I've been using OpenTable for a couple years and no restaurant as ever failed to register me as honoring the reservation. Alice Fazooli's didn't. Please beware when reserving with OpenTable for this location. When you check in, double check your OpenTable arrival has been acknowledged.   Other problems. My date and I both ordered the porterhouse steak. Mine was cooked to my order: medium rare. My date requested medium well. Her's came out medium rare as well. The waiter took it back for a bit more grill time. Meanwhile my meal was getting cold...  The steak itself was chewy and unpleasant. The waiter suggested the steak with the red wine sauce. It was a mistake to go with his suggestion. It pretty much tasted rank.   Really, really disappointed with this location. Try Earl's next door or visit the better managed location in downtown Toronto."}
{"text":"Food was okay but each time I've been here, I've been either not greeted or simple just not seated at all. Twice, we've actually just seated ourselves because no one came and the server just said, sit in there and I'll come find you. Terrible. What the heck do their hostess do??? I've come to them multiple times and it's happened each time."}
{"text":"I was a little surprised at the prices, considering it's a chain restaurant.  The food was okay, but certainly nothing special.  Like I said, it's a chain.  I did like the decor.  It was a nice place to enjoy a drink or dinner."}
{"text":"Food was good but the portions were tiny and most of the dishes were expensive. At those prices I could've gone to some of the other restaurants in the are and had the same food but much cheaper."}
{"text":"Came here yesterday with family. We accidentally missed our reservation time but the host was great and the place was empty at the time so we lucked out. The ambiance is nice, we were seated at a large table in the back.  To start off we got a pitcher of the Bianco sangria which was delicious!  I got the chicken caesar salad. Yes I was THAT person who got salad as an entrée. BUT it was good. The chicken was grilled, fresh and the lettuce was nicely dressed.   We also got the atomica pizza, salmon, and butternut squash ravioli. The atomica was a delicious thin crust pizza with tons of toppings. The person who got this definitely liked it. The salmon had a crispy crust and was nicely seasoned. It came with risotto which was a bit too creamy. But still delicious. And the butternut squash ravioli was sweet with a creamy sauce. The people who shared this dish enjoyed it as well.   Overall, it was a great meal!"}
{"text":"This is not the first Alice Fazoolis'  I've been to but it will certainly be the one I do not return to. While the food is still great- the service here leaves a lot to be desired.  When I saw this place first, I was thrilled ; I am a fan of Alice Fazoolis and this one is 5 minutes walking distance from my work, perfect for our after-work -payday drink nights. The group that visit range anywhere from 5-15 people - which is not a huge group but should certainly take some priority in serving because there would be larger share of tips and it's also more work. But we're a jolly happy crowd, happy to tip you as long as you actually serve us.  The first couple of times, we were left to wait in the hallway for a table to become available. Because were only only planning to drink, seating us in the dining room was not an option. The front of the house(maybe even the bar) manager actually gave us lip because he promised us the lounging area in the front and 40 minutes later we were still standing around looking like lost children.  The third time however, the service was rather good, we had a jolly time and reconsidered this spot as the place for drinks.  The last couple of time were horrible.  We were in the patio, which was awesome. Our blob of a waitress brought the first round rather quickly but, after that? was MIA for our table - she made extra effort to walk far around our table to avoid us, to serve the table next to us. I mean, our orders were not difficult :9 Stella and a guiness - is that too hard to remember?  It got to a point where we were individually going inside to request our drinks. We had to do the same for the bill.  I love Fazoolis food - over any other I love it. The service here is a hit and miss always, and it's without gray area - it's either excellent or absolute horsepoo. Which really doesn't help in having a relaxing time with your friends when you're chasing after a blob to get your pint.  This isn't to say that I will never go to a Fazoolis' but in that small block, there are similar and better restaurants all around - so Eeek, Me thinks not, is right."}
{"text":"What to do with Alice?  One aggressively-thrown beer bottle away from ClubLand, this is a restaurant trying to be many things at the same time and doing so satisfactorily.  It's kind of a restaurant, kind of a lounge, and kind of okay.  The restaurant area is a decent eatery space, ample seating with knowledgeable staff that will take you through a fairly unchallenging Italian restaurant.  You can take parents, aunts, and uncles here without any concern of overwhelming them.  The food is straight-forward, simple, and tasty enough, but nothing that you couldn't find elsewhere in a smaller family-run restaurant elsewhere in the city.  Proximity to the clubs has its consequences I guess.  There's also a lounge area at the side, darkly lit, with a DJ spinning if you get there at the right night at the right time.  The attempts to be chic and hip are apparent, with the same menu available as in the restaurant, but with a stronger drink focus on martinis.  Would you expect anything less?  It's a decent eatery, and okay lounge, but nothing to make you pick up a pen, get out a sheet of paper, and write \"Dear Mom and Dad, I hope this letter finds you well.  I was at the most amazing place last night...\""}
{"text":"My wife and I had lunch here, found the food tasty but very italianish, duh, it's an Italian restaurant.. But, that's the problem. I personally find these places a bit too predictable. They have a great 4 - 7 pm apply special that is worth checking out. I would only be back for work functions. Don't get me wrong, it's nice enough, but I would rather go here if someone else is paying.. I am just funny that way with Italian places."}
{"text":"Stumbled in here when Jack Astor's beside it was jam packed at 5:30pm! WTH.  All we really wanted was a beer and some food, so we decided not to look any further. It took a while to get us seated, even though the restaurant was empty.   Once seated, the service was quite good. We ordered our drinks and food altogether and everything was quick to come out. They have Perroni on tap! Nice bonus. One of my friends ordered a Keiths and he said it was really flat. He asked for a replacement and they were more than happy to.   I ordered the Chianti Sirloin Steak. So good! The potatoes were so delicious and the steak cooked nice, and the mushrooms and sauce were excellent. The green beans were really bland and sad though. Average price for a steak, $24.95. The portions were a bit small too, although I was extra hungry that day.   I wouldn't say I would go out of my way to come back here, but if someone suggested it, I wouldn't oppose."}
{"text":"First of all, Kudos needs to go out to our waiter (David) who provided us with exceptional service.   The food was really good generally. The portions were of a reasonable size and they have an extensive menu providing me with a challenge when figuring out what I wanted to eat. Complimentary bread appeared homemade and was very delicious. I had the winterlicious 2014 menu. The Caesar salad had quite the bite to it which I wasn't expecting but not overly so that it ruined the overall salad experience.  The main - chicken fettucine was also adequate. It was a good portion with a nice blend of flavors. The dessert was a perfect ending to the meal.  So why only 3 stars? One star was lost because I was seated directly under the coat rack, to the point that my head was leaning against some stranger's coat (who puts a table there?). Our meal was also occasionally interrupted by people strangely wanting their coats! There were plenty of other available tables so I can't explain why we were placed at that one. The other star was deducted because a very detailed winterlicious menu failed to mention that the Caesar salad with 'garlic, croutons, and parmesan' also included bacon bits. Thankfully, I'm not a faithful vegetarian but I have enough friends who would have been bothered by this exclusion that it deserved a mention in this review.  Overall, it's classier than some of the other big name Italian chains and overall a good place for a semi-romantic evening up to a fun-night out with friends and if someone told me we were going there I wouldn't complain. However, will I suggest to a group that we go there? Probably not."}
{"text":"I had arrived for a dinner with family on a Saturday night to eat at Alice Fazooli's for the first time ever. The decor is extremely nice and the menu is well described. Each dish on the menu. Is worded to make a person who is hungry want to try everything.   Our waiter was extremely nice and helpful with eveything from asking how the meal was to refilling drinks and packing meals at the end.  I had ordered the Baked Carbonara, and I must say, beware this dish. The dish is extremely salty and the bacon in the carbonara pasta doesn't help the salty taste. It was difficult finishing the second half of the dish. Good service but very disappointing food."}
{"text":"I just finished playing some volleyball and was looking to get some drinks and food. I decided why not give Alice Fazooli's a try. We were seated and began to look at the drink menu. A little pricier than other places and they didn't even have drink specials on any day except for Thursday. I ended up splitting a pitcher of Rickard's Red Beer with a friend and sharing a pitcher of Rosso Sangria (red). I know splitting 2 pitcher would mean that I was going to have a great night. Boy was I right!!! I got a bit of munchies and decided it was time to eat. I ordered the Grilled Chicken & Avocado sandwich with a Caesar Salad. The food and drinks were great. The service was good up until the server forgot to change the channel to Hockey when my friend asked him. We sat there for about 20 minutes and then we realized that he forgot about it. \"Sooooo.....Hockey's not on??\" He finally put it on. But overall a decent night. Jimstar out!!!"}
{"text":"I went there with my friend. She love the mussel appetizer here. I order a medium rare steak and caesar salad, the steak was salty, when I ask for re cook it, they changed the other one for me. The salad was good as well. I like the mussel sauce."}
{"text":"Food and service were great! Caesar salad with large crispy croutons and bacon with nice creamy dressing. Sirloin steak was excellent, tender and juicy with little fat. Good size portion. Ambiance was nice and the music not too loud making dinner chat easier."}
{"text":"Wonderful service! The waiters/waitresses were very friendly. The food came to our table in less than 10 minutes! The food is quite cheap as well.  I've come by a few times now.  I thoroughly recommend any of their pizzas, the seafood fettucini, their pennes, or chicken risotto.  However, was not a fan of the shrimp angel hair pasta.  For dessert, i had the marscapone cheesecake - which was rich and delicious.  However, make sure you have someone to share it with you, or it will be too much.    For drinks/cocktails, I really enjoyed the Dolce Diva - a mix of Smirnoff Orange Vodka, triple sec, fresh orange, lime and cranberry juices.  It was absolutely delicious and the sugar coating on the martini glass was a great extra touch to it."}
{"text":"A decent Italian-ish at a decent-ish price. The place is one of the better box-on-a-lot restaurants and this particular location has a fun vibe.  Our group of 11 year old hockey boys enjoyed their chicken fingers, while the adults dined on more exotic fare. One small piece of feedback is that for these kinds of groups, the standard make 'em-linger-before-you-bring-the-bill-to-see-if-they-order-dessert service style just doesn't work with a hockey team. No lingering - no delay of game. Get 'em in and get 'em out.  But other than that, a good dining experience and we would return with or without a hockey team ...."}
{"text":"Went here for a friend farewell lunch and was greeted by friendly staff and was kind enough to let us maneuver the tables to accommodate out whole party. The menu was not really eye pleasing but I managed to figure what I want.   I've decided to go with the bake cabonara, and eat was delicious. It didn't look a lot but boy did it stuffed me up. It was penne pasta with fettuccini sauce with bacon and egg on top, sounds disgusting but it was a delight. The presentation and the speed of the food was decent but I can't complain.  The only downfall was that it took a while for them to get the receipts correct. Human error it happens, but because of it we were all late back for work. Other than that no complaints and prolly will I back for the same entree again."}
{"text":"In town on business and ate there tonight. Bartender was a lovely young lady named Stephanie, and it was her first night working the bar. From listening to the other people working there, somebody else had called in sick, so Stephanie was working overtime handling orders at the bar and from the other servers. Regardless, great service from her and the people who brought my food out. Had the sirloin, which was fantastic, as were the vegetables that came with it. Also had the bruschetta, which was better than I've had anywhere else. Very good cannoli for dessert. Impressed, and was sure to tip well. When I come back to Oakville, which is otherwise a fairly bland suburb, I will definitely come back here to eat. One note, you can walk to it from the Marriott, but it's a little risky, especially when it's icy."}
{"text":"great food!  Always busy.  I recommend a reservation during peak times, or special days, like mother's day etc."}
{"text":"Had a group of 6 here for dinner. Fast and attentive service. Has salmon dish that was prepared perfectly. Nobody walked fro the table hungry."}
{"text":"Good for a decent dinner or with a group of friends when no one wants to spend too much.  Chillax place, sometimes theres a live singer."}
{"text":"Great place to go for the daily deals, food/drinks are ok for the price.  Mascorpone cheesecake is to die for."}
{"text":"I've been pretty happy with the food and service at Alice Fazooli's. It's par for the course with the several other restaurants in this plaza.  Italian food + wine. Gotta love it.  I recommend: +Tuscan Tenderloin: It's a goooood piece 'o meat. +Whichever fish is on their seasonal menu. I was quite pleased with mine.  I (half) recommend: Chicken Risotto: I've had it twice. The first time I ordered it, the risotto was a little \"dry\"(?). The second time I ordered it, I was much more pleased. Creamy and rich like it's supposed to be.  Other notes: Parking is tough around here even though it's a shopping center. Don't get frustrated though. People are going in and out at all times."}
{"text":"They were at about 60 percent full while we were waiting for our food. Server was fast got us our drinks and took our order. 45 minutes later she came and apologized for the long wait and told us the food was just starting to be prepared. We almost walked out adder waiting another 20 minutes. The food arrived and the pasta was dry and hard, the carbonara was overly salty and risotto was mediocre and definitely not worth the price. The server apologized and that was it. The excuse was that two of the cooks called in sick, but we should have been notified when ordering.   There are other restaurants with better products, especially considering the price at Alice fazoolis."}
{"text":"Started off with the ravioli fritti appetizer. This first dish set the expectation for the other main dishes. Just like everyone recommended the ravioli fritti's were addicting. If I had these at home I would be downing them like popcorn. They're just so yummy (5/5 stars). For the main dishes got the Butternut squash ravioli (4/5 stars) and Fettuccini Alfredo (3/5 stars). The first few bites were awesome but as I kept on eating the flavor started to get a bit boring.   The place was pretty packed during lunch on a weekday but service was still good. The overall experience was great and I really want to give this place a higher rating but when compared to places like Remezzo I just can't justify any higher than a 3.5 star overall rating."}
{"text":"This is the first time using a Yelp check-in promotional offer. It allowed me to get crispy ravioli appetizer for free. Thanks Yelp!  It was alot simplier to claim than I thought. When I showed the check-in offer to the waiter he said that he has seen this offer before. No questions asked and the free appetizer was served which is normally a value of $9.84  The crispy ravioli were just as good as the first time I tried them in the Richmond Hill location. A nice crispy caramelization on the outside. I could eat these all day long.  Tilapia with a creamy tomato pasta $20.66 - Everything tasted good. only complaint is the angel hair pasta. A bit on the soft side. I would rather have regular sapghetti which are thicker and have a bit more chew.    Tuscan salad $12.53 - I'm not a big salad person but it tasted good.  Meal came with completmentary bread.   Service was excellent. Food was good.   Prices a bit on the high side and speaking about the price I wonder why they price their items so weird. Whats with the 84 cents and 66 cents and 53 cents."}
{"text":"Took a business client here for lunch, I ordered the Funghi pizza and she ordered the Arctic Char on my recommendation for something different.  Pizza was okay.  My friend really liked her AC!  Like a Boston Pizza but with better Italian fare selection!  If I could I'd rate this a 3.5 but alas Yelp only has whole stars!  This is a huge restaurant with a huge selection.  I've eaten here before and been a bit disappointed with the pasta but such is life!"}
{"text":"I've been to this restaurant a few times; mostly for work, but today with a large party of about 60 people.    They, if nothing else, can handle big tables.  In fact, they split the bills for us without a care and accurately.   In fact, my wife's order was too spicy for her (the arrabbiata was a bit potent last night; another of our party had the same issue), and our waiter asked her if it was okay and took it back for her.    The only drawback was that our table didn't get a bread basket, but that was hardly an issue.    I had a meatball sandwich, and the meatballs were delicious, the sauce was tasty, and the roasted vegetables were well done.  I got the canolli for dessert, and it was worth leaving the gun for.  I got a mojito, and it was good, but I'm still working on getting over the whole crushed mint part of it.    It's good, though.  Good service is important, but the food has to be tolerable first."}
{"text":"I love the house salad. They changed the name from Insalata Fazoolis. The shrimp angel hair pasta is good. I got their seafood linguini and enjoyed it. The cheesecake is usually really good but if it isn't fresh it tastes dry. This location is much better than the Colossus location."}
{"text":"Since the menu change it hasn't been that good. The cheesecake is really good tho and patio seating is nice!"}
{"text":"First visit, and if I am in the area again... I will be back!    Relaxed atmosphere ... Staff was very friendly ... the bruschetta was AMAZING!  Pasta was cooked to perfection.  The next time I am in town I will be back.   Enjoy!!"}
{"text":"Food was good, I was pleasantly surprised.  The dessert was fantastic, authentic and probably the best cannoli ever, and I'm Italian!!  I was with a friend who had a wheat allergy and they were able to accommodate."}
{"text":"i ordered the chicken parmigiana with spaghetti and tomato sauce.also the calamari to start with. halfway through my meal, i had to run to the bathroom and i had diarrhoea. sorry for being gross but thats what happened. this wasnt my first time here at this place but it was def my last just cause of the experience. the food was good though, but unfortunately due to the unpleasant experience i had it was not so good. so we paid for the bill without finishing it (obviously) and i went to go buy some pepto bismol ."}
{"text":"Good Italian food in a juxtapose atmosphere of old and modern. My fish was done perfectly and the vodka sauce was quite the compliment."}
{"text":"Came here with a coupon ($10 off if you spend $30 or more). I got the ravioli. I love the bread that comes with the meal. The ravioli is a bit salty (it's consistently salty from all the times I ordered it) but tasty. In general, I think most of their entrees were a bit too salty. However, I do come back here because if the coupon it's a great deal and the food is decent for the price. I do like coming here when I feel like eating at a \"upscale\" chain restaurant. The service here was also very good."}
{"text":"Amongst a slew of \"box\" restaurants in this busy area of Richmond Hill, Alice is a stand out. It is very close to the highway, making it easily accessible from both the north and south. The decor is nothing to write home about, but it is a chain restaurant we're talking about.   The service was quick and friendly. Our server almost had bread on the table before we even sat down! Which was very much welcome after a long day of animal watching at the zoo. I think we went through two bread baskets before even order and we asked for one more before our meal came. My friend was kind enough to share the ancient grain salad (grilled chicken, farro, apple, toasted almonds, fresh greens, grapes, cider vinaigrette) and the short rib ravioli (pasta stuffed with braised short rib, basil pesto, grated Grana Padano, tomato emulsion). Both dishes were winners, but if there was a fight to the death, the ancient grain salad would win! Surprise! The ravioli put up a good fight and was definitely delicious in a cheesy, meaty, carb-filled way. However, the salad had great balance, with the farro still having a great bite to it and the apples and grapes adding some nice sweetness. it was just a great salad, and I am not normally a salad person. This might change things for me now though, I'd suggest giving it a try!"}
{"text":"I came here with Christina R and another coworker to celebrate a belated birthday. The service we received was friendly and genuine & our food came out promptly as we were the only ones there! The three of us ordered the mussels, and I had the chicken, beet and goat cheese salad. I have to say, the salad was kind of blah. It was just boring! I think it was the chicken because it was served a bit on the cooler side without much flavour. The cheese was also crumbled up a touch too small for me as I prefer larger chunks. BUT that is my preference so I won't hinder their rating.  You may ask yourself why I'm giving them a 4 if I've started my review off somewhat sour? That's because they say the reader usually takes the last bit of knowledge and runs with it. So with that being said, the mussels were fantastic. The waitress said there's usually 12-15 mussels per bowl. I think ours had 20-25, to be honest. If you're into seafood and are craving some mussels, head to Alice Fazooli's on a Thursday and get their $7 special. I could have (and did...) drink the broth like soup. So. Good.   I shall leave it there, my friends."}
{"text":"Decent food, friendly and prompt service. I'm a little biased on the drinks because everything was free. But the service was plentiful"}
{"text":"My husband and I unexpectedly stumbled upon this place while biking home one day. While we were not dressed for the occasion, we did stop for a couple drinks and ended up meeting up with some friends here. It seems to attract many people who live and work in the financial district.   I was pleasantly surprised by their large patio which could accommodate several groups. It was very lively and provided for a very entertaining evening.   Summerlicious was going on so we grabbed a bite to eat and both my husband and myself were quite pleased with our meals. Generally speaking I prefer to frequent more independently owned and operated restaurants, but for a chain restaurant this was pretty good!"}
{"text":"I  had lunch at Alice Fazooli's and sat in the dining room.  Stephanie was my server and she started me off with some hot bread and olive oil/chillies.  I ordered Penne Arrabiatta with sausage.  It was good and had just the right amount of heat (spice).  I've had it before without the sausage and it's good meatless too.  Next time I think I'll add chicken.  Stephanie was friendly and helpful and took good care of me."}
{"text":"I had lunch there today with two colleagues.  We got there about 11:45am and it wasn't crowded ... it never did get crowded.   I ordered a pizza with no onions or green peppers.  After a long long time, it arrived with onions and green peppers.  When I brought it to our server's attention (he hadn't noticed!), he said it would take another 10 minutes to make a new one. We didn't have time so I ate it.  I love pizza and this wasn't a good one.  There wasn't much cheese and it was barely warm ... it had obviously been sitting around for a while :(  I won't be back."}
{"text":"The first time i went here I definitely had a mediocre opinion of the restaurant.   The first time I got a butternut squash ravioli and I only got 4 large pieces of ravioli but I didn't feel it justified the price of $17.  The last time I went I got the Agnolotti which I found OK. Definitely something I'd have again but I'm not sure if Id come again due to the value. The pricing and the value of the food doesn't equal out to me as I'm not amazed or stricken by their food.   On a positive note they do offer gluten free pasta in Penne form only and nothing else.  The service was OK, the bred on the table was really fresh, but overall I wasn't too impressed with the place on both occasions I've been.  If you want something different than what you are used to then this is somewhere to consider, but I don't see myself becoming a regular here."}
{"text":"Great place for a big group. We came here for a friend's bday  and had a nice spacious dining area (could prob fit 12). Good also for families with young children/toddlers. Lots of stroller space. They were ok with us bringing a cake for the birthday girl... for which i was grateful.  Our waitress was just average. She checked on us once and filled our waters once... but most of the time they were almost always empty. Maybe it's cuz none of us ordered alcoholic beverages and it was not worth her time.  Otherwise, our dinner was alright. I had the chicken risotto. I thought the rice was only slightly watery but it was delish! I don't mind coming here again."}
{"text":"3.5 +. We celebrated a friend's bday here & had a very pleasant experience. The waiter was very courteous and patient with us (9 ppl). Ambiance & decor was nice.  The bread w/ the olive oil & salsa was so good. Honestly we should've asked for another loaf but we wouldn't be able to eat n e thing after! We ordered 2 pitchers of sangria. Be patient w/ the sangria and let it sit for a few mins so the taste of the fruits/wine would be better.   Food was alright depending on what you order. I think I have had better risotto (a little bland & not enough cheese) before but I believe everyone else enjoyed their meals. The cheesecake was really good! Give it a try if you're not full or have someone to share it with :) Prices were a bit steep for dessert imho but expected that here.  Great place & if we're in the area we won't mind coming back again. You'll def. have a nice experience & they keep the place spotless. We kept seeing a hostess wiping away at the glass door everytime a patron left."}
{"text":"Havnt been here in a while, and lord was it awful. I'm 99% certain that the chicken and fish is frozen. Snapper was soggy and chewy. Then got a salmon which was totally dry inside and charred on the outside.   The chicken on the risotto might as well have been shredded instead of cut into the the thinnest strips ever. The dish was generally over proportioned and very under seasoned.   Ravioli was wayyy to sweet and the sauce basically looked like clarified butter with some pine nuts thrown in.  Overall unimpressed. Over priced, under served, poor quality. Please don't tell me \"but sir, the food is always like this\"."}
{"text":"Today was my first time at Alice Fazooli's. My work Christmas lunch was at this location. It was very loud and busy - there were many large tables, so I am guessing we weren't the only ones who decided to use this restaurant. One of the main reasons AF was chosen was because they could cater to my gluten allergy. Always a win ;)   We had two waiters - both were very attentive and polite. Absolutely no complaints about the service we received!   I had a spicy penne pasta - The pasta itself (meaning the noodles) were great! I actually had a co-worker taste them to confirm that they were gluten free because they didn't have the \"normal\" rubbery, gluey gfree noodle taste (in terms of gfree noodles in restaurants) that I have become accustomed to. The sauce on the other hand was WAY too spicy. Now I'll be the first to admit that I'm a spice wimp, but my co-worker, a lover of spicy Indian food, was even feeling the burn. By the time I got to the end of my meal, I literally couldn't feel my tongue, my nose was running and I had chugged my way through three glasses of water and a glass of wine. This kind of ruined the experience because I couldn't really taste anything besides the burning after about five minutes.   The portion size was good. I felt full, but not sick-stuffed to the brim- going to puke any moment - full.  Kind of sad to watch everyone dig into what looked like delicious bruschetta, but that's not AF's fault (though I personally think if a restaurant if going to offer gfree food, they should go all the way and do the bread as well).      Overall, I can't say for sure whether or not I would return - but I wouldn't totally rule it out."}
{"text":"First time here. The service was very good but the food was just average. Would I go back, sure. Worth a try."}
{"text":"i took my wife to be on our first date here. Love the food and also the atmosphere. everything is good."}
{"text":"I was there on a Saturday night and I thought the there should be a wait. So my friend said he made a reservation.  Too bad they said no but can sit me right away.  I ordered a salad and my friend ordered a masala chicken with a salad side.   My salad and my friend's main was great. Chicken in both our dishes were BCE and moist.  But my friends salad side has a couple huge pieces which it's a bit not professional.  But overall it's great."}
{"text":"Prices seem a bit on the high side for okay service and mediocre food."}
{"text":"A very quiet place, compared to Jack Asstor's next door. More suited for a date or a dinner with family so you can actually have a conversation and hear the other person. Got some drinks last night - 2 rum and cokes & a rye and ginger. At first glance upon arrival we thought they were huge. But after sipping it tasted like just a glass of coke. Couldn't taste any rum at all. And that's not me being picky at all."}
{"text":"To be honest the food is very bland. I have been here several times, and each time I felt I could have done myself a favor and cooked the dish myself. Alice F does get bonus points for atmosphere. The service is above average, there is lots of room for groups, and as previously mentioned the patio is pretty nice. I think this would be a decent place to go for some appetizers and drinks (Sangria is great) and then head on to somewhere else. The theater crowd will find much better choices in the near vicinity."}
{"text":"Although I find their entrees a tad expensive, they are very good and the restaurant has a great overall atmosphere. My wife and I mainly go there for drinks and appetizers as they have a really nice patio in the back, with greenery and shade, and they offer $4 pints of Heineken from (I believe) Tuesday To Friday. This may be a special for a short time, but some sign out front usually indicates their drink specials. This is a nice franchise restaurant that is bordering on trendy. There have also been sightings of Toronto Raptors' players attending this place on occasion during the summer. I have also had no problems with the service that some people have experienced My wife thoroughly enjoys the Boconcini with Tomatoes, Basil and Balsalmic Reduction"}
{"text":"The last time I came here, I had an amazing experience where the waiter made sure that we were happy with our food and that we lacked nothing.  The food was good and the service was great, therefore I will be back for sure!"}
{"text":"I visiting this location on good Friday with my family for lunch. I've frequented this location on many occasions and have seen in the last 4 weeks this place go absolutely down hill. On good Friday for lunch we ended up leaving before our orders were even ready. The kitchen staff was beyond slow.  There was no manager on shift, I know this because when I asked to speak to him I was told, and I quote 'he booked off sick'.  This is a terrible business practise and I will 100% NEVER RETURN to this or any other Alice Fazoolis. I will also tell any friends or family about and to boycott this chain.   Shame on you Alice Fazoolis. What was once a very nice, contemporary Italian restaurant, is nothing more than a common McDonalds."}
{"text":"The food is bland and overpriced. I had to drown it in chili peppers just to taste something. There was a hair in my food and something floating in my water. Disgusting! Avoid at all costs and go to East Side Mario's or something."}
{"text":"As we were unable to eat at another restaurant in the same complex, my boyfriend and I decided to try out this location of Alice Fazoolis (loved the downtown location).  The service was HORRIBLE.  First, my table was sticky to the point where my sweater stuck and when I requested that it be wiped, I was sighed at.  It took awhile for our order to be taken, 15 mins to receive oil for dipping bread and the waitress actually cleared the tables besides ours and ignored us..  Not impressed.  Will not be going back."}
{"text":"I've been to this restaurant a total of 3 times, and each time I've gone, the food was great and I don't really have any complaints.  The atmosphere is welcoming with friendly servers, and its pretty spacious inside as there is also a bar/lounge side and outside patio.  Came here recently for dinner and we ordered the Antipasto Board for Sharing and Chicken Arrostito, which were excellent!  The prices are reasonable, as their pizzas, sandwiches, and pasta are all under $20, and if you sign up on their website to become a 'friend with benefits', you'll also receive a $10 off coupon..sweet. =)  Overall, its a casual restaurant that I prefer over Milestones, Jack Astor's, or Montana's any day!"}
{"text":"From what I remember, this place is expensive and the quantity of food is minimal.  The entrees don't come with any extras like bread, etc.  I was not impressed.  The bar however is a fine place to chill for a drink, if you're on a date for example.   Derek"}
{"text":"I have come here for celebrations and large gatherings. Their menu pretty much has everything for any taste. Their service is pretty good and they're generous with the drinks."}
{"text":"Not sure why it got 3 stars but this place has never let me down!  I love their calamari for start and their pasta is delicious. Pizza is good too.  And I love how they have a nice patio to just chill out and relax in.  It's hard to find a patio in Richmond Hill and Alice provides one that makes you feel like you've escaped from the burbs for a tiny moment.  I would have birthdays here and christmas dinners with friends.  It's a nice place with good vibes and the service is also good."}
{"text":"We go here with the kids on the weekend for lunch and then a movie if something kid friendly is playing.  The kids like the pizza which is pretty good.  I like the chicken fettuccine (I invariably get that each time) and my husband likes the seafood fettuccine although he switches it up and gets the spaghetti and meatballs once in a while.  This is solid fare but not haute cuisine.  Lots of better \"real\" Italian places if that is what you are looking for."}
{"text":"The $16 sausage pizza was essentially dry dough. Good thing I had the $8 pint of warm beer to wash it down with. It's a shame such a good looking venue serves such mediocre food. What's with the massive pile of arugula on top of the pizza?! The service is inconsistent. I had the waiter try and persuade me to rate him perfect on a survey. With that said, this is still a pretty happening place in Richmond Hill, which isn't saying much.   Food 2/5 Atmosphere 4/5"}
{"text":"im not a brushetta fan but i tried it here cause someone else order it. I must say the Antipasto app was excellent with their creamy garlic spread i also like the herbs they used. im pretty sure it was basil and lots of olive oil. Sometimes i find places overload on tomato and that's all you can taste but this dish had a good blend to it. The large toasted slice bread was a good touch.   Also had the antipasto mix platter with a variety of cheese, deli meats, bread, olives, figs, and sundried tomoatoes. A nice sharing dish for the patio to go along with some pints.   The service was very good considering it was a packed patio on a thursday night. waiter was prompt and was never left hanging without a beer.  overall a really good experience"}
{"text":"A friend of mine was organizing a group dinner a few weeks ago, and she decided that Alice Fazooli's would be a convenient location for all of us to meet and eat. Granted, the space is quite large, and in a pretty central location, but I'm tempted to say that I would have preferred eating at the Hooters down the street than spend my money here.  First of all, the service was so slow. It was a scorching weeknight and the restaurant was mostly empty, but for some reason it took forever to get our drinks and our water was hardly ever refilled.   In terms of the food, I'm seconding Justin M.'s sentiment about the arrabbiata - I ordered it as my main and it was seriously spicy. Now, I'm pretty good with heat (years of eating kimchi) and gobbled it down quite happily, but my friend who also ordered the arrabbiata couldn't even finish half her meal because it was way too hot for her (our server didn't even ask if there was anything wrong with it while she was taking it away). I remember having a glass of Pinot Grigio for a really reasonable price. We also ordered a round of celebratory tequila shots, which unfortunately seemed almost watered-down.   Also, I think the air conditioning must have been broken while we were here, because it was so hot inside the restaurant. Coupled with the spicy food and lack of water, I spent half the evening unpleasantly dabbing away the sweat streaming down my face.   My final point of contention...one of my dining companions had asked for the remainder of her food to be packed up. I left the table to go to the washroom, and saw that our server had just abandoned her plate on an empty table near the back of the restaurant - she hadn't even brought it into the kitchen. Anyone could have done anything to that food!  It was supposed to be a special evening for my friend, and ultimately it was tainted by the poor dining experience. Alice Fazooli, if I ever meet you, I will have to suppress the urge to windmill kick you in the face."}
{"text":"Not a fan, sorry. I've been here twice, both times with fairly large groups and both times I was disappointed.   The first time I had their ravioli which was really dry and drenched in an overly rich sauce that was too salty. I think there were six raviolis and I didn't even finish them. The second time I went I had their salad which was super average and I get better salads at Freshii so I was not impressed at all.   I would definitely not come here if you are expecting quality Italian food and I know I won't be coming back."}
{"text":"I was visiting my husband's family in T.O. earlier this month, and we decided to go out on a Friday night for a good dinner. I had been to Alice Fazooli's only once before, and all I tried at that time was their bloody Cesar (which was delish!) What I liked almost instantly about the place was the ambiance, and the fact that even on a random weekday afternoon it was busy! I figured there had to be something good about this place, right? Right. It's their food, their amazing cocktails and their great service, in addition to their neat rustic decor.  We ordered a variety of cocktails - from the pinot grigio mojito to the pear martini, from the classic martini to a fancied up gin & tonic with red peppercorns! of course I had to get a sip of all the beverages, and I had a hard time deciding which one I liked the most! for food we had the grilled calamari, wild mushroom pizza, Penne Arrabiate and another pasta (which was less memorable). I loved the calamari and the penne. the quality of all the food was great. I'd most definitely recommend this place to anyone looking for a good Italian restaurant in this part of town!"}
{"text":"Their patio is the comfy-st in the whole east beaver creek plaza: water fountain, low seats, garden themed with a good mix of shade and sun.  If you want to find a seat in that plaza on a friday sunny afternoon lunch rush, should check here first.  Tilapia: Fish baked till soft topped with saucy white alfredo. Paired with green beans and angel hair pasta.  Would definitely recommended. I love my meat and don't normally go for fish but this is definitely hits the spot!!"}
{"text":"Savour York Region's Lunch for $15 at Alice Fazooli's is definitely a great deal.  Mushroom & Sherry Soup (Porcini, Shiitake, Cremini, Tarragon, White Onion, Cream) - Tons of mushrooms and it is not too creamy... the taste of Sherry is quite strong  Fettuccini Al'Pollo (Roasted Chicken Breast, Sundried Tomatoes,  Spinach, Cream Sauce) - The chicken breast is surprising quite tender and plentiful - Cream sauce makes this pasta dish really hearty.....  Tartufo (Rolled in Toasted Almonds, Caramel Sauce) - Almonds.... hmmm love that! and it is quite sizable...   Service is really friendly.   I would definitey come back for their drink specials at their bar area which is more casual...  Thursday Martini Specials sounded good!!  BTW, those spot lights shining right at my table are awesome for photo taking! :)"}
{"text":"Sometimes it is not easy to find places that open late on weekdays so I can meet up with friends for a night cap up in the burbs.  Alice Fazooli's was perfect as the kitchen stays open till 11:30 pm. As we were the only table there, our service was really attentive.  Spaghetti with Meatballs and some drinks, a perfect and simple night snack as I love eating pasta any time."}
{"text":"Stay away from the $9.85 \"Cheesecake\" dessert!!!   If you're looking to try \"Philidelphia Cream Cheese\" that was quite literally opened from its package and molded into a round white cream cheese brick and then entitled \"Cheesecake\" on the Alice Fazooli's menu (near the AMC Winston Churchill 24), then you'll want to try this. This is by far the worst cheesecake I have ever had. It literally tasted like biting into a brick of Philidelphia cream cheese that I usually buy myself at Valu-Mart or No Frills. Although it looked impressive, looks can be very deceiving. Stay away, this is not cheesecake, this is cream cheese. You don' t need any talent to create this menu item. ew ew ew. Stay away. You have been warned."}
{"text":"We ordered a chicken and avocado sandwich dish, a seafood fettucine type of dish, and a pork tenderloin dish. All three were bad to medicore. The pork \"tender\"loin was dry and tough. The chicken and avocado was forgettable. The seafood fettucine was bad- watery and bland. They did put enough seafood in though. 2 stars for the food. That is to say i would've given this place if it were a $10/person type of place. But it's not. The service was nauseatingly slow too."}
{"text":"3 of us popped in tonight for Savour York. I was hesitant to visit here as I had an awful experience about 3 years ago and swore I'd never step foot in this place again. I gotta admit...I was mightily impressed.  Let me start with our server...Mirelle.....she was fantastic. Attentive, warm, funny, and engaging, she allowed us to set the timing of our meal. She checked on us after every course, asked if we wanted to delay dessert (as we mentioned how stuffed we were), made recommendations. She should be cloned and sent out to other restaurants.  Ambiance was great...with two of the funkiest chandeliers I've seen.  On to our meals. For $25 each, we had:  Person 1) Calimari as an app. There was tons of it but every morsel managed to get eaten. Next course was Tilapia. Two large pieces with green beans (which were a tad on the cool side) and angel hair pasta. Dessert was the mini donuts with the caramel sauce (to die for). This person loved her meal.  Person 2) Caesar salad to start. A bit of a disappointment as the dressing lacked garlic. Main course was Chicken Cacciatore, with green beans and polenta. His beans were warm, polenta excellent and the cacciatore flavourful. Dessert was tiramisu ( in a mason jar). It was excellent. This person loved his meal.  Person 3) Caesar salad to start. See comments above. Chicken Alfredo with semi sun dried tomatoes,. Nice sauce with several pieces of chicken. Dessert was Tiramisu. I found it to be ok....a friends mother makes the best..but this was ok. I also enjoyed my meal.  On top of this, we were told that the brushetta (normally $9.99) was discounted to $5 tonight...so we ordered it as well. It was excellent....loads of tomatoes, parsley, cheese and drizzled with balsamic. What was surprising was how large it was...but being the troopers we are, we polished it off.  I have to say, this place has redeemed itself in my eyes....we left stuffed but surprised at the quality of the food. We will be back.  As a side comment...the have the best menus I've ever seen. Kudos to them for originality."}
{"text":"We came here for Savour York Region and also because there was a deal on gift certificates on their website. We have been to this location once before and used Yelp to create a reservation.  We were here on the last evening of Savour York Region, and this place was kind of dead. There were very few patrons. We ordered the calamari and the pea and pancetta soup. The calamari is always a good choice for appetizer. The soup was not that good in my opinion. For entree, we ordered the chicken cacciatore and the the tilapia. Both were pretty decent. Not the best chicken or tilapia that I've ever had, they were both a little overcooked. For dessert we ordered the tiramisu and the ciambelle. Tiramisu is always good. The ciambelle wasn't good. They were more like beignets."}
{"text":"This place is more upscale than its name would suggest. While it wouldn't make any top 10 lists of Italian restaurants in Toronto it does a fair job on the food front. When I was there it was 'Feel Good Thursday' so the bar was jammed but this is the case with most lounges on a Thursday in Toronto. I wouldn't go back for the food but if you end up there on some elses suggestion it will be an ok evening."}
{"text":"Alice Fazooli's changed up their menu recently, so I received a promotional email for a free appetizer. Luckily, I managed to drag my family here to try the new menu before the promotion expired.  After studying the menu for a very long time, I opted for the ravioli fritti as our free appetizer: deep-fried ricotta and spinach ravioli, dusted with cornmeal and herbed breadcrumbs, spicy tomato sauce. This was an excellent starter for sharing and I don't regret my choice one bit.  Next, we ordered a Bruschetta to share: Roma tomatoes, roasted garlic, grana padano, e.v.o.o., balsamic, grilled crostini.   From the pasta section, I chose something new on the menu: Rigatone Salsiccia, featuring ragu with Niagara Berkshire pork sausage, spinach, roasted cherry tomatoes. I loved this! Generally, pasta can be really heavy because of all the sauce, but the non-saucy pasta are often overly dry. This wasn't the case here because the sausage and the vegetables retained a lot of moisture, and the pasta was cooked al dente.  The steak sandwich was rather mediocre. Although the combination of   sautéed mushrooms, onions, and provolone sounded delicious on paper, the execution didn't impress. The steak was rather tough. I enjoyed my grilled chicken panini last time a lot more.  As a cheesecake fanatic, I couldn't resist ordering the mascarpone cheesecake for dessert. The cake was pretty big- perfect for sharing, and very creamy and delicious.  Oh yes, and the tapes teaching you Italian in the washroom are pretty amusing."}
{"text":"Angela decided to head to Alice Fazooli's for a little bday get together for dinner.  The Alice Fazooli's located on Adelaide is a pretty big one and is nicely decorated. We headed there on a friday and it had all the typical young professionals there unwinding down and enjoying their TGIF drinking traditional.  We made reservations ahead of time and they were pretty accommodating and seated us even tho we only had about a third of the people there.  With this being a larger restaurant, you're in luck if you're dropping in on a whim. At around 8ish the restaurant probably filled to just about two thirds capacity. We had some great waitresses that were attentive friendly and got hit on by our group there.  And even with our friends hitting on them, service never dropped a beat.  I ended up ordering this special fixe prix dinner menu that was targeted for a valentine's romantic dinner promo. The dinner came with complimentary sparkling wine, a small calamari appetizer, a choice of soup or salad (went with the casear, average I would have to say) and a nice entree which was steak and some butterfly shrimp with mixed greens on the side. For dessert I went Italian inspired cannoli. Now the sparkling wine was alright, nothing special. The small calamari dish was a bit of a letdown. It was small and looked frozen. Didn't taste fresh nor was it even deep fried well.  The main entree of steak was better.  I felt the seasoning wasn't there but it was grilled well.  It wasn't a small piece so you don't have to worry about finding a post dinner option.  Each butterfly shrimp was rather small so tho taste was okay, it was a enough work for each one to be bring the dish value down. Call me lazy, but it was enough work for me to dock them a point especially with the size of shrimp that was used.  Now the dessert options weren't great with the fixe prix menu, so I was hoping the  cannoli would have panned out. I wasn't thrilled with it and ended up leaving it unfinished.  Angela wasn't thrilled about it either and if your dessert expert stops eating, you follow their lead.  The dessert felt premade and was simply waiting to be taken from the kitchen.  Overall, I'm mixed on Alice Fazooli's. The food isn't horrible but for the price you pay I just kinda expected more.  The food just wasn't on par with many downtown options.  But service, mannn was it good.  Attentive, friendly and fun (I'm sure this might be an exception to the norm). Even with our friends hitting on the waitresses (yes multiple), they rolled with the punches and mann did they fire some back at them. This was not only entertaining but helped to pull everyone out of their shell. It was a new group so this helped to break the ice. I just wished Alice Fazooli's had better food to compliment their service cause boy did their service stand out."}
{"text":"I have been in this resturant few times. I had red snapper and borshta which was decent but the second time I has steak and it wasn't good. It was very small pieces and took forever to get it. Thier resturant is chick and they have good customer service."}
{"text":"Horrible food, horrible service whenever my family decides on where we should go to eat we joke and say Alice Fazooli's."}
{"text":"We had no reservations for our group of six but were immediately seated. It took a few minutes for the server to come to our table but then service was fine.  The bottles of wine were reasonably priced. No pre-meal bread offerings. Everyone else's portions seemed to be of a normal size but my salmon was miniscule. The server noticed this and had already ordered a replacement piece by the time that she brought it to the table. It took about ten minutes more for the second piece to arrive. One of my dining companion's beef dishes was fatty and undercooked. All the other parties seemed to enjoy their meals. One of them ordered dessert; no sure what it is called, but it was tiny cream puffs dusted with sugar and served with warm nutella. Quite good. Prices were moderate.  A small plea: if you are able, please consider keeping food storage containers in your car so that you can wrap up the uneaten portion when dining out. It saves small businesses money (a little bit from each diner adds up over the course of a year) and it saves packaging from going into a landfill. Try it - you'll be surprised at how good you feel."}
{"text":"Lovely environment and good food. Great service. They fixed my food even though it was my fault because I had forgotten to ask for something! They still fixed it and made it a lovely dinner for me! :) will definitely go back and highly recommend!"}
{"text":"After having a very terrible visit at Alice Fazooli's a year ago, I was very pleased with yesterday's visit.  We arrived for our dinner reservation at 8 and were surprised that there was no wait at all. We opted for patio seating and got our drink orders in about 10 minutes in. I ordered a long island iced tea (which had no taste of alcohol at all) and my friend got a gin and tonic (should've gotten that to get a buzz going).   Our server was fantastic! He provided recommendations and they turned out to be great recommendations. I chose the ravioli over the chicken risotto and my friend got the margherita pizza. When I saw that there were only 5-6 pieces of ravioli I thought I would still be hungry. Nope, those hit all the right places and I was full. The meat filling inside were hot and wasn't dry at all. The pizza was a bit thicker than paper and tasted pretty good. We ended off with a slice of cheesecake which we could barely finish. It was creamy and the hazelnut crust topped it off well.  The bill came up to about $60 (before taxes) for the both of us combined, which is pretty decent to me. Overall, the service and food was fantastic! I am definitely returning in the future."}
{"text":"something about this plaza...I'm not sure what is up with it and me. I would go so far to say that I've not had a good experience at any one of the restaurants in this \"plaza or common.\" right off the bat, parking is an absolute nightmare, as people park illegally and park diagonally taking up multiple spots, after about ten minutes of searching, I was finally able to find a spot, wouldn't you know it, four spots away from the door, after searching pretty much half of the parking lot. OH and people were just chilling in vehicles with the lights on and the engine running, IF you choose to do this, I think you are leaving, because the lights are on...guess no ones home. anyways, walked in the door at 7:13pm which was two minutes ahead of the reservation and we were promptly seated with menus, everything looks and sounds absolutely fantastic, so it was very hard for me to choose between one app or two, went with two, which was the bruschetta, and crispy ravioli. I was pretty confident in my choices, but I was concerned with getting caught up with talking to my friends, about ten minutes later the waitress came back to take our order for the main courses(we didn't make a decision at the point app's were ordered) we continued to chit chat some waiter dropped off some pull apart bread with this absolutely orgasmic oil with herbs and LOTS of garlic, which was super delicious but for four people the bread that was brought was only four pieces. a moment seemed to hang on a little bit too long, just as we were collectively trying to figure out what was going on with why our food was taking so long, our app's showed up...HOORAY!  we slowly eat our apps and continued to catch up as we had to catch a movie later in the evening(dinner was 7:15 and the show was 9:15) I couldn't help but notice within all of the chit chat, just watching the people come and go and the workers do the shift work. at about 8:00 or so, I also noticed that the restaurant was pretty packed, but our waitress wasn't serving any time other then ours(to my knowledge) not to mention they had about 4-5 ladies pulling the \"table paper\" from this roll that was right by the kitchen, I was fascinated with how much detail and precision went into tearing \"table paper\" from a roll? anyways, in noticing that we couldn't find out waitress anywhere, we couldn't help but think...ok where is she, and where is our food, and why haven't the plates been cleared off?(at least a 20 minute gap between last fork coming down and collection of the dirty plates) dinner arrived sometime after the plate collection happened and I couldn't help but notice that my plate was pretty small, I was not impressed at the very least, that is, until the bowl of pasta hit the table, then I was pretty impressed, easily there was a top layer of shrimp with additional shrimps swimming through the pasta. the table was asked if we wanted cheese or black pepper, which I said yes to both. The lady who wasn't the waitress did a fantastic job cheesing and peppering my bowl of food. I continued to eat and eat and legit, this bowl of food took me forever to get to the bottom, it was hot, it was very flavorful, and absolutely delicious. my girlfriends food was not very impressive as she thought the steak dinner was under or in a warmer for the last ten minutes and that her food was cold. three of us finished up early so we continued to chat, miss waitress actually came around and grabbed the plates pretty quick in comparison to the app course. all we could think of at this point was that we are going to miss the movie, cause we were all done and the waitress was no where to be found. she came around to collect the last plate, and apologized about the service tonight and told us that dessert would be on her, to which some apple cookie came out, some sugar balls and a chocolate cake...thing? the cookie was cold and came in a cast iron square frying pan that sadly has seen better days(untreated and rusty) the sugar balls were awesome, and I never got a piece of the cake...thing? in closing I would like to challenge the workers at this restaurant, cause it just seemed like a \"I don't care attitude\" the food is absolutely flavorful and fantastic. having to suffer through that service for it though? not a chance. total time at the restaurant was 2 hours and 15 minutes which put us passed the movie time even before we left the establishment.  not a happy visit, and after this, I'm done giving this restaurant plaza a chance.  a funny moment; was going to the bathroom though, I walked in to wash my hands and they have Italian lessons playing on the speakers, i walked in during a bit of a break, so when the instructor came back on it scared me a little bit, because I knew I was the only one in the bathroom.  a sad moment; upon walking out I saw that whoever used the brick of Parmesan cheese left it uncovered on the ledge of a backrest of a booth? I'm pretty sure that's not sanitary at all.   not impressed!"}
{"text":"Not as food as it used to be.  Ordered the grilled calamari putanesca and it was rubbery.  For a main, I had the chicken penne a la Vodka which was dry like it was twice cooked and chicken was hard and tough...really bad dish.  The new roasted chicken was dry bit side dish of pasta was ok. The others at our table had pizzas and they were floury.  Will never go back again to any Alice's for food.  Basically bar is great but eat before you get there."}
{"text":"Went there today Was greeted warmly Sat at the bar Got good, attentive service The pizza was good. Overall good experience"}
{"text":"The interior of this restaurant is gorgousss! Totally not what I expected, Brick walls, Chandeliers, Dim Lighting, Wooden Shutters, Very Cozy and Warm Feeling.  The parking lot however......jammed packed..if your coming on a Friday or Saturday night be prepared to wait for a spot. We came around 8:30pm and there was not a free spot to be found. Also you should make reservations because the dining room was a one hour wait however we were lucky enough to snag the last table on the lounge side.  Service wise, food came out Fast and Piping Hot! Our waitress however was slow as snail but was friendly and helpful...just slow in doing so.  But the Food was Amazinggg! No faults on the Food!  Drink - Limonata - its a sparkling lemon flavoured Italian Soda ..... not too sweet but had a good tartness which I love!  Complimentary Bread - Mini Ciabatta, served warm, crunchy exterior, chewy interior and comes with a dip of garlic olive oil with something else mixed in it - warm bread.....how can you go wrong?  Appetizer - Alice's Homemade Meatballs - A mix of veal, pork and beef, stuffed with asiago, simmered in tomato sauce. You get 2 medium sized piping hot, tender meatballs, with a delicious suprise of gooey cheese in the centre.  Main - Margherita Pizza -Fresh niagara artisanal mozzarella, tomato sauce, basil. Thin curst, you get the option of white or whole wheat. I wanted to stay traditional and opted for white. Good tasting pizza I was expecting a super crispy crust.....because that how I like my pizza....however this wasn't super crispy but still a great tasting pizza.  Desserts -   Tiramisu - Lady fingers, Kahlua, espresso, mascarpone, chocolate shavings, espresso cream. More of a deconstructed tiramisu, with the mascarpone drapped over the lady fingers, not as dense or as sweet as a traditional tiramisu but still delicious.  Cioccolato Fuso - Molten Lava Cake, Chocolate ganache, cafe latte ice cream. Extremely decadent and equally delicious! I loved the pairing of the coffee flavoured ice cream with the rich warm chocolatey goodness! A must for chocolate/coffee lovers. The definite winner of the night!  Overall what its lacking in service it surpassed in food and ambiance. FYI be prepared to wait for a parking spot!"}
