{"text":"I've been going to Alima's for years; it is an amazing place. The doubles, pies, and roti are simply the best.  The food is fresh and they also have frozen roti, doubles, curry, and vegetables for take away.  They also have a bakery but I haven't tried the baked goods but they have many of the staple Guyanese/Trinidadian goodies.

Every time I visit the GTA Alima's is my go to spot for great Halal West Indian food."}
{"text":"Excellent roti!!! Moist and flaky and massively huge! I had to freeze half of it because I over estimated how much I needed. Saving it for a rainy day :)
I also ordered the chicken curry which was good. It wasn't amazing. I am a huge fan of hot sauce and gave their house brand a try. It is good! I wouldn't go out of my way to drive there and buy it though."}
{"text":"Their roti is awesome here. I like the paranta roti. It is flaky with a tender inside and is great at soaking up curry. People from  all over the GTA drive here for their roti. Their pumpkin curry is a great with the roti . They also have chicken, lamb and shrimp roti. This place will not let you down"}
{"text":"We had a terrible experience here although previously I thought they were ok. The cashier failed to give my husband the option of paratha and dhalpurie. He can't have dhalpurie and they made his order with it so we asked if it could be made again with paratha and we would pay the difference. The owner/manager came out and basically told us it's not about  the money it was the meat....we didn't understand because we were gonna pay for the meat. She was very rude and upsetting although we were being polite and apologetic. It was 100% the cashiers fault for not offering the options as our usual Roti place ( Radica's ) always asks what kid of Roti we would like. We will never go back here again because the food wasn't very good after all that."}
{"text":"Alimas has the best roti and doubles, I understand why my mother has been ordering from them for so many years. If I'm in the mood for doubles, no other place compares to Alimas. They make the best roti and doubles and it is reasonably priced. But my mom told me one old one working there gave her a cut eye."}
{"text":"Take out only.

But that's ok cause it's soooo good.  It was a nice day so actually sat outside in the parking lot and had my curry chicken Roti and doubles.  Portion sizes are great and the flavour was excellent.

Its A small shop, but friendly service and not much of a wait when I went.  They also have some baked goods and of course lots more on the menu.

I'll definitely be back here again."}
{"text":"This unassuming place located in an area of warehouses is home to one delicious roti joint. I randomly found it on google one days when I was having a serious craving while in the area and I've been coming back ever since. There's a reason it's thrived this long in this area. 

The roti here is legit both in terms of texture and taste."}
{"text":"Ordered the large chicken roti and I found the roti to be slightly underfilled and meat to be on the skimpish side, quantity of potatoes was okay but almost competed with the meat. That being said, the taste was on point. I also had a raspberry coconut tart/square and that was absolutely scrumptious. Service was fast and cashier was very friendly."}
{"text":"Delicious and friendly service. Tried the Double but the best thing we had was the chicken wrap. Also picked up a nice sweet aniseed loaf."}
{"text":"Totally worth the drive from Nebraska. Our family orders roti by the dozens. Whenever anyone visits GTA they pick up a few dozen for the people back home. Today we walked out with roti, pine tart and cheese roll. Yummy!  I am a little jealous of citizens from Brampton who can walk in and grab some pepper pot or curry from the freezer. Not to mention someone making your roti for you. Look forward to my next trip to the GTA so we can hit up Alima's.  The prices are pretty affordable too."}
{"text":"I have been going to Alima's for over 10 years and would highly recommend their doubles, stuffed rotis and chicken curry."}
{"text":"Definately the best doubles I've ever had! This little place is packed and I'm not surprised. Also ordered roti and it was fabulous. 
There was a great selection of take home items that I will b sure to try next time I visit,"}
{"text":"This is my first time trying this place because it's close to work and my colleagues are always going on and on about it. I must say that I am completely disappointed.  They gave me a regular roti instead of the dhall pourri roti that I ordered and the curry was meh! We could not go back as we are on our lunch break. Let's not even talk about the pineapple tart!  My mother's is so much better. Thanks for reminding me why I only eat West Indian food at home and at Drupati's!"}
{"text":"Take out only. Brought home the chicken roti and chick pea roti. The chicken was okay and the chick pea tasted burnt and had a weird after taste. Both were over reduced and salty and soggy. This place is not for me."}
{"text":"This place is an undiscovered gem 
The food was made very quickly 
It was fresh parathas and the chicken combo 
The pastry and the pauloris were a first time for most of us that came but when you dip it in the tamarind sauce, it's good. 
Def a place to check out"}
{"text":"This hands down one of my fav spot. Their roti is the best.  Very soft and flavourful. I always get the roti filled with curry and it has never failed me. This is a take out spot and it can get really busy. It's worth it."}
{"text":"My parents have been going here for years. Amazing bussup shot and dahlpouri. The doubles is good too. This isn't a dine in place, only take out. You can also purchase frozen foods and some baked goods. Peppersauce, west Indian sodas and random nick nacks for sale. Quality is perfect after all these years."}
{"text":"The absolutely best Roti and curry. This is homemade delish. If you love West Indian food and don't know how to make it buy it here!!!!!"}
{"text":"I can't believe that this place has only 18 reviews. This is the most famous, for all good reasons, roti places in the western GTA. 
Points: 
this is a take out place, no sitting area. 
The food is really good
Rotis and dhalporis are fresh and tasty
Always gears chicken in dhal poris. 
Good for catering. 

Location sucks though."}
{"text":"I ordered the beef curry and found it overpriced and really basic tasting.

The patties are really small for $1.45 each.

After coming here a few times i probably wont bother coming back."}
{"text":"Oh yeaaaaaaaaaaaaaaaaaah.  Doubles:  soft, pillowy, fluffy dough filled with the best filling and generously so - satisfying, but not heavy.  Aloo pie ......... ooooooooh ... the flavour of chadon beni in the doubles - this is truly representative of good Trinidadian food, my goodness.

In a nutshell:  ooooooh.  Ahhhhhhhh.

I am lost for words.  Which means.  This place is the real deal.  Their currant rolls ... OMG ... the baigan choka ... (frozen) ... exquisite.  This place is far for me to get to ... but worth it."}
{"text":"Good doubles and Aloo pies , roti is good a little less salt and would be perfect , 'this is my taste preference, but generally good food for the price , recommended stop in Brampton ."}
{"text":"The food is cooked and served fresh and not sitting around all day, dripping in oil. Extremely reasonably priced, especially their combos. Must try - doubles and chicken/beef roti. Hooked!"}
{"text":"I absolutely love and adore Alima's. One of my favorite spots. I live all the way down in Maryland, USA now and I really miss your food. There has been no place down here to compare, thus far. They are so warm and welcoming. Love you guys and can't wait to visit! xo"}
