{"text":"The banner on the wall outside stated \"the best Thai and Chinese food in town\".  For that reason, I passed it by every time for the past 10 years, not trusting the extravagant claim.   Recently, I was having some work done to my vehicle at a shop next door, so I figured I would try it.  The banner was a challenge I had to confirm.  I was the only patron at 12:45 PM, so I had free run of the seating.  The menu looked typical of a Chinese restaurant, so I ordered the Phnom Penh Seafood Noodle Soup and the Black Bean Shrimp.  The soup was flavorful, with a single perfectly cooked shrimp and two pieces of perfectly cooked squid, and a variety of fish balls on rice noodles.  The owner took the time to explain to me that the soup was Cambodian style rather than Vietnamese, due to the use of pork broth instead of beef.  The Black Bean Shrimp had 8 decent sized, properly cooked shrimp in a bold sauce, with the usual overkill of bell peppers, onion, celery and carrot.  A complimentary bowl of rice made sure that I had a way to sop up all of the sauce.  Overall the food was good, the portions ample and even though light on shrimp, it was a slightly lower price than I am used to seeing.  The flavors are bold, but I don't think MSG is part of the recipe.  I would go back.  I would have given three stars if the banner truly lived up to the claim.  A little humility goes a long way..."}
{"text":"After reading the other reviews of this place, I was a little wary. I have to say, I was pleasantly surprised.  We ordered the pad thai, green curry chicken, and crispy beef. Portions were substantial and the food was delicious.  It was a little pricey for thai food, but I don't mind paying for quality. I will return."}
{"text":"I ordered a soup and some spring rolls(the menu photo displayed 2) that i pointed on the menu. They bring me a soup and a very large platter of spring rolls costing $10. I did not order this??? She said the picture i pointed on the menu was a special and she didn't know how to break it up. So in stead of explaining this to me, she decides to bring me a large platter and charge me for it. Watch these people, they are very sneaky. I'm never going back."}
