{"text":"One of our go to breakfast spots, mainly because it opens early enough at 6am for me and a friend who are early risers to get our breakfast on.  Nothing spectacular about this place, but the breakfast is solid, everything is made to order.  The coffee though is kind of weak, but the food was yummy enough."}
{"text":"Excellent family style restaurant! Been coming here for years with family - great breakfast, lunch or dinner. Especially love the Greek chicken salad and fish & chips. New owners took over a few years ago and very happy to say they have maintained the same type of food which keeps all the regulars around. Very friendly and welcome staff all around"}
{"text":"I've been here a couple times for take-out and orders halibut and chips for both times.  The chips were big and crispy, unlike some places that use skinny fries. The fish was really good as well. The decor of the restaurant is old, which may or may not suit your liking."}
{"text":"Was there tonight for takeout.  If it wasn't for jan and Tracy you'd never know it was the same place.  The beef barley soup used to be fork worthy....now it's just broth.:-( the coleslaw was soggy and grey(a tell tale sign that business is slow) and the fish wasn't halibut.  Try as u might you can't fool an old fool. The portion was ridiculously small as well. The Greek salad  had 1 olive 1 slice of cucumber and 1 slice of tomato.  The rest was brown ish  ice burg lettuce.   Sorry.....    after 25 yrs. I won't be going back."}
{"text":"This fish and chips greasy spoon diner has been around Allen court plaza forever. Ever since I moved to this area 15 years ago I remember the restaurant being there. I don't usually get the fish and chips, I normally come here for the poutine so this review will be on the poutine. The poutine is $6.95 before tax and is a good buy. The poutine is large and can be split enough fairly between 3 people. The fries used are almost like wedges and instead of cheese curds they use shredded cheese. It's a unique poutine experience so I would recommend to others."}
{"text":"This is such a hidden gem!!!!! I recently tried this spot! Was craving fish and chips. I had halibut and chips and it was really good!!! This place is so old school, it's refreshing in a way. Service is extremely friendly and caring. I really recommend you try this place if you already haven't."}
{"text":"Yum!! I love the decor in this restaurant. It's like stepping into the past. The lady at the cash is grumpy but the food is very good."}
{"text":"Disappointing!!! Frozen French fries and discount ketchup are the standards of Allencourt fish and chips. I ordered 2 piece halibut with fries, it cost $29.85....WOW!!! Sorry guys, but it wasn't worth $5. Pretty sure the fish came out of the freezer as it had no taste and was very dry and chewy. Sure signs of an owner deep in debt and cutting corners. Save your money folks. Big flop here!!!"}
{"text":"Decided to try something different for breakfast.  The restaurant time warps you back to the time with good service, good food in conjunction with traditional diner style decor.   We had the breakfast-Eggs Benedict with home style potato.  The eggs were not over or undercooked-just right and the homestyle potato did not come with optional oil and grease-perfect!    Next time I will try the fish and chips which is their claim to fame-maybe I will go for lunch :)"}
{"text":"I was taken here a while back and honestly thought that my brother was leading us to a back alley to shoot us. But to my surprise he took us to a little diner that is hidden away in the back corner of an old plaza right by my house.   Upon walking in, the first thing you think of is old diner. The decor is old and rustic with an open kitchen and a tiny tv in the top corner that plays cp24 all day. The chairs are terrible to sit in and everything just looks like it was from the '80s, which it probably was.  Once you order though, that's another story. Typical diner food like all day breakfast and what not are a staple. The eggs are always cooked to perfection, I like mine over-easy and I can't tell you how many places overcook them. The food isn't drenched in grease but there is a little bit of sheen on it. Home fries are phenomenal, best I've ever had. And they serve real breakfast sausages, not like other places that serve wannabe breakfast sausages.  This place is a Richmond Hill staple and I don't see it going anywhere. There's always a group of locals that have their table and sit there all day and all night chatting with each other and all the other regulars. The owner is still the cook and his wife is still the waitress, except for Sundays when it is their day off. Great place to come and feel like you've transported to a real homey diner."}
{"text":"Excellent fish and chips. Salad fresh. Service is great. Take good care of the kids. Hidden gem in the area. Will become our regular visit restaurant this point on."}
{"text":"Heard great things on yelp about this place and doesn't disappoint. Its your traditional looking diner and the food is outstanding. We all had the halibut dinner and it was FANTASTIC!! The crust on outside was light and crunchy and the halibut was cooked to perfection.The server was the most friendly and suggested we try the strawberry rhubarb pie a la mode, which seemed homemade and delicious. This will definitely be our go to place for fish and chips"}
{"text":"Tuesday night I had to pick dinner up on the way back from work when I decided to pop in and try Allencourt.  It's tucked away in a corner but apparently has a loyal following of local residents. Ordered Halibut fish and chips, which was ready in under 10 minutes. The owner chatted with me throughout. The whole place had a small-town, old school, mom & pop diner vibe; They were greeting customers by name. The food itself was decent- fries were huge & fish was done just right. Pricy though. Four orders, which were medium-sized, cost around $54. Compared to some places in scarborough, which have crunchier batter + shrimp+ larger portions, i think this was really expensive."}
{"text":"Your typical family diner serving local customers for years...have had their breakfast and their renowned fish & chips...both are good but then again, you can't really go wrong with a breakfast and the fish & chips are relatively good...if anything, it is a little on the pricier side given it's a diner...the ambience is an aged looking diner with the same looking chairs/tables (for God knows how long) plus the aromatic smell of grease...then again, it is a grease joint.  Would I repeat? Sure, if I'm in the neighbourhood and craving for some diner food. It's not bad and it's not good, it's satisfactory...thus a solid 3 stars.  Again, it's a little pricier than other diners. It's located at the N/W corner of Bayview & Major Mackenzie in a strip plaza, hidden in the corner of the plaza."}
{"text":"Food was fair, it's a typical diner that offers classic breakfast dishes. Had breakfast here numerous times, everything was average. Eggs were particularly good, but other than that there's nothing too interesting."}
{"text":"Great hidden gem tucked away in the far corner of an old run-down plaza. The interior of the restaurant isn't much to look at either, with dated tables and chairs and staff and inadequate lighting, but it's the food that counts!  They specialize in fish and chips, so that's what we got and it was excellent. Light, crispy batter around juicy, tender halibut fish without being soaked in oil. This is what fish & chips should taste like. I got the halibut & greek salad, so I was missing the 'chips', but the greek salad was also very good. It is a bit pricey though, where the Halibut & Greek Salad costing $18.45.  The steak was juicy and good, though I would still go with the fish and chips. Next time, I plan on trying the burger as well.  Service was very nice and friendly."}
{"text":"Best fish and chips in town, they serve all breakfast all day. There soups are so yummy all homemade.  And the Greek salad with there homemade dressing is to die for. Great price and the portions are huge. I'm defiantly going to be a regular here"}
{"text":"Place: The atmosphere is like a 90s diner, which is super cool since you rarely see this in Richmond Hill.   Food:  I was super excited about the fish and chips after reading the reviews here, but it didn't live up to the hype. The fish batter was light and crispy but the actual fish tasted like cardboard. It was chewy, heavy, and stale. The chips were pretty decent, but since the fish is the main star of this dish... I would give it a 6/10."}
{"text":"Best fish and chips in Richmond hill hands down!"}
{"text":"Intimate fish and chips joint.  Old old style decor and changed ownership about 4 years ago but everything is the same including the staff.  Coleslaw is finely cut and has a pickled taste to it which I like a lot.  The fries are thick cut and the fish is great.  All the tartar sauce comes in packets so it's kinda old school.    The rhubarb pie and bread pudding desserts are all homemade and tastes great!  My go-to fish and chips place when in my hood."}
{"text":"Great staff, great service. Friendly local restaurant that serves tasty \"homestyle\" food, with a small town charm. My favourite dish there is the steak and eggs, which I have at least once a week. Definitely worth a visit if you're looking for a quick, easy meal with a friend/family."}
{"text":"Been here a few times on our visit to the area. Mrs.O's aunt directed us here for dinner and it has become a regular thing when we are up there. Last time was with my younger daughter's family. We were well taken care of. Good food and friendly service. Maybe I should rate it higher."}
{"text":"Quick...close your eyes and think \"greasy spoon\". Upon entering this place...it's probably what you imagined.  For breakfast, it's not bad (but then again, it is difficult to screw up bkfst). Prices are decent. Lunch menu is just ok...on the times I've been here I've gone the safer route and ordered the Club House Sandwich.  Decor is so outdated it might be back in style....."}
