{"text":"Great food with authentic flavor, had the chicken couscous which was awesome and my girlfriend had the fish tajine, we enjoyed the food very much and will come back soon for more."}
{"text":"The staff is extremely rude and unorganized! I have never been so disappointed! The location is uncleanly and doesn't smell good at all. The restroom had no toilet paper or hand soap. To top it off the food was prepared with no gloves. I recommend not going here EVER!!"}
{"text":"This restaurant/market/clothing store is highly overrated!  It is located in a seedy little strip mall in a not-so-great part of town.  We ordinarily love little joints like this and avoid chain restaurants at all costs.  This one, however, did not impress us.  The owner is very nice but, since we were the only ones there it should not have taken over an hour to get our food.  We walked around the small market while waiting and found the meat and vegetables very unappealing and the canned goods looked like they had been there for a long time.  Some of the bags of food were so sticky we recoiled when touching them.  Someone came in for a carryout order that had been preordered and paid for and even that took an additional 20-30 minutes after they arrived.  We thought the prices were on the high side for the type of place it is and the lack of ambiance - and, to top it off, we did not receive a check and had to stand by the register while the owner added it up and verbally gave us the total which we realized later was about $8.00 more than the menu prices for our two entrees and tea. We would not have added a 20% gratuity if we had known we were overcharged in the first place. All in all it was not an experience we would care to repeat."}
{"text":"Alzohour Market is a prime example of the recommendation not to judge a book by its cover.  It has the (rightful) appearance of a store, where you could buy Halal meats, canned goods and clothing, but there is really nothing to suggest it being a restaurant except for the few tables and chairs.  While the store is quite large, the amount of space dedicated to the dining area isn't and this is a shame.  Alzohour Market is a \"mom-n-pop\" shop, the husband being from Morocco; the wife being Syrian  (I asked, because there was a fairly wide selection of Bosnian items on the shelves -- as is the case in several Middle Eastern shops in the Valley -- and also, because there was at least one Bosnian dish on the menu).  Their respective heritages are readily reflected in the food, which, at times, may be somewhat different than what you're used to in Middle Eastern food.  We started out with the hummus and babaganoush as appetizers.  For the prices they charge, the portions were more than acceptable.  While neither was typical of similar dishes we've had in the Valley (the hummus came with a variety of vegetables garnishing it and the babaganoush had onions and was somewhat 'gelatinous'), both were very tasty and neither of us had any complaints about either (except a difference of opinion as to which was tastier).  My partner then had an order of cheese pie and one of meat.  While the wife part of the team (part chef; part waiter; and part marathon runner) stated the cheese pie would be like a \"burek\", it really wasn't (but that's irrelevant).  At $2.99 each, the sizes of each were good and could easily have sufficed as either an appetizer or even a meal in itself  (in fact, after splitting the hummus and babaganoush, and then having these two pies, my partner was -- amazingly -- full ... no mean accomplishment, if you've read my other reviews and know how much of a glutton we both are.  That nevertheless did not stop him from helping me polish off my entree and half a dessert).  The cheese in the cheese pie is a bit salty, so if you're not a fan of salty foods, be advised.  The meat pie looks like a flat, pita-pizza and, in itself, is not very substantial.  I had the lamb tangine for my main entree and was pleasantly surprised ... especially as its no easy feat to find variety in a Middle Eastern restaurant out here.  The lamb was succulent and almost fell off the bone.  The stewed prunes and toasted almonds complimented the lamb splendidly and the sauce was finger-lickin' good  (yes, I had washed my hands beforehand).  Like most Middle Eastern restaurants, the lamb was served with way too much saffron rice, which, while very good, is something no diabetic should be tempted with! :-)  Though we were quite full  -- and glad we had hit the gym prior to coming here -- the owner recommended the Kunafa for dessert ... and it was a wise recommendation.  We've had this before in another restaurant in the Valley.  It was served cold there and I was not particularly impressed.  This time, it was served quite hot and the crushed pistachios and orange-blossom water really contributed to its wonderful taste.  In my opinion, were the owners to shut down the store part of this place, do some decorating and hire some waitstaff, this place could easily become a very decent Middle Eastern restaurant in its own right and provide some much welcome competition to other places in the Valley.  The minor discomforts of eating in a store, where the restaurant is not the main draw, should be overlooked this time.  It's quite worth it."}
{"text":"Fabulous food. The owner is terrific.  You won't be disappointed. We drove 40 miles and will do it again. We tried four dishes and the were all delicious."}
{"text":"A neighborhood ethnic place in yet another ubiquitous strip mall. I thought the food was good and the owners charming. I had the lamb shank with vegetables and cous cous. I thought is was good not great. It needed more seasoning and I relied on some red spicy sauce we all passed around to give it dimension. If I am ever in that neck of the woods again, I would definitely try one of the tangines.  We need to support places like this and enjoy the diversity in our neighborhoods!"}
{"text":"We had been in Morocco earlier in the year. My wife's birthday was a reason to celebrate and to relive part of the trip...the food  here was better  than in Casablanca.  Just surrender to the menu, ask for guidance and you will have a wonderful dining experience..The low ambiance is off set by great food and hospitality. We will be back often."}
{"text":"Really, I can describe this place only in superlatives. I've been here multiple times now, and it has never disappointed. Everything is cooked fresh, the flavors blend beautifully, and the owner is pleasant and informative."}
{"text":"Food is totally awesome. The owner is great too, the only issue is that since she does everything, it's possible it takes forever to get service.  Restaurant, Clothing Store, and Grocery."}
{"text":"A friend and I shared a chicken  bastilla here and loved it. Along with its companion salad, it would easily have served three, maybe four lunchers. Our second lunch buddy had the Bosnian sausage, served with sour cream but not avjar, which pretty well matched that of the Sarajevo Cafe but was not quite as savory (perhaps less fatty, which for us is actually a good thing). Service was leisurely, but we expected that. So, all good, though I wish they had divided up the salad and maybe the bastilla on individual plates (tables are small and the ensuing plate clutter was significant) and offered our friend both sour cream and the peppery red sauce (avjar) that would have made the sausages more complex and delicious. Other than that, no complaints at all about the food. Can't wait to return for another bastilla.   I can't speak for the scope of the market, but I did find some interesting items and did not find their prices out of line, considering how small the operation is. Enjoyed seeing the colorful clothing, at least some of which is apparently sewn on site.   My friends and I lunch weekly and seldom repeat a restaurant, but we agreed this one is a keeper for all of us."}
{"text":"I had dinner there tonight. The food is great. I tried Bastilla and it was amazing. The owner is very nice but she needs some help. She needs to hire a nice looking waitress to help her out. Anyway, the Bastilla is a little sweet but taste wonderful. If you go there be sure to try the Kinafeh is it something pretty good and you will never forget it. The owner is a Moroccan lady , she had a beautiful face without any enhancement. I will recommend this place to everybody I know."}
{"text":"This meal was like nothing I've ever had before - I've had Mediterranean and Middle Eastern cuisine at a number of places but this was my first time trying Moroccan food. The entrees were superb and very generously portioned - we shared the lamb tagine and the bastilla. Such rich and complex flavors and an interesting combination of savory and sweet, just absolutely delicious. Also had the best stuffed grape leaves I've ever had (served warm, which I really liked because they tasted so freshly made).   Service was friendly and pretty quick, it's a one woman operation so I expected I'd be pretty slow but there was only one other group of diners there so I was pleasantly surprised at how quickly our food came out.  I highly recommend checking this place out, it exceeded my expectations. You won't be disappointed!"}
{"text":"I may very well have found the perfect dish to satisfy those who want to eat dinner and dessert all at once.  And while I was at it, I discovered a truly multifaceted local business.  I've already sung the praises of Habbouz, a local restaurant serving up delicious food with a primary focus on Tunisian cuisine (as of this moment the only restaurant in town with this emphasis as far as I'm aware).  Right next door to Habbouz is a restaurant, with hard to find Middle Eastern groceries as well as a Middle Eastern clothing boutique all in one spot.  There really is no place in town quite like Alzohour Market.  And there's no dish I've ever tried quite like the Bastilla.  Originally opened in 2003, Alzohour is the brainchild of owner Zhor Saad.  Originally from Morocco, Zhor opened the market first and foremost as a grocery store and clothing boutique.  The clothing boutique on the south side of the business contains a variety of cultural clothing for men and women and in fact I saw a couple of Muslim families shopping at the boutique during my visit here.  The grocery store is on the north side of the business space and contains a variety of dry and cold grocery items as well as a deli counter that backs up to the main kitchen.  In the middle is the sit down restaurant, which Saad added to the space in 2008.  The restaurant portion seats maybe 20 people and the entire business was operated by three people on the day I was here, with Zhor herself running the show.     I came here on a Saturday after attending a rally in support of the local Muslim community at the Islamic Community Center just down the street.  A number of Muslim families and supporters made their way here afterwards so I figured I'd give it a go.  Another driver of me coming here was an article I'd seen about Alzohour by renowned Arizona Republic food critic Dominic Armato.  In one of his \"Killer Dish\" articles, Dominic sung the praises of Alzohour's most complex dish of all.  The Bastilla.  In fact there's actually a video on AZCentral that shows all the ingredients and the process Zhor Saad uses to make this dish.  But there were other pleasant surprises in addition to the Bastilla.  When I arrived, Zhor very kindly sat me down at one of the corner tables.  As I knew what I was getting for my main course (and I was starving), I ordered my Bastilla right away and also decided to give a glass of their mango juice a try as well.  First though, the house salad, which you get with your entree as a starter.  The salad was a delightful mix of greens, olive oil, pita chips, tomatoes, and even some cucumber mixed in.  Nice and cold, but with a smooth finish each time thanks to the olive oil.  The mango juice was also a very pleasant accompaniment.  Not too sweet, not too acidic.  Just a smooth fruity drink to wake up my palette.    And then, at last, the main event.  The Bastilla.  The ingredient list for this dish is so long it would rival a Mexican Mole' recipe so check out the AZCentral article I referenced for the full rundown.  But basically we're talking about chicken and almonds that have been mixed with a ton of different ingredients, which is then cooked into a filo dough pie and doused with tons of cinnamon and powdered sugar.  The size of this dish was quite imposing when it arrived at my table.  But that first bite, wow.  A veritable cornucopia of different flavors swirl in your mouth with every bite.  You get the sweet notes from the cinnamon and sugar (both on top as well as cooked into the chicken), along with the savory notes of the chicken, saffron, cilantro and a number of other ingredients.  The volume of chicken in this dish was quite surprising and such that there's no way I could've finished this all by myself so I had to take some home.  In any event it's abundantly clear to me why Armato marked this dish as Alzohour's calling card.  I've never eaten anything quite like it.  Total cost for the salad, Bastilla, mango juice drink, tax and tip came to about $30.  I'd noticed a number of people who'd previously reviewed this business on Yelp docked it for poor or unreliable service.  I experienced nothing of the sort today.  Zhor was extremely friendly and attentive to me even with 6 other customers dining in.  Considering its just her and one or two other people working in the kitchen, the amount of food, quality of the food, and relatively short period of time they're cranking out the food is quite impressive.  By the way, you'll want to order the hot tea here sometime.  Zhor puts on an impressive show with the tea you have to see for yourself.  Great food, great owner, great find.  What a treat."}
{"text":"Moroccan food in Phoenix? What? How had I been working a mile down the street for a year and a half without trying this place?  Well, I finally stopped by. It's a little confusing when you walk in, because it's really a small operation... Didn't know whether to just pick a table, or let the lady working there seat me, or what. But once I got situated, things started getting a little more relaxed.  The menu is impressive indeed, with a good six or seven dishes that were all calling my name. I ended up opting for the lamb tangine with soup and rice, and the lemonade. The lemonade is as good as any delicious lemonade you'll find at a Mediterranean place, by which I mean it actually tastes kinda like lemon.  I like that they make it a little tart - the same way they do it at my favorite Lebanese places.  The soup was a tomato based soup with carrots, chickpeas, lentils, spices, and possibly some other things. It's OK, I'm not a huge fan of that kind of soup, but it went down nicely, even on a 110 degree day.  Of course the tangine was what I was looking forward to most - the only way I can describe it is succulent. The lamb is fall-off-the-bone tender, and presumably cooked in the clay pot after which it is named, along with some figs and an aromatic sauce.   To complete the meal, I had some baklava for dessert. I figured I might as well try it, since I hadn't had baklava in awhile. It was delicious. It was drizzled in a light syrup, and wasn't quite as overwhelmingly rich as baklava can be sometimes.   This is definitely a place where you can expect to relax - it's a small operation. But just savor it, you're in Morocco!"}
{"text":"Halal Hookup?  I came here on the recommendation of a friend who stated that what is the best middle eastern joint out of all the popular places in town.  As my friend and I entered the restaurant we were cheerfully greeted by the owner and was warned that they had run out of the chicken option for that week. Immediately we were given bottles of water instead of tap water without asking. I asked the owner why she had done this and she told me that they had run out of ice and would rather have me a drink bottled water. It would have been nice if she had given us the option in the first place.  I decided to get the lamb tagine (marinated lamb shank served over rice) which was a popular dish of the restaurant. Did dish was simple, the meat was very easy to pull off the bone but was a bit on the dry side. I couldn't understand the appeal of this restaurant, and would much rather get my halal hook up from other places in the valley especially in Tempe for less than 15 dollars.   The owner disappeared for the remainder of our meal and when we ended our meal, the owner was nowhere to be found at the store front. We ended up having to find her office and asking for the check."}
{"text":"We were passing through Phoenix on our way to California, and eventually to Seattle, and we found this family friendly restaurant just near our hotel. We were craving for Moroccan couscous and lamb Tajine. Boy was it delicious! We had the lamb Tajine, and my daughter had the chicken kebab. For dessert we had the kunafah. Everything was delicious and we though we were somewhere in  Marakesh or Rabat. The owner went out of our way to accommodate us by making fresh kunafah even though it was sold out as we went for a late dinner."}
{"text":"Definitely a fan of Moroccan cuisine. Delicious chicken couscous, lamb, and goat."}
{"text":"There ( almost ) is no need to hop the Marrakech Express since we have Alzohour Market right here in Phoenix. Islamic clothing , groceries and other items are sold here but there also is a very modest small Moroccan Restaurant and Bakery here. The food we tried was delicious. Service was VERY pleasant but terribly slow. I think it took them a half hour to bring our beverages. Only one  other small table was in the restaurant and our meal was a two hour stay so that should be noted. I also noticed that table of four people had each plate delivered to them one by one and NOT TOGETHER! I think it might be very hectic for them to serve more than two tables at a time.  We shared the B'Stilla. It's a Moroccan Appetizer. It's a very large House Made Phyllo Pastry stuffed with shredded chicken, almonds, and cinnamon. It very delicious and certainly unique. It really feeds four or more people but we wanted to try it.  Then we shared another Moroccan dish the Fish Tangine. It was Cod on a sizzling skillet in a Tomato based sauce with onions ,  bell peppers , preserved lemons and exotic spices. It was very fragrant and spicy! They gave us side salads and a big plate of fluffy long grain rice to share.  You can get Moroccan without the hassle of going to Marrakech.   This building is Halal that means no pork is in the building and a big wall of A Grade Maricopa inspection reports are posted on the window."}
{"text":"This review is for the restaurant...  We were looking forward to eating here, but when we walked in we waited around for about three minutes with no one showing up.  Then when someone finally did I'm pretty sure she was arguing with someone on the phone, she sat us down, tossed some menus down, then walked off. We sat there for a good 5 min with no checking in and hearing the ongoing argument. We left."}
{"text":"Very disappointed that we came to eat during their designated hours but it's all locked up."}
{"text":"We went in there with a group of friends and was pleasantly surprised with the quality of food. The favorite picks from the table were goat Tangine, Coucous lamb and chicken Kabsa. They cook the food fresh and the aroma of hot cooked food itself gets your taste buds to sing happy songs. The owner was present, very friendly and took good care of us. Will definitely come back for some authentic Moroccan flavors. Plan your visit when you are ready to spend sometime there as they cook after your order is taken."}
{"text":"The food is GREAT! The owner lady is super sweet and welcoming !!  I would give this place 5 stars on food quality and a 4 on service , because it's kind of slow (the chef also is the server , so, makes it extra slow) !!! Once you eat though, you don't even care about the fact that the service is so slow haha !!! Check it out!!!!"}
{"text":"First time trying Moracon food. Had couscous with chicken and vegetables. Fantastic new flavors.... Large portion that I was unable to finish. Customer service was awesome. I will be back as I saw many things on the menu that I must try.."}
{"text":"Absolutely delicious meal - couscous with lamb for my husband and bastilla for me. Generous portions and wonderful seasonings. Be prepared for a relaxed pace and watch out for small bones, but the meal was extremely enjoyable.  I would love to see the bastilla in an appetizer size, because it's a little too sweet to make an entire meal.  You might want to share it with a dining companion, which is what we did.  We will definitely come back."}
{"text":"An amazing cook worth the time you spend waiting everything is made fresh and with lots of love."}
{"text":"Went there expecting another back room table place. NOT the case. Was extremely amazed how just one lady can cook, run the meat counter, ring up customers in the front, take orders and serve food and still remain delightful. If you are understanding of the culture you know that time is unimportant, the food is why your there. I asked for a usual Moroccan drink and the owner brought out a unique beverage that i can only say you have to try just to try it. At the end of a fantastic meal I again  asked what a usual dessert is and she came out with a wonderful seminola flour pastry with her own homemade cream filling bathed in honey, WOW! Making a list of friends to bring there, cant' wait to go back."}
{"text":"My friend found this small Moroccan grocery and invited me to stop by for dinner. The interior consists of a grocery and clothing section, and a tiny dining area. There was not much of ambiance as we were the only visitors on that evening. It's a one-person operation and the owner does everything from kitchen to the floor.   The Harira ($3.99) came with lentils, tomatoes, garbanzo beans and cilantro soup. The blend of ingredients and spices made it zesty hearty with a good lift stemming from a mix of lentil and cilantro. It was a light opener and one item to consider for those looking for soups.   The Baba Ghannouge ($4.99) came with baked eggplant, sesame sauce, garlic, and lemon. The thick eggplant consistency was garlicky and addictive. The zesty lemony flavor nicely intertwined with the deepening sesame sauce. However, the bursts of eggplant flavors were held in check and in need to be more striking.  The Bamiah ($12.99) was put together with a large bulky piece of simmered lamb, saffron, okra, and a combination of spices. The okra was very tasty and nicely stewed. The outer-layer of the lamb had some dry spots, but otherwise it was tender and easy to fork into. The mix of spices could also be more intense and integrated. It was missing one note that could have brought it all together.   The Goat Tagine ($14.99) was culminated by a large bulky piece of goat with the bone in, saffron, and spices. The goat too, had some dry spots on the outside, but it was still very tender and easy to fork into. The aroma was sensational, but I wished the goat were seasoned better.  Overall, the food was solid but not spectacular. There were some minor wow factors stemming from the soup and the wonder aroma of meat and spices. Despite the missing notes that could serve as a bridge between the meat and broth, but the drizzles were still very tasty when served on top of our generous servings of rice.   Service was very personable and friendly. It goes without saying, but the one-person operation will cause the food to take some time to arrive. I'd be very interested in coming back to try their good-looking Bastilla."}
{"text":"We shared chicken tangine, bastilla and kunafa (dessert). All were delicious and highly recommended.  The food was expertly prepared and graciously served. Don't let the strip mall fool you. Alzohour Market offers a dining experience you won't soon forget...and one you will want to repeat. We're looking forward to our next visit. Hope to see you there!"}
{"text":"Stopped in today to try the Bastilla and it was delicious.  The service was nice and i would definitely recommend this place."}
{"text":"Stopped by at 11:20p today and both the market and restaurant were closed up.  Did not see a posted hours sign to see if the hours on Yelp are incorrect.  No signs anywhere about emergency or  anything to explain the closure, either.    Super disappointed, I'm here on vacation and went out of my way to come here.  Oh well, maybe I'll give them a second chance in the future, I really wanted to try that b'stilla."}
{"text":"This place genuinely is *as good as it gets*, in many ways. I feel that since my last review, they've genuinely upped their game significantly, so it's time to rewrite and re-evaluate everything.  I've eaten here probably about ten times now, and every time the food is consistently *amazing*. The bastilla will change your life. I'm serious. If you've never had bastilla before, or had it somewhere else, then you're in for a serious treat as you stuff your face with the real deal. Perfectly balanced, and presented beautifully. The chicken tagine is served with delicious olives and preserved lemons. All of the tagine dishes are slow-cooked and just fall apart when you touch them with your fork. The couscous is light, fluffy, and fills your belly with the blissful contentedness that only a home-cooked meal can deliver.  Service is always fantastic. A friend and I once sat at our table for probably about four hours while chatting. Our tea was always refilled, and the owner even brought us a dessert on the house.   They've recently expanded their dining area by knocking down a small wall, so they have more tables (which will be *VERY* helpful during busy times!). They can get busy here, but even when they were the wait for our food never seemed too long. Understand, folks- this isn't fast food, nor is it a speedy restaurant where you get in, eat your food, and get out. You're meant to linger, to experience the setting and the tea, to salivate with anticipation when you see other peoples' dishes, to savor every sip of their AMAZING lentil soup.   Their market has also gotten much nicer. Even though most items still aren't priced, the variety and organization are *MUCH* better than when I first came. We've gotten several sets of housewares from their selections (especially a beautiful butterfly tea set!) and even though their offerings don't span the gamut, there are definitely things here that you won't find at Fry's.   All in all, this place is an absolute delight and this five-star review has been LONG overdue. Mostly because I've just been too damned lazy to Yelp lately."}
{"text":"A while back, I read reviews of this place while searching online for Moroccan food.  Have eaten here twice since then.    The overall business is quite spacious.  It encompasses a boutique, grocery store, and small dining area.  The owner says that she will be expanding and upgrading, but not sure of a time frame.    I'm mostly interested in the food, so as long as she keeps cooking up made-to-order platters, I'll keep visiting.  The food is yum yum yum to my tum tum tum.  I can barely pronounce the dishes and I surely can't spell them, but you can find  poultry, red meat, fish, and vegetarian food on the small menu.  There are pictures at http://phxfoodnerds.com/viewtopic.php?f=2&t=1029&start=20  -  salad: wonderfully green, doesn't come with cheese (I detest cheese in my salads!), and is dressed in a light tasty vinaigrette. Morsels of toasted pita on top. - spinach pie: looks and tastes homemade (I'll order two next time.) - baba ghannouj: hearty, the eggplant is blended well and it's not bitter like some other places. -  kashkbademjan: warm version of baba ghannouj that's topped with olive oil, spices, and crumbles of nuts.  I could eat this alone as my meal - fish tangine: delicious with or without the marinated lemons. (The owner had run out of lemons on the second visit here.)  It arrives to your table sizzling hot.  It looks like a stew at first but once you cut into the fish and scoop up the veggies you can see that's it's a nice chunky sauce.  A bit oily but tasty.  With all the appetizers and salad, you can split the tagine easily between 3.  Just a note - If you're planning on going to Alzohour with more than 3 or 4 people, I highly recommend calling ahead.  Let me repeat.  If you are going in a group of more than 4, I highly recommend calling ahead because otherwise you might be in for a long wait to get dishes on the table."}
{"text":"First, the food is the 100% the best middle eastern food I've ever had. I dream of the lamb Tigine. The flavor and textures are heavenly. The owner is one of the sweetest women I've ever met. She cooks the food, serves and sells very beautiful Arabic clothing. The food was amazing, service was on point, and I bought a dress from there. It was georgous, the owner helped me choose it, she has amazing style and I value her honest opinion. I am so in love with this place!"}
{"text":"This place is way over priced, and their food taste just OK. The lamb tagine was too sweet. Nothing really impressed me."}
{"text":"Yum! The food was excellent and tasted home made.  We ordered the fish tagine and the lamb tagine with rice and bread, and both of them were boiling hot and very flavorful. Afterwards, we drank some tasty Moroccan green tea and had a nice chat with the owner/chef. I highly recommend this restaurant.  Be sure to check out the market as well for interesting products from the Middle East, North Africa and the Balkans!"}
{"text":"As a family, we are trying foods from around the world.  Tonight was Morocco night so we went across town to try Alzohour.  It was a wonderful experience and the food was fantastic.  We got it to go so we had to wait a bit but it allowed us to take in the full experience.  It is a family owned business and they all do their part to bring it all together.  Go in with an open mind and just take in the experience.  No, it is not a fancy place and they don't run it like a chain restaurant, they do it how a family owned restaurant should do it.  We are glad we made the trip and experienced the flavors of Morocco."}
