{"text":"The signature cake, the Amadeus is my favourite cake of all time - you must try it! Everything else is pretty good too. Everything looks pretty as well."}
{"text":"Just checking in the fantasy cake shop. The cake taste so good. Not too sweet and so creamy. Macaroons is nice too. But the price is a little high. Want to try the whole cake next time."}
{"text":"I always drive by this place when i'm around Promenade mall but I never went inside because the strip plaza didn't seem to have much to offer. So I was pleasantly surprised when I did enter the patisserie because the decor inside is simply amazing and certainly no reflection of the strip plaza. Inside the store, they have several tables for sitting which were occupied even as I went in near closing time. They have a huge assortment of cakes, mini-cakes and some pastries. I bought a mini Berry Cheesecake to celebrate with my friend and I think that was one of the more popular choices, and because my friend loves cheese and berries ^.^ Unfortunately, I was in a rush so I got my cake to go, but for sure I will drop by next time.

**If you check in, you get a free small coffee**"}
{"text":"After an apparent change in ownership must say the quality of the cakes deteriorated. We used to love ordering cakes from Amadeus for special occasions. Two weeks ago ordered a cake for my father's birthday party. Chocolate mousse cake. The cake was decorated clumsily and many of the  20 people who were invited to the birthday party did not enjoy the cake. We had so much left which never happened before! The cake was not fresh and tasty. Was not worth the steep $75 price...
To our dismay, complaint to the actual store manager went unnoticed. Will not purchase there again and will not recommend Amadeus at all. There are far better tastier and better value fine cakes out there!"}
{"text":"Excellent! We have just moved to Richmond Hill from downtown Toronto where we bought our cakes and pastries  from Dufflet Pastries or Harbord Bakery. 
In October for my husband's birthday we had Amadeus Black Forest cake. It was the best Black Forest cake we have ever had. Just amazing! 
Yesterday for my son's birthday we had Amadeus Berry Cheese cake. Another hit! The oreo crust with the baked cheese cake and fresh berries. Again. just amazing! 
I have placed an order for Amadeus Strawberry Shortcake for my daughter's birthday in two weeks. We can't wait. We know it will be just amazing! 
I would like to thank the Amadeus staff for making me a very happy customer! Great Service!"}
{"text":"The croissants were crazy flaky (extra butter between layers please :-), though I personally prefer a bit more chocolate in my chocolate ones...I don't know of any places that have croissants as flaky in Boston (we have a chain called Au Bon Pain that does a decent job, but it's a lot heavier and greasier).

We also tried their tiramisu in a chocolate cup, ameretti (sp?) cake, black currant cheesecake, and opera cake.
The tiramisu comes in a cute chocolate cub that's edible...the only negative was there was a bit too much expresso in the lady fingers (a bit too wet). The marscapone cheese tasted great and the chocolate cup was definitely a nice presentation.
The ameretti cake tasted a bit too much like alcohol for our taste buds, but if you're into ameretto flavored cakes, it's a good one...it was extremely moist and the chocolate outside was smooth.
The red currant cheesecake was a surprise...one of our friends wanted something w/ fruit and this seemed interesting with the gooseberry on top. The currant jam on top was a nice balance to the rich cheesecake underneath.
The opera cake was nice and chocolately...my favorite of the four fancy desserts. Nice layering of textures and the pastry wasn't soggy."}
{"text":"Excellent cakes, very fresh and beautifully made.  The cakes are pricey but the quality is superior.  The only thing I don't enjoy is the long drive to get there, kind of out of the way for mid-town and down-towners."}
{"text":"Absolutely wonderful experience ordering cakes for my bridal shower. Staff were quite helpful and communicated well via email and phone in helping me with my order. Everything was ready on time and they were able to accommodate us as best as possible. Prices are a little high but you are paying for the quality of the foods. We ordered 50 small strawberry shortcakes and the mango coconut ones. We got rave reviews for the cakes and how not only were they so pretty but delicious. I would highly recommend this place!!"}
{"text":"Excellent cake selection. The presentation is amazing as is the flavour. They have familiar items such as red velvet and tiramisu, but how they did their cakes seem and taste upscale. It's not too expensive, around 5 dollars a piece (for a superb dessert). I've gone to other places for dessert and they sold good cakes for 7 dollars a piece. Amadeus does mark which items are gluten-free."}
{"text":"My wife bought some pastries and creme brule plus a small strawberry shortcake.  It was pretty decadent ... I'd hate to think of the calories ...  Cake was quite good, moist and a fair amount of whipped cream.  Also not low cal.   But I guess when you're into dessert you're not gonna get low cal.   The store is quite elegant.. clean white and dark flooring ... somewhat modern looking .  Desserts on display are very enticing under glass.  Cannot speak about other products but the items we purchased were quite good.  Everything else looked quite nice.  I would tend to characterize as pricey but when you consider the cost of ingredients these days I guess  you get what you pay for."}
{"text":"OMG! To die for.... best best almond croissants. mmmnnnnnn... 
Decent to Good customer service. :D
Pricey but soo worth it!"}
{"text":"awesome macaroons and delicious cakes...and great service it was a great pleasure in meeting anat the baker for our wedding cake..."}
{"text":"Their strawberry shortcake is to die for! Fluffy, light, juicy but not too sweet. 
Also love their macaroons. Very reasonably priced at $2/each."}
{"text":"The bakery looks very normal when walked in.  What makes the difference is the cake itself.  The price is on the high side.

One of the most recent trial is the lychee cake.  The flavor is so authentic as if you are eating lychee.  The lychee is on the top layer and the bottom layer crust is so fruity and tasty.  It is not too hard and is crispy enough with a mixture of different flavors. 

Friends who try it immediately want to go and buy more of its cakes."}
{"text":"Simply the best  -FINE- cakery in Thornhill. I've been getting birthday cakes here for several years. They have mini slices to try. Good to sample before buying the big one or great to spoil yourself with after a workout. which I did today. we all exercise to eat right?!   

First time dining in here today though. After looking over the great selections behinds the glass displays. I decided on a piece of the St. Honare (choux pastry custard filled, with fresh cream on top, glazed with caramelized sugar) + macchiato (this is a caffe macchiato (1 shot of expresso with foam) not a latte macchiato you get at Starbucks) so this baby is strong!!

It was a fantastic combo. The sweetness countered the bitter coffee perfectly. Very fresh custard and cream.

I have some gripes though and it has nothing to do with the food. They serve using plastic plates and cutlery. My macchiato was served in a paper dixie looking cup.  Suitable for a picnic?  But c'mon for a cafe.

And the staff was unprofessional, talking amongst themselves like ' they can't wait to get out by such and such time, 'wear slippers on the job or running shoes.' Okay that something you talk in the backroom and not out loud with customers around. 

Despite the gripes, the cakes and pastries are bar none the best in the area. The grade is notch above anything you'd get at a normal bakery or grocery. Yes - it costs more. Roughly ~ 20% more but the amount of detail and freshness can be tasted with each delectable bite. Try it.

Recommend!"}
{"text":"This is a nice place. The pastries are around $6.50 per a piece. They have all kinds of typical French bakery products like macron. The qualities are good. I can get anything I expect from French bakery. The place is clean and their seats are spacious. However, the bathroom is in the kitchen and it is strange."}
{"text":"The Elysee honey nougat cake is a personal favourite. The pastries are displayed well beneath the bright interior lighting. Several little tables and no visible washroom (ask the counter staff to let you into the back) don't make it conducive to sit down and have a leisurely bite. Looking forward to trying the other offerings."}
{"text":"This place's pastries taste even better than they look. 
Elegant minimal counter, the beautiful cakes really do speak for themselves. This is a must go to if you have a sweet tooth and are in the Vaughan area. Definitely will be back soon."}
{"text":"The place is nice, clean and tidy... however the quality of the breads, foods, cakes is only average, you can find similar quality at your local Metro (not walmart tho, Amadeus are at least 1 notch above them)... Don't know what the whole hype is about...i'm originally from Edmonton and it's astonishing this store is considered one of the best in Toronto when in Edm I can name at least 3 places that are light years ahead in both quality and price... and Edm is what 1/6 the size of the GTA? geez...
Been a few times already to keep trying their different breads/cakes so I can make an opinion based on some brief experience.
This place is over hyped is all I have to say.. but more power to them and kudos for creating such a good name to themselves.."}
{"text":"Loved the decor, and the cake takes the, well... cake. Amazing flourless options and always new options for changing seasons/holidays. Pretty pricey but still a better option than grocery store bought."}
{"text":"Came here for tea time on a holiday; it was crazy busy continuously. They have a private parking lot but there weren't many spots available because the plaza is really small. The patisserie itself is fairly large compare to others. They have seatings available if you wish to enjoy your tea and pastry on the spot but I highly recommend to find seats first before picking out what you want if it's busy. 

I liked how the staffs were friendly and they also came around to wipe down tables so you feel comfortable seating. The ambience of the patisserie is very bright and clean, white and pink in colour.

We ordered three different tarts which were all very delicious. The flavours weren't overly sweet and tasted fresh. We redeemed a cup of coffee with the purchase of our tarts by checking in (so make sure you do that!). 

Overall, I love this place and will be back again."}
{"text":"Drove by this place and decided to have dessert with coffee. Cappuccino were made to delicious expectation. Our group ordered 3 cakes between 3 of us, and were surprised how filling the cake may be too! we were not a huge fan of the mousse cake, but love the tirimisu. If I am in the area, would go back! Great place to bring family or friend for quick catchup"}
{"text":"This place is a gem in the area.  Amadeus doesn't disappoint it is always packed but have their own parking lot with around 15-20 parking spots so it isn't too bad.  Decor is nice and chic here, lots of staff to assist you.  The display of the cake is amazing.  The pastries is even better than it looks. Pricing is on par with downtown stores but I say this is the best pastries place I been to.  The cakes are SOOOO Delicious, I had the Exotic cake (mango and coconut) and the Pistachio Delight!!  Also had the almond croissant.  I will def be back to try all the other ones.  Worth the price for sure.  There is also a nice seating area with around 5-6 tables for you to enjoy your cakes."}
{"text":"Nice place, very clean and big cake choice"}
{"text":"Came here on a week night and it want too busy.

Pros:
- Spacious
- Seating area
- Food tastes pretty good.

Cons:
- Pricey for the quantity offered."}
{"text":"Simply The Best cakes in North York!
For years I am buying all my cakes at Amadeus and I love it!   

Do not buy Macaroons here though."}
{"text":"I thought this place would be a nice place to visit since they offer free small coffee couple of days ago.  I came here and was extremely impress with the dessert display.  The desserts pastries were all petite and elegant.  They all looked so good and it was really hard for me to pick out a dessert for my afternoon tea.  The price us pretty reasonable.  I think i paid $5.95 plus tax for my mont blanc if i am not mistaken.  The mont even has a small vanilla macaron on top.  I was super happy.  And it was really tasty and velvety smooth.  The servers were super friendly.  My friends tried some other delicious treats which were also awesome.  

Before I left, i also bought a dozen colourful macarons for $1.85 each.  Very good price.  The only drawback to this place has a wide and narrow design which feel a little odd for me.  Overall, i had a good hangout time with friends."}
{"text":"Everything tastes really good here, one of the best French macarons for a reasonable price compared to competitors. I live nearby and always grab a pack when I'm heading to a family dinner. The macarons are always very fresh. Their cakes are well decorated and unique compared to the LaRocca cakes everyone always gets. 

I always find the staff rather rude to me and I don't know why... I asked which cake is the most popular and she said \"it depends what you like, if you like cheesecake get cheesecake, you like chocolate get chocolate, I don't know what you like\". They aren't very helpful so research their menu online before going so you know exactly what to get."}
{"text":"I come here for the Macarons, their eclairs, and their chocolate croissants. I have been coming here for years now.

Macarons - beautiful and great quality. Crust is delicate and shatters delicately like and eggshell to reveal a succulent and moist inner filling. My favourite flavors are Pistachio, Raspberry and Rose.

Eclairs- best eclairs - though a little pricey in my opinon

Chocolate croissants- Just as good as michaels, but more succulent and flavorful on the inside."}
{"text":"This is my go-to place for when I feel like fancy dessert. Their selection stands out, in that they have dessert I cannot get anywhere else. The quality is outstanding, everything is always fresh, and their hours of operation are perfect for me (open till 10 during the week, and also late on weekends). Even when I come later in the evening, they always have what I want. I pretty much always get one of their newest creations, the \"Exotic\" which is a coconut-mango mousse fusion. Their Napolean cake is a little different from the classic, and the add-ons don't do it any favours, as classic is best (go to Chocolada for that). They also have great pastries (don't always last until the evening). My favourite is the apricot cream - flaky croissant like dough with a sweet custard filling. I have never tried their coffee/tea or made to order sandwiches, but they recently renovated the place to have an even more appealing sit-down area."}
{"text":"Layout looks amazing, cus service is amazing. Food is good. The ONLY reason why I didn't rate it a 5 star is that the owner told me not to put my bag on the glass because it will scratch his glass. Mind you I have a Tory burch leather bag, and the leather part was on the glass"}
{"text":"The macarons are so crazy good there's no other way I can epically describe the first time I sunk my teeth in..  Fresh,  crispy on the outside and inside is a sweet pillow of goodness almost like heaven. . Just the perfect amount of flavour per selection and I had the pistachio,  red velvet,  salted caramel and chocolate (something)..  You wouldn't believe what out of body experience you've encountered. . 100% decadence.  Pure love.  Always busy inside,  the staff are super pleasant!!  I still need to try their signature coffee and matcha next. . Oh yes how can I forget the cakes moist delicious and beautiful to look at!! . Great lil spot here in Thornhill.  Trust me.  Go.  For.  Yourself.  #SweetToothProblems"}
{"text":"I have been a regular at Amadeus Patisserie for years and they truly makes the best cakes in the GTA, at least in my opinion. The Amadeus and Mozart cakes are delectable; so light, fluffy and layers of hazelnut goodness that you won't find anywhere else. The recipes are truly something special. The mini-tarts are very good, especially the St. Honores. 

In the last year, they remodeled the whole place as it was a bit outdated (especially for the prices), and it's now a more modern cafe with more seating. Highly recommend it.

note to management:  add a washroom."}
{"text":"Such a great place.
Clean, cute, comfortable seating.
Lots of variety of pastries. Seriously, their pastries and desserts tasted great. Not to heavy, but rich in flavour. The lattes were also great.

High recommend, will be going for sure once a week."}
{"text":"A wonderful place to get your fix of delicious temptations like Napoleons, Macrons and Eclairs. A great independent bakery with a coffee shop where you can get real hand crafted coffees. The store is bright and modern looking. Tables nestled together for a cozy chat for 2 or a group of 4."}
{"text":"They have a large selection of beautiful cakes that makes me drool as soon as I walk in. I also really like the large windows that allow the sunlight to pour into the bakery. However, there are areas for improvement:

First, you have to be ready to help out with the cleaning. Unfortunately, they did not have any clean empty tables. I had to clean, put away used cups, and wipe down the crumb-filled myself before sitting down.

Second, the self-serve cream & sugar table was out of milk. I'd understand if this happens at a high-traffic Starbucks, but I expected them to check and replenish milk at a relatively more expensive patisserie.

Lastly, if you don't have something, don't put it on the menu. I tried to order an iced coffee, but was told they do not have ice until summer. 

My recommendation? Come here and just get the cake to go."}
{"text":"My favorite patisserie and coffee shop.   If you love fine pastries and delicious baked good stop by Amadeus.   This place is so chic and cute inside.   You will not be disappointed by the selection of treats.   I had the milliefleur and the strawberry shortcake.  I had two things because I needed to try more then one!   The milliefleur was so buttery and flakey and delicious,  the custard was to die for. And you could tell they used real vanilla bean extract.  I saw little tiny vanilla seeds in my custard.   The flavors were amazing.   the strawberry shortcake was also delicious:  the cake had coconut in it and it complimented the airy strawberry cream,  I am drooling just remembering how good the pastries were."}
{"text":"This has to be one of my favourite cafe/patisserie in GTA. 

I was fortunate enough to true Parisian patries and was craving for authentic sweets and delicacies from Europe. 

I was in the area and had to get a cake for Mother's Day. I stumbled by a vibrant pink sign. It caught my eye and went inside. As you step foot inside the cafe, you'll see a whole ro2 of pastries and cakes. They're beautifully decorated on their display case.

They have croissants and other dry pastries near the cash. Once you take a bite out of their desserts, it has a smooth texture and it's not overly sweet. Each mini dessert/cake is aesthetically pleasing. 

Pricing varies for the cake. The lowest is $35-$48 depending on the size.

Smaller desserts is approximately $6.50

You should try this place!

PS: the owner checked up on us while trying out dessert. He made sure that everything was okay. Great service!"}
{"text":"This comment may be outdated since this experience happened a couple of years ago; however, I've never gone back since - hopefully the cockroaches we saw the one time the party of us tried the place are gone and the \"Pass\" in the window is legit.  Nevertheless, not worth going back."}
{"text":"Tucked in right in the pocket of the Promenade mall area is this little french pastry shop. The shop itself is in a really small plaza with very minimal parking. Upon walking into the shop I was looking for a more french inspired Parisian feel to the interior but it was far from it. Standard table and chairs and super busy on a Saturday. Their pastries are lined up similar to how butter avenue and nadege would line up their mini cakes/ macarons in a glass cage. Each mini cake ranged from about $4 to $8. They did have a huge selection to choose from and i opted to pick 3 up to go. The strawberry shortcake was our favourite one, the cream was delicate and smooth, strawberries were fresh and they also incorporated cut up strawberries inside the cream of the cake. Although the cream was smooth, the cake itself felt very light tasting and was very enjoyable with a cup of tea. We also got this coffee flavoured cake and that at first had a very gelatin bite... the gloss from the chocolate was very shiny and wasn't that great of a taste... but after a couple bites it grew on us. It does have a strong coffee flavour so if you're not into that, I wouldn't choose this cake in particular. Lastly, we also got the pistachio tart (I think the Alize?)... the pistachio custard ontop was creamy and smooth and the shortbread crust was crunchy and tasty. 

We also tried their regular crossiant and my fiance said it was super buttery and crispy. Enjoyable but not to the point of craving it all the time. Macarons were also fair in price, for a box of 6, each macaron went for $2.10... mind you they were not mind blowing to the point of laudree or butter avenue but they had a good consistency in texture. (crunchy shell with a smooth and light filling). I don't know if I would purposely come back here just for the pastry as there are so many bakeries in Toronto with similar flavours/concept. Good to try if you never been before though."}
{"text":"Amazing deserts and cakes. If you need to bring a cake for a party this is the place to go to. Fresh all year round and special traditional deserts for Jewish holidays. 3 reasons why I can't give 5: (a) No healthy / sugarless deserts :-( (b) Expensive (c) service was not good yesterday.
However - I highly recommend"}
{"text":"I don't go into a lot of bakeries like this so this is based on my girlfriend's thoughts about this place.  She loves bakeries and wants to check out the best of the best in the GTA.  To be honest today was the first time I've ever had a macaroon.  We got the hazelnut flavor macaroon along with a shaler cake and a coffee.  The coffee to me tasted like ......guess!  Coffee! : ).  The macaroon to me tasted good but as said earlier, today was my first time eating one.  The shaler that we had was not that impressive but not horrible.  My girlfriend said that she felt this place was pretty expensive for the size of the sweets.  As far as quality she said she's had better for cheaper.  It was a very nice place with very friendly staff.  I have to admit for me though, I did enjoy that macaroon.  Can't wait to join my girl in her quest to find more bakeries in the GTA and eat more macaroons."}
{"text":"While I was visiting Canada I felt like a Princess. My Princess adventures were not complete without satisfying my soft spot for cute pastries. With the culinary influences from France, I definitely wanted cute French pastries to sweeten my trip. I found Amadeus Patisserie through Yelp and it was beyond what I was looking for in a pastry shop. Even the Toronto Star raves that Amadeus Patisserie is \"the best pastry shop in Toronto.\" 

This quaint little patisserie was brightly lit with a decent amount of tables if you wished to enjoy your sweet treats here. They had coffee, macaroons, little cakes and of course big cakes too. My attention immediately gravitated towards their little cakes so I could try a little bit of everything. The variety they offered had unique flavor profiles and unlike the pastries I have commonly seen back in the LA-area. With the help of their friendly workers I narrows my selection down to 4 choices that were either flavors I loved or popular selections from their other customers. I ended up getting: 

- Strawberry Shortcake ($6.50 CAD) - A much fancier version of a strawberry shortcake. 
- Le Roche ($6.95 CAD) - Plays on the flavors profiles of the loved Ferrero Roche: chocolate, hazelnut and wafers in cake form.
- Temptation ($6.50 CAD) - Delicious chocolate exterior with a creamy coffee mousse center. 
- Pavlova ($6.50 CAD) - My favorite and the most unique out of my selection. Meringue base with a raspberry center, lemon zest and cream topping. 

All of these desserts were beautifully and thoughtfully composed. Every aspect of the consistency and presentation was on point. Every bite was light, playful and tantalizing for my taste buds. My heart flutters in quite the whimsical beat while I reminisce these delightful goodies. I promise these desserts were just as delicious and graceful as they look. The culinary execution of these desserts are among the finest! My compliments to the pastry chef! I especially like how these French pastries were expressively sweet enough to be a dessert without being overly sweet. They pair well with a nice cup of tea or coffee. 

I had a sweet sweet trip to Toronto and Amadeus Patisserie really made my trip even sweeter. These desserts are worthy of royalty ;) I highly recommend Amadeus Patisserie if you find yourself lucky enough to be in the Toronto area."}
{"text":"This is my favourite patisserie in Toronto. It's bright and spacious and their pastries scream \"take me home\" I swear I really wish I have an excuse everyday to buy cakes here.  The cakes are so pretty and they have some seasonal things like in April they have flourless cake which is probably for passover. The small individual pastries are always a treats at the party. 

They also sell coffee and crosainat but I never got to try...it's always an in and out thing for me but one day..."}
{"text":"I searched on yelp for good croissants and saw a lot of good reviews from Amadeus. We bought a chocolate croissant and a almond croissant, turned out to be a big disappointment. 

The chocolate croissant has very few layers inside and yes, it is buttery, but way too buttery or oily IMO. Don't tell me good croissant is supposed to taste like this. I know how much butter is required for making good croissant and I've had better, less oily yet flaky and delicious croissants elsewhere. Same for the almond croissant. 

I haven't tried their cakes though, maybe I will give it a try..."}
{"text":"Excellent! Love the huge selection. We recently had the ensure of purchasing a gluten free cake, it was the most moist and flavourful cake we shave all ever had!
My friends were hesitant, due to it being gluten free; they were automatically turned off by the idea and were not interested to try! Between the 4 of us we nearly finished it and could have had more! 
Very very good stuff!
Will be back!"}
{"text":"I almost drove pass this place because it was within one of the smallest plazas and some TREES were blocking the Amadeus sign while next to it was a corner gas station which had bigger real estate. I enjoy the decor/presenation here although the on-site seating wasn't made for the most comfortable Dessert and Cappuccino enjoyment but did as required. 

Beautiful Individual Cakes($4.50+) and other large Cakes & Pies as well as Croissants and Baked items for sale. Quite a selection it definitely made a tough choice for us, however we did get Amandine(Rum Chocolate Cake) which had it's share of Rum flavour soaked into the Cake as well as within the Chocolate Mousse layer then coated with a Ganache GLAZE. Praline(Hazelnut Filling) had a smooth while Nutty flavour creme inside with tiny crushed Nuts inside to give it texture, then with White Chocolate Glaze and a drizzle of Caramel. 

They have a well equiped Kitchen as I took a peak while staff swing in and out. They have Coffees and Teas available for dine-in patrons of roughly 10 maximum capacity. If they had Loungey seats, this would be one of my go-to spots for some afternoon/evening Cake & Tea. 

Look at their website Gallery which has pretty accurate photos of their items for sale because the Unbaked Cheesecake was one of the things I have a good photographic memory of. 3.5 *Stars* just because they gave off a sense of dining in was an after-though with the paper plates and plastic forks."}
{"text":"Walked in on a Saturday unexpectedly. The cafe was clean, bright and inviting. Large display of cakes, pastries and macarons. It was a holiday weekend so there were tons of people but there was a lot of staff to assist. Got the pastacio delight. It was light and the the crust was done really well. Coffee was really good as well. Only downside is there is no bathroom. Would recommend for a quick treat or to get something before a dinner party"}
{"text":"Went here to pick up a cake for my birthday. The place was clean and staff were attentive. The staff that helped me was able to answer my questions about their different cakes. The cakes inside the display case were exquisite and nicely decorated. I ended up ordering the Amadeus cake which is gluten-free. The cake was moist and was not overly sweet. The cakes were on the pricey side but the quality makes up for it."}
{"text":"Amadeus is located near the bathurst and clark intersection in the plaza next to the Petro-Canada. I came here with a couple friends on a sunday afternoon and it was fairly crowded at that time but was staffed well enough to make everything flow without too much of a wait time.


When I was looking at the cakes a staff member offered to help which narrowed my choices down from the good selection of cakes that they had on display. I got a Lotus mini cake ($6.50) which was really light and delicious. The only downside to this place is the price, but the quality definitely seems to be there. Their bigger cakes are more expensive ($30+) but they all looked very delicious. I'll be back to try more of what they have to offer."}
{"text":"By far one of my most favourite cake bakeries in York Region.  The hours are convenient and they open most days of the year.  The selection of cakes and pastries is excellent. While it is pricey it is worth every penny because the quality of the cakes are amazing.  My favourite cakes are the strawberry shortcake and Marzipan."}
{"text":"Their cheese croissant is so good! Coffee is nice too.  This is such a nice and quiet place to do your work in the morning on a weekday. I will definitely come back again! 

**Free small coffee if you check in with a purchase of a croissant**"}
{"text":"This is a European style bakery and they do make \"Fine\" cakes. They are kind of expensive but then you do get high quality ingredients and it is a lot  fresher than what you buy at the grocery store.

They also make a great espresso and cafe latte

We ordered a cake for a birthday party and the guests all remarked on how fresh it was compared to previous big store purchases.

You may wish to also stock up on various small pastry and the selection is delicious

I saw most purchasers getting \"Coffee cake\" and it literally flew off the shelves before xmas"}
{"text":"Came here on a Saturday night.. They have a pretty good selection of cakes and macarons here:)lemon tart.. Cream puff...
Hazelnut cake.. Would definitely recommend all dessert lovers to come try it out.. If you are looking to buy the croissants, come earlier because they are almost sold out by the time I get there. :)"}
{"text":"Took some older family members after lunch. They have a very good selection of pastries and excellent coffee.

The meringue pastry was good, but just a wee bit crumbly. They make Ba-ba au rhum, and make it well. Not very many pastry shops even attempt it.

Good selection, good looking tasty pastries, simple atmosphere."}
{"text":"So for my birthday I got to try a cake from Amadeus that my mom got me. It was a Tiramisu cake. First time I tried a Tiramisu where the alcohol inside it started to soak the cake so much that when you cut it through the middle it leaks out a bit. The center of the cake tasted really strong of alcohol, but after the very first bite of the cake the taste of the alcohol goes away. My twelve year old sister who doesn't like alcohol thought it was fine, where I (sometimes called to be an alcoholic) actually thought it was strong. I think the strong alcohol part is what I found the cake to be special from other Tiramisu cakes, I'm assuming it's rum.

The cake was not too sweet, nor does it make you feel really full after one slice. Usually I'm bloated after one slice of cake and wouldn't be interested for another piece either because it's too sweet or I'm too full of it. But for this one, I actually wanted another piece. I was also not dying of thirst after eating it like I would for other cakes. Also, I'm usually frightful of whipped cream, or really thick and creamy types of creams. For this Tiramisu, the cream tastes just right and very smooth."}
{"text":"Came here for strawberry donut and dark forest. The dark forest here is the best dark forest I've ever had."}
{"text":"I got a croissant here with salmon and sprouts and it was DELICIOUS. Like REALLY REALLY DELICIOUS. I live downtown but would still come here because it's that good. Honestly, go and get their croissant right now because I promise you, it's what a croissant should be (not that I am an expert baker or anything, but I did live in France for awhile and this is up there with the croissants I used to get in Paris every morning from the local boulangeries). I am super pumped to try their desserts and cakes."}
{"text":"I keep coming back because its one of my bf's favourite pastry shops and because we live just around the corner. I have to say their selection is pretty big, but so far everything I tried tasted perry okay. However not good enough to make this place MY favourite."}
{"text":"Bought a cake for daughter's birthday (strawberry shortcake, big and expensive) turned out to be wet and not fresh. Got the feeling it was previously frozen. Guests left it on plates no wonder why. Bakery is good with some products other not so."}
{"text":"2.5 stars would be more actuate but half stars aren't available on Yelp.

Me and my boyfriend came here today and the desserts display reminded me of Nadege and I got really excited to try some things out. We grabbed 3 mini desserts: the berry cheesecake, the lemon meringue tart, and the strawberry shortcake. 

I was hoping they would taste as good as they looked but they didn't. The strawberry shortcake was bland, the cheesecake was also bland, oddly soft and watery, and the lemon meringue was just ok. Nothing here is worth the price being charged."}
{"text":"This place is great. Clean, recently renovated, over staffed and great - absolutely great treats. The prices are a little high, however my rule in life is you get what you pay for. 

Quality desserts with a great seating area now."}
{"text":"A high-end European inspired patisserie that rarely disappoints. The pistachio delight was a great balance of a solid fruit filled cake foundation crowned by a delicate green hued mousse."}
{"text":"I've never sat down in the location itself to have any of their little pastries or desserts, but I have had several cakes from here and each time it's fantastic. There is a wide variety of unique flavours and they taste excellent. The cakes are very well put together and wonderfully presented. If I'm north of Toronto, this'd be my go-to spot for cakes for any special occasion."}
{"text":"Clearly it has been a long time I had been at Amadeus as it was completely different. New ownership, cleaned up space, no more bags of frozen dumplings for sale off to the side.

It smelled wonderful. I went in for a macaron. The red velvet was beautifully made and somehow they managed to get the icing every so slightly tangy like cream cheese icing. Well done.

This is a beautiful and clean shop and each item looked pristine."}
{"text":"Love it! Their Mozart is the best cake ever. And I love their creme brulee and almond croissants. I work nearby and often come there for coffee and croissant in the morning. I have to limit myself as I need to watch my weight - bad genetics :-)"}
{"text":"Definitely a go to place for sweets. Love the eclairs there. Cakes are all r ally nice and fresh."}
{"text":"Great selection of tasty pasteries and deserts. Russian style! Very classy and chic.
Downsides: bit expensive, rude girls working there (russian style) ;)"}
{"text":"Awesome pastries and cakes. Highly recommend for every occasion."}
{"text":"they clearly changed the baker. used to be a big fan of their strawberry cake, but it is not good anymore. very disappointed."}
{"text":"This place is lovely! Been wanting to try this place for 2 years now and only earlier this year, I had the opportunity to do so. The staff are all very nice and polite. Knowledgeable if I may add too. Coffee was tasty and their sweets were not all sugary. Flavourful and wonderful textures from the different desserts. I definitely recommend this place if you're looking to treat yourself, family and friends!"}
{"text":"I don't really have a sweet tooth.. but when I need a European Pastry or cake, this is the place to go to!!!

Been coming here for years for birthday cakes!! 

Would recommend without a doubt!"}
{"text":"Service: the girls who helped me were well put together, helpful and efficient
Aesthetics: the cakes and confectionary look really good and appetizing
Prices: too high, the quantity and quality do not justify it but they think they can get away with it because of the attractive cakes and sweets
Taste: very disappointing. Everything looks so yummy and inviting but when you put it in your mouth... NOTHING
Parking/plaza: no place to park, a small plaza with no parking is annoying especially when the jewish dry cleaner next door has all the reserved spots with NO CARS and NO CUSTOMERS"}
{"text":"A modern pretty looking pastry cafe with yummy sweet pastries you can view and pick from a showcase as soon as you enter the cafe.

The place was clean and had plenty of seating. I had a cappuccino and a pistachio tart and my boyfriend had the Mont Blanc chocolate moose cake. Came up to $17~. IMO I think thats expensive for two pastries and a coffee, but I did not mind at that moment as we were looking for an excuse to go that night. I wish they had more coffee selections. 

It was all delicious. The cappuccino was not the best I have ever had, but it was decent. The girl did her best with the cappuccino art...kinda failed at it, but she did try :D lol The pastries are what tasted really good. I might have to go there multiple times to try each one ;)"}
{"text":"The best cakes in Toronto in my opinion and i've hunted for a store that has it all. 

They have traditional mousse cakes, but they have some great interesting cakes like the Amadeus (tastes like a ferror rocher), the paradise (with passion fruit cream brule, mousse on a rice crispy crust) and various other favourites. I've tried them all now and only go there for birthday cakes now. 

The only problem is everyone expect me to get them an amadeus cake now and its getting expensive ;) I think i need a membership card or something."}
{"text":"During my one hour stay here on a Wednesday night fro, I was left rather disappointed due to the following:

I ordered the matcha latte which had a pleasantly strong matcha taste, however, it left spoonfuls of matcha powder in the mouth. Good thing customers can help themselves to water located next to the entrance.  

Their individual cakes average from $6-8. The cakes I tried were Pistachio Delight, Temptation, Alize and Raspberry Macaron, all of which were just ok to me. My favourite was Alize. This cake had a very beautiful aroma of pistachio and a crunchy texture of assorted nuts. The Pistachio Delight was recommended by the staff as I wanted something lighter. The first few bites were good but halfway through, the pastry base turned soggy. The center of this cake were maraschino cherries. In my opinion, all the cakes I tried were too sweet for my liking.

The colourful display of cakes was very attractive, but upon closer look I could tell that not every cake's presentation was made to perfection. It wasn't that the presentation was bad but when compared to other bakeries I've tried that are priced in the same range, their pastry chefs pay greater attention to finer and more intricate details of the cakes. I suppose for the price I paid, I was expecting cakes that not only are delicious but beautifully handcrafted on the outside and inside.

Last but not least, although this bakery was clean and brightly lit, half an hour prior to closing I witnessed a staff taking the trash out, putting the dirty cups into the sink WHILE wearing the SAME pair of gloves she used to handle the cakes. Shortly after, without washing her hands or removing those gloves, she rearranged the macarons in the display case. That was a huge \"X\" for me!

Seeing that many customers are praising their croissants and eclairs, I may give this cafe a second shot."}
{"text":"This is a review of their pastries and macarons. The pastries are beautiful but are just overpriced sugar. I got 3 different ones and they had no distinct flavors, just sweetness. The macaron are great and I'd only ever come back for those."}
{"text":"This place has shady and insulting business practices. I have bought a case of pastries there and when served it to a party of friends and family it turned out some of the pastries we're \"day-olds\". They were absolutely not fresh. I returned there to complain and expected to either get a refund of replacements and I was turned away while I was told that there was no way this could have happened. They refused to even look at their product. Such arrogance and patronizing attitude. I have never returned there again."}
{"text":"Not worth the hype! 6 or 7 years ago this was a wonderful patisserie but over time the quality has gotten worse, even service is bad. They do have some decent pastries but they're way too overpriced, save your money and go to another."}
{"text":"Whenever I want a high-quality cake, Amadeus never disappoints. Sure, a lot of people might argue that their cakes are overpriced and not worth the money. Sure, they are not cheap. if \"cheap\" is what you're after, you can pick up a cheaper cake at Loblaws, Sobeys, or at one of the Russian bakeries not too far away at Bathurst & Steeles. Amadeus specialises in making exquisite culinary masterpieces and they charge a premium for it. Plain and simple.

In terms of quality of ingredients and taste, Amadeus is second to none. In terms of cost, their prices have gone up in the last 7-8 years, but so has inflation and cost of ingredients.

If you value quality over quantity, you won't be disappointed with either of Amadeus' creations. I, for one, am looking forward to the next occasion that would call for a trip to Amadeus to pick up one of their cakes."}
{"text":"Used to buy cakes and pasties for many years. It was the best bakery in GTA. They used only real butter, cream etc.
Was extremely disappointed to find that my favourite eclairs got modified.
The cream inside is custard without butter and on the top it covered with some artificial \"vanilla\".
Tastes awful.
Sad..."}
{"text":"Amadeus Fine Cakes is a cake/pastry cafe right at the corner of Bathurst and Clarke in Thornhill.

The cake choices here are decent. No you are on a diet cake, no I cannot eat sugar cake, no can I have something light cake... all of them are the one that for sure make you fat, with tons of sugar, tons of chocolate.. and so rich and creamy... But at least they do taste good and you won't regret eating them.

You can see them all nicely displayed in the display case and with the name and what they are made of properly labelled. That is good for me so I don't have to ask what in it!!

The inside of the store is really open and airy.. there are cafeteria style seating and self helped service if you decide to eat in. I do wish they serve the cake on proper plate and give us real forks instead of plastic forks and paper plates to eat on...

They accepts Visa."}
{"text":"You would barely notice that this bakery is there if you never heard about it. It's located in a small plaza along Bathurst just south of Centre St.

The bakery serves a variety of pastries and you will be blown way by the selection of desserts they have. They also have a wide selection  of macarons.

I came here for lunch on a Saturday afternoon after a friend had told me about the place. I had the Tuscany sandwich, which features a lightly grilled croissant with sliced portobello mushrooms, sundries tomatoes, seasoned with pesto. It was delicious! Topped it off with a cappuccino.

Also bought a box of Sufganiyah, which was recommended as well.

This is a great place for coffee and dessert or a short lunch."}
{"text":"Amadeus is a cafe that sells coffee and cake and the cake is by far the main attraction here.  They sell cake by the whole or in slices if you want to sit in there and eat.  Tons of people go here during peak times so just watch out if you want to take a seat!

I first got notice of this place when it was our friends birthday and they got her a chocolate based cake from there. Everything about it was amazing from the texture to taste to looks.  They cake literally melts in your mouth and you just end up wanting more.  This led to me buying another cake from here which was the Pistachio based cake and it definitely did not disappoint.  It's a bit pricey ($35) but if you want to treat your special someone this is definitely the place to go to impress them!"}
{"text":"Hard to keep it strictly professional as this place has always meant a lot to me, however I know for a fact that the owner puts a great deal of effort and thought into the bakery. The goddamn pastries are sized perfectly to fit the boxes that coincidently fit onto their designated areas. Pastries are made fresh every day and the smells that come from this place can be sensed from my house. However, there is never anywhere to park and if you can't, no pastries for you. Furthermore, if there is nowhere to sit down inside (which happens a lot as the location is tiny), then it isn't even worth the trip. Half the experience is devouring the atmosphere with your treats. I recommend going on an early weekday morning."}
{"text":"The best patisserie in town! I stumbled upon this place driving in the city and ever since then, I've gone back without hesitation. 

Favourite dessert so far is the St.Honore and I have yet to try to amazing Strawberry Shortcake that everyone raves about. 

Staff are also really nice about giving recommendations and welcoming you in and out of the cafe."}
