{"text":"One of my favorite spots to go. If you're in the North Las Vegas area and you're craving Thai food, this place will do no wrong."}
{"text":"Been ordering foods for pick up since I noticed thr place opened for business.its really close to my house. A big plus.ordered papaya salad.whole, deep fried tilapia with curried, basil seafood stir fry,thai drunken noodles. Every dishes been delicious. Every time.I think that one lady who gave them one dtar seem a bit hard to please.maybe she's a genuine foodie&I'm not.I'm Thai&use to eating Thai foods as it was in Thailand. This place came pretty close to that."}
{"text":"We stumbled on this awesome place by accident! The ambiance is clean, classy, and comfortable. The pad thai was great, but the Mango Beach Ice Cream is to die for! We will defiantly be back."}
{"text":"Hot new spot in N. Las Vegas. I'm glad I stopped in. The Tom Kar soup with chicken was delicious... soothed my sinuses, I ordered spice level 2. I almost wanted to order another bowl to go... it was full of tender chicken and lots of mushrooms. Crab Rangoon was good. Pad Kae Mao (Drunken Noodles) was good too, but I could not finish them because that soup bowl was humongous... A couple of my noodles were stuck together but all in all, very tasty at a spice level 4 and I counted 8 small/medium size shrimp. When I arrived the place was pretty empty, but there were a lot of To-Go orders being picked up. Service was great. Credit card minimum $7 and cash transactions receive 10% off. It sits 100 people."}
{"text":"This place has amazing customer service, great food and has a nice cozy atmosphere! Highly recommend!!"}
{"text":"Chicken curry was extremely sweet, no heat, and very soupy. That was my first and last time eating there. Also was not impressed with the chicken fried rice. I found it odd where you pay but I guess safety first since it's not at the front of the store."}
{"text":"We live about 3 miles from Amazing Thai and have done 3 takeouts so far. Have not been disappointed and are still trying new things on the menu.  We did raise our heat level to 7 the last time and the food was even more \"amazing\".   Recommend dishes so far:  Pad Thai with chicken Drunken noodles with shrimp Orange chicken Yellow curry with vegetables  Mongolian beef Fried wonton"}
{"text":"This is definitely my favorite Thai place. The food is great every time I eat here and the staff is very friendly! They're always here when my curry cravings hit."}
{"text":"I ordered the pork pad Thai. It was so good. Very good flavor. A good amount of spice at the spicy level. Spicy but not burning hot. I also had the Thai green tea. It tasted it a little perfume-y but I still really liked it. Most excitingly is that they have a crepe bar. I'll be hanging that next."}
{"text":"Nothing fancy, it satisfies your craving. So far, this is the only Thai place we know that offers refillable Thai Ice Tea."}
{"text":"I used to go to Archi's for Thai food here in Las Vegas... Now I go here.  Need I say more? (Yes it's that good!)  The Pad Thai with chicken, level 10 spicy was out of this world awesome!   Chicken Satay for appetizer was perfectly balanced with spices and taste! (TIP: You can ask for more peanut sauce too without an extra charge)!  To top it all off...Mango with sticky rice was the perfect dessert to finish off the meal!  If you haven't been here before, you absolutely have to eat here if you are looking for high quality Thai food!"}
{"text":"Great Thai food and even better that it's up here close to home. The beef basil was amazing and had a nice kick to it. The chicken house Fried Rice was awesome as well. I will definitely frequent this spot now that I got to finally try it!"}
{"text":"I wanted to try a different Thai restaurant other than Archie's and my fiancée and I decided on Amazing Thai Restaurant in North Las Vegas/Centennial Hills. The food here was phenomenal. We ordered the egg rolls (best I've ever tasted in my whole life), chicken pad Thai and the crispy duck fried rice. The pad Thai was well flavored just think I may up it in the spice scale next time I'm here (not their fault). I've never been able to find crispy fried rice at any Thai restaurant and their's was crispy (well d'uh), moist, flavorful, and complimented the fried rice and Chinese broccoli perfectly. Michelle was our server and she was friendly, quick, and was there whenever we needed something. I will come back not only for the food but for Michelle's service as well. For a finale we got the mango sticky rice, my fiancée is NOT a mango fan, but she loved this dish. It was the perfect amount of sweet and tart that balanced the dish very well. Can't wait to come back!! With the appetizers, entrees, and desserts, the whole check came to $40. Very reasonably priced. Thanks!!"}
{"text":"This is my favorite,  delivery is fast and food good and hot! Try it yourself,  you'll like it"}
{"text":"I read the reviews all were good .   I beg to differ we ordered the sicilian sea bass for 19 dollars and orange chicken . Bill was 40.00 dollars .  The fish was about 2 ounces with white rice probably cost 2 dollars to make .   Worst orange chicken ever, egg rolls were out of a box . Havent been this upset over food ever. Hope they choke on my fourty dollars."}
{"text":"Ive got to say, they really do own up to their name. \"Amazing\" Thai gave my family and myself a great first impression. Came here for the first time, the distance to and from my place is very convenient.   We decided to order a ton of to-go and we were all very impressed. The customer service, VERY kind and sweet. The chef looked like a man you can trust cooking your food, LEGIT .. The food was not oily which is a plus & a must, ingredients tasted fresh and deliciously made..   Only reason why this wasn't a 5 (dont mean to be a buzz kill) is because the portions weren't quite what we hoped for. We ordered so many and opened it up, not as generous as I hoped it would be. Although we ended up fulfilled nonetheless.   I could definitely see myself going there again for sure.  Kudos Amazing Thai! Thank you for your hospitality and Amazing Thai food.."}
{"text":"11/26/2016 Well we just left being told by the server that the manager refused to come out to speak to us. Our visit was intended to be the second of many due to the fact that we live 5 minutes away. First off, my husband and I went in eager and hungry for some yummy Thai soup. We are seated and after a few minutes a server approaches us (without introducing herself) asking, Are you ready to order or do you need more time?  I replied, I'm ready!? She states, Oh hold on....I'll be right back.  She went behind a bar chated with a coworker then proceeded to assist two other customers whom came in for their pick up. We eventually ordered our food. I ordered the cucumber salad and my husband his usual wing order with two separate soups. We specifically ordered lime based soups with noodles. Lone and behold we are served coconut based soups. Now mind you the server did come back and ask, if the soup was to include noodles? We replied yes, thank you. Not to mention that I had to get up and approach the server in order to ask for more salad dressing. So, I've pretty much know that I will not be returning due to that fact the management has no regard for their customers along with the very poor service. It's one thing to make a customer wait but to get the main entree entirely wrong is very poor service. All I can say is that I'll definitely drive to Chinatown and visit Pho Kim Long every time I am feeling like eating Yummy Thai soup. Thanks for reading!  =/"}
{"text":"This restaurant is good! Price and Portion for this location is okay. I LIKED how the thai ice teas are refillable. I also love thier desert called Amazing Tree ice cream!"}
{"text":"This place never gets busy and I'm thankful and yet wondering why... the food is really \"AMAZING\". Been coming here or having delivery since they started and pretty much tried most of their menu and I gotta say I am impressed. Just spoke to the server why it's not so busy every time I dine in, they say they get overwhelmed from Uber Eats and delivery orders.... but seriously, if you're in the North LV area close to Aliante, be thankful this Thai place is here and it's REALLY a good thai place too."}
{"text":"1: food was  good but very salty.  2: restaurant had a little bugs sprayed smells. Sorry I was told I have super sensitive nose. 3: service was nice 4: we had to order extra food to counteract with other salty dish and told server please uses less salt ( fish sauce) but it was still salty. 5: I give 4 stars cuz my husband like the food ( he loves salty food). My  parents, brother and I not into salty. 6: overall... I will give this place another chance."}
{"text":"Food was mainly delicious. Had a huge order and they got everything correct. Mango Sticky rice was just OK (it was kinda tough and chewy/ dry). Would order from them again!"}
{"text":"Ordered yum won sen, chicken tom kar and chili fried rice. The shrimp in the glass noodles was undercooked (raw) and the spice and fish flavor was too high. Maybe this is the dish, but it did not appeal to me at all. The soup was also sour in a off way and not balanced well with the coconut milk. I enjoyed the fried rice. Pretty pricy $45 for food I couldn't finish. Sorry, I won't be back. Sever was very pleasant and the food came fast."}
{"text":"Overall good experience it's good. People are friendly and efficient and the food is tasty but if you really want real good Thai food I still gotta stick with the Ochoa Thai cuisine as one of the best Thai places in town."}
{"text":"Went for lunch. Place looks new. The food was very good. I had the Massuman curry, and the wife had chicken pad thai. Both tasted great. I asked for more heat and they delivered.  Will definitely be going back! They do give a 10% discount if you pay with cash."}
{"text":"Absolutely horrible!  We were starving and decided to try Amazing Thai for lunch on Sunday, Oct. 16th 2016.  I had high hopes that it would be good because it's much closer to the house than the usual Thai Restaurants we frequently visit.  We were greeted by two friendly employees as soon as we entered so I say to myself, \"Ok, so far so good.\"  We ordered the Wor Wonton soup, Crispy Duck and hot green tea.  The Wor Wonton was not bad and the hot green tea was your basic Lipton brand.  It quickly went downhill from here. The Crispy Duck was placed on our table and the server turned her back before I could order a bowl of rice so I had to flag her down.  I shouldn't have ordered the rice. It tasted like old Uncle Ben's instant rice.  We took about a minute looking at the Crispy Duck because it looked burnt, but again we were starving so we jumped in anyway.   Big mistake!  It tasted like it has been aged in the fridge for a few months and the gravy was nothing but fat drippings loaded with five spice.  If you've ever forgotten leftover poultry or beef uncovered in the fridge for a significant amount of time, you'll know what I'm talking about.  The meat has lost its moisture and the texture is powdery and stringy.   I kindly addressed our issue with our server and she apologized.  The restaurant still charged us half priced for the duck from which we only ate two pieces.  And on top of that, we were waiting at least 30 minutes for a second order of hot tea.  Don't let this restaurant ruin your day.  Believe me, there is nothing amazing about this place. Absolutely horrible!"}
{"text":"Nice soothing classy looking atmosphere, felt like I was on the strip in an expensive place, background music, clean, staff seems to have sweet attitude and full menu for gringos or advanced diners, I went with the Pad Thai and I could even dial in my spice level on a 1-10, I went with 6, was super great! I'm think I'm a regular now!"}
{"text":"This place definitely lives up to its name. The food is amazing. I get the Pineapple Thai Fried Rice. Best part, they deliver!!   My new go to spot for \"Amazing Thai!\""}
{"text":"Placed a pretty big takeout order since it was the first time visiting. Order the following:  Chicken Satay: pretty bland and not even warm (I live 10 mins away) Fried chicken appetizer: Extremely dry and tasted like day old microwaved chicken.  Crab Ragoon: this was ok but nothing special Chicken Kow Soi: The spice level was good and again nothing to brag about. I mentioned no red onions a few times but they seemed to have put a dozen in there.  Agedashi Tofu: My wife took a few bites and threw it away   We tried everything we wanted to and it was pretty bad in my opinion and will definitely not go back. We'll stick with Plumeria Thai instead."}
{"text":"Terrible experience with Amazing Thai and after hearing so many great things we were really excited to try it. We ordered online for delivery, with an assured delivery of 45-60 mins, and after 90 minutes nothing had arrived. We called and after giving our name numerous times no one seemed to know who we were. Our credit card had already been charged so we gave it another few minutes then called again. They still had no record of even having our order, then put us on hold for 10 minutes the whole time we could hear them helping other customers. At this point all we wanted was to cancel the order. We finally hung up, after no one ever came back to assist us or even let us know they were looking into it, and refused the charges on the credit card. Extremely disappointed with Amazing Thai."}
{"text":"I'm not a huge thai food fan but my son loves the orange chicken and my husband gets the Pad Woon Sen at least 2x a month and always orders an additional order for the next day."}
{"text":"My husband and I ordered food from Amazing Thai last night.  We ordered take out and had it delivered. I honestly was nervous about the food because we had ordered late and I didn't know if we where going to get good quality because of it but I was surprised how much detail was added into our order. Everything was packed individually, our order was in double bags and the presentation was amazing.  They even labeled everything for us which I thought was so nice of them to do.  When we opened up all the food it was all still nice and hot.  We ordered egg rolls,  Crispy duck fried rice,  Tokyo Curry and Tom yum noodle soup. The portion size of everything was great.  We ordered for 2, but we feel as though we have left overs for 2 more days. Now it was our first time trying Thai food so we did not know what to expect. We loved the egg rolls and fried rice but we where surprised about the Tokyo curry.  The chicken and rice itself was good. But the curry tasted a bit sweet, we had ordered it mild.  Despite that my husband and I did enjoy the Tokyo curry. And the Tom Yum Soup was interesting we thought it was going to savory but it was more sweet.  Again we don't really know what Thai food is supposed to taste like and we don't have anything to compare it to.  But overall it was a good experience and I would definitely come back to try something new."}
{"text":"I saw all the reviews on yelp and decided to try out this restaurant because of the good review. I thought the food was okay, it was just really greasy for the Pad Thai. A pool of grease was at the bottom of my take out plate. But the main reason I'm giving this restaurant 1 star is because as I was eating, I felt something hard, thinking it was just a burnt noodle. I couldn't chew into it. I took it out of my mouth and realized it was a long strip of plastic. I almost ate plastic!"}
{"text":"Anything but amazing. The quality of the chicken in my yellow curry was subpar. The calamari smelled and was also poor quality. The curry itself was very bland and not flavorful at all. I was very disappointed. Would have done 1 star but our waitress was just the sweetest thing."}
{"text":"There aren't a lot of Thai restaurants in the north part of Vegas. We found this one and everything we've tried has been good. We've dined in and ordered takeout. This is our go-to Thai restaurant when we don't want to go down near the Strip."}
{"text":"I have eaten at this restaurant once before and had a good experience. I really liked the spicy eggplant. So tonight I ordered for delivery. The lady told me it would be 45 mins to an hour. After an hour and a half of waiting, I called and she told me that the delivery driver left 15 mins prior. (BTW I live 10 mins away). Another half an hour later, the driver finally shows up. Needless to say, we already started cooking dinner since it had been 2 hours (8pm). My husband was not friendly when he told the guy we order 2 hours ago and did not want the food anymore. After we closed the door, our neighbors heard him say that we should have picked our food up. He also sat in his car diagonal at the end of my street watching our house.   If I could have given 0 stars I would have. I am so displeased with how we were treated. I understand that mistakes happen and if the woman that I called would have explained that they forgot, I would have understood. Instead they lost a customer."}
{"text":"I have been to this restaraunt twice and unfortunately their service is severely lacking. The food was pretty tasty the first time I went so I decided to give them another shot and the second time around I wasn't even able to eat. My husband and I were seated (by a very unfriendly server) at a dirty table that had silverware strewn across it. We looked over the menu and 20 minutes go by without our drink order even being taken. A large family was sat about 5-10 mins after us and they were addressed and got their drinks served to them. I noticed the servers were struggling with an online order so we tried to be patient (even though people sat after us were served first). We still weren't acknowledged and couldn't get the servers attention. We got up and left and they never even acknowledged us walking out the door. It was extremely odd and rude. Sun Thai is close by on Craig and gives amazing service and has awesome food. Don't waste your time here."}
{"text":"So this place clearly has a few bugs to work out being newly opened. But the people are very nice. The restaurant is beautiful. Of course the most important thing is the food and it is delicious. I can't wait to try more of their interesting dishes. I know Thai food. Weera, Naga and of course Lotus of Siam. Even Ocha is a favorite of mine working downtown. Welcome Amazing Thai! So nice to have you in the neighborhood  ;)  Keep up the good work!!"}
{"text":"The food was excellent and the servers were friendly. The only oddity was a TV in the restaurant. I'm there to eat dinner and enjoy time with friends and not to watch the local news. I will be back and I can't wait to eat more of that curry or the spicy eggplant."}
{"text":"Great service, great food..tried the jicama salad oh so yummy. Tokyo curry chicken is breaded like the hawaian Katsu chicken in a yummy curry sauce.  Also ordered curry fries they had a side  sauce.. ..10% discount if you pay cash."}
{"text":"Excellent authentic Thai food.  Spicy hot and flavorful.  Love the Tom Yum soup and the Pad Kee May Noodles."}
{"text":"It was goo I had the shrimp yum tum soup it was ok the chicken pad Thai was really good and I also had pineapple fried rice they had put too much salt and way to much condiment I give it a 5/10 service was really slow as well"}
{"text":"Great thai spot near my house. Food was awesome, as well as the service. I had the green curry, the spice level and flavor was on point. Free refills on thai tea was a welcome surprise. Fantastic!"}
{"text":"Sandy was the best waitress ever! She explained the menu and she recommendations. She was awesome! !!!!! The food was excellent, and the beef jerky was tasty!!!!!we'll be back"}
{"text":"Very good Thai restaurant!  Our first time here, very clean, nice calming interior!  The server Sandy was so kind and friendly, great service!  Good was delicious, we will definitely be back to the Amazing Thai!!!!!"}
{"text":"Hard to beat the taste and quanity of the food. Have eaten here 2xs and was excellent on both occasions. Only drawback is it can get a bit pricey if appetizers and drinks are included."}
{"text":"Good food and excellent service. They offer unlimited thai iced tea so if you're into that, this is the place. I got the that green tea but it was way too sweet for me. Staff here are very friendly and makes you feel at home."}
{"text":"Finally found my go to Thai place near home! Everything we ordered was just delicious! Thai iced tea, salt and pepper chicken, beef pad see ew, shrimp pad Thai, and chicken panang curry. Big portions to share, good price. They even give you 10% off if you pay in cash!"}
{"text":"The food is amazing. I never been to the restaurant but had delivery from them 6 times . The delivery is fast"}
{"text":"This was my first time eating here and having it delivered.  Let's say I'll be a returning customer.  Didn't give it a 5 star because the delivery guy forgot my Thai Tea, he did bring it back within 5 minutes and I didn't get any forks or napkins.  When ordering off the menu the ingredients aren't accurate.  First I ordered the Cucumber Salad on the menu it says it came with cucumbers,  red onion, their special Thai dressing.  I got a salad with much more,  it also contained red and green peppers, nuts,  tomatoes and lots of cilantro (which I love). The salad was awesome, flavorful-lots of color.  But add ALL the items that's added into the salad.  It would have been easier for others to choose, and please keep the salads consistent.  The next time I order that salad I'm going to expect the same. One more thing I ordered the fried chicken wings,  they were fresh and Taste good however they were on a bed of jalapeños, didn't like that,  the whole point was to NOT have spicy wings.  Next I'll try the Pad Thai hope they add lots of cilantro."}
{"text":"Great food, great customer service. And there's a lady who works here that will up-sale you anything on the menu. But it's always worth it! Today we order a secret menu item, fried chicken fried rice & it's amazing. I recommend this place."}
{"text":"Phat sassy and content. The name of this place says it all.  The food is amazing, the atmosphere is nice, the staff is attentive. We will make several trips back to try different things on their menu."}
{"text":"This place was a disappointment. I'm giving 2 stars for a decent Tom Kar soup and a great server (with curly blonde hair:) To start off, we had not one or two but THREE dirty dishes/utensils and even a dirty napkin at our table, so the first impression was not good. The service was not good either, except for the very hardworking lady who seemed to be handling the whole place even though there appeared to be other employees present(keep in mind this woman wasn't even our waitress but she offered the most attentive service in the whole place.) The food was okay but far too artificially sweet for me. The Pad Thai sauce is a very bright orange which is to me is not traditional Thai. I did enjoy the Tom Kar even though it too was overly sweet. I would MAYBE, go back for the soup but I also have reason to question the cleanliness of the place and food and that makes me want skip it all together. I really hope that more quality places come to the area, we certainly could use them."}
{"text":"Not what I expected, my noodle where hard and crispy and I expected them to be like regular noodles, and the broth it came with didn't taste to great either"}
{"text":"Ambience is nice and relaxing and the service is great. Most importantly the food is yummmster lol"}
{"text":"The food here is AMAZING! As an Archi's fan no longer living near a location I say \"Archi's who?\" Lol. This place is family run and still struggles with service, turning over tables etc. You overlook this because they are so friendly and the food is so damn good!"}
{"text":"Hubby and I are so happy to have legit Thai near our house! We ordered take out. We ordered the Pad See Ew(combination) and the Pork Larb. Both dishes were prepared with the perfect amount of spice level as requested(4). We decided to try the mango sticky rice and highly recommend it as well as the other two entrees. We enjoyed both dishes and I ordered a Thai green tea(in a to go cup)while I waited for my order and they even topped it off before I left. We will definitely be back to eat in the dining room soon."}
{"text":"The food here is nothing less than amazing and they match it with very beautiful food presentation and friendly staff! We had their amazing seafood chow mein,crab fried rice and won ton soup. I won't stop till I've tried their whole menu!"}
{"text":"So good!!!! We were pleasantly surprised. From the Tom ka, to the drunken noodle, to the panang curry, everything was amazing! Our server was Awa (not sure on the spelling) but she was so fast and sweet and did everything we asked and more! Great place"}
{"text":"Best Thai on the north side. Extremely friendly, excellent service, great lunch special. I absolutely love their papaya salad! Best I've had since Chiang Mai"}
{"text":"I'm giving this place 5 stars because service + food = enjoyable dinner. I personally really enjoyed the food. The Satay fingers were unique tasting for me but bomb. I loved my panang beef. Sometimes you get beef from thai restaurants and it doesn't even look like beef more like white pork. The beef here looks like what beef should look like. The servers are very attentive and nice and my thai tea is refillable!"}
{"text":"This place is Amazing like the name. We go once a week. The food is very Flavorful. The wing App. Are so good. The portions are a good amount, had the Mixed Veg. With beef last night very tender. Service is right on free refill on the Thai tea. We have been to many Thai Rest. And like this the best. Give it a try. :) They close a 9 pm"}
{"text":"Their Tom Yum fried rice with chicken was truly outstanding. Spice level 5/10 made it so we could still taste all the flavors but still enjoy the necessary kick that makes Thai food Thai food.  I loved the menu options and wanted to get one of everything.  Pad see ew with bbq pork had even fatter noodles than most places. Kudos for making that happen. I love fat noodles. The flavor was great and it came out quick. I forgot this time but I normally substitute their broccoli for American broccoli simply because I prefer the texture. Think about it  The shrimp rolls were okay. They come fried, with a sauce, and the shrimp are a good size, not to mention they come with a lot. Perhaps I'd enjoy them more if we had more ppl and it wasn't the only side option (I like variety).  The Pad Thai was thuper good. It didn't seem to have any spice level to me but my friend was dying across the table. It's a mystery.  Portion sizes were flattering. We had a healthy amount to take home for the spouse. A mega plus!  We came for a birthday and got the Amazing Tree ice cream dessert (they don't offer birthday candles yet). It made us smile and added a bit of special to the meal, that needed something for a birthday dinner. Chocolate ice cream under the chocolate crumble \"dirt.\"  The \"rock\" candies were like a heavier textured M&M. We didn't eat the tree. I say give it a go  Service wasn't that outstanding but that could just be a cultural thing. We walked in and most of the tables needed to be wiped down still. Looked like we got the end of the rush. Most Thai places don't look as modern or as updated as this restaurant and it made for a nice change.   Amazing Thai may have taken the top spot to satisfy my Thai food cravings"}
{"text":"I just have to say I ordered their Mongolian beaf and it literally smelled liked a mix of feet and poo. So gross! If not for that I would of given it one more star because everything else was on point. The crispy duck fried rice was tasty and the skin was nice and crispy. Also the Tom Kar soup and massaman curry were both what I expect I get when I order Thai. Seriously though don't order the Mongolian. I won't be ordering anything beef related after that."}
{"text":"Amazing is a stretch. I ordered via DoorDash. The tum yum noodle soup and the spicy basil. I ordered very spicy for both. The food was mediocre, the vegetables were still raw, the food wasn't spicy and everything was far too sweet. I will never order food from this restaurant again. It was the worst Thai food I have ever had."}
{"text":"Decided to give Amazing Thai a try while in town.  We are always looking for good, authentic Thai food.  We were not disappointed.  The service, food, and atmosphere were all wonderful.  Rich spices infused the dishes we chose.  The prices were reasonable.  The quantities large.  This would a regular place to eat if we lived here."}
{"text":"Highly recommended! Warning on the curry. Although, I only got the level 2 in spicyness, my mouth was on fire. Overall, it was delicious!"}
{"text":"This was a Father's Day treat for me and they have Great Thai Food!  Definitely try the Pad Thai and the Thai Teas are constantly refilled."}
{"text":"Food was great my favorite will be the jerky and then the chicken larb I was expecting that I will like the Red Panang curry I didn't like it that much. Did delivery took 1hr & 57mins to came that long and its only 6min away from my house. And it came not even hot except from the panang curry that's it the rice the jerky rice all cold Already. Anyway the jerky was worth waiting for..."}
{"text":"Service was great, very quick to get our food. Food was delicious! Will definitely be back!! Large portions and ended up taking two boxes home."}
{"text":"Good prices. Authentic flavors. Large portions. The most complete Thai food on this side of town, and good value = winner winner Thai for dinner. Typical 1-10 spice levels. They have duck and crab fried rice, along with all the staples. Go get ya some of this! The rest is in the pictures, Cupcake."}
{"text":"The food is delicious. Flavorful. I dine in at many Thai restaurants in Nevada and California. This restaurant is one of the best. Our server was Friendly and helpful. Definitely coming back."}
{"text":"The name says it all the food was very tasty you must try there chicken wings. I had the pineapple shrimp fried rice and my husband the pad Thai. The only reason I didn't give the five star was because the service was a bit slow but it's a new spot so it might speed up with time."}
{"text":"I knew I tried this before but I just couldn't remember it. Based on the four stars I decided to give it a shot. As I was trying to eat my food my first experience came to my mind. the customer service is pretty good but everything that I've had so far is extremely sweet. I remember my first visit now and I sat there and ate and I remember sending my food back because it was just way too sweet. It was the sweetness of my 2nd visit that triggered the memory of my first.  I tried adding some cayenne pepper to make it better but it was still just too sweet and ended up throwing away $40 worth of food."}
{"text":"BEST SERVICE EVER.  More attentive than any Thai restaurant I've ever been to. Food was great and they actually understand how to do spicy food properly. Pad kee mao, papaya salad, tom yum fried rice, Penang curry. All perfect. Thank you!"}
{"text":"So happy to have found this little gem. Service is great, the place is cozy and clean, the food is really good and prices are very reasonable. There hasn't been many good restaurants on this particular area of North Las Vegas, but with this addition it's looking up."}
{"text":"This is amazing Thai food! Seriously! I ordered delivery 2 days in a row! Day one we all ordered green curry, drunken noodles and beef with broccoli. It was all so so good... oh and veggie eggrolls. Day two my sis ordered beef with broccoli again and I got the kao soi... which was yellow curry with noodles... so so good. I'm a huge curry fan... Japanese, Indian, Thai, you name it... if it's curry I love it, but a lot of places just aren't good at making it. This place is soooo good at it. Their yellow and green curry are more on a sweet side compared to others that I've had, but the sweet goes so well with the spice. I got a 5 and it was pretty spicy so beware of a 10  oh and all of my items were vegan... no meat in either curry, it's made with coconut milk... just extra yummy veggies. And I skip on the tofu option usually."}
{"text":"Ordered pick up - one Pad See Ew and Egg Rolls. The food was delicious! Will definitely be ordering from there again soon."}
{"text":"Mediocre. Environment was nice, service was friendly, food was bland. I ordered spice level 10 and it has NO heat. My husband thought his was bland as well."}
{"text":"This is our go to place for Thai.  And chicken wings.  The salt and pepper wings are fabulous!   The panang is great, a bit on the spicy side as a 0 or a 1 but that's ok.  Their peanut sauce for the satay is awesome.  We have tried almost everything on the menu and have not had a bad meal yet.  The servers are super friendly.  They remember us even when we haven't sat in the restaurant for a while (we mostly do takeout)   The only reason I do not give them 5 stars is because their takeout is very slow.  They tell me it'll be ready at a certain time but it is still 20-30 minutes after that.    I don't want to recommend them because I don't want share them."}
{"text":"The food is about 3 stars but the service brings it up to 4.  Had pork curry and pad Thai.  My husband enjoyed the curry but agreed that my pad Thai wasn't great.  It was a bit sweet and I asked for a level 4 but my spice level was through the roof. Way too hot.  We think the chef/server might have messed up and given us a 8 or 9 because we can both handle heat and this was too spicy for us both.  I barely got through a quarter of my food.  We will probably be back to try something else.  It was a clean, friendly restaurant with fantastic servers."}
{"text":"Good food, bad service.  Try ordering take out or delivery.   The wait staff are either inexperienced or simply don't care anymore.   The food is good, not great or award winning, but pretty good."}
{"text":"Went in for lunch. The food was amazing!  Especially loved the mango/coconut desert!!! Will definitely go again!"}
{"text":"Good food and decor. Came during lunch about 1pm no wait plenty of seats. Place looks like it gets visitors later in day. Will come back for dinner. Lunch specials start at $6.95 great bargain and food quantity. Not sure what the soup with special was but it tastes good. Ordered the 5 piece salt and pepper wings. Seasoned great and real tasty not dry. Entree was chicken pad Thai lunch special with level 5 spicy which wasn't too hot but at your own risk. Portion was good and taste great. Place looks like at night you could easily bring a date. Waiter is quick and attentive. Food came out quick. Found me a nice new lunch option. Will see about dinner."}
{"text":"Authentic and delicious. Ordered eggplant with shrimp and wonton soup. Both were nothing less than amazing and thumbs way up to their kitchen and staff"}
{"text":"I'm pretty impressed with this place. Glad North Vegas has some great Thai, it's about time! Good lunch specials with larger than expected portions (yay, because I'm always hungry). Friendly service every single time I've been here. Definitely appreciated.   I almost always order the Beef Salad (8/10 spicy) because it's truly \"Amazing\". So fresh with a lot of crunch and packed with flavor. I can't get enough of it. My kiddos love the satay with peanut sauce. We usually have to get two orders because they can eat, lol! So glad they aren't picky eaters. Makes my life so much easier. I've yet to try any of their soups but looking forward to it."}
{"text":"In search of Thai food I yelped and found this gem! We were greeted and seated right away. I looooved the whole ambience. The beautiful gold tree painted on the walls really caught my eye. The waitress was very pleasant and attentive to our 5 year old daughter. The food was delicious as well. A bit of a wait but then again that just tells me everything is cooked to order. We ordered the pineapple fried rice without the shrimp.  Huge portions two people can totally eat from one order.  We also had the chicken wings, my husband looooved it. The Thai iced tea was super refreshing and tasty. Lastly we ordered the sweet sticky rice with coconut ice cream, to die for! It's more of a soupy consistency because they add coconut milk to the rice but i didnt mind this at all. Would definitely return. Price point is a little on the higher side rice order was $11 but now that I know you get enough to feed two I would order one order instead of two."}
{"text":"Super tasty!  Pad Thai is BOMB !!!  I added chicken and shrimp in my pad Thai and I also got it SPICY  !! My boyfriend ordered some kind of crunchy soft food ball that was stuffed with really good mixture of octopus  and some kind of filling, it was our first time trying it. It was pretty tasty! The egg rolls are just amazing of course, the delivery didn't take long at all, my food was super hot when it arrive, I was very satisfied and I'm hard to please!!!! I'll definitely be ordering take out again."}
{"text":"Went there last night for dinner.  The service was beyond bad!!  A couple that came in at the same time as us received their appetizers, their meal and left before our entrees were even put in for order.  The waitress/manager that took our order was so busy trying to fix a take out order she forgot to put our order in.  When I asked another waitress about our order, it took another 15 minutes before I finally went up to the register to find out about our order.  By this time we had already been there over 45 minutes.  The Manager said she would put our order in and wouldn't have to pay for our meal, but we had plans and we already wasted over 45 minutes.  We tried their take out once and the food wasn't hot when we received it, so we thought we would try dining in.  That was worse.  After 2 strikes, they lost our business!!"}
{"text":"Food is Amazing as the name suggests!  Great lunch specials too.  We've been here twice now.  We've had the pad thai, curry and pork basil. We abandoned our previous favorite place for this now..."}
{"text":"Amazing Thai is no amazing service. Although the food tasted good The restaurant lacked adequate service. We waited long time to be served and when we finally did the soup and entrées came out together. We did not have plates or adequate silverware to share our food. And finally when it came time to pay the check there was no one around to take our bill. I had to shove cash in an envelope and give it to the front desk on our way out. I don't think will come here again."}
{"text":"Tried this place on 2 occasions. 1st time was during lunch on a weekday, my husband and I were literally the only ones in the restaurant and we still waited about 5-7 mins for someone to finally come out and seat us. Once we were finally seated it probably took them about 10 mins to come over and take our order. Food was decent, small portions but I guess because it was their lunch specials. Waiters never came around to check on us or to refill our waters until we waved someone down, seemed like most of the staff were eating lunch at one of the tables when they knew we were the only customers in there. The only person that really helped us was the Hispanic woman, but she had left the restaurant for a bit assuming the rest of the staff would take care of us, which they didn't. Overall it wasn't a good experience considering the food wasn't the best and we've definitely had better.   Now due to the fact that this place keeps getting good reviews and ratings for some reason, we decided to give it another try. We came in on a Friday night so the restaurant was pretty busy, there were several tables available and a small line of us at the door waiting to be seated. There was only 3 people working in a packed restaurant so they could barely seat people right away nor did they offer adequate service. Took them again around 10 mins just for someone to finally come and take our order,  then probably 20-25 mins just for our small appetizer to come out. We ordered the crab Ragoon which was 6 small pieces for $6?! Ridiculous.. Pad Thai was decent but not the best and again a fairly small portion especially being dinner time.. the best dish was probably the crab fried rice which we did enjoy but that was probably the only highlight of the dinner. We had to wave someone down every time to get more water. The only accommodating waitress again was the Hispanic woman who was very sweet but it's very disorganized the way they handle their service since none of them seem to be assigned to one table and were all over the place the entire time. We will not be coming back here since we've already given them another try. We wanted to like this place since it's so close to home but looks like we'll stick to driving to China town for the good spots. I would definitely order the crab fried rice again, but take out only."}
{"text":"The food was mostly good, curry was spicy but It delicious.   The pepper steak was more like a pot roast with gravy though.  Service was meg"}
{"text":"How does this place have 4 Stars? I had the Pad Thai, Fried Rice, orange chicken, egg rolls and another noodle - wide noodle chicken (can't remember the name).   OUR ORDER: Pad Thai - super greasy, a bit too sweet for me, but the noodles just had tons of oil. Tilted my plate and it pooled to the side.   Fried rice: actually decent, but let's be real, it's fried rice. We are not talking about something that's difficult to make nor hard to find. Case in point, Panda Express.  Orang Chicken: Chicken had zero flavor, clearly not seasoned before it was battered and/or the flour and batter were probably not seasoned, as well.  Wide noodle pad Thai: super greasy, my plate literally had oil dripping from it. The Chicken in the dish was dryer than the Sahara desert. Chewy too.  Egg Rolls: DISGUSTING. clearly fried in a fryer that was set at too low of a temperature. Like the noodles, dripping with oil.    I will never order from the \"Unamazing Thai Restaurant\" again. I had also ordered 3 Diet Cokes. When my order was delivered, they only gave me 1, so I called and the delivery guy brought back two more, but they were regular Pepsi, not Diet Coke. I tried calling back a couple times and kept getting a message saying they were not available and to try back later. My order of 5 entrees/dishes and 3 drinks came out to $65, which is an absolute shame for a bunch of Over-priced, poorly cooked, under seasoned, soaked in oil CRAP!"}
{"text":"I've eaten here a few times and it's a hit and miss. The staff is really nice and that is one of the reasons why I keep going back."}
{"text":"This was the first time trying a new Thai spot since Archies. The food was amazing, and the care of the delivery was paramount in this visit. You've made a long time customer. Absolutely amazing!!"}
{"text":"We have been to this restaurant many times before. Tonite, we were there again. The menu has apparently changed. Pricing is now a bit higher. Price increase by itself is not an issue, but when service quality drops and food quality drops, there is an issue.   We ordered:  Crab Fried Rice - tasty, but the rice is slightly hard. Dish is also quite oily. Rated a B. Shrimp Pad Woon Seen - again it is very oily. Rated a B-. Tofu Panang Curry - Taste is strange. Only 6 or 7 pcs of small Tofu cube. Rated a C-.  What was really wrong was that after we ordered, it took them 10 minutes to send out our Crab Fried Rice. And the other two dishes took another 15 minutes to arrive. Food is sitting at the kitchen counter too long??  For me, this is no longer that same restaurant that we used to visit. I am very reluctant to revisit this place. My dinner dollars can be better spent elsewhere."}
{"text":"My favorite Thai restaurant in town. I order here atleast once a week. The Thai hot basil is phenomenal and the pad see ew is always good you won't be disappointed."}
{"text":"Best Thai food place I've had!!! Prices are very very reasonable, and the service is GREAT!"}
{"text":"This our Thai spot... food leaves up to the name \"amazing & delicious . Staff is super friendly and attentive. I highly recommend the green curry  the bum ."}
{"text":"Truely amazing thai food! Me and my boyfriend got our food delivered to us from here instead of the same old chinese place we normally get.   Vegetable Noodle Soup - I ordered this one not really expecting much, but I wanted something easy on my tummy because I didn't feel well. This was the PERFECT thing for the flu. The broth was very mild. I was super impressed with how perfectly the veggies were cooked. Also it was thoughtful that they put the noodles on the side so they didn't get soggy through delivery. The noodles were well cooked thin rice noodles seasoned with garlic. Was just what I needed to feel better!  Red Curry with tofu - Let me start by saying the portion was intense. While curry normally comes in a little tiny bowl, it came in a giant soup bowl. This was perfect cause there was definately a good left over portion. The curry itself was a little soupy instead of creamy but I didn't even mind it because the flavor was so good.   Can't wait to reorder!"}
{"text":"If you are looking for the convenience of delivery DO NOT order from this restaurant.  The food is great, we have eaten there once and ordered takeout once.  When we ordered take out we used their website because no one would answer the phone after trying to call at least 5 times.  Tonight we could not reach them by phone again so we ordered through their website and ordered delivery this time. An hour later, I called to check on the status and got no answer.  Tried again 10 mins later and finally reached someone who put me on hold then came back to tell me that a few orders didn't come through on their website when the order was placed and they didn't receive mine until an hour after I placed my order and it would be another 40 mins for delivery.  We live 5 mins from this restaurant so we were not anticipating a 2 hour wait for dinner when placed the order.  Needless to say we cancelled and will NEVER use their website or order delivery from this restaurant again. I would say your only option is to eat there in person since their website is unreliable and they do not answer the phone."}
{"text":"i go here almost every week, the people actually know my name lol. The food is amazing!"}
{"text":"I had the Beef Khao Soi. It was an incredible explosion of flavor. The portion was more than enough for me and I'm no small eater. The place is very spacious and has a cool tree design on the walls. We will be back soon."}
{"text":"Ordered 2 beef salads, one spicy and one non spicy. They were spot on wrt spice level. The pad thai was made w/o fish sauce so happy they could make it vegetarian but the tofu is made separate so no flavor in that nor the pad thai itself. Won't order that again. You can use grubhub or uber eats but they also deliver withing 10 miles. Service was fast."}
{"text":"Amazing Curry here. Beef was a little tough but, it's curry it over cooks easily.  A little on the sweeter side but it's delicious,  Great service from the waitress.   Looks like a relatively new restaurant. Nice, clean & airy."}
{"text":"I am giving a two star right now because our service for our to go order was not up to par. We eat here quite often and always ordered through Uber which now no longer carries this restaurant. We LOVE the food but today we went to pick it up and they hadn't even reviewed or started making our order when we showed up at the time it was promised. They kept trying to give us orders that weren't ours and offered no apologies or compensation for us waiting over 20 minutes (which was a total of 40 minutes from when we ordered). Disappointed that the pick up service was not what it should of been."}
{"text":"Ordered from EAT24 will never order from them again. The food I ordered was the crab fried rice, which was $11. and change. The moment I opened the bag I knew I had made a mistake when I was hit with an overwhelming smell of ammonia! I hadn't even opened the food container yet! The moment I opened the container my suspicions were confirmed, the crab was bad and had turned bad!!! I was angry and called the restaurant, they all acted like they didn't understand what I was saying and nobody spoke English! I called the health department on this place. I placed some in a zip-lock bag and placed it into the freezer, the Clark County Health Department sent someone out to pick it up that very day. 02/14/2016"}
{"text":"Great service excellent food. Crispy duck and tilapia are both savory dishes! The rice was nice and fluffy it goes perfect with those two dishes! The pad see ew is amazing we ordered it with tofu! We will definitely be back real soon!  So glad a great Thai restaurant has finally opened in our area."}
{"text":"It's pretty good; we don't have a lot of Thai restaurants to choose from; their soups are pretty good especially the Tom Kar; I ordered take out and the wait was quite long (and I called it in before I came and waited 20 minutes and it still wasn't ready) and they left the bean sprouts and other condiments out and no utensils."}
{"text":"Amazing Thai is the perfect name! They have the best food, hands down!!! Their Thai Beef Salad is the best I've ever had."}
{"text":"This is definitely one of the best Thai restaurants here in Vegas, every time I come here it never disappoints! My favorite item here that is a must to try is the pineapple fried rice and I like to get that pretty spicy  it has really good flavor and it comes with chicken and shrimp, also the coconut curry is really good, I usually do take out when I come here but you can also dine here but it seems like most people do take out. Definitely recommend this place!"}
{"text":"First time trying th. Ordered spicy basil shrimp fried rice for pickup. The food is really good, only if they had put more shrimp"}
{"text":"Been here three times. Thai tea is good. Pad Thai is kind of sticky and dry. Tom Kar soup is good. The service is a little slow and the atmosphere is a little bland. Not too much going on inside. There is a tv though if you want to watch something. I would go here only a few times a year. Nothing to write home about."}
{"text":"Finally made it. Wasn't sure what to try so after looking at pictures everybody else had taken I went with the sweet and sour chicken. This isn't like the kinds you get at a Chinese restaurant. It was different, it wasn't battered like most chicken was. It had a nice crispy crunch but not dried out. And I love how I can pic how spicy I want it. All there platters are shareable. Also the Crab Rangoon was pretty good.  I'll be back. Welcome to the neighborhood Amazing Thai"}
{"text":"Ok I like this place but this is the second time I ordered yellow curry with the request of not spicy and getting my order that's spicy! I've ordered the same exact thing before and having the curry very mild and just perfect, so idk what's changed... Even on their website, the option for not having it spicy is on there.... Yellow curry is supposed to be mild!!!! Unless you request it to be hot... Not going back here anymore, it sucks because I really like this place"}
{"text":"Glad to have another Thai restaurant so close to home! We ordered pickup for last night's dinner. We ordered egg rolls. chicken panang curry, 2 beef and beef meatball noodle soups and 2 Thai green teas. The owner was really nice and said that she could save our address for next time, if we wanted delivery. The delivery cost would be $3. That was convenient to know. The egg rolls were vegetable egg rolls were crunchy, but the sauce was watered down. The chicken panang curry was absolutely delicious. The richness in flavor of spices will definitely have us back to order more. We ordered a spice level 6/10, which turned out to be perfect! This order also came with a serving of white rice, which was cooked well. The broth of the beef soup was good, it was slightly lacking the real depth of flavor my family and I have had in other beef soups we have had in the past. The beef was a little more on the tougher side and the meatballs were fine (typical). The Thai green tea would be something we won't get again. Can't quite put a finger on it. Gonna deff try the regular Thai tea next time, though. Overall, I'm curious about other menu items, so we will be back!"}
{"text":"I don't usually make reviews i typically just read off of everyone else... But since this is a new restaurant I'll make my own!! This place is amazing for sure food is delicious, good proportions, excellent presentation and service!! Glad to have a decent Thai restaurant on the north side of town instead of having to drive down town for it!! Will be back for sure to try more from there menu!!"}
{"text":"Not my usual this place. I actually went to this place because it seemed like the only decent Thai place open on Sunday. I ordered the pad see ew and the Thai fried rice. The food was made in a timely matter and it was good."}
{"text":"Horrible experience from both amazing Thai restaurant and eat 24. Ordered food at 6:30 estimated arrival being 7:30... 7:40 no food, try to open chat with eat 24, no response for over ten minutes, can't get ahold of eat 24 or the restaurant by phone. Eat 24 responds to chat and tells me at 8pm the food is on its way and will be at my house in 5-8 minutes... food arrives at 8:30... cold... I tell eat 24 this in the chat support at 8:30... still no response, very displeased with both the restaurant and the service of eat 24. Waste of money threw the gross old cold food out and got fast food instead."}
{"text":"Not bad, but not great either. Ordered delivery online and it was quick for a Friday night. The crab rangoons were beautiful (flower shaped) but would have benefitted from more crab (just charge more for them). I got the chicken pad see ew and it was okay, good caramelization and white chicken. However, it was kind of bland and dry. Most pad see ew I have eaten includes at least a little soy/garlic sauce, this didn't have any.   The pineapple fried rice was rated \"it's ok. Not great, not terrible\" by the boyfriend. So...sort of bland as well.   So kudos Amazing Thai for the fast delivery, foil prepared containers and decent prices. However, we will stick with Nittaya's Secret Kitchen for top notch, flavorful Thai food."}
{"text":"Finally a good Thai place in the area. I had the lunch special Red Curry and it was very good. Comes with soup, salad and an eggroll. Great service and clean establishment."}
{"text":"back again!  we come to the amazing place at least once a week. can't wait till next week to try something else on the menu."}
{"text":"Found this place by chance and loved everything we ordered.  First we had the chicken legs for an appetizer and it was outstanding flavor.  A hint of soy sauce and sliced jalapeño made It tasty.  I ordered the chicken Thai basil and I wasn't disappointed.  The restaurant was clean and the staff were friendly.  They do a lot of takeout from the looks of it while we were there.  I definitely will be back."}
{"text":"I order from this restaurant ALL THE TIME. There are so many delicious true vegetarian options and the delivery is so quick! The food never disappoints. I'll order from here time and time again."}
{"text":"We order from here quite frequently! Love this place and they are great to accommodate vegetarian needs. Delicious!"}
{"text":"I've been meaning to try this place ever since it opened and I wasn't disappointed! My dad ordered the Ultimate Fusion Salad while I got the crispy garlic tofu stir fry.   The salad was so good, my dad wanted it spicier but I thought it was perfect: nicely sweet and spicy. When you order the salad, they ask how spicy on a scale from 1-10 so I suppose you can straight up order the 10 if you want heat. We got a 7 and to me, it wasn't terribly spicy but I thought it was delicious.   The crispy garlic tofu stir fry was aight to me. It didn't hit my taste buds like BAM but it was really pretty. In general, all the food was beautifully presented.  What sold me was the seasonal mango beach ice cream. It had a subtle sweetness and the sticky rice was so great with the coconut milk, not to mention perfect ripe mango on top! I'll definitely come back here just for this sometime XD   Thank you Amazing Thai! I left happy"}
{"text":"Terrible customer service and food was NOTHING to write home about. We called-in for our food at 6:49 on Friday and was told our food (4 entrees: pineapple fried rice, spicy basil chicken, pad see ew, and beef salad) would take 20 minutes by the woman who answered the phone. We ordered pickup and not delivery. We got there a little before time and waited, and waited...and waited. We waited for 45 mins before I finally lost patience and found the hostess who was at the back counter, who did not look as if she was terribly busy, and asked where my food was and why was it taking so long. I told her that three people came after me and left before me with their large orders. She said that these people placed pickup orders before I did. I said \"why would you tell me it would take 20 mins then?\" And she had nothing to say. She went into the kitchen and my food was already sitting there because she immediately brought it up. I paid and left. When we got home, like I said, food was nothing special and beef salad tasted weird. Don't know why most people give it great reviews. There are numerous decent Thai places here in Vegas, and this place is not one I will be giving my business to again. I feel cheated out of $45 and being treated like a second rate customer. DON'T LIE TO THE CUSTOMER ABOUT THE TIME IT TAKES FOR FOOD TO GET READY SO I CAN BE COERCED INTO YOUR RESTAURANT TO EAT YOUR BEEF SALAD AND PAD SEE EW FULL OF LIES."}
{"text":"I really wanted to believe the food lived up to the name. The photos here on Yelp looked amazing, and I do think their plating is lovely. The service is great, and that's why I didn't just give it one star. The restaurant is clean, sparse, but inviting. There, the goodness stops.  The food was below par, lacking in the subtle layers of flavor Thai food is so well known for, and every dish was swimming in grease. Noodles were stuck together, and even the fried rice had no taste. The portions were generous. My husband's Larb had a strange sweetness to it, and not enough vinegar. Nothing eaten here could compare with Chai Tips, just a few miles away.   Nothing eaten here could compare to Thai Basil, just across Simmons. Amazing Thai is much pricier than Chai Tips, but the food quality is below par. We won't be going back, even though the staff could not be nicer, nor the place cleaner. It's just in need of a chef who can bring out the unique notes of Thai food. Hopefully, it will improve in time, and with a new chef.   Until then, Chai Tips and Thai Basil will continue to be our \"Go TO\" Asian restaurants in our area."}
{"text":"Love it all. We especially like coming for lunch dates. The lunch special is $6.95 with lots of delicious options. Spicy basil chicken is my fav!  My man loves the Penang curry. Great service with such nice servers."}
{"text":"This place is almost never busy, but their food is always fantastic. They also have GREEN THAI TEA. I haven't seen it anywhere but here and its nummy. Restrooms are clean, servers are nice, and will answer questions if you have any. Portions are pretty big for the price, which is good. The only negative thing I have to say is that I ordered pickup one time for my wife and I and they got the spicy level backwards on our orders. I wanted mine really hot, and my wife wanted 0. It wasn't the end of the world, but it did make us sad."}
{"text":"The food is amazing. I'm never disappointed. Da mama and I were out going the rest of our Christmas shopping and decided to stop by for a quick lunch. This place is always clean, the service is attentive and friendly. One of my favorites in Sin City."}
{"text":"Tried this place on the way home and I've been back three times! One of my fav Thai spots is Pin Kaow and Amazing Thai definitely measures up!"}
{"text":"The name says it all! The name says it all! The name says it all! We are so happy to finally have great Thai food in North Las Vegas. Every single time that we go, the food is consistently great! The chicken wings are excellent. The crab fried rice cannot be touched. The pineapple fried rice is really great! Their customer service has been Amazing as well."}
{"text":"I order a combination pad Thai and the crab friend rice. They were both amazing and very well seasoned. Price wise average  I called in the order and I love that I can place the order through yelp Great experience will eat there again"}
{"text":"Best Thai food in the area! My boyfriend and I visited on a Sunday evening for dinner and arrived to see about 4 other parties dining in (a good sign). There seemed to be a constant stream of to-go orders so the waitstaff was a little slow to help us. Once we ordered we decided on the beef jerky, roasted duck and the spicy basil fried rice (at level 5 spice).   It took quite awhile to get the food to us and it came out in waves (jerky then rice then finally the duck) which wasn't surprising as the duck takes awhile to cook. Everything was flavored really well - the beef jerky was amazing, the rice was spicy even for a level 5 (hence the name, hah) but the duck was a little dry (needed a good about of sauce to make it enjoyable)  I have a feeling that to-go will be a better option from now on but i'll definitely be returning."}
{"text":"Really great food. Can't wait to go back. I had massaman curry and husband had mongolian beef and both were really good. Service was not very fast, I could tell they are still trying to work things out, because they opened very recently. I am sure over time it will smoth out. Food was great though and worth the wait."}
{"text":"When you don't have a good customer service, you just don't want to come back and that is exactly what happened to me. Food was okay, looks clean, everything good. But they are not very friendly which makes people feel uncomfortable. Food is not the best tho."}
{"text":"What is happening with this place, it's getting worse . When I first went here I was so excited that there was a Thai restaurant in the neighborhood and it was good. The last two times I've been here have been bad. The food lacks in flavor and cooking technique.  It seems as if they just don't care and will give the customer anything.  Please we know better. Good food is good food no matter where you go and this is not good food  ."}
{"text":"What a delightful meal! The service was exceptional and the food was quite nice.  I dined for lunch at about 3:30 (lunch specials 11-4) and there was no one else in the restaurant except for the two people who came in to pick up their orders. The dining room and restrooms were immaculate! Loved the fresh flower bouquets on each table-very nice touch!  I ordered the lunch special panang curry with pork. The soup of the day - a nice broth with vegetables - came out before I even ordered my meal. It was soooo comforting on a rainy, cold day. Then, perfectly timed, the main course arrived with a lovely, crunchy egg roll, steamed rice (basmati I believe), and a salad with a nice, nutty flavored dressing.   The whole shebang came to just $7.50 plus tip of course. The waitress brought me a yummy piece of chocolate and wished me a Merry Christmas."}
{"text":"LOVE this place. We eat here a few times a month. Staff is great. Food is great. Chicken satay, tofu pad thai and cucumber salad are our favorites!"}
{"text":"Super yummy. The noodle dishes are delicious we got the fried egg rolls and they were a bit crazy but they tasted good prices and really good food definitely recommend if you like Thai or if you don't"}
{"text":"Love the food, the prices, the atmosphere, and the fact that they deliver!"}
{"text":"So we visited this place on a Friday evening and didn't arrive until 8:40 about 20min before they close at 9... so the service was kinda slow.  They made it clear they were closing and even had us order our dessert with dinner at 8:50.  Still didn't get any food until 9:15. That said it was seriously some of the best Thai we have ever had. Chicken Panang, Kee Mao Beef noodles, and mango sticky rice.  All Delicious!!"}
{"text":"Couldn't decide where to get Thai for dinner and decided to check yelp and seen Amazing Thai in North Las Vegas. Happy we decided to stop in!  All the food was very good and a very decent price for the amount of food. Our waitress was very friendly and we will be coming back. Thanks for all the great food and service."}
{"text":"Omg.. SO GOOD!! and they actually have crab in their crab rangoons!! I don't care if it's imitation (idk if it is),  they are literally the best I've had in town.. everything I've gotten here is delicious.  All the curry,  pad see ew, the chicken skewers.. amazing!!! Yum yum yum!!"}
{"text":"Great food at a great price. Friendly staff and good service make this restaurant one of our favorites in Vegas"}
{"text":"Immediately greeted by a kind lady and was seated. I love the modern decor and music. Not very busy here on a Thursday afternoon.   Food: I ordered Tom Yum Tofu Soup. It was very sweet in comparison how it traditionally would taste more broth like, the veggies and tofu were good though. My boyfriend ordered the chicken wings and Yum Woon Sen which I'm pretty sure is called \"silver noodle salad\" at most other places, that tasted better than the soup. Still a little sweeter than I'm used to but otherwise delicious. I could see myself ordering that in the future. The wings I didn't try but my boyfriend said they were \"bomb\". I'd trust his word as he's eaten this dish at different locations of Thai restaurants throughout the valley haha.   Overall this is a nice restaurant but don't come in expecting it to taste authentic. I'd say this location is a little more Americanized-Thai."}
{"text":"I love Thai food so I was excited to find this place in my neighborhood, this is my second time Ordering takeout. The restive looked very clean inside and nice. I ordered Pad thai again and it was very good! I love that they have levels of spiciness, i got a 4 which had the perfect balance. I will definitely be coming back regularly!"}
{"text":"I love this place for the food but after tonight they have shown me that the service is Outstanding!! I had place an order for pick and on my way to pick it up my car stalled. I had made it home and decided that the best cure for my broken heart and car was getting Thai food delivered. I called them and they were happy to deliver. When Alex came with the food he brought an extra Thai tea food my troubles!! I am so grateful for them. Thank you so much. I will be back soon!!"}
{"text":"This place is good. There pineapple fried rice is great, Wor wonton soup was good. Friendly staff and reasonable prices. I will eat here again."}
{"text":"If u live in this neighborhood and like Thai food. You must come try this hidden gem it was dead on a Saturday and the food was fantastic, I would hate to see it closed due to no business. The Ambiance is nice clean modern look with great service"}
{"text":"The staff is very friendly, but the food is not good. The dishes are not traditional Thai dishes (e.g., the larb and other dishes that usually use finely cut meat are made with ground meat instead; like ground beef, chicken or prok). I guess they use shortcuts. Our dishes were loaded with sugar and MSG. I mean we ate because we went there starving, but regretted it later. We took home our leftovers, but that went in the trash. Nice place, nice people, but not so good food."}
{"text":"I am rating PURELY based on delivery, as we have never been to the restaurant. This is our go-to Thai delivery and we probably get it every 1-2 weeks. I am always amazed by the speed of their delivery - pretty consistently receive our food within 30-45 minutes, even on peak times. I have tried quite a few things on the menu and have yet to find something I didnt like. The first time we ordered we also received a free mango with sticky rice for dessert that was super yummy!"}
{"text":"I was pleased to have a new Thai place in North Town and very hungry so I called to ask when they closed. They were closed BUT took my order for take out! SCORE! So nice! I tried the pineapple fried rice, chicken satay, duck noodle soup and mango with sticky rice. I don't care for the soup but have never tried that before so I can't fairly compare. The satay and sauce were delicious as was the dessert but the rice was not so great. Will do in a pinch but nothing to write home about."}
{"text":"Best Tom Kha in the area. The eggplant chips are to die for. I've yet to get anything bad from this place."}
{"text":"First time I came here during lunch special hour, I was impressed. The portions were big for being a lunch special. The spices were on point. The staff was very attentive. Great lunch.  The next time I came, portions seemed slighlty smaller and the food just did not appeal to me like last time. Spices were not up to par. I ordered tofu pad thai and got chicken instead. It did not have any spice to it at all when I usually get medium."}
{"text":"It's not your typical trinkets everywhere Thai restaurant. Atmosphere is clean, modern, and friendly. Cheap lunches. The chicken pad Thai was a little saucy and sweet, I guess a bit more Americanized than I prefer, but I give them five stars for presentation. The orange chicken, however was lack luster. Dry white chicken dunked quickly in a half ass orange sauce."}
{"text":"Amazing Thai definitely stands by their name. Their food is absolutely delicious and their spice level is actually on point. So if you can't handle the heat lol stay at a spice level of 5, it's a true medium.   We tried a few of their dishes, Tom Yum soup, pad Thai, and Mongolian beef. They have the best chicken Tom Yum soup I've tasted in Las Vegas. And I've been to at least 10 different Thai places here. Not the best I've ever had but definitely the 2nd best. It was so flavorful, the spice level was on point. We got the soup in a spice level of 5 and it was delicious. You can taste the chili and all the spices combined. It was amazing !!!!  We had the Chicken pad Thai at a spice level of 7. It was so bomb!!! It was a little too spicy for my fiancé, he has sensitive taste buds. But it was perfect for me. The chicken they used was amazing and they had green onion inside of it. Super good.   Then the Mongolian beef. The Mongolian beef was really good. We got it without bell pepper and extra green onions and it was very flavorful, spice level at 6. You can really taste all the flavors it was awesome. The only thing I wasn't a fan of was all the wontons on top. The out a bunch of them on top and they're okay but I felt like they were in the way. I just put it off to the side.   All the good was really amazing though, they didn't disappoint. The only thing that needed some work was the service. They only checked on us once or twice after we orders and got our food. We waited a lil white to get noticed that we were finished and wanted boxes and the check. But other than that, this place stood up to its name and met all my expectations.   I highly recommend this place."}
{"text":"I love their shrimp pad thai! Too bad I have moved now here on the south side but sometimes when I get the craving I would literally do the drive for their shrimp pad Thai and mango coconut sticky rice dessert. It just won't compare to no other.  I love Thai food and their pad thai noodles are the one to crave for. So gooooddd!"}
{"text":"I came here during lunch and another time for dinner. Their lunch specials were awesome especially for the price!!  The food here is really flavorful and tasty!  Love how clean and modern the restaurant looks! Customer service is on point the servers kept checking on you even if it's slow or busy. I will definitely recommend all my friends or family to come here!"}
{"text":"We've eaten here/ordered from here 5 or so times and tonight will be the last.   Curry didn't come with rice, Pad Thai portion was tiny.  Always late, always problems.  The food is good but half the times we didn't get what was ordered and the other half of the times they took waaaaay to long.  We tried picking up a few weeks ago thinking we'd save time, they quoted 25 mins.  We waited over an hour."}
{"text":"Good food. I Like their papaya salad (Laos style). Close to authentic ...best I've found in in the Northwest area. Two thumbs up!"}
{"text":"I've been going there since they opened a few months ago and was pleased with the quality and service, but either I'm going on a bad day (usually Saturday) or they're experiencing some challenges in the back (and front) of the house.   The food quality, presentation, and serving has not been on par with my earlier experiences. And if you ask for a spice level 3, you can bet your butt it'll be the equivalent of 8 in most places. I don't like to send my food back but I had to when my nose starting running on the first bite and persisted its burn for an hour after I ate!  The Lad na noodles I usually ordered that bathed in a luxurious silken gravy are now being served in a big congealed mass of fried goo. Apparently, \"it's our signature dish.\" And if you order duck fried rice, be prepared to tear through a side of sinewy duck. It makes me wonder what happened.  Perhaps it's not just my experience since on the three most recent visits, the place was nearly empty. Even with few patrons, it took at least five minutes to be greeted another ten to place an order. And there was no refill of my water or checking to see if I needed anything either.   Still, it's in my neck of the woods and when I'm desperate and lazy, I'll pop by but if I really want authentic Thai, I'm going to have to make the trek into the city."}
{"text":"finally a really good Thai joint in the north side, service has been great and foods been on point, they even have free refills on Thai tea, I can't think of another place that has free refills like this place. I ordered some chicken panang spicy level 10 and it definitely got my nose runnin'."}
{"text":"It really is Amazing Thai food. Good quality, good service and good prices. 10/10 would recommend to friends"}
{"text":"Very please tell food has been consistently great."}
{"text":"Food is great, but ordering takeout through Yelp is unreliable. Last 2 orders were missed, so I had to wait for them to cook when I had ordered 30 minutes prior to arrival. Their response was to order over the phone. If that's what you want us to do instead of investigating why the Yelp orders are being missed, please don't offer the takeout option through Yelp!"}
{"text":"the service sucks, came in with my boyfriend's family (party of 6) and not once did they ask us for refills until the very end of the service when they noticed we weren't necessarily satisfied with the service, they added the gratuity without even letting us know, i would have understood adding the gratuity but they need to let guests know all other thai restaurants we've eaten at never charge the fee but we are always happy to tip after Portion sizes are decent and presentation of the dishes were well done  the food was good the spice levels were a bit off all dishes were brought out together and  we never saw a server again until payment was due they didnt check on us or ask how the food was we had empty cups halfway through lunch without refills being offered. it just came off as rude since we were the only party in the restaurant at the time If were going to be charged $105 for 4 dishes they can at least serve us with a smile and some hospitality"}
{"text":"We love dining here. Food always great. They need more help, though... never a bad meal; Lunch or dinner. Eat all the dishes xxxooo."}
{"text":"First time trying this place. I can't believe it's right around the corner from my house. The food was amazing just like its name. My 19 year old son was very impressed too. We had pad Thai, Mongolian beef, and orange chicken. Will be ordering from here more often!!!!!!"}
{"text":"The chicken curry is absolutely amazing! The service is typically not the greatest, but the curry is so awesome I deal with it."}
{"text":"I always order Postmates from here when I do not have time to cook. The pad thai, pad see ew, and the curries were all delicious. I would recommend the pad thai!"}
{"text":"Great food... not so great service. I really like there curry. Ordered here twice and happy with the food, but every time my food isn't ready when I get there. I received an order confirmation at 7:37. Says food should be ready in 10-35 minutes. At the time of this review it is 8:30 and I'm still waiting."}
{"text":"My hubby & I attended the soft opening of this family-owned Thai restaurant tonight. If this was a test run, we can only imagine how great it will be after their grand opening!  We were greeted by May, the wife of Chef Palord. The dining room is lovely, hand painted gold on a tan background. Subtle and warm. We ordered the Tom Kha soup with Chicken, Spicy Eggplant with Beef and Orange Chicken, all with level 2 spiciness (cause I'm a wimp!). The soup had lots of white meat chicken and lots of mushrooms in a delicious, creamy broth. The eggplant with beef was served with a big bowl of white rice. I usually don't enjoy cooked green peppers, but in this dish they were super. The orange chicken was sprinkled with sesame seeds & served with fresh orange slices. At the end of our meal, Chef Palord visited our table - what a treat!  We will definitely be back!"}
{"text":"LOVE the Thai beef jerky on the appetizer menu. We really enjoyed the woon sen with chicken and had a terrific amount of large shrimps. Enjoyable egg rolls which were authentic. Tom kar soup was delish especially like all the fresh mushrooms and cilantro. A bit salty hence the four stars. Yummy Thai tea. Will patronize and ask for less salt to be added."}
{"text":"With a name like Amazing Thai I couldn't help but think that (a) the food might be disgusting, and (b) the played a bold move by calling themselves \"amazing.\" This restaurant goes above and beyond to serve some of the best Thai cuisine that I've had in town, especially this side of town that's ridden by fast food joints.  If you walk in here and the place is empty, don't sweat and turn around to the exit. The majority of customers order out or come in to pick up their take out orders. Take a seat and start ordering.  Curry Takoyaki: This is a tasty spin on Japanese octopus balls with just a thin drizzle of curry sauce.   Thai Papaya Salad: Shredded papaya salad with romaine lettuce and tomato wedges. Refreshing and flavorful especially with the inclusion of shrimp - I believe this might be an additional cost.  Panang Cury (sautéed tofu): LOVE this, and it's perfect at a spicy level seven. This is chock-full of soft, sautéed tofu and green and red bell peppers. The curry is exceptionally flavorful.  (Note that all entrees come with rice, and you do have the option to sub out the white rice with brown rice for an additional cost.)  The staff here does a great job ensuring that customers are pleased with their meal and experience. They're always coming around to tables to make sure that beverages receive refills and to clear up plates.  Although I've been here twice, I've told all that Thai food lovers I know to give this restaurant a try. I'm loving this restaurant and will continue to frequent it."}
{"text":"Pros:  - Food was good - Food was presented well - Dining room was pretty well decorated - Reasonably priced  Cons:  - The service was ridiculously slow. The seemed to have a ton of to-go orders, but very few people eating in. It took a long time for them to even take our order. They then brought each dish out one by one. The staff was very apologetic about it, which certainly helps."}
{"text":"New to Nevada and adore Thai food. It's difficult to find places you truly love and can rely on. Amazing Thai Is very good. I got the tofu green and red curry. Both were delicious and full of flavor. My boyfriend got pad woo sen and said it was pretty good. Great place to enjoy some delicious Thai food."}
{"text":"The crab fried rice was awesome! Crispy duck was a bit dry, but had good flavor.  The driver forgot my mussels, but when I called, they promptly had it delivered along with extra drinks! So no harm, no foul. The sticky rice and coconut ice-cream was a perfect end to the dinner. The service was excellent!"}
{"text":"They really do have an amazing thai food I should say.... compared to all Pad Thai tasting we've been doing around the valley, theirs passed my taste bud with flying colors. The only downside are the serving size and pricing. Compared to others,  they have a smaller portion considering the pricing in the menu. It's either they add more to the serving portion or lower the price for the same size. That way... they can claim their name \"amazing thai\" with good food, generous portion and reasonable price."}
{"text":"Worst Thai food I've ever had. Everything tasted like oil. You are better off going somewhere else."}
{"text":"I got a chance to meet the talented chef. He's actually from Thailand and studied cooking there as a career before moving to the States. The food here is AMAZING just as the name states it. My favorite dishes are the noodles soups. The serving sizes matches the prices. The flavors taste homemade and fresh.   ORDER the Mango Sticky Rice!"}
{"text":"Great service, but their food wasn't the best I've had. I went with a friend who absolutely loves it here. So to each their own :) However, I only tried one dish, and she and her husband have tried several. So to be fair, they've given this place more of a chance than I did. But first impressions are everything :)"}
{"text":"The food is good, but the service is terrible. During my entire meal a couple was complaining about not getting their to-go order properly. After that drawn out complaint the service just seemed to stop. The couple behind had given their credit card to pay for their meal, and didn't get it back for 20 minutes. Another couple ordered, and then had to wait forever just to get water. Another couple got the wrong spice level on their food and had to wait a while to get it corrected. I waited about 15 minutes after being done with my meal to get my check. I ordered a dessert, but it was never brought to me. A had to have them take it off the check because they were unaware of the mistake.   It's too bad because the Singapore Noodles were really good. I might try a to go order to give them a second chance, but dinning in again is not going to happen."}
{"text":"I was recommended this place by a  coworker of mine. Being that she did recommend a different Thai place before which was so good. So I decided to try this one out. However,  I was so disappointed with this place and my food was horrible. I ordered Thai basil fried rice, it was so mushy and was covered with basil on top of it, then I order 2 different kinds of chicken wings. Jalapeno chicken wings and salt and pepper wings. I just didn't get why my chicken wings tasted the same and was drenched in salt. I felt like my blood pressure hit the roof! I was so disappointed, being that I spent  $60 there. Probably will never go back! I always give restaurants a second chance, but my experience was just HORRIBLE!!!! IF I WAS A BLE TO GIVE ZERO STARS,  I WOULD"}
{"text":"I love your pad Thai !!!!  it a lots. Finally I found the  place that have the pad Thai that I like. Just too bad that your are so far from my house but I will come visit you soon . I was here twice already ."}
{"text":"this is by far one of the best thai places in North Las Vegas. Every dish is delicious and has layers of flavor!"}
{"text":"This cute little restaurant IS definitely A-mazing!!! Service was great and it was nice and quiet :) my husband and I decided to try this place on a whim! Definitely one of our favorites now! Everything we ate was absolutely delicious. We had tomyum shrimp soup, crab rangoons, spicy Thai basil rice and pad see ew....recommend them all!! Thanks for a yummy date night :)"}
{"text":"Amazing, I just went in there for a nice hot coconut milk soup.and I just got to say it's most definitely the best I've ever had in my life I will most definitely be going back. The wait time was not bad and if it was it would be worth the wait."}
{"text":"Tried this place since we heard some good things about from friends. When we arrived the place was busy around 715pm. We ordered and the first thing i ordered was the special \"prawns in garlic sauce\" well i was told they were out and so i made a quick decision and went with the tilapia fish in chili sauce. At first i wasn't too happy with making a quick change in my order but when the order arrived it turned out to be great dish! I don't know what i was thinking when i ordered this dish but i thought some little tilapia fillets would arrive on my table but NOPE the whole frickin fish in chili sauce showed up LOL. It was a pretty big portion enough for 2 to 4 people. But it was delicious!!! We also ordered pad thai with shrimp and that wasn't bad either. Over all this place had decent service and good food. Not a bad place to try out if your in this area. Gave 4 stars because they should of told us the prawns was sold out before we even ordered."}
{"text":"Really great prices but not the best Thai food. The Thai tea is free refills which is amazing but unfortunately no boba."}
{"text":"Was driving by and decided to try it out, best decision I made! The food was delicious and our servers were so attentive, they answered any questions my boyfriend and I had about the menu. We'll definitely be back!"}
{"text":"EXCELLENT Thai food! Great service!! We have been looking for a good Thai restaurant for a while and I'm happy to say we have found one!!"}
{"text":"Food was pretty good. The Tom kar was rich in flavor and I really enjoyed it but it might be a little oily for others. Their thai tea is refillable when dining in which i thought is great. Also, they have lunch specials mon-friday for $7.    I thought that they had excellent customer service. Employees were very sweet. I was given the wrong order but they accomodated me which shows great service. On top of that, they were attentive to my needs."}
{"text":"Worst experience ever and I have given this place multiple chances to learn from their unprofessional customer service.  The first time I ordered food from here they charged my card on another order and just said I will refund it back to your card, not even a sorry. Just now I ordered food at 6:22pm got to the restruant at 6:40pm and told the lady my name 3 times because she couldn't find it as well as told her exactly what I ordered and she went over to the 2 packages of take out and told me \"it is almost done\" if I could wait, which I did wait. By 7:11pm the same lady tells me I don't see your order are you sure you put it in? After she just told me they were \"almost done cooking it\" she goes back over to the table of packages and goes \"here it is\" (that package was sitting there the whole time I was waiting) I told the lady that was sitting there since I got here and you checked it and said it wasn't my order. Instead of apologizing the lady argues with me stating no it just got here. A man claiming to be the owner comes out and says that it said your pick up time was 6:48pm and I responded yet I was here and it was sitting there the whole time and now it's 7:11pm. The man says well it says 6:48pm so what is the problem? The problem was I waited here the whole time and my food was right there and instead of apologizing you are telling me there is no problem. The man asks me well what do you want and I responded the least you could do for wasting both of our time is take care of half of the bill which was $15. The so called owner tells me NO I cant do that I would loose money. (Still has not apologized) continues to argue with me about no he will loose money and I can just leave. Horrible customer service!!! They made me wait 30 min when my food was sitting in front of me the whole time and goes on to blame me and not once apologizing! Trust me you do not want to do business with this restruant!"}
{"text":"Steak salad and tom yum are amazing!! So good. First time I came here I had the orange chicken and it just wasn't good. Since then I've ordered a few times and they haven't disappointed. Cute little hole in the wall in N LV. I'll be going back!"}
{"text":"Tom Ka is loaded with flavor and everything you will eat, unlike other places where some items are too chewy or hard to be edible. Very nice and polite service too. Clean, spacious restaurant. 5 stars :)"}
{"text":"We ate here tonight and ordered chicken satay with peanut sauce,  green shredded papaya salad,  egg rolls, eggplant with beef in brown sauce, red curry with vegetables, and rice.  Everything was delightful!  The dishes are generous and the food so good that we ate everything!  This is authentic Thai food.  We left satisfied and happy with a to-go menu.  The place across the street just does not come close to this quality."}
{"text":"I am actually taking a break from eating this delicious meal at Amazing Thai to write his review. This is our first time here and will definitely be coming back. Great service and great food. I had the Panang curry and my husband had the Pad Si Ew the portions are very generous!!!"}
{"text":"AMAZING! ! !  The food here is so good... i will defiantly be returning. Closest Thai Restaurant to me, never craved for Thai food but after eating here I want it again . I ordered pineapple fried rice, crab rangoon, beef pad thai and beef ball noodle soup... all were fantastic.  Crab Rangoon was well presented and fully stuffed and crispy on the outer wrap. Delicious.  Beef Pad Thai delicious as always.  Beef ball noodle soup was also delicious!  Pineapple fried rice was my favorite! So flavorful and the cashews really added a nice savory crunch.  Defiantly will be returning!"}
{"text":"The food was very delicious, with the menu including a variety of Thai and Chinese dishes.  We ordered fried tofu chow mein and BBQ noodle wonton soup.  Both were very delicious, although the deep fried tofu and chow mein noodles were a bit too greasy.  They tasted great, but it upset my stomach a little later.  There were a variety of meat and vegetarian options.  One thing I would change is the level of service.  The service was very slow, and our entrees were brought out at different times, which is awkward.  We spent a lot of time waiting for our server.  We enjoyed the place overall and plan to go back to try other menu items."}
{"text":"I adore this place! I went to Amazing Thai for the first time today. Great service with a clean and pleasant vibe. My Pork Panang was perfectly spicy and they offer a very generous portion. Amazing Thai gives a 10% discount to customers who pay cash. I am so glad they are in the neighborhood."}
{"text":"Don't order your food over the phone they will messed it up.. just go there in person to order food the lady in the phone really messed up my order I ordered all mild ( little bit spicy) and got home and all my food are really SPICY can't taste the flavor anymore"}
{"text":"This place is missing everything, it was so disappointing! I ordered the lunch special and picked it up. They didn't include the eggroll or the salad in my order. That is extremely disappointing! Craving the eggroll is literally the reason I decided to try the place. But I wasn't going to drive back.  I got yellow curry and \"upgraded\" to the egg fried rice for an additional $2. The curry was ok but didn't seem to contain any potatoes. Mostly sauce... it felt more like soup. The egg fried rice was just bad. Very mushy with a weird taste.  I wish more of these reviews focused on the taste of the food rather than the service/prices/decor. I tried it because of the star rating but didn't read closely enough to realize that the food is gross and a lot of these ratings are based on other things. All that other stuff is kind of pointless if you don't have good food to begin with.  The pickup experience was average for a small Thai place but wasn't worth it. I wish I had just gone to Carl's Jr. because this was an awful waste of my Saturday calorie budget. I am very disappointed. Anyway, I'm leaving this review so maybe someone else doesn't make the same mistake."}
{"text":"Went here for lunch today and it was Amazing! The dining room was beautiful and the service was great. There are some fun items on the menu as well as the standard Thai options. I really loved the free refills on the Thai Iced Tea. The dessert seemed really good but I was too full to try so I will definitely be back to try them!"}
{"text":"Ordered two beef noodle soup(s) for delivery. Upon arrival both were steaming hot and fresh. Without question both were delicious! When ordered to dine in I have never been disappointed however with delivery I was very impressed. No difference in the two. Just as satisfied with delivery as I would be dine in. Love this place"}
{"text":"I love this place!! It is very clean and nicely decorated. The people are very nice. The food is absolutely delicious. They were very patient with all my husbands questions. Try the pineapple fried rice. It's my fave."}
{"text":"I love Pad Thai but I thought it was just meh here... noodles seemed very soggy to me."}
{"text":"Food came out quick and the service was very good. The food was ok. Not quite like we were hoping for. We both had the Pad Tai. I got the level 8 spicy but it was not very spicy at all."}
{"text":"\"Jack talk Thai. Jack talk Thai REAL good.\" (Meet The Parents). Best Thai in North Las Vegas, for sure. I got it to go and even at my house it was perfect. I love Pin Kaow, don't get me wrong but this place was awesome. My family ordered a variety of everything. The hotness level was on point. If you wanted a 5 out of 10 on hotness level, they came correct. The food tasted fresh and wasn't super greasy or overcooked. This is my new lady jam. I will frequent this joint like Norm on Cheers. They will know my name if I have anything to say about it."}
{"text":"Loved it! You're going to get some amazing Thai food here while also getting good customer service. I had some trouble with my spice level on my pad Thai and she was so accommodating, I really appreciated it. I also got the pineapple fried rice and my boyfriend and I ate it all in two mins haha. They have all the traditional plates with some unique apps as well"}
{"text":"Best. Curry. EVER. I can't say enough about how good it is! And super fast, too. New favorite Thai joint!"}
{"text":"This is seriously a must try! And after you do you WILL come back!!! My husband seriously love all the food everything we ordered was AMAZING and so was the service!!!!"}
{"text":"Customer service was great!!! Food was delish amd freshly prepared... enjoyed everything immensely... Will definitely frequent this place whenever I'm in town"}
{"text":"Two words -  - MANGO BEACH!!!  Must order this dessert.  It's sticky rice with mango and a scoop of coconut ice cream. Droool!! It is so delicious.   The food here is good, I love the curry..it's wonderful! All food is really fresh and lively. There's always beautiful fresh flowers on the tables and restaurant has a nice calm energy, plus in my book!!"}
{"text":"This place gives its name justice. It's pretty amazing. I love Thai food, and having had the pleasure of eating true authentic Thai food, I've gotten spoiled and really picky about where I eat Thai. Living on this side of town I would always have to travel at least 30min to satisfy my Thai cravings. The other two Thai restaurant in this neighborhood are less than desirable. I'm super excited that North Las Vegas is finally on the map when it come to some really good Thai food.   The service and staff are pretty amazing as well. We had friends in town from California who had allergy restrictions, and everyone went above and beyond to accommodate the allergy. This is most definitely going to be my new go-to when I'm not in the mood to cook!   This is a MUST try! You won't regret it!   Food we ate:  Thai beef salad- best I have had in a while!!!  Drunken noodle- still my favorite! Some places make it really greasy, but this was really good I didn't want to stop eating it.  Veg stir fry with chicken- I never usually order chicken, I've been disappointed too many times by under seasoning or dry chicken, but this was just right.   Pad Thai- all I can say is yum! Steamed sea bass- was a little over cooked, but the taste was still there!"}
{"text":"Food is good. Free Thai tea refills was a plus! Friendly and efficient service. I'd give it 5 stars but It was a little over priced for us. Spent about $40 (not including tip) for 2 people for chicken pad See ew, combination rice, one soup and one Thai tea."}
{"text":"Seriously......service is ????? Food ehh. Been to much better place. I'll take my business elsewhere."}
{"text":"As far as the food, it is a solid 5!  But the constant bombardment of the advertising on its tv is something that takes away from the ambiance.  Service is always a 5.  Recommend to come try yourself."}
{"text":"Used to go to Archi's buy this place has delivery. Amazing Pad Thai and Pad See Eiw at affordable prices."}
{"text":"Finally found an amazing Thai restaurant on the North side of town!!! The customer service was awesome!! Everyone there was friendly. Food was great!!! We usually have to drive across town for a really good Thai restaurant, not anymore!! We are so happy it's not too far!! We will definitely be back!!"}
{"text":"Worst i ate, ever not goid taste, why i have put more to end just not good what had burnt taste"}
{"text":"The food was excellent! We had the duck and shrimp fried rice. Nice to have a new restaurant in the area."}
{"text":"I order from here once or twice a week. It can be hit or miss... but usually a hit. It was mostly a miss when it first opened but every once in a while the orange chicken's chicken will be a little off. When it is a hit... it is a HIT.  My favorite things to order from here are the drunken noodles and the duck fried rice. Both are delicious!"}
{"text":"This place was delicioUs!!!!!!!!!! Came across this place randomly...had pad Thai teriyaki bowl n chow mein.everything was sooo gooooddd..gave delivery man 100$ bill he didnt have change n said he would b back with my change he was back in like 30minutes n delivered my change no problems...5 stars !! For service n food !!!!!!!"}
{"text":"I tried their lunch, when I got there only 5 tables including mine. Our server was nice but she forgot to place our order to kitchen. After only our table did not get the food, she came & she said she forgot what we order.  I forgot the name of my order but it was ground beef with basil & it was to salty for me. My mom's bestfriend order pad thai, I'm don't really like pad thai but this place have a good one.. their pad thai better than my order.  I saw they have kao soi kai ( egg noodle curry soup with chicken), so famous at northern thailand like chiang mai.. I will give them another change to try that kao soi kai, I hope is good"}
{"text":"We have visited twice. The Panang Curry and the Pineapple Rice were amazing both times. The Phad See Ew with chicken was way better the first time. Called in the order and I appreciate they told me it would be about 40min. I don't mind waiting if the food is going to be done right! Customer service was great! They are new and working out the kinks, if you've ever owned a restaurant you know how it is, others on here obviously don't! Will definitely be back soon!!!"}
{"text":"Food was good , lots of flavor however if you are going to order anything over spice level 5 be prepared!!"}
{"text":"NOT Amazing Thai.  In fact, this is more like bland Chinese with a touch of Thai.  I have a feeling this is like many other plaza shops that just change their name from a failing business.  Rice: Not Jasmine.  Cheap rice that smells dirty.  Yellow curry with chicken:  Chicken was likely boiled in water then thrown into the sauce because the chicken had zero flavor.  Sauce seperates after a few minutes indicating a \"just add water\" mix.  Pad see eiw with chicken: Greasy and charred.  Broccoli tasted old.  Bland with no added flavor.  Mixed vegetable stir-fry with tofu: I blame myself for ordering this at a \"thai\" restaurant.  Panda express makes a better stir fry. Tofu was the soft version.  Not good for frying.  Ill stick to my spot downtown over this nearby dining option."}
{"text":"Excellent spot for lunch. The hostess has a wonderful personality and will give good \"spice advice.\" The Beef Thai Salad is a perfect protein/veggie option. My niece got the lunch special Pad Thai. A+ and our new monthly place when in North Vegas/Centennial area."}
{"text":"I've bookmarked this place almost a year ago and finally made my way there and I'm so happy I did. This place was great! The food and service were both wonderful! If you happen to be in the north side of town go there for Thai food! Or even get in the car and travel!   Basil beef 5/5  full of flavor and oh so yummy! We got a spicy level of 3 and it was just right.   Pad See Ew (chicken) 4/5  The dish was great. The noodles we perfect not over or under cooked. The broccoli was tender and had a bite. The only reason for the 4 stars and not 5 stars was the quality of the chicken. It was seasoned well but the texture was kind of off.   Egg rolls 5/5 Crispy, fresh, and tasted great. The dipping sauce was also a great compliment to the egg rolls.   Side salad 4/5  The side salad that comes with the lunch special was good. I loved the salad dressing. It was ginger vinaigrette.  Thai ice tea 5/5  Loved it!"}
{"text":"- Great Food  This place is a gem,  spicy basil fried rice,  pad thai,  tokyo curry and larb salad with stick rice. Each dish around $9 - $11, reasonably priced. The quality of the food reminds me of my grandmother's cooking,  which is a very hard to come by  and i'm glad i found this gem of a restaurant.   I have only ordered to go and have not dinned in,  so can't comment on the service but the interactions i had with the staff has been pleasant."}
{"text":"The food is amazing!! Really good options and service was amazing and fast! Great suggestions from the sever!"}
{"text":"Terrible service and not good food. Really disappointed in this place. The service was extremely slow and it wasn't even that busy. The pad Thai was really sweet I didn't like it at all. The satay was good but that's about it."}
{"text":"Absolutely love this place. The green tea with milk is a must, and their crab fried rice is the best from all the other Thai restaurants. The tree desert, well served as it were a tree, and the service was phenomenal."}
{"text":"I ordered online through Yelp. It was simple and quick. I picked up my food at about the estimated time that was stated in the email confirmation. I ordered the pineapple fried rice, house shrimp fried rice, chicken pad thai, orange chicken, cream cheese ragoons and the cucumber salad. All of the food was good. I didn't have much interaction with the staff since I ordered online. They checked my ordered, asked me to sign that I received it and I was back out the door. I would order from here again."}
{"text":"Worse experience ever. I placed my order online through their site (which took me to beyond menu). I selected ASAP and only ordered an order of fried rice. I wait about 15 minutes to go pick up. Walk in and am not greeted so I walked to the counter. I advise I'm here to pick up an order and am told if I placed online it isnt ready. I have a seat. 40 minutes later I decide to go ask how much longer....they couldn't give me an answer until I told them to just cancel my order and refund my card (which they said no). Five minutes later and I am finally handed a bag, which was taken back from me since the lady wasnt sure if it was still my order. Get home to finally enjoy my fried rice and it was greasy. I definitely wont be ordering from this place again."}
{"text":"I hate giving bad reviews, but after being up all night sick to my stomach (as well as everyone else in the house). When I first saw that this was opening right around the corner, I couldn't wait to try it, but I will never order from here again. When I called to place an order the person on the phone was helping another customer with their take out order and asked me to hold. I did. She forgot. During the 22 minutes on hold she helped two customers to their tables and one more with a takeout order. I hung up, called 20 minutes later and finally placed my order. We had a large order - eggplant chips, fried wonton, crab ragoon, pork pad Thai, BBQ pork pad Thai, shrimp pad Thai, BBQ pork fried rice and Crispy duck. I actually liked the wonton and fried rice. My mother loved the crab ragoon  and was thrilled to actually find some crab in every bite (these days, there is no crab, just the cheese).  I will say it all arrived hot,neatly packaged, and none of the containers leaked. That is probably the only good thing I can say. The rest of the night we were all sick to our stomachs, including an 18-month old who only ate some fried rice.  Knowing we had a big order, I expected a delay in delivery. Was told 45 minutes, but it was an hour and a half (after peak dining times) before it arrived. We won't be ordering from here again."}
{"text":"Love having a great Thai place close to home now.... I've tried a few other Thai places in the area and haven't been impressed. But Amazing Thai is amazing...       I've tried something different every time and it's all been presented great and tasted very good.       Favorite so far is the yellow curry and the best thing is the way they fry the tofu it's a game changer! Love it!      Seems like everything is made to order which is good to know but it can be a little bit of a wait if they're busy and service has always been great and keeps us coming back"}
{"text":"Great delivery. Everything was still hot. Curry chicken, Kung pao, Mongolian beef and Singapore noodles were all fantastic. Packed up just right. We will do that again soon."}
{"text":"Came here during our lunch hour on their 3rd day of being open for business. The service was awesome! Very friendly! Greeted us and sat us immediately. Very nice and clean surroundings. The soup of the day was served to us a little cold but still VERY tasty! We got the Pad Thai lunch special that included a salad and an egg roll. All of which was VERY DELICIOUS!! The Thai Tea here is AMAZING!! Although it was very busy in here so we had to wait a little longer than a usual wait time, they still managed to check up on us often and give GREAT CUSTOMER SERVICE!! We will DEFINITELY visit this place again!! Congrats on the grand opening!! :)"}
{"text":"They have great fried rice. However, they are incredibly slow. Estimated 20 minutes for takeout. Got to the restaurant about 25 min after ordering. Still waiting for our food 45 minutes later. Disappointed and hungry."}
{"text":"Wow what a nice place first timer I tried the panang curry and teriyaki chicken and Singapore noodles it was very fresh and full of flavor the staff is very friendly they even offer a 10% discount if you pay cash the only reason I give it a four-star instead of A 5 is the portion sizes we're a little smaller than I was used to so if you're sharing there's not a lot to go around overall great new place"}
{"text":"This place has gotten a lot better. The fish cakes are my favorite appetizer, the basil chicken is also really good."}
{"text":"While this is my first time here and it was ok. Food was not bad but customer service was not great at all. Your greated at the door with a smile and thats all you get from there. Prices are not bad but fyi if you have 4 or more people right away you get charged %18 gratuity. No option fir any other amount. Dont think I'll be returning."}
{"text":"I was excited to see that we had a Thai restaurant up north. Well, I ordered takeout and had the lunch special, and it wasn't what I expected it to be. Plus the wait for the food was too long, I left the place starving."}
{"text":"When this place first opened up it was awesome. Food was great! Staff was slow but nice. Now....it takes over an hour to get food. So we started using their delivery. Mistake. 2 hours. We constantly call back to get a status and they play like they forgot the order. This has happened 5 times. I kid you not. A nonchalant \"sorry about that\" is all we get. I don't want anything for free I just want to know what happened? They just started giving no fucks and it's sad cause this place is actually really good. I'm done giving them my hard earn money for a shit show."}
{"text":"I was anxious to try this restaurant, I've had a hankering for Thai for a few days.  I go into the restaurant ace I greeted by a woman eating.  Im looking over the menu when she walks up aca tells me when I'm ready to order to just walk upto the counter. Mind you she did t wash her hands or anything, do I shrug finish looking at the menu and walk up to the menu....I place my order, after a question or 2, and HAND HER MY MONEY..... she places my change on the counter without hesitation and walks off. I leave then change.on the counter and proceed to walk off...I get to the door and I have a chnge of mind...so I walk bak over and tell her to cancel my order. She asks \"Whats wrong you cant wait 10 minutes\" and I reply, \"NO, I handed you m money and you put my change on the counter\" she say \"yeah, so\" I just look at her and wait for my money back. Im HUGE on customer service and this just did it for me. DONT PATRONIZE THIS PLACE....EVER.....PERIOD."}
{"text":"Love this place, nice & clean, the food is AWESOME!! excellent customer service every time I come here THIS PLACE IS AWESOME TIMES TEN!!"}
{"text":"The food was yummy!  That was the most flavorful fried rice I've ever had in my life.  The duck was awesome and went well with the rice.  The pad Thai was good! Next time we will try the crab fried    Service was great!  Very clean"}
{"text":"The food was good, service was good when we  had dinner the restaurant.  It would nice if they were closer to Centennial Hills or if they had a location there.  I will come back again."}
{"text":"Pretty good Thai restaurant to go to in North town; especially when you're craving for good Thai but not so much to trek to Spring Mtn LOL I love their panang (I don't like it thick) and they make it perfect. We always get their Thai fried rice- yum!! And of course then mango sticky rice is always a fave for dessert. The staff is super nice, we've never had issues with this place and that's why we keep coming back."}
{"text":"Food \"ok\" but flavored not great, temperatures could have been hotter which would have improved flavored a lot - especially the soup.  Newly opened, permanent menus not yet delivered & temp menu printed too small. Premixed seem clean, place is friendly."}
{"text":"Very attentive. When you walk in your quickly greeted. Lots of seating. Menu prices are modest. We ordered alot of food. Everything was plated very beautifully. Ample parking outside. Their desserts were my true fav"}
{"text":"I'm usually all about authentic, particularly when it comes to Thai food; but this place was just Blah.. food was ok, service was bad and portions were small. I had the beef jerky which is usually really good at most Thai restaurants but this one was so sweet and bad quality. I didn't even have one piece. I would not recommend nor return because there are better options w better portions."}
{"text":"North Las Vegas is plagued with b-level restaurants. This ones just slightly above average. The soup was good though! xoxo EatWithReese"}
{"text":"YUM! Ordered off of Postmates  I made the mistake of passing this place up and ordering from a different Thai restaurant (it was awful).   I ordered the Tom Kar vegetable and a Thai iced coffee from Amazing Thai and holy cow! Delicious, fresh flavor and packed with veggies! Lacking NOTHING!  Thai iced coffee is delicious as well!  I will be ordering again to try some new items!"}
{"text":"The food was awesome as usual and the service even better! They are so friendly and attentive... and you have to try the Thai Iced Green Tea... it's so good!!!"}
{"text":"We were craving Thai NYE, but not craving leaving the house. After checking Yelp, I settled on delivery from Amazing Thai. Amazing it was. Delicious pad thai, chicken panang, and OMG, where have eggplant chips been all my life??? The only slightly unfortunate part was that the website said the food would be delivered in 28 minutes but it actually took an hour. It would probably have been even better served hot in the restaurant, but allowances must be made for personal laziness!"}
{"text":"Got papaya salad and green curry to go. Came out to about $23 and the curry was more like watered down soup, and the salad was mediocre. This obviously isn't Lotus of Siam, but for the price of two items it's quite steep and underwhelming. For North Las Vegas standards it might be considered palatable, but there are better options around town. I would not recommend this my AirBnb guests."}
{"text":"The egg rolls are okay but the chicken wings are absolutely amazing. I am the queen of chicken wings and these are at the top of my list. I ordered mine extra crispy and sauce on the side"}
{"text":"Food is pretty good.  It's nice to have Thai restaurant in the area. The service is great! They went above and beyond!"}
{"text":"Loved this place! So nice to have a good Thai restaurant out this way. The Pad Soon Wen is probably where they got their name because it was amazing! Wasn't a big fan of the Pad Thai, but I can find plenty of other delicious things to make up for it!"}
{"text":"We might go broke because of our love for this place! We just got delivery for the first time and I have to say that it was super fast and everything was correct. Our kids are now lovers as well. Our picky daughter said it was the most amazing fried rice she's had. She's tough to please. Thank you for fulfilling my craving yet again!"}
{"text":"It was pretty good Thai food the only reason that I gave it one star less than 5 is because it wasn't as good as I am used to from other places. Also I only have it four stars because I literally ordered 3 meals and they said it would take 30 minutes which is the longest I've ever heard to make fried rice but I figured they were busy. When I walked in to pick up my food there were absolutely no customers. A person called on the phone and ordered a lot more than me (I eavesdropped) he told her 15 minutes.   My food was alright but my family loved theirs so I think it is a place we would eat again from."}
{"text":"Always a good Thai place near. Tonight was a long wait an hour after we ordered we finally got our food. It's too delicious to complain though. Plus people get busy understandable. Worth the wait     Spicy basil fried rice with chicken was so good, along with the pad se ewe. One of the better Thai places by Aliante and decent prices."}
{"text":"This place was ready good. Found it on yelp and everyone enjoyed the orange chicken and spicy rice with chicken and basil. Really yummy and clean on the inside and nice."}
{"text":"This Thai place is legit amazing!!! The food was pretty delicious. Had some duck fried rice and tom yum ..pretty big servings and average price was about $8-$12 a plate.Glad I found this place in north Las Vegas."}
{"text":"I wish I could give this restaurant a higher rating, I love ethnic food and love Thai!  I dined with Kathy H and I see she felt the same as I did. First of all the menu we were given was a To Go one printed in a very small font and was very difficult to read. The server apologised and explained the new ones were on the way. Until they arrive, I suggest getting the printer to give you 30 just to use in the meantime.   We ordered the lunch special, and it is a great price starting at $6.95 and it included a salad, egg roll, salad and an entree. When the soup arrived it was mushrooms in a tomato based broth. First of all, the broth was lukewarm and secondly the mushrooms were virtually raw and almost cool. I realize it was early, 11:00 but that was unacceptable. The server was very nice and explained the different types of curry. Last week I tried the Panang and was disappointed in the flavor, and the texture of the chicken. This time I tried the Red Curry and Beef. Again, the meat texture was off, they are marinating the meat, but the flavor is not coming through. The curry sauce was OK but I was not wowed. My salad had some pieces that were slightly wilted and it was drenched in a bottled dressing. They do get points for the presentation, it was beautiful. The decor is fresh and modern but I am not a fan of TV's when I am dining, and on top of that the music was on so there was a show with music as the background.   I wish the food was as good as the service, and maybe they just need the time to work on the delivery of the menu items,"}
{"text":"Soooo delicious! Im really picky when it comes to the thai food i eat, especially when its pad thai. I typically find the \"good\" types of food on the other side of LV. Thats why im incredibly happy that the north side has excellent thai food from this place!!!! Its super close from home and not located in a crowded area"}
{"text":"Average. We were looking for a new place to eat and we're feeling Asian food. Read the reviews on yelp since it was close by BUT I wasn't impressed.   Weren't a lot of people in the place and there was only 1 server-red flag which we ignored.   The chicken pad Thai was AVERAGE, I've had better.   The crab fried rice was horrible.   Would we come back? No.   Would we recommend? No."}
{"text":"This was the best Thai food ever. Like seriously the Tom kar soup was amazing. The girls in there need more help because the service wasn't that great. The girls were nice just overwhelmed with the people dining in and the to go orders and the phone ringing off the hook. I called 6 times and never got a answer, so I finally walked in and placed an order. Rating is based on the food. I like the staff but they need more help. This restaurant could be a huge hit if they had the right help and processes in place."}
{"text":"I can easily say that this is the best Thai food I have ever had, and I eat Thai food quite a bit.  Amazing Thai lives up to its name because Amazing Thai is simply amazing.    The potstickers come drizzled in some kind of \"secret sauce\" that is absolutely to die for.  I ordered the sweet and sour chicken, but I asked for it to be an 8/10 spicy.  It wasn't very spicy at all, but the flavor of their sweet and sour combined with the chili powder made for an extraordinary flavor.  My girlfriend always orders pad Thai; which to me is really just boring filler, but their pad Thai was actually very impressive.    Also, do yourself a favor and order the Thai iced green tea.  It's incredible.    All in all; this place is amazing. Needless to say, I'll be back soon"}
{"text":"This is probably my favorite Thai restaurant in town. I drive halfway across town just to visit this location, and it is WORTH it. Service was attentive and friendly, and my water was always full. My favorite dish was the tilapia with priking sauce, it had the perfect amount of spice without losing the flavor of the coconut sauce. Would recommend this place to anyone"}
{"text":"Lunch special was filling and delicous. Had the panang curry mild spicy, enjoyed and was plentiful. Thai coffee was great and refillable!! Mango n sweet rice to top it off. Will be back!!!"}
{"text":"Enjoyed the Pad Thai and Pad See Eew. Both were very good, though the spice was a bit off. The first time we ordered medium and the spice was not evenly distributed. We'd take a bite and not get any spice, then take another bite and POW! Definitely needs to be mixed in better. The second time we ordered mild and there was no spice at all, which was even worse. So we'll just have to order medium and be sure to mix it ourselves before eating. We ate our dinner at home both times, so I am unable to comment regarding the service in the restaurant. Delivery was quick and easy."}
{"text":"This is amazing food! We order from here frequently and are never disappointed. Delivery is fast and the food is hot and always correct!!"}
{"text":"This is the best Thai food in this area of town hands down! When they moved in I texted everyone I know because I was so excited. Their menu is extensive: it has all the traditional Thai dishes and quite a few surprising ones. The eggplant chips are to die for and for dinner I can recommend.... everything I've had! Curries, eggplant, stir fried, you name it!  Service can be slow. Service can be a tad bit disorganized. If you're in a rush, do take out. Otherwise go, enjoy the food and relax!"}
{"text":"I enjoy the ambience of the restaurant. It's nice and clean not too busy. The food is savory and fresh!"}
{"text":"I love this place! They really do have amazing Thai food! They have a cheap lunch special that has more food than I can eat at once. I come eat here about once a week now. They have great staff that are very nice. I am vegetarian and they have the best tofu options. Great presentation and  super yummy food"}
{"text":"Red curry was ok. The soup was not that good.  I order red curry with chicken 10 spice.  The chicken was not that good. Seem like it was like rubber or fake chicken not sure how to explain it. The prentasaion if the plate was good but one thing they had sauce on the side which I don't know what it was. Sorry to say I been to lots of Thai places in USA and I have to give this one a 2 star. One thing I like was free thai ice tea refills can't find that in other places in Vegas or us. But I just tried red curry.  There's other places that are good in North Las Vegas or in Vegas period. Also took a long time to get my bill keep on looking at them. Didn't care if I was here."}
{"text":"I am recommending 1 star, because I felt they lack in customer service and although the food is okay the few times I had it, I was terribly disappointed with the service.  More specifically, I attempted to order food and was placed on a long hold just because customers had entered the restaurant-which I later found out. When my phone call was picked back up (what seemed like 5 minutes later) it was a different person all together. She wanted me to repeat my order when I had already been given a price and a estimated time to pick it up. My call was handled poorly and she made an excuse by saying oh customers entered the restaurant which was why I was placed on hold. I refused to repeat myself especially after hearing her defend the previous individual. Its not worth it, so I hung up and I'm not going back. Rude!"}
{"text":"My favorite Thai restaurant in Las Vegas.  Speedy delivery too"}
{"text":"Amazing Thai is my new go to place for Asian cuisine in North Las Vegas.  All the other Asian restaurants on the north side all have similar tasting food whether it's Thai, Chinese, Vietnamese etc. Amazing Thai bucks this trend.   I have eaten in the restaurant once and had delivery twice and the food has always exceeded my expectations.  My favorites so far are the Singapore noodles,  Mongolian beef, any of the house fried rice and the chicken satay finger appetizer. I will update this as I try more menu items. What I like about all the food that is common at most Asian restaurants here, is that Amazing Thai's take on them is unique and delicious.    The only time I ate at the restaurant was a good experience.  It was a Tuesday evening so it wasn't very busy.  We had multiple employees come to our table to check on us, and all were very friendly.  The dining area isn't fancy but it was clean and had a decent amount of seating.    Both times I had delivery service were good experiences as well.  The prices are competitive, delivery was quick and the food was still hot. I highly recommend this place and will be going back."}
{"text":"We looked on yelp and found this place. What a gem. Food is fresh and tasty. Portions are plenty to share. We had 3 dishes and brought home rice and entree for lunch later. We had noodles and spicy basil and crunchy garlic. All were a 6 in spice. And we all do spicy. We are from So Cal and have good Thai there too. This was great and I want to go again to get something differen"}
{"text":"This is our favorite Thai restaurant !! My family and I love the mango sticky rice..."}
{"text":"This place is \"The Bomb\". If you like Thai food then Amazing Thai is a must try. I can not say anything about their service because we have never eaten in the restaurant. We have ordered it to go about five times and it is always delicious."}
{"text":"This is my favorite Thai place and order delivery here atleast 3-4x a month!!! Good is fresh and the pad Thai is probably the best in th the city. I always get the. Friend rice with chicken for my daughter. She's one and loves it!"}
{"text":"Terrible service at night.....customers sitting waiting for their food, tables haven't been cleaned up...."}
{"text":"My wife and I went here on a lunch date and the food was great. We both thought the environment was lacking a bit. We'll definitely come back here to eat again."}
{"text":"Amazing Thai is one of my go-to delivery spots when I'm too lazy to cook. The drunken noodles and Thai basil tofu are my two main squeezes I always go back to. I get the drunken noodles without the onions and bamboo, and the remaining bell peppers, steamed tofu, and mushrooms are plenty for me. The mushrooms are out of this world! They're probably my favorite part of the drunken noodles. The Thai basil tofu comes with a side of rice and also comes with bell peppers. Both are spicy dishes.   It's rare that we eat in, but if we do we're all over the Thai iced tea! It's legit delicious. Even better, Amazing Thai is the only place I've ever been to that gives refills. Make sure you ask for coconut milk for your tasty tea. ;)  The only drawbacks for Amazing Thai is its smaller portion sizes and the steep-ish prices. My order of drunken noodles and a Thai iced tea came to $17+. That is waaay too much money to spend on one person for delivery. Still, I'll keep coming back because the food is consistently good.  YELP 100 CHALLENGE 2017: #37"}
{"text":"Hands down... best Thai food restaurant in the area. So far I've tried the parang curry, the pad Thai noodles, crab fried rice, and the fried tilapia. Everything was a 10/10!"}
{"text":"I was excited to try this place because of all the 4 and 5-star reviews and it's close to home.   We got here for dinner and the place was empty. Not even an employee was in sight. We heard banging and clanking in the kitchen so, they got to be open. We were saying \"hello?\" to get somebody's attention but nope. We were ready to leave when finally, the hostess/server came out.  We tried a few items on the menu. I was happy that they have refills on their Thai iced tea! That's probably the only thing I liked about this place.  Basil in Egg Cup: Fried hard boiled egg white with chicken satay. The chicken was sweet and pretty weird. 2/5  Beef Salad: This was pretty tasty. But it was spicier than it should be. 2/5  Tom Yum: I had chicken added. Their spicy level is from 1-10. I asked for a 6 but it tasted like an 8. I burnt my taste buds and my stomach. 1/5  Tom Kar: Basically, Tom Yum with coconut milk. Same issue here: burnt taste buds and stomach ache. 1/5  I was disappointed and was in pain. I think I'd rather drive a few more miles to get some good Thai food. I was not amazed."}
{"text":"This is my second time here. I really enjoyed the eggplant chips and the Shrimp Panang. They are always attentive and pleasant. Definitely coming back!"}
{"text":"This restaurant should have \"Notso\" added to their restaurant name.  We went for dinner and ordered hot green tea, the Salt & Pepper chicken wings appetizer, then Tom Yum Kung (\"shrimp\" for the farangs LOL) and Crab Fried Rice.  Here's the \"play by play\":  1) Hot Green Tea--$3 an order is a big markup for basically hot water and a tea bag.   2) Salt & Pepper wings were really good and served hot.  We thought this was a good omen and couldn't wait until the next entrees.  On a down side however, the appetizer was served without any accompanying plates for us to eat on which forced us to eat over our napkins and the table top.  We couldn't wait for the busy waitresses to come around to request plates because we were hungry. 3) Tom Yum Kung (shrimp)--bland, served lukewarm, and although we received cups to eat soup out of, we didn't get spoons to eat with (only forks on the table setting).  I couldn't taste any lemon grass, galangal, or lime juice in the broth.  The soup was watery as if they were stretching the last bit of soup before closing for the night.  The amount of shrimp was good but the soup only had some floating button mushrooms without much cilantro or tomatoes. 4) Crab Fried Rice--served lukewarm, and the rice was dry (in clumps) with hardly any crab or scrambled egg in it.  It was mostly stale rice with soy sauce in it.  An uninspired fried rice dish--very disappointing.    The main problem that we could see is there was only two waitresses and they seemed overwhelmed and not familiar with restaurant operations.  I couldn't see what was going on in the kitchen but the fact our food was not piping hot may indicate the dishes were ready for serving but the waitresses couldn't pick the dishes up and they sat around cooling down.    It's too bad this restaurant didn't deliver a good Thai food experience in this part of town.  I like Siam Garden (LV Blvd) and Lotus of Siam (Sahara) in Las Vegas for Thai food.  Pin Kaow is pretty good but I tell them to not make their dishes so sweet as I prefer savory over sweetness."}
{"text":"This is a nice neighborhood option if you are in the mood for Thai style food. I've been here 3 times so far for dine in and 1 time for takeout. The food and service is relatively good and if you like Thai tea then you are in luck because they offer free refills for dine in customers. If you haven't had this drink, it is very sweet and I think mixed with creamer or half and half. There are better options in terms of taste and variety available in Las Vegas area if you are truly a Thai food fan but if you don't feel like driving far then this is a great option. I would rate them 3.5 stars but since I haven't had a bad experience I rounded it up to 4 stars. Keep in mind that they get busy around early dinner 6-8 PM and also get a lot of takeout orders."}
{"text":"this place stands up to its name! its amazing! the thai tea is perfect!  i ordered the pad thai luch special and egg fried rice. it was filling and was flavorful. the egg fried rice was beyond expectation, seasoned to perfection. i will definiately be ordering lunch from here often. excited for future orders!"}
{"text":"The food was decent, but the food quality was not enough to make up for their awful service.   I called to place a pick-up order and they said it would be ready in 15-20min. Great, no problem. I got there 25 min later to pick up my order thinking it should be ready; it's been over the 20min they had promised. WRONG! I get there and pay for my food, then the lady in the front says \"have a seat.\" So I go sit down to wait for my food. 15 min later, still no food. I ask the lady how much longer it is going to take for my food to be ready and all I got for a response was, \"oh.\" Then she proceeded to walk away and never came back to give me an answer. I continue to wait. 15 min later I FINALLY get my food...almost an HOUR (55min to be exact) after I had originally placed my order! No explanation either as to what took so long. Don't get me wrong, I get places get busy but I watched dine-in customers come and go before I got my order! There were maybe 4 tables occupied at the time, so they were by no means full.  Amazing Thai...if you know you're busy and are going to take forever to fulfill an order, please let the customer know that! Also, maybe consider keeping your customers informed on delays and not blatantly ignoring them."}
{"text":"We went there on 2nd Jan 18 lunch. It was so cold inside that we had to eat with our jackets on. We requested the waiter to turn the heat up and he showed me a note from his owner saying not to touch the thermostat. It was a horrible lunch.  When the customer is telling you what and how you can make things better and you choose to be miser with your gas bill, not much good reviews you can expect."}
{"text":"Just got our order and the food is horrible.   The service was fast but food was not worth the 50$  Verry disappointed. I love thai food and this did not compare.   I'm used to spicy Tom yum soup, this was way too sweet!!!! Missing true thai flavor.  Will not order again!"}
{"text":"This is the best Thai food I've ever had. And I love Thai food. Every dish tasted different and fresh. They were full of ingredients and not just too much noodles. Definitely coming back"}
{"text":"Went here for dinner last night.  It was great.  Decor is nice, service was awesome and the food was also top notch.  Try it out!"}
{"text":"Khao Soi, Khao Soi, khao Soi!!!!!  You gotta order this!!!"}
{"text":"Best Thai food in town hands down. The food and the service was amazing. I believe this restaurant just open a couple weeks ago."}
{"text":"I've been here quite a few times because it's one of the few Thai places that I like that is near my house. Only dined in once, but I usually order to go. Whenever I'm here, there's usually only 2-3 other groups eating here. They get a lot of pick up orders - while I was eating, there was probably 5 people that came in to pick up their food.  Anyways, we ordered Chicken Panang, Khao Soi with Chicken, and Seafood House Fried Rice. There are some reviews that say their food is average - I think it's great and very flavorful. If you're not a picky eater, you'll enjoy this place. They cook their food here on the spicy side, but I like it that way. Also, they charge $1 for extra ingredients in their foods, such as basil or bamboo shoots. One downside is that their food does take somewhat of a long time to come out, but the servers would always check back to our table and update us when they can. This isn't a super big restaurant where there's lots of people cooking in the back so I understand. I like this place, so I can be patient about waiting a little longer than usual for my delicious food.  Sidenote: Overheard a conversation with another customer where they got her chicken satay order wrong and a lady employee here, who I'm assuming is the manager, insisted that a make-up order be made totally free of charge for her. The manager recognized that she was a regular to this restaurant and wanted to make sure she left happy. After reading reviews about bad customers service, it's nice to see now that they really care about their customers."}
{"text":"Amazing Thai. Amazing...no. Thai...yes.  We stopped in for lunch. I love seeing new restaurants open up on our side of the valley, because I feel North Las Vegas is a lot slower at that in comparison to the Southwest/Southeast. It was a great opportunity to support the Thai movement business in hopes we no longer have to do the drive. We still do...but this place is definitely an emergency lunch option. Emergency as in if I have to sit in the car for 2 minutes more listening to all the shit I hear back there, I am going to lose my head. Jokes aside.   It was 12 something and we entered. I immediately felt  like it needed to be jazzed up. I get it, they're still new...maybe they're feeling it out before they completely invest anymore money for decor, etc...quickly we were greeted then seated. Great!  We sat and dove right into the menu. I didn't care to go through because I knew I was going to get something off their lunch special. My phone seriously auto-spelled sexual vs special. Good thing I caught thaaat typo. I'm going off the subject again. Once we were seated the waitress went off somewhere so drink orders happened some minutes later.  Lunch specials are 6.95. An entree from selected lunch menu, soup of the day, spring roll, salad, and steamed rice. That's a pretty good deal around this 'hood I must say! I had the spicy eggplant no meat. Husband had the red curry with beef. Ordered the toddlers the beef fried rice. Also, I had to try the Thai iced green tea. 3 bucks free refills! Spiffy! Haven't frequented much Thai joints, but enough to say none of them offers FREE refills on their Thai teas/Thai green teas. Winner.  There was only 1 worker working that room. Upon entering there were about 5 people in there, when we left there were about 6. She did her best being the only one, but we surely experienced the delay between her going back and forth with orders, disappearing for a moments time...I'm thinking she was helping cook too? But I don't know. Although service was a 3 to me...I have to give her 4 stars from being as attentive as she possible could giving her circumstance.   Soup of the day was a bowl of their tom yum soup. While I didn't think it was bad, I wished it wasn't served so lukewarm, and it also was a lot sweeter than I'm accustomed to. I finished it anyways as it wasn't that bad but certainly isn't the best.   When we got our food I noticed I had no steamed rice. I looked at my husband then said, this is healthy stuff, I got a salad and spicy eggplant. Do I not get rice or something? He says, of course you do. Yeah...of course I do. I'll wave her down. This is one of the instances disappearing for a moments time is in effect. As my husband is going to town with his curry eating away...I've managed to finish my salad, the salad on my sons plate, my eggroll, and empty out my green tea before I was able to wave her over. She eventually popped out but then she had to help a to-go order, then she was bringing out a dish to an elderly couple, she was busy. I get it. My rice quickly arrived as soon as I told her.  My dish was a 5 level in heat; it packed a pretty good heat. The chest was warm. I thought the weather was cooling down? Lol. They definitely pack heat even at a 5. My husband said his red curry was pretty good. Surprise surprise and surprise surprise that I'm even typing surprise surprise.   HOWEVER, the beef fried rice was funky. We didn't finish the meat in it. The meat was cold? I thought, maybe it's cold because it sat for a moment before I scooped into it. I tried the meat to begin with 'cause in my mind...if the beef taste good...it's all gonna be good. The beef being cold, the rice warm...do they precook meat? If so...uh, stop. Not only that, the meat was tough and it tasted old. Here's when you know I'm not crazy, even my 3 year old who eats everything quit and said, mommy don't like it. as in don't feed me the meat just give me the rice.  The rice was more like sticky rice kind fried rice which is good, but wasn't good here. The rice lacked a certain quality or freshness to me, but that's just me. A little salted on some bites. That Thai iced green tea is good stuff. I know for sure I'd be back just so I can order it.   Overall, twas alright. I'd recommend them for sure because for a 6.95 lunch special paired with refillable Thai teas?! yes please! One of those suffice status restaurants. I'm just not yet convince this is a place I'm willing to drop full menu price for. They're certainly still working on their kinks. Definitely kid and stroller friendly!"}
{"text":"Excellent Thai food and service! Panang Curry, Crab Fried Rice and Pad Woon Sen were all flavorful and delicious."}
{"text":"I was so happy when I found out there was a new Thai restaurant open not so far away from my house. It's so hard to find any good restaurants on this side of town. Ordered to-go from amazing Thai and it was so good. Now I know where to satisfy my Thai craving!!"}
{"text":"We got the Curry Fries, Panang Curry with Chicken & Shrimp Pad Thai. Everything came out quickly. The food was delicious! I like my food spicy, so I asked for an 8 (of 10) and asked for a 'Thai 8, not a white person 8'. Spice level was perfect! The service here was excellent as well. Definitely happy to have a great Thai place close to home!"}
{"text":"This is my favorite Thai restaurant in town.  Their lunch special is $6.95 and the food is incredible!  They have free refills on their Thai tea!  The restaurant is clean and has convenient parking."}
{"text":"This place is great. They have an awesome lunch special. The sticky rice mango is a must try. Thank you Michelle!"}
{"text":"What a surprise. We went on a journey today to find a new place and we definitely found it. Nice little place, very clean and friendly staff... The food was also phenomenal, very fresh and tasty!"}
{"text":"Really good for a great price! Love this place, food & service. When family comes to town this is where we take them. Sooo yummy."}
{"text":"Awesome food!  We had lunch here and had red curry chicken and green curry with tofu. It was OUTSTANDING!"}
{"text":"Everytime I take my mom out to eat this is her favorite place. It's local and the food never disappoints! I never heavy sigh with my mothers repetition for this place."}
{"text":"They have AMAZING pad Thai, egg rolls, and fried rice! And they are right around the corner from me so it makes it even better! Oh and don't forget the unlimited refills on the Thai tea when dining in!!!"}
{"text":"Our server was super nice and it had an inviting environment. I took my dad here while waiting to get my car serviced and the food came out quick. It was delicious! We both got a lunch special which was $6.75. It came with a main meat, egg roll, soup, and rice. Definitely would come back."}
{"text":"Alleluia!   Amazing Thai Restaurant has arrived in our neighborhood in North Las Vegas and I couldn't be happier.  We don't exactly have a plethora of good food options near us here, but things are slowly turning around.  Amazing!   We came here for Saturday lunch and the items we ordered were:  Chicken Satay Finger- Ordered off the Fusion Appetizer section, my son called these chicken tenders!  I guess so, but better.  Marinated in Thai style marinated and then fried, they are served with house peanut sauce.  We enjoyed them.  Fried Won Ton:  my son's choice.  Nothing too special about them, but not everything has to be extraordinary, just satisfying.  Thumbs up from him.  Pad See Eiw (side note: I've seen so many spellings of this dish.  Which one is correct?  This is their spelling) - my son's girlfriend orders this at every Thai restaurant and she loved it.  Spicy Basil Fried Rice- kiddo's order at the spiciest level of 10.  I tasted it, but it was way too spicy for this wimp (me), but he also liked it.  Pad Thai Shrimp- my order and I only ate half because I was already getting full because of the chicken fingers and I wanted to leave room for dessert.  Good dish that I can enjoy again as leftovers.  Volcano Ice Cream- vanilla ice cream with raspberry and caramel sauces over chocolate rock.  This was a fun dessert to look at and tasty to eat.    Service was excellent throughout our meal and I foresee us returning since it's close and since it's good. Going back soon to try the Mango and Sticky Rice!"}
{"text":"Amazing Thai? Yes, very amazing. Aside Pin Kaow restaurant being my most favorite Thai restaurant I say this place is second on my list. They serve very authentic style food and presentation is appealing. My favorite order off the menu is the \"Tom yum soup\" #3 spice & \"papaya salad\". The other entrees we had was the chicken satay and sweet chili fried rice was great too.   Food portion can feed up to 2-3 people on what we ordered. Want to come back and try their dessert like the mango sticky rice and other items off their menu. Will recommend to friends and family to come here. Customer service was very helpful always checking up on us. Awesome atmosphere and vibes.   Tip: Go lightly on the spice level Becuase a #3 was pretty hot for us already for the soup."}
{"text":"Everything we've had from here has been on point. The fact that they deliver is a bonus. I personally love the yellow curry, while the rest of my family enjoys the pineapple fried rice."}
{"text":"This place was amazing, just like the name of the restaurant! Great customer service, always came to check up on us and drinks were never empty. The food was so yummy, we had the spicy basil chicken egg for appetizer...and it was amazing! Must try!! Different but in a good way! We also had the spicy basil crab fried rice and crispy pork. Everything we had was presented so nicely as well. Cute, romantic place to go on a date."}
{"text":"Incredible food. We had the crab rice, basil rice, cucumber salad and the sweet and  sour soup. I must say the food was delicious. The service was great. Very friendly staff, smiling faces through the entire dinning experience.  Will return."}
{"text":"The location is pretty nice, the interior of the restaurant is big and clean.   The food does take a while so be warned, we waited over 20 minutes to get 3 dishes and the restaurant wasn't busy.   The food was good, nothing that would make it a memorable moment but decent enough to satisfied my hunger. The portions are very good and the flavor is there, there is no wow factor.   Side note, their credit card minimum is $7 so if you are thinking about just getting a lunch special by yourself, you will have to get a drink with that."}
{"text":"Great place for Thai food in our area!! I've tried almost everything on their menu,  My favorite is their spicy basil, tom kar soup, Singapore noodle, chicken paneng curry, pad Thai  or pineapple fried rice, with a side order of, fried won ton, crab rangoon, chicken satay or amazing Thai takoyaki curry, at times I order fried won ton skin, which they don't fry until I get there, and while I wait the waitress would bring me Thai ice tea...  Most of my food has special requests for the chef. I ask for less sweet, and spicy level 3 or 4 and the flavors are still there, \"never bland\".  their amazing chicken larb burger is amazing    *No pictures of any of my orders as it's always take out*   Thank you, Amazing Thai. I'll see you soon!"}
{"text":"My other half and I went to this place randomly since we were craving rice as apart of our meal, but didn't want to drive to Chinatown or go to the Americanized Chinese restaurants around us.   This place is a little tricky to find at night since there outside sign foes not light up, but it is in the Albertson's shopping center on Ann and Simmons. Upon entering we sat ourselves and waited for a few minutes for a menu. We ordered the chicken satay, crab fried rice, bbq pork pad thai and pad prik king.   The chicken satay was delicious! Hint of curry flavor, moist and came with a delicious dipping sauce. The cucumber salad side was tasty but came with so little. The crab fried rice was surprisingly tasty, though the rice in general had simple flavors the crab was definitely present. I could have just ate that rice. The pad thai was meh, nothing to oogle over... was just a little too sweet for my taste. The pad prik king we got with chicken, it was flavorful and spicy! But not so spicy that you couldn't tastes the depths of the spices.   This place stayed fairly the evening we went. They also get a lot of to go orders that were picked up by customer, ubereats, eat 24, and I believe grubhub.   I'd come here again or at least order something to go or for delivery. Overall the meal was enjoyable, just lost me a little at service, location visibility, and some of the flavors being only decent. Seems like a great place if I want to order in one day!"}
{"text":"Stopped by this place because I had to wait for my appointment with the DMV and it was a bit far but we'll worth the drive. Great food and service! Kudos to the chef and staff!"}
{"text":"Came in on a Saturday night and waited about 5 minutes before anyone acknowledged me. Once I got the attention of a lady that worked there she signaled for me to sit while she was on the phone. At this point I started debating leaving and going across the street to Thai Basil, but I decided to stay and give them a shot. I ordered the chicken pad thai with a green thai tea (free refills!!). The matcha in the tea was a little strong for my liking but I finished it and got a thai tea to replace it. Last but not least we ended our meal with the Mango Beach Ice Cream. The food and dessert was good, however, the customer service was lacking until a sweet lady took over our waitresses table.  If we would have had her as a waitress in the beginning we might have had a better experience."}
{"text":"Our family just discovered Amazing Thai. It is our new go to Thai restaurant. We have yet to have something on the menu that we don't like."}
{"text":"This probably the the best Thai restaurant on this side of town. Thai basil is literally across the street and that place is no bueno. Service is great, lunch specials are great as well."}
{"text":"This place has good food love the egg rolls and the basil chicken and shrimp is really good."}
{"text":"The food is good. Love the Crab Rangoon. The duck wasn't good at all. It was expensive too so a bit of a disappointment. My husband likes the pad Thai. 1 star for the duck 4 for the pad Thai 5 for the crab Rangoon"}
{"text":"This was a truly disappointing experience. We arrived at 4:30pm on a Wednesday, we were the only people in the restaurant. We were greated and seated promptly however that's where the service ended. I ordered the pineapple fried rice, one of my favorites. When my order arrived 10 minutes before my husbands it had no chicken and no pineapple. I would have mentioned it to the server however she was no where to be found. My husband ordered Beef Pad Thai. A different server brought that to him. It  overwhelmingly smelled of fish. So much so I could smell it across the table. My husband was unaware that it was made with fish sauce as it is not indicated on the menu. Worst experience in a long time. Very disappointing!!"}
{"text":"The name says it all. Out here visiting and ordered the spicy eggplant and a few other dishes...simply delicious!"}
{"text":"My favorite place to go to. I love their happy hour menu. I just wish they serve them on weekends also. The staff is so friendly. And they serve unlimited fills on Thai tea"}
{"text":"Absolutely one of my favorite Thai restaurant in Vegas.  Great lunch speacials and fast service.    Great spot for a family meal or casual date."}
{"text":"Fast and efficient, every time I go here it's always a great experience. I enjoy the customer service enjoy their smiles. I also like the flexibility that they have and they accommodate to all my friends in doing separate checks. I've ordered a pickup order and they are just as great. I did have to wait a bit but it was Valentine's Day."}
{"text":"Simply delicious!  Pad Thai, spicy basil and Thai jerky appetizer, very good.  It's about time we have something great in our area.  For those of who don't live close, it's worth the drive!!!!!!"}
{"text":"Food was warm not hot when it came out, very pricey, extremely salty. Service was terrible!"}
{"text":"We just ordered from Amazing Thai for the first time, and HOLY CRAP....this place lives up to its name!!  We ordered several entrees so we could all try multiple things, and everything was SO GOOD!  My favorites were the Red Curry and the Drunken Noodles...but you seriously can't go wrong with anything on this menu.  Up to now, Archi's has been my favorite Thai restaurant in Las Vegas, but Amazing Thai just took over as my favorite!  Can't wait to go back!"}
