{"text":"If you love chinese take out ..this is the place for you. Their shrimp fried rice...beef fried rice n vegetable fried rice very delicious!!!! Their wonton soup is also great and I love love their FRIED CHICKEN WINGS..you have to always order extra hot SAUCE n hot OIL on the side...because it is so delicious!! I love this place!!"}
{"text":"The food here is very good. Great customer service and super fast delivery. I never have a problem with my order."}
{"text":"One of the few carry out places contact that I have stored in my phone. The only problem I have is overcoming the language barrier on the phone, but that's part of the fun as well. My favorite Chinese take-out in Cleveland!"}
{"text":"I think that because I ordered at a weird hour, not quite lunch and not quite dinner, that the food was old and stale. Wasn't at all satisfying and sort of left me feeling gross. The hunt for great Chinese delivery continues."}
{"text":"Delivery was quick the food was average they need to change their oil!! A lil pricey I order sweet and sour chicken it was $11 and had to add more food because the delivery is min$15. Chicken was over cooked. Might order again if I am in the area defiantly not my first or second choice"}
{"text":"First the positive, food came at the expected time and was hot but the negative, they missed things from my order and didn't taste too great. I ordered the basic Sesame Chicken, Bourbon Chicken and rice, somehow that was ruined. If I was to go again it would be for the egg rolls."}
{"text":"I ordered from Amazing Wok II for two reasons: the positive yelp reviews, and the convenience of online ordering (and delivery). I ordered twice on two separate occasions, so as to truly give this place a chance to make a good impression.  I found the food to be extremely hit or miss (mostly miss). I love spicy dishes in brown sauce (Kung Pao, Hunan, etc), and no matter which dish I ordered, it seemed to be in that bland, nondescript brown mystery sauce that mediocre Asian places are known for. I was very disappointed.  The fried rice, however, was delightful. Fully cooked (nothing is worse than undercooked fried rice), full of flavor, and chock-full of vegetables, the vegetable fried rice did not disappoint.  The nail in the coffin was the potstickers. They actually provided plum sauce instead of the standard soy-and-ginger sauce that potstickers are supposed to come with. Who are you kidding?  I love Americanized Chinese food; no need to have an \"authentic\" Chinese menu for me to fall in love with your restaurant, but come on. Shortcuts like these not only alienate new and potential customers, but they actually piss off die-hard Asian food fans like me."}
{"text":"We ordered delivery tonigt, and not only was the food great, but they added an amazing holiday touch.   We have ordered both take out and delivery from them before, and the food has always been satisfying. But never before have I been given a gift from a delivery man.   Tonight we were given a beautiful holiday wreath by amazing wok II and it has solidified it's place as \"our Chinese food spot.\""}
{"text":"Joseph F. and I have been coming here for many, many years. So often that we have seen the young boy behind the counter mature into a man ;-) Pretty soon, we'll be asking him where he's going to college!  I have always found Amazing Wok to be great takeout  - I've gotten the chicken lo mein, chicken with broccoli, sesame chicken, and always the beef spring roll. Although I really enjoy this place, I have to drop a star because every once in awhile, the food is not consistent.   Funny story - I've also bought jewelry from Amazing Wok II. Yes, they sell jewelry. And those giant belt buckles. And those purses with the giant sequins. Kind of curious."}
{"text":"Love it! Our family orders delivery about once a week. Quick easy painless and YUMMY!   We order beef and broccoli, lo mein, war sue gai, eggs rolls and soups. And all of them all come hot and tasty! We have never had any problems with our order being correct and on time. Cheers to Amazing Wok!"}
{"text":"Very disappointed. I got hung up on 3 different times trying to place an order for delivery (the third time I told them I would pick up)... Yes, they were busy and the roads are bad. But don't just hang up on me. Finally I got someone who picked up and was nice enough to say they were really slammed. I told him I would be ok with picking up and he was happy and said that would be great. Then while placing my order the guy (not the nice one) said \"I'm just going to have to cancel your order\" then hung up. Wtf if you can't handle your stuff you have no need to be in the restaurant business."}
{"text":"Disclaimer: We partook of their offerings on Christmas eve, not much open so fairly busy. Thus they may have not performed to normal standards.  Rather blah American-Chinese food. Was expecting better in a big city near a university, considering the competition. We did pickup and although it wasn't ready when we were told it was, the biggest problem is then never calling us when it WAS done. Hence I was sitting around for more than 15 minutes AFTER everything was bagged and ready."}
{"text":"The food is amazing and way better then Golden Dragon on Lee Road. I would recommend this first. The people are way more polite especially the delivery drivers. I love how you can order online, but I hate how they charge an extra dollar if you are under a certain amount of money. They usually call you and ask you if that is okay, but if you don't know about this and you add a tip for the delivery driver online with your card, they won't call and the dollar will be taken out of the tip and the driver will get less money. Ordering online is a great choice and delivery is fast. Polite delivery drivers. Thanks!! You are my only choice for Chinese food close to home."}
{"text":"Delivered on time-45 mins.  Hot and yummy!  Kung pao chicken, Rangoon, wonton soup and beef w/ vegetables.  All delish!"}
{"text":"Our family moved to Cleveland 4 years ago. We have FINALLY found \"our\" Chinese food place! The owners are nice and the delivery crew is respectful and prompt. My husband said he hasn't had Chinese food like that since moving from Mass. 17 years ago. I like the online ordering. I had an issue with ordering because I live 4 miles away (Lyndhurst) and almost immediately after emailing them they fixed the problem. The food is always hot when it arrives and taste delicious."}
{"text":"I hate leaving negative reviews but I just don't understand why this food was so expensive. It was Probably the worst Chinese I've ever had. Seafood quality is terrible, and nothing taste fresh at all, I couldn't even finish a bite of the egg roll I bit into because the cabbage tasted off. Won't be re ordering"}
{"text":"Yuck. Always disappointing. Skimpy with the sauce that they make you add yourself. They can't make sweet and sour chicken? They give you a tiny dipping sauce you mix with deep fried nuggets of grease. They charge you extra if you want more than a tablespoon. The containers are always half full except for the hard free white rice. I've had better Chinese at the food court of abandon malls."}
{"text":"Sad so very sad. The food isn't great, but when you live in the eastern suburbs it will most certainly do. I always stick with the appetizers because their entrees I have found are always hit or miss. Mostly miss. They have this thing about delivery of course and if you're out of their delivery area they charge an extra fee so okay I called yesterday tell them where I live like I have every other time I've called and the nice young woman asks what I would like. After thirty minutes I receive a call thinking the food had arrived. Nope it was I believe the delivery driver but his English was completely indecipherable. I think he kept saying \"No Delivery\" but I couldn't be sure. I hung up and called the restaurant and it was like the Twilight Zone. I explained to them what had just happened and they were like ya sorry can't deliver to you. I pushed it because if they decided not to deliver you don't wait till thirty minutes after the order was placed when the customer is now waiting for their order. The person refused to tell me why they couldn't deliver just that they wouldn't. Finally he said there was a note on the computer saying we could not deliver to our address. I live in a condo with two separate buildings and a gatehouse so was this \"note\" specifically about my address or someone else in the complex? I finally hung up. It was also strange because when I asked to speak to the young woman who I originally placed the order with her shift had ended and she was gone. Sure I believe that. So I called back today to see if maybe someone could clear up what happened yesterday (like I said Chinese delivery on the eastside good luck). A young woman answered (claims she wasn't the same one, but I think it was) and when I explained what had happened she put me on hold and then came back and said the delivery driver had called and no one answered now that is interesting because yes I do believe he called but when he did he just said well we think he said no delivery. She also said the delivery driver claims he was at our address but no one was there now this is a complete lie because no one came to the gatehouse so if he was at an address it was not the correct one and for a company, any company to believe their delivery drivers and then deny a customer, a good repeat customer further service when it was because of the driver's error that any of this even occurred is beyond me. So I am writing this review to say don't even bother with this place. The food is sub par if you're lucky and clearly they don't care enough about their customers to actually believe them when one of their drivers makes a mistake and will not admit it."}
{"text":"I've had a really hard time finding good Chinese food in Cleveland. This didn't compare to NY but this is the best I've found. It's a great price and really fast, inexpensive delivery. I'd shop here again!"}
{"text":"We had a horrible meal tonight.  All of us were feeling fine until we ate the food from this restaurant.  Now all 3 of us are throwing up and when we called to complain the owner blew us off.  I highly recommend staying away from this restaurant.  Find another chines delivery restaurant because this one is not good."}
{"text":"Nothing amazing about this place, to be perfectly honest. Really I would rate it 2.5 stars, but that's not possible so I'm being charitable and giving it a 3.  The portion sizes don't match China Gate's, but the flavors are slightly better, in my opinion. A very notable exception are the egg rolls, however, which are pulled out of the freezer before your eyes before being dropped into the fryer. Only bought one once, and didn't even finish it.  The dining area is pretty cluttered and I never dine-in as a result.  One advantage this has over China Gate and Richie Chan's is the location. I live on the south side of Cedar Rd, so being able to avoid that cesspool of transportation woes is appealing at certain times of day. Nevertheless, I still patronize the aforementioned venues more often than A-Wok II."}
{"text":"at first i thought this place was decent and cheap chinese food that delivered. but, the last two times i have ordered they just never delivered it!  the first time they no showed i had ordered online, after an hour i called and spoke with a women who had no idea what i was talking about. they still never sent it.  the second time i decided to order by phone to make sure there wasnt just an internet ordering system error. i spoke with one of the younger people who speaks english quite well. he assured me the food would be delivered with in half an hour. after more than an hour it never showed and i didnt think calling would solve anything this time either, so i didnt bother.   waste of time and disappointing."}
{"text":"Right after eating the food I ordered my stomach was upset. I was sick all night!"}
{"text":"I was a consistent repeat customer. Tonight it took forever 1:35 minutes to arrive with no warning when placing the order. With the in laws in town this was embarrassing. The food was semi-warm.  The kicker was I was on the phone asking the manager for a discount because of this unexpected delay and he would do nothing. I told him to just send the driver away. In the end the driver gave me something off as I was in the car leaving to pick up something else. Really disappointed in the management.  If only they had informed us when we ordered they would not have lost a customer. Communication people that is all it would have taken."}
{"text":"This is your average take out Chinese place. There are technically some tables inside but I don't know if I've ever seen people dining in. What's nice is they're one of the few Chinese places that will deliver. General Tso's is my favorite thing to get. They accept credit cards but only with a minimum order so make sure your ordering for at least two people."}
{"text":"I have ordered carryout from this restaurant many times.  Timely service, decent prices and now you can order online.  Food is OK, not great.  Not a Chinese foodie, but if you are in the area and want Chinese takeout you can get it from here and not be disappointed."}
{"text":"This is typical americanized Chinese food.  The chicken and broccoli is decent. Egg drop soup is okay.  The fried rice is pretty good.  Don't get anything with shrimp since the seafood quality is not good.  Expect greasy comfort food.  Its very affordable and they offer free delivery at $15 purchase.  The customer service is good.  I prefer Hunan Coventry or Schezuan Gourmet if I'm not too tired to go out."}
{"text":"I base my review on the few items I ordered from this place on a weekly basis: chicken curry, roast pork lo mein, Singapore rice noodles, shrimp fried rice.  I lived a mile away, and was always given a good estimate for delivery time before completing the order on the phone (20 min to an hour at times) and the food was delivered hot.  I tipped the drivers pretty well, since it was always like -5 all winter.  The few times I strayed on the menu, the dishes were hit or miss but my main choices were always amazingly consistent. Not the cheapest cheap Chinese food around, but delicious for what it is and good value for the price."}
{"text":"I ordered online via beyond the menu, everything arrived on time and it tasted great!  I wanted to try out this location and I'm so happy I did. We will definitely order from amazing wok 2 again."}
{"text":"Have ordered from here many times and they are generally good...decent food and on time delivery...placed and order at 618 tonight...called at 730 to inquire about the delivery and was told the driver was already on his way...called at 8 and canceled the order...I'm no more then 10 minutes from this place and dont mind paying the 3 bucks for them to bring it to me. But i could tell they either lost my order or had issues with there ordering system, both of which had they told me that i would of been fine with and understood that it will take longer then usual. But they lied and told me twice the food will be there any minute. On a food level they would get a solid 3.5 stars..For takeout Chinese thats usually the best you will get from me as the food is what it is... On a service level this place failed and lost a customer in the process."}
{"text":"Hot and sour soup weeee!   This soup is my panacea. Whether it's seasonal allergies, a cold, the flu, or any other combination of illness, this soup makes me feel warm, cozy, and completely congestion free. While it's not as spicy as some other hot and sour soups I've had, it certainly does pack a punch without sacrificing taste.   In terms of other appetizers, the spring rolls, crab rangoon, and fried wontons are all as good as if not better than your local Chinese take-out place. I'd say definitely give them a try, and order extra because you won't want to share. For dinner, you can't go wrong with their chicken chow-mein. We're not talking ground-breaking fine dining here, but it certainly acts as a good companion to any post-work, movie marathon slump you've found yourself in. Delivery is fast, efficient, and cheap! Order now :)"}
{"text":"I've never walked inside this place, or have even seen it for that matter. This is my family's go-to place for delivery. Cheap and fast delivery (We've never waited more than 40 minutes, ever. Even when there's a blizzard they seem to get here incredibly fast.)  My go-to dish is the Shrimp and Pork with Golden Brown Sauce. What is in the sauce? I have no idea, but it's slightly spicy and amazing. That's all I need to know."}
{"text":"I order delivery online from Amazing Wok II at least a few times each month. It's probably my favorite Chinese restaurant. They have your typical \"Chinese\" items but I think their food is better than most other similar restaurants. My favorite items are the lo mein and dumplings. Their General Tso's chicken is also good. Their portions are pretty big so I always have leftovers. The food is always freshly made and is still hot when it arrives. Delivery is prompt and has never taken more than their estimated 45 minutes. It's worth trying if you're looking for Chinese food."}
{"text":"Ordered the sesame chicken combo.  Ya know how when you try to reheat chicken in a microwave it gets all hard and chewy. Well that's what I got, plus some added fat. Pretty gross. Rice was dried out and egg roll was shrimp, thought it would be a veggie. Didn't eat much before writing that meal off. Don't waste your money."}
{"text":"Horrible food. Egg roll was burned and tasted like old grease, egg drop soup was thick and clumpy and seafood delight was over cooked and tasted fishy!!!!"}
{"text":"This it the best chinese take out place that you can get around cleveland heights! Imagine cold winter days and you are craving yummy wonton soup with shrimp fried rice and chicken lo mein with...delicous fried chicken wings and egg rolls with hot sauce and hot oil! THIS IS THE PLACE! I love their egg rolls ..and wonton soup! Its delicious! And their fried rice and lo mein and you have to get their fried chicken wings! I would order from here at least once a week! This place is good and they are very friendly!!!"}
{"text":"I am a college student at a school nearby and this is always my go to place for dinner if I don't feel like cooking or going to the dining hall. I always get general tso chicken (which lets you pick how spicy it is and comes with white rice), chicken fried rice, and wonton soup. The food always tastes good and the portions are huge so you will definitely have left overs for the next day. Since I didn't bring my car to campus, I always got it delivered right to my dorm. They delivery is always very fast and they call you to let you know that they are there or they are about 2 minutes away so you know when to come out. I would recommend if you like fast, easy Chinese takeout."}
{"text":"Average Chinese at a modest price.  Lunch sizes are plentiful and rather inexpensive.  While I certainly wouldn't recommend dinning in, there are in fact designated eating areas in the establishment.  However, the tables are typically covered with products for the awkward built in retail store or occupied by employees on break.  Service is speedy, but the food really just doesn't stand out as excellent.  The Lo Mein is flavorful but greasy, the fried rice is rather flat, and most extras (egg rolls / wontons) are mediocre.  General Tso's and Kung Po are among their better dishes, good flavor with excellent spice.  Overall a pretty decent spot for take out or delivery, but I certainly wouldn't go out of my way."}
{"text":"A long time ago, my girl and I decided that it would be nice to get Amazing Wok after her evening class. From that day forward, the Amazing Wok Tradition has lived strong through dating, engagement, and marriage. Each semester, we pick one night of the week (usually Tuesday or Wednesday) to be Wok Night...and even when we're done with law school, there will be Wok Night.   We have gone here on an almost weekly basis since 2005 (excluding some times in the summer and when we were apart) and this place has never, ever gotten old. I have eaten the same dishes hundreds of times and the idea of taking a week off has never crossed my mind. In fact, we have re-arranged our schedule and passed on social invitations to accommodate The Wok when necessary!  Simply put, this is takeout Chinese at its finest. It's inexpensive, the food is filling and tasty, and they give you a LOT. The people there are friendly and endearing too, not rude and curt like at Chopsticks down at University Circle. Additionally, your order is prepared quickly. I have called in my order on the way to the restaurant and it has been ready when I arrived.  My favorites are: General Tso's Chicken, Pepper Steak, and my new personal fave, Singapore Mei Fun. My wife likes the Chicken with Broccoli and Chicken Lo Mein.   Need I say more? When you don't want to cook or are tired, give The Wok a call. You will not regret it. If this place ever closes, I just might take that as a sign that it's time for us to leave Cleveland. I do hope that they give us advance notice if they plan on closing, though, so we can buy a freezerful of their food and freeze it so that our kids and grandkids can experience the goodness."}
