{"text":"This place a joke. You have to rob a bank before you get in!  It's not worth the money. People say its nice to be in there and be seen. Screw that I rather see a nice hotel with my girl and drinks. It's cheaper"}
{"text":"we only came here weekdays, there were only gay guys but we didnt care, we just wanted to have few drinks, i can't comment on fri or sat nights
price was moderate , it costs around 16 for a cocktail but i didnt find much alcohol in it...(its the same every place we go to you pay for the atmosphere and location not the amount of alcohol) I don't know their food but the girl that served us was friendly and music was good. if i get a bad experience i will post it for sure"}
{"text":"Oh Amber, you are the Miami of Toronto, and I'm not sure if that's a compliment.

Owned by Tofique, whom every frequent patron knows intimately.
The patio is the jam at this place and it's a hot spot during the Film Festival. 

Years ago, I worked there and we had to wear all-white (at a bar!) and the bar is all-white, and it was murder.

Who frequents the joint? Fashion magazine editor's and the buyer's for Holt's and TV personalities like Ben Mulroney. It's pretty jovial for the crowd it attracts and it can be a very discreet place to meet for drinks. it ain't cheap honey, not it ain't cheap at all, but you don't come here for the price points, it's to see and be seen dahlin'.

Also, they make this great martini with rose water and the staff are great. Ask for a red-headed slut, I taught them how to make that."}
{"text":"I never ever write these reviews (I literally had to sign up to yelp to write this) but I'm not at all impressed with our treatment here. Last night myself and 4 of my girlfriends (who are all very well dressed, stylish, affluent women who live in the city) wanted to have a couple drinks here as we had just finished dinner in the area.  The guy at the front door said we could not get in unless we were getting a bottle.  We said well no we just wanted to have a couple glasses of prosecco and enjoy the night.  He said no that couldn't happen and said \"we expect to get really busy later on\". So we would be taking up space in your bar for the \"other people\" coming later on?  The place was totally dead, nobody in there.  It made zero sense to turn us away and we felt very disrespected.  Why even open if you are not going to allow paying customers the opportunity to enjoy your bar? Very silly business mentality."}
{"text":"not a bad spot. good food. a bit small and the music was so so (saturday night) we left by 11 to look for a more happening place. better music (maybe a dj) would have been enough to make us stay."}
{"text":"Super cute space, pricy drinks but generally happy vibe."}
{"text":"When I show up well-dressed to meet my supplier inside, you do not give me attitude with fake BS excuses that it's bottle service only a quarter-after-midnight with the place half-empty. I party a lot in downtown Toronto about 2-3 times per week and haven't been treated this bad since Cheval six years ago. Get over yourself."}
{"text":"I have recently been traveling to Toronto for work and slowly exploring the city and discovering the different neighborhoods. Yorkville is so far my favorite..great choice of restaurants..great shopping as it's right off Bloor St...and full of all the snobby rich people Toronto has to offer.

I met with a good friend on my last trip and we came upon Amber...what drew us in was the very cool and sexy patio...it sort looked like an old back porch patio on the farm..but painted out all white with sleek chrome tables, modern chairs and benches with comfy cushions..the music was fun..remixed 70's disco with a chill element..and the servers were all beautiful and dressed in head to toe white..this place is what pretentious dreams are made of....in a good way of course..

I usually don;t expect good  service in a joint like this but my dinner date and I were pleasantly surprised by the friendly and prompt waitress that took great care of us...I hadn't even swallowed the last swig of my beer and she had replaced my bottle with a new one...that's the kind of service  I like!!

The menu was decent..not a lot of selection but some good nosh for a warm summer night on a patio...we both had the burger with seasoned fries..very yummy..not your average burger...it was a \"fancy burger\" with zucchini pickles and pickled onions..tasty none the less...

I do recommend this as a stop on a trip to Toronto..especially in the summer as the patio is the best part..the inside is equally as nice but not as fun for people watching...

My only complaint would be the prices...$60 for a burger and 2 beer is a little steep...but if you have..spend it!"}
{"text":"An alright place, nothing over the top
The atmosphere is nice, especially at the patio, while downstairs is usually more on the quite chill side.

Located in the heart if Yorkville, it certainly is a cool spot as a lounge, with some cool \"Yorkville crowd\""}
