{"text":"Burgers (ordered 2)- very bland, even with a good amount of toppings...cooked great, nice color, just no flavor.

Hot dog- good, bun was excellent! Chili was ok.

Fries- no flavor/no seasoning...disappointed!

Onion Rings- very good! Great crunch!

Wasn't the worst burger I have ever had, hot dog is a few pennies cheaper and was better than the burger! May stop back by, everyone gets a 2nd chance!"}
{"text":"We went here on a nice Saturday and they did not appear busy. The fella who takes the orders was very polite, professional and helpful. We waited a longgggg time for a burger with fried and Cesar salad. Salad did not taste or look fresh and the dressing was flavorless in my opinion. Burger was OK. Place was clean and didn't smell of food which I love."}
{"text":"Great Burgers reasonably priced. Family oriented and a great place for lunch! We will be back."}
{"text":"Tried to go to the new location at the promenade, two people taking orders took forever, when it's our turn one guy walks off leaving us standing there to wait. If it takes 15 minutes to order how long does it take to get the food."}
{"text":"The burger I ordered was great. As far a customer service the 2 girls at the counter where very unpleasant. When I came in today they where playing on there cell phones and gossiping about inappropriate sexual behaviors loud enough for me to hear, and my 8 year old daugher.Besides that, the female was rude in general, I asked about the salad featured on the sign outside and she was clueless. Then her and the other girl where started talking agian being rude. Basically food was good terrible customer service. The cook had to ask if i needed anything bc they where to busy on there phones. All it was extra sauce."}
{"text":"Under really good management.  The manager is friendly and talks to patrons.  Never been disappointed with quantity or quality.  Worth the drive!"}
{"text":"Just another burger place with fancy pictures trying to pass off a 4oz frozen patty as a hamburger.... just because it's Lil better than McDonald's doesn't make it good people. 12 almost 13 dollars for a burger drink and cheap tator tots. Run by kids apparently, not clean , sink in bathroom didn't work so couldn't even wash my hands. If you don't eat junk and know what good food is I wouldn't recommend."}
{"text":"This franchise location is heads above others in the area by a mile! Great food, fast service with friendly and helpful staff. This location proves that the manager can make it the best in the area! I've seen him demand nothing but the best from his crew and it shows in every area of the restaurant, food to attitude to cleanliness. You will not be disappointed!"}
{"text":"These burgers were oppressively mediocre. They had nice toppings, were greasy and good browned outside but we just so bland. Also the burgers are like a 3\" ball of meat on a 5\" bun. You get half a \"burger\" with no meat and then half that is thick enough for a bear.  The white buns in our order were all stale, but the toast and pretzel ones were better. It's also fairly pricey and just not that good. You'd do much better at The Trail House and slightly better at Hickory Tavern. In all, there is almost no reason to come here unless they make serious changes to the burgers."}
{"text":"First time in for lunch and  didn't even order. The floors were like fly paper when you walked in.  Your feet practically stuck to the floors.  Not a very appetizing thing. 
Can't speak about the food quality because I didn't even order."}
{"text":"All said was true. Frozen tasteless burgers- asked for med (because we thought they were pattied fresh) and received well done dried out burgers. Disappointed because it looked like a real burger joint...and there is one by my house and I won't go now. Overpriced for sub par. Very disappointed."}
{"text":"Didn't feel like cooking so I popped in to American Burger to order takeout for me and my husband who is always down for a burger and fries. It was about 8pm on a Sunday night so as expected it wasn't super busy - bonus for me. I walked up, looked at the menu, placed my order and sat in a booth as I waited for my order. Staff was friendly and brought my order out when it was ready. Pleasant takeout experience. The only thing I dread about this location is the parking, but on a Sunday night I was able to park pretty close. Noticed that they do $5 Build Your Own Burgers on Tuesdays so I'll definitely be back to get our burger fix!"}
{"text":"I'm giving a 1 star because I ordered several things that were all crappy. Onion rings were better than anything else. Still pretty bland. Fries half seasoned, cold. Mac n cheese side was boring. But the burgers take the crap cake here. Both custom burger and Mac Burger were burnt!! Bland bland bland on the inside when I ripped off the rock hard char!! Just terrible. Cookout is better and 1/3 the price!"}
{"text":"This was the best place I ordered from during my stay in Charlotte. The chili cheese fries were amazing and the burger was 4/5 stars."}
{"text":"I have had it with this place and won't be back.  It is really conveniently located next to the Sun Valley theater and my family has eaten there numerous times.  Unfortunately, more often than not something is wrong with the order.  Today our order of French fries never showed up, we had to ask twice and eventually got a refund.  Poorly managed and the food, even when right, is pretty marginal anyway.  Steer clear and if you want a burger, go two doors down to Hickory Tavern.  They're not great but better than this places dreck."}
{"text":"Yummy burgers, make sure to ask for medium rare if you want a juicy burger. Sweet potato fries are awesome and the cinnamon butter is on point."}
{"text":"I was there last week with a friend for a burger before a movie. They said they ran out of tomatoes!!! It was about 7:45 pm, not crowded and staff was just chatting behind the counter with each other. I asked the cashier why didn't someone go across the street to Harris Teeter and buy more tomatoes? No one seemed to think it was a big deal. I should have asked to speak to the Manager who should not have allowed this to happen. What's next? They run out of fries? Very disappointed."}
{"text":"Service was great although to be fair it was 11am. The custom burger I made with pimento cheese, tomatoes, and red onion is always my favorite combo and they did it well. The ground beef tasted like it was of good quality. Onion rings came with their own dipping sauce- everything was pretty tasty and I'd go back. They had a good variety of side items including tater tots and sweet potato fries. I just can't say this is the best burger I've ever bought anywhere, so, 4 stars. But would give 4.5 stars if possible!"}
{"text":"By far the best burgers in the sunvally area. Their burgers are so much better than highway 55 and hickory tavern,definitely recommend trying them also don't forget to try their homemade BBQ sauce! It's wonderful. They make their shakes homemade too they're so thick and creamy, so good! Well definitely eat here again"}
{"text":"I have to say this was really good. Burger cooked to order and tasted great. Tater tots were hot. Had the Oreo milkshake that was also great. Definitely will be back."}
{"text":"The management/owner is rude. Food is not great. Better places to eat in the area, stick with those."}
{"text":"Great location, right by Sun Valley movie theater for a burger and date night. The burgers are decent and they have a variety of toppings. Also, they have tots! Yes, love the childhood throwback but also have fries or salads. 

Parking lot, casual ( order and they bring food to table), clean, good staff."}
{"text":"Driven by this location multiple times without stopping because we thought it was just another fast food burger joint. Craving a burger this afternoon and decided to stop and try it. Burgers were good and cooked just right--I am definitely a picky burger eater. My son got a turkey burger and said it was good as well. We also got a milkshake after seeing on being delivered to the table next to us. It was creamy and delicious. Definitely will be back to try another delicious burger."}
{"text":"Rise and shine burger with egg white only was perfect...but let me tell you that was the freshest ABC salad ever, best salad I have had in like a year. Coming back asap. We eat out at much more expensive places often, new place."}
{"text":"I love burgers and anytime we go to an American restaurant, a burger is what I almost always get.
We stumbled upon this place since another restaurant we were going to eat at was closed.
It was okay. Burgers were nothing special, fries were nothing special. The employee at the register was nice. I don't know if I would come back just because there are so many other balances with better burgers."}
{"text":"This place was a complete circus show! Went in on the 4th after ordering online to go walked in waited In line for 10 mins to find out our order had not even been put in yet, after being told 10- 30 mins to pick up, waited 40 to give them time . I was rudly told \" well I'm way to busy to even care about to go orders today and it's not my fault your shouldn't have ordered online \" so I waited for another 35 mins before my order was even put in. As I waited I watched atleast 20 plus other food orders be returned due to error and not one customer was given an apology or actually given a proper order.  The manger stood there like a deer in headlight letting these cashier's take the heat for his errors , mind u he was the Cook making the errors. So after 1 hour and 15 mins from my order time I was rudely thrown my bag of food and reminded how much my $50 order of McDonald's grade burgers was a giant inconvience for them, or final order was completely a hot mess of its own. My husband's burger was covered in a topping we specifically told them not to put on it due to an  extreme allergy . I than requested a new sandwich , not willing to risk an allergic reactions , Instead I watched the manager scrap of the unwanted stuff off try to put his sandwich back together . Every ones food was cold hard and half put together . After waiting that long and the mishap I expected better and atleast some common decency or apology . Nope just a bad attitude and a staff that reminded us constantly that is was OUR fault not theirs for ordering to go a service they advertise all over they do . Well they had no problem charging me for the to go  order with in 5 mins of receiving it  but had a major problem actually making it. American burger you should see what this branch is doing to represent your chain . To top this my family than missed our plan for the evening thanks to a 2 hour ordeal just to get some road kill quialty food ."}
{"text":"I have eaten at American Burger Company many times and never had a complaint. Was there on Saturday 3/25/2017 . Received my order and there was a hair on my burger. Asked to have a new order made with no issues. Still would have thought some sort of compensation should have been made or even the manager to come out to make sure there was no issues with my new order."}
