{"text":"Love the Ghost Pepper wings and cheese fries. Great TV and service. Will go back for sure."}
{"text":"I use to come to this place when it was US Subs. One day I drove down to get my sandwich fix and saw that US Subs had closed and  this place was not opened. I did some research and waited for a few weeks for this place to open. Though I was disappointed not to see US Subs anymore I cant say that it was a total loss because I went recently to give this place a try and US Subs who?! I wont even crave a sub after this visit! I have dubbed myself wing connoisseur so I think I know a good wing when I taste it.  We walked in, the place was tidy and well kept. The young lady standing at the counter came out to greet us. She was friendly and when the wing sauce I wanted wasn't available (Caribbean citrus) she quickly suggested one of the other 30 flavors, Honey Moondust, which was her favorite, I went with that flavor along with the hot lemon pepper, and the hot teriyaki. ALL OF THESE SAUCES WERE THE BOMB!!!! Each wing was coated perfectly, setting you up for the perfect finger licking scenario. The hot teriyaki made its way into my taste bud heart, my favorite so far! The combo comes with fries which were well seasoned which is always a plus. As I made my way back to my seat from getting ketchup I stopped in my tracks and had to take a double take because surely my eyes were playing tricks on me and the bottle didn't say MAMBO sauce (DC staple \"put it on everything\" sauce.) IT DID, IT DID SAY MAMBO sauce! I almost cried tears of joy. This place has it all don't let the name fool you, even though they may be known for their wings they have a little of everything for everyone, from wings to fish to phillys to salads. Take your pick and I'm sure you wont be disappointed. I cannot wait to come back to try other things!  Well done!"}
{"text":"Been wanting to try this place out and I'm glad I finally did. Placed a call in order and ordered the Philly and the 3 piece whole wing box. Was disappointed when they called back and told me they were out of whole wings, so I just ordered the five piece wing meal instead. The Philly was really good, and probably is the best Philly cheesesteak I've had in the University area. The wings (mild flavor) were really good too. They also have mumbo sauce to go with your wings, for all my DMV people. The fries that came with the wings were perfectly cooked, but the seasoning that they put on them was a little too much. Will all stated, I will definitely be ordering from them again."}
{"text":"My husband and I decided to try them one night and so glad we did. The food, particularly the wings were really good. The young lady who served us was so friendly and helpful. Looking forward to going back."}
{"text":"Wings are good. After a few visits and trying other things on the menu, quickly realized the many things are frozen not fresh. I love fried mushrooms. Don't get the here. They are store bought and frozen. Can't speak for other things on the menu, but guessing it would be the same."}
{"text":"Good food, great service!! Their buffalo wings are jumbo and love the 30 different flavors and the environment. Will definitely go back."}
{"text":"Pretty mediocre wings for a place called Americas best wings. They were not crispy and pretty soggy. The sauce was not very flavorful but some of the other people I ate with liked theirs. The blue cheese tastes like it came out of a bottle from the grocery store. The wings were big though I will give them that and they are not super expensive for wings. They have a lot of sauces and items on the menu, maybe they should concentrate on the wings."}
{"text":"America's next best wings has the most amazing wings. They have the best phillys in the state ! Their steak and shrimp is amazing. I am from NY and I've been searching for a tasty sandwich and I found a place. Every time I go there they have different deserts as well."}
{"text":"This is probably the best wings I've had in a long time. They are a little more pricey than Wing Stop or American Deli but worth it. Order was fresh and prompt. Try the spicy Old bay! Just yummy!"}
{"text":"I've finally been able to visit this location.I ordered the honey mustard wings combo (fries and drink).I wouldn't say they were the best wings as nothing made them stand out to me in comparison to another wing spot.However,I still enjoyed my meal.The fries were really good with slight seasoning.They offer different dipping sauces with Mumbo (well known in DC) being a part of the selection. My drink (mixture of cherry and pink lemonade..I think) topped off my meal.The employees were really friendly and welcoming.While it may not always happen,I liked the fact that they had more than enough staff on the shift because it helped with the wait time and great service.I am happy to have America's Best Wings in the area and I'm sure I'll be back often."}
{"text":"Based on the reviews we tried this place. My first experience was just okay. One of my daughters had a steak and shrimp cheesesteak and she loved it. My other had chicken tenders and she said they were just ok (nothing she plans to ask for again anytime soon). The fries had some type of seasoning on them that was way too spicy for my younger daughter. And they were not hot and fresh which made them just ok. If they had been hot I can imagine they would have been great. I had wings. They were mediocre and initially came out something different from explained. However The staff was great. Very friendly and accommodating. ......Be careful when ordering the wings. When you see \"hot\" that equates to HOT SAUCE not SPICY. If you are not a fan of hot sauce don't ask for anything hot. My first order of wings was hot teriyaki. I asked did that mean spicy teriyaki and was told yes. When it came out it was hot sauce mixed with teriyaki sauce.  Needless to say I returned them. They called around to management to find out what was in the sauce and confirmed it was hot sauce. I don't eat hot sauce. They did prepare a new order for me with just teriyaki sauce with no problem.    We ate in. The atmosphere was fine. It was clean and comfortable.  The pricing was a bit on the steep side. $8 for 5 Wings. My wings did not come with anything. Just wings. My daughters meals were upward of $9 which included a drink and fries (tenders meal) and there were 4 nice size tenders and a massive amount of fries. She couldn't eat it all. They did offer a 10%  discount for students which I thought was great.  I am sure we will give this place another try. They had some other items on their menu we will give a try. I will be sure to provide an updated review when and if we do."}
{"text":"America's Best has some solid wing flavors and great salads. I've been coming here for a little while now and they've never disappointed me. Management and staff are always courteous and polite. The wing prices are reasonable and service is timely. When you stop in you've got to try the \"Old Bay Catfish\" Salad. It came highly recommended and didn't disappoint."}
{"text":"I've been seeing this spot on my way home and decided to try them out and called in an order. The online menu was vague so I just made a simple order of Lemon pepper wings and the wifey had a burger and fries.  Even though I didn't eat in to my surprise everything was good and it wasn't a rushed order. The fries were good with a cajun kick to them and the wings were as good as anywhere on this side of town! Welcome to the university side of town. I'll be back!"}
{"text":"Best food in town! The wings are absolutely amazing! My favs are the Old Bay, 24k,and the Parmesan Garlic wings! Their phillys are to die for and the Grilled shrimps are super fresh! And if your from up north (DC) they have Mumbo sauce!! There's much to try and don't forget to try their homemade lemonade!!"}
{"text":"I ordered a 5 piece wing and fries that took over 30 minutes. I wanted to try a new wing place but I will not be coming back. I order lemon pepper wings that were very crispy and fries were disappointing."}
{"text":"Tried this place out for the first time because naturally I gravitate towards any restaurant that says they have the \"best\" of anything. I ordered 3 different types of wings, and tried two of them (the nuclear and the hot Caribbean citrus).   The nuclear flavor had a little bit of heat, but they didn't exactly burn my tastebuds off. This could be good thing depending on your expectations when eating hot wings. They had a good flavor to them, but the heat was canceled out by a slight touch of sweetness.  The hot Caribbean citrus was good too, and in my opinion hotter than the nuclear ones. This flavor had a bit of tang to it, but wasn't stingy on the heat by any means.   Personally, I look for 3 things when eating wings; Smell, Texture, and Taste. For these wings I would rate the Smell 4/5 because you can definitely tell what's hot and what's not when you smell the flavors. Texture I would rate 3/5 because although they were meaty, the wings weren't very crispy or crunchy, which is what many people look for when having wings. Taste I will rate 4/5 as well because for the most part the names of the flavors coincide with how the flavor profiles unfold on the tastebuds.  All in all, I will come back here to try other flavors out, as well as other items on their menu. I think it's worth noting that they have other options available besides wings like cheesesteaks and burgers."}
{"text":"So good! They have tons of flavors. The wings are AMAZING. I'll be back. I had a ten wing combo with the hot parmesan and hot teriyaki. If you're a fan of garlic parmesan and hot wing sauces, you'll love hot parmesan. The hot teriyaki wasn't that hot to me but still delicious and has a great flavor to it."}
