{"text":"The staff is great, food is on point, and pool tables are great. My wife & I are somewhat regulars here."}
{"text":"Worse pizza in town. I ordered a slice  it came soggy and micro waved heated. The girls serving never washed their hands. Ate food for themselves with their hands in their mouths. Licking their fingers never washing their hands before serving my food. Gross!!! Never will U ever go back."}
{"text":"NFL Ticket available - large bar with several HDTVs to watch any game you want to watch.  (just ask) Sunday special $2 Miller, Bud 16oz drafts.  Food menu incudes pizza, wings - all the bar food. We ordered Hot wings crispy - they were crispy but more buttery than hot  - blue cheese was awesome.  Also had personal pan pizzas - Sunday comes with 2 free toppings only $5.99 each.  Pizza was great. There were also 4 sweepstakes machines for 1/2 time entertainment. Women's bathroom bright and clean.  I know they have bands on Saturday nites but for Sunday Nascar/NFL it was fantastic!"}
{"text":"Family ate here tonight...had a deluxe 9\" pizza...had to have been store bought the nuked by this place...first time eating here...won't again...i can say the salads and sandwiches are pretty good...don't get the pizza..."}
{"text":"Great atmosphere with friends, and bands. That's where it starts to fall apart. Here are some pros and cons  Pros + You can play pool + Beer is cheap and good + Friends makes it better  Cons - food is bad, I have not had 1 thing that was great. I mean the pizza is ok. About the only thing you should get there aside from beer - Although you can play pool, their sticks and pool tables are rough. - Waitresses are not good either. They ate sometimes there and sometimes they forgot about your beer.   Neutral * The band's that play may or may not be good  If you have drinking buddies, this place is good to hangout. Not that much fun with other people who came to eat. This is not an eating place. More of a watering hole."}
{"text":"My husband went there last week and got an awesome meat lovers pizza. We went back today to try a supreme. We asked the bartender about removing 2 toppings and switch from black to green olives. I could not believe how rude they were. The girl who had obviously been there longer than the other girl, said \"no, we don't do that, you can't substitute\". We said we just want to remove 2 toppings and switch 1. She said \"we're going to charge you extra for a switched topping, there are NO substitutions or changes or you'll get charged more\".  We felt totally un-welcomed and like they just didn't want to serve us. We said thanks and left. Never even got to try their pizza. Never again, the bartenders/waitresses that we dealt are probably the reason for all the previous bad reviews for service and not being friendly at all."}
{"text":"Smells like fried food and cigarette smoke. Pizza was average. Bartenders are easy on the eyes. Very casual place. Saw a pretty good band here once."}
{"text":"As soon as we walked in I could smell that the oil in the fryers was way past old. We left."}
{"text":"Pizza is good. Great wings as well. The garlic knots come burned and hard as if they've been reheated. Nice entertainment on the weekends. Great place to go servers are great and polite."}
{"text":"Food was just average. Monday at lunch with maybe 5 customers. Ordered a club to go and it took 20 min. Sandwich was below average. The fries chips were good but should be served with some kind of sauce.  Not sure I have any reason to go back."}
{"text":"Terrible service, and we were literally the only two people there. It seemed the staff was more concerned with socializing amongst themselves than making money.  Everything was sticky, the tables, pool sticks etc. I was afraid to order food at this point. We will never go back."}
{"text":"The service is slow and not very friendly and the pizza tastes store bought. I've tried to eat here several times with friends.  But it just doesn't seem to do anything for me.  There's a Jack in the Box across the parking lot with hot food and friendly service."}
{"text":"This place has great food. The pizza is very good, and the fried mushrooms are the best I've had so far. It's a bar that has live music, pool tables, and really good pizza. The place is kind of a dump. The bathrooms are disgusting. They should expand their beer menu. It's more of a bar than a family restaurant but if you get here before 8, it's fine for dinner or lunch. The service is good. The staff is very friendly."}
{"text":"I'm totally a fan of the live bands playing on the weekends. It's a fun atmosphere. Not to mention, we always get grade a service from our favorite waitress, Jessica. When we sit down she says \"Budlight for you and coors light for you?\" She is polite, and attentative to what's going on and what we need - even on busy nights. All the waitresses seem to be friendly, but if you go to Amicis, ask for Jessica and tell her BreAnna sent you :)"}
{"text":"I really don't like giving bad reviews, nor do I enjoy imposing on the negative face of businesses, but I feel like when one has a bad experience at a restaurant, it needs to be addressed one way or another. The bartender was extremely peculiar and very rude. When my friends and I approached the bar, she didn't say a word to us, not even a hello. It was late at night, so there wasn't many people in restaurant, but she disregarded our presence for at least 5 minutes before saying anything. We did not feel welcomed, and it appeared as though she didn't want to be there. What made it worse was she immediately put on a front when the manager came by the bar. This was a distasteful experience of hospitality, therefore I will not be returning."}
