{"text":"We decided to check out this restaurant. I'm really glad we did. We ordered the garlic bread app. I had the chicken masala. The roasted potatoes were so delicious. My husband, who doesn't even like roasted potatoes typically, kept stealing them off my plate. He had no complaints of his carbonara. Everything tasted homemade with fresh ingredients. We will definitely be going back."}
{"text":"Service was terrible sat down and wait 20 minutes to get our drinks there was about 2 other tables only!! Then the order was messed up twice food was cold. They were out of something as well! Just wasn't as good as everyone said it was! Very disappointed."}
{"text":"This could be the most belated Yelp review ever.  

Our visit tp Taste of sicily in September of 2008 was, perhaps, the most memorable restaurant visit in my 62 years.  My wife and I were traveling the Lake Erie shoreline on motorcycle with friends in 2008.  It was a mid-afternoon,  and we were looking for a quick stop for food.  Our first choice was a restaurant across the street from A Taste of Sicily, but it was closed.  So, out of desperation, we walked across the street to this unremarkable little pizza place.  And then, a miracle happened.

This little pizza place also had a pasta menu.  And it was DELICIOUS.  I will never forget the Pasta DiPortabella.  We dined alfresco, and all dishes we served on china.  The owners were having coffee nearby and engaged us in conversation.  After dinner, they went home to fetch cups and saucers for espresso and treated us to complimentary cannoli.  Excellent food, combined with unforgettable hospitality, made this visit one to remember always.  Almost five years after, I still have the menu.  And great memories."}
{"text":"This is by far my favorite place to get Italian. I've tried half of what's on the menu. Normally at any restaurant I find something safe and order it every time. But everything I've ordered here has been SO amazing. Huge portions, you'll definitely bring leftovers home. Which is awesome when you're on a budget. Not to mention, the prices are amazing. The bread they serve with their meals is always fresh. The service is always fantastic. I can't say enough good things about this restaurant."}
{"text":"We tried it for the first time this past Sat night. We were very surprised. The food was excellent. The bread came out with a roasted pepper and calamata olive spread (excellent), the salad had a nice homemade balsamic dressing, the pasta and chicken were excellent. The prices were great and the service was quick enough and very personable. I felt the food was better then the majority of restaurants in Little Italy. This is a great gem of a restaurant."}
{"text":"Delicious food. Horrible Service and Slow to get meals out to you...Id only return for carryout."}
{"text":"Food was ok, prices ok. Service not so much. Each time we've been, they've been under-staffed. Yesterday, my party arrived before I did (about 10 mins before me) and had still not had their drink orders taken. It was another 10 mins after I arrived that our waitress came to get us beverages. Shortly after getting our drinks, we had a spill at the table, which the waitress watched happened. She rushed away. We thought she was getting something/someone to clean it up. NOPE! We watched her bring out entrees to another table. When I got up to approach the bar to get help, she seemed annoyed, saying she was getting something. She rushed into the kitchen and came out with...bread for the other table she was serving! What? Finally, a busboy came out to clean the mess. When the waitress came back to the table she barely acknowledged the spill, and certainly didn't comment on the fact that she had literally left me holding the table cloth to keep the mess from going all over the place! Not cool, dude.
It was our second trip there. There won't be a third."}
{"text":"First thought, Friday night pizza!  Once I walked in to Andaloro's Taste of Sicily -- the Italian aromas led me to change my mind immediately. As I was looking over the menu - I could hear customers at other tables talking and laughing, seemed to really be enjoying their food.  My husband and I try to order different meals while dining out so we can taste a lil of each others,  so as normal I ordered the chicken parm and he ordered the FOUR cheese baked ziti.  The chicken parm was good and very tender - and was covered in the exact amount of cheese.  The side of pasta....YUMMO - I loved the sauce.  Halfway in to my meal, it was time for the taste test.  My husband and I tried each others dishes -- his baked ziti, I have to score a 10 out of 10!  Now, if you are expecting garlic bread sticks like some of the chain italian restaurants...you will be disappointed. However, your dinner meal does come with a salad (balsamic dressing was really good!), and bread with marinara sauce for dipping.  The atmosphere was quaint....possibly like a little family restaurant from Italy, I just can't say for sure because I have never been to Italy.  Hand painted sky w/ clouds for the ceiling and grape vines painted on the walls...really cute.  The dining room was much larger than I expected, it is divided in to two sides so it would be great for large parties as well as small groups of friends, even cozy for couples date nights.  Oh and if you are bringing the family....towards the back of the restaurant, there are a larger tables and there is a little cove tucked in the back of the dining room with couches and a TV...yep. the lil ones can stretch their legs or sit back and relax while the adults finish their meals - yes, the cove is all open and the kids would be just an arms length away.  The waitress? - Friendliest waitress I have ever had, she even brought the owner over to introduce him (her fiance)  - made us feel like part of their family.  So, second thought - I am going back  - still want to try the pizza, as long as I can pull myself away from that baked ziti!"}
{"text":"We went one Sunday, the food was amazing, my daughter finished her soup. Fetuccini and lasagna were great..... but the best was the service.....
Price was OK and once before we ordered pizza that was really, really good.... So, we recommend this place,"}
{"text":"Popped in for a late lunch this afternoon because they had a banner advertising pizza & pasta for $5.  We were pleasantly surprised by the quality of the food, and the pleasant friendly staff.  For about what we would have paid at a fast food drive through for the two of us, we were able to enjoy an authentic Italian meal with fresh baked bread that had a delicious dipping sauce!  I highly recommend it!"}
{"text":"My husband and I very much enjoyed our dinner here tonight! Excellent service and tasty dinner; have already recommend this restaurant to a friend!"}
{"text":"Excellent. Real veal not patties.Good service. Very nice atmosphere. I am hooked."}
{"text":"The food and service was great.  Enjoyed the chicken piccata and Parmesan on several occasions."}
{"text":"I waited until the second visit to say anything, but, this place just sucks. Thursday around 530pm and only one table to serve?! That's when I should have just walked back out. The waitress was friendly, no doubt, but seemed to spend more time in the back then up front which makes it difficult to fill drinks (that's your main job). The pizza was ok but I the spaghetti is BLAND and the veal is non-existent. And listening to Italian rock/metal isn't my idea of a relaxing evening out. Just stay away and do yourself a favor. If they can;t get basic concepts right, they aren't going to survive anyhow."}
{"text":"I usually wait to write reviews and comments on restaurants until I have frequented them a minimum of ten times or more. I decided to comment early because of the high quality and flavor of my first meal. For starters, I usually try the veal parmesan for reference. I added their spaghetti with meatballs and meat sauce. The salad was a perfect blend of very fresh baby greens and vegetables topped with their house dressing. The veal was perfectly cut, pounded, spiced, breaded and fried, and placed on an adequate bed of marinara sauce that was very well balanced, full of flavor and robust. The veal tasted as if it was fried in canola and not olive oil. The veal was topped with fresh fragrant herbs. The meat sauce was good but seemed to lack the dimensional qualities and full range flavor of the marinara sauce. The meatballs were excellent in size, texture and flavour. Dinner service was very satisfying. The interior decor was typical old Italian with water fountain, painted ceilings and newer styled erratically placed pendant light fixtures. This is a restaurant that would be right at home on Mayfield/Murray Hill roads down in Little Italy. I don't think there are any authentic Italian restaurants in Willowick or the surrounding cities that can compete with Andaloro's. SM."}
{"text":"This was my first and not my last visit to this delicious Italian place.  Stop here for lunch with two of my coworkers and were greeted and seated right away. The service was great from the start, we were asked what were drinking shortly after we were seated and at the same time deliver some hot fresh bread with an amazing roasted red pepper dip (which was so so good and free). We only had an hr for lunch so no apps went straight to the mains, i ordered the veal parm and my two coworkers both got chicken parm. All the dishes came with a house salad which was a nice portion and fresh, my only issue with it was the dressing we all got italian and it seemed and tasted like 90% oil and not much other flavor.  Are main courses all came out hot and fresh, all of which looked delicious with a nice portion of spaghetti with each. My veal parm was a huge portion nicely fried not over cook well seasoned with a good amount of sauce and melty cheese and oh so tender. The side of pasta was the perfect al dente, the sauce on the veal parm and pasta was great nice tomato flavor that was not overlly acidic and not to sweet with a good amout of seasoning.  I would have loved some fresh grated parmesan cheese but they had the classic shaker of crumbly parmesan cheese which i am a sucker for (got to love old school italian resturants.

Overall the experience was great, service was impeccable, food was well seasoned, portions were huge and prices were great. I will definitely be back to this classic italin joint to explore the menu and there fresh house made pasta and sauce!!"}
{"text":"Best cheese pizza in town!  They have a taste all their own and there's nothing better than one of these pies on a lazy day of football and beer!"}
{"text":"Good food and good value.  Chicken Marsala was so-so.  Portions are very generous.  My wife had the eggplant and veal parmesean.  She said it was very good.

The service was top-notch.  Our 2-year old daughter fell backward in her chair and was immediately helped by the staff, including the manager (or owner?).  Of course she was crying--more scared than hurt.  They came to make sure she was ok and offered her ice cream to \"make it better\".  Hats off to a great experience at andolaros!"}
{"text":"Very good bread, pasta and sauce, pizza was ok needs more flavor but very nice presentation. Great value restaurant, inexpensive and large portions. Servers are excellant as well as management. Nice place."}
{"text":"My wife and I came from Akron to see a Lake Erie Captains game with my Sicilian mother in law. I always try to find good Italian places to take her. After reading the reviews on here we decided to give this place a try. We arrived at 5pm on a Sunday and was greeted promptly and sat. The server was great got drinks right away and gave us time to look over their amazing menu. I had the spaghetti carbonara, wife had the gnocchi with creamy tomato sauce, and my mother in law had the veal picatta and roasted red potatoes. They brought fresh bread with a plate of olive oil with crushed tomatoes and fresh basil. We also got a tossed salad with our entrees.I have to say the food was very authentic and amazing. We all tasted each other's dishes and my mother in law almost had a tear in her eye because it tasted exactly like her grandmother's food. The portions are huge and the prices are low. However, they don't skimp on quality. We also split two cannoli for dessert and our total bill for three people was 53 dollars! You can't beat that anywhere for the amount and quality of what you get.If you are ever near this place I highly recommend eating here. You won't regret it!"}
{"text":"They have some of the best pizza around. It's our new favorite. On Tuesdays and Thursdays they have buy one pizza get one half price. You can't beat the quality or price for that matter. We got our pizza for carry out but next time I think we'll eat at the restaurant and give the rest of their menu a try."}
{"text":"My boyfriend and I love coming to Andaloro's! From the drinks, the food and most importantly the wonderful service from what feels like my very own family, this is a sure place to indulge in good food and company. 
Every time we visit, we get our classes of wine and share a pizza - we want to try them all!. We always have enough to take home for the next day ( or late night snack! ). 
I love their Portobello Pasta, and I always add broccoli. Perfect amount of spice and always leftovers ( but you got to stop me! )  
Thanks for the hospitality, wonderful food and great company!"}
{"text":"Best authentic Italian restaurant outside of Little Italy. I love the decor and ambiance. I particularly enjoy the house red wine. Service is always top notch."}
{"text":"Even with new ownership i did not find this place standing out as the to go place for great Italian food, it was very average both in sauce taste and portion. I almost want to say the sauce is not house made yet i wish to give them some credit it is just missing some extra love in it.  I hope for the new ownership to find its groove as this part of town needs some good Italian food."}
{"text":"The food is very good, the service is timely and the prices are very reasonable.  We have tried the pizza, veal piccata and spaghetti.  Desert ranges from a very nice tiramisu to stromboli and more.  Full bar with decent wine selection. I wish they would finish the paintings on the walls."}
{"text":"Food is tasty and authentic! The decor inside is charming. It's an older restaurant. Each pasta dish or entree I've had was delicious! Mushroom ravioli is great for a vegetarian. Usually pretty quiet if you go for early dinner. Have not tried the pizza yet."}
{"text":"The food is divine!  But, let me tell you about the interior!  I hasn't been changed since, oh...1970?  ...in a good way!  I don't have a drop Italian blood in my family, but I still felt like I was at home in an Italian Grandma's home.  
Portions are huge and FRESH!  The House Italian dressing has a wonderful zip to it and the spicy pesto is phenomenal.  Very worth a visit!!"}
{"text":"The name changed but the food seems the same, which is a good thing. I had the chicken Marsala and the Mrs chicken parm"}
{"text":"Italian cusine doesn't get much better than this!  When you step through the doors you get the feeling that you're in for an authentic experience... well you are!  Southern Italian cuisne is known for its simpicity, and Andalaros offers just that at very reasonable prices. Not to mention, the portion sizes are quite generous, and all entrees come with bread and a house salad, so you won't have to worry about not being satisfied. Lastly the staff are very warm and welcoming, know the menu, and treat you well!  There are no negative points to list, so if you want the true, unadulterated Italian experience, try Andalaros - it is the best in ne Ohio as far as I'm concerned!

               ***UPDATE***
Since Marco sold the business to some schmuck, it has nose dived in both quality and legitimacy, I mean, the owner isn't even Italian! You can't replace a gold medalion with a bronze one and expect people not to notice. Sadly, the soul of this restaurant died when the Italian owners sold it - thus the old world atmosphere and culinary authenticity evaporated as well."}
{"text":"\"Saturday night and I ain't got nobody\".... so I wanted pizza. 

I called Andoloro's since I had never tried them before and they are super close to the ranch. 

I sent huzzband dude out to grab a menu (he is still my slave) since they have nothing on a website. He procured a menu. I chose. I called to place an order. 

The woman on the phone was silly. A very silly woman, indeed. She clearly didn't understand how to use a credit card reader because she called me back to tell me that my card was \"declined\". I was a bit shocked and immediately thought, \"hmm, someone must have stolen my awesome identity!\" I mean, really, who the hell wouldn't want to be me? Seriously. So she said she'd try again after I gave her the number a second time. 

She called back. Again. Still \"declined\". I knew something was fishy. So. I did what any self respecting woman would do. Sent huzzband dude out to pay for the pizza in person. I wasn't leaving the house! 

The card reader worked in person. How mysterious! 

If you're still reading....I realize most of this review is my boring story about TRYING to pay for a freakin' pizza. I apologize. It was a huge part of the experience though. 

They had a section of specialty pizzas. They were all Sicilian style - all white. I chose one with artichoke hearts, portobellas, tomatoes. It was alright. Not the best though. I also ordered a side of calamari that was extremely disappointing. It was the frozen stuff. And there were no tentacles. I love tentacles. 

They were really nice and gave me a large pizza (for all of the credit card trouble) instead of a medium. I only ate 2 slices. If you would like some pizza, stop over. There are still 10 slices left. 

I will try them again -- because they were so nice to give me a bigger pizza without my even asking or making a stink about anything. I would order a different pizza next time though."}
{"text":"Good food, excellent service.  

They went above and beyond to fix a mistake they made and I wasn't going to complain as I got two meals out of it.

 I ordered the eggplant and they brought me the chicken parm by mistake. I said I would eat the chicken because I love it anyway and didn't want to wait for the eggplant. 

The chicken was very good, but the chef made me an eggplant dinner because he felt bad for misreading the ticket. Needless to say I walked out very full and happy. 

Very friendly staff. 

The chicken is thin and crisp with a good amount of cheese, not too much. The eggplant was fresh and not black from being in the freezer. Both dinners were very good. 

The prices are right too, not over priced for what you get.

I will be going back."}
{"text":"I won't even bother to try this place.  I called to find out what their web address was, and the RUDE woman who answered the phone gave me a \"Pshh!  We don't have one.\" remark.  I called back a few minutes later figuring that just ordering a plain pie would be safe, but the boy who answered informed me that \"We ain't got no delivery guy working today.\"  Thanks, nevermind.  Business must be booming there to be able to deter customers the way they do...."}
{"text":"My husband and I stopped here for dinner as it was a place we had never been before.  They made us feel like we were their only customer... Wait,  we were.  Th  restaurant was empty.  I suspect the do more carryout than anything.  The food was nothing special,  in my opinion.  It wasn't awful but it wasn't anything special either.  While we were sitting there an older man with a Cain came in and stood by the door for about five minutes and after he waited for someone to come to the  front to acknowledge him,  he left. They definitely lack on customer service.  When other customers came in,  there was no greeting or welcome, just \"do you have a pick up order\"  which was yelled from across the restaurant.  The lady at the  bar leaned over the  bar with her coat on playing with her phone as well pretty much the whole time we were there .  I wasn't a fan of the vinyl sticky table cloths either."}
{"text":"Greeted upon arrival. Our server visited our table frequently to see if we needed beverage refills. I wasn't impressed with the spaghetti and pizza. Although the $5 deal was a great price point."}
{"text":"Was looking forward to trying this restaurant.  We're not greeted when we arrived.  One server only.  She had a large table and one single. She came over and seated us. A man came out from the kitchen and started clearing a table.  I ordered a lemon drop martini.  The server said she didn't know how to make it. I asked if there was a bartender.   She said no.  The guy clearing the table then said no bartender yet. Ok. No worries.  Our friends arrived.  We ordered 4 simple drinks. Then asked if we could have dinner menus.  She had given us lunch menus.  She brought us one for 4 people.  Asked for three more dinner menus.  She brought them. And then proceeded to bring water to a table that had arrived ten minutes after us.  Still no water.  No drinks.  We left.  Sorry we couldn't taste the food.  But you have a long long way to go with customer service.  Which is almost as important than the food.  Will never go back. And there are no excuses.  Don't want to hear you were short staffed.  If nothing else, one of the owners should have been there to help this poor girl. Left on her own.  Did the best she could."}
{"text":"After a disastrous first visit by my dinner club, and the resulting poor review, the manager invited us to come back a 2nd time , on the house.
Night and day! Angela was a breath of fresh air. Upbeat, quick to check if anything was needed, and kept us updated on our meals progress. 
Just as before, the food itself was very nice. Only one dish was a bit over browned ( the calzone) but Angela quickly offered to allow him to reselect.
The new meal came out quickly and was packaged to go as requested.
All in all, a 180° change in how we were treated.
Thanks Scott for the invite, we really enjoyed ourselves."}
{"text":"Only complaint I have about the food is my tiramisu was frozen. When I questioned why it was frozen, I was told it was supposed to be that way. Pizza was really good, Linguini Alfredo was awesome.  Service was still as poor as Andalaros was though. Aside from being told my tiramisu was supposed to be frozen, our app of mozzarella sticks came same time as our meal because \"the cook burned the first batch\". (The cook also burned the bread brought to the table.)  We never got plates for our pizza and refills were hard to come by.  We were there on a Sunday around 5, only 4 other tables there with us."}
{"text":"Great meal today, friendly staff treats you like family, very affordable, hidden gem off Lakeshore Blvd, check them out! Sausage sandwich was great. Plenty of room for big parties and a full service bar as well. We will definitely be back."}
{"text":"Fantastic food and very pleasant and helpful staff.  We live nearby and I am sorry that we waited so long to try this place.  Reasonable prices and large serving."}
{"text":"This is my second time coming here and the experience was a night and day difference from the first one. I believe the bad experience was a fluke. Our server, Angela, was an absolute ANGEL!! Very chatty, friendly, attentive, and anticipated our needs. That's our new home girl! ;P

The food was incredible and the manager was very kind to comp our second time around because of the disastrous experience. I'm very happy with the service and the delicious food, and we WILL be back!!"}
{"text":"I love this restaurant.  Best spaghetti and meatballs on the planet!  And best Italian wedding soup.  We go here every 2 weeks, service is excellent."}
{"text":"What a mistake going to Amore was today. My wife and I went with four friends. Although I made a reservation earlier in the day they had no record of it. They set up a table for us where it was so dark you could not read the menu. After we ordered we had to wait 65 minutes to get the food and half of the meals were cold. Then I got my bill and was overcharged $6 for my bottle of wine. The waitress response was \"thats what the computer rang up\" and did nothing about it.  Tried talking to the woman at their desk when I left and she kept avoiding me.  Will never go back and I will be glad to share my experience with my friends. This place won't be around much longer."}
{"text":"This is the best Italian restaurant in town...all fresh, home made ingredients...good quality food for a very reasonable price...not to mention the portion sizes.OMG you get 2 meals for the price of 1...also very friendly service."}
{"text":"Throughout my life I have seen this location go through so many restaurants, and now I am glad I checked this latest one out! It wasn't very busy, which upsets me because sometimes the greatest places go unnoticed. 

I just moved to the area and decided to check it out. The guy who answered the phone was super friendly and helpful! The food was AMAZING!!! I liked it so much that I called back to say I want to come back in and buy more of the sauces for our leftovers later.

I asked the server on the phone which he would recommend on two choices and he was honest. He recommended the less expensive option. That's how I know they really care about quality of the food vs just making a buck.

I hope that more people will visit this place so it doesn't go under. The staff, courtesy, food quality is worth every penny!!! Too inexpensive for the quality in my opinion!"}
{"text":"Food is FRESH and great tasting. Staff makes you feel welcome."}
{"text":"Didn't even know this place was there until I saw the Yelp reviews. It's a gem.

Instead of a regular olive oil for dipping, the bread came with a rich tomato mash. My wife couldn't get enough of it.

Caprese was ok; beefy tomatoes (romas, I'd guess).

I had the veal parm; it was lean and tender. You get your choice of pasta; the fettucini was done exactly right and the spicy tomato sauces was a treat.

My wife had the gnocchi in a creamy tomato sauce. A little bland for my taste, but she liked it a lot.

We got tempted by desserts. Her coconut sorbet was, she said, one of the best she'd ever had, and was topped with a mound of shaved coconut. I got the cannoli and could only finish one -- rich, but not too sweet, drizzled and dunked in chocolate.

We'll definitely be going back."}
