{"text":"The food, to say the least, was underwhelming.  It depends on what you are looking for.  If you want fresh food, prepared cleanly and with distinct spicing, and not bland creamy, meaty, saucy, average stuff -- this is not your place.  The room is dated, but very roomy and comfortable.  The staff is friendly.  The view is spectacular.  Prices are fair.  But the food, not so good.  Average stuff, that senior citizens think passes for good dining."}
{"text":"Good food, great atmosphere, great service and great prices! We will definitely be back! Can't wait to try the Sunday Brunch!"}
{"text":"I've eaten here twice, the food and service were excellent on both occasions.  The chef even came to our table to accommodate a special needs diet.  Worth a visit."}
{"text":"The restaurant is in Corta Bella (a gated 55+ community), but if you tell the gate attendant you're going to Anacapa they'll let you right in.  The food was delicious.  I had the prime rib (that night's special) and it was perfectly tender.  We enjoyed the sunset view of the golf course as well.  Since this is in a 55+ community the place emptied out pretty early."}
{"text":"LocateD in Corte Bella Country Club but open to the public. Provides wonderful ambience and excellent service. My wife and I have eate n here often and not been dissapointed.  Summer menu is limited, but \"in season\" menu is extensive."}
{"text":"Brunch was great on Sunday. They were possibly a bit short staffed or there was some miscommunication between staff. Tasty and great atmosphere.
Went to dinner last week and the service was all over the place, took a long while to get our food, but when it finally arrived it was very Good!
Come for happy hour from time to time and it is always a bit confusing whether a server will come to the table or you have to go get your drinks at the bar. Well priced happy hour drinks though."}
{"text":"Excellent restaurant. Outstanding service and food. The hostess greeted us at the door with a smile and made us feel very welcome. Food was great. Fish Friday's ! Daniel our waiter was great very courteous. Food took a little while but they did have an event next door that they were catering. Overall excellent experience."}
{"text":"The ambiance is O.K.  ..... the beer selection is not and the food leaves a LOT to be desired.   Wish the food were better.  The menu never changes and even the soups leave something to be desired.  Oh, my ....."}
{"text":"Our community owned restaurant  features a varied menu bu Chef Dan and a good wine selection. It is open to the public as well"}
{"text":"Since I wrote the earlier very favorable review, Anacapa has had some struggles and it is reflected in the current state of the restaurant.  After a particularly disappointing visit with poor service and a less than average meal, I wrote a note to the new general manager and the overall Top manager.  Add into the mix that we were former weekly diners who gave the restaurant a stellar 5 star review.  No reply.  The usual arrogant, we don't care attitude that permeates the Corte Bella management has bled into this formerly grand restaurant.  Too bad.  It has a great setting and could be so much more if it just got back to its former self.  One star is a gift."}
{"text":"Had reservations for Sunday brunch. Service was terrible. We were served coffee immediately but had to ask 3 times for water. That should just be automatic. There is a made to order omelette station, manned by 2 cooks, each had 2 pans. One cook had 2 pans full and the other cook only had 1 full so I stood in front of him. He totally ignored me and kept up a running conversation with a female staffer. I said, \" would you help me\" and he ignored me and continued talking to the other employee like I was invisible.
So I went over to the other cook and said, \"what is his story that he won't help me. This cook said the other guy liked to chat up the female employees. So apparently his lack of customer service is well known but mgt. chose to do nothing. I will not be going back. Wish I had gotten his name. Our reservation was for 11:30 am and the brunch goes until 12:30but 2 of the steamer bins were empty with no sign of anyone replenishing and the fruit tray was empty except for 5 grapes. I am terribly disappointed. Sorry for the people who live in  Corte Bella if that is the service they get there. Will be telling my friends and will not return."}
{"text":"Arrived with friends here. They'd been before and was our first time. The wives had salmon and said it was excellent. We had the fish and chips. It was very tasty, but a little greasy. I'd ordered sweet potato fries and they placed the fish over the fries, which made them a little soggy. Prices were reasonable for this type of restaurant. We will return."}
{"text":"This is a good choice for a special night out in an area where there are not a lot of places that fit that description. The setting is lovely and the dining room and patio are very attractive. The food is fine - nothing exciting or memorable, but there is a nice variety of offerings on the menu."}
{"text":"Been here twice for private events. What a beautiful setting. Gorgeous view of the golf course and the food was delicious. Stay for drinks during the sunset, so peaceful!

Meat loaf was a highlight of dinner - highly recommend! Service was also fantastic."}
{"text":"WARNING, Be very careful!!  They committed fraud/theft.  We dined here a while back.  The food was good but the service was terrible.  Our bill was $73.  I usually tip 25% in cash for a great experience.  Due to the poor service I left only $14 cash, almost 20%.  When the credit card statement arrived someone had changed the bill amount to $81.  I showed this to management when dining there later and asked for an explanation.  They promised to investigate and call within 2 days.  I never heard from them.  Apparently they don't care if an employee is stealing from customers."}
{"text":"Cute little place. Reasonable prices. I was excited to learn it's open to the public considering it's in a private golf retirement community. The Sunday brunch was ok. Nothing to write home about except the omelette station for made to order omelettes. The service was good. I look forward to coming to dinner because their dinner and lunch menus look amazing. Cannot wait. Just wish it were open later than 8 pm, but it's a retirement community so I understand."}
{"text":"After a rough few months earlier this year, the service has improved.  Food has always been good.  A few new items on the menu,  including a delicious walleye."}
{"text":"Good food, nice décor, pleasant service, and spectacular view.  Beware, though, that if you are attending with a group that your bill will include an automatic 20% gratuity.  That's understandable, but then there is a separate line on your bill for \"TIP\" and some customers will likely fill out an additional amount accidentally without realizing that they have already been charged for this.  It's an annoying and sneaky maneuver that could easily be resolved with better cash register programming."}
{"text":"The menu and wine list haven't changed for quite a while, they need to  shake it up. If you want to go for the prime rib special book early because they they run out by 6pm. We used to be able to put a hold on prime rib but last time the chef assured us there would be lots........and guess what?? Chef Dan's cooking class menus sound great, not so his menu at Anacqpa"}
{"text":"Been there many  times.  It has become a family tradition when the 'kids'  come out to AZ to visit.  We all love the Sunday Brunch.  Yummy!"}
{"text":"Lunch took over 2 hours. Service incredibly slow. Food came out cold. I will not return"}
{"text":"Every time we go, we like it more.  Service is great...a very comfortable, friendly bar and very good food.  And close to home!  Verde Grill should have looked at this place before they went under!"}
{"text":"We love love LOVE this restaurant!  It is a high end restaurant that actually has high end food!  My husband and I came to celebrate our anniversary and LOVED our experience.  we have been back several times.The portions are big, so my husband and I like to share an appetizer, meal and dessert... Which is my FAVORITE way to experience lots of things on the menu!

The menu is rotating, so you may not be able to get the same thing twice.

The restaurant is in a gated community, but getting in was NO problem at all.  We told them where we were going and they let us right in!"}
{"text":"The Anacapa Restaurant at Corte Bella has a No Weapons Policy posted. As they choose to prohibit me from exercising my weapons rights to protect myself, I choose not to solicit"}
{"text":"I have been to Anacapa several times for drinks on the patio and food, and have always had good service and decent- and sometimes much better than decent--food. This is a great place for the more 'settled' crowd (you know, senior citizens) in a beautiful setting overlooking the golf course at Corte Bella in SCW. The reason I'm writing this, though, is not because I've had a good experience every time I've been there, but to describe a special event hosted by my 90 years-young Mom for dinner after my Dad's funeral. Mom wanted to treat the extended family to cocktails and dinner so we went in a week or so before to book arrangements. The extremely nice assistant manager described how they would set up the small private dining room (we had 14 and it was just enough space) with Mom's color choice of linens and the selected menu she picked. He gave us the menu so we could take it home to make our selections. It took one more short visit to close up the details. On the day of the event, the staff was very attentive to our needs on the patio for drinks and when told the venue was ready for seating, they had done the room beautifully with gold charger plates and burgundy linens and a beautifully printed keepsake menu honoring my Dad with his name at the top. The waiter(s) were excellent, going so far as to separate food items in little dishes for my nephew who doesn't like to have his food touching on the plate. Salads and dinner were all delicious. Moreover, the price was extremely reasonable (14 people, cocktail and dinner, under $500?? amazing) and staff went out of their way to make everything easy for us. I just can't say enough for the staff and the chef and will think of Anacapa first when I have a future event to host."}
{"text":"Great view from Patio.
We are trying the mussel appetizer.
For dinner we are trying the;
Shrimp Linguini with white sauce was very tasty.
Pecan crusted Salmon was superb.
Austin our waiter did a marvelous job as did all the associates serving and assisting at our table.
The only 2 suggestions I have for the restaurant is; make sure your stemware is very clean and spotless, my martini glass had a terrible film on it?... the other suggestion is don't bring out the salad before the appetizer dish."}
{"text":"Visited Anacapa for \"Happy Hour\" and had a very disappointing experience. The food was not only expensive, it was not good. The service, although friendly, was almost non-existent, requiring asking other staff to attend to our needs. Took 15 min to even take our drink order, and we had to ask several people, a few times for water. Thankfully the people we went with were great, but we will never go there again and I will not recommend. Tip: either have better food or lower your happy hour prices and get more (or better organized) staff."}
{"text":"Went to Anacapa for the second time, the first time Anacapa hosted our wedding reception and the second time we celebrated our 2nd anniversary. We have eaten at many Phoenix restaurants and I can certainly say that Anacapa is one of the top five restaurants in the Valley. Our ribeye steaks were cooked to perfection and tasted ever so much better than the steaks served at Fl____ings, which is a steak specific restaurant. Prices? Half of what one would pay at Fl____ings and you get side dishes too included in that price. Take that, Fl____ings!

Staff is very attentive and prompt, courteous and made us feel very special. We drove about an hour each way to come eat here,  worth every second. We will definitely be back!"}
{"text":"We have eaten there many times,the food is excellent ,service is courteous."}
{"text":"Been here several times for both dinner, lunch and breakfast and we always say to each other, \"why don't we eat here more often?\" Granted we live here but I think that the food, service and ambiance are pretty good.
We have done the Sunday brunch, average for a buffet, they do omelette to order and have lots of things to choose from. Lunch was out by the pool, sandwiches were great and just what we ordered. Dinner has been good as well, the fish and chips are very good as well as steaks. I like the soups, these are fresh and made from scratch. There are some chef specials, the chef here is great. I should visit it more!"}
{"text":"This is a nice restaurant with good food and staff that is professional and courteous. The restaurant has nice decor, comfortable seats, and pleasant atmosphere. The food is good but save room for desserts. They are great! In order to be seated promptly, I suggest making a reservation."}
{"text":"I wish I would have known that you need a reservation. Being that it's located in a gated community and Google maps took us to a private entrance we couldn't use, we really had to go out of our way to find Anacapa only to discover that we would not be able to get a table, anyway."}
{"text":"Ambiance very nice, view wonderful. Food average, menu described an 11 ounce prime rib, what we got was a small piece of meat , dry meat, that was maybe 6 ounces: have been there many times and complaint is always always how poor service is . Servers seem to have tables inside and outside and you end up waiting and waiting. Good luck looking for your waiter hoping to get something else."}
{"text":"Have never had a good experience here. Outdated menu, mediocre service staff, run out of specials before most people even think about dinner."}
{"text":"Took a friend of ours who lives near there, to dinner at Anacapa Restaurant last night.  It was SO FESTIVE! Big huge Xmas Tree, Fire in the Fire Place, beautiful view of the golf course.  The chairs were huge and comfy.  I had the chef's Salad, and it was EXCELLENT!  My husband and friend had the prime rib special and it was cooked perfectly.  The Calamari appetizer was very good also - I think it had deep fried Pepperoncini Peppers with it - really great.  The service was outstanding - Daniel/Danny was awesome!  We thoroughly enjoyed ourselves.  The wine was great - they didn't have what we originally ordered, but they substituted with something else and it was great.  We had a great time and will definitely go again."}
{"text":"Reserved the private room for a 16-person, 90th birthday diner. The staff was very helpful. Jill (the banquet manager) worked with my Mom to set the date and room setup. We kept our waiter (Alex) busy with our orders...the food was delicious.  And we were able to split the bill easily. Appreciate being able to go and enjoy the food and our family at a lovely location!"}
{"text":"I still visit this great restaurant every so often as my parents live in the area.  Still exceptional!"}
{"text":"This is a very nice restaurant (particularly for the Sun City West area) with good food and friendly and attentive service.  As mentioned by other reviewers, it is very nicely appointed and there is a wonderful view out the large windows.  So why am I writing this review?  Because after dining there several times recently, I just want to say that you had better dress warmly when you come to this restaurant.  At least during the winter season, they keep the temperature inside pretty brisk.  Even my wife, who almost never thinks a room is too chilly, complained about the low temperature.

So, as they say, forewarned is forearmed or, in this case, forewarned is warmly dressed."}
{"text":"We had brunch here and it was adequate. Nothing fancy. Just okay.  I think I would go again and order from the menu to see if it's any better."}
{"text":"We have dined here 5 or 6 times now. Never did have an outstanding experience. Food is just so so. Lunch poor quality for the price. Dinners way over priced. $25.00 \"Caribbean\" buffet was about the crappiest buffet ever. Jerk chicken tasted like crap. Fish was dry with no flavor. Shrimp salad smelled like rotten shrimp. Doubt we will return. They need a better chef and better quality food. Avoid would be my recommendation."}
