{"text":"Speechless!!!!!!!  Cozy place, was welcomed with a smile. Recommendations provided were great :)   Pasta were saucy and lavish with taste but not over creamy ..... Awesome   The best tiramisu I have ever had !!!!!!  Definitely recommend, will be going again"}
{"text":"I just tried this place for the first time. One word. WOW! The lighting could be a bit better but still not a bad ambien ce. The food is absolutely delicious. The prices are not bad at all considering an equivalent place in Toronto would be $15-$20 more. They were shorthanded in the kitchen today so the meal took a bit longer than it should have but it was fresh when they brought it out and tasted amazing. I had the Gamberi E Carciofi(shrimp in the sambuca sauce) for appetizer and my friend ordered the Calamari. Both were excellent but I preferred the shrimp app. Simply amazing.   For mains I ordered the Veal Boscaiola which was exactly what I was craving. A good veal in an amazing white wine cream sauce. Just perfect. My friend ordered the Lobster Jumbo Ravioli and for $5 more they threw in some shrimp and some scallops. I tried some of it and I have to say that is probably one of the best raviolis I have ever had. My friends fiance ordered the Spinach Gnocchi which was good but I personally am not too fond off gnocchi.   For desert we ordered cheesecakes. I got mine with the wild berry sauce and my friend got his with chocolate. It was smooth and creamy. It was a little weird because I think the sauce was warm and the cheesecake was cold so it was an interesting contrast.   Overall absolutely amazing and I am definitely going back there to try the rest of the menu."}
{"text":"A really great thing about this place is how accommodating they are. I went with my father, who ordered off the menu; the staff were completely fine with that and very kind about it. The other strange accommodation was made by the server - we requested that he put ice in a lunch bag I had in my purse. He looked very confused at the request,  but did it for this no complaints and limited questions.  The food tasted good, it was nothing spectacular but enjoyable anyway."}
{"text":"The food was delicious! Salmon pasta on point. Wish I had discovered this place a while ago - been living in sauga for over 25 years ans just found out about this place. Very yummy - def returning and highly recommend."}
{"text":"Having just visited Italy 3 months ago, I would say the menu is pretty authentic. A quaint little restaurant, that is well kept. Does not accommodate large parties well, due to size and layout.  I was, however, disappointed that our waitress did not understand how an Italian multi-course meal should be served. I suspect that had the chef been aware that an individual had ordered two courses, he would have staggered them appropriately. But I suspect he was just handed a list of dishes, and so both my courses came out at the same time. By the time I got to my 2nd course, it was no longer warm.  But overall, still a positive experience. Flavours compared well with the meals I had in Milan and around Lake Como."}
{"text":"The food is amazing, especially for the Bianco Nero. Every time I eat there it is a must. Dessert mainly is tiramisu and wild berry cheesecake. The flavour are rich, but not too sweet. Love it a lot. Only thing is the services. It is a small restaurant and during the dinner time the restaurant is packed. Only 2 servers in the dining area and one chef at the back. Very slow services. If you are going there next, be sure you have lots of time to enjoy."}
{"text":"Food overall was okay. Service was well below par and the tiny place was only approx 60% full. This place reminds me of Indian restaurant interior and cutlery.  I recommend this place for families and not romantic dates."}
{"text":"Tried the penne pasta which was pretty amazing, huge portion and good amount of pine nuts as well . We also ordered the lobster ravioli . The sauce was fantastic but the ravioli was a little undercooked and I think they're should've been more lobster meat (more saucy but not meaty ) I would've liked or was expecting some good chunks of lobster in my meal"}
{"text":"A perfect Italian dinner and ambiance. I had a wonderful minestrone soup and veal parmagiana - perfectly prepared. It is a small dining room, like the small neighbourhood restaurants in Italy - and the food is just as good. And because it was my first visit the chef treated me to a free desert.   I wish I could keep it a secret but alas, it is already well known. Go early and go often - I know that I will."}
{"text":"Food quality and taste was fantastic!  Highly recommend and we will definitely come back again soon."}
{"text":"Solid little gem in Streetsville. Italian food and not frozen cooked the way you like it. Small restaurant but service is very friendly. Very reasonable prices as well."}
{"text":"Great place. Their simple spaghetti is to die for. Very courteous service. This is my go to place for Italian."}
{"text":"My husband and I loved eating at this small gem in Mississauga. The food was fresh, flavorful, and authentic. My husband had the Piccata de Pollo and I had gluten free Penne al Pesto. It was a wonderful dinner with great service!"}
{"text":"A poor introduction. I go in at 11:45 AM on a Wednesday morning. There are three customers. The waitress wants to seat me at a little table facing the back wall of the narrow little room. I ask if I can instead sit at a little table that faces out on the other side of the room. The waitress reluctantly agrees. But then she gets into a long and loud argument with the chef and disappears into the kitchen to argue more intensely. At that point I decide that it is unlikely that I will enjoy a pleasant and relaxing lunch there and leave. Some folks probably shouldn't be in the restaurant business."}
{"text":"Love coming here. DELICIOUS Italian food. I've tried every appetizer and I love the pasta. Great family owned restaurant. Would definitely recommend checking it out."}
{"text":"Small little place with great food and fantastic service. Best seafood pasta we ever had. I would suggest to call before going as it's a very small place and its usually full."}
{"text":"Great Italian place. Big portions and good price. I always come here when I'm craving mushroom risotto and garlic bread! Great for families, laid back, casual atmosphere.  Menu has plenty of delicious choices, will suit even the pickiest eater."}
{"text":"This place does things so well that I can't think of a better place to bring coworkers or family for a lunch or dinner. They continue to make incredible food, and the service is fantastic.   We are actually trying to decide what to order right now. The risotto marinara (so good, I crave it weekly) or the spaghetti with meat sauce (simple and delicious). Or the lobster ravioli (the BEST I've ever had). Or the bow tie pasta with smoked chicken.   It doesn't matter what you order, it's guaranteed to be delicious."}
{"text":"We had a great dinner here. We went there as group of 5. We ordered Bruschetta with Cheese, Caprese Salad, Calamari alla Livornese to start, and we ordered Veal Boscaiola, Spinach Gnocchi, Veal Parmigiana, Cannelloni, and Chicken Boscaiola for main course. We like everything we ordered, they are so delicious. The portion is generous and we could not finish them all. The service is decent and food is the best Italian food We have tested in Mississauga. We definitely come back for more."}
{"text":"Wow. What a great place for pasta. I had the gnocci which was amazing. Started off with a butternut squash soup which my wife tried as well. We both agreed agreed it was great. Can't remember my wife's entry but she said it was packed with flavour. We shared a great cheesecake for dessert. Love this place. Will definitely come back."}
{"text":"Andiamo has blown me off my feet. A real hidden gem, small and in between an old fish & chips and a \"love shop\", who knew the pastas here could taste so amazing. I am still in awe that we havent gone here sooner. Highly recommend!!!"}
{"text":"Cute little place, friendly service but the food was disappointing. My family and I decided to try this place last Friday night. Overall we felt everything was too bland. Here's a review on each dish:  1) The stuffed chicken with veggies: Chicken was a little dry and veggies were undercooked. The sauce was tasty.  2) The lemon linguini: Very under seasoned! Not to be harsh but I make better pasta at home.  3) Seafood pasta: Again bland and something you could buy at the grocery store.  4) Desserts: All were very good! We think they bought them from the bakery down the street but either way very yummy! The tiramisu and chocolate moose cake were excellent."}
{"text":"I made a reservation for a Friday night at 6:30.  We came quite a bit earlier, but they were still able to accommodate us.  Yay! The place isn't very big so if you really have your heart set on eating here, it's best to make a reservation.  My partner and I ordered the bruschetta to start and for our mains I got the veal parm (because I'm obsessed ATM)  and my partner got the chicken cacciatore.  The bruschetta looked great in presentation, however; there was just something missing.  My partner agreed.  There was something in the taste that just didn't give it the full bruschetta taste.  I've definitely had better.  The mains took a bit of time to come out but the bruschetta held us over. My veal was a generous size along with the chicken cattiatore.  I could not finish my meal, but when do I ever? lol I tried some of the chicken cattiatore and it was actually really good.  Might actually have been better than my meal.  The servers were very friendly.  I might return as their menu is very extensive with lots of things to try.  Also note, the menu online does not reflect the same prices in the restaurant menu.  Perhaps they've changed their prices or the menu online is a take out menu."}
{"text":"Although a very tiny place, so be sure to make reservations the food here is superb!  So many choices of menu items and everything we have had here is great.  We have recommended to a number of friends and everyone loves it!  Streetsville dining at its best!"}
{"text":"Made a booking for 7:45 - did not get seated until 8:05. The waitress made it seem as if our booking had not even been made by the way she was speaking to the other waitress behind the bar. We were finally seated, however, with no service (zero water, acknowledgment, even bread). By 8:40 we had received no service and left. We had been to andiamo before and had a pleasant experience but this was ridiculous. Andiamo - either hire more waitresses or acknowledge your guests, a simple apology would have sufficed but my partner and I were completely ignored. Very disappointing."}
{"text":"Food was excellent. We had the Cannelloni and Veal Marsala. Tasted great. I've had these dishes before in other places and this was one of the best. They need to change the lighting to make it warmer and more inviting but other than that we had a wonderful time. Staff were super fun. Good convo and the owners are great. Everything is reasonable priced including the bottle of wine. These people know their stuff. Will go back again for sure."}
{"text":"OMG!  This place is so good.  I came here the other day for lunch with some coworkers.  The food is really super good.  I super highly recommend the butternut squash agnolotti and the lobster ravioli.  I'm not sure why this place isn't super packed always.  but it's great.  and totally worth trying (and it was pretty reasonably priced too).  the lobster ravioli was either $14 or $16, and the butternut squash agnolotti was $12.  I was stuffed on one entree."}
{"text":"This place was recommended by my friend long time ago. I have been wanting to try it out but they were so busy when I called for the past couple times. Today, we were lucky they had a table for 2! Yabiiii  I have ordered vodka penne smoke salmon. The sauce was very creamy and very flavourful. You dont see a whole piece of salmon in the penne. I believe they cooked the sauce with the salmon together, the salmon was already blended into this creamy sauce. Even so I could definitely taste the fish.. it was truly an amazing dish.   My husband ordered spaghetti bomba. The menu says \"very spicy\" besides it for us it wasnt that spicy. This order was very very garlicy...people who love garlic would definitely enjoy this dish.   I enjoyed both, husband liked the penne better! One thing to mention here...I am pretty sure the bread was ordered from outside, it was not made in the house-I was hoping for a different, a more unique kinda bread but it was just a plain white bread.   The service was decent, it is a small restaurant. They sat us at the very end close to the kitchen. It was hard to get them when we needed something.   For food- 4/5 Services-3/5 Pricing- 3.5/5 I thought it was a little expensive. Penne was $19. Spaghetti was $18"}
{"text":"We phoned in our order for pick up and were told it would be ready in 20-30 minutes. We were going to pass it on the way home so we just went straight there and arrived 15 minutes after our phone call. The restaurant was almost full.....so great to see a local business doing well. We waited for our order for another 20 or more minutes. They said the delay was my gluten free rice pasta which had to cook longer. Hubby ordered garlic bread with cheese and actually got a lot. They also gave 3 slices of fresh bread. Hubby had the spaghetti and spicy meat sauce, I had the gf pasta with arrabiata sauce (which is vegetarian). The pasta was still hot when we got home and tasty. The restaurant itself is small and has limited seating so make a reservation if you wish to dine in."}
{"text":"Absolutely great food. Went there as a family last night. It's a hidden gem in streetsville. However, service should be improved to keep up with the orders during peak times. The 3 girls were struggling to keep up with the more than 30 customers. Probably they should expand and take a couple of more staff. I am sure they will succeed even more that way."}
{"text":"The Penne al Pesto had a subtle initial taste but I found myself enjoying it more and more as the meal went on. Bread was provided prior to the meal but I wasn't particularly tempted by it's presence after having tried a piece."}
{"text":"If you drive too quickly you will miss Andiamo Pasta Plus. It has a small storefront and were it not for the lit \"Open\" sign in the window you  might not know it's there. It is located next to Mondello's.   However once you're inside, you will find this small space inviting and comfortable. And if you can score a four top for two, you will enjoy your dining experience even better.   The staff is friendly and Emma did a great job of introducing herself (it's amazing how many wait staff don't do that) and telling us a bit about the place. The Streetsville area has its fair share of Italian restaurants, the most popular one being Goodfellas. However I have always found that place to be a bit arrogant. And maybe it's because they're so busy and think they can do that, however Andiamo has none of that arrogance and the food is excellent.   We had the Osso Bucco which came with risotto and some veggies. The veal was very tender and the risotto, perfect. The veal piccata was also very good and the portions are also sizable.   The tiramisu was also excellent and certainly portioned large enough for two to share. If I had one suggestion for improvement it would be the bread. I don't know why more Italian restaurants don't have real Italian crusty bread, otherwise own as Calabrese bread. That would just make things a lot better.    I was very impressed with my first visit and will definitely go back."}
{"text":"10/10 would recommend. Love the pesto pasta. Small little restaurant in the heart of streetsville. Authentic Italian food, decently priced, good atmosphere. Been three times and would definitely go back again."}
{"text":"Hidden gem in Streetsville. Small Italian restaurant with limited seating and warm ambience. We tried the bruschetta, risotto, pasta, chicken in white lemon sauce and ravioli over multiple visits. Also must try their tiramisu  it's like a bite of heaven in your mouth. Enjoy!!!"}
{"text":"So I have driven by this place a hundred times and didn't know it was there until my girlfriend said we should try it out. I had gnocchi  with the cream sauce and my girlfriend agnolotti and we shared some garlic beard with cheese. The gnocchi was just the right texture that I was looking for and the sauce was a great addition. My only issue was that there was too much sauce on the gnocchi, I ran out of beard really quick and had to leave a lot behind. The place isn't that large so it can fill up quickly on busy nights.   Warning they don't do free refills on sodas so if you order more than one you will pay $2.50 for each."}
{"text":"Breaks my heart to rate this place 3 stars. However, it is mere based on the service. The food was delicious.  Like many others have stated it is a small place and should definitely make reservations to avoid waiting. A buddy of mine and I were around the area and decided to test our luck and to our avail we were able to seat right away on a Wednesday night around 7PM.  Pros: Delicious food (5 stars for taste). Can definitely tell the pasta sauce was homemade done the right way. The pasta was cooked perfectly al dente. Bruschetta was soft yet tasteful.   Tip: If order the Bruschetta and want bread as well you have to ask otherwise they will not give you bread.  Cons: Service was dreadful. Had to ask every time for more water and did not notice once that our glasses were empty. After asking for the check, waited an additional 20min before it arrived. Finally, waited an hour for our main meals to come and 20-25min for a salad and bruschetta as an app.  Good food but bad service."}
{"text":"I was very excited to try out this place due to all the positive reviews. I was going to take my mother out and she was excited for it as well after seeing the pictures online. We arrive at the restaurant and it was quite busy. We waited until the hostess came. She greeted and told us that she did not have any tables available as they were all reserved. There were 2 visible tables with the reserved sign but the third one that was at the entrance did not. Trusting this hostess, we left but as leaving a couple behind us said that also don't have a reservation but suddenly were seated. This was unprofessional and disrespectful as the hostess could have called us back but she proceeded to seat the couple as we exit out of the door. The hostess clearly was too busy to just seat whoever and not pay attention to the quality of service."}
{"text":"I have no idea why Andiamos insists on seasoning the life out of every pasta dish. It's pseudo Italian food on MSG.  Only reason why I'd +1 star is sometimes we'd get really friendly service.  The sauces are very heavy and obscenely salty (even when we asked beforehand for reduced-salt) They may taste good on the first bite, but 1/3 through my pastas here and I have to stop eating. I usually feel bad after eating here, extreme dry mouth.  The gnocchi is AWFUL- mushy and grainy, it was definitely store bought and sitting around for a long time.  The manicotti was nice but has the same issue with the sauce being way too salty.  The pesto penne was too garlic-y but otherwise decent.  The veal parmigiana was decent, but came a much smaller portion of pasta than it usually did. We suspect it was because another table had complained about their pasta and the kitchen had to do a quick re-fire- both pastas were penne so we think they just took some from our order.   On two separate dinner occasions (one was a birthday) we wanted to order tiramisu but were told that it was not ready- keep in mind it was around 7pm.  I have been here six times in the last year and  the quality has gone downhill each time. My family and I will not return."}
{"text":"This is my favourite pasta place. The pasta is so fresh and saucy. The pana cotta for dessert is freshly made. Love!"}
{"text":"Went here mid-afternoon and was the only one in the place! Chatted with the owner and found out he actually did his training in Italy, and Germany I think. He was extremely friendly and when I said I was too full for dessert he brought me out a delicious tiramisu on the house, saying he couldn't let a first-time visitor leave without dessert. The menu is huge, and I mean huge. I had the shrimp appetizer, which was amazing and very rich. Then I had the veal ravioli for a main. The sauce was great but the ravioli seemed processed and nothing special. I love homemade ravioli because the filling can be so flavourful. Anyway, if you like pasta, I promise you will find something on the menu, because, as I said, it's huge. They also have gluten-free pasta!"}
{"text":"I love the pasta here! Big portions, great tasty food. I would highly recommend this place for a nice dinner Date. I would also recommend to make reservations first because they get full easily. Also during busy hours, the food service may take longer than usual but the food is worth it in the end!"}
{"text":"I have been here a couple of years ago. The food is equally delicious, however this place sure became popular!  Tight cozy restaurant. Make sure you make reservations. Or you'd end up waiting and drooling all over other peoples food. Great place to bring friends and family.   Friendly service. The staff were running back and forth to ensure all tables were looked after.   Food was good. It was a busy night, it took some time for the waitress and for the food to arrive, it was worth the wait. I normally don't like gnocchi, idk what possessed me to order the spinach gnocchi. But it was delicious!"}
{"text":"Waiters be runnin back and forth. Tight dining space. Food tastes salty. Service? Mehhh. Disappointing when servers kept goin fast pace up and down the hallway that's pretty tight already. Plus, can hardly get a hold of any of them.  In terms of food, we ordered...  1. Zucca Pasta (butternut squash agnolotti) - $16 Decent amount, decent taste, but salty. Probably because of the bacon?  2. Lobster Ravioli - $19 - generous amount of lobster chunks inside ravioli, but salty as well.  They give complimentary bread which was nice. Would I come back again? Probably.. I wanted to try their risotto & other pasta."}
{"text":"I didn't even know this place existed until my brother told me about this place. He's been a few times before and raved about the food and thought we should go together as a family for dinner. We had reservations for 7pm on a Thurs night and it wasn't busy. Right around 730-8pm was when it started to get super busy. The restaurant is quite small and can get a little crowded.  Service was great, we asked for recommendations and he suggested what was good and we ended up liking our plate.   We ordered: Regular Bruschetta Lobster Ravioli  Penne al Pesto + chicken Chicken Parm Coffee x2 Tiramisu  I was debating between the regular bruschetta or the one with cheese but I opted for the regular one. It tastes different from other places I had bruschetta from - a good different. The bread was soft yet toasty and it was STUFFED with lots of tomatos with extras for flavouring. It comes with 4 pieces. Next time I'd try the bruschetta with cheese.  My mom ordered the lobster ravioli and I'm not a fan of seafood but I tried it anyways. There was a strong seafood smell but the ravioli didn't taste seafoody at all. Sauce was creamy and the portions are big. My mom said this was not bad but felt like there wasn't enough lobster pieces in it.   I got the penne pesto and I really enjoyed this. At any other italian places, I usually order anything with pesto and chicken so this was my first thing to try. They aren't skimpy with the protein portions either. I had enough to pack as leftovers for lunch the next day! My fav part was prob the amount of flavour the pasta had in it. I love pesto sauce so this is a plus. If you look closely in the pic, theres some nuts in it as well and it wasn't hard nor soft. Good texture so it adds a bit of a crunch in each bite. The sundried tomato I was okay with. Some pieces were too big and hard to chew, but the smaller pieces were fine.   My brother got the chicken parm and he said the protein portion got a lot bigger as compared to before. He gave me a piece to try and the meat was soft, juicy, and tender. The tomato sauce penne however, tasted very generic. Nothing close to the other 2 dishes we had ordered.   Coffee was good and strong.  Tiramisu was OK. It tasted really moist and the bottom seemed too wet that the cake kinda broke after the fork cut it.   I would come back to try other dishes. There's a whole lot on their pasta menu!"}
{"text":"It's been at least a year since I was there, but I didn't forget the delicious food, including the tiramisu (I think my Italian friend was that it was one of the best he tasted)."}
{"text":"Awesome. So delicious! They have veal chicken and seafood. Unassuming storefront and yet very good waitstaff.  I tried veal marsala which is served with veggies and potatoes. Ran out of potatoes so was served gnocchi instead.  My experience here is 4/5.  Check them out!"}
{"text":"Authentic Italian Food. The chef was nice enough to add rissoto to my veal shank. My go to place for Italian food"}
