{"text":"Friday night fish fry turned out to be disappointing. We got seated right away, but food took a long time to come out and wasn't hot. The sandwich was an average size, but was only served with one small side of haluski or coleslaw. When I asked to buy another side of coleslaw, server said we couldn't, but was able to charge me for the extra tartar sauce I ordered...Very disappointed."}
{"text":"Our family and close friends love Greek food and frequent several Greek Restaurants all across Pittsburgh.  NEVER and I mean NEVER have we been charged for pita bread with our meals!  To all of us it was very cheap way to run a restaurant.  NO other Greek restaurant has ever charged for pita bread.  Even if you would ask for extra (Alladdin's - all locations ) they will gladly bring you more and not charge you .75 cents for one pita quartered.     Also their portions for dinners are very small. All four of us were surprised and still hungry.   Told all of our friends and four of them had eaten there ANC felt the same.  Don't nickel and dime your patrons Andros. When I asked the owner a lady she said yes they do charge for pita ANC didn't think there was anything wrong with it.  Won't be back. Too many other places"}
{"text":"This is a fantastic place place eat.  The Gyros and Zeus burger are incredible.  Finish it off with a baklava sundae...."}
{"text":"First of all, my experiences at Andros have been amazing. After reading some of these negative reviews on here, I will admit I was a bit nervous. But now I have to wonder- did these people go to the same restaurant? I have ordered different items every time- chicken, fish, gyros, salads, etc. Every single time, and I mean EVERYTIME, I have had a wonderful experience. The portions are very large and filling, and their homemade Greek dressing is fantastic. The warm pita served with the salmon salad is the perfect touch.   The owners are a husband and wife and they are absolutely lovely. My waitress was amazing and we brought our own wine and had the perfect,  romantic evening out the last time we went. The ambiance is warm and relaxing and really made me feel like I'm on vacation (but not in a tacky, touristy way).    I hardly ever post reviews- more often than not I will admit if I DO post a review it's because it's a negative one-but I felt it was my personal obligation to post an honest review that reflects my positive experience. I am happy to see that there are a lot of positive reviews on here and I am glad to see others who are just as excited as I am about this local business!  I personally love to support small, family owned businesses and dislike big chain restaurants- I will definitely be back to Andros again. If you are reading some of these reviews and are wondering whether or not to try Andros- do yourself a favor and check it out for yourself- and while you're there try the Baklava- it's the absolute best I've ever had!"}
{"text":"This place is a gem! It has a cozy, homey cafe feel to it, with a menu full of surprises ranging from casual to upscale. Following the lead of other reviewers we tried the grilled octopus, which was amazing. The texture and flavor exceeded my expectations- so deliciously tender and flavorful. The Zeus burger is delightful. The lamb is perfectly seasoned and if you have them cook it medium (not well!) it will be perfect. It's a big burger!!   The owner is very involved in dinner service and it's just a really pleasant place to eat. I can't wait to go back- heck we will probably become regulars!- because the menu is huge and has so many appealing options."}
{"text":"The gyros here are amazing, definitely the best around.  My husband and all his friends love the lamb burgers.  We have yet to try any of the other dinner dishes, but do get a different appetizer every time we come.  The desserts are really good as well, especially the baklava sundae.  The prices are a little high but you get a lot of food for what you pay for.  The service is always excellent as well."}
{"text":"I know Greek food well and Andros does a fantastic and authentic job. To the poster surprised about the cinnamon....Greek cooking uses cinnamon in most dishes. Found it funny that was mentioned as a con. Really due to unfamiliarity. They prepare moussaka as it should be prepared.  Highly recommend this restaurant if you are interested in delicious Greek cuisine."}
{"text":"This food was delicious! And the staff was extraordinarily friendly. Those 2 things alone give it 5 stars. Additionally, I am a vegetarian and there were no shortage of options. I ordered spanakopita, grape leaves, and a village salad. Everything was great - and it came out super fast. My parents both ordered the stuffed cabbage - not only did they love it, but the portions were huge! Great value for the money. Highly recommended!"}
{"text":"Fantastic Food! Great Service! Athena has been our waitress twice and she is very attentive and very pleasant. We have been here maybe 7 times and the food is always great, the staff is always friendly and it is the perfect amount of busy.  The homemade grape leaves have a nice flavor, the delicious pitas are served warm and go perfectly with humus. The souvlaki is very good. And my husband gets the Greek chicken salad. The baklava is homemade and fantastic! I haven't tried the baklava Sunday, yet, but I have heard it's amazing!"}
{"text":"This is probably my favorite lunch spot in the area. First off the portions are generous. I have never left this place still hungry. My usual is, of course, the gyro with fries. They do a good job of slicing the meat just right: not to thick, not lunch meat thin. Also I eliminate tomato from mine and they always get it right. As a guy who does not like tomato, I wish I could say that about more restaurants. The Zeus burger and gyro solid bets as well. On the rare occasion I think I can fit it end, I wrap up the meal with some baklava.  Nothing I have had here is ground breaking. That said, the food is great, the service is friendly, and my coworkers and I walk way happy every time."}
{"text":"Came here tonight for a late birthday dinner with my wife. We were the only car in the parking lot on a Saturday after 5pm. More people need to know about this place! I tried lamb chops for the first time. They were tender and delicious. My wife had the day's special which was an amazing 5 cheese macaroni and lobster dish with warmed pita on top. Very creamy and big chunks of lobster throughout. I had a taste and am very much looking forward to the leftovers we brought home.  Finished the meal with the much anticipated baklava sundae. What a great ending. Every dessert is homemade and I'm working on eventually trying everyone. If you like very good Greek food at reasonable prices, get there soon."}
{"text":"Friendly atmosphere and good food.   I'm from out of town and visit family and have gone here the last three times.  Wait staff is very knowledgable and friendly.  Glasses never got empty and food came quickly but without rushing us.  I had the stuffed chicken one time and the lamb another.  The food was not great but is very good for the price and let's be honest this is not fine dining it is a friendly, comfortable place to eat with the family. In that respect, andros fits the bill.  I will be returning on my next trip."}
{"text":"For those of you who live in and around the Irwin area, you know that Andros (the new Greek restaurant) used to be Rey Aztec, which used to be Los Campesinos, which used to be Rax.  My husband and I decided to try this place out Saturday night. My review is middle of the road, and here it goes:  Pros: The restaurant and bathrooms were clean and our waitress was friendly. The food was good. I had a chicken gyro and baked lemon palatas, which are really potato wedges with a little seasoning. Both were delicious. My husband had the Moussaka. It came with a nice-side house salad, and he liked both very much.The Moussaka looks sort of a like a lasagna, but is a mixture of eggplant, potatoes, beef and some type of sauce.   Cons:  I sampled some of the Moussaka, and I thought it was rather sweet for a dinner...it wasn't a dessert, after all. We guessed it had cinnamon in it and when we asked the waitress, it  was confirmed. Just think that maybe that should have been stated in the menu. It does say it comes with a \"creamy bechamel\" sauce, which may somehow mean \"sweet\" but the average person wouldn't know that.  Also, the food is over-priced. Our bill was $30...a gyro is $7 which is okay but the palatas were $4 and you get like 8 wedges. The original Andros started in McKeesport and I'm thinking that these prices wouldn't fly there, not to mention a small place on route 30 in Irwin. Also, I love having iced tea when I go out to eat, but I asked and it is not fresh-brewed. It comes from the soda fountain. My husband got it anyways, and it was gross.   The place was uncomfortable and the tables were too close together. No booths. The couple that came in and sat down next to us were too close for comfort and the gentleman literally had to move over so I could get up to use the restroom.  Lastly, I do have to mention that the staff all were friendly and on top of things...which is why I am giving Andros 3 stars. There was a couple with two kids (I'd say 10 and 12) two tables down from us. Since we were so close and the mom was loud, it wasn't hard not to hear the conversation. Basically, she told our waitress that it was unacceptable that they didn't have more \"kid friendly\" menu items and that, for that reason, they would not be coming back. She said, \"all you have is stuff my kid won't eat\". The waitress pointed out that there is chicken and french fries, salads, etc. The mom said \"like, don't you have pizza?\" Omg...it took everything I had not to say something to this lady. I mean, this isn't fast food lady! She said her son was picky and wouldn't eat anything on the menu. Well, it is a Greek restaurant...ugh! The waitress handled herself very well and tried accommodating the family to the best of her ability, although it was probably because she was a little intimidated by the woman. Regardless, bravo for handling the family like a champ!"}
{"text":"My mother and I decided to try something new for dinner.  Andros is close by on route 30 in Irwin so we went there.  The atmosphere in the restaurant isn't far removed from when it used to be Cozumel not long ago.  The inside could use some cleaning up (the bathroom wasn't terribly clean, the seal in the windows is broken so condensation hampers your ability to see outside).  The staff is very friendly and we were seated soon after arriving.    The menu was very appeasing and had a variety of interesting options on it.  My mother went with the crab stuffed flounder and I had the Greek pasta with chicken.  The meals came with a Greek salad and the feta cheese was the best part of it.  The meals were OK, nothing too great for the price.  The crab stuffed flounder had pieces of crab shell in it that was kind of a turn off and the fish was a tad bit overcooked and dry.  The pasta was filling but unfortunately most of the flavor sunk to the bottom of the dish which was very top heavy.    I'd be willing to give this place a second try sometime down the road.  I think it has a lot of potential to be a good Greek restaurant in a place that doesn't have much option for Greek food. The desserts look really good, and the menu reads really well but for now this place just doesn't cut it for me with the food."}
{"text":"I really like this place! Local and usually fast service.  I've had their gyros and gyro salad, both of which I really enjoyed. I loved the pita bread that came with the gyro salad.  It's a lot of food though, so make sure you're really hungry.  I also have had their grape leaves and an artichoke chicken dish for dinner.  Both were equally as excellent.  The waitresses are friendly and service is generally fast, like I said; the promptness seems to depend on how busy they are, I guess."}
{"text":"Dinner at Andros Restaurant this afternoon was a \"Herculean\" disaster!  I cannot in good conscience recommend this place to any sensible person.  I departed this place saddened and nineteen dollars poorer.  What is worse, is the fact that I have driven past this place for a while, and have grown more and more excited about it, even expressing to the greeter that I'd \"dreamed\" of trying it.  The disappointment began with the delivery of the meal.  The salad, known as the \"Andros Salad\", was bland with a standard bagged greens mix with two abused cherry tomatoes and two Kalamata olives, an ENORMOUS slice of cucumber that someone attempted to cut with a dull knife, along with a stamp-sized square of flavorless \"Feta\" cheese.  To coat this \"fresh\" salad, I discovered the \"Greek Vinaigrette\", or, \"small container of oil.\" No flavor...I didn't need Cassandra the Seer to tell me how this meal would turn out.  Now, the pita bread that I ordered for an additional dollar had some flavor, and was surprisingly warm, the highlight of the meal.  For the main course, I ordered the Chicken Souvlaki.  Now, the menu asserted that the chicken was \"marinated\", but in what I'll never know because I could not discern a flavor.  So, for fifteen dollars, I received two skewers of \"grilled, marinated chicken\" on them, with no flavor, and absolutely nothing remarkable other than the level of blandness and the price.  This meat was not grilled, but seemed to be baked, and it was certainly not marinated.  I salted it twice to give it flavor, even going so far as to put the slice of lemon from my water onto it just to revive it.    Moving on, this meal was described as, \"...served over a bed of orzo or rice pilaf & grilled vegetables.\"  Sadly, this was not to be, and it was a \"Thermopylae\" of a disappointment.  Instead of a \"bed\" of orzo, I was treated to a lukewarm pasta salad reminiscent of what is served at picnics and what can be purchased at Giant Eagle or Shop n'Save as \"Greek Pasta Salad.\"  It was lousy.  Now, the description claimed it was, \"chilled, rice-like pasta in chicken broth with fresh herbs, vegetables, and & feta.\"  If this were true, it'd be a meal fit for Olympus.  Instead, I received two table spoons of lukewarm pasta, no vegetables in sight, absolutely lacking in any herbs or feta.  The vaunted \"grilled vegetables\", described as, \"delicious vegetables grilled & seasoned\", was instead a lukewarm mixture commonly served as a side dish at Eat n'Park, with such delights as green beans, wax beans, some very soggy baby carrots, and broccoli from the days of Leonidas.  These were not at all grilled, but rather steamed, but hey, the waitress didn't seem surprised when I commented to her that the vegetables were not grilled but steamed.  In fact, she seemed blase about it, as if she had heard this complaint before.  Still, nobody came to check on the diner, and instead, the dreadful fifteen dollar disappointment continued.  Closing the meal, the waitress, possibly sensing my lack of enjoyment, proffered me a dessert menu, but since the meal was such a let down, I did not want to grant Mr. Andros any more of my money.  No, I merely paid for what I had and left a tip.  Oddly, the hostess that greeted me with happiness when I was talking about how excited I was about the meal, was hesitant to even ask me how I enjoyed it.  When I told her that it was not too good and lacked any flavor whatsoever, she encouraged me to give them constructive criticism.  But then again, whenever I tried to make eye-contact with the two people schmoozing with the tables, I was ignored.  I was relegated to a tiny corner table, and was soon barricaded in by a table of two loud families.  Note that it was not the kids who were loud but rather the parents, and soon someone who seemed to be an owner and who earlier was telling a guest about how they'd like to keep the business in the family, came over and gushingly greeted this group, telling the \"youngin's move to the back.\"  She then had a long conversation about her love of wine coolers, stated some tale about the time she received the carbohydrate count from a  beverage company when it was not listed, but nothing to the person sitting at the table clearly not enjoying the meal.  So, as I started my Odyssey home, I left hungry, I left unsatisfied, and most of all, I left nineteen dollars short.  I will never, ever return here, and I will never, ever recommend this place to anyone, not even Darius the Great."}
{"text":"Best gyro on Route 30! You can't go wrong with them. They were great years ago when they were in McKeesport and having been open for a while in North Huntingdon their quality has not changed. If your order their gyro you won't leave hungry."}
