{"text":"On a busy Monday night, Half off pizza, dine in only, they don't make much of an effort to seat empty tables. They wait 5 min. for people to respond to a text, instead of actively seeking out waiting customers. This causes everyone else to wait longer while staring at empty tables. There are plenty of other pizza restaurants in Lakewood. Skip Monday."}
{"text":"Angelo's Pizza is the kind of pizza place that leaves a lasting impression on you. Just today I was randomly thinking about how nice it would be to have some of their pizza! I have never eaten in the dining area, but have ordered to-go many times. Their pizza is just so good, you'll keep coming back for more!"}
{"text":"Angelos. I went back again last week. You have to search far and wide to get better za in C-town area. I have been going here since I worked next door at Lucas auto as a Junior at St. Eds when Angelos was a small take out in the attached building.   Never did a shift go by without a meatball sub or Sausage, onion and pepper ring za.  I only mention that history because although they have moved a few doors down into the old hardware store, the food is just as good as it ever was.   The location on Madison has a small number of seats and a great people watching front outdoor patio in the summer. They have beer and wine and for those in the area they will deliver beer with your pizza late into the evening. This was always an appreciated feature when I lived in Lakewood.   The aforementioned meatball sub is a great combination of perfectly spiced broiled meatballs with sweet (but not overly) marinara covered with melted cheese all tucked into an Orlando sub roll. A simply but wonderful treat which I still crave.   The pizza must be ordered as the \"deep dish\", no exceptions. I have taken many people there for the first time and make sure to watch them taste the first bite. Always amazed that they never had Angelos before. The \"deep dish\" has a wonderful crispy buttery bottom crust that at first glance seems very curious. One bite and its over. Truly a unique taste and texture yet always delicious.   Favorite toppings are meatball- try it they are not as greasy as sausage, onion- always fresh tasting with slight crunch and pepper rings. They sell so much Za here everything is fresh always.   My kids will eat a lot of places pizza but I only eat at 3 places and this is tops on the list.  Search this place out and if doing take out order ahead or you will wait the 20 minutes at the small bar area."}
{"text":"Pizza is not bad just way overpriced for what it is. Service not great wait for food was a good amount of time. Ordered deep dish and was brought a traditional style. Then they tried to pass off a thick crust pizza as a deep dish on me cuz they screwed up my order. How pathetic. Will never go again. Just not worth it. Can find better pizza elsewhere for cheaper. 2 stars is being generous. ."}
{"text":"Very overrated pizza place, someone should investigate their grease traps because I feel they ladle that shit on their pizzas before cooking them, like seriously you could fill a soup can with the grease from a small pizza"}
{"text":"Stopped by on a humble to kill some time, have been wanting to try this place forever but since it is clear across town i had not had the chance. However yesterday was perfect, our server Jamie was great, pizza was delicious and come to find out you have the pizza partially cooked and finish it at home, clear across town and enjoy it just as you would there. Awesome, will definitely be back!  Another great date day w/ the hubby thanks to Julie and Jamie, not only is the food amazing but the service is top notch as well, well worth the drive from Lyndhurst, i even made a new friend... lol call me Julie"}
{"text":"We like Angelos for the most part - they usually have generous toppings - what we don't like is the random way they slice the pizzas- some large - some like slivers - it's weird. Their prices are a bit high. I actually can't stand when they answer their phone and it's so loud you have to shout your order. They have very large portions when you order the fries, and the chicken is good when it's \"fresh\" and it's not expensive. The servers are usually not friendly either... Wait, why do we go there?"}
{"text":"Very busy but worth the wait. Family orriented with a bar; lovely waiters. A place to be."}
{"text":"Damn fine cheese and pepperoni pizza, albeit a little pricey but you're definitely getting what you pay for. I especially enjoy the potato specialty one they have, definitely worth a try!"}
{"text":"Deluxe pizza was awesome.  Nice craft beer selection.  Staff was friendly and I really enjoyed the laid back atmosphere and good service!"}
{"text":"We ordered a family size vegetable pizza this was the 2nd time we have had this pizza from them. It is the best vegi pizza I have ever had it is piled high with fresh flaver full vigis that are diced just right"}
{"text":"Angelos doesnt even need a review. Their food speaks for itself. Has and always will be the best"}
{"text":"Best pizza on the West Side of the CLE. The current management of Angelos has been at it for years and knows its stuff.   (The restaurant itself has been there for decades, except that a couple decades ago someone else ran the place and the pizza was not so good as it is now.)  The crust is excellent - not too thick and not too thin - similar to the family-run Italian pizza place of my now-distant youth that operated elsewhere in this neighborhood many years ago.  The slices are cooked just crispy enough not to wilt in your hand, without being either too crispy or like a big piece of bread with tomato sauce sittting on it.  The fresh ingredients are so much better than the gunk served at  all the chain places that taste like everything came out of a vat.     Angelos is very popular and tends to get very crowded, including its outdoor patio on nice nights.  It really draws across all demographics - hipsters, jocks, families, foodies, everybody ends up at Angelo's at some point in time.  You can get it delivered or get it to go if you don't feel like eating in and dealing with the crowds and possible wait for a table.    They apparently serve things other than pizza - however, given that this place is known for its pizza, why would I want to go there and order anything else?    Only minus of this place (not worth deducting a star since many Lakewood businesses have this issue) is the lack of parking on busy nights.  This joint needs its own big lot.  I can generally find a place within a block or two, but as this isn't a busy area after sundown, the hike to and from the car can be a bit dark and drear if you're by yourself."}
{"text":"Seriously the best pizza in lakewood, and probably on the west side of cleveland.  My family has been eating it for decades, and will continue to for years to come!"}
{"text":"It feels weird to disagree so many who have reviewed Angelo's before me, but I just have to.  I have had Angelo's pizza several times since moving to Lakewood (always delivery, I should note that I've never eaten in) and I am yet to be impressed with the pizza.  I have tried a few specialty pizzas (the Margherita (side side note, there should NOT be red sauce on a Margherita pizza) and the House Special) as well as some standard favorites (like banana peppers).  Each time I want it to be great, it keeps coming up short.  Now, I love pizza, but for me Angelo's falls in to the Pizza Hut category...not worth the calories...especially at Angelo's price.   Let the hate mail ensue."}
{"text":"This pizza is rich and flavorful; it's what I imagine the perfect pizza tastes like. They run a great dine-in deal on Monday (all pizzas 1/2 off) but be prepared to wait an hour or more for a table because everyone in Lakewood loves this place and knows about the Monday deal. Other nights eating there is a pleasant experience but I feel like pizza is more of a takeout-and-eat-on-your-couch-in-your-jammies sort of food and if you feel the same, Angelo's is also great for takeout/delivery."}
{"text":"I have been coming here for quite a few years. The food is good... when you can actually get what you ordered. I've stopped ordering pizza here because every single time I do, they screw it up. So by the time I get my new pizza, a half hour to forty minutes have gone by and everyone else I am with has finished their meal.   Not only do they screw up orders, the seating is an absolute joke. Multiple times have I been with a party of four or five and we are the last ones being seated. I understand that larger parties are harder to seat, but when a party of two just walked in after my party had been there for forty minutes, gets a table that can sit at least five, it gets me and the people I am with pretty peeved.   Not only has this happened to me, but the last time I was there, there was a party of two who had been there just as long as I had (over an hour, when we were told 25 minutes), who were visibly annoyed. In walked a couple and they were seated right away.   After speaking with the manager (James, I believe), he was incredibly nice and apologetic. I did not complain to get free food and I made sure to tell him that. I do not think that it's the managements fault, but the hostesses, but who knows.  I can safely say that I am done with this place for a very, very long time."}
{"text":"Was in town for a day and based on the other reviews I decided to check this place out.  The pizza was good,although pretty traditional.  If thats what youre in the mood for, this place is good.  Had some ohio beer too, burning river or some such, that wasnt so great."}
{"text":"Over priced Pizza Hut. The only reasoned I ordeder Angelo's is because Jets Pizza in Westlake doesn't deliver to Lakewood and I didn't feel like driving. Ummmm its worth the drive. Better crust, prices, cheese and pepperoni and friendler staff.   I don't know what all the hype is about."}
{"text":"Great pizza i love it ! But unfortunately they don't deliver anymore to Cleveland which is very disappointing because there pizza was delicious guess i have to go hungry tonight"}
{"text":"This is by far the best pizza I have ever had, period. Angelo's offers an entire line of traditional and specialty pizzas. One of my favorites is the artichoke pizza or the more traditional, double pepperoni.  They also offer more than just pizza. You can get other traditional Italian dishes and dessert.  Angelo's is available through delivery, carry-out, or dine-in. For dine-in, weekends and evenings tend to be busier and they don't have a lot so you'll need to find street parking or ride your bike."}
{"text":"I am not sure what the hype is all about when it comes to Angelo's pizza.  The staff is friendly and do their best job for good service. Other then the pizza on the menu is mostly cheap bar food that is over priced .   When it comes to the \"award winning pizza\", I can not believe the hype about it. I don't know who rated Angelo's pizza to be the best in town , I would like to know why and how . please explain to me how cheap Sysco products and an inexperienced teenage kitchen staff can make the \"best pizza\"   for 20$ !? Especially when you compare Angelo's  to other pizza restaurants in town that  use real food with a professional kitchen staff. This makes no sense to me, if anyone knows the answer please contact me.  That is not an answer to my questions . How can cheap Sysco products and teenagers,make the \"best pizza\" . I also want to know who gave the award and why, with a logical explanation please."}
{"text":"This is the Best Pizza I have had in along time!!  Will be back again! It is kid friendly. I Took my little niece and she had her First Deep dish, and she Loved it!!!"}
{"text":"I know their specialty is deep dish, but this onetime New Yorker prefers thin crust, and I really like it here. Fresh ingredients, a good salad, pleasant service. I've only been here in the daytime on weekdays, so I've only seen the place with a light lunchtime crowd. I'm sure it must be incredibly busy at night, but I would consider the wait worthwhile. One of the best pizza places in Cleveland."}
{"text":"I was told Angelo's was the best pizza in Cleveland. I give it that. Not the best pizza I've ever had, but the best pizza I've had in Cleveland so far. So yeah, I'm a fan. The crust was crunchy on the outside and chewy on the inside, just the way I like it. The sauce was good, a little on the sweet side for my liking, but good. The toppings and cheese were cooked perfectly and were abundant on the pizza. No skimping there.  I have to say the bread sticks were tasteless. Not a fan. If it weren't for the prepackaged garlic butter and the marinara, they tasted like frozen, reheated bread sticks.  Overall, I would go back. It was enjoyable based on the pizza itself. I just don't think it lived up to the hype."}
{"text":"Arrived on a Tuesday and it was not very busy.   The waitress forgot to bring my drink sample and after 15-20 minutes finally brought it.  Once the pizza arrived we still had no plates and only half my party had silverware.   After about 5 minutes the plates arrived but no silverware.  Had to ask for silverware again, it arrived when we were half done eating.   Food (pizza) was ok (a bit too greasy for my taste) but service was horrible.  Will not go back."}
{"text":"Angelo's and Antonio's have hands down the BEST PIZZA IN THE US.  And i've tried a lot of pizzas.  The sauce ever so slightly sweet and the crust has a cool crumbly texture, like a muffin almost.  So so so good.  A real treat when i come home to visit."}
{"text":"I'll give this place 3 stars instead of 4, only because of people who think this is 4 star pizza.....  I asked a local about getting good pizza in Cleveland and he said Angelo's was the best.  I tried it and it was.....  good.  But that's it.  It wasn't amazing. It wasn't incredible. It was good standard pizza.   I mean you aren't really making a bad choice by eating here.  It's just not anything that will knock your socks off."}
{"text":"Best pizza in Lakewood. White pizza is amazing, dessert selection always kills it, and it's a great atmosphere for a local pizza place. Vegan hint: they have hummus!"}
{"text":"I remember picking up pizzas at Angelo's when it was in the tiny space next to the gas station, and I'm glad that they've expanded and remained successful, because they do make some of my favorite pizza in the greater Cleveland area.  Their sauce has a bit of sweetness to it, and the crust has always had a nice balance of crunchiness and softness, and somehow manages to remain enjoyable long after it cools.  I'm happy to see their new specialty pizzas, particularly the Margherita Pizza, which was delightfully garlic-y and tasted wonderful with the basil.  Their coupons, featured either on their website or through outside sources, are a great bonus, but I'd keep coming back even without them."}
{"text":"I came here on a Sunday afternoon. There was a bit of a wait so my party ate at the bar. We order the spinach dip. It was so rich, decadent, creamy and awesome paired with fresh out of the oven pita bread. YUMZ! Oh yes, and the pizza... We ordered the Chicken Alfredo pizza. Also delicious. I must admit that the spinach dip was the star of the show, however the pizza was great too! The deep dish crust is buttery and yum yum. I will definitely be back (not on a Sunday though i.e. Ohio liquor laws)."}
{"text":"Seafood pizza with regular crust is the bomb!!!!!!!! We always have them make it well done since the sauce is  pretty juicy (which is the way to make it). The double cheese and pepperoni is our 2nd choice when we are really want a lot of salt but sometimes we try to eat a bit healthier and we'll get a loaded veggie pie with extra mushrooms. I wish they !made a chicken and white garlic sauce with spinach, mushrooms, black olives broccoli and red onions. Do they ever have any way to hold some kind of contest to try to introduce new  recipes? I love just about the entire menu but sometimes you are not sure you want the same old same old 'za that we have all the time. Still the best in town!!!!!ยก!ยก"}
{"text":"New to the area we are looking for places to frequent on an ongoing basis. This will not be one of them. I do not see what all the hype is about. The pizza was a little above average but not great. Crust was greasy. Prices are high for what you get. Their large pizza is a medium at most places, the X-large is a large. Expect to pay 20.00 for what amounts to a medium pizza. Danny Boys in Rocky River is priced about the same but much better. My wife ordered the chicken parmesan dinner. What a joke. A round mystery meat chicken patty that was burnt. Not just a little it was dark brown and dry. How the kitchen sent this out is beyond me. Will try again on pizza. Hopefully the greasy crust is not an ongoing problem."}
{"text":"Oh my lawd!! The crust...there are simply no words worthy of describing it. Easily the best pizza in Lakewood, maybe even in Cleveland.   This place is on the pricey side, but worth the splurge every once in awhile."}
{"text":"As always the pizza is awesome.  Chicken cesare salad can't be beat.  Good draft selection."}
{"text":"So, this place wasn't bad but i didn't like the sauce for the pizza at all. It seemed a bit too sweet for my taste. Maybe i am spoiled by all the pizza i was exposed to while living in NY for the past several years. who knows? BUT the redeeming factor is their spinach dip is NO JOKE, THE BEST!!!"}
{"text":"Just yes. A Lakewood staple. Make sure to order deep dish. Done-in service has always been good, and takeout is worth the wait."}
{"text":"we got pretty terrible food poisining after eating there the night before - I don't think their Cesaer salad is up to standards to say the least. Pizzacwas mediocre. Will  never visit the again despite the great reviews."}
{"text":"Angelo's has the best pizza in town. The crust is fantastic, toppings are awesome, sauce is not over powering. They deliver or you can dine in."}
{"text":"Angelo's pizza is the best in Lakewood by a long shot.  Be it dine in or delivery they are almost always on time and piping hot. The sauce is probably my favorite thing about this place, it's sweet and somewhat spicy and pretty much just perfect.  The crust is crisp on the outside and perfectly chewy on the inside.  If you live in Lakewood or rocky river and somehow have not tried Angelo's yet, you need to get on that asap"}
{"text":"Most amazing pizza ever... love it and miss it go there on Mondays and dine in for the most super deal ever... the philly cheese steak pizza is amazing and so is the veggie..."}
{"text":"Coming from Chicago, I'm always afraid to order pizza while traveling. Delivery was fast, food was hot. Ordered the deep dish pizza and everyone loved it. Great cheese, pepperoni, and Italian sausage. My youngest who is really fussy ate an entire order of fettuccine Alfredo. My family is already talking about ordering again tomorrow."}
{"text":"Angelo's has the best pizza in town. The waitresses are very attentive.  I have always had a great experience, even with delivery. All together the food is fresh, the staff is awesome and its super cute inside! Thank you Angelo's for being Lakewood's best-"}
{"text":"Hands down best pizza in cleveland!  Scene magazine says the same.  Get the Philly Cheese.  It's pricy pizza, but well worth it!  The crust definitely makes the pizza what it is."}
{"text":"We have ordered Angelos many times since 2001.  Things change and so has their food. Not for the better though.  After many years of not ordering, we decided we'd give it a go once more.  We got a pizza and chicken alfredo. The pizza crust and sauce is just okay.   The chicken alfredo tastes so processed.  I feel like the chicken has been boiled.  Not sure why it seems to have a rubbery texture.  The sauce, (i've never cared for it)probably straight from a jar.  The salad and roll are very fresh. For the price, the portion was generous but the taste just ruins it. We literally used to order once a week. Now we are lucky if we order once a year.  Angelos is very personable. They send us a Christmas card every year.  They should save themselves a stamp and buy some better quality ingredients and get us back to ordering once a week."}
{"text":"Good pizza.....I said good pizza, not great. Nice variety of combinations of pizzas. Definitely over-priced, but they have their reputation. It's not NYC pizza or even Chicago pizza. Enjoy it for what it is."}
{"text":"We went to Angelos yesterday  with high expectations  as we have every time we have gone since this is our favorite  pizza place. Their pizza is usually amazing since they use fresh ingredients and their servers  are always friendly.  Yesterday we ordered  our favorite  pizzas, the seafood pizza and our new favorite,  the veggie  pizza. I have recently  found out that I have severe  food sensitivities so I ordered  the veggie with garlic butter instead of their standard  sauce and with no onions, green peppers or tomatoes. Sad but true. I explained when ordering that I have a serious problem with  certain  foods and I was assured that wouldn't be a problem.  When we received  our pizzas, mine had onions on it which unfortunately wasn't discovered until I took a bite. We told the server who got the manager. She apologized and ordered another for me assuring  that it would be corrected. She said they were very  busy and the mushrooms and onions are next to each other on the line. When we were given the new pizza the server stated she made sure it was right but again it had onions on it!. The manager didn't charge us for our dinner and offered  to give me something other than pizza but by that time although  we didn't yell we were discussed and ready to leave.  I went home without dinner and we will think twice about going again."}
{"text":"Ordered Pasta w/ Meatballs from this Place and it was a F 'ing Joke . Not only did it come with ONLY 2 Meatballs ,but had no alfredo sauce in the dish at all. This and their service doesnt make up for the tast of the pizza."}
{"text":"I like Angleo's.  I didn't at first and I'm glad I've gone back to try it again because I've finally found my dish:  the three cheese pizza with pineapple and jalepenos added, deep dish.  I had their spinach artichoke dip the first time I went and frankly I'll pass on that.  It wasn't very good.  They make a nice little homemade chip, though.  Random, but tasty.  The place is pretty much always packed but it's worth the wait."}
{"text":"I mean seriously - their pizza is amazing. Buttery crust, cheesy goodness, delicious flavor. They have great appetizers, too. This is a great place to dine-in and really get that pizza-parlor experience. The employees are friendly and helpful. Prices are a bit high but you get what you pay for. I can't live without Angelo's!"}
{"text":"Best pizza ever! My wife and I compare every pizza we eat to Angelo's, needless to say, they all come up short."}
{"text":"Used to love this place when I lived in Lakewood.  Was excited to have it again. It was horrible. The pizza was so greasy it was next to in edible. It just dripped off the slices. I couldn't believe the cost but I chalked that up to it being so long. Definitely never going back."}
{"text":"Two words: Yum-May  Deep dish pizza with sausage and banana peppers.  Don't forget the online coupons on their site.    Pick up a 6 pack.   Heavenly bliss ...with grease spots."}
{"text":"BEST pizza!! I love love love Angelos! Recently moved to Cleveland and have been looking for a delicious pizza place! Angelos does not disappoint!"}
{"text":"This is a great place to hang out and have great food. If u get here on Monday's they have an awesome half off pizza deal but get there earily or be prepared to wait. the food is really good, the ingredients are fresh and the service is great."}
{"text":"It's mediocre in my opinion, but affordable and better organized than the competition.  The pizza itself is overrated.  The sauce is too sweet; it lacks fresh herbal notes that would make it genuinely worth going out of your way for.  The same is true of their salads, dressings and other entree offerings.  Nice neighborhood place but definitely not stellar."}
{"text":"I don't understand the hype surrounding this place. I like my pizza with a shit ton of sauce (only if it's a good sauce) and not a whole lot of cheese. The pizza had barely any sauce on it (the sauce was decent) and you know how when pizzas have a lot of cheese but after it gets cold it's just an inch thick coating of cold cheese? That was basically the outcome. I bit into it and tasted nothing but nasty ass cheese and grease. The pizza had some kind of dried grease on the bottom of it. The pizza overall wasn't the worst I've had, but it wasn't very good. The pepperoni tasted like salami. Will give a second chance again soon."}
{"text":"This is the best pizza, my husband and I get it at least once a week . Perfect balance of sauce and toppings.yummo"}
{"text":"I don't understand the naysayers writing negative reviews here... It's pretty simple, the pizza is awesome. I fancy myself a guy who knows a thing or two about pizza pie... Is there better pizza in Chicago? Sure. New York? Maybe/probably... In Cleveland? No... only thing that comes close is Geraci's.  Getting it to-go, or delivery, is a tad of a buzzkill but if you sit in the restaurant  and get it piping hot out of the oven, it's the best ever.  Parking is a bit of a pain but that's also part of the charm... Would you rather it sit in a huge parking lot in the suburbs in front of a Target?  No. Ignore the haters, savor the pizza."}
{"text":"Just went to Angelo's last night.  Wow what a good pizza.  I have had pizza all over the country and I still vow that they have the best.  All around the taste is unbeatable."}
{"text":"this is one of the best places to go for Pizza in Cleveland.   There is literally something on the menu for everyone, and I always try something different every time I go.  My roommate and I usually get our own small pizzas, because the pizza is still amazing as a leftover, and it doesn't get all soggy and weird."}
{"text":"This place has the best pizza. They offer 1/2 price pizza on Mondays.  I got a large veggie and pepperoni, it was amazing.   They offer two different crust. I highly suggest trying the pan pizza with a buttery bottom, it was so crispy and delicious.  I am giving them 3 stars due to slow service and the kitchen actually forgot to make one of the pizza that another person ordered at our table.  It took about 30 more minutes till we got it."}
{"text":"I love this place! I live in Parma and drive all the way to Lakewood just for pizza. No place comes close! Best deep dish pizza I've ever had ANYWHERE, and I'm quiet the pizza connoisseur. It also has a cool hipster bar vibe atmosphere. The food and drinks are a bit on the pricey side, but in my opinion it is well worth the price! I never complain about the bill, I'm always more than satisfied. I wish there were more Angelo's  than just this one. Actually life would be better if there were more pizza spots that were actually cool and served actually really good made from scratch pizza!!!"}
{"text":"Very good pizza! Looks like a cool place. We got take out and it was the first time so I can't attest to that. Very good. But they did forget our salad dressing. Which was sad :( but still good!"}
{"text":"Pizza is good, but for a pizza shop there meatball sub/sandwich is a joke...It is very small in comparison to there other food items and not all that good. The marinara sauce is a little too sweet for my liking also. I will stick to the pizza!"}
{"text":"We ordered the potato skin pizza I believe and it was awesome! I cannot wait to go back to try a different specialty pizza."}
{"text":"My wife and I stopped here on New Years Eve to eat after visiting her dad in the hospital earlier.  The place was jumping.  Crazy busy from the bowl games and parties.  Carry out was lined out the door, while eat in was busy but not as crazy.  We ordered an appetizer and some drinks and decided to split a pie.  The spinach and artichoke dip was amazing.  But about the time we finished we thought out pizza should be out soon.  We were told because of the carry out orders it would take a little longer than usual.  Ya well, turns out they made it but forgot to bake it and left it sit on the tray.  The manager came out and couldn't apologize more and waived the cost of the pizza since we were already eating And drinking.  Hey we can't ding them for that.  Things happen when you're so busy and they made it as right as possible.  Otherwise the food and service were great.  Complaining about the order wouldn't make it bake any faster and they did everything they could to fix it short of time travel.    I say give them a try, I'm positive you won't be disappointed as our pizza was well worth the wait!"}
{"text":"Im giving a four star review but it would have been five and I'll get to that later. I have been their twice and each time had the most stellar customer service. It goes a long way with me when servers and front of the house people are so friendly accommodating and completely devoid of attitude....it is rare to say the service was world class. The food is good, expect the pasta sauce to be a little sugary, the pizza is excellent, and salads better than excellent. What brought it to a four from a five for me was when I used the restroom there was an absolute assault on my nostrils....some kind of potent air freshener or pot pourri which nauseated me immediately. Smells and fragrances have no business being in a restaurant. A good business woman or man will know a part of the public is sensitive or even allergic to the chemicals in air fresheners and artificial fragrances like the ones in the ladies and men's room (husband told me his was outrageous as well). But if you want excellent service and fairly excellent food please go to Angelo's."}
{"text":"If you love pizza- and I mean REALLY GOOD pizza.... this is the place for you. Also, if you enjoy beer with your pizza- this is a good place. They have a decent beer selection. But the pizza is AMAZING!"}
{"text":"I've only eaten here once, so this might not be the definitive review. I know Cleveland raves about it being the best pizza in town, but I found the sauce inedibly sweet. I kept trying to eat it, thinking it would grow on me, but in the end the dog got pizza. Nice crust, nice toppings, but -- can't do sweet sauce."}
{"text":"So good! Ordered last night for dinner. I have gotten the caprese salad before it never fails. So fresh and an AMAZING portion for the price. You can taste the fresh basil and the balssamic is perfect. I also really appreciate how you can order and then pay with your credit card when they arrive. You dont have to read your credit card info over the phone they just swipe it upon delivery.  The pizza is great. I like the deep dish best and delivery is always fast and never a moment past what they tell you. Great pizza and great service deffaintely deserves 5 stars!"}
{"text":"This is probably the best pizza I've ever had.  They have probably the best wings I've ever had.  They even have some of the best salad I've ever had.  There's not much more I can say about it, except that I moved to Tampa and now there's not a pizza place anywhere that can compete with Angelo's.  I miss it terribly.  Granted, I've never tried any of their weirder combinations...when I went, I just got pepperoni and cheese, but it was more than memorable.  And as I said, I'd urge you to try their wings and salad.  Their ranch - wherever it comes from - is to die for, too.  If I make it back to Cleveland, this is the first place I'm going.  I'm not kidding."}
{"text":"When I first moved to Cleveland I heard tons of talk about this place so I decided to order. They have a deep dish option and while its very thick, its very greasy. I have ordered there a few times and every time that we order a deep dish pizza it is never cooked in the middle (I have to cook it in my oven for about 20 more minutes) and I am pretty sure that can make most people very sick. After realizing that this isn't normal I called to have the pizza replaced. They were very nice about replacing it and when they delivered the new one back it was cooked less than the first one they sent me. I am not a huge fan of complaining again after the item wasn't fixed so I have decided to take my business elsewhere."}
{"text":"Don't be fooled by my rating, the food is good quality and the place is run well.  In fact the wings and most items on the menu are really good.  The pizza is just not my taste.  It's what I refer to as \"ohio\" style pizza.  What is ohio style pizza?  Exactly- it isn't really a style of pizza.  It's not thin like new York and it isn't deep dish like Chicago...it's some place in between, just like oho.  To be specific, it's about a 1/2 to 3/4 inch thick, somewhat spongy crust.  The dough is typically made the same day it's used, so it won't have that chewy texture.  They also tend to bake them in a pan or on a rack rather than right on the surface of a pizza oven, so you won't get a crisp crust.  The sauce tends to be pretty sweet.  Cheese is cheese.  Toppings don't always get much beyond warmed up perhaps because the crust absorbs so much heat.  Sausage products in Cleveland are exceptional and recommended.   All this having been said, if you grew up on ohio style pizza this is about the best you'll find.  This post isn't meant be derogatory to this establishment, it's just to ensure that people know the type of pizza they are about to get.  The place is an institution for good reason.  What they do, they do very well!!!"}
{"text":"First  time I ordered from Angelo''s tonight. My pizza is off the charts incredible. Probably the best I've ever had. The people who run it are amazing as well. What a lucky find... 6 stars"}
{"text":"Posting on behalf of my husband and family visiting from out of town.   This is hands down one of the best pizza experiences we've ever had.  Mashed potato pizza, what's not to like?"}
{"text":"The pizza is definitely very good. Nothing will ever top Adriatico's for me, but since they don't seem to ever be opening a Cleveland store (haha) I'll have to save it for my trips back to Columbus/Cincinnati.  We were there on a weeknight, but I'm sure on weekends the wait probably gets a little out of control. Definitely worth it though. I also had a spinach salad which was excellent. We had the original crust, but when I'm back I'll hit up the deep dish option.   Service was a little meh, but what can you do, really? They're busy.  Also, props for airing NBATV while i was there. Can't get enough of replays of the 2009 Playoffs."}
{"text":"Our favorite pizza place in the world. We've been eating there for years and are never disappointed. The crust is just phenomenal and I would highly recommend people try this place out!"}
{"text":"Went here for the first time last night. This place definitely lives up to its reviews. Good pizza, solid beer selection, and entertaining wait staff. My wife really liked the caprese salad which was huge and the dessert was really good. The restaurant had a cool feel with its open concept. They had big windows/doors open which was nice on a summer night. I would definitely come back to this neighborhood joint."}
{"text":"As an individual who worked nearly a decade in pizza... I have the utmost respect for a family who's been able to do it for so long. This place is a Lakewood institution with consistent product.. I have to be honest by saying this pizza is incredibly average, consistent, convenient, but average.. Always greasy, always slightly undercooked (doughy center) and way to much \"dough crisper\" it's an industry product. Get some coupons, and you probably goto 3 stars..."}
{"text":"Never had a bad thing here. If you haven't tried Angelo's yet, now is the time.  Yes, it's pricier than the others but the ingredients and flavor are worth it.  Deep dish is a must!"}
{"text":"I was delighted to see on a a recent trip to Southern Oregon that at least the Phoenix branch of Angelo's was still in operation. The store in Ashland, that used to be by the old bowling alley behind the Sentry grocery, is long gone. (note: the Medford store is also still in operation----thank GOD)   This place retains a completely unfeigned, throwback feel. They've been in the game since 1968, and taking in especially the insides of the place, it is hard to see that much if anything has changed--- and moreover, nothing NEEDS to change! I hope wiser and cooler heads remain at the helm @ Angelo's and don't try to fix something that clearly isn't broke.   Angelo's is at its best w/its thin crust style. I love their Lumberjack as well as their classic combo pies, as well as the Chef's and Meat Eaters specials, being a lover of all things spicy, with their house special Pepperoni, hot Italian sausage, green pepper, ground beef, black olives, and red onions. Angelo's really piles it on with the toppings, so if great value for your hard-earned moolah is important, that's the most important thing to know about this place.  Finally, If memory serves, Angelo's is the very first place I ever  had taco pie pizza, as well as Chicken fajita... I loved 'em both, and so now it's a real dilemma going back, trying to decide what to get each time, subsequently. There's a few new items I don't remember seeing before on their menu, including a couple of chicken pizzas w/the white garlic sauce, as well as vegetarian. Their Mediterranean looks right up my alley.  Thanks for all the great memories, Angelo's, and what's more, thanks for all the great pizza! Southern Oregon is most definitely a better place, with you in it!"}
{"text":"Angelo's is frequently called the best pizza in Cleveland, and although many people would offer up contenders, I'm unaware of them, and they're too distant to reach when it's just a 10 minute drive away. I've heard of Mama Santa's on the east side, and that it's better or a close second, but I haven't had a chance to try it. Pizza chains don't stand up to their product, not even in the slightest. I think what makes it so great is the sauce--it's perfect.  Their specialty pizzas are great, too. Their baked potato pizza is incredible--reminds me of pierogis.  That said...  On a whim I was feeling adventurous, so I ordered their Pesto Chicken Pasta because I needed to bring something to work the next day and my girlfriend and I had a near-empty fridge, and hadn't figured out what we felt like cooking, yet.  Big mistake. The chicken was like overcooked chunks of rubber, the texture of it felt artificial, and I needed to add more pesto from a jar in my fridge, and parmesan cheese, to make it worth eating. Regardless, I ate it all.  Anyway, POINT IS: just get the pizza. It's fantastic. Don't stray from the pizza. Don't get out of the boat. Just set your course for pizza island, and don't look back.  Five stars, because it's primarily a pizza place, and their pies can't be beat."}
{"text":"I haven't been here in years.  I haven't lived in Cleveland since I graduated LHS '01  The thing I miss most?  Angelo's Pizza.  And I guess my mom.  That crust.  My favorite pie was pepperoni and pineapple.  Can someone please send some to NYC?  I hate New York style pizza.....  ::tear::"}
{"text":"The best pizza period.   I have been all over the US and this pizza ranks at the highest level. The pan crust is unreal. Angelo's pizza is a must if in the Lakewood or Cleveland area.   If you have had it, it is no secret to you how amazing it is, but this place loudly flies just under the radar!!"}
{"text":"Whether you get their deep dish or original, the regular cheese stick or the bosco sticks... All amazing.   Great delivery staff, always faster than they say they will be."}
{"text":"I was picking up a late night pizza (which was excellent) and witnessed one of the employees (a young lady) help another young girl who was clearly out of sorts sitting across the street alone. The employee brought her inside and gave the young lady water and offered her food. Not only does this restaurant have great food but, outstanding employees as well. I'm proud to have this restaurant in my neighborhood."}
{"text":"Some of the best pizza in the area and the wings BANG!!!! Angelo's always has a crowd so unless your dining in and beware they are remodeling but I suggest calling in your order. Save time and beat the crowds especially on the weekend."}
{"text":"Best pizza in Cleveland.  Only bad thing is I wish it was closer!!!"}
{"text":"Absolutely the best I have tasted in the Cleveland area! Great place to eat for everyone in my family and the only complaint we have ever had is that we can't get enough! Not the cheapest but so worth the money!!!"}
{"text":"AVOID THE BAR AT ALL COSTS. They must hire family members to staff the bar. The pizza is amazing but the service at the bar is terrible. The bartender Brit was rude to all the customers and   when I caught her eye she rudely said \"I'll be RIGHT WITH YOU!\" I've never had such bad service. Still waiting for her 15 minutes after sitting down at the bar.   Finally walked next door for a beer while I wait for my pizza"}
{"text":"Finding good pizza in Cleveland has proven to be something of a challenge. I moved here from NYC, my boyfriend moved from Chicago, so we have a pretty high standard of what pizza should taste like.  Disclaimer: We only tried the traditional pizza with traditional sauce; we have yet to try to deep dish.  We started with side salads, me grilled chicken pecan with balsamic vinaigrette and he with ceasar salad. His was okay, traditional caesar sald and dressing. My salad was incredible! It is made with: Spinach-Romaine Mix, Grilled Chicken, Sweet Glazed Pecans, Red Onion, Roma Tomato. Let me first start by saying they did not skimp out on any of the toppings. It almost felt like a full salad rather than a side dish. The candied pecans were amazing and so many of them too.  After the salads we shared a large pepperoni pizza. The crust was a perfect thinness with a enough crunch on the outside but still had a soft chewy center. The only issue I had with the crust was that I think when you hold up a slice of pizza and eat it with one hand (especially one as small as these pieces were) it should be able to stay up. However, with this pizza crust, as it went toward the center of the pie it got very greasy and droopy.  I can only guess they must cook it on the pan that it's served in rather than placing directly on the oven surface.  When you are choosing your pizza you have the option to select between several types of sauce and toppings. We chose a simple traditional sauce and pepperoni. The sauce was very good and there was an ample amount of pepperoni, enough for every slice.  My biggest issues with the pizza was the droop factor and the size of the pizza. We ordered a large since it has 8 slices thinking there would be plenty to eat later that night after going out. But the pie was more like a small than a large. The 8 slices were still there, just very small slices.  Overall, this is definitely one of the better pizza places I have experienced in Cleveland and will definitely be back here again."}
{"text":"There are those who assess each new pizza experience, savoring the flavor, testing the texture with their tongues, assessing the quality of the crust.  And then there's me.  I love pizza.  Cheese, with the works, you name it.  Thick crust, thin, less or more spicy . . . it all means one thing:  I didn't have to cook.  So, awesome.  It was a very strange moment for me when I bit into an Angelo's Pizza and was sto struck by the flavor, texture and crust that it actually interrupted my I-totally-didn't-have-to-cook-this nirvana.  Try it.  It's more pricey than some other local places, so we don't get it every time, but now when we order from less expensive places, my not-cooking ecstasy is muted by the knowledge that there is something better Out There."}
{"text":"I love this pizza! Best pizza in town, in  my opinion!  Friendly staff and I love \"half off pizza Mondays!\" The Bae ordered a pizza that would normally cost $40 with all of the toppings that were put on it! Only cost about $21 on Monday! Thank Goodness!! LoL"}
{"text":"I lived in Lakewood for more than 10 years before moving to California. And let me just say, every time I come back to visit I CANNOT leave Ohio without having Angelo's! No matter what kind of pizza you order it's delicious from plain cheese to veggie you won't be disappointed. The veggie pizza has FRESH crunchy vegetables and not soggy and possibly canned vegetables. And the crust is so yummy! It's kinda like bread crumbs on the outside so it's crunchy but soft on the inside. This place is definitely worth the long wait times! Can't wait wait visit again!"}
{"text":"Best Pizza I have had in Cleveland. The sauce is spectacular. I have had Pizza three different ways from Angelo's. I have eaten in. I have gotten take out and I have gotten \"half baked\" take out to go. In every instance the Pizza is consistently awesome. We have only had the traditional style crust. My wife and I are not huge deep dish pizza fans."}
{"text":"Amazing food. Amazing service. What a great business. They are actively involved in the community and are always supporting great causes. Just wish they would bring the Cavateli back."}
{"text":"everyone kept telling me angelo's was the best pizza around, not even just on the west side, but the best in cleves.  i have to say....big guy's in tremont is still my favorite.  it's not bad pizza by any means.  but it was a little too doughy for me.  i guess there's different styles, and it's just not my style.    for that type of pizza, it's good, so i'm giving it three stars.  but big guy's is still my fav on the west side."}
{"text":"My favorite pizza place in all of Cleveland! I've never had a bad experience and that's saying a lot from all the times we used to get it delivered and from dining in. Great taste and cute little place. Sometimes I wish there was more seating, because it can get pretty crazy trying to wait for a seat so if your going in a group maybe 5 people being the biggest group and more like four or less comfortably."}
{"text":"You can never go wrong with Angelos. While I have never eaten in the restaurant, I get take out with my boyfriend from there all the time. Deep dish is definitely where it's at. Anything with green peppers and olives, throw on some pepperoni and maybe some sausage, and you have an A+ pizza from there. I also like their side salads."}
{"text":"Lunchtime playlist at Angelo's:  All Night Long -- Lionel Richie You Spin My Head Right Round -- Flo Rida Power of Love -- Huey Lewis and the News Come To Me -- France Joli Hurts So Good -- John Mellencamp Lonely No More -- Rob Thomas Rich Girl -- Gwen Stefani She Blinded Me With Science -- Thomas Dolby  If I were to name this as a Pandora station, it would be \"Obsessive Love.\" Not bad when paired with pizza."}
{"text":"Best pizza on the west side, if not all of Cleveland.  Not sure what they do to their crust, but it is taaaasty!   I've actually wanted to try other menu items but it just seems so wrong to go to Angelos and not get the pizza.   I have been an Angelos customer for 25+ years and cannot bring myself to try any other pizza.  Why bother?  They always have coupons available online, plus daily deals.   Gotta love the Monday deal of 1/2 price pizzas for dine in......but prepared to wait for a table as this is quite popular.  Parking can be tough at times."}
{"text":"My friends and I came here on a Saturday night and ate our little hearts out!   While the restaurant was not very crowded they must have had a ton of to go orders because it took awhile for our food to come out. Well...when you are having great conversation you sometimes forget how long you have been waiting. The only reason I noticed was because the waitress came and apologized and without us asking gave us 25% off of our bill! Talk about fantastic customer service! I was so impressed by this that I will most definitely be eating here again because of their loyalty to their customers (and the fact that the food is great)!   We had 3 orders of wings and 2 pizzas for 4 people! What a perfect indulgent Saturday night!"}
{"text":"Pizza was excellent, speedy service. Prices are outrageous. I ordered two \"large\"pizzas and they are the size of a medium vs a typical large. Two medium pizzas shouldn't cost over $40...."}
{"text":"My wife had told me about Angelo's a few times, we finally had a chance to come here last night. Small local place, it has a full service bar, and from where we sat I could tell the bartender is very nice. Kind staff, even for them being understaffed the day we came. Very polite and apologetic about the situation.   We first ordered their beer battered onion rings, which were amazing. I'm an onion ring guy so fresh onion rings will always ALWAYS win me over. The serving was enough for our table and the chipotle Mayo provided was excellent. We ordered a whole pie, half cheese (for our son) and half house veggie. The crust/dough was great. Crispy on the edge without being dry or burnt, and dough itself was baked well without being doughy. The veggies were very fresh and well put together in terms of taste. My son is picky about what pizza he will eat, so him eating his part without us forcing him makes Angelo's a big winner. My only concern is that they're not family oriented. I would have liked to see a kids menu, or maybe some kids options. A small pan pie or chicken fingers for the little ones given the size of the regular menu. And honestly that's the only reason they're receiving 4 stars instead of 5. Everything else is excellent, any and everyone should stop here. With or without family."}
{"text":"The food is so good! We ordered a large super deluxe and it didn't disappoint. The service was also incredible, especially for being packed."}
{"text":"Luckily, my first experience with Angelo's was not a \"dine-in\" one...or I would have hurt someone. Seriously.   I ordered ahead of time and came in to pick my pizza up practically right on time. The line for pick up was a tiny bit backed up, but I was feeling patient that day, so I gladly waited. Plus, who can deny that delicious pizza aroma?! Yes, the one I was about to smell my whole 30 minute car ride home... The amount of people packed into this tiny establishment was impressive, as was the amount of people lined up on the sidewalk. I was immediately intimidated and thankful for my pre-order.  When I got the pizza, I was a bit disappointed in the size (yes, I'm a pizza hog and I know it, though my eyes are usually way bigger than my stomach).  Mostly, what irked me was the size to price ratio, but I had a Groupon, so no complaining.  I got the margherita pizza (who can resist basil and mozz?) and immediately opened the box (once I made my way back to the car, of course; vultures all over that place). The pizza appeared and smelled fabulous, but could it last the car ride AND taste good when it made it home?   OF COURSE!! Everything was still perfect and delicious! AND, it lasted a couple of days later as lunches! The amount of cheese, basil and tomatoes on this pizza was absolutely astounding. I'm used to margherita pizzas being thin and barely substantial, but this was beyond that. All of those awards and the praise all over the walls?   Definitely no lie, if you ask me. Perhaps my specific selection made a difference, so I would definitely categorize this as the best \"specialty\" pizza around. Typical pepperoni and cheese may be a little different, but Angelo's has got it goin' on if you want something a little different on pizza night."}
{"text":"So, a friend did us a favor and we wanted to take her out to eat in return. She wanted to go to Angelos. Not a fan but OK. The last time I went there I ordered a pizza and being a NY'er, growing up on Long Island in an Italian home, their pizza is lacking. My disappointment with all Italian food here has been frustrating. A friend here said \"welcome to the Midwest\". Anyway, this time there I ordered the Fettuccine Alfredo with chicken to try another dish while they ordered a pizza. Do yourself a favor, go buy a jar of Alfredo sauce from the grocery store and make it at home. It will be better. I tried, but their food isn't anything better than mall food."}
{"text":"My favorite pizza place that delivers. They may look pricey, but you get what you pay for. Angelos never disappoints. I love their seafood pizza, but a large is a bit much. A slice or two is all I can take. So now I order the deluxe and it's delicious. Their chicken pizza is good with spinach and alfredo sauce  and a good idea as your only pizza, I can eat quite a bit of this one. Delivery takes about an hour and I'm pretty close by... Well worth the wait!"}
{"text":"Angelo's is a West Side institution and when I was dating a boy from Lakewood, we spent many evenings scarfing down an Angelo's pie, then walking down Clifton on a warm summer evening.  It wasn't quite as good as my hometown Marconi's, but it was great pizza.  Marconi's has faded but Angelo's is still great pizza.  Definitely give it a try if you're new to Cleveland or passing through town."}
{"text":"Always popular on mondays, since it's 1/2 price pizza. No take out orders. I like trying a different pizza every time I go. There's 2 types of crust. Both are yummy. I usually go for the original, it's a little less greasy. Mushroom & sausage is my favorite. Desserts are good especially their cassata cake. There is usually a waiting line so come early, like at 3 or 4pm. Always a good atmosphere!"}
{"text":"Seafood deep dish pizza!! This place has some of the most innovative and delicious pizzas in town! I wanted to give it 4 stars because the decor is so blah but the pizza is so good it gets the 5th star."}
{"text":"Here's the Reader's Digest version of our story...come for the pizza, but stay for the wings and dessert.  Want the longer version?  Then read on!!!  I know everyone in town is gonna hate me for this, but Angelo's was not our favorite pizza in town.  Not that they did anything wrong, mind you...we did have a good meal, but my family is not a sweet red sauce kind of gang and Angelo's version is.  There, I said it.  Here is a rundown of what we had during our recent meal there.  Both my wife and I enjoyed their reasonably priced beer menu, and they even had a number of ciders to choose from!  Their Happy Hour prices are even more affordable.  The Greek side salad we shared was large and the homemade creamy Parmesan dressing added a nice kick.  The bowl was full of veggies, peppers and homemade croutons...it split three ways just perfectly.  Next up, their wings.  Ohhhhhhh, their wings.  The garlic Parmesan wings were fantastic...plump, juicy and crispy on the outside.  We got ours with bleu cheese dressing (a must!) and we will most certainly return to try other flavors as well.  I loved the fact that the specialty pies can be made half-n-half so that you can try multiple flavor combinations...just remember that both sides must share the same base sauce.  The house special and three cheese pepperoni half-n-half pie was good, but as I said earlier their sauce is too sweet.  We ordered the pan-style crust and although we prefer a much thinner crust it was crispy and buttery on the bottom and chewy throughout...nice job!  The toppings were generous and appeared to all be fresh.  Lastly, we saved just enough room for a treat that caught all our eye...the buckeye pie.  Damn folks, this slice was mind blowingly good, not overly sweet and served in a graham cracker crust; the three of us savor each and every scrumptious bite.  So there you have it.  Not sure how much love I'll get for this review, but it is what it is.  I know we'll return, just not necessarily for their namesake dish."}
{"text":"Seafood Pizza. Deep Dish. Do yourself a favor and order it.  Best pizza place from New York City to Chicago. Go on a Monday night and all their pies are half off! (Dine-in only.) My advice is to come early as it gets very busy. Other favorites include the Baked Potato Pizza and Acapulco BBQ Chicken."}
{"text":"I live near Angelo's and get carry out fairly regularly (over the past 5 years). I have also eaten there a handful of times.  This is hands down my favorite pizza in Cleveland. I like the regular crust and LOVE the deep dish. I have enjoyed all of the specialty pizzas I've tried over the years - particularly the margarita pizza. I've had some of the salads on the occasions I've eaten in the dining room and they've been great too. In the evenings when I pick up pizza the place is packed, so be prepared to wait if you're there during peak dining hours. Parking can be a problem, but I love the pizza so much I don't care. The prices are definitely higher, but I think the quality and taste reflect that."}
{"text":"Angelos pizza used to be so good when i was kid and it was at it original location where it was take out or delivery only. Over the years the pizza has changed but its still pretty good. its not consistent enough tho, one time ill order it and its great, next time I'll get the same pizza and its not that good. Ive tried a few of their specialty pizzas, the mashed potato one wasn't very good, the mash potatoes are too plain should be seasoned more, the mac and cheese one was ok but it would be better if they didn't used stoffers for it.   Also they are def way over priced, i don't care how \"good\" a pizza is a small one topping pick up should not be $10"}
{"text":"I've had delivery from here a couple of times now, and I'm still craving the pizza. Of course, considering the name, it must be excellent. ;)   The crust is great - it's on the thick side, yet very flavorful with a great cornbready texture. I'm usually a bigger fan of thin crust, but I ate every bite of the many slices I ate.   My personal favorite is the 3 cheese special with the roasted red pepper pesto sauce and red onions for the topping. I wasn't sure about the sauce at first as I'm picky about where red peppers go in my food, but I was assured by my sister-in-law that I'd enjoy it, and she was right. Granted, there's definitely more of a red pepper presence than a pesto presence, but the combination goes really well together. I wish I could have taken some with me on the plane, but I was already loaded up with enough goodies.   There are cheaper places, but this is totally worth it. 4.5 stars for now with major potential for a 5.   Random fact - Many pizza places in NE Ohio use provolone on their pizza rather than mozzarella. Not that mozzarella is never used, but if it is, they'll advertise that fact. Ultimately I don't know which I like better, but this Californian has zero complaints about the provolone."}
{"text":"Yes, the pizza is consistently wonderful, but my last two experiences with the service will make my husband and I go looking for another deep dish joint.  Tonight the friendly host sat us at a large booth that sits six or more folks; we offered to switch to a smaller one knowing how busy they get on a Saturday night.  He laughed and said it was okay because there was not yet a line out the door.  Yet.    We waited and watched four other tables get seated and have their orders taken while not a single server came by to acknowledge us or to get our drink order.  After 20 minutes of being invisible, we finally left, went to Dewey's, were not ignored, and proceeded to tip them handsomely for the experience.  This was the second time this has happened to us. Sorry Angelo's, we already gave you a second chance.  You lost customers for good tonight."}
{"text":"Angelos is known for their pizza, and rightfully so.  I think their buffalo wings are very underrated.  After living in Buffalo for 6+ years I struggled to find good wings in Cle.  Angelos is my go-to when I'm craving.  The place is a great mix of a dinning room/ sports bar.  Plenty of tvs around and if you don't want to watch sports then they are easily avoidable.  The seating area is always packed on the weekend nights.  Sometimes it can be a struggle to get in there if you go at peak hours.  But such is the case with delicious places like this."}
{"text":"Yesterday I ordered a seafood pizza from a place in Olmsted Twp., I won't mention their name. The worst I ever had. I had to make up for it by treating myself to a seafood pizza from the one and only Angelo's today. Angelo's is packed with an hour wait to be seated on a Monday. But, I've got to tell you, it's worth it. They have amazing food and I've never had a seafood pizza this amazing anywhere else in my life. Just pure perfection."}
{"text":"Best pizza in the Cleveland area, hands down. I'd say my love of this pizza is second only to Chicago-style deep dish pizza. I've waited here for 3 hours before (they don't accept reservations) just to get a taste of these rich pies that have some of the best sauce I've ever tasted. Pair this along with an extensive beer/cocktail list, and you can understand why this is one of the CLE's most visited joints. If you're short on time, I'd advise calling in an order. Wait time for take-out is usually shorter than dining-in. The pizzas are a bit pricey, but that's what you pay for greatness. I'd advise going on Mondays--everything's half-off.   Pro-tip: Extra sauce and deep dish every time. It's not extra charge and you get even more of that saucy goodness."}
{"text":"Met up with Angela M, Lou K, and Jillian N at Angelo's for a much needed laugh-fest. Yep. We all sat around the table and made fun of Lou for an hour or so. We ordered much, much too much food. We started with their cheesy fries that are actually waffle fries! Who would have guessed! They were kick ass.   I followed up with my entrรฉe, the antipasto salad. This thing was HUGE and piled high with pepperoni, ham, cheese, olives (the kind from a can), and tomatoes. I ate it with their garlic parmesan dressing (looked like Oil and vinegar but kicked ass b/c of all the garlic amazingness).   Angela M couldn't decide if she wanted pizza or spaghetts so Lou suggested she order both. Done. She had leftovers for the next day.   Lou and Jillian split a large pizza, which didn't look too large to me.   We sat in the front near the big windows, which I love doing in Lakewood, especially the eastern end on Madison because it has phenom people watching. My favorite? A teenaged boy walking down the street wearing a tshirt that was only  1/2 on. Speculating why or how his shirt came to be and how we all wanted to punch him for walking around like that gave us a good chuckle. Yes, beating up teens makes us laugh. But you would want to punch him too if you saw the way he was wearing his t-shirt. He wore it with such confidence! I thought it was a new trend, but Angela who works with teens didn't seem to recognize it. She is always the one to go to with questions about what teens are up to these days.   They have Mr.Pibb on tap. Yes, yes, Mr. Pibb doesn't have the schooling that Dr. Pepper completed, but I think they both do the same work."}
{"text":"I cannot say enough good things about Angelo's pizza. Soo good. The seafood pizza is one of my favorites but they are all good. Thick crust is a must- they put Panko breadcrumbs (or something similar) on the bottom of the crust. It is delicious."}
{"text":"Lakewood's best pizza, according to many. They have some very good sandwiches and salads, too. They've been a staple in the community for close to 40 years.  Great place to dine in."}
{"text":"Absolutely delicious. My favorite pizza hands down! I always get the meat lovers one and I can't get enough of it! Also the fried ravioli appetizer is amazing!! Don't be surprised if you're waiting for a table for more than 15 minutes though."}
{"text":"I don't understand the hype. Nothing special about this pizza, and it's overpriced. I've had better in Cleveland for much less.   I paid $16 for the pizza pictured below.   What is this?  A pizza for ants?... The pizza will have to be.. at least three times as big as this..  Never again. I almost said, \"what the f $%^ is this when I saw the box come out."}
{"text":"October second in the evening, I called my usual place to worry 4 a pizza. I asked I asked for young lady 4 a large pizza, deep dish, with extra cheese in extra sauce. The delivery guy was right on time. I paid the gentleman and got my Pizza and coke, and I cook my pizza to the kitchen where I am open the box up. And I found pepperoni all over the top of it. I had asked for young lady to make it without pepperoni.   However this is a minor mistake, and not what I found to be the usual. So I'm eating my other half of my Pizza today. which is a good day to eat it, the Ohio Buckeyes are playing Indiana today, and they're not really looking very good. like I said, it's a very good day for second day Pizza."}
{"text":"Be warned now: their sauce is super sweet. Not the \"awesome\" sweet, but the \"this is starting to hurt my teeth it's so sweet\" sweet. Not my thing, but if that's for you go for it.   Also, their traditional crust was neither thick nor thin - just somewhere in the awkwardly mushy range.  Don't waste your money or time trying to find parking.  Out of the 7 people I bought Angelo's pizza for, only one liked it.  Cleveland's best?  Hardly."}
{"text":"GREAT pizza.  Wow, I was surprised.  A friend recommended I check out Angelo's and so my boyfriend and I dined there on a Tuesday night.  It was packed so we sat at the bar.  I rarely eat crust on a pizza but this pizza was so good I had to do it!  I asked for extra sauce and they gave it to me.  The saucy is a bit on the tangy side but damn, the crust, cheese, sauce and toppings were on point.  I will definitely go back!"}
{"text":"The deep dish pizza is amazing. You don't find crust like this anywhere else in the area. It's almost as good as the toppings, which is so rare. Bosco sticks are always my appetizer of choice. They melt in your mouth with so much cheesy goodness. Amazing.  Their customer service is awesome. While there usually is a wait, they do their best to accommodate you. I came here for some late night chowing (after 2 am) once and looked inside the door. They were obviously closing down, but they opened the doors and welcomed us in. They were as cheerful as ever. They didn't have to do that for us, but they know how to serve customers right. Love this place. It's always a treat to stop by when I'm in the area."}
{"text":"I really cannot even offer a star because I never got to eat here. We arrived on a monday at 3:30 and were the second people to be put on a wait. We were told aFew minutes. A half an hour later when we went up to ask what was going on, the hostess ( who was def. not in th right profession) said they were understaffed. ( but other people were getting seated) 4 girls were standing in the kitchen talking doing absolutely nothing. I work for a corporate rest. And now I know why! Very disappointing! Really wanted to eat here and so did my kids. We finally walked out as did several others. They were really in need of a manager or owner up front. Super rude hostess and lazy staff."}
{"text":"This place is a little more expensive than what you normally will spend on pizza but you will get your moneys worth! The sauce is spot on and the toppings are very generous. I've never had a bad experience with their pizza and I've had Angelo's a lot! When my family comes into town to visit, they always want to make a stop here before they go home."}
{"text":"I don't get what all the hype about. The pizza sauce tastes like Chef Boyarde. It is entirely too sweet! Sure that may be appealing to some, but I just though it was gross. I've tried thier other offerings as well such as pasta, and had the same opinion. Too sweet. The artichoke dip was enjoyable though. As much as I try to support local business I would chose Geppetos over Angel is any day."}
{"text":"For me, the key to great pizza is the crust and Angelo's deep dish is my idea of perfection. It's like the whole crust has been deep fried and that's probably roughly true. This does mean the crust is a little \"buttery\" or, less charitably, it's a bit greasy, but I like it this way. My grandmother's pizzeria used to use old chicken grease to grease the deep dish pans. There's no way you get a crust like this without some fat. I almost never enjoy a slice of pizza from the first to the last, there's usually a big pile of \"pizza bones\" on the tray after wards, Angelo's is the only place I have been to so far in town (granted I am relatively new to Cleveland) where we leave an empty plate.   They have a nice selection of toppings. We've had the Chicken Club (multiple times), Meat Lovers and Hawaiian and all were excellent. I also find the sauce to be the perfect blend of sweet and spicy.  Be warned that you will probably wait at peak times and if you go for Monday half price pizza night, you will wait a long time (last time we went was an hour wait for half price night). However, it's well worth it, just don't go with an attitude. Nobody likes to wait, but I'm always amazed at people waiting who were told it would 45 minutes and they are getting snarky after 10.  The bread sticks are also phenomenal and make a great starter."}
{"text":"Just the greatest pizza in Cleveland. Better than Athens, better than Sweet Basil, better than the chain gang. The sauce is without a doubt the star of the show, with the dough and crust following just behind. But more so is how much they care about the satisfaction of their customers. Their standards are very high as well, we came here one night a received a pizza that was slightly dark. (A shade beyond golden brown...) Without even a hesitation the chef came to our table and apologized and said a new pizza was on its way so you can wait to box this one up if you like. Mind you we did not say a thing about the quality. That shows this establishment cares and why it is so successful. They have lifetime customers in us for sure. Do yourself a favor and get the best pizza you can buy."}
{"text":"This is the best pizza I have had in the Cleveland area.  At least the deep dish is.  This pizza is on the pricy side so it's entirely up to you as to whether or not it's worth it.    I have found that the regular crust pizza is pretty unremarkable but the deep dish more than makes up for it.  If you don't mind the wait time you can get these pizzas for half price if you dine in on a Monday.  You will probably have a significant wait time and best of luck on finding parking but once you get past that it's very worth it."}
{"text":"Starting to get very pricey! Nearly $30 for a specialty pizza.Their food is good.Their lack of parking and prices are not."}
{"text":"Whenever in Cleveland this is a halt all activities and grab a pie.  Growing up on the east side and near Little Italy there were several good pizza shops.  Angelo's is on another level.  As. native Clevelander, when coming home there are a few non negotiable stops Angelos for pizza is one of them. The crust is crispy and light none of that pre made stuff a lot of places have gone to in order to be efficient.  Toppings are fresh and veggies are fresh.  Go for the pizza but don't sleep on the wings, excellent flavor and not mega sized so you get a lot of fat. Salad was fresh.  The cherry on top is the Cassata cake, if you have never well you probably should. A slice feeds 2-3."}
{"text":"Wow. I can only speak to the deep dish baked potato pizza here as that's what we had while visiting Cleveland, but it was fantastic. I went to college in western Massachusetts where potato pies are something of a staple and this pie merged that wonderful idea with an awesome crust. The crust isn't quite Chicago style, but more of a pan pizza style. However, it's nothing like the great bread of a pizza hut pizza. It's a busy, chewy, delicious conduit for the symphony of toppings which it carries. The thing that makes it even better is the use of panko bread crumbs in lieu of corn meal or some such for eating sliding on the peel. This makes for an additional texture and crunch that surprisingly adds a lot to this crust. The park toppings were great... Loads of cheese, bacon, and potatoes with scallions for that extra kick and sour cream on the side to as some tart creaminess and make up for the lack of sauce. Also, the XL pie feed 5 hungry people with a couple of slices left for breakfast. Now that's impressive. All in all a great pizza experience...I wish we had an Angelo's in NH."}
{"text":"I'm new to Cleveland and a friend recommended this place to me. I went in on a Monday unaware of the half off pizza special and it was pretty packed at 5pm. They said it would be about a 30 minute wait, which I didn't mind and we only waited about 15. Eating a lot of pizza from New York and the east coast has made me a pizza critic. I refuse to eat pizza from chain restaurants. This pizza did not disappoint. It was amazing. It also came out very quickly for how busy they were. I will most certainly be back. I can also say that the entire staff in this place was friendly and smiley. I've worked in the restaurant business for over 7 years and always appreciate good service. This place is a new favorite. Keep up the good work!"}
{"text":"Delicious! Half price pizza Monday!! Visiting from out of town. Was craving pizza. Looked up a couple pizza places. I was wanting more of a Chicago deep dish as opposed to a New York flat slices. This was a great find! Perfect for what we wanted. A little bit of a wait, but they used the yelp waitlist and so I was able to see updates and know about how much longer to anticipate. We brought our 20 month old too. They had a high chair and the loudish busy sound of the place drowned out her occasional tantrums! lol. Coloring crayons and a coloring menu helped. And the pizza was very good! They only have pizza sizes small, large and x-large. But they say that the large is like a medium. We were very hungry and got the XL. Between my pregnant self, my husband, and our daughter, we only ate half. Yay left overs! We don't understand why they don't just call the sizes s, m, and L. Oh well. Great experience. We'd definitely go back. :)"}
{"text":"I got food poisoning from this place! I am 99% sure it was from the chicken on their pizza. I would stay away.  Regardless of poisoning, I would not come back here a lot. They serve a very deep dish pizza, thatยดs really fatty and unhealthy. Iยดve also had frozen pizzas at home that had more flavour."}
{"text":"If you want good pizza, go to Angelo's!!! The customer service is great which is always a plus for me. This time we tried something new which was the Philly Cheesesteak and Seafood pizza. Both very different but both were awesome. We'll definitely be going back again."}
{"text":"This place is worth the wait! If you decide to go on the weekend, one of the best things you can do is use the Yelp app to get on the list ahead of time.   This is a family-friendly restaurant offering a wide variety of pizza, wings, salads, pasta and more. Their pizza can either be done in the original style or deep dish, but when I compared ours (original) to our friends' deep dish pizza, I didn't notice a huge difference. Either way, the crust and dough on this is perfect! Just the right amount of sauce and cheese. The meat lovers pizza was delicious.  As far as the atmosphere, expect it to be crowded, busy and loud on the weekends, with waiters zooming by trying to constantly play frogger with the people standing around waiting for a table. Beer selection is decent but not amazing, with a few standard Great Lakes beers. Their \"last chance\" $2 and $3 beers are also a great way to knock back a few on a budget!"}
{"text":"I had a craaaaaaazy pizza craving and we stopped here. It was amazing everything was fresh and clean the pizza was to die to for and the customer service was on point. I can't see why they have so many neutral reviews. Next time I'm in Oregon or passing through I'll definitely be back."}
{"text":"Snarky server Chelsie should work someplace else if she cant be nice to customers when the restaurant is busy. Pizza and salads were good but Chelsie's attitude ruined the evening."}
{"text":"Favorite favorite place to be.  I love 1/2 price Monday's. The pizza is always t he best. Fast service. Great beer selection"}
{"text":"Best Pizza in Lakewood . Thick crust and breading, sweet sauce with a gentle blend of spices.  Put on your favorite toppings under the double layers of mozzarella and provolone and wallah- your in Heaven.  Great meatball sandwiches.  I usually order meatballs when I have family over and they are soft, flavorful and are home made!  Great prices,  delivery and dining available.  Best in the west!  You have not ate a real pizza until you eat at Angelos!"}
{"text":"I've had pizza here once in the early 90s.i just moved into the area & needed to order a pizza. This is an excellent local family owned pizza place! I simply ordered a pepperoni pizza as a test guide and it was great. A slight bit pricey but it won't stop me from coming back. Looking to get deeper into the menu next visit."}
{"text":"My favorite pizza in the Cleveland area. I'm a big fan of the Acapulco BBQ chicken and artichoke pizzas.   I never get anything but the thin crust; it's not wafer thing like other places and provides just the right amount of crust."}
{"text":"Angelo's is always amazing.  Their spinach artichoke dip and wings are my favorite.  There is always a wait to be seated, but you can use waitlist in Yelp to get your name on the list and see how many people are in front of you, which is nice.  Their pizza is so good, we've never been disappointed."}
{"text":"Pizza was really good and so were the wings. Good service too. Would definitely go back next time I am in town."}
{"text":"Food is great when work pays for it.  I got it delivered to my house once. The driver parked in my [angry] neighbor's driveway. I ordered buffalo wings with bleu cheese and they gave me ranch. Yuck!  I sent them a message about my disappointment, both through their website and good old e-mail. No response and no remorse.   I'll never ever turn down a delicious Angelo's morsel, but I sure as heck will never pay for it again!"}
{"text":"This pizza is great!  Not sure if I caught them on a bad day - 4th of July - the service is ssssllllllllooooooowwww!  It took 10 mins to my check after I asked for it.  Surrounding dirty tables stayed dirty for extended time.  If you're going to be one of the only restaurants in Lakewood opened on a holiday - staff for it.  Just saying!"}
{"text":"Stopped here on a road trip and wasn't disappointed.  The 12\" pizza we ordered was very cheesy and the toppings were plentiful.  The service was very friendly too.  I could see at least 8 different beers on tap with two large televisions in the spacious seating area, and NASCAR garb hanging in various places.  Crust was crispy, but a little flavorless.  Would definitely stop here often if I were a local."}
{"text":"I had to eat and was in the area, so figured to call this place to order take out. After perusing the menu I ordered a large pepperoni and an order of o rings. I was going to order one of their specials, but none of them really appealed to me.  Pizza was average and too doughy. O rings were standard. Not the best pizza in Cleveland for my money. Speaking if money, 18 dollars is way too much for what I had... and that was after a $2 off deal.  This is my second trip to Angelo's and not sure there will be another. Not bad, just average pie."}
{"text":"So Round 2...I thought that maybe I should give it another chance...maybe the staff members had a bad day or something.  NO!  They still have crappy attitudes and not very professional, that's why I changed my rating.  The food is awesome (ordered the Chicken Pecan Salad-yum!) but the service is horrible and  I will NEVER go back there again.  It is not worth the crappy attitudes.   So...lol, went there for lunch (around 1pm) and even though it wasn't \"crowded\" it still looked busy (if that makes sense).  Didn't sit at a table so I headed for the \"bar\".  It took maybe a little over five minutes before someone realized I was sitting there (I was the only one at the \"bar\" area) and then after one woman acknowledge me, she kind of ignored me and the other woman behind her noticed me and decided to help me (she disappeared too but came back like 5-7 minutes later).  I have always planted in my head never be mean or give attitude to people who handles your food...you never know what they might do...lol.    So when she finally came back I decided to order the cheese pizza with alfredo sauce.  The pizza was EXCELLENT...too bad I only had enough time to eat one slice.  I then ordered a tiramisu to go.  Not too thrilled about it, I only too two bites and threw the rest away.  The pizza alone gets five stars but the service and how things were delivered to me (not getting too much into the WHOLE experience, to be nice lol) this get only 2 stars.  Personally, I wouldn't dine in but will consider delivery only, lol."}
{"text":"I never get pizza here. The sauce is so sweet and the cheese used so sparingly..all on a thicker crust..not my thing.  Their sandwiches however are quite good. A little pricy. I also want to eventually try their pasta but I worry I won't like the sauce if it's like the pizza."}
{"text":"Delicious but expensive! I can't order it all the time but I would like to. They have great specialty pizzas and awesome ingredients to pick from if you build your own. I've only done carry out, never eaten in, so I can't comment on the vibe much. Highly recommend the food, though!"}
{"text":"- no offence. the pizza is good but certainly not the best, nor great (as everyone calls out).  - also ordered the spaghetti and meatballs. overcooked noodles, and flavourless meatballs.  - sorry, angelo's. you had promise."}
{"text":"Very tasty food but poor customer service on calls and the parking situation is ridiculous. I call in to pick up a pizza time to time and they are hardly every pleasant (mostly sounds like they can careless). When choosing pizza I would try out other local shops and see who really appreciates your business. None the less the food is tasty."}
{"text":"I like their pizza, but I love their sandwiches. The Meatball Sandwich is the best I've ever had. It comes with homemade chips and is perfect for a takeout dinner. It is also huge and lasts me 2 meals."}
{"text":"Coming from Chicago, I was super impressed by their pizzas. Rightfully so, as they were given awards for the best pizza in Cleveland.   We had the Deluxe and the House Special. My favorite was the Deluxe. The regular crust is unbelievably soft but firm, the tomato sauce is the perfect blend of salty and sweet, and the toppings were fresh. Putting it altogether, with all the secrets and other talents that go into pizza-making:   Angelo's makes one of the best pizza's we've ever had."}
{"text":"One of the two great deep dish pizzas in the Rocky River area (Danny Boy's is the other), Angelo's Pizza is an absolutely astounding.  The only reason that it doesn't get five stars here is because, well, you have to be in the mood for pizza, because the pizza's the only really exceptional thing.   Fortunately, that pizza's amazing.  The crust is thick and made of actual bread (and I'm a bread lover), the sauce is tangy and tastes like tomatoes, and the toppings are always top-notch.  Best of all, they get better overnight; generally, cold pizza is an acquired tastes, but I always love taking home the leftovers here.    The rest of the menu is kinda skimpy, and done okay.  The garlic bread is top-notch, but after that there are better Italian meals.  But that pizza... Mmmm.    Good stuff."}
{"text":"The Acapulco BBQ Pizza is probably the best specialty pizza I've had. I've never had a bad experience at Angelo's. All of the staff is great and friendly. Will definitely be back!"}
{"text":"Pricy pricy pizza, but usually very good the other times we've had it. However, we ordered the seafood pizza and I was disappointed that there was imitation crab on it (the ingredients listed on the menu says CRAB MEAT not IMITATION CRAB). The shrimp was real, but since the crab was imitation, the \"lobster cream sauce\" probably did not have any real lobster in it as well. The imitation crab meat just tasted....crappy. This isn't acceptable when you're paying a premium. Probably one of our last times ordering from Angelo's."}
{"text":"After being proded by my father to try what is supposed to be one of the best pizzas in town.  I can yes, it is one of the best in Cleveland.  So good that I ate 1/3 of the pizza cold!!   The Deluze pizza was amazingly awesome.  The sauce is slightly sweet and are balanced out with their yummy toppings.  The toppings are little bites of delicious heaven.  Everything is fresh and aromatic with crunchy vegetables and flavorful sausage and pepperoni.  I enjoyed everything except for the cheese- it was a bit on the heavy side for me, so I'll ask for lighter cheese next time.  The crust has that nice soft texture on the inside with a nice and crispy outer crust.    The pizza toppings, especially the areas with lots of cheese, are a little on the greasy side, which I suspect was due to the copious amounts of melted cheese?  But even then, it is definitely not as bad as Pizza Hut or Dominos, where sometimes, you even get a free side of grease with your pizza haha.    I want more Angelo's pizza (hot or cold) with a salad (so I don't feel so bad about shoveling pizza in my mouth haha).. I have to try their salads and other entrees soon!"}
{"text":"Holy cow, this place is good ... really good.  We first heard about it from our realtor and then friends in Lakewood.  Finally, we tried it ourselves.  It was OUTSTANDING.  The seafood pizza is absolutely addictive.  They must lace it with crack or something, because it was extremely good, and I wanted more.  The place is a bit of a tight fit if you want to eat in (not a lot of tables there), but the pizza is some of the best I've ever had.  5 stars aren't enough!"}
{"text":"All things considered the pizza is delicious and crust heaven. Service always solid and you can't beat 1/2 Monday's. However it's a tad pricy at regular price and toppings not plentiful when paying $2+ for each topping. Cover that damn pizza w/ pepperoni already."}
{"text":"Another favorite!!  Excellent food! Food is consistent  And can get great coupons  So glad it's close to home!!!!"}
{"text":"Truly amazing pizza; just recently discovered the greasy, crispy goodness of their deep dish after years of being very happy with original.  tip: if something comes with marinara, ask for pizza sauce instead: it's WAY better, and tastes more homemade."}
{"text":"THE BEST PIZZA IN ALL THE LAND. \"Nothing Compares to You\" by Sinead O'Connor plays in the background."}
{"text":"I just do not understand all the hype about this place. The first thing people said to me when I told them I was moving to Lakewood was something along the lines of \"Oh golly, you've got to try some of those Angelo's pizza pies!\" I came in with high hopes and left utterly disappointed. This place rides the hype train harder than former hype train conductor Johnny MoneySignsToTheSky Manziel. I don't think their pizza was necessarily terrible, but nowhere near the best pizza on the West Side. Hell, I wouldn't even consider them the best pizza in Lakewood. I've tried their pizza multiple times with a few different sauces, and every time I left feeling like it was somewhere between average and subpar. Also, as a  word to the wise: a pizza with alfredo sauce with cheese on top sounds good, but after two slices you're going to hate yourself. It was so damn creamy. Creamy is not an adjective I look for in my pizza.  Alright, I gave this place 3 stars, so obviously it wasn't all bad. I don't like their pizza. That's a fact. However, I did have some sandwiches and things there that were pretty good. I've ordered appetizers with my meal that were solid as well. Did they make up for the disappointing pizza? No. Were they good enough to keep this review from being a total hatchet job? I guess. That first paragraph was pretty rough though.  Final verdict: I compared their pizza to Johnny Manziel. That's a bad thing.  If I was faced with the choice between Angelo's and Pizza Hut it would probably come down to a coin flip and while the coin was in the air I'd secretly hope it came up Pizza Hut. If you must go here get a sandwich. If you must get pizza go somewhere else."}
{"text":"Best deep dish I've ever had!!! Our waitress was fantastic. Great atmosphere and music."}
{"text":"I would say if i was my old self \"I have tired every pizza in Cleveland.\" But that would be a lie, and my new years resolution is to tell the truth whenever possible. SO.   I have tired five pizza places in Cleveland. Two of them are my top favorite pizzas in the world.  This is one of them.  We live in Ohio City.  We almost moved to Lakewood because the IDEA of being ABLE to have ANGELOS DELIVER TO OUR HOUSE...... was almost too good to be true.    we love there Large pan cheese pizza. We love the pizza with artichokes and all the good stuff on it.  (I can't remember the name just now).  IT is VERY GOOD PIZZA. Great crust.  Its deep dish, but that just means it is thick with all that good yellow drippage from the crust when you bite into it.    I love this place.  And I am pretty sure, its my favorite pizza place in Cleveland cause you know.... i have tired them all!"}
{"text":"As usual, Absolute Best Pizza $ Can Buy.  We love their crust & sauce... never had anyone come close in my travels.  We visit every few months.  Beef pepperoni is awesome!   Dinner salad is huge.  Tried chips w/ dip this time.. nice app, large portion.  Patio is great too!"}
{"text":"Nothing beats an Angelo's pan pizza!"}
{"text":"Love 1/2 off nights!  Baked potato and taco are my favorites!  I love living within blocks of this place!"}
{"text":"Ordered delivery through Eat24 as it was the only italian place near my hotel and had decent ratings. Decent is a little generous - I'd say edible.  Ordered chicken alfredo and shrimp alfredo with a normal side salad and a caesar salad. The salads were nice and fresh but $2.50 for a caesar upgrade seemed a bit steep considering it's just making an all-romaine salad with croutons and cheese, they probably saved more on it because it didn't have the cheese blend, tomatoes, onion and cucumber of the side salad. I asked for garlic parmesan dressing and apparently they didn't have it because they sent me 3 random packets of dressing (luckily there was one I'd eat) - never called to ask me what I'd rather have. Notice that I said packets - their salad dressings are not fresh, they're Newmans Own.  The pastas were al dente, so that was a plus and the shrimp were well cooked. That's where my compliments end, The alfredo sauce was tasteless, luckily I had the foresight to order a side of the basil pesto. Unfortunately, even though it did add flavor it was oily, separated and the pine nuts were floating in oil rather than nicely blended in. I had to strain the pesto out of the oil to mix into our pasta to make it palatable.  The \"ciabatta\" rolls that came with it were cold, bland, dense dinner rolls that felt like those frozen bake at home ones that had been allowed to thaw but were never baked.  The chicken in the alfredo was bland, anemic, and almost looked like it had been sliced off a chicken \"loaf\" rather than carved from a nicely sauteed/grilled/baked breast. No flavor, and eating it made me think of a chunk of chicken lunchmeat rather than a slice of actual muscle tissue.  All in all, this tasted like cafeteria/fast food Italian - not a local-owned unique place. Maybe their pizza is better? I'll never know because I'm just passing through town and I know if I'm ever back in the area I'll look for somewhere better."}
{"text":"I've been going to Angelos for quite some time now. There pizza is so great and has so many options to choose from! Pepperoni and baked potato all the way. The pasta and other food from there I have noticed aren't always as good. The prices are kind of higher than what I'd like to pay for this place though."}
{"text":"Best pizza in Cleveland! Salad is good too. I'm a fan of anything caprese-related. The crust is crispy and perfect."}
{"text":"I've been to Angelo's a couple times and I will say that their pizza is good as long as you don't get too complicated.  And when I say complicated, I mean they have tons of really weird pizza combinations. Seafood pizza? Macaroni and cheese pizza? What ever happened to mushrooms, pepperoni, and green peppers? I'm sure that some of those different combinations are good, but I'm not that creative.  Service was good as well. Very attentive, speedy, and I always had refills.   If you do go to Angelo's make sure you order the spinach artichoke dip! You won't be disappointed. The portions are huge! I was full before the pizza even arrived, and I shared with 2 other people.   Where this place lost a star was their parking. God awful. Mostly meters and street parking. I hate parking there because we almost always end up parking on some far away side street and hoofing it."}
{"text":"It is the best pizza around. The most amaze balls of pizza deliciousness and well worth every penny. Word to your mother."}
{"text":"Angelo's has been my favorite for YEARS, consistently good pie time after time. The deep dish style crust really makes a difference. It isn't a traditional \"deep dish\" but my goodness it is amazing. I cannot speak highly enough of Angelo's quality, there is a reason they are continually named best pizza!  The service is always great, even when we have had an issue with our food they are quick to correct any problems. The updates they have made, the new bar and garage style doors, make it a great place to sit down and have a slice. Half off dine in/carry out on Mondays is always busy but who doesn't love a good deal!  BONUS - they are open until 2am on the weekends if you need a late night pizza"}
{"text":"I love Angelo's! I'm always a happy customer here. Their servers are so friendly. It's a very casual and welcoming atmosphere. They have so many different toppings to choose from for their pizzas. Also different sizes. There is something for everyone. They offer full size and half size pasta which is nice because I can't eat that much. And unless you're a really big eater I recommend getting the half order. Or get a regular size and save some for the next day!"}
{"text":"Excellent pizza. Its to die for, people. I can't speak for service AT the restaurant, but I can tell you they do fine with deliveries. Don't let those prices fool you. You may be paying around $20-25, but you'll be spending your money well on a fantastic meal. Go nuts, Lakewood!"}
{"text":"I'm updating this review. The pizza is still same quality, but the customer service?...Yikes.  My last few times I've called, I've been lucky to not be hung up on. I asked about this, and explained that I had been hung up on twice on this particular call, and I was on my third attempt. The snippy response from the snippy young lady was that THEY had poor phone service, and hung up calls if THEY could not hear.   Nice. Here's a thought sweetheart....Assume your customer CAN hear you, and say that into the phone before hanging up. Additionally, I have a difficult time believing they can't either update their phone service (seriously, the place is in Lakewood, not a third world country) or CALL THE CALLERS BACK, as every phone on the planet has caller ID now.   I will finally try Dewey's up the street, as this has happened too many times now. And I adore Angelo's pizza."}
{"text":"Pretty solid pizza. We ordered our pizza with sausage, green pepper and onion. We got a regular pizza, not a deep dish. The pizza was a good size and the price was reasonable. I've heard this is some of the best pizza in Cleveland, and while it was pretty good, it didn't stand out from other local places I've tried. Maybe the deep dish is better? They advertise on their website that they deliver, but when we called they said they only deliver catering orders to businesses. A little misleading, but not a huge deal. Overall, it was pretty good pizza. We will order again, but I don't see anything special about their pies."}
{"text":"3.5!   If you're hungry for pizza, Angelo's is the place to go. I came here with friends (fellow yelpers Joseph F. and Sheila F.) to celebrate a friends' birthday. We ordered many a round of pizza and pretty much demolished it all.   Angelo's is small and intimate, but it still had enough space to fit a party of 10-12 people along the side of the restaurant. It's on the west side across from this record store, which we went in to check out before we ate.   Some of my favorite pizzas of the ones we ordered: the seafood, the acapulco BBQ chicken, and chicken mac-n-cheese. We also ordered the taco one and margherita - taco was so-so, and margherita was just the usual."}
{"text":"What's the big deal? The pizza is good: nice crisp and doughy crust, fresh (but lukewarm) vegetables and a decent red sauce. There are lots of veg options too. The staff was nice. But I wouldn't say it was the best pizza in Cleveland. To my taste it was a much better version of Pizza Hut, not the mind blowing pizza other reviewers say it is. This is not pizza that's going to wow you. It's not pizza that's going to make you understand pizza in a new way, or make you taste pizza differently. It does its job, but doesn't take you to a new place. Everybody calm down."}
{"text":"When we lived in Lakewood, we always used to order Angelos and pick it up. Since moving to Tremont , we decided to order online for delivery. I received a call from Shawn (I believe?) stating that they couldn't deliver to our area, even though I already placed the order. What happened next?! The customer service was amazing! We went to pick up the pizza , and they apologized and also hooked us up. I will continue to order Angelos..not only for the amazing pizza but for the great customer service!"}
{"text":"Now I've only ever gotten take out, but let me say I get it atleast once a week. Their pizzas are amazing, and much to my surprise, so are their wings. Their delivery times reflect how busy they are (which also reflects how good the food is), definitely worth the wait. Voted the best pizza in Cleveland for a reason."}
{"text":"If you have a big group (over 4) do not go here on Monday.  All pizza is 50% off on Monday.  Otherwise I would recommend this joint everyday of the week.  The pizza is teh goods!"}
{"text":"Angelos is my go-to when I'm craving some really good pizza. They're a bit pricey, but the deliciousness is absolutely worth it. Their desserts are also great. Overall, they've got the best pizza in the area, hands down."}
{"text":"This place is the \"bomb\" of pizza places. In my opinion, the plain, deep dish pizza is the best around. Crust is amazing = only pizza I have ever had that you can eat cold and the crust is still crisp. Sauce is sweet and tasty. The dry, Italian wings are to die for! Best you will ever have. You have to try this place. Get the pizza/wing combo and you will be happy!"}
{"text":"Angelo's is a sort of staple in the Lakewood area...It's always packed. The pizza is usually very good. I especially like the pepperoni. You might want to get extra cheese though as sometimes it's sparse...On some occasions the pizza has been undercooked, especially in the larger sizes, with dougheyness on the inside underneath."}
{"text":"I am SOOOO happy that I finally got here! I had seen awesome reviews and me being a pizza fanatic I made my way into Lakewood in search of this gem!  It's SMALL inside, maybe 20 tables, a tiny wrap around bar, definitely a \"local\" spot.  There's a parking lot one block up designated for Angelos customers and two other surrounding spots.   We arrived around 7:30 on a Saturday and it wasn't packed, no wait for a table of 5. Unfortunately it ended there service wise, they were short staffed, that might even be an understatement. 20 min in and not even an introduction, no drinks, not even an acknowledgement of how slow they were being. Mind you we just came from edge water so we were hungry and thirsty! Finally got drinks, usual tap beers, some Ohio custom brews I saw.   We started with their beer battered onion rings, 15 min later and they arrived, they were huge! Came with a nice chipotle dipping sauce yummmmmm.   We ordered a large original crust pie half plain(cheese) and the other half fresh veggie. That took another 30 freaking minutes to come out( sigh) but I will say it was worth it. The crust was so crunchy and soft at the same time, the veggies were fresh and cooked perfectly on top of the mozzarella. It came out warm, not super hot how I like my pizza but I'm almost certain it sat waiting to be delivered. We kept getting different waitresses so I don't even know who to blame for the poor service.   Overall the food was awesome , great price, great taste, fresh to death, however I really was bummed at how slow the service was."}
{"text":"I do not understand the hype. Maybe it is because i am a transplant who doesn't get the \"cleveland style\" of pizza. Where I am from and accross the majority of this country a thinner, chewy dough with a little bite to it is the standard. Neopolitan style or New York style if you will.  The cleveland thick buttery bread like pizza is just nasty. Someone please tell me where i can get a real slice of pizza pie in this city?"}
{"text":"Love Angelos! When we order food, it's from here. Their pizza is awesome! We order the sandwiches a lot and occasionally the wings. The wings are hit or miss but the subs always taste great! Angelos never disappoints!"}
{"text":"This is really good traditional pizza that makes me think of pizza when I was a kid. And the crust is wonderful, just perfect."}
{"text":"The waitress was very good and very attentative.   We really enjoyed the pizza. It had a ton of cheese offering a great cheese pull with each bit.  The wings were good but lacked sauce. Maybe they were a dusting of spices rather than a sauce.   The pasta needs more sauce and the sauce needs a little more seasoning. It lacked basic components such as salt and pepper.   Overall we give 4 stars and may come back someday, but it's a 1 hour drive so it will probably be some time."}
{"text":"Angelo's is Good Stuff...  THE UP-SIDE: Great pizza!  Pleasing atmosphere.  THE DOWN-SIDE: The service can be a little rushed at times.  THE SUM-IT-UP: Yeah, go here now and stuff your face.  Yum."}
{"text":"Absolutely authentic Italian pie.  Firm crust that can handle ingredients, properly seasoned dough with a tasteful blend of oils. If you bring friends to Lakewood, send them home with an Angelo's pizza.  They'll ask you to bring one every time you visit them from then on."}
{"text":"Tied for best pizza ever!!! Pepperoni chips, deepdish mac n cheese w bacon!!! Nuff said.........tied w romeos a cle chain."}
{"text":"Angelo's was recommended to me by several friends and it did live up to the hype.  The pizza is great, and they offer half-off deals on Monday.  The service is kind of slow because they're always so busy, which is hardly their fault.  Great quality attracts business.   Keep up the good work!"}
{"text":"It's the best pizza in the Cleveland area. One suggestion is I recommend that they do a good cleaning job. It's a little dusty in the restaurant, and the tables need a better cleaning between guests."}
{"text":"Pretty decent overall. We were seated almost immediately, which I was surprised about. Ambiance was relaxed and the waitress was nice. Beer was served fast and so was the salad, which was pretty tasty. As for the pizza....we got the Italian sausage with mushrooms. It was very flavorful and the sausage/mushrooms were cooked perfectly. The only downside about it was that it was a little bit \"mushy\" and a little bit on the colder side (a little bit warmer than room temperature). I'd recommend it if you're in the area, but probably wouldn't go \"out of my way\" to visit it"}
{"text":"Best pizza around! I brought my brother here for the first time and he agrees. Every time I get great service and great food."}
{"text":"I have been meaning to go here forever and it was worth the wait (but then I think of al that time wasted not eating it!) The pizza was great and exactly what I wanted. This pizza has soft, chewy crust with a crispy outer edge, is cheeeeesey, and a healthy amount of slightly-sweet sauce. You can't go wrong once you get this trifecta down, whether you are ordering a plain old pepperoni pizza, building your own, or trying one of their specialty pizzas. We also had mozzarella sticks which, while nothing special--were PERFECT! I haven't had a good mozz stick in a very long time! Perfectly crispy exterior with a ton of gooey cheese inside. I already can't wait to go back."}
{"text":"Best pizza in the area.  Monday's are half-price day and night, and all pizzas are, surprise: half price.  The place is packed, to be expected, but at around 9:30 at night you could expect to get in without any wait, or maybe a little wait.  I don't wait for Mondays to go there as their pizzas are wonderful, served piping hot, and the crust is super fantastic.  It's worth every penny for what I get for my money.  I love this place.  I love doing their pizza for take out, the only challenge being not eating a steaming slice or two on the way home, which is almost impossible for me.  Yummy.  Reasonable prices.  Very good service.  Clean restrooms."}
{"text":"I've been meaning to give Angelo's a Yelp for a few years. There was a time in my life when I think I ordered Angelo's delivery at least once a week. I've visited twice recently and it's still one of my fave CLE pizza joints.  Angelo's pizza is well above average \"for Cleveland\". You may not find deep dish crust like this anywhere else in the area. Let me know if you do though, k? DOUBT IT!   Their specialty pizzas are all pretty bomba$$. An easy fave, and what I normally order, is the Seafood Pizza. When I think of it, I tend to have to wipe the drool from my chin.   Delivery is always timely.   Eat-in service has never been less than stellar either.   LUV Angelo's!!  Don't hesitate to give them a holllllaaaaaaaa!!!!!!!"}
{"text":"I finally made it to Angelo's!   Good pizza. Tasty pizza! Freaking delicious pizza! I'm a sucker for the buttery, deep-dish crust. I didn't go for any of their specialty pizzas, and there are quite a few of them. Very simple, lots of cheese pizza. Tasty. Service was mediocre at best. It took to rounds of me looking around the restaurant to get my wine re-filled. The MonAmi Concord is quite delicious. To sweet for me to have more than a couple glasses. Although I'm sure it didn't help that we were seated next to a small group of women, maybe mom's--at least one of them, with a small baby in attendance. Screaming infants in smallish restaurants makes for a really angry Kris. (Sorry for the third person referral but it really grinds my gears to hear that sound.)   Go for the pizza. Get the deep dish. You won't be disappointed. Ingredients are tasty, pizza styles are inventive. And its not too pricey."}
{"text":"I forgot how good Angelo's pizza is. I had it recently delivered and it was beyond. Great crust, great sauce, great toppings. I love. And that says a lot, because I really like pizza.   They also have a lot of creative pizza combinations that i wouldn't nessisarily try, but I'm glad they are there:)   I give it 5 stars because it definitely is in my top 5 pizza places."}
{"text":"All pizzas I give 4 stars except the seafood pizza;the seafood pizza I'd give no stars if possible. Only downside to all the pizzas is the greasiness;it upsets my stomach, but it's so good I put up with it afterwards. On the other hand, as a warning...don't get the seafood pizza. It is absolutely disgusting. It's so rich I thought I was going to throw up. My husband can usually eat a large himself bc he loves Angelos so much too but he only ate two pieces of the seafood pizza and felt sick too. I had to lay down to keep from getting sick..."}
{"text":"Best pizza in the LAND hands down! Great customer service as well and always get the pizza to me in a good amount of time. Love it"}
{"text":"We have only eaten pizza at Angelo's. We especially like the Seafood Pizza and Chicken Alfredo pizza. Recently tried the Philly Cheesesteak pizza and it was better than expected.  The dining room is small and loud."}
{"text":"I'm sure the food is great, but after waiting 2 hours to be seated, the hostess told us we'd only been waiting for 24mins and had 7 people ahead of us ( after having previously told us there were only 2 ahead of us). She just shrugged with a \"sorry bro\" expression. Didn't look into it at all. Great service, guys. Keep it up"}
{"text":"Normally I love the pizzas at this place but this is pitiful. Not only did the specialty pizza I ordered have topping on it not listed on the online menu, the the amount of specialty topping is pitiful. A \"Philly cheese steak pizza\" should have a good amount of steak on it. Just pitiful... 3 stars only because the driver agreed with me and gave me some money back!"}
{"text":"Great pizza and it is priced well . Also they have specials you should check out . Warm atmosphere, and good staff . A bit cramped during Evening if eating in . Parking can be a bit hard to find . But well worth it , really yummy"}
{"text":"Angelo's is our go-to pizza for first timers in Lakewood, who have never had the pleasure of a good mom-and-pop pizza shop. And really, it's hit or miss when it comes to the smaller shops. Not with Angelo's. Consistency is their hallmark, and what keeps people coming back.   However: If you're just getting the pizza: take a chance, folks. Try the spaghetti, it tastes like spaghetti. Try the eggplant, it tastes like eggplant. Try the wings, they taste like wings. Try the snozzberries, it tastes like I'm slipping another quote from a movie into a Yelp review.   Seriously, though. All the good things people say about Angelo's are correct. Probably the best pizza on the West Side, and I'll bet throughout Cleveland."}
{"text":"I grew up eating Angelo's. I remember eating here after every volleyball match. I remember ordering Angelo's delivery and pigging out with my mom while we watched movies. I remember walking over from PHS on lunch. I was anxious to get back after being away for more than a decade and desperately hoping that the pizza and fries were still as good as I remember them being when I was young. And OMG yes they were.  Me, my best friend, and her niece ordered a large pizza with half Mediterranean (it may be called something else) and half meat (Mike's Meat or something like that). We also ordered fried chicken because I wasn't about to leave without getting some Jo-Jo love. I wasn't a big fan of the meat pizza, but that's because I'm not a huge fan of meat. Likewise I didn't have any of the fried chicken because I'm not a fan of fried chicken. I did, however, get down on some of that Mediterranean pizza with its piles of broccoli, feta, tomatoes, and all sorts of good stuff. They certainly do not skimp on toppings here. And if heaven isn't a bunch of warm Jo'Jos dipped in cool ranch, I don't know what is. They make some of the best fries I've ever had. They are hot, fresh, not too greasy, and crunchy on the outside and creamy on the inside.   We are not girly eaters, but there was so much food we ended up taking more than half of it with us. All of that plus a beer and a soda was around $30, so not too bad for three people (but really four or five).  My friend's niece is in high school and it was kind of neat to see her recognize the other young people coming in from school, which is something I distinctly remember happening whenever I ate at Angelo's in high school. It made me realize that Angelo's has been around for so long and seen so many generations of high schoolers pass through its doors.  I wish there was an Angelo's down in San Diego because I would be all over those Jo-Jos like a PHS girl on Jo-Jos. Side note: They don't call them Jo-Jos in California and will have no idea what you're talking about when you say it. lulz"}
{"text":"My favorite pizza place around the Cleveland area hands down. The environment is fun, the staff is friendly, and the food is outstanding. The only downside is it's a small restaurant with long wait times. They do not take reservations, but they have a link on their yelp page where you can put in your name and it'll tell you how many parties are ahead of you. There's bars nearby to get drinks at while you wait too.  As for the food, YUM. There are so many different types of pizzas like baked potato and Mediterranean and all of it is great. The crust has a perfect crunch and texture to it where it's not too doughy and not too burnt. It's a great place to hang out with friends and watch some sports too at the bar. I always try to bring friends from out of town here, and they love it.   Highly recommend this place!"}
{"text":"Can't rate the food it never showed up. Ordered a couple of pizzas early in the day around  3 for a 5pm delivery.  At 6 I call to see where they are and after sitting on hold for 10 minutes they tell me they are extremely busy and it would be an hour and a half wait. If I ordered two hours early how can I have an hour and a half wait an hour after pizza should have been there."}
{"text":"Angelo's is the go to for gourmet pizza. On the pricier side but well worth it! Their sauce is perfect.. Not too sweet but not too tomatoey. Love them!"}
{"text":"Listened to the hype and decided to give Angelo's a try. Found out that it wasn't hype at all! One of the best deep dishes I've had. I ordered a large bacon and pepperoni-daaayum! The bacon was well done and just perfect. The sauce was light yet super flavorful. And that crust, just crispy goodness. Angelo's is legit!"}
{"text":"I came in on Wednesday night to eat with my friend while I was visiting from out of town and we did not realize the dining room had closed earlier then the delivery but the hostess was so kind and told us to go have a seat and our waitress was wonderful never once did we feel rushed from the Cook to the manager to the waitress we felt so attended to the food was wonderful the service was superb. My friend had had an awful day one thing after another and that great act of kindness that they did by opening up their restaurant just for us to serve us and to treat us with such kindness was amazing I will recommend this restaurant to all as well as come back to it again when I am in town Jamie and Heather were the hostess and waitress. I had the baked ravioli with a homemade creamy Parmesan dip which was blend it and I had angel hair pasta with marinara sauce and my friend had the chicken Parmesan everything was delicious. I can't thank you enough for your kindness"}
{"text":"First time having Angelo's tonight. This is GOOD pizza. So why three stars? The sauce is so incredibly sweet. Too sweet. WAY too sweet. This is coming from the girl who would eat ice cream for 3 meals a day if it wouldn't kill me. Please Angelo's - lose the sugar and you really have something here..."}
{"text":"Their pizza is pretty good, but not for the price. We asked for a medium pizza and the lady on the phone straight up told us that they don't have medium pizzas because their large is what other stores call a medium. A \"large\" is $16, so we essentially paid $16 for a 2 topping medium pizza. I would probably have given 3 or 4 stars if I didn't feel like I was being ripped off."}
{"text":"One of the best pizzerias in Cleveland! Go for it! Will never be disappointed!"}
{"text":"My husband and daughter and I were stuck in possibly the worst hotel in Cleveland, exhausted from a long drive and so very hungry, so I decided to Yelp to see what good pizza joint might deliver to us. I picked Angelo's because of the reviews, especially the mention of an awesome Roasted Garlic Parmesan Dressing (and of course all the good things people had to say about the pizza). The girl answering the phone was less than friendly (bordering on angry) and for a couple of appetizers, a side salad and a 12 inch pizza I think we ended up spending over $50! To their credit the food came fairly fast (thank goodness because my toddler was about to mutiny) and the first thing I opened up was the salad, and what do I see? A Newman's Own Roasted Garlic and Parmesan dressing packet! Now of course on their menu they never claimed to make their own dressing (although seriously? shouldn't they?), but I was so annoyed at ordering from a place specifically for a salad that I could have made for myself for MUCH less. The appetizers (which were mostly fried) were mushy and tasteless, their pizza was akin to a Pizza Hut pan pizza with a slight aftertaste (maybe margarine? I'm not used to fake butter flavor, I think that may have been it). All in all I was annoyed at the price and quality, and frankly at my fellow Yelpers who led me astray on this one.   Save some money, go to Pizza Hut!"}
{"text":"I have been buying pizza from this award winning establishment since 1984.  I once heard the owner say you can be the best or you can be the cheapest. There is a reason they keep winning Best Pizza year after year. Now its your turn to find out why.  I recommend the 5 item deluxe with an extra side of sauce. Just don't get too upset if you have to make a new line item in your budget titled Killer Za. You have been warned. :)"}
{"text":"Celebrated a late Christmas with my Family! My 4th Time here over the years and it's been great every time. The beer selection is awesome and the pizza even better!!! Service was great as well. We had a large party and they were very accommodating."}
{"text":"The pizza crust. Really thats what it all comes down to. Sure the cheese and sauce help, but really without the crust, there is no pizza. That being said, the crust on Angelo's Pizza is heaven. It's a nice buttery pan crust with a crispy, crumbly situation going on at the bottom. The sauce and the cheese are nothing to scoff at either. If you're looking for good pizza in Cleveland, really you don't have to look further than Angelo's."}
{"text":"An ode to Angelo's crust: You're somehow crunch and soft at the same time. You're flavor delights me senses. You can hold so many toppings. When you're gone I miss you instantly.  Never change, crust. Never change."}
{"text":"the best deep dish pizza in cleveland. i travel a hour just to eat pizza here.  there topping are great and you never have to ask for extra cheese service is fast."}
{"text":"My favorite pizza place in all of Ohio, by far.  The crust is so good - the little crumblies on the bottom, the crispiness.... my wife is not a crust fan in general, and she loves this crust, which is high praise indeed.  The sauce is incredible - it's sweet and robust and unlike any other I've had.  The toppings are phenomenal - I highly recommend pepperoni/mushroom, and ham/bacon/pineapple.  Holy cow.  No pun intended.  Just awesome pizza.  I drive here from Akron every year a couple of times just to get this pizza.  And it's the only place in Cleveland I do that for.  I can't say enough good things about it.  And... if you're really lucky.... there is a business a few doors down where a cat or two lives, and sometimes they are in the window, and they are extremely cute and friendly and will roll over for you.  As if there weren't enough great reasons to go here!  What the heck are you waiting for, anyway???? Sheesh!"}
{"text":"Used to be my fav place. Was there a couple of days ago with the hubby. Rude, rude waitress. Crabby as hell.  Pizza was cold in the middle and luke warm everywhere else. Forget mentioning it to the crab. Skimpy on the sausage, too.  The place has gone down hill.   Too bad I can't give it negative stars."}
{"text":"Heard wonderful things about this place so we decided to try it out. Called in our order (2 large pizzas and a Greek salad) and was told it would take 15 minutes. We drove over to pick it up, and the place was packed, which we took as a good sign. We picked up our order and got about halfway back to Westlake before we opened the boxes and realized they had given us the wrong pizzas. We drove back to rectify the mistake and found out they had given our pizzas to someone else and would have to re-make them. When asked if we could get a discount because of the mix-up, they said \"you already using a coupon, so no.\" Not the way they should have handled it, in my opinion. The pizza itself was ultimately disappointing. The sauce was too sweet, the dough was bland at best, and the \"large\" pizzas were small for the price (even with the coupon!) The \"entree\" sized Greek salad (while tasty) was small for the nearly $10 price tag. Overall, we were very disappointed after hearing such positive reviews. Truly great pizza places have three things in common: Quality ingredients, affordable prices, and good customer service. This place seems to lack all 3, and we will not be returning any time soon."}
{"text":"Ehhh.... have ordered multiple times from Angelos and seems the last few times it hasn't been nearly as good as it was a few yrs ago.   The toppings were very skimpy and barely any cheese or sauce.  I know this is my complaint always at pizza places.... the toppings are skimpy... but damn if I'm gonna pay $25 for a pizza I don't want all crust.... and speaking of the crust I always compared theirs to Jets... but I gotta tell ya Jetts has been better lately... yesterday's (March 22) was hard and not the typical soft greasy that I had liked in the past.  Idk call me crazy but I wonder if it has anything to do with the 20 kids around 21 and under making the food?  Probably won't be back.... unfortunately.  I gave it 2 tries... months apart and still wasn't pleased."}
{"text":"Pizza fan? Good for u... not me! :-)  I am never excited about pizza, except when we're on the road to and from Cali. We always stop in to Angelo's for dinner: salad bar, pizza, sometimes a mug of beer. Or their lunch buffet which includes all the goodies and delicious chicken and Jo Jo potatoes. Today we had the buffet and I asked if I could have a few taters done crispy and they brought me a full plate of them!! YUM!!! The people running the place are always so friendly... we love it! Our only complaint is that they don't have an Angelo's in Eugene. Too bad because pizza parlors in our town never ever pile on the toppings like this... u can order a smaller sized pizza here because of that! We discovered this little gem on accident just over 2 yrs ago when we made a stop in Phoenix for gas.                                                                           They don't make pizza parlors like this anymore."}
{"text":"I feel bad giving Angelo's just two stars but PIZZA is in their name so PIZZA is what I'm rating them by. That being said, their pizza is very tasty, they don't skimp on toppings, the sauce is tasty, sweet, and spicy and the crust is crunchy and quite savory. So why two stars? The grease factor. These pies are among the GREASIEST I have seen from a pizzeria. There is grease pooled atop and beneath every pie. You'd need a roll of paper towels to even make a dent in one of their large pies. Even after sopping off as muc as you can there's enough grease in a slice to turn my stomach into knots and have me running for the \"Pink Bismuth\" or ginger pills(and before you judge, I do NOT have a sensitive stomach). Ignore their pizza and sample from their other menu items. The wing sauces are standard(the bourbon is quite good). I like this place a lot. Just not for their pizza."}
{"text":"Don't. Don't. Don't believe the hype.  The first time i went to Angelo's was a few years ago. Based upon that one time, I would have gladly described Angelo's as \"the best pizza in Cleveland.\" Granted, the wait time was pretty long (even after my party was seated), but I expected as much with a small popular place. Then, I left the area and only recently returned to Lakewood a few months ago.  Something drastic must have happened to Angelo's in the meantime.   I've only ordered take out since I've been back, and each time has made me wonder why I had such a great time before. First off, the pizza never seems as hot as it could be during pickup, almost as if it had been laying out for some time. I expect that from delivery pizza, but not when I pick it up right after it should be in the oven. Second, on several occasions, the pizza seemed to be all bread and sauce. The cheese and toppings were on a very thin layer that slid almost completely off the slices when picked up. The sizes seem wrong too: a large is a medium, a medium is a small, etc.   But what really ticked me off (and caused me to write this review) was tonight's pizza. First, they gave me the wrong pizza. I called back after spending almost $20 on a pizza, and they claimed that I ordered something completely different. I told them no, that was not what I ordered, and they promised to deliver me the pizza I ordered ASAP. Almost an hour later, my new pizza finally arrived -- still somewhat subpar. I guess the lesson here to to only eat Angelo's in-store.   For the high price, you would think you were getting what you paid for. There are better and more cost-friendly pizza places out there."}
{"text":"Everything here is so delicious, wings pizza and pasta it's pretty hard to go wrong. Food is always good and there is never a mistake by the staff. However if there is one complaint I have I wish they would have kept the hot garlic parmesan wings! They're own version of it is so much better than other places with that sauce. But they stopped selling it :("}
{"text":"This pizza and salad place in Lakewood has so many Yelp reviews with 4star rating that we decided to give it a try. Casual ambience. It is reasonably priced. Thursday afternoon was busy.  The service was a tad bit slow but the food was pipping hot which is what you want when having pizza or wings.  Chicken wings were tasty and fresh and juicy. The hot wing flavor is adequately tangy and spicy, the Tuscan garlic dry rub could have used a little more flavor. It was well done. Small veggie pizza original crust was fresh and the base wasn't chewy. They have the deep dish option too.  Tiramisu was decadent, and yummy and the serving size was huge for the price, we were stuffed but it was gobbled in no time. Be prepared to burn some calories or skip dinner after your visit here which is definitely worth a try."}
{"text":"The crust here has something special going on with lil bits of tasty crunchies - my guess is lightly garlic-salted breadcrumbs, but I am not sure. Craft beers could be had for as little as $4!"}
{"text":"Went down on a weekend and there was a short wait 15-20mins. Ended up getting Mozzarella sticks and the traditional pizza with pepperoni. Very good pizza and sauce, crust was decent. Good selection of beers as well. I've had pizza in New York, Boston and Chicago and while I have had pizza I liked better in those cities, this is one of the best you will find around NE Ohio."}
{"text":"Pizza is good if you carry-out. However, every time I dine-in, service has been terrible. Very unorganized staff and was served cold pizza. Took over an hour to get a pepperoni pizza. Hostess sat a party of 2 at a large table when there were 3 large parties waiting and plenty of 2 tops available. 3rd time trying today and will definitely not be back."}
{"text":"Angelo's definitely is the go to pizza  place in Cleveland. My friends went with the house pizza which had the meatballs and sausage and the Bbq chicken pizza with banana peppers. Both were absolutely delicious. It's a thicker style Neapolitan pizza. Different and quite delicious. Great job Angelo's. PS. Just had their chocolate chip and snickerdoodle cookies. OMG. AMAZING."}
{"text":"The only reason this place could get less than five stars is for the price or the wait.  It is by FAR the best pizza in all of Cleveland, in my opinion. It is so amazing - have to get the deep dish crust! It's a little pricey for the amount of food you get but I still say it's worth it. We wanted to go on a Monday evening and the line was out the door for a wait - so we drove home and ordered delivery. A must-try if you're a pizza fan!"}
{"text":"One of life's most important questions can certainly be, \"who has the best pizza in town?\" Well on the west side, it definitely could be Angelo's. The pizza is arguably the best on the west side. Do they put crack in the sauce? A friend of mine thinks that is their secret. Whatever it is, they make a really good pie. If they're not legendary, they should be."}
{"text":"We were there on the evening of Saturday March 12, 2015 for the first time. It was packed. We waited about 20 minutes. We placed our order and it about another 20 minutes before our pizza arrived. Trust me it was very good. Good atmosphere, there were even people lined outside to come in when we left. Definitely we will return to the Best of the Best Pizza in 2015."}
{"text":"I won't go so far as to say it's the best pizza I've had, but it's pretty darn good.   They have a lot of specialty pizzas. The Seafood Pizza was phenomenal, complete with garlic butter, shrimp, crab meat (I think it was imitation), spinach and cheese. One of the best fu-fu pizzas I've ever tasted.   As other reviewers noted, it's definitely higher in price. But all in all, a great place."}
{"text":"I've had pizza in Chicago, New York, and other places and to me this pizza is one of they best I've ever had. For those in Cleveland who have never been here you must try it. If you do you may never go anywhere ever for A pie. I'm definitely going to be making my way back here real soon."}
{"text":"Angelos is an oasis in the desert of crummy pizza on the west side of Cleveland.  I had lost my taste for pan pizza until I tried Angelos' phenomenal hot or cold."}
{"text":"We waited for an hour and half to be seated. Let me tell the wait was worth every minute. The customer service was impeccable. The food......delicious. We ordered an XL deep dish pizza and it was hot and fresh. The sauce was tasty. The toppings generous. The crust.......heavenly! The price is unbeatable on Monday's."}
{"text":"Great Pizza, Great Atmosphere, and Good local beer. Went here tonight to get some pizza, so freaking happy I did. Everything was delicious from the crust to the toppings. The local beer was a nice mix with the pizza. Just wish the mixed drinks were not as expensive."}
{"text":"Okay so where do I start, this place is a long time family owned business in Lakewood. It's very well known for their pizza. I've had on numerous occasions and I have mixed feelings about it. Angelo's is definitely an overrated by quite a bit. Some of their pizzas can be quite greasy and their sauce may need some sugar to tone down the acidity of it. However I think they do really well with their different kinds of unique pizzas that you can't find anywhere else, from BBQ, to chicken Alfredo, to the hawaiian pizza. Their soups, salads, and other sides are really really good suprisingly. I feel it like their food is generally really pricey for some of the cons you get out of them. My last concern is that their staff can be quite rude from time to time by refusing to take a pick up order because it was busy, a little bit of lacking in the social skills.  +Unique selections of pizza +Some Pizzas are really really good when are made right +Can eat in, not many places do that. +Really good soups/Salads/Sides  -Staff can be rude at times, maybe i'm just unlucky -Some of the pizza seems like they have a lot of grease on them -Lacking consistency? Really acidic sauce sometimes. -Slightly pricy."}
{"text":"I have been ordering food from this place since I moved to Cleveland. They have excellent choice of sandwiches. Print delivery of food. Try Cajun chicken philly sandwich it's best."}
{"text":"I think this is the best pizza I've tasted on the West Side, although I have to be in the mood for it.  Sometimes it comes across a bit too 'thick' and Pizza-Hut-ish.  Still, good stuff.  I live on the East Side, and when my wife picks me up from the airport we often stop here on the way home. Get the Angelo's special; HUGE, multi-topping pizza for $16.75.  Feeds two people for two days."}
{"text":"Bland city, across the board.  Angelo's Pizza come fresh from the back of a Sysco truck to you.  We had bosco cheese breadsticks, cavatelli with meatballs, and a large pizza.  Everything was very flavorless and quite short of special.  First, the breadsticks are just the cheese-filled breadsticks Sysco sells.  There's nothing good about those things--it's heat and serve blandness.  The bread has about as much flavor as a slice of wonder bread and the cheese tastes like a really bad stick of string cheese.   They came with side of marinara and a side of garlic butter.  The marinara was sweet--that's about all I can say of it. It didn't even have much herb or spice flavor.  I couldn't even get any garlic flavor out of it.  The garlic butter was good, but it's just a pre-packaged Sysco garlic butter cup similar to what you get with a Papa John's pizza.  Thumbs down to this dish.  Note, now that I revisit the menu, the entire appetizer section reads like a Sysco fried foods order sheet.  There's no appetizer you can't get for cheap in your grocer's freezer section  at Angelo's.  The pasta was terrible.  The pasta itself was overcooked.  It's the same cavatelli everyone in Little Italy sells during the feast.  The flavorless, no-texture, pasta that's mushy and without much texture.  The sauce was quite bland.  It was the same sauce from the breadsticks.  I poured some garlic butter into the mix to make it palatable.  The meatballs were also incredibly bland.  The chunks of onion were so big that it reminded me of meatloaf, but without any seasoning.  This was the worst meatball I've ever had.  The pasta came with a sad excuse for a salad.  It looked like pre-chopped salad mix with a handfull of shredded cheese.  The salad came with a packet of Sysco croutons and a packet of Neuman's Own dressing.  We ordered balsamic vinaigrette--they can't even make that in house?  At least Neuman's Own is a decent tasting dressing.  The Pizza was just ok.  It wasn't as bad as everything else, but it wasn't something to celebrate.  The toppings were in the right proportions and the pizza looked nice.  However, I don't understand all the great ratings.  The pizza is pan pizza, which gives a nice crisp to the thick crust.  If you like pan pizza's, then the format here is right up your ally, but the flavor of the dough might leave you let down.  The dough and the crust was no different than a Pizza Hut pan pizza.  No different at all.  If you think otherwise, I challenge you to a blind taste test of crusts and you'll not be able to tell the difference.  Sorry, this crust was nothing but white bread.  Pizza dough should have a flavor that comes from the dough fermentation.  This lacked that 100%.  The sauce, like the pasta, was sweet and lacking in garlic and spices.  At this point, I'm thinking they either try to doctor up a pre-made Sysco sauce, or they just mix large cans of tomato paste and tomato puree with not enough seasoning or cooking to make a quick sauce.  This pizza would have been a loss had it not been for the flavor of the pepperoni.  The other toppings we had on the pizza looked like they came from a can.  Nothing seemed fresh here.  As far as I'm concerned, just get a Pizza Hut pizza and call it a day--it's going to be about the same.    I wouldn't be so harsh, except for that all this cost about $40.  It's not worth the price.  This joint is all hype.  There are not really many \"great\" places for pizza in the Cleveland metro area, but of the few that are, this place is not part of the exclusive bunch.  There are much better pizzas to be had.  Perhaps if this was the closest pizza place to my house, I would be all about it, but I still wouldn't call it the best.  I would just call it convenient."}
{"text":"By far the best Pizza in cleveland! Deep Dish is amazing! Also we really like the atmosphere and have never had a bad waitress."}
{"text":"Angelo's has very good pizza, fried chicken, potatoes and salad bar at reasonable prices.  It has a party room, TVs and video games.  We especially like the senior value pizza/salad bar combo. The pizzas are above average in flavor and quality of ingredients. The wife prefers the Hawaiian pizza with lots of Canadian bacon and pineapple. I prefer tomatoes and olives with sausage.  The staff are very accommodating and we have had some successful group lunches in the private dining room."}
{"text":"Two times have I gotten take-out pie from Angelo's, and two times has my mouth been happy with the choice.  As others have commented, their sauce is delicious, and the crust is perfect.  A word to the wise, pizza is \"greasy\" when there is actually cheese and sausage on it.  Both of those items weep juices when heated, so it's not unheard of for a pizza containing those items (not to mention being a deep dish crust, which has oil in it) to be a little on the wet side.    Another reviewer commented that they skimp on ingredients...if this is true, why did another comment on the grease?  Perhaps it's the KIND of pizza each ordered?  On both occasions, the pizzas I have eaten had plenty of toppings that did not dribble off the crust when I picked up a slice.  This, to me, is perfect pizza.  I can't comment on the service, because I've done takeout/delivery on both occasions."}
{"text":"The pizza is delicious one of my favorite crusts.  Also the appetizers hit the mark every time.   This place is good if you want a date night or a night out with the family and kids.  I have never been disappointed and always wish that there were more."}
{"text":"Always good the wait is worth it love the fried breaded mushrooms and the pizza is so good!  been there at least 6 times already  wish there was better parking though"}
{"text":"My lunch bill $25.$$. Twenty five dollar and change for a beer, iceberg lettuce salad, and $13.?? For a small pizza.... Waitress was rude took her time,  my pizza was actually cold, I asked her to heat it  .... It as just warm  .... The pizza was made oh instant dough or something. Not good.... I felt bad I had brought two other retired women thinking it was going to Be a great lunch.  I felt so bad and apologized to them all the way home. I do not recommend this place. The waitress kept saying her uncle owns it. That started when we ordered.   Not a good experience ,,,,, not at all value for my money"}
{"text":"The overall rating for this place is 4.8/5. Below is the details of my review.   Food: 5/5 - 1st visit: 4/5 On our first visit, we ordered a family-size salad and Supreme pizza. The overall food was great, except the sausage in the pizza that we don't like much. Please note that there is nothing wrong with the restaurant and their food. We just don't like the taste and smell of some sort of herb in the sausage.   - 2nd visit: 5/5 For this visit, we tried the other pizzas that do not have sausage. We ordered large pizza with a half of Philadelphia cheese stake pizza and a half of Hawaiian. I love that they can make half and half on their specialty (as long as it use the same sauce), which a general pizza place does not have this option. We also ordered Parmesan chicken wings. Everything is amazing! We love all food we ordered this time!  Price:5/5 The food price was very reasonable here.  Service: 4/5  The overall service was good. Everyone were friendly and polite. I love that I can put my name on their waiting list through the feature in Yelp app, so I don't have to wait for my table too long. It is a great feature that other busy restaurant should have.   My experience at Angelo on the service aspect from both visits are very similar. The service was somewhat slow, especially the attentiveness of the waitress to check with our drink and water after the food was served. The waitress (different persons) did good job both times we visited when it comes to the promptness in taking drink and food order; however, the service after food was served was not quite good. It almost feel like our waitress disappeared since she brought us food. I don't know whether this issue happened because we sat at the patio or not. I will get a better idea if we happen to be seated inside next time.   Atmosphere: 5/5 The atmosphere of this place is nice. It is good for a low-key dining. Nothing fancy. I love their front patio. It is very good spot for people watching on the summer weekend. But, like I earlier mentioned, you may get a slower service if sitting at the patio. It is kind of trade-off thing, I guess.  My tips for people who have never been at Angelo and would like to visit this place are as follows:  Tip#1: Use the Yelp app to put your name on the waiting list probably 15 minutes before you will arrive the restaurant. This restaurant is quite busy, especially on Friday and Saturday evening.  Tip#2: You can order a half and half pizza, even for those speciality pizza, as long as they use the same sauce.    I hope that this review can be useful to the Yelpers somehow. Enjoy your meal!"}
{"text":"Amazing pizza, I know some people complain about the small space its in but its so worth it. Will return soon!"}
{"text":"Hands down the BEST Pizza in Cleveland!  whether you order wings, salad or pizza you will not be disappointed."}
{"text":"Really good pizza. A little bit more expensive what I would like but definitely tasted good. Open late nights and pick up are an ease."}
{"text":"Me and my boyfriend order Angelo's pizza at least once a week, mostly twice a week. He gets banana peppers and pepperoni, and i like the veggie, both thick crust. Best pizza in the area! This is the kind where you start to get a hankering for pizza and then you think \"OMG I WANT ANGELO'S,\" then you repeat your idea to a friend and they agree, and before you know it everyone you are with is satisfied and agrees it's the best pizza around."}
{"text":"We absolutely LOVE Angelo's! The pizza is delicious, the service is always friendly, and their breadsticks are to die for as well! The only downside is that sometimes the wait can be really long, and there isn't a lot of room to wait between the seats and the door, so it can be uncomfortable. However, it's worth it!"}
{"text":"Great neighborhood spot in Lakewood for delicious pizza in a pedestrian retail location. (Plenty of parking along the side too). Their menu features the  standards of pizza and salad with lots of varieties to choose from. Build your own. They have both round and deep dish round. Prices are reasonable. Mondays feature half off pizza. Place gets crowded. Wait staff is very attentive. Bar has lots of favorites and several TV's to keep you entertained. Outdoor seating is a huge plus."}
{"text":"The one and only rules for buying pizza here is it HAS  to be deep dish! If you get regular crust there is no point, alot of money on average pizza BUT  if you get the pizza deep dish(which is amazing) is pretty much worth the high price you pay for the pizza! Me and my wife found a secret about ordering the pizza was if you ask for the pizza \"well done\" it turns out to a perfect golden brown and makes the pizza just that much better! Good thing I am writing this review now because If it was when they were open I'd probably have to order a pizza now!"}
{"text":"I judge every pizza place based on their mushroom and green pepper pizza. There wasn't anything about their pizza that needed to be adjusted. It can't be improved upon."}
{"text":"Great food and despite how crazy busy they can be, service is very good. Friendly and helpful."}
{"text":"Maybe because I'm from NY/NJ that it's hard to compare any pizza to the pizza I'm used to, but we went last night to Angelo's and I would be totally be ok not coming back. We ordered the Caprese salad, and the pieces of mozzarella looked like the small pre cut mozzarella from the supermarket & the small piece of tomatoes as well all over a huge bed of lettuce. It was not worth it. The pizza came out next, we ordered a large. The pizza was the size of a small personal pie. The pizza tasted and looked like a upgraded version of Dominio's pizza. The atmosphere was pretty nice, we sat outside. There are signs all around saying no smoking, and the table next to us stood up from their seats and were smoking cigarettes. I am 4 months pregnant and I had my 18 month daughter with me, so this was not okay for me. I had to get up and walk to the other side of the restaurant for about 15 minutes. The waitresses never said anything to them. Aside from that, there were a group of 4 people at the bar watching TV, obviously drunk and started screaming profanities at the bartenders, and then made a scene and left still screaming. This isn't the restaurants fault but it's just not what I was expecting, especially with my daughter there. I won't ever be interested in returning here again."}
{"text":"A staple for anyone who lives in Lakewood (or the surrounding areas), Angelo's is where you go for pizza. Period. Their crust is buttery and crumbly, the toppings are always fresh and the sauce is nice and tangy. Delivery is usually pretty fast and the prices are on par for the quality. Also, the interior has recently been expanded to allow for more dine-in seating. Despite this, the place is always slam-packed, which I like to think is just a testament to their popularity. My personal favorite is the meatball green pepper combo. Yum!"}
{"text":"I've been here numerous time, before I was a Yelper. Normally I wouldn't give five stars or consider unless I absolutely love the place, and I do love Angelo's. There was one thing that throws me off course and allows me to give my typical four 's and that was lack of the usual awesome service. Yes, it's Monday, 1/2 off pizza, but you should receive the same service always. Now, the food outstanding bas usual. I got the Mediterranean gobs of veggies, with an olive oil sauce. The wife Acopulco chicken almost a Hawaiian but not. Garlic Parmesan wings were one of the best in that flavor that I've had. So, over all awesome except the server we had, but it happens from time to time."}
{"text":"This is defenitly one of the best pizza spots ohio has to offer this place is always busy but thats for good reason their pizza is well worth the wait and the drive for me its the sweet pizza sauce extra cheese is a must you will not be dissapointed stopping gere for pizza no matter how long the wait."}
{"text":"I know a girl from Chichen Itza whose name is LISA Tries to seduce every guy that MEETS HER She never really dates because nobody TREATS HER Right, in the night, and their games are WEAK, SIR  When she plays hockey nobody BEATS HER She plays tonsil hockey too if a guy PIQUES HER Interest, but only for a few WEEKS OR She gets bored and promptly deLETES THE  Number from her phone and flies to IBIZA Where she takes a pill which she got from her TEACHER Avicii thinks she's so cool he just sprung a LEAK, SIR And he's asking Mike Posner to give back his pair of BEATS OR  He's gonna tell Mike's girlfriend that he CHEATS HER That's the type of news that always FREAKS HER But all this aside, to quote the girl from Chichen ITZA The best pie in the world is from ANGELO'S PIZZA!  WHAT!  Hey, it may have taken awhile, but we got there in the end. That's what he said.  What to get: Deep Dish version of Loaded Baked Potato Pizza What else: Just get that, please. Trust me. Just that, and please get it now Is there a heaven or hell?: I can say with certainty there is a heaven Where is it?!: In the arms of the Angelo's, far away from here... Wait, that sounds like the Goo Goo Dolls: Let it slide. And I won't tell them your name.  Oh how I loved that movie. City of Angelos. It was all about this pizza. There must be an Angelo playing with my heart. Man I feel sexier than Jessica Alba in \"Dark Angelo\" right now. I feel like Tom Hanks in that one scene in \"Angelos And Demons.\" I'm feeling like Angelo from Buffy The Pizza Slayer. Oooh look at me go.  Angelo's Pizza is simply one of the greatest pizzas you will ever eat. It's easily the best in Cleveland, by a distance the best in Ohio, it's probably better than any other I've had in the Midwest (sorry Chicago, still love you), and it's up there with the best of Buffalo and New York City, believe it or not.  But there's only one pizza you should get here. Some of the others are good too, maybe even really good, but only one is truly world-class and legendary. That is the deep dish Loaded Baked Potato Pizza. It's made with a garlic butter sauce instead of tomato, and has chives, bacon bits and mashed potatoes all over it. This sounds like something I would hate, and call \"hipstery\", and granted, they have some hipstery pizzas sometimes, but it's not really a hipster place. It's a bit of everything, but more than anything, it's a \"real\" Cleveland Pizzeria, a bit higher end than most, with one particularly world class pizza.  It takes a lot for me to deem some weird \"Loaded Baked Potato Pizza\" as one of the 5 best in the country. In fact, it's very out of character for me. But that's how good it is. Just make sure you try it hot, and make sure you come hungry. You can't get it by the slice, so get a small if you're by yourself. It's worth it.  The waitresses here are pretty stunning too. But not nearly as stunning as the taste of that pizza. Not that I have tasted the waitresses (or waiters). And even if I had, I wouldn't tell you. But I doubt it'd be better than this pizza. You never know, though.  I know a guy and his name is ANGELO He makes amazing pizza and he lives in a BUNGALOW He hates comic books but he really loves MANGA DOE And his fave song is \"Copa\" by Barry MANILOW You should see the sausage that he's packing DOWN BELOW But on his pizza, skip the sausage, because otherwise you'll NEVER KNOW The miracle of Deep Dish Baked Potato Pizza - NOW YA KNOW That Ohio's best pizza is the DDBPP at ANGELO'S  WHAT!"}
{"text":"A HUGE shout out to the team at Angelo's.  On Thurday night, 5/16/13, they donated 100% of the sales of pizza to help the 3 women that were held in Cleveland for over 10 years.  The support from the community was amazing but the team at Angelo's was beyond words.  The entire staff donated their hours to support the cause.  What an amazing way to support the local community and to help those around us.  Thank you Angelo's for the best pizza and the biggest heart in Northeast Ohio."}
{"text":"Angelo's has amazing food and a wonderful staff. After a really bad day, I  just wanted to sit and have dinner with a friend. We arrived just as the dining room was closing. The hostess happily sat us anyway, and our server insisted that she was happy to wait on us (even though we were the last customers). Our food and drinks were great! I highly recommend the baked ravioli with parmesan dip. I can't thank Heather and Jamie enough for their courtesy and kindness. Their thoughtfulness and outstanding work ethic are certainly appreciated :)  I thank you again for your hospitality."}
{"text":"Decent pizza, casual indie pizza place, one of the top handful of pizza places in Cleveland probably. Always a group of teen boys or teen girls there on any given night, but it's also a casual date place. Years ago this was Lakewood's go-to hardware store and the Angelo's people saved the outline of the original 1950 era sign and retrofitted it with the new Angelo's Pizza logo, which was a nice touch: and now you've learned a new fact about CLE!"}
{"text":"love the deep dish pizza with mushrooms & sausage.  my favorite pie in town.  the wings are also good.  take out or dine in available.  located in Lakewood near Lakewood high school at Bunts & Madison."}
{"text":"I love this place.. Go on a Monday half price the wings are also good. I have never had a bad experience here the food is always hot and fresh. But it's always crowded the staff is also very friendly and now they have a bar and they have special every day.."}
{"text":"I believe I died and went to pizza heaven! Hot,fresh and delicious are the perquisites of this establishment! Absolutely delicious, other pizza have a seat to this leader. Want a great tasting pizza? Then take a drive to Lakewood,no car then hitchhike, bus, or walk! Just get there,AWESOME!"}
{"text":"Great pizza place. The pizza was very good, but not the best I've ever had. The prices are reasonable. The service was mediocre at best. Our waitress never refilled our waters, and only offered once we were finished with our meals. Atmosphere is very cozy."}
{"text":"You can't tell someone from Chicago that \"this is the best pizza you've ever had\". You just cannot. \"In town\", perhaps. I've had Angelo's three times now and I gotta say, it's not the best pizza in town. Don't get me wrong it's better than average, but it's not life-changing and I can't imagine craving it.  The crust is that great mix of chewy inside and crispy outside, the sauce is good but I keep hoping for less sweet and more spice, the topping options are numerous too (what's up with the banana peppers?) but yeah, it's not the best."}
{"text":"I loved this Pizza place!! Columbus needs a spot like this!  We got a pan crust, it was very filling, I had left overs. The price was very reasonable, the place decor is very welcoming and it has a nice atmosphere. The service was pretty quick, even thought I had to wait it was worth it! They have 1/2 off pizzas on Mondays! Check it out!"}
{"text":"I've had Angelo's takeout three times - once, was absolutely delicious, twice it was undercooked and soggy. They have a lot of potential but need to work on consistency."}
{"text":"After finally trying their original crust, I can honestly say this is some of the tastiest pizza I've had in CLE.   It's definitely one of a kind--meaning other pizza places around NEO have received 5-star marks from me, but for all different reasons. Angelo's is a great, casual, old-school-bakery-style pizza in my opinion. The sauce is sweeter to match the sponge-y, bready, butteriness of the crust. And the original, thinner crust (which still isn't really thin, per say) is still buttery, just like the deep dish. It's just good, trust me.   I've also tried a few other things. Their breadsticks are pretty good (a carbon copy of their buttery crust), the stuffed breadsticks are just mozzarella stick-stuffed breadsticks... although still yummy! And the side garden salads are a bit weak, if you ask me, but not nearly as bad as others I've seen. Next time I'd get a different salad.   Again--I've only ever experienced delivery and it's still getting 5 stars from me. That's how good it is!"}
{"text":"Typical arcade style pizza place. Good for a big group to get together have some good beer and good pizza. They are quick if you are picking up to take out. Type of pizza that reminds me of when I was a kid."}
{"text":"I love Angelo's pizza.  That's why I so disappointed tonight when I ordered online, show up to pick up my pizza and there is an ENORMOUS line for carry-out pick up well out the door.  I waited in the freezing cold for 10 minutes and line didn't move at all.  So I left.  Absolutely ridiculous cluster and atrocious customer service.  I will not be returning."}
{"text":"I give this place 2 stars. Only bc the service was great. Food was not so good today. Maybe it was the cook honestly bc I left very unhappy. The fries were the best part of what I and my father had ordered. Unfortunately I'm not going to return bc I feel I wasted my $. Pizza wasn't great and lacked flavor n was undercooked. Ordered potato skins which had raw bacon on it and the potato was hard and undercooked as well. Just upsetting bc they r so high priced but food isn't great. But like I said the service was great tho."}
{"text":"Simply put, it's the best pizza you can get. Go deep dish! You can't go wrong with the spinach artichoke dip, either."}
{"text":"The pizza was terrible this time. Way too much sauce and they couldn't even cut it evenly. Also I ordered a side of ranch and they gave me about NOTHING. not ordering from Angelos again."}
{"text":"This is my husband's favorite pizza spot. He loves the deep dish crust! Buttery with a cornmeal dusting."}
{"text":"Excellent pizza and excellent service.  I went in a Monday afternoon and arrived about 4:45 expecting to walk right in.  Nope. Long line and a 45 minutes wait for 1.  The great part, they took my number and entered me into the waitlist.  Told me I could follow my progress on yelp.  I went and sat in the car and checked yelp.  Yes it works.  13 people ahead of me.  I made a candle relaxed and then received a text that my table was ready.    I was promptly seated and waited on.  The pizza was oh Shit good.  Really Good.  Crust is excellent.   Though busy the server was pleasant and attentive."}
{"text":"I like the food but the service is always so poor that I can't even give a better review. Almost every time I get food from here the order is messed up and they are never pleasant about correcting it. I work right across the street and would love to consider this a regular lunch spot but the high prices paired with the less than desirable service make me never want to give money to this business again."}
{"text":"Please provide an east side location. I think that says it all about how good Angelo's Pizza is!"}
{"text":"I'm giving them 5 stars because the 3 times we've been there the pizza is delicious. Detractors would be that it can be very busy with long wait times, very loud, and they recently have done some construction which infringes on the ambiance of the place. However, the pizza is so good that I don't care about any of that other stuff. You can use the Yelp app to get in line if they have a long wait time which is nice. I do wish they had some healthier menu options for their appetizers, but it's a pizza joint so I won't nitpick. Best pizza I've had in Cleveland, and it's not even close."}
{"text":"Just found my new pizza spot!! You must get the deep dish pizza!  It's not like Chicago deep dish but more of a pan pizza and it's amazing.  It's so buttery and good!! It also heats up well the next day which is something I factor in to my pizza rating.    You may want to get on the wait list via the yelp app because they are busy.  We sat at the bar because we didn't get in line ahead of time.  Next time we will use the yelp app to get in line.  They also deliver!"}
{"text":"I've been starting to sample some of the Cleveland-area pizza shops, and Angelo's came very highly recommended.  The offering of deep dish varieties was tempting, but we opted for a regular Deluxe pizza.  Angelo's certainly doesn't skimp on the cheese, which I thought was the best part, highlighted in those first warm, gooey, and delicious bites.  I wasn't a fan of the crust, though, which was nice and crunchy, but extremely oily (and for lack of a better example, the crust at Pizza Hut comes to mind).  Also, the vegetable toppings (mushroom, onions, and green peppers) didn't have the eye-poppingly fresh taste and texture of the pizza at Pepper's, which I prefer over Angelo's.  Overall, I think Angelo's offers a solid pizza, a cozy and decent restaurant atmosphere, and passable service."}
{"text":"Love their style of pizza. Friendly service. The only negative is the traffic and parking around the store at peek times. Plan accordingly."}
{"text":"Cannot go wrong with the deep dish pizza here! Reminds me of Chicago and doesn't make me miss it."}
{"text":"***Update Angelo, sometimes your food is really good! That deep dish seafood pizza! Those plump wings covered in sauce! One time you messed up my order and delivered a corrected pizza to me even though I was outside your delivery zone (just barely outside). All great things, but then other times I get a pizza and it's a little lackluster and the wings are on the small side with little sauce. So I've gotta take away a star. Your food is generally good, but for the price I expect it to be awesome all of the time.   I mean, I am still going to hit you up now and then, maybe it's my fault for putting you on a pedestal, but I think we need to just be friends for awhile, I need some time to think things over and see what other pizza pies are out there."}
{"text":"Best pizza in Cleveland.  We live in Baltimore and drive out to Lakewood every time we are in town to pick up a pie.  Yummy!"}
{"text":"Angelo's has a reputation as having some of the best pizza in Cleveland so I was excited to try it especially on a Monday night when the pizza is half priced.  Finding parking near Angelo's can be very difficult, especially on Monday, luckily I went over to the next side street and found a spot.    Angelo's has a fairly small dining room that is broken up a bit, with a bar area near the kitchen.  The decor is warm and appropriate for this type of pizzeria.  Getting in can be difficult, but I managed to get a seat at the corner of the bar.    I ordered a Large deep dish pizza with the garlic shrimp, which came out after about 20 minutes, not too bad on a busy night.  The pizza is nice sized, certainly not huge, with a good sauce and a nice amount of cheese.  The shrimp were nicely cooked and juicy, although I really did not get any garlic flavor; the portion of shrimp was very generous.  Where the pizza let me down was on the crust, which I found to be softer then I would prefer, I would describe it as almost pillowy, I like my pizza to be more chewy.     Overall the service was good and very friendly, but there were a couple of misses, 1st it took quite a while for me to get my check after I had finished and had my extra pizza packed up, 2nd when the bill came they had not discounted the pizza, which they quickly corrected when I pointed that out.  Angelo's is certainly very popular and with good reason, it is worth giving a try especially if you like a soft crust to your pizza."}
{"text":"Lakewood is a road trip for us, but having had Angelo's bookmarked for a couple of years, having it recommended by a friend, and having no other reason to go to Lakewood, we decided to make that road trip.  We arrived at a little after 6 on a Saturday and were told we needed to wait about 45 minutes. The waiting area is rather cramped, and although it is obvious they are remodeling and expanding their dining room, it is not apparent that the waiting area will improve. So if you are opposed to standing in an awkward area or outside, then I would suggest you try Angelo's at a slower time.  The good news is that you should probably try Angelo's if you haven't already. In general I am not a big fan of the type of pizza that is popular in Northeast Ohio, but Angelo's is good. The style I refer to is the thicker doughy crust [I prefer thin crust, either NY style or crackery like in Columbus, OH. Not that thick crust is bad, just not my style]. So we had an original crust (you can also get deep dish) with sausage and onions (our typical toppings). The sausage was as good as it gets. I am not sure if it is homemade, but it is perfect for a pizza topper. The sauce also tasted fresh and had an Italian spiciness to it not typically found at pizza shops. This combination of spices was enough to help me set aside my crust preferences and really enjoy this pie.   Prices are reasonable, and service was quite good for a pizza shop. Like I said the dining room is in a remodel, so I can't really say what it will be like a month from now. The parts that looked undisturbed were inviting, the rest not so much. The pictures indicate it would be a pleasant place to dine outdoors, so maybe we will give that a try in the summer.  Enjoy!"}
{"text":"I'll give it 5 for pizza and 4 for wings.  Pizza is done great, very nice crust, great cheese blend, tasty sauce, and great tasting dough. They put a great pizza together. I was really impressed with them, would def go back as a regular here.  Wings were good, they are tender and delicious."}
{"text":"I'm a fan, however, we did have an issue with our last visit last week.  Have been coming here for years and the food quality and consistency is always excellent.  Until our visit last Friday.  Yes, they were very busy.  But is that an excuse for a compromise in execution and taste? We ordered our usual - large Seafood pizza and combo wings and house salad.  The pizza was burnt on top and dry (which has happened twice now in too many visits to count in the last 12 months).  The wings were tasty as usual, but definitely smaller than they used to be...perhaps they have changed vendors? We've been coming to Angelo's for years and love their food...and in the last 3 years have watched their prices creep up.  Now you pay $19.75 for a large seafood pizza.  Seriously?  Their large pizza is not a typical large size pizza, it's only 13 or so inches.  $19.75 for that and, it's fake crab. And, their appetizers (many which are frozen and fried) are $6-$8 range?  It appears that they are stretching with their laurels...Now that we found Pelicano's in Rocky River has a seafood pizza and an updated menu, we will check them out instead of returning to Angelos's.  Very disappointed, so consider your options.  Competition is good!"}
{"text":"I love Angelo's!  I come to Angelo's usually over the summer on the half price pizza night - it is always packed then, of course.  Also a great place to watch a game in the bar. The pizza is amazing and I also love the location and environment."}
{"text":"This is the BEST pizza. Hands down. Yes, a little expensive, but everything about is spot on.  The crust is crunchy and buttery, and cheese is plentiful, and the toppings are....my mouth is watering just thinking about it.  I  usually stick to the basics, pepperoni, tomato, & green peppers or spinach.  I've tried a few of the specialty pizzas and they are good as well.  I guess I just like the simple things though.  Yes, the pizza is a bit on the pricier side but you pay for what you get!  If you dine in, you must order a pitcher of Sangria!  It makes the wait almost bearable!!"}
{"text":"Visited Angelo's for the first time recently and it did not disappoint. My wife and I always evaluate pizza in it's most simple form - the cheese pizza. This is the foundation of a pizza and if someone can really knock my socks off with a plain cheese pizza, I know that it should be amazing if loaded with toppings. My family of six had two orders of breadsticks along with what appeared to be homemade marinara. The breadsticks were among the best that I have had. The pizza followed very shortly after the breadsticks and was amazing. Best deep dish pizza I have had. This is not TRUE deep dish as the sauce is located under the cheese, but nevertheless it is thick pizza.  Sauce was a little sweet, but for me that is a good thing. Cheese was great, and crust was PERFECT with an awesome texture - they definitely have this down to a science. All six of us were blown away. Finished up our meal with homemade chocolate chip cookies that were equally as good as the pizza and breadsticks. Our waitress was very friendly, and the food came out quickly. The inside is much nicer than your average pizza joint and the atmosphere is good.  Top 40 music was playing throughout the dining area and was at an appropriate level.  About two hours after we left Angelo's my family requested that we go back for supper. Yeh, that's pretty good pizza when you want to return the same day for round two.  We'll be back soon :)"}
{"text":"hubby saw an angelo's pizza commercial on tv and decided we would try it next time we went to medford for medical appointments. so we did.  i walked in thinking i would i would have the salad bar. after checking it out, i decided against it. the ingredients didn't look appetizing, nor were there very many good ones.  so i settled for my back up, chicken, a 3-piece chicken selection. i didn't realize it came w/fries, which i don't eat. and good thing. they were not good. greasy, tasteless, mushy. and the chicken - so well done, i mean, SO WELL DONE!  the pieces had hardly any chicken meat on them. if you're one to eat the deep fried, well done skin, you'd do well. i don't and didn't.  hubby was so disappointed with his pizza. the sauce tasted like ragu. the sausage (i tasted it myself) was nasty. not the kind of italian sausage i've ever tasted. the crust was totally overcooked and had less flavor than the sauce on top of it."}
{"text":"We were looking forward to trying this place. There was a mixup with our order, but the manager in charge made things right. The manager took great care of us and the pizza was fabulous. I recommend this place for anyone who wants great pizza at reasonable prices."}
{"text":"Great pizza. Good deal to go on Mondays (1/2 off) but be prepared to wait...so go early or later. Everything Ive had has been great."}
{"text":"Great atmosphere, family friendly, but still trendy.  The pizza crust is unique; I tried plain and margherita and both were delicious.  The only thing was that our first choices in dessert were out! No cannoli, no tiramisu, but the chocolate bomb was scrumptious."}
{"text":"I'm okay with them. Decent pizza, a good beer selection (though the bar area is on the smaller side), and I experienced good service here. I went middle of the road because I've had better pizza AND better atmosphere in the area. They do offer deep dish which you can't find just anywhere in these parts, so if you're into it it's worth a stop. Benches, tables, and bar seating make it a versatile eating venue accommodating families, game watchers (only at the bar), and post partygoers alike. It'll do."}
{"text":"I made a previous review months ago about Dewey's having the best pizza well, I was totally wrong...Angelo's does pizza better!  I haven't been to Angelo's in years but I used to get their pizza all the time years ago. I decided that there's just no good pizza in my area so, I ventured out to Lakewood for Angelo's.  The pizza is so tasty! It's loaded with toppings & the crust was perfect. It wasn't soggy, it kind had a little crunch to it which I love. For an x-large with 2 toppings it was $20 which to me isn't bad.   This place always draws in large crowds but it's totally worth the wait. Also, ask if they have chocolate chip cookies because I picked that up as well & they were so good! They were soft, fresh & the cookies were loaded with chocolate chips."}
{"text":"First let me say our server was great.  I had a plain cheese pizza, deep dish. It was my first time eating Angelo's. The crust was perfect but the sauce didn't do it for me. Too sweet. Some people love it, me, too much. They were not skimpy on the sauce at all. We had a family dinner salad which was pretty basic as you'd expect. Poppyseed dressing and zesty Italian were very good. So only 3 stars based on the sauce, just couldn't get past it."}
{"text":"Hands down, best pizza joint in Lakewood. I've lived here for over 8 years and just learned that they deliver (is this new?!) ... Regardless, so much easier to enjoy on these cold winter nights. I'm partial to the Hawaiian. Their salads are pretty outstanding as well, enjoy!"}
{"text":"Everybody always seems to be stuck up Angelo's ass and I always thought it was just ok.  I was starting to get worried that something was wrong with me.  So i just stopped ordering and as the years went by I just started saying I had never tried it.   Then I got a groupon and decided to return.  Ahhh...it was good.  Not Casa Vella good (seriously order from there) but better than anything I remembered it being.  We shared a deep dish veggie pizza and some cheesy bread sticks.  The bread sticks were garlicky and cheesy but I loved the pizza.  Loaded up with seasonal veggies and tons of cheese...after one slice I was done.  The only part I wasn't a fan of was all the grease.  Every time I picked up a slice I had to wipe my hands with a napkin."}
{"text":"Upon arriving at Angelo's, we had to wait about five minute to be seated. When we sat down, the table was dirty and no one cleaned it for us. It took about 30 minutes to get our food which was only alright. The waitress never checked up on us and we had to ask a cook for refills. And the kitchen looked filthy and the containers holding the sauce and toppings looked extremely dirty. This was an unenjoyable experience. I will not come back."}
{"text":"Best in town Consistent in or at home Only pizza we get Friendly staff in or delivery Tried and true over 30 years straight.  Have tried all styles All good"}
{"text":"Angelo's Pizza is my favorite pizza in the Cleveland area! I usually have to stop at least once while I'm in town.   Their \"deep dish\" pizzas are my favorite. I typically choose the build your own option. When dining in, I like to order the family style house salad with creamy Parmesan dressing.  Fantastic!  The only downside to dining here is that it is quite a small place and the wait is usually about 45-1hr whenever we go. The bar is stocked with great local beers and a great option for waiting out that 45 minutes!   Honestly, the wait time doesn't even matter to me because it's THAT good."}
{"text":"The customer service and food were horrible. I will never go in there again and I highly advise against it for anyone else.  Some of the staff there are extremely rude and have terrible customer service skills."}
{"text":"This isn't pizza. This is crack. I'd say \"crack on a crust,\" but really? The crust itself is crack. I can't even begin to explain how amazing the crust of this pizza is. If tastiness was a crime. Angelo's would be guilty of Deliciousness in the First Degree. I ordered wings this time, thinking that I wasn't in the mood. After I ate the wings, I went back for the pizza. The yummy, yummy pizza. Two slices are sitting on the dining room table, and even though I'm not hungry they are calling my name. Don't get me wrong; the wings were good. But the pizza. The pizza. Oh, the pizza.  I can't decide if it's more like great sex or a religious experience."}
{"text":"Had a wonderful lunch today with 6 great ladies! I was surprised how small the place was and it packed. We had about a 10 minute wait then we were seated. Service started out slow but well worth the wait. We started with their house salad followed by a chicken and Marconi&cheese pizza and a sausage, mushroom and onion pizza. They were both delicious but the second pizza's sauce was by far the best I ever had. We had deep dish style and the crust again by far the best I ever had. Thank u for a wonderful experience!"}
{"text":"For any pizza lover in Northeast OH. This is most definitely the place for you.  Yes, there is always a wait. But, it's so worth it. We travel all the way from the East side to eat here at least once a month. There's something about the sauce.  I'm usually not a fan of pizza sauce. But, they seriously use magic when making theirs.   We don't go for anything fancy, a normal works pizza is just fine for us. The crust is spectacular!  Soft, yet crunchy at the same time and we usually get extra sauce. They have a pretty decent drink menu and the staff is awesome.   Can't wait for next month, so we can return.   I'd highly recommend this place for any pizza lover!"}
{"text":"The best pizza I've ever had. Deep dish is my favorite, but original is good too. Everything I've ordered from there has been delicious. The sandwiches are huge, chips and dip on the side. The salads always have plenty of toppings! My favorite is the spinach, perfect garlic parm dressing. I worked close by so I've tried a large variety of menu items. I recommend trying something in addition to the pizza, I'm sure you will be pleasantly surprised.  I agree it's not cheap, but it's not cheaply made either."}
{"text":"Was without a doubt the very best pizza I have eaten.  Crust was done and not doughy. Parking is a bit rough but well worth the drive around the block.  I have found my new pizza place to eat and have a good time!!"}
{"text":"Holy moly the pizza here is GOOD. I don't know what they do to the deep dish crust, but it is perfectly flaky and buttery. The Acapulco BBQ chicken is delicious, definitely need to go back to try more of their pizza!"}
{"text":"I went to Angelos last night for the 1/2 off dine in deal, the 3rd or 4th time I've had their pizza. Angelos is a top 2 or 3 pizza place in Lakewood, depending on what you're looking for in your pizza. The food is phenomenal and the combinations they create for their pizzas are very unique. I had the loaded potato pizza for the second time last night (I've tried 10+ kinds, my friends and I all order different kinds and split it with each other) and it confirmed it is their best pizza. The service is decent, it can take a while to get seated at times (especially on Mondays) but overall it is worth the wait. I've had multiple servers with poor attitudes and mediocre service, which explains my 4 star rating. The food itself earns 5 stars ten days a week!"}
{"text":"We were a party of 8 (plus a baby) eating there this past Sunday.  The bar staff , servers and hostess were all really great.  The restuarant was BUSY BUSY.  We did have to wait quite awhile because we wanted to all sit together at one table - they said they should split us up in 2 side by side tables, but we waited.  It was a fun atmosphere.  The apps were yummy and the pizza was really GREAT.  The pizza dough is the best I've eaten. Take out area was just as busy as the eat in dining room (especially for a Sunday).  Can't wait to go back!"}
{"text":"They do a quality pizza over at Angelo's. I saw that they even do a gluten free! Friendly service, too. Top contender for best in the Valley."}
{"text":"If I did not live in such a dangerous proximity from the best pizza in the world (walking distance), maybe I would have desirable size 2, but hello! Angelo's is invading me, luring me in, teasing me and as a result of all of this feeding me . Almost on daily basis. I don't care about stressful parking ( I never drive there) or rushed service ( I almost never eat in), or the fact that they butcher my last name,  pizza is good!!! The crust, the sauce, the toppings... specifically the sauce...sour-sweet-heavenly! All of it is very very good.  Of course I wish it would cost less and it will I am sure ...the same day Dolce Gabbana will be sold at Walmart. And I will have my cake and eat it too. But for now I have my  Angelo's pizza."}
{"text":"i love angelos for their deep dish crust. it tastes like an italian family tradition. i used to live in lakewood and would carry out all the time.  i have never dined in so can not comment on that, but they seem always busy.  parking situation....a downfall, but hey, everywhere in l. wood is like that.  lots of yummy choices. like i said, the deep dish is amazing, in my opinion. perfectly buttery, crunchy and delish!"}
{"text":"So delicious!!   We've tried lots of pizza places, but this is by far our favorite!!   The deep dish is amazing   Tip:  Monday is 1/2 price pizza day - dine in only   Update: I now tried the chicken parm and it is sooooo good!!! Mmmmmm"}
{"text":"Super yummy! I can see why this place is so popular. I had the margarita pizza with garlic butter instead of tomato sauce, and it was the bomb!! Will definitely be back!"}
{"text":"Easily one of my favorite pizza places. And I know good pizza. Always consistent. The dough is soft and chewy, always fresh ingredients (no fake sausage balls), plenty of toppings, delicious sauce. I love the super deluxe. They care about pleasing their customers. Even the simple side salad tastes amazing.  Expensive, but not if you dine in on Mondays which is usually packed. Go before 2pm. Try the raspberry barbeque wings. I know it sounds disgusting but they are delicious! I've easily introduced 15 people to this place over the past year and they all love it and go back! The line out the door on mondays speaks for itself. People wait hours for a table..."}
{"text":"not great, but not terrible. sandwichs are great but wasn't a huge fan of the pizza. honestly with such a verity i could have just ordered the wrong one. also the wait time for food is a bit too long considering how empty the place was. willing to give them another try but as of now the best thing about this place is the staff. they were amazing!"}
{"text":"I've been searching for good pizza in Cleveland and I finally found it!  We came here on a Saturday,  just before the dinner rush.  Our wait was less than 5 minutes for a table.  We shared zucchini and fresh chips for appetizers before our pizza arrived.  Everything was great. I don't know any other place in Cleveland that even comes close."}
{"text":"Amazing service, waitress was very helpful. My only gripe was that the wings were 10x better than the pizza. Should be called Angelos wings."}
{"text":"Quoted 45 for delivery at 4 in the afternoon, currently an hour and 20 min later and still no food. Called to check in, 20 minutes ago, and they said the driver was in route, which is obviously false. Very frustrating and the staff doesn't care."}
{"text":"Wow!  Not sure why we've never been here before but we plan on making up for lost time!  Fantastic pizza!  The crust is nice and crunchy with a great flavor!"}
{"text":"I'm a native Clevelander.  I grew up on the East Side and now live in Columbus but return often to Lakewood. This place is THE BEST pizza shop on the West Side of Cleveland.  The best on the East is Mama Santa's, but we all know the Italians on the East kick the butts of the Italians on the West Side.  ;-)  Just go to Angelo's.  Get the pizza.  You won't regret it."}
{"text":"Legendary restaurant! I've been eating Angelos since I was a child. Although everyone here will rant about their pizza, I have always been ga-ga over their penne pasta with marinara and sausage. The noodles always have just enough bite to them and the marina is to die for! The last few years I lived in lakewood I would order Angelos at least once a week. The delivery times can take upwards of 45 minutes. Trust me, it's worth the wait. Just plan accordingly. Their wings, salads, garlic/cheesy breads are all fantastic too. You can not go wrong with ANYTHING on the menu. They are dedicated to giving you the best service possible. They seem to take good care of their employees too. A+ all around for Angelos."}
{"text":"Great pizza joint.  We had a large Margarita and a deep dish meat lovers.  Both were delicious.  The deep dish had sort of a crumbly bottom and was a bit sweet.  We also had pizza fries which were great.  Nice selection of draft beer.  The service was great and the pies were on the table in short time."}
{"text":"My partner ordered from here last week. We got a large half olive half pep/sausage combo with bosco sticks. The bosco sticks were kind of hard and the pizza was just okay. I think for almost $30, I'd have rather not spent it? Not sure if we will return. A bit over rated."}
{"text":"Truly best pizza in Cleveland Metro-and right down the street from our house. Lucky us. Consistently good service, and the menu has a wide and varied selection from which to choose. Kudos."}
{"text":"Angelo's is a local gem in Lakewood.  I have ordered multiple times, but only ever takeout or delivery, so I cannot attest to the dining experience.  Don't be surprised if they are busy (during high school football games especially), which is a testament to their quality.  I have ordered pizza, salad, and wings from this joint and I haven't been disappointed yet.  I drunkenly ordered their Chicken Alfredo pizza (why, I cannot say) but it was wonderful!  Chicken, mushrooms, red peppers, etc.  Quite heavy, but yummmm.  Try 'em out!"}
{"text":"I don't think we need another review of this wonderful little eatery. All that's been said is all that needed to be said about how good the pizza is and how the price may need adjustment.  So here's some tips while eating there. Mondays are half off pizza for dine-in all day. For dinner: go early or bring patience. The wait can get pretty long. Lunch was not as packed but \"you never know on Mondays\" said our waitress. If you are up for an appetizer, their Bosco Cheese-Filled Breadsticks is a must have! Yep, gooey cheese encased by nice tasting bread with savory marinara dipping sauce. Oh yeah, if you are lactose intolerant like me, you need to medicated before dining ."}
{"text":"One of the best pizzas you'll ever eat. Love the outdoor patio. We seriously EAT when we go there. Tons of awesome food besides pizza... This girl will never be thin while Angelo's is still in business."}
{"text":"Angelos beats out any pan pizza I've ever had. I've been to tons of places in the major midwest cities. They have a great menu selection and the prices aren't that bad either ($2.50 beers, $12-15 large specialty pies)  It's always busy in the dining room, so plan on waiting a few minutes, also parking can be a little dicey if you don't want to walk a block or two.  There's nothing in my new hometown of Columbus that compares to the deliciousness of angelos. Tip - for an asian inspired twist on a pie, try the seafood pizza."}
{"text":"Angelo's Pizza was the best pizza choice I could've made while visiting Cleveland. The pizza was delicious with tons of options, fantastic service, and a great ambiance.   Here's what they do well: 1) The pizza itself. They had some awesome combinations to choose from, all that included quality ingredients. Sure, you can get a basic pepperoni or meat lovers, but you could also throw some mac and cheese on there. Don't be afraid to be creative, you'll be glad you did. 2) Service and ambiance were great. We arrived late at night and were greeted nicely and taken great care of. Our waitress gave us some awesome recommendations to the area since we were visiting, and was a delight to chat with. The setting was great. Basically a hip and happening bar, but suitable for family of all ages if needed.   Do yourself a favor and check this place out, you'll be glad you did. I would also recommend getting deep dish style for the pizza. It's not super deep dish, but it's more like pan pizza and it's amazing."}
{"text":"Cleveland Magazine's 2010 and 2011 Silver Spoon Award for Best Pizza in Cleveland. Metromix's 2011 award for Best Pizza. 98.5 WNCX's Pizza Wars Winner. The praise for this place is off the charts and well pronounced both on the walls of this establishment and all over their website. But could it possibly stand up to the accolades? Doubt it.....  Two of the most overrated pizza joints in the greater Cleveland area are Mama Santa's and Angelo's. Sorry, but I just don't get the hype surrounding the praise and local recognition these places have received throughout the years. There's certainly better options out there in the pie department. Much better in fact. And quite a few better alternatives that continually seem to go under the radar of the mass public.   I've had Angelo's before. Multiple times in fact. But this time, before posting my review, I had to go back once more. Investigative reporting if you will. Just to see if what I had in the past was not just some kind of fluke. How could I be wrong?! THIS was Cleveland's best pizza for chrissakes! It says it on their walls!    On a recent at-dusk-dinner, we chose to dine outside of Angelo's, which overlooks Madison Ave. Our selection? The large deluxe. Traditional instead of thick crust. The sauce, I found a tad sweet, yet flavorful. The dough, toppings and cheese were all forgettable though. The pizza almost reminded me of Pizza Hut's. Underwhelmed and unimpressed, yet again. I've had better elsewhere. Decent? Sure. Would I support this pizza joint if I lived in the neighborhood over the surrounding chains? Absolutely. But \"best in Cleveland\"?! Not even close. Sorry."}
{"text":"I used to love this place back in high school.  I am thrilled that they haven't changed anything other than the location.  I met a friend here last Friday, ordered some onion rings andas large pie.... it was delicious!!  Wait staff was friendly and attentive.   My only complaint was the price otherwise I'd have given them 5 stars.  I felt $35 for an order of onion rings and a large 2 topping was a bit much.  Other than that this place rocks and I will definitely be back!!"}
{"text":"I didn't get my full delivery (missing items I paid for) and they called for me to come down to the street rather than actually delivering my order to my door. I would rather give my business to a company that will deliver to me, if that is the service that I'm paying and tipping for."}
{"text":"Always a treat! They're known for pizza, which is fantastic, but the pasta and sandwiches are amazing too. Their shrimp pasta and veggie sandwich are a couple of my faves  They also offer special pizzas every month to keep things interesting."}
{"text":"Great service & delicious food! Try the BBQ wings. I think they're the best in Cleveland!"}
{"text":"Found this restaurant on Yelp while visiting for weekend. Ordered Margherita Pizza, salad and two desserts. Excellent pizza, some of the best we've ever had. Take out order ready in 15 minutes. Great prices and quality. A must try!"}
{"text":"I usually come here when GLBC does the Brewmasters specials.  Sit at the bar, have a few Nosferatus and b.s. with random folks.  Bartenders are efficient.  Lakewood has so many pizza places its hard to choose one.  I (personally) like Roman Fountain and Papa Nicks, but that's just me.  This one is thicker and a lot of sugar in the sauce but its tasty.  Thick pizza is not pizza...its casserole.  Normally, its really crowded and expensive.  Two things that steer me clear of places.  But the good tap beers will keep me coming back for Happy Hour.  I'm still burping up the sauce a day later but I have burped up worse.  Lets just leave what happens in Tijuana in Tujuana...."}
{"text":"Great pizza. Pizza should be good in at least 2 of the following three areas: sauce, cheese, crust. Angelo's is great in all 3. Tastes fresh and was deliver piping hot. Had it a couple times now. The sausage is like pork heaven. Try not to be too drunk when you order this one. It's worth remembering the taste."}
{"text":"I should start off by saying the reason I'm giving them 3 stars is solely based on the service and not the quality of the food.   When we got there we were told that the wait was 30 minutes. After an hour we were called.   I wouldn't have cared about the long wait because I love the food, but the service got worse. My friend ordered a draft beer, got a bottle. They totally forgot one of my friends orders so she had to watch us eat while it took forever for the waitress to check on us.   And then the biggest complaint...the pizza was cold!  A place that is known for pizza gave us cold pizza.   On a positive note:  we did get $10 off our bill for complaining.   I would definitely go back but when it's busy the servers are still supposed to be attentive, and they weren't."}
{"text":"The BEST pizza on the West Side by far. Their barbeque pizza is so darn good that  I have to take a break from ordering it so I don't get burned out on the delicousness of it. It's like candy. Normally I would NEVER order a barbeque pizza at any other establishment...but something made me want to try it long ago and I'm really glad I did! Dine in for a great time too... even the bathrooms are nice."}
{"text":"Really? 20 dollars for a large mediocre pizza? I ordered a Hawaiian pizza and it tasted like just another chain pizza place.  Coming from New jersey, i can tell you this pizza place wouldn't even compete with a bottom of the line pizza joints in new jersey.  Sorry to burst your bubble, but this pizza is nothing special. I wont be coming back!! My boyfriend ordered the shrimp pasta and it smelled and tasted bad. And he's not picky at all. Tiramisu was awesome and then they just switched it to a cheaper version. So they lost both of us now since they don't even have the good tiramisu."}
{"text":"The best pizza and chicken parm in Lakewood. I've been going here for years and it's always delicious the only thing I don't like is the new garlic toast they give you with chicken Parm now, the old breadstick was better - bring that back please."}
{"text":"Came here for pizza and margaritas and happened to see a picture of a cassata cake on the television and OMG it was delicious. Got a three cheese pizza as well which was really good and the server was really really nice. Even took the last piece of cassata cake to go...haha sorry, not sorry."}
{"text":"Great atmosphere.  The pizza was delicious.    The wings were very meaty and tasted great.  Service was wonderful.   We plan to come back soon."}
{"text":"Best pizza ever in Cleveland. Well worth the parking chaos and minimum wait for a pickup order. They tend to be forgetful of your side order of sauces so double check. They also have a cute hidden little bar with very friendly bartenders if you ever want to have a beer while waiting for your pizza. Open late (12am I believe) for pick up orders. Only down side is their patio is not dog friendly."}
{"text":"I think one of my biggest regrets in life is only discovering Angelo's a month before I moved away from Cleveland... So much delicious pizza, so close, for so long... And I never knew.  This place is excellent. Really, really good deep dish pizza. Their deep dish crust is crispy and wonderful, just like deep dish pizza should be. No mushy, saggy crust here.  The toppings are also great. I'm especially fond of the meatballs.  My friend and I would come here and each order large pizzas specifically because we want tons of leftovers to take home. And then I actually have to hide this stuff in my fridge so my roommates won't eat it. It's that good.  Eat here you'll be glad you did!"}
{"text":"If you live in the greater Cleveland area and still haven't experienced Angelo's, you are doing your tastebuds a disservice.   This is my husband's absolute favorite pizza in the world. I wish you all personally knew him, he's the most pizza-obsessed person I've ever met (he once held a subscription to a pizza magazine), because if you did it would tell you how amazing this pizza is.  We always opt for the deep dish, which isn't really exactly a deep dish pizza but just a thicker crust. The crust is buttery but not greasy, and light and airy. Oh, and it's covered in amazing little breadcrumbs. The sauce is just the right amount of sweet. We always get meatballs as the topping too and it's the only way to go in my eyes.   We live within 5 minutes of literally about 15+ locally owned pizzerias, and will still make the 45 minute round trip commute to get Angelo's whenever we can."}
{"text":"Look, the pizza is good. It's crispy and chewy and cheesy and delicious. The service, though, is not worth most trips out. The staff are very slow, the usual din of locals isn't particularly pleasant, and wait for food is usually excruciatingly long. Be sure to order some take out when you get urge for pizza, or you'll be chewing your napkin before a slice even gets close to your table."}
{"text":"Angelo's earns its spot on the top pizza list of Cleveland for sure. This is definitely one of the best places for pizza, and they have bosco sticks (great way to relive your childhood). I've been to just about every pizza joint here in the CLE and surrounding areas, and this is definitely at the top of my list."}
{"text":"Best pizza in Cleveland.  Service is the best around.  The staff was super attentive to everything we needed.  Wish it was closer to my house and I'd be there on a weekly basis...."}
{"text":"Awesome pizza! Amazing and super friendly staff! Fast service and it's always busy here on top of it!! This place shows true passion in what they do and where they work. I love it!! Highly recommend anyone to go here AT LEAST once!!!"}
{"text":"Good pizza and very committed to the community. A little pricey but again, my kids love their food so we'll always come back."}
{"text":"I am not a huge pizza person, unless it's homemade or Angelos. Seriously. This place is unlike any other pizza you will ever eat. I can't really explain it, it just needs to be tried. Once you have Angelos nothing else will ever compare!!  Everything about their pizzas is perfect. Try the baked potato pizza...... you won't regret it"}
{"text":"Ordered pizza from here and was not disappointed. We got two different kinds. We got a deluxe pizza on regular dough. They were not stingy in the toppings. So much and the pizza didn't fold! It didn't get soggy. We also got the house special pizza on pan dough. That had meatballs on it. We ate this one first, didn't even have left overs. We did take out because we didn't feel like eating out. We ordered and left and by the time we got there it was ready. This place was packed and they seemed like they were able to keep up with everyone. There was just the right amount of sauce as well. Cheese was gooey and stringy just how pizza should be! We also got garlic cheese bread and that was fantastic! Not hard or soggy. Cooked perfectly. We are going to try every pizza on the menu here. We were so impressed our first order. We spent about $40 or so, but it was totally worth it."}
{"text":"In my opinion, the best pizza you can find on the West Side (short of going to a place that offers personal, more artisan type pizza fare). The panko bread crumbs on the crust add something extra. Cheese isn't exceedingly greasy and of pretty good quality.  Delivery is pretty fast.  Pies and slices are on the small side. Sauce is a little sweet and could use a bit more spice. But overall, very good, especially for Cleveland pizza (I'm used to New York pizza)."}
{"text":"Angelo's deep dish (really a pan pizza).  The L&B square slice.  Nick's Special at Vito & Nick's.  Frank Pepe's white clam pie.  There you have, ladies and gentlemen, the Mount Rushmore of pizza.  It's great to see Angelo's has taken off like it has.  The upgraded/expanded operation is a testament to the strength of the delivered product.  I do find myself, from time-to-time, missing the old, dimly-lit takeout location (now The Greek Village) a couple blocks west on Madison.  I'm a sucker for the unpolished/unassuming, what can I say?  Anyway, guys, I've been a customer for nigh-on 30 years.  Only a handful of occasions over that time have I had anything less than a stellar pizza.  A trip to Cuyahoga County without a trip to Angelo's is incomplete."}
{"text":"Half priced Mondays for lunch, can't beat having a large specialty pizza for lunch and then the leftovers for dinner and getting out with a drink for a shade over $10.  But this and Antonio's in Parma are on another level compared to pizza places in Cleveland. No one else is even close."}
{"text":"The pizza here is pretty amazing. The crust is probably the shining star--it has the perfect combo of crispiness/dough ratio and has delicious flavoring. We tried a variety of pizzas, including pepperoni , white, sriracha chicken, and Mac & cheese. My favorite was definitely the sriracha, closely followed by the white pizza. If I lived in Cleveland I could see myself coming here regularly.  They also have a ton of fun beer offerings, with a big draft list. Glad I got to check this place out!"}
{"text":"My friend lives in the neighborhood so when I suggested we grab a bite while I was in town she recommended Angelo's. Never one to say no to pizza I said that was just fine and....it was great!  She came with her two kids and this place is perfect for kiddos. They have a big, kid friendly menu and great servers who are patient and friendly. We ordered a few different pies and the cheesy breadsticks (which were awesome--I mean, can you go wrong with cheese stuffed bread? I don't think you can). They have a wide variety of toppings, gooey cheese, and a delicious crust. The makings of a fantastic pie.   Big comfy booth seating and a wonderful old school pizza parlor vibe make this a great, casual spot to grab lunch, dinner, or anything in between."}
{"text":"Woohoo! I love me some pizza and this place did not disappoint.  Definitely on the greasy side, but who said there's anything wrong with that?  Sauce and dough were both excellent.  Service was great, and I liked the interior of the place - fun Italian decor.  I won't say its the best pizza I've ever had, but it's definitely up there.  Yum!"}
{"text":"First experience with Angelo's before a Tribe game on a Tuesday around 5:30PM.  Seated immediately.  Service was efficient, if not overly friendly.  Pizza and salads were both great...salad seem fresh, crisp and just the right amount of 'stuff' on it.  Pizza was hot, crisp....got the original crust.    Remodeling is underway, detracted a bit from the experience, but that won't last long.  As a far east-sider, took a bit to find a parking space, if you know the neighborhood, probably not an issue.  Prices were very reasonable, including the glass of wine. Very solid....exactly what a neighborhood place should be."}
{"text":"Nice place.  Very clean and has street parking.  Service was not always available so I gave it 4 stars but they did comp the bbq wings which were very sweet.  Potato skins were great but they had no chives which was on the menu.  Margherita pizza was excellent with a delicious garlic crust.  Good beer also."}
{"text":"Angelo's Pizza is the one place in Cleveland where I am willing to wait two hours to eat pizza.  I usually go with my friends for the Monday dine-in half-off special.  Everything about the pizza is great.  The sauce is delicious and the crust on the deep dish pan pizza is crisp and flavorful.  Their pizzas always have a large amount of toppings.  My personal favorites are the Acapulco BBQ chicken pizza and the Deluxe pizza.  Although the wait can be long, the service is great - the staff is very receptive in the very rare occasion a mistake is made with your order.  I've eaten deep dish pizza at the original Uno's in Chicago, and I like Angelo's Pizza just as much as the pizza I had there."}
{"text":"Great pizza ! Love their deep dish pepperoni and sausage . You can eat only 2 slices they are so big and deep dished.  Like to dine I. When possible. Love their salads too! They are are very good !"}
{"text":"I was a little worried that my Angelo's Pizza experience wouldn't be as memorable given the fact that I pretty much gorged myself at Melt Bar and Grilled earlier in the day. I was wrong. This place rocks. Some of the best pizza I've ever had.   I'm hoping the folks at Angelo's can relay this message for me: Deep dish Mac-n-Cheese Chicken Pizza, I will never forget you. I hope that we may one day come together again. Love you."}
{"text":"I have sleepless nights craving that deep dish crust. Changed my flight and took a day off of work, so I can stay on Monday for half-off."}
{"text":"This is one of my favorite places to dine in Lakewood. The staff and the food is excellent. So many specialty pizza's to choose from. We have tried them all and they are all awesome. The chicken parm sandwich is the best I have tasted. There spinach artichoke dip is amazing. You will be hooked with one visit. When we have them deliver the food is always hot and the delivery guy is always on time!!! Rock on Angelo's"}
{"text":"Get the deep dish. It's great. Terrible for you. But amazing flavor. What a hidden gem. The staff is friendly and there's a quick turnover for your order if you place it to go. I was there on a busy Sunday evening when the wait to sit and eat was treacherous, but we decided to place an order to go and it was ready in about 15 minutes."}
{"text":"I've had different pizzas all over our great country, including the famous deep dish in Chicago and the large thin slices of New York, and Angelo's in Lakewood makes a great pie.   The crust is crispy and the sauce and toppings are delicious. I would highly recommend the caesar salad as well. The delivery was very quick and ordering was a breeze.   Definitely give it a try over any chain pizza places and you won't be disappointed."}
{"text":"So the pizza is pretty good and I have review them before on the pizza however this was one of the worst pizza experiences ever. Order a deluxe medium pizza with no black olives and no mushrooms. We also ordered appetizers and things were looking great. When the pizza arrives it has black olives on it. The waitress takes it back and said it shouldn't be longer than another 15 minutes which wasn't a big deal we still wee munching on our appetizers.   This is where it goes all the way down hill. She comes back out asks if we want to box the original pizza and the second that was made was made with mushrooms so they have to remake it again. Now this is 25 minutes after the original pizza came out. I was like okay will wait but we want to box it because we have other plans and have already wasted time waiting.   So she brings the boxed pizza and the bill apologizes and says she took the pizza off the bill. We have her the card and she comes back with it we look at the detailed receipt and it is double what it should and belongs to another table. So she brings the actual receipt and a copy of the void of the first transaction. At this point I am beyond frustrated and my boyfriend is pissed his card will be double charged. So I'm like at least the pizza looks good and doesn't have mushrooms or olives.   We get home and the pizza has fucking mushrooms on it. It looks as if they picked the much rooms off the top but forgot there were some under some of the cheese. Totally grossed out and pissed. At this point we will not be making another trip out there again."}
{"text":"If I could live off of one food item only, it would be pizza. And for Cleveland area pizza, I always keep coming back to Angelo's. The crowd must agree, because it's typically busy anytime I've been here. Whether dining in or picking up, make sure you leave your stomach some time. You don't want to arrive here starving just to be met with a wait.   The pizza is superb. I've tried a few but my number one favorite is the supreme, so that's my go-to anymore. The price is a bit expensive compared to other pizza places, and building your own can rack up the cost quickly. Check out their predefined pizzas to save some bucks on toppings.  They have some interesting options like chicken alfredo or baked potato pizzas.   If I'm getting Angelo's, it's usually on a Monday when they have 50% off for dine in orders. A little known tip is that they partnered with the McGinty's Pub a block away and offer this same deal to the bar patrons on Mondays. It's typically less crowded over there and allows for a wide assortment of beverage options. Just place your order with the bartender and your pizza will arrive shortly!"}
{"text":"Went there 2 nights ago, this is definitely THE BEST pizza I've had in the whole Cleveland area! Our waitress was exceptional."}
{"text":"Pizza great - all apps are bowling alley quality.  Seating is horrible if you have more than 4 - and even uncomfortable with 3 or 4.  I recommend takeout or delivery."}
{"text":"Everything here was great server was very attentive the drinks were good, the wings were cooked perfectly sauces could have been better but were still delicious and the pizza (pepproni ) sauce was delicous the dough was crispy and fluffly overrall good just a littlw too oily."}
{"text":"My inner fat girl kicks in when I go to this place. I can not resist my meat lover's pizza. Don't let these hazel eyes and pretty face fool you, I will totally shove those magnificent slices in my face. Being originally from New England, it has been hard to find good pizza, but I'm glad I found this place. Eventually, I will try something else from the menu, but until then I'll keep enjoying this pizza."}
{"text":"Angelo's always delivers. Whether it's a Friday night out or a Tuesday night pick up. I'm rarely dissatisfied with the service or the food. Try the off the menu artichoke and red pepper speciality pizza, its far and and away my favorite. The cannolis are local and the staff is attentive without being smothering. We'll be back for many years!"}
{"text":"We visited this restaurant while on vacation.   This restaurant offers outdoor and indoor dining. We chose a booth where the overhead garage door-like walls were open so that we were inside but still kind of outside. Very nice option!  We started the meal with breadsticks and the lemon curry chicken wings from the appetizer menu.   The breadsticks came as an order of 5 sticks and were served with a side of both marinara and garlic butter. The right amount of soft and crunch that was lightly seasoned with an Italian mix.   The lemon curry chicken wings served with a side of ranch came in an order of 6 wings but they gave us 8. Bonus! The flavor was zesty and upbeat. I have never had this flavor anywhere else. This item was my favorite from the meal.   Our main course was a large deep dish pizza with cheese, pepperoni, and sausage. The pizza was sauced well and had generous portions of each topping.  The crust was equally crunchy and buttery. And the cheese was so melty that we could have filmed a cliched pizza commercial on the spot.   They serve Coca-Cola products and kept our drinks filled throughout the meal.   Every bit of the food was great and the service was terrific during a moderately busy lunch.   Thanks Angelo's!"}
{"text":"Hands down, the best pizza in the area! I had the 3 cheese pizza and changed the sauce to Alfredo. It tasted like a grilled cheese pizza. So good! Servers have been great. Parking can be a challenge but I didn't have too much trouble, once on the street a couple houses back and once right in their lot."}
{"text":"The best pizza place in Cleveland.  Always good sometimes very crowded especially Mondays.   It is chaotic getting checked in and there is really no waiting area, but great pizza."}
{"text":"Best Pizza on the West side! Not the best price... And service is what you'd expect at Little Ceaser's. but hey, the pizza is perfection, so ill pay the price from time to time :)"}
{"text":"You can not go wrong with Angelo's pizza! They won best pizza in Cleveland for a reason. The sauce is something out of this world!! I have gotten to the point where nothing stacks up to Angelo's, so I don't order pizza from anywhere else. It is more expensive than going to chain pizza places, but you will never be disappointed. I have gotten take out multiple times, but have never actually had a sit down dinner at Angelo's. When I do pick up, it always takes 20 minutes, no more, no less. It always works out perfectly for me. Eat local!!"}
{"text":"I would agree with the two-star generic rating: Meh. I've experienced better. With all the hype, I figured I was living right near a gem of Lakewood. The atmosphere is cool, and it's always packed, but my boyfriend and I agreed completely separately that it is Pizza Hut. Except more expensive. On to the next pizza joint!"}
{"text":"Best Independent Pizza Joint in Lakewood, OH! This is a Lakewood staple, you can't call yourself a 'Westsider' until you've eaten here. AND That's a FACT!  WHY I HAVE TO KNOCK OFF A STAR Pricey for the type of pizza they make. Minimal street parking. If you're a non-local who can't street park, estimate more time for searching for parking and expect to walk to your destination. Small restaurant, this place is good and it shows, it's always busy/the restart is always packed, and there's always a wait - if you're ordering by phone, you will be put on hold."}
{"text":"Im only giving one star because I can't give zero stars. I don't get the rave reviews for this place. I stopped in for lunch and ordered a meatball sub. It was one of the worst sandwiches I've ever had! Let's start with the fact it was served cold with barely melted cheese. The meatballs were horrible and the server was indifferent. The bread was soggy and barely browned. Clearly, it had been thrown together by some high school kid working in the back. No thanks! Overrated. Fans of this place must not get out much."}
{"text":"I like it and have ordered from there several times, but I still don't understand why everyone is so crazy about it. For how much it is and how much everyone raves about it, the first time I got it I thought I was ordering pizza from a place where I would be getting pizza from as long as I lived in the area. Not the case. I would definetely take this place over something like Domino's, but I don't see how it's so much better from other family owned pizza places.   I was at my boyfriends house, 6 miles west of the restaurant--I mapquested it to see if there would be a possibility of delivery when we were ordering since we had company over. They wouldn't deliver!! They said it was outside of their delivery circle-- 6 miles..?! Really?!  For the price, I would much rather order somewhere else. It's not that it's bad or not good, I just don't see what everyone else does and think it's the most amazing pizza in the world. I'm sure I will order from them again in the future. In the end, pizza is pizza!"}
{"text":"will. travel. for. food!  LOL  I try to get here at least once every 3 months from the east side of town.  Great pizza!  Love it!  Monthly specials are always good."}
{"text":"I currently live in NY and have made a couple of trips to Chicago and this place still has my absolute favorite pizza, and trust me I have looked for it's equal all about the country. The sauce is sweet yet savory. The crust is soft yet firm. Lots of quality toppings, with simple Pepperoni to the amazing seafood pizza. They also have more than pizza all of which was tasty too.  Simply perfect. I crave it often and it is the first stop we make when visiting home, even before seeing out families sometimes ;)  It is a small place that will fill up fast so we often get take out but whenever we ate in the staff, was always been friendly. Great Lakes Beer available. If there is a game happening, it will be playing.   The only downsides? It is a little pricey but worth every penny in my opinion. Also parking is super limited but you will need the exercise of walking back to your car after eating here!"}
{"text":"This is the best pizza I have ever had! While it comes at a little steep of a price, you can't beat their half off, dine in deal on Mondays. My absolute favorite is their deluxe pizza. I've tried almost all of their specialty pizzas at this point, but nothing ever compares to the deluxe. A close second is their baked potato pizza, followed by the veggie. No matter what you choose, however, you will not be disappointed! The delicious crisp to the crust and the amazing sauce make my mouth water just thinking about it. If you're in Lakewood or Cleveland, it's worth a trip to Angelo's!"}
{"text":"Pizza the way your mom would make it.  Next time you consider ordering Pizza Hut or Domino's take a long hard look at your life.  Everything that has gone wrong is because your taste for pizza sucks.  Go to angelos and you'll instantly get a girlfriend/boyfriend, make your wife pregnant, buy a house and have grandkids all at once.  It'll change your life."}
{"text":"Alright pizza. Very over priced. There are plenty of cheap pizza places around that have better pizza. Service was mediocre. Server came right away, we asked for a few minutes, she came back 15 min later. We waited another 15 min or so for the check after we asked for it. A good note the sauce that comes with the onion rings is awesome and they have fried zucchini.  This place is very popular and always busy. It is also very tiny. toy will have to wait for a table which is fine, but there is nowhere to actually wait where you are not in the way of the servers or standing right on top of someone trying to eat their dinner."}
{"text":"Love the pizza here. I think the regular crust is just as good as the deep dish. I enjoy the pepperoni pizza and the seafood pizza is pretty good if you are into that scene. I saw another yelper recommend  the three cheese pizza with jalepeno and pineapple and i have to say i think that is my new favorite. This place is always busy.  Parking is a pain sometimes but that's lakewood. I believe the desserts come from kb confection which is a local bakery and is pretty good. If you are from out of town and you only have time to pick one place to eat in lakewood, this would be it."}
{"text":"Anyone who knows me, knows how much I love pizza. And this place has absolutely perfected the art of the \"zaaaa.\" Whether delivery or dine in I've never been disappointed. The only downside is how busy they always are, so you may wait a little while before putting that luscious piece of heaven in your mouth. I wish I could live here."}
{"text":"Love! Always order deep dish, you can't go wrong. A little overpriced but so worth it!"}
{"text":"Angelo's is an institution in Lakewood, but it's up there with the best in Cleveland.   Angelo's reminds me of when we used to go to Pizza Hut with my mom and dad back in the day. It was a major treat because Pizza Hut was two towns away so it was only for very special occasions. Angelo's makes me feel like that, even though I can have it now anytime I want. This is a pizza place that makes you want to stop, sit and enjoy a meal with the family. Of course you can get delivery or take-out too, but I recommend eating in with some of your people.   We like to order some pizzas from Angelo's when we're having parties at our house for friends that live all over, but many of them on the east side of town. Once they try it, they are always sad to learn that there are no Angelo's locations over on their side of town. Try anything on the menu, it will be some of the best you've ever tasted.   However you like it, get some Angelo's if you're in Lakewood in the mood for some great pizza."}
{"text":"I love Angelo's! One of my favorite pizza places ever and I have been to both New York and Chicago. Everything is delicious! Pizza, wings, Bosco sticks, salads, pasta dinners. Everything there is so delicious. Great beer list too. Mostly the staff is super nice and helpful and works superhard. Love this place!"}
{"text":"I feel personally victimized that they took their macaroni and cheese pizza off the menu. That pizza shaped who I am as a person today and it was ripped from my greasy fingers right before my eyes. All their other pizzas are fiiiiine, I guessss. However, they do have some really good wings. The teriyaki flavor is THE BOMB. Get them while you can, you never know when they'll completely destroy your life by taking it off the menu. RIP mac pizza."}
{"text":"You may have to wait for a table, especially on Mondays, but it is well worth the wait. Best pizza in the area. I live in Lagrange which is a hike, but I will drive for this pizza."}
{"text":"I am SO damn upset. Why? Because I had my beloved Angelo's Meatball Sub today and it was once again so great I just KNOW I\"M NEVER GOING TO ORDER ANYTHING ELSE FROM HERE!   And, dammit, I really want to try their pizza."}
{"text":"Not sure if it's bad for me, but I go here every single week. It's my favorite place to go get pizza. The best part for me is their mozzarella sticks, I can't get enough! Their courteous & friendly waitresses make the place even more enjoyable. I've literally become so obsessed with this place, I've bought a hoodie from them. Overall, food is top-notch. The vibe is amazing. It's my traditional Friday night plan! We stan!"}
{"text":"I have been here more times than I can count.  Probably the best traditional pizza I have had in the city.  I would recommend ALWAYS ordering deep dish (the crust makes the pizza).  My favorites are the super deluxe and the newest addition to the menu,phillycheeesteak.  Tip:  Mondays is half off pizza day.  Dine in only. During happy hour times expect a long wait for a table."}
{"text":"Ok, I have to update. The last few times I've been here, the food and service have been awesome. And, half price pizza if you eat in on Mondays :-) complete turnaround!"}
{"text":"5 stars hands down!! What is there to say that hasn't already been said about Angelo's? Their pizza is the best in the city of Cleveland!!! (At least in my opinion) I just recently moved to Lakewood and plan today here many Monday's during their infamous half off Monday's! Only downside is there will probably be a wait, but it is worth it. All pizzas are half off! Whatever pizza you get, order the deep dish pan. It is their award winner. I usually get the Mediterranean! It has no red sauce and made with a garlic butter tasting sauce instead. Toppings include banana peppers, black olives, spinach, mozzarella cheese and sun dried tomatoes. It is so soo good! Eat here if you haven't! It makes Monday's, especially so much better!"}
{"text":"I've been sitting on a $10 for $20 deal and finally got around to trying the mega hyped Angelo's. In my opinion it is a little over hyped. Sure the pizza is good, but certainly not the best. We ordered two larges and were surprised by how small they were. The deep dish is the way to go, the crust is crunchy and was my favorite part. Was it good pizza? Yes. But will I go out of my way to come back? No."}
{"text":"I was tentative because I'm usually disappointed when a place is so hyped. Angelo's did not disappoint.   We got the traditional thin crust extra large pepperoni pizza. It was awesome! The sauce is tangy and sweet. The crust is light, not heavy. The cheese was perfect. The crust was crispy. It was oily, and sauce dripped everywhere but it was so damned good. My only complaint on the food was that the bottom of the pizza was a bit under done. The slice was like a limp noodle. I'm not sure if this was the intention or we received an under baked one. Regardless it was good, everyone loved it.  The ambiance was also good...the place is well decorated and very clean. Our service was OK, nothing great. The pizza took about 20 minutes to arrive, and we had to ask for refills.  Regardless, the pizza was so good I cannot wait to go back."}
{"text":"In my opinion, Angelo's is the best pizza in the Greater Cleveland area. The secret is definitely in the crust which is the right combination between soft and crisp and is so tasty. The restaurant is small so you may wait for a table but it's definitely worth the wait. My favorite pizza is the house special which has sausage, meatballs, onions and mushrooms. The teriyaki boneless wings are delicious too. I also love their Caesar salad which is very cheesy. The only downside to Angelo's is the service. It's often very slow and servers aren't very attentive. But the food is definitely worth it. Consider going on Mondays. While the line is long the pizza is half off!"}
{"text":"Amazing freaking pizza.  I haven't been here in a while, but the last time I went was with a fabulous family after a recording session, and it's one of my favorite memories of a good friend who passed away last year.  Their pizza is legendary, the atmosphere is homey and warm, and it's really just hands-down the best pizza I've had in Cleveland.  And everyone is right about the crust - SO good.  So enjoy, Chuck... I bet you get all the Angelo's you want up there!  And for those of use who are still Earth-bound, it's a great reprieve from your boring old Dominos and Pizza Hut pizza.  Yum."}
{"text":"Ordered pizza here for a fundraising event my sons school was having and I absolutely love this pizza place. It was so quaint and had such a great atmosphere. Lots of people already packed this place at 2pm on a Tuesday! Got the pizzas went home and it was obvious when I opened the box we were going to have a heavenly feast. It was great pizza and the kids and I were extremely excited ."}
{"text":"Something sickly sweet in the pizza. Not sure if it is an oil or part of the sauce. Noticed it on my second visit here. Additionally, they are way overpriced since it seems to be the only pizza place in lakewood people have gone to! There are better options."}
{"text":"Angelos is a Lakewood institution. Seriously the best local pizza in town. The sauce makes the pizza and Angelo's runs on the sweet side. Their salads are also freshly prepared, and their ingredients are always top notch. After decades in Lakewood, they have a reputation for being the best. If you want to go on the weekend, get there early or be prepared to wait. And parking? Yeah, not so much, but plenty of street parking nearby as long as you aren't competing against a sporting event at the high school."}
{"text":"Although other reviewers disagree, this IS the BEST pizza I have ever had!!   However, I would mention that if you like pizza sauce that is on the sweeter side you cannot go wrong here but if you like spicy sauce you may want to seek other options.   One of my family members lives in Chicago and grew up in Chicago. When he visits Cleveland he insists on going to Angelo's noting he finds it better than any place in Chicago. That is high praise indeed!  We live in Lakewood so we order delivery regularly. We had out of town guests this weekend and ordered pizza delivered for dinner and they loved it too. They asked to take the leftovers home with them!  The only negative is that if you go to the restaurant to dine in sometimes the wait can be really long particularly on Mondays (half price pizza night) so we almost always order delivery or pick it up on the way home from work. I have the telephone number memorized and saved on my speed dial, of course!"}
{"text":"I love Angelo's pizza. The crust literally wins my heart, it's perfect. Sometimes they can fall short on service and wait time but the Pizza is so good and they get so busy that I understand it's hard to tell when the kitchen is going to get back up with orders just flowing in unexpectedly. They always make sure you are happy at the end and will help you out if you are waiting too long. Honestly out of all the Pizza flavors I think Angelo's has the best deep dish pepperoni pizza I have ever had. DELISH!"}
{"text":"Way too expensive. 20 bucks for a large margherita pizza? Damn! Better be the best pizza I've ever had in my entire life. It was good but not great. Real Americanized italian fare, not very authentic. I'm italian I can say that. The sauce overpowered ithe pie & u don't put tomato slices on tomato sauce. That's too much tomato/ acidity. One or the other. Oil & garlic would better serve the tomato slices. Or sauce & no tomatoes. Attention to detail for that price. Next time I'm just going to little ceasers for the 5$ hot & ready & save 15 bucks."}
{"text":"I called in an order to pick up and it took waaayyyyy longer than they said. I waited and waited and the staff kept coming over with updates, she's cutting it now, it will just be a minute, etc. All lies unfortunately. I'm still not sure what happened but I waited an additional 25 minutes after my order time.  Pizza was good when I finally got it, but a tad greasy."}
{"text":"Angelo's is the best! I come here often! The chicken is to die for and the buffet is awesome!"}
{"text":"Our absolute favorite pizza in Cleveland. You can see that this place is so popular when you try to get a table on a Friday or Saturday night. The wait is usually around 45 min to an hour. Takeout also takes some time as well, however it is all worth the wait! we order takeout from here whenever we are in the area. Their pepperoni pizza is so delicious and their antipasti salad is amazing as well.   Everyone working here is always very friendly and polite. Never had an issue any rude servers, bartenders or delivery people. Highly recommend this delicious place!"}
{"text":"Well, I must say, I am glad to have \"discovered\" this place and dropped in a few times to enjoy the delicious pizza.  As circumstances would have it, our opportunities to visit were on Saturday evenings during televised Buckeye football games, so, needless to say it was packed with patrons and we waited a bit for our seating. But, we all agree that our wait is worth it.  We really enjoy eating here. I understand that it is usually always very busy, especially in the evenings, but it is such a unique and truly \"neighborhoody\" place, you have a wonderful time dining in and mixing with the friendly crowd, in spite of the delay in getting a table right away. It is noisy, (happily so), but it is part of the excitement and ambiance that reflects it's local charm. The style is one that I truly call an American pub. Pubs in this country are very few and even farther between, so it is great to have one around. I would love to see this kind of thing replicated in every neighborhood corner across out nation. (We need it don't we?)   Since we always order the pizza with a salad accompaniment, I can't reflect on anything but..however, the pizza is remarkable and worth the trip. Also, our salads have always been fresh and generous, i.e., you can share and have plenty to go around. It's fun to watch the kitchen staff in action, always busy, and each seem to know their position to an art.    It all comes together to serve up a wonderful local atmosphere with personality, inner-city pizazz, and culinary pleasure that evenings out require.  I think you'll like it too, and you'll be back again and again."}
{"text":"I LOVE Angelo's Pizza. They have a huge variety of toppings and the combinations make for some great pie. They recently did renovations to the inside of the restaurant and it looks great, but I've only ever done takeout. They make the pizza FAST. I would often be getting 6 extra large pizzas and they would tell me 30 minutes during a busy day. They are also one of the few pizza places left that still make big pizzas. Everywhere else it seems that the large pizza has gone down in size and I'm happy to see Angelo's hasn't."}
{"text":"I normall don't go out for pizza...well, I normally don't eat pizza, but one night, I was really in the mood for it.  My fiancee suggested that we check this place out (she doesn't even like pizza but recommended it, which is a big check).  Right from entering that restaurant I was in love.  It has a very homey kind of pizza-place atmosphere, that I have only ever encountered in movies and TV shows.  It seemed dimly lit yet quite bright all at the same time.  I'm not quite sure how that worked, but it did.  Then comes the food...  This is no Pizza Hut.  I was having a pizza and pulled pork craving that night (no joke, I swear I am not a pregnant woman).  After settling for pizza, I was ready to enjoy myself with a nice traditional pie until I opened the menu.  It was like God was smiling over me.  The first item on the signature pizzas menu was a BBQ pizza with pulled pork.  It was fantastic.  My only complaint is that the pork was a little dry, which is what would happen after being in a pizza oven.  Still, no serious complaints overall.  I need to try a more traditional pizza, but I have heard they are great.  I'm looking forward to going again in the future.  Word on the streets is that they have half-priced pizza on Mondays if you dine-in.  I'm not sure if this is real, but I intend to find out."}
{"text":"This is some great pie! The deep dish is divine but the thin crust is great too. The service is always friendly, and on one visit, the entire staff was donating their wages to the three girls who were kidnapped. THAT shows you the character of the staff here.  The only possible downside: sauce is a bit sweet for my preference (but I'm a black coffee kinda gal) and it's a tad too expensive to be my weekly go-to for pizza.  Bottom line: The Teenage Mutant Turtles would love it and so will you."}
{"text":"Angelo's is legit worth all the hype, both on Yelp and probably from all your friends too. This is hands down the best pizza I have ever had outside of Brooklyn, Ny - even beating Gino's East in Chicago. If you live in CLE and love pizza, you have got to go here - it took me far too long to finally try this joint.  The pizza here is absolutely amazing! The crust is heavenly buttery and so flavorful - definitely setting it apart from most crusts. The cheese on my wife's pepperoni was so good and goey as well. I ordered the bbq pulled pork which was AMAZEBALLS. LEGIT. Incredibly tender pork, sweet bbq sauce with the right amount of zip, and the sauce was just right.   If you're craving pizza, Angelo's has exactly what you're looking for - whether it's a classic pepperoni or something more adventurous. Ugh, I'm craving it again as I write this. Brb...ordering a chicken Alfredo pizza.."}
{"text":"I was there today and the menu prices do not reflect the pricing I was charged. When I asked to speak to a manager she said well there is nothing I can do he menus say pricing subject to change. It is just good business to be upfront with customers before they get the bill. She was very rude! Sad that now I won't go back because prices could change again and I'm not sure what I would be paying when the bill comes."}
{"text":"BY FAR the best pizza I've had on Cleveland's Westside. They're deep dish is to die for. It's not Chicago style, just a deeper pan crust with panko breadcrumbs that form the perfect combo of fluffy and crunchy. Plenty of specialty pizzas to choose from, some unique, and they even have monthly special pizzas.   A little expensive, around $20 for a large specialty, but well worth it. Try to take advantage of half off all pizzas on Mondays! However there will be a decent wait, as the deal is dine in only.   Only drawback is parking. They're \"lot\" has maybe 5 spots leaving only street parking which in Lakewood can be hard to come by. Often I have to park down a side street and walk so if you have any elderly or disabled just drop off at the door first!"}
{"text":"Ooooooh soooooo goooooood! Simply mouth watering pizza. Wings are great too! And don't forget their potato skins"}
{"text":"Best pizza my wife and have ever eaten outside italy. The restaurant had a great neighborhood atmosphere and the service was excellent. I live in Georgia and go to the Cleveland Clinic several times a year and this is a great incentive to head north"}
{"text":"Love this place, both the pasta and their famous pizza.  Most recent visit was in December and, as always very crowded.  My only complaint is that the hostess screams out names for tables.  It's a small place, I think an effort could be made to locate the party without that.  But I will definitely visit again and again."}
{"text":"This is a really good pizza place. It is way better than Dewey's which is on the east side of Cleveland. It is worth the drive. The salad are excellent the wings are outstanding. And the pizza is really really good!"}
{"text":"I've been eating and loving Angelo's Pizza for as long as I've been in Cleveland, and I finally put my finger on why I love it so much. It just comes down to this:  It tastes like what Pizza Hut pizza tasted like in the 80s.   Ta-Da!"}
{"text":"Am I the only one that doesn't understand the obsession?    Their pizza is decent, but the price of the pizzas are so expensive for pizza that is average.   Their wings are excellent, but that is beside the point.    I have had their pizza multiple times as my coworkers love it.   The service is good and the people are friendly, I just don't get it....."}
{"text":"Angelo's is amazing - highly recommend the house special with the homemade meatballs.  The only two downsides about Angelo's: 1) Impossible to get a table unless you beat the rush 2) It's feels pricey for what it is  However... every once in a while we love to treat ourselves to some Angelo's."}
{"text":"Seriously amazing pizza. The best I have had, probably ever. If you watch the kitchen, they totally hand-grate all the cheese...what?? So delish!   Their salads are killer. So much yummy goodness! I recommend getting their roasted garlic and Parmesan dressing. It's kinda like kicked up, adult Italian. SOOOO good.   They have amazing dessert. They also have Cheesecake Factory cheesecake.   We love this place so much, we're considering having it as our rehearsal dinner fare. YUM!"}
{"text":"Far and away the best pizza you can get in Lakewood! We always get the deep dish extra large pizza (with pepperoni and sometimes sausage) and it can easily stuff 3 people and leave some to take home! Service is typically good, servers are often hustling around to multiple tables but are always courteous. The bosco sticks are a favorite starter as well!"}
{"text":"Absolutely Amazing!! we ordered two small deep dish pizzas, and a couple beers. Best pizza I've ever had. Jaime was our bartender, she was so quick and such a sweetheart!! There was a blonde manager who was so nice and helpful. Awesome staff, felt right at home. I would recommend this place to anyone, worth the 40 minute drive!!!"}
{"text":"I'm a pretty intense guy, but the supreme pizza i had at angelo's was just too much. Since everyone and their mother claims Angelo's pizza is the best, I had high expectations for this place and their pies. Unfortunately, you have to be high and have a serious case of the munchies in order to finish one of their pizzas.   The pizza is just disgusting. Overwhelmingly greasy, sauce is insanely sweet, and the sausage on my pizza was way too salty.   I have been known to say I could eat pizza every day for the rest of my life, but the one pie i eaten from Angelo's has made me reconsider. I purchased a large, and ended up throwing 1/2 away, something I have never done before."}
{"text":"Really Angelo's? We regularly order pizza here for work- absolutely hands down delicious... but then I ordered wings with celery and ranch and literally got 5 pieces of celery that are an inch or so long.   Pizza- 5 stars. Delivery- 5 stars. Anything extra that you'd expect- meh."}
{"text":"if you must eat here, get the pizza. ordered pasta for the first time and it was absolutely tasteless! borderline horrible."}
{"text":"The deep dish crust is to die for.  This isn't a Chicago style deep dish, but the crust is what really makes the difference here.  The pizza ain't cheap, but you will have no regrets afterward.  I've been incredibly happy every time I've been there, because the wait hasn't been long for 2 peoples, the food was incredibly fresh and tasty, and our servers were polite and helpful.  This gets 5 starts from me because it really is one of the best pizza joints in NE Ohio.  It's a small place, but worth the wait.  There's a wide variety of tables, from seats at the bar to high 2 tops, to seating for larger groups, they can accommodate.  The one time we visited, their computers were down and they didn't miss a beat.  I even hear there's half priced Mondays..."}
{"text":"My roommate is moving out, and moving to Lakewood. He loves pizza. I told him to try Angelo's. I guess I realized it is pretty good pizza. Most people love it. I know he will enjoy it, so I am updating my review and adding a star because if I have some Tums with me, I can go for some Angelo's from time to time. It is good Cleveland hillbilly pizza!"}
{"text":"It's okay. I've had better pizza, and I've certainly had better delivery. No matter what I order, they always forget something. It's okay if you need some pizza, and you need some salad and you're not expecting the best in the world. You're much better off than if you ordered Domino's."}
{"text":"When you want delicious, non-chain pizza this is the place to go. We love Angelos so much, we had it at our rehearsal dinner. Just writing this review makes me want to order some right now! Great place to take family/friends who aren't from the area"}
{"text":"Seriously.  I don't get it.   After waiting almost an hour for a table at 9pm on a Saturday, we were so PUMPED to scarf some 'za.  Instead, our experience basically sitting in the front door was disappointing.   Most of the time spent in this restaurant, I was feeling ill.  The place looked so dirty, and this feeling was only compounded by the most disgusting-looking, dirty, wet towel laying on the floor under the table next to us.  The whole time.  I mean, waiters tripped over it and left it.  If they have this kind of lax approach to cleanliness under their diner's table, what does the back look like?  So, beyond being fixated on this dirty rag, I noticed the crust was just greasy.  Won't be back, but everyone seems to love it."}
{"text":"Now has outdoor seating on the sidewalk! I haven't even eaten here in months, but seeing those outdoor tables made me plan for a visit very soon. Pie is very good, but pricier than just about any other shop in Lakewood. The dining room is very fun and the staff is cheery. Even the sign is cool when lit up at night. And the take out boxes are very sturdy. Okay, i think enough has been said about this place."}
{"text":"Okay, I don't even live in Cleveland, and I already know this is the best pizza joint in town.  Here's my one and only interaction with Angelo's, and it's a doozy...  A few weeks ago, a friend of mine who teaches at Bard High School Early College told me his team won the girls basketball extramural championships with an 8-1 record.  They dethroned the 2-time defending champions, who hadn't lost a game in three years.   I thought this was an amazing feat for the Lady Raptors, and asked my friend what the school was doing to celebrate the accomplishment, to which he replied, \"Nothing.  They didn't even get a pep rally.\"  I was floored.  I've heard about all the doors that open for male athletes at the same school (even though they don't perform as well, had to drop a few players for grade ineligibility, and always get premium practice court time), and could not fathom the administration making such a clear divide when it came to support of sports programs.  I asked my friend what the name of the local pizza place was, and when he said Angelo's, I immediately called and spoke to a series of managers who, in the end, graciously agreed to donate a pizza party to the girls basketball team at Bard there in Cleveland.  Brian, Sean, and Karen, were amazing.  They acted like it was no big deal to help celebrate the young ladies, and I was over the moon when they confirmed they'd be sending a bunch of goodies to Bard on April 4, 2017.  I'm currently sitting here in my office in Cincinnati, and my friend in Cleveland is sending me pics of the pizza party Angelo's sent over.  ARE YOU PEOPLE KIDDING ME?! YOU'RE AMAZING! I thought maybe, MAYBE, you'd send 2-3 pizzas, and you sent SO MUCH MORE.  The girls are going crazy, thinking they've won the lottery, ON TOP of having won the championship!  Thank you, Angelo's, for hiring people like Brian, Sean, and Karen, who make great things happen in your local community.  Words cannot describe how appreciative I am that you made a crazy request seem like just another day in the office.  You'd better believe you have my \"Pizza Loyalty,\" and the next time I'm in Cleveland, I'll be dropping by Angelo's to shake somebody's hand."}
{"text":"I have to say that Angelo's pizza is not my favorite but it's decent pizza. I think the sauce is a little too sweet and the pizza is a bit greasy. That being said, I wanted to get pasta the other night and I didn't feel like cooking or going out, so I ordered pasta from Angelo's.   I got the chicken Parmesan and my wife got the fettuccine Alfredo. Both were delicious. We also got an order of the baked ravioli, which was amazing. I would recommend trying the pasta."}
{"text":"If you live in or around downtown/ Ohio City you will notice a huge trend that when it comes to pizza thin crust rules. The nice thing about Angelo's is that it refuses to follow this trend and offers a thicker crust. I am not going to label the crust as Angelo's does as deep dish bc it is not. At least not like a true Chicago style deep dish. Despite this the pizza is still very good. The crust is a nice thicker and flakey consistency compared to thin crust found around town. The sauce was delicious and it was a nice mixture of cheese.  Do note that you may pay a little bit of a higher price due to this different style. However, I still plan on going back because of the different style of crust and options."}
{"text":"The Monday half off pizza deal is the best. Really quality pizza with some interesting combinations. Super delux and the bbq chicken are my favorites. Tip - if you're going to go on a Monday you need to get there close to 5:00pm to avoid waiting 30 - 45 minutes."}
{"text":"I experienced Angelo's on a Monday night and was pleasantly surprised to find that it was half off night! As long as you dine in on Monday's your pizza is half price. Who doesn't like half priced pizza??? Let me correct that statement, who doesn't like awesome half priced pizza??? This guy sure does. We started with the fried zucchini appetizer which was good. The best thing about the appetizer was the size. We had zucchini for daaaaays. We elected to go with the super deluxe and it did not disappoint. With Pepperoni, Sausage, Mushroom, Black Olive, Pineapple, Onion, Mild Pepper Rings, Bacon, Ham and Green Peppers, the combination of flavors with the deep dish crust was perfect. The crust is exceptional and just the right amount of crunch and has a hint of sweetness to it. I will definitely be back to try some more of the specialty pizzas. The only reason I do not give Angelo's a 5 star rating is because I was not impressed with their small selection. But if you are looking for just straight up pizza then this place is definitely a 5 star place."}
{"text":"The fiancรฉ suggested we order pizza late last night and Angelos delivers until 2 am on Friday and Sat. I have heard amazing things about their pizza and was extremely excited. We order the chicken bacon ranch pizza and oh my lord was it delicious!!! The chicken wasn't the little pieces you normally get from pizza joints. They were large beautiful pieces that were moist and tender and perfect! The bacon was generous and you had a taste in every bite. Sitting here writing this review I am already contemplating ordering again tonight. If you live in a location that gets delivery I suggest you try it, and if you don't you should drive to Lakewood immediately."}
{"text":"This was a great experience. I've eaten this pizza my whole life. Never sat inside. Waitress was helpful, young, and energetic. Food tasted great. Service was a bit slow, but not anything drastic. They are busy. And it's for a reason. Quality and consistency. Only suggestion I would offer is that dining room is freezing. To be fair is was negative degrees when we were there, but the draft, and the emergency door. Kept us in the cold. Over all great experience."}
{"text":"We went to Cleveland for the air show, hitting Angelo's on the way out on a recommendation.  Pretty darn fantastic!  However, the service was a bit lack-luster.  Yes, it was Saturday evening, which is a prime time for dining out, but they seemed under staffed.  We waited about 15 minutes for a table, but there were 4 or five that had been vacated before our arrival, however they had yet to be cleared off.  Our waitress was not only busy, but training someone, so we saw very little of her.  I could tell she was stressed, so I was sure to tip over and above my usual.  The pizza was great, with wonderful crust (deep dish) and very flavorful sauce.  The sauce was on the sweeter side, which I like.  The crust was light and airy, yet crisp.  Both my daughter and myself thoroughly enjoyed it.  I was even able to talk her into trying mushrooms for the first time, which was a success!  The atmosphere was nice as well, it was just a bit chaotic with the short staffing.  I was contacted by one of their social media people and informed that they have in fact been short staffed lately.  They are in the process of training new servers.  Had the service been a bit better, I would have certainly given them the full 5 stars.  If we're ever in Cleveland again, we will certainly go back, as it was an excellent pie!  I hope they're able to get the help they need to keep up with the demand.  Thanks Angelo's!"}
{"text":"Great great great pizza. Went there for lunch and ordered a meat lovers pizza and some chicken wings and I was blown away on how good everything was. The wings had a great taste and the pan style pizza was crispy with loads of meat. The service was great never did I have to think about a refill on our drinks they just kept coming. Over all I'll be coming back again and again keep up the good work."}
{"text":"Very good pizza and salad. Had the dinner salad with spring mix instead of iceberg. Light Italian dressing is great. Had the pepperoni with original crust. Crust was perfectly light and crispy. Excellent texture and flavor. Sauce was a bit sweeter than we like but very good. Service was excellent, thank you Jamie. Need to have the bar open for drinks, not just beer on Sundays. All in all, one of the best pizzas in cleveland area."}
{"text":"After some contemplation, I'm pretty sure I've reached the conclusion that this is officially the best pizza I've ever had in my life. Their deep dish crust is buttery, crispy, and covered in golden breadcrumbs on the bottom, and soft and fluffy in the middle. Their sauce is sweet but not too sweet, very fresh tasting. The veggies they put on their pizza's are always super fresh, never any of that silly, precooked stuff in cans. As for the quality of their meat, I'm a vegetarian, so I can't attest to that. The cheese is as good as it should be, but as with any pizza place, make sure if you're ordering a pizza with a lot vegetables you ask for it be well done; the high water content of the vegetables cause the cheese to not cook as thoroughly (you always wanna have brown spots on the cheese; that's gonna give you the best flavor). I've worked in several pizza places, and tried nearly every pizza place in Cleveland, and I've still yet to come across a pizza place that seems to understand this. Anyways, despite that, this is still the best pizza I've ever had. Well done Angelos."}
{"text":"Paid $24 for the large margarita pizza...so I figured it has to be amazing for that price. Not so much. A margarita pizza is supposed be a thin well done crust, mine was oily and thick. The buffalo mozzerella and the sauce were pretty good. But when it comes to making great pizza, it starts and ends with the crust. The fact that I see ppl leaving 4 and 5 star reviews gives me the impression that they are fake or that  clevelanders wouldn't know a good pizza if it hit them in the face.   So all in all....ur better off getting Papa Johns, their pizza proved to be by far more superior to angelos."}
{"text":"Used the NoWait app to get in line.  When we go to the restaurant we had less than a 10 minute wait as a result.  I hope more and more restaurants use this app.  It's really great.  I ordered a small order of hot wings and split a small deluxe style pizza with my wife.  Wings were delivered hot and were pretty standard.  They were what I expected.    The pizza here is just amazing.  The bottom of the crust seems crumbly and buttery.  The crusty exterior leads to a tender interior.  We ordered the deep dish pan style.  Deluxe pie.  I was amazed how many toppings they fit per slice for such a small pizza.  The ingredients were all fresh.  The sauce has a slight sweetness to it.  It's making my mouth water just thinking about it again.  They don't have the cheapest pie in town either.  But no one seems to care.  There was a line out the door for a table all night.  People were lined up for carryout all night as well.  While drivers were taking pies out for delivery nonstop.  It was definitely worth it."}
{"text":"The Acapulco chicken pizza is to die for. I mean, include it in my last meal good. I believe panko is what makes their crust so special and delicious. And it is delicious. We try to take people who have never been here so they can experience the glory. It is a little pricey. If you go on half price Mondays (dine in only) expect to wait a little bit. Overall a great place to get a pizza. One of if not my favorite."}
{"text":"Multi-time winner of best pizza!  This stuff has to be amazing, right!?  Uhh...I'm mean, it's good, but...really, this is a prize winner?  We ordered their buffalo chicken pizza.  It was good with plenty of toppings, cheese and a nice buffalo pizza sauce, but did it blow me away?  No.    Also, we used a coupon which made our medium pizza ONLY $15.95.  That's $2 for a slice.  Would you spend that much per slice at a to-go counter?  Probably not...and per slice you're expecting to pay more for the convenience anyway...  Anyway, if this place keeps winning awards, I think people start need to get out more..."}
{"text":"Never a complaint from this wonderful place. Not only is the pizza the best around but the atmosphere and employees are top notch too. I ordered pizza for pick up yesterday and I was just awed by how nice everyone was. I always feel good about spending my dollars where the people seem to want to help you. If you don't want a fancy specialty pizza just an old fashioned pepperoni is just as great (deep dish, of course) and don't pass by the rest of the menu. We also ordered boneless wings and they were great. If your looking for awesome pizza in the Lakewood area look no further!!"}
{"text":"I absolutely adore Angelos!  Even though you may have to wait for a while sometimes to be seated.  People only wait for what's worth it.  Angelos is definitely worth it!  Their pizza is amazing!  The sauce, the crust.  And consistently amazing.  It's pizza.  You know what pizza is.  So, the only other thing I can say is that every time I go there I end up excitedly bouncing in the booth on the seat when the pizza arrives.... clapping and smiling like I was five and someone just gave me a new puppy."}
{"text":"Cleveland's got a ton of great pizza places, and this is at the top of the list. It's the best pizza place on the West Side--nothing comes close.   I've been here twice--one for a large birthday gathering and once for Mother's Day. I've gotten outstanding service both times. On Mother's Day, our server disappeared for a long period of time for some reason and I was pretty bummed. However, she made up for it by apologizing sincerely and profusely and making our drinks free! That's outstanding service right there--some other places make you feel like they're doing you a favor by allowing you to eat there, rather than making you feel like you're the guest and they want to make you feel good about eating there.  The pizza is amazing and you can get it as simple or complex as you want it. The Mac and Cheese pizza and the Acapulco BBQ are especially good! The fact that they offer a deep dish option for no additional charge is especially awesome--some other places would probably add an additional charge!  My only beef is that the prices are a teeny, teeny bit high and the pieces can be a tad small. Don't let it deter you from going there unless eating there will send you into bankruptcy--it's the best pizza place on the West Side, hands down--but if Pizza BoGo on the East Side was located right next to it, I'd probably pick BoGo a bit more often. (Edit: I was told like 5 minutes after writing this review that it is half off on Monday's for dining in, so go there on Mondays!) Having said that, I am always very excited for a trip to Angelo's!"}
{"text":"Angelo's has some AMAZING pizza! I've been going here for a while - had some intense deep dish pizza cravings one night and a friend suggested this place and I've loved it ever since! No, it's not the best deep dish I've ever tasted, but I'd rank it among the best in Cleveland for sure!!   I've dined in a handful of times but also carried out multiple times. I most recently got takeout last night. The food is always SUPER fresh and delicious- and last night was no exception!!! I am a creature of habit and always get the fried ravioli appetizer - b/c it's so darn good. The filling is ricotta cheesiness - so a veggie like me can actually enjoy it :) And it comes with a side of marinara.   Like I mentioned, I usually come here for deep dish pizza, which I always enjoy. I've tried the three cheese, the veggie, and have created my own. I've only tried the traditional sauce (they have OPTIONS!), which is on the sweeter side, which I tend to hate, but I love their sauce. Their crust is great- not too salty and always crispy on the outside and soft on the inside! I tried the original crust for the first time yesterday. I did notice that it was pretty greasy when I got home, so I'm not sure if that's the case with the original crust pizzas all the time or if it was just a one time occurrence.   My food was ready when I came in to pick up and the guy was super friendly as he helped me. For the times I've dined in, I've experienced nothing but good service. I wish the place was bigger because there's always a wait when I'm there- and once you step in to the restaurant and smell the AMAZING aroma, you won't want to wait even a minute before sitting down to devour some delish-ness!"}
{"text":"Cons: parking situation sucks, there is always a cold draft near the door in the winter (and since the restaurant is small, this is pretty much everywhere), as mentioned, location is small, so it is pretty much always full/crowded,  Pro: the pizza is good....SO good. Dat crust- I would eat anything off of that crust. I always get the deep dish, and they let you split your pizza into two specialties if you want."}
{"text":"Great tasting pizza with an enormous selection.  The portions are large and they all taste good.  The place is crowded, so get there an hour ahead of time.  I don't think it matters what time of day (if it's on a weekend). It's a little loud, but there is a correlation of lots of people and lots of people's mouths. I wanted to try the buckeye pie and I didn't.  I think that's my biggest regret in life."}
