{"text":"Best mexican in the area?  You bet!  I haven't had it this good since El Canelo in Bucyrus, OH and Erie, PA.  Highly recommend it.  Salsa and chips are homemade, and very good."}
{"text":"Best Mexican food in the area. Great for lunch and dinner. Mexican #3 and Mandarin Jarritos is the best for lunch."}
{"text":"Ugh, not a fan. The place was small and hot. The food was bland and mediocre. Also , we went because we had a certificate .. Which they said we couldn't use because it was Cinco de Mayo , but they weren't doing any specials .. Ummm , what ?"}
{"text":"Made me feel like I was in Mexico!  Ignore the bad reviews...this is legit Mexican food...not over-commercialized Ameri-Mexican.  It's not a luxury dining experience...duh...look at the building!  Expect imperfection...and enjoy it!  The steak tacos are bomb...ask for the white cheese sauce in a little side dish and dip it up!"}
{"text":"great food.   ranks up t.here with some of the best mexican restaurants i've been to. will come back 4 sure!"}
{"text":"I have only been here once.  I should go back, because the food was pretty good.  The tacos were decent, but the nachos were amazing.  We got some kind of nacho platter with a bunch of topping on it.  It was really good.  I don't know how the guy stays in business, because I NEVER see anyone in the parking lot.  He has been here six years though now, so he's got to be selling something, plus the food is pretty good."}
{"text":"Stopped here on our way home from biking recently.  The food was decent but the portions were a lot smaller than I expect from a Mexican joint.  Usually it is no trouble for our two 5 year olds to split an adult platter with food to spare but I ordered them a \"super quesadilla\" with shrimp to split and it was't all that super in size - we finished everything on the table and had hungry crabby kids.    My husband got carnitas which he said were OK, just smaller portions than he expected.  My oldest son got the steak tacos which were good and a decent amount - 3 soft tacos, nicely filled.  I got a super shrimp quesadilla for myself and it was tasty but it's just a quesadilla which is kind of hard to screw up.   The small portions wouldn't have been as big a deal if they weren't also stingy with the chips and salsa.  For 6 people they brought us one small basket of chips and maybe 1/3 of a dish of salsa - the salsa bowl actually had marks in it like they had poured us more, then decided to dump some out.  No refills offered.    Maybe we were extra hungry from biking but we found the portion size to be very lacking.  I'm really torn between giving them a 3 and a 4 rating.  If they hadn't been stingy with the chips I'd have given them a 4.  It wasn't horrible but there was nothing amazing about it, either.     I don't think they had a kid's menu."}
{"text":"My husband and I went on our first date here. . We came back a year later and the man remembered us and even remembered the table we sat at! Went again about 6 months later and he remembered us and that our normal table was taken! The food is delicious and the service is great. The restaurant is very small but that will not prevent me from going back!"}
{"text":"I drove past this place a few times, and it seemed to have some potential.    Boy was I wrong.  Awful.    The steak was so overdone I couldn't chew it.  The grilled shrimp were average.  The best part of the dish was the seasoned rice, so no, I won't be going back."}
{"text":"I'm from San Diego, Ca and my experience outside southern cali with mexican food is usually a unedible nightmare. First of all the place is immaculate the owner was super ifriendly and welcoming. Food was not the typical baja style taco shop I'm used to but it was unbelievably good. I'm pretty excited since I'm used to mexican food making up about half of my diet."}
{"text":"I change my mind. I went there recently and was very disappointed. The tortillas were cold the meat was so so overlooked. Sad, but true. Will not be back."}
{"text":"Friendly staff, just two people working.  Given a small serving of nacho chips (offered more when empty) and salsa.  The salsa was a little spicier than most places and had a little sour flavor.  The menu is the usual standard Mexican.  Nice little place, could tell they had just cleaned, had that pine sol aroma.  The Chimichanga comes in a soft flour tortilla, chose to not have it fried, and  a guacamole salad and beans came with it.  Enjoyed the meal."}
