{"text":"Loved the crust: tasty and soft.  I had the pig destroyer and the nacho pizza.  The pig destroyer was tasty but a bit heavy (for me).  That's not a surprise as it's supposed to replace a meat lovers pizza!  I thought the nacho pizza was great and should make it on the rotation.  The pizza slices were flavourful and full of toppings.  Between the two flavours I liked the nacho pizza better because it tasted exactly as I thought a nacho pizza would taste whereas the pig destroyer, while tasty, doesn't quite taste like a meat lovers pizza (I'm a relatively new vegan so while I have no interest in eating omni, I remember the flavour profile).  I also had the doughnuts.  These were tasty too.  The texture of the doughnuts surprised me too because they were light and springy, and had a different texture than doughnuts I've had previously (probably the effect of lard).  But I liked that these doughnuts tasted lighter as well.  Would get again.  There were other non pizza items on the menu I'd try in the future.  I noticed the island pizza was popular so I'm looking to try that as well."}
{"text":"Disclaimer: I am NOT vegan, but I do have a dairy allergy. I ordered the Reunion Tour pizza, and although I could tell that the ingredients on the pizza were fresh, I found the overall flavour of the pizza to be very bland. The crust didn't even really taste like a typical pizza dough, there was no \"yeasty\" taste that you find in leavened anything. It actually made me google \"can vegans eat yeast?\" (they can) because it seemed like the only explanation. However, their use of vegan cheese impressed me. I honestly cannot stand the taste of imitation cheese, but the \"fake\" feta that they used on my pizza was pretty good. I also had a bite of a friends' taco salad, and the cheese in that didn't overwhelm the dish or taste like plastic. I'd give Apiecalypse Now! another chance to try their desserts or salads, but I'll pass on the pizza."}
{"text":"Pros- This is the best vegan pizza in the city. Everything here is great, my go-to's are the Pig Destroyer, Tator Tachos (a must have), the BBQ Buffalover. It's great they have slices ready. Their donuts/desserts are good as well.   Cons- The delivery through Just-Eat is atrocious. Not something you can really blame on the restaurant as it is out of their hands but beware when thinking of ordering delivery (my preference is uber). I've had a couple occasions when the staff hasn't been very pleasant/ been put on hold for quite awhile. Not sure if I happened to get them on a few bad days.   Overall- Go in and indulge on some great vegan eats!"}
{"text":"The food is so good here! There is a lot of variety and I have yet to be disappointed. My favourite pizza so far is The Pig Destroyer Destroyer. The korn dogs, jalapeno poppers and Not-Chicken Caesar are really good too. Great food, great service."}
{"text":"Had the Toronto Island pizza, so good and did not take long. The donuts are also very moist and taste so good! Convenient location near subway station. I bring back my non-vegan friends and they love it as well. The staff are very friendly!"}
{"text":"Very tasty, if a little greasy, vegan pizza. Fake meats and cheese make you feel great that a pizza this great can indeed be vegan. I would say 4.5 stars to be more accurate. There isn't much else; a limited seating area, kinda slow, though polite service. But Apiecalypse deserves to be on your radar as a must-try if looking to indulge yourself with some nostalgic local pizza."}
{"text":"I'm officially obsessed with this place. When it comes to vegan pizza - this is as good as it gets, folks! If you're feeling wild, there's a whole bunch of flavoured dipping sauces too (Jalapeno Cheddar, anyone?)   Seriously disappointed with the chocolate soft serve though. Not sure if it was an off day but it tasted like melty chocolate popsicle."}
{"text":"It tasted a lot better when I first had it. I had the reunion tour and bit into a blob of salty white sauce. The cheese wasn't there anymore. Very disappointing."}
{"text":"Wow!  We had the BBQ BUFFALOBOTOMY large pizza which was fresh and cheesy....oh so DELICIOUS!!! We also indulged in the cookies  & cream  and cinnamon twist donuts...they were so fresh and moist!!! The staff were super sweet despite their small and hot space.  I wish I lived closer because this would be my go to spot for cheat meals  lol"}
{"text":"I've always had the most lovely experiences with Apiecalypse Now. Their Mozza sticks, Pig Destroyer pizza and Yeezy Bread Sticks are my favourite.  They also have amazing looking doughnuts that I can't wait to try.  The staff are delightful and their Instagram is on point.  Love this place."}
{"text":"They went above and beyond for me today with their customer service.  They called me personally to assist with a prepayment and a delivery because I was unable to get to them.  It is an extremely busy day for them and I truly appreciate the moments they took to assist me!  And did I mention the food is GREAT!"}
{"text":"Let's keep this simple. Man walks into the store and gets a pizza. Man likes it so much that he orders another slice of pizza with different toppings.  Man decides that he will be a regular at this place. That man is me!  I am vegan and I usually get my pizza cravings fixed at Pizzaiolo. Well, not anymore."}
{"text":"For vegans this is a pretty decent and creative option. Their pepperphony is pretty tasty and so are most of them...except, well, the dough needs some work. Simply put, it's not awesome, and most people either eat the crust first to get it out of the way, or they just don't eat it at all. Best to get a dip for the crust as it definitely helps give it some flavour. Might just need some salt? I don't know I'm not a baker. I still go back though as there aren't really many options around for vegan pizza downtown."}
{"text":"This pizza is soggy and near tasteless. Definitely not one of the better vegan pizza places in Toronto. I have tried a few different types of pizza here and every time I have had a slice it was worse than the last one.   I wouldn't recommend this place to anyone."}
{"text":"This is my favourite restaurant in Toronto right now!  They have never disappointed me, ever (except when they are closed and I wanna eat, lol), and as a kid who could never digest meat or dairy products (I'm one of those food-intolerance vegans), this place actually changed my life and gave me the opportunity to eat pizza the way everyone else does - with like 5 types of cheese ('cheese') and 5 types of meats ('meats'). I've tried most of the slices and my favourite is the Toronto Island, though I also love the Mac N Charlie, the Pig Destroyer, and the BBQ one whose full name I forget. I order from there probably 3-4 times a month, which is bad for my pocketbook and great for their pocketbook. Honestly, it is so fucking delicious, best comfort food of all time. Not too sure how much else I can say about pizza, but it. Is. So. Good. Really great balance of flavours on all the slices I've had! And hey, adding a little hot sauce and chili flakes never hurt anyone.   I've brought non-vegans here and they all LOOOOOVE it!!  Recently I went out on a limb and tried their tofu nuggets, which are also super good! Glad they started serving beer and cider recently, because nothing goes together better than those things.  I gotta say, I also really love their donuts. Go here!!"}
{"text":"I love apiecalypse. I loved them before I even ate anything from there store. Why?Because I love that they are 100% vegan and promote veganism in a way that isn't about flowers, butterflies, and rainbows. I love that when entering their store you already feel a different vibe than most other vegan places, they have an activist edge to them and it's awesome (I love my sticker that I got from there once that said \"you want to hear a joke? \"paleo\" best thing ever).  Now onto the food, I love that they don't really care about it being 100% healthy, because being a vegan or eating vegan alternatives doesn't always have to be about health. This is a great place if you are looking for something indulging and amazing.  Their \"mac & charlie\" pizza is by far the most amazing pizza they have and i am hooked. i have tried their slices (which are also very good) but that Mac and cheese always keeps calling me back. On the desserts side, I'm not the biggest fan of their doughnuts they are okay to me, they look good, but I don't know I've had some pretty amazing vegan doughnuts before and these guys have yet to amaze me. Their other desserts are quite though! Anywho, I will continue to frequent this place because they are just awesome in so many ways and I hope they are around for a long time!"}
{"text":"They should be more clear about upstairs seating! I wish I had known that they had more seating. When we got there, we ordered 2 small gluten-free pizzas and waited 25 minutes for them (which is pretty normal). The total was around $41 which isn't bad, but isn't what I was expecting. Although it was on the pricier side and I wished we had known about the upstairs seating, the pizza was AMAZING. We are vegan and LOVE pizza, so this was a treat. Especially the sweet BBQ Buffalover! We also ordered the Reunion Tour, but it wasn't as good as we had hoped. The Ricotta wasn't very cheesy, but what can you expect from vegan cheese, right? Other than that, on the Reunion Tour pizza, they didn't bake the pizza with the spinach on it, they put it on after! That's amazing! It was pretty busy when we went in there, but they managed to make our pizza within the 25 minutes they said they would. Overall, it was a pretty good experience, I just wish we had eaten there (because we live about 20 minutes away, so we waited an hour to eat). EAT HERE!"}
{"text":"Bloody amazing pizza. Crust is perfectly balanced. A-1 ratio of toppings.  Staff was super friendly and helpful. The service was great. First time there, we had the Pig Destroyer Destroyer ... and we destroyed it. Going back for sure ASAP!"}
{"text":"Vegan pizza is always a hit or miss situation -- if you're looking for a NY style cheese and grease fest, there is no way Vegan will do it for you.   BUT, having said that: this is the best vegan pizza I've had in a long while. Not a huge fan of the doughnuts -- but it's really more of a PIZZA place...come on..."}
{"text":"I've been here several times and the food is great. The pizzas are made with daya cheese and are pretty delicious. The \"pig destroyer destroyer\" is really good and my favourite pizza there. All of their sandwhich specials are excellent. This month is a tempeh sweet potato with cabbage slaw sandwhich. It's crispy, savoury, saucy goodness with just be right amount of tang. Definitely recommend it!"}
{"text":"After systematically trying every vegan/veg place in Toronto, I was super excited to hear about that the Apiecalyse has returned featuring: delicious vegan pizza. I tried 4 slices on one of the soft opening days - \"The White Walker\" with creamy garlic sauce, un-chicken, and arugula, the \"Pig Destroyer Destroyer - basically vegan meat lovers, and \"The Reunion Tour\" a compilation of deliciously flavored veggies and cashew ricotta, and the hilariously named \"Mac and Charlie\" a ridiculous pizza with a mac n cheese base, un-chicken, and jalapeno daiya cheese. All were seriously good, and probably would have been even better had I eaten them on the spot instead of 30 mins later. Luckily I was able to get my hands on a full \"Reunion Tour\" pizza and my suspicions were confirmed. I love pizza, I eat a decent amount of pizza and I can say that this was one of the top 3 best pizzas I've ever eaten. I was legitimately sad when it was gone. This place will definitely be a \"treat meal\" staple in my household - especially once the delivery service starts up! And for the non-vegans or skeptics out there don't knock it til' you try it, even my non-veg friends tried it and loved it!"}
{"text":"Great vegan junk food, especially the pizza! I'm a carb fan so this place rocks for that! I recently had the Mac and Charley pizza - mac and cheese pizza! Crazy! The Big Mac pizza is also pretty good!   They've also got donuts and other things like poutine, but the pizza filled me up before I could try them! Next time!"}
{"text":"WOW! I had heard so much about Apiecalypse Now that I had to stop in when I was in the neighbourhood. Their pizza is right up there with the best pizza I've had in the city. Not the best *vegan* pizza - the best pizza period. Already looking forward to my next visit - wish it was closer!"}
{"text":"I ordered a the Reunion Tour pizza and it was so tasteless that I threw it away after one slice. I have had the Pig Destroyer Destroyer and the fried Marz bar and those are great."}
{"text":"The Simpson's Donut is as awesome as it looks! If Homer was vegan, this would be his donut of choice!  The donuts are airy, greasy, and just freaking good. Not as sweet as expected - which I liked. They sell out fast, so make sure to get there early!  If you feel like pizza, salad, snacks, or vegan poutine, there are a lot of options! I tried the vegetarian meatless meatball sandwich.  The meatballs were juicy and flavourful and could fool any meat eater.  The fried tofu with tamari was a simple and satisfying snack.  I'll definitely be back for vegan goodies!"}
{"text":"Ordered the Toronto island and another with Mac n cheese but couldn't remember the name. The size is decent but I was really hungry so two was perfect. Really liked the crust, perfectly crisp, not dense. There's limited seating area, but there's a park right across so you can always grab and go. Coming from someone who's not a huge fan of pizza in general, this place is absolutely amazing!!"}
{"text":"Very friendly service, yummy donuts, and cool all-vegan menu. The pizza was pretty good, and the prices were ok. Happy to support this place but the pizza and greek salad weren't impressive. I very much enjoyed the Simpsons donut, though."}
{"text":"I tried the slayer pizza and a vegan corn dog while in Toronto. Everything was tasty! The area surrounding the place was congested, and parking wasn't the easiest, but the pizza was worth it!"}
{"text":"Apiecalypse Now is an absolute gem in the community.  It's right across from Christie Pits and is the perfect location to grab a delicious bite and hang out with your friends in the park, or pick up a pie and hop back on the subway. I've had the Thundergun Poutine a few times and it's gigantic.  Totally shareable and oozing with vegan chickn', hot peppers, cheese and gravy.  Their pink Simpsons donut is delicious, despite being a little dense and greasy - again, perfect for sharing.  At Christmas I ordered a Shepherds Pie for my vegan main course and it was so great I'm campaigning to have it on their menu full time. Sadly, I've only tried one pizza - the White Walker which was so good.  Garlicky, salty with a delicious creamy sauce and not-chickn.  The only thing that was a little strange was the gigantic piles of fresh arugula dumped on top - it was a little excessive and wasn't baked in or bound to the pizza in any capacity.  BUT once we cleared off a few handfuls we had a little side salad!   The staff are so nice and I love the punk rock, DIY vibe.  Great vegan comfort food and worth checking out."}
{"text":"I'm not vegan but I really like pizza and this place was pretty good !!! I felt like it was really sweet though, but I can't really give a review without being biased as I don't eat a lot of vegan specialty foods."}
{"text":"My boyfriend and I are from California and are visiting Toronto. We've heard from all the locals about this place. Hands down the best vegan pizza I've ever had in my life. Beats Los Angeles big time. Can't wait to come back for this!!! I'm gonna be craving this so bad now..."}
{"text":"Okay I don't know *how* they do it but this place must be a dream - let's start with everything we ordered was vegan and so so sooo good!   Vegan donut - chewy and not fluffy like the regular ones but it was awesome covered with the right amount of sugar without making me feel like I'm going to be high on sugar  Pepperphony - how oh how did they manage to get that pepperoni taste I still remember from my meat eating days I'll never know my group ordered a small pie to share and everyone agreed phony or not it was amazing-only!  Jalepeño popper - my favorite! Crunchy on the outside and the right amount of vegan cheese oozing hot with peppers that didn't kill me with hotness   Big Mac slice - I forgot the exact name they call it on their menu but again, I've had a Big Mac many moons ago and know the taste and BOOM! Super surprised they were able to recreate it vegan style ... I'm curious to know what the fake meat is but I didn't ask because I was too busy paying attention to details (like the sesame on the crust that looks and taste like a Big Mac bun)  After ordering at the counter there's plenty of seats upstairs. The food was awesome to satisfy our curiosity of whether or not it would taste like the meat version (ditto to that for sure). We all agreed the only thing that would've made the pizza *even* better was if the crust was slightly more crispy (keep the slice from flopping down/breaking apart) and salted/seasoned.   Oh and I forgot about the fries ... honestly they were forgettable since it wasn't anything to yelp about (kinda remember them being too salty) so they're not part of the \"so good\" claim I started this review with (but everything is).   Anyhoo, Apiecalypse is filed in my \"let's come back here again\" next time we visit Toronto!"}
{"text":"First time customer, and now I'm a fan of this place.  I've tried there mac pizza and it looks, and taste great. The customer service was good and I enjoyed the vibe there.  If your ever in Toronto, and wanna try great Vegan pizza, this is your first stop."}
{"text":"It is not difficult to make a super awesome vegetarian or vegan pizza. Actually most traditional Italian pizzas just need flour, tomato, basil, seasoning, and olive oil. This place is trying out some unique ways of loading a pizza with a ton of vegetarian options. Personally, most of the flavor combos were just too much. Good food should be simple and emphasize the few ingredients used. More is not always better, and the pizzas here have too much that the pure taste of individual ingredients were lost.  Also, they seem to use vegetarian fake meats a lot. Since these fake meats don't have the natural fat of real meat, they can taste very dry if not properly used. Yes, the 2 different pizzas I tried were very dry."}
{"text":"Having a vegan pizza/snack shop open up around the corner from your house is just magical! Full disclosure here - I am not vegan BUT I am lactose-intolerant so having a cheese-less pizza option so close to me is amazing.  I was actually really surprised when I bit into the BBQ pizza as the \"chicken\" on it could have honestly fooled me. If you didn't tell me it was vegan I probably wouldn't have believed you, other than the dayia cheese of course. I mean I like dayia but it's really only because I don't have a ton of other options.   Also the desserts here are to DIE for. Probably some of the best sweet treats I've had vegan or not. Get the mint nanaimo bar - you will not regret it.   I must go back to try the soft serve."}
{"text":"Being a huge fan of real pizza, I was skeptical that this could compete. I tried the Chicken Parmagiana and BBQ Chicken pizza and my partner had the Cheeseburger pizza. The flavour profile of all three were spot on and tasted exactly as we thought it should. The crust was also well done. Will definitely be back during visits to Christie Pitts this summer."}
{"text":"Okay I live in MARKHAM and I trek down to Christie Pits at least once a week to get pizza from here. Sometimes even twice a week. I'm OBSESSED. Their pizza is heavenly, unique and if I'm ever having a bad day, I'll head right down to Apiecalypse Now and automatically feel better. That's how goddamn good it is...like it brings me so so much joy it's insane. I've tried almost every single one of their pizzas but the BBQ and fat mac are my absolute favourites. I swear they have the best pizza in the city - even better than any pizza I've ever had before I went vegan.   Not only do they have bomb ass pizza, but they also have crazy good donuts - the Simpsons donuts are to die for oh my god. If you have not been here, you have not lived, trust me."}
{"text":"ABSOLUTELY BOMB.  Ahem. ok. As far as vegan pizza, heck, vegan junk food goes - this is the best I have had. Period.  Not just for vegans, guaranteed anyone will like this place.  The toppings are indulgent but work perfectly. We had the Fat Mac (drool) and the Toronto Island. Get the creamy garlic dipping sauce!  Annnnnd a Simpsons donut, because what are we, heathens?! Dessert is mandatory.   Also, located across from Christie Pits, as others have mentioned. Lounge with your pizza and friends in the park! It's summer! What more do you want?!?! Ok, done aggressively professing my love now.   (small small note, the crust was like, a little supbar on our second time, but I'll chalk it up as a anomaly)"}
{"text":"We loved this pizza!  I'm vegetarian, but my family is not and my kids (ages 9 & 11) thought this was some of the best pizza they have eaten.  My husband and I enjoyed the \"pig destroyer destroyer\" and the kids enjoyed the \"BBQ Buffalover\".  We made our choices just looking at the pizzas, but I wish we had looked closer at the menu.  Later I saw several other things I can't wait to try.   There is seating for less than 10 people, so be prepared to take out if it's full.  If it hadn't been raining, I would have been happy to walk across the street to Christie Pits.  We were lucky to arrive just as a group was leaving, so we ate our pizza looking at the donuts and we couldn't resist.  Generally I don't like pink food, but the pink donuts were so much better than expected and really good.  We make vegan cupcakes and regular donuts at home, so now we're inspired to make vegan donuts.  We'll be back because I want more pizza and to try their poutine or jalapeno poppers.  Wish we lived closer."}
{"text":"Amazing!!!  Pizza from other places just aren't the same.  Even pizza places with Daiya cheese (thanks to those for existing though!) don't have the same intricacies as Apiecalypse Now.  This place has the most amazing pizzas to choose from and you're not stuck with one simple order because \"that's all you can eat\".  My favourite so far is the White Walker and I also love the Pepperphony one.  I am really excited to try the mac and cheese one.  There are simple, basic pizzas but also very unique and more gourmet pizzas.  Plus, the staff are super amazing and friendly.  Would highly recommend to anyone and everyone.  Even if you aren't vegan, try it out!  Why not?"}
{"text":"Had to come and try this place out. I ordered the Simpsons doughnut and my boyfriend ordered the traditional glazed doughnut. As a vegan food option I found it super super tasty. I am trying to transition to a vegetarian diet and I was in the area so made a point to try this place out. I was pleasantly surprised and I definitely ate the doughnut way faster then I should have, it was moist and tasty, seemed super fresh.   I also liked the atmosphere, it's a small corner shop with lots of light. We were able to sit down at the window and people watch while we ate our doughnuts. When I'm in the area again... I'll be stopping in for some more and I'll come hungry so I can try their pizzas!"}
{"text":"Much better second time around. The Toronto island Pizza was delicious and the donuts are thick and rich. Avoid garlic sauce in the pizzas its very overpowering."}
{"text":"This is probably my favorite vegan pizza place in Toronto. I had the Big Mac and it was actually really good. I wanted to try the BBQ one but they ran out. Definitely come here early because they run out by the end of the day which I think is 6. Also their desserts look divine. Will be back to try their deep fried chocolate bars!"}
{"text":"Only tried delivery and mac and charlie pizza. Decent junk food for when you want to stay home, refuel, rnr, etc.  It was the saddest day the day I found out I'm lactose intolerant. Oh man, two things I usually can't order combined into one... done.."}
{"text":"I love seeing a vegan pizza shop! (The donuts look killer too.) The first slice I had from here (the fake pig parts) was delicious. The vegan 'Big Mac' was really underwhelming - enough to take off two stars, but the sesame crust won one back. And the staff - they're always fun."}
{"text":"One of my favourite spots to take a meat lover - always blows their mind. There are still plenty more flavours I need to try, but like many people, I keep coming back to the Fat Mac. All of the taste, far far less of the guilt. Tonight I had the Toronto Island - no surprise it was delicious. Their crust is truly superb, and that's really the foundation of a good pizza. The fake bacon coated in sweet BBQ sauce doesn't hurt either!"}
{"text":"It was late, they were open, and on the recommendation of a friend I decided to stop in for a slice of their vegan pizza, name eludes me but it was their vegan take on bbq chicken.  Oh. My. God.  It was amazing.  The taste was incredible, crust was nice and crispy and not doughy and thick, and for the price the slice was worth it!"}
{"text":"I loved it here! I got a slice of the Chili-Mac and Charlie and the BBQ Buffalover. The BBQ Buffalover was soo good. I also tried the Mozzarella sticks and the Jalapeno poppers. Both were amazing as well. Definitely recommend getting them as an appetizer or snack. 10/10 recommend this place."}
{"text":"Excellent service. FANTASTIC pizza! single slices of $4.50 and donuts for $3.50, also wonderful. A take out, snack in cafe. Not a sit down restaurant. Highly recommend anyone to stop here for pizza and a donut as its right across the Christie station."}
{"text":"Easily in the top five vegan spots in Toronto - actually, between Ontario and Quebec.  My partner and I ordered three slices - The Toronto Island, The Fat Mac and The Pig Destroyer. I've never had a Big Mac but my partner said it was so similar and even garnished with a sesame seed crust. The Toronto Island and The Pig Destroyer were a solid 10 for flavour and texture. The crusts on each were crisp yet chewy. The garlic dipping sauce was balanced and well seasoned.  The best part? The massive jalapeño poppers. Best I've had anywhere, vegan or otherwise. Spicy with an intensely flavourful filling, perfect crunch and thickness to the coating. If there is a must have here.. It's this - not even the pizza.   Why not a five out of five? 1) their infamous Simpsons donut was far too greasy, dense and lacked flavour/sweetness 2) we threw out the tempeh wings. They were under seasoned and an off texture. They really shouldn't be listed as wings at all.  All in all, in the top 5.  Service is beyond friendly. They can do no wrong when they have wonderful, patient service."}
{"text":"Not only the best vegan pizza ever, but the best pizza ever! Love the branding, the staff, the unique pizza flavours.. all around awesome! I only wish I lived in Toronto."}
{"text":"I was unfortunately disappointed by this vegan pizza place. We tried 2 pizzas and 3 different appetizers and were impressed by none of them. The pig destroyer was okay but we found the BBQ sauce base to be too sweet and little out of place for the flavour of pizza. The Toronto Island was not great either and the flavour was again too sweet and a little off-putting. In terms of appetizers, the tempeh wings had a texture reminiscent of cardboard and the sauce was too sweet. The mozzarella sticks and fried tofu nuggets were tolerable but nothing special.  However, we appreciated that the pizza was fresh and piping hot! Service was also very friendly. I'm, perhaps, just not a big fan of the flavours or textures they offer."}
{"text":"If you like vegan junk food, this is the place for you. The slices are so so good, my fav being the Mac n Charlie followed by Toronto Island & the Reunion Tour. I've been vegan for long enough to enjoy the taste of Daiya cheese, especially when it's used skilfully and not just thrown haphazardly over a pie (like most non-vegan pizzerias do). However, if you're a Daiya hater like my husband- do try the Reunion Tour slice as it has delicious house-made nut based ricotta type cheeze on it. I'd love to have one or two more slices with that stuff on it for him to have a variety.  The korn dogs are amazing as well, highly recommended with the Jalapeño Cheddar dipping sauce.  Their desserts are top notch. Possibly the best vegan donuts in the city, and a changing variety of other goodies too like peppermint Nanaimo brownie squares that are just so big and sugary and wonderful.  The slices are on the smaller size so get two if you're hungry and eat 'em in the park while the summer's still here!"}
{"text":"This restaurant was such a surprise! Don't expect classic Italian pizzas. These pizzas are chunky, full of fake meat and heavy! Nonetheless, so delicious! If you're hungry, are vegan and need fast food pizza, that's your place! My boyfriend enjoyed the pizzas a little more than me. 2-3 slices are more than enough. Their bigmac(?) pizza was phenomenal. Their donuts not our favourites (dough tasted like pizza dough and we wished it was softer). We gladly tried their selection of beers from microbreweries (they were very good!). Oh and their fried jalapeño with cheese....Just try it, don't question it!"}
{"text":"This is by far the BEST pizza I have ever tasted, vegan or not. My cousin from England traveled to Toronto just to taste their food and even took some back home with her. I highly recommend this place to any and EVERYONE, vegan or not. Do your body a favour. Also dont forget a donut before you leave as they sell out fast af!"}
{"text":"Apiecalypse Now! is the perfect place to grab a quick slice of za and a donut to wash it all down. The service is quick, the staff are cool, and the location is on point. Located directly across from Christie Pits park (and Christie Station - VERY accessible by subway), you'll be squirming to get outside in the summer months. Grab a slice and snatch a picnic table in the park.   My personal favourite: Zachos pizza and cinnamon sugar donut."}
{"text":"I ordered the vegan caes'r, Nicole's slaw and a cinnamon twist donut. The dressing for both salads is the creamiest vegan dressing I've ever had. The cinnamon twist donut is massive and was really good. I definitely want to come back to try the Simpson donut. There's lots of seating upstairs."}
{"text":"Got a slice of pizza - the pig destroyer. It was amazing!! Great flavours, with some garlic and bbq to it. Mmmm daiya cheese =D  Crust is good thickness and fluffy. Toppings flavourful. If you're hungry, one slice is definitely not enough. Prices for each slice range from $3.20 for the classic 'pepperoni' slice to the more gourmet ones.  Sooo tasty. Would def recommend! Located across from christie pits, you could just grab pizza and go across to the park for a picnic."}
{"text":"As I mentioned before in my previous reviews, I am NOT vegan. I've had vegan food before and have always enjoyed it. I've been to Raw Aura, Doomies, Hogtown Vegan and Grasshopper but Apiecalypse definitely tops the cake! It is the BEST vegan restaurant I've ever been to.   I got the BBQ Buffalover, The Fat Mac, Rainbow Vegan Cookies and a bottle of Parmaggedon.   BBQ Buffalover - this is one of the best tasting pizzas I've ever had (vegan and non-vegan). The cheese was gooey, the 'meat' was smokey, the bbq sauce was tangy and the ranch sauce was creamy. Definitely a fav!  The Fat Mac - ugh did not like this at all. I feel like this was just a deconstructed version of a Big Mac but in pizza form. The lettuce on the pizza was soggy and not very good.   Rainbow Vegan Cookies - these had no flavour at all. It was very crumbly and didn't really taste like butter cookies.   Parmaggedon- For anyone who's vegan or can't have dairy these are heaven sent! It tastes just like parmesan. Wishing I bought two bottles instead of one.   Overall, this place is a hit. It was so good in fact I went back the same day and ordered a large pizza to bring home.  Bring all your vegan/non-vegan friends here, you will not be disappointed."}
{"text":"I couldn't believe it tasted exactly like pizza... delicious pizza! Better then regular pizza!! I highly recommend! I tried reunion island pizza and it was delicious! Lots of vegetables, vegan ricotta cheese, and the dough was delicious! My friend raves about the Toronto Island pizza? So I will give that a try next time. I got one slice and was not full so make sure you get two or you will regret it! They also have a large selection of drinks and desserts, one of them being the Simpson doughnut which looks exactly like the doughnuts homer eats in the Simpsons!"}
{"text":"Love this place! My carnivorous boyfriend also approves of the pizza here. White Walker is our favourite, but we've also tried the Pig Destroyer (not a fan, but the boyfriend likes it) and the Toronto Island. The jalapeno poppers are whole peppers stuffed with cheese and bacon, and super crispy on the outside. The doughnuts are amazing as well!! Only thing I haven't liked so far were the tempeh wings, way too sweet.  Definitely will be coming back here!"}
{"text":"I occasionally go here when I'm in the area. Overall it's average pizza- could do with some more sauce, but the crust is delicious ."}
{"text":"Let me start off by saying this is not one of those gluten free, raw kale, overpriced, taste like cardboard kind of vegan pizza.   I ordered a slice of their \"pig destroyer destroyer\". The mock meats and cheeses are legit here. Filthy taste in a good way but without the animal products. Decent portions and reasonable prices. Friendly service.  Overall great place to grab a slice of vegan pizza. Give it a try the next time you are in the area. Don't get triggered by the V-word! Try it and I am sure you will like it."}
{"text":"We just tried this place when we visited Toronto (based on the Yelp reviews) and loved it.  We got 4 different kinds and they were all very good.  But the Fat Mac was so good that I immediately went back and got another slice for dinner before we left the city.  I love the fact that when I am looking at ingredients the only thing that I have to consider is whether I like it or not.  And the rest of my family which does eat meat liked their slices as well.  I wish we had this place in America :("}
{"text":"Has bookmarked this place for a long time and finally made the almost an hour trip from home to the Bloor Street (& Christie) location. Reached there at 7:15ish on a Sunday evening and they do close at 8pm and found that they stop taking orders for a full pies at 7pm. They also took orders for sides and had none of desserts left.   So we decided to take a slice of each of the pizza slices they had - The Pig Destroyer, The Reunion Tour and perhaps the third was the monthly special called BBQ something.   The Reunion Tour (3.5/5) was OK. The herbs, garlic and artichokes and onions shone through. The cherry tomatoes and cheese didn't work for any one of us. It tasted a bit on the sweet side. The BBQ pizza (4.5/5) was just amazing. Everything on that pizza was a perfect blend. The ChickN, the white sauce (garlic?) and the BBQ sauce was perfect. It started with a bit of sweetness however ended with a spicy kick at the end. The Pig Destroyer (5/5) was a pizza that I could have everyday of my life. Everything on that pizza was a perfect blend of seasoning to spice to cheeze sauce and the \"meats\" were very good.   We also had No Honey Wings (3/5). They are triangles of fried tempeh doused in some sweet sauce. Too sweet for us although it had some spice to it it wasn't much. The sweetness overpowering everything else. We also tried Hoser Fries. Spiralized Fries with all the fixings and topped with (Lays?) All Dressed Chips. The cheeze sauce not a lot. Lots of Vegan Bacon bits, raw and green onions.   As there was no seating as it was late, we walked to the park across the street and ate on a perfect spring day. Wish we could have eaten fresh warm food. Our experience would have been better I think and could have had some desserts as well.   But we are coming back. Soon"}
{"text":"It was amazing! True to the hype!  We had the big mac style and buffalo- thenig man one tasted just like you would dream."}
{"text":"2 words: vegan. pizza.  I like it, I like it a lot. I had the Fat Mac and it was soooo good. I want to try Zachos next and they have donuts that I have my eye on :) See you soon, Apiecalypse!"}
{"text":"A friend introduced me to this amazing vegan food and there's no doubt it's the place to try. I tried being vegan and this place was my sanctuary at the time! Their unique take on vegan will blow your mind. From pizza, to corn dogs, and to doughnuts, this is an amazing place to start. I even got non-vegans to try it, and they still don't believe it's vegan, myself included."}
{"text":"The Pig Destroyer and Fat Mac are my favourites but I love them all! I am so glad they opened a second location in the East end (Pape and Mortimer) as I was driving 25 minutes each way every time. Their pizza place was my pregnancy craving!!! Lol."}
{"text":"Pretty good pizza for a place that isn't even open yet! In about a month, this will be a proper vegan pizza and snack bar, complete with g-d corn dogs. CORNDOGS! I'm excited just by the prospect.  Why Hogtown, Sadie's and literally every veg place with a deep fryer doesn't have vegan corn dogs, I don't know. (If Chicago Diner can do it...)  We tried one of every slice they had available: A white pizza, a mac 'n cheese (why did this take 7 years to come to Toronto??? Another Chicago thing), a standard pepperoni and a BBQ chicken.   Tasty toppings, but the crust was on the thin side on most slices and a bit crackerish which isn't really how I like my pizza. I'm into a thicker, more chewy and satisfying crust unless it's Napolitana style, which this isn't. Also, stuff that crust baby! Couple that with the ranch dipping sauce that used to be at the Apiecalypse Bakery and that's good. I've eaten myself into a food coma on homemade stuffed crust pizza and Apiecalypse ranch many times.  The place has bar seating for roughly 6 and 4 chairs along the wall but it's definitely take-out style so don't plan to bring a group unless you're headed to the park. (Stop stealing my ideas!)  Overheard talk about dessert (pizza?) options and there were a couple donuts for this soft opening, making it the 4th place you can buy vegan donuts within 3 subway stops (Bloomer's, The Steady, Through Being Cool - not to mention the vegan baked goods at Bakerbots and D-Beastro)."}
{"text":"I got off the subway to meet a friend and I had this place bookmarked at one point but removed it thinking I would never visit, however when I saw it, I knew I had to try it. While I try to eat very healthy and mostly vegan these days, I definitely do miss a greasy pizza.  Usually I can custom order a vegan pizza, but when I saw this place was also organic, I was SOLD SOLD SOLD.   Atmosphere: mostly a takeout place with a few bar stools for eating in.  What I ordered: Pepperonhy pizza. It had a thick crust with great texture. I usually prefer thin crust though, but I still loved it. In terms of replicating the look, it didn't come close to the real thing (vegan cheese is very easy to tell apart from real cheese) but the Pepperonhy looked pretty close.  In terms of replicating the taste, it was close except that it was BETTER!  What I also like about this place is that they have a bunch of preset pizzas so you don't have to think. Thinking's hard man.  In addition, they have vegan donuts.  Verdict: For a vegan cheat day, this place is da bomb and will definitely cause an Apiecalypse in your mouth."}
{"text":"This place would be amazing, even for non-vegan customers! Granted it's small, but the food is great and more than makes up for it. We got the Fat Mac pizza (a popular choice since everyone was asking for it) along with one of every single donut and we were blown away. Another thing that surprised us were the amazing prices. If you're looking for a greasy-spoon cheat meal for cheap, this is the place to go. We live in Richmond hill, but went all the way to Toronto just to try Apiecalypse Now!, and would make the trip over and over again just for a slice of that pizza. This is the food that makes people want to be vegan. 10/10 would (and will) go back again and will definitely recommend to my vegan and non-vegan friends and family."}
{"text":"Best pizza in Toronto. The crust is incredible and there are lots of different pizzas with crazy topping combinations. Try the donuts too."}
{"text":"I had a slice each of the Toronto Island and the Whitewalker. Both were excellent BUT I had a bite of my husbands poutine and it was SO GOOD! The cheese on it was phenomenal.   Doughnuts! Forget those other vegan doughnuts that are cake baked into doughnut shapes...THESE ARE REAL DOUGHNUTS and they are AMAZING!"}
{"text":"Great little vegan pizza shop outside of Christie station. The slices are a good size and reasonably priced. You can definitely see the work they put into these pies; making sure the flavours are harmonious and meat eaters don't feel cheated, haha. I recommend the the pig destroyer destroyer- really great flavour!"}
{"text":"Heard good things about this place and I really wanted to try vegan options and what vegan cheese tasted like!   I got a slice of BBQ lover pizza (~$5), and ate in. (There are only a few seats so keep that in mind!) It was a big slice with nice thin crust and crispy. However, it was WAY too salty! With bbq sauce, ranch sauce and cheese and crispy bits it was the saltiest pizza I've ever had. No wonder they have jugs of water by the tables.  The crust was okay, soft and chewy but tastes like soda crackers.  To be honest, I don't know if I want to try another slice. I'm not lactose intolerant so I'm okay with regular cheese. I went to the pizza place next door after, and after having their slice, I realized just how much more salt apiecalypse has."}
{"text":"Went here after a meeting in the area.   Finally got to try their vegan pizzas, got the \"meat lovers\" and my friend who eats meat and myself loved it! So hard to decide between the many choices and delicious combinations.   Also grabbed their simpson donut but didn't eat it til later that night and kind of wish I had it earlier. But an unnamed Burlington spot really has spoiled me rotten for vegan donuts. Also got their chocolate almond donut which my partner really enjoyed!  Will definitely go back!"}
{"text":"I got the Toronto Island and 2 donuts. I didnt really enjoy it. The donut didnt have the normal deliciousness that would make you crave it on rare occasions...and for the price of $2.50 each. Definitely not worth it. The pizza was forgettable. Staff is very nice, getting in and out took a while if there was a line."}
{"text":"Highly satisfied with the pizzas and doughunts I've had from here. The lines can be quite long so bring a friend or a book."}
{"text":"Absolutely the best pizza place ever. I've never been too crazy about pizza so it's rare that I ate it, but when Apiecalypse opened I had to try it. I love that they are conscious about quality and flavor, not to mention a great staff. I stay away from pizza places in Toronto in general because they lack quality and I don't want animal products in my food, so Apiecalypse is a real treat. My favourite is the reunion tour pizza. The dough is just perfect and I love the veggies. The garlic dipping sauce tastes great. It's also nice to see that this place is situated in between conventional pizza places but Apiecalypse is always waaaaaaay busier. . . glad to see people finally starting to care about quality (it's about time) not to mention compassion for animal-free food."}
{"text":"This place is bomb!!!  So thankful to live in a city that finally has a vegan pizza place! I've been here three times, and it just gets better and better. Each time I HAVE to get a slice of the Mac and Charlie. It's to die for. The pizza crust in general is pretty amazing. Last time I was there, I tried the mozzarella sticks. I got an amazing cheese pull out of them! Who'd have thought you can get that from vegan cheese!  The soft serve is also out of this world. Perfect for a nice walk through Christie Pitts!"}
{"text":"gotta love vegan pizza! and donuts!   I would love to see more non-daiya options but can't complain too much about all-vegan pizza"}
{"text":"Awesome vegan food that won't break the bank. Definitely recommend."}
{"text":"Been here a few times now, enough to know that everything is pretty damn delicious. The pizza is really good, I love the poutine as well. Donuts are good but I've had better for less cost. Service has been hit or miss, not super friendly just average. It looks like a small place but they do have seating upstairs, we've never had an issue finding a table. Food comes out pretty fast, even when ordering a full pizza to go. The ranch dipping sauce and other sauces are so amazing I don't know how its vegan. The location is good, lots of parking (paid) available on the street or in lots. I ordered one of the chocolate bars they had which ended up being expired so I had to choose a different flavor which was disappointing. The packages of these chocolate bars said 'Should not be consumed by people with milk/dairy allergies' which was pretty concerning to a vegan. I know many things are processed in dairy-use facilities, and don't exactly have milk ingredients but I had never seen that warning on packaging before. They should probably consider purchasing from an all-vegan company in general. The bars weren't that good anyway but they didn't have any donuts left, so I just thought I'd try. Overall, never had a bad experience with their food and I would recommend to everyone. Definitely will continue coming back here."}
{"text":"This place was amazing. I am a Detroit vegan who was visiting the city for a few days and was told i must stop by! The Toronto island pizza was fantastic - if you love pineapple on pizza (as you should), then you NEED to try it!!! Also had the cinnamon sugar donut and it was awesome. Love this spot"}
{"text":"Ordered the slayer and pig destroyer destroyer. It was alright pizza. But nothing to come back for. The pizza had so much fake cheese on it, that it was oily beyond belief and gave everyone stomach problems. The \"meat\" is overly sweet and for the most part tastes just like honey on a pizza. It sticks out like a sore thumb compared to the rest of the flavours. Made me feel ill every time I had it. Their one saving grace is the jalapeño poppers. And that's the only thing that didn't make me sick.   Also, side note: if you don't like a place with heavily implied and shown political views and instead want something more professional, I'd suggest skipping this place. They have an antifa sign by the door, and several signs saying they'd kick you out without giving reason. Made me uncomfortable and left a sour taste in my mouth. I personally don't like when business is merged with personal beliefs and politics.   Side side note: the staff also sounded like they were arguing in the back over something, so that was awkward.   Maybe they were having a terrible day and made the pizza wrong, but  Overall, definitely wouldn't come back."}
{"text":"Mozzarella sticks=convincing Marinara sauce for dipping=needs salt Yeezy bread= boring, dry, bready and def not worth it Caesar Salad= don't need to have it again. Dressing was very mustard heavy. The fake chicken made my stomach gassy  I really wish I liked this place more. I really do. I will continue to get those mozzarella sticks though."}
{"text":"I've always wanted to try vegan pizza for a long time, and I am glad I picked this place! I've tried the bbq buffalo pizza and it was a little spicy but it definitely exceeded my expectations.  I posted a photo of it on Instragram because I wanted my friends to see it and check out the place at least once in their life!"}
{"text":"The White Walker is my favourite pizza on their menu. The mozzarella sticks are also a fave. The customer service has always been phenomenal. Would 100% recommend for Vegans and non-Vegans alike!"}
{"text":"Greatest pizza place you will ever come across. Not to mention its vegan AND organic? Come on, for the price they offer, you really cant go wrong. Don't waste your money anywhere else; GO HERE"}
{"text":"THIS IS MY FAVOURITE VEGAN PIZZA PLACE!!! I've tried both the Pig Destroyer pizza, the \"Mac and Cheese\" pizza, and a vegan corn dog. Both of the pizzas were awesome, although of course they weren't the healthiest choices. But if it makes you feel any better, their ingredients are supposedly all organic!   I wouldn't order the corn dog again, partially because I don't necessarily love corn dogs, but also because the hotdog used was kinda... weird? Like rubbery and sorta plastic-y? But that's honestly how most vegan hot dogs' texture are without being pan fried first.   But all in all I love this place- they're notorious for being really close to their meat version and for being able to mimic \"normal\" pizzas. Although they use Daiya cheese, it's not very noticeable in a good way (cause personally I don't like the taste or smell of Daiya cheese)"}
{"text":"100% vegan.  100% junk food.  100% delicious.  I tried... -- The mac & cheese pizza.  Decadent on top of decadent.  4 stars. -- Jalapeno poppers.  Best ever, even if remembering back to when I ate real cheese.  5 stars. -- Donuts.  Sugar topped with sugar topped with cookie bits.  Yum yum. 5 stars.  Prices are really low and service was very friendly.  I'm glad I don't live in Toronto, or I'd gain 100 lbs."}
{"text":"I am from Toronto but live in Florida and the pizza in this place is the bomb!!! It is so fresh and the taste is out of this world. Will be coming back every time I'm in Toronto. It's a must for Vegan pizza!!!"}
{"text":"This is probably the best vegan pizza you can find in Toronto. I am not a vegan myself, but pizza here (especially Fat Mac) tastes better than regular meat/cheesy pizza!!!  Me and my boyfriend came around 8pm on a Tuesday night. The place is empty, second floor has 30+ seats and you can get alcohol.   We ordered 3 kinds: Fat Mac, BBQ Buffalover, Pig Destroyer Destroyed. All of them are very tasty, satisfying, and you don't feel bloated at all after meals.  Fat Mac is very creamy, messy to eat but most delicious among all!!!!!! BBQ Buffalover has sweet taste in it, if you don't like sweet taste in your pizza don't order it.   I will def come back here!"}
{"text":"Their poutine is so delicious omg. The cheese  my friend who loves poutine told me she loves it more than regular meat based poutine!"}
{"text":"I'm not sure if I'm not use to vegan food or if it was the food itself, but my experience here was a little hit and miss. I had a slice of The Fackin' Wheel and was torn between being impressed and confused. The dough is really well made, a solid crisp base for the toppings and the crust had a great texture and taste. However, for a pizza with two types of cheese, I didn't taste any cheese flavor. The predominant flavor was definitely the garlic from the artichokes, which was good but its only one of the six ingredients. The Seitanrizo crumbles was a little jarring because it was strangely overly chewy, which clashed with the rest of the textures of the pizza. Maybe I didn't order the right pizza for my first try??  The fried tofu side was really well made. Great crunchy outside with a firm tofu texture inside. Definitely the winner over the pizza. Service was helpful and friendly. I would be open to trying another slice of pizza in the future, especially if I'm hanging out at Christie Pits right across the road."}
{"text":"I had the mac and cheese slice with chipotle dip and a strawberry shortcake donut for dessert. Both were delicious and since this place is dangerously close to my home, I can see it becoming a regular thing. Nom."}
{"text":"The Pig Destroyer Destroyer is a must try (I suggest you use a garlic dipping sauce or any sauce that you like with their pizzas because they taste pretty dry without) also the donuts are amazing! I especially loved the Simpsons donut very creative and tasty idea. Would definitely come back :)"}
{"text":"Went here today for a slice of pizza. It's a convenient location, and female staff was nice and friendly. I like the fact they have water available in jugs, cups, and paper towels (really nice touch).   The pizza was very oily, and it fell apart when you tried to hold it, thus you can not really hold AT ALL to eat it as you would a normal Pizza slice.  As the pizza crumbles, no point paying for a dipping sauce, because it falls a apart. Clearly person who made it does not know what he/she was doing.  They should give a fork to eat the slice, no need for a knife...  or improve their slice so that it does not fall apart like a child made it.  Did not enjoy it at all.  4 stars for staff and convenience but 1 star for food, thus 2 stars."}
{"text":"Best pizza I've ever had ! Also so impressed with the poutine that I had to get it again. I look forward to trying everything on the menu."}
{"text":"O-M-G! I loved apiecalyse now. This vegan pizza was THEEEEE BEST vegan pizze I've ever had.   The service was great! Everyone was so friendly and answered all my annoying questions lol  My mom and I ordered the reunion tour. It was a super veggie pizza but delicious. We also ordered vegan mozzarella styx and the vegan jalapeño popper, I wouldn't order those items again because  were deep fried and had too much batter on them but they tasted good but I'm trying to live a healthier lifestyle lol   Overall I can't wait to return!"}
{"text":"I really wanted to like this place since I live in the area and like eating and supporting vegan businesses but the pizza here was just okay. It was a bit cold (even after being heated up) and the slices are small for the prices you pay. The dough was also tough and flavorless. I will try it again in case I went on an off day. The staff was friendly though."}
{"text":"WHY DID NO ONE INFORM ME OF HOW GOTH THIS PLACE IS?   There were a bunch of teenagers dressed in black chain-smoking and eating their donuts in front of Apiecalypse. I didn't think much about it, but when I actually went in, I was greeted with the beautiful, soothing music of heavy-metal screamo. It was a really jarring experience.  The customers were dressed in black from head-to-toe, and the staff looked very edgy as well- covered in piercings, black lipstick, and heavy eyeliner. They were all very friendly, and they heated up the pizza in the stove before serving it to you.   Even the pizza slice is wrapped up in black paper, haha. They really have this dark, brooding theme down to a T. I happened to be wearing a bright pink jacket on that day, and I've always had a penchant for pastel colors, so I really stood out in Apiecalypse. It felt like a scene from a sitcom.   I found the pizza pretty okay- thin crust, vegan cheese, interesting pizza toppings. I'm a massive carnivore so eating pizza without meat on it was a bit sad for me. I'm sure this would make a great pizzeria for someone who is lactose-intolerant or lives a vegetarian lifestyle.  I had the Toronto Island pizza, which was unexpectedly sweet? The tofu on the pizza has a bacony texture, which is very cool. We also had the BBQ Buffalobotomy which was much tastier than the Toronto Island, so I definitely recommend it.   Drop by if you're vegan or vegetarian, otherwise I'd probably go to a greasier, meatier pizzeria!"}
{"text":"Vegan pizza and donuts - Absolutely yes. A gem among many other vegan gems in the vegan friendly Toronto area."}
{"text":"Their jalapeno poppers are actually spicy!! Can't wait to try more stuff, service was great, beer was amazing, what more do you need?"}
{"text":"I had first heard about them from VegFest. One taste of their vegan pizza and I was hooked! I had to find out where this place was located. So I picked up their business card and I've been a regular customer ever since.  Parking: Located downtown Bloor, so you'll most likely have to pay for parking during daytime hours. Finding parking spots is random (it's the parallel parking kind of parking you'll have to be doing.)  Venue: Very small walk in pizza joint. As is your typical pizza joint, you're given a display of what you can grab and go or you can order it fresh off the menu. There are no tables to sit at, but there is however a counter where you can sit and eat your pizza. *UPDATE*: They just opened up the top floor, so there is actually more seating above, a bar where they serve alcohol and another set of washrooms.  Washrooms: Well maintained, clean and stocked. Just 1 graffiti mark on the wall that's about it.  Experience: I had a great experience here, the staff are very cool to talk to, and the food is good. I've tried the Mac and Charlie, Reunion Tour, Toronto Island, the monthly special (a poutine pizza) and my personal favourite the BBQ Buffolobotamy which I order every time. The Jalapeno poppers was something I also ordered frequently, I've tried the mozza sticks and the poutine there.   What I'd recommend are the BBQ Buffolobotamy and the Jalapeno Poppers, but that's just me."}
{"text":"I've bookmarked this place some time ago, and I was excited to finally visit this place!   I'm not vegan, but was curious as to what a vegan pizza would taste like.   Service: A friendly young lady greeted me and informed me that there's a menu that I can look at (rather than read pizza description on the glass panels)    Order: Recommended to try the \"Pig Destroyer\"   With tax, the pizza slice was about $5.   Food: It was sooo tasty! The cheese was gooey, the mock meats were chewy and succulent, the crust was soft, the consistency of the sauce was just right- not too much, not too little.   I would come back and try the other slices!  You should too! :)   Tip: limited seating area (there are 4 chairs and a long table)"}
{"text":"It was very hard to do this review mainly because we came about an hour before they were going to close and you can tell the pizza we got was the leftovers from earlier and their selection was very minimal.   The restaurant itself is this little hip spot that is pretty cool inside and even has an upstairs dining area that sells beer! They played good music and had some awesome décor and the workers there were very nice.   When we walked up to the front to order it looked like they had a bunch of different flavors (you can tell even by looking at their menu), but many of them weren't made and they said what was there was all left for the day (understandable since it was close to closing). So we ordered what seemed would have been the best from what was left which was: Zachos, The Fat Mac, and sadly I cant remember the last slice.   Overall the pizza was alright (nothing spectacular about the slices we had); it was a bit hard and you can tell it wasn't very fresh (The Fat Mac had to have been our favorite). They do have a some good dipping sauces that you can choose from so that is awesome and the fact that everything is vegan is nice.   I definitely would like to come back to Toronto and make a stop in early in the day and taste their pizza when its fresh!"}
{"text":"This pizza was lacking for me... It needed that zing... cheese and meat???  I know this is a vegan place, so it's definitely not bad. but not the greatest.  also, the sit in area was too stuffy, though there is a beautiful park just outside making it awesome.  i got the big mac... and... it was .. half there to tasting legit.   i love my veggies... but this place didnt' do it for me..."}
{"text":"Ordered the white walker(garlic sauce, arugula, vegan mozza, tofu\"chicken\"), the tempeh wings and the little Simpson donut. Pizza was 9/10. It's refreshing, not greasy, not salty(some may find it plain but it's the right amount of flavor for me). The vegan mozzarella was creamy but with no mozza texture. \"Chicken\" tasted exactly like tofu. I tried some \"Parmesan\" too. It turned out to be too salty. Since there was no excessive oil, the crust was not as crispy as some other pizza. Wing was 3.5/10. It was basically just fried tempeh in syrup, super sweet. The taste of tempeh and syrup wasn't getting well together. Donut was 7.5/10 It's doughy with right amount of sweet. Finished in two bites. Nothing special but an ok donut. Will get a large one next time I crave for donuts."}
{"text":"Bookmarked this place in advance, and finally had the chance to see what it was about. Lets just say this is the realest tasting vegan pizza i have ever had. I have had a lot of vegan pizza  but this takes the cake easy. I had two slices one was the Pig Roaster and the other was The Buffalo both were Fantastic. My meat eating friend ordered the Big Mac and Pig Roaster as well and LOVED IT!! On a side-note they also serve vegan poutine and donuts. My favorite one is the Cookies n Cream out of what the ones we tried. All in all i do recommend everyone to this place. Literally they have something for everyone."}
{"text":"I love Apiecalypse Now! I recommend this place to anybody who will listen. Their pizza is phenomenal and the best I've had vegan or otherwise. Try the Fat Mac or the Pig Destroyer Destroyer! Or anything for that matter, I haven't been let down yet. Can't wait to try their new burger bar, BRGR KVLT! Cheers."}
{"text":"My friend and I each ordered a slice to go, and they were different types of pizza. I got the Big Mac she got some bbq stuff. for some reason instead of giving us each our own bag they put both slices in the same bag FACING EaCHOTHER LIKE A DANG PANZEROTTI. I'm sorry BUT WHAT KIND OF SICKO DOES THAT. if I wanted a flipping panzi id be down the street at bitondos thank you very much!!! I'm still giving them four stars because they had the balls to make our two different slicesinto a new sandwich which is not what we ordered but whatever it tastes really good."}
{"text":"Their pizza is probably one of the best I've ever had and I'm not vegan."}
{"text":"Decent slice of vegan pizza. If your also gluten free they have gluten free options. I just came in for a bite of pizza. Not bad at all. I got my pizza to go because the dine in option was impossible because there was no air conditioning in the store, other than that, it's a nice quick bite in the go!"}
{"text":"The \" pig destroyer \"  is great, very tasty. The buffalo/BBQ flavoured pizza was a little bit better!in my opinion. Although enjoyed both slices.   Also had a maple donut which was very delicious.   I plan on going here 1-2 times in a month for a cheat meal, although I would still say it's a healthier pizza and not the traditional non-vegan \"cheat\" pizza."}
{"text":"Quite a small place but they surely are able to cook up some amazing pizzas and donuts. Definitely to be tried if you are a vegan.   Food: They have a great variety of pizzas and donuts. We went for the \"Pig Destroyer\" and \"Zachos\" pizza slices. Both the pizzas were great - seasoning, veggies, soy, base, the heat and how everything came together to make an amazing pizza. We also went for a Yeezy Bread to accompany the pizzas but heavily underestimated the size - kind of our mistake that we didn't read the description properly which said 12\" circle. Very delicious and something you would enjoy while watching a match with a can of beer!! However, calling it a bread is a little misleading when it is a size of a pizza itself.  For donuts, we went for the Pistachio donut - quite heavy but delicious.   Space is quite congested - very limited seating. There are a couple of tables facing the street (high-chairs format) and two chairs next to the staircase. There is additional seating space upstairs that opens up after 2 PM. We, unfortunately, reached in the early afternoon, so had to put up with whatever was available. On top of that, two of the customers occupied seats even when they were done with their food and were just chatting - didn't bother to vacate even when they saw us searching for space. It's not something one would expect in this part of the world.   The staff was very friendly and the service was quite fast. The place is good for a takeaway, especially if you are going there in the first half of the day."}
{"text":"If I ever become vegan, this is the place I'm giving credit to for helping make it a reality. This joint specializes in vegan pizza, and my first sample was of \"The Fat Mac.\" It's a vegan interpretation of Mc Donald's Big Mac and has \"ground not beef, shredded dill pickle, sweet vidalia onion, plant-based cheddar cheese, diced iceberg lettuce, sesame seed crust, and vegan fat mac sauce.\" Overall, a really great substitute as the plant-based cheese has a gooey texture and the fat mac sauce is a near perfect copy. The non beef has an almost rubbery/squeaky texture but you really don't miss the real thing as everything else is full of flavor. Also had the (I believe this is the one in the pic) BBQ Buffalover which has \"BBQ sauce, buffalo soy curls, red onion, plant-based mozzarella cheese, plate-based japaleno cheese, ranch dressing.\" The soy curls tasted like chicken cause, let's face it, everything tastes like chicken. The sweet and smoky BBQ sauce brought out the sweetness in the onions and the creaminess of the cheese doesn't make you miss the cow version. This place is conveniently located directly across Christie subway station and the park for some outside seating. Or stay inside during colder months. There's very limited seating on the first floor but seems like you can take your food upstairs to the sister bar. By the way, really friendly chill people. Can't wait to come back!"}
{"text":"Their pizza is the best vegan pizza I've had in the entire GTA. In fact, it's the best pizza I've had in my entire life (my non-vegan past included). The staff are always extremely friendly and more than happy to offer suggestions.Their other food items such as their jalapeño poppers are also great as well!"}
{"text":"There is no better place for vegan junk food than Apiecalypse Now. What more could you ask for they have donuts, soft serve, and such creative pizzas loaded with toppings and vegan cheese. I usually don't even like daiya cheese that much but they do it so well here even the texture of the pizza crust is amazing. I had the pig destroyer pizza which had I think 5 different types of vegan meat. If you want to try mock meat (whether you're vegan or not) this is the place to do it.  The staff are super friendly and the place has lots of personality. Need to come back asap and try all their different pizzas!"}
{"text":"Vegan food is great when it's green and in bowls, but it's even better when it's in a plain white box in all of its comfort food glory. Apiecalypse is a must-try for for vegans- everything is plant-based, so you can have anything on the menu!  I appreciate their diverse pizza offerings- from nostalgic burger flavours to beautifully crafted vegetable pizzas with incredible house-made cheeses. They offer a few gluten free options, too, and their GF crust is phenomenal. The faux-BBQ meat on the pizza, however, was a bit too sweet for my liking. I also wouldn't recommend making this a regular spot if you have a sensitive stomach- it's rather greasy.   I can't speak much to the dine-in experience, as we've only ever had it delivered. They are also very accommodating of dietary restrictions. Vegans and omnis- give this a try!"}
{"text":"This vegan pizza place is located just opposite Christie Pits park. I'm not vegan, however my friend is and she highly recommended the spot to me... Her description was \"you won't even know it's vegan!\"   She was right! I got a slice of the Fat Mac pizza which is inspired by the Big Mac. It tasted like an absolute replica of the Big Mac except it's pizza and vegan! I also ordered the cheese sticks which were quite a large serving, you wouldn't even know that's vegan either. They also sell desserts here like donuts and ice cream.   I'll definitely be back to try the other pizza flavours and the desserts. The server here was also very lovely, best customer service I have experienced in Toronto!"}
{"text":"Vegan pizza fiends this is a destination to add to your to do list! Small store front with minimal seating--best to take out as there is a small park just a stones throw from establishment.  Purchase by the slice or entire pie :D To get a sampling of their fare ordered 4 slices: 1)The Fat Mac includes special sauce, lettuce, down to a sesame seed crust = LIFE CHANGING! 2) BBQ Buffalover had an amazing zesty sauce and the cheese used is the best I've had thus far. 3)Chili Mac & Charlie was the only slice that was underwhelming as macaroni was very dry  :( 4) the Pig Destroyer Destroyer =lots of veggie meats on this slice!  They also sell the most amazing looking vegan donuts I've ever seen. Sadly was too full to sample them.   Adore there creative menu and style"}
{"text":"Best vegan pizza I've ever had. Came up from Miami for the long weekend and I'm hitting up tons of vegan spots with my girl and stopped in tonight. Four slices for $20 give or take and I would of payed double! Pizza had so much flavor and service was great. Highly recommend even if you're not plant based."}
{"text":"The worst crust I ever had in Toronto. It was like saw dust, dry and tasteless. The pig destroyer was terrible. This slice was too heavy in taste and also left a bad taste in my mouth. The BBQ sauce pizza was too heavy and sweet in flavor and also left a terrible after taste.   Please improve on the crust and maybe a good tomato sauce would also be nice.  Sorry to be nasty but a better crust and tasty toppings is an easy fix."}
{"text":"Traditional, fancy, DOP certified pizza this is will never be. Tasty and damn convincing though? You better believe it.   Over the weekend I was spending a night in with some pals who were having a mega craving for the Fat Mac pizza, and I was curious to try this thing they had both been going on about for ages. Never having tried a real Big Mac in my pre-vegetarian days though, I wasn't confident I'd be down to commit to it as my only source of Friday night junk food, and perused the menu a bit before settling on a second pie. My high-school days working at a Kelsey's in the burbs came flooding back to me when my eyes landed on the Buffalover. The ingredients were almost the exact same as my buffalo chicken pizzas of yore, only veganized, and I knew I had to give it a go. BBQ sauce, soy \"chicken\", red onion, vegan mozza, and ranch dressing? This monstrosity needed to be mine.   I gotta say, it didn't disappoint. Every bite lived up to expectations and I looked forward to the leftovers the next day. The Fat Mac was also good, but I think those who hold the original Mac from McD's close to their hearts will always love it more than I ever could.   I look forward to checking out the rest of the menu eventually. There are so many delightfully trashy food items to explore; from the chili mac 'za to the tater tot nachos to the deep fried \"mars\" bar, I feel its my duty to investigate them all."}
{"text":"So I was craving a pepperoni pizza and, after I read all of the GREAT reviews, I decided to get my pizza fix and save a pig at the same time. If I like this pizza as much as the real thing then I can be a regular and save dozens of little piggys! So they deliver via uber eats $5 delivery and I ordered the smaller size (12\") of the pig destroyer destroyer. With tax and delivery it was $26 (not tip since I'd just spent a tun on one pizza just for myself) The verdict....I could only eat one slice and I was grossed out. It tasted like dry dough (not fluffly or crispy) and the toppings were not evenly distributed so there was too much of one topping on some slices and none on the others.  After a few mouthfulls of what tasted like rubber covered in a tun of paprika, I had to mourn the loss of my money and my determination to save pigs. Only a strict vegan who is missing meat but refuses to eat it could maybe like this.... maybe."}
{"text":"So amazing! As others have said, I keep trying other flavours, but I always end up coming back to the Fat Mac, which is essentially a vegan Big Mac on a pizza (healthy, I know!). I tried the tofu nuggets, which were a little different than I thought, and I didn't like them as much. But honestly any pizza here is great, and I always love taking a trip here!"}
{"text":"Located on Bloor Street West on the southeast corner of Bloor and Christie the place is a small corner shop converted into a small take away. While there are a few seats perched in the windows looking west and north it really is a take out place. The place has a small selection of donuts and thin crust vegan pizzas by the slice. While we haven't tried their pizzas, we tend to make our own, their donuts are just the right mix of doughy deliciousness and not too sweet toppings. Too often vegan desserts are far too sweet, but Apiecalypse manages the right balance in their donuts. The only issue is they that these yummy donuts disappear to quickly. While picking up donuts yesterday we discovered they also have a number of vegan nibbles, including their version of corn dogs, which I need to try, jalapeño poppers and mozzarella sticks."}
{"text":"Easily one of my favourite vegan places in the GTA!! Worth the 45 minute drive! The must try slice is the Fat Mac and a close second is Zachos!"}
{"text":"This place is really good! All the pizzas are really tasty, I especially recommend the Pig Destroyer. The staff are friendly and it's always pretty busy."}
