{"text":"This place is freaking ridiculous! I call and place my order and they said it'll take 45 mins to an hour, ok fine I can wait. The food gets here the driver is in a rush and drops the pizza and leaves. I check my food and it's the  WRONG order! I ordered a pepperoni and bacon pizza, with 12 chicken wings, and 3 cups of ranch. I got a chicken and jalapeño pizza, 12 chicken tenders and 1 ranch. I called the driver to tell him and he got mad at me and said I ordered it wrong and was very adamant that it was my fault. He hangs up, calls the pizza place and calls back and says o it was my mistake keep that pizza I'll bring you another one. Ok so I'm happy and I'm waiting, a new driver comes in with the new pizza and we check it and it's correct, but then he goes I need the other one. I was like no he said to keep it, he then goes we need to take that pizza back to who it's supposed to go to. I then proceed to tell him we ate a slice from it and he gets angry calls his manager Cynthia to tell her and she calls my phone angry screaming why we kept and ate that pizza. I hung up on her and gave him back the pizza and he left angry with it. They are disgusting and have the worst service ever!"}
{"text":"Food took an hour and a half,  arrived cold, and no 2 litre soda.  STAY AWAY..wish I could give them .25 star"}
{"text":"My office orders from them all the time. We will never order from them again though. After getting food delivered, I called and spoke to a woman to ask what the breakdown in pricing was because they did not leave a receipt showing what we ordered. She told me my total. I had to explain that I need the actual breakdown of each item. Right away she was getting very impatient with me and trying to rush yelling, \"what the problem?!\" I told her nicely that I'm just trying to understand why I'm being charged so much.

She explained that they charge .50 cents extra for each ranch and marinara and that the delivery fee is $1.00. I told her it still doesn't add up. She continued to be very rude and impatient. She said I'm adding wrong and that I'm supposed to add tax AFTER the delivery fee, which is wrong! And even if that was the right thing to do, she STILL overcharged me!

She asked again, \"what the problem? Things happen, it ok.\" I told her, \"it's NOT ok and I want my money back that you overcharged me!\" I also explained that their soup was sour and that I bit into a hard inedible piece of who knows what. She argued with me and said their soup is fresh. She then yelled, \"what you want? You want credit? I give you credit next time.\" I said, \"we will never be ordering from you again and I want my money back right now.\" She yelled AGAIN \"what the problem?!\" I said, \"your soup was disgusting, you overcharged me and you've been very rude this whole phone conversation! Can you just refund my card?\" She claimed she couldn't. I asked to speak to a manger and she said, \"I am manager, I owner.\"

She FINALLY said she'll just have the delivery driver come back to my office to get the soup and give my money back for the soup and what she overcharged me (which would only be a total of $4.96, mind you). And then she hung up on me!

She called back a few minutes later yelling, \"where the soup, you eat it?!\" I said, \"no, I have it right here.\" She asked, \"what wrong with it?!\" (even though I already told her). I explained again. She asked, \"where the hard piece you say you got in your mouth?\" I said, \"I threw it away, it's right here in my trash.\" She screamed, \"that was wrong of you to do!\" I said, \"it's wrong the way you run your business. Have your delivery driver come back, he can get the soup and give me my money back\" and I hung up on her this time. No one ever came back and she still charged my card the full amount!

I just think it is so ridiculous that she is an owner and she argued and questioned me for over ten minutes. People with good customer service skills believe that the customer is always right. She just lost a whole office full of customers because of this. If she was smart she would have been nice and accommodating. Then we would have been right back to ordering within the next couple days. Not a chance now!"}
{"text":"Awesome food, awesome service, family owned and it shows, quick delivery and great price....what more could u ask for?  Thanks Anna!"}
{"text":"The food here taste like shit. Plain as day a frozen death revived and then spit into a styrofoam casket. It is the classic Vegas pit that includes pizza wings subs and Greek food. First the wings come out of you like the devil grabbed a surfboard made of sandpaper and decide to hang ten your anus for the weekend. They pass out flyers using bums and drug addicts to unassuming tourists who are unfortunate enough to find their flyer either under their hotel room door or window. So the trick is to hit and run on tourists with cheap Nasty \"food\" delivered to your door with a jacked up price. Avoid this place if you want to live. I just hope they change the name to something not Greek and take Greek food off their menu it's embarrassing to Greek food lovers everywhere."}
{"text":"Got a bunch of flyers dropped off at my work so my co woker and I thought we'd give it a try. I ordered a lamb gyro, which the lady said, \"You mean jy-ro?\" I said no, GYRO. And she said \"No its J-Y-R-O. JY-RO.\" Alrightyyyy then. I'll let it slide. My coworker got some jalapeno poppers and spaghetti. Took the lady over an hour to deliever. We thought the food wasn't THAT bad but not great. A couple hours later, we were feeling dizzy, nauseous, and overwhelmed. This food made us sick. DO NOT EAT THIS FOOD!"}
{"text":"Good food great people and service. Good stop for lunch with cozy atmosphere. Cheesecake is good and lunch specials are decent"}
{"text":"Thumbs down for this place these guys are unprofessional. I saw it had to much negative reviews, but I still give it a shot. Wow the reviews speaks for themselves. I found a hair on my Phillie cheese sandwich which it was very disturbing and nasty. With all these negative reviews they have I'm surprised they are still in business."}
{"text":"This is the worst pizza place ever. They were rude when we called to complain and didn't want to make anything better. Chuck e cheese and frozen pizzas are better than their tasteless awful cardboard pizzas."}
{"text":"Stromboli extremely undercooked, hardly NO pepperoni inside. Gyro, was horrible. Almost no meat, Tzatziki sauce was, whatever!!!! Nothing remotely close! My first, and DEFINITELY last time. Please don't waste your money!"}
{"text":"We ordered for takeout and it took forever during non-peak hours and they screwed up our order. My boyfriend ordered the Philly Cheesesteak pizza but they gave him the sub, because it took so long, we didn't bother complaining. We also ordered a pepperoni mushroom and olive pizza. The sub was good but the pizza quality was just a step above frozen pizza quality. The mushrooms were canned not fresh and the crust was kind of greasy. We picked it because of it being close to the Rio and the other Yelp reviews, but we'd have been better off ordering from Pizza Hut or Domino's."}
{"text":"I ordered take out and they deliver on the Las Vegas Strip. My main complaint the lamb gyro that I paid $9 for had little pieces of lamb not like the meat stuffed gyro you are accustomed to at your neighborhood greek restaurant. The best thing was the greek salad."}
{"text":"I just placed our order for the Authentic Gyro and the Philly Cheese Steak.  We also ordered yesterday.  The Philly Cheese Steak and the Lamb Shish Kebab.  Yum-O!

I always order from here every time in Las Vegas.  It's very authentic and very tasty.  My fiance' was a little skeptical about ordering the Philly Cheese Steak from here but i ensured him of how good it will be.  He loved it and will be having it again tonight.

Ordering via phone was simplistic.  Thank you Anna.  Delivery was very prompt as well.  :)

If you love Greek food, ordering from here will not disappoint you.  :)"}
{"text":"I order from Apollo's every time I come to Vegas and I've never been disappointed... Until now. The pizza tasted like something you would by from the frozen section in a discount grocery store, the wings were over cooked/dry and didn't come with any sauce, and they didn't honor the Yelp coupon for a free 2 liter Coke with $30 purchase. Instead they sent a can of Pepsi... I asked about the discrepancy when the guy delivered the order and he said that's an eat24/Yelp offer and it doesn't match any promotions they have. Never mind the fact that I used the same promotion last time I was in Vegas and I did get a free 2 liter of soda... 

To make matters worse, the delivery window was 45-60 minutes, and the order took almost 2 hours.  Everyone was asleep when the food arrived. I didn't even bother waking them because the food wasn't worth waking them up for. 

Wondering if the restaurant is under new management or something, because I've been ordering from them for years and this time they really dropped the ball"}
{"text":"I used to LOOOVE this place i ordered from here all of the time, I recommended it to everyone i knew, then one day I ordered a Stromboli, i got it an the dough was still raw, the cheese was still in shredded form and still cold, I call that night to complain and they were closed, I call the following morning a lady told me that they didnt  do anything wrong and told me she would call me back, she did not take down my name or my phone number, I called her 6 hours later since she never called me back, i again explained the situation to her, she told me i was wrong an that there is never anything wrong with there Stromboli, so in essence is calling me a liar. I told her i would like my money back, she said that  \"she cant do that\"  she said she could give a a 14\" free pizza.  Which is NOT what i paid for a 16\" Stromboli  + the delivery fee. I said fine, she proceeded to ask me what i wanted on the pizza and take my address, then, I said \" I dont understand why I just cant get my money back?\" She then  yelled and said that she is not going to to send me anything and that she is not goign to give me my money back, and hung up on me.  I called back, it wrang twice and she picked up the phone and hung up on me again with out saying a word, I called a 3rd time and she put the Pizza delivery driver on the phone. He said shes on the phone, I could hear her yelling in the background in whatever language she speaks, So i said no shes not I can hear her yelling in the back, So he says \"sorry she doesn really speak English and she messes up orders all the time and she just gets mad\" WTF kind of place is this lol. Any who I told the guys what happened and he said \"Shes telling me to hang up now\" Poor guy. Long story short I WILL NEVER ORDER FROM THIS PLACE EVER AGAIN, I HAVE BEEN A LOYAL CUSTOMER FOR 2 YEARS and they cant even give me $16  for the food THEY MESSED UP  horrible customer service, horrible way of running a business. If your customers tell you, you did something wrong you FIX IT not yell at them hang up and call them a Liar."}
{"text":"Mom and Pop Vegas style. Was staying at Budget Suites, had food from another place night before, wasn't impressed. I'm not a hater so wont mention name. Took standard 40m like most Vegas delivery I've dealt with. Minimal delivery charge ($1.00), and driver was clean and courteous. Had exact change, imagine that !!  THE FOOD.....was awesome. My pie was hot and fresh with no bubbles, ordered the house special and it was loaded with toppings. My Girl got extra HOT, extra crispy wings with BC on the side. She was VERY happy....so I was HAPPY. Soda was cold too for those who care.
Moved to Circus Circus two nights later, same order, same quality. Talked to owner on phone (she takes most orders) and she said they deliver to most of the Strip. Definitely ordering again when staying in range."}
{"text":"Wow awful food and service! If I could give this place zero stars I would! First off It took me about 15 minutes to place my order over the phone as the worker taking my order kept repeating everything back incorrectly. Then, our delivery took double the time we were quoted (keep in mind this was about 9:30 pm on a Monday night... Not exactly prime time for a place like this). As if all of this wasn't disappointing enough, awful doesn't even begin to cover the quality of the food.

Veggie pizza add pepperoni: I'm pretty sure this was a frozen pizza, the crust tasted like cardboard, the veggies were 100% canned and our pepperoni add on was about 4 pieces over the entire pizza. One of the worst pizzas I've ever had in Las Vegas. 

Garlic Bread: if possible this had even more of a cardboard consistency then the sad excuse for pizza. Based upon the taste, there wasn't garlic, nor cheese on this \"garlic bread\". On top of the garlic bread being inedible, they forgot the marinara sauce we requested. Threw it out after one bite. 

Jalapeño poppers: tasted like they were made 4 days ago, didn't come with any sort of dipping sauce either. Beyond disappointing 

Mozzarella Sticks: since the delivery took so long they were cold and hard by the time we received them. Not only did they not come with any dipping sauce, but again they forgot the extra marinara sauce I requested. Also were thrown out after one bite. 

Potato soup: ice cold and definitely canned 

Called back to let them know they forgot all of our marinara sauce and that our food was inedible and we were offered nothing, not even an apology.  Not only was the food worse than poor but the service was despicable.  

Overall, this place is a disgrace. Huge waste of time and money. We ended up throwing everything out and ordering from Daddy's Delights. I would NEVER order anything from here EVER again. Disgusting."}
{"text":"I saw this flyer as I dragged myself into my hotel room after a long road trip and a starving family. $20 for a 2 topping large 12 wings and a 2 litter of Coke? what a deal! Then it came and my exuberance from finding a great deal turned into self-pity for getting tricked. 1. The dough/crust tasted sour doughy/rotten.. 2. they used CANNED mushrooms. 3. The cheese didnt stretch nor taste/look like real cheese! The places has all kinds of ewww going on so stay away. Like I said, I found it under my hotel room door. I think they prey on folks from out of town (one time  customers) without internet access to check the reviews. No way  this place has repeat customers."}
{"text":"I didn't know nail was a topping... Wings were all right though. I should have known this place was gonna suck when I saw the flyer on my hotel door...and the guy said it was gonna take about 45minutes to deliver like 4 blocks away..."}
{"text":"Mediocre- pretty sure it's a drug front because they've never had any other business when I've been by. Interior looks like someone's cluttered living room, complete with snacks and stuffed animals. 

12 piece wing, as someone else mentioned, comes with less than 12 wings- I counted 11 and one was the size of my thumb. Ranch it comes with tasted off, possibly spoiled or just a really bad discount mix.
Mozzarella sticks were mostly breading, which is sad when they're $1/stick and falling apart. The marinara dipping sauce was the tastiest part of the meal.
I knew I shouldn't have asked about their soups but the $2.50/cup of potato soup tasted like it was fresh out of the can, devoid of any seasoning whatsoever.

Service was polite but that's not enough to bring me back here. $17 is an absurd price for what was received."}
{"text":"I stopped by to get a drink because I was super thirsty, but I couldn't resist reading the menu and ordering their $6.99 lunch special that includes a drink of your choice! They also have different family specials starting from $15.99 and up. They deliver, you can order and pick up later or dine in as well. Their menu has a variety of different selections. From soups, to salads. Sandwiches and burgers. Don't forget to pick up dessert! They have cheesecake and tiramisu. For those Greek food lovers they have spanakopita ( spinach pie ) 
Lamb kebab, and Greek spaghetti. I love their mozzarella sticks and Greek fries. Also add up up to 4 toppings to your pizza, add some stromboli and the philly pasta. Have fun ordering !"}
{"text":"Ordered delivery on a Thursday night and it took about an hour - right as scheduled. Started off with a $5 order of Mozarella sticks which were quite good, despite probably being frozen originally. Main course was Greek Spaghetti, which said was served with a meat sauce and feta cheese. Now, basically I can't really imagine that is true Greek style pasta. It was basically spaghetti with a thin layer of meat sauce topped with a thin layer of cheese and then the feta came on the side. I ended up adding the feta to my salad (included) and putting a few cubes on my garlic bread that was also included. Most versions of Greek spaghetti incude olive oil and butter and feta. On well, there was a delivery fee and they have a large menu, but heartburn is just dying down now. It was a big portion though."}
{"text":"Ordered two lamb gyros, one came with coleslaw the other with fries for delivery. Delivery came in about the time they said it would. Can't really say anything about the coleslaw, because it wasn't for me, but the fries and gyros were underwhelming at best. The pita could have been warmed or baked a little bit, seemed like it was just taken out of a package. Lamb was very thickly cut and very tough, but the tzatziki sauce was pretty good. Fries were thick steak fry style, pretty mushy and not very crisp, maybe that's how they make them, but they weren't very good. Overall not impressed, they should stick with either Italian or Greek, but not both. I definitely wouldn't order a Gyro from them again, up in the air if I'd try anything else either."}
{"text":"I've only ever ordered lunch from here, so I can't review the interior of the restaurant. They offer a $7 lunch special that includes about 5-10 options that all include a soda; chicken fingers/wings and fries, foot-long philly cheese steak (or one made with chicken!), giant greek or caesar salad w/or w/out chicken, small pizza, etc. 

I've ordered the philly and the greek salad lunch specials, and I've split one of their special pizzas that comes with shrimp. The philly is better than the average cheap pizza place, with lots of gooey cheese and veggies and meat all crammed into the bread. It's on a soft white bread that makes it ideal for ripping off a handful of deliciousness to gnaw on while attending to other tasks. The greek salad was HUGE, enough for 2 filling meals for me and was loaded with goodies; cucumbers, pepperonicinis, tomato, PITTED kalamata olives- nice because so many places use the ones with pits, chunks of feta, red onion slivers and lots of chicken. The specialty pizza was also delicious- it had a white sauce with spinach and a blend of cheese melded with well-handled shrimp. The shrimp actually tasted like real shrimp and weren't over or undercooked, so that was hugely impressive from a place that's mainly billed for pizza. The crust wasn't particularly memorable, but it wasn't bad (because bad would be memorable, right?). 

The delivery was expedient, probably only about a half hour or so of wait time for a shop just off Spring Mountain and the strip. I'll be ordering from here again and will update when I've tried more items!"}
{"text":"Ordered their family special which included 12 wings, when we received the wings there was only 10. I immediately called them any the discrepancy. I was told it's either 10-12 depending on how big the wings are. False advertising. He told me when I call back that he will guarantee I receive 12 wings. You can best believe I won't be calling them back"}
{"text":"So far not impressed. Ordered food and was quoted a 45 minute wait time. It's been 1 hour and 15 minutes and my food still isn't here!! If the foods amazing maybe it will make up for it. We will see!"}
{"text":"Cold cardboard pizza. After an hour, I called to check on the status of my order.  The women on the phone asked of I ordered online. When I said yes, she said \"Your driver left awhile ago\" and hung up on me. The driver got to my hotel, didn't call, and just honked his horn until I came down to check. 

There was almost no sauce on my pizza. The cheese was gross and the whole thing was cold. It tasted like something that hadnt been cooked recently and had been left out all day. Suddenly glad I didn't order it with shrimp."}
{"text":"I should've known the food was going to suck when I had that flyer slipped under my hotel door. I ordered the shrimp fettuccine Alfredo, steak fries, lamb gyro, white pizza, chicken Alfredo, and broccoli cheese soup. Everything was tasteless. Absolutely everything. I was blinded by hunger and I now know I should have looked up reviews on this place. I honestly felt like I just wasted $60 :/"}
{"text":"It's simple an clean the food is  not bad.i would recommend for someone. .for driver I recommend to ask for Rudy he's real nice."}
{"text":"I work nearby this place(valley view & spring mtn) so I decided to stop by and get myself a pizza. It was awful, took them 30 minutes, pizza was watery and greasy. After the second byte I threw it away. I will never go there again !"}
{"text":"Ordered as a last resort because my son was sick and I didn't have anything for dinner. Ordered pizza, wings and zucchini sticks. Everything was great! The wings were warm and crispy. The zucchini wasn't soggy at all. The pizza was great, too! Delivery took a while but it was worth it."}
{"text":"After an hour of waiting and calling to check up on it it the pizza finally arrived cold and stiff. Wouldn't be surprised if the pizza was frozen and pre packaged."}
{"text":"Ordered a burger and diet pepsi from here. First time I've ordered, and the last.. one hour and fifteen minutes later my sort of warm burger arrived as I am calling to cancel the order. I took the food and payed the man who stated they just had to fire a driver. As stated, the burger was warm at best and not very good.  With delivery time and the food quality, I would not order from here again."}
{"text":"Twice...I repeat TWICE we ordered from this place and that's it. The first time we called and ordered pizza and a 2 liter of Diet Coke. When it arrived they had the generic Diet Rite!!! Wtf!!!! What kind of cheap place substitutes out the 2 liter of soda when they charge $3/bottle!!! 
The next visit we specifically ask what brands of soda they had and they said Pepsi. So we ordered a 2 liter of Pepsi.  Super simple request that I've never had a problem with anywhere else. When the pizza comes they bring us some Pepsi X DRAGONFRUIT FLAVORED PEPSI!!!!! WHAT THE HELL?!??! All I want is Pepsi. Regular freaking normal simple everyday PEPSI!!!!
Anyways...
The pizza is mediocre at best. Not worthy of a review on its own. The wings are probably the only part of the order that deserve any recognition (that recognition is a1-star). Never again will I order from here. It's get my stamp!

DO             NOT              EAT             AT                 APOLLO'S!!!!!!!!!!!"}
{"text":"This place is very unprofessional. I do NOT recommend this place to anyone. They came into to my work and dropped off flyers to give out to customers so a few of my  co-workers and I bought a pepperoni and bacon pizza, 1 L of soda and 12 wings. It took them an hour to 45 minutes to deliver it to us and when we got it they gave us a buffalo and Jalapeño pizza with 12 chicken fingers so we called them back and they said \"that is our fault keep that order and we will bring you yours with no charge\". After another hour wait another delivery driver came with only the pizza and demanding the other pizza back even after they said to keep it, he said we were lying and called his boss. After 5 minutes of talking to her he started yelling on the phone to her and calling her a bitch in front of our customers. So after all that we just gave him the pizza (we ate 2 slices and he still said he needed it back). After another 2 hours another guy came back with the pizza that we didn't want saying that we had to pay for it and pay for another set of wings. After arguing with us for a good 10 minutes, in fount of our customers again, we asked him to step out. Needless to say their communication is very poor and I will never eat there again."}
{"text":"Our office ordered lunch for the first time today for this place. It was awful! The pizza tastes like cardboard it was disgusting... One person said \"it has that dirty feet taste\" lol. We will be tossing the menus in the trash."}
{"text":"I can say enough about this place. I first learned about Apollos from a flyer I received at my office, and it has become a regular rotation in the week for my whole crew to eat from Apollos. Between the 4 of us we have ordered just about everything on the menu, and have yet to have anything but delicious, fresh food... including the pizza. The best part is they really have a large variety of food... you get your normal pizzeria menu with all the things that you usually expect, but they also have Greek food, all of which is phenomenal. And let me just state, probably one of the best Stromboli's I've ever had. And to top it off, it's run by a very awesome family. The service is great, the food is great. A true rare gem to find in Vegas.

01/10/2014

I've had my final straw with Apollo's. This place used to be soooooo awesome, as mentioned in my previous review, but since ownership has changed hands, there's been a rapid decline in customer service as well as quality of food. The woman that answers the phone and runs the front counter is argumentative and rude (& is the owners wife, as I found out today), and today marks the 5th time in a row that they have screwed up my food. I am done. It really is sad because the original owners of this place knew what good food was and how to take care of their customers."}
{"text":"Horrible, when the best part of your meal is the soda, that's telling you all you need to know. Too bad zero stars isn't an option."}
{"text":"My office ordered from here today for the first time. I must say we all were pleasantly surprised. We ordered a Philly cheese steak, Gyro, and Chicken sub. the food came with drinks and the sandwiches with fries. Our food was hot, delicious and only 24 bucks for the 3 of us. My Philly steak was WAY better than POPS Philly's on Decatur. 
I know We will be ordering from here again. 
**Only down fall the delivery took about an hour. Hopefully it will be faster next time!"}
{"text":"Needed a pizza place that delivered on the strip. This place was so nice and inexpensive. The guy who took my order was so friendly and the delivery guy came right to my door. Really appreciated it."}
{"text":"this place is great!! there is young lady name anna who is a sweet heart along with her mother they are both sweet heart n as for customer services well that is top notch! i been going there ever since it opened an i must say they have great food my fiance and i love there food i always get the philly cheese steak with jalapenos and it's great cheesie
and tastie my fiance gets the
double cheeseburger with bacon omg! it's
more then just good! also there pizza delicious!!!! lots of choices
with different meats all meat lover or philly cheeese steak pizza if your in ther area i so recommend this place to anyone who knows what good food tastes like!!"}
{"text":"Sooooooo, my coworkers had this pizza delivered, and I got to try it, and somehow was kinda impressed. So I took it upon me to go pick up the pizza, because there's nothing I hate more than cold foods (that are supposed to be eaten warm or hot). 

I ordered for pick up and WOW I did not expect this place to be like what it was. It was kinda like the owners kids and kids friends were hanging out on the tables after school. I got it picked up, and boy, the address on Yelp is incorrect so I got lead to some other place, wrong pizza shop, and then had to make a couple phone calls to track this place down. 

The second time j got the pizza I was kinda ready to move on...was just average for me. No more Apollo pizza for this gal."}
{"text":"Why can't we give negative stars? This place would earn the most if we could trust me. They shorted us on our order and when we called to let them know, they got all rude and even tried charging us for food we had already paid for and hadn't received. Your money is better spent buying microwaveable pizza, that way you aren't disappointed, it's inexpensive, and no one will be rude to you!"}
{"text":"Anna is the daughter/hostess/server for this family owned restaurant. Very sweet and great service. 

We had the gyro and veggie pizza. Both REALLY good. And great fries. 
This place is definitely worth visiting!"}
{"text":"I ordered the Italian sub. It was amazing. Fries were delicious and I received everything  I ordered. I only gave four stars due to the fact the delivery person was a little unfriendly.  I will definitely order from here again. I just hope the delivery person has a little more personality."}
{"text":"Ok . So another  Pizza joint down.. The case of the good the ugly. 

Order Gyro, Philly pizza, choc mouse cake for dessert 

1. One of the better Gyro's I have had. flavor etc, could of used more sauce but thats to personal taste. 

2. - Verry Verry disappointed. The dough was under cooked or partially cooked there where pockets of air where it was raw inside.These are defiantly canned mushrooms I use to own a pizza joint and can tell difference. Well these where just really bad along with the dough. The dough felt like cardboard esk maybe due to rawness see pics soon.The cheese was descent. It was a shame cause I actually like the pizza sauce, it had flavor and texture. The philly meat was light on portion size also I am not shure , they could use a mix of grated cheddar and mozzarella  to make this better. Also do not use those mushrooms. Yes I know button nose mushrooms are expensive but trust me customers can tell product wise know. espic. if we work in trade. 

3. Choc Mouse dessert -- one of the better ones I have had not frozen witch has happened or flavorless. 

It seems that they are trying to be to much either a Greek food place serving classic Greek flare or Italian food restaurant serving such.  

I also ordered on the website for a coke product and got a pepsi one main reason I wanted to order and try seems pepsi is buying out the pizza restaurants lol. 

overall good greek food and dessert pizza's could use alot of work."}
