{"text":"I was in the area and looking for a spot to grab breakfast before heading to work. Vesta was not an option for me (needless to say). I was apprehensive at first to go in but did so anyways. As soon as I walked in, I was greeted with a smile. I sat down at the counter and ordered a feta omelette ($7.95). You can see the cook making your breakfast near the front window. I was pleased to know that my omelette was made with real eggs and not an egg mixture (like a lot of diners do). Quicker than I could read a short article in the paper, my breakfast was ready. My potatoes were nice and slightly crispy and my eggs perfectly cooked. Also, they did not skimp on the feta!  Apollo 11 is what you would expect of an old school greek diner: good and honest food."}
{"text":"LOVEd this place it was really good food and the service was excellent.  really felt it relaxing"}
{"text":"looking for a greasy spoon? Well this is the greasiest ( in the best way possible).  Before I get into the food, The decor of this place is 100% amazing. If you're reading the name then yes it's exactly that- old photos of the Apollo 11 landing. As a space lover that little touch alone makes me want to come back.  If you were to picture a greasy breakfast spot then this is exactly it. I got my ol' faithful- A BLT. Prices here are so cheap. and I mean CHEAP. under 5$ for a sammy and salad? Sign me up!  One word of advice if you're really hungry though- Add on the fries because that salad just ain't cutting it for me. I actually ordered a second sammy to share.   See you there during my next hangover breakfast."}
{"text":"SO happy to have found this place! I stumbled across Apollo 11 while I was out for a Saturday afternoon stroll and popped in for a quick bite. It's your classic Greek diner, and it's fantastic! The prices are great, the food is just what you want from a diner, and the owners (I think that they were the owners) are the sweetest people ever. They were so sweet and kind that I would go back just purely to see them again! This place in a little Toronto gem!"}
{"text":"Was at a meeting down the street so we popped in for lunch . As you've read it's a mom & pop greasy spoon diner  Very old school,  love the vibe . Food was alright I had the fish  and chips and buddy had souvlaki dinner . Prices are alright I know mom & pop need to survive so it is what it is . Food is prob better for breakfast but everything else is decent aswell . If u want old school diner feel then check then out ."}
{"text":"Found this place googling \"Annex Poutine\" but there was no poutine on the menu. No biggie. I ordered a bacon and tomato sandwich and onion rings (dreaming of the amazing onion rings at the late lamented People's). About two minutes later, \"what did you order again?\" Come on, it wasn't that busy. The onion rings came straight from the freezer, disappointing, but not a big surprise (although I do wish People's was still around, sigh). My sandwich wasn't very bacony, though. So unbacony that I disassembled it, and discovered... no bacon at all! That is a disappointment I just can't forgive. So sorry to rain on the parade of people who love this place, but I have to rate it a big meh. The couple who run it were as cute as promised though."}
{"text":"What a great find! Thanks to Yelp, my search for a breakfast place in the area led me here. It is a solid four star place, yet it brought me five star happiness.  Here are the particulars....  1. They have a good old-fashioned breakfast . Apollo 11 hits the sweet spot between fast food breakfast and high priced crepes and eggs Benedict breakfast. For 10$, you can get a great, classic, filling meal here. 2. I had French toast and bacon on my most  recent visit. It was standard white bread French toast and bacon, yet it was delicious. 3. The coffee is great. 4. The ladies that run this place are super friendly. 5. The restaurant is neat and orderly. While it is definitely not the Starbucks, it has a relaxed feel. Whether you are meeting an important client for breakfast, meeting friends, trying to feed hungry kids, or just by yourself, this place accommodates all comers well. 6. They have counter service, as well as table service. You can also order coffee and food to go. 7. The Bathurst bus stops right at the door. The Dupont bus stops on the corner a few steps away.  In conclusion, this is a great spot for breakfast. It exudes the feel of a place that is (or should be) a \"regular\" place. The food is good, and you won't break the bank having a good meal."}
{"text":"Classic diner food. The couple that run the place are very cute. I've only come in for breakfast, but it is done well. Service is speedy. Overall, a decent spot, but I think it is a bummer that you cannot order pancakes as a side - but that's just me."}
{"text":"Great hearty well priced breakfast, watch it cooked right  in front of you, coffee good too, been here a  long time which is due to the good old diner style cooking"}
{"text":"I came to this place today for breakfast, and I am really happy that I did! First, when you walk in, the place is considerably clean.   The women who run this place are amazing, and kinda reminded me of my own mom (I'm Greek so the sense of familiarity was definately there) And the best part was the breakfast! I got eggs with bacon and sausage and my friend got French toast! The breakfast was tasty, and not too greasy! It was just perfect!  This place, for me, is a gem in the area. I definately will become a regular, and suggest the same for you!"}
{"text":"24 Hour Greek Mom & Pop Restaurant that's Better than Vesta.  I first tried Apollo 11 in April and was underwhelmed by their Montreal Smoke Meat deluxe sandwich on rye.  They seem to specialize in this, especially since it's highlighted on their storefront sign.  The smoke meat doesn't come close to what can be had in Montreal.  I returned today for lunch to give them another try.  Last time a lady was running the show.  This time it was a gentleman named Paul.  Apollo is also a 24h eatery establishment, just like Vesta, which is located across the street on the NE corner of Bathurst & Dupont.  I'm not sure what the association this place has with the NASA Apollo 11 space mission, but they have several pictures up on their walls taken by astronauts during the spacecraft's journey to the moon and back.  For today's lunch, I ordered the Chicken Shish Kabob ($10.50), which was very filling.  It came with bread (buttered with a side of yogurt sauce), a salad, and fries (I requested gravy to be added, sadly they don't have poutine here).  It was decent.    The place has redeemed itself to me.  When I now crave Greek food in the Bathurst area, I'll return to Apollo 11 instead of Vesta, just a personal preference.  Apollo is quieter and cleaner with better tasting food in my opinion."}
{"text":"Obviously I came here for the name. Why else? Because I love diners.  It has a great family diner vibe. Food was fast and good. Service was friendly.  I wish they took the theme a little further, but we can't get everything we want in life."}
{"text":"Not the quickest service here, but the food is made from scratch and delicious. French toast was awesome as was the bacon. The Greek couple that owns the joint were just a pleasure to speak with and could not have been more hospitable. If you enjoy the nice little mom and pop joint and want to support it then I would highly recommend Apollo 11."}
{"text":"Mom's in the back frying up the bacon, Pop's in the front topping up your coffee, and small photos of the moon landing hang on the mostly bare white walls. Yep. This place is what you're looking for for breakfast.   I had a mushroom and (deliciously processed) cheese omelette with bacon and sausage. It was exactly what you'd expect from a diner. It ended up being a touch pricier than expected, but that could be on me, extra meat and all that.   Places like this truly are giant leaps for mankind, and I will be back."}
{"text":"This is my new breakfast place. For a greasy spoon with a $5.99 breakfast special, I was taken back by their gourmet taste and feel. The service was amazing and warm, the food was filling and satisfying, but what first caught my attention was the coffee.   All and all, great experience and would love to see more people enjoy this place."}
