{"text":"Well, we decided to go back and give it another try.  We went during the day not wanting to temp our luck.  We just get dessert and the cake and ice cream was really really good. The service was really nice too.  Must try the lemon cake..."}
{"text":"The apple dumplings food is excellent but whats the point of ordering food if you dont get it for an hour? I came inside at around 12, with around 4 other people inside and ordered two burgers and after 50 minutes of waiting I asked how long it would take and they said ten minutes. Ten minutes is how long it takes to make a hamburger. Either they need to get more cooks or just go next door and eat hong kong kitchen within a hundredth of the time it takes apple dumplings. The slow wait completely ruins the restaurant."}
{"text":"Great Food, Atmosphere, Staff, Chef...Friendly...... food made with real apple slices sauce, ..... homemade fudge. Ice cream... all just home cook.. Worth the drive."}
{"text":"The food is good, but the selection is limited.  Try the apple/ham sandwich - shockingly good.   Although the food is very tasty , the price is very high for what you get."}
{"text":"We have been here many times, and so far it has been consistent.    We enjoyed the tuna melt, hamburger and homemade tomato soup.  All were very good.  The waitress was very attentive and the service was prompt.  That has historically not been the case however.  Service sometimes can be a hit and miss.  We will contiue to frequent this cafe."}
{"text":"Delicious food would definitely come again just for the food but very slow service.  When my Husband and I sat down we waited 10-15 minutes to even get a menu and once we were ready to order took forever for someone to come over to. Other then that was great."}
{"text":"My husband and I each ordered a different sandwich and then we swapped halves so we could try both types. We had the Chicken Avocado Sandwich and the Rotisserie Chicken Sandwich. Both were amazing!  The first had a sweet taste due to cinnamon apples on it. The second was savory. We highly recommend both. We will be back for both!"}
{"text":"I thought this place was awful. I was very disappointed. It was hot in there, smelled like fried food. The breakfast we had was awful. The plates were plastic and decor seemed very old. Considering they had just moved I was not sure why they did not update this place.  I think the place is good for those that are accepting of canned and processed food. I am not. Corn Beef has came from a can, potatoes had no flavor.  They were friendly but this did not take away the fact that I could have opened a can of hash and made my own toast at home.  When I got home I had to change my clothes as they smelt of fried food. Any place calling themselves the Apple Dumpling cafe should have homemade apple dumplings. We were told that they ordered them because their kitchen was to small. Hmmm  Disappointed would not go back. Good luck to anyone that does"}
{"text":"The food is usually very good however the service is terrible. You need to plan at least an hour for any meal."}
{"text":"The food is unique and very good. The decor in the new restaurant at Chandler Heights an Higley is Spartan. I have been to the new one 3 times.  The food screams comfort but the ambiance just screams. Too bright, uncomfortable and worst of all, there are always dirty tables. They have young kids waiting tables, but they aren't trained well. They bring your food one plate at a time, no silverware. When we finished both of the last two times they brought a dessert menu, came back and we declined dessert, then they went away and came back with the check, we paid and they collected the money - all the while never clearing our plates!  My suggestion - train the waitstaff and clean up the dining room and make it more homey. And for goodness sake get rid of that horrible cart just inside the door - and that weird cluttered 1/2 booth by the door."}
{"text":"I thought this was a nice restaurant!  The food was very good and was a great value!  Our server was very nice and helpful!  They also make there on fudge!  Although it was 10 in the morning I had to finish my breakfast with some ice cream!  We will be back even though we live 30 minutes away."}
{"text":"Are breakfast here this morning and I was let down. I am all about eating at mom and pop joints and 9 times out of 10 it is amazing, unfortunately not the case here. I was excited to see they had corned beef hash on the menu as it is one of my favorites.  I will say that my eggs and potatoes were great however when I saw the hash I was disappointed to see it was a canned pile of slop that resembled canned dog food.  Now if I had paid 4 bucks, I could understand but for 10.00 dollars not cool. Needless to say I didn't eat it and left it on the plate. The owner was friendly but our waitress was not up to par. I never received a refill and she never even came back after the food was delivered. If you're going to brag about all the \"homemade\" items you serve then it is an absolute travesty to serve canned corned beef hash! Needless to say, it stayed on the plate and wasn't touched. I will say that my friends were pleased with their chicken fried steaks and omelettes, and portions were generous, however not impressed by the service (or lack of) I guess I just made the wrong choice."}
{"text":"This review was for a take out order last Sunday. Called for a take out order and they said it would take 30 minutes - a little long of a wait but we were ok with that. Came in about 25 minutes hoping the order might ready early but ended up not getting the takeout order ready about another 30 minutes later -  and to top it off they got the order wrong. I called to let them know, I was given the cook to talk to who said he apologized and took my number and said he'll make it right next time....  So I'm not sure if the cook is in-charge of the restaurant, granted he was the one that likely made the mistake...  But they should have double-checked the order... Anyways, 1 HOUR WAIT on a take out and then GOT THE ORDER WRONG.. INEXCUSABLE at any level..   BTW - not even an offer of water while we were waiting...."}
{"text":"1st time here.  Food was ok, ate breakfast around noon and the potatoes were not fresh.  Son had the biscuits and gravy and said those were really good.  Kids pizza is a Red Baron pizza, was thinking this would be more home made."}
{"text":"This place is sensational. The food is amazing and the service is fantastic. I had this apple vinaigrette that reminded me of the apple orchards my parents would take me to as a kid back in Michigan. I highly recommend."}
{"text":"Walked in today with a friend and they were crowded. We couldn't stay anyway. Wanted to order something to go. We ordered toast. She said its going to be a wait for it. And I said for what the toast? And she said yes. About 20-25minutes. I was shocked and thought it was a joke cuz only needed to put it in the toaster and hand me some butter and jam. They said we have other people waiting. I said for toast? U could actually tell a customer to wait 25 minutes for toast? I then realized in this place, the staff sucks. U will be out of business with staff who have no idea how to work in the food industry. You just lost my business and my friends with that idiotic response. And I used to frequent the place often."}
{"text":"Move over Paradise and Kneaders. This is hands down the best sandwich place evah. I've been half a dozen times and each time I leave in a happy food coma. (Went for dessert once, lunch every other time.) I've also done carry out a couple times.   The waitresses are always friendly and chatty. The atmosphere fun with a trendy-cozy feel. And, um, the sandwiches? To die for."}
{"text":"My family doesn't really eat out for breakfast a lot, but this restaurant is defiantly a go to. I went here with my friend and his family and the server was super sweet and loved saying funny stuff that made us laugh. I had an omelet and bacon. The omelet was delicious and the sausage, cheese and eggs inside were perfectly cooked and spread evenly through out it instead of other omelets were the sausage is in one corner and the cheese is in the other. I want to go there again!"}
{"text":"LOVE this place! So convenient that you can call in your order and it is ready for you when you walk in. Great little family restaurant. Nothing to fancy but always wonderful food. The charlie sandwich is all Ive ever gotten and I couldn't ever try anything else because of how good it is. Highly recommend this place!!"}
{"text":"Had breakfast this morning at Apple Dumpling and found a hair in my biscuits and gravy.  I pulled it out but then could not eat because it made me sick, so I put it back.   Mentioned it to the server and the cook came out and told me that I put the hair in the food.  I explained to him what I had done, but he continued to blame me for the hair.  With the added burnt pancakes, cold eggs and a late kids meal, we will never visit this place again.  Bad service and bad food....it's a shame that yelp does not allow no stars...."}
{"text":"Went to breakfast - nothing special - ordered waffle with strawberries and ice cream, a side of sausage and an apple fritter.  Waitress forgot the ice cream, the side of sausage and the apple fritter!  It's not as if the place was busy - just a few tables occupied.  Owner did apologize, however, but it's \"one and done\" for us at ADC.  Too many other, better places to go to spend our money."}
{"text":"I love the Apple Dumpling Cafe. The food is wonderful and the staff is warm and friendly. I recently had an issue with an item that I ordered that was not to my satisfaction. I spoke with the owner regarding the issue. He listened to my complaint, corrected the problem and really made me feel like he cared about his customers. Overall the Apple Dumpling Cafe gets my stamp of approval and recommend you go and check it out!"}
{"text":"This is a family own restaurant that I come over for breakfast sometimes. The food is getting much better but some of the waitress since so sad to be working , besides Donna who has served us with a huge smile and amazing attitude . Thank you for the service Donna"}
{"text":"This small out of the way cafe suffers from many problems, not the least of which is an indenity crisis. It doesn't know whether it is an office, (the manager's desk is in the dining area.) a cafe, an ice cream parlor or a kitschy antique store.  The store had no real antiques, just the sort of craft work one generally finds at the swap mart.  The menu is that of a brunchery with french toast, omlettes, egg dishes and baked goods. Sounded good. Unfortunately the execusion is where this cafe fell flat.  The sausage and cheese omlette was obviously microwaved instead of being prepared in a pan on a stove, topped with a single slice of American processed pretend cheese. The french toast tasted very much like it was taken from the freezer and popped in a toaster.   Bacon and sausage were of the lowest order, the bacon being so thin you could have read the paper through it and possesing no actual flavor at all.  The promised \"homemade\" biscuits were such a disappointment that they went unfinished. I have had better biscuits at McDoanlds. Honestly, and McDonalds makes dreadful biscuits.  Overall we were extremely disappointed in this little cafe and became even more so when the check arrived. The total price for this disaster was almost the same as if we had gone to a real resturaunt  but without any thing that approches the satisfaction one gets from dining on good food. The waitress/cook/manager very cheerfully gave us discount coupons for our next visit, we left them sitting on the table.  The food was actually so disappointing and we ate so little of it that we  then went someplace else to have our breakfast.  If you're hungry and are thinking about stopping by The Apple Dumpling Cafe for a bite, I recommend McDoanlds, the food will be cheaper and NOT microwaved, and be moderately better tasting.  *******************************************************************************  Well, a few days after posting this review I received a meesage from an owner of Apple Dumpling Cafe and after due consideration I thought I'd add my response to that message here as well. I will use their statements then respond to them, promotional comments have been edited out. Also I should like to point out that the location we visited is now closed and they have a new location in Queen Creek.  ADC: \"We have been in the Restaurant and catering for 25 years. Yes everyone has some off days. At Apple Dumplings, we cook everything up fresh, no cooking items and keeping them warm. Fresh eggs, not powdered or liquid eggs.\"  DBABH: Now between my wife and myself we also have nearly 20 years of restaurant experience, everything from family dining all the way up to 4 star restaurants. We know what good food tastes like, this wasn't it.  ADC: \"Maybe you are not used to baked biscuits instead of warmed microwave ones.\"  DBABH: Being a native of the west I have had my share of delicious, tender and tasty biscuits from campsites to local restaurants and no, the biscuits at the Apple Dumpling Cafe do not qualify. They were of poor quality and neither tender nor tasty.  ADC: \"Our business is growing in Queen Creek. Our Apple Burger has been called one of the best in the country by many.\"  DBABH: I am sure the business is growing and that is a good thing. But the new location is far enough out to discourage this reviewer from giving them a second chance at the apple. Perhaps if I were in Queen Creek one day for another reason I might stop in, but given the low quality of food we received on our first visit I think the odds of that happening are long indeed."}
{"text":"My aunt moved into the dairy farms of the desert and we were visiting her from out of town. The cows are apparently grass and alfalfa fed cows who hang out under fans misting them constantly under a metal roof providing some shade.  Somehow they survive and make AMAZING ice cream, or so we experienced at Apple Dumpling Cafe. I had something that had a base of vanilla ice cream, mixed with some chocolate candy bar and drizzled in chocolate and caramel syrup. To die for, and in a waffle cone none-the-less.  I highly recommend one of these small town diners serving fresh-from-the-cows ice cream."}
{"text":"I was a little skeptical coming in because we were the only people there... and it was prime breakfast time on a Sunday morning. But it was this or McDonalds, so we gave it a shot. And by the time we left the place was getting pretty well packed.   Service was friendly, the food was good. I had the French toast - no whipped cream - and it was fluffy and not overly sweet. Also had a side of bacon that was a tad overdone but I like my bacon crispy anyway so not a big deal to me.   I would like to go back and give lunch a shot as well as the desserts. They have a ton of desserts as well as fudge in the display case and all sorts of ice cream.   I have to agree with my husband though, when we left he said he smelled like a deep fryer. As I sit here and type this, I can definitely smell fryer oil - maybe we eat outside next time?"}
{"text":"\"STAY AWAY\"---SHOULD HAVE GONE TO THE MCDONALDS that is there in the parking lot instead. First time going, will not be back.  My wife and I and our young son stopped in on a Sunday morning.  For being the only restaurant any where close except for McD's for b'fast we decided to give it a try.  At 8:00am no one was there, was not a good sign and we soon discovered why.  I ordered the chicken fried steak and it was pretty good.  The gravy had pieces of sausage in it and was also good.  The eggs were fluffy and light.  But the potatoes were sliced home fires style that appeared to have been re-warmed, possibly from the day before and just barely warm and was tough and chewy.  Not good at all.  The meal did not come with biscuits and gravy as a chicken fried streak should, not even toast was included.  Disappointed.  My wife had an omelet that only came with toast, nothing else.  Disappointed again.  My son ordered pancake on a stick with scrambled eggs.  The pancake on the stick was burnt and should not have been served to a customer.  I showed it to the waitress when she placed it on the table and she did not offer to replace it.  Disappointed for the third time.  After all the disappointments the bill was still nearly $30.00.  The place has so much potential of being a gold mine with the location but as the lack of people that was not there should have warned us to stay away.  WE WILL NOT BE BACK..."}
{"text":"Had whole family of 5 for breakfast.  My son had a hair in his burrito, they simply took it back and remade it.  It came out when the rest of us were all done.  My son lost his appetite and they didn't even offer to take it off the bill.  They have punch cards for a free desert and wouldn't punch it per meal?  We had 6 meals and two deserts and received one punch on the card.  When I asked, they said one punch per visit.  Live in the neighborhood, won't be going back or recommending it to anyone who lives around here...."}
{"text":"We have just moved to the area and also had family in town. We were quite a large group (12 people) and came in on a Sunday morning in addition! This place worked extra hard to make sure they could find seating for all of us. I watched them provide the \"kid tables\" as much service as the adults received. Plus, the food was phenomenal! The decor was great. It was such a nice, pleasant visit. We did not realize how small it was reading the reviews and photos online, yet they still did an amazing job accommodating us spur of the moment! Can't wait to have a reason to go back! Oh -- and order their lunch meat and start saving some money there. They have a meat and cheese menu and I cannot wait to give that a shot as well. Prices they reviewed with me were definitely $3-$4 cheaper than the grocery store."}
{"text":"Dropped in for a quick bite while helping a friend move. It's a seat yourself, cozy place. Promptly greeted at our table by a nice young man and placed our order; Charlie's Rotisserie,  an Ultimate Omelet and the children's Pepperoni Pizza. Food came quickly, hot and SUPER delicious. Impressed with the portion sizes and their yummy fries that are crispy outside and soft on the inside. Staff seems friendly and was helpful. Glad we dropped in and discovered this great little gem! (BONUS, their water is filtered and tastes great!)"}
{"text":"I have been here a few different times and have mixed feelings about it.  There are times I would go and the food would be very good, while other times the food has been questionable.  During my last visit with my family, my son ordered a cheeseburger, as he had done during a past visit.  The burger came out cold and the cheese looks like it was place on top at the last minute.  It was still hard and cold and not melted on to the patty.  My wife had to ask the waitress to take it back to melt the cheese as it should on any normal cheeseburger.  On this visit, all of the food was extremely bland with little to no flavor.   Based on my last visit, I would probably rate a 2, but we have enjoyed the food on previous occasions, thus the 3 rating.  As a consumer I hope for consistency - good or bad.   It makes choosing whether to return or not much easier.  I'll likely use my next visit here as my final determination on whether I continue to frequent the establishment."}
{"text":"came here for lunch last saturday and at first i thought it was called \"the dump\" because thats what it was being referred to. not in a bad way. lol. its a cute place, definitely wasnt crowded at all. in fact we were the only ones in there for a while. service was kinda slow even though we were the only ones in there[there is a sign that even says it is slow because everything is cooked to order] but im talking about like bringing drinks and taking out order, and the waitress has/had a really soft voice at first. their menu is pretty big. i got the mango chicken salad. it wasnt bad but i would have preferred it to not be served on a ton of lettuce that i didnt even eat all of it.   the restaurant is also an ice cream parlor/antiques store. there is a lot of stuff that you can buy. didn't try the ice cream but the waitress brought us a sample of the apple pie fudge which was to die for!! we might have gotten some but it was hot out and we werent going right home. so all in all i would say to check this place out. its kinda off the wall but i dont really have any complaints. there breakfast menu looked good so i would say that this place is prob best for breakfast?!"}
{"text":"I'm giving them only 1 star because the service is horrible...the waitresses look like they hate life or maybe just working there and we had to wait forever for our food.  The food was ok definitely not worth the drive."}
{"text":"I've gone here twice now, once for breakfast and once for lunch. I would probably give this place 3.5 stars, but half stars aren't an option and I don't think they deserve to go as low as 3. First, I am a fan of local businesses and I was very happy to find this place as it is much better than many other local businesses near me. They are very family friendly and at my first visit brought some fruit out for my infant to munch on while we were there. The food was pretty good. I had the turkey club on my first visit and it was huge and delicious. I had the breakfast sandwich the second visit and it was alright. It wasn't the best or the biggest I've ever had, but the eggs and bacon were cooked perfectly. I also had the cinnamon roll and it was huge and very good. It had a little too much frosting, but it was large enough to snack on the rest of the day. I also like that they use good quality meat for their sandwiches. I would definitely suggest to give this place a try. It's not the best local restaurant, but I'll definitely be returning.   I do have to mention that the cleanliness could use improvement. My first visit it was very sticky and I had to clean the table off with some baby wipes. The second visit was better, but it was first thing in the morning so I would expect that. This is the main reason I would have preferred to give 3.5 stars instead of 4, but it's still a good place to go."}
{"text":"First the bad: I was surprised they even served the fries the way they did...burned. We ordered takeout and didn't realize it until we got home. Very disappointing. They were terrible.   The good: The sandwiches were pretty good. The Pastrami was just ok, but French dip and Apple Burger were good. The cinnamon mayo or whatever on the burger was real tasty. Just check those fries before you leave."}
{"text":"Went for breakfast at nine in the morning. On the menu was a burger with egg. When it came out i cut it down the middle waiting for the gooey egg. Nothing. Called waitress over and pointed out the problem. She disappeared saying sorry. Waited as food got colder. Gave up and ate part of food. She came by later to say she would take off cost of egg. Got bill with no deduction. Never will go back"}
{"text":"Delicious fresh food, cute setup, love the dessert ice cream shoppe/fudge family feel.  Our main issue is the wait ... It seems they make one ticket at a time so every dish tastes and looks wonderful but it does take 25 to 30 minutes to get your food ... Even when it's not that busy."}
{"text":"This place was pretty good! Forget all the chains - Dennys, IHOPm and Village Inn don't have anything on this place. It just tasted... more homemade to me. Serving sizes might have been a little smaller than the aforementioned places but didn't leave me starving.  My guest also enjoyed their meal. The service was good too, with multiple people checking on you (it's a small place).  It also looks like if you wanted to sit outside that it is dog friendly. Will stop by again."}
{"text":"Excellent food and great service. No reason not to eat there. Quiet enough so a personal conversation is no problem."}
{"text":"Portions were generous and the food was scratch made. The pancake was my favorite, the biscuits and gravy was good but not the best I've had. The omelet my wife had was good but a little greasy. Overall it was good food at a good value but not jaw dropping."}
{"text":"We were really excited to find a place that wasn't a chain so close to our new home.   Reading the reviews we thought this was going to be a really good spot.   However,  we were not impressed with the quality.   For the price evening should have been hand made but my hamburger was from a frozen patty similar to what you would get at Sams Club.   The mac n cheese we ordered for our kids seemed like the version we make for them out of the quick single server microwave version.  My wife had a salad that looked pretty delicious but she said it was just ok.    The look and feel of the place was very nice.   And we were wondering if their breakfasts might be better.   Not sure if we are going to try.  Maybe if someone we know goes and highly recommends it."}
{"text":"We went here yesterday for breakfast.  I had an omelet which was par for the course but the pancakes were very fluffy and the syrup tasted just a bit better than normal. My wife had a chicken avocado sandwich but to our pleasant surprise they put fried apples on it with a sweet cinnamon sauce.  It was good.  I had an OJ and it tasted like the cheapy cheapy kind so I wouldn't order that but we got out of there for about $20 including two kids so that was good."}
{"text":"We've eaten here a few times. Interesting menu with apples on things you wouldn't expect, like burgers, but it works. Great desserts too. Service a little slow but worth the wait."}
{"text":"came in on a Sunday morning,  around 9:30. we were able to get a table for 2 adults, and 2 kids. they gave the kids coloring pages, and crayons,which was nice to keep them busy. I ordered a bacon and mushroom omelette.  it was cooked well, other than the egg shell I crunched on...... I understand it happenes, but it's a total turn off!! the mushrooms were nice and big sliced, which I enjoyed!! they also used marble cheddar:)another plus. my child got the pancake, an egg, and bacon. all was well cooked. my friend food looked great as well. the service was a bit slow, and nobody had much personality,  but ....oh well;)"}
{"text":"French fries were very good, the rest was bland and boring. Took FOREVER to get our food."}
{"text":"Been to ADC in the Queen Creek area, delicious, too bad  customers did not enjoy the comfort and cozy decor and feel. The service is pleasantly slow, you get seat right away with drinks, then order and wait for a homemade breakfast... the wait is not extreme, just enough to understand your food is made to order, homecooked. For those who want faster service and instant breakfast you are at the wrong location and your idea of breakfast is chain fastfood.  Great place to take one or all...."}
{"text":"We went back for another try and enjoyed our meals. My husband had a Reuben that we customized by replacing the pastrami with turkey. They gladly made the change. It was good although the dressing and/or sauerkraut could've used a little more zip. The bread was a very tasty marble rye and fries were very baked potatoes flavor which he enjoyed. I had the French Dip which also had good flavor and the salad for the side. I appreciate that's it was not just iceberg but a nice mix of greens. Both dishes were ample portions. For dessert we had a very tasty apple dumpling and a brownie sundae. We couldn't finish any of our dishes but will enjoy the leftovers."}
{"text":"I have tried this place a few times and they cannot seem to get it together. I ordered breakfast staples (eggs, pancakes, bacon, etc) first of all the wait both times was LONG. The prices are ok, but a little high for the quality. Today my pancakes were only cooked on one side. When I pointed that out I was told \"oops, sometimes they forget. It happens\" I really want to like this place, but everything was inconsistent not just the pancakes. The French toast was chewy and kind of stale. The bacon and eggs were done pretty well though."}
{"text":"Yummy food and a friendly staff to serve you.  We were there on a Friday night with three adults and four kids and everyone loved their dinner.  You really can;t go wrong with what you choose off of the menu.  But be sure to save room for all of the yummy desert options available!"}
{"text":"I really wanted to like you Apple Dumpling. I was sort of mislead thinking this was going to be Asian Dumpling place, but when we walked it, my friend said it was like stepping into her grandmother's house in the Midwest. We stayed despite completely different expectations, and it was good and tasty comfort food. They're known for their custard (with apple dumplings?), but they were out of custard when we were there.   A few hours later, my friend and I were studying, and the food didn't sit right for either one of us. I'm not sure if its because they don't fry their food, and I don't know what alternative cooking method is used, but it didn't go over very well. Sorry Apple Dumpling, I tried!"}
{"text":"Great cafe! One of my new favorites. Staff has always been very nice. Food has never disappointed."}
{"text":"Excellent food in a quaint/cute little place.  I had the Chicken Avocado Croissant.  VERY tasty.  The second half of the sandwich was even better the next day after a night in the fridge.  The home fries were cut in a very unusual way and tasted great.  Ice cream deli in there too with a bunch of good flavors to choose from.  Highly recommended !!"}
{"text":"I Went here with my girlfriend last week for dinner, and I wasn't to impressed. The waitress was nice and accommodating but the food took forever to come out and there was only a couple other parties in the restaurant. When we finally got our food my girlfriends chicken was still raw. The waitress took it off of our bill and she sent it back to finish cooking. A little while longer it came back fully cooked. It did not have a lot of flavor but at that point we were just happy the food was there and it was safe to eat. I wouldn't recommend eating dinner here, but it is a good place for desserts."}
{"text":"I had lunch at the Apple Dumpling this afternoon. It was highly recommended by a colleague. The service was fine and was greeted well. Took my order in a timely fashion. The food came and  i ordered the Apple Dumpling burger which has cooked apples and bacon and raspberry sauce. The burger was pretty tasty but nothing amazing the french fries on the other hand. The menu says they are fresh cut house made. There were literally 12 french fries on my plate and burnt (very well done) on one side and normal cooked on the other 3 sides. I have tried to reheat my fries in a skillet and this is the result i usually get. That is completely unacceptable in my eyes. A few reheated fries on a plate is nothing to rave about. I understand this is under new ownership but work the bugs out and get back to fresh ingredients."}
{"text":"I love their apple burger believe it or not the mix is very great together truly their signature dish!"}
{"text":"This is a great neighborhood/family/casual restaurant. The food is delicious. You also can't go wrong with the deserts as they have some spectacular ice cream creations. The service is also very friendly. The only issue I have with this restaurant is it often takes far too long to get food once it is ordered. However, once the food does get made, it is delicious."}
{"text":"Wonderful staff. Excellent food. They have amazing apple French toast. And their apple hamburgers are delicious. Plus there is ice cream, fudge, the best cinnamon rolls and muffins. A must try for breakfast or lunch. It will not disappoint. And huge portions."}
{"text":"This was my first visit to this small family run Cafe.  The menu had several choices both breakfast and lunch were available.  As well as a large dessert selection.  I had the Arizona. Roast beef, Havarti, and sliced green chilis (enough to cover the entire sandwich!). This was a grilled sandwich on Sour dough with Parmesan Cheese grilled in. Unique and tasty. I would order this again but next time with grilled chicken instead of the roast beef."}
{"text":"Food should get 4  for generous well seasoned portions. I really want to like this place as I am a huge supporter of independent restaurants and avid avoider of chains. Gave it a 3 because the decor and atmosphere are so sad. Hodgepodge of tables and chairs and half booths create a closed in feeling; dark wall colors and random wall decor (definite not eclectic and fun) add to the cramped atmosphere. There were no aromas other than the heavy layer of fried food and pancakes that was evident at 2 in the afternoon. Really needs a facelift! Next time I'll order food to go."}
{"text":"We were out here early in the morning and grabbed breakfast. James had the croissant sandy and I had an omelette. He loved his sandwich, however, my omelette was more filled with cheese than the actual add-ins I paid for. Cute place, good food, super relaxed and quiet in the morning, and they have a punch card!"}
{"text":"the food was just ok, the service was nothing to write home about, and the decor/ambience was kinda blah and uninspiring. It would probably take a major retread to make me interested enough to come back."}
{"text":"Since the address on Yelp is incorrect you should know that this restaurant just moved a couple of miles west on Chandler Blvd and are now located at the intersections of Chandler Heights & Higley. Now for my review...  I was working from home today with a coworker and we decided to to head out for a late lunch. Having noticed that the cafe moved int my neighborhood, we decided to give it a try. It was late so they were not busy. We were greeted upon arrival. The staff gave us several recommendations for lunch and my coworker couldn't decide between two of their sandwiches so he told the server to surprise him. The server came out a few minutes later with a half of each of the two sandwiches he was interested in. In all of my 39 years I've never seen a restaurant do this!  As you can imagine he was thrilled and very pleased with his lunch, as was I with mine. The food was great, the service was great and it's in a great location for anyone in SE Gilbert. I highly recommend giving this place a try!"}
{"text":"The apple pie is delicious.   That being said, the takeout portions and price-per-slice is consistently inconsistent--depending on who is preparing your order.   Also, their menu reads more like rules and regulations:  Hours-730am to 9pm but \"***kitchen closes an HOUR early***\"  Various added charges: 18% gratuity on tables of 6 or more; .55 for split checks; additional charge of $1 for more than 2 takeout orders; additional charge for \"multiple flavors,\" whatever that means.  And...apple pie isn't actually on the menu,  so you get charged whatever the staff member on duty decides.  For such a nice little neighborhood place, there are simply too many off-putting conditions, making the place appear inhospitable."}
{"text":"Went here for the first time last night.  It was very nice place.  Great service and nice people.  Food was fantastic.  Was a little warm in there so not sure if that is normal or not.  But all in all it was a great visit.  Will visit again."}
{"text":"We really wanted to love this place!  We recently moved to the area and really miss having downtown Gilbert close by.  We took the boys after their football game a month ago and were really disappointed.  They didn't have any fries at lunch time...which is strange.  The place had an overwhelming smell of greasy food.  They were frying something!  The server was really sweet, and the kids really liked the popcorn machine...but the food is not worth returning... not for awhile!"}
{"text":"If it's your first time here, try the Cairo sandwich! The chipotle raspberry sauce is amazing, and I love the avocado. Sourdough bread with buttered garlic on it is so evil and yet so tasty.   The girl serving was nice and had a good smile. Fun family atmosphere and I appreciate the true hometown cafe feeling."}
{"text":"We randomly decided to come to this restaurant based on the suggestion of a friend.   We tried the Stellar's Apple Burger, Chicken Avocado Croissant, and topped it off with the pizookie for dessert.   The food was all great and the staff was great."}
{"text":"Loving this place more and more with each visit!!! Gluten free pancakes are amazing!!!!"}
{"text":"I had such high hopes for this place.  Let me start off by saying that I am a breakfast person and very particular.  Breakfast ingredients are cheap and there are not that many unique combinations so it is an absolute necessity that it be done right.  If you are thinking, \"Oh! That's me!\", this is not the place for you.  First, the staff was friendly but not overly excited or very apologetic that it took 30 minutes to get our food.  It was also unpleasantly warm inside the restaurant.  I might be able understand if the place had been crowded, but it wasn't.  It was half empty at 11 am on a Saturday.  The food was not especially cheap for the quality.  I had the ham steak breakfast which was nearly $10 for ham, eggs, toast, and potatoes.  Here are some thoughts from my meal and what else was ordered at our table:  The ham was tasty but it was sliced ham and not a ham steak.  My over easy eggs were browned* .  The toast was cold*.  The pancakes were fluffy but dry like a biscuit and not spongy.  The home fries were tasteless and undercooked*, unless you like hard potatoes.  The \"cream\" for the coffee wasn't cream, it was milk.  The sausage patties used were the cheap ones you can buy frozen at Walmart and hardly qualify as meat.   I let out a sigh of relief when we stepped out into the open air; glad to be finally free from waiting for someone to take payment while enjoying the cool breeze rushing across the back of my legs, cooling them as it evaporated the moisture built up from an hour of sitting on a cushion in an over-warm room.  The joy of this moment left me with one final utterance, \"Eff that place.\"  On the bright side, this has motivated me to start writing reviews instead of only reading them.  * denotes things about a breakfast that would make me want to punch a kitten."}
{"text":"Slow to no service after order was taken. Ordered a hamburger wow let's just say bun was toasted but cold and stale. The meat was medium on the bottom of the patty so makes me wonder if they bake it like they do their fries. The place lacks air conditioning, a room ac vented into the space above the ceiling. You can give the place a try, that's your call. If the place lacks the proper equipment they need to find their niche, maybe it's breakfast."}
{"text":"Yum! I got the Chicken Avocado Croissant. Grilled chicken, Havarti cheese, cinnamon apples, raspberry chipotle sauce...delicious. My husband got the apple burger, and he was surprised at how great all of the different flavors meshed together. We were really impressed with the food. Other reviewers have mentioned poor service, but we didn't have an issue. However, we were uncomfortably warm throughout the entire meal.  I will go back again, but maybe wait until fall when it's a bit cooler outside so their AC does a little better."}
{"text":"Read the reviews and kept seeing this place pop up on other sites so I decided I wanted to try.  I am really glad I did.  Amazing service & food with even better dessert.  Kids eat free on Monday & Wednesday so that was a bonus.  Reasonable prices on the ice cream.    I can't wait to go back and try more.  This is a great place to go when you want a \"home cooked\" style meal.  Great job on this place (to the owners)!"}
{"text":"Horrible service. I went in with my fiancé about ten to fifteen minutes before breakfast was over and they wouldn't serve us. I might understand if the place was busy and we were past the specified time, but it was essentially empty and we were within the breakfast hours. I would encourage skipping apple dumpling if its on your list of places to try."}
{"text":"As a true breakfast fan, this place is a MUST!!! The staff is friendly and work so well as a team. The owners are regularly in the business which ensures the quality of this family owned cafe.  After eating here a dozen times (plus) I've never had a dish that wasn't great! The homemade cinnamon rolls are to die for, the coffee is great and always fresh and the kids menu is complete to satisfy even the pickiest of eaters!! Very clean. They also serve fudge and ice cream which I haven't had as often, but would still recommend based on all of my experiences with the Apple Dumpling Cafe. Make this a stop on your to-do list this week!"}
{"text":"Not impressed. Went here for breakfast and we ordered a variety of things. The stuffed French toast with apples was delicious except the apples (raw) were gross. The pancakes were not good at all, they were not cooked thoroughly and had a greasy taste. My brother had eggs one was cooked correctly the other was not, potatoes were ok but not great. Couldn't believe the price of coffee, seemed a little high. The service was ok, my daughter had to wait much longer than the rest of us for her food, which to me is unacceptable. Kids food is always the priority over everyone else's. Drinks weren't filled promptly, and the manager/owner? kept coming by but at awkward times. Overall we won't be back maybe if it was around the corner, only reason we went here was bc the place we wanted to eat wasn't open yet and we were ready for breakfast."}
{"text":"I go 15 minutes the opposite direction to grab a sandwich on my way home from work. This is my favorite place to recommend to friends, take family when they're visiting or birthday lunch with a group.  I've only ever eaten the lunch and dinner menu and even then don't stray from the sandwiches.  I love the friendliness of the employees- they are always so pleasant even when the place is packed. Sometimes it can be slow but it doesn't stop me from going back."}
{"text":"4 stars......are you kidding me? My cheesy eggs and sausage were not as good as what I could have gotten at Mc Donald's at half the price. Pressed and formed  precooked sausage patties were disgusting! The only thing worse was the service! They can keep their frequent user card!"}
{"text":"You'll be shocked by how tasty the food is. The burgers with apples? Yum. wow! Hidden gem. Be patient, the service is a little slow, true mom and pop kind of thing. You'll be glad you supported such culinary talent. Breakfast was great too."}
{"text":"best Omelets my husband and I have ever eaten. Great service. the new owners have just owned this restaurant for a month. I think they will do well."}
{"text":"Awesome food and staff! Love that they sell and use boars head deli meat"}
{"text":"My kids constantly beg me to take them here. Food is really good, service is friendly and prompt. Breakfast is solid but we usually come for lunch. My favorite French Dip in the East Valley. Rotisserie chicken sandwich is on point too. Desserts are ridiculously good and they have a lot of them. Only reason I gave it a 4 is because I don't care for the french fries, they are weird and almost seem burnt, I know it wasn't a one time thing, that's just how they serve them. Great atmosphere, like you're back in Grandma's kitchen!"}
{"text":"What a fun restaurant, I love going there because it takes me back to the old days and I love how they were able to make the apples work with just about everything they could imagine. It's a local owner and they cater as well. So nice!!"}
{"text":"The Apple Dumpling Cafe was an awesome resteraunt! :D I ordered the waffle with chocolate chips baked into it. My meal was amazing!!! There were so many chocolate chips in that thing, everyone should eat here! IT'S SO AWESOMEEEE!!!   The bacon was cooked to perfection and my son couldn't stop talking about how wonderful the sausage was."}
{"text":"I had the wings there and the wing sauce was so good I went back a few days later and bought a container to put on chicken I made at home.  It is a great blend of sweet and spicy.  My wife has a veggie rueben that she thoroughly enjoyed.  We will be going back!  I just wish they were open on Sundays."}
{"text":"This is home cooking at its best. The service is good! Not much room, but great cooking. I had strawberry crepes, they were so light & delish. My husband had Eggs Benedict hit the spot for him! We both vote to come back. Coffee is really good to0! Our service was perfect, always there too refill the coffee. It is a hidden little gem."}
{"text":"My family loves this place. They have a large selection for the kids. This is the kind of place you would go if you want a home cooked meal but don't want to actually cook it yourself. Their desserts are wonderful! I wish they had a few more options without meat but they are always willing to work with me on whatever I order."}
{"text":"I felt like I was home having breakfast here. It's a small place because it is a cafe but the people here welcomed me and treated me like I was their family. I had their delicious strawberry crepes and my bf had an omelet with potatoes and biscuits. Not too shabby and their prices were pretty good. The service was fantastic. Now I know a good breakfast place around my area. Awesome job guys!"}
{"text":"I finally got to this place after years of living in the East Valley.  I had it all worked up in my mind to be this fabulous place.  And for the most part it was!  When we first drove up I was a little concerned as it is located in a grocery store plaza.  Plaza joints always freak me out, LOL!  When we walked in we were warmly greeted by the owner and seated immediately.  The woman that cooks (the chef) walked out and suggested a few things.  We took her up on her suggestions and ordered the Cairo's Rotisserie and the Country Fried Steak.  To our surprise, nothing is fried at this place.  Everything is baked.  The steak was crispy and the potatoes were yummy.  We couldn't believe that it wasn't fried, it was so cute.  My son ordered off the kids menu a pizza with fries. The fries were handcut potato wedges BAKED.  Very tasty.  My sandwich was awesome!  The parmesan bread is yummy.  The prices are a little steep for a place located inside a plaza BUT the portions were huge and it was quality food.  The staff was super friendly and personable.  Will definitely be back and hopefully for breakfast next time."}
{"text":"Amazing apple dumpling and apple pocket!    Cute little place.  Great service and reasonable prices!  My husband and I will be back..and back..  :)"}
{"text":"My best advice... KEEP Driving...even McDonalds would be better than this place.   I will say we had been several times for ice cream at the old location on Power and Chandler Heights, and we had delicious ice cream and enjoyed the little shop etc... the new Location is at Higley and Chandler Heights.. is not so cute, let me tell you... if they moved because they thought the problem was location... UM, NO its NOT LOCATION that is the problem!   When we walked in it felt warm and dark and had an odd scent... the lighting was AWFUL, there is an old.. Ice Cream Cart thing right when you walk in with all sorts of Local papers, you know the stuff people browse on a Sunday AM, when eating alone... well, anyway, it was a mess... so lets move inside... there are several plants, I assume to make the place welcoming and warm... they were all dead, or dying... ;( they could at least water the plants!   Lady says take a seat... it was me, my husband and our 9 week old baby in her carrier... so, the set up in this place is AWFUL.. 2 booths on the left, that can only seat 2 people...on the SAME side, and Face the window/ door we just came in.. another booth there, taken, so, we look, there are 2 booths on the FAR wall, one is taken, the other has direct sunlight shining on the whole table... umm, it was 105 at 9:30 AM, No thanks to that one, then another booth in the center of the last wall, taken by a waitress... i assume the owner and a girlfriend having coffee, and then several stand alone tables all miss moshed... so at this point I am slightly ANNOYED, but I LOVE breakfast/Brunch and would love a place me and my baby daughter could go on a regular basis, so I am keeping an open mind...  Well, it did not take long! The Coffee was the worst I have EVER had... I LOVE coffee, and I drink ANY coffee when the need be... I took 2 sips and was like, NEVER MIND.. and ordered a diet coke... which if I was the waitress and I had JUST brought you a cup of coffee and 2 seconds later you order a soda... I thinkI would ask if something was WRONG! NOPE, she did not care the full cup of coffee just sat... oh and there was no cream, and nothing to stir the coffee with?!? Had to ask for Cream and then a spoon... so you would think after returning 3 times with stuff for my coffee it is weird I did not drink it... but whatever... I am still open at this point... I put my arm on the table.. and YUCK, it had not been cleaned, I take out a germ wipe... and begin to wipe the table down, the lady I assume was the owner and the waitress both see me go through 2 wipes, which have turned almost BLACK, and they again never say anything...odd... I thought.... so now I have a clean table, coffee I can't drink, and a soda on the way, so we order our food...   I got an omelet with cheese and mushrooms, my husband got Chicken fried steak (which we later learn is not fried at ALL) great for health reasons, and he said it tasted ok, but would not order it again. the Omelet was good... the house potatoes were AWFUL could not eat them, well first of all they did not stay on the fork, they were really think, and sort of hard and it was weird... no flavor, and Chewy... so weird... how the hell do you mess up POTATOES.. they obviously were cooked in advance, like maybe days in advance... not sure... anyway, I get 3/4 of the way through my meal, and I come across a small piece of BLUE PLASTIC.. weird, almost like part of a wrapper, like the stuff they shrink wrap around bottles so they do not leak... anyway, then another bite I find a HAIR, YES a HAIR! I was completely and TOTALLY DISGUSTED AT THIS POINT. I told my husband get the bill and lets get the hell out of here.   As we were paying the owner brings us samples of fudge.. i must say THAT WAS DELICIOUS! and she was REALLY nice, and told us all about the no fried etc. etc... but HONESTLY it was just a BAD experience... they should stick to ice cream and Fudge, maybe a sandwich or something, but as a CAFE/Ice cream shop they do not WORK... I have little confidence they will be there in 6 months, there only hope is they are right next door to Taco Bell... however if you gave me the choice... Taco Bell would win EVERY TIME!   Good Luck Apple Dumpling Cafe... you are going to need it!"}
{"text":"Went here the other day! Menu looked great. I had a taco salad and a side of fries. Fries were awesome. Salad was ok really greasy seemed like leftover burger bits from the grill.. But I will definetly be back. They got 3 stars because service was extremely slow. We asked for our fries first and they brought it all at once, and it took forever. Service could be better too. Not bad but definetly not great"}
