{"text":"Great selection of VQA and international wines.  Great small plates of food.  Informed staff.  Clean comfortable space.  Wine preserve systems that allow a large selection of wines to available by the glass.  


Highly recommended."}
{"text":"A small & cozy space that is great for an after-work snack or even better, a late-nite nibble. Lots of wines available by the glass or by the bottle - with most of the bottles at $50 and under. Really reasonably priced. It's a nice alternative to while away some time if you're waiting on a reservation in the area, or just want to linger in the area."}
{"text":"Archive is a quaint cozy dream come true right up the street from my place. The wine list is extensive and reasonably price (that's a rare find in Toronto these days). The tapas style food is delicious and the ambiance is relaxing. In fact, I'm a complete wino and a reggae nut and so the combination of reggae and wine (not sure if they always play reggae but the two times I've been there they have) is a winning one for me. The tapas I've tried are the crostini which are amazing, the crab cakes are divine, the tartar is the tartar of my dreams. I've even contemplated going there just to stuff myself with tartar. Basically the food is perfect, reasonably priced and the portions are are just right, the wine is great, the service is top notch and the ambiance is great. Amazing find!"}
{"text":"Such a cute place, very unpretentious and nice staff. And reasonably priced for Toronto."}
{"text":"Olives! If you like olives try them! The atmosphere was very classy. The food had small portions but was very flavourful and more than enough. The service was very good. Overall it was a great experience. They had a nice selection of craft brews and an extensive wine selection. Pricey though."}
{"text":"Been here twice now, quite like it. There's a  
nice relaxed atmosphere that makes it great to grab snacks on a date. The food is tapas style portions, prepared fresh in front of you lots of preserve and antipasto\charcuterie to choose from and lots of wines! I had a leak and fennel salad and steak tartar which were both lovely. My only complaint is that I haven't been offered a proper drink either time I went in, had to ask for a beer. Other than that I enjoy it and would go back again."}
{"text":"Drinks: Ordered 2 x blind tasting with my wife and some additional by the glass. Great experience, Kyle chatted with us about the wines, we tried refreshing orange wine from Aus (just like chinese candied ginger and ginseng from a chinese dried foods store with great acidity), cab franc from both norman hardie in prince edward county (loire valley green pepper!) and pearl morrisette from niagara (like loire valley but riper!). Also tried other notable tasty wines, pinot gris from BC (thought it was muscadet sur lie) and oxidized like white from France. 

Food: delicious steak tarter with capers and pickle plate. Complimentary food to the amazing wine list!"}
{"text":"My girlfriend and I have visited Archive three times over the past six months and though it looks great on paper (trendy spot around the corner, good wine list, easy to get a table) the experience has made us a bit sad every time. We kept wanting to give it a second chance, though, because there's a lot to like, especially in a city with limited wine-focused options for a night out. It's not like Archive has done something bad and we're very mad at it. We're not angry, just disappointed. 

The key problem is the service and attitude towards wine. The fellows who run the place seem fairly unwilling to leave their comfy spot behind the bar making wisecracks to actually serve the tables. Each time we visited we sat with emptied glasses for a good long while and ended up asking for the cheque rather than getting a second glass. If the staff actually know much about wine, they hide it very well - though I can't tell if it is the usual ironic detachment style of service that is still popular in Toronto (though fast falling out of vogue elsewhere) or if they actually just don't care. The wine list provides very little detail to the novice and is very inconsistent about where the wines are from and what grapes they are made of. This would be fine if the staff weren't so uninterested in explaining details about what the wines are actually like. If you want to know what good wine service looks like, visit a bar in Montreal called Buvette Chez Simone where the servers ask what you are interested in, then bring piles of bottles to your table, pour samples of this and that all while effusively describing them, and then pour you a full glass of whatever you've settled on. Their enthusiasm is infectious, and I swear it makes the wine taste better. 

What saves Archive is an actually interesting list of wines, some of which are quite unique, and a nice rotating list of tapas plates that match them all well. There's been clearly some thought put into both, so someone behind the scenes seems to be doing something close to caring. Unfortunately it's hard to tell from the front of house."}
{"text":"Enjoyed the wine list, and the service was pretty attentive. The owners are involved in the running and won't hesitate to give you recommendations. The tapas aren't bad, but didn't get a chance to try very many. A nice place to enjoy a few drinks and enjoy the conversation, plus nibble on some snacks. Would go back."}
{"text":"Getting my group to come out every week for a quiet gathering of small talk, work gossip and griping over liquor is never a tall order. Getting them to go this far west of the downtown core, however, takes a little bit of persuasion. Thankfully, Archive has given me a great argument.

The venue itself is cozy and set amongst a variety of shops. The interior is neatly decorated but not ostentatious, giving you the impression that this is a place that let's the product speak for itself. Menu's exist on three blackboards, offering you a variety of selections helpfully categorized for you by type, along with some charcuterie selections for you to enjoy amongst you group.

The wine selection is extensive, as is the knowledge of the servers. Whether you know your stuff, or simply want someone to make the choice for you, these guys are ready to provide the perfect example of what you're looking for. They even offer to pour  you samples of various wines so that you may choose exactly what you're looking for. 

I can't tell you what wines we ordered though I can remember we did have some French, Italian, and Georgian bottles which certainly helped unwind after a hellish week. We also ordered a meat plate consisting of chorizo sausage, duck procuitto, cornishons, paprika coated almonds, crostini, and another cured ham which went perfectly with the wines. 

Overall, I was impressed with the layout and the crowd as well. It was quiet enough that you could have a conversation, though, it is small enough that you can get interrupted by the more boisterous guffaws from a neighbouring table. Everyone was friendly and attentive and it provided a nice relaxed atmosphere all around.

The owners are local boys who really wanted to open up something where they group. It's nice to see people from the community actually opening up shop there, so bonus points for that.

I think we will likely be coming back again. Hopefully I can leave the car home and fully indulge my inner wino."}
{"text":"Excellent selection of wines , lovely quaint place but the servers and \"chef\" are bloody awful. No idea why they work there? Our server honestly couldn't be bothered to be there and in a place with that many wines you need to be a person open to discussing wine and so on.. Waiting a good while for a food order of cheese may I add sitting at the bar , we asked the chef politely when the cheese might be ready to which we got this snotty sulky man \" it will be ready when it's ready \" charming ... if your going to be in the service industry unfortunately yeh you do need to engage with the customer , give some eye contact force a smile , something ! Personality of an A4 page with crap attitude shouldn't be a server."}
{"text":"Finally a wine bar the focuses on wines found in our back yard. 

I was so excited to try this place out for my BFF's birthday. It was a Saturday night and it was a bit quieter so we were able to take over most of the bar. It's a great relaxing vibe with attention to details. (IE they put cubby holes under the bench for people's purses). 

My favourite thing about this place though is its focus on Ontario wine. I love this because I feel like so many places in this city are importing wines from the Old World instead of focusing on what we have to offer in our own backyard. It's refreshing. The prices are great and they have really taken the time to find the cream of the crop where Ontario wineries are concerned.

I highly suggest checking out Archive .. if only for a glass of local goodness"}
{"text":"Another too-tiny restaurant, with wooden tables, chalkboard menus, overpriced tiny sharing plates with meats and cheese on wooden planks....and customers with tattoos, beards, and pants that show you all their business.

Look, it's not that there aren't some gems in the hipster-crazed restaurant trend.  There are times when it's great.  But you still have to have top notch food to keep me interested, for when the trend wears off, who will survive?

Strong, strong wine list.  Service was quite nice, only one server for the whole joint and he was good.  Ambiance is breezy, a neighbourhood feel to it, laid-back.  But the food didn't inspire me.  Dates wrapped in proscutto were literally two dates on a plate for $5.  We ordered the three meats (for $19) and it was three slices of small toast with chicken liver mousse, three small toasts with cheese and pesto, and three small toasts with mushrooms.  Yummy, but nothing that stood out as amazing.  Certainly far from filling, presentation boring, and nothing I haven't had before.  Needs a more adventurous and fulfilling menu to match the wine list."}
{"text":"Hello wine lovers! If you're looking for an extensive list of wine, search no further! This intimate wine bar has everything you could dream of. Whether you want a familiar VQA wine, a classic Bordeaux, a typical Rioja or a unique wine from a more unknown region like the Archeche valley, they've got it! They even serve Vin Jaune which is usually impossible to find here in Canada. Me and my hot date ordered a few small plates to share, most notably the Steak Tartare, Arancini, and the Autumn salad. The Tartare was incredibly fresh, flavoured with garlic, chopped gherkin pickles, something spicy (hot sauce?) and a raw egg cracked on top.   The Arancini was served with a tasty tomato sauce, and the Autumn salad was the perfect accompaniment to finish off the meal.  Regrettably we forgot to order the Dates with Machego cheese and Prosciutto but I can only imagine they would have been as delicious as everything else. Even with the bartender shattering a wine glass and almost spilling red wine on my cream shirt, I'm giving this place a good review. The comprehensive wine list is totally worth the shards of glass that were sprinkled all over me. I like to drink dangerously ;)"}
{"text":"This is a lovely place, but not a serious restaurant.
 It appears to be a group of guys enjoying themselves in having a Tapa type establishment. The waiters are amiable, but the service is a bit intermittent. 
The food has few 'aha's, and is mostly spreads on thin pieces of bread.
 The wine list is unusual and long but there is little that is value priced.
Worthwhile to drop in for a glass and a snack, but I wouldn't plan a dinner here."}
{"text":"I love wine
&
I love this wine bar 

An incredible selection of wine. I've had the opportunity to sample some amazing vintages here and the staff are very knowledgeable about their wine! I once came in feeling bold and asked for the most dry/ savoury wine they had and they brought me this incredible smokey flavoured wine that had soo much depth to it. 

I love to bring friends here to do their \"mystery\" flight of wine. They always give everyone different wines and these sheets with a pen to make notes about each glass. AND the wine sipping ambience in their is perfect!

I would also like to mention that the food here is not to be overlooked! The charcuterie board options are mouthwatering and their small plates are delicious!"}
{"text":"Delicious wine that you can't get at LCBO. Would go again for the wine. In terms of food, it was ok. The prosciutto croquettes and date with manchego and prosciutto were extremely salty. I liked one tapas dish that was on a cracker with ricotta cheese, peaches and sage."}
{"text":"I really want to love this place.  Their staff is great, I like the space and the vibe.  But their wine... I'm not sure if they're trying to have a very narrow wine menu, but their selection is pretty limited in scope.... very heavy on the French, and light to medium bodied overall.  I would love this place if they kept the menu fresh and had a broader selection."}
{"text":"Archive is a cozy wine bar with very good tapas to boot.
The tapas are Italian and Portuguese influenced, with a nice variety seafood, meats and cheeses. You can get a fair sampling for a reasonable price.
The wines range in price so you won't break the bank.

Good for: small groups, couples. Staff is friendly and it wouldn't be a big deal if you went and grabbed a seat at the bar for one."}
{"text":"Great selection of wines by the glass.  Very interesting selection.  Don't be afraid to explore.  They have picked a huge selections of winners.  Lovely food as well.  All small plates. And a great selection of sherry, amaro, even scotch.

Come for the wine.
Enjoy the food.

Friendly helpful staff to boot."}
{"text":"Thank you Josh and Joel for a lovely evening.
I've passed by this place a few times, and for a first timer, party of 3 we had a blast. 
After the staff was kind enough to let us sample wines, we were able to choose a bottle.
I had the opportunity to sit down with part owner Joel who told me that their business is constantly changing to try and meet needs to retain both loyal and new clients.
We had their 2011 Tollgate, Ontario wine after we were able to narrow our selection.

Steak Tartar 5/5: with an egg yolk in the middle helped bind all the ingredients together.  Flavors were fresh, tender, and local.

Prosciutto wrapped dates w/ Machego (cheese) 5/5 beautiful balance of flavors with all three of these ingredients, the cheese was the x-factor that helped unify the balance between both the dates and prosciutto.

Meat & Cheese: Duck Prosciutto, prosciutto, Beemster xo (Dutch cheese) served with pickled celery, & cauliflower & smoked paprika almonds... perfectly paired with our wine, it was a complete meal.

Pasteis de Bacalhau: with cheese, a Portuguese/Brazilian dish, perfectly fried, and prepped with perfection! I would recommend in a heartbeat 5/5

The overall ambiance is dim, cozy, small; intimate.....just a great place for a low key hot spot."}
{"text":"It's cozy.  It's relatively quiet to allow for actual conversation.  It's wine selection is rather impressive and delicious.  It's owners, two wonderfully friendly and knowledgeable brothers, are, well, friendly and knowledgeable.  It has food (did not try, so sadly cannot comment on it), tapas style aka my favourite.  I even loved the way the windows condensated up to allow my wine friend and I to sit right in the front window and not feel like we were in a fishbowl!  

There is not a single negative or even temperate thing I have to say about Archive.  I love it.  Go... or maybe don't; I don't want you taking up my table ;)"}
{"text":"Went there with my friends for a low key wine night. The interior design is very interesting, and with music creates a very cozy, pleasant, atmosphere, perfect for a low key night out with some friends, or a date night. Music is not very loud, and will not interfere with your conversation. Both owners (brothers) were very friendly, professional,  and definitely very knowledgeable about their wines and food. They allowed us to try 6 different wines until I found a perfect red for my taste, really putting guests' satisfaction first. 
Small plates selection was great! We ordered prosciutto wrapped dates with cheese,  steak tartar, meat and cheese platter. Every appetizer was full of flavor, had a nice presentation and was rather affordable. Will certainly keep coming back!"}
{"text":"For me, winter is wine season. It's a time for hibernating and drinking a deep-bodied red. When winter rolls around, my go-to place is always Archive. 

Unlike the wine bar of yesteryear, Archive is a little more approachable and hip. The staff offers an impressive knowledge of the wines they have on offer and if you're lucky enough, let you sample some before committing to a purchase. 

During the winter, my go-to red on their menu is the Pearl Morissette's \"Cuvée Mon Unique\" Gamay, which fills the mouth with rich and earthy dark fruits. Much of the wine list is devoted to Ontario and come in three- and five-ounce pours, as well as by the bottle. 

One of my very first visits here was with my partner during a hot summer night who implored me to try the Cave Spring's \"Dolomite\" Riesling, which fills the mouth with citrus flavors - it's now one of my favorite wines. Don't forget to try their tapas menu while here - it's dynamite! The dates, manchego, prosciutto bite is probably one of the best things I've put in my mouth. So simple, but so so good."}
{"text":"I like nice servers who know their stuff. I like chill vibes. I like being able to order some little dishes to compliment my drinks. I love wine. This place made me happy."}
{"text":"Great little wine bar, they have a small menu but everything is done well. I like the variety of wine they had though I do wish they had a per the glass German Riesling option. Kyle was attentive and friendly. This is a place I definitely recommend and will definitely go back."}
{"text":"Great, non-pretentious place. Tried a flight of orange wines (new to me), which were amazing."}
{"text":"Came here with a group on Saturday and we all loved it. They have an extensive drink list and the staff were very knowledgeable and helpful in making recommendations. The service was excellent - we ordered the \"everything on the menu\" option and it was brought to us perfectly portioned for 9 people to share, not an simple feat when you consider this is a tapas menu. We also ordered a large cheese selection and were impressed with the spread they brought out.

Of all the things we tried, our favorites were definitely the polenta & mushroom dish, the kale salad, the ceviche, and the apple pie pocket for dessert. The atmosphere was comfortable and unpretentious, not too loud but not too quiet (it was busy), and we had an amazing night there. Would definitely go again!"}
{"text":"Loved this experience. Great wine selection and solid service.

I couldn't choose a wine, so Joel, our bartender, suggested a blind flight (which I completely missed on the menu). Great choice for anyone interested in testing their vino ability or for someone as indecisive as myself. I received a trio of reds (bordeaux, cab sauv and malbec) and enjoyed all three.

Steak tartare is a MUST and the enchilada is tasty. I'd consider this a good date joint. Not sure if it gets busy - I was here on a weeknight because I'm addicted to drinking. It's small, but cozy, and has a classy yuppie feel imho"}
{"text":"Killer spot. Really intimate setting with a fabulous wine selection. We tried some of their tapas as well which were okay. I wish the place was a bit bigger - the seating is a bit awkward and uncomfortable at busy times."}
{"text":"Archive is a lovely little wine bar, on a beautiful stretch of Dundas that has been slowly picking up over the last few years. The atmosphere is candlelight, re-purposed wood, exposed brick, hipster bartenders... essentially everything endearing about high-end, urban bars is housed here. Hooray.

Their wine selection isn't pages and pages, but it seems to be a well-curated little list, with a few rosé and sparkling options to please my palate. Beyond their wine they have many small plates for sharing, and we indulged in their house-made(?) truffles. Delightful."}
{"text":"I'm disappointed with the service here. The price is pretty reasonable, given the average price of a good glass in the city, but the service was so bad I'm not sure I recommend stopping in for more than just one glass. Our charcuterie board was the last of our food choices to arrive, and we sat with empty glasses and an untouched board for 15 minutes before anyone asked us if we wanted another glass. The server then took the order from the table next to us and they got their wine before us! I can understand when a place is busy and the servers are short staffed but these guys just didn't seem to care."}
