{"text":"our table had the chef's menu and in summary, would rate it as very good. The ceviche was tasty and had a decent amount of fish. It wasn't over lemon'd or seasoned. There was a beef heart dish that my friends weren't big fans of, so I got to clean up and eat the leftover food. It was well cooked, not too tough, and well seasoned. 
The main dish was a standard Peruvian chicken dish. I found it to be a bit over cooked/dry, but the sides were really good, and definitely saved the dish. 

The food is not spectacular here, but it is decent value and the service is great."}
{"text":"Great atmosphere, and surprisingly quiet for the Ossington strip.  Best ceviche I've ever had.  Knowledgeable service.  What a great night!"}
{"text":"This is my first time trying Peruvian food from a restaurant.  I've been hearing good things since they opened several months ago.  There's no sign yet, but it's located right beside the ossington.

Let me start by saying my girlfriend is Peruvian and just came back from Peru a few weeks ago so her standards were set high.  I've personally only tried Peruvian food once or twice.  We ordered the pisco sour flight (3 flutes in different flavours) - I thought they were delicious but on the weak side.  We later found out it's because they're only allowed to serve 4 ounces of alcohol per flight, whereas the individual pisco sours were 2 ounces per drink... for $32... I would have ordered two separate pisco sours if I had known.

The ceviche was perfect.  Even my girlfriend said it was delicious.  They used a mix of different white fishes and I could have eaten two orders.  I had the cau cau as my main which I highly recommended.  They use seafood and you get lots of scallops, tiger shrimp and squid on a bed of quinoa.  My gf had the seco de carne, which was a large beef shank.  A very generous size, but I found this dish to be very bland.  For something that was at the top of the menu, I was surprised.  Skip over this for now even if you're tempted by the meat.  We also had the rice pudding as dessert, which was not too sweet and had pieces of fruit in it - just right.

Service is excellent.  We received two drinks on the house because the waiter thought he took too long (he didn't).  We spoke to him a bit and came to the conclusion the restaurant is still ironing out some kinks.  We were told that they are trying to source a number of authentic ingredients that are not readily available in Toronto.  They also have an intriguing brunch menu.  I'd definitely return in a few months."}
{"text":"It took me a while to find this place but when I finally did I wasn't disappointed! The food is divine especially the ribs with dark chocolate salsa and the cocktails were delicious and quite unique. The service was also very good and I learned a bit about Peruvian food through the staff who were friendly and attentive without being overly so. 
All in all, a lovely experience. I'm definitely going back for more."}
{"text":"No, not good unfortunately.

Waiter was very good, knowledgeable, food was just decent, place was empty. Seems like the menu has changed a lot since the previous reviews, because it was totally different than what I'd read.

It was Tuesday night and snowy so not surprising but still it killed the ambiance.

The interior was pretty plain by today's standards of trendy areas like Ossington and it was freezing inside, maybe only 17 degrees or so, my feet never warmed up. 

$40 prix fix meal was just average - $16 for a pisco sour is a gouge. 
The 4 course meal was sent out too slowly, partially I'd imagine because they seemed to pick up a last minute catering gig for the bar next door which took precedence over us.

Appetizer ceviche was decent but portion was too small for $20, the food just isn't good enough for that price range.

For a one drink, 1/4 ap and one prix fixe each a $80 all in price is too much for what they offer. This place will not last even in an over hyped area like Ossington. The hipsters will not stand for mediocre.

Fail. Disappointed. Too bad, seemed like there was potential.

One star is a better rating, but our waiter's quality bumped it to a two."}
{"text":"I wanted to follow up on my last review. We were there tonight as a table of four and ordered the chef's fasting menu. Two gluten free diners, a completely (including food) alcohol free diner and a diner with a peanut allergy. We must have been a restaurant's idea of a nightmare table. Again, the service was excellent, describing in detail each dish delivered and the food was some of the best I have had in Toronto."}
