{"text":"I used to live in the area and order from here often. I love the menu and while it can be a little slow to get your food sometimes the atmosphere is great and staff and chefs are very friendly. The cuts are great and fresh, rolls are neat and beautiful. Everything I've ordered from here has been delicious. Worth stopping in if you love sushi!"}
{"text":"We love this place, authentic and delicious sushi, the volcano roll is amazing. The staff is so friendly. The place is not so fancy, it's just fine."}
{"text":"The sushi is good.  It is fresh.  The sushi chef's seemed unprofessional and quite novice.  The fish is tasty, but the rolls are not tight enough and fall apart miserably.  All that aside, I would have given this a 4 star rating.  HOWEVER, they have a TV that 8 out of the 10 times I have visited there they are playing classics such as, \"Backyard Brawls\" and other extremely violent shows notwithstanding there was NCAA basketball going on at the time.  What is worse, the sushi chefs will watch the show while working and laugh outloud. 

Don't get me wrong, I actually find some entertainment in the \"backyard brawls\". But there were young children who I saw watching with complete mortification and terror what was unfolding in past their tasty looking bento boxes on the television. It's really, really inappropriate.

Notwithstanding, the food is good. The service is extremely slow, but friendly. I will give this place one more chance, but if they are playing Jerry Springer or cage fighting best moments, I am out."}
{"text":"Local friends took us here and given the location we were skeptical.   As others have commented the service was a bit disorganized.  But as an east coast sushi snob the food did not disappoint.   We ordered a range of rolls and sashimi offerings (standard stuff, california, spicy maki, tuna) and a noodle dish and all were above average.  The bill with beers for 4 was around $100.  No one left hungry.  Do not be put off by the strip mall location.  This is the real deal.  By the way I have to wonder about the \"Panda Express\" review."}
{"text":"The good news is I actually was served this time- probably due to the fact I was the only customer in the restaurant at noon on a Tuesday. Ordered the chicken Katsu 
Lunch comes with 4 piece CA roll- noticed the sushi chef- (I use that term loosely) - sneezing for about a minute, he proceeded to blow his nose and then continue preparing my sushi- I called the waiter over- nice kid, explained what I observed, he offered me cucumber salad in its place- what a dumpster fire this place is- stay away!"}
{"text":"Has no beer, other than Japanese beer on Happy Hour. No draft beers?  Happy Hour is overpriced and not appealing.  Add more draft beers, more happy hour items, and see if you get more customers"}
{"text":"I can't believe how good the food was here! I'm a \"new yorker\" and yet had never had raw fresh wasabe like they used here for the special sashimi we ordered, including delicious Toro and amazing Hamachi. My wife is half Japanese as well and she was impressed. Went with 6 and the service was slow, but so well worth the wait!"}
{"text":"Love Ari Sushi! I crave there Sushi rolls! If it was up to me... I would be here multiple times a week!"}
{"text":"We love this little place.  My favorite is the salmon lovers roll!  We've lived in the area for years and go here quite often.  I'd have to say, the service has had its ups and downs over the years, but the food has always been delicious.  I really don't care about about the attitude of the server- I'm not one to rate a place based on someone they hired -unless they're a jerk...  I'm here for the sushi and have never been disappointed.   The service has been very good for at least about a year now.  I wish they're happy hour menu had more to choose from or changed once in a while, but that won't stop us from coming here- still love it!"}
{"text":"Had a great meal here last night. No issues with slow service, although we were there for a fairly late dinner. Service was good and the food was yummy. We had the mixed tempura app, one other delicious one I can't remember, the Volcano, Mexican, and Vegas rolls plus the Deluxe Sashimi. Quality of the sashimi was good and I really liked the rolls. Who doesn't like cream cheese in their rolls? 

It seems to me like they were aware of prior reviews commenting on service. At one point we were double teamed by two waiters who could've communicated with each other a little better so we didn't have to answer the same question twice, but no biggie, they were just trying to make sure we were taken care of. 

My only complaint would be that the rolls were really big- definitely a two biter. It made the volcano a little difficult to eat, but delicious nonetheless. If we're up that way again, I'd definitely return."}
{"text":"The potstickers here are amazing! So is the edamame. A bit pricey but the quality is off the charts. The sushi is decent, definitely recommend the spicy California rolls. Crab can, at times, taste overly fishy but that's only happened twice in my experience. Without this, I would give 5 stars for sure. Overall, I love this place for when I'm craving Asian food. It always hits the spot"}
{"text":"This is definitely one of the best sushi places in town.  The food is great and the price is very reasonable.  The owner tries very hard to please customers. 

It is a small place, family environment.  But you have friendly waitresses and friend owner.  Worth a try."}
{"text":"I would highly recommend Ari's,  great sushi!  We eat  at the Cave Creek location several times a month and always are very pleased with the meal and the service.  Yesterday they had a sushi tasting party, and put out a beautiful display of new rolls.  It was a lot of fun and alot of new rolls will be added to their menu shortly. The Japanese Lasagana was to die for, still thinking about it along with a grip of other new rolls."}
{"text":"Pretty good.  This will be my go to sushi place when going downtown to harumi is just too far"}
{"text":"I love it here, the staff is so friendly and seem genuinely excited to see you. They have great bento boxes and lunch specials. The kid's meals are super cheap and a huge ammount of food. The restaurant is clean and the food is fresh. Plus, who doesn't like that guy at the intersection who waves and salutes everyone who passes by?"}
{"text":"Cave Creek's hidden gem. I love this place. Its very affordable and has great, fresh sushi. It's doesn't have all the flair the Electric Eel has (and Electric Eel is more expensive and in my opinion not as good) but it has better food. My only concern is that it always looks closed which may discourage potential customers from going. It's also in a small shopping center and very discreet. 

I was also impressed at how clean the place it is. My husband noticed the Sushi chefs washing their hands after preparing each roll. In this day and age that's impressive.

You gotta check this place out!"}
{"text":"Got early takeout for lunch - service was quick and polite.  The restaurant was very clean and they seem to be doing good business at lunchtime as there were 5-6 other groups of folks in at the same time.  Ordered sushi rolls (California, Philly, and Crunchy) and they were very well prepared and tasted great.  Would recommend this place to anyone nearby and based on the great lunch today am adding them to my list of places to try for dinner!"}
{"text":"Fresh and delish! A non-pretentios, casual, mom-and-pop shop, with prices to match, make this a place a gem. The prices are great for sushi and the fish is fresh, not to mention they offer fresh wasabi, and I recommend treating yourself to it. I agree the service can be painfully slow, so if we are in a hurry we order take-away. But even though the atmosphere is casual we don't mind lingering when we choose to eat in. I love supporting local eateries and this place deserves it."}
{"text":"Went to Ari sushi today and yelp did not let us down! Small and unassuming, this great sushi place had excellent deals on lunch specials as well as a lot of very unique rolls. The spicy garlic edamame was fantastic as well. Quick and attentive service, good prices and great sushi. We will definitely be back!"}
{"text":"I've tried this neighborhood place many times, and sometimes, I've even walked out before I ordered.  The service was so unreliable. But I am back and happy due to one of the best service experiences I've had anywhere. Katie welcomed us with this huge smile and it was all uphill from there. Our order was taken promptly, our drinks and food came at the correct pace (and it was delicious), and we had a great dinner. Looks like this spot has made big improvements and I highly recommend it for both sushi and cooked meals. Thank you!"}
{"text":"Below average.  Went in for lunch.  I ordered the sashimi salad.  It was a few pieces of sashimi slapped on a bed of romaine lettuce (the kind that you get in a bag at the grocery store) and drizzled in some spicy sauce.  Totally uninspired.  Then I ordered the salmon eggs and mackerel sushi.  The salmon eggs were OK but the mackerel was awful.  How can a place like this stay in business?  I'm never coming back."}
{"text":"I went to this restaurant for dinner, not expecting a whole lot from reading the reviews. The sushi was pricey than I thought and the taste was just OK. The Salmon sushi was lined up with lemon slices for decoration and that made it taste bitter, only one sushi plate contained wasabi and gari (did they forget to add it to the other sushi plates, strange). The noodles were strange tasting the chicken was 1/4 that in a MD sandwich, the kids didn't eat (Might have to swing by Panda Express). The server seemed allright but the wait was long with very few customers."}
{"text":"I got 2 sushi rolls and they were great! It had great flavor and they were both well proportioned. My friend got their teriyaki beef bowl and that was great. I'm not giving it a 5 star because I've had better sushi and the eel sauce was a little sweet for my taste. But it was still really great! Totally recommend!!!"}
{"text":"My husband and I love this little place. Sushi is so fresh.  It is in a strip and is not fancy- but the food far outweighs any \"fancy\" or trendy sushi restaurant.  Prices are great!"}
{"text":"Wow, wish I lived closer to this place or they had one in Surprise. The sushi was fresh and left us wishing we had more room in our stomachs. We had Salmon sashimi and three roles; Philly, Spicy Tuna, and Unagi. If the food wasn't enough our server Mia was outstanding... Super Friendly and on spot with her service. Mia - we will take your recommendation and go to Seoul in April!"}
{"text":"Great service, nice upbeat feel. Everything was perfect. Total go to spot for sushi in the north side of Phoenix. The menu selection is great with fair prices and options for those who like something cooked."}
{"text":"3.5 stars.  4 stars for the sushi, but downgraded to 3.5 because this place is stupid expensive.  I have had a lot of sushi better than this for half the price.  But, the sushi itself IS quite good.  Too many sushi menu items with fake crab in it, but there are enough without that to work around it."}
{"text":"Wow, what a surprise! We just got back from Hawaii and I was still Jones'n in for some sushi. This was not too far a drive from our house... The owners were there and they are lovely. Our sushi chef was Josh and he totally knocked it out of the park! Everything we tried tonight was superior! Our favorite was the sushi wrapped with cucumber... so light and fresh and tasty!  Nice to have found a great little sushi gem so close to home!"}
{"text":"My fiancé chris and I had a amazing dinner!! Not only was the food so fresh, the service was amazing. Sitting at the sushi bar was a wonderful experience thanks to JJ the chef. We will be regulars at this amazing new find in cavecreek.. I'm very picking when it comes to sushi and I tried everything!!!! Loved it all!!!"}
{"text":"Decided to check this spot out after such great reviews.  So glad I did!  Sushi was yummy but the show stopper was the Udon soup!  Honestly the best soup I've had since moving to Arizona!  It's a hearty soup full of deliciousness!  Wish I had taken a photo but it had just the right amount of toasted sesame seeds garnished on the top.  Perfect bowl of soup to warm the heart (literally).  Will definitely be going back and extra points for being so close to home!"}
{"text":"Had a wonderful meal. I sat at the bar and JJ the sushi chef just was amazing. I told him what I liked and he just made me special rolls. I will most definitely be back"}
{"text":"Ethan- I beg to differ. This place is AMAZING! I have never had sushi before, and was really hesitant about trying it. We sat at the bar and ordered \"The Godfather\" (not on the menu, just ask the cooks), it was truly amazing! Also the Garlic Tuna was even better! This place has completely changed my perspective on sushi, I HIGHLY recommend this place to anyone!"}
{"text":"Very good rolls, kids love the bento boxes. We go all the time.   Recommend."}
{"text":"Absolutely fantastic food !! Really impressed !!! Tons of sushi choices !!! Love it !!"}
{"text":"When we walked in no one greeted us, we kind of sat ourselves by the bar, it took another 7 minutes for the waiter to aknowledge us, another 10 minures to order drinks but the sushi was served fast. Half of the waiters don't speak english but are friendly. Sushi is a little expensive, one of the yellow tail salads was $20 bucks (not worth it). Overall wasnt too bad, something new to try."}
{"text":"I go to Ari Sushi whenever I can. Good rolls, great price for the area (so close to scottsdale..) I just love pretty much everything about the atmosphere and feel of the place too. Nice for people who want a feel of a family sushi place. They actually place Japanese music too."}
{"text":"Awesome happy hour. Great staff. Always ready to serve and make your food delicious. Sushi always fresh, never any strange tastes. Spot on and great miso soup!"}
{"text":"We've always loved the sushi here, but the service has taken a giant leap forward. Super friendly, fast, and fun. Looking forward to more sale bombers in 2017. Great restaurant to have in the community. Squid salad is great, soft shell crab, seven sensations."}
{"text":"They Advertise to have Reverse Happy Hour on Friday 8:00pm - Close. On the Web site & on the menu. They said no on a refund of $ 16 dollars. They said the web site need to be update weeks ago.   They loss a customer over their mistake. Not good Business !!"}
{"text":"The sushi was good but the service was just ok. Don't order the roll in the cucumber unless you want all cucumber, there was barely any fish in it."}
{"text":"I love their tonkatsu and sushi rolls. I am not big fan of sushi but this place is amazing. I was told that they make their own  shrimp tempera  as soon as customer ordered the food which is very fresh and size of shrimp is pretty big compare to other japanese restaurant. I worked at japanese restaurant in my college years but what i remember is most of japanese restaurant uses pre-made tempera. And i do feel ari japanese is alot clean compare to many other place. I don't dine out much because i am very picky about cleanness and what restaurant uses to prepare food but i feel i can trust this place for dine out. I will definitely return whenever i feel like having some more sushi and rolls. So far, ari is my number one favorite japanese restaurant. Thank you ari!"}
{"text":"I have been to Ari multiple times. I've taken my friends, my mom and my sons. The service is very friendly and the sushi is really fresh. If you cannot find something you like on this menu, you need to go to McDonalds. Even better, sit at the bar and just ask the chef for his recommendations."}
{"text":"So far this is our favorite sushi spot in the north Phoenix/Cave Creek area. Great quality food and great staff!"}
{"text":"I had some time to kill with my daughter until I had to pick up my son from basketball practice.  It was around dinner time so we thought we would give this place a try.  After putting in a long day at work, I was pretty exhausted, getting out of making dinner sounded pretty good to me at the time.  We walked in and it seemed pretty cute.  Nothing fancy, but I didn't need fancy.  The waitress who greeted us was emotionless at best, no smile, no enthusiasm and didn't really seem to care if we were there or not.  
We ordered a sushi roll for me and a teriyaki kid's meal for my daughter.  The emotionless waitress took our order and left.  When she came back to take the order of another couple that wandered in and sat next to us, I asked to add an additional kid's meal to go.  So I could have dinner for my son when I picked him up and didn't have to stop somewhere else.  Well although that sounded like a REASONABLE request, the waitress said, \"No, we don't do that.\" and walked off.  I was speechless.  \"No\"?  I could not order a kids meal to go?  SERIOUSLY?  When she came back with our food and I asked to speak with the manager because I thought she was being ridiculous.  She said, in a very snippy tone, \"I am the owner's daughter and it is not our policy.\"  Hmmmm?  A policy on kid's meals?  I said, \"What difference does it make if I order it for here or to go?\"  I told her that I was a frequent YELPER and this was my first time at the restaurant, thinking she would want a good review and want me to come back.  HOWEVER, that didn't seem to affect her in any way.  I asked where it stated the policy on no kid's meals to go?  She could not answer and begrudgingly said she would do it, \"This ONE time\".  Darn right ONE time, because I will NEVER go back there.  Too bad, it could have been a regular stop for us!  What a strange policy?  I honestly don't know why I just didn't walk out.  I wrote on her receipt to look for my YELP review.  Maybe her parents should know how she is treating guests.  Never again!  A definite DNR........................."}
{"text":"Katie,  Katie, Katie ....seriously the coolest server ever!  I think we come here because she's just the kind of person who makes you feel very welcome.   See you soon Katie...btw, sushi is great too!"}
{"text":"I love this sushi place. I wish the happy hour was longer but the food was great! Loved the Mexican Roll and Dragon Roll."}
{"text":"I love love love me some raw fish but have been hesitant to try things in the North Valley.  I don't know why.  Maybe it's that extra 15 minutes from the airport?  

Anyhow, great experience here last week.  Service was efficient although not overly friendly.  The miso soup was very good.  You can't beat the lunch special - 3 rolls for $13.  The downside is that there are only about 8 rolls to choose from and there are so many interesting looking rolls that aren't included in the special.  

We did get the salmon sake sashimi and it was out of this world.  How I would eat to have a plate of that all to myself.  

Will definitely be back."}
{"text":"This is the fourth sushi ace we've tried since moving to town and I think the search is over!  We ordered 6 rolls and loved 5 of them and the sixth wasn't bad :)."}
{"text":"Quick update: Electric Eel went out of business. Not sure if it was Ari's that did it but I am sure it might have contributed to its demise. While I like to see competition because it *might* keep prices in check; the closing of EE did not affect Ari's prices. I was there 3 weeks ago and my opinion has not changed."}
{"text":"This is the third time we have visited ARI Sushi I the past 3-weeks and it is amazing. My husband loves their spicy sushi rolls and I've tried the Udon Noodles and they were fantastic! Great food, great atmosphere, and awesome customer service!"}
{"text":"Very solid, quality, delicious food. I have seen this place a thousand times and never tried it, I don't know why. It's actually quite good, and very reasonably priced. Service was great!"}
{"text":"We love us some Ari! The food is always really good and the service is as well. Love the Cave Creek Roll!"}
{"text":"I hope you like Krab Mix on everything.  All our rolls mostly tasted the same because of the generous addition of krab mix in each roll. I also ordered Ikura(salmon eggs) and sea urchin, which normally come out first everywhere else because it's relatively easy and fast to prepare.  After both our rolls, chicken katsu, and yellowtail came out, still no ikura and urchin. The waitress finally checked on us 20 minutes after we ate everything else to see if we needed anything else, not realizing we were still missing items.  While she was quick to bring them out, they were mostly frozen and I had to send them back.  We went out to celebrate my promotion at work, and I have to say the whole thing was a disappointment, especially for paying average prices for below average food.  I'll drive a little farther out of my way for somewhere else."}
{"text":"Frozen vegetables and awful chicken.  My experience was worse than panda express.  Japan is sad for this restaurant"}
{"text":"Hands down best sushi in town 
We've been to restaurants all over the valley 
I think we've found our home"}
{"text":"Went here for dinner with my wife and 6 year old son. 
As usual, top level service accompanied by top level sushi! There is no better place to have sushi and sashimi on Arizona!!"}
{"text":"My wife and I have tried many sushi restaurants in the Phoenix/Scottsdale area and have had some very good and not so good sushi. Ari Sushi is in our opinion one of the better restaurants we've eaten at. 

The food is good and always consistent and the prices reasonable. I read comments about slow service but if everyone would just relax and enjoy they would realize the service isn't slow at all but just right. Its to bad so many want to order and eat as fast as they can and be gone miss the relaxation of eating sushi at a place like Ari."}
{"text":"One of my favorites! We go here almost once a week. Everyone is so friendly and it seems like they enjoy getting to know their customers. I love the Spicy Garlic Tuna, the Risa Risa, and the Where Is Sue. The garlic edamame is so good. We have never left here disappointed and enjoy coming here as often as possible."}
{"text":"I love going to Ari Sushi! They have great service, everyone is very friendly and the food is fantastic!  Ari is more of a local neighborhood sushi bar which is part of why it is so great! Try it out sometime!  I highly suggest the hot night roll, the kiss my ass roll and monkey brains...yum!"}
{"text":"After driving by this place numerous times, hubby and I decided to try it. It is a jewel of a sushi bar, unpretentious, and good sushi. We loved the toro, kiss my ass, finding nemo, cave creek, and fresh, raw wasabi. The place was packed (Friday night). Didn't have to wait long and the service was good. I love the fact that it is a neighborhood place, and it usually doesn't look open. I'm glad I went in."}
{"text":"This is a wonderful restaurant... one of the Cave Creek area gems. The food is high quality, the service excellent. The lunch specials are fantastic! My husband and I have been eating here since they opened and love it. I would rate it 5 stars were it not for the restaurant's ambience. It's very dark, and there was little thought put into the decor. I hope one day they will improve on appearances. If so they might not be able to get rid of me :-)."}
{"text":"Service is bad. Waiting forever. One server for the whole restaurant on a Saturday night."}
{"text":"Little did I know that there was amazing sushi in the desert!  Spicy garlic edamame alone is worth coming for.  Bluefin tu a is amazing.  Friendly stuff with great service."}
{"text":"Upon first arriving, I was a little discouraged because their hours were clearly posted but they weren't open.  After creepin' through the windows someone caught my attention and as I started to walk away they opened and invited us in.

The crab stuffed mushrooms were a great start for an appetizer and wow was the shrimp tempura roll.  It's served with a tempura sauce that when combined with a little bit of wasabi and soy seemed to taste like a pretty damn good combination.

The green tea was legit... Very green."}
{"text":"This little mom and pop sushi bar is just the kind of place that needs local support. I love this place. It is just the way I envision traditional Japanese sushi bars to be. No glitz, no hip coolness,  just a comfortable family run neighborhood place to get a great meal in a friendly atmosphere. The food is fresh and very tasty. They have a sushi roll for each state in the country!! Their fried rice is super tasty, very comfort foodish. Service could be a little better but all in all I think this is a great little place!"}
{"text":"You get the feeling its a family run business so you kinda root for them to make it and they HAVE outlasted Ten Sushi which was super upscale and whatever the Electric Eel was before. Yes, the owner is that weird guy who twirls the sign on the wrong corner! LOL. Its not fancy. The service is friendly but not great. The food on the 2 occassions we have been there HAS been great! Pleasantly surprised!"}
{"text":"I've waited a couple of weeks to post this review so I can be more objective. However, my displeasure is unabated. My birthday dinner at Ari was the worst experience I have EVER had in a restaurant. My wife and I dine out 4 or 5 nights a week at places that run the gamut from Capital Grille (our favorite) to Summit Diner. There were 6 of us and when we arrived at 6:00 there were 4 other people (at 2 tables) in the restaurant. We promptly ordered beverages (beer and wine) and 2 appetizers. The appetizers were a little slow in arriving, but nothing serious. We placed our order for main dishes and the order included 3 large plates of sushi and 3 Bento boxes. At this point I noted the time (6:20) because we were seated at a table nearest the kitchen and I got the feeling there was some confusion going on. Twenty minutes later the sushi dishes showed up and no Bento boxes - our waitress seemed to be confused and I think it was a language barrier. Another twenty minutes went by and still no Bento boxes and our waitress was doing everything she could to avoid us. After numerous complaints and a request for the check the Bento boxes showed up (45 minutes after placing the order) and the terrijaki chicken was ice cold. I asked for the check and a \"to go\" box so I could take the chicken home to the dog. I paid the check and as we were leaving a man walked in who I presumed (correctly it turned out) was the owner. I tried to engage him in a mild-mannered conversation about our experience and he would have none of it. His response was to flail his arms at us and yell over and over \"very busy-very busy-very busy\" Things got ugly in a hurry when he knocked the \"to go\" box out of my wife's hand onto the floor. My clear-headed son saw where the situation was headed and he hustled me out the door. And, to think this was a birthday dinner with my family.  VERY, VERY BAD !!!!!!"}
{"text":"Stopped in for an appetizer while we were in town, we ordered the \"hello peno\" which is a deep fried jalapeño with crab,spicy tuna, and cream cheese. It was absolutely phenomenal. They have a great happy hour also as well as a friendly staff. Would certainly return"}
{"text":"I travel 150 nights per year.  Also, I have visited 42 states in the last year and eaten at sushi restaurants in all of them.  The good:  the service was friendly and the restaurant was clean.  The bad:  the prices were relative high and the sashimi portions were quite small.  There are better sushi options within 10 miles of this restaurant."}
{"text":"Last two visits, very poor, rude service.  Very disappointing.  I will not be back for a long time, need to get the bad taste out of my mouth."}
{"text":"The food here is REALLY GOOD!  I highly recommend the Spicy Ramen!  Sushi is very clean and served in ample portions, probably a little more than elsewhere.

The only reason I gave them 2 stars and not more is because of the heinously S-L-O-W Service.  Time to be seated, time to get drinks, time to place food order, time to get food, and time to get check - all waaaay too long.  A quick bite to eat takes all night.  Great if you want to kick back and suck down some sake while you chill, but not if you wanted to get home and get to bed on time.

I'm not sure what the time delay is - they seem adequately staffed.  You'd think they could make more money by getting customers in and out faster."}
{"text":"Great little family run sushi place and the only one in Cave Creek. Everyone who works here is super friendly and always smiling. Ari, the owner, is there every night. Treasure Island roll is my fav! But honestly I haven't ordered anything I don't like and I'm here a few times a month. My only complaint is they've gotten busier and only have one server and one sushi chef so it can take quite a while to get anything.  But they're trying and that's what counts!"}
{"text":"Ethan, If you cannot find anything appetizing on this menu than you don't like Japanese food. To order fried rice and say the food is no good is missing the point of this place. The raw fish is fantastic. My wife and I ordered the Chirashi, a bowl of rice topped with numerous types of raw fresh fish and pickled vegetables. Yummy!!!  miso soup and cucumber salad all first rate. On the daily menu were 4 types of live fish. Can't wait to go back. Cave Creek is not the place to look for Japanese food until now, so I hope they can make a go of it."}
{"text":"This is an unassuming sushi restaurant with a surprising charisma that will keep you coming back. As soon as you walk in, the sushi chef will yell something in a welcoming tone, and the hostess will come and seat you. She is super friendly and will make sure everything for you is good. I ordered off of the happy hour menu and was super excited to get a Kirin 22oz for $6. Pretty dang good deal.

My favorite thing about this place is that a number of people walked in that were clearly regulars, and the hostess had all of their orders memorized. She even remembered that one gentleman had some issues with shrimp when she was recommending him to try something else!

The restaurant itself isn't huge but make sure to dine in. Just don't sit at the bar if you get there between 5 and 6pm, because the sun shines directly on the bar when the door is opened and can be blinding."}
{"text":"I have been here twice and I thought it was over priced and both times the food was not good at all."}
{"text":"Ari Sushi is very good. try there cave creek roll it  is great! there miso soup has the best flavor around! the service is a little slow but well worth it if your not in a hurry."}
{"text":"Live nearby, first time visiting and it was so good! Garlic tuna roll, gyoza and caterpillar roll is what we ordered and all 3 were amazing. Highly recommend!"}
{"text":"Like some others have said, unless you have all night to spend, don't go here. The service is quite slow. The food, on the other hand, was pretty good. I would have given them 4 stars were it not for the slow as molasses service. I wish restaurants would read these reviews so that they could improve themselves and make the customer experience better."}
{"text":"Closest Sushi spot to us. Katie did a great job making us feel welcomed. We felt the salmon was sliced too thin. It was falling apart as we picked it up with our chop sticks. There was a female chef there. Not sure if the male chefs slice more generously? The roll was good as well as the miso. I think we will return if we want to stay close."}
{"text":"We ate at Ari Sushi recently. I see that friendly-looking fellow at Tatum and Cave Creek Rd. a lot and wanted to patronize his place. It's in a strip mall and has a neighborhood kind of vibe. The service was good, clean and casual dining area. The fish seemed very fresh and the maki was delightful with good (not mushy) rice. Prices were very reasonable. This is at least as good as Toyama and closer to home! I really can't fault them. We'll definitely return!"}
{"text":"This is a fave local place of ours.  Sit at the counter and get faster service.  We love the deep fried calamari; it is light and airy, not greasy at all.  Another appetizer is the Gyoza which my husband devours.  We typically order the Chef Special and find that excellent.  The fish is always fresh.  The staff is very pleasant.  Don't go Sunday, they are closed."}
{"text":"A generous 3 stars for Ari Sushi from some serious sushi fans. The service is perfect and warm and happy. The Udon is also a solid 4 but the sushi is average quality. Good. Just not THE BEST we have ever had. Red snapper was the highlight and best cuts we had. No hard feelings 5 star givers, but this just wasn't in our 5 star range. Cute, sweet and A-Ok!"}
{"text":"When I first looked at the menu, there are all \"Krab\" with the \"K\". I was a little worried about the quality of the sushi. But then I was impressed with the presentation, the generous portion and at last the deliciousness. We ordered 5 rolls: Montana, north Carolina, Oregon, Washington and Cave Creek roll. They are all very good. We went there early on Saturday at about 6:00pm to avoid the crowd.  The service was good. The waiter was handsome:). I am coming back for more."}
{"text":"This place is just ok at best. Extremely expensive for the quality. For the prices I also would have expected a better ambiance. We ordered take out and it came to $70 and took over 30 mins to get our order. The fresh rolls were made before the baked rolls so the sauces ended up getting completely soaked into the rice and made it really salty. The Dynamite roll was good but unlike anything I have ever had before. Didn't taste at all like sushi but more like a Mexican casserole."}
{"text":"Went here for the first time after living less than a mile away for 6 months.  Made the mistake of being starving and wanting a quick meal and then coming to eat at 630PM.  

We ordered two kids' meals and 5 rolls along with edamame.  They are understaffed and it took quite a while for someone to take our order.  The main server, who I assume is the owner, was running around (literally) trying to help as many people as she could.  Service was slow and we were hungry, so a little frustrating.

Food quality was good.  One of the rolls I had was drenched in Gochujang, a Korean spicy sauce.  I'm familiar with it but surprised because it is pretty spicy and may not be great for the typical Cave Creek palate.  The kids meals were on the small side.  Usually we determine if our 5 and 7 year old can share a kids meal or need one of their own by what the kids' meals age limit is.  We assume that if its up to 12, our kids can share it.  We ordered one for the kids to share and definitely was not enough food and they tapped into MY sushi rolls! GRRR =)

They do have a HAPPY HOUR, I think from 430-6.  I may go check that out soon.  The prices are not as competitive as Stingray, but now that Stingray at the Quarter is closed, may have to do, and is WAY closer to our house.  

All in all, we are fans of supporting local business.  I am biased and also like to see Korean small business owners doing well.  Definitely worth trying out, good quality food, just don't go expecting a quick meal.  (Also closed on Sunday.)"}
{"text":"First time here and had sushi and ramen noodles soup. The sushi was fresh and delicious just the way I like.

The ramen noodles soup for somehow wasn't great, it was just OK. I think it's need more seasoning to get the kick of it.

Service was good and overall we were happy.
Thank you!"}
{"text":"This place is a hidden half-gem. Not amazing but still worthy of five stars for its friendly staff, family atmosphere and fresh fish. Happy hour rocks too."}
{"text":"Really great sushi, friendly staff and nice cold beer.  The television is always playing something innapropriate for the place, and loudly which is a big distraction to the guests. It is terribly expensive and the atmosphere is very plain.  Still, the food and service is very good and this is the only good sushi place in the area."}
{"text":"great food, good service. as far as sushi goes, this is about as authentic as you get! I appreciate the usual and creative offerings they provide along with fresh, house-made wasabi. ambience is a little off- nothing special or spectacular, but the food truly does make up for lack of environment. check this no-frills place out for a change of pace from your usual spot. Get the garlic tuna roll- you won't regret it!!"}
{"text":"Well,our foursome checked the website and found they had reverse Happy Hour for food and drinks M-F 8:00-10:00 PM. We were told when we got there that they would not honor HH pricing on the website as local menu had M-Th listed. First, to accomodate us, they offered 1/2 off of drinks then added to the food after a little further discussion that we were Yelp devotees. That cleared up, we had some great sushi albeit still a little pricey. Management came through but \"heads up.\""}
{"text":"Love this place one of my all time cool and chill places to get a great meal with some great chef specialities."}
{"text":"My family and I eat dinner here almost every Wednesday, we love this restaurant! Try the Tuna Naruto as a starter!"}
{"text":"First time here and so impressed.  An excellent choice when in Far North Scottsdale- Cave Creek.  See attached photos of the Seven Sensations and the Dynamite Roll!  My favorite was the Cave Creek Roll. EXCELLENT!  So glad we took time to try Ari!  Simple decor but very clean. Try it!"}
{"text":"Love Ari! Delicious rolls and kitchen food. Service is pretty good and can usually get a seat right away. Love their lunch special you get a lot of food your a reasonable price. Closed on Sundays."}
{"text":"Just about the best sushi in north Phoenix. Staff is always prompt and friendly, atmosphere is warm and inviting an best of all the sushi is great. Never had a bad dinner or lunch here. Highly recommended."}
{"text":"Went for lunch last weekend...the philly roll and tuna roll were good but not great....server didn't talk much...cooks were very good...OK but will try other sushi places next time I'm in PHX"}
{"text":"I was skeptical about this place but I gave it a try one night my girlfriend was out of town. I sat at the sushi bar and was very impressed with the atmosphere (casual and relaxed). The sushi chef and waitress were very pleasant. I ordered some sashimi and a salmon Kama, I eat a lot of sushi and this is a great spot to go for good sushi and a relaxed atmosphere. That's how I like it when I decide on a sushi spot, all the glitz and glam places are for the birds just give me some good fresh fish and let me enjoy that! I will eat here again and again."}
{"text":"Real great taste comes from ingredient i.e. matrrials what they use not from the only seasoning. They use bigger shrimp, prime quality of fish and best mayonneice. Even the eel sauce they use is home- made one they  boil with plenty of real eel. 
Their target is greater sales rather than cost reduction. Good quality, enough quantity and kind service are their main tactics. Prices are average ones        prevailing over the city. Why shall we look for other place to enjoy  sushi ."}
{"text":"Favorite sushi restaurant by far! Fresh and creative rolls. Great customer service. My family, boyfriend and I have been coming here for years. We love our local sushi spot."}
{"text":"I would give this place six stars if the would let me! Greeted and seated right away when we came in. The waitress promptly came and got our drink order. 
Drinks and food both came out quickly and the food was very good!
Fun spot and very personal!"}
{"text":"Service good  3 (-_- could be better. But sushi was the best so far in Arizona. 5 (-_-)...
very tasty and the portions size was worth the price."}
{"text":"ANY place that has my name in it's name is awesome.

We've been hearing about this place for months.  Reading the Yelp reviews and seeing the sheer volume of positive reviews was making me doubt the just how accurate it could be. Well, we finally had the opportunity to visit tonight.

I had reservations, fortunately.  For a Wednesday night, there were already people lined up to get a seat.  We got seated right away.

Yes.. get reservations!

I'm not going to be verbose and echo what others have said here.  But, this is not a stretch to say this is the finest sushi in Happy Valley.   The other preparers are good, but.. its noticeably less than the food prepared by the owner's hand.

Let's just say sitting at a table here  is like sitting a the owner's sushi bar.  Its.. amazing.  Just absolutely amazing! 

We tried some staples:  tuna, salmon, yellowtail. All fresh and prepared beautifully.  My seeing eye dog got the chirashi deluxe bowl and we could only STARE at its beauty awhile before digging in!

I realize a great metric to judge the freshness of fish and the skill of the preparer is to try Uni (Sea Urchin).  I've had numerous bad experiences trying Uni in the past, though I was talked into trying a piece of Uni sashimi tonight.  Oh my GOD!  Its texture, subtle flavor and freshness was wholly unexpected.  I would say this is a MUST try for anyone visiting.  It really lauds the quality of fish here!

We tried a shiso-plum roll.  Delicious!

Already wrote more than I intended, but I'm going to close and say that the overwhelming positive reviews on Yelp are not exaggerations or \"hive mind\" agreement.  This is as GOOD as it gets!"}
{"text":"We LOVE Ari Sushi! We do date nights here and also get take out. Always fast, friendly service and great food!"}
{"text":"After eating there at least monthly for the last year, Tokyo Lobby is a distant memory. We have a new item every time we order and we've still barely made a dent in the impressive menu!

The place isn't fancy, but who cares? It is clear that it's a family business who has no aspirations to becoming a nationwide chain. And that's fine by me.

The waitress is very friendly: greeting me by name when I walk through the door, remembering my orders (even when I forgot to get my usual garlic tuna roll), and giving me small treats as I wait for my takeout. The owners are similarly pleasant, so i imagine that it's part of their customer service culture.

I recommend Ari Sushi to everyone I know that lives near the area and they all have loved it as well. The place has gotten busier, which results in longer wait times at the peak. But it's the price you have to pay to make sure that it stays in business."}
{"text":"Lots of really good rolls! Volcano had to be ordered for a second round it was that good. Red dragon, TNT, playboy, happy day all were really. Our server couldn't pronounce gyoza or mochi. Strange.  A little pricey for a small strip mall place, but really good fish."}
{"text":"Ate here the other night before closing and honestly was some of the best sushi we have had! Service was amazing and the sushi chefs were awesome at exchanging items for stuff we didn't like haha we had the baked lasagna roll, Las Vegas roll and some tuna it was all amazing and fresh we will definitely be back!"}
{"text":"I would like to give this place more stars for the food (which we have to admit was tasty), but because of the rest of the experience it doesn't even warrant the one star. Took about an hour and a half to get our food, to which the waitress would just shake her head and disappear whenever we asked about timing. We were only sharing the restaurant with about two other smaller groups. We were a party of 6 and the food came out spaced 20-30 minutes apart so food would get cold while waiting for others to eat. When we spoke to the owner he was extremely rude and told us that we weren't eating at a fast food joint, that the food takes over an hour to make, and if we wanted quick food we should have gone to Panda Express. The service was terrible at every stage of the meal and really made for an upsetting experience for all. We are typically patient and understanding with but cannot support a restaurant run by such rude and unfriendly people."}
{"text":"I think they're awesome!  I love the traditional, intimate atmosphere of this restaurant compared to those new, quasi-sports/sushi places.  They usually have coupons in redplum.  I wish I saw the Ari Sushi guy on the road with the \"Ari Sushi loves you\" sign.  I miss you Ari Sushi guy..."}
{"text":"Good food.  Lots of sushi rolls to choose from. Sashimi is fresh.  However, service can be sporadic.  Entrees do not come out together.   It appears that when we were there, they were short staffed.  Great neighborhood gem in the Tatum Ranch area."}
{"text":"Great family run restaurant.  Best sushi I've had in Phoenix.  You will be welcomed and served with a smile.  Classic and the more unique type sushi rolls await you if you make the drive.  It's worth it."}
{"text":"Not a fancy looking place but a great sushi restaurant. Staff is amazingly friendly and always greets you with a smile. Kevin the sushi chef is as professional as they come and Mia makes you feel welcome and well taking care of. The fish is always fresh and price is absolutely fair. I can highly recommend you to stop in and enjoy! I'll be back again and again!"}
{"text":"Dude, this place is beyond bad.  It replaced another sushi place called Katana Sushi that wasn't open long enough for us to try it.  We dropped in for lunch the other day and had the place to ourselves, literally. 
My wife ordered a very simple roll with tuna, cream cheese and cucumber and I ordered what I thought was beef fried rice (primarily because nothing else on the menu looked appetizing).  Her roll came out resembling nothing akin to tuna and after one bite she refused to touch it saying it tasted \"off\".  My \"beef fried rice\" reminded me of something my mom would have tried to pass off to me as \"chinese food\" when I was 10.  It was like rice and odd beef chunks stewed in ketchup and soy sauce.  I'm serious.  Oh, and a bug crawled out of my salad.  
A few days ago I passed a guy standing on Cave Creek Rd NORTH of Tatum holding a sign that simply read \"Ari Sushi\", no arrow, no address.  He was holding it up for drivers that were a block past his restaurant already.  Not sure what institution these folks escaped from but I'd steer clear."}
