{"text":"Visited Aria a week ago Friday for a corporate dinner with several of our sales reps and 7 of our vendor partners from the US.  Our Marketing coordinator had set up the dinner in advance for us.  This is a renovated establishment in North Brampton but definitely had the feel of a restaurant that you could find in Yorkville.  We had a pre fixe menu that gave us a nice spread of options.  I opted for the baked brie appetizer, filet mignon entrée and raspberry crème brulee for dessert.

Everyone loved the options selected and sampled a bit of everything because it all looked so appetizing.  I was very impressed with all the offerings.  It really bodes well when your clients from out of town has nothing but compliments for the restaurant selection.   The staff at Aria was absolutely amazing.  Very friendly and knew everything about the menu.  The owner also did more than just walk by to ask if everything was fine. Towards the end of the night, he took the time to sit with us and talk to us about his new restaurant and ask us our thoughts about everything from the wine and food to the antique Royal Dalton china they had used for the coffee/tea service with personalized pastries to finish off the evening.  All in all it was a great experience.  Definitely worth a return visit!"}
{"text":"Simply awesome. Food a 5. Service a 5. Price for what you get 5. Our waiter was all round amazing. My daughter wants to come back just because of him. Meet the owners, absolutely precious. You must experience it for yourself, you will not be disappointed.  We will be back."}
{"text":"I wish I could rate this restaurant higher because the food was excellent and the restaurant was beautiful...but service was so SLOW!!!  Upon the arrival of our party, it took our server at least 15 min to get us menus, then another 15 min to even take our order, then at least 30 min to get our appetizers, another 10 min to clear those dishes, another 30 min to get our mains, followed by another 10-15 min to clear the table...  service was so slow I could not even consider dessert or coffee due to time constraints!  And to make matters worse, we were the only people in the restaurant.  

Definitely worth a try if you are not immediately hungry and willing to wait extended periods of time for the food."}
{"text":"This is definable a place to go when you have a lot of time for dinner. We went for a bday dinner for two but had plans after so we're on a bit of a time crunch so we may have spoiled the mood they try to set a bit. Luckily it wasn't too busy. 
The food was great, I guess it was just a bit pricy for what we got so that's why 4 stars instead of
5. The bread they start you with is awesome. They have their own house wine but we opted for another instead which was delicious. For starters had a Caesar salad which was big- a whole wedge I ended up wasting some- recommend sharing this instead. My husband had the escargot, it said it was really good. I had the shrimp linguine and it was awesome. The portion was big so I ended up taking it home. My husband had the lamb shank and that was amazing. We didn't have space for dessert. Our waiter was also really great and attentive. Would definitely return."}
{"text":"My then-bf took me here for our anniversary. 

The vibe in there was nice and cozy, though at first we felt a bit uncomfortable talking much as the other customers were quiet. Needless to say, the service and food was amazing! I still think about that bread and shrimp/scallop pasta I had. 

Our server knew what he was doing. He paid so much attention to detail it was amazing! He asked us what we were celebrating and so we told him it was our anni. Though we opted out of the dessert, he came out with the most delicious creme brûlée on the house. 

I might've been a bit biased as we came out of that place engaged hah! 
(But no, really, that place is a gem)"}
{"text":"AMAZING!!! 
We Love this place.  This is our go to place when we want a nice romantic dinner. 
A bit on the pricey side but atmosphere, food, service ambience make up for the price you pay. 
The server, manager and chef came out to us to check to ensure we were enjoying the meal, you really felt like they cared.  if you prefer a quiet romantic alone time, I am sure you can request it, we are a social couple, so it did not bother us."}
{"text":"Trying this fining dining restaurant for the first time in Brampton. A hidden treasure so needed in Brampton. We tried their Prix Fix Menu, has mussels, steak and chocolate mousse cake.  My kid has lobster with pasta. All the food we ordered were fantastic. The house bread...OMG!  Can't stop eating it.  If you are looking for a romantic night out, this is it!  The service was impeccable!  I am so impressed about this little find.  Will definitely be back. I didn't give a 5 star because I am not one to give perfect marks as perfection is rare.  Ariy - our server was absolutely awesome.  Honestly, it's hard to find genuine service like this. The restaurant should recognize this employee as a definite asset."}
{"text":"Wow! Really enjoyed our dinner...the home made bread was wonderful, the soup delicious, the baked Brie spectacular, and the filet mignon really delicious...

We chose the restaurant because our guest was vegan and they had some great vegan options on the menu...the bean cake and kale salad were very tasty...

For desert the fruit cup satisfied but the creme Brule was poetry

The house is lovely and the tables and chairs comfortable...we sat in a conservatory room and the setting was quite charming.

We will return!"}
{"text":"The service at Aria was impeccable. A lovely quiet atmosphere with exquisite decor. We ordered the mussels to start and they were plump and nicely done but the Thai curry broth had little flavour. My husband had the NY steak which was cooked to perfection. I had the seared scallops, they were very large and served with a good risotto. The scallops were not overdone but the outside sear was extreme to just short of being burnt, a bit disappointing but still good. Overall a very nice meal."}
{"text":"Had a great group dining experience here last night. The waiters were all extremely professional, attentive and helpful and the food was incredible. For hors d'ourves the pulled pork sliders with apple coleslaw are a must!! We had a set menu because of the group function and everyone seemed pretty happy with their choices. I had the seabass as my main and raspberry creme brûlée for dessert - I would rate both 4/5. As for the decor, it is quite lovely and the private dining area is great for groups of 30 or less. They have a fireplace in the private room as well as an 80\" tv which was perfect for projecting our presentation from. Overall a very nice experience and I would definitely recommend."}
{"text":"I host large group dinners here, and it's always great! They're a fine dinning atmosphere, although we usually get one of the private rooms on the second floor. The food is always delivered and cooked to perfection. There's a reason why we keep coming back for our group dinners. The staff are always a great help, and provide great accommodations. Where we provide a wellness talk during our dinners, they have a TV available in the private rooms to deliver our presentation. I'd definitely recommend for any small business events, or for that special date."}
{"text":"Im not one to usually dine at fine dining restaurants I have been told by friends that Aria is one of Bramptons best restaurants.  Finally after many years I was invited to a function at Aria so there is the perfect chance to give it a try.  From the outside it looks like a fancy old house with a huge parking lot.  There is a nice sized patio which was closed cause of weather. Upon entering the doors we were greeted instantly.  The restaurant was very fancy.  We had a private room upstairs.  Upstairs was a hidden gem.  Quiet, very personal and perfect for parties and if you want privacy.  We were a group so everyone ordered different things.  We have a few picky eaters and Aria was able to fit their picky needs.  If your vegetarian/vegan no worries there are lots of menu selections for you.  Once you sit at your table they bring you fresh baked bread, hot and fresh out of the oven.  We all ordered different things and no one had a complaint other than a few of us thought the portions were a bit small.  Then again that's fine dining.  All food was full of flavors and cooked to perfection.  Please be warned that its not cheap but you will know what you are paying for when you see the quality of the food."}
{"text":"Great place! Michael and his staff are exceptional, not only is the food amazing, Michael's taste in wine is fantastic and it reflects in the wine list. I've eaten at Aria numerous times and even had them host my companies christmas work party. Can't wait to eat there again!
Dorian Childs"}
{"text":"Dinner: We had a party of 9 and every single dish came out looking and tasting beautiful. The restaurant is quite nice and fancy also they have private rooms upstairs (which is where we dined). They were very accommodating of all our special requests before and during our dinner. Service was top notch and our server was always nearby or standing by the door ready if we needed anything. The waiters really know their stuff when it comes to the menu so if you have an allergy or food preference they know whether your dish has it or not. Also good to note that the menu has vegan options in every category which is awesome. We ordered the following: Risotto (mushroom), filet mignon, calamari, seafood and non seafood pastas, caprese salad, and lamb amongst other things. All of them absolutely delicious, no one at the table had any complaints. The tiramisu looked like the best thing I'd ever seen but was quite on the strong/bitter side. Side note which I loved was that in the ladies bathroom they have any necessities you might need like mouthwash, tissue, deodorant, hairspray etc. One down side is they charge pop/iced tea per glass so if you're feeling thirsty or wasteful then prepare to pay extra (and the glasses are not that big) or maybe opt for less or no ice. Otherwise, they really strive to give you the best experience while being here and the servers were very friendly and service was excellent. Definitely will come back!"}
{"text":"We hosted our daughter's wedding at Aria Bistro last month and we could not have asked for a more perfect venue. From our first meeting, Jackie and Melanie were attentive and responsive to our questions and requests. The owner, Michael, was extremely reassuring and provided helpful suggestions to ensure the wedding reception was perfect. The wait staff were excellent, extremely professional and always polite. The food was amazing-passed horderves were plentiful and delicious and the main courses were excellent. We had 70 guests and many commented that it was the nicest wedding they had ever attended! Thank you very much to all the Aria Bistro Team!!"}
{"text":"I'm sad writing this review, as I really really wish I could've given it a higher rating. Sadly it was not meant to be. 

The good: Location, gorgeous ambiance, and fantastic service. The server was attentive and even though the kitchen was making mistakes, he tried to make the best of the situation. The gentleman took us around Aria, showcasing the history and all. It is truly a beautiful place. 

The meh: The beef soup had no salt or pepper in it. Some flavour yes, but I needed a bunch of salt just to make it palatable. The crab cake, while quite soft inside, crispy outside were too oily and too much salt. (The irony..I barely use any salt usually in my own cooking). 

The lobster penne not enough lobster at all, and too basic of flavour....Also it was a large size (more akin to a basic restaurant, not fine dining). It was more of what I'd get take out at a chain wannabe Chinese place making Italian food. Took two bites. Needed salt again. Disappointing. 

The steak. Yes it's a big one. 12 oz. But presentation people, c'mon. Fine Dining. It came on a king size pillow top mattress of mashed potatoes. I wasn't even given an option if I wanted something else. I'd asked for medium rare. It came out as Medium well. I didn't want to wait longer. At least the steak was still nice @ that temperature. Incorrect still. That's a big mistake. The beef au jus was too salty again. Lastly ruining a beautiful, delicious steak with a heap of cheese and mustard on the top. Why. That's sacrilege. What's up the weird cut of veggies in-between the steak and potatoes? Presentation classes needed. 

The waiter bless his heart, offered a dessert and cognac to make up for the steak. We asked for the creme brulee, which was quite quite nice. Nice thin crisp layer on top with a delicious centre. The cognac had a fruit fly in it (which I noticed after taking a sip or two)...I quietly grabbed the servers attention, who quickly went an grabbed me another glass apologizing. I did feel bad for him. But this isn't acceptable for a restaurant where I'm paying for and expecting fine dining. Sorry Aria, this time you just left a bad taste. Had it not been for the service you wouldn't have got the second star."}
{"text":"Food was good. The service was okay - more like 3.5 stars. The place is a bit tight since its an old house converted to a restaurant. Good wine list, but wish they had a corkage fee."}
{"text":"Probably a 3.5 with the disclaimer that I came here for a work dinner, so we had a large (30-ish) party in one of the private rooms upstairs. 

Our dinner started off with passed appetizers, which I'd rate \"ok\". In particular the meatballs were terribly dry and rubbery. An open bar with attentive service helped though..

Our group had a limited menu to pick from so I'm keeping that in mind because I'm sure there are more interesting/creative dishes available than what we had to pick from. My starter was a Caesar salad which was \"ok\" - it was unevenly dressed (the dressing was really thick and parts of the salad had none while other areas were all dressing). For a main, I went with the roasted chicken which was really, really good - crisp skin, moist meat and good seasoning. It's hard to make chicken for a group but Aria nailed it. Dessert was a vanilla cheesecake which was \"meh\" for me - nothing special but certainly not bad.

Our servers were really nice but probably could have used another pair of hands to keep drinks refilled and plates cleared. 

I think Aria is probably best for a party of 6 or less and I'd happily return to check them out in that context."}
{"text":"Please, please, please ... if you're a waiter, button up your shirt so that your big chest hairs aren't hanging out.  

Our waiter here had his shirt buttoned up only half way and a massive hairy chest was showing.  I completely lost my appetite and wanted to barf even before I was served.

Also, the waiter offered everyone at our table wine except for me.  I completely felt as though I was invisible.

I would never recommend this place and I will never return."}
{"text":"We have always been curious about this place. The outside looks very nice and the inside looks very intimate. The food selection is very nice. I tried on their summerlicious menu and overall have enjoyed everything. The food was a tad bit salty but is still enjoyable"}
