{"text":"Our first time here will not be our last super clean salad soup bar nice service great and food is great as well we had turkey and it's real not a roll mashed potatoes are real bottom line we will be back again and bring friends"}
{"text":"Located in a plaza on the edge of Brunswick and Strongsville, this diner serves up reasonably priced, well prepared diner fare. I had a standard two-egg breakfast that was not overly greasy, eggs prepared as ordered.    The service was good and like the previous poster points out it is a very clean place. There are a number of places along Pearl competing in this price range and fare but the one thing that stood out to me was the cleanliness and the eggs and potatoes were not overly greasy.   I would recommend for some good inexpensive eats - particularly breakfast."}
{"text":"Breakfast was slow to arrive ,toast never came no refill on coffee very disappointed one star is is a plus won't be back"}
{"text":"Very nice breakfast yesterday.  The staff was efficient, the food was served in a timely manner and the restaurant is as clean as you would expect from a veteran (which is to say it's spotless). We'll be going back to try the dinner menu as they offer a traditional favorite, the open faced sandwich."}
{"text":"This is a new restaurant. It opened Dec 1, 2017.   First thing upon entering I noticed how clean it was.   Our server was super nice and very helpful.   The soup and salad bar was fresh and delicious! Homemade soups - stuffed pepper and chic noodle today.   I ordered the chicken store fry and my husband ordered the bbq boneless chops. My stir fry was very good! The flavor was fantastic, but the chicken was a little dry. None of the vegetables were mushy!! The bbq chops were very good. Good bbq sauce - it was sweet and smoky. Fries were crispy and good! Both of our meals were specials so they came with soup/salad bar and dessert. For the included dessert the choice was ice cream or rice pudding. I got mint choc chip ice cream and my husband got rice pudding.   We are so happy to have found a new place near our house that is a Mom and Pop type place!!   They serve breakfast all day here!!"}
{"text":"Owner doesn't take responsibility for anything that's his or his staffs fault. He blames the customers! food was horrible, service was horrible. Worst restaurant I have ever been to."}
{"text":"First impression on the outside is that you could miss it even if you were looking for the place. Once on the inside though the place is very fresh and clean.   Our server was very nice and the food was good. I wish they would expand the breakfast menu a bit more for people who don't like eggs though."}
{"text":"We had a pleasant lunch - the salad bar is fresh and ample, the 2 soups were hot and tasty.  Our meals were satisfying, although unadorned canned corn as the only vegetable choice was underwhelming. Service was friendly and efficient. It's not fancy or trendy, but there is much to be said for simple, decent food at a reasonable price. We'll go for lunch again, and also soon try the incredibly inexpensive breakfast offerings."}
{"text":"Went in for breakfast today with a coupon for 4.99 for any omelette with beverage purchase. Ordered ham & cheese. When time to pay bill, was told that coupon had to be presented when ordering. That they had their regular omelettes & the \"special \" ones for the coupon. NOWHERE on the coupon or on the paper that I cut it off of does it say to present when ordering. Nor does it say anything about \"special\" omelettes. And it's no wonder that Hometown Country Kitchen is so much better! Needless to say, won't be back! Will tell everyone about their sneaky tactics!"}
