{"text":"Great new addition to Westlake & surrounding area! Have been here  for both lunch & dinner. The food was to die for & service was top notch!! Although the name of this place might be a little confusing (meaning \"Bistro\") I was surprised & delighted to discover it is actually an Asian fusion restaurant. Believe it or not they even offer burgers, wraps & (are you ready?) SCHNITZEL not to mention Linguini Alfredo! While I haven't tried any of those, I can attest to their  Green Pepper Steak, Orange Chicken, Honey Walnut Shrimp, Lemon Chicken & General Tso's... are all to die for!! Their prices are more than fair & their portions are very generous The service is beyond courteous. While it is a small restaurant the ambiance is so peaceful compared to so many of todays \"warehouse\" places. They are waiting for their liquor license but I'm pretty sure you can BYOB. I would call ahead to be sure just in case (440)455-9900. I used to be a King Wah fan but this places blows them right out of the water. In our humble opinion this is the BEST Asian restaurant in Cleveland!! Try it, you won't be disappointed."}
{"text":"This place is amazing! Everything is made fresh to order. Have patience with the service and you'll get great food in return. The Peking duck was crispy yet tender and juicy. With the scallions and hoisin sauce, it makes the perfect Asian wrap! The Kong Pao Duck stir fry was so delicious! The fresh veggies paired well with the sweet tangy homemade sauce and the duck was of course cooked to perfection."}
{"text":"Adding to my prior reviews.  The curry. The curry is my new obsession. Giant, protein focused, $10/$11 portion that Tandul in Tremont can't even touch. What truely amazes me Is their ability to make a non-spicy curry, while still retaining its creamy, comforting, delicious taste, and texture. Of course silly me, I forgot to ask for  no  spice this time. So in 15 minutes I'll be heading back to get my free replacement. I recommend this with noodles on the side instead of rice."}
{"text":"Wanted so badly to try this place, love Chinese...so decided to take myself out for a 70th birthday lunch.....drove there...went in..no one around , some guys at a table said \"someone's here\" ,..... so I waited a good 10/15 minutes...no one appeared ....not wanting to spend my whole afternoon there I left....no matter how good the food is, if no one is there to give it to you , I say it's not worth it. Didn't want to give it one star , but can't post otherwise ."}
{"text":"Visited for the first time yesterday and was really impressed. The food was delicious, the wait staff was courteous and attentive and the decor was beautiful."}
{"text":"Mediocre food horrible take out service. They tell you half hour I arrived 50 minutes meal nowhere near completed. Told  at least 15 more min Utes. I asked for reason I was told they had a table if 5. These were the only people there  Gentleman was also waiting said his time was now over 30 minutes. Do not go here at all..no bar service . Go to Asian work or king wah..this place should be out of business soon."}
{"text":"Delicious food!  It's hard to find decent Chinese food and this wowed my whole family.  We got the general tso's chicken, egg rolls, wonton soup, egg drop soup, chicken and pork fried rice, egg foo young, and sweet n' sour chicken and it was ALL delicious.  The egg drop soup was some of the best I've ever had.   Wonderful service and great prices.  Highly recommend!  Will be back for more!"}
{"text":"This is without a doubt becoming my go-to Chinese takeout place. Let me tell you why:   Yesterday I placed a take out order over the phone and the process was quick, pleasant, and easy! I came to pick up my food about 30 minutes later and everything was fresh.   On the way home I couldn't help but eat one of my veggie spring rolls. They are INCREDIBLE: Crispy, obviously hand made, and mildly spicy. The filling had a fantastic texture with the outside providing a lovely crunch. Probably the best spring rolls I've had anywhere.   Along with my order I also got tempura vegetables, wonton soup, and two sweet and sour chicken entrees. The tempura vegetables were a wide assortment of vegetables in a delicious coating. I saw green bell peppers, broccoli, zucchini, onion, eggplant?, and snap peas, among other things. I didn't personally have the wonton soup, but I was told it was similarly yummy!  When we got to our sweet and sour chicken entrees, I realized that they had accidentally given me shrimp instead of chicken. I called in, hoping to correct the issue, and the handling of this mistake was some of the best customer service I've experienced anywhere. The polite person that answered the phone was apologetic and offered several options for correcting the issue. I chose to have the chicken remade and picked it up. When I got there, they were so friendly in making sure I definitely received the correct order. In addition, they gave us coupon off of our next order. This was above and beyond for me.   The chicken was WELL WORTH the wait. It was amazing. The coating was deliciously onion-y and the sweet and sour sauce was more nuanced than the corn syrup-y messes I'm used to. I would definitely highly recommend their sweet and sour chicken.   Due to the superb customer service (even in times of mistake), the absolutely delicious, fresh to order food, and the very fair prices for the quality, this restaurant will become my go-to for takeout. I hope to update my review soon when I am able to dine-in."}
{"text":"From their menu, it's kind of a mix of everything. But we wanted some home food (Taiwanese), ordered a bunch of veggies, and was not disappointed, can't say for the or Thai, Mongolian, American stuff, we didn't order it, but the Chinese food was quite authentic."}
{"text":"I've been looking for a decent Chinese food place since moving to the area almost 4 years ago. Tried this place for the first time and I was disappointed. My sweet and sour chicken was undercooked with practically raw batter under the initially fried outsides. The fried rice was average, no veggies and hardly any egg. Sweet and sour sauce tasted bland, it was nothing special. Same with the won ton soup - had high hopes and it tastes almost like nothing. Just plain noodles in plain broth. The search continues."}
{"text":"we stumbled onto this gem tonight and had one of the best authentic chinese meals in a while. we were first offered the \"usual\" menu, but our server quickly shared the version more in line with asian palates. she offered a list of suggestions, and we took her up on the crab & fish maw soup, salt baked pork chops, clams in black bean sauce, oyster casserole with ginger & onions, and snow pea pods in garlic sauce. definitely coming back to try the rest of the menu!"}
{"text":"This place has GREAT fresh Chinese food.  They are newer so a little slow at times but so worth it!!"}
{"text":"Everything was really good. Hibachi chicken was delicious. Wonton soup was awesome and so were the egg and spring rolls. The fried rice was great and one order could feed 4 people. They are working on getting their liquor license, but you can bring in your own. The staff was very attentive and nice. Very clean restaurant and looking forward to going back soon!"}
{"text":"The BEST. Not tried this restaurant,yet.? GO!  Ordered to go chicken stir and choose the Szechwan sauce. Chicken was prefect, sauce not overpowering, and the freshest (crisp) vegs. Generous portion, too. Best I had in decades! Service was exceptional, too! I ate half before I took this pic."}
{"text":"We went to Aristo Bistro for the first time yesterday and were thrilled with the food and the overall experience. We have passed by the restaurant many times but never ventured in. But I happened to read the Yelp reviews and my husband and I decided to try it based on the excellent reviews. The dinner did not disappoint! We were pleasantly greeted to our table and the restaurant itself is done up in a cozy and elegant manner (white table cloths)! We also have been craving a good Chinese restaurant in Westlake and Aristo Bistro is that and more. The menu is very interesting with items from China, Japan, Singapore etc (Aristocratic Eurasian we were told!). We ordered the vegetable spring roll, my husband ordered the Won Ton Soup and I ordered the vegetarian Buddha Hot and Sour soup. All sumptuous portions and delicious. For our main entree we shared the Classic Stir Fry with Tofu and Chicken with the Nippon Curry sauce and the fried rice! Every item was unique, made with fresh ingredients and delicious. The Nippon Curry (a first for us) was elegantly spiced and wonderful. Large portions so we brought home enough for lunch today! Prices are very reasonable for the quality and amount! Excellent service as well! We will surely come back. And hope others reading this review will stop by and keep this new local business operating for a long time. Aristo Bistro is an excellent addition to our culinary scene in the Westside."}
{"text":"This place is not what u think it is! It is not Italian (which I assumed it was when I saw their new sign up, less than a year ago). Want an all-American burger? They have it. Want a ramen Burger? They have it. Want a veal wiener or pork schnitzel? They have it. Want the usual American style Chinese fare like sweet and sour pork, General Tso's Chicken, orange beef, and fried rice?  They have it. They have 2 menus--the one I cannot read (in Chinese) is the one I ask for--I just have our waitress translate!  This menu has all the authentic, exotic Chinese dishes that I love! Since I discovered this place, I have not found it necessary to go downtown for Chinese food, ever again. It's all here, and it is much cleaner!  Everything I have ever ordered has been fresh & scrumptious...and the price is right (often cheaper than what I have paid downtown). My recommendations: Seafood King and Fish Maw Soup (a large bowl for $15.95) has become my new comfort food...even if it comes only in a large bowl, it heats up perfectly in the microwave for days to come; Sautéed Flounder & vegetables nested on whole fried bones for $28.00--you get the best of both worlds...feast on the crispy fins and tails while savoring the tasty flounder nuggets! Also good are the Aristo Rib eye Steak (boneless rib eye with Chef's Special Steak Sauce ($22.00). They can cook up your choice of seafood in a variety of ways: ginger & Scallion, black bean sauce, steamed, salt baked, garlic and wine. You have to call ahead if you like to order Peking Duck. This place is just starting to be discovered and sometimes they have a skeleton crew that can't keep up... so if you are in a hurry, it is better to take out, or come during off hours. Don't be dissuaded by the parking lot, which is always full--not everybody is at the restaurant. I promise you--once you've sampled the food here, you will never again be happy with the usual cheap Chinese hole in the wall take out, because you can also order take out here and the food is SO much better! Bon appetit!"}
{"text":"A hidden gem! What a delicious meal that I had here for lunch. The name is deceiving, it's a wonderful Chinese/Asian restaurant. There is plenty of parking. The restaurant is clean and inviting. The staff was friendly and welcoming. The prices are not over priced. Great lunch specials!  The wonton Soup was fantastic and the General Tso dinner was the best I've ever eaten! I highly recommend you trying this hidden gem. It's my new favorite local Asian restaurant !!"}
{"text":"We went for dinner last night, it was really nice.  The wait staff was very knowledgeable.  The food was really good and portions were large. We had no complaints about the prices either. At this time they are only serving beer, we were told they are working on their liquor license. We were told we could bring in wine if we wanted. We will definitely go back again."}
{"text":"Have been searching for a new Chinese restaurant. 2 weeks ago found Aristo. We ordered the General Tso and the Sesame chicken. Fried rice, egg rolls and hot and sour soup.  They were having their 'soft' opening as they must be fairly new.  The food is out of this world good!  Egg rolls were stuffed with pork etc.  fried rice was so flavorful i ate all of it. General Tso was the dark spicy sweet sauce which is exactly what i like and have had a hard time finding elsewhere. They prepare several styles of food like schnitzel.  I will definitely go back to try their non-chinese meals."}
{"text":"Very good Szechwan shrimp and chicken . Great egg roll .  Really enjoyed my dinner. Big portions too."}
{"text":"I had a taste for ramen and came across this place on yelp. I saw an earlier reviewer mention the Taiwanese beef ramen and it sounded good. Started with an egg roll, fresh tasting with the right amount of crunch and chew to it. The Taiwanese beef ramen was my entree. It came in a larger pot vs a ramen bowl so you could share it if you wanted. There were plenty of noodles and a good amount of very tender beef. The broth had good flavor, I asked for a little spice and for my taste it was just enough without being too spicy. I can't speak to the authenticness myself but it was tasty, I'd order it again and recommend it. Since they are a new restaurant they do not yet have alcohol service but are getting it. Best of all I received a $5 gift certificate for next time with my check."}
{"text":"Great place to eat.  Authentic Chinese food and a great staff as well."}
{"text":"Can't really rate this place as we left after waiting 12 minutes at our table. Once we were seating neither of the two waiters ever acknowledged us.  The place was only half empty at 7:30 this past Friday night.  Probably won't give this a try again as there are plenty of other restaurants to choose from in the area."}
{"text":"The food was so refreshing and the service was great! The waitress was very kind and gave us an extra rice to take home. The portions were huge i got two meals out of one! The sauce was light and not greasy/bland like you get in typical Chinese take out. This is definitely an authentic restaurant with tons of yummy options. I got the kung pao sauce that had fresh peanuts. So yum!!!   I highly recommend this restaurant for a filling, well made, healthy meal."}
{"text":"Portion is pretty biiiig! We ordered Yangzhou fried rice; Taiwan beef ramen noodles; black pepper beef ribs (????; stir fry pea shoots?????; black pepper fried calamari and egg rolls.  They are all very good.  We think the restaurant in general cooks American style chinese food. But the above dishes we have ordered are pretty tasty and authentic. The staff are all very good!"}
{"text":"Excellent authentic Chinese food. Ive been there about 3 times and every time was an excellent experience."}
{"text":"This is a great place for chicken and broccoli. That is what I wanted in Christmas Eve and it was fantastic and almost forgot to mention the manager was so super sweet and gave me a coupon for my next order. I will definitely be going back for more as it was such a great dinner seriously hands down yummy."}
{"text":"Best Chinese in Cleveland. You have to try out this new place. Don't let the name fool you! It's traditional Chinese. Fresh ingredients, the kindest staff. Large menu including some American and kid offerings, my 12 year old son ate vegetables with chicken and sauce for the first time ever. No liquor license yet so BYOB or try their selection of hot tea. I had amazing sweet and sour shrimp - crunchy vegetables, not over fried shrimp. Delicate rice. Tasty coconut soup. Love it here! Support local restaurants!"}
{"text":"Today I had the Szechuan Shrimp at Aristo Bistro.  It was spicy, but not too much so.  It was full of vegetables and large delicious shrimp.  I recommend it highly! My other guest had Mongolian Beef.  Again, full of tasty fresh vegetables, and beef that is super tender.  Some over cook stir fry.  Not them.  I go there often, and every meal was beyond fantastic."}
{"text":"Didn't think I would find a place around here that serves Taiwanese beef ramen soup! #asiancomfortfood"}
{"text":"This is our new favorite place! We ordered General Tso, sweet and sour chicken, egg rolls, and crab rangoons. Everything was SO fresh and delicious. I've never been a fan of sweet and sour chicken because the sauce was a gross, tangy, goopy mess that tasted like ketchup. However, after reading another review on here, I decided to give it a try. I'm so glad I did! Since it was a pick up order, they put the sauce on the side which was awesome because the chicken wasn't soggy. The egg rolls and crab rangoons were so yummy and crispy! We can't wait to try out some of the other things on the menu next time!"}
{"text":"We stopped in for a quick lunch on a business trip and were so impressed with everything from the decor to the service. The food which is made to order was some of the best Chinese I have had.  I highly recommend the General Tsos Chicken."}
