{"text":"Everything is barely mediocre. It doesnt have anything special, the owner is incredibly rude/cheap, and everything is so unnecessarily expensive. You have to pay extra to get a few more pieces of lettuce, and food quality is sub par at best.

For better kbbq, i recommend... well anywhere else!"}
{"text":"Wow. So impressed! I've been sitting on a livingsocial voucher for a couple of months and to be honest, probably wouldn't have walked in here if I didn't have $40 worth of food to eat for $20.  Now thanks to my compulsive buying of daily deals I have located my new favorite Korean/Japanese restaurant.

We were greeted as soon as we entered the door and promptly seated, the place was full of people obviously enjoying their meals but did not feel crowded or loud at all.  The booths are very cozy and the ambiance is elegant yet comfortable i.e. ideal for a romantic evening or nice group dinner but you don't need to fret if you spill some rice on the table.  

The menu is well-laid out and split between Japanese and Korean dishes; vegetarian dishes are marked with a leaf to make navigation that much easier.  We decided to start with the vegetable gyozas and wakame salad, both of which were perfection.  How they made seaweed taste so sweet, fresh and succulent all at once is enough to bring me back again and again, but I'm getting ahead of myself... Before the apps we ordered even arrived we received the standard Japanese salad and Korean banchan.  Oh how I love banchan, it is usually my favorite part of Korean dining and here the bar was raised.  We snatched up the tasty morsels quickly and the empty dishes were replaced with fresh servings to eat along with our meal.

Our mains were bibimbap and vegetarian cucumber and asparagus rolls (six of each), all of which we both gorged on equally.  The sushi rolls were presented beautifully and the asparagus had a delicious crispy coating.  The bap was some of the best I've had, full of a beautiful mixture of sauteed shitakes, carrots, sprouts and more on top of a smoldering bed of rice with a toasty, crispy bottom.  

After all of that, along with a beer and a pop we asked for the cheque and were told that since our total was only $34, we could order more food if we'd like to use the full voucher!  We managed to find some room for an order of green tea ice cream each and we left full and happy after paying only the tax and leaving an excellent tip in thanks of the stellar service!"}
{"text":"I am impressed with their \"forever\" smiles and happiness at the Arisu restaurant. 
Their atmosphere was very friendly than T.G.Friday or Ruby Tuesday american restaurant. The Arisu waiters treated us like good friends.

The Arisu's menu has excellent selection for everyone even elderly citizen without teeth. 

We are very touched by their kindness!!!"}
{"text":"Slow slow slow service.  There were only 4-5 tables during lunch time.  We ordered Korean BBQ.   Sat there for 20 min  and we get tea.  And another 15min we get one side dish.....   another 15 min we finally get some beefffff....  oh that's after we threatened them that we would leave.  I know the time cause after 15 mind,  I put the timer on.  I was gonna leave but ladies were famished.  Terrible service.  Lady was OK.   The kid she was training defiantly needs more training on attitude and what not.  Oh and they might have reused their side dish cause it looked like it and when the waitress came by she just changed it saying shes sorry...Only reason I give this restaurant 2 star is that the meat was good. 

I would not come back.  At this price point,  service should be much much better."}
{"text":"REALLY great Korean BBQ and sushi! Service lacks a bit of something. I came in one time where I guess a party of 10 VIP's (maybe the owner's family?) waited 20 mins. for water... First thing they should've done was water us first. Anyway, I think they could really improve on the service. The owners are essentially the managers, but they don't help the servers out at all even if it's packed. You'll be waiting at the door, and the owner will be right there... he won't even seat you or say hi. Some good servers there, some of them need to learn to be more friendly and helpful. 

The only problem I have with this place is the service. Great sushi and Korean food. Good selection of Asian liquors if you're there to drink. Owner needs to be more helpful. It's very evident that he's the owner."}
{"text":"I was a little afraid to come into Arisu initially because of the previous owners...and seeing how the building use to be Mc Donalds before it closed down I figured this building must be cursed. Any how gave it a shot and it was a pleasant experience. The owner who took over sure knows how to design a restaurant. The decor was nicely done with a lot of wood furnishings that gave it a very robust, clean and modern feel. What I enjoyed especially was this one table which had a sand pit centre piece with a fish installment hanging from the ceiling.  

Now onto the important stuff. This restaurant has a menu that caters to your Korean and Japanese taste buds which I personally enjoy. Moreover, what impressed me about this place other than their renovations was their appetizers which I think is really the only significant thing that differentiates other jap/korean apart. They bought out a tiny cup of warm soba noodles in soup along with Kimchi, and a couple of other delicately placed korean looking side dishes (seaweed, tofu, choy, potatoes etc.). Those things filled my bf and i's tummy up before our main dishes came. The salad was good which was your typical tasting salad that you would get if you went to other jap restaurants, however this place put a lot more effort into presenting it compared with other restos.

The service was great I asked for tea once and the waitress topped us off promptly following with a jug of tea that I didn't have to ask for which I thought was fantastic (it was like they read my mind). Thumbs up in this category because there was enough happy and ready to serve staff constantly making sure that their customers were content.

To sum it up I'll def. be going back because theres a few items on the menu where you need to tell them 2 days in advance in order for them to prep. the food for you, so I am intrigued about that. PLUS THEY HAVE KOREAN BBQ. :D"}
{"text":"It was clean, modern, and they had good service, but the the food we had was overlaced with sauces/oils. Mine had too much sesame oil, and tasted too sweet.  

This is a good place to bring someone who is sketched out by run-down $7/plate Korean food places (at the cost of paying premium though), but I can find better/healthier food at those run-down places."}
{"text":"Excellent service & food! Loved it here. Servers were extremely nice & sweet. Food was great, atmosphere was nice. Really, I have nothing to complain except it's on the pricey side but I think it's def worth it. Would recommend this place!"}
{"text":"I got the Summerlicious set menu, was incredibly mediocre especially considering the price. The dessert was pretty but haphazard with too many flavours and textures that didn't go together."}
{"text":"I used to live in Korea so I know what authentic really tastes like.. this place is very authentic. I especially like their cold noodles and bean stew (biji jigae)! Yes it's a bit expensive compared to the rest of K-town, but honestly K-town is just soooo cheap compared to the rest of toronto which makes arisu seem expensive. 


I've been to tons of restaurants around Toronto and with this kind of interior/service, i wouldn't say it's expensive at all. You can't expect them to invest so much and sell 5$ kimchi stews ...  anyways, i really hope this place doesn't close because I go here often and I love it! Esepcially because UofT students get 10% discounts with their student card. 


Japanese and korean food here are both awesome. I would stay away from the set meat combo though. I forgot which one, but one of them is just way tooooo sweet for it to be really Korean. Maybe it's catered towards Canadians? Idk.."}
{"text":"------------
Update to respond to Ryan:

I am not a competitor, just someone who genuinely had a bad experience at your restaurant.

While I appreciate your due diligence in looking through my Yelp history, I just want to note that the fact that I do not have a lot of prior reviews doesn't make this one any less legitimate. In fact, I rarely Yelp but felt like I had to after the meal I had at your restaurant as I felt like that was my only recourse. 

I know you are running an honest business so I don't mean to bash on your restaurant. If you have taken steps to remedy what I've written then perhaps people should give this place a second chance. I have not emailed you as I'm not sure what that would achieve....

Ed"}
{"text":"Arisu is one of many Korean restaurants in the area but it definitely sets itself apart with its array of options and quality of food!  The restaurant itself is clean, wait staff is friendly and helpful and there is plenty of room to accommodate large groups, which you really can't say of most of the other restaurants in the neighbourhood.  

There is sure to be something to please everyone with the array of options on the menu.  From sushi to table BBQ to authentic korean stews - you can try a bit of everything with their combo deals.  We went with a group of 4 and ordered the combo for 4 for $100 - it was enough food for probably 6-7 people...portions definitely did not disappoint!  Sushi was fresh, BBQ was delicious and all the extras that came with the meal were very tasty!  Would definitely recommend - $25 per person for ALL that food, including sushi?  Deal of the decade if you ask me!"}
{"text":"My favourite korean restaurants! One of the things I really love about this place are the side dishes, comparing to other places I have been too, their side dishes are the best! Also so far, I haven't been disappointed with any of the food I tried here, and I have tried many things from this place. One thing I didn't like much was the service.. they don't really refill the side dishes, and they are really slow, we had to keep calling them for drink refills, bills, etc It's a bit pricy as well but the food is so good, it's worth it!"}
{"text":"The place was busy when we got there, but there were still a few booths and decent tables left. However, you won't get a booth unless you are doing the grill, they straightforwardly refused to give us one. Ok, let's get a table then!  They took us all the way back, next to the kitchen, with servers and busboys constantly running by, constant noise of plates and glasses etc.
Obviously, we were quite unhappy with this arrangement and tried to get attention of a server, which proved to be a hard task! Finally, we were able to request to be seated elsewhere. Reluctantly were we sent to a table in the middle of the restaurant. Definitely better! 
The food we got was alright, though overpriced for what you are getting. 
Service was bad - getting a server to refill the water glasses, bring the bill and process the payment took awhile... quite awhile."}
{"text":"Came here for summerlicious lunch with a friend. Chicken appetizer was really good. The tofu soup was extremely salty, had to dilute it with the water they gave us and the korean beef had no seasoning. Cold soba noodles were also pretty flavourless. Otherwise, the meal was enjoyable and I like the big portions."}
{"text":"Very good Korean restaurant that is clean and serves authentic dishes.   Some might say it is pricey compared to other korean restos but there is a difference in the quality of food served here.  I always enjoy going here when I am downtown."}
{"text":"Excellent quality and value. Warm, generous and highly attentive staff. Korean BBQ can't be beat - nor can their $100 dinner for 4.  Don't feel the MSG I usually do at Korean places (esp in stews), side dishes don't feel tired either."}
{"text":"Had the BBQ boneless pork ribs and chicken. Came with a chefs salad/kiwi dressing. Servers did a great job explaining all the choices and how to prepare the dinner. Very tasty. Service was prompt and courteous. Would return."}
{"text":"Food is good and offers esp very good quality beefs. However, I must deduct two stars for the inconsistent service. I use to come here and the service was great however the most recent visit I went to gave me extreme frustration. I had to call out throughout the whole night for nearly everything. Also, the ssam sets that came with the bbq combos are missing this and that.  We were served by at least 4 different people which probably directly affected the service. Moreover,  there were obvious impatience on the waitress/waiter's face as we had to call them for everything we needed.

- had to repeat certain drink orders 3 times before it came
- had to ask for tea refill 
- had to remind for rice that came with the sets we ordered 
- had to remind for the ssam (lettuce etc.) that came with the orders 

it was a complete mess that makes me really want to give only 2 stars but considering their past performance and the quality of food, i will still to 3

It makes me wonder and realize how useless restaurants servers can be, sometimes i think they are merely a transport tool from the kitchen to the dining table which can and should easily be replaced by a transport belt. I rather self-serve at times and have some kind of automated ordering system so that if i was not going to get good service anyways, at least i did not have to feel frustrated and offended yet still feel obligated to tip. 

That being said however, previous times I have been there were enjoyable and those were busier days. Consistency is the least one can ask from an restaurant because it is really worse when one can feel the gap between visits."}
{"text":"First of all...1 star should not be given to this restaurant. Food quality is not bad they try hard. However, what made me to write the review for the very first time is for their very upsetting service. 

We ordered 6 orders of pork belly bbq and soup side order.

It was served with 8 lettuces leafs...for 3 adults to share???and when we asked for more...they said it would need to be a extra order!!!!!! What?? Shouldn't you be serving the right portion of vegetables when customers are expecting to have authentic korean bbq????????and the answer we got was that 'they have limited portion per order'....are you kidding me?? Clearly 8 lettuces leafs does not serve 600g of pork belly...

But we didn't wanted to urgue back so we just ordered the extra vegetables. 

Servers did not come back to check on our table until we asked for the cheque..normally at korean bbq place they offer to change your grill if it seems to start burnt...but this place ignored our table and let us grill on the burnt grill..horrible!!!!!!!

Lastly, we had our 3 yr old son with us and saw other tables getting an ice cream as they asked for their bill. So we asked if we will get one..and the answer was 'no' since we did not order a combo. So we kindly asked if only our child can get one as he could not take off his eyes on those ice creams....and they also said 'no' because we did not order the freaking combo!!!! Wow that just threw us off!!! For that one scoop of green tea ice cream!! This restaurant had to be that cheap!!!!!!!!!!! 

My experience at this restaurant is so horrible that I want to call every inspectors that could possibly visit to restaurant and let them catxh whatever shady thing they might do and give this restaurant no chance for business!!!

Horrible..disgusting...has no sense of customer service!!!"}
{"text":"Holy delicious!! I'm glad that I discovered this authentic Korean restaurant in the downtown of Toronto.  Beautiful atmosphere, good service, and food are excellent.

We had Taste of Seoul combo for dinner. The taste of the short ribs was very juicy and it tastes even better when you try it with fresh veggies which were given. 
In addition, there are lots of promotions going on so, I can taste quality of food with care in good price. 

Will definitely be returning to try out their authentic Korean table BBQ as well as the rest of their menu. FIVE STAR :)"}
{"text":"Great choices for Korean AND Japanese food. Make sure to have reservation if you want to do Korean BBQ though. 
Best deal is the $0.99 per oyster on Mondays and Tuesdays. Max 6 per person but good quality oysters. So good for an after work bite if you are in the area."}
{"text":"Great decor, attractive menu. It took us about 20 minutes to decide what to eat because of all the options available. We went in looking for bbq, but balked when all the side dishes (kimchi, garlic, lettuce etc.) were extra. Settled on the dolsot, but was pretty unsatisfied with the quality. The bowl was warm but lacked any sizzle and had very little flavour. 

The place is good for someone looking for an introduction to Korean food, but vets looking for traditional style should stay away."}
{"text":"Arisu is a Korean BBQ / sushi restaurant. The atmosphere was very relaxed and great for conversation. 

I went to dinner here tonight with a small group and it was fantastic. We ordered from the table BBQ menu. Service was quick and friendly, drinks were very reasonably priced. The price of dinner is on par with the quality of food. We all left happy and stuffed. 

Try the Kloud beer - it comes with an interesting story. 

I will definitely be back to eat at this restaurant again."}
{"text":"I had been here last year and wasn't too impressed but came back again for my birthday this year and was pleasantly surprised. The staff was really friendly, the waitress my friends and I had was so adorable. We were taking a group photo and she just popped in the background! Best photo! haha

They had a special for birthdays which was sparkling wine and sushi pizza. I had never had sushi pizza so I was really excited to try this. SO. DAMN. GOOD. Definitely order this if you like raw salmon and crispy rice! The sparkling wine was really tasty as well. I couldn't pinpoint the flavour but it was a mixture of some fruit sparkling wines.

I had ordered the sashimi bibimbap which came with a surprising amount of lettuce. The sashimi was really good, it was cut up into smaller pieces than I'm used to and I think I prefer larger slices. I also ordered a kimchi pancake and this place has one of the best Korean pancakes I've tried. Korean is one of my favourite cuisines and kimchi pancakes are one of my favourite dishes, so I've tried a lot of them. My other friends enjoyed their food as well.

For my dish+appetizer and a bottle of soju, it cost me ~$50

For dessert we got the FBI (delicious) and the Bingsu, I was really excited to try this because I had been lusting after it for quite a while and it did not disappoint. It is now one of my favourite dessert dishes (TRY IT!). Shaved ice topped with sweet red beans, candied fruit swimming in condensed milk. Are you salivating yet?

It's a little more pricey than the mom and pop shops you'll find nearby but the decor and environment are also a lot nicer."}
{"text":"I came here with a large group.  
The menu was extensive...maybe too extensive with Japanese and Korean fare. Overall, many of the food items were overpriced for what you got. We ordered 3 dishes and did not love it. Only great thing was the presentation. 

I ordered the spicy sashimi bibimbap ($15.99). I was thinking it would be sashimi pieces in a large bowl with some veggies..like a chirashi bowl. Instead, I got a large dish of mainly lettuce, small portion of diced up sashimi and a bowl of rice on the side. As there was no dressing, I was essentially eating lettuce with soy sauce and rice. 
My daughter had the Pork Don Katsu ($12.99). The portions were big but the pork was the toughest I've ever eaten. I couldn't give it to my young daughter as she couldn't chew it. 
My husband ordered the \"All-in-one\" meal under the \"Deluxe dinner box\" section. It was an overpriced bento for $26.99. There wasn't anything that stood out in this box compared to what you would get at other Japanese restos for that price. 

The restaurant does offer a prefix 3 course meal for $29.99 and have daily specials. Looking around, looks like many customers come for the tabletop cooking. ..which looked good. 
With an extensive menu, I'm sure there are many great dishes. We just happen to choose dishes that didn't satisfy. We ate it anyway since we were hungry. 
Service: servers were often forgetful of our requests."}
{"text":"I came here for the firs time a few weeks ago and since then I've came back three times.  I've tried a variety of items on the menu and the must order for me is the Seafood Pancake.  Ordered it three times and I love it!  

The braised beef short rib was also delicious, had it twice and soooo good.  Love my Galbi Jim. 

I love their Angus Beef and ordered it twice, get the Combo 2 people is enough if you order other items for three people.  I ask for salt and pepper and sprinkle a bit more on after placing on the bbq, don't over cook these babies!! 

Aburi Salmon is another one of my favourites!  Wouldn't have expected it to be so good and for $12 I think it's a great deal!"}
{"text":"Dropped in on a whim for lunch with a colleague and we were thoroughly impressed! Its essentially a Korean BBQ meets Sushi bar with everything in between. Big menu but we kept it simple. I got the  spicy sashimi bibimbap and my co-worker got the LA short rib bento box and we really enjoyed our meals.

If I'm in the area and need a quick, fresh sushi fix in a sea of korean, this will be my go to spot west of Bathurst."}
{"text":"The worst food I've ever had in Toronto. Literally.

The chicken tastes like paper soaking in the oil and the soup taste like herbal medicine. There's barely nothing in a beef stew. The appetizer is worse than any little Korean restaurant.

Such a waste of money and time."}
{"text":"Was probably a 3.5 stars. Mackerel wasn't a whole fish and was oversalted. They had nice seats and tableware for kids so that was great.

They didn't let us order a noodle dish that came with raw fish because they said they were out.. yet they had a sushi cooler full of fish, so that didn't make sense.

They have the button on the table for service, so that's always nice. Overall service was great."}
{"text":"Had to try Arisu for some korean bbq.  I haven't heard much about it but it was just one of those places I always walk by and wonder about their food.

Even though it seemed busy, the hostess and the servers were very efficient.  They were friendly and checked up on us to make sure the tabletop grill had the right amount of heat, etc.  They even offered to change the grilling plate halfway through our meal to make sure the meats are cooking perfectly.

Their menu is pretty much a book.. I would appreciate it if they can focus on a specialty but it seemed like they wanted to do everything rom sushi, sashimi, table top bbq, table top hot pot, ssam combos, you name it!  We decided to go with the Arisu table top Combo B.

The Tabletop Arisu Combo came with 5 different kinds of meats, veggie platter (to wrap the meat in), sauces, 2 bowls of rice and dwen-jang-jjigae (Korean bean stew). Of course all the traditional side dishes came along with the order.

We found we would have liked more of the beef Short Ribs Galbi and the L.A. Bee Short Ribs instead of just 5 pieces each - it was such a tease.  Instead of the marinated bulgogi and chicken. more of that ribs would have been a better choice.  It made us think that the combo was overpriced!

The Soybean Stew came as well.  It didn't look that good but it tasted fine. Nothing special.  

Overall, we had a good experience here.  The beef short ribs impressed us but the other meats in the combo and portions were disappointing to the price we paid."}
{"text":"Great first experience. Have already recommended this place to others. Higher on the price scale for sure but clean and roomy dining combined with amazing food. The chicken is a must have starter. Topped off. My. Meal with the spicy baby octopus and it's exactly that. Crazy hot temperature wise for soo long... Made it tough to eat but much better than a cold meal. 

Service was quick, almost too quick but wasn't annoying or made you feel rushed in any way."}
{"text":"Two of us had table BBQ today and it was so good. 

We had gourmet beef combo ($80ish), actually good for almost three people. A bit pricy but quality is pretty good.

Will come back again!"}
{"text":"Came here with my aunts and was very underwhelmed.  Didn't really like the booths and there was no ambiance to the place.  The food was average.  Service was good except for the fact that the servers English wasn't very good but they knew what they were doing.  Probably will not eat here again."}
{"text":"We went there for lunch on a Sunday and took the Korean BBQ. It was good, decent portion food with all the sides to expect at a Korean BBQ restaurant.

The service was a little bit slow, my husband had to go get the waitress to know what was going on with our order. There wasn't many people in the restaurant so we have no clue how bringing the pre made sides could be any longer than 15 minutes. 

The beers came out right away though. 

I saw that they have a patio that looks very nice too but it's kind of too bad the electrical wires aren't long enough so that we could have the BBQ outside! That would be awesome so we would not have to go wash our hair and clothes right after eating there because the sizzling grill smell does stay..."}
{"text":"Went for Winterlicious and will be going back. Service was great, and food was even better."}
{"text":"Authentic Korean food.
Excellent flavors but too small portions considering their price.

Good service and atmosphere.  

Definitely get some meat for the barbecue and finish up with the naengmyun (the noodles are so good and elastic). 

Highly recommend this place, especially if you have a friend who want to try Korean food for the first time."}
{"text":"I decided to take my friends here since one of them from Japanese food, and the others want Korean food. 

From my past experiences, Arisu's food are usually over salted  or too saucy, same as this time. But all of us enjoyed our food. The miso soup was so salty none of us finish ours, it also tasted different from other miso soups. The only con of the night was the family with kids sitting beside us. Their kids were loud. I understand they are kids, but would be nice if the parents try to quiet them down.

I like arisu, but the food is a bit on the pricy side comparing to other restaurants that offer the same dishes, still worth the price though. The great thing is it doesn't smell as heavy herelike other Korean restaurants, I can leave here without smelling like Korean food. Arisu makes better Korean dishes than Japanese dishes, they have very nice menu for stone pot, lots of options. Good food but not stunning.

4 for the food.
4 for service
5 for environment, spacious and comfortable"}
{"text":"My boyfriend and I spent a good New Years Eve here, and this place is quite memorable. 

Like everyone is saying, it is A LOT more pricey than the other restaurants around, but I do think it shows in the food, in a good way!

My boyfriend and I ordered the Arisu combo ($49.99)
- Beef Short Ribs Galbi
- L.A Beef Short Ribs
- Bulgogi (VERY DELICIOUS)
- Pork Belly
- Marinated Chicken (got the non spicy)
- Soybean Stew
- Lettuce wraps
- 2 bowls of rice
(check pictures for the platter)

Once we entered, we were greeted with a picture of Psy dancing on stage, autographed, framed and all. Pretty funny stuff! 

Let me start by saying that the service is top notch here! Some of the waiters here are pretty easy on the eyes, and are honestly borderline Kpop idols xD Even go as far as bowing to you. The tables also come with a button, which calls for service. My boyfriend and I only had to use it once during the whole night, and once we pressed it, we had someone at our table in a split second, I'm not even lying. Our bbq grills were also changed almost every 4 minutes.

The bbq was great, it's an in-table bbq. The platter for it was nicely presented, and they even do the bbq for you. The only complaints I have, is that the pork belly was cut WAY too thick for my liking, I personally like it a bit thin, almost bacon thin. The non-spicy chicken was just ... Bland. It's our fault though, because we had forgotten to ask for the spicy one, which I assume is packed with more flavours. All of the other meats were top notch, high quality and delicious. The L.A beef short ribs for sure, hands down, was the most melt in your mouth beef I have ever experienced! 

My boyfriend and I were split about this place though, as he didn't like it at all and was quite disappointed. His reasoning is because the bbq marinades weren't 'White' enough for him (he's Chinese). I personally love this place, and would come again and again, but I guess it all depends on the person!

 A great place to do bbq with friends! In a great atmosphere! With wonderful service!"}
{"text":"Are you accusing me of lying about your horrible restaurant?  I can show you tons of different pictures of my entire group and pictures of your buffet that was set up against the wall in the back.  This just confirms your sleazy customer service."}
{"text":"Anytime I am West of Bathurst you can expect me doing some gangster sh*t.
In this particular case, I met up with an old buddy of mine from another life. We haven't seen each other since 2005, so when we both found out that the other one was still alive, it was our mandate to make a man-date. 

I compromised and traveled to my discomfort zone of West Toronto, debated for fifteen minutes whether to pay the four dollar Green P parking or to risk it and give the middle finger to the system. I ended up paying, because I was unable to overcome the slave mentality of adulthood. Although..they do say the cerebral cortex only stops developing at around the age of twenty-five...so that makes me only a juvenile in adulthood years. I wonder if that would ever hold up in court?

My buddy Trocki and I walked down Bloor Street only to end up walking back to where we started and settling for the most non-Korean friendly looking Korean restaurant, which led us through the doors of Arisu.
The real estate was pretty sexy, clean, good lighting and organic Korean décor. 
We came in at 21:30hrs, but even then it was sufficiently staffed. A man showed us to our table, a polite older lady took our orders, a young woman brought us the food, and an even younger lady gave us our bill. I never met more people eating Korean food! I had an odd feeling though, something was off, but I couldn't tell what it was.

I got the spicy something chicken in a hot stone bowl, and Trocki got two sushi platters. He thought the sushi was good, but what does he know? His spicy tuna was smothered in sauce, and he didn't even have wasabi in his soy sauce. I was truly dining with a novice. It wasn't bad. Actually, it was surprising good for a non-specialised sushi restaurant. It's actually a specialised Korean BBQ restaurant. I have good feeling about this place because it is very clean, so I have no doubt with the quality of the BBQ. This is based on my experience at other places. I am an experienced diner. TRUSS YO.
I asked the waitress what Arisu meant, and she told me it's a river in Korea, and it somewhat translate into big river. I think however, she meant 'the great river'. This is based on my cultural understanding of everything, because I am super cultured and just wanted everyone to know that. 

I was satisfied with my food, despite it being about 40% higher priced than any other Korean restaurant I've been to in Toronto. I suppose that's the price I pay for cleanliness, and professionalism. Well worth it. I just wish I was more educated in what to order, I've always played it safe with Korean food. 

And suddenly it dunned on me, and the odd feeling I was getting earlier manifested into a memory. This place used to be LABRIOS! I think that's how its spelt. LABRIOS was a Latin nightclub. I used to bounce the Latin/Spanish scene, and I bounced here once a blue moon ago. What the hell..
Closes at 11pm. Booth seating mostly.

There is this cute waitress here, and when she spoke perfect English to me, I was surprised, and said to Trocki: \"No accent, that was surprising\", like an idiot.
This was only two seconds after she left our table. Trocki buried his face into his balms laughing in embarrassment. Apparently she heard me.
RELAX, I used to be security here!"}
{"text":"New fav. sushi joint on Bloor. 

Used to go to New Generation a lot (more so for the late-night hours) & some of the random Korean restos for kbbq, but now, it's no question. Although the restaurant is advertised as a kbbq joint, it has an extensive menu including a lot of sushi & Japanese fair. At decent prices, too.

LOVE the maki rolls & hand rolls. I definitely recommend the spicy salmon hand roll & volcano maki roll (tempura shrimp and crab with spicy salmon & crispy bits on top). Huge roll! So huge that I immediately knew I'd be taking the rest of my meal to go. So be weary of this. You can easily get full of this roll alone.

Also ordered bulgogi & bibimbap. Love how the bibimbap has extra toppings for $1.50 each. Got extra shrimp & pork belly. So good. 

Also serve free Korean tapas (the usual kimchi, fish cake, eggplant, etc.) & sometimes a soup w/ noodle app. Loved that.

Went for lunch and also for dinner. Lunch time menu has awesome deals."}
{"text":"We ordered the sweet and spicy chicken and baby octopus on top of rice. The chicken was delicious with just the right amount of sauce on it. The only downside was that it didn't come with rice so we had to do a side order of it. The baby octopus was delicious. However, I wish they told us that it came on top of rice. We ended up with too much rice in the end."}
{"text":"Arisu is very nicely decorated, I must admit the decor does elevate the experience, unfortunately the food is more lack luster. Ordered the pork katsu lunch, wife ordered the chicken teriyaki. The dishes came out looking great but the meat was bland and overcooked (dry). Also had the chicken soba (Tuesday special) noodles were great but again chicken overcooked and dry. Overall experience was good may visit again and try their bbq instead since that seemed to be their specialty. 
Bottom line recommend  yes, but would suggest bbq where you cook your own Meat."}
{"text":"After a long tiring day walking around the city, my family and I just wanted to eat some nice korean bbq to end the day but this place did not satisfy us at all.

The price is extremely expensive for the small portion size. We spent a little over $100 for the entire meal and I didn't even want to take pictures of the food because we were so disappointed. Usually a good server would let us know of the best options to order for a family of 4 to get the amount that we're paying for. But the server did not help us in selecting what we were looking for. She didn't seem like she really had any experience in that. 

Overall, this restaurant has poor food quality, poor service, and poor dining experience."}
{"text":"We've been to Arisu a bunch of times and have always gotten great service. You can't go wrong with the bibimbap, table top BBQ or hwedupbab. The owners are really friendly too!"}
{"text":"Food was good! Solid spot to go out with your significant other or a group. Good atmosphere, good service. Would recommend bringing a Korean speaker to get the best service/experience. Bottoms up and Bon appetite."}
{"text":"Kelsey's and Ka Chi had a baby. They named it Arisu.

When eating here today, I had the surreal feeling that some generic North American chain had commandeered what had once been a Korean restaurant and decided to pretty it up.

Upon arriving, the service showed undeniable overtones of Korean hospitality (and spoke more Korean than English)... But little things such as the software-designed menu, the hollow rounded metal chopsticks, and the IKEA-restaurant worthy decor made me suspicious that it was all a front for the sale of disappointing Korean food at exotic prices. 

However, the food turned out to be decent - it wasn't great (definitely not as good as some of the restaurants in Koreantown just a block or two up), but it was good enough the same way you might have a pasta dish at Kelsey's that scrapes satisfactory for the $15-20 you spent. 

If you have a friend who is wary of Asian cuisine, this may be a decent place to ease him into it. He'll feel right at home in this Woo-Buffet-reminiscent resto, and perhaps he'll build up enough courage to venture into the heart of Koreatown next time."}
{"text":"Always spending time in korean town in the past, I always wanted to try this place.  However, back then.. it was still under construction.

For the first time in a while, after a meet up with some friends.. we finally got the chance to try this restaurant out.

The decor is sleek, simple and clean. The waitress/waiters were very friendly and kind.  As well, the booths were cozy and comfortable. 

The only issue was.. after deciding on our orders, it took quite a while to get our food. We must have waited for about 30 mins+ until it came. However, I may be bias as I was a very hungry person & manage to order $30 dollars worth of food just for my portion of the meal.  I tried the mackerel fish with miso soup & rice + spicy salmon roll & minced spicy scallop rolls. 

Also, while ordering my portion.. the waitress prevented me from ordering more food as she said \"I think this is enough food for you\". However, little did she know I might be small but I have one very bottomless pit stomach, and was not satisfied with everything, as I was about to order more.. but decided to just grab menchies. 

The food was good... but just equivalent to most korean restaurants that serve these dishes.  As a result, I think this place has made it to my \"it's alright..list\". However, I may give this another chance in the future."}
{"text":"We went with a Groupon, but this place is still expensive, for Korean food.  That said, it is still good food.

My wife & I had the BBQ Combo for 2.  Simply put, I think we had too much meat last night.  My stomach wasn't used to the meat concentration, but it was still good.

I'd like to go back to try their regular cooked food, or some sushi/sashimi stuff, but it's cost prohibitive for us.  I'd go back if friends wanted to go."}
{"text":"Came here by myself cause I was craving sushi. 
I ended up getting a combo that came with udon noodles, Pork Katsu and salmon roll.

The Pork Katsu was really dry and the salmon roll had garlic sauce drizzle over it that didn't complement the roll at all. 
The udon noodles wasn't that bad which was surprising cause I came for sushi 

Overall 3 stars because the staff was nice and the udon noodles was alright"}
{"text":"We heard good things (especially Korean BBQ) about this place from our friends so we had to go check it out when we visited Toronto last time. The interior was clean and the staff was very friendly/polite. The menu was slightly pricier than other typical Korean restaurants but the food totally justified the price.
We ordered marinated short rib galbi strips and braised galbi jjim and the food was definitely high quality! I've had galbi jjim at several different Korean BBQ places but the sauce at this place was just about right. It was not too sweet or not too dull. And the meat fell off the bones very easily, making it easy to eat. Galbi strip was also very delicious and was worth every penny.
I'd strongly recommend this place for those who crave for some authentic Korean BBQ experiences."}
{"text":"What a pleasant surprise!

My husband had purchased a voucher from Livingsocial a while ago and we finally went for dinner on the weekend.

Upon arrival, the first thing we noticed, was the very nice decor. 
Arisu has an upscale look, but still manages to have a casual atmosphere. 
We were greeted right away by a friendly waitress and since we had made reservations, our table was already waiting for us.
Arisu's menu is extensive since they are serving Japanese and Korean cuisine so you need a few minutes to take it all in.

We decided on the following order:
- Spicy Samon Rolls
- Salmon Rolls
- Hot Pot Bibimbap with beef and vegetables
- Spicy Chicken

The food came out after just a few minutes.
My husband and I split the two orders of salmon rolls and I am happy to report that the fish was fresh.
I had ordered the Spicy Chicken and really liked it. 
It was chicken breast with several different veggies cooked in a spicy sauce and it had just the right kick to it.
It also came with a bowl of rice and they gave me the choice of regular white rice or multi-grain rice.
My husband had the Bibimbap and also enjoyed his dish.
Additionally, we were each served a small salad as an appetizer as well as a miso soup and about six small side dishes (kimchi, bamboo sprouts in a sesame vinaigrette, some kind of apple salad, chick peas plus two other things that I wasn't able to identify). 
Everything was really tasty.

As for the service:
Throughout the meal the two waiters assigned to our table came on a regular basis to check if we needed more water,  wanted more side dishes or just to inquire if we were satisfied. Good job.

Conclusion:
Thumbs up x 2 for great service and great food.
We will be back."}
{"text":"Best Korean food I've had in Toronto, and the service is amazing, the servers are all so polite and helpful."}
{"text":"Good service, we ordered the sashimi with the meh woon tang (a spicy fish soup) which was good as well but the sashimi platter did not have everything it said it would om the menu, which was listed as many different types od sashimi and oysters on the side as well. The service was very good and will go back for other things on the menu, also there are daily specials so look it up! Also free wifi :)"}
{"text":"My sisters treated me to dinner for an early birthday celebration and I enjoyed this place better than other Korean bbqs I've been to.

Firstly, the banchan selections were so yummy!! I would go just to eat those lol.  The meats we had were good, nothing overly amazing for me.  Next time I would like to try their other main dishes and not just the Korean bbq.

All of our servers were very polite and friendly.  Sometimes when we asked for things, we would have to ask again as they forgot.  The table we had was quite small for our group of 6 people as we barely had enough room to put all the dishes on.  The best part, we did not smell like bbq when we left which means they have a good ventilation suction so you don't leave smelling like food! Amazing!"}
{"text":"Hot Pot Bibimbap!
Love!

This Korean resto is pretty classic. With a vast menu, including the option to cook your own food, you're bound to find something that you'll enjoy.  I usually get the spicy chicken bibimbap with the multi-grain rice - and that comes with the slew of mini Korean apps and a miso soup. I've had the sushi here before as well and it's pretty good.

I have been many times and will definitely be back!"}
{"text":"Really friendly staff.  Ordered the fried tofu and wakame salad for appetizers and for the main course: veggie bibimbap. Taste-wise, all was pretty satisfying and presented as visually appetizing."}
{"text":"Best BBQ and excellent service as always. My go to place always !  It tastes good and for the price and quality of meat, it's worth it. 
For those who've never tried KBBQ I strongly recommend you start here. 

Enjoy!"}
{"text":"I wasnt sure what to expect, but it's quite nice, and the fact that you can get both Japanese and Korean food is a plus. 
They have non-traditional Korean food as well which is good for people like me who aren't actually big Korean food fans. 
The 'traditional' alcohol though is expensive. 

Over all it's a nice place if you're with a picky eater who claims they want Korean food but doesn't want to go to a not-so-glam Korean restaurant in Koreatown."}
{"text":"Arisu! I came here for summerlicious 2017 on the first day (Friday July 7) and I was super excited to try out their menu.

I ordered the:

- sweet and spicy korean chicken: it was a bit cold when it came out but the presentation was good and the sauce was good as well 

- korean lunch tray set: it came with purple rice with lentils and beans, tofu soup, flat iron beef, and some side dishes (seaweed, kimchi (YAAAS!), and fish cake). I found that half the flat iron beef was tough but I enjoyed the hot tofu soup a lot. The portion was excellent.

- watermelon crush: exactly how it sounds, watermelon with crushed ice

My meal was definitely a 4 star but due the wait was really long. It was more than 30 minutes. I noticed the table next to us who came before us did not get their food until much later and they asked the waiter who told them that there was a mishap in the kitchen. The food came out after about 40 minutes. I find that it's important to let your customers know when their food is coming out especially if it's approaching an hour wait. If they let me know that something happened in the kitchen, then I would have totally understood.

However, I am glad I got to try summerlicious here, their day-to-day menu sounds promising too."}
{"text":"There are a ton of choices for Korean food on Bloor street, Arisu stands out with its snazzy facade.  They prepared a delicious veggie bibimbap, and I found the staff to be particularly friendly and knowledgable.   

Good food, excellent service."}
{"text":"This restaurant is incredibly pricey compared to other restaurants in the area. The portions are also a lot smaller for the same food menu. My boyfriend got the spicy chicken sizzling pot which came with a bit of rice on the side and some sides. We also got the kimchi potato pancake which was also small, looked like 6 small sushi rolls, and didn't have that same crispy texture as other restaurants do. I ordered a citrus tea and two small (rather tiny) fruit platters. Our bill came to about $50.00 which was crazy!

The service in the beginning was good, but we had to wait a while to get their attention. The servers are constantly speed walking around the restaurant, rarely checking back with customers if they need anything else, which feels like I'm eating in the middle of a cross walk."}
{"text":"The food is good (must confess I always get the same dish, baby octopus). The service is good and most of the servers are Asian which gives more character to the restaurant and the theme it represents."}
{"text":"The food is so good!!!! 
I came today for the summerlicious lunch menu for $18. I ordered the appetizer: Korean style taco, main course: beef brisket on rice noodle, dessert: green tea Icecream on mochi. The service was excellent, they offered us drinks and checked in on us every so often. As for the food, I have no single complaint. All was tasteful and delicious. Thanks Arisu :)"}
{"text":"I went to Arisu with my sister around lunch time today for Korean BBQ.The restaurant was fairly empty so we were seated promptly. We ordered the Arisu 5 meat combo, which was one of the less expensive combo, for $30 per person. The amount of food was good for two women. The service was good - they checked on us regularly and changed our grill once. However, I gave this restaurant 3 stars, because the taste of the BBQ meat and side dishes, were OK, but not good. This is not a place I would choose to go back again, given the many options for Korean food in the Annex. Arisu - please improve on the taste of your food."}
{"text":"Came here for Winterlicious on a Saturday night. We, 2 people, ordered Smoked Aburi Salmon Sashimi, Seoul style BBQ on Table and Anmitzu, which was ice cream with mixed fruits and red beans. The portions were really big and we could hardly finish all. We must recommend the beef here, very well marinated and juicy. Such a good choice to pair this meal with cold green grape Soju.

Great value and great atmosphere. The waiter was really polite and fast services. They changed grill plates for us almost every 10 minutes and we didn't need to ask for it! Definitely will come back here again!"}
{"text":"Today was my second time eating at Arisu. I went for lunch today with my parents and my partner and we ordered the Arisu BBQ combo consisting of boneless galbi beef short ribs, beef short ribs, bulgogi, sliced pork belly, marinated chicken breast, vegetables, soybean stew plus Banchan dishes & rice. The food was absolutely DELICIOUS as it was the last time I went with just my partner. The meat is extremely tender and tasty and BBQing at the table is truly lovely and endlessly entertaining in a family setting. I highly recommend Korean BBQ for dates and families! 

I rate the food 4 stars. I love the tofu stew and the banchan dishes are really tasty and fresh and make a wonderful compliment to the BBQ'd meat. My issue was with the service and the overall experience and after today I won't be returning because I'm very upset after receiving poor service and witnessing an incident that made me extremely uncomfortable.   

Our server was very aloof and inattentive although we were friendly, laid-back and patient. I worried that Arisu was understaffed because our server forgot to bring us coffee that we ordered and never checked back in to offer water or tea refills or check up on how things were going. He also wasn't attentive to managing the grill and switching over to a new grill half way through the meal to prevent it from smoking and to keep the meat from sticking and burning. He came by quite late in the meal to switch the grill plate for a new one and towards the end of the meal he swooped in just after we'd put the chicken on to grill and removed it when the meat had just started to sear. The meat stuck and the butter and marinade was lost in transferring the meat over and the chicken didn't turn out as tender after he scraped it off and transferred it to a new grill. It was disappointing and awkward. After our meal we sat awkwardly for a while trying to flag him down because our grill was billowing smoke after we cooked the bulgolgi and the marinade started charring. Very poor service! I wonder if it's a staffing issue...

We were sat in a booth by the window and we were upset to see two staff members shooing pigeons away from the side of the restaurant by knocking them with brooms. One of the birds was stubborn or possibly sick or injured and when it didn't shoo the staff member pummelled it with a broom until it didn't move and swept it under a bush beside the restaurant in plain view of where we were sitting. It was utterly horrifying to watch and we all felt badly. It was extremely unsettling and unprofessional to behold not to mention CRUEL and needless. How horrible, shame on them!!

We paid around $150 for four people for lunch and I expected much better service and professionalism and I won't be returning based on my experience."}
{"text":"Came with a large group and overall I would give this place a 3.5/5. We all got the $35.99 combo (comes to about $45 after tips and tax) and it was not bad. The meat quality was decent and we got a mixture of pork, chicken, beef and veggies (although not a lot). For me it was pretty filling but I can see how the portions could not be enough for a bigger eater. We also got a soybean paste soup which was good. 

The only bad thing was their dessert - it was suppose to be Korean shaved ice but the ice was a huge chunk that was really hard surrounded by sweet milk. I didn't finish mine. 

I thought price was a bit high for what we got, but it was still pretty authentic and delicious. Service was average."}
{"text":"Food was nice. Came here for lunch and though the service was nice, took longer than expected."}
{"text":"Nice place, Nice People.  The food was fresh and the slices of beef was great!! However!! The Menu is huge and complicated.  The staff don't speak English all that well, so communication was difficult.  

Paid over $90.00, for sushi and table bbq that says will serve 3.  The portions was small, very small.  You will leave hungry for sure. The location used to be a McDonalds.  Could have really gone for a Big Mac after this meal at Arisu, but sadly couldnt, as we spent $90 for a few sad slices of beef, few pieces of sashimi and maybe 5 California rolls."}
{"text":"If you are open minded like me and always look for something different, go to this place.  I have dined at Arisu many times and have always been very satisfied. Not like other typical Korean restaurants that only have limited choices, there are surprising amount of selections at Arisu. 
 
The food is fresh and the presentation is beyond expectation. Everything is delicious and the portion is just decent. Servers are very friendly. Overall this place is a delightful experience. Its my must go place whenever I am in the area. 

My favorite is the spicy sashimi bibimbap. It just tastes so good and looks very healthy. Their seafood lover combo is also pretty good but you might not be able to finish all of them yourself."}
{"text":"Food isn't that good. Everything taste typical, just avoid here. Service is lacking and the set up is weird. Spent 20+ dollars on each meal and everyone left hungry. Went to another restaurant straight after. Even the rice looked measly as though they picked every grain itself.  Waiter forget about my extra order until it was time for us to cash up. There are better places."}
{"text":"Showed up at 10pm and found out last call was at 10pm so we were allowed to order only if we knew what we wanted on the spot. My boyfriend and I came for the dollar oysters (max 6 per person). We originally wanted to look through the menu but that wasn't an option. The oysters were good, nothing extraordinary. They came with a fish sauce and a spicy sauce."}
{"text":"We went to Arisu last night for for dinner to celebrate two birthdays, the restaurant was recommended by one our friends who is Korean and he said it was really good authentic Korean food.

Since there were many of us, we ordered quite a few things off the menu but I will review the items that I tasted and we had on our table.

First off the decor  and furniture is really sleek and modern and with a few plasma TV's showing Korean advertisements.

The banchan came out first which was really good, fresh, a good variety (5-7 dishes) and was perfectly seasoned and not too salty.

Then came the main course the Arisu super combo for 4 ($98.99) which is a table BBQ and sashimi/sushi platter, the combo consisted of Beef Short Ribs Galbi, L.A Short Ribs Galbi, Bulgogi, Spicy Chicken Breast, Sliced Pork Belly, A Korean Soybean Paste Soup with Veggies, Assorted Sashimi, Assorted Sushi, Dynamite Roll, California Roll and Tempura along with white rice.

The Galbi and Bulgogi were amazing, they were fresh, were lightly seasoned, sweet but not sweet and really tender, the meat used for the Galbi is 'AAA' quality but keep in mind the prices are more expensive than other Korean restaurants because of this. The Spicy Chicken Breast and Sliced Pork Belly were also good but the meat was the main highlight.

The sushi/sashimi platter was good but not great, decent quality, decent cut but poor execution but nice plate presentation. if your looking for great sushi/sashimi go to Zen or Cafe Michi in Scarborough.

Service was above average and like most Korean places in Toronto, you get better and quicker service if you can speak Hangul.

Overall, I would say it's a pretty good higher end Korean restaurant, that does a really good job on Korean food and a decent job on the Japanese food from what I have tried (sushi/sashimi)."}
{"text":"I came here for dinner for one of my friends birthday. It was packed when we arrived so we had to wait about 15mins before a table was cleared up. 

It was cold and raining that day so I ordered soon tofu less spicy. When it came out, I noticed it wasn't boiling hot like other places and the egg was already in the pot. I prefer it this way as I don't really want to get egg whites on my fingers from cracking the egg lol. The soon tofu was bland and I think it was because the seasoning is all the in hot pepper paste. 

The service was okay, the server forgot the steamed rice for me and one of my friends. It was understandable because the restaurant so busy. After that we rarely saw our server but we did get the bill towards the end of the meal without having to ask for it yay. 

I'll probably come back again but next time I'll try the sushi options."}
{"text":"The place is clean and the food seems like quality but quantity and service is the worst I've seen in all my life. We were on a vacation and had great experiences in Korean bbq before, but this one is just not worth it. As soon as we sat on our table clients next to us had trouble with the check and problems with the quantity. When we received the check they charged us with a more expensive menu which we not order. it took a lot of effort to get a hold of our sever, terrible experience!"}
{"text":"Will never eat here again.  BBQ burned too fast with food sticking to grill pan.  Food just ok.  Service also just ok. Will not return."}
{"text":"I was introduced to this restaurant by a Living Social deal ($40 of food for $20). I have read that these come up often. Between Living Social and Groupon, you can find great daily deals to some hot spots.

We were warmly greated on a slow Saturday afternoon and they agreed to accept the Living Social voucher although you are to call ahead. Tip: They have limited seating for these deals especially during peak hours. V

I really liked the modern asian inspired atmosphere and large booths.

The menu consisted of traditional Korean and Japanese fare. There is also grills on the table to do Korean BBQ.

We each started with a seaweed salad and vegetable tempura. The seaweed salad was tasty and well presented. I was impressed to find a broader selection of vegetables used in the tempura like asparagus and squash. We also had a excellent selection of sushi rolls - the crunch roll is my recommendation. We were too full to consider dessert.

Our lunch was $65 plus tip, but $45 plus tip with the Living Social voucher."}
{"text":"My friend really wanted to come to this restaurant because of the soju. I'm never opposed to trying a new Korean restaurant so here we were. 

She ordered the grapefruit flavoured soju and WOW! It was amazing! I'm not a fan of \"normal/plain\" soju, but this flavoured kind was really good. It was also much softer, which is probably why I enjoyed it so much. I would recommend everyone give it a try. They also had other flavours to choose from.

I ordered the spicy bulgogi dolsot. The food arrived quickly despite the restaurant being very busy on this Saturday evening. My friend ordered spicy pork. There were many side dishes and the waitress was attentive.

I will definitely come back here when I return to Toronto's K-Town."}
{"text":"Wanted to try Korean BBQ since we were on vacation in a different area from home. Nothing special. 
Waitress was very rude:
She was forcing us to pay at 10:20pm, 40 minutes before closing. We were not even half way done with eating yet. She demanded us to pay, standing at the end of our booth, she didn't even give us any time after she gave us the check. She literally just stood there for almost 5 minutes as we just quickly looked through the bill to make sure everything was correct and didn't get over charged for items we did not order, then we had to pull out our wallet midway through our meal and grab money and whatnot, which is awful, considering money is so dirty, being touched by who knows how many people. After we've given the amount on the check, we were going to leave our gratuity on the table after we were finished eating, but she refused. She demanded us to pay the tip right there and then before she walks away from our table with the bill. After we gave her more money, she counted our tip, shook her head and gave us quite a dirty look before walking away and pulled over the dirty dishes cart, getting ready to clean off our table. HELLO?!?!? we were not even halfway done with our dinner yet"}
{"text":"This place was awesome. Delicious Korean BBQ. Succulent meat and some of the best service I've had in a long long time. Everyone was so sweet and helpful. Definitely worth checking out. Can't praise the staff enough."}
{"text":"Went here for winterliscious, not the Korean bbq although I might return to try that next. First off the device was excellent, quick and courteous staff made the entire dining experience relaxing. I ordered the steamed many, the veggie and mushroom stone pot for my main and the green tea & Michigan ice cream for dessert. Everything was absolutely delicious, highly recommend all of these items for fellow winterliscious visitors. My friend ordered the Korean fried chicken as him main which I tried- it was also very tasty but I was disappointed that it did not come with a side."}
{"text":"Interesting ingredients and big entrees. Came at 2:30pm for summerlicious lunch today and the place was vacant. Service is mediocre - no one checked on us ever, no one refilled our waters until we requested, no replacement of used napkins and cutlery. Service pros- food came fairly fast as did the bill, which came before we finished dessert, so felt rushed. 

For summerlicious the appetizers and desserts were super tiny! Luckily the mains were large. If you have hypertension don't come here because salt is the key ingredient. I liked my vegetarian cold soba noodles in shoyu broth, but omg it was so salty. My friends loved their skinless, boneless fried chicken (only 3 small pieces for the appetizer). The mains were definitely impressive, especially the salmon aburi lunch tray - my friends loved the sushi! My vegetarian bibimbap was decent? too - very unique ingredients were used, including raw kale, wakame, corn, mango, and fiddleheads for one of the 3 banchans. The organic tofu stew was amazing - not that salty actually and the tofu was between silky and firm, overall just a delightful stew. Note- I think mayonnaise may have been used on the bibimbap (not vegan).

Desserts were disappointingly tiny. The only non-dairy option was the watermelon slush, which is exactly what it sounds like.

They do have Korean BBQ here and a pretty extensive Japanese and Korean menu - might come back one day for their normal menu options!"}
{"text":"My girlfriend and I went to Arisu last night looking to fulfill a rather big hankering for sushi.  Yes, it's a Korean restaurant with Japanese options, and I typically stick to Korean dishes at such venues... boy am I glad I ventured into sushi land at Arisu!

First up, decor:  very spacious, huge booths, very comfortable benches, real orchids... it did have a bit of a chain restaurant feel, as it was just so polished, but in this case it was a very good thing.  Either they -- or a good designer -- put a lot of thought into the look and feel.  ****

Hungry as we were, we ordered the 48pc Snow...bird? Snow...wind?  I forget the name -- sushi boat, anyhow, with a variety of sashimi, nigiri, and maki.  We also had wakame salad, some miso, and ginseng red tea.

Wakame -- good but not great... pretty standard.  ***
Miso -- good but not great... though it did have generous amounts of seaweed, much more than the typical tiny shred. *** 1/2
Ginseng tea -- I thought it was a little weak, Heather thought it was a bit strong... odd we differed in that way.  It was still quite tasty, if a bit pricey for the amount.  I'll give it ** 1/2 with the caveat that it's certainly worth ordering and trying, though I likely wouldn't get it again.

So, while we're nibbling on our salad and miso, our server (an adorable younger girl who was very attentive and friendly) brings out a HUGE amount of banchan.  I believe it was nine small plates in all, each one generously heaped with a variety of tasties.  The amount was what I would expect for a table of four or even five.  We polished it off, and I remarked that banchan has always been my favourite part of Korean food, but I was surprised to have it offered when we ordered exclusively sushi as a main.  

Banchan -- easily a **** 1/2, some of the best I've had.

Now for the sushi boat, and what a boat it was!  Beautifully arranged, with extremely generous cuts of sashimi and nigiri -- I'm used to some of the cheaper sushi joints in Toronto, where a typical piece of nigiri is about 1/2 kilo of rice and a milligram of fish.  Arisu does not skimp on the fish, folks, and while you're paying (maybe) a little more for the privilege, you're getting great quality.  Fresh, skillfully cut, large portions, and most importantly, delicious.

Not a single misfire on the boat.  **** 1/2 for the best sushi I've had in Toronto, and the first time I've actually felt bothered to write a review.

And for the capper to all this, while we're enjoying our sushi, our server brings out another round of banchan!  I mean, here we are having already stuffed our faces, already been comp'd one large helping of banchan, and she brings us another round.  Really very generous.

Finally, we were there with a livingsocial coupon (presented upon arrival, before ordering), and we were treated exceptionally well, not like discount shoppers.  This is the first time I've used a group-buy coupon at a restaurant and felt as though I was being given top notch treatment.  

It seems as though the staff and owners at Arisu really want to impress, and are willing to go the extra mile to do so.  It shows.  We will definitely be back, and I hope this review inspires others to try them out.  Well worth it, coupon or not.

(All told, our bill came out to only $68 -- we paid $48 due to the coupon -- an absolute steal for the quality and quantity we received.)"}
{"text":"A few steps above the street level, upon entering you can smell the aroma from the table set grills. The decoration is of typical Korean restaurants but with a few modern twists, clean and inviting. The place is generously sized with a decent amount of tables, so you have plenty of choices. 
The main thing here is grill yourself BBQ, several different set courses are offered, with a la cart as options too. I personally prefer the marinated version of ingredients such as beef short ribs, pork, and sirloins, which are usually made with lower grades of meats. The higher grade and quality cuts are presented in their plain form with nothing added except a bit of oil. This I can appreciate but certainly feels bland ( arguably, the point is that you should enjoy these without any flavor distraction). Needless to say, everything is very delicious. 

We only had one sushi dish which is of a seasoned and torched variety, a bit too much rice in my opinion.   

As for drinks, I recommend beer which is typical with marinated BBQ dishes, since the meats tend to be sweat. I would also suggest Japanese Plum wine as well because they cleanse your taste bud very well   

Beer selection is small with your typical Japanese (Sapporo Asahi ), Korean and large brands such as Blue. Sake selection is decent but not extensive. A few Soju brands are offered too."}
{"text":"Good but not great. Subpar compared to Korean Village. Did not like the seolleongtang. I prefer it at Owl of Minerva down the street. Although, the tangsuyuk is pretty great."}
{"text":"I came here for a birthday dinner yesterday. My reservation was for 6:00pm for 9 adults and 1 child. I arrived 15mins early and everyone with the exception of 2 did not arrive yet. The waiter came over and notified us that we would have the reservation until 8:00pm. However, out order was not put through until 20mins later. We were waiting our refills for about 10 mins and some of our orders was forgotten. The winterlicious menu wasn't great. The sides were not FREE. Most of Korean restaurants offer FREE tea and Korean side dishes. The tuna tataki was not fresh. The meat cuts were very fine and was not substantial. Overall service was mediocre. - Would not come back due to BAD service, no parking and food was not great."}
{"text":"Amazing restaurant with gorgeous food. The owner is very nice, a hard working big guy!) Thanks for the great food :)"}
{"text":"[UPDATED REVIEW!!!] So I recently wrote a review for this place and rated it 3 stars but my recent experience has made me so angry that I just had to write an update.

I came here with a bunch of friends for the bison & kobe platter. Since it was recommended for 2 people only, we decided to order 2 platters so there would be enough for everyone. We were given tiny (like half the size of the palm of your hand) pieces of beef which were FROZEN, unmarinated, unseasoned. There was not enough meat for the 5 of us, I don't even think this would've been suitable for 2 people. If I wanted this trash I would've just cooked my own frozen meat for a fraction of the price. 

The platter was also supposed to come with a miso soup, rice, and veggie wraps. The waiter \"forgot\" to bring all of these items. I put forgot in quotation marks because on my last visit he also forgot a lot of our items. We had to call the waiter back twice before we were given the miso soup and rice. However, we were only given 1 miso soup and 2 bowls of rice which is incorrect. We SHOULD'VE received 2 miso soups and 4 bowls of rice since we ordered TWO platters instead of just one. As for the veggie wraps, we found 2 shrivelled up pieces of lettuce on the plate (covered in beef blood)....... do I need to say more??

After we were done cooking the meat but still cooking the onions, the waiter came and turned off our grill.... even though we were still cooking. We later tried to call again for the veggie wraps (seeing as they only gave us 2 pieces of lettuce instead of 4) but we were ignored. 

Finally when another waitress came to give us the bill she had the audacity to ask us for a tip and then mutter to her coworkers in a less than friendly tone when we politely refused and explained the situation to her.

TLDR: Spent $130 a tiny platter of frozen unmarinated meat. Served dried up leaves covered in blood. Waitor forgot dishes that came with the order. Left hungry and disappointed. DONT GO HERE FOR KBBQ."}
{"text":"I'd say one of the best Korean BBQ's in the city. The only reason I didn't give this place 5 stars was due to the slow service.  The waiter was friendly and very polite but was unattentive because he had so many othe tables to look after on his own. I had bought a groupon for this place and thought I'd check it out because its one of the places I still haven't been to. We had the BBQ set for two people. The banchan (side dishes) were fresh and they had a good selection! The portions served were perfect for me and my husband. I bought a couple more groupons while I was dining there because I really enjoyed the food. I'd definitely go back even without the groupon deal. Their menu is not only BBQ but they have a mix of great traditional Korean items as well has Japanese dishes!  I'd want to go back and try the other items on the menu but I think I'd end up getting their BBQ because its just that good!"}
{"text":"I almost forgot to write reviews of this restaurant. My friend and I came there for summerlicious and all choices come from lunch menu. To be honest, it was not bad but such price can have more delicious and greater portion of Korean food in other places nearby.

The arisu sushi was the best of all dishes, it looked really beautiful and tasted yummy too. But other dishes were a little disappointed. Cold noodle was ok, pancake was only two small pieces, dessert was tasteless and seaweed salad just like package food in supermarket.

The service was not bad because there were few tables of customers in lunchtime. I would not come back, more better choices in Korean town."}
{"text":"Wanted to just update plus 1 star! 

I still haven't tried the regular menu but as I said before, I think it's much better than the summerlicious menu offered here. My review was soley based on that experience and food we were served. For a quick over view, we didn't have a great service experience, apps and mains were great (soup was very very good) and dessert was very disappointing. I would want to try the regular menu and skip dessert :)

Although I am not likely to visit, simply due to it being a bit farther away for me, the customer service manager had welcomed us back. I appreciate that he still took the time to look through his reviews and try to amend a bad experience, even if it was almost 6 months ago. Definitely something to love about this place :)"}
{"text":"It's quite expensive but I've have never had bad quality. You definitely get what you paid for! Always nice service and the dishes look absolutely beautiful. The sushi is probably what they are known best for but they have some good Korean food. But I would recommend going to other places for Korean food unless you are looking for just fancy dining."}
{"text":"Not bad - we went for the set Korean BBQ lunch which includes galbi short ribs, L.A. beef short ribs, beef bulgogi, pork belly and chicken with ssam wraps, rice, stew and bunch of banchan for $25/person.  It was quite a bit of food - but was surprised to learn that additional veggie wraps were extra.

To be honest, the BBQ was pretty unremarkable.  However, service was excellent.  They changed our grill about 4 or 5 times while we were there and we never grilled on the same grill more than once or twice."}
{"text":"Good food, good service, interesting combination of japanese and korean food. A bit pricey compared with other locations...overall a good place to go."}
{"text":"Not bad I must say. Located in Korea Town right outside of the Bathurst Station, it is pretty convenient. I'd gone for dinner in a Wednesday. It is a Korean/Japanese place, so it wasn't really vegetarian friendly albeit have a couple of vegetarian options. For a sushi slash Asian fusion place it was a tad on the pricey side. 

We'd gotten the Philadelphia Roll, Dynamite Roll and Kimchi Roll (I'd cheated being vegetarian today as there weren't many good veggie alternatives.) It wasn't too bad. The presentation of the sushi rolls were definitely top notch, but the quality, I felt wasn't reflective of the price I paid. It was pretty tasty, but I've definitely had better for a better prix.

Service was pretty poor, considering how empty the place had been compared to the attentiveness of the waiter to our needs. But it was satisfactory. We had to wait a while before we could make our order (we'd been famished) and we ended up going to the cash register to settle the bill rather than the waiter coming to us, adding to the waiter's attentiveness to our needs.

But overall, the restaurant itself seemed pretty modern, with each table adorned with an individual hot pot, and the decor of the place itself. It was clearly well maintained. One reason I would come back is for the $3.50 Sapporo pints (Monday to Thursday). It would definitely be a great place to host a group of friends for cheap drinks in a \"fancy\" place."}
{"text":"I recently discovered this Korean restaurant and now it's one of my faves. Everything is so good including the seafood pancake, their hotstone bowls, and a highlight is definitely their bbq. They use only the best meats that are local and organic.  You can definitely tast the difference. Their menu is big so lots to try and there is plenty of seating."}
{"text":"Pretty wonderful birthday date with the lady here and a few friends. I must say it was quite the delightful experience, also it is on the pricier side of the table as the menu is a la carté and not all you can eat. 

I really enjoyed the sashimi platter here, very generous thick cut fresh sashimi. You get what you pay for here. I found the portions to be fairly reasonable for the cost. 

Pretty neat place to go to If you haven't ever been before, they have the options of eating sushi and Korean barbecue. I've had both. The barbecue, I do highly recommend. Our party did order separately, but me and the chick had the set meal for two which was 39.99 per person and a sashimi platter. 

We also ended up getting some desert since it was my birthday. Very friendly staff sang me happy which was greatly embarrassing and funny at the same time. I would come back here again to try different dishes. Great venue for events or parties. They even have a private room in the basement."}
{"text":"A friend and I decided to go to Arisu for Winterlicious dinner since he had previously gone before and had a pleasant experience. I know they left him with a bad impression after this time.

What I ordered: mung bean jelly bites for appetizer, which was served with kimchi, mushrooms, chives and Yuzu dressing. This was basically the only good dish in the entire meal. For my main course, I had veggie delight dinner box which was subpar. It's good that this restaurant has vegetarian options, but it was too drab. For dessert, I had red bean porridge with rice flour dumplings.

Well, it was supposed to come with rice flour dumplings but there weren't any. Seated on an uncomfortable bench and did not offer us to change to a booth seat when there was an available one even though I asked. The most infuriating thing about the entire night was the service. Waitress asked if I wanted the dessert to come when the main course had just arrived. Who eats dessert when their main course just arrived? So I said no, it should come later. Then another waiter comes and tells us to let them know when to bring out the dessert. My dinner partner and I kept getting the feeling that they wanted us to leave. I'm certain two hours for a Winterlicious dinner is not a long time. Why should we be in a hurry when the entire restaurant wasn't even full? Then the waitress brings out the dessert and starts collecting our utensils and main course when we didn't even ask her to! What the hell is that! To top it off, when giving change, we gave her two $50 bills and the change was two $20 bills, a loonie and a quarter. How do you expect us to give you tips? Good idea, we should leave you the loonie and quarter right? Because there's no way we would leave you the 20. However, I'm not mean to servers even when they offer really bad service, so we still paid around 10%. Your fault we did not tip above because of how you gave us the money, not everyone carries spare change around. Terrible experience, do not go! This restaurant should not participate in any Licious events ever again. I will not be returning."}
{"text":"I'll be honest: I'm not the biggest fan of Korean Barbecue. What, you want me to cook my own food? I could just do that at home!

My unreasonable bias aside, Arisu does Korean Barbecue extremely well.

I had purchased a dinner-for-two Groupon that, as we eventually learned, comes with a *ton* of food.

We went with the \"Taste of Seoul Combo\" and honestly there's just too much stuff to list, so I'll instead go over the highlights:

Spicy Salmon Salad: This was much, much better than I expected. I thought it'd be just a sad little salad with a few pathetic pieces of salmon thrown in, but instead it's an entree-sized concoction with an absurdly generous mound of salmon atop a very tasty salad. (I don't know what that dressing was, but it was seriously delicious.)

Sweet & Spicy Chicken: These were basically deep-friend chicken balls, but they were a definite cut above the usual item of this type. The sauce, of which there was plenty, was indeed quite sweet but it was also impressively spicy, too. In retrospect, I wish I'd eaten some of this with the included rice.

Japchae Noodle: I'm usually not crazy about glass noodles, but this dish actually worked quite well. The food arrived piping hot and the accompanying sauce and veggies were a tasty addition.

The various meats we got for the purposes of tabletop barbecuing were all quite good, although the standout was the very tasty Spicy Chicken. Some of the other cuts, though edible, seemed to have their fair share of bad pieces throughout.

Dessert was a scoop of green tea ice cream, which, although I only ate a couple of bites, was a good way to end an extraordinarily filling meal."}
{"text":"Best tasting and quality Korean food in town. Service is also excellent. Considering their high standard, everything is very reasonably priced. We come here 2-3 times/week and everything on the menu is so good we never get tired of it!"}
{"text":"If you ever want kbbq DO NOT COME TO ARISU!!! 

My friends and I were looking for a place where we could enjoy some nice korean barbeque and we thought arisu would be a very nice place where we could satisfy our cravings. But spoiler alert it did not. I dont remember the exact platter name we ordered but we ordered 2 rounds of it since it was only meant to be for 2 people. Well when our meat finally came, it was frozen. yeah thats right FROZEN. with no marinade or anything. There wasn't even that much meat, i mean for the price that they were charging us we we're expecting a lot more, & we deserved a lot more for paying 100+ $$ for basically 2 pieces of beef. 

Another thing that left be baffled was that in our little platter thing that we ordered it said that it came with \"veggie wraps\" but they were just 2 limp pieces of lettuce covered in the blood of the frozen beef that was slowly defrosting. They also forgot to bring bowls of rice.  The only thing that we actually enjoyed was this spicy soup but it was still not enough to satisfy our cravings. 

Do not make the mistake by coming here for bbq, im sure there are many places that serve delicious bbq for under 100$. We left with a lot of regrets. Im sure they have other great food but i honestly dont recommend the platters for the bbq. TRUST ME OK esp if ur ballin on a budget."}
{"text":"I went here with a few friends, I  didn't get any food. The server and host were extremely friendly and that was cool. Friends got food, they seemed happy enough with it. I got the... I don't even know what it was.. a ginseng honey yogurt thing...?... That tasted like none of the ingredients and the only taste familiar was that it was kind of like rancid olive oil (yes, olive oil goes bad!). The taste was neat, but the aftertaste was like a fire that someone had pissed in. I think that's the best way to describe it."}
{"text":"Service: 0 stars
No water was served for our first half hour. Servers, some more than others, were rude. The sun got in our eyes and one server got angry at us for lowering the shades... Her reaction was unwarranted. When we placed the order, the server kept pushing us to order more... That (to me) was annoying. When we called for the bill, the server made a big deal about having split bills, specifically saying she didn't want us to split the bill. 

Food: 2 stars
My group did table top cooking, and the only foods I would recommend are the galbi... The flavour was fantastic. I really liked the ribs (second one listed on the menu, I believe). Pork belly wasn't bad either. They were quite stingy about the banchan. Relative to the portions they served, I find the menu overpriced. 

Overall, it was an okay meal because of the food, but I wouldn't be back."}
{"text":"This was the message I received from the manager from Arisu blaming our bad experience on a \"trainee\" and asking me to take down this review because they are all \"hard working people\" without addressing any of the real problems. Other than replying to these reviews on yelp, I suggest management actually start to operate the restaurant better and provide legitimate training to their staff. 

\"Hi Arc, Chloe L. sent you a message on Yelp:
Subject: Your Review
\"Hello Arc. Thank you for your  comment. Also. sorry for the happening in here.
One of our new trainee didn't prepared well enough before get into the work,so  he caused  discomfort to your table. I really apologize for that. now the person is doing lot better than before with little bit of confidence. The beef combo you ordered   is always  serving without marinating because it is different kind of selection. please aware for next time.  The promotion things  I have to apologize again nothing else. After that night we had a  special meeting to  enhance our  systems and memories..Please accept our sincere apologies  And  if you have time please visit us again ,then we don't mind to take care of you.,Also if you  don't mind please think about removing review from the page for the hard working people in here for  try harder and better. it will be a great encouragement for them.\"
\""}
{"text":"This is probably the best tasting Korean restaurant on bloor. The prices are slightly higher but the quality is clearly better. All the meats are high quality and delicious and the baby octopus with rice that comes in a hot stone pot with rice keep me coming back for more. The music playing in the background at the time was a Korean traditional instrument playing pop music which was pleasing to my ears. I can tell this place pays special attention to detail."}
{"text":"I enjoyed the food, the service, and the overall atmosphere and design. The price relative to food was good.

The food quality and taste was overall good. Nothing that was in your face outstanding, but good. Just your typical tasting food. 

Wait time was decent. Servers were kind, and checked up on us. 

Interior design and atmosphere was quite nice, and representative of the type of food they were serving relative to culturally inspired designs and layout. 

Conclusion: Good food, service, and atmosphere. The only bad thing is that I could also go to other stores and get the same type of food, with similar tastes and quality. Therefore nothing that stands out, but overall still good since it's an accumulation of decent food at relatively good pricing."}
{"text":"3.5/5, +.5 for service

Arisu was my only Winterlicious stop this year, and it was certainly worth it.

I came in with a large group of 12 people, and we were accommodated quickly and efficiently. Both the Winterlicious menu and the regular menu were offered that night, so there were a huge assortment of choices available for our large party. After careful thought, I stuck with the Winterlicious options. I had the Japanese pork belly, Seoul-style sushi and maki roll, and the yuja cha + mochi ice cream.

Despite it not shown on the menu, the waitress gave us all complimentary miso soup, as some of us ordered from the regular menu and the waitress figured we should all have the starter soup regardless, which was definitely nice of her! The pork belly was decent, however the portions were a little smaller than I anticipated as I somewhat expected 1-2 more pieces. What started out as slight disappointment was eradicated when I saw the Seoul style sushi and maki roll...they were some of the most unique sushis I've seen! To make it even better, they tasted delicious! Definitely some of the best sushi I've had for the price point. Finally, the mochi ice cream tasted very good, but I could've done without the yuja cha.

Service, as outlined already, was excellent, and our large party was attended to the whole way. With the relatively excellent food here as well, I will definitely return."}
{"text":"QUITE pleased with this place after one visit for lunch. I was hungry and ridin' solo, so I ordered a green tea and the Roll Bento, which turned out to be a really good bang for my ($10) buck(s)! The bento box came with California, spicy salmon and tuna maki rolls, plus salad and miso soup. By the end of the meal, I was satiated, plus my taste buds and wallet were really happy. I shall definitely return soon."}
{"text":"Used to go to Miga, which stood in the same place as Arisu today. Assuming that it was run by the same people, I expected an enjoyable dining experience tonight. Well ...  Arisu is apparently run by another owner and has no ties to former Miga in any way, shape, or form. 

As it's called an izakaya, I expected a lot of Japanese tapas with a selection of drafts on tap. The quintessential yakitori sticks were nowhere to be found. The bar menu was scant and pricey. The Korean BBQ was bland and rubbery.

My experience here was hardly worth the price I paid. It doesn't cost an arm and a leg, but the bill is still substantial."}
{"text":"A friend chose this place during Winterlicious, and I'm happy she did. Throughout the whole meal, we just kept repeating how it was life-changing. Staff was friendly, and the owner even came to help us grill our meat the way that it's intended to be cooked. 

We started off with the Tteok Galbi (\"Minced & grilled beef short rib\") as our appetizer, chose the Gyu Katsu as our main (\"Flash fried beef cutlet to be grilled at the table served with steamed rice, salad, dipping sauce\"), and topped it off with the Mochi Ice Cream for dessert (\"Ice-cream covered with rice cake served with green tea\"). 

I don't usually go all the way downtown for restaurants (out of pure laziness) but this is definitely worth the drive/commute. The tteok galbi was so flavourful, along with the lightly dressed salad it came with. The gyu katsu was the life-changing course of this meal. With the help of the owner, we were able to explore a different way of grilling the beef, and he even forced us to use the wasabi. The wasabi wasn't like the annoying bits that accidentally touches your sushi, it wasn't spicy at all and added a unique flavour to the meat. The mochi tasted \"authentic\" in a way that you couldn't get from regular freezer mochi from your local asian grocery store. The green tea that was served with it was definitely needed after a filling meal."}
{"text":"The food here was phenomenal!

We had a group of 4 and ordered a 4-person meal for approximately $120. We added some sushi on top, though I don't know why as there was a ton of food already! The price point is very reasonable for the amount of food you gets and the food (in particular the bugolgi and kimchi) was amazing. 

Will definitely be going back (and will be traveling to Toronto from Oakville specifically for this restaurant)."}
{"text":"Came here on 02/07/2015 for Winterlicious lunch with my girlfriend. $18 for lunch sounded like a great deal and I grew up on Korean food (I am Korean) so I thought it would be a great place for us to try.

The first thing we noticed when we got in, was the decor was more traditional than we thought it would be, the outside sign makes it look more modern, but I'm a fan of traditional. The hostess was quick to seat us and throughout the meal, the service was good.

We both had the japchae for our appetizer as it is a favourite of ours, and we both definitely enjoyed it. I appreciated the hot pepper shavings they put in for more flavour, was a great touch to make it look pretty and taste a little better. My girlfriend had the bibimbap, which was above-average. They used clearly fresh vegetables and I appreciate that they put in white rice and the red/purple rice that many Koreans grew up on, tasted very refreshing and the colour made it look better too. I had the galbi roll, which was tasty and had a great soft texture, but I thought the meat would be a little more prominent. Probably the only disappointment, which wasn't even that much of one. For dessert, I had the ginger ice cream with the burnt rice crisp (it's supposed to be burnt) and I really enjoyed it, reminded me of nurungji which paired very well with the ice cream in terms of the crunchy texture. My girlfriend had the sweet potatoes, which was quite a small portion, but they cooked it with caramelized sugar, and it tasted quite good.

Overall, the experience was good, probably will come sometime to have some samgyeopsal when the craving hits.

Food: 4/5
Service: 4/5
Location: 4/5"}
{"text":"The food was delicious and flavorful. I liked everything we ordered.  
The customer service was wonderful. They were very friendly and were always there when we needed their assistance without any wait time. 
My boyfriend dropped a chopstick and before he looked up to ask for new clean ones a server was there with new chopsticks and napkins. 
Also, all the server dudes looked like they were from a  K-pop boy band which was cool... IMO LOL"}
{"text":"The search continues for a good Korean restaurant that doesn't dump MSG on every dish. Unfortunately, Arisu won't be our go-to, but it was good. 
Other reviews have mentioned this, and I agree about the prices being a bit too high for the quality and quantity. 
We ordered the Seoul style spicy Korean chicken, pajeon, salmon oshi, dynamite roll (so embarrassing, I'm so basic when it comes to sushi), chicken yakisoba and seafood soon tofu stew. All, once again, were good but not incredible. The oshi was definitely the best dish, compliments to the sushi chef! 
Our server was pleasant though, and the place was clean and didn't reek of barbecue and smoke upon entering, like most other Korean restaurants."}
{"text":"Wow...unbelievable. My first time commenting on Yelp, But I just just had to. We ordered Korean bbq and it doesn't even come with the basics. There were only a couple of lettuce and for the price it didn't come with hardly anything. When we complained their excuse was that they serve mostly Caucasians there. And they said they had dessert for us with the bill but they brought us mint candies. We had 6 adults and ordered 6x bbq. Please don't experience what we did."}
{"text":"Good food, kind waitresses, a little pricey considering the other restaurants nearby."}
{"text":"Here we have another quasi Japanese/Korean restaurant that is confused on its offerings while trying to roll out classic traditional food. 

The menu is pretty long, and kept most of us guessing as to what we wanted, it was a mix of various styles, with some staples. I'll admit the food was fresh, but it was bland and poorly seasoned which is a big no no as far as Korean food is concerned. All the spice and flavor profiles simply went out the window on this one. 

The sushi on the other hand was just right (as it has very little seasoning to begin with). I cant say that I would recommend the Korean side of what they try to do here but since most average people have trouble with regular Korean spice levels, Arisu tries to satisfy both purists and tourists.

If you're ready to feel the burn, go somewhere else, get really spicy and tasty Korean food and have a blast"}
{"text":"Brought my family here for dinner. It was sooooo good! The meat cuts were nice and thick.
I like how the owner explained to us how to typically eat Korean bbq and what the traditions were. The food was very flavourful but the odd meats were a bit salty. Absolutely loved the Korean beef rib and the banchan"}
{"text":"Where to begin, 
Booked a large party of 20 people for aome korean bbq....half of us being korean, and this being a korean resto, I guess we expected too much Korean hospitality because we got none of it. 
We ordered alot....and were not full, because the meat is not be 1 persons portion like every other legit korean bbq restauurant but in grams. 100grams of whatever meat you pick, i.e. 6 slices of inch sized pork belly per 100gram, no where near enough. 
Lettuce refills for samgyupsal are not free....and they give you a very limited quantity of 5 lettuce leafs...banchan is also only a one time refill....
Food was meh, atmosphere was meh, and pricing/menu was way over priced! I can name so many better korean bbq restos uptown way better then this place. But the lady serving us worked hard to keep our group somewhat satisfied....so the service was good i guess, until she gloated about how well they treated us..."}
{"text":"Service was phenomenal, our waitress was very patient and informative with the menu. 

I was excited to try the Bibimbap Salad with Spicy Sashimi. It was a plate of veggies with a handful of diced fish and sliced crab with a bottle of \"spicy sauce\". Not really worth $16.99 but it was surprisingly filling. 

The bento boxes were also very good!! The bulgogi was delicious. 

The food is quite expensive, but it's worth the quality. They have an extensive menu and I am looking forward to come back to try something new."}
{"text":"Service is not great. Food was decent. Wouldn't recommend nor would I ever come back."}
{"text":"I am gonna go with 3.5 stars.

An imposing facade drew me into Arisu the first time, but I've been back since. It's a very spacious and shiny place especially compared to most of the other ethnic places on my favorite part of Bloor West.

The first time I went in, it was pretty late and I didn't want bbq (hella more expensive than the other bbs around town) so I scrolled through their extensive menu and went with the spicy bim bim bap salad: a smattering of different sashimi meats on a salad bed. It was definitely not spicy, but very healthy and filling.  HOWEVER, there was a long piece of black keratin aka hair, in my salad. I am not too fussy, so didn't say anything about it to them.  Overall, I wasn't a big fan of the salad. Maybe, I just need to get used to it.

The next time I visited, I went with someone who likes Korean food but likes big shiny places. It was late on a Friday night, the weekend before Christmas weekend. So Arisu was packed. YET, the very courteous staff somehow got a booth for our aching feet!

We ordered the shrimp tempura and I ordered the spicy pork bim bim bap and my friend ordered the shrimp bim bim bap. THE GOOD: Sizzling and aromatic both stone bowl dishes were, with abundant shrimp, pork and veggies. THE BAD: Super oily, the rice clumped up at the bottom and became brittle hard, the food took forever to cool down. I have nothing against the pork bim bim bap here, but I've had better, in Africa of all places (I swear! I hate it when people bandy names of exotic places in a blase, show-offy manner). I loved, loved the little Korean place which apparently the Korean president loved to visit whenever he was in town!

The staff at Arisu has been consistently awesomely polite and attentive; very filling food; the small platters are great especially the fish strips, and ergo my experience has been pleasant both times. Food could be better, but the staff is: Woohoo! It's as good as it gets!"}
{"text":"Went to Arisu today for Summerlicious. Boy was it good!

The server immediately greeted us and led us to a reserved booth by the window, with menus already placed on the table. We ordered quickly and were served water relatively quickly as well. 

The Summerlicious menu is a great sampling experience at only $18/person for lunch. We had the salmon tataki and Korean tacos for starters. We thought they were a bit small, but the flavour was ok. Typical Asian fusion flavours with nice plating. But with the two following courses, the size of the starters was not really a problem. 

We then got the Korean lunch tray and the ox bone noodles and were very pleasantly surprised by the variety and the quantity. The lunch tray came with soon tofu stew, nicely grilled juicy boneless beef ribs, multicoloured rice, and 3 types of mini side dishes (bean sprouts, kimchi and anchovies with nuts). The flavours were fantastic. The ox tail soup was a tiny bit on the salty side, but the nice big chunks of slow cooked beef definitely make up for it. It came with a generous amount of rice noodles which I couldn't finish. 

The dessert was ok. But we were very impressed with the amount of attention put into the dishes so the flavour was not the biggest concern. We had the green tea mochi ice cream and the ginger ice cream with rice crackers. The combination was interesting, but it's nothing spectacular. 

The owner (or so it seemed) came around to each table to greet everybody and told us little stories about Korean food, which was a plus to the experience, as we felt that we were treated personally and attentively. 

Overall I would definitely recommend this, especially for Summerlicious."}
{"text":"Came in today with 2 co-workers on our lunch.  I ordered the Curry Chicken Bento Box.  Probably the best tasting items on a bento box I ever had.  Came with miso soup on the side (can't go wrong with Miso).  Curry chicken was a chicken breast with curry on top and sliced vegetables (peppers, mushrooms, onions, etc.) Delicious!  Real white chicken breast too not \"pretend chicken\" lol  

Small portion of rice which was perfect as that's all one needs.  2 really delicious dumplings; a small portion of salad (nothing to write home about); 3 California rolls (not bad).

ON the table, they put a few dishes for us to share (little portions of Kimchi, another little portion of bean sprouts; tofu; wheatgrass, fish portion).  Very nice addition to our plates.

Overall, Great meal, great service and quick.  Best part for me was the delicious chicken breast."}
{"text":"Very nice good - we had the winterlicious menu with Korean table bbq and we had four different cuts of meat, with appetizer, soup and rice, plus dessert! Service was great and food was delicious! The rolls were great too:)"}
{"text":"I have never walked out of Arisu without swearing that I'll have more self control the next time. Regardless of whether we order the Korean barbecue set dinner (which says it's for two people, but could really feed six), an assortment of a la carte appetizers izakaya-style, or humongous entrees that come with soup and salad. No matter what you end up ordering, you're guaranteed to first half-stuff yourself with more appetizing side dishes than any other Korean restaurant in the area offers (that I know of).

The service is excellent when it's not too busy. The servers are extremely attentive when you have their attention. It can be frustrating sometimes though when it is clear that there are not enough staff on the floor to work a full house. Two-tiered trolleys are then used to deliver multi piping hot stone bowls of soups as well as (hopefully different ones) pick up the numerous dirty dishes.

The decor is considerably more polished than a number of other Korean options on the same strip. Arisu is a great choice if you don't have any specific cravings in mind (like soon tofu or fried chicken) and want to have the benefit of a large menu to choose from."}
{"text":"This place is Amazing! If you love Korean and Japanese food and can't decide where to go that night or what to eat, BINGO you found your spot!

The sushi is really incredible there I must say, and the price is great for the quality of food. All the Korean dishes come with all your sides. The Kimchee is nice and spicy which I love. Also the starter soup they give you is delicious and they even add some noodles in it which most places don't! 

The wait time Is not fast, but also not slow... Its average I would say, but definitely worth it for the food. I came here once and had to come back the next day!

They seem to be busy each time I went which was a Monday and Tuesday night, so Im assuming they are usually always busy. but either time didn't have to wait for a table, might have to if you are planning to come at dinner time especially on weekends. Also I saw they have good Lunch time deals that might bring in some crowds as well.

Overall Love it."}
{"text":"Stumbled upon this place for a Saturday lunch when we were turned away by the long line at Sushi On Bloor.

I'm so glad we came here!
Modern decor, and not too busy.

Their lunch specials were priced just right. I opted for the Salmon Bento $11.99 and the boyfriend got the Bibimbap $7.99. We didn't even finish all the food we were pleasantly stuffed.

They have an extensive menu which included a very expensive Korean BBQ page. I wasn't too sure how it worked but I remember reading that you needed to have at least 2 orders per meat (1 being priced at $25).

Washrooms are downstairs, next to the giant party room (I really feel like they should turn that into a Karaoke place at night) which are very clean. (Tough to find especially downtown!!)

Service was a little bit slow, especially since it wasn't too busy. There are buttons on each table to get a waiter. 1 second after I pressed it someone came running. I felt embarrassed as it was a loud \"ding-dong\"."}
{"text":"My gf and I had a great time at Arisu. We had a Groupon voucher and decided to try the Table BBQ option with beef, pork and chicken. I was able to make medium-rare beef the way I like it, while sipping a bottle of Asahi. Arisu has an extensive menu with lots of options to choose from, encompassing Japanse and Korean cousine. It's somewhat on the pricey side, but the food is worth it. You should definitely check it our if you're in the area."}
{"text":"Had dinner with the girls at Arisu on a Friday night. They put us in a basement private room since there were 8 of us. The table was just downright awkward and there was no bell, so the poor waiter had to keep looking every 5 minutes to see if we were ready to order.

I ordered this absolutely disgusting Korean stew - it sounded really good on the menu but ended up being a miso style broth with 3 measly dumplings and at least 2lbs of korean rice cake noodle. Super boring and bland.

My girlfriend had a catfish stew and the fish had all the bones left on, it took her 30 mins to pick apart the fish just to eat it, so she was not impressed either.

Some of the other dinners looked MUCH better. The sushi was good quality. The banchan (Korean side dishes) were also very fresh and nicely presented. 

Price here is very high for dinners (lots costing $25 per person) which is pricey for this neighbourhood. It does have nicer decor and good service, so it's a decent option if you're not into the cheap and cheerful type Asian dining. But next time I will go to a cheaper option with better food (Buk Chang, Sunrise, Thumbs Up, Kachi, etc)"}
{"text":"The Good:

-           Extensive menu of Korean and Japanese cuisine
-           Combos
-           Service
-           Daily specials
-           Quality of meat

The Bad:
-           Grill got burnt too fast - changed grills at least 5-6 times
-           Kimchi tasted watered down
-           No ventilation
-           Quantity of meat

It was quiet here on a Sunday night at 6pm when we first arrived. My first thought was - wow, there's too much food to choose from. But we went with the Better Together - BBQ & Sushi Combo For 2.

At the price of $79.99, it came with: Arisu Beef Short Ribs Galbi + Boneless Ribs + Bulgogi + Assorted Tempura + 6pcs assorted sushi + 4 pcs assorted sashimi + your choice of dragon maki roll (black/green/red) + ssam (veggie wrap) + dessert drink + miso soup + rice + banchans.

I started off with a red ginseng tea, which was very interesting and very different from Chinese ginseng. The salmon sashimi's cut was too thick, but all the other sushi and the black dragon roll was good (they had red tuna). And then the table cooking! For $79.99 you would have thought that the meat portion would be a lot bigger. Anyways, the meat were all perfectly cut. Nice and thin. Yes, some of you would be like.. the thicker the better! It's so small! Well.. no. It actually tastes a lot better thin. The quality of the meat was really good. Especially the bulgogi. Marinated to perfection - not too salty and not too bland.  If you're looking to stuff your mouth full of meat, you're better off going to an AYCE Korean bbq restaurant. But I guarantee the meat texture and taste will not be the same. The only thing I want to complain about is that the grill got burnt TOO fast! We cooked 4 pieces of meat and the center got all burnt within a few seconds. We had to change our grill 5-6 times. Luckily, the servers were amazingly nice and attentive every time and offered to change the grill before we even asked them to. Service 5/5 right there! There were quite a bit of banchans - peanut, cucumber, kimchi, tofu, and bean sprouts. I was kinda disappointed at the kimchi.. It tasted very watered down, which made me question - are authentic Korean kimchi supposed to taste watered down?! I'm assuming not. Finally, the dessert drinks - cinnamon punch. O_O...... It wasn't disgusting.. but it wasn't amazing. It literally was just ...[dot dot dot]. An eye opener drink. A taste I've never had. Apparently cinnamon punch is a traditional Korean fruit punch. Hm, interesting. Well, I certainly don't know how to drink it but I'm sure a lot of other people would love it.

Overall, we had a good time. The food was good, but unfortunately it didn't wow me enough to make me want to drive the distance to come back again. Perhaps if I happen to be in the area then yes, I would go back."}
{"text":"My first Korean barbecue experience. The place was very nice, food was delicious and service was fast and friendly. I'll try Korean barbecue again but likely at another spot."}
{"text":"So we rolled around K-town during chrismas holidays hoping restaurants would open... Thankfully we blindly ran into Arisu. I can say hands down, Best of KBBQ in the city.

Top notch meat selection. TONS of variety and selections. And also many different combos to mix and match if you want to try different things. It is pretty pricey tho as you order plates of meat at a time and you get a limited amount."}
{"text":"Arisu is not a Izakaya as it tried to brand itself when it first opened... now it is really a Japanese and Korean restaurant.

I was hungry as usual after the October 30 day Challenge party. Korea town seems to be a good options as places are closing late and the price point quite reasonable. Then I saw Arisu....

Nice Korean staffs here were really friendly. I think wait staffs usually nice to me especially when I am dining alone... maybe they feeling sorry for me?

Seafood Soon Tofu ($7.50)
- tons of seafood: squids, little octopus, shrimp, mussels
- Tofu though a little overcooked, not as silky as it suppose to be

The well prepared Banchans were super fresh and tasty. The owner kept asking if I need more and happy to give me as much refills as I need.

Lunch Specials seems to be a much better deal compare to the dinner menu, maybe I need to come back to try out other items on the menu."}
{"text":"Came here on a Saturday and the place was pretty busy which is always a good sign. Two in our group ordered a sushi set and the sushi was pretty good by Toronto standards. Everything was very fresh. 

The other two in our group who are Korean, ordered several Korean dishes and they said everything tasted great. Would definitely recommend for those who want a nice interior restaurant with both Korean and Japanese food on the menu."}
{"text":"I've been there twice before and the service was great each time. This time was no different. My friend and I had the  took hoe (a Korean beef tartare) and some beers and  map gul li (a milky alcohol). A solid place, you can't go wrong here."}
{"text":"Came here on a whim as we waiting on our table at Snakes and Lattes, and they didn't disappoint! I got the vegetarian bento box and thoroughly enjoyed my meal! We came 45 minutes before close, but as we were paying they started cleaning around us, which was a little strange, but all in all the customer service was wonderful & the food was good! I'll definitely come back."}
{"text":"I came here eating lunch alone, and ordered one menu that costs over 20 bucks. And I realized that an old man (he definitely was the owner) was keep staring at me until I finished eating. The restaurant's rent fee must be really high, thats why the prices are high. So maybe, maybe the owner was upset for the fact a poor looking girl came alone for a meal. Wtf"}
{"text":"Worst experience ever! Their waiters have the worst attitude! Because of their bad attitude we gave 10% tips and their waiter checked tips in front of us (who does that?) and said that the tips were not enough (?!). Not going back to this place ever. I'd rather to pay more to go to Miku's where the waiters' attitude were 10x better."}
{"text":"The staff were very friendly and knew it was our first time with korean bbq so they explained everything to us and even helped us with the grill. Wish I would have known it's a lot easier to go with a group, there are only certain menu items you can order one of each and the veggie plate was to large for both of us to handle, overall great experience"}
{"text":"Because I had a craving for some grilled fish we headed north to Koreatown on Bloor. We found a Korean restaurant, Arisu Korean Barbecue & Japanese Restaurant. Located in the revamped building of a former McDonald's, the place had a great Korean and Japanese menu with a good selection of grilled fish. 

Climbing stairs away from the street there are a selection of booths looking out to Markham Street, with some tables running along the middle and the other wall. At the back of the restaurant is the sushi bar. Each table has a grill installed in the centre, hooked up to independent gas lines for Korean barbecue. There was an extensive menu of both Korean and Japanese dishes. I opted for the grilled mackerel and my friend for a beef rib hot pot. We also ordered some vegetarian gyoza. While the service was quick and attentive the price was expensive for the quality of food that was served."}
{"text":"Really cute Korean and Japanese restaurant by Bathurst and Bloor. My friend and I came for summerlicious and it was so great that we are definitely looking forward to trying this place again another time. Prices normally aren't too bad either. Their soba noodles were really refreshing and hit the spot for the hot day we went. My friend really enjoyed her veggie bibimbap, especially the fresh mangoes which she kept raving about. It's not something usually seen in the dish so it was a nice touch. The tempera was delicious although I was too full to truly appreciate all the pieces. My aburi sushi was slightly too torched for my liking, but it was still good.
 The booths we sat in all had Korean grills installed so they also offer kbbq which is cool. The decor is a good representation of Korean and Japanese culture. 
The table next to us had a pair of friends completely new to Korean and Japanese cuisine and the waitress took the time to introduce each dish and explain how to eat it too!"}
{"text":"Fantastic Korean food with a dizzying array of menu options.  Also includes a full sushi menu which was surprisingly good as it seems an odd toss in.
 
I really loved the citrus tea and the unsolicited appetisers that kept appearing."}
{"text":"A bit pricy for its food...the beef for bbq has a strange smell... The Korean soup I ordered  obviously had been cooked for too long, it had a really salty taste.... The environment was good compared to other restaurant though....not worth it anyway"}
{"text":"After a long argument with a group of varied diet restrictions, we finally walking into Arisu and were pleasantly surprised.

A wide variety of choices, from Korean BBQ to traditional Japanese fare, it seemed there was something for everyone, including the vegetarians, or crustacean avoiding diners.

4 of us ordered one of their combos, which was suggested for 4 people ($96 for people).  This could have easily fed 6!  Starting off with some cold appetizers, we were greeted with a fantastic sushi/sashimi boat with a wonderful assortment, and all well made.  Then, rice for each, miso soup, 6 different korean side dishes (i.e. kimchi, picked radish, spinach salad, etc), and then onto the Korean BBQ which had chicken, pork and beef, in different marinades and cuts.  We really could BARELY stuff down all the food and it was all delicious.

For 2 others that did not partake in the group feeding, they had special requests for their orders, (one noodle and one salad) and the servers were happy to oblige.

We were all happy and full by the end, and the service was friendly and humble.  If in the area again and feeling the craving for some Korean BBQ and some sushi, I would happily come here again."}
{"text":"This is a great place for Korean BBQ and even better if you have someone that wants sushi.  They even do combos of both.  It works for large groups too."}
{"text":"Best Korean & Japanese restaurant yet!  Delightful service too and tons of food for your money.  A must visit and we will be back."}
{"text":"I love this place! Although there are so many restaurants to choose from in the Annex, I highly recommend this place if you're looking for something affordable and delicious. 

The interior consist of dark wooden tables and antiques scattered around which immediately makes it feel so homey. A great place for a date or to chill with friends. All the servers are very friendly and accommodating as well. 

This restaurant offers both Korean and Japanese cuisine but unlike most places, they do both equally well. You have the choice of doing Korean BBQ or ordering from their extensive a la carte menu. 

Everything I've tried here so far has been great. I would recommend their torched sushi and soba noodles with cod (the fish is cooked so well). 

They also make great japchae, which is my favorite Korean dish."}
{"text":"We came in last night just as the kitchen was closing and they were willing to accommodate us.  They then took us to a very huge and roomy booth.  The place is a little more upscale than other Korean places that I have been to, including the bathrooms.  Service was really good, and the wait staff was cute.  Food portions were big and tasty, and my buddy and I ordered enough to serve 5 or 6.  By the end of it I couldn't move.  The bill was a little bit on the pricey side but I was too food drunk to care."}
