{"text":"This is a wonderful coffee & espresso shop . It is such an inviting place and the espresso is delicious. Simply reminds me of morning's in Italy. Kim, Cole and Nick are fantastic. My husband and I can't help but go here everyday. If you haven't been to Arriviste yet, you are missing out on probably the best coffee & espresso experience in Pittsburgh!"}
{"text":"This is a decent coffee place, a nice little spot for a cup of coffee and some quality working/writing/reading time. What we like the most about this place is that it has a nice atmosphere, and it's quiet enough to read but also comfortable enough to talk and chat. We got a Japanese-style flash brew and a café con miel. The flash brew actually reminds us of the coffee that we got from the widespread vending machines on Japanese streets. It has a hint of bitterness that's somewhat enjoyable more than others. The café con miel, which is espresso+steamed milk+honey is very smooth. It has a nice silkiness to it, and the sweetness from the honey is not overwhelming at all, but rather tastes very natural, making the drink not overly sweetened. I can easily see someone prefer here over chain coffee shops."}
{"text":"The coffee was just okay. The focus seemed to be on all the fancy machines they have. The store itself was clean and well decorated, but it was weirdly silent even though the pace was full. Kinda felt like the Apple Store became a coffee shop."}
{"text":"Super friendly barista and a quiet atmosphere. Excellent iced coffee. I'll be back. Not a ton of seating but it wasn't a problem while I was there."}
{"text":"Wonderful place to sit and enjoy a latte or espresso. The design of the space is so purposeful yet doesn't get in the way. Great service and it's really cute how they serve mineral water and a cookie with your drink."}
{"text":"Great coffee, vibe and treats. The oatmeal cookie is reminiscent of a childhood Little Debbie favorite with a gourmet makeover. The espresso drinks are consistently great quality. It's a new and great addition to the neighborhood. I look forward to many visits in the future!"}
{"text":"This studio knows how to do espresso. Easily one of the best in Pittsburgh alongside Constellation and Redhawk. Thoughtful touch with the cookie. Excellent working space and interior vibe. Highly recommend!"}
{"text":"Great coffee, good vibe/aesthetic, and wonderful people. The owner, Kim, is so warm and welcoming. This is a fantastic and much needed addition to Ellsworth. It is a different kind of coffee shop from the hustle and bustle of Coffeetree and others on Walnut.  Best part is, they have delicious raspberry shortbread bars that I have been looking everywhere for!"}
{"text":"A wonderful, unique addition to Pittsburgh's specialty coffee scene!   The vibe of the décor at Arriviste is very airy and light. My first thought was that this would be a great place to meet up with friends or come to work when you really need to get things done, because the atmosphere is very calm and without distraction.   The staff at Arriviste is as friendly as it gets. I came in on an unseasonably warm day, and ordered a flash-brew iced coffee, because I had never had one before! I have to say, I'm not usually a big fan of iced coffee, but this was absolutely delicious. So refreshing! I highly recommend it if you head in there sometime over the summer.   Arriviste sources a variety of beans from a variety of places, but there's a focus here on finding which brew method really showcases each bean. When I visited, Kim and one of his staff members were experimenting with several different ways of brewing a new kind of bean they had just gotten in. They do a great job of explaining some of the different flavor profiles of their beans (for example, notes of fruitiness, spice, tea, milk, etc...these are flavor notes, not add-ins), which I find fascinating! I love trying different coffees at their best, and that definitely seems to be the focus at Arriviste.    One of my favorite aspects of Arriviste is how thoughtfully they source the chocolate that they use to make their espresso drinks. They use Askinosie chocolate, which is ethically sourced (very difficult to find in chocolate these days) and extremely high quality. They also sell bars of the chocolate near the register. I got a bar of the peanut butter dark chocolate and enjoyed it with my iced coffee...what a luxury!"}
{"text":"Definitely a nice spot for a relaxing cup of coffee. Atmosphere is good, not much seating, pricing is fair. The pour over coffee would be my recommendation."}
{"text":"Good coffee, cool atmosphere. Arriviste also has comfortable chairs and free wifi, perfect for getting work and studying done. I had their house drip coffee (Commonplace Coffee Mwalyego (Tanzania)) which was good.  Their coffee isn't cheap or very expensive (the menu is on their website). Arriviste is a little quiet, so it isn't too loud for studying but also may be too quiet for a conversation.  I would come again :)."}
{"text":"I visited Arriviste for the first time right when it opened. It's perfectly situated on Ellsworth which is an instant win in my mind. The coffee was delicious, but I was disappointed in minimal seating. I had to take mine to go. I returned for an event there as part of #pghcoffeeweek and learned all about some of the specialty coffee they serve and I was more intrigued to continue visiting. I'd like to be able to sit and stay next time, but with very refined barista skills and an emphasis on pure coffee and espresso, this is a wonderful place to check out in Shadyside!"}
{"text":"Loved this place from the moment I stepped in the door! Very clean, modern style. The barista was very knowledgeable and friendly-- not condescending like some can be at other shops. My latte was large and delicious. Large window with  natural sunlight and couch seating near the front. Small and large tables, whichever you prefer. The only downfall was that there wasn't enough seating--during my time there, I observed a few people come in and leave due to no available seating. Overall, love the place! Can't wait to go back!"}
{"text":"It's a coffee shop so the most important factor in the rating is the coffee. Whether it's the espresso drinks or the pour-overs, Kim and the crew have nothing but the best. They take pride in their drinks without coming off as rude about it.   If you're one to hang out and do work, the shop is also great in that aspect too. Obviously it depends on the crowd but it's typically a pretty quiet and calm atmosphere. One of my favorite places to hang out when I need to get out of the house and buckle down in my work."}
{"text":"That's a nice addition in the neighborhood. Nice environment, friendly service and very good coffee. It is recommended for both just hanging out with friends but also for getting some work done. Definitely I will be coming back here!"}
{"text":"Great new addition of a coffee shop to the Shadyside area. Located on Ellsworth, it's actually in a pretty quaint and cute part of Pittsburgh. The coffee shop interior is dotted with tables throughout along with some couches & a rather comfortable seating area near the door. In general, the place sells espresso-based drinks, filter coffee, specialty drinks, steamers, teas, assorted pastries both sweet & savory. I tried the cafe con miel iced and it was pretty dope. Just a wonderful combination of sweet flavors blended in espresso in one nice large cup to drink down. Probably would have preferred less ice but you can probably specify such when placing your order. Pretty quiet shop so you can definitely get a lot of work done here. Great place for meet ups, doing work, and grabbing a cup of joe to enjoy to boot. Will probably visit here a couple more times to try more specialty drinks, but overall definitely worth paying a visit."}
{"text":"Beautiful space, great music, and great coffee. A perfect space for meeting up with friends, reading a book, or getting some work done. The owner Kim and his family are friendly, great at explaining the choices, and will clearly become a cornerstone of the community. I also loved the furniture and aesthetic!"}
{"text":"greatest coffee I ever had!! the atmosphere is very nice and modern. great music, great decoration. I love every thing. The owner Kim, is very nice and friendly. If you live in this area, you should not miss this place."}
{"text":"Best espresso in Pittsburgh. I seize every opportunity to drag friends here for forceful caffeination.  One of the best pour-overs too. There's some really great coffee around, and I make an effort to try everything I can find. The crew at Arriviste is fantastic, and they've been hooking me up with the good stuff since they opened.  Going here is a treat. Great place for a quick stress busting session with a dose of high quality theophylline and conversation, or a relaxing and productive work environment thanks to the open plan, light, and baristas who have a good ear for music (good air quality too for those who notice these things). They have a good selection of beans and mod bar equipment; stellar third wave coffee, local confections, and given the offering, they are well priced.  I'm not one to write reviews, but I have to make an exception for an exceptional business. Seriously, come get some coffee."}
{"text":"If you want an authentic coffee shop experience, come here! Perfect coffee. Calm, modern atmosphere ... the owner Kim is amazing. You won't be disappointed. SUPPORT LOCAL!"}
{"text":"The sign on the door reads, \"Almost 5 stars on Yelp.\" This high-concept coffee bar on Ellsworth doesn't keep pace with Pittsburgh's better coffee shops. On the plus side, the staff were pleasant, the shop was spotless, they had the Sunday NY Times, and they use high quality coffee. Unfortunately my coffee was not hot. The barista brewed and delivered a replacement but it didn't include the shot I ordered. The other members of my party were similarly disappointed with their beverages. I found the atmosphere rather clinical and uninviting. Bottom line: disappointing coffee in a downer setting."}
{"text":"I feel like I am the only one that's pointing out the pink elephant in the room...Arriviste Coffee Bar does NOT smell like coffee!!! What is up with that?! Part of going to a coffee shop is the experience, the overwhelming aroma of fresh brewed coffee that knocks you in the face as soon as you walk in the door that you could bask in all day. But not Arriviste. When I walked in the door there was NO coffee smell that I look forward to when going to a coffee shop.  Also, the decor was so uninviting, it felt sterile, uncomfortable, not somewhere I want to sit for a hour or two hanging out with friends or on the computer.  They do not really offer flavored options for your lattes. The best they had was a spiced honey latte. I ordered it iced with almond milk. It was ok. Nothing fancy, a mild flavored latte.  On the plus side, the barista was very nice.  With so many coffee shops in Pittsburgh it's tough competition to set yourself apart and I don't feel Arriviste did that..or at least in a positive way.  I just don't get it..Arriviste was a complete miss for me."}
{"text":"Cutting edge coffee in a hip setting in Pittsburgh...sweet!  I liked it, and a nice biscuit along side, and a setting that is good for taking your time.  Well done."}
{"text":"Came in to do some work. Love the vibe and the furniture - a good place to hang out. I will definitely be parking myself on the couch to write my dissertation.  I don't drink coffee (please don't yell at me) so I usually order hot chocolate in coffee shops. I'm lactose intolerant (please see my previous parenthetical) so I order it with almond milk.  The presentation of the hot chocolate was gorgeous - I'm impressed that they can do latte art with non-dairy milk. However, the taste is not great. They should maybe look into a different chocolate source.  All in all a pleasant experience. Will be back soon!"}
{"text":"One of the best choices for coffee in Pittsburgh. Always something different, always great choices. Awesome espresso and pour overs."}
{"text":"Solid hipster coffee shop. I like coming here to grab a quick coffee and sit down to read a bit. I've recently discovered that they're good for breakfast as well - they have amazing quiches (much better than Adda's new quiches), as well as almond croissants and other pastries delivered from La Gourmandine. I only come on weekends, but they have tables and free wifi, so it's a good place to get some work done. One thing that I really appreciate is the atmosphere - they have a pretty minimalist style, but still put up beautiful artwork up, which makes the ambience feel very homey but artsy. You can tell they won't just put up any student artwork up, but instead select very interesting and experienced artists."}
{"text":"Artsy vibe and the white album was on when I got here. You really can't ask for much more. Oh yeah and the coffee is awesome!"}
{"text":"Very cozy atmosphere. Great Wifi. Seating arrangements are great. Although sometimes it's hard to find room for 2 or more. Coffee is 11/10."}
{"text":"I've been to Arriviste a few times now and I can say that it's a new favorite!  When you go up for your order, there are a few menus to look at describing the drinks and snacks, and the barista is always willing to explain the options to you.  I've gotten the iced coffee, japanese-style flash brew, and house drip coffee (this is a Tanzanian blend from Commonplace) which have all been good!  If you're looking for something savory, their bacon/chives/cheese scone is a favorite! They also serve Leona's ice cream sandwiches!  The space is wide and open with nice decor, there isn't a huge amount of seating, but there always seems to be enough. The seats themselves are very comfortable! (Sometimes difficult to find in coffee shops) and outlets are nearby.  The atmosphere is very conducive to studying because it's generally on the quiet side and the music does not get loud.  It's located on Ellsworth, very close to the busstop at ellsworth/summerlea, so it's very convenient to get to, also not a long walk from the bustling walnut st!  Definitely want to come for specialty drinks!"}
{"text":"Chill coffee place that has free WiFi and ample plug points. Love the coffee and the ambience here - isn't too crowded and has sleek interior!"}
{"text":"If you're a bougie searching for affiliation with the next step, you've found no better place than to become an arriviste at the appropriately named cafe. They have a modern layout that's very cleanly decorated with only the best accoutrements: bowers wilkins audio system, artwork from the impressionist and others (or who knows!) and interior designing that makes my IKEA furniture weep.  The coffee tasted very good and priced at the typical price range for a hipster coffee shop. This would be a great place to study. When I went it was very quiet, but the seating was somewhat limited. I ended up sitting outside and enjoyed a very sophisticated conversation about the nice weather with good company.  Overall, a nice coffee shop to sit and chat outside, perhaps not inside, or just passing by to get coffee and feel like an arriviste."}
{"text":"Little gem in Pittsburgh. I walked to this coffee place on a rainy day in Pittsburgh (LA didn't have a rain for over a year!) I had Panama pour over cuz I never had Panama coffee before. Very rare and very good! Conversation with Kim, the owner, was fun. He was very knowledgeable. On the second day, I had two different pour overs to taste. Very nice! Loved coffee, ambience, and people."}
{"text":"Hasta la Arriviste, baby!   Really, I don't have to say much else.   But I will.   Arriviste is really a great shop! It has quickly fallen into the ranks of the great coffee shops in Pittsburgh. When I saw the scale when I ordered my americano...I knew we had found quality.   Americano was great. Even drip was great. I had a specialty drink that had orange in it, and that was weird. I have been told they hang their hats on their pour-over. It's pricy. Cafè con miel was a great specialty drink!   Location is great with average seating - including a large communal table (I happen to be sitting here now. These seats really cradle you. Nice.).   Wifi works great! People work here for a bit which is great if you get a table and want to do that.   Plenty of parking - paid and non paid behind certain streets (but keep track of time, as they are permit areas).   They have baked goods that are really fantastic too! Want to mix it up? Thought Adda was your only choice of quality coffee in the area? Wrong. Go Arriviste.   They're nice."}
{"text":"I went on a Sunday morning and squeezed in at a comfortable chair by the couch.  Three guys were sitting there and there were magazines on a chair.  When I asked if anyone was sitting there, they immediately moved the mags and I found my home.  I scooted it a little closer to the window and was so comfy and cozy.  I loved this coffee shop a lot because it has much more of a Seattle-like vibe than others I've been to in the 412.  This brought me a lot of positive memories and warm and fuzzy feelings because I'm from Alaska and Seattle is our first link to the outside world, and a place I get to explore on business trips, something I don't get to do right now.  It was interesting to me how much space was allowed between seating options: this was not a cafe with European-style seating elbow to elbow with no personal space.  The seating was almost architecturally arranged, like the spaces in between were as much a part of the design as anything.  There are a couple tiny seats at the front where you could watch and breath on the baristas, which I did not do, because I didn't think they'd appreciate me staring at them for two hours solid.  There is also a side area where you can take your espresso standing up.  But thanks to Yelp, I scoped out the seating options before I ordered, because I wanted to stay and soak up the interior design.  As for my drink, it was also a five star drink.  Thanks to Yelp I understood the system of little pieces of wood that have different pieces of the menu on them.  I like to read menus, so I read them all.  But I was also on a mission to redeem my idea of cold brew, having had a nasty one elsewhere recently.  The barista asked if I had any questions, and my shy self normally says \"No\" whether or not I have a questions, but I decided to go ahead and ask \"Is the cold brew bitter?\"  He said, \"No, not at all.\"  So I ordered it.  I never send food or drinks back when they are bad, but I figured if I was going to be brave, if the cold brew was nasty and bitter, I'd be in a better position to say so since I'd asked in advance.  But good news, I had no need, as it was delicious, delicious, delicious.  I drank some as is, then added half and half.  And I nursed it for two hours.  I was sad when it was gone but knew it was time to move on.  Arriviste has made my short list of shops worth a repeat visit during my time in town, however long or short it may be."}
{"text":"Arriviste is a very trendy coffee spot on the always exciting Ellsworth Avenue. It truly is an artisan coffee bar, offering boutique beans from different locales as well as a variety of artisan teas.  Beans are ground to order for each specialty cup of coffee or crafted beverage. This results in an incredibly fresh cup of coffee, but also a longer wait. I wouldn't recommend stopping here when you're in a rush, but if you have a few minutes to spare, you can get an incredibly flavorful cappuccino for $3.50.   The decor is bright and modern with interesting details. However, if you want to be able to sit down with your coffee to enjoy those details, make sure you don't show up at a peak time because seating fills up quickly!"}
{"text":"Came here to study for finals and venture out from the craze on Pitts campus. It was perfect - I was able to get so much work done in their environment, with their light music and background noise. Their vanilla latte was pretty good - not too sweet but sweet enough, and the biscuit on the side was just the right touch. Gotta love their coffee art. The main barista there was very helpful as I wasn't really familiar with their menu, and explained each drink to me. I did not order any pastries, but they did seem to have a minimal selection. The place itself is super cozy and has the perfect amount of aesthetics. Often I found myself looking at the intriguing wall paintings on display. This coffee shop is a definite gem of Shadyside. All in all, I am sold and will definitely be coming back here again on another study adventure."}
{"text":"Stopped in with my older parents for a little pick me up after lunch down the street. They don't go to trendy coffee places like this very often so they were a little confused by the menu but the barista was extremely kind, explained what each drink was, and was very respectful. I can't tell you how much I appreciated the great customer service. My parents also loved their drinks! We will be back. For sure."}
{"text":"Thank you Arriviste Coffee Bar for actually having free WiFi!!!  Feeling spoiled as it's everywhere in California but a rare find in my hometown.   Super Industrial design and cleanliness, barista is a kind and articulate bearded guy. Cool chill music at a chill volume level. I appreciate that it's unfamiliar and modern, has a new sound to it Connan Mockasin. Funky.   Great smelling coffee, some bars, well done pastries and I'm having a Savory 'Pierogi' turn over."}
{"text":"My FAVORITE coffee shop in Pittsburgh. It checks all of my coffee shop must-haves.   Good coffee? (Passengers, commonplace, Maquina) - CHECK  Aesthetic? (These guys are into the details, and it pays off. I love the way that they serve pour overs: a mug + glass coffee pitcher served on a personalized wooden tray. Bonus: equals out to 1.5 mugs of coffee.) - CHECK  Good work space? (ample space + WiFi)  - CHECK  Out of the box experimental drink options for creative days? - CHECK  Great space to come with a group? (Several \"large group seating options) - CHECK   Kind, engaging, helpful staff? - TRIPLE CHECK  You are doing yourself a disservice by not stopping by to check out (or return to) this place. I personally stick to pour over coffee, but every once in a while I venture into Cafe Con Miel territory. I am always pleased with the result."}
{"text":"top star espresso bar! this was the first time i'd seen a modular espresso machine. espressos -- two offerings -- were both delicious and unique in profile from each other. my barista Cole was experienced and knowledgeable and unlike some places actually likes coffee.  worth going out of your way."}
{"text":"Visited Arriviste today for the first time. Really cool spot! I was somewhat boring and just ordered an iced coffee - but their options are endless. Lots of speciality drinks to try, so I'll definitely return. The location in Shadyside makes it really convenient for foot traffic and there is street parking all around it - making it relatively easy to find a spot if needed.   The only disappointment was that I wanted to sit down & enjoy my coffee there, but there wasn't any seating left. It's a smaller place, but if you can find seating, it seems like a great place to meet a friend or to get some work done. Employees were very friendly."}
{"text":"Stopped over here after lunch to get a cup of coffee since it is near the Harris Grill. The place is small and has free WiFi for your laptop or mobile device. They have several different menus. Everything depends on which menu you decide to order from There's one for expressos and lattes, coffee, tea, and the few sweet desserts they have in the shelves. Each menu is attached to a small clipboard. I had only seen the latte and coffee clipboards prior to ordering. After I had ordered I picked up the clipboards to find the tea and dessert menus  All their coffees are from South America and they feature \"pour over\" which means they will add various fruits, spices, tea, milk, and bourbon (in this case I was told it mean the type of coffee bean) for an extra charge. I would only recommend getting one of those if you prefer you coffee black. He let me sample their basic cup and I found it a bit bitter. I ordered a small cup to have in house and it did taste better once they filled it and I was able to add cream and sugar.   The coffee was just okay in my book. I suppose if I were a fan of expressos and lattes I might have enjoyed it more. I like the way the serve the coffee if you drink in house because if you order a the blend with a \"pour over\" which takes a little while longer I was told you would get it on a serving dish with a glass pitcher. It's convenient when in that area. On Ellsworth there is pay metered parking but if you head up to the next street one block north you have daylight limited free permit parking which is also a perk. Bike parking is nearby too."}
{"text":"A cool little spot in Shadyside that serves a good brew and plays good tunes. I went for the second time today and worked from here. I had a chamomile tea the first time and a mocha the second. Really liked that the barista served my coffee to me at the couch; a nice personal touch! I like that it attracts diversity; and I don't just mean ethnically. Both times I've seen older folks wander in here to have a spot of tea or a shot of joe. A true neighborhood joint that has a decent menu and makes you feel like you're stepping back into the 60s. The only thing that was an annoyance was the wifi cutting in and out when trying to work. I think a more reliable hot spot or connection is advisable. I shall return!"}
{"text":"I have never written a Yelp review before, but my experience here was so lovely I felt compelled to give a shoutout to this new business! Had a great chat with the owner, Kim. He was welcoming and friendly in a way that is sorely lacking in the area. The space is beautiful and peaceful. It's definitely somewhere I could see myself spending a lot of time.  Finally, the most important bit: the coffee. I haven't had a great cup of coffee in this neighborhood in years until today. I'll always wait for a good brew, but the whole experience only took about 5 min and the coffee is perfect. So, so excited to watch this business grow."}
{"text":"Definitely my new favorite coffee shop in Pittsburgh! Nice, chill place to study with small tables and one large table to share with other studiers. Low but relaxing music, plugs galore, a friendly staff and great coffee keep me coming back. On nice days, there are 2 little outdoor tables too! The Japanese style flash brew is my go to during summer- I'll update when I've tried some of their hot coffees."}
{"text":"Tasty traditional macchiato.  Free coffee for mothers on Mother's Day.   Friendly staff.  Fun decor."}
