{"text":"Delicious pizza and GREAT price, take and bake is a great concept and exactly what the South hills needed!!!"}
{"text":"Fresh and delicious.  We ordered a large pie (salami and basil), farmhouse salad, and giant cookie for $20.  Excellent deal and more than enough food for a family of three.  The pizza was excellent - tasty and fresh.  The salad was baby greens with toppings.  The sugar cookie may have been the best part!

Keep in mind that this is take and bake.  It takes a little time, but it tastes as if it from a high end restaurant.  The staff is learning, so some patience ay be needed."}
{"text":"I have gotten a lot of pizzas and salads from Artisan and I've been impressed every time. I love that the ingredients are all natural and everything seems very healthy for getting a pizza. Anything from a plain cheese to their signature pies are all excellent and the price is good too. The pizzas are easy to bake and 100 times better than anything you can get from a pizza delivery place.  I'm a salad lover as well and they have good ones to choose from (the Farmhouse is the best). They are friendly and the owner always remembers me. Two thumbs up!"}
{"text":"Love this place. So fresh with unique toppings. The salads are fantastic. This is our new pizza place. It bakes up quickly in 12 minutes. Nice to have an option that isn't heavy and greasy. I love that they have a kit where you get all the pizza fixings and the kids can have fun making it at home.
I found the staff to be really friendly."}
{"text":"Oh my, oh my!  There are about a dozen pizza places on the commute home but this one is absolutely the one to beat.  

It's take and bake, so the price is great, the \"signature pies\" have some great combinations, and the taste is very good - red sauce isn't too chunky and the crust isn't too crusty.  

But the absolute winner in all of this is their attention to and accommodation of dietary restrictions.  We go gluten-free sometimes, and they not only have a gluten free crust but they make the pizza in a dedicated area with gluten-free flour.  So when a dairy-allergic, gluten free family member wanted pizza this was a no-brainer.  We had full confidence that if they said the pie was dairy free, it actually was - no hidden whey, lactose, etc.  Love that they publish the menu and ingredients online, love the combinations, love the convenience, love that it's just minutes from home.  If you haven't tried them yet, do!"}
{"text":"So well liked by everyone else but I thought the pizza fell short of the mark. The experience was not good. We were greeted by 2 guys who immediately told us it would be a 25 minute wait because they have to many orders in front of us....really? I can get an excellent baked pizza in less than 25 minutes. It turned out to take 45 minutes. Not good.

We ordered Classic Margherita, The Greek, and Royal Hawaiian. The dough was excellent but it ended there. The red sauce tasted like sweetened tomato paste, had little flavor, and overwhelmed all of the pizzas. I just couldn't get by the red sauce. The Greek may have been better as a white pizza. In addition, there was only 2 pieces of artichoke heart on three pizza and several individual leaves.

Although I didn't like the pizza, the Apple and Blue salad was very good. But I went there for the pizza."}
{"text":"Take N' Bake your own pizza.  Second location for this new concept.  You order the style of pizza you want.  Take it home and follow the baking instructions and there you have it.  Hot and fresh pizza.  They say it is all natural, fresh and homemade.  The pizza is put in a plastic wrap with parchment paper under it.  You cook it on the parchment paper, take it out of the oven, let it cool a few minutes and then it is time to eat. The menu includes some fresh salads and some sweets including cookies that you bake.

This take N' bake concept can be OK in some cases, but I usually want my Pizza cooked so I can eat it now.  But I have had some take N' bake from another pizza place and cooked for a party.  

Had a Signature Pie, The Artisan, that has spinach, crumbed feta, Sun-Dried tomato and more.   The crust was good and brown and not to thick.  All in all an interesting concept that would seem to be more for those that do not want to eat it now or have a little later when some friends drop by."}
