{"text":"The vegetarian food, the vegan pastries, the good coffee, the great beers, the mood and look, the charming employees... This place got it all!"}
{"text":"Je suis allée au Atomic Café pour une soirée musicale et j'ai des points positifs et négatifs à mentionner. Je vais commencer par le négatif. Le son de la salle est mauvais pour les shows de musique trash. Je pense qu'il n'y aurait que de la musique douce dans le style acoustique qui sonnerait bien dans la salle. En ce qui concerne les consommations, j'ai aimé l'originalité des breuvages non alcoolisés malgré leur simplicité. Dans les boissons alcoolisées, j'ai goûte leur cidre et j'ai été agréablement surprise. Moi qui n'aime pas les cidres surettes, le leur était sucré, c'était délicieux. Autre point positif: La décoration a attiré mon attention, ça aurait été cool si il y avait de la lumière colorées pour les soirées pour donner une touche encore plus rétro tape-à-l'oeil!  Bref, si l'occasion se présente, j'y retournerai. Ça semble être un endroit sympathique."}
{"text":"Endroit intéressant! Nous y étions pour voir un groupe de musique. Il y a beaucoup de places assises et une petite scène au fond avec un bon dégagement pour danser ou juste s' approcher des musiciens.  La clientèle est variée et sympathique. Nourriture et alcool servi par un serveur derrière le comptoir. Les toilettes étaient propres."}
{"text":"J'ai attendu si longtemps avant d'entrer dans ce café situé juste à côté de chez moi, mais la semaine passée, je me suis dit \"tu as un blog culinaire (la boufferie), alors Allez, vas voir)!   C'est charmant! Un décor rétro, une ambiance conviviale et un menu sur lequel on trouve autant des classiques que des plats inusités (comme le sandwich concombres & cheddar)!   Personnellement, j'ai essayé leur smoothie fraises, bananes & lait de soya qui était délicieux et GIGANTESQUE et leur croque monsieur qui était un régal.  Le vidéo répertoire qui partageait leur local a fermé qui y a quelques semaines... Selon les rumeurs, le café deviendra peut-être le premier café-spectacles de HoMa. Intéressant! À suivre..."}
{"text":"Magnifique endroit qui met en valeur la culture de son quartier avec ses expositions et vernissages, ses spectacles de musique et autres événements diversifiés. Bonne bière, prix raisonnables, belle ambiance rétro sympathique tout comme le personnel, je recommande!"}
{"text":"Sympathique, accessible. J'y ai pondu beaucoup de travaux de sessions!  Ça vaut le détour!"}
{"text":"Pour etudier c'est un endroit corecte.  Le cafe est bien bon et la bouffe aussi. Par contre, l'ambiance retro est manqué et donne plus l'impression D'être mal entretenu . De plus, il faisait extremement chaud et selon moi la musique etait un peu derengeante !   Au moin les nachos etait bon !"}
{"text":"Belle place vintage. On se croirait en 1980. Le truc le plus cool ici en se moment, c'est la bière des Îles de la Madeleine pour 6$. Tsé. Une Belle Saison et une Écume de l'abri de la Tempête. Yo. C'est le même pris qu'aux îles. Capote tu? Moi, oui."}
{"text":"Wahou! En voilà un café typique et vraiment original! Situé en plein Hochelag', sur la rue Ontario, l'endroit est vraiment surprenant tant de l'extérieur qu'à l'intérieur.. les photos parlent d'elles-même.. Le menu est assez varié et bon marché, le service est très bon, on peut y aller pour chiller seul, accompagné, longtemps, pas longtemps, bref l'endroit se prête autant aux étudiants qu'aux couples ou groupes.. Un endroit à découvrir sans hésitation!"}
{"text":"I'm in love with the interior of this cafe, which sometimes turns into a movie theatre or a mini concert hall, depending on the night. This place is like a time machine back to the 70s or 80s: swanky chairs, orange deco, metallic knick-knacks, vinyls... The coffee is good, and they also serve beer, which is perfect for their terrasse in the summer. Their desserts are DELICIOUS (generous portion and vegan!). Lots of tables and chairs, it's open late, and the staff is easy-going and super friendly.   One of my favorite spots in Hochelaga."}
{"text":"Je suis très ambigüe par rapport à ce café! Il me semblait tellement plein de potentiel. Il détonne des cafés typiques, tout en n'étant pas étonnant! On a voulu créer une ambiance \"à gogo\" , mais on dirait qu'on a laissé tombé le concept en cours de route. Mon café était froid et cher (7$), les bancs sont déchirés et l'éclairage te fait sentir comme dans une cafétéria! Le service est quasi-absent, il n'y a pas grand chose qui en vale la peine ! Je vous dirais de ne pas y aller si vous tripper sur les cafés comme le Tommy ou le Hoche café."}
{"text":"ATOMIC CAFÉ  Un nom tout droit sorti d'un film de science fiction des années 80 et c'est bien dans cet esprit que le ATOMIC CAFÉ reçoit sa clientèle. Forme géométrique, fausse fourrure couleur orangé et L'expo 67 est aussi thème très récurant dans cette décoration confortable qui nous rappelle étrangement le sous-sol de chez nos grands-parents. Pas de café filtre, un excellent latté, un choix intéressant de plat végétarien, un nachos gratiné pour satisfaire une envie de gros, un hot-dog de Nathan typiquement new-yorkais. Une connexion internet trop souvent défectueuse qui personnellement m'irrite, permis d'alcool, bonnes bières et choix de plusieurs drinks. Depuis peu le ATOMIC CAFÉ à doublé en superficie et peut maintenant accueillir soirées de hockey, musiciens et depuis tout récemment environ une fois par mois soirée à saveur underground avec D.J, projection et clientèle jeune et déjantée.    LONGUE VIE À ATOMIC CAFÉ!   3606 Rue Ontario Est, Montréal, QC (514) 500-1905  dimanche 09:00-00:00 lundi 08:00-00:00 mardi 08:00-00:00 mercredi 08:00-00:00 jeudi 08:00-00:00 vendredi 08:00-00:00 samedi 09:00-00:00    Archevêque B"}
{"text":"We decided to try Atomic because it's one of the few cafes within walking distance of our apt that stays open late (until midnight to be exact).  Love. Love. Love.  It's part cafe, with a small food menu including a choice vegetarian/vegan selection -- can you say \"vegan chocolate-covered bacon\"? -- and mini alcohol bar, and part video rental store (Club le Septieme) with an array of international flicks to rent.  The cafe decor is a mid-20th century / early-21th century fusion with a small, malt shop counter and a few red-coushioned stools, an old juke box against the opposite wall, and a section of blank wall space used to project a 21st century A/V goodies from a computer.  Despite how you might think they look, the employees aren't too cool to provide quick and friendly service in English or French, and the customers aren't territorial when newcomers cross the threshold.  We just had some hot drinks to keep us warm, but we're sure to return to nibble and sip our way to the end of the menu."}
{"text":"Tout mignon comme café! Le look retro du café m'a surpris un peu au départ mais c'était le fun de se retrouver dans un endroit qui partage le zen d'un café relax avec le fun d'un \"diner\" retro. Ils ont un petit menu quand même pas mal original avec de quoi plaire absolument tout le monde. Oui, oui, même vous les végétalien avec intolérance au gluten! Mon latte et ma chocolatine étaient tous deux délicieux, surtout pour un matin ou j'avais besoin d'un grand bol d'espresso! J'y suis restée pendant quelques heures pour y faire un peu de travail et la connexion Internet était super bonne. L'ambiance en générale est très bien. Ça parait que c'est un café de quartier qui a une clientèle régulière simplement à la manière que la personne qui était là quand je suis passée semblait être très familière avec 80% des clients! Et si vous avez quelques minutes de plus, et que Le Septième est ouvert, allez fouiner dans le fond pour dénicher un bon film. Ou bien, restez confortable dans votre siège et faites un chef d'uvre sur la tablette \"Etch-a-Sketch\" !"}
{"text":"Cool endroit. Le café est bon, mais j'y vais surtout pour l'ambiance, le décor rétro.  Un des seuls endroits en ville où on peut déjeuner avec des poptarts ou des toasts beurre d'arachides et bananes!"}
{"text":"this place is so hot everytime i come here :( winter or summer im always sweating! why do they do this? haha put some AC on guys!"}
