{"text":"I shop at the freshmart and sometimes I'm hungry leaving. Went here the first time and wasn't impressed, decided to try it a second time and will never go back. The food is terrible, don't bother."}
{"text":"Everytime I go to Aunt Bell's I find the employees are wonderful and the owner is very nice! I always order the jerk chicken and oxtail. Reminds me of Mama's cooking. If you want a great meal at a good price! Stop in you won't be disappointed! People have to remember everyone has a bad day sometimes! Don't let a bad review from someone deter you from trying Aunt Bell's..."}
{"text":"Amazing jerk chicken, been back a few times and it's always been good! But the service needs alot of work. Lady who works there doesn't even seem like she wants to be there... BUT THE JERK CHICKEN IS STILL GOOD SO YEAH IM STILL COMING BACK"}
{"text":"Went today 5 star  for customer service food is great I try the goat and oxtail . Next I will try the jerk chicken . Aunty bells is such a great and welcoming lady thank u"}
{"text":"If I can give less than a 0 I would. I called to find out if they have any soup and I was asking what kind it was. The lady then went on to tell me that she has a customer in front of her and if I want the soup to come to the store and buy it. Disgusting and poor customer service. I work in the service industry and that's not how you deal with customers inquiring politely about a product you are offering."}
{"text":"Honestly.. I don't see how there is only ONE review for this place. I was skeptical to try it, based on the gentleman's review below me.. but I tried the rice and peas and jerk chicken and Bbq chicken and it was DELICIOUS! Customer service isn't the greatest but the food makes up for it. This will definitely be one of my go to favorites for some good Caribbean food! The lady can cook! The Jerk chicken has a nice seasoning to it and lots of flavor, I really enjoyed the Bbq chicken equally as well and the rice and peas was good.. I seen fish and other dishs there, so I will try the other items, since I was happy with what I ate. Highly recommend. Don't let that one star fool you. Food is very tasty and makes up for the customer service."}
