{"text":"We had a great dinner. Friendly, polite and efficient service. We have been coming here for years and it is so nice to have a neighbourhood pub/restaurant that appeals to all age groups."}
{"text":"Food was good except girlfriends meal she got really sick, first server was good but got turned over to another girl and took over 40 min to get bill. wow. Not to impressed with this place."}
{"text":"Looked forward ringing in the new year. At Austins If it weren't for one of their regulars. Talking beside me, saying\" I wonder if hookers are free tonight\". I mummbled \"stay classy\" And he retorted some like \"you got to be classy to stay classy\" feel like I couldn't  say something to the staff, because their tight. Instead I'm going home. And I don't think they change the oil in the deep fryers. Cuz My app tasted like everything else."}
{"text":"Food is good, beer is cheap and the place looks good. This is definitely one of the better bars in the south. Great place to shoot pool and have a in expensive steal sandwich. Worth a visit."}
{"text":"My favorite local hang out! Salad of the week are always creative. Wished they didn't take the grilled romain salad off the menu though as it was my favorite.... Oh a great service."}
{"text":"Love there $8 steak sandwich!!! For $8 it's pretty darn good. I go here at least once a week. Most of the new staff is great and friendly. I'd recommend going there to anyone."}
{"text":"Wow... I used to come here because it is so close to my home. 7 years and counting since I turned 18 in fact. Now I will never ever ever come back. First, my friend was over charged by 4 beers. He was then not able to dispute it because the little blonde server (terrible server never smiles never says thank you), had rudely switched us to another server. Also, My other friend whilst going for a cigarette left money on the table expecting change, and the server pocketed the extra cash and left without asking if he would like some back.

For me, the wings were God awful, and the quesadilla was a small portion. This is also typical with Austin's. Their portions are extremely small for what you pay.

Here are some local suggestions: creekside pub (Canyon Meadows), Three Crowns (Woodbine), or the point and feather in (oakridge/braeside)

Austin, is this how you want your legend to end? Increase your portions and hire some happy servers. Until then, I will continue to boycott, and tell others to also boycott your bar. Which by the way is a lot of your youth clientele."}
{"text":"I remember their food was very good once, now it's overdone, soggy and gross. It's too bad because it was once some of the best value around."}
{"text":"Great looking restaurant after the renovations. Have gone a few times. Prime rib on Sundays are a good deal. They have cheaper beer than most places. Service is nothing special but gets the job done. I like the Saturday steak and lobster special but they just increased the price from 17.95 to 21.95. I would still go because it's close to home, good prices, lots on the menu."}
{"text":"Alberta Burger Week 2016 Edition

Neighbourhood pubs are the life blood of any community. It's a great thing to know that you can walk into your favourite haunt, know the server's name, grab a pint of the usual and a plate of the usual and just chill. The recently renovated Austin's aims to be that kind of place. Could it be yours? 

The time has come once again for Alberta Burger Week and I find myself at Austin's Bar & Grill, meeting Executive Chef Federico Jr Causapin. Over 100 restaurants are bringing their original culinary creations to this charity event in the pursuit of bragging rights in what is becoming one of the biggest restaurant weeks of the year. Though the contestants are many, what has drawn me to this neighbourhood pub was a bit of something very familiar to me; the Longanisa Burger.

As a Filipino Canadian, I have been proud to see the emergence of Filipino cuisine into mainstream food culture. Chef Federico has brought his Filipino roots into this year's offering for Alberta Burger Week, creating this Alberta beef burger with the flavour and essence of classic longanisa. For those who are not familiar, longanisa is a cured pork sausage similar to chorizo or Portuguese linguica. The Filipino version is commonly available in 2 varieties, one which is more on the sweet side, and the other being spicy.

I was skeptical at first upon learning that the burger patty was all beef, wondering how that flavour of the longanisa would carry in beef. The burger itself is made from 100% Alberta beef, seasoned with brown sugar, garlic, soy sauce, and smoked paprika which gives it a subtle kick. The sesame seed sweet potato bun is house made and is delightfully light and fluffy. Add to that, garlic mayo, lettuce, tomato, onion, banana ketchup, and cheese. Served with sweet potato home fries and a side of mango and papaya atchara, Chef Federico's homage is a welcome addition to the vast selection of burgers at this year's event.

Upon trying the longanisa burger, I was pleasantly surprised to find that the meat was not at all dry or overcooked. The 60/40 lean to fat ratio carries the delicate flavouring of the longanisa, but not overpowering it. Chef Federico explained that the fat was very necessary in creating a beef patty that would deliver the familiar flavours without having to resort in using pork. The subtle flavour of the longanisa is present and also highlights and celebrates the flavour of the beef, with the smoky accent of the paprika at the end. Did I mention that the bun is house made? It's sublime and surprisingly it holds up well to being handled in the way that a burger should be handled when strategically trying to cram it in your gaping maw.

All in all, the Longanisa burger is delicious and I hope to see it as a regular part of Austin's menu. Keep up the great work!"}
{"text":"Great bar with amazing pub food! One of the best in all of Calgary!  Who doesn't love their cheap steak sandwich which is the everyday special! There wings are yummy! Never had a bad meal here!  They have an amazing beer selection. Service is always amazing. Vlts for anyone whose feeling lucky!"}
{"text":"Kinda hard to get a waitress, seems locals rule

Service sometimes good , other times you need to go to the bar to get service

If you are patient and wave a lot....."}
{"text":"Austin's is a newly-renovated pub in the South, just off Elbow Drive and Anderson Road.  Overall the atmosphere was nice enough.  The server was attentive and friendly.  Very casual atmosphere and menu.  They have a decent wine list with reasonable prices."}
{"text":"Good neighbourhood pub. Kitchen is open late, I have ordered here past 1 am. If you are looking for a well prepared meal at 1 am. There are not a lot of options in the city. The Fil chef here usually has good specials. Regular menu items range from standard pub fare to braised lamb shanks. My rating out would be 3.5 if I could give it a half star."}
{"text":"Austin's is a great neighborhood pub, consistently great food, great atmosphere and excellent staff!  This pub is very very community minded and they always find ways to give back.  
It's also really clean and is quite nice inside, the prices are very reasonable.  A hidden gem for sure."}
{"text":"A casual neighborhood joint with beer and food.
The food is not bad. I've had the burger, and the fish and chips.
Food seems to always be freshly made which I appreciate (=crispy fries + hot food).
They have quite a few TVs for watching sports.
Staff are nice and so far it's been good service the 2 times I was there.

Yes they do have steak sandwich for $6.95.... and yes it is small...but for $6.95 you can have 2!"}
{"text":"Good prices.  I work nearby and take advantage of the fact that it's not as busy as the other places that end up with a huge rush when the high school is out for lunch.  The all-day steak sandwiches are good cuts and well priced.  The burgers are ok and they have some ok prices for domestic beer on tap.  The bartenders are pretty inexperienced so don't bother ordering anything fancier than a ceasar.

It's average pub food at average prices with a clean atmosphere.  I recommend going there if you're hungry and need some lunch or dinner."}
{"text":"Food is really bad! Won ton soup was cold, cheesesteak sandwich....?  Didn't really know what was going on there but just gross!  Service was slow but server was good, she was just very busy.  Good ambiance but I think food is rushed, slapped together and just bad for pub food."}
