{"text":"I used to like Avatara's whole wheat crust, although it could be a bit tough and bland. I REALLY don't like new \"multi grain\" crust, it's basically just white bread. The last two times we've ordered pizza, it tasted very undercooked. Maybe it's because the crust isn't a chewy, typical pizza crust, but is a more dense, bread like one. It's got that raw bread taste you get when you take a pizza out of the oven too soon. Sorry, Avatara, won't be back."}
{"text":"Horrible. I guess gluten free means it should taste like crap. Little Caesars is better surprisingly"}
{"text":"I haven't had a pizza in 10 years. After visiting this place with a non lactose friend of mine both of us agreed we will be regulars. Even if you aren't celiac try the gluten free crust. Absolutely amazing experience from service to product."}
{"text":"Avatara is located next to the McKay's ice cream in Parkdale. Kind of a blink and you miss it place. It doesn't have any tables, and is for take out  or delivery only.  This place advertises as a 'healthy' pizza place. They have gluten free, and thin crust options. The dough is made of 50% wheat flour.  My friend and I chose the King Of Zion pizza, on thin crust, size large. it came to $27 with tax, which is kind of pricey. A small/personal is $11, a medium is $17. That being said, my friend eats a lot, and there was still 2 pieces left over when we were done. I myself was stuffed on 2 pieces, as they are quite large. Avatara has unusual toppings, such a a butter chicken and mango chutney pizza, and does the traditional ones too. The staff are super awesome, and are happy to make suggestions if you need them. Definitely worth a try, especially if you want healthier vegetarian and gluten free options."}
{"text":"Wow.       Disappointed that we missed this business in its heyday. Word generally indicates that when it opened, this place made serious pizza. By the time we got to it, all that was left of the glory days was the higher price.      Edible, but not for the price their asking. NO way. I can go to Sunnyside market, buy better ingredients, and still make a pizza better and less expensive than Avatara. I'm guessing the popularity of the place led the owners to decide to cut corners so they could taste some easy cash/profit. I could be TOTALLY wrong -- maybe it's new staff, miscommunication, et cetera. These optional reasons are why the place gets better than one star. Good ingredients are fine, as long as they're not destroyed in the process.       I have heard so many good things about this place that I'll try it again this December, and update. Just in case that night was a poor exception..."}
{"text":"Very good pizza! Quite thin crust and creative toppings. Love the gluten-free option!"}
{"text":"the first time i tried Avatara Pizza was leftovers at a friend's house, who lives a few blocks down from the place. I dont remember the exact kind, except that it had pepperoni on it, and had a regular crust. it was delicous, as most day old pizza is.  I decided to pop in last Sunday for dinner. It was CRAZY busy but the front staff was pretty quick at getting our order. Needless to say, when we finally got our pizza 45 min later as opposed to the 30 it told us it would take,( The Santana, thin crust) it was mediocre. The thin crust tasted dry, and almost dirt like. The toppings were alright, fresh, but didnt mesh together well.  I will try Avatara again despite this, and maybe a gluten fee crust (this is only offered with the personal pizza sizes) because there must be a reason why they get all these great reviews!"}
{"text":"Fantastic gluten free pizza. Crust is light. Flavored are good. Very fresh ingredients. Started with the spinach salad - excellent. Bruschetta is very good. Love it. Doesn't look like much from the outside but everything is fresh, organic and flavorful."}
{"text":"Fresh and simple meets flavour explosions in your mouth. These results are guaranteed!   A really cool open concept kitchen where  the humble pizza artists are forming your dream pizza. Relax as you enjoy watching them or admire the artwork on the walls. Each art piece reflects their pizza's and can be a fun game as you are waiting patiently for your delicious eats.   Even the salads are amazing! I highly recommend the Popeye along with the Santana (Veg) pizza :)   Once your pizza is done it is ready to go in a recyclable/compostable round holder and easy to transport around :) Should you wish to eat elsewhere.   Guys, you gotta try it!!!!"}
{"text":"This my first time having pizza in Canada, so, I'm not sure on style differences with the states. That being said, this was the 2nd best gluten free crust I've ever had from 20 cities!  However, the rest of the pizza was a little disappointing. I ordered the Aristotle and it was topped with bruschetta, but the tomatoes weren't ripe and it was rather flavorless. The pizza sauce was made from San marzano, but there was little to no seasoning! A little salt, garlic, oregano and pepper would go a long way. Finally, the crust was burnt in place and undercooked in others. Having been a pizza chef, someone didn't rotate properly and there were some burnt topping on my pie that looked as if it fell from someplace else.  Overall, I would def try a different pie or maybe try it in store cuz that crust tasted amazing for gluten free!"}
{"text":"I tried their pizza at their food truck and was blown away -- really great thin crust pizza from a truck! Amazing.  For those with gluten issues or lactose issues, this place is a godsend. Fresh ingredients, gluten free crust and lactose free cheese.  I'm in the gluten-free camp and I can finally eat pizza again. The pizza reminds me of the kind I had in Tuscany - thin crust with fresh toppings. Not the kind deep dish pie that goes for pizza round these parts - for that you'll need to go elsewhere -- but more like the Neopolitan style without the gooey half-done crust.  Their location in Parkdale is undergoing renos -- their previous location was just a hole in the wall. I'm looking forward to when they open to see what it will be like, but for now, I always look out for their food truck for a napolitana fix.  Great addition to the YYC food truck scene"}
{"text":"Love the thin crusts,. Italian Stallion is my favourite, like the Mediterranean one too.  Also enjoy the Jones Colas. Only part I don't like is the Vegan Daiya cheese. Wish we Vegans had more cheese choices, ie. Basic Roots or The Light Cellar's gorgeous nut cheese. Or the incredible range Kite Hill (US) offers."}
{"text":"All up, we were very happy with our pizzas. We ordered The Buddha, T-rex Meatzilla, Italian Stallion, and Mauie Wauwie.  All the flavours were there but maybe the crust was not the best we've had though the whole point is that it's 100% whole wheat. You can also get gluten free, Vegan, lactose or dairy intolerant pizzas.   I really liked how they used the bio degradable round boxes with lids to take home. The decor is friendly with an open kitchen and a view into the huge pizza oven. Hung on the walls are painted representatives of each pizza. And as you may have guessed, mine was a Buddha."}
{"text":"What planet are all these great reviews from?  My boyfriend and I ordered two veggie pizzas from Avatara and were extremely disappointed.   First off, the crust tasted like cardboard. I've had some great multi-grain crusts in my day. This was not one of them.  Secondly, toppings were stingy and some were even missing. We asked to substitute mushrooms for chicken, so maybe that factored into our M.I.A. cilantro? I asked about substituting vegan cheese for regular when ordering, and were told they'd be happy to accommodate, but found a $2 per pizza charge when they arrived. Famoso has no problem making a quality pizza with free daiya, why can't Avatara manage?  For $40 I expected to at least get two people fed. It was barely an appetizer portion. I'd like to think it was just an off night for them, but nothing seemed remotely salvageable. Never again."}
{"text":"Had pizza from Avatara's food truck for lunch today. I didn't like any of their toppings, so I asked if I could get a pizza with custom toppings. They obliged which made me very happy with their customer service, and my co-workers said that the pizza is quite good so I was looking forward to a great pizza.  Except..It wasn't great.  The crust was thin, and that's about all the good I can say about the crust. The flavour is poor and the texture even worse. Not to mention the crust was also burnt, so it tasted mainly of ashes.   The toppings were all right, but it just wasn't much better than a gourmet, thin crust pizza that I can get for 5 dollars at superstore. I'm not impressed at all, and I'm going to be sticking with Gaga Pizzeria, the most amazing pizza place in Calgary!   Also not the cheapest for it's quality!"}
{"text":"It's great that they have vegan options (daiya). Pretty lame that it costs extra for the vegan cheese (not advertised). I would go again, it was tasty, just nothing to get really excited about."}
{"text":"Wow! Great pizza even if you have vegetarian/ lactose intolerant/ anti gluten friends ( or one of each at the same party). Pizza is a little more expensive but are heavy with toppings.   Order the lemonade if it's available!!"}
{"text":"They have pretty good pizza and its a win that they have veggie options. But the don't hold true the hours, I have tried to order pizza a few times now only to have the guy tell me on the phone \"nahh we are closing, it was not a busy day\"  clearly the reason you are slow is that you are disappointing your clients and they go else where. Like my friends and I did."}
{"text":"For once my husband and I could eat the same thing. He's got zero allergies and I have all of them.  It was great sharing a pie that was legal for me and my sweetheart could also enjoy.   I was also impressed to see kombucha in the fridge.  Bringing home the other half to watch a movie."}
{"text":"Many GF DF options. Love many of the specialty pizzas, esp. the Picasso. Favorite pick up pizza place in the city."}
{"text":"Gluten free dought bought and made in calgary from a bakery.topppings where frozen and the price of the pizza to high .but most of all the owner was very rude J tried breaking the ice and talking to him but he seemed not to want to talk to a guest....I always say if you can't smile don't go in business....asta lungo amico"}
{"text":"Nice atmosphere, temperature was a little cold. The chef was very friendly and social and from speaking to him it was obvious he was passionate about the product he is putting out. His passion showed in the pizza, it was very very good, full of flavor and a crust to die for."}
{"text":"I had the meat lovers - Awesome! I love thin crust pizza and the freshly made pizza topped with awesome, generous portions of pizza leave me wanting more. Damn, should of gotten the full for lunch (I ordered half only with a soda!) There's not alot of options for food in that area so I'm glad there's Avatara! Staff was quick and friendly as well."}
{"text":"Have you ever worked in the food industry?  If so, avoid this place at all costs to avoid the massive frustration you will encounter when you watch them attempt to build pizza. This sounds trivial, but it took us 37 minutes to receive two half pizzas, and the primary reason was very poor build workflow. Most of the time, it seemed like they were confused about what was supposed to be on a pizza and were constantly taking things out and putting it away.  37 minutes is far too long for a food truck to deliver the goods. There was also a great deal of confusion as to when someone's order was up, as they also failed to call out names on a number of occasions. I watched the chef not call a name and put the pizza on an oven, only to later have a group that was standing there for some time finally go inquire. Turns out the chef had been keeping the pizza on top of the oven for no reason the entire time. He had not called for them. Pretty disappointing as I think they had been there longer than I had!  A few positive points; topping selection is excellent offering some legitimately impressive variety from artichoke hearts to pine nuts. The sauce tastes home made and compliments the toppings well.   I am told the majority of it is gluten free, which makes this a home run for those allergic--but not necessarily the average food-truck-goer. Crust is an integral part of wood-fired pizza, so the crust truly falls flat on its face here, as it is gluten free. It has an almost cardboard-like taste and is incredibly tough, thin, and homogeneous.  Of course, this won't matter for celiacs (and I'm sure it's actually quite good from a gluten-free perspective), but I wasn't impressed. Ultimately though, I was happy to just finally receive my pizza.  Maybe it's growing pains, or new staff. Maybe I'll have to give it another try. But unless you are allergic to gluten, and especially if you're on a schedule, I simply cannot recommend it."}
{"text":"Love this place! We moved not far from here and was referred by friends. They have awesome gluten free pizza, lots of choices and they deliver.  You can't go in to eat, it's only take out or delivery, but we live close so we don't mind. As well, they are quick, I've never had to wait more than 30 minutes to pick up.   It is a little pricey, and I do find it annoying that I have to pay more for food, as I have an allergy, but it is good pizza, so I don't mind."}
{"text":"I have been a fan of Avatara since they first launched in Calgary.  Now I have even MORE reason to love them - the entire restaurant and menu are 100% gluten free!  No cross contamination.  I asked the gentleman behind the counter when that changed, and he said ever since he had been hired.  70% of the menu is vegetarian, they offer dairy free and vegan cheese.  Tucked into a small strip mall where Memorial Drive NW turns into 3rd Avenue before the parking lot for Edworthy park.  There is a small parking lot just next to the mall where other boutique businesses ring the parking area.  Next to an iconic Calgary landmark, LICS - Leavitt's Ice Cream Shop, there are maybe 15 seats and a few stools at the counter.  Walking in, you are greeted by the order counter 2 steps in the door straight ahead.  Beverage coolers to the right.  Paper menus to look over are in the mailbox outside and inside on the counter.  If you eat in, you'll notice quite a few people order ahead for take-out.  Pizza names like Picasso, Aristotle, Crusty Cowboy, Shiekh, Buddha, Guru, Italian Stallion, Maui, New Yorker and T-Rex.  Every pizza is a delicious combination of ingredients.  The walls are adorned with art depicting the ingredients on the pizzas... the T-Rex art is definitely as amusing as it is tasty!  You *can* order  1/2 pizza, but I find the pizza heats up perfectly in the oven/toaster oven and is crispy and delicious again the next day.  Although I have been known to order 1/2 a pizza to avoid the temptation to devour the whole thing in one sitting.  There are dipping sauces, create your own pizza on Multigrain Gluten Free Flatbread - this dough is a perfect taste, crunch and softness that no one else serves.  Sides! All gluten free! The Chicken Fingers/Tenders are fabulous bites - crunchy, fire roasted and definitely moist and delicious dipped in a sweet plum sauce.  Smoked Turkey Legs! Pork Back Ribs - hormone free pork as well.  Dessert... they serve Gluten Free strawberry cheesecake - and there are special flavours too! Just ask.  Oh, and if you're at an outdoor event in Calgary - they have a truck out and about at festivals and street stops."}
{"text":"My co-workers and I love this place - we order often for office events.  I love that you're getting a treat, but with healthy, fresh ingredients.  The Guru and Picasso pizzas are amazing!"}
{"text":"I guess it's good if you're celiac or vegan, but otherwise, it's not enjoyable pizza. The crust is stale and cracker-like. The tomato sauce, I will grant them, is pretty good. Very rich and flavourful. However, the rest of the toppings don't live up to the standard set by the sauce. The cheeses lack taste, and the herbs and vegetables essentially act as exciting-looking air. All in all, it's like you're eating baby food topped with decent tomato sauce. If you have severe dietary restrictions, sure, this may somewhat satisfy your pizza cravings, but for the pizza enthusiast, Avatara pizza has none of the fun and vibrance of a good pizza."}
{"text":"As someone with Celiac, this place is pizza heaven! My girlfriend doesn't even have Celiac and she loves the pizza. We also love getting the chicken fingers. They don't even taste gluten free! I highly recommend this place for those on a gluten free diet."}
{"text":"My other half is Celiac so she insisted we must stop her on one of our trips to Calgary. She has always raved about how good their gluten-free pizza is. So on a trip we stopped into their brick and mortar location (they have a food truck too!). I ordered some food for us and when I got to the table she reminded to make sure I asked for the gluten-free option. I told her the menu only had gluten-free options so I didn't have to. She was excited and nervous all at the same time. Did I mess up the order? Is it really all gluten free? YES IT WAS ALL GLUTEN FREE! This is a big deal because yes you can get gluten-free options or gluten-friendly options at many pizza places. The bad thing is for people with actual Celiac disease this doesn't really cut it. Flour in air can cross-contaminate food and when you are talking parts per million of gluten can cause an issue you can understand how unsafe most pizza joints are.  This place is 100% gluten free so I am hoping everyone with genuine Celiac disease knows about this place because not only is it safe but the food is amazing! Their crust is excellent and the assortment of pizzas is great.  The fire-roasted chicken fingers though are superb! If you fed these pizzas and chicken fingers to anyone and didn't tell them it was gluten free I doubt it would even cross their mind."}
{"text":"REALLY sad. . .   I phoned to see if they were open Christmas day and was told yes. I arrived at 6.33pm and they were there, lights on, but locked door. I asked him to open and hoped he would sell me a ready made base so I could still give my children their promised pizza on Christmas day. He was very unfriendly and rude and said he'd closed the till.  - I could have paid cash - It was a shelf product  He had a CHOICE on xmas day, to help or not. He chose NOT to be helpful.  I too am in retail and know he had a choice.  They have seen the last of my money . . . ------------------------------------------------------------------------------------------------------------ I am 'updating' my review from a 1* to a ***  and to add that I was personally contacted by the owner and he was really great. I received a heartfelt apology, he took ownership of the problem, related to me what had been done to address it and asked me if I would accept a voucher and give them another chance. He thanked me for my review and concern. Kudos to you Chris..."}
{"text":"Work ordered a large number of pizzas for our lunch, and not having tasted their pizza before, I was interested in seeing what it was like.  After the order arrived, I sat down with a few slices consisting of T-Rex Meatzilla, Mauie Wauwie & Guru.  Basically a meat lovers, Hawaiian & a butter chicken pizza.  I prefer thin crust over thick so I appreciated their crust.  The toppings were decent as well.  The problem I had with the crust was that the edges were burnt whilst the bottom wasn't crispy at all.  Very odd.  15 bucks seems like an okay price for a meal (I finished off about an entire pizza), but I'm torn on whether it was truly worth it.  Something baffled me about their menu : A pizza named Che Guevara.  Why would you want to name a pizza after a mass murderer and psychotic? Oh well, I suppose there are still useful idiots these days that think he was some kind of hero."}
{"text":"This pizza was awesome!! It is a rice flour crust that was surprisingly fluffy, and all of the toppings are so fresh. Each individual flavour comes through nicely and is a joy to the taste buds! We'll be back to try out their other pizza flavours, as well as the chicken fingers (a personal favourite). So nice to have a great gluten free option, without the worry of cross contamination, and so close to home!"}
{"text":"Sorry, but this pizza is terrible. I don't know why food trucks in this city insist on trying to offer specialty items. Why can't someone just make really good pizza? does it have to be gluten-free, lactose-free, vegan....all of which equate to being \"flavor free\" to those of us just interested in buying a normal meal. There are still more of us \"non-allergics\" out there than there are people with sensitive tummies, so why not try catering to us? There crust is terrible - I'd rather have eaten the box it came in. I don't know if I accidentally got a gluten free one, or if they've just bastardized their recipe so as to offer a gluten free option, but it was aweful. Their New Yorker was supposed to have bacon and parsley, of which I had neither, so I was stuck with the most flavorless pepperoni and cheese that was clearly not \"good, melty pizza cheese\". Again, I don't know if they started getting \"regular\" cheese from their lactose-free supplier or what, but how hard is it to make a pepperoni pizza that's decent? I've had better Pizza 73 at the movie theatre, and that's sad. My husband had the butter chicken pizza, which tasted nothing like butter chicken, but more like one spice in particular (coriander?), which I think was coming from the drizzle of mango \"chutney\" on top. Normally chutney implies chunks, but this was blended up and tasted of little else than that spice. He didn't even finish it, and he never leaves anything on his plate. He ate my last piece of pepperoni and then threw his away. Sad. I think I'm over food trucks, as I have yet to have a good experience, yet I try not to give up hope. And why the hell are food truck prices so expensive? You have no overhead, all you pay for is ingredients, and you're not offering good food!"}
{"text":"Happy Juanuary!!!!!! :) .......some may get this, haha.  Anyway, after work my gf and I decided to get together for a girls night but we were both pretty tired from work and both too lazy to prepare some dinner.  Amanda mentioned that there was a pizza place that she was able to order from as she has a newly discovered list of dietary restrictions.  She was going to place the order while I was on my way to her place so I quickly looked at the online menu and saw \"pepperoni, BACON...\" and decided to go with the New Yorker ($12) on whole wheat which was Tomato Sauce, Mozza, Pepperoni, Bacon, and Parsley.  Amanda went with the Mauie Wauie ($13) which had Tomato or Rebel BBQ Sauce, Ham, Mozza, Pineapple, Bacon, Parsley with gluten free crust.  We got comfy because we ordered delivery.  Delivery charges vary, depending on where you are but ours was $9 and of course you can go and pick your order up as well.  They offer 100% organic whole wheat, gluten free, lactose free, dairy free, & vegan options.  It felt like forever when finally our delivery person came....it must have felt long as I was super hungry.  Anyway, he came with two boxes and a portable debit machine.  After he left I was super excited to dive right in.  I opened the box and saw a very thin crust pizza that looked silly in the box, I even pondered to myself if whether the pizza should be bigger or the box should be smaller.  Amanda mentioned that her Mauie Wauie was a version of Hawaiian and she very much enjoyed her pizza.  At first bite, I found it to be really salty, the bacon is bacon bits...I was hoping for pieces of bacon!!   Overall, this is not the pizza place for me because my perfect pizza has thicker crust, loaded toppings and when you bite into the pizza there is melty cheese that stretches from your mouth to the pizza.....mmmm.  BUT! for people with dietary restrictions, I'm sure they satisfy that pizza craving!   EXTRA EXTRA!  There will be a location opening up in Marda Loop right across from the Shoppers Drug Mart within the next year or so!"}
{"text":"I dig Avatara's dedication towards providing vegan options, and their quirky pizza names, but it really ends there.   I went here with a friend a few weeks ago to see what all the hype was about and make an informed opinion for myself. I was a little bit underwhelmed. At Avatara, one is able to order a half pizza, which is exactly that. Not a smaller, personal sized pizza, but an exact half pizza with about four small slices included. I like having this option, as sometimes I am dining with non vegans and don't necessarily need a whole pizza to myself.   I ordered \"The Aristotle\" with Daiya Cheese and my friend got the vegetarianized \"Che Guevara.\" I would have ordered the Che based solely on the name, but I wasn't a fan of the toppings combination at all. Upon ordering our half pizzas, we sat down, and waited for about 45 minutes for our pizza to be made. This isn't really a sit down spot, but there are a few tables and some drinks, so we made ourselves comfortable.   I was happy to have so many awesome vegetable toppings on my pizza, but was not impressed with the crust at all. I have made many a vegan pizza crust, and all have been better than this one. I understand that they offer whole wheat to promote a healthier option, but I use whole grains tons in my recipes, and they don't have to taste lifeless. Not to mention, I'm fairly certain a topping or two was missing on my pizza. They also need to learn how to cook Daiya properly so it doesn't turn into a half melted tapioca mess.  I didn't like the weird things they served our pizzas on. Also, my friend mentioned upon walking out that even though we had each just eaten half a pizza, she was still hungry. Overall, I am just kind of bummed someone is able to sell vegan options like this and make money from it, when my friends and I can make pizzas twelve times better than this at home."}
{"text":"Just had this today for the first time and it was incredible!  They accommodated all my annoying preferences (gluten-free, casein-free, no cashews...).    I had the Guru (with red curry sauce instead of butter chicken sauce) - it was a masterpiece with gooey vegan cheese!    The price is amazing too, I don't know if they just changed their pricing since some of the other reviews because the price is great!  Perfect portion for 2 people (to even be a bit too full!) for $15!  How is that expensive?  Especially because they don't even charge for changing everything to gluten-free, vegan... like other places do!  And the quality of ingredients is second to none.  Will be a regular from now on and am telling everyone about it!"}
{"text":"Nice little restaurant with good gluten free pizza. Friendly staff, clean environment. Not the best GF pizza I've ever had but good. The crust was thin and crispy, the topping were fresh."}
{"text":"I've had Avatara 3 different times and have used the highly scientific calculator residing in my brain to determine it's overall ranking.    First time - off the truck, had the Picasso, beyond amazing. Second time - at the shop, had the Picasso, pretty good. Third time - takeout, had a pepperoni with pineapple on a gluten-free crust, pretty good.  I think the reason that the pizza hasn't been amazing the last 2 times is that it needs a little more moisture from the toppings.  Yeah yeah, it's on a thin crust so you don't want it to sog, but I'm not a heavy drooler and I think the oven dries the toppings out just a bit too much.  The gluten free crust is amazing - probably the best GF crust I've had.    Bottom line - this is a great option for people dietary restrictions, or those heavy droolers out there."}
{"text":"If you want quality gluten free pizza that's original and delicious, Avatara is your pizza parlour! With two members of my household having gluten dietary restrictions, myself not included, I was hard pressed to find a pizza that we could all enjoy! Now, I can't even tell the difference between gluten and non gluten free, at the discovery of Avatara! In fact, I find their creations much more enjoyable than most, and we can all share our favourites with each other without the worry of upset stomachs!"}
{"text":"I really like the pizzas here, they are not traditional pizzas...  But they are great!!... Those I have tried are really good.. The price is average and the service is not bad... I would go back, to try some pizzas that seem to be interesting..."}
{"text":"I absolutely adore Avatara pizza!  And if you're lucky enough to catch them around town, they also have an amazing food truck.  Located in the heart of Parkdale, Avatara's owner Chris is a great business owner with a strong sense of consideration for vegetarian, gluten-free, and vegan needs.  I have had almost every combination of pizza from Avatara, but my favourite pizza is the crusty cowboy (award-winning!) with chicken!  This pizza has a chili-lime sauce, cashews, honey drizzle, mushrooms, crushed pineapple and more!  The Buddha is a close second favourite with red curry sauce.  You can also customize your own pizza with unbelievable toppings such as roasted red peppers, artichokes, in-house made brushetta and more.  On top of having a great selection of pizzas for everyone, Avatara also offers some different  options such as hormone free gluten free chicken tenders! (50% on Tuesdays!  I know, right? Amazing).  And you know how sometimes you see other things at pizza places and you're like ummm stick to pizza.  Well in this case, you're not going to want to stick to pizza because Chris also slays the chicken tenders (fire roasted!) and turkey legs.  And if you're not too full, finish your meal off with a strawberry champagne cheesecake.  For drinks there's a cooler filled with drinks to go perfectly with whatever you order, even Kombucha!  What I love most about Avatara pizza is you're not left feeling disgusting or remorseful.  All ingredients are so fresh and healthy you're actually left feeling good.  It's a gourmet meal at a great price.  Most pizzas are around 18 - 20 dollars for a 12\" and you can even do a half order (which I do.. often.. don't judge me..) Hands down, this is my absolute favourite pizza in town!  If you haven't been, get your arse over to Avatara!"}
{"text":"The very Best  glutin free  pizza in Calgary or Airdrie. We feel everyone should try the 'Cowboy Pizza'  - Sooo good. !!! Actually all the pizza , oh and let's not forget the fabulous Chicken Strips."}
{"text":"This is just great pizza. Nice thin crust fire roasted for authenticity. The pizza is freshly made with lots of flavour. Nice atmosphere, nearly every flavour combination you could hope for this place is well worth a visit."}
