{"text":"We went to Avec Bistro for our anniversary in June 2013 and it was beyond our expectations. The food was fabulous and the service was exceptional.  I had the duck and my husband had the lamb. Both were outstanding - I really dislike lamb but this was so good, even I would order the lamb.  We had some questions about wine pairings and suggestions given by our waitress were bang on. Everything about Avec Bistro gave us such a fantastic meal experience that we will definitely be back soon."}
{"text":"Just had dinner at AVEC. Great restaurant. Enjoyed the food and wine. Had smoked salmon with horseradish garnish on top of baby greens and a 'potato frite' not sure if that's the proper description but wow, it was fantastic! My husband had the beef tartar as his appetizer (I don't eat meat, but he said it was terrific). I had the fish Du Jour which turned out to be albacore tuna with baby potatoes, green beans, cherry tomatoes and other delectable greens which gave the dish an overall hearty 'meat & potatoes' flavouring (without the meat). All I can say is YUM! It was mouth watering, satisfying, and over the top for someone who no longer eats meat. My husband had the duck con fit with beans and cherries. He said it was delish, with the cherries compensating for the richness of the duck...he loved it! We ended the night by sharing the chocolate terrine. It was like a chocolate frozen dessert topped with caramel shavings and salt. If they would have left out the salt it would have been perfect (I'm not a big salt fan). If you're in town over Stampede, do check out AVEC, it's worth the trip and prices are reasonable. Loved my dining experience this evening!"}
{"text":"Beautiful food and excellent service. We had the special appetizer, a chanterelle mushroom ragout on baguette - delicious. For dinner, my partner had the steak frites...flank steak isn't really my thing so I don't usually end up ordering steak frites bc it's traditionally made with a more muscular cut, BUT - I tried a bite, and it was the best cooked piece of flank steak I've had (cooked sous vide before being finished in a pan, which really helps tenderize the meat). Came with a creamy bearnaise sauce and garlic aioli - so good. I had the fish du jour - pan fried fresh trout with peaches and cream corn, heirloom tomatoes and a gorgeous sauce underneath. This is honestly one of the best fish dishes I've ever had in Calgary...I relished every bite. We caved and ordered two desserts (chocolate terrine with salted caramel and a yellow plum tart with vanilla bean ice cream)....both were delectable. We both left feeling pleasantly full and quite happy that we discovered, and got to experience, Avec. Go. You won't be disappointed.  Note: They've done a great job of renovating, but I would say that the right hand side of the restaurant could use a little more pop/charm. The chairs don't seem to totally match the decor, and it's a little too monochromatic. They have some beautiful red chairs up at the bar - if they could bring more red into the other side (red chairs, perhaps?), it would give the room a little more energy and cohesion."}
{"text":"They definitely get 5 stars for service and ambience, but 3 for menu variety and 2 for the actual food. I am not a huge fan of pork but everything on the menu had that word in it, including the chef's specials with the exception of a Halibut dish.   For appetizer I ordered a pork platter and it was simply ok, nothing outstanding or terrible about it. The entree is really what my review is all about.... I ordered the steak and although the meat was really great, the white, creamy, totally plain sauce that it was topped with, ruined it COMPLETELY. After eating I felt a bit sick and did not have any desire to even try a dessert. I played it safe and just had a glass of muscat.   Based on this particular dinner experience I would never go back but I have friends that love this restaurant and to be fair, the service was exceptional. In a group setup I suppose I would give it a second try."}
{"text":"I had the best meal of my life in Paris last summer and Avec was pretty close to it.  I can't wait to go back :) The service was excellent as well."}
{"text":"Food quality is average, a bit expensive for what it is. The entrees did not match the price. I had the scallops (only 2 for $30!) and they were over cooked. The chocolate terrine was good but not spectacular, and the lemon pie was spoiled. Food is french inspired, that's it. Calgary offers much better french restaurants. The service is all right, our waiter was?t very attentive though. The ambiance is quiet, pleasant. Overall, decent but disappointing."}
{"text":"Straight up classic French cooking, and I'm really liking it. If I could describe this place in one word it would be \"conscientious\". By that I mean that all aspects of the service and food were carefully considered to provide a refined and atypical dining experience, though without being pretentious (much like the modern, clean lines of the warm wood decor).  Rather than having a bloated menu that tries to please everyone, Avec has opted for a modest number of customizable items prepared very well.   Right off the bat, the drink menu has a small but inventive cocktail list: the two we selected were tasty and well-balanced aperol and bourbon concoctions. And they are strong. Deceptively strong. You surely won't need more than one or two for the whole meal.  The menu starts with inexpensive mini appetizers such as croquettes and truffled eggs.  These were a nice way to add variety to and extend the meal without straining the pocketbook.   We skipped over the regular appetizers and went straight for the main courses, though a tablemate did have the mussels which were substantial and could be combined with a mini-appy to make a light meal if cost or calories is an issue for you.  Mains are in the range of $20-25, with the option to add various culinary accoutrements like bernaise sauce to the steak, or green beans amandine for extra veg. We embraced this philosophy and added duck confit ($4) to the otherwise meatless gnocchi with goat cheese ($20). Yes, that makes for an expensive pasta, but MAN was it good...worth every penny. The gnocchi had a pleasant slight chew to them, while the herbs and zucchini balanced the richness of the duck beautifully.  For the other main, we had the crispy chicken with foie gras mushroom sauce. Since you can't get too much of a good thing, we ordered a piece of seared foie gras to top it.  The chicken was crispy but otherwise just okay.  What made it really good was the mushroom sauce.  What made it excellent was the beautiful lentil mixture it sat on.  Each dessert had a suggested digestif pairing, which reinforced the pervasive conscientiousness. The suggestions demonstrate a predilection for hard-to-find-in-Alberta bevvies, from a low alcohol Nova Scotian slightly sparkling Muscat, to a fortified French red.  I had to drive, so I had the bread pudding but skipped the pairing.  The lightly spiced bread was nice and moist, with a slightly crispy exterior making it (in retrospect, unsurprisingly) more like a pain perdu than an English bread pudding.  The caramel sauce was spot on, if a little too little for someone with a sweet tooth like mine. We left Avec pretty light in the pocketbook, full in the belly, and grinning ear to ear."}
{"text":"To. Die. For.  I went to Avec with 2 girlfriends, both of whom are trained chefs. We agreed that the calibre of the food is exquisite. We asked our server for suggestions and we were not disappointed.   It is a bit pricey... and worth every penny. So far, this place seems to be one of Calgary's best-kept secrets. I would go back in a heartbeat."}
{"text":"Definitely on the pricier side but good for a business lunch or a date night dinner.   This place doesn't seem to have become an \"it\" place yet which might be due to its higher price point or its slightly more formal atmosphere (more Parisian bistro feel rather than a local pub).   The food is of the caliber you would expect from the ex-sous chef of Rouge without some of Rouge's more out in the left field experiments.   Overall, if the point of this meal is to impress your date or just your belly, Avec Bistro is a great choice as long as your wallet can carry the price tag."}
{"text":"This is by far one of my favorite places to eat in Calgary!  The owners are fantastic, the servers are gracious and the food is Wonderful!!  Jackie always does an amazing job recommending what wine to pair with my meal.  The menu changes on a very regular basis- and it is always fun to see what is new.  They have every thing from the classic steak frites- to items that someone more adventurous would like.  The food is always spot on-full of flavor, hot, and artfully plated.   I never feel rushed out the door- they make me feel at home!   It is great for a date night out- or to bringing your family when you just don't want to cook!  Amazing, lovely little gem!!  It is in my regular playbook!"}
{"text":"I really wanted to like Avec.  I really did.  But unfortunately, I was let down.    This happened a few months ago, Valentines Day, to be exact.  I was dining with my boyfriend and we had booked a reservation.  We were sat and ordered.  Things seemed to be going well... but it seemed like, after our server had asked if we wanted any wine/alcohol to drink, he stopped caring about our table.  We were just drinking water that night.  And at some point, I remember being very thirsty and not seeing him in sight.  I just wanted a refill.  So did my boyfriend.  And we'd seem to walk right past us and help the other tables.  Even when it became less busy (and he was only dealing with 2 other tables besides us) he still wouldn't come around to ask if we were okay or anything of the sort.  He completely ignored us.  And even when we wanted to pay, we could not for the life of us get him to come to us.  We became fairly agitated by the service that night.  When we were finally able to pay, we left, still completely thirsty and both agreed that we wouldn't want to return.    As for the food, it wasn't spectacular enough to save the night from that poor treatment.  And I feel terrible for posting it... but I had to share."}
{"text":"Loved Avec Bistro. Our first visit but it won't be our last. Excellent service and wonderful tasty food. Portions perfect - not too much and not too little!"}
{"text":"Being from Montreal, I think they don't deserve more than 2! Service was not bad though."}
{"text":"I can't say enough good things about Avec. A cheery restaurant with a welcoming vibe, one of the best (and most approachable) wine lists in Calgary with staff who can give you great recommendations, and most of all just excellent food. I keep going back for the confit duck on white beans, one of the most light and delicate confit duck legs I have ever had, and just enough of it to leave you satisfied but still able to have one of the excellent desserts."}
{"text":"We love eating here. Amazing food and cocktails every time. Very good service. Love Avec."}
{"text":"Bonjour mes amis!  Alright, this review is long overdue because I dined here during Big Taste (eeep)  However, what I loved about the Big Taste menu was that they featured items they actually serve on the regular instead of the bait and switch that most other restaurants do.  My sister and I loved all the options so we got one of everything so we could try it all. Roasted beet salad, butternut squash soup, roasted chicken, moules & frites and the mille feuille and vanilla creme brule for dessert. We were ready for flavortown!  I'm more of a dark meat person when it comes to poultry, mainly because I feel like white meat is dry. But oh mon dieu, the roast chicken was so moist and I contemplated ordering seconds so I wouldn't have to share!  The French know food, and I think Avec does an amazing job representing what French cuisine has to offer."}
{"text":"It was our turn to choose a place for our 4-couple supper club so we decided on Avec Bistro as it looked classy and had good reviews despite being a relatively new restaurant.  The atmosphere was great. Simple, stylish decor. Intimate enough it would be a great date night spot but casual enough that a group of 8  wouldn't feel out of place. I liked that while it was busy, we could still hear ourselves speak and were able to all speak to each other at the table (not always the case when we go out as the supper club).  My man and I started with the moules (mussels). They were lovely and fresh, cooked in a delicious broth with tomatoes and bacon. The portion seemed pretty impressive too for an appie.  He went on to have the steak frites with mushrooms and foie gras. He said they were very good but the meat could have used more seasoning. I had the short rib. It was delicious and perfectly portioned. Everyone else at our table seemed to be really impressed with their food choices.  We all had a salted caramel chocolate terrine dessert. To. Die. For. Lick the plate clean kind of goodness.  The only little trip up was the service. While it was good and our main waiter was very knowledgeable, charming and friendly, it seemed to take a bit of time at the beginning to for them to figure out who was helping us. Some of us had our drink orders taken twice and others not at all. No big deal though. This is the kind of place where is is okay to have a leisurely meal and you don't feel like you are being rushed out. However as a result there were a few times where it did feel like service had slowed down a little too much. For example, my emptied wine glass was removed with our appie dishes but no one asked if I wanted anything else. When dinner arrived about 15-25 minutes later, we still hadn't been asked if we wanted anything else to drink. I eventually asked myself, only then to wait till I was essentially done my main for the glass of wine to show up (it had been sitting on the bar awhile). I think if they just worked out some of the service kinks, this place would be totally worthy of 5+ stars.  One thing to note: they do charge 18% on tables of 8 or more. Pretty typical but good to know ahead of time."}
{"text":"Eat at Avec; don't wait, eat there tonight.  On New Years Eve I had a good friend in town from Vancouver. Although I knew he would be visiting we planned nothing, and at 6:30 pm on Dec 31, I called Avec to squeeze us into the NYE special service at 8:00.  The dinner was a five course meal that included, what the server described as, \"the chef's biggest hits of 2012.\" If these dishes are the stars, I can only imagine how excellent the a la carte menu must be.  The service included a fresh and bright crab cake, a spectacular duck consumee with chestnuts, a fluffy seared scallop with pork belly, salted caramel chocolate torte and a mushroom tart that was so stunning I had to stop myself from licking the plate.  At a French restaurant it's expected that the food be excellent, and Avec delivers; but the most notable thing about Avec, besides the stunning food and the convenient location in the beltline, was the unpretentious atmosphere and overall warmth of the staff and menu. It's a odd description, but the dishes felt friendly, like I was eating at good friends' exceptional dinner party where the crowd was chatty and laughing, the servers friendly and the chef out shaking hands while humbly accepting compliments.  Avec has excellent food, great service and an endearing sense of humor. The staff sparkle as brightly as the menu; so expect this small place with the warm heart to serve a meal you won't soon forget.  T."}
{"text":"Not the busiest place on a Monday   Beef brisket 3.5/5  Absinthe menu is cool  Nicer on the inside than on the outside"}
{"text":"We celebrated my birthday at Avec with 2 other couples that had never eaten there. They are STILL raving about the wonderful food and service. We even joked about going back the next day just to order all the things we wanted the night before but didn't order. On the specials menu was a foie gras and chicken liver pate with a citrus jam. It was OMG delicious. I truly hope it is on the menu next time we visit because it was amazing."}
{"text":"My wife and I had dinner at Avec tonight to celebrate our 3rd anniversary together, and as this is a new restaurant that had not been reviewed much in the local food press, I was a bit hesitant to try it. However, after inquiring about the owners and chef, I decided to try it out, especially that it is just around the corner from our place. First, upon entering, the staff was very welcoming and the setting was nice and modern but unpretentious unlike many over-sophisticated and supposedly-hip new places catering to the oil and gas Calgary elite. After being served some sparkling water (a super deal at $1 per person, all you can drink), we started with a plate of refreshing grilled asparagus with oyster mushrooms and shaved Comté cheese, and a remarkable beef tartare with Dijon mustard, crispy shallots and slightly cooked egg yolk, over thin croutons. The meat was fresh and not too finely chopped so its consistency was as it should, not like hamburger meat. For main, we shared an excellent bouillabaisse served with toast and a little rouille (I would have loved a bit more of it...), followed by a duck confit with white beans and spinach and stewed cherries. The bouillabaisse was surprisingly very good and well seasoned, so good that we completely cleaned the plate with excellent baguette. I spent five years in Provence between Marseilles and Aix-en-Provence, and I can safely say that the bouillabaisse we had tonight would not disappoint a real marseillais. Indeed, it was so tasty that we thought the duck confit that followed would be a little bland, but as a matter of fact, it was not the case. The tartness of the cherries complemented well the richness of the duck, which was very tender and cooked to perfection. To finish off, we shared a delicious vanilla crème brulée which was rich without being overly sweet, so that it contrasted well with the hard caramel.layer on top. Even the coffee, a simple Americano with a rich crema, was surprisingly good, indeed much better than the brew served at most upscale coffee houses in town.  Overall, the setting was nice and trendy (and as a bonus during the Stampede, there were no haystacks, wooden fences or cowboy hats...), the menu offers a good selection, the food was excellent, the portions were satisfying, the service was prompt, courteous and friendly, and the prices were just perfect. We will be back!"}
{"text":"All in all an amazing experience - we got lucky as they were not busy due to the stampede so it was intimate - exceptional service only outdone by the food, the lamb saddle and steak were both great and the absinthe dessert was a very fun idea"}
{"text":"So much tastiness!   I had the mushroom tart to start - flaky buttery crust and creamy mushrooms. For entrees, we shared 3 and they all rocked! The chicken - insanely tender, and the skin was bursting with flavour. The pork tenderloin - as tender as a brisket! And the tagliatelle with short ribs - an adventure in pasta. And then dessert - the chocolate terrine with salted caramel and vanilla bean ice cream - addictive and irresistible, even on a very full stomach.   If you're lucky like I am to have friends who share, you get to try it all! And you'll want to eat it all, every last little bite."}
{"text":"Great small restaurant - classy feel without the high brow negativity. The lunch menu is very simple, but it nice to choose from a select group of entrees that are carefully put together and flavorful. The sandwich and soup combo for the day was a cauliflower puree with a bbq brisket sandwich. Might seem like an odd match, but it worked. The soup was creamy, smooth and rich, and it paired nicely with the bbq brisket sandwich. The meat was tender with bits of fatty tissue which added to the depth and texture of the meat. Other dishes that looked amazing from our party were the burger (huge + fries + small side salad), quiche (large slide + large side of mixed greens).  Tip - For the month of September, you can add truffles to any item on the menu for $10."}
{"text":"Part of poutine week - poutine was good - good smoke bacon.  Had lamb and duck - both just ok.  Expensive cocktail drinks.  Service was excellent and quick."}
{"text":"Woo just when I thought I'd never review Avec again (previous one deleted for reasons unknown) an opportunity for a redemption visit came when we decided to dine her on a last minute whim.  Notes on my first visit: The service was stellar and charming and the waiter educated me on cognac and armanac. The menu (then) was elegant with a firm backbone of french cuisine served in small portions-befitting a high end dining establishment.  On our recent visit: I tried their entrant to poutine week: masterfully fried fries with hamhock gravy over cheese and bacon. Delicious in texture but heavy on the palate with salt, savory, and fattiness. Next I had their duck confit, which was the most tender and fatty confit I've ever had, but I didn't find it  good match with the lentils. Finally we got a chance to learn about Absinthe: our waiter brought out a fancy water drip(a fountain) and educated us on what absinthe is all about: no burning sugar cubes and nothing in the liquor itself that would cause hallucinations (if anyone drank a high volume of alcohol, they're guaranteed some sort of mental episode)."}
{"text":"If you have a chance to check out this Calgary gem-GO!! Fresh and innovative cuisine with a distinctive French vibe. Service is friendly, informative and personal. Can't wait to come back. We had the chefs 4 course with wine pairing which was incredible but the menu features an incredible selection."}
{"text":"4 of us went to Avec for my birthday on Monday.  Another fantastic dining experience.  I had the beef bourguignon for dinner and the beignets for dessert.  Both were delicious.  We paired dinner with 2 great wine selections, one from the Rhone and the other from the Willamette Valley.  Can't say enough good about this place."}
{"text":"First time at Avec Bistro. Great place, nice ambience, friendly service, great food and wine list."}
{"text":"Avec is our favourite restaurant in Calgary. It's the place we go for any special occasion and it never disappoints.  The service is always superb without being pretentious.  The drinks are fantastic with an extensive wine and cocktail list.  The food is always amazing. Our favourites are the beef tartar, duck confit, steak frites and the banana bread pudding for dessert.  The prices are very fair for what you get.  We will continue to go to Avec until they give us a reason not to."}
{"text":"We live only a few blocks away from this restaurant and we pass it almost everyday. So sooner or later we had to try it, specially with all the good reviews.   From outside, the patio looks a little bit dated. However, when you enter, it has a casual comfy feeling.   We ordered the beef tartar and rack of pork in addition to mussels. The food arrived really fast. The mussel and fries was good but nothing special, pretty standard. In contrast, the beef tartar was excellent. Fresh, tasty and the bread cracker was fantastic. But the star of the night was the pork rack. One of the best pork dishes that I had in Calgary. The exterior was very flavorful and inside was moist. The bacon sauce and potatoes on the side was also excellent. Just thinking about it, I want to go back there and order that dish.   My experience was very good, however, our friends ordered the halibut and bouillabaisse. Both dishes smelled a little bit too fishy and in my opinion not the freshest sea food; hence the 4 star review. Otherwise it would have been an easy 5 star.   In conclusion, Avec is exactly what you expect from a french bistro. Reasonable price, simple menu and generous portions. Highly recommended for a relax dinner or lunch. Very good for solo diners."}
{"text":"We finally tried Avec, and I'm so glad we did. On a quiet Monday evening after Remembrance Day, we received absolutely stellar service. I tried the mushroom soup, plat du jour (seared scallops and prawns), and the chocolate hazelnut bar, and I was pleasantly full at the end. Every dish was superb. Warning: the chocolate hazelnut bar is very dense, it can easily be shared by two people. The wine list isn't extensive, but there are more than enough selections to pair with the various menu items. A fine place to have a relaxed dinner with good company."}
{"text":"My first bistro experience in yyc and let me tell you, it was the most fantastic meal I've had in a long time.  To say I damn near died and went to heaven after my first bite of Foie Gras would be and was an understatement.  I savoured every morsel, and cried when the plate was finished. I felt like Degas himself prepared the dish. I had never before tasted something quite so divine.    The Tempura Escargot were equally delicious - I wont say the word battered - because it was so light, the flavour of the escargot shone through the tempura - not taking anything away from the dish whatsoever. The pea purée complimented the escargot perfectly, making this dish a great start to any meal.  When it came to the main course, my friend decided that she wanted to split it between the two of us, which meant we had to be ever so diligent in our choice, and after much agonizing I decided on the Ricotta gnudi, courgette purée, chèvre, truffle honey crouton with duck confit as our main course.  Gnudi (pronounced \"nu-dee\") is a type of gnocchi made from ricotta cheese and a little bit of flour. The result is a dumpling that some describe as \"nude\" ravioli, or filling without the pasta -- that is to say, light, fluffy, and creamy.  I have never had gnudi before - I am a HUGE fan of gnocchi, and I was pleasantly surprised at the slight differences the dish had to its potato brethren. The courgette and chèvre completed this meal perfectly. A true ingredient symbiosis.  The Avec Bistro menu is seasonal, and what we enjoyed on that perfect September evening may not be found on the current menu but I highly recommend; whether you are a seasoned veteran to the Calgary food scene or simply passing through - to go and enjoy the atmosphere, the service and most importantly - the food. It is indeed glorious - and a place I cannot wait to visit again."}
{"text":"I was debating between which french bistros to try out during Big Taste - Avec Bistro and Parc Café and Brasserie. Clearly, we went with the former and were hoping that the food would match it's high rating on Zomato. However, I didn't realize before we arrived that they were under construction so it was a bit tricky to spot from the road.  Avec Bistro has pretty regular hours but beware they're only open for lunch on weekdays. Took a few photos of their menu posted outside. Love when restaurants do that, very French of them. Reminds me of Montreal. They have beignets!   The service was on par but the timing between courses was way off. We easily waited over 30 minutes to get our dessert from the kitchen. If we had to be somewhere, like the table beside us who had a play to attend afterwards, I would not have been a happy camper. We could overhear them debating whether to forget dessert and leave but they ended up staying, wolfing down their dessert and running off. Not sure what was happening that night (it was a Saturday) but for the price ($35.00 Big Taste menu) and AB's reputation, I expected better.  - Roasted beet salad - candied pecan, chevre noir and shallot vinaigrette. Started things off with a delicious, albeit crazy small amount of beets. We're talking half a dozen bites, maybe??? - Butternut squash soup - maple candied bacon and speck creme. My friend K went with the other option, which she was 100% stoked about all day. I had a spoonful to try - nothing really pops back into my memory about it.   - Roasted chicken - creamy polenta and truffle honey carrots. This was my entree for the night. The polenta had a light, creamy texture but I could taste a bit of gritty texture between some bites. The carrots had a touch of sweetness but the truffle didn't come through for me. The roasted chicken was disappointing. Three tiny pieces and somewhat dry. - Moules & frites - white wine, parsley, shallot and butter. The mussels were nice and plump and went well with the sauce. The fries were missing a sauce/aioli to accompany them and were desperately in need of the deep fryer. Soggy and limp is never good.   - Mille feuille - chantilly, vanilla custard and raspberry compote. This isn't what I normally expect for a mille feuille but maybe that's just me. I had a bite but we both thought it just okay. It needed to be more flaky, buttery, and be more infused with the whipped cream/cream filling. - Vanilla crème brulee - a classic that's hard to mess up. The top was nicely caramelized and the inside was custardy goodness.  Overall, we were both disappointed with our dinner at Avec Bistro. Can't see myself coming back anytime soon."}
{"text":"Went to Avec today for the Big Taste luncheon and I would say more of a \"Big Letdown\".  The lunch was $25 and included a micro salad with 3 leaves Arugula and a few pieces of beet, the salad literally was 2 inches long by 1 inch, for my main I ordered mussels (which were good) that came with fries (small,small serving), my girlfriend ordered the goat cheese and mushroom tart, it was awful.  A small piece of puff pastry with a tiny dollop of goat cheese on top and a few mushroom pieces.  We waited almost 40 minutes from the time we got our salad to the time we had our main course, this was followed by the worst Mille Feuille I have ever had, just a splash of liquidy custard under the puff pastry-  very tasteless.  The whole thing took almost two hours, which is not acceptable during the workday especially when it is a set menu.  Two other disappointments were they charged me $3.50 for a refill of coke (the glass was so full of ice that it was only a half cup of coke) and $4.00 for a small baguette to go with my mussels.  Do better."}
{"text":"This place deserves all the good reviews it gets. On our first visit there, we had high expectations, and we were not disappointed!  The steak was excellent, the dessert was great, and the service was really flawless.  for a dinner for you, with appetizers, dessert and some wine, you are looking at about 150-200 $."}
{"text":"I was here last night with friends.  The only turnoff is the automatic 20% gratuity charge with a party of 7 or more people.   Avec is simply decorated but it's classy and most patrons were dressed this way as well.  The tables aren't excessively large and even though it was quite busy and a little louder at one point, it didn't disrupt our visit with friends at the other end of the table.  This certainly is an issue in some restaurants.    Our server was a cute and mature male, which was nice for a change.  I'd consider the menu to be narrow but yet the choices are diverse, so everyone could find something they'd like to try.  My spouse and I shared a special appetizer, which was a pastry with mushrooms (and other ingredients I don't remember).  It was rich and delicious.  The pastry was obviously very fresh.  My main was the Goat Cheese Ravioli with garlic confit, ratatouille and basil.  I added the confit chicken.  It was slightly less flavorful than I had expected but it was good and one of the more unique pasta dishes I've had.  I enjoyed a delightful glass of Riesling with this, but my drink order did take awhile before it showed up.  My spouse liked his steak frites but thought the fries that accompanied it were just okay.  As far as I know, everyone else at the table enjoyed their appetizers and mains.  For a low key, pleasant dining experience, give Avec a try.  Picky and conservative eaters beware, this may not be for you.  I don't think I could return because I wouldn't want to eat the same meal twice and being that I'm a little picky myself, there isn't much else on the menu I'd be open to eating.  If you're like me, check out the menu online before you go."}
{"text":"Everything was excellent here!!! From the wine to the desserts!!! The appetizers were delicious!! And the main dish was great!! I had the duck and it was amazing... As appetizers we ordered different things to share and everything was good!! Nothing to complain .... The dessert was the best part! We had the ice cream and it was incredible!! I would definitely go back to this restaurant!! I recommend it 100%"}
{"text":"Despite it being Valentines and not having made reservations (Last minute nelly here) They still fit us in at the bar. Service was excellent, our waiter/bartender making excellent suggestions on both food amd drink.  Decor was excellent. Food... oh my ... the fooooood. So good, beyond words."}
{"text":"Good wine and food selection. This restaurant has great ambiance. The food was expertly cooked, there isn't a large selection but what is offered is great."}
{"text":"I've come here about 3 times and on most occasions I have a decent meal. The restaurant is very tiny though, so there is limited seating. If possible, make reservations.   The last time I came to Avec, we happened to come on their one night with set menus only. We were not aware of this, but we decided to stick around and try their menu. I believe I had the fish and my friend had the chicken. There was only the option of the fish or the lamb, but the waiter said for 10$, my friend could have the chicken. Well, it turns out it was for an EXTRA 10$ she could ave the chicken; it ended up costing her close to 35$!! If she had known, she would have just ordered the fish too.   Other than that, food was fairly tasty. They tend to lean more towards the 'casual' French cuisine, which is very comforting and warm. Definitely a good place to come for a casual French dinner. Pricing is okay, as are portion sizes.   I do find that service can be a little hit or miss. A few times I've had to go up to the waiter and ask for my bill. Another time, I stood waiting at their cash register for either one of the two waiters to notice me and help me get my stored jacket. They were just talking amongst themselves and seemed to ignore me.  Unfortunately, this has tarnished my experience with Avec and while the food is good, it isn't worth the mostly miss service."}
{"text":"My new favourite place! Everything we tried was super yummy. Our waitress was cheerful and welcoming.  We started off with the peasent cheese plate, my only complaint is I would have liked a softer bread option with it. I had the Mushroom Risotto, very delicious and the crunchy cheese wheel was a very nice contrast. I added the prawns to it, but it didn't really need them. We shared the sticky toffee pudding and I would go back just for that. The dark and stormy drink was a bit more lime then I would have liked. They were not overly busy so everything felt very comfortable."}
