{"text":"I feel as though I need to start this off by saying I had never been to the old Avenue. Driven past it many times, yes. Heard great tales about it, yes. Actually stopped by, nope! I'll blame this on my West-side tendencies. Anyway...

I think the \"new\" Avenue is great! I love the interior. Sleek and Mod, with beautiful finishes!

My date and I went on a Saturday night, without a reservation. We were told the wait was 30 minutes and it was suggested that we grab a drink at the bar. My date grabbed a seat on the long, low banquettes in the front of the bar (a really nice place to wait), and I bellied on up to the \"bubble up bar\". This was my only point of (minor) disappointment with Avenue. It took quite a while to get drinks. I get it though, Saturday night = prime bar time! But even when someone did take my order, it was quite a wait before she got around to making my drink, and I watched her make several for other customers. I was actually surprised she remembered what I ordered after all that! For such a long bar, and the need to make drinks for seated tables as well as bar customers, it seemed like they could have used one or two more staff members behind it. But hey, a minor issue, really. I was probably just thirsty. 

The drinks though, they were tasty. My date went with the Sparkling Negroni ($9) and I tried the Spicy Grapefruit Fizz (Also $9, but... muddled jalapeno!). Both were flavorful and strong.

After we were seated at our table (a cute comfortable very round spot at the back of the restaurant) we perused the menu and I have to say, everything sounded pretty good. So, we decided to go with what our waitress referred to as a \"parade\" of their shareable items.

My date, feeling somewhat adventurous was craving the fresh oysters and beef carpaccio. I didn't eat them (not my thing) but he reported they were good. 

We split an order of walleye fingers, which were tasty. Two crispy breaded cuts of walleye paired with a shaved brussels sprouts salad, a grilled? lemon and house-made tartar sauce. Standard fare for Wisconsin, and Avenue delivered.

We also had the short rib, white cheddar \"croquettes\". These should probably be renamed \"arancini\". The difference being: arancini are made with rice whereas croquettes are made with smooth mashed potatoes. These were indeed mrice balls filled with meat, which left me a bit disappointed because I was expecting a different texture. That being said, the short rib meat inside was delicious, as was the tomato sauce they were served with. I didn't taste much of the cheddar, which I think may have just been grated on top.

As silly as this is, perhaps my favorite item was the dish of fried pickle chips. YUM! Well seasoned, but not TOO salty. Not at all soggy, like some are. And the green goddess sauce on the side... perfect! What can I say, I love a good fried pickle.

Overall, a nice experience and I look forward to going back!"}
{"text":"I've had lunch at the new Avenue bar twice now and the food was very good but it took way too long to get our cocktails, the bartenders need to move a lot faster, they seem to have no sense of urgency, properly trained bartenders want customers to get their cocktails asap and should deliver them to the tables themselves if they aren't busy and they were not busy.. I will go back but given that this has happened twice now, I'll go to the bar immediately and maybe eat there."}
{"text":"I have been to Avenue Bar numerous times and always enjoyed the supper club atmosphere and the food was good and plentiful so I thought we would try the newly renovated Avenue Club. It has that modern feel with a modern menu. Unfortunately they no longer have the lake perch which was one of the best in the Madison area and no longer have the shrimp dinner but they still make a really good old fashioned."}
{"text":"Used to frequent when it was the Avenue bar. Awesome restoration with a great new atmosphere. Unique cocktail menu. Very very good food!!"}
{"text":"What a great restaurant. Food Fight really nailed this one. I have been there 2 times and can't wait to go back. The staff was friendly and welcoming. Food was excellent! I would go for the short rib stroganoff. My husband had the cod sandwich -- both were very tasty. Definitely going back and letting my friends know about this!"}
{"text":"We made a 6:30 pm reservation through Open Table on a Friday night and when we got there, there was no record of our reservation. Even though I showed the confirmation on my phone, they did not have a table for us. So we had to wait about 20 to 25 minutes to be seated.  Our server was nice, but the service itself was very slow. We actually got our entrées before our drinks made it to the table. I ordered the pan seared walleye, and it was so greasy it was like I had ordered the fish fry.  Overall the food was mediocre, the service was slow and we won't go back."}
{"text":"Pleasantly surprised after glossing over this place for the last 5 years. I think the supper club concept is properly modernized here. I really liked some of the choices offered, like a \"traditional\" vs \"Wisconsin\" Old Fashioned and baked vs fried options for fish fry. Works for me because I'm normally not a fan of supper clubs. The space is nice and big and we didn't have to wait at peak time, although it was busy. 

Malissa our server/bartender was excellent. I was surprised at the how good and flavorful the burger was. Cheese curds were some of the best I've had. Recommend!"}
{"text":"Food was good, however both times I have been here in the past two months the wait has been very long once we sat down. I think they only had one server both times for our section.  Good for groups though."}
{"text":"Pleasantly surprised! Excellent cocktails and a varied menu. I enjoy the veggie hummus wrap.  Nice ambiance and great bartenders. Definitely an improvement."}
{"text":"Yes, yes. The Avenue Club/Bubble Up Bar really nailed it. I've been here twice and left pleased both times. I really appreciate a place where the bar tenders are dressed sharply. The collared shirt, tie and neat appearance enhance the cocktail experience for sure. 
It's an intimate atmosphere with superb lighting and bar layout. Very inviting. There are plenty of seats at the bar but the bar tenders definitely ensure you are served properly. 
My drink of choice is the Old Fashioned but I asked them to modify a few things to fit my preferences. They had no trouble with this and even remembered the modifications perfectly on the next round. It was quite busy so this was appreciated. 
We tried a variety of appetizers including chips and dip, Reuben sliders, deviled eggs and chicken wings. None of them disappointed. The chicken wings were outstanding. 
Parking is easy here as well, always a plus."}
{"text":"Forget it. Four adults and one toddler went in on a Sunday morning after running a 1/2 marathon. How complicated can breakfast be?  Straightforward order w/ Bloody Mary's and 3 coffees. Everything took forever. Good crowd, but not crazy. And plenty of staff on the floor. I ordered the standard egg breakfast - with scrambled eggs. I got an egg omelet. I hate omelets. My son ordered corned beef hash and dared any one of us to find any corned beef in his dish. The coffee tasted like the stuff I got in a bus station when I was in college. 90 minutes later the toddler was tired of sitting and cranky and while we weren't  full, we had nothing we cared to eat. Second try at Avenue Club for me. There won't be a third."}
{"text":"I cannot praise the Avenue enough. The renovation is absolutely stunning. Their drink menu is extensive and their food is always consistent and delicious. I have interacted with many of the staff and they are all extremely helpful and genuinely care about their patron's experience. They do get busy on weekend nights, as most good restaurants do, so it's obvious that service might suffer a tad but even when the staff is running around trying please everyone they are still smiling. It's disappointing that there are some out there who have trouble appreciating the art of the service industry. I know I couldn't do what these people do, I bet most people couldn't. Keep up it Avenue! You have never disappointed me."}
{"text":"I had family in town, so I suggested we go to The Avenue Club and Bubble Up Bar. I had heard good things about it since the renovation, and I was craving fish fry. I was able to make a reservation for 6, which was nice so we didn't have to wait. However when the food came out it was way too salty. It tasted like the chef may have been a little heavy handed with the salt shaker. Four out of six dishes were over seasoned with salt. Also when I got my fish, they had placed everything strategically where the fries were extremely soggy. They weren't even enjoyable. I was pretty disappointed. On the other hand, the service was friendly and quick. I don't know if I would race to get back there."}
{"text":"Had to try their fish fry since many people I know rave about it. Not a big fan of battered fish but figured I would give it a try. Way too greasy. The table next to us had broiled cod which I would try. Looked good. 
My husband had the walleye. He said it was excellent. Since he's not a huge vegetable fan I ate his green beans - very good. 
Since we were there during restaurant week they had my favorite - key lime pie - great job! Don't think it's offered on the regular menu. 
I would go back, just not for the fried fish."}
{"text":"We dined on Sunday night and really enjoyed the atmosphere and the dinner.  It is old school midcentury modern glam with an updated vibe and it really works and is a wonderful update to an old favorite location.  My husband had the Sunday night special of chicken and champagne.  It was delicious and nice and crispy.  The Duchess potato was a delicious side order.  I had the blackened chicken salad which was beautifully presented as well as delicious and again an upscale modern version of the traditional Cobb salad. They also make Old Fashions that were very good."}
{"text":"I admit I only went to the original Avenue Bar once so I can't do a comparison and I don't think I would want to. This is a reinvention based on what the new owners wanted to do. I've been wanting to eat here since it became a Food Fight restaurant and finally made it last night with my husband and friends of ours. We were all pleasantly surprised at our meals. We loved the atmosphere as we are all old enough to remember the traditional supper club. The Avenue Club just feels comfy and welcoming. My husband had the fish and he said it was very good, the fish was flaky and not greasy. I had the Cali Chicken burger and it was flavorful. I also had their tomato soup w/chicken. It had a nice little kick to it. My girlfriend had it also and she is not a big fan of spicy food but the soup was just right for her tastes. Her husband and the BBQ and pasta. He said it had a bit much BBQ sauce but overall it was very good. We'll be back again to try other things on the menu."}
{"text":"you must be kidding?? it appears that no one writing reviews here ever went into the old ave bar....this is progress? terrible to think that the once venerable spot is no longer. would have been better to have simply torn it down. sad!"}
{"text":"Dinner on a Wed night with my family. First time to try this restaurant and looking forward to it, as we generally are fond of the Food Fight restaurants.  Overall quite disappointed, mostly based on the food quality and price.  I had the short rib stroganoff, my husband had the pan seared walleye, and my son had a cheeseburger.  Almost everything was pretty blah and seemed devoid of spices, salt, anything.  My husband said his walleye was \"OK\" but not worth the $20 tab.  My stroganoff was OK at best (as mentioned very bland and I needed to add lots of salt/pepper) and definitely overpriced (at $20) for a bowl of pasta, peas, mushrooms and one little tiny piece of short rib.  I don't mind spending $20 for an entrée that is tasty but this was definitely not it.  My son ordered his burger medium-well - it was way overcooked and extremely dry, and the coleslaw was also extremely bland. Again, I don't mind paying $11 for a good burger or sandwich but this was not worth it.  I will say that our server was nice and relatively attentive.  The décor is not my up my alley but was attractive and comfortable. However, based on the disappointing food, especially for the price, probably won't go back except maybe to have drinks at the bar or if I hear they've made some significant improvements."}
{"text":"I had to been to this place years ago and thought it was really good, so when a friend suggested we try the updated version I said sure.
The atmosphere was nice, kinda felt a little 50'sish.  The menu was a little pricey, but new and exciting.  I had the blackened salmon sandwich with fries.  The sandwich itself was excellent, salmon cooked perfectly, the right amount of seasoning and the size was just right.  My only issue was the fries, I was not a big fan but that is just my personal preference so no points off for those.  Overall a good experience and great food.  I will return."}
{"text":"I have been here twice for lunch and both times, they did not disappoint. The first time was with a group of six, and everyone's dishes, mostly ordered the lunch salads and the sandwiches, were fantastic. Not one complaint around the table. The 2nd time was just a party of two, we tried a couple different sandwiches, the hummus and veggie wrap for me, and the ham and cheese sandwich for my husband, and they also were very good. I felt it was a good portion for the price. The fries on the side were great. We were farily regular patrons for fish fry at the old Avenue Bar, so I wasn't sure my husband would go for this renovated place, but he thought it looked pretty nice inside, and having good food helped him accept the different atmosphere. We will be back for sure."}
{"text":"We made a reservation and when we arrived we were told to wait at the bar, waited there for over a half an hour then were finally seated. While wait staff was pleasant, the hostesses were very unfriendly and stared at us over the course of the entire dinner. After ordering our meals, we sat there for quite some time waiting for our water to be refilled. No rolls or other noshing items were provided. I ordered the beef stroganoff, which if you're into flavorless noodles floating in a heavy (and somehow dry?) cream sauce, you're in for a treat. The beef portion of the dish was similarly flavorless, came in a moderate sized cube, and was not cooked with the rest of the ingredients so as to impart any flavor - I will concede, the peas and mushrooms were good. My dining partner had the Friday night fish fry of cod. The battered fillets were served tepid, and the batter was essentially a soggy paste casing the fish. The single piece of the bread provided with the fry was hard and stale. The French fries were tasty but few, and the coleslaw was actually quite good.  Well this wasn't a absolutely horrible experience, given the other options available nearby and throughout Madison, The Avenue was a waste of time and money. Save yourself the disappointment, go elsewhere."}
{"text":"Went to the Avenue Friday night for fish fry and was not disappointed! This was my first time being here since the remodel. I was a fan of the old place and the old fish fry, and this is definitely still a great place for fish fry. The cod is beer battered in Spotted Cow and so crisp and delicious. I would highly recommend to anyone. We also had the cheese curds appetizer, which was similarly amazing. Plus their drink menu of craft cocktails is awesome."}
{"text":"We called about the wait, and they could seat us ASAP. Naturally we rushed over. It only took us 10 minutes. Upon our arrival, we were told it would be another hour and a half before we would be seated. That wasn't going to fly, so after complaining, they sat us in the corner of the bar. It took 20 minutes to get water which was disappointing. It's fish fry night so naturally we got the cod. It was SOOOOO battered. I could go on, but I think you get the point...

I will say that the interior was very nice!"}
{"text":"We hadn't been here since the good old days when it was the charming Avenue Bar. Now, it's swanky and cold feeling. I was expecting the food to be better since it's a Food Fight restaurant now, but my baked cod was overdone and the cole slaw had a weird flavor to it. Why improve on a madison classic? They should have left it as is."}
{"text":"We've been looking for a regular Friday fish fry spot for a bit now. We decided to give Avenue Club a try since they take reservations (thank you!) With our picky kids in tow, we were all in. Everything was phenomenal - the fish fry, the drinks, the chicken fried pickles! The atmosphere and service were worth returning for as well. We truly felt at home. We've already been back a second time and cannot wait to visit again."}
{"text":"Well, that was disappointing.

Tried the Avenue Club again last Friday night - for dinner this time. The Templeton rye old-fashioned press was still great, but the dinner...sigh. I ordered the pan seared walleye - something I've had other places and absolutely love. But this was just sad. It came with brussels sprout/radicchio slaw, sautéed green beans, and two small, smashed potatoes. All of the go-withs were sort of lumped together on the plate - and then the walleye was draped over the top. 

Now, wouldn't you think they'd serve that with the seared side of the fish up, so you could see that lovely brown crust? Nope. They put it seared side down, with a smear of tarter sauce over the top. So you had this utterly unappetizing, white and gray piece of fish (which I swear wasn't even a full filet) as the centerpiece of a lackluster plate. It tasted all right, but I had a terrible time getting past the way it looked. Think hospital cafeteria.

And frankly, it just isn't enough food. I found myself looking longingly at the plates of fish fry being carried to other tables, wishing for a do-over. I arrived starving and left hungry. Bread basket, please. Or something. Anything.

Also...6:30 on a Friday night and the place was not full. Food Fight needs to step up their game - or the Bubble Up Bar is going to go flat real quick."}
{"text":"For years, I occasionally frequented The Avenue Bar and Grill.  It was a goodf, scuzzy bar with indifferent food, mostly from the 1950's.  Recently, it was purchased by Food Fight, and the transformation has been amazing.  While the exterior remains very similar, the interior and the menu have been brought into the 21st Century.  I have been there at least 6 to 8 times in the last 60 days, and have never been disappointed!  The service is excellent as well!  Overall, a great experience!"}
{"text":"Really a bummer that Food Fight Group took over this once nice place. The service was bad (slow, inattentive, and plain rude) and food was lack luster.

Plenty of better places to do in Madison than this once esteemed restaurant-definitely worth skipping for breakfast or dinner."}
{"text":"Pretty disappointing. Bartender collected our money,  said 'thanks' and didn't bring back the change, of which there was more than a good tip. Fish boiI is gone; the best burger in the city (blue cheese with bacon jam on a pretzel roll) gone; most of the staff gone. We ordered a goat cheese cheesecake (very good) with coffee that came out 10 minutes before the dessert. Our food was just ok.
I'm sure they are not aiming to keep the over 60 crowd that used to go there- we saw very few of  the old Friday night regulars. I like the interior, but many of the older east side crowd will be a bit uncomfortable with the retro- this- belongs- downtown vibe. They really should have re-named the place entirely so there would less expectation that anything remained the same.
But, I understand the sometimes need to change. Overall- meh"}
{"text":"Well, that was disappointing. Start with the food, because that's the point of a restaurant. I went for brunch and had the sausage and corn pancakes and the small biscuit and gravy. The pancakes had no real flavor or texture, as though they had been sitting in a steamer for a  long time and garnished at serving. And, until I re-read the menu for this review, I had forgotten there was supposed to be sausage in them. I can't say I tasted any. I've had the brunch corn cakes at fellow Food Fight venue Eldorado Grill and theirs a lot, lot better. The gravy on the biscuit was also severely lacking in flavor, and was not quite cold upon serving.
Sadly, the food was the best part of my experience.
I walked in to what felt like a lie. When I told him I needed seating for one, he told me he couldn't fit me in on the restaurant side, but I could seat myself in the bar area. That was a little surprising since I could see at least one 2 and a couple 4s open, in addition to larger booths. When I left, most of those same spots were still open.
If the policy is to not seat singles on the restaurant side, say so. Don't lie and make it seem like you're too full. People hate being lied to.
In the bar area there were some pub height tables with 'Reserved' signs on them (they were never used while I was there), and a lot of spots at the bar, so I sat at the bar. The bartender greeted me, got me a menu, got my order promptly to the kitchen. The food came out sooner than I expected, which makes sense if they had cooked the pancakes earlier in the day. Ten minutes in I ran out of ice water and pushed the glass to the bartender's edge of the bar. Fifteen minutes in I ran out of coffee, and did the same with my cup. Twenty minutes in he offered to take away my dishes (I wasn't quite done, but 'OK'). He reached around the empty glass and cup and took my plates. Twenty five minutes in, the gal who had been prepping drink garnishes walked by and finally asked if I wanted refills. A couple minutes later he brought the bill.
Comments: The coffee was OK. I prefer a blonder roast and a richer brew, but that's just a preference. The place is pretty, in an upscale 60s kind of way. I'll probably try them once more. The problems I had are fixable, and Food Fight usually takes care of things."}
{"text":"This is one of my neighborhood bars and I love it here. The atmosphere is great, staff is amazing and the food is top notch as well. Don't pass on the classic old fashioned, it's one of the best in town!!"}
{"text":"Our server was quite lovely; our dinners were pretty meh, especially considering the price.  Caveat here- I feel like a lot of the reviews I've read about this place are comparing the classic Avenue Bar to this new Food Fight iteration- I don't have a dog in that fight as I never really cared for the Avenue Bar food that much. But I will say that the decor and atmosphere here are great.  Very comfortable (we were seated in a cushy booth) and really relaxed, calm, and quiet.  

We ordered the tempura calamari as an appetizer, which I totally recommend- it was the best thing we ate.  Lightly flash fried in sweet chili sauce, with a side of Napa cabbage, topped with peanuts and cilantro- this was perfectly balanced and tasty.  Unfortunately our entrees were .... well, I have to say that the closest thing I could compare them to is cafeteria food.  I ordered the steak.  A 12-ounce strip for $30.  The menu said it came with red wine sauce, maître d'hôtel butter, and duchess potatoes loaded with sharp cheddar cheese, bacon, chives, and sour cream.  I asked for no sour cream.  I got a steak with the maître d'hôtel butter as described, but it was also smothered in a thick, tomato based sauce.  Almost like a marinara.  and there was a lot of it.  It made the steak, which was already swimming in melted butter, pretty unappealing. Just a really weird flavor.  And the potatoes were basically mashed potatoes pressed into a ramekin and baked. No cheese- no bacon- no chives. Again- weird. My boyfriend's burger was supposed to come on a \"house-made cornmeal kaiser roll.\" It came on a standard hamburger bun.  And for $11, it was a burger with lettuce, tomato, onion, and soft cheese spread (which lent the burger a strange gritty texture).  He only ate half of it due to the excessive char on the burger.  His fries were unremarkable and undercooked.  There are plenty of spots in Madison where a better burger and fries could be had for 7-10 bucks. Step it up, Avenue. 

We liked our server and she bought me a birthday dessert partially due to the food issue- both the desserts were yummy (chocolate layer cake with berry sauce and creme brulee) but we noticed that all of the service staff looked pretty unprofessional- jeans/tshirts/etc etc which was an awkward standout in the classy space.  

Will probably go back for drinks/apps in the bar in the future, but not likely we'll get dinner again."}
{"text":"Not sure of past reviews but this place is FIVE STARS in my book. Awesome service, cool vibe, reasonable prices and tasty food. Started with cheese curds. Best I have ever had. Followed with meatloaf. Also delicious. Wish I had time for the drink menu. Next time for sure."}
{"text":"The fish fry at Avenue is a Friday night must! While it is necessary to make reservations, it
won't disappoint.  Start by having the onion dip (it's amazing), then order a brandy old fashioned or local beer, then finish with a fish fry. They may try and push you out of your seats due to the number of folks waiting, which can be frustrating. If that's the case, head over to the bar side and enjoy the rest of your evening. They have some great stuff going on. The only thing that I would change is the pressure the staff feels to turn tables quickly. Let people enjoy the awesome atmosphere, food, and beverage!"}
{"text":"This review is for brunch only. I've been here twice for brunch and have left very happy both times! This is a good spot to choose if you're late to the party (meaning you haven't really planned exactly what to do) and you want to get brunch near downtown. Parking is easy and it's a short ways down East Wash so it's just out of the hustle bustle of the square. On our most recent visit, my husband and I both got omelettes. He had the ham and cheese and loved it. The ham was shaved very thinly and he was impressed with the caramelized onions. I had the mushroom omelette and they happily substituted goat cheese for feta, which was such a good choice. Yum! I highly recommend it! The potatoes are very, very fried but yummy and they have homemade jam for the toast. Coffee is good and strong, service is quick (if you want it to be) and friendly. All in all, we would return. Their cocktail menu looks really good so I'd love to try some of them in the future!!"}
{"text":"What did they do to the inside? The remodel completely disappointed me. It no longer looks like a charming supper club but some cheap modern average restaurant. The service was poor, our server said maybe 10 words to us the whole time. It took the kitchen 45 mins to get us an omelet and an order of chilaquiles, which by the way are not chilaquiles. They gave me a plate of nachos with some toppings and eggs. Very very disappointed. Don't waste your time."}
{"text":"Brunch review only:

Brunch? More like late lunch. But it was Saturday, and they still had eggs on the menu.

Well, I FINALLY found a place who will give me GREAT Mexican food breakfasts. Enter, the Huevos Divorciados. OMG! These are fabulous. This is \"Shock and Awe\" for my eyes and tummy. First, not one but TWO, PERFECTLY cooked poached eggs. Not one but TWO, perfect Mexican sauces (the red and the green = guajillo meets enchilada sauce and mild tomatillo sauce). Shredded chicken, still moist. Black refried beans, no whole, but REFRIED. Real chunks of avocado (a WHOLE half). White corn tortilla - soggy but you can't get it all perfect. This thing is amazing. If you dare, get it!  5/5

Fried Chicken Egg Benedict - the chicken breading is gnarly fun but it was dry. Could use a little more \"slap ya momma\" or some cajun seasoning, but overall, it's decent. The biscuit is HUGE, but dry and no flavor. The real flavor comes from the perfect poached eggs, and the mustard dill bene sauce. The mustard dill sauce is pretty good, but not \"traditional.\" So we got the bechamel sauce too - more \"traditional\" (think country gravy without sausage in it), BUT that one was cold.  3/5

Salty Dog (drink) - well, I like grapefruit, vodka, AND salt. So this is a winner for me. 5/5

Aperol Sour (drink) - kinda scared, but I've been meaning to try one of these egg white drinks, and I figured a bubble bar was the place. So this is gonna sound weird, but this thing tasted like that Orange Push-up popsicle thing from when I was a kid. Which normally sounds gross, but hey! this is BRUNCH! If you don't Screw Drive it, Mimosa it, then dang it! Aperol Sour it! The citrus actually went great with my huevos. 5/5

Ambiance - neat, clean lines. New retro feel. I know this use to be a supper club. I never went to it, so I can't compare. But I like clean, and this is clean. No one was there at 1pm, so no wait in line. We had a fancy U-shaped booth. The muzac was a little too loud 90s for me. 4/5

Waitress - was ok. Normally I don't comment on this, but she didn't know the menu at all. When asked a question, she took the menu from me... to read it back to me! What? Come on. At least B.S. me a little and ask a cook. Same thing happened with the drinks. I can't tell if this is her fault or the business'. Shouldn't all waiters try all the food, at least once? Or at least know what it looks like? Other basics weren't great either. We had to ask for coffee and water refills, even though we were the only ones in her section, and she walked up to our table a couple of times (for the answers to the questions)  1/5


Overall, we liked it and we will be back."}
{"text":"I write this after the fact.  Having calmed down from this experience.  I've never really been fond of Food Fight establishments.  They seem to have the same menu, same cooking styles.  When I heard that they were taking over The Avenue Bar, I was sad, but I gave it a shot.  I was even more sad when I saw the menu.  It's meh. Nothing grand, just regular run of the mill fare, which is why I had a hard time choosing something.  Everything seems to come with some sort of aioli.  Aioli this, aioli that.  There are different condiments and sauces that would work, even better.  But I feel like they were trying to be sophisticated with \"aioli.\"  Not so much.   They are really fond of the brioche bun.  A brioche bun for a burger is pretty overkill.   I didn't want a ruben, having tried a ruben at Monty's and it arrived swimming in grease.   That's all I could taste.  Salad?  Out of a Sysco box? nahh.  My wife tried the mac & cheese. Thank God I didn't order that.  It was bland, and I have done better using a blue Kraft box.  So I thought, I'll try the fish fry. That's hard to screw up. Sad that it only came with fries and there is an upcharge for the Yukon gold potatoes.  This was a fail.  First the batter tasted like flour, was greasy, tasteless mess.  Inside the batter goo was barely enough fish to call an appetizer.  For $14.95, with an upcharge for the Yukon potatoes, I expect something a little more substantial.  I'm not kidding when I tell you that the size of the fish portion was appetizer size.  Most of the size of the meal was the batter all puffed up.  Greasy. Ick.  And the potatoes.  They were supposed to be herb roasted. Roasted.  It seemed pretty clear they were par baked, then fried in the fryer because it was supposed to have herbs.  No herbs.  Just a mass of greasy bland potatoes, The service was good though.  That's about it.  I got a few drink cards as an apology, but I cannot bring myself to try this place again. 

The Avenue Bar used to have character, and okay food.  Good service,  It was supper clubish, and it had great kitsch.  I love the fish boil.  Given that this was always sort of a supper clubish type of atmosphere, Food Fight should have kept it a little like the old place. But it's clear they wanted to do away with the old.   So it goes.  I won't be back. I gave away the drink cards.  Can't do it.  If I could give a minus review, I would do that, but I gave one star because the front of house at least tried."}
{"text":"It's not that I don't necessarily like the new look, feel, & menu...but my family lost the place we used to go with our two young daughters every weekend for brunch.   We had been coming here every weekend since before my three year old was born.  Now it's basically no kids allowed"}
{"text":"My family and I visited over the weekend and we were very pleased with our experience. All of the staff was extremely friendly and their new drink and food menus were very exciting. The spicy Paloma was delicious and everyone really enjoyed their meals. We will definitely be back!"}
{"text":"I loved my time here on a laidback Friday night. Three friends and I found ourselves here and were happy to find a creative cocktail list with a really stellar late-night menu. I love the modern decor and the booths are really comfortable and inviting. Great place for date night."}
{"text":"Love the renovation.  Food is great and always a spot I take friends and family when they visit town."}
{"text":"Honestly, I didn't want to like this place. Why mess with the legendary Avenue Bar?  I'm glad to say that, at least this one time, I was wrong

We came for brunch on a Saturday around 10:30 and it was relatively empty. Really good, fast, friendly service. The coffee tasted like Starbucks to me, for good or for bad. My wife had the divorciados and loved every bite of it. But my croque madam (Monsieur with an egg added) was agreed to be the clear winner between our choices. 

Maybe we'll have to try dinner and drinks sometime soon."}
{"text":"I love this place so much and I cannot wait to go back!
We went in for brunch on New Year's Day, and I'm glad we made a reservation because they were busy!
We were promptly sat at a fun, curvy booth. Our server was quick, and pleasantly chatty despite being very busy. The coffee was great. Normally I wouldn't comment on it, but it was that good. 
My fiancé ordered the eggs benedict and they were delicious. Nothing over the top, just simple and well made. I ordered the all-you-can-eat pancake bar (New Year's resolutions don't actually start until 1/2, right?) and HOLY COW I NEED MORE. I ate 3 large pancakes myself, and I'm not sure I've ever done that before. They had multiple syrup-like toppings for it, but my favorites were the spicy butter rum pecans, and the berry red wine compote. I could have eaten that compote all day long. Absolutely amazing. 
This was their first time doing the pancake bar so they were very attentive. Our server asked what we thought, as well as a manager (I think she was a manager?). I told them I would keep coming back, even just for the pancakes. I loved it!
Aside from the food and service, I just loved the décor and ambiance. It has obviously been remodeled recently and I think it looks gorgeous. It has a very classy retro feel to it, but it not over the top. The music they played seemed time appropriate too. They played some great classics - Frankie Valley, Ella Fitzgerald, Fats Domino, etc. 
I'm disappointed here reading other reviews, and I don't understand why this place only has 3.5 stars. I would definitely recommend trying it out, and I can't wait to go there for dinner soon."}
{"text":"Why have I not checked out the new Avenue until now? Came in for breakfast on a Sunday morning and yes they take reservations and yes they have a large parking lot.Seating was not a problem in the newly renovated Avenue.They have a build your own bloody Mary bar, one of the better stocked I've stumbled into or (from)!! They did a nice job on the remodel with happy and friendly employees, good food and a relaxing atmosphere! Will be in soon to check out the happy hour and evening meals."}
{"text":"On a recent day trip to Madison, we happened upon this trendy, hip establishment for lunch. The decor is reminiscent of the bygone 1950-s 60's era and has a certain \"Vegas-Vibe\" to it. Decent sandwich and drink selection. Opted for the pastrami paired with a Dirty Bastard Scotch Ale. Sandwiches are excellent...good portions and fresh. Service is professional and attentive as well. Next trip, it's the salmon BLT. I highly recommend The Avenue Club, a hip, mid-century locale coupled with modern ambience to relax and grab some awesome sandwiches and beers. Check it out..no disappointments here!"}
{"text":"Avenue Club is great. I don't come here nearly as often as i should. First off, parking and location is a breeze. Downtown, without the chaos. They have two separate parking lots on both sides of the building. It's really obvious where the restaurant is from East Washington Ave. Secondly, the restaurant inside, is so cool! The retro vintage vibes are truly unique among Madison restaurants. 

Last night, i had a few Mai Tai's before dinner at the Bubble Up Bar. Super sweet, which i love and came with an umbrella for my glass :). (I'm a trinket person lol). If you are into Tiki drinks...highly suggest!!

We split a few appetizers. Not a bad one ordered. (We will be coming back for their app deals during the weekdays). Chicken wings, were flavorful and done perfectly and sweet. Relish tray was filing, with many unique veggies and also some small pieces of bread with an amazing cheese spread. The shrimp cocktail, is also worth mentioning because the shrimp were huge and cooked perfectly! 

Lastly, the goat cheese cheesecake, is to die for. I would say, this by far, was my favorite part of my meal tonight! It came garnished with a raspberry and some peach wedges. My boyfriend paired it with a red wine, and it was superb. 

Hoping to come back shortly!"}
{"text":"A quick, unplanned stop for lunch at the Avenue on a Monday afternoon led me to discover something absolutely addictive: The fried chicken sliders with spicy honey, a pickle slice, and chili aioli. They're so very good, they may be addictive. They were served with smiles from the hostess and prompt, friendly service from the server, which made them taste all the better.  You have to try some, and don't even think about sharing."}
{"text":"I ate at The Avenue Club last night. I think the restaurant is lovely. We were seated in a booth in the bar area. The acoustics allowed us to hear the background music and we were able to hear each other talking in soft voices. Almost all the tables were taken yet the setting was very relaxing.

We started with an Old Fashion which was just perfect. The \"supper club\" feel of the bar just called for an old standard. We both ordered off the \"Restaurant Week\" menu. All the of the foods offered for restaurant week were also on their regular menu. We could see what a great bargain we were getting and portions were quite generous. $25 for dinner was a real steal. 

For an appetizer, my dining partner had the Caesar Steak Tartare, which was presented with Caesar dressing, Parmesan cheese, egg yolk and crostini. It was quite delicious and lovely to look at. I had the Iceberg Wedge which was spared the common mistake of overly dressing the salad. It was crisp and all the little additions,radish,bacon,tomatoes, and red onion truly complemented the butter-milk blue cheese dressing. We were off to a great start.

My friend ordered the Pan-Seared Walleye, that was simply served with smashed red potatoes and green beans. She liked every aspect of the presentation and the fish was cooked to perfection.

I had the \"Beef Stroganoff\" which was really fresh tagliatelle pasta with braised short ribs, roasted shiitake mushrooms, peas, red wine sauce, and horseradish sour cream. It was the perfect dish for a winter's evening but I am not sorry that I chose this dish. The short ribs were tender and the meat was falling apart without being overcooked. The pasta soaked up the gravy and my leftovers held up well after sitting in the fridge overnight.

Now for the Piece de Resistance, dessert. We both had the Cold Fashioned Ice Cream Cocktail made with Korbel brandy, orange, cherry, and a dash of bitters blended
with vanilla ice cream and topped with whipped cream. What can I say... a perfect dessert before heading out the door into the summer heat. All in all, a very Wisconsin meal.

Thank you restaurant Week and The Avenue Club (I really want to say Bar). There is no doubt I will return."}
{"text":"Great time was had by all. Good food choice, not rushed and nice service.  One set of poached eggs were over done and they remaid them in 5 minute without any issues and with an apology."}
{"text":"The atmosphere is great! Went for brunch. I'm not a big breakfast person and was pleased that they included a large selection of sandwiches. Did not go for the Bloody Mary bar this time but definitely will go back for it. It looked amazing! Our server was super pleasant. And man, they know how to cook potatoes there. We had breakfast potatoes and fries for sides and they were both well seasoned and crispy! My table mate had the BELT sandwich and it looked delicious. Giving four stars because my Rueben was just a little too greasy. Definitely will be going back though!"}
{"text":"Really wanted to like this place.  Went here twice a week before the Food Fight group took over but then tailed off.  When they announced a new concept I was all for it.  I always wait a month before I go to a new restaurant.  But I did a walk through one day after they opened and thought that the decor was most excellent!!  But...these have to be the lamest bartenders ever.  I ordered a Manhattan and the guy swished the sweet vermouth around in the glass, dumped it out and filled the glass with Makers Mark.  He must only know how to make a Martini.  My wife ordered \"Ketel One with a splash of Cointreau, shaken and served up like a Martini\". Pretty easy, right?  It came with dry vermouth in it.  It seems like they are hiring people and training them to be bartenders rather than just hiring bartenders in a town where there are many bartenders. (Bring back Janet Schmelzer, Jody Wall and Tom Burke!!) I had the pork chop and it was OK.  My wife had the Short Rib Stroganoff and thought it tasted like nothing.  No discernible spice or anything of that nature.  The salads are enormous and delicious but I prefer a simple side salad being included as part of my meal rather than paying $7 for one.  I'll try it again after a few months.  As a side note, I emailed Food Fight with my concerns and heard from no one."}
{"text":"While I certainly loved the Avenue Bar of old, I also love the update. I do miss more of the super club feel, the update is really well done!  We have been here a few times since the change and we have really enjoyed the old reliable old fashioned. The fish (both cod and walleye) are delicious. The chicken is Wonderful and the meatloaf is superb!"}
{"text":"This is my first time back to Avenue Club after renovations, and I really like the feel of the new dining area and bubble up bar. 

The old neon sign belies the modern connected interior with neutral tones and thoughtfully arranged seating.  Whether you're at the long wavy bar, a cocktail table, or in one of the many cozy U-shaped booths, you'll get to enjoy an intimate but open atmosphere. The bar snacks were great to munch on, definitely don't underestimate the chips and onion dip, and I was impressed with their cocktail list. 

I saw creme de violette and green chartreuse, variations of the good old fashioned (I love that I can make mine less sweet), with a handful of ice cream drinks to boot. The amaretto sour \"gone south\" was surprisingly smoky and sophisticated, and the cava colada is a refreshing, ticklish take on the piña version. If you're looking for dinner & drinks, after dinner drinks, or dessert drinks, the bubble up bar has something for everyone. 

For a neutral, clean space to gather a wide range of friends, I'd put Avenue Club's Bubble Up Bar near the top of my list."}
{"text":"I came here with a bunch of friends on a Badger football night. It was very busy so I was glad I called up for a reservation. They didn't have a table available to reserve for a couple of hours but was able to reserve us the bar area. It wasn't a perfect setup but for six guys on a Saturday night, it was good enough. I was also surprised that the entire place had a remodel since the last time I was there. Instead of the Wisconsin \"North Woods\" look, I was surprised with a modern looking restaurant.

Everyone got Manhattan's and they were delicious. This is a signature drink here and I highly recommend it. We had their cheese curd, fried pickles, and the chicken sliders for starters. The cheese curds were solid...some of the biggest curds I've ever had. The sliders were also delicious. I could have just ordered another for my main meal and been very happy. I was disappointed with the fried pickles though. It was clear they made these from scratch but the \"pickles\" tasted much more like cucumbers.

There was a plethora of entrees ordered - BBQ Brisket Mac and Cheese, Fish Fry, Short Rib Stroganoff, and their special that night...Prime Rib. There wasn't a single person who didn't immensely enjoy their meal. I would highly recommend all of these entrees.

The only other disappointment was I had been really looking forward to their Grasshopper dessert drink. However, they ran out of vanilla ice cream...on a Saturday at 7pm? Manager should have run out to a grocery store to pick up more...come on!

Overall, the meal was great. This is a date-worthy place but make sure you make a reservation. If you do get the chance to try their Grasshopper, do it. It's to die for!"}
{"text":"We tried the Avenue Club for dinner Monday night. We had never been there before and were initially delighted by our experience.

We were greeted by a friendly hostess who welcomed us to the restaurant, gave us menus, and told us about 1/2 price appetizers and cocktails all day. We started getting excited as we looked thru the drink menu and saw the variety of Old Fashioned they offered. The appetizer menu also looked intriguing with a relish tray, onion dip, fried pickles and more. The atmosphere was modern, clean, airy, and seems like a great place to hang out for drinks.

Our waitress arrived. She was fun, perky, and helpful. We each ordered an Old Fashioned derivative. We also ordered the Whitefish Spread and Cheese Curds to start. Our drinks came out and they were delicious. Certainly Old Fashioned but with twists. Our waitress was great about checking on us and making sure we had everything we wanted.

When the Whitefish came out, it looked pretty cool. A mound of whitefish on a tray with Ritz crackers, radishes, and toasted bread. Unfortunately it was basically a cold, flavorless, grainy mash. We had tried whitefish spread recently at Everly and loved it. This sadly, was not at all similar. I did like the presentation and the price was great, but it was not particularly tasty. Very disappointing. The cheese-curds also had an interesting presentation. They looked like giant tater-tots. Unfortunately, again the flavor did not live up to the appearance. Wisconsin is known for their cheese-curds, but these just didn't have the flavor or texture. I did appreciate that they were different, but unfortunately in this case different was worse.

For dinner we had the Walleye and the Mussels with Fries. The walleye itself was delicious but it was served with a pumpkin puree which didn't pair well. The mussels were also delicious. The broth was rich and salty and I drank it down. It was served with a chunk of thick crusty bread. The fries were a let-down. They were not particularly crispy and kind of clumped together.

In general we loved the atmosphere, we loved the service, we loved the drinks and we loved the value. Unfortunately several of the dishes just weren't up to the rest of the experience. I wouldn't refuse to go back, but it won't be on the top of my list."}
{"text":"Ok so I need to update this:

I still stand by my comments made previously. I also recieved as soup of the day today clam chowder. So, that was either made Thursday or Friday and is still being served. Hopefully the HAACP guidelines are being followed. I'll let you know if not.

Today I ordered a Reuben and the smoked onion dip. The dip isn't quite as good as when matt made it, but its still damn good. And they give you SO MUCH. Its still addictive and delicious. My jaw hurts from eating the chips because you just can't stop. And I still have more.

The Reuben is pretty delicious. The corned beef is great, the bread not too hard/toasted, and the sauerkraut is perfect. I didn't get that much from the russian dressing or the swiss cheese, but that's ok. Its really the delicious corned beef that should be the star.

So, It WOULD be a 4 star, except that three day old soup is still the soup of the day. Otherwise, its delicious. Cheers."}
{"text":"I think that we must've hit it on a bad night or maybe I just ordered the wrong thing. To start the service here was great. They were slammed, but everyone was friendly and efficient.  Drink refills were always spot on.  I ordered the cheese curds for our appetizer and they are tempura battered, large, and square.  Call me old fashioned,  set in my ways or unadventurous but I prefer my cheese curds fried the way that they come...small roundish ballish mouthfuls of yummy goodness but these were not that. I loved the batter and the yummy aioli that came with them.

For an entree I had the fish sandwich.  The fish was excellent but the bun left lots to be desired.  It completely fell apart while I was trying to eat it. I finally gave up and just ate the fish. I think that what contributed to the problem was too much sauce on the sandwich and they put the fish on the sandwich while it was too hot. So all the accompaniments such as lettuce and tomatoes were a slimey disgusting mess. The fries were really good. 

The environment and decor is amazing...loved it. 

Will I go back? Definitely.  I'm not sure if I'd go for an actual meal or just drinks and appetizers at the bar but I definitely haven't given up on them yet...i will give it another go."}
{"text":"Been waiting 20 minutes for ice cream drinks to come from the kitchen. Waiter already apologized and said one will be free. Still mildly annoying. It's a Tuesday and this place is hardly busy. The grasshopper and Brandy Alexander were tasty and a reasonable size and price. Better than Smoky's Club, our other ice cream drink experience so far."}
{"text":"I went here for dinner last night and wow - not impressed.  We had reservations for 6:30.  When we got there, we were told that the people before us sitting at our table were just finishing up.  20 minutes later they are still there, so we are instead given a smaller than desirable place.  I realize this is out of their control but it didn't start the evening off well.  20 minutes after we got seated, we had to go find a waitress to take a drink order - not sure if they had forgotten about us or what.  

My biggest complaint is that we didn't get our food until 8:30 - a full 2 hours after our reservation time.  No bread on the tables or anything to snack on. My order was also wrong, but after waiting that long I wasn't about to say anything.  The waitress didn't come to check on how things were at all, and other little things came up (a soup was forgotten, and a salad didn't contain advertised ingredients).  

In the end we didn't get out of there until after 9:30pm.  A 3+ hour dinner (which is normally ok, but it's nice to not be waiting for food for the majority of it).  A complaint was made and the waitress brought drink coupons for the NEXT time we come.  I will admit that it is an attempt to correct things but I would have much rather had our drinks compensated for THIS meal as a goodwill gesture.  Or an appetizer brought out to hold us over since they had to have known the wait for the food.  To use these tickets, we will have to come back, which I really don't want to do. 

Oh - and for those who want a real supper club vibe, you'll be disappointed - it's all modern.  No wooden paneling, it's too bright in there.  I think by definition, a supper club is not modern.  The only thing reminiscent of a classic supper club were the candles.  I get that it is trying to appeal to Millenials but come on.  The Old Fashioned got the vibe right and it only opened in the last 10 years or so.  The original Avenue Bar was around for much longer than that and had the appropriate decor.  

Not impressed in the least.  This is not a place I need to go back to."}
{"text":"Great twists on supper club favorites! Saturday evening I had two friends visiting from out of town, and we stopped by the Avenue Club. From my fantastic wedge salad (fantastic flavors) and shareable fish and chips (homemade potato chips that were delicious) to the fried cheese curds and chicken with goat cheese sandwich, we all loved our meals. Their brandy old fashioned was solid, and my hubby enjoyed trying the New York Sour, one of their signature cocktails. The ambiance is a super fun and a little retro. The blondie sundae at the end of the meal was definitely worth it."}
{"text":"Got take-out, Short-rib stroganoff and Banh-mi.  

The new decor is an improvement in the restaurant area which was pretty gross, or at least old-school wisconsin, before.  The bar seems a bit more roomy but was not more enjoyable, seems kinda dark.

The food was very Food Fight: bland and inoffensive pile of stuff that did not taste very fresh.  I can't say it was bad, but it was not up to the quality of many of the restaurants on the east side and did not justify the price.

Wife says: the bread for the banh-mi was inappropriate.  I think that means it hit on her.

I'll give it another try or two and check out the bar because it's a block from my house, but not real optimistic."}
{"text":"My wife and I came here after the renovation. Their booths by the bar aren't very comfortable. There's barely any lower back support. The booths in the main dining room weren't too much different, but slightly better.

I ordered my onion burger medium, but not surprisingly it came back well done. Not many places here in Madison seem to be able to figure this out. It had average flavor, but nothing exciting. The fries were okay. My wife enjoyed her blue cheese burger. She preferred KFC's coleslaw though. 

Not bad. Not great. But it's nice that it's nearby for a late night craving."}
{"text":"Gin drink watery. 
Meatloaf: dry. 
Mashed potatoes: from a box?
Cheesecake: not flavorful.
Server: a food deliverer only
Ambience: good
We would have bee better off just getting a beer at the bar."}
{"text":"I had not been into the \"old\" Avenue in probably 15 years, so I was excited to go check out the new and improved Avenue Club. My husband and I came early on a Saturday for some pre-football brunch. It wasn't busy, and we were seated on the bar side. I meandered over to the dining side to get a look. Personally, I love the decor.  The waitress shared that they had a lot of asbestos clean-up and obviously they retained what they could of the original structure and decor.  I totally understand people's aversion to change, but in this case, I really think change is a good thing.

There were so many appealing dishes on the brunch menu, but I had to try the Peach Cobbler French Toast. It was delicious!  The toast was cooked perfectly, which is more than I can say for a number of other French toasts I have tried at various Madison restaurants. The topping was sweet, but not sickeningly so. My husband, who perhaps the most unadventurous breakfast eater ever, chose The Standard with eggs, sausage, toast, and potatoes. He enjoyed it all. I wasn't a huge fan of the spices used on the potatoes, but that's such a personal preference that I would never hold it against them!

My favorite part of the experience was right near the end of our meal when a much older couple, decked out in their Badger red, walked in with their cane and walker and sat right in the booth right behind us, which apparently had been reserved for them. I can only imagine (and hope) that perhaps the Avenue keeps tables reserved for the folks who have been coming there for years, which is so incredibly thoughtful and respectful.  I hope that some day my husband and I will be those old Badger fans frequenting our favorite spot and that they will take care of us as well as The Avenue Club appears to be taking care of it's long time regulars.

I can't wait to go back and try some more items on the menu and maybe even bump this up to a 5 star review. :)"}
{"text":"Simply put, I loved it. 

The rebranded Avenue Club and Bubble Up Bar has been given a much needed facelift but stayed true to their mid-century roots with both the decor and menu. 

The space is peaceful, sleek and modern, yet comfortable and not at all pretentious. We attended a pre-opening event the Friday before their planned Sunday public opening. They said there were a few furniture items yet to arrive, so they will continue to enhance the decor.

The cocktail list is diverse and impressive. The menu includes pictures of the drinks, which I thought was a nice touch and practical. I love bubbly cocktails and quickly gravitated to theirs. They also premix a tiki drink and one other and have them kegged. We shared samples of both and they were excellent. The tiki drink is a great throwback to the mid 20th century cocktail party vibe.

The food we sampled at different stations throughout the night was excellent. They make their own hummus, chicken pate and wonderful bread, including a pretzel bread. I was particularly fond of the hummus and the lightly pickled vegetables for the bahn mi. Throughout our visit, servers brought around samples of many menu items. The fish fry was so good and the slaw was perfect. My husband even loved the slaw, and he's usually critical of slaw. I also enjoyed the pork chop sample very much.

The staff working were all eager to explain the food and drinks and were genuinely excited about the opening and how great the menu is. I loved their enthusiasm. The Food Fight leadership team there were great and welcoming. The sense of pride they all have in the food and the space was infectious. That, more than anything else, makes me look forward to my return trip."}
{"text":"Disappointing meal. The fish had way too much batter and the clam chowder was just ok.  The old Avenue Bar restaurant had much better food."}
{"text":"I came here fro bunch because my friends wanted to go somewhere with TV's to watch the game. I had the corrned beef hash. The only negative thing I can say is that it was very salty. I know corrned beef is salt cured, but this was a bit much. Otherwise? the flavor was quite good and I had a good time."}
{"text":"This is my updated review.  My last review was that the place was OK.  Is it possible a place could actually go down hill???  Yep sure is!  First the Old Fashions are made with a mix, and not a very good one at that.  I sure couldn't taste the bitters.  Overall, it was just \"D\" grade.  My companion commented that I cooked WAY better meals.  I'm not sure what this place is trying to be, but it misses the mark BIG TIME!  They said it was \"comfort food\" which I get, but good lord, make it decently!!  Chef Ramsey, where are you, this place needs HELP!!!"}
{"text":"First time at the new Avenue. I was pleasantly surprised .  It's trendy with a fresh and clean look. Wait staff are in jeans and t shirts with black aprons. I like that. They look comfortable, makes me feel comfortable.  Our waitress was very nice. The service was great and so was the food. The coleslaw could have used a little more dressing but the pastrami sandwich on challah bread was very good. 
The prices were reasonable. 
I will definately will be back to try the other items on their menu."}
{"text":"I like knowing that there are old school Wisconsin supper clubs out there that are as old or older than I am. I appreciate the dated decor, the stuffed Muskie or Deer head on the wall and knowing there is an old timer near by with a story about how he or a friend of his caught that trophy. Knowing by just the atmosphere alone and the sheer number of people in a place that the Brandy Old Fashions are going to be unbelievable and that the food is going to be amazing. 

Now the Avenue 'used' to be exactly that supper club. I grew up loving the Avenue supper club. It just had a standard that couldn't be beat. Yes, it was dated and cheesy complete with old time regulars and dusty nick-knacks on the walls, but it was fantastic. 

With that said - a few years back The Avenue Club was sold and remodeled and its \"just that same place anymore\". Not even close. I think a wiser owner would have left everything the same - or at least the majority of things - but that's not the world we live in.

With much hesitation my wife and I decided to give the Avenue Club (and Bubble Up Bar? - really?) another shot - to see if it held any of the old magic that was there before. Came in between 6 and 7 on a Saturday night. Expected a wait, and was told it would be about 20 minutes. No biggie... except there were empty tables - a lot of them. I counted around 15. That's weird to me... I don't mind a wait. Usually prefer to have at least one drink at the bar while waiting. But usually all the tables are full. (strike one) We get two drinks at the bar and honestly I was afraid to order the Old Fashion knowing it wouldn't match up to years past. I look at the drink menu and the main thing I see are \"Tiki drinks\" such as Rum Runners and Mai Tai's? What? We get one beer and one mixed drink. A bit expensive - but what was weird was I got my change back in a leather bound book. I guess nice, but awkward and totally not necessary - I'm at the bar! (strike two).

Not shortly after the new owners took over, they did a major remodel. I will admit, they did a good job. The place looked great and was very modern. But again, that's not 'supper club'. . . feeling like this places has a big identity crisis - or maybe I'm wrong assuming they were trying to keep their supper club status. 

After over 30 minutes - we were seated at one of the many open table we saw when we got there. Service was nice - very good - no complaints at all. Top notch. I ordered the Fried Walleye and my wife got the 6 oz. Tenderloin with mushrooms. We both got mashed potatoes for a side. I have to say my fish was very good. Nice large piece, tasty breading and not too greasy. My tarter sauce had a crust on the top like it had been sitting out for a few hours. My wife steak though - meh, not so good. A Tenderloin is supposed to be 'tender' - this was the chewiest steak I've had in a long time. Very low quality, even though it was cooked right and the mushrooms were tasty. We both laughed at our mashed potatoes though. Two big scoops of potatoes each - well made, but not really tasty. My wife didn't even try her's till at home later. The size, quantity was just laughable. Not sure what they were thinking. 

Overall, the food was decent. Maybe not worth the price, but fair to good. The decor was great and the service was fantastic. Its a decent place, but if you are that diner that (like me) spent many holidays, birthdays and special occasions here over the years and always impressed your guests or were impressed yourself with the character, the amazing food and decent price - don't be fooled. That Avenue is a long gone memory that will be forever missed."}
{"text":"I'm a fan of the fish fry experience and have had some good ones at the Avenue. But tonight, it was disappointing even while the perch and cod were very good. Even had good fries and rye bread. However, the gin-infused tartar sauce was terrible. What made the experience disappointing was the long wait until our waiter showed up to check on us after food was delivered. I was hoping to ask for regular tartar sauce but had to wait 15 to 20 minutes for the waiter to show up (even after asking another waiter to get our waiter).    Final bad mark was coleslaw that was essentially raw cabbage and carrots.  There are many good fish fries in the Madison area, so it will be a while before we give this one another try."}
{"text":"I've been anxious to try out the updated Avenue Club, and am happy to report I didn't leave disappointed. We had reservations for a party of 6, and arrived a bit early so had the opportunity to check out the bar. I really loved the special cocktails they had - the Rouge 75 in particular. After being seated, we ordered some apps (cheese curds & stuffed mushrooms) - both delicious. 

I decided on a cheeseburger for my main, and it was very good. Cooked medium-well as ordered, and had a side of hand cut french fries that were perfect. The service we received was great, no complaints there. I'll definitely be back!"}
{"text":"\"I think I would give this place five stars,\" I said to my husband while we enjoyed our dinner entrees at the Avenue Club. That was before our dessert. Now those five stars are three.

Pros:
- Service: Our server Katja was phenomenal. She was prompt, friendly and knowledgeable. She shook our hands, and we introduced ourselves to each other. I would specifically request to sit in her section if I return. If she left the Avenue Club and started working as a server at another Madison-area restaurant, I'd visit her new restaurant just to sit in her section. 
- Smoked onion dip: That stuff is awesome! In my opinion, anything smoked is amazing, and anything onion-y is amazing. This appetizer combines those two, and it's addicting.

Cons:
-  Decor: I'm sure everyone else on Yelp will disagree with me, but I have to say that I hate anything and everything mid-century modern. 
- Dessert: The Avenue Club was out of the chocolate cake, which we originally ordered. Katja suggested the baked alaska instead. And it was incredibly disappointing: the over-torched meringue did not taste good, the ice cream had barely any flavor, and the cake had freezer burn! Despite the awful decor, the reason I knocked two stars off my would-be five-star review was the baked alaska.

Will I return? Likely, no. But it's an okay place. As long as you enjoy mid-century modern decor and avoid the baked alaska, you'll probably enjoy your experience at the Avenue Club."}
{"text":"I made a reservation two days ahead. We arrived right on time. Party of two for an intimate birthday dinner. When we checked in we were told it would be a few minutes but we could wait in the bar.   Ummmmm.... where? Seating was packed. This is exactly why I made a RESERVATION. 40 minutes of standing and two inquiries later we were finally seated. 

The food was okay. Fries with the fish were too salty to eat. The brisket stroganoff was very good. 

Our server was pleasant. We could tell she was being over worked but doing the best she could.

I'm mostly so very frustrated we had to wait so long!  We should have left and gone to another restaurant.  I won't go back."}
{"text":"I really liked the fish fry.  And the service was really friendly.  I ordered a beer, they said they didn't have it, then they found out they actually had it.  That was pretty much the only mistake they made... quite a forgivable one."}
{"text":"Like others, this is a tough review.   I think if this place was built from the ground up, it would easily get 4/5 stars.  Place looks great, nice retro old Vegas feel to me. Food was fantastic, drinks great(old Fashioneds) and service was very attentive.  All what we want.   She had the salad with steak, and would have it again.   I had the club.  I couldn't decide and for this Saturday evening, it fit the bill.   Stacked and flavorful.
However, it wan't the old Avenue, and that is a shame, as it gets that knock which may or may not be deserved.  that was our comment as we left.  Wasn't the same, was a fine place and great meal, but wasn't the same..."}
{"text":"This place is absolutely TOP NOTCH!! We came here for Madison Restaurant Week for the first time and were very impressed.  The staff was friendly and helpful.  Margaret, our waitress was a delight and her positive energy helped make our evening even better.  The food was spectacular from the beet salad, to the fish fry, the chicken pot pie, and meat loaf were delicious!! Drinks were fantastic and dessert was a perfect way to end a lovely experience.  Highly recommend the cheesecake and chocolate pie!! We will definitely come back and recommend this place to everyone inquiring for a great dining experience. :)"}
{"text":"Came here a 2nd time from Milwaukee and it was worth the trip. Everything is 5 star starting with the ambience and Dean Martin type of music, the Service staff is extremely attentive and the food, WOW. Delicious is an understatement. The fish fry is superb and the 1/2 chicken yummy."}
{"text":"Was pleasantly surprised by Food Fight makeover during recent fish fry visit..Service by Jeremy was very good.Fried cod was OK [had better ,had worse]..Downsides were, parking was very difficult,and glass of house wine was $10...[sheesh abit high in my opinion]. Overall a nice experience.."}
{"text":"This place is one of my favorites to go with a small (2-4) crowd. They have daily drink and food specials and the interior design is very mid century and gorgeous (don't forget to snap an instagram worthy shot of the bubble up bar light sign). I've never had to wait for a table or spot at the bar and service has always been friendly and quick. 

I would suggest getting the South Side on the East Side drink which is a gin and mint combo, refreshingly delicious! I've tried many items off of the menu but the standouts are the stuffed mushrooms and cheese curds (apps are half off for happy hour)."}
{"text":"Finally got back to the Avenue Club for dinner. It has become a new and classy place. The four busy bartenders are encouraging  the high end drinks by presenting you with a place setting with all the speciality drinks pictured right there for you to choose from.They are good drinks I might add. Of course they take longer to make so the wait is longer that it should be, even with the four bartenders. I like the idea though. The fish fry was pretty good. There were two big pieces of fish and a large baked potato and a piece of bread on a plate that was too small! They should have had the potato on a separate plate or just served it all on a lager one. It was tricky to eat without knocking stuff off on the table. Oh, and there was just one lonely butter patty for the bread and potato. I would have asked for more but the waitstaff was only around when I didn't need her and not when I did. Lots of rubber necking for our late glass of wine as well. They apparently only serve the waitstaff  drinks at the far end of the bar, so it was a long walk to the front of the place by the windows where we were. They are trying hard to be the best here but it still needs a little tweaking. I moved them up a star and liked the restaurant better than last time. I would go back."}
{"text":"From the outside, I would never have suspected the Avenue Club to be so cool. The Bubble Up Bar is sweeeeeeeet.  The bar tenders are incredibly friendly, attentive, and polite; they were all adorably hipster, and that just adds to the swanky yet casual atmosphere. The bar itself feels like it was designed specifically for  happy hour. The drink specials are impressively-made and apps are half off. I ordered the Original Avenue Old  Fashioned and it was decent, but in my opinion you've got to mottle the cherries or it's just not right. They have several types of old fashioneds on the menu and I definitely want to try another. My friends loved the apps: shrimp cocktail and calamari. This is a great spot for drinks and I would absolutely go back again and again. Can't wait to actually try the restaurant sometime too. Avenue Club is totally underrated; a hidden gem...but in plain sight."}
{"text":"The food was good. The drinks were great.  We had a larger party reservation that went without flaw.  People need to let go of the past and realize that the great people that took this place over are trying to make it a vibrant and exciting place.  Yes, the avenue bar had history - but you can't make a living on history alone.  Try the place out and see what you think!"}
{"text":"We went to the Avenue Bar on Saturday for a late brunch (1 o'clock ish)
Immediate seating on the non-bar side.  It was a little cool and got even cooler each time the front door opened.

The server was reasonably prompt to bring water and ask for our drink order.  We're Non-alcohol so had club sodas.  Seemed like a long wait before she returned for our food order.

We ordered corned beef hash with wheat toast and eggs benedict, firm.  The food came in a reasonable time.  And it was ok.  The server asked if it was too our liking.  As meals go, it was good.  Not memorable or ravingly great, just good.

With \"ok\" service and food, it' unlikely we'll return soon.  We'll continue looking for a memorable (in a good way) place.

PS.  I expect if one had few bloody marys or the like, the review would be more positive."}
{"text":"I never experienced this place before they remodeled it, so I can only speak for the renovation.

We came here for a late dinner one night and was seated in a booth by the bar. The seating wasn't really comfortable and there was a loud, obnoxious, intoxicated college girl in the next booth who made it a point to be heard. That entire combination would've spoiled our night, so we asked to be moved and they happily moved us to the main dining room where no one was seated. The booth in the main dining room was little more comfortable and spacious, so there wasn't any kicking going on underneath the table.

My husband ordered the smoked onion burger, medium. It was overcooked and 'really onion-y' so he thought it was okay. The fries it came with was pretty thick and seasoned okay. I ordered the black and blue burger, medium-rare. The meat turned out to be more medium, but the flavor of the burger and fixings were delicious. The aoili was plentiful and there was no shortage of blue cheese. I really enjoyed it.

Even though it's 'bar food,' it seems a little elevated and not limited to fried foods. I'd love to come back here again and try their brunch."}
{"text":"New York strip was mouth watering but the brussel sprouts with bacon are the bomb. The oysters are fabulous!  You won't go wrong."}
{"text":"I heard they had a great weekend brunch and they do. We couldn't have been happier with the selection, the food, the coffee or the service."}
{"text":"We've come here only a couple times since Food Fight bought the place, and we haven't been seated in the dining room.  The drinks in the bar were fine, but every time we've come, the background music has been turned up so LOUD that it's hard to converse.  That's not the atmosphere one is expecting in a classic supper club.  The bar is not walled off from the dining room, so the music is blaring in the whole place.  We were there last night, a Thursday, and it wasn't overly crowded, but the music volume was ruining the vibe."}
{"text":"I went for brunch twice in two days! I recommend the cheese curds-they are the best I've had in Madison! I got the fried pickles too, they were ok. The drinks are great, the service is awesome-great attitudes, friendly inviting smiles, quick attentive service! I had the huevos divorciados-very good! On my second visit I ate the pulled pork and sweet potato hash. I recommend both!"}
{"text":"It's hard to give a star rating for a situation like we had last night, but I decided to go with just two because service is such a big part of dining out.  The food is great (but don't get the brisket mac'n'cheese), but service on a Saturday night was rough.

This was the second time I'd been to Avenue Club.  The first time everything was great, so I had high hopes for last night's dinner. We had a 6:30 reservation and got there a few minutes early.  It's weird to be told you have to wait for your table when there are four open ones in front of you, but it was fine.  We were taken to the table right at 6:30.  Our waitress stopped by and then....we didn't see her for a long time.  She was in the restaurant, running around, but apparently not very efficient because she didn't think to ask us if we were ready to order drinks, appetizers, or food of any type.  She did the \"I'm not looking at you\" walk past our table many times.  

The real issue was with crackers, and it was just so strange.  We ordered two appetizers, the relish tray and the whitefish spread.  Both needed a medium for consumption, and the relish tray had a few (maybe 4) crostini, and the fish had about the same number of crostini and a couple of Ritz crackers.  Not nearly enough for the amount we had to spread. I asked our waitress as soon as she brought the appetizers if we could have more crackers.  About 10 minutes later, she came by with four.  Four Ritz crackers on a plate, for four people.  And said that that was all she could \"rustle up\" right then. We asked again next time she rushed past our table, and she then brought us eight more.  It still wasn't enough (the whitefish and the everything-coated cheese ball were delicious - we just wanted to enjoy them!) so we asked the kid who was trying to take the appetizer dishes away if we could get more crackers again.  He brought us two cellophane wrapped packs of two crackers.  Again, for four people.

What was so weird, is that after all of this, and after honestly poor service from our waitress (the other staff were much more responsive and helpful), we got charged $0.50 for the extra crackers.  Who does that?  It's so petty and just confirmed after the bad service that we wouldn't be back."}
{"text":"Are you serious? I'm sure some people will say this reminds them of the 60s. To me it just reminds me of an old hospital. The paintings on the walls just look like desperate pleas for color. The bright lights did not help the mood.

Two cocktails, fried pickles, carpaccio, and the Avenue fish sandwich all missed the mark.

Rasberry shrub is delicious, but it needs to pop. You know what shrub is, right? Vinegar + fruit. It's a preservation technique. The lemon peel that I paid for needs to be expressed on top because I'm drinking old things and want them to taste fresh.

The Jet Pilot Tiki drink took a lot of water to get diluted right. By then my ice was gone, and wtf, come on. I'd have been ok with half the booze to cover your costs. Also, um, you guys cost more than literally all of the cocktail bars in Madison.

The fried pickles were OK, but they're better at other Food Fight places. It was fine when the breading distracted from the pickles at DLUX, but come on. If I want a nice dinner I don't want food for children.

The carpaccio was covered in a salad. It's another red herring because their beef is flavorless. I guess I shouldn't have been surprised that distraction was the MO.

The fish sandwich is what fucking kills me, though. Overcooked (aka dry and chewy), undercrisped (aka not enough time to rest and/or sat in the window too long), undersalted, and bland vegetables on a mushy bun. It's the end of summer and my tomato tasted like it had never seen the sun. Maybe this is what sold me on the hospital feel, but compare this to something like Jin's (now JD's) fish sandwich, and it's just a bad joke. My memories of the old Avenue are pretty much Badger Football cuts of The Avenue's kitchen. It's supposed to be good old fashioned fish fry.

Our server provided us everything we ordered him to bring to us and checked up on us as if we were babies but never noticed our sauces were gone. He also had a Mexican bringing us water because he was too busy doing other things. I guess this is new Wisconsin dining.

Edit:
The owner of the Avenue Club's non-response is hilarious. Please, business owners, I encourage you to succeed. But if you straightface tell me that your product is not for me get the fuck out. I will tell you when I don't want a product. Of course I want good Wisconsin Tavern food. The only products I don't like are dumb and lazy products, and The Avenue Bubble Up Club is both. If it wasn't called The Avenue or had a rich history of Wisconsin dining I wouldn't even pay attention to it. Please continue to take the money of people without taste in things. Squander it. All of you can love your boring, bland food together."}
{"text":"Great cod fish fry. Two generous portions of cod. Light and crispy Sprecher beer batter. Cold and creamy coleslaw and loaded baker ($2.00 extra for potato toppings:  cheese, sour cream, bacon and chives). Served with a piece of rye bread (not our cup o tea and a little on the dry side). All around super quality meal. Waiter was attentive and very nice. The place has a great 60's retro-yet-contemporary atmosphere. Dean and Frank crooning and a candle on our table. We were seated at a table for 5 in the back of the Bubble Up Bar, which was much quieter than the dining room. Cannot wait to score a window seat on a snowy night!"}
{"text":"Under new management.  The menu, service, price and vibe are not good. Three bad experiences over past month."}
{"text":"I understand that a busy place means longer waits but it also means that people like it. I have eaten here dozens of times and drank here dozens more. I have never had any complaints. In fact I was preaching the virtues as we pulled into the parking lot. We sat at the bar and were promptly given menus by our bartender. We ordered bloody Mary's and they arrived quickly and they were outstanding. I would love to tell you how delicious our food was but that's where this review stops. Once we had our drinks we no longer existed. The couple to our left received their food and ate. They said it was amazing. Another couple sat down to our right as we were finishing our drinks and ordered their own drinks, then finished them, ordered food, then ate their food.... we sat there with our menus and waited to order for over 30 minutes after we got our drinks... we threw $20 on the bar and left. I am writing this review at the McDonalds up the street. It's our fallback when others fail to deliver. Thank you Mickey D for always delivering"}
{"text":"Very different atmosphere and very limited menu. Considerably less seating for diners than before, bar seating has expabded. Probably not looking to return"}
{"text":"R.I.P. Avenue Bar.

Food Fight, in a seeming effort to cater to younger professionals in the area, savagely murdered all the charm that was Avenue Bar as we knew it before. Sure, the food is fine and the drinks are well-made, but what does that matter? Before, the atmosphere inside that place reminded you that Madison was once a small Midwest town disguised as a city. You ate the delicious fish fry and drank an old fashioned like a gott-dayyum Madisonian. You sat there in the wood-panelled room like you belonged. Like you were part of something more important than yourself.

Now, you go in there and instantly feel like you've been hoodwinked. You've clicked on the top google result before you realized that the top link was just an ad. You aren't in Madison anymore; you're in one of any of the thousand hotel restaurants across the country. You sit in your high-back booth for \"privacy.\" That is, you get to remain in your own little bubble with your own little world view. You order fish because you're in Wisconsin, but the food they serve lacks any authenticity it once had. Sure, the fish might be local, but it doesn't matter. It might taste great, but it doesn't matter. You're actually being fed the idea that your own individuality doesn't matter, that our community doesn't matter.

Don't let Food Fight or anyone else convince you that this is the quintessential Madison restaurant. It was once. It is no longer.

\"We could all use the money, Brink. That's how it all starts, you know? First, you start doing something for love, then you start doing it for money and before you know it, you're just another sell-out.\" - Gabriella from Disney Channel Original Movie \"Brink!\" (1998)"}
{"text":"This restaurant used to be great. There was a recent remodel.... new owners?  Whatever the reason, our last two meals have been bad enough that we are probably done with Avenue. Drinks are still good. Cheese curds are still decent. So I guess it is a good place to get an evening started."}
{"text":"I've had the chance to try several dishes at the Avenue Club and Bubble Up Bar and everything has been excellent.  Between their pre-opening event, where we sampled several items, to multiple subsequent visits after opening, everything has been excellent and we've always had a great time.  

My favorite dish so far is probably the Short Rib Stroganoff.  I like comfort food year round, so I'd order this any time, but if you choose your entree based on the seasons, you'll be glad Fall is here and you've got license for this kind of dish.  Very flavorful and satisfying.  The pork chop is equally delicious and high on my list of meals to order again very soon.  I loved the fish fry and accompanying slaw.  Crispy Spotted Cow batter, tender cod, and a really nice vinegar-based slaw.  The pork chop is fantastic as well.  I am usually a traditionalist with a cheeseburger but the Bubble Up Burger with its brick cheese spread is an instant classic.  The menu is very diverse and should appeal to a wide range of tastes and appetites.  

On the liquid side, it leans more cocktail bar than beer joint.  The beer list isn't necessarily lengthy, but it's well thought out.  I think there's not only something for everyone, but some really nice, interesting choices too.  There are several signature cocktails to suit all tastes and interests.  Two rotating cocktails are always on tap - a variety of Manhattan, and the Tiki Bar drink.  We had the Jet Pilot, which was sweet yet boozy, and very tropical vacation-y.  I'll want a couple/three of these in the dead of winter to transport me to a warmer state of mind.  

Service was great with attentive, enthusiastic staff all around.  

I really dig the mid century modern design of the place.  I know some folks miss the old Avenue Bar, and I, too, love me a nice old school supper club, but I think they've created a really great place with the new design.  It's modern and retro, casual and classy, all at once.  

I think this is the kind of place you could bring any one, for any occasion, or for no occasion at all, and everyone will have a great meal and a good time."}
{"text":"We ate here several months ago and the food and service were fantastic.  We loved the atmosphere and seating,  We returned today for brunch and while the service was top shelf, the food was awful. The staff was very concerned that we did not eat much of our food and comped one meal for us.  However, all the food was terrible.  Our cheese curds were undercooked, cold, and greasy. Our breakfast meal was served with cold, hard eggs and toast.  It was inedible. Another member of our party ordered fries and a burger and ate little of either.  We ended up taking the burger home to our dog.  The fries did not seem to be \"homemade\" either.

The highlight of the food were the chips with onion dip.  Also, they serve truly wonderful coffee.  These were good.

As we had a great previous meal, we will return a third time and give the food another chance.  Maybe it was just an off day...though, it was not very busy."}
{"text":"Happy hour drinks are great. The curds are excellent with the Old Bay sauce. But come for the wings. Nothing else like them in town. 

I was nostalgic for the old Avenue, but the new renovation makes for a very classy date night or a nice night on the town when family comes to visit. 

Looking forward to coming back for a meal."}
{"text":"Excellent food and creative, delicious drinks. Fun, cozy, cool place, especially for Friday night dinner. My favorite dish is the veggie and polenta."}
{"text":"Positives- Arrived at the restaurant 10 minutes prior to our reservation and got seated right away. Had a good Old Fashioned. Nice ambiance. Had a very nice and attentive server. I enjoyed my mash potatoes and the rye bread. 
Cons- My baked Walleye was kind of fishy and my sisters baked cod  was not very warm. Would not go back for the fish fry. There are other options that are better and less expensive ($18 for not so good walleye) 
I would go back to sit at the bar for a drink - I liked the look of this place."}
{"text":"I had a great dining experience today at Avenue Club.

I hadn't eaten fish fry in a while, so I decided to give Avenue Club a try because the pictures of the fish fry looked good. When I walked in, I wasn't sure what I was seeing. I felt like I was in an old living room with a modern twist; it gave me serious Archer vibes. You really have to see it. It feels like you've gone through a time machine. I'm not really familiar with the whole supper club concept, but I haven't seen any like this before.

The first thing I noticed was the big bar, so I ordered a cocktail. I chose the smoky margherita, and it didn't disappoint. My server made it not too sweet, and it was perfect! It was a little sour, just sweet enough, and smoky like an islay scotch.

I tried the loaded fries for an appetizer. I wasn't a big fan of the fries. They weren't very crispy, and the beer cheese wasn't well distributed. I regret not ordering the cheese curds instead.

For fish fry, I ordered the walleye with a cup of clam chowder. The clam chowder was interesting. It wasn't too thick in texture, and it had a strong but smooth garlic flavor. I think it would have made a great pasta sauce. I didn't hate it or love it. The walleye was huge, and it made a strong case for its $19 price tag. The batter was nice and crispy, but it felt kind of mushy and greasy on the bottom where the hot fish was causing condensation at the bottom of the plate. Still, it really hit the spot since I was craving fish fry. The other sides (I got house chips, cole slaw, and rye bread) were nothing to write home about, but they rounded out the fish fry meal.

Overall, the food was decent, the cocktail was awesome, the service was killer, and the atmosphere was cool. I would love to come back some time to try more cocktails and other menu items."}
{"text":"My husband and I had not been to this place since it changed ownership, but we went last Sunday and were not disappointed, which is an understatement. Another reviewer mentioned the Huevos Divorciados, which is what I had, and they were AMAZING. My husband asked them to switch bacon for ham in his omelet, and they happily complied. He said it was the best omelet he's ever had. We will definitely be back! My only quandary is whether to try something else on the menu - it all sounds so good - or to get the Huevos Divorciados again."}
{"text":"I just don't give out 5 stars.  This was my first time here since they reopened. Notice I didn't say remodeled? The cosmetic changes are significant but minor overall. The menu revamp is incredible. Very upscale yet so reasonably priced. I had oysters on the half shell for an app. I started with a half dozen due to skepticism. How could this place 1500 miles from the nearest ocean have fresh oysters? Bam! They were sweet and salty goodness. I ordered a dozen more. For the main course I had the duck. It sat on a bed of puréed squash with Brussel sprouts in a reduction sauce of berries and red wine. I've had duck from Vienna to Viroqua and it was the best I have ever had at $22. And the cocktail menu is to match. Grab your best gal and head down to the new Avenue. Reserve a nice high back booth and enjoy a great meal. Enjoy!"}
{"text":"Full disclosure:  we eat here every couple of months.

We ate here last Friday night for the fish fry.  We consider this one of the 3 best places in Madison for fish on Friday and the reason is because it is so darn consistent.  The serving portions are huge and the tartar sauce, coleslaw, etc. is alwayz the same.  GREAT!  So we both ordered the cod.  My cutee patootee had an old fashioned (you forgot to muddle it) and I had a sidecar.  Both delicious.  A funny story about the sidecar....I asked the bartender if he knew how to make one and he said yes I do so I kept my eye on him and noticed he was misting my drink with the oils from the zest of the lemon.  Uhhhh ya.  They know what they're doing.  LOL and as a side note, Marcia commented that I'm the only person she's ever see pick up the fish to eat it....ya....that's how we Colorado men roll....and we lick our fingers too.  ;D  Good eating everyone!"}
{"text":"I've only been there one time. New Years Eve 2017. I loved the ambiance. I'm not sure if it's 40s flare or what, but it was new and classic. I had steak. Perfect. The rest was good. But I had a Brandy Old Fashioned and loved it. 

There's a very good chance I'm going again tonight."}
{"text":"Why did they try to fix something that wasn't broken? What a huge loss. The old Avenue was perfect. The redesign is so predictable and bland. It feels like the hotel restaurant of a Marriott. The laid back perfectly Wisconsin environment is gone. Places like the new Avenue Club area a dime a dozen. Classics like the old Avenue are priceless. And now it's gone. And for what? The food is not as good, the service is slower, and I think the prices are higher, too."}
{"text":"Second time great drinks and even better service and good beef stroganoff and soups are good. Not too expensive drinks are reasonable food is more. Burgers are reasonable. Great ambiance. Recommended highly served dinner late till 930-10 and have a great looking late night menu."}
{"text":"Authenticity.  This is one element I always look for when I review an establishment.  Whether it is a 5 star restaurant or a divey hole in the wall, I look for whether or not they stay true to what they are.  When I look at Avenue, it lacks this critical element.
Now don't get me wrong, I wasn't a fan of the \"old\" Avenue either.  It looked worn and weathered.
The new rendition tries to emulate a mid century modern feel but it falls short. The fixtures, tables, chairs and other furnishings just don't do it for me.  They lack originality and more importantly, history.  The charm of supper clubs and other restaurants of the like is that they have that history, they have that authenticity.  They may be awkward or clumsy looking.  But the fact that-at one time-to some people, it was the \"in\" thing makes it appealing.
Picking some products out of an Ikea like restaurant catalog doesn't do it for me.
Aesthetics aside, I felt the food choices were acceptable.  The waitress recommended the calamari and her recommendation was on point.  The rings and tentacles were perfectly battered and fried.  For my entree, I opted for the cheeseburger.  The bun was maybe a little too much for the ingredients between it but it was solid.  As like many other Food Fight restaurants, the food never blows you away yet never disappoints.  
For some, I am sure the new Avenue Bar is just up their alley.  Unfortunately for me, it's not even on my same block."}
{"text":"Strike two.

5:15 on a Friday (learned later that East High had a home game nearby) and the place was mobbed. Wonder how many will return?

Saw the fish fry, realized I did not want that much food. Opted for the sandwich and slaw.

Menu suggested \"sushi grade\" cod but doubt you'd find that on the box it was delivered in. The sandwich was just okay, batter and bun kind of disappointing. The slaw was indecently exposed, very under-dressed.

Oh, $10 for a small pour of house chardonnay? Seriously?!

Based on a thin (and pricey) menu, I doubt I will be going back."}
{"text":"Cleaner, more open vibe since the remodel.  I missed the large, cozy booths but quickly forgot about this once food arrived.  Veggie fricassee was flavorable and special.  Dining companion claims his steak was savory, cooked to Medium as ordered.  Best fried cheese curds of my life, paired well with the aioli sauce.  Waitstaff was attentive despite a dining room busy with St Patrick's Day revelers.  Will definitely come again."}
{"text":"Great decor (sort of mid-century Mad Men-esque) and the food is well done and interesting too!

Before the remodel, I would have classified it as retiree friendly (if you were ever here for lunch, the average age was probably 90), with uncreative food and eclectic decorating.

After the remodel, I would say this place is pretty classy with a menu to match.

What I tried:
Chicken Fried Dill Pickles (served with green goddess dressing)- exactly what you would think. Hard to hate fried things dipped in mayonnaise based sauce.

Corn Nuts- great if you need a crunchy fix

Blue Cheese, Apple and Fig Salad- totally packed with toppings and a really good vinaigrette. Didn't seem like there was a huge size difference between the small and the large option. I would go with the small even if that is your main meal because it is quite filling and I would hate for you to get gypped. 

One downside, not very many vegetarian friendly options, but if you have an unrestricted diet, there are loads of stuff on the menu to keep you interested and merit a return trip or two."}
{"text":"Ever since I heard about the renovation of Avenue Bar, I was excited to give its new iteration a try. Retro vibes are my favorite vibes, and I wasn't an Avenue Bar devotee - I don't like fish, the food was not memorable (literally; I have no idea what I had), and in all my years of living in Madison I went once. While I'd heard some complaints from friends about the Avenue Club, most of them were more centered in that it wasn't the old Avenue and not actual disappoints in food, drink, or service. 

I decided to make a reservation for my birthday a little over a week in advance. Their online booking system kept coming back that the only times available for a party of 8 were incredibly early or incredibly late. I tried to make alternate plans and kept checking back with the system just in case, but two days before my birthday I still wasn't able to find anything that excited me so I did the unthinkable and picked up the phone. The woman who helped me was able to get me a table with no issue; I let her know that their online booking system was showing them full up. She asked me if I was celebrating anything and I let her know it was my birthday. We confirmed the time and my group showed up two days later. 

There was a short wait for the table but then we were seated and our drink orders quickly taken. I went with the Amaretto Sour Gone Southern and the server was very enthusiastic about my choice. After sipping, I was too. It was definitely one of the better drinks I've had in a long while - super smooth, not too sweet, and a Luxardo cherry on top. I also ordered the Chicken-Fried Pickles to share and loved them as well. They were very thin cut but stayed crisp and had a super sour zing that was perfect with the light breading and dressing. The only issue was that they would not cool even after ten minutes of being at the table - we found cutting them with a fork helped a bit. 

The Rachel was my entree of choice (hey, I love a turkey sandwich, don't hate). Delicious. Normally I skip over slaw but since it was billed as a vinegar slaw I decided to get crazy and try it. It was still pretty creamy but definitely had a better flavor than mayo. All around, great flavor from that simple sandwich. The fries were fine - not bad but just not something I really want again, which is weird because fries are among the most delicious things on this planet. 

One mild disappointment of the evening was no acknowledgement of my birthday - I normally wouldn't expect it but I don't understand why they bother to ask if you're celebrating something when you make a reservation. I love celebrating and I was looking forward to some surprise since they asked, be it a message on our menu or a dessert or, honestly, a simple \"happy birthday\" or \"thanks for celebrating with us\" from the host or server. I had a great meal in great company in the end, though, so c'est la vie."}
{"text":"This was my first time at Avenue Club/Bubble Up Bar. I hear they've recently undergone renovations and it shows.  Both sides are tastefully decorated.  They definitely nailed the classy supper club vibe.

The drinks were amazing.  If you like sweet (and I do) the Banana Painkiller is for you.   The Mai Tai has an interesting twist with the addition of ginger but hands down my favorite is the gin fizz.  It's got some secret ingredients but I won't tell you what they are, you'll have to come taste it for yourself!

I was pleasantly surprised by the amount of parking, especially for a place so close to the square.  They have an ample lot surrounding the building.  I had no trouble finding a spot although I did get there relatively early and on a Tuesday.

The relish tray with the \"everything\" cheddar cheese ball was good but the smoked onion dip was the clear winner.  I only had apps but next time I'll check out their full menu.

Like the restaurant itself the restrooms are recently renovated so everything is spotless and in excellent working order.

A nice place for dinner and drinks, I'll definitely back!"}
{"text":"Came for the fish fry and loved it! Wait time was much shorter than I was told. Service was great. The ambiance is also very nice. I will definitely come back again."}
{"text":"The reviews of the Avenue Club and the Bubble Up Bar are exactly what you'd expect. 

Multiple 4 and 5 star reviews praising good food, a warm atmosphere and interesting drinks. Muddled by a series of grumpy 1 star-ers upset at the demise of the former Avenue Bar.

A couple of thoughts:
1) Read Avenue owner Joey C's comment to Eric M's one star review. She says: \"Thanks for your post.  I agree with you that the old Avenue had incredible charm and the most Wisconsin feel you could find in Madison, but it was not a busy restaurant.  Friday nights were our busiest night of the week, but a business can't sustain itself on one night a week.  We kept the tradition going with minimal change to the menu and interior, but it just wasn't sustainable.  I'm sorry that you feel we've taken a classic away.  Our hope is that with the changes we've made, the Avenue will continue on for 50 more years.  \"
      It seems as though the previous Avenue, with all of its charm, was untenable.

2) The new management did go a bit... overboard. The entire restaurant screams \"out with the old and in with the new!\" between the mid 2000s indie jam playlist, the Ritzy \"bubble up\" bar design, and the contemporary decor. We were surrounded by tons of mid-20s/early-30s couples and groups, though, so it must be working.

3) As for the actual substance, we were very pleased. The cornmeal-breaded calamari was unique and delicious. My pastrami challah was well balanced, not too heavy, not too salty. My girlfriend wanted something \"hearty\" so she ordered the beef rib stroganoff, and said \"wow, I feel like if I closed my eyes, I could be right back in the old Avenue.\" And she used to go there every Sunday AM with her grandparents, if that says anything for their cues towards tradition.

4) Drinks were good. Variations on classics. Not too much mind-blowing novelty, but definitely a menu created by someone who inherently understands the component creation of drinks. We were happy.

So overall? As long as Avenue continues to weather the inevitability of criticism that comes with change, I'm sure it will do well. The simple busyness of the restaurant seems to assure that. And, for all their insistence on the new, it seems their heart is in the right place."}
{"text":"I am biased as I liked the old Avenu just fine, but I was hopeful for a cool new place.  
Instead the new Avenu looks like they took one color card from Menards and told the designer you may only work with these shades of blue grey ish. 

\"Ok, you strongly object? Fine one yellow thing... but in return the art shall be oddly small and off centre\" is what I imagine the owner to have said. 
\"The bubble bar lettering will look like it came from Hobby Lobby\" they continue."}
{"text":"I certainly liked this place before the makeover, but I have to say that I really like this place now! I met a group of new friends here the other night. We started with drinks; I sooo recommend the Rouge 75. They were all delicious! Yep, yea Bubble Bar! After moving over to the restaurant area, I ordered a Mushroom and Swiss Patty Melt. It was very yummy, but the rye bread it comes on was full size while the burger was, by comparison, so much smaller. Despite it being tasty, the bread:burger ratio disparity is problematic for me. However the amazing fries that came with it made up for any issues. Great service, even with our larger group complete with separate checks. It no longer has the supper club feel, but instead has a classy yet casual atmosphere."}
{"text":"I have been to this restaurant a few times. Food was great. Last night I went for my birthday dinner with my sibs. Unfortunately I was disappointed in the meal. My meal and my sister's meal was served warm not hot. So the food quickly got cold. I ordered the fish fry w/baked potato and Cole slaw. The fish was good, good batter and nicely done fish. The Cole slaw was terrible. Limpy cabbage with no flavor. We also had a chip and Smokey onion  dip appetizer. The chips were great but the dip was so bland, no flavor. My sister was very disappointed in her meatloaf and potatoes. Served warm and very little gravy.  If I go again, I hope the food and service are better."}
{"text":"Never been so unhappy with a restaurant experience...

Made a reservation- still had to wait an extra hour before we were seated. Irritating but I get not always in their control.

We finally get seated (we took our drinks from the bar) and our waiter took over 30 minutes to come greet us at our table. At this point we are both very hungry and getting angry- but we order our food and try to keep a positive attitude.

Our food comes and we take our first bites- and the Fish Fry was COLD. We wanted to ask to send it back for some food that is warm but our server is nowhere to be found. He hasn't asked us if we would like more drinks/water/etc. 

We finally get to the point of filling our own water glass with nearby pitchers and just sucking it up eating our cold food-- not a great idea... ended up getting very sick. 

We will NEVER return back to this restaurant even if it's for free."}
{"text":"Amazing. Ethan, our server was adorable and very accommodating. 2 of us in our party of four ordered the vegetarian eggs Benedict but subbed out the tomatoes for avocado. Sometimes modifiers like that can get lost in translation, but both dishes were served perfectly.

I had never been here before, but heard there was a significant remodel. It looks great. You can bet that we will be trying the cocktails next time! Great Madison establishment!"}
{"text":"Edit: entrees are not \"mostly above\" $25. I still think they are overpriced but I must have exaggerated it to myself when I first wrote this. Whoops! 

I liked Avenue Bar and I like Avenue Club. To me they are entirely different and my fondness for the old restaurant doesn't detract from my enjoyment of the new one. That would be comparing apples to oranges.

Ambiance is modern and festive. Would be a good spot for a celebration.

Food is very good. The mussels were good and in a delicious broth. I only wish we had more bread or there was more in the broth besides mussels because I ended up trying to drink the remnants up like soup. I also enjoyed the confit chicken wings and the apple, date and bleu cheese salad.

The drink menu has a lot of intriguing choices and the shrub cocktail was great. I thought the Rouge 74 (75?) was fine, but I expected a little more. Definitely want to return to try more cocktails.

Service was fine. A little slow at a few points but not so bad for 8pm on a Saturday night/a new restaurant working out the kinks.

My biggest complaint would be the price of the entrees. I am excited to return to try more of the shareable plates, sandwiches and salads, but I likely will never order an entree. Many are $25+. Why do all of these relatively casual restaurants in Madison, WI suddenly think they're fancy restaurants in New York City?!"}
{"text":"Bar great for a drink BUT will never do dinner there again   Business associates to casual dinner.  Squeezed us in cramped booth (could they be any smaller?!).  Waiter a dolt.  Clueless - inattentive - other than to rush us into ordering on a very slow Monday night. Brought my drink overflowing with no napkin, led to nice puddle in front of me.  Pan fried white fish was chewy tasteless.   Expect more out of a food fight restaurant.  Bad impression all around."}
{"text":"I have to recant my previous review. Tried Friday fish today and was very pleased with my baked cod. The pan fried walleye was excellent as well, I understand. A very pleasant experience. We will return."}
{"text":"I was pleasantly surprised with avenue club.  The atmosphere is a little old school, almost trying to be vintage, but appears more dated than deliberate, which made me very hesitant and reluctant at first, however,  I was pleasantly mistaken.  For starters,  our server Tonya was AMAZING. She was very friendly and attentive despite being the only server on staff with 8 tables on a Saturday night.  She recommended the fried green beans for an appetizer and they were so delicious! Great recommendation! Our main courses (prime rib for the hubby and fish fry for me) were also super delicious. The fish fry was the best I've had in Madison, truly delicious! I'm so happy we stopped there, we'll definitely be back."}
{"text":"I'm a fan. Four stars because of little things that could be better. 

Fish Fry, Friday night: we were able to make a reservation, which was done with great friendliness and even an inquiry if we were celebrating anything special (we weren't, but asking that was a nice touch). We arrived a couple minutes before our reservation time, but it was still 15-20 minutes before we were seated. No big deal, we were able to have a drink at the bar first. A friend had recommended I try their whiskey sour, which I did in honor of it being St. Patrick's Day. It was quite good, although I'm not normally a whiskey drinker. Very smooth. I had asked for us to be seated near the window, which we were, but unfortunately we were in a corner booth with our only option being to face away from it. Womp womp. Plus, there was an overly bright spotlight glaring down on our table directly overhead. Seemed like that could be turned down a couple of notches by 7:30 pm. As the faux leather seating and the tablecloth were very white, that only exacerbated it. 

Our waiter, Shaun, was very attentive, personable and helpful with the menu. After his description of the cod vs. the walleye, I decided on the walleye, and was not disappointed. The batter wasn't super crisp, but crisp enough, and the fish inside was so very tender and flavorful. The pub chips were quite good, but the dill tartar sauce was bland, as was the coleslaw, which had no detectable flavors other than cabbage and a faint sweetness. 

Dessert was a shared slice of goat cheese cheesecake, which comes with the option of chocolate sauce or bourbon peaches as a topping, so we asked if we could have a bit of each.
The peaches were phenomenal on top of the lightly tangy and not oversweet cheesecake, the combination is outstanding. Skip the chocolate sauce, it tastes exactly like liquid tootsie rolls. Hard pass.

Random thoughts: I mostly love the interior, but it also reminds me of a very stylish doctors' office. It's the curtains, I think. Also, if you go on St. Patrick's day, be prepared for men in kilts."}
{"text":"Went in for brunch. Group of 4. Had to wait 20 mins but waited 30. They forgot we were at the bar. 

Waitresses was okay. Didn't make eye contact much. Didn't see to want to be there anymore.

One guy tried to bring out the wrong food. My girlfriends potatoes were burnt and mine were fine but it was pretty ballsy to serve both plates at once. 

Egg portions are a shame.

3 out of 4 of my party complained. Refills on coffee were non existent. 

Not again."}
{"text":"I'm sure everyone says the same thing when they walk into the new Ave; \"it's SOO Different!\" And not in a good way. It's lost all of its mom & pop, supper club, kitchy, homey appeal. Now the look is just like any new trendy place, nothing special. The older crowd in their token badger gear are still there, but not sure if they're satisfied. 
To the food:
Mother board: delicious except it came with a panko crumb pork loaf? It looked like a filet of fish, didn't go with the board at all.
Iceberg wedge: mediocre, had cherry tomatoes instead of diced and small pieces of bacon. This place won't last without an excellent wedge
Rib croquettes: definitely a miss, not very flavorful
Duck: this was pretty good. I would give a 7/10, it was seasonal and flavorful.
Will I go back? Probably not, the Avenue Bar with the delicious soup and crab legs that I grew up with is gone :("}
{"text":"I was skeptical when I learned that the Avenue Bar was getting an update, but after visiting last week I was very impressed!

Food Fight has done an amazing job turning the old Avenue Bar into the Avenue Club and Bubble Up Bar. Both the dining area and bar area have been updated, with a much more open seating area that makes the whole space look completely different. The space looks much more modern, but it has a touch of retro style reminiscent of its history. 

The menu has changed substantially. Old favorites such as the fish fry and the old fashioned are still on the menu, but many of the items are more modern takes on traditional fare. I was surprised to see dishes such as salmon and duck breast on the menu. I ordered the duck breast (served with butternut squash and farro and a raspberry balsamic reduction) and was pleasantly surprised by how delicious it was. The portion was also pretty generous and the food was reasonably priced. My friends had the walleye and the salmon, and both seemed happy with their meals. We split the chicken wings for an appetizer, which were easily split between 3 people and pretty tasty. The creme brulee we had for dessert was okay. It was a bit heavier than I would have liked, and the brulee wasn't as dark and crunchy as it should have been. 

Our drinks were excellent. I particularly liked the Ave Club Shrub. I also tried the Cava Colada, which was beautiful and tasty but a bit too sweet for my liking. The drink menu had a long and varied list of cocktails as well as a decent wine and beer list. 

I'll gladly come back for another meal at the Avenue Club and Bubble Up Bar. I recommend checking it out at least for drinks and appetizers. It's the perfect spot for a night out with friends or a nice dinner date! And they take reservations too!"}
{"text":"Not all restaurant reboots are successful but Avenue Bar seems to be one of the fortunate few. 

As someone who loved the old school wood paneling, original furniture and supper club fare, it was a bit of a shock to step foot into the bright, mid century modern designed space with cool earth tones and new cream colored leather booths. 

The menu has undergone a considerable makeover (e.g. oysters and carpaccio) and we happened to dine during their Sunday Chicken and Champagne (mind blown), which is case in point that this is not your dad's Avenue Bar. 

Also the staff has been overhauled with the median age 25--they're all friendly and attentive, seemingly at home here or in an Eddie Bauer catalog. 

Cheese curds were ordered -- they're definitely bigger and seasoned differently than the old recipe but it's a flavorful upgrade that was approved by the table. Brandy old fashions were still well made with a strong pour and classic garnishes. 

The chefs kindly accommodated our request and made deep fried walleye (typically reserved only for Friday), which came with fries (average) and cole slaw (above average with a nice vinegar and sweet balance). The 4-piece fried chicken was light and crispy, the oil was definitely fresh. The side of green beans were also a bright spot, well
blanched and lightly oiled and salted, which complemented everyone's entree. 

Well done Food Fight, well done."}
{"text":"Amazing menu...but the food is ok.  Not the best burger in town, or mac and cheese, or anything else I tried.  But, the cheesecurds are as good as they say they are.  And the drinks are fun and tropical.  A great place for a group, the waitstaff is always on it, and the dinning room is classy."}
{"text":"First time at the Avenue Club (I'd never been to the Avenue pre-takeover/makeover) and it was about what I expected.  I really liked the modern/retro decor, and we were seated in a delightful little nook by the fireplace.  Bonus: we had the whole corner and a fire to ourselves; Con: the table was challengingly small.  

Brunch prices were reasonable and food portions were large.  I took half of my meal home as leftovers.  The brunch menu is full of little twists on traditional breakfast fare: a nice departure from the norm, but I would have really appreciated a standard eggs benedict.  Food, as with all food fight restaurants, was good but not outstanding.  Similarly, service was fine, but a little slow and occasionally seemed to miss the mark.

While there was nothing wrong with our meal or experience - everything was good enough - there's so many amazing brunch options in Madison that Avenue just failed to really impress."}
{"text":"I'll be brief. 
Found a hair in my iced tea. 
Server didn't seem to want to give us the time of day. 
Had to ask for water after glasses sat empty for half the time we were eating.
I'll never go back."}
{"text":"Mid-Century Modern style restaurant that could be easily plopped down in the middle of Palm Springs, Ca.  Food and service were both excellent. The Short Rib Stroganoff was outstanding.  Wait staff personable and professional.  (One adjustment would be to get rid of the small bar in the dinning room and replace with more seating.  There were four people at the dining room that were pretty tipsy and quite loud.) Otherwise this restaurant is a total winner!"}
{"text":"I come here because its location is very convenient for me. I'm surprised I haven't reviewed it before! 

In the past, I was thankful for avenue because it took a rather large reservation on a Saturday for my birthday. They were able to seat like 10-12 people. The service was good, and our party liked what they got. 

My issue with many of the dishes I've had from here is that they tend to be on the saltier side--the curds, dips, chicken (when I ate it) and fish. It's been a consistent issue during each of my visits, but normally another component of the dish makes up for it. 

On my most recent visit, we just went for drinks and a snack after work on a Friday. The place was packed, but the bar is first come first serve. Luckily there were two seats available. I ordered the mulled mule. This tastes like those little cinnamon candies you used to get back then. It's pretty good, but I got tired of the taste after awhile. We also ordered the curds. Besides being salty, the cheese did the thing where every bite you take, it stretches and stretches. Yum! The bartender was hard to get a hold of to get water and order more drinks, but it was a Friday after work so he was pretty busy.

I noticed they had a veggie pot pie which was interesting to me because you can never find that in restaurants. Will go back to try that next time!"}
{"text":"This was the first time I had been to the Avenue Club and the Bubble Up Bar since the remodel.  It looks so nice and stylish.  The brunch menu has a lot to choose from.  I didn't quite know what I wanted to eat so I had The Standard.  The Standard is eggs (your choice of cooking preparation), bacon or sausage, roasted potatoes, and toast.  Everything was very good.  The bacon had a very nice flavor and my poached eggs were perfect for me.  Someone at the table also had poached eggs.  Her eggs were really hard boiled, so I wonder if different people cooked them or if the chef is inconsistent.

The drink menu looks very fun.  One brunch member got the Bloody Mary that looked impressive (size wise).  It was interesting that it was served with a spear of cucumber instead of a dill pickle.  I ended up getting a Amaretto Stone Sour on the rocks.  It was the sweet I was looking for to accompany my eggs and toast.  I liked it.

I walked through the bar to get to the bathroom and there is a lot of space there and it is equally as pretty as the dining room.  I would like to try this place again for both a meal and just drinks.  And just to note, no complaints about the bathroom.  It was well mantained and clean."}
{"text":"Why did they renovate? To be fair I loved the old Avenue Bar, it had that supper club vibe and was unique. Now it feels like many of the other restaurants in Madison. Service is fine, we've gone with our two young kids. I wouldn't call them unwelcoming to children but then again they didn't seem thrilled with it. Food is ok, nothing special on the menu and food prep is pretty standard. Too many good options in Madison to spend a meal here."}
{"text":"I have to say I am pretty darn impressed.

The bar is beautiful, the lighting is great, the service is fast and friendly, and the food is pretty darn good. What an upgrade!

I came here a few times in the past and never really had a good experience, though I did hear people talk about how great the Avenue was back in the day. While this doesn't feel like a classic Wisconsin bar anymore, I do appreciate the modern and clean feel. 

As far as the food and drink goes, my bloody mary was delicious (served with a nice beer back) and my biscuits and gravy were some of the best I have ever had. I really enjoyed having something a little different as their gravy is not the standard white sausage gravy, instead they have a red eye gravy with ham. The biscuits were especially great - buttery and flaky to the max. The eggs were perfectly over-medium and the potatoes were cooked and seasoned well, but nothing special. 

Overall I would say I am pretty darn happy with the first brunch of my 2016!"}
{"text":"I'm going to be honest here. I was a little nervous to try Avenue after the renovation as I had heard some loyalists opinions that they preferred the old location. However, I was pleasantly surprised and happy with all of my recent experiences.

I did like the old Avenue Bar, however, found that I also really liked what they have done to the new Avenue with the modern decor. I've been here quite a few times in the last year. I've ate at the bar. I've also had lunch on a quiet Friday, and have even been here for happy hour.

Our service has always been great. We've had some amazing bartenders as well - hustling on a busy Friday night and they did a great job. Remember - tip your bartenders.

Happy Hour is by far the best deal. Half off appetizers and half off taps. A really great option if you are \"food hopping\" around town. 

For mains, I don't think you can go wrong. But you should really get the fish fry. Avenue has always been known for their fish fry and I would recommend it. It's always good!

The only challenge is trying to get in on a typical Friday night. Busy is good and Avenue is always busy. We like to sit at the bar anyways, so it makes for a shorter wait.

Try Avenue. I'm sure you'll love it."}
{"text":"We had last been here pre-renovation when this was your average Wisconsin bar. Now it is a retro lounge with cool furniture and stylish artwork on the walls. I love the decor. 

Too bad we didn't love the food. With the exception of the cheese curds which were very good the rest of the meal was so-so. The walleye was tasty but tough. I've never had fish so chewy. Not sure how they did that. And the smelt was overly fishy but when we commented on that the waiter, with no hesitation,  asked if we wanted something else. We did not want another dish so he did not charge us for the smelt. We didn't even need to ask. Kudos for good customer service. 

Oh yeah, their classic old fashion was spot on."}
{"text":"In summary: Avenue Club has had a great \"makeover\" and it's a great asset to this stretch of town.

I've been here twice for dinner and once for a special event dinner.  The alcoholic beverages have a greater selection of fizzy drinks (get it--Bubble Up bar?) than most places, and sometimes bubbly drinks can veer towards overly sweet.  All of the drinks I've had here have been nicely balanced.

I had my first wedge salad at Avenue--first of all, the small portion is quite generous!  Really a wedge salad is a delivery system for red onion, tomatoes, crunchy bacon, and dressing, which is not a bad thing.  The cup of clam chowder Friday soup was good as well.

Pan seared walleye is a great choice, with a generous size of fish and sides.  Next time I'd probably decline the slaw that comes with it, as I prefer a vinegar based slaw.

As for the cons, which are few, we had an advanced reservation for a table for four on Friday night.  We were seated on time but the high top table was very small.  Normally I would reserve this for 2 people. If our table had ordered multiple dishes, such as everyone getting a salad and soup or having appetizers at the table at the same time as an entree, I don't see how we would have fit everything on the table.  Very few restaurants in Madison downtown/near east have reservations, so I appreciate the opportunity, but if I do a reservation for four on another night I will request to not be seated at one of those little high tops.  A dining companion ordered a special that was similar to a lamb stew.  The lamb was served with a side of pitas, but the pita was left untouched. A small amount of pita could have been used to mop up the gravy, but I don't think many diners would have been interested in eating all the lamb as mini pita sandwiches. This dish would have been better complimented by a grain or a salad and perhaps one slice of grilled pita to mop up the gravy.

We also attended a special event for Second Harvest here.  The four course dinner paired with beverages was amazing, especally the chicken chimicurri and the apple galette. I hope they add these items to their menu and I will go again if they host it next year.

Overall, I'm happy with the re-do of the former Avenue Bar and will return."}
{"text":"Never went in there when it was Avenue Bar so I can't compare but a large group of us went there on a Sunday night and the service was impeccable in spite of the fact that we all came in at different times. Everyone was happy with the food which was mostly sandwiches. Prices are a bit steep for what you get but the place has a nice inviting feel, and a good ambiance. We'll probably return to try the dinner but for $26+ we'll expect it to be outstanding!"}
{"text":"I honestly don't think many people know about this place. The decor is super modern and fun. We went for brunch and found the menu to be incredibly diverse. Everything we ordered was delicious and our waitress was super nice and attentive. I can't wait to go back and try something else. Definitely a gem."}
{"text":"This was my first time in the new remodeled restaurant. The beer battered cheese curds are absolutely fantastic. I have never had cheese curds that tasted as good as these. I had fish and chips from the sharables and that was also excellent, I need to go there for a fish fry on a Friday night. I highly recommend this place."}
{"text":"Fun, new, modern. I had an amazing lunch there. The service was great. If you are \"stuck\" in the past, and expecting the same old Avenue Bar, then skip it. If you want something new, with fresh, delicious food, then go and enjoy! I'm looking forward to going back soon."}
{"text":"Great Food, decent service. Got our food and drinks promptly, but the servers didn't give much attention to our group. Our server had a trainee, but wished she gave a better service. The waitress didn't refill our water after everyone's cups were empty but the hostess ended up refilling all our drinks.

As for the food, the shrimp scampi is one of the best ones I had. Even better than Olive Garden with good portion too. The beer batter cheese curds were fresh and soft but the portion was a bit little.

As for the mix drinks, I think majority of their drinks are premixed since my wife ordered a virgin drink and the waitress said that she couldn't order the normal mixed drinks since its premixed already so they had to make a separate drink."}
{"text":"I have loved going to the Avenue ever since it opened as The Avenue Club and the Bubble Up Bar. The South Side on the East Side is my go to cocktail and the Short Rib Stroganoff WAS my go to entree. We made last minute reservations at The Avenue last weekend and were eagerly awaiting the incredibly tasty Stroganoff and was very disappointed to see that it was no longer on the menu. I substituted for an OK NY Strip. I REALLY hope they bring back the Stroganoff. That may or may not be a deal breaker regarding return visits."}
{"text":"Decent food, great decor, serving speed can use some improvement. It was my first time eating there so could not comment on more things."}
{"text":"Beware the surprise, deceptive, nowhere listed on the menu \"rocks service\" charge. They add $2.00 to an already pricey call beverage and act like that is standard practice! When we inquired upon receiving the inflated check they acted
like we were annoying them."}
{"text":"Pleasantly surprised! I was skeptical going in as I was a fan of the old Avenue Bar.  I had the black and blue cheese burger and fries.  My spouse had the fish sandwich.  We shared calamari.  I would recommend all the above plus the tiramisu (perhaps the best I've had in Madison) and the goat cheese cheesecake with compote... All super delicious."}
{"text":"What is it with this place that we can't seem to get decent service?
It is the Saturday before Christmas, the students are done with exams, and so Madison is a quieter place now.  My wife had to be at work by 9 am and we saw that the Avenue Club, now part of the Food Fight Group for which we have a Gift Card to use, opens at 8 am for Saturday Brunch, this should workout nicely.

We are a party of 3, we arrive promptly at 8 am to open doors, and we are the only patrons at this time.  Let me cut to the chase, we were first given empty menu holders-no menus inside, the shrimp for the shrimp and grits were overcooked, as was the poached egg, mom's thick cut French toast had 1/3 amount of the syrup she prefers and no extra syrup on the table to add more, my Chicken and Biscuit Benedict's poached egg was also over cooked, and I would have liked some tobacco for the dish.

After our food runner delivered our food, we never got a chance to let anyone know any of this, because the entire front of the house was devoid of any employees for 15 to 20 minutes.  Other than one other table, where a regular patron sat down after we had ordered our food (he was greeted by name, and was told to smile) we were the only other customers in the place.  One would think, incorrectly, that a basic level of service would be available.

Once our waitress did make an appearance, here was our exchange:
Waitress: How are the first few bites?
Me: Mom needs a box for her French toast, and we are ready for the check

It is exactly due to this \"level of service\" that, when we do decide to go to \"The Avenue\", it is under the pretense of, \"Well, maybe things have changed?  Let's give them another chance.\"  And once again, \"The Avenue\" has allowed me to share my experience on social media.

Maybe we will see you in another 10 years, but, probably not.  I will give 2 stars because I like the new décor."}
{"text":"I love the interior of this place. Very cute and retro. I had clam chowder and a pesto grilled cheese. The chowder was good, I would definitely order it again. The chunks of potato were a bit too big, but I'm being picky because I'm one of those freaks who hates large veggie chunks in my soup. There were plenty of clams and bacon, and it was really a comfort soup.
I had a couple minor issues with the grilled cheese--the tomato wasn't ripe and the cheese wasn't melted. But, I'm forgiving those two things because the flavor was so fantastic that who really cares if the cheese was melted or not. The balsamic drizzle and the pesto were amazing. I would definitely order this again.

Also, I was driving so I didn't order anything to drank, but their drink menu looks delicious and I'm definitely going to be back to try some out!"}
{"text":"The interior is nice, but a bit sterile. Hopefully, it will break in with time. The staff was friendly, but rushed. We had a drink in the bar and I was disappointed with the small pour of wine. I had the veggie fricassee for dinner. It was delicious and well prepared. I would love to see more vegetarian options on the menu."}
{"text":"I had never been to the old Avenue bar so I can only comment on the newly renovated space that the Food Fight group took over. 

I liked the space and the large bar. Bartender service was good and attentive. Their old fashioned happy hour is such a good deal. I loved old fashioneds and they did not disappoint especially for $4 or $5. They also have several of their appetizers for half off. The fried pickles were delicious with a tasty ranch dressing and the smoked onion dip was out of this world good if your a fan of onion dip.

The regular menu looked good and there were several dishes that sounded appealing to me, maybe a little pricy like others have said, we chose not to stay for dinner though. We will definitely be back for their happy hour and hopefully try more."}
{"text":"I've been wanting to try this place for almost a year, and I finally got here on Thursday with some of my girls for happy hour drinks and dinner. It was so fun and cute we decided we might turn this into our own personal MacLaren's (for all you HIMYM fans)! 

We got half-off tiki drinks for happy hour (the menu says 2-4-1 tiki drinks, but you don't have to buy two to get the deal!) And they were cute and tasty (and fairly strong)!

I ordered the Chicken Parmesan which was delicious crusty chicken on a bed of spaghetti with red sauce (yum!) and came with a soup or side salad. I got the Caesar salad and it was great! Hard to do Caesar wrong in my mind, but still.

Also, our bartender (yup, we were eating spaghetti at the bar) was super friendly and honored our somewhat silly requests (e.g. pouring our second round of drinks, that otherwise wouldn't have been in martini glasses, into martini glasses).

I already have plans to return with another friend on Tuesday, so keep up the good work Avenue Club!"}
{"text":"A Wisconsin support club with fish fry and burgers. Portions are huge and the fries are good. They've decent views of TVs, a cozy decor and a cocooned booth that's private. Staff are very friendly and the variety is better than some other restaurants around."}
{"text":"Typically I enjoy the food at the Avenue club. This past Saturday I had their prime rib special... perhaps it was just a bad night. At least half of the 12 ounces was fat (difficult to accept at $28!) and while the waitress mentioned that it would come out medium rare... In fact I felt it was under done and tough. Again perhaps this was just an outlier? The service though was exceptional as always."}
{"text":"Update! 

I am happily bumping this to a 5 star rating. 

Went in tonight for round two, to give them another shot. After my previous post, I was personally contacted by management and they thanked me for the feedback, said they would speak to chef about it, and that is super awesome. 

This time I had the daily special - chicken pot pie. Holy cow. Best pot pie I have *ever had.* The chicken was cooked so perfectly, the creamy sauce was spot on, and the puff pastry on top was light and flaky and amazing. They have a veggie pot pie on the regular menu that I must absolutely try next time I am in!

The BF had the chicken parm and he was very satisfied as well. It was huge! So much leftover! 

We started with the beer cheese fries. They were so good. And also huge! Way too much for just the two of us!! 

We left very happy and *very* full. Lots of leftovers for lunch/dinner tomorrow. Bonus!"}
{"text":"Really good food and atmosphere. Friendly staff, tasty steak, but what really shines are their unique and tasty cocktails. Cheers!"}
{"text":"Went after a holiday party. Sat at the bubble up bar. Beautifully redone nice comfy seats good beer selection menu is limited after 10 but has good choices. Bread and hummus very good light perfect with summit pilsner. We visit again soon."}
{"text":"It was simply f'ing delicious. I wasn't a huge fan of the old place and went in skeptical. However I just have to say it was all around a great experience, service, tasty and price point on. You could actually make it as expensive or not depending on how you order. Something for everyone. It lacks the dark, dank and dust of the old supper club-but that's a good thing. Pan seared walleye, fried walleye and short rib stroganoff was great! We shared as a table. Going back for my own stroganoff. Well done, Food-fight, well done!"}
{"text":"Portion was huge and prices were great! The place was not too crowded during weekend brunch time as well so that was a plus."}
{"text":"Tuesday night - slow. But the service and food were great. Our bartenders were knowledgeable and friendly. Our server too. Most importantly to us- our short rib stroganoff- carpaccio and smoked onion dip were very good. Rare to get house-made chips that are not overly fried and burnt tasting. 

And- the stroganoff was great. We are not picky - but both cook and know the difference between ok and very good. Very good experience !"}
