{"text":"Neither expensive nor cheap. The quality is above average though rolls r a bit salty for me, while service is quite slow. Nothing impressive after the first time. Still go there as it's nearby and offers brown rice option (extra $1 per roll). Go there for lunch is more economical."}
{"text":"I have been here twice and I love this place! They have lots of vegetarian options, their teriyaki tofu tastes great and the brown rice is the best I have had in Toronto. It is not very busy and they place classical music which makes for a very relaxing atmosphere. Highly recommended."}
{"text":"Solid sushi restaurant with good portion sizes for the prices at dinnertime. Service is quick and friendly (both the servers and the owners). Haven't been here at lunch time, so I can't speak to the service or food during those hours, but dinner is great. Note: Their udon noodles are more Korean Style. The only downside is that it's on the smaller side, so I wouldn't recommend coming here with more than 4-6 people in a group (I would call to see if there is seating for 5/6 available before heading there)."}
{"text":"Their spicy tuna and garlic roll is to die for! It is my favourite dish, ever. Great food and service."}
{"text":"Love their vegan/vegetarian rolls!   I live close so I always come here for a quick bite, and their vegetarian roll is soooo good. They also don't skimp on avocado, and they have this roll that has pickled veggies which is so good. They also have a brown rice option ($1 extra) which is I think better than the white rice."}
{"text":"decent joint for lunch! prices are not bad either.  not much to say other than its your typical quick fix sushi place."}
{"text":"The reviews looked amazing so I was expecting better. The portion sizes are decent, and the service was nice indeed as the others have commented. However their lunch menus are still quite pricy. Half of two rolls, ie one roll, 8 pieces is 10 dollars. That is quite pricy in my opinion. Furthermore, the tempura inside the sushi (dynamite roll) is stale. I expect my dynamite roll tempura to be crisp and fresh for a \"dine in\" place. I'd rather walk down the street to Wow sushi instead of this place.  It is quite disappointing and I will not be coming back."}
{"text":"Not a bad place to stop for a quick bento box or a roll. The service was prompt and attentive and the food itself was relatively high quality, tempura was added into the spicy tuna roll which while not bad, I couldn't help but feel like it was just filler. This restaurant is nothing special but if you happen to be in the neighbourhood their are far worse places to stop for a lunch or dinner."}
{"text":"Usually come here for dinner, but came for lunch this time. I got the Sushi and Sashimi Lunch combo B. They have good portion sizes and a wide variety.   It's a fairly small restaurant with relatively quick service."}
{"text":"This place is really cosy,  with nice classic music and wide selection of rolls and other sushi food5 out 5 from me and my boyfriend"}
{"text":"Great little spot for tasty sushi! Wide selection and choices for combos + super cheap miso soup! I had a California Roll, Spicy Salmon Roll, and some vegetable udon and I was extremely full. I would highly recommend!"}
{"text":"I don't know why I haven't been coming here more!   The service is great and the food is awesome.   The spicy salmon is very good and so is the dynamite roll.  I will definitely be coming back!"}
{"text":"I live in Yorkville and see this little restaurant every day when I walk home from work, but I've never stopped by until today. A friend and I decided to check it out, and I was very happy with the service we received! The waitress took our order quickly, and the food was brought out within 5 minutes of placing the order. While we were waiting for the food, they even gave us both a bowl of miso soup to enjoy. The soup was perfect texture and not too overpowering.   My friend ordered the BBQ Eel Dragon Roll - definitely recommend. It was the perfect balance of crunchy but sweet. I was expected it to be slimy, but it wasn't at all! I ordered the avocado yam vegetarian Dragon Roll, but was slightly disappointed. It was a little dry compared to other places and was not nearly as flavorful."}
{"text":"I recently moved in near this place, and discovered this gem! My go-to sushi place now.   Great customer service.  Always amazing, fresh quality sushi!  Their lunch specials combos are great for take out as well as dine in. I recommend the Dynamite roll with the Boston for just $10!"}
{"text":"Service is great. Food quality is terrible.  Not sure why it's rated so high - this place is never that busy. I've tried this place multiple times to give it some chances but it's a disappointment every time. The sashimi is a watery mess, they're not fresh at all. Never order their sashimi platter!   There also isn't a lot of variety in their menu. Reading through the menu was so dry. I wish they had pictures in the menu."}
{"text":"Great little sushi restaurant that has become my go-to spot for lunch. Used to be open at this same location as Avocado Salad. The service is always very friendly, and although I have only picked up rolls to go, they always offer me tea while I wait, nice little added touch I think! Their service is quite quick, so a good option when I need to get back to the office quickly.  I have only had the basic rolls, but whenever I go in, it seems the dine-in customers all have bento boxes. It is slightly pricier than some places along Yonge, but I find the service and freshness of the rolls are totally worth it."}
{"text":"One of my favorite sushi restaurant. Their service is very quickly, friendly, and sushi is really tasty always! My favorite menu are spicy tuna sushi and salmon and avocado sushi, When we order bento box we can also get miso soup and tasty salad! And after meal  they give us candy which is also my favorite.  Friendly, quickly, tasty and reasonable sushi restaurant!"}
{"text":"I did not expect this at all! Tucked away on Bay street, this tiny little restaurant really impressed me tonight.   I came here with 3 others and they all ordered bento boxes, while I ordered a combination sushi + salmon dragon roll set. To my disappointment, their meals came with seaweed salad but mine came with a regular romaine lettuce salad so when the waiter saw my facial expression go from excitement to sadness, he generously offered me one on the house! What great service!   When my food came, my mouth instantly started to water. The presentation was very well done with bright, fresh colours and the salmon dragon roll pieces were fairly large. I took a bite into the salmon sushi first and WOW. The salmon was buttery and melted in my mouth - I really didn't anticipate that level of quality! The portions of everything, including slices of sashimi and avocado, were overall very generous and I would definitely come back! It's a bit pricey (my set was $17 before tax and tips) but it was definitely worth it!"}
{"text":"Came here for a quick lunch. They do not offer AYCE. The price was reasonable and the service was friendly. I didn't find anything to be special about this sushi house, and it was fairly quiet. However, the sushi was decent and it seems like a good lunch spot or take out spot."}
{"text":"Amazing sushi for a great price. Cozy interior and nice staff. They have a great lunch menu until 3pm and 5% off cash payments too."}
{"text":"Coworker and I came here on a whim for a Friday lunch.  Atmosphere: fairly small with 5-6 tables, but fairly pretty.  Menus are printed on quality paper. 3/5  Food:  pretty good. I got Bento Box 3, which included chicken teriyaki, California roll (I substituted spicy salmon for $1 extra), 7 PCs sashimi, gyoza and your standard green salad and miso soup.  The sashimi was very fresh and tasty, however the chicken teriyaki was just okay.  It wasn't grilled so it didn't have that smokey flavour/feel teriyaki it should have.  3.5/5 for food.  Service: tea was filled up often but the wait for food was slightly long - about 20 minutes. 2.5/5  Verdict: I'd probably come back and order takeout sashimi ahead of time. Still solid."}
{"text":"Really great place for a quick lunch. You can get a combo of 8 sushi (4 of one and 4 of another) with miso soup and salad for around $10. Very fresh quality, wonderfully made sushi. The fish is delicious and the rolls are all very flavourful. Of course, the miso soup is just regular miso soup but it is still very nice to have. They do takeout so it's great to just walk over, order, and head back to work. The service is very friendly."}
{"text":"My friend and I came here for a Friday lunch. This place is extremely understaffed; only one waiter for pretty much everything.  The food here is also overpriced for its quality and quantity.  We both got the Set A sushi lunch which included a miso soup, salad (both average), 6 pieces of spicy salmon and California sushi each. The sushi was quite yummy, but the slow service + overpriced food = not returning to this place anytime soon."}
{"text":"Restaurant is clean, service was fast and the food was really good. I've had better edamame, but the sushi seemed fresh."}
{"text":"After seeing all the good reviews, and being a sushi/maki lover, I decided to go for a lunch. Place looks nice, glass wall overlooks a part of Bay street. For their food:  Main positive thing is that it doesnt have a lot of rice.... great.... But, it barely has any fish either!!! they are filled up with cucumber and stuff like that.... U can barely see the piece of fish!!! Although I liked that they don't stuff their rolls with rice - Would not go back as I love to actually taste the seafood in the rolls..."}
{"text":"Great little place. Our group of 10 were impressed by the extensive menu, variety of combos and quality of food, satisfying all our tastes. Will visit again for sure."}
{"text":"My husband and I visited Avocado Sushi for lunch on a weekday. It was our first time, we did not plan to eat there, we just came across the place as we were on the way to an appointment. At 11:30 it was completely empty, I guess we were the first customers of the day. The place was clean and neat. We were welcomed by a friendly hostess who also ended up being our server.   We were glad to see a special lunch menu which made it easy for us to choose something quickly. We were slightly let down that they do not offer 'all you can eat'.   My husband chose the teriyaki salmon + California roll combo. I chose the teriyaki chicken roll + tempura shrimp roll combo. Each combo came with salad and miso soup. Both were satisfying. We could tell the salad was pre-made and kept in the fridge prior to lunch service. We didn't mind, it was still fairly fresh. Some people may not be so cool with that though. Miso soup was on point!  The meals were served promptly, not much waiting time at all. The presentation was nice and everything tasted fine to us. The rice was a good texture and taste in our rolls. They were fresh and very flavourful. We're not the biggest sushi connoisseurs so we're very easy to please! We liked the food very much.   Our bill came out to around $27 after taxes. I think it was a little high for basic combos without any extra drinks or desserts. Must be the neighbourhood.  Service was great, very friendly and responsive. We had a nice experience and we would most likely return if we were in that area again in the future."}
{"text":"This place is FABULOUS!  When we came on a weekday evening, there were barely any customers. Most of them ordered takeout, which is what I would like to do next time simply because I like to eat at home more. The waiter was really nice- not really attentive, but very nice. We ordered a bunch of rolls and sashimi, which came with miso soup and salad. The miso soup was kind of watered down, but as we all know the main attraction is the fish.  The appetizer sashimi had small but incredibly fresh and soft slices. It had tuna, salmon and I think cuttlefish? We waited for quite some time for our rolls, but that's because they put all of our orders onto one plate! Everything looked so pretty and fried to perfection. Just thinking about it makes me hungry again.  They gave us candy while we were paying, and the total amount was kind of expensive. However, they have really good combos (e.g. 10 sashimi, 15 rolls, 18 sushi is one combo) for around $30~$40, so I would definitely get that next time! We paid $50 (inc. tax and tips) for 4 dishes. I love it here, and I'll definitely order more food next time!  (p.s. people seemed to have a bad experience with the teriyaki here so I didn't try it, and I don't plan on it either. The sashimi and rolls are really tasty!)"}
{"text":"I ordered their lunch special with the spicy salmon and California roll. The sushi was okay but what bothered me is the amount of salad they gave me. It's like they cut up one piece of lettuce. Not what you expect when paying $12!"}
{"text":"Great little gem hidden on Bay St.! The sushi rice is so perfectly seasoned and the hand rolls are full of fish. The restaurant is also clean and spacious. Will be back soon!"}
{"text":"Lunch menu is worth it. For $10.50 I got 6 pieces of fresh spicy California rolls, 6 pieces of delicious spicy salmon rolls, miso soup and green salad. Service is great! Would come back for lunch."}
{"text":"Miso -- too salty.  Salad - needed a microscope to see it.  BUT and here's the important stuff:  the sashimi was very fresh and the sushi rice PERFECTLY seasoned - just the right proportions of vinegar to mirin.  Mat cha was good.  They have soft music going in the background, quiet clientele and polite wait staff.  Nice family who own this restaurant.  They may not have a huge assortment of fish - but what they have is very, very fresh."}
{"text":"The owner here is one of the nicest people I met. He's genuinely a nice person. Most small requests are handled with no extra cost. The portions are enormous, although the variety of fish or the technique is not the most advanced, they have great rolls and combination sets that makes this place a gem.  I like."}
{"text":"If you are used to fancy Japanese sushi restaurant or even all you can eat sushi, I will not recommend this restaurant. Or ask you lower your expectation. Nothing fancy. Sashimi was good (no smell means you will not get sick), portion of food was okay for someone not too hungry at the moment haha. Price was okay for the location and rent. It's good enough to eat for a meal purpose. A bit slow...if you are not in a rush, not a big deal. Service was not bad. Just one person works on the floor, but I thought it was okay for a not too busy restaurant."}
{"text":"Unreal. Fresh. Fast. Can't go wrong with $15 sashimi meal (E). Amazing company. God. Damn."}
{"text":"I came here based on the Yelp reviews while visiting the Royal Ontario Museum nearby, and I agree with the majority of reviewers.  Initially, the storefront seemed small, and since we came in after a few minutes of opening, it was relatively empty.  However, you know it's a tell-tale sign that the food is good here when shortly after, the restaurant is entirely full.  The ambiance of the restaurant was nice and clean due to the large windows, and lots of natural lighting.  After we ordered our food, we noticed there was a line up of people waiting for seats!  In terms of food, the sushi here was great! We ordered the Small (30 pcs) Sushi & Roll Platter, and it was very fresh.  The miso soup was seasoned nicely as well.  I thoroughly enjoyed the food here.    Service was great as well.  We were greeted by a younger male server who was able to accommodate for our group by rearranging the tables.  He also was fast, and easily approachable.    Overall, this is great place for sushi.  Although, I'm not in this area often, I'll be sure to return if I am."}
{"text":"I have wondered past this place a couple of times on my way home from work as I work at Queen's Park and live near Yonge/Bloor. I think the actual signage keeps people away from this restaurant.   As Asahi Sushi near my house was closed, and Wow Sushi wasn't that great last time I was there, we decided to venture over to Bay Street. I can't state how happy I am that we did. There was only one other person inside this restaurant for lunch on a Saturday. Assumed the worst, but got the best.   We both ordered combinations with sushi, sashimi and rolls. I can't emphasize enough how delicious the rolls are with some extra seasoning on them. The chef puts some definite love into his work. The fish were extremely fresh, the portion size was good. The salad and soup were good, they asked us if we wanted more. I LOVE THIS PLACE. It is a few dollars more, but this is my new go to spot and I will walk the extra 2 blocks from Asahi to go to this place from now on.   If you are in the area and love sushi, definitely check this place out - even worth traveling to - yes I said it and I never say that. Only downside is that if the place was full, service could be slow???"}
{"text":"If you're looking for good customer service and great food ( most importantly fresh), then I highly recommend this place.  First off, if you're an avocado lover than this is a perfect place to eat. The name is what drew me to this place. I ordered the avocado salad, avocado yam rolls and sashimi every time I've came. The portions are very good not to small but enough to keep you satisfied and light.   Not only the avocado was what kept me going back, but the staff are so genuine and they truly value their customers. After the third day coming straight, Michael (the owner) left his cooking station and came over to introduce himself and say how much he really appreciated that I kept coming back. How could I not? One time he even gave me an avocado just before I left, since than he always greeted me by my name.   Overall the place is small but cosy, great atmosphere with pleasant music, and a great place to eat either alone or group. Nothing but postive things to say."}
{"text":"Checked out this place as it was close to work. I was pleasantly surprised! The interior is not very impressive but the food and service were both fantastic. Their rolls were fresh and food quality was great. Would recommend their torched rolls!"}
{"text":"Absolutely loved it! I learned about it from Yelp. Went there with a Sushi-loving friend on a warm day in August.  It is a cozy place tucked in between other shops.  Nice outdoors. Welcoming staff. We ordered a platter of Sushi contained 39 pieces for 38 CAD ( had California roll, Shrimp, Crab) which came in ship-shaped plate. Very nice looking and delicious. In addition. We had Avo-green salad which was amazing, I loved the dressing. At the end we had a tasty toffee sweets. Very nice experience will definitely visit the place again."}
