{"text":"I'm from Seattle where all Asian food is quite good, so The bar is high for me when rating Pho. The food at AZ Pho was okay, but not great.  Service was very friendly, but quite slow. Restaurant was nice, very clean."}
{"text":"Steak Pho is super flavorful! It comes with fresh mint, bean sprouts and jalapeño garnish! Yummy. Will be back for more."}
{"text":"Finally a very good Vietnamese restaurant in Gilbert.  Haven't had a bad dish yet. Highly recommend!"}
{"text":"Nice little place in Gilbert.  I ordered the P2 beef pho bowl.  I would rate the pho around average, wished it had a few more noodles.  My friend ordered the N2 hu tieu and it looked great, but found a square of plastic in the middle of the dish after a few bites.  Talk about losing your appetite.  They did make a new dish, but did not offer a discount.  Staff was friendly, but not sure we'll come back."}
{"text":"Best Pho in town. I go atleast 2 times a month. The beef pho's are my favorite. You can tell the broth has been given hours of love before hitting the bowl. The beef is quality meat and comes with your typical side plate of veggies. On the table is hoisin and sriracha however they have chili paste and chili oil upon request. I get the Pho and iced tea for under 12 bucks!!!!!!"}
{"text":"Bad value. Did cost twice as much as other pho places in town and isn't half as good. In a vacuum, it's ok. But I just cannot recommend this place considering the competition such as Saigon pho or even pho Chandler"}
{"text":"I usually go to Pho Chandler but I wanted to give this restaurant a chance since it is really close to my house. Service was okay at first but our waiter forgot about us at the end and we waiting a good 10 minutes to get a to go box and pay our check. I ended trying a Bun dish which was pretty good. Food was good but I wish the service was more warm and attentive."}
{"text":"I've posted about this place before. Best Pho South of the 60!
Get the spring rolls too!"}
{"text":"I love this restaurant!  The staff is so friendly and nice.  Their food is simple and clean, not heavy but super filling.  I usually get take out at least 2x a week, but my husband and I will stop in for date night occasionally as well.  My favorites are the lemon grass chx, fried rice, shrimp spring rolls and the chx pho.  So DELICIOUS!"}
{"text":"I've never had Vietnamese food before, but this place is amazing.  I got the P2 (it's the beef pho with noodles) and it was delicious!!  I got it to go, so it came disassembled, for me to throw all the ingredients in together when I got home.  It was cool to throw together and watch the beef cook in the broth.  So fresh and tasty!  I highly recommend this place!"}
{"text":"My wife and I tried Az Pho & Grill last night since we saw it was now open earlier in the day.  Overall the food was good.  I had the Steak and Flank Pho.  After I added the bean sprouts and the peppers with a splash of Hoisin it was just about perfect.  Gold Star.   My wife had the Seafood mix clay pot.  She thought it was pretty good.  The rice was just rice and moist & mushy. Ok.  We also ordered the sampler but probably should not have since it all was a lot to eat.  The staff and I assume owner were personable and nice.  I know they just opened this location but service was scattered and after food delivered it was not apparent if you wait for a check or how to pay.  After we did get our check, no one came back to table.  I ended up taking it to the counter and paying.  Also, billed for a Cosmo and at the time of ordering, the wait person said not sure they can make but he put on ticket anyhow.   We would have been ok about being told not able to make the menu item but didn't get it.  When I got the check we had been charged for the Cosmo.   

One odd thing was they didn't have enough menus and the restaurant was 1/3rd full. Time to goto Kinkos.   Don't get me wrong we will be back but some of this is the basics and some kind of system to make sure each table is worked thru without is needed.  I still think 4 stars since this place could be a winner.    I wish them luck."}
{"text":"Fantastic food!  Very fresh and authentic with great blend of flavors. We started with Spring Rolls and they were very good. I had the Quang Nam Noodle Mi Qaung. I'm not sure what that means but it was awesome!  Best Pho food we've tried in the East Valley. It's going to be a regular for us!"}
{"text":"Service is ridiculously slow. Definitely do not come here if you're hungry or looking for a quick meal. 

Food is average at best. Definitely not worth the long wait."}
{"text":"Last night my husband and I had dinner here, we both ordered our meals, I had the stir-fried seafood over crispy egg noodles and my husband ordered the shrimp and beef with white rice.  I got my order right away but my husband didn't, there was some mix up with the order and after 20 mins of waiting for his food he asked if they could check up on his order when management realized this they quickly cooked up his meal and brought it out.  Both meals were excellent, delicious, and perfect.  The manager comped my husbands meal because of the delay and kept apologizing.  We will definitely eat here again, their service was excellent and even though there was a mix up and delay, their service was still professional and they made up for their error."}
{"text":"Just finished eating here. And it was absolutely amazing. My wife had the pho and I had the fried rice. The portions were really generous we had to take the extra home. We also ordered the pork spring rolls and they were delicious. Very refreshing. Overall the experience was great. The atmosphere is calm and nice, the restaurant has nice decore (very clean), the staff were attentive and polite. I recommend coming here for dinner!"}
{"text":"Delicious food and great service. Loved the option of being able to order more than just pho.  My kids won't always eat it when hubby and I are in the mood for it. The decor and atmosphere was also amazing. Definitely going back."}
{"text":"Very good Pho at AZ Pho and Grill.  The broth is very tasty, and the meat is great!  The noodles are good, but usually stuck together at the bottom of the bowl.  Not a big deal for a great bowl of Pho.  On my top 2 in the Phx metro area."}
{"text":"A very nice restaurant. The food is delicious; and excellent service. Pho is flavorful; has a clean Pho taste. We will definitely be back!"}
{"text":"Overall the food was good but not amazing.  - probably a solid 3.5-4.  The coconut shrimp that came with the appetizer sampler were the lowlight of the meal, just not crispy.  Egg rolls were very tasty and their sauces were all on point.  I had beef pho and my wife had a vermicelli bowl with shrimp - nice portions.  The kids shared a fried rice which was well seasoned and not oily.  Food came out pretty fast as expected with Vietnamese. 

They fell down a little on service and it really wasn't that busy (Sunday lunch, only 3 other groups when we arrived and maybe 75% full at peak).  Wife had to go grab a high chair herself, as one wasn't offered.  Waitress brought drinks with no straws - we had to ask.  My pho came without chopsticks (and I'm Asian) so I grabbed a still packaged pair off a nearby table that wasn't cleared yet.  That is, the table next to us stayed piled with dirty dishes up until the point we were paying for the meal.  

The food was good enough (and I really like pho) that I will give them another go and hopefully be able to raise my score with a better service experience."}
{"text":"Based on the reviews we gave this place a try. It was very good! Even better was seeing hoisen sauce on the table. Food was yummy and we plan to come back soon! Service was good too!! Place was crowded which is always a good sign."}
{"text":"Looks like a new place - we had difficulty find it. Thanks to map quest we found it. Once inside u can really see the earthly balance in all the decor.. I got to say live the bar and variety of beers. Their egg rolls and pho delicious. Will definitely recommend and will definitely go back whenever i am close the community...."}
{"text":"First review, third time visiting AZ pho. I have been very pleased each time, getting the P1 pho special. I'm always satisfied with the taste, the broth is top notch and hard to compare to any others I've had. The service is always pleasant and the atmosphere of the restaurant is great. There has been minor inconsistencies with my visits but nothing too bad to consider this place not worth the trip. The noodles do seem bunched up when you first get the bowl, but after adding your lime and bean sprouts it just needs a quick mixing, the tendons don't quite melt, but they are very good none the less. Every table (bar included) has hoisin and siracha for those who want bolder and prominant flavor. I choose to always top my meal off with a Vietnamese iced coffee, and these guys really get it right for me. Altogether I consider AZ Pho And Grill 5 stars."}
{"text":"This is the worst beef noodle (pho) place ever! I can't believe they have the nerve to put the word pho in their store name, but don't even know how to cook pho properly. We are a Vietnamese family and have tried pho at every Vietnamese pho places in town. We saw this new place and decided to give it a try around noon this Saturday, but we definitely will never come back. We ordered special combo pho (P1, pho dac biet), but the noodle was uncooked (stiff and crunchy), the broth was cold, the meat was chewy, the portion was small and the price was $1.5 - 2 more expensive than at other pho places. We also ordered hot and sour seafood pho (P8, pho hai san chua cay), again the noodle was uncooked and the broth tasted funny. Fried rice with seafood (F3, com chien hai san) and crab paste noodle soup (N5, bun rieu cua) were also very bad. We observed that a few other customers around also complained about their pho and barely finished 1/2 of their bowl. Worse yet, I personally got a stomach ache after eating their pho and had to take a couple of Pepto Bismo tablets to calm things down. I gave this place 1 star because it appeared clean and spacious. Please take your money elsewhere!"}
{"text":"I've tried this place several times and have not been impressed with the food. 
Service is nice although slow."}
{"text":"Was really looking forward to going here. I had heard really good things about it. When we walked in there were about 2 tables with people in the place. But to my surprise every other table was dirty with dishes on them. The waitress just standing around."}
{"text":"Tried clay pot..  This should only be eaten at location.  Let it sit as long as you can in clay pot.  All the taste will infuse into rice.  Yet each item will still have its own taste.  I had the seafood clay pot three times now.  Once as a take home thus why I suggest eating there.  The clay pot is really required to get the infusion.  Yummy....  Will be back."}
{"text":"This is a regular for our family. They have a clean, pleasant restaurant and friendly staff; not to mention really good Vietnamese food. I've had their Pho soup, grilled rice plates, and vermicelli, all excellent. We usually finish our meal with a Boba Smoothie or Mochi ice Cream, really good!"}
{"text":"I thought the staff was mediocre at best. The food was not good at all. It was over priced and the restaurant smelled like the old stale fish clothes. I was really trying to like this place, since this is the closest pho place in Gilbert. It just didn't meet my expectation. I wouldn't go back again."}
{"text":"This was the WORST pho I've ever had!! Horrible broth that had a strange flavor and the meat looked and tasted not fresh. I couldn't even eat it.. So unappetizing! Ordered fried rice for the kids, no flavor and horrible! This place looked borderline as to its cleanliness and honestly if I called it in I'm betting they would be shut down! Will NEVER go back!!"}
{"text":"Me and my family came here to eat and will not return. They forgot my moms food and we were waiting for over an hour. got there at 6:30 and it is now 7:50 and leaving. they brought us our bill before even bringing our food. our server didn't know what he was doing and kept trying to say it was our fault. never had such shitty service in my life. try going to saigon on alma school and knox. very good service there and very fast!"}
{"text":"This place has SO much potential to be the best pho place in AZ. The food is what keeps me coming back.. 

However, I've been here a handful of times now but don't expect too much from the service. My last visit I was pretty shocked. We received half our order and still didn't have any drinks after 20 mins. So I didn't mind getting up to ask for our drinks when they got some time... then we waited a really long time for a refill when I witnessed the girl walking around with water to the other tables with filled glasses that declined wanting more water... there's definitely more than me being shocked about not having water and I won't even go into the couple that walked out on them too :/...."}
{"text":"I'm speaking on behalf of the staff,, RUDE . My wife and I went in at 6:30pm on a Friday and the restaurant was empty, only two tables were sat, we asked if we could sit by the window at a booth and they said NO. That they were reserved, so they insisted on sitting us on a small table in the walk way, so I said I'll just take my business else where and they didn't seem to care so we walked out. I've been in the restaurant business for quite some time now, and the number one rules has always been to make the customer happy.. I do not recommend this place"}
{"text":"I ordered the vermicelli grilled pork to go. The two guys that work there have great service. Offered me water while I waited. The thin pork was freshly grilled with a teriyaki like sauce taste, the noodles, basil, fresh bean spouts and cucumbers balanced with the vinegar. Didn't care too much for the extra salad."}
{"text":"We have been loyal customers for well over 2 years and in those two years we have had twin boys that are now toddlers. They are still learning table manners and today the owner followed us out to inform us that our kids \"make a huge mess\". The service is SLOW and tables are not all clean when you walk in but we put that aside these years because the food is good. If you have small children, my advice is that you don't bother going. There are several other pho places in the area that we will be taking our business to in the near future."}
{"text":"Clean, healthy, fresh Vietnamese food. Very affordable for an uber clean restaurant. The serving is bigger than how much I wanted to eat, but it's all good. It's not a five star restaurant, but the ambience is excellent to meet with friends and colleagues to wheel and deal, and the food is safe enough to bring my family for dining in lieu of cooking at home. 

I know the restaurant owners and I know the quality of their food. Good people who are proud of their work. Honest food. Two thumbs up on preserving the quality and authenticity. 

Food:4.5/5. 
Freshness and quality: 5
Affordability: 5
Service: 4.5
Cleanliness: 5"}
{"text":"Delicious!!! I had the Pho beef and my sister tried the pork with rice. We were both very pleased and will be back soon! They've done a really nice job and it has a great atmosphere. I'm thrilled to have a Vietnamese restaurant in the neighborhood."}
{"text":"I was really craving some veggie Pho and found this place. I ordered ahead, and it was ready when I arrived, no wait at lunch time, so that was nice. (Sometimes places say 15 minutes when they actually mean 45, so that was cool.) It's a nice clean place, and the staff was friendly. I was greeted right away, and helped efficiently. The Pho was great, and as an added bonus, they actually offered veggie Pho in veggie broth, instead of chicken or another meat base. I'll be back!"}
{"text":"The atmosphere is very calm and relaxing. Service is quick and friendly. But most of all the Pho is delicious. The broth has a nice flavor not too bland and not over powering. All of the herbs are fresh and flavorful served on a side dish so you can flavor to taste. This was the perfect bowl of soup to help break my summer cold!"}
{"text":"My favorite place to go for Pho.  Wonderful staff with great service!  Fresh vegetables  and affordable appetizers."}
{"text":"Had lunch here the other day with a friend and we both loved it.  I had the daily special and my friend had the pho, they were both excellent.  Service was great, will definitely be back!"}
{"text":"Great Pho and Banh mi. Very clean and the service was excellent. Prices are very reasonable. We enjoyed our lunch."}
{"text":"Came in on Sunday with our family. We knew they closed at 8:30 pm though we figured they usually serve us quickly and we walked through the door at 8. There was a couple of tables eating and the hostess said it would be 5 minutes while they cleared some tables which was strange because like I said there was only a couple of tables occupied. So we wait 10 minutes until the hostess comes back and says \"we close at 8:30 so... is that ok?\" But she didn't offer us a table, it was her trying to \"politely\" say that we were not going to be seated. The open sign was still turned on and like I said we had come in with 30 minutes to spare before the closing time. We just stood there confused and my husband told the hostess \"next time please tell us you're closed instead of having us wait 10 minutes for a table and then tell us you're not going to seat us.\" I thought this was so rude and this is a spot we have been coming to often. They just lost our business and we will be sure to tell people we know about this experience because it would've been better to be honest and say sorry we are closing in 30 min when we first walked in and we don't want to have to stay later than that. As we left at 8:12 pm they still had the open sign flashing outside... never coming here again!"}
{"text":"Great ambiance, very clean, attentive staff.  The owner was so nice and helpful. The pho broth was VERY flavorful and the regular size bowl was very filling.  The green tea boba was tasty and the Vietnamese iced coffee was out of this world.  We will definitely be back!"}
{"text":"Just like I promised the women (I wish I grabbed their names) who were serving me this afternoon, I am here writing their review.

First off, Vietnamese is by far my favorite and I would call myself a pho enthusiast. Their pho, amazing. End of story. Sometimes when you get pho, it can be bland. Their's was full of flavor and came with a good amount of fixings and was perfectly portioned. I also got their eggrolls, again, fantastic. I wish I got a little bit more mint and another leaf of lettuce, but that's my fault for not even asking. I also got their Thai tea with boba. I LOVE the fact that sell boba. I checked out the rest of their menu and I am very excited to try their sandwiches. The man I was sitting at the bar with (oh, yes, they also have a stocked bar. Thumbs up for that!) informed me that their shrimp and pork spring rolls are to die for. So now, I need to go back and try that out.

The atmosphere is very nice and clean. Big screen TV at the bar for the lonely patron like myself. The staff were very friendly. I can see that they're under staffed so please keep that in consideration when enjoying their food. 

This is the first time I have been there and definitely will not be my last. I even plan on bringing my coworkers there for our next lunch meeting in February. 

You guys are fantastic. Keep it up and I will definitely be seeing you soon!

EDIT: I had to come in and add to my review after reading everyone else's. 

First off, I agree the prices are slightly higher than say Saigon over in north Chandler or the hole in the wall places throughout the valley; you have to remember what their expenses are. The commercial rent in south Chandler isn't exactly the cheapest in the world. Especially in a hot area like Germann/Queen Creek Rd and Gilbert. So of course you're going to fork out a little more money than say a restaurant in west Mesa. 

They're a new restaurant, they informed me they have only been open for 4 months. They're still trying to get the flow of everything. I was on my lunch break also, so I wasn't exactly there on my own time. I got my food and drinks and FINISHED EVERYTHING within 30 minutes. That's as quick as it is at Saigon. 

So for you guys reading the negative reviews on this place, I definitely did not experience any of that while I was there. I actually had a very good time chatting it up with another patron that was sitting at the bar with me. He said he has been going there since day 1 and he absolutely loves it (we also talked about other Vietnamese places throughout the East Valley and this place is on par with them.) 

Again, I highly recommend giving this place a shot. Make sure to have an open mind when going in that they're new to the game and that this place has a ton of potential. I see them rising to the ranks of Saigon and Chandler Pho.

Keep it up AZ Pho and Grill."}
{"text":"We love Vietnamese food and one of our friends recommended this place. We've been to different Vietnamese restaurants and by far this is the most beautifully decorated and the cleanest we've seen. The staff was friendly and knowledgable. We got the AZ Pho sampler for appetizer and it was beyond our expectation. The spring rolls were fresh and the peanut sauce was so tasty. The egg rolls had this wonderful smell and tasted so good. The coconut shrimps were fresh and just perfect. 
Our server recommended Pho and yellow noodles with shrimp, chicken, pork and quail eggs, which I don't remember the name. They both were very tasty, especially I never had the yellow noodles before and they were exquisite. Overall we enjoyed our experience thoroughly and will be back soon to try other dishes."}
{"text":"I went to AZ Pho & Grill for lunch today.  Initial impression - this is one of the cleanest Vietnamese restaurants - no, the cleanest, period.  Pho was fantastic.  The broth was tasty.  The meat (beef) was lean.  The basil, etc., were clean.  What more can you ask for.  My lunch mate - who has been missing Pho Au Sen - really liked her bun.  The bbq pork was lean.  The summer rolls were freshly made.  Everything was there.

There are some reviews complaining about slow service.  We did not find that to be the case.  This place has been open only a few weeks.  I presume any kinks, if any, in service has been or will be worked out soon."}
{"text":"Absolute worst service.  No one was in there yet took 15 mins for someone to take my order.  Didn't even get water brought to me until I asked. Counter tops hadn't been cleaned at bar even dishes were still on them. The dishes sat there from the people before for over two hours (no joke). Never got asked how my food was and no one ever offered a refill for my water. I would have ordered a beer but never got approached once food was served.  Had to request ticket. Over price pho which isn't authentic. Such a waste of time and money"}
{"text":"Excellent menu choices with large portions. Service was friendly and perfectly willing to accommodate diet restrictions. Grest choice for a quick lunch or not so quick dinner."}
{"text":"Disclaimer:  I am not of asian decent. But growing up in the PNW I love all things Vietnamese food offers. Including Pho, Banh Mi Sandwhiches, Spring rolls etc. The thing I like about Pho establishments is that a number 2 is the same all around the country. The pho was great and the flavors well balanced, not hiding under bubbling salt bomb broth. The reason I gave it 3 stars is all of the 5 times I've been there, the service is unfriendly and cold and have to wait a long time. I have tried all 3 banh mi sandwhiches look like subway and they are gross. Very thin mystery lunch meat with BBQ sauce. This should just be a noodle house. Pho is rare in Arizona, so I'll keep going but I hope this review helps the owners make changes because if there is another Pho opening, I will switch."}
{"text":"I eat here several times a week. Pho and fried rice is great. Not the cheapest food and the service can sometimes get overwhelmed when they are busy. It it's a great food spot."}
{"text":"Went for lunch.  Had a seafood soup.  Friend had a pork sandwich.   Both were quick and excellent.  This places ambience is great!  Would  recommend  to anyone."}
{"text":"Awesome pho.   It has a nutmeg / jerk sort of flavor.   Super fast and the staff was very friendly and made suggestions.   I also had the appetizer combo.   The coconut shrimp was delicious."}
{"text":"I love this place! Delicious Phó and the atmosphere is relaxing! Every time I go there the employees are happy to serve! I recommend this restaurant!!"}
{"text":"I recently moved down to Arizona from Colorado and the one thing that I thought I was going to miss was the Pho. Then, I saw AZ Pho & Grill as I was driving and pulled up the reviews and the rest is history. I have been there three times and every time they get it right, one thing new that I have never seen was the veggie pho which is delicious and fresh (baby bok choy, broccoli, carrots,etc). The place is super clean and great customer service."}
{"text":"Pho-nominal Chicken Pho! 5 stars, and delicious spring rolls w/shrimp, peanut dipping sauce is the bomb.  Can't wait to eat at this gem again in near future"}
{"text":"After traveling to Vietnam I'd say this is the best and most authentic Vietnamese food I've found in the east valley. Very fresh, extremely reasonable in price, and large portions. Clearly family run.  On this busy night every family member was hustling to give great service.  Very pretty and upscale on the inside with a full bar.  Worth the drive from NE Mesa."}
{"text":"Yum! Our favorite pho place! Embarrassed to say we go almost once a week.  Clean and delicious and the service is great."}
{"text":"My boyfriend and I love stopping by this restaurant every time before I head out of state or just for dinner! our favorite is the N4. Bun bo hue. the broth is really something; fish sauce, crispy fried onion that adds to the aroma, taste and flavor. not to mention, lemongrass taste, and don't forget to add the vegetables, it helps give that crunch. other then that, service is on the slow side during week days, as oppose to weekend night's."}
{"text":"The very first moment I walked in I saw the\"please wait to be seated\" sign but I saw this really good seat for 3 and sat down. Then the waitress walks over and says \"you can't sit there\" I asked if there was a problem with this seat and she replied\" no you no sit there.\" I never saw such a disrespectful waitress and when we moved they were looking at me and mumbling. I know they were talking about me because one of them pointed at me. I have one last comment/question. Did their parents ever teach them that pointing isn't nice?"}
{"text":"Arguably one of the top 5 Pho places in all of phoenix. I'm vietnamese you can trust me on this lol. In fact i think its on par with some pho restaurants in little saigon down in southern california. Portion size is great, soup is great, meat is great. What more can you ask for from pho?

Go ahead, if you live in the east valley this is the place to go. Better than any of the restaurants near the asian supermarkets."}
{"text":"All I can say is AMAZING!!!!
I know people use that word so much, but in this case it's TRUE!!!  Not only is the food so healthy & delicious , the staff is friendly & knowledgeable!!
I will definitely be back!!"}
{"text":"First time here. Food was decent. Service was really nice. The atmosphere felt great. I orderred Pho Ap Chao thinking that it was the traditional flat rice noodles stir fry in sauce with veggies and stuff. Turned out that it wasn't, and they happily replaced it for me for the style that I wanted. My friend who went with me got Mi Quanh and she said it was really good too!"}
{"text":"HIRE MORE SERVERS OMGGGGGGGGGGG

Pho is supposed to be quick. I don't understand why it takes more than 30 minutes to take an order and serve the dang food!!! 

Food was taking way too long so asked for togo but they forgot the things I asked them to include when they knew we were leaving early because we were in a rush. OMG..... So frustrating"}
{"text":"Place is nice enough, ambience was good...but I'm not here to eat the ambience. We ordered a variety of dishes including Pho, Bun, and another noodle dish. All the food was very bland, even their fish sauce tasted like it was watered down. 

Service was slow as well, although the servers were very nice. The place wasn't packed but yet everything took forever. There were no utensils on the table, no napkins, and no condiments (hoisin sauce and sriracha). Every Vietnamese restaurant has these items on every table. 

The only thing that was good was the coffee jello we got for dessert. 

This place is closer to home, but I'd rather drive a little bit further and go to Pho Chandler...that place is good."}
{"text":"This place is awesome. Came here as after a recommendation from a friend and have gone two weeks in a row. The vermicelli noodle bowl was really good, just make sure you are adding the fish sauce and a little peanut sauce, otherwise its dry. I added a little Sriracha because I like my food to have a little kick. The second time I ordered pho and i have to say it was pretty good. Portions are really good, I was able to take some home that I ate later that day. Its near me, so I will definitely be back!"}
{"text":"Place was VERY clean and service the Friday evening I went was VERY fast and friendly. That is why I gave them 3 stars instead of two because the food was only fair. The egg rolls were good (but not as great as what you can get on the street in NYC), the charcoal grilled pork roll tasted good, with a nice combination of vegetables but the pork part was strange. These are not like Chinese pork egg rolls. The pork looked like a slice of SPAM or turkey pastrami or some kind of imitation bacon...not at all like the pork you would see on a good spare rib. I had the seafood pho with sour broth. Not too impressive. 2 small shrimp, a few tiny scallops and mostly imitation crabmeat \"seafood legs!\" like you get in the supermarket. Noodles seemed hastily thrown into the bottom of the bowl in a tightly wound birdsnest. And no veggies in the mix other than some bean sprouts given on the side. I knew it was going to be spicy, but they overdid it on the cayenne. They did not ask HOW spicy I wanted it (mild-medium-hot). Based on their professional attitude, I might give them another chance and try some other things there in the future."}
{"text":"Great food. Love the PHO and many awesome appetizers. Also serve alcohol. The only problem is the wait staff is very slow. The are friendly so I try not to get to upset. Overall it's a good place for some tasty food that won't break the bank. We Go back often."}
{"text":"My family and I had dinner at about two weeks ago. My daughter did not finish her steak pho, so we took it to go and I had it for dinner the next night. The pho had a very large meal worm in it. I immediately sent them an email asking for a refund and reporting what happened, but got no reply after two weeks so I have come here to leave my review and make sure others know that they might have more protein in their pho than they planned on."}
{"text":"Always like coming here. Let's be clear I love PHO! There ingredients are always fresh, from the veggies to the meats. I almost always get the veggie PHO as it's my jam and once again didn't disappoint! I use either chicken or beef broth as I am not vegetarian. Bowl size is generous, it's served super hot (which I love) and has all the accoutrements (jalapeño, sprouts, line, basil). We got the spring roll app and it's great. This place is pretty darn good and I always FEEL good when done eating here. I have not had everything on the menu but have enjoyed everything I have gotten here."}
{"text":"This is a fantastic place to grab a quick AND FILLING meal! Stopped by AZ Pho & Grill on my way home from work because I was really craving a Bahn Mi, and they did not disappoint! Because I had never been here (nor had I tried any Vietnamese restaurants since moving to AZ In march) I wanted to try their Pho as well. So I ordered the BBQ Pork Bahn Mi and the Brisket Pho (regular size) both to go. The service was really fast, I got my food piping hot within 10 minutes of ordering, and was out the door! I drove hope as quick as I could (carefully as not to spill the broth) and was pleasantly surprised that the Pho broth was still SUPER hot when I went to pour it into my bowl. 

The BBQ Pork Bahn Mi was a really tasty sandwich and something I could see myself ordering frequently. The bread was a little less crusty than I'm used to, but it was nice not to have it cut the roof of my mouth as I have with Bahn Mi sandwiches in the past. There was a really good amount of tender and flavorful pork on the sandwich and bonus points for NO weird chewy bits or extra fatty parts. My ONLY complaint with the sandwich is that the pickled veg on top was not sour enough, it was almost more like a sweet pickle, which combined with the sweet sauce they put under the pork (delicious by the way) was ALMOST too much sweetness. 

The Pho itself was really really flavorful. My wife said delightedly that \"it tastes like Christmas\" which was a complement especially since it was her first time ever trying Pho. The Brisket was really tender and full of intense Beef flavor, however next time I'd be interested to try something a little less intense in meaty flavor as I think it covered up some of the delicate flavor in the broth. 

I absolutely loved that they send you home with all the accompaniments in separate containers so that you're able to add things based on your preferences. I ran out of cilantro and onion, but that's just because I like a bunch in my pho. 

All in all this is definitely going to make the rounds into our regularly visited restaurants, and I know I'm going to be back soon to fulfill another craving!"}
{"text":"I have been coming here whenever I am in town. I usually order the Pho Ga or the Pork Fried Rice. Service is good, servers are friendly. Food is usually always promptly served, hot and tasty. Seating is plentiful and the restaurant is decorated with a quirk. However, I recently ordered the Pho Ga and the chicken was very rubbery and smelled old. I was quite disappointed. I hope the chef hasn't changed the menu or quality of food."}
{"text":"I came here for Pho... and I had it. It was good, but nothing to rave about. I guess I just don't have that craving for fishy soup. Ever. But when I do, I keep getting unimpressed. One could argue that i should stop eating Pho if I don't like it - but it's not that I do not like it, it's that I keep expecting to feel the Aha-moment that a lot of Californians seem to have been blessed by. I also realize that Pho is flavored by, to the western eye, strange things like tendon. Am I suppose to eat it, or it's just suppose to sit in the bottom like my personal bowl-kraken? Hoping not to disturb it which my wild amateurish chop stick-fu, in which point it'll fling up it's fattiness onto my spoon.. and heaven forbid into my mouth. Because that happened. As traumatic as it was, maybe this is part of the experience... I simply do not know. Maybe one day I understand why this is supposed to lurk under the surface of my soup and make me pay full attention to what I am fishing up, ready to be identified before attempting to being devoured. 

The place was clean and the service was absolutely OK."}
{"text":"I am so impressed with this Vietnamese place!!! Originally from CA, this Asian gal knows her Asian food and when I first moved to AZ about 10 yrs ago, the only foods I liked here was American and Mexican. After trying AZ Pho & Grill, I can add Vietnamese to my short list of cuisines that I love in AZ. I ordered the Steak n Meatball Pho and the Egg Noodle with Beef. I am not even kidding... hands down these two dishes might be the best I have ever tasted... EVER! This restaurant could be in Little Saigon in Westminster and it would still make money!!! This place is so yummy!!! If you have not tried their Pho or Noodles or Anything, you are really missing out!!!!"}
{"text":"I have eaten at many pho restaurants throughout the valley and this has to be one of the few that I can call legit! Was told that they had opened two weeks ago which brings up the reasons why they don't have selected items such as boba and smoothies yet. I ate here with my family and we had ordered the beef sandwich and pho as well as the shrimp and pool rice plate (R6). Everything tasted very delicious and was surprised how they freshly squeezed my daughters lemonade. The staff was very attentive and polite. Definitely coming back and hoping they will have smoothies soon!

Wish I could I give a 4.5!"}
{"text":"A nice and clean place. Friendly staffs. 
The Pho broth has lots of flavors.
Beef cuts are very thin and fresh.
Really good marinates on the chicken and beef.
These are my rating: 
1. Mi Quang
2. Pho special
3. Vermicelli combo (chicken+ beef+shrimp)
4. Chicken sandwich"}
{"text":"This is a beautifully decorated restaurant with extremely fast and friendly service with delicious food to boot! I had the Vermicelli with Grilled Shrimp and Grilled Pork ($9.50). It came in a very generous sized portion filled with cucumber slices, lettuce, bean sprouts and onions. I really liked the marinade on the pork, it was flavorful and delicious. I was in and out of there in less than 20 minutes! I saved the rest for dinner that evening. :)"}
{"text":"I loved their food. Their \"Seafood Pho\" is the best."}
{"text":"For Pho in Chandler Arizona this is it. It's got the best pho with a big plate of do it yourself add ins for a really good price. I get the large but it's enormous. The regular is very filling. The ambience is very beautiful too for pho. It's a very clean newer restaurant. The staff is fantastic and helpful. Very much recommend this place and will always come back!"}
{"text":"I'm a little picky when it come to pho. This place is good. The atmosphere is good and the waiters are nice."}
{"text":"Good food the service is good but could be worked on a little the egg rolls are delicious I ordered the chicken pho tender  meat definitely coming back :)"}
{"text":"I love their Spring rolls! Tastes so fresh. They are all about customer service food is on point. The owners are very friendly. The pho was so good I got the steak and flank! Check this place out you won't be disappointed!"}
{"text":"My husbands and I love pho, and we are always looking for good places. We probably have been to more than 7 pho places in the valley, such as Cyclo, Chandler Pho, Saigon, and others, but AZ PHO & GRILL has by far the BEST pho broth. It is very tasty and well done. The spring roll is also really good, but the peanut sauce is truly the BEST.

I think this is my first time writing a review for a restaurant, and I really believe they deserve the best review. Yummy food! Awesome treatment."}
{"text":"The food was very delicious and the service was superb! My family of 4 ordered: egg rolls, calamari, kids chicken fried rice, pork bahn mi, pho ga and beef fried rice. Everything we ordered was more than satisfying, large portions and very flavorful. Definitely returning!"}
{"text":"We had a great experience at AZ Pho! It was the first time I had Vietnamese food and I loved it! If you like Thai then you will like V food. The manager was very nice and checked on us a few times. Restaurant is clean and service was good. We will be back!!"}
{"text":"I'm from Washington state and I have had lots of pho in my life and this place the food it makes me think of home. I love it I will be back for more."}
{"text":"Although I really like atmosphere here more, I prefer the food at the Gilbert location. I ordered the Bun Bo Hue which is a spicy beef noodle bowl.  It tasted like the pho broth just with different noodles and meats in it. Very disappointed in that.  Also, this is the fourth time they ran out of boba..."}
{"text":"I was excited when I saw that there was a new Pho place in town! It was very good! I especially liked the Bánh mì! The cost was a little more than I anticipated though."}
{"text":"Amazing food quality and price. The restaurant is very clean and organized. Will definitely come back for the amazing Pho. Only negatives are the staff don't really check on you so you have to flag them down and the Vietnamese ice coffee is hard to pour into the ice cup without disaster."}
{"text":"I ordered the pho with oxtail. It was some of the best pho broth I've had in Phoenix. Lots of anise flavor. However, the oxtail was a little tough. Next time I'll get the steak pho."}
{"text":"Came here on a rainy night, had the pho bo. The atmosphere was very nice and the pho was delicious. I have never had a pho with broth that I haven't had to add siracha, chili paste etc. The broth had a strong cinnamon taste and at first it was odd but once I added lime I found that the broth was perfectly balanced and satisfied all of my cravings.  Our service was a little spotty (they were very busy and didn't seem to be properly staffed)  otherwise this place easily deserves five stars. I can't wait to go back!"}
{"text":"The food is delicious if you can tolerate the terrible service. The broth has gone downhill but my kids swear they have the best fried rice in town."}
{"text":"I have contemplated coming here for a while because of the area... I didn't think it was going to be very authentic... I am glad I came this chilly day, I've been sick for three weeks and just wanted some really good broth hoping it would make me feel better. I always order egg rolls because I love a good egg roll and they had a good egg roll... only thing so wish was with it was more lettuce and some of that pickled daikon radish- my favorite to wrap an egg roll in. 
I got their P1 special and it had an add a side of veggies option... now I have never done it before but like so said I have been so sick and I just wanted some hearty flavorful soup so I had the veggies added to my pho.... the soup was beautiful and the flavor blew me away....it was so flavorful that my heart felt immediately happy and the burning in my chest from my cough subsided long enough to enjoy the hot bowl of soup.
I ordered two bowls to go for my family at home who I left behind lol... and I am definitely coming back here."}
{"text":"Very nice atmosphere inside. Very good decor and overall cleanliness of the restaurant that I could see. The food was excellent, we had the rice grilled pork chop and BBQ pork sandwich, and spring rolls. The staff was very nice. The price was reasonable. Overall great experience."}
{"text":"I Love  This Place! The portions are large, food is fresh and prices are reasonable! I'll be back at least once every 2 weeks!! Happy to see a good Vitnemease Resturant on this side of town."}
{"text":"Pho is OK. Ambience is nicer than many Pho cafe. 
Not crazy about the Banh mi since regular mayo was used on it, which is fine, but please don't call it Banh mi. For great flavor of Banh mi, go to Urbanh Cafe. It's a little bit of a drive from S Chandler, but I promise you will be pleased with the fresh, authentic flavor and good portion size."}
{"text":"This is as my first time here and decided to order the goi cuon (spring rolls) and bun bo hue (spicy beef noodle soup). I would say that the goi cuon was okay. I've definitely have had better and the price for them were a little more pricey than average. My bun bo hue was decent as well. My meats were very tender which I liked. The soup base could have been more flavorful but I also put into consideration that most places in the US \"Americanize\" foods so they aren't as authentic. The service was really good. My waitress was really nice and always made sure everything was ok. Overall, I was say this place is decent, and would consider coming here again."}
{"text":"The best Vietnamese food in the valley. Not only is the food delicious, their portions are very generous. I had the Chicken Vermicelli bowl and the wife had the Pork/Shrimp Vermicelli bowl and man, they were amazing! Also, compared to other Vietnamese restaurants, the prices were very reasonable. 

The restaurant is nice and clean, with a full bar and two TV's. The staff was extremely nice and welcoming, which made for a nice experience. 

I will definitely be back. Often! 

This place is 'Primetime'!"}
{"text":"Got take out and it was fabulous. Pho was amazing, I had the traditional with meat and meat balls. Also had the pork and shrimp spring rolls. They were also great. Next time I will stay in the restaurant to eat, as it was super clean and had a very friendly staff when I went to pick up my food"}
{"text":"Wonderful food we got the az grill sampler everything was fresh and tasty ..... skip the chicken wings (old and double fried reason for 4 stars) Pho was amazing so much flavor and portions were huge !!!!"}
{"text":"I'd rate the P7 Hot & Sour Seafood = 2stars. Shrimp was the only real seafood; all others appear imitation.

V3 Vermicelli with Grilled Chicken/ Pork/ Beef and Egg Rolls -- was very good (instead of beef I asked for more chicken) = 4 stars.

A co-worker said her S3 Grilled Chicken Sandwich was very good.

I'll stay away from the seafood altogether unless it is shrimp."}
{"text":"So glad this place opened! Can't wait to come for lunch all the time! 

The staff were all very attentive, and we were in and out of there in 30 minutes... I love a fast lunch. The pho is awesome, can't wait to come try more on the menu soon. 

Bonus points for playing nature documentaries in the restaurant, totally sold."}
{"text":"Love the food, especially the Pho. Everything is very fresh and flavorful. The service is prompt and everyone is very friendly.  After relocating from California where there were plethora of Vietnamese Restaurants, it was a challenge to find good Pho. This place has it!"}
{"text":"I just had my third bowl of Pho here in the last two months. Fantastic! Best Pho in the valley for sure."}
{"text":"Mmmmm best broth ever made with six spices, served with plenty of noodles and big pieces of meat.  Great value!  Quality food, well prepared and healthy...the trifecta!  If you order something other than pho remember it might take a little longer.  They are currently trying to hire more servers, so if you know anyone....  Look forward to their opening the patio soon but now they have a full bar.  Nice atmosphere, clean shop and smiling servers - I'll be back soon and so should you."}
{"text":"The Pho here is not that good as other Vietnamese Pho from other places, also it so expensive with they try to charge you $1.50 for extra, but their bowl still smaller than other places! I come here one time and compare to other Pho places in this area and i won't ever come back here for another bowl of Pho here! Thank them for first and last time...!!!!"}
{"text":"One Saturday night, my wife and I happened to out a bit later than we usually are, and we stumbled across this new place not long after they had opened.  Our experience wasn't all that grand, so much so that we've never gone back.  The food was a bit pricier than what we'd normally paid, but -- ever curious -- we gave it a try.  While it was \"good,\" it's safe to say that we'd definitely had better AND at much more affordable prices.  It just didn't distinguish itself as all that different from Pho-style eating that we'd had before.  Wait staff were only OK; they weren't especially attentive, and a few of them seemed to be standing around gabbing with one another more than paying any service to us.  Sad.  Probably won't go back."}
{"text":"Ordered the brisket pho, fried tofu vermicelli, and lemongrass chicken for takeout. Unfortunately, the food was so bad we ended up throwing it away. Vermicelli noodles were dry, fried tofu was bland and squishy, chicken lacked flavor, etc."}
{"text":"Although I believe there should be more waiters, the food was very enjoyable. I ordered the pop stickers (dumplings), and I couldn't get enough. I highly recommend this restaurant if your not in a rush and just want to sit and talk."}
{"text":"We were the only people in there today.  Building interior is lovely. Our waitress was nice enough and attentive.  Food came out very quick, but our egg rolls were cold and they only give one piece of lettuce for two egg rolls.  We sent them back and asked for hot egg rolls. Shortly after our pho came out.  It was just okay.  Nothing to get excited about.  Then the fresh, hot egg rolls came out and they were bland.
With so many other options for pho nearby, we will choose one of our other favorites next time."}
{"text":"As good as the pho places we frequented while living in the Bay Area. I always pair my pho with their mango boba. So good! We order food here at least every other week. We don't get tired of it!"}
{"text":"This place has good food,  but the staff seems like it's their first day on the job every time.  I have been here 5 times,  and 2 out of the 5, I've had good service.  One edgy waitress with short, purple highlighted,  hair knows what she is doing, but seems to only work day shifts. The others don't seem to have a clue.  Even the owner looks flustered all the time. Not only do we always sit for about 10 minutes (one time for 15, even though we were one of 3 tables sat in the whole place!) before anyone asks us what we want to drink,  but they constantly forget to bring what you've asked for throughout your meal. I finally told one server that he should probably write stuff down.  So frustrating because their pho is delicious and so close to my house! I'll probably keep going back though and deal with their slow & forgetful staff...  It's not like they are rude, they're just oblivious."}
{"text":"Good Pho, a little light on the meat but a great presentation and taste. Really great portions for the price. The spice was great and ambiance was very clean, especially for a Vietnamese restaurant. I hope they last. I really enjoyed the food!"}
{"text":"Delicious food without the long wait! Meals are ready to go within 15 minutes. Ample customization options are available to meet everyone's preferences and dietary needs. 

I love the vermicelli dishes - grilled shrimp is the perfect addition. The side salad that comes with the vermicelli is great--super fresh and crispy vegetables, with decent variety. My husband enjoys the fried rice dishes with tofu and chicken. 

Fresh ingredients, quick and friendly service, great location, what more can I ask for?"}
{"text":"Very delicious and nice environment. Our family eat here so many tinmes and love the food here. Strong recomend..."}
{"text":"I had the egg roll, wow it was delicious smell good taste good. I also had the Pho combo which has meatball, slices of rounded eye steak and tendon and more i couldn't remember all, but it was good and Pho is their house specialty. I also heard that their house specialty is Quang noodle as well so i think i will try it next time.."}
{"text":"I had not explored Vietnamese food very much other than Vietnamese spring rolls. The nice waiter gave me a few recommendations and I decided on the Chicken Breast Pho. I was not disappointed. The meat was tender the flavor of the broth amazing. There was something spicy I couldn't  identify but that gave a little zing to the broth but not to much. The Pho was served with a plate of garnish, lime, basil, jalapenos and bean sprouts. I opted to add a little lime and the sriracha that was on the table. I will be coming back. As for the restaurant itself. It is clean modern with very nice servers. The owner even came over and talked to me for a few moments about Vietnamese Cuisine and made recomndations for the next time I visit. Great experience."}
{"text":"The pho broth is awful and the spring rolls were not very good either. Service was ok.  The restaurant is clean."}
{"text":"Food was excellent. Start to finish. Pho is the best I've had in town. Plentiful, flavorful, fresh. The egg rolls were good, but the spring rolls were fantastic! Atmosphere is quiet and clean. The wait staff is courteous and prompt - not at all in your face. Highly recommend this restaurant. Looking forward to our next visit!"}
{"text":"Very good food. Excellent service but I found hair in my pho bowl that was sticking there on the side until I ate half of my pho... They comped my meal and apologized but when the cook came out, she wasn't even wearing a hair net. They are a new restaurant and aren't even following food safety. I felt like it wasn't the manager or the server's fault but the restaurants really have to be careful. Who knows what chemicals or anything that could have been on that one strand? Anyways, i would have loved to go back but after that experience, no thank you! I am debating to call an inspector on them..."}
{"text":"i was in town visiting, this was my first time here. nice atmosphere. service was ok, could've been better. I got the veggie pho &it def needed more flavor. what my family ordered was very tasty although they were out of the ox tail soup my aunt was wanting to order. we went at lunch time on a saturday, no wait at all but it started getting busy as we were leaving. i didn't get pictures but the thai tea &taro boba was delicious!!"}
{"text":"Incredible Pho. My first time here and I ordered the Veggie Pho. I added an extra side of pickled white onions to mine. Super yum. I found this place because it's close to Banner hospital and I wanted something fresh and authentic. Needless to say, the hospital menu was out of the question. Service is good. Atmosphere is good. Clean, light, airy and good vibes. I'm here at an off-peak hour (4pm on a Sat) so not sure how busy this place gets."}
{"text":"Visiting Arizona for the first time. This place was hot and new so thought we'd checked it out. Overall very impressed. The place is super clean! The declarations are tasteful. I know most Viet places can be over the top but this place is spot on. Photographs very well chosen. Having been to Vietnam it brought back some fond memories. We came for lunch. Started with spring rolls which were fresh and delicious. The peanut sauce was phenomenal. Had vermicelli with grilled pork and \"noodle soup\" (hu tieu). Grilled pork was nice but the red pork in my hu tieu was dried. There aren't many options but the ones they have are good. The prices are a little high for Viet foods but I also come from a city where there are lots of Vietnamese places so I suppose when you're one in a few you can charge as much as you want. Our server was pleasant. I didn't catch her name but appreciate that the service gestures are there."}
{"text":"Have military discount on meals very nice quiet restaurant, fried rice with shrimp is very good and the Pho was exactly the way it should taste.  Perfect, great taste and good price"}
{"text":"Stopped in last night to check the place out because I wanted some Pho.  Everything was great and definitely will be back. The Pho was awesome and service was good.  Best Vietnamese place on the East side."}
{"text":"Amazing Pho!!!   I was almost drinking the broth with a straw.  Lol. 

The vermicelli bowl was outstanding as well.  Will be back for the bahn mi sandwich this weekend.  

If you like pho, try it here."}
{"text":"We waited 15 minutes for water and almost an hour just to get out food. Let me tell you, this place is not worth the wait! The food is expensive and mediocre. Service is slow... it's bad."}
{"text":"This is our favorite Restaurant lately to eat noodle soup if we need a Pho fixed. The restaurant is clean and modern and the staffs are usually attentive and friendly. I got what I wanted and it tasted good. Happy customer here. I only notice you get more service on the weekends vs a week night. The last time I came here I had to fill my own water. No biggie is Tuesday!"}
{"text":"Back in the middle of July I wanted to try Pho Chandler.  Guess what?  They were closed for their summer vacation.  So we drove on over to AZ Pho & Grill and gave them a try.  On our first visit we sat at the bar and ordered the BBQ pork & shrimp spring rolls and we each had a vermicelli bowl.  Mine had pork and an egg roll and my husband got the one with pork, egg roll, and shrimp.

Man, those shrimp are good!  After I swiped one of his, you know I get them for myself now every time.

We really enjoyed the fresh food in large portions and the classy and comfortable atmosphere of the restaurant.  They have a nice bar area and the interior is in cool colors, which is very pleasant when it's 115 degrees out for sure.  On that first visit our server/bartender was very friendly and helpful when we had questions about the menu.

Since then I've been back several times for takeout.  I can call as I'm leaving work and it's ready for me when I get there.  Every single time the food has been fresh and delicious.  And every single time the staff is friendly and helpful.  I really can't think of anything negative to say.  I've been ordering the same things almost every time, the spring rolls and noodle bowls.  Once I got the appetizer sampler which had 2 spring rolls, 2 egg rolls, and 2 coconut shrimp.  That was a nice variety and, with a noodle bowl, a huge amount of food.  I took a big nap on the couch after that.   We need to go back and be more adventurous and try some other dishes.  Overall, AZ Pho & Grill has become a nice regular stop for us and I always look forward to a return visit."}
{"text":"I love pho and I love not having to drive very far, which makes AZ Pho perfect for me! I'm so glad I don't have to go all the way out to Mekong area from where I live, to satisfy my pho cravings anymore!

Every time I've come here there's been no wait to be seated, the service is on point, and the food is delicious! I usually get the steak pho, but lately I've been more adventurous, and have tried the crab stew as well as spicy beef noodles.. no complaints on anything I've had so far. While they might be a little more expensive than my other go-to pho spot, I really can't beat their location and welcoming atmosphere :)"}
{"text":"This is a dinner review:

We ordered our respective beers listed on the menu. Only three were in stock. We opted for water. We were told the menus belong the \"the other\" restaurant, wherever that is. Pictures of each dish on the menu would help. The food was average, if not less and overpriced for the quality/quantity.  

I ordered the \"N3. Seafood with Rice or Egg Noodle Soup - H Tíu Go hoc Mì Hi Sn $9.79. Ingredients were: Choice of rice or egg noodle with scallops, shrimp, mussel, and squid in chicken broth; garnished with chives, fried shallot, and fried garlic. It was more soup than substance. I requested a search party to find the scallops, shrimp, mussel, and squid.

They do not remove your dishes as you finish, which caused the table to be cluttered. They were slow to clean tables as customers left. We saw many dirty tables when we arrived, during and after.

Not sure if we will make a return visit."}
{"text":"I was feeling under the weather and was in desperate need of a pho fix. I ordered the chicken pho Togo and although I was grateful to have pho, it didn't live up to my expectations. The broth did not have a meaty flavor like authentic counterparts. It had a distinct cinnamon flavor, which I found odd and left me Unsatisfied. Pho thang is still #1 in my book...."}
{"text":"After my very bad experience in this place, I reluctantly agree to meet up my brother in law here because he likes the location. There were new servers here at this place, and I still saw the manager who was calling me out on social media for leaving them a bad review. Yet, I managed to ignore her and tried to focus on some family time. Despite the fact that I really dislike that lady, everything else was tremendously improved at this Pho joint.

Our female server was quick, friendly, attentive, and very humble. The SpringRolls were fresh, Canh Ga Chien was flavorful, and Pho broth was just great. The owner came by our table, and made sure everything was okay. Overall, I had such an improved experience. 

I can't say that I would come back to this place in the near future due to a very awful impression with that one manager regarding my original review. Yet, if anyone asks where to go for Vietnamese eatery, I would still recommend this restaurant."}
{"text":"Great place!  Great Pho!  Great service!  Tried about 7 places here in Phoenix area.  This is 2nd best in our eyes so far.  The bowls are smaller than what I'm use to.  Glad they have kid priced bowls for little ones. We will be back!"}
{"text":"So happy to have a Pho place near me! It will be nice to not have to go to Chandler or Mesa for a quick Pho craving! Ordered the P6, beef pho with steak, brisket and tendon. The broth had nice flavor and the brisket was tender. I would have loved more tendon though.  I enjoyed my meal and left satisfied. Though this is not the best Pho I have ever eaten, there are better in Chandler and Mesa, it was good enough for me to return again. Just happy that Gilbert is getting some cultural diversity!"}
{"text":"Average Price for (2): $32-38

Full Review Coming Soon!

We typically get (2) pho bowls and the grilled steak appetizer (A11).  The app is amazing...tasty and grilled just right.  The pho is incredible, fragrant and flavorful.

Service has been hit or miss."}
{"text":"Seriously so good! I have not had a Pho that was this good EVER! It was perfectly spiced and not to salty. My boyfriend had the sandwich and could not stop talking about how much he loved it. We will definitely be coming back all the time!"}
{"text":"The steak Pho was amazing! Really tender meat, deff not chewy like I've had before at diff Pho places. Great atmosphere for the fam. Ordered some egg rolls, shrimp&pork spring rolls which are amazing too. And don't forget they also have Mochi ice cream and amazing smoothies with boba or fruit poppers like lychee or passion fruit. Overall amazing service and great Pho!"}
{"text":"Food is good. I would give it 4 stars, but service is so slow. We spent most of time waiting. Even waiting for the check."}
{"text":"We've ordered takeout? from here twice now but have never stayed for a meal. Service is always friendly and attentive, while the decor and interior are? clean and appealing. Standard chicken with rice is good, but not as flavorful as we're used to in Hawaii. Good grilled taste but prefer more sauce to flavor the rice. The Chicken stir-fried? with lemongrass was quite flavorful and tasty; we would order this again. We will continue our search for \"THE\" best Vietnam restaurant here that wows our palette?."}
{"text":"Had a try here today. Foods are ok, the restaurant is not very busy. I like its quiet ambience. But there was one thing bothering me that the staffs laughed, talked and joked each other when working. So sad!!! Wonder why the manager didn't say anything."}
{"text":"Going off a few reviews from my Yelp friends, I was pretty excited to explore a pho spot whenever I am geographically misplaced in the outskirts of civilization. Anyone who lives here knows that the cross streets of Gilbert & Queen Creek is borderline BFE or the welcoming gate to it. Sweet mother of GPS....thank goodness I know my way!

Perks is that with your check-in, you get 10% off your bill so I was starved and ready to go to town. Construction may deter you but once inside, it is a lovely spot; more upscale than the usual Pho dives. Despite arriving after the lunch crowd, we still had a wait and I noticed tables weren't being turned over as quickly. The menu is extensive and I was even more excited to see they offered a variety of boba teas.

With that said, I think pho is really a matter of taste preference. I have one spot that I hold as a litmus test for others to follow suit. Needless to say, I was disappointed. The pho broth was decent but not where I wanted to be a neanderthal and slurp up the bowl (mom's idea of litmus test); I also prefer my veggie plate to include jalapenos and lime with the usual bean sprouts and basil. The noodle salad bowl was very generous if you're into eating a lot of rice noodles. I am a meat eater and picked the combo of grilled shrimp with pork and egg roll. The egg roll and pork were not as flavorful and crunchy as I prefer.

I can't say that I would make a trip back here unless I ran out of gas and needed to find nourishment until help arrived. But then this isn't a deserted island and I am a foodie with a discerning Asian taste bud."}
{"text":"First time trying Vietnamese food and have to say we enjoyed it. Came for dinner late and the place was packed; now we know why. Tasty food with attentive service and spotless environment. We tried the Vermicelli bowls with spring rolls and really enjoyed the change of pace."}
{"text":"I noticed AZ Pho and Grill opened up as I was driving down Higley and thought I would give them a try since the town of Gilbert seems to be lacking when it comes to Vietnamese food. As I was going over their menu they had all of my favorites so had to try them all. Pork/Shrimp spring rolls were awesome but the peanut sauce was not homemade which was a con for me. The pork/Shrimp vermicelli was huge and could feed two people and was mediocre as the grilled pork was lacking in flavor but the shrimp was really good. I also tried their pork bahn mi which also had the same pork so was not a fan of that or the bun they used which normally makes the bahn mi good. Overall AZ Pho and Grill has great service, decent prices but just overall ok food. I am still on my search to find good Vietnamese food here in the East Valley."}
{"text":"The staff is awesome, they will make it, the broth is good, not great...but I'm  a snob, I lived right by little Saigon so most AZ PHO is not all that comparatively. But, that being said this place will do, and it is close to home."}
{"text":"Excellent choice for Authentic Vietnamese Cuisine.  Delicious and well prepared.
The combo plate as an appetizer was great and we also enjoyed the lettuce wrap with chicken and the fried rice plate.   All beautifully prepared.
The restaurant was well designed and comfortable and extremely clean!
I highly recommend this establishment !"}
{"text":"Good food,  not the best vietnamese I've ever had  (i eat Viet probably 6 to 8 tonnes monthly so take the 4 star with a grain of msg ...but it's location honestly its decent. Tried the pho broth,  only complaint needed Moore star anise ... got the egg cake,  shrimp and pork which was really good asking Witt the egg rolls.  It takes a lot fruitful a vietnamese restaurant to get 5 stars but,  if you're in the area there aren't any other viet joints so I suggest the stop in"}
{"text":"My hubby and I have had Pho only a handful of times but tonight we decided let's do it again. Have to say the service was good, the staff was friendly, prices were reasonable, and the place was clean and nicely decorated. The food was very very good, will definitely be back again soon"}
{"text":"I have had fried rice and pho from so many different restaurants not only here in The Valley but serval diferente states and I have to say AZ Pho & Grill is on the top of my list! I have nothing bad to say about this place!"}
{"text":"Love this new swanky Vietnamese place. Full bar plus tablecloths, excellent food and service. My new favorite pho place!!!"}
{"text":"Let's start with the service. I got to be honest, the service has always been good, but when they first opened, it was slow!  Since then, it has gotten so much better. I don't think they realized how popular this place would be. 

Now onto the food. I have had the steak and meatball pho, the egg roll and pork with vermicelli (bun), and the sunnyside-up egg and grilled pork and rice. All were very good. I would order them all again without hesitation. I've also had the milk tea with lychee popping boba. Sooo good!

So nice to have a decent Vietnamese restaurant so close to Morisson Ranch."}
{"text":"This was my first time trying Pho so I really have nothing to compare it to, but I thought it was great. I had the flank steak and my wife had the spicy seafood. I liked hers more, but mine was still good. This is a great place for first timers. Service was fast and friendly.  Restaurant was clean and modern. Manager checked in on us to see how everything was. You can tell that it is a well run restaurant and they take pride in what they do. Looking forward to going back and trying more of their menu."}
{"text":"This restaurant is not Second Amendment friendly. They have a large \"no gun\" sign outside the door. So, they have lost our business."}
{"text":"I was in town for business and I thought I would try out a local Vietnamese Pho restaurant.  

The restaurant is hidden away in a business park.  I almost went somewhere else because Google maps didn't drive me directly to it.  After a little driving around I was able to find it.

The interior is very nice.  From the floor to ceiling the restaurant was well thought out and nice.  I was quickly greeted and shown to my table.  

I order the appetizer sampler to start.  The spring roll, egg roll and coconut shrimp were all good.  I love the peanut sauce for the spring rolls.

 For my main course I order what usually order at Pho restaurant the Pho Dac Biet.  The bowl was a little smaller then I expected, but was packed full of noodle and meat, much more then any Pho bowl I have had.  The meat balls were the best I have had.  The steak and tripe were good.  The tendon was undercooked and uneatable (at least for me).  The broth was a little bland.  I had to use an ample amount of Hoisin, Sriracha, and jalapenos to bring the flavor up to my liking 

Overall it was a good bowl of Pho.  If the cooked the tendon a little more and brought the broth flavor up a notch it has the potential to be great."}
{"text":"This is one of the best pho restaurants we've seen in AZ. The interior is absolutely amazing and detailed in each area of the bar and tables. We ordered pho, boba and fried rice since we wanted diversity in our meal. The seafood fried rice was delicious and flavorful. We asked the pho to be replaced with egg noodle and the management were able to make it happen with no difficulty (excellent customer service) and the coconut boba was delicious! We always come back to this location to get our pho cravings! Absolute must for anyone wanting to eat excellent Vietnamese food."}
{"text":"This establishment does not let you substitute items on any dish and is very picky about their menu. Vietnamese food has a wide variety of ingredients and I don't believe you should limit your customers to specific items on the menu. Poor customer service for a brand new restaurant."}
{"text":"I could smell the food from the kitchen and couldn't wait for my food to come out... The spring rolls were a great starter, and the pho was noticeably fresh and tasty! I tried some of my dad's chicken, which was nice and tender.  The inside is unlike any other pho place I've been to, very aesthetic environment with nice lighting and a small bar on the side.  Staff was very friendly and will make sure your food is how you want it. The restrooms are very clean. This is a nice place all around, I would take a client out to eat here or take family for dinner.  Not to mention a great price! Very impressed, I will definitely come back"}
{"text":"Bad service.  My 13 year old daughter treated me out for dinner & we received the worst service.  I can't believe we paid the bill.

The restaurant is small and busy but its not like our waitress had a lot of tables to serve.  Our waitress didn't deliver our food nor did she check in with us after our food was delivered to make sure everything was fine.  If so, we would have told her that our pho had garnishes in it when we asked not to include the garnishes.  My girls had to fork out the garnishing.  Speaking of forks...we asked for chopsticks but never received chopsticks.  My drink went empty & was empty for a long time...we had to ask another server to fill our drinks.  Then, we had to ask for our check and a to go container for my other daughter who is eight years old & the waitress just handed her the container to fill the pho herself in which I did so she wouldn't spill her pho.  We were upset because the waitress was more attentive to her other few tables which we were next to the other three tables but she still failed horribly to provide us with good service...I still cannot believe we paid for that bill because our experience there was horrible."}
{"text":"The place was a comfy little restaurant.  The service was great and the staff seemed to be very welcoming.  The food was overall okay.  I can't say that the food was the best, but if you're craving some Vietnamese food it's a place you could check out."}
{"text":"We ordered the pho and grilled beef w/ Rice. The pho was good, the rice entree was just okay. I thought I would get thicker cuts of beef but it was super thin and grilled. Almost like the thin eye round that they put in pho, just marinated and grilled."}
{"text":"Food looked good but tasted decent, but there were nats and mosquitos flying around in the restaurant so it was difficult to enjoy. I had to stop eating my meal bc they flew into my food, was very disappointed."}
{"text":"I love Vietnamese food but it's rare to find one in Gilbert and close to the house.  I really wanted to like this place but left disappointed twice.  Although the atmosphere was nice and broth was pretty good, the prices are high for what you actually get.  I left hangry both times.  On top of that, they charge extra for putting meat on the side and the explanation was that they have to slice it extra thin.  It was 3 slices of meat.  Really? 
 And you don't do that if it's in the broth?  Ridiculous.  I will drive an extra 20 minutes to get something better."}
{"text":"Good but a little pricey. Very noisy place with the concrete floors. I think I've had better at some other less expensive places nearby."}
{"text":"Vegetarians beware!!! Veggie pho is made with beef broth staff will not inform you of this, even when everything you order is vegetarian. Absolutely disgusting, tastes like top ramen. Highly disappointed"}
{"text":"This was my first time here. So disclaimer first, pho is my single favorite stand alone dish. So my expectations are always pretty high when trying a new place. AZ Pho Grill did not disappoint! The base for a good pho is the broth, and their eye of round steak pho broth was probably one of the best broths I've ever had. And I've had A LOT of pho.  The balance ingredients in the bowl was pretty much perfect; not too much, not too little. But man oh man, that broth was good. I would have given five stars, but I can't because all I ate was the pho with a Thai tea. However, I HIGHLY RECOMMEND this place!"}
{"text":"Great week day quick meal. I have never been disappointed. The service is quick. Meals have always been flavorful and filling. My kids love the boba tea. We devour the pho and love the wide variety selection just in case you don't want PHO.  Have always enjoyed each and every meal and we dine here often."}
{"text":"Love the Pho here get the P2 each time I come by. Nice thin cuts of steak and the best broth! Always pretty busy except if you get in early for lunch, normally we order to go and enjoy at home. All items are. separated out and you just mix together in your bowl and enjoy"}
{"text":"Awesome, tasty Banh mi sandwiches, real deal Pho soups in a well decorated dining area. This is the prettiest pho place I have ever eaten where the taste of good food matches the decor! So worth it if you want wonderful Vietnamese food!"}
{"text":"Was glad to see a Pho restaurant open up close to us seeing we go once or twice a week. My wife had the Pho. She said it was okay but was not served hot enough. It was cold by the time she was half way through the bowl. The waitress suggested the Clay Pot Fried Rice. She stated the rice is crunchy around the edges of the bowl. I have had similar fried rice so gave it a try. When the waitress asked if I liked it, I said it was good but the rice was soggy. Suggested she not tell the customers it is crunchy. She said it should be, so I told her the cook doesn't know how to make it right and she should let him/her know. She just gave me the bill with nothing else said. I will keep driving a little further for better Vietnamese food."}
{"text":"Have been her a few times and their Pho is great, this time had a P4 , and their other dishes haven't disappointed 

Ambiance is different from the regular Pho restaurant, it fells more like an Italian restaurant, its very clean and servers are very friendly.

definitely will keep coming back"}
{"text":"Love this pho grill because it's always so clean and quick! Also love the fresh squeezed lemonade they offer!! I get extra veggies in my pho and they put everything from carrots to broccoli to celery. Highly recommend it!"}
{"text":"Great place!  The food is fantastic and the service is amazing!  My favorite is the pho with brisket. They always remember to bring me extra jalapeños."}
{"text":"Stopped by for a quick lunch by myself.  The place is hidden in the back of a strip shopping center along Gilbert Road.  Once you get inside it is quite pleasant with regular and bar style high tables which I like.  I had Spring Rolls and Chicken Pho, and both were very good.The Spring Rolls were ample size and the Pho filled me up as usual.  Would stop back again."}
{"text":"Nice environment but the food had no flavor. I got the grilled pork rice plate and was not please at all with it. They also forgot my shrimp when I got the combo plate. I also got the grilled pork spring rolls and didn't look like grilled pork that I always get from a Vietnamese restaurant. Was not pleased and will find an alternate Vietnamese place in the future."}
{"text":"First time at AZ Pho & Grill. Our first impression was that the restaurant is really nice but their choice of music and tv show was off. The place makes you want to fall asleep with the classical music going and the TV show of the deep sea is not amusing. The prices are reasonable.

I ordered the chicken pho and added on brisket. My girlfriend ordered the veggie pho. The broth was delicious;however, the brisket was over cooked and tasted terrible. I had to remove it from my plate to avoid eating it. They also only give you 1 napkin. We ordered tai iced tea which was delicious. 

The food came out fast and the waiters were friendly. I hope the owners of this location read their reviews as it seems customers have the same complaints."}
{"text":"We had the tofu spring rolls which were very good with just a hint of mint and very fresh. The beef and noodle dish was very good,as were the lettuce wraps that I ordered as a meal. There was a lot  of food  each portion. This restaurant is very pretty inside and the soft music playing is a nice touch! We will defiantly be back:)"}
{"text":"The pho here the last two times I have had it is super delicious. Not to mention the potstickers are made fresh, and will easily disappear quickly if you leave them out in the open.

One of my only complaints though is I didn't care much for the grilled chicken teriyaki... Not sure why, it just had an off taste to me. But I don't think it had to do with the quality of the food, just personal preference. 

If you're as cold as I am when it's 40 degrees and rainy out, I recommend their pho to help warm you up!"}
{"text":"I was really skeptical about this place because of the reviews here.  All the 5 stars were written by 1 or 2 reviewers while the elites had not so good things to say about it so I went into lunch here thinking it was going to blow like a lot of new Vietnamese places popping up in white rural neighborhoods.  

My first impression was it was clean.  Too clean.  Wasn't used to my peoples keeping a clean establishment.  There was soft music playing in the background, the full bar looked organized, the servers were smiling.  Totally not a traditional Vietnamese joint.  There was a freakin wine list!  Way too bougie for me.  No wine I know of pairs well with a bowl of rare beef pho.  

I ordered the spring roll and chicken banh mi.  My sister ordered the special pho.  The spring rolls were OK.  Wasn't anything special.  You can tell they were prepared earlier because the rice paper wasn't as tacky as if they were prepared on the spot.  When the entrees came and I bit into my sandwich I was shocked on how good it was.  I haven't had a good sandwich like that in a long time.  All the banh mi places here are crap.  The bread wasn't over cooked, the chicken was moist, and there's plenty of pickled veggies.  I could have used a little more cilantro.  I tried my sister's pho and the broth was solid.  The vermicelli was good and she got a lot of meat.  

Overall it was a good experience.  The service was excellent, food was good, and the staff said bye as we left.  I know that's corny to mention but again, my peoples don't do that.  I'd come back and if I get a different experience I'll definitely let you yelpers know."}
{"text":"The only complaint I have about this place is the slow service, other wise I haven't had a dish I haven't loved. We were very satisfied with our appetizers and our meals!"}
{"text":"Wow!! I've had a lot of Pho in my life, but this place is by far the best EVER! This is my new fav spot. Don't change a thing owners, it's perfect!! 

Food 5 stars
Service 5 stars
Ambience 5 stars 

We had the red pork spring rolls, P.1 and yellow noodle dish was exotic but flavor was  scrumptious"}
{"text":"There are few things that this place can improve, but the most critical one is the service. 
Whether there is a rush at dinner time or with just three tables in the whole place, the service will be equally slow and inadequate. I am wondering whether the restaurant owner ever ran another restaurant before or any of the waiters have work in a server job else where before. 
For example, we were sat besically right way, on an empty table. No utensils and no napkins. After we sat down for about 7 minutds, the server came by and asked if we were ready to order, we ordered \"water\" first. Then she grumpily came back with that. After our appetizer arrived, there was no plates or utensjls, which we had to ask for them again. 
The food is quite good, but the service need to be improved. I will come here on after a good day at work, otherwise my patience may run out and the dinning experience become much less pleasant."}
{"text":"Wanted check out this new spot. Support local business.

Service was a little slow but nice.

I was debating on a rice dish, but had to do Pho because it's in their name. I got #P1.

For the Large size, there wasn't enough meat or noodles, there was more than. enough soup though. The Pho itself was avg, you're not going to hate it, it is what it is.

Granted Im 5'10 170lbs and just got done working out, but I'm leaving the restaurant hungry and going to find another meal.

For $10 just for the special and no drink... Just not worth my time 

If other reviewers like it, that's great, but I wouldn't recommend this spot to anyone."}
{"text":"Amazing food , big portion , not expensive .. First time here they went above and beyond , clean , fast and friendly . 
4 big meals and appetizer all for under 40.00 . This is a place we will be back for sure , 
I eat vegetarian only and they made sure to go and help me . 
I highly recommend this place"}
{"text":"This is probably my favorite Vietnamese restaurant I have ever had. The service was exceptional, the restaurant was very clean, would recommend this to all of my PHO LOVERS!!"}
{"text":"I'll start by saying the food was great. The banh mi with BBQ pork was outstanding, spicy, and fresh. My wife's pho with tofu was also outstanding and had some of the best broth I've ever tasted. Their broth has almost a sweet spiciness to it that I've never experienced with pho before. The spring rolls and coconut shrimp appetizers were fine, but didn't match the quality of the entrees. Both were softer than they should have been, and the shrimp were ultra greasy. The main reason for the three star rating, though, is the service. While everyone was pleasant, service was incredibly slow. We were there at lunch time, but there were only two other parties dining. Still, my sandwich took about 20 minutes, and then my wife's pho took a further 20 after that. I also couldn't get someone to take my payment for quite a while. When we were trying to pay, all of the staff had disappeared to the back of the restaurant. I'd give them another chance, if only on the strength of the pho, but all in all, it wasn't an amazing experience."}
{"text":"Well another incredible meal once again here
Last time I had the spicy pho, and this time I had their incredible Lemon chicken lettuce wraps. Husband had wait he doesn't know what it's called but it was really yummy lol.. Nice and light with noodles ,chicken ,shrimp,bean sprouts cucumbers mint then sliced cucumbers and carrots with a fish sauce dressing  (vermicelli bowl )Some of the best Tea ever it's very refreshing. It's not plain and boring also not overpowering flavoring . very light and refreshing. Beautiful atmosphere .. don't let stripmall thing fool you it's very nice inside.."}
{"text":"First time in and we will be back.  Very nice space with attentive service.  Highly recommend the grilled beef rolls as a starter - delish and good portion.  I had the veggie Pho and added shrimp -  balanced light and fresh flavor.  Husband played it safe with beef fried rice (added and egg).  After the starter we brought food home for left overs.  Spied the bahn mi sandwiches and look forward to trying those on next visit."}
{"text":"This place was really good. My wife was in the hospital and it was an easy walk to get to. The spring rolls where a good 8.5/10. Very full. In two days I ate there twice and it was great. They had a lot of really good flavors. The tamarind chicken wings were delicious. More on the sweet side, but definitely delicious. I got the slice beef pho. Flavor was really good. Serving was decent. Taking it to go is definitely a lot more work but that it okay.

I'd say with both times I was rather happy. I would definitely stop back in if I was in the area. They are pretty quick on phone in orders."}
{"text":"Wasn't really great the taro boba tasted chemically and the pho had no real flavor and the broth was just almost all water not really broth. Spring rolls had more lettuce than shrimp or noodles... maybe I caught them on a off night but I won't be going back sucks tho I was hoping for good things!"}
{"text":"I've only ever had an issue here when I called and had a bad connection! The customer service is great and food is even better.  We have come here much more often than I've remembered to check-in, and it's always been a positive experience."}
{"text":"Terrible service. Came in for dinner got seated at a table, five minutes later another family gets seated. The family got waited on after getting there after us, we didn't have anyone come over and say be right with you or bring us waters. Sat there for 10 minutes with no acknowledgement and got up and left. Will not be back."}
{"text":"Very nice, clean cozy and modern decor. Service is  only average grade. They seem to act very cold, for whatever reason. Food is good, but not worth the price. A bit expensive for what you get. Have tried the lemongrass chicken stir fry. Very tasty but extremely basic, and lacking variety of veggies. The vermicelli bowls are fairly complete and end up being a good light, non bloating lunch. The shaking fried beef was actually quite excellent. The meat quality was tremendously good for a restaurant, almost like steakhouse meat. Tender and marinated, fantastic. Probably the best thing I have eaten here. The spring rolls are nice and light but seemed to be lacking a bit. Maybe they were not rolled tight enough. Overall a solid 4 star place for vietnamese food.  Dont be fooled by the 5 star-ers. This doesnt have all the components for 5. Service quality can take a 4 star to a 5 for me, and that's where they fall short."}
{"text":"This is the best Vietnamese place in the valley- the food is wonderful and the staff are so nice! Try the red pork and shrimp spring rolls or the clay pot fried rice."}
{"text":"I really like the pho here. I give it 4 stars. Their Boba avocado smoothie... Twenty stars. Amazing. 

They were a little short with me when I came in to pick up my order, which I suspect was because I was wearing my usual attire- pajamas (#classy). I'm not naive or entitled. I totally get it. I don't care, but I get it.

Anyways, the (justifiable) attitude was not abhorrent. The food was delicious and the smoothie was great. I'll definitely be going back. Probably wearing pajamas."}
{"text":"Good chicken pho. We won't have to drive to West Mesa anymore. I'm excited to try the rolls and banh mi the next visit. The place is clean and nice. Service is fast and courteous. I'll be back."}
{"text":"Very good egg rolls as stated! However, I ordered the V6. Vermicelli with Grilled Shrimp/egg roll. (It only has 3 slightly over cooked small grilled shrimp. It was still good food, but next time I will try a chicken dish.  I had also had very good service!"}
{"text":"I'm surprised that this place is rated so good.... this is the first pho place that I've ever been to where they have forks on the tables instead of chopsticks. We ordered the nem noung, it was definitely not authentic.... the meat that they used was so thin and not grilled like they usually are. The pho was bland and tasted like they only used star anise to flavor the broth. 
As for the service it was ok. The waitress came and took order and asked what we wanted to drink. We got our appetizer and finished it and still didn't get our water. We had to get the attention of one of the waitresses to bring us water. They also didn't bring us little dishes for our sauces so I had to pour out the peanut sauce from the appetizer to use that dish. 
Definitely the most expensive pho I've ever paid for..."}
{"text":"Nice pho broth! Yummy vermicelli!

I needed some easy after the dentist feeding so Pho is an easy go to food when you don't want to chew....

I got the Chicken Pho bowl and in XL size.... The broth was quite fresh tasting and good. 

Donna ordered the chicken vermicelli with egg roll. It was a good dish...

Since my mouth as numb from the dentist I don't have too much to say... 

Good spot to eat from what I could tell...."}
{"text":"Nice pleasant atmosphere....I ordered oxtail pho....I am use to oxtail falling off the bone and it wasn't. Noodles , broth were very good. Like adding my own
Cilantro too! I will return!"}
{"text":"I LOVE this place! The Pho is deeelicious! I usually get the veggie pho in chicken broth and the shrimp spring rolls. And a plus, the staff is sweet & efficient and prices are reasonable. I've been to other pho places around The Valley and Always come back here for the best! 
I didn't give it a five star only bc sometimes they are understaffed at peak times and the wait can be a bear."}
{"text":"Tried the brisket pho and it was delicious and the tai tea was also. Will be back again"}
{"text":"Great little spot I found in Chandler, that serves very delicious pho of many sorts. This place is located about a mile south of the 202 on Gilbert Rd. I really like the setting and atmosphere they are going for here. Very quiet and peacful place to just get away and relax. I ordered the combination pho without the tendon. It was really good! I loved the textures of the different meats, and the broth was very very good! I was very please with the pho here. I will definietly be back to get it again. I noticed they had a few verieties of vietmenese coffees here. I think I am going to try one next time I visit."}
{"text":"Great friendly service. The food is delicious ate the pork sandwich, the beef pho and crispy noodles with seafood spring rolls and egg rolls. Everything was very good. Restaurant very clean. Will come back for sure"}
{"text":"Very good Bun Bo Hue!  Very clean and attractive restaurant. The staff is very friendly. I recommend this place if you like authentic Vietnamese food."}
{"text":"I have been so, so impressed with this restaurant.  It's so clean and inviting and the service is phenomenal.  The women working here are so friendly, attentive, and helpful.  My friend and I both ordered brisket pho and it was so delicious.  The broth was deep, sweet, sour, spicy and all the add ins were super fresh.  I appreciated the Sriracha and Hoisin sauce on the table because I always like to add spice to my pho.  I definitely recommend trying this place out.  My only complaint was the guy sitting behind me slurping the heck out of his pho but I suppose that just means it's delicious."}
{"text":"Really, really good Bahn Mi. Vermicelli bowls are excellent and filling as well. Service has been good, with the food coming out pretty quick at lunch time. Only downside to me is they don't take Amex."}
{"text":"This is the BEST pho in all of Arizona. I HIGHLY recommend them. I come here often and order the steak pho with tofu spring rolls and always leave satisfied! The staff is also super friendly. COME HERE."}
{"text":"Straight review begins now 
We ordered a few things 
-the pho was by far very bland,  nothing special 
-the rice dish was boring, the beef was thin and not seasoned very well. Shrimp was not very good either
-the spring roll was gross/tasteless - the peanut dipping sauce was generic, like a recipe from Google 
-normally a Banh Mi dish is my favorite thing in the world. But this damn place manage to screw it up, they put lettuce in it. LETTUCE!!!!!
-the calamari was yucky also, the breading was hard and fell off the moment you bite into it. Tasted like an onion ring not calamari
***the thing that makes me the angriest, above all the bad food, was they charged me $2 dollars for a small bowl of broth with my rice, in my years of eating at Vietnamese restaurant, I've never been charge for broth with my rice, let alone $2!!***

It seems like all the reviews are  saying that this place is good. Nope not me! I do not agree at all.

-service was great, the ladies were really nice, clean restaurant, if the food was better I would be here everyday, but sadly no."}
{"text":"I like this place a lot. Or did until 10 minutes ago. Good food. Nice atmosphere. But today I wanted Pho and to sit in the restaurant and eat, not bring it home. I don't like sitting in the middle of a restaurant, though. I prefer sitting along the outside walls. I came alone so I get it that you want to reserve the 4 person tables for larger parties, but I came at 430pm on Sunday. The place was almost empty and had only three tables with people when I got there and one table emptied just after. There was plenty of seating around the outside wall. I was told that I could only sit at one of the small two seat tables in the middle... I decided on getting the Pho to go and not sure I'll be back. I'll try some other places in the area. Maybe I'll find a place that'll let me sit where I want when they're almost empty."}
{"text":"The food was delicious! Staff all where very friendly. The only opportunity they have is better attention to customers needs/wants like napkins not being on he table and having to ask for it, we asked for shrimp (which was extra) and the pho literally had 2 pieces of shrimp, they didn't remember to bring out drinks when we ordered, we got the food and drinks at the same time. I'm sure others have had better experiences this was just ours. Overall I would come back if I had a craving for pho again only because it's close to my house. Hope this helps"}
{"text":"I love that there is now a place in S. Gilbert to get great Pho, Bun, and more!

The vermicelli is pretty generous, and any grilled meat dishes are well marinated. Pho is good for any hangover or cold too! 

My only gripe is that my family has ordered pickup from them a few times.. And it has gotten messed up more than once! Recommend to call and have them read back the order to exact specifics if you do takeout."}
{"text":"This place is just ok.  We stopped here because one of our usual places, pho chandler, was closed.  I got bun rieu, husband got bun bo hue, & our friend got pho... Husband thought his food was bland, my bun rieu was ok... Nothing special. This is farther from me and I probably wouldn't go out of my way to eat there again, maybe if i was near by and needed a pho fix."}
{"text":"Soup was good. Nice ambience. Only thing was no napkins, no chopsticks (brought out the spoon but no chopsticks) no dip tray. Didn't feel like asking for every lil thing . But still new, still learning I guess . Overall, it was great. Next to home too. Will be back . Hopefully next time will be better service"}
{"text":"My first visit. I got the Chicken Pho and egg rolls to go. I took it home and tossed it all in a bowl. Very easy and very good. Very happy with both! The staff was friendly and the place looked nice and clean. I will definitely go back"}
{"text":"the staff were nice and the food came out pretty fast. The pho was kind of boring, though. I've had pho at a few places in phoenix that were better. In my opinion, if you are going to be a good \"pho\" restaurant you gotta do better than this and. it be half as good as the hole in the wall places in downtown phx."}
{"text":"Tried this place for the first time. Water tasted funny and spring roll tasted bland. Pho was ok. I rather go to Pho Chandler, which is way better."}
{"text":"I got the chicken pho and it was gross. The broth had a strange flavor and the chicken tasted Gamey like it had been boiled and sat aside for days. Cream cheese in the wontons was thicker than normal, too. Not at all satisfied. A waste of $20."}
{"text":"Best Pho in Phoenix! Amazing food! Great service! We have tried many pho restaurants and none can compare! We will definitely be back! So glad this place opened up close to home!"}
{"text":"My wife and I have enjoyed going to the AZ Pho grill south of the lower 202.  We tried takeout at the new location on Higley last week.  It's a very different experience from dining in versus take out with this restaurant since everything is given to you in pieces when you order one of the Pho dishes.

The best way to explain the take out is that it's like a lego set.  You're given all these different ingredients and then have to put them together at home.  The flavors are pretty good once you get them to mesh, and mind you it will take a bit after putting it together for the flavors to combine.  So aside from having to drive there, constructing the dish when you get back, waiting for the flavors to mesh, the dish is comparable to dining in.  I'm just not a fan of having to build my dish once i'm home.

We will probably go again, but to dine in and not do take out."}
{"text":"Wow!  The lemongrass chicken is so tender and delicious!  The egg rolls are still perfect!  We liked the Mi Quang, too!  I just wish it had a little more meat and broth!  This place has really improved!  Great meal'"}
{"text":"Definitely 5 stars! I ordered a regular sized combination pho which was large and the large was even larger! Even the kids bowls of pho was the regular size, so you can actually just order one for your kids to split. Their gyoza/pot stickers were great! I have not yet tried their spring rolls but with how everything else tasted I'm sure those are great as well. I also ordered a boba Thai tea- great as well. The service was great, the atmosphere was good and the restaurant was very nice and clean. This will probably be my new pho spot in Chandler!"}
{"text":"Good pho, god service, clean modern feel inside. Chicken pot stickers were some of the Best I've ever had. They were accommodating and combined my veggie and tofu together. However if your true vegetarian you want to skip this place. The broth is chicken-based."}
{"text":"I like the clay pot fried rice. I will give it five stars! It tastes great. The fried rice is on the bottom, and with high quality of rice. Fried meat with vegetables are on the top. Strongly recommend!! So delicious!!!"}
{"text":"My boyfriend and I absolutely love this place. Great menu, super tasty pho, and excellent customer service. Not to mention the place is always super clean and quiet! Definitely stop here by if you're in the mood for pho..you won't regret it!"}
{"text":"Delicious food, great broth, 33 is ice cold and the service is friendly and attentive."}
{"text":"Took my husband here for some Pho, and he loved it. Service was great and food was yum. The restaurant is clean and nicely set up.  Looked like they have a full bar as well.  The owner/manager even walked around and checked on his patrons. I had the rice platter with chicken and a fried egg, very delicious! The appetizer platter with spring rolls and shrimp were very tasty as well.  Definitely going back!"}
{"text":"This place has some good Pho. Although their peanut sauce could use a little work all in all it's very delicious!"}
{"text":"First time I stopped here before they were technically open (they were advertising on the street lol). Anyways stopped by today on my way home from work for lunch. Greeted & asked for something to go. Went with red pork(?) bahn mi. It was very tasty & the only thing I'd like is extra jalapenos (I love spicy). The red pate (I think that's what they call it lol) had a little kick so that was a nice surprise! I'd definitely order this again although I'd like to try the other options as well. Next time I want to try the pho  too! If that is good I'll come back and give that 5th star !"}
{"text":"We got take out... phenomenal. Some of the best pho I've had. Fresh everything & hot. They gave me all the sauces I needed to make a spicy masterpiece. Thank you. It was delicious."}
{"text":"Best pho I've ever had, it's a bit of a drive for me but so worth it. I always get it to go and they package everything separately for you which is great. Everything is hot and fresh, staff is friendly, and the atmosphere is quant."}
{"text":"Wrote a review about my experience and food at AZ Pho and Grill :) check it out! 
http://itsmesteph.com"}
{"text":"The food had okay flavor. The portions were smaller than I expected at the price that we paid. I expected much better food and flavor from the reviews that I read on yelp. We will give it one more shot. However, based on the quality and flavor of the food just one more."}
{"text":"This is really nice place, the atmosphere is nice.
Food is really good, I had Quang Nam Noodle (N1) best noodle, also egg-roll is fantastic (I consider this is best in town!) 
Service is great very friendly very attentive, the staff take your drink orders right away.
They just open few days but they meet my all my expectation so they deserve 5stars!

Highly  recommended this place"}
{"text":"We tried the flank and steak Pho and it was delicious.  Egg rolls were also tasty.  Comfortable atmosphere at this place.  I think I like it better than Saigon Pho."}
{"text":"This is my second time there in 2 weeks. Great steak pho, shrimp spring rolls and grilled beef w egg rolls on vermicelli. Great atmosphere at an excellent price! Where else can you get 2 entrees, appetizers and beverages for $25.  Food is fresh and tasty."}
{"text":"This is an amazing place. Friendly, clean, upscale with tablecloths -- the right lighting and noise level. An exceptional owner, Tom, intent on creating the right experience for you. I am impressed. Food is excellent and diners are clearly frequenters of this neighborhood gem."}
{"text":"This was our first visit.  We had a bbq red pork sandwich.   The bread, cilantro, and pork was delicious.   The quang-nam noodles were outstanding.  Portions were just right.  We will be back to try other dishes.  Although the restaurant was a quarter full,  the service was slow."}
{"text":"I almost left before even ordering and I should have followed my instincts. Foreign object in my Pho is a no go!

I made eye contact with several employees a few times as I waited to be seated and didn't get any acknowledgement. I would have expected at least a \"hi, we will be with you in a moment\", but nothing.

 I should have turned around then and there but i gave them a chance because the decor was upscale and they seemed decently busy for lunch hour (but not too busy to greet a customer)

In any case I ordered steak and beef meatball pho. The food was typical for the style but unremarkable. I didnt care for the meatball that much, a few seemed a bit tough to chew. During my meal the wait staff were much more attentive and checked on me several times.

 I did eat almost the entire bowl. Unfortunately as I was finishing the last bits i notice that what I thought was a piece of lettuce or cabbage was actually a bit of cellophane or plastic. Suddenly the bowl that was tasty before was no longer pleasing to me and I worried what else clould have made its way into my meal.

Unacceptable to have this in my food. Turned a 3 star experience into a 1 star very quickly.

I alerted the management and they did apologize, offering to take a bit off the bill. I declined and said I ate my food so I will pay for it, but was very unhappy. He then offered take 50% off which I declined. I told him I used to manage a restaurant so I understand these things happen, but as a customer it was very disturbing to find that, especially after eating almost the whole thing.

He did offer me a free appetizer if I return, but I dont think ill give them the opportunity. The manager just didnt come accross as concerned enough. I think offering to comp the whole meal may have changed my mind (although I would have still declined the offer). Frankly I felt like the manager initially thought I was trying to scam them, which I didnt appreciate either.

My advice is chefs need to watch what goes on in the kitchen better to avoid foreign objects in the food and hosting/wait staff while not rude could afford to be much warmer/friendly.

There was a \"help wanted\" sign in the window, and I concur they do need help."}
{"text":"We've been coming here since it opened and I've waited to write this review to give them time to sharpen their service up. 

Yummy pho
Clean
Food doesn't take too long to come out
Service is pretty good
Lots of seating 

The nature shows they play on the TVs are interesting. 

Pho Tai is yummy and the fried rice is so good!"}
{"text":"I am visiting from out of town and stumbled upon this place.  This is the BEST Pho I have ever had!  The restaurant is spotlessly clean, the service is very friendly and helpful. The music is relaxing and not too loud.  The food is VERY fresh and delicious!  Vermicelli is excellent!  You can tell they take pride in their establishment.  I have eaten here 5 times already.  I brought my elderly parents in and they had a ball. They were slurping their noodles like little kids and just giggling away.  They LOVED the food too.  I cannot say enough good about this restaurant. Well priced and well worth it! They also have a nice bar if you enjoy cocktails."}
{"text":"Good location. Nice decor. Friendly service and even though their menu says no substitutes, they allowed them. . The portions are large so you'll have left overs. I would go back."}
{"text":"We are fans of Vietnamese food and are so happy to have this great restaurant close to home.  The food is fantastic!  The service is ok but could be a little faster.  The boba drinks and mochi are so good!"}
{"text":"This restaurant was really cute inside and clean. We get the same waitress every time. She is really nice and informative and she makes nice suggestions. I had never had Vietnamese food before and I thought it was very delicious."}
{"text":"This place is great.  The service was fine - came in for lunch.  Coconut shrimp was only disappointment...rubbery, seemed like from box you get at Costco, not made from scratch.  Vermicelli was 100% perfect.  Fresh, crisp, great flavor.  Well done.  Also, bathrooms were SO CLEAN.  Finally, TVs were playing a video of deep sea life which I found very interesting...nice change from typical ESPN."}
{"text":"This place is not cheap but the food and atmosphere is good. I guess you pay a little more for the ambiance. This is one of the best looking Vietnamese restaurants I've been in so props for that! Staff was also friendly.

I would recommend this place to anyone who wants decent Vietnamese food."}
{"text":"Drive past this restaurant almost every day. This is hard because I want to stop every time I drive pass it. I love the food."}
{"text":"This food is top notch! You can't go wrong with anything you order. Delicious. The flavor is there and the service was friendly. The lemongrass tofu was perfect spicy but lemon flavor on point! The pho is the best that my boyfriend has had he said the chicken was the best and most well cooked he's ever had and we have tried a lot of places. My son got the grilled chicken and rice and he loved it also. I really recommend this place. You will be happy!"}
{"text":"Waitress did not pay attention to what we ordered , their pho broth tastes terrible I got so thirsty after sipping a spoon of the broth. Too much msg . Don't waste $ coming here !"}
{"text":"An eclectic, modern atmosphere and fresh, delicious ingredients make this pho experience definitely worth coming back again and again. I had the chicken pho with steamed vegetables added. It was amazing! Large portion sizes means you'll satisfy even the most ferocious appetite, or take it home as the leftovers are just as yummy. 

As for appetizers, the shrimp rolls were fresh and delicious, and I highly recommend trying one of their shakes. Both the taro and mango shakes were very tasty. 

The staff were all extremely friendly, and the service was fast. The aforementioned atmosphere and decor make this restaurant ideal for an intimate date or lunch with the family."}
{"text":"Let me start by saying that we used to live in a Chicago neighborhood that was predominantly Vietnamese. We had over 15 options for Pho within a half a mile. That said.. I've had some phenomenal pho and am quite particular about it.

We live very close and we were so excited when this restaurant opened. We've been there several times since the opening and and would highly recommend it.

That said, the Pho is slightly better and more flavorful at Chandler Pho. However, the  atmosphere here far surpasses Chandler Pho and the service is wonderful.

The vermicelli is absolutely amazing. Though I recommend eating in the restaurant. We've ordered \"to go\" and it doesn't compare."}
{"text":"Beautifully decorated, ambient atmosphere, great and friendly staff, and phenomenal food. What more could you ask for? We will definitely be back! The egg rolls are out of this world, and the pho was top notch!"}
{"text":"Just tried this place out about a week ago and had a great experience! The inside of the restaurant is really nice for a pho place, in my opinion. I really liked the ambiance and our server was great. My husband and I both ordered pho with spicy hue-style broth and shared the charbroiled pork spring rolls. We didn't have to wait long at all for the food to come out and everything was delicious. Will definitely be back!"}
{"text":"I always forget how much I like this place until I go. I pick up a to-go order maybe once a week and it's always, always great. The staff is really friendly and accommodating and the food I get is delicious. In comparison to another Vietnamese restaurant I go to (that's also been open for way longer), this place gives me considerably more meat and veggies with my dishes. Everything is always fresh and well-priced."}
{"text":"I am a PHO-NATIC!  I have eaten at almost every Pho place in the Valley... I am soo happy when this place opened so close to my house! Then I was sadly VERY disappointed. Service was terrible, 45 min for egg rolls and a bowl of pho. Eggs rolls were ordered as an app. They came AFTER my pho. The fiancé ordered the beef and rice dish, they took they same thin cuts of beef they put in the Pho Tai and cover it in sauce and service it with rice.. portion couldn't even feed a 3 year old, I had to take him the burger king after we left the restaurant.. Now back to the important thing.. the Pho.. Watered downed broth that tasted of nothing but greasy cinnamon, no deep pho flavor at all .. SO disappointed I will never go back.  It tasted like they were running out of broth and just poured a bunch of water in it to get them through the rush hour, GAG."}
{"text":"Good Pho and one of the only ones in Gilbert. It's clean and the service is better than what you find at most Pho restaurants. It's a favorite of my kids."}
{"text":"Okay where to start? My wife and I love to find new food places, especially Pho places... We happened across the original AZ Pho and Grill (South Gilbert) about a year ago today. It was awesome. What luck we found AZ Pho and Grill #2 on Higley and US 60. Now the food is just as good as the original, I know some times the sequel doesn't always make up for the original, but in this case it was awesome... My wife had the Veggie Pho (no comment), and I had the Bánh Mí Thít Nuróngor or pork Vietnamese sandwich with paté, pickled daikon, radish and jalapenos... DELICIOUS! 

Now I'm not a purist and getting baguettes for the sandwich in Arizona??? Good luck... I loved the sandwich. Now for the Pho I had the P1. The broth was very flavorful and the proteins were plenty, loved the noodles too. Now I love Pho and can make anything taste to my satisfaction with enough jalapenos, basil, hoisin sauce, and the greatest condiment ever made Sriracha. But the culmination of all these ingredients met and surpassed my customer expectations. Great food, great price, great location. See my photo... Peace..."}
{"text":"We eat here almost every week! My hubby Loves the spicy seafood pho and I predictably order chicken pho with veggies. It's an upcharge of $2, I think, but the soup is loaded with carrots, bok Chou and broccoli."}
{"text":"always great to go to a foreign rstaurant and surprise you with authwnticity. vietnamese all the way through. fresh vegetables, refreshing milk tea, and sweetly marked deserts. 
happy to find this place 4 mins away from church!"}
{"text":"i still do not know why this place got so many stars, may be the interior design is nice. that is it! i'm Vietnamese, and to be honest the pho broth here is tasteless. I was there on Tues because Pho Chandler closed on that day. it was very busy, may be because Pho Chandler closed on Tuesday. sounds logical, doesn't it? anyway, spring roll was kind of plain, nothing special than other places."}
{"text":"I like this restaurant very much.
I have been back four times.
It is lovely and clean at no extra expense.
The Pho is delicious although I would prefer more veggies and not as many noodles.
The tofu Pho is wonderful too.
I have one suggestion about the fresh rolls.  Please use the Thai basil, instead of just lettuce!
Next time I return, I will specifically ask for the Thai basil in the fresh rolls!"}
{"text":"Love the food so much we went back the next day.  Good service and nice atmosphere.  The food is so authentic and the soup is sooooo good"}
{"text":"This is our staple Americanized Pho joint! It's close to our house and the food is always good. I can't say the same about their service but consistency is a good thing right?! Whether it's take out or dine in, this place is great."}
{"text":"If I could give ZERO stars, I would. Terrible food. Terrible service. Overpriced (I guess anything you hate is going to be overpriced but we paid nearly $100 for something we took only a few bites out of). I couldn't bear to see this go to waste so we drove around Mesa for the next hour looking for homeless people and passed out our leftovers to them. It may not be the tastiest, but at least they had some Pho in their bellies on a somewhat cooler day. We had so much leftover because we only took a few bites out of each dish. It had no flavor and getting anything to add to it (such as sauce) was like pulling teeth. (We later went somewhere else as we were all still soooooo hungry). It literally took about 20 minutes just got get the to-go containers. When we asked for plastic spoons to go with it, the waitress blatantly looked at another guy that works there and rolled her eyes- right in front of us - as if we are blind! We were being completely upbeat and friendly the entire time so it wasn't because we did anything wrong- it was simply her attitude which she had since the moment we walked in. When we asked for a drink refill, we might as well have asked for a million dollars by the way we seemed to be putting her our and interrupting her time of sitting at the cashier desk doing nothing... and more than half of our requests went unanswered- in other words: ask for a refill or Sriracha or napkins- there was about a 30% chance that they would come back with the item. I could maybe see if it was busy, but there was one other table there with two people sitting at it. Come on! I make decisions off of Yelp ratings but I am starting to lose faith in the reviews because this isn't the first time I've gone to a restaurant with 4 stars and found it to be more like 1-2. Are businesses paying people to review or getting all their friends and family members to post positive ratings or what???? There is no chance a single thing about this place would be considered good, let alone average.... it is far, far below average. I wish I could get the money I paid back and the time I wasted on a Sunday with my family sitting there waiting for items to be brought that never came and dealing with people who clearly shouldn't be in the food industry and cooks who might want to find a new job- unless tasteless food becomes a thing. By the way, we ordered steak Pho, veggie Pho and chicken Pho, crab puffs, a Vietnamese sandwich, and a seafood and rice platter (which had about 4 pieces of seafood). Please so yourself a favor and eat somewhere (anywhere) else! ZERO STARS in every single way. Enough said."}
{"text":"Excellent food & service!!! We were seated immediately upon arrival even though the place was nearly full. We were handed menus and our server took our drink orders were taken right away without being pushy.

The entire time we were there we watched the staff work efficiently while maintaining a friendly attitude. Service was quick and excellent.

Now food!!!! We ordered the Pho Special Combo, egg rolls, a pork sandwich and a chicken sandwich.

The rolls were crunchy on the outside and tender on the inside, without being oily or greasy. They are hands down the best I've had in all of Phoenix!!! The dipping sauce was thinner than I expected but full of great flavor! Sweet but not too sweet and the perfect compliment to the rolls.

The sandwiches were next, great value and great tasting both had tender meat and were also full of great flavors. The buns were a little too big. But overall no complaints.

The Pho was great, & aromatic. I could smell the cinnamon, cloves, anise a mile away! I was worried that the broth might actually be overpowering but it wasn't, the flavors were spot on and what I expect of a good pho.

I will definitely be back here soon!"}
{"text":"Alright Pho, nothing that stands out.  Service is fine and the place is really clean.  The spring rolls are good and the kids always want an order of egg rolls.  They tried the calamari one time but they were not impressed.  Had the grilled meat and rice plate once.  I always love the Vietnamese grilled meats with the fish sauce.  I just wish the egg was fried with runny yolk.  Other Vietnamese restaurants have the runny yolk so I am spoiled.  When I am lazy and in the mood for Pho, we go here cause it is right down the street."}
{"text":"Pho was alright. Took 30 mins for it.. It was a sunday & there were a couple big groups but the servers seemed to pay more attention to them & put us on the back burner. Passion fruit juice tastes like it was fresh. Very delicious. Really wanted to like this place (it's right by my house) but I've had better pho sadly."}
{"text":"I tried AZ Pho & Grill out this week as they had just opened up in the area that I work in.  The Pho is really good! It has a lot of flavor and they give you plenty of goodies to add in. All of the food is cooked perfectly, I've had the chicken and beef so far and have enjoyed both. 

Like everyone else has been saying, the egg rolls are also quite delicious! The owners are super nice as well as the staff. It's great to have something different for food options in the area. Definitely recommend giving them a try!"}
{"text":"This place is my new favorite!  The food is delicious, and is a refreshing blend of traditional and innovative.  The service is quick, and the staff is friendly, as well as courteous.  

The menu has food that I have only seen offered in Little Saigon, so that totally impressed me.  Unlike Little Saigon, however, the staff checked in on our meal several times.

We ordered the pork spring rolls, the Vegetarian Pho with shrimp added, the Vermicelli with grilled pork, shrimp, and egg rolls, and cafe den da and cafe sua da.  The pho didn't come with all the extra herbs, but since my girlfriend doesn't like them anyway, she was happy with just the fresh jalapeños, lime, and bean sprouts.  The Bun Tom Thit Noung Cha Gio was delicious and came with finely shredded lettuce, which was a nice change from the traditional.

Both cafes came in the French Slow Drip fashion, but they didn't take the whole meal to brew; they were ready to drink as soon as they were set down.  I'd never had that happen before and was used to waiting patiently for the coffee to filter out.  The cafe was strong and clean, just like it should be.

The prices are friendly to the wallet, and the portions are very satisfying.  We will definitely be back!!"}
{"text":"This might have been the most horrible food I've ever tasted. We LOVE pho, and this was such a let down. Their noodles were not cooked, and the broth wasn't hot enough to cook it even if I let it sit. The peanut sauce for the spring rolls, was  chalky, and gross. And the rolls were so bland, no taste at all. The slow drip coffee was watered down, and disgusting. The music was classical, and it wasn't good. The only good thing I can say about this place, was the decor was nice, as the service was great."}
{"text":"Good but not the best. Ordered the chicken pho + veggies. The chicken tasted like it had been boiled and kept to soak for a few hours/days. Broth is was watered down. 

The service was attentive. But....I ordered a Thai Milk Tea at the same time as the pho order. Pho came out quick and promptly. About 10 minutes in to the pho (almost finished stuffing my face), server realized she hadn't served the thai tea and rapidly made it behind the counter. Fine that she eventually remembered, but had she checked on me, I would have said forget the tea."}
{"text":"Expensive for Pho, and taste just OK.  Service and decor was nice but service on slow side.  Had difficulty waiving down waitress for more water.   The soup of bun no hue was flavorable but the choices of meat inside was far from authentic and limited.   I ate all the meat and still had 3/4 bowl of noodles.  This place caters to white crowd who likes the idea of Vietnamese food."}
{"text":"Very nice place!  Atmosphere is very relaxed and comfortable.  They have a great bar to sit at and also tables and high tops.  The food was great, I have a sandwich for lunch and it was perfect.  Can't wait to come back and try the Pho, will be great for a date night."}
{"text":"What a wonderful change from the norm!  Came to Mesa,Az to visit son and family and stayed near AZ PHO&GRILL.  The food was OUTSTANDING!!! Probably the BEST PHO I have had BY FAR!! Had the spicy seafood pho SOOOO GOOD! The wife had grilled pork sandwich sooo good! Staff was SUPER FRIENDLY AND ATTENTIVE. REALLY VERY NICE INSIDE."}
{"text":"Best pho ever!!!!! Order the egg rolls and the p2 for your main meal. I've never had a bad experience here."}
{"text":"AZ Pho and Grill is truly a MUST-GO in the Gilbert area. The pho is absolutely PHOnomenal . The owners (Tom & Thao)  are very kind and do their best to make sure you enjoy your food here. My favorite items on the menu is the P1 Pho Dac Biet, the V6 Vermicelli bowl w/ grilled pork, and the Grilled Pork and Chicken Banh Mi sandwiches. 

I have been here more times than I can count, and have always had an awesome time. 

TLDR; Just go. You won't regret it."}
{"text":"Excellent lunch again all around atmosphere, service and food. I met 2 of my friends for lunch.

Nice selection of beers, i had the Lagunitas IPA. We start off with appetizers. Always reordering one of our favorites the (A11) Grilled beef Rolls along with trying the (A2) Fried Egg Rolls and (A12) Tamarind Wings. Funny thing is we all wanted to try a different noodle soup from our traditional Pho, so we all each ordered the (N4) Spicy Hue Style Beef Noodle Soup and of course for an added $, I add Tripe to mine. 

All the dishes came out in a timely fashion. Service was excellent, always checking up on us. Food was excellent! Being so convenient a location for me, this is my go-to Pho craving satisfaction."}
{"text":"Very good food.  Had the Bun and it was great.  They were very busy but did not mind the wait because the food was worth it.  The staff was great and we had no less than 3 people ask if we enjoyed ourselves.  The manager Ken was very attentive."}
{"text":"I've dined here twice this week! I brought my parents along with me the second time, they were surprised by the decor and cleanliness of the establishment. I'm new to the pho world but so far I have enjoyed what I've ordered! I will be coming back for more."}
{"text":"Excellent Vietnamese restaurant.  They are doing it right.  Service is also top notch.  I typically order the V6 which is vermicelli noodles with shrimp and egg roll plus your choice of pork, beef, or chicken.  I typically can't decide so I get beef and pork.  I had the calamari app this go around and was not a fan.  The platter app is good, 2 spring rolls, 2 egg rolls, and 2 coconut shrimps.  Great value and tons of good flavor.  Definitely a spot I will go back to."}
{"text":"Loved their vermicelli chicken bowl. It was so fresh and perfect for lunch. I did ask for less rice noodles and more veggies. The veggies were mainly shredded lettuce. It was fresh and great!"}
{"text":"Love,Love love love this place. Food taste great every time. I order there bbq pork spring rolls and steak Pho.I've had others Pho and this one is the best so far in Chandler."}
{"text":"Let me start out by saying that this was one of the nicest pho places I've been to.  The place is clean and decorated nicely.  But ambiance aside, the food left much to be desired.  The spring rolls were mostly filled with noodles so you could barely taste the shrimp or pork.  Portion sizes seem way off for the prices.  It's not expensive, but when you compare to your standard pho places where a bowl is around $6-7, and this place charges $10, you're really paying for the atmosphere and not the food quality.  Because the food was not the greatest.  I think I'd rather go back to the hole-in-the-wall places that have out of this world pho than pay extra for lackluster broth and nice surroundings."}
{"text":"Giving 5 stars ONLY for the delicious pho and tea. The service needs some help. The two girls working tonight talked to two boys during our entire dinner and I sat with an empty cup for 10 minutes. However, the food was GREAT and the restaurant was very clean."}
{"text":"I'm originally from a city where there's Vietnamese food at every corner, so moving to Arizona was a bit worrisome at first in terms of finding decent Vietnamese food. Luckily, there's AZ pho and grill right down the street from school! Love the convenience of this location. Honestly, I don't know if I would frequent this place so much if it wasn't so close to where I live/go to school. My friends and I find ourselves at this place about once a week on average. If we don't know where to eat, this is the place we turn to.

I usually stick to one of their pho bowls, bun bo hue, or a vermicelli dish. Not bad, not bad at all. They all definitely satisfy my Vietnamese cravings on days where all I want is a taste of home. Their bun bo hue is a little less flavorful than what I'm used to, but it still hits the spot on days where all I want is a hot bowl of noodle soup. I'd say their menu is pretty extensive, and there is definitely something for everyone. My only advice to the restaurant is to leave chopsticks on the tables so that customers don't have to ask for them. Service is always on point though! Everyone there is so nice and attentive!"}
{"text":"Not recommended. The pho had Ramen noodles, not the traditional rice noodles. The water tastes contaminated and the service was slow. The restaurant is quite fancy and the restrooms are super clean."}
{"text":"The food is great! We love it!! But the waiting service is terrible, even when not busy. They take so long to come take drink orders, food orders and then another wait to get the check.  If customer service would improve this place would get 5 stars."}
{"text":"Came here on my lunch break with a co-worker after discovering our main Pho place is closed on Tuesdays. We were very pleasantly surprised by this restaurant. Very clean, classy and modern making it a comfortable place to dine. The Pho is great! The service very friendly. I will definitely be back!"}
{"text":"These people suck!!!! First they pick up and place my order for pick up and then they hang up I call back and the lady was being super sarcastic asking me if I wanted a coke then she told me I called the wrong place they were right call chandler pho cause they suck super rude and then they told me I have to come in in order for them to get my order ready they were being so rude the girls name was Bianca super rude never will I ever go there"}
{"text":"Get the brisket pho! This place has a nice atmosphere--could go here for an informal lunch or not too casual  but not formal date. Lots of parking available and good customer service."}
{"text":"I usually end up at this restaurant when I am the mood for Vietnamese because it is my neighborhood joint. That said, I solidly believe this is one of best places to get pho and spring rolls. The broth and portion sizes of the beef soup are superior to restaurants in south Chandler.

This restaurant is also 10x cleaner and more comfortable than a typical Vietnamese restaurant."}
{"text":"YUM! The real deal! I'll be back. If you aren't feeling well, a bowl of pho will cure you."}
{"text":"Our \"go to\" Vietnamese place due to great food, service, ambiance and proximity.  Excellent Spring rolls, Pho and Vermicelli.  Recently tried their Sandwich (S3) and it was fantastic!  

The only thing keeping me from giving this place a 5 is they tend to be on the slower side considering their volume is less then other Vietnamese places we frequent. So... we just make sure we aren't in a hurry when we decide to go there."}
{"text":"Trying out some new place due to some of the regular spots for Pho there closed during the month of July for a few weeks with my disappointment.  This place is Very nice place inside sat server was good ordered some drinks and some apps. Spring rolls and Coconut shrimp. The rolls where warm and small not what im use to no fresh feel. Took a little while later and came with the coconut shrimp. Wow look like 3 little tiny box shrimp which they where soaked in grease on top of some lettuce nothing like the pic on menu. Sad excuse for an app and at 6.00 dollars no way. We decided thats enough we didnt even wait for the Pho and talked to server and mention we where leaving its just not appetizing and would pay for the rolls and drink. I believe either the manager or owner asked whats going on i mentioned the issues he said no problem apologized and said no charge. I felt he handled it right. Sorry we wont be back or recommend.."}
{"text":"This place is pretty good. For beef pho the serving is pretty good, the chicken a little chewy, the seafood is very good (with veggie broth), and tofu (with veggie broth) was actually really tasty. The all shrimp spring rolls rock and the coconut shrimp is so great. Usually the spring roll comes with pork. They do have only one Vietnamese beer here. It's pretty good. Overall nothing stands out too much. But the Yelp 10% discount is very useful. I'm glad they honor it. Been here twice and I think I'll come back."}
{"text":"I was craving for Mi Quang and while yelping I came across this place. Though I'd come to give it a try. My husband had the pho dac biet. Food was just okay. You can't ever expect mi quang to taste anything like a homemade bowl. My husband thought his pho was just okay also. The service was pretty good though."}
{"text":"First time here under the new business but the food was incredible the ambiance is suttle which is very nice ans the staff was very professional.  Our food came out hot and was very tasty."}
{"text":"Food was very spot on.  Had the Pho Dac Biet and broth was very good. The rest of the dishes my family had wets very tasty as well.   They do not do refills and water was brought late to the end of the meal."}
{"text":"Get the seafood pho!! The appetizer sampler was sufficient as a meal itself. Also the Vietnamese hot coffee is amazing here"}
{"text":"Whenever I am in Chandler this is my go to place at least 3 times a week.  Love the Pho veggie soup.  Absolute best!"}
{"text":"AZ Pho is by far my favorite Vietnamese bistro in the East Valley!
Friendly service from competent staff. Dining room has a sophisticated ambience and the bathrooms are spotless. Full service bar for an evening cocktail or a nightcap. 
Menu of choice: fresh egg rolls, eye of round steak pho, and a Thai milk tea. Superbe!
I would also suggest trying the grilled chicken sandwich, if ever you crave something besides soup. If you find yourself in the area of Gilbert and Queen Creek, do yourselves a favor and get some pho!"}
{"text":"Absolute favorite pho place in Phoenix..come here at least once a week! The egg rolls are the best I've ever had as well..not too heavy like other places"}
{"text":"We went to Arizona Pho yesterday and ordered the pho combination. Service was very slow, extremely slow, and we almost walked out. Waiting for our check was even slower and finally we had to ask for it. Also to get chili paste for your pho is something you need to ask for, I actually had to get up and ask at the counter because the server never came back to the table to see if we were OK or needed anything. The atmosphere is nice in there and the pho was delicious, you can really taste the Anis in it. Seems like they give you a lot of meat which was very nice and kind of made up for the lack of service."}
{"text":"Service very bad I get order Togo never put spoon fork or chopsticks.i don't know how can I eat 
I feel so mad and I call back phone than the guy answer phone the voice not nice & he said so awkward..."}
{"text":"Came here for the pho with my son. He ordered noodles with pork. The waitress came back to us about 10 mins after we placed the order after we overheard a bit of commotion in the kitchen and said \"the chef recommends a different meat because it will taste better.\" Okay...So we got the chicken. The food was okay. I definitely prefer the Gilbert Road location because the food is way better. 

Wasn't sure what to make of their unique choice of show playing on one of their TVs. My son was definitely grossed about watching the deep sea creatures on the tv instead of focusing on eating his food."}
{"text":"Love this restaurant - great summer rolls and beef rolls are delicious - always great service too !"}
{"text":"Comfortable dining area, friendly staff, good food.  We ordered chicken breast pho, spicy seafood pho, mango smoothie, and taro smoothie.  Smoothies were very tasty. Taro is out of this world!
Chicken breast pho was flavorful and filling although, admittedly, my company's order of the spicy seafood pho was a flavor explosion!"}
{"text":"I love pho and I'm so excited to have it close to my home. They are so friendly and the pho is to die for! My kids love it too!"}
{"text":"Best Vegan Pho in town, the vegetable broth was amazing. All flavor no fluff. The shrimp spring rolls were deliciously refreshing. The staff was very friendly and attentive. I definitely will be here again."}
{"text":"I have gotten Pho from here 5 times, in the last 2 weeks, :) 
The first 4 times were great, I called, placed order, picked up, Pho was super good.
Tonight I called 5 times & no one picked up.  So I went in and placed the order.  Which is fine, but annoying.  I waited 20 minutes for it to be made, the restaurant didn't look busy but theres \"Door Dash\" and \"Uber Eats\" now, so who knows, maybe they were busy with to-go/delivery orders.  
While I was sitting waiting someone came in who used \"door dash\" and he said this was the last time they were getting food there because this was mistake #5. 
So service is obviously an issue here, but their food is GREAT.  The chicken Pho is so good.  I always get double chicken and it's really good, just bring your expectations down in the service department."}
{"text":"We usually drive out toward Chandler or Mesa area for pho, but  when I was driving home 1 day I saw a sign this place was open and decided to give it a try with the family. 

We order pho tai, pho dac biet, steak cube and their  sampler platter. The pho was good and flavorful. Steak cube was ok. The platter consist of 2 eggrolls, 2 springrolls  and 2 coconut shrimp which were over fried. The eggrolls were full of meat (shrimp, chicken and pork) and really good. The springrolls, I was not a fan of because they use shredded lettuce to roll that's just a preference of mine but hey someone else may like it. 

Overall we found a pho spot closer to us that we would definitely come back to."}
{"text":"First time here and had a great experience! Started with shrimp spring rolls then had R22 with shrimp for my meal. Food was great, service was great... I'll be back for sure!"}
{"text":"We like this place.  Family owned and operated.  Very attentive service.  Back at you dear over and over again.   Spring rolls and Pho, yummy!"}
{"text":"My wife has been obsessed with Pho lately.  This is the 3rd restaurant we've had Pho at in the East Valley.  It was my favorite.  Food was very tasty and ok service.  Decor was ok.  We went on a Thursday night and it wasn't too busy which I liked.  

They brought out our Pho while we were still eating appetizers.  Seriously, why can't they just give us a few minutes?  At least this table wasn't so small so it wasn't as uncomfortable.

We were very happy with the amount of meat they served.  We were smart and paid the extra $2 for the LARGE sized Pho.  Well worth it.

Towards the end we ordered a strawberry smoothie for our daughter.  I tried it and didn't think it was great.  Tasted like Strawberry Nesquik.

-------
Update-

Went back a 2nd time and still lived it.  Service could be better though.  Bathroom was very clean.

I'm raising rating to a 5!"}
{"text":"Our first time here. I had the Pho and my son kept stealing bites. We all shared the shrimp, egg roll and spring rolls. The spring rolls were the favorite. The tea was excellent with boba. Vermicelli with chicken and shrimp was awesome. That's what my husband had. We'd get that again. Fresh, yummy and great service. We will be back!"}
{"text":"I've been to a lot of Vietnamese restaurants and this place doesn't disappoint.  The bun bo hue was delicious.  Could've been a tad bit more spicy but the broth and fixings we're  great.   The shrimp spring  rolls we're fresh and tasty.   I'd definitely come back."}
{"text":"AmazeBallz!! Been to about 5 diff places in AZ and CA and had homemade in a Vietnamese home, and started making my own homemade.... This place tops it all!! Not at all salty like a lot of places are. Really enjoyed everything we got

Appetizer sampler which came w coconut shrimp, Vietnamese spring rolls, and egg rolls, dipping sauces

Veggie pho w added shrimp (awesome quality shrimp, plump and fresh, not fishy or chewy)

Quang noodle according to my man, it was a bit bland but good w sauces added 

Kids shrimp friend rice -delicious and light! Peas were juicy and sweet and no soy sauce flavor! 

Service was great! Owner or manager not sure which but he certainly had a vested interest in the business and customer service, came up to ask if we'd been in before, how we found them, advice on food... He wanted to make sure we liked it and we're happy without being overbearing. Servers works as a team! 

Will definitely eat here again and again!"}
{"text":"Nice place, not crowded, wait staff were fast, and the food was great. Had the pho tai gan gau and it was really good."}
{"text":"This is the closet pho restaurant to me that will bump them up a star, If the pho is bomb its worth a drive, this pho is not worth a drive but is a solid 3 star bowl (tasty but small with a non complex clean broth flavour)noodles were decent and they have other Viet entrees that look intriging, absolutely worth a return trip as they have bahn sandwiches etc... And I was amazed to see kids pho bowls on the menu, will be back for the bahn pho-sure, if your not a complete pho addict like me you will enjoy the pho"}
{"text":"I wanted to like this place because it is literally a stones throw from my house but...I just can't do it.   The decor is great.  The bar looks cool.  Service is very good and friendly.   Even the apps are good.  But the main dishes are overpriced, small quantity and lacking flavor.  I didn't get the Pho...maybe that was my problem.   The menu is weak. Outside of the apps.  They have pho, vermicelli and rice dishes.  That's it.  Very very disappointed!  Chandler Pho is 100 times better.  I won't be back until they fix it."}
{"text":"This has to be one of my all time favorite places to get some pho! The staff is always friendly here. When we order to go, the staff makes sure we have water while we are waiting and the order is done really fast! I can't recommend this place enough!"}
{"text":"Fantastic bun!! V4, order chicken & shrimp. The meat is moist & grilled to perfection. Abundant noodles & great flavor. This is our new favorite noodle spot!"}
{"text":"We've been here a few times and it's great every single time. The Pho, rice, noodles are all very good. Very fresh spring rolls with excellent peanut sauce. Give them a try and judge for yourself."}
{"text":"Love it! Attentive service and amazing PHO  Check it out, you will not be disappointed. The steak pho is my favorite and you can add extra steak for a small up charge. Full bar and yummy food, what more can you ask for?"}
{"text":"Spring rolls were fresh and delicious and I had the Pho with thinly sliced beef. The spring rolls and pho were delicious and the service was top notch!  My first and not last visit for sure!!"}
{"text":"Sunday afternoon is a great time to eat at this restaurant.  Service was slow and the young waiter cold, but the food is excellent.  Great atmosphere and a relaxing place to enjoy a meal.  I am going to try and visit during the week.  Maybe the wait person will have more personality.   No matter, the food is the real deal.  Oh by the way they have a full bar."}
{"text":"Chicken and egg roll vermicelli was great!

Lots of chicken and plenty of veggies.

I added some chili oil to my sauce so it added so spice to it! 

I also tried the, The chicken pho. Very good broth! You can always tell by the taste of the broth if it is made well..

Definitely will come back here when I am in this location."}
{"text":"It's pretty good!

I don't think their spring rolls are that great but it's not bad.

Their meats in their dishes all seems to be sliced really thin if you like that. Kinda like a Mongolian BBQ. 

They charge a bit too much for some things like the appetizers. $12 for Lettuce Wraps app etc

Reasonable for other things such as Bon Mi at $5.50

Worth checking out. The service was a little odd. Seemed like high schooler Vietnamese kids. Not super professional."}
{"text":"We were craving Bahn Mi but did not feel like driving to Lee Lee's. This one blew me away! It had more veggies and meat than Lee Lee's. I was very pleased. We will be going back."}
{"text":"I came here on a whim when my usual pho place was closed for the day and my stubborn self had my heart set on a big bowl of pho. I have to say, I was pleasantly surprised with my experience here! The pho itself was really tasty and just what I needed, plus they have a lot more options here. If you're not a meat eater but you're not up for veggie pho, they do have a tofu option which is great. That is what I ordered and I ate every single bite because it was so good. I also think that portion sizes here are a bit larger which I am totally okay with, but you make up for it in the cost. Still, this place is pretty inexpensive.

The service was also pretty good as well. We were seated immediately after arriving and our waitress checked up on us periodically throughout the meal. No complaints in terms of service. This place also has a stocked bar, so if you're wanting a beer, glass of wine, or a mixed drink with your pho, it looks like this place has the hookup.

All in all great place, I just wish I didn't live so far away!"}
{"text":"Great atmosphere, awesome pho, friendly, fast service!!  Also, good egg rolls and boba! I will be back!"}
{"text":"I gotta say, my entire experience here was pretty underwhelming. I ordered pho, and the only good thing about it was the broth. Upon the waitress bringing out the pho, you can see that the broth is hot, but when mixing the noodles, it clumps and is very brittle. I'm no chef or professional taste tester, but it's pretty clear that the noodles were precooked hours beforehand, and let to sit until someone ordered it hours later, with the hope that the hot broth will loosen up the noodles.

Also, this place doesn't automatically serve chopsticks or the small bowl for the sauces as any other traditional vietnamese restaurant, you have to specifically ask for them. Maybe it's because they dont get too many Asian customers.

But otherwise, the ambiance, service and broth was good."}
{"text":"Not bad! I'm glad there's a pho place a minute from my house now! Usually I go into Mesa or Chandler, but I'm happy now. Orderedtakeout -  the bbq pork banh mi and boy did they stack the heck out of them! Crisp veggies, so fresh...and very flavorful. Usually some sriracha tops it off, but wasn't provided in our take out order (bummer there). We also ordered chicken fried rice which had generous amounts of chicken, but a little bland. A couple of soy sauce packets helped put flavor in it. My brother ordered a shrimp and chicken combo (R6?) and he really liked it. Fresh veggies, big shrimp, seasoned chicken and an egg cake... Will be back to try the rest of the menu."}
{"text":"Tried this place when they first opened and their pho was just okay. But went back for the first time in a long while, and the soup has improved a lot. Pricing is high compared to other Vietnamese places ($80 for four people?)but everything tasted good. Service was decent."}
{"text":"Place was really really authentic. My pho was absolutely delicious that broth was done perfectly. I'll be returning again and again."}
{"text":"We ordered take out from AZ Pho & Grill.  I had the tofu vermicelli and it was excellent.  Our food was ready to go when we arrived.  The restaurant itself has a nice decor, and seemed very calm and relaxing.  I will definately return to dine there."}
{"text":"This place is delicious.  The service is fast and friendly and there are lots of authentic dishes to choose.  So far I tried the Steak Pho, Veggie Pho with chicken added and a kids meal for my tot that was a generous portion of chicken fried rice.  Worth checking out!"}
{"text":"Was going to be generous and give 2 stars but mum says no! The pho was average priced. Everything else was pricey in super small portions. The shaking beef came on a ginormous plate with greens piled below but the actual beef was cut into a few small chunks on top. Not worth the $14. The snow peas were not de-vined. The decor definitely masks the quality of food."}
{"text":"This place was a little hard to find, but I enjoyed the vermicelli. Overall, the experience was a little bland. However, I WAS here on a Sunday night, so perhaps the staff was exhausted from a busy weekend. I'll be going back for another try sometime soon!"}
{"text":"DoorDash delivery...... I just had my gallbladder removed and the first thing I thought about was some soup. I've had Pho from here before but today I ordered veggie pho not my usual but it was hot upon delivery. I can get 2 servings out of an order. All of the veggies were fresh and the broccoli was crunchy just like I like it. By far this has been a great bowl of veggie Pho...."}
{"text":"Drove out here today in the rain to get my pho fix, and I'd have to say it was alright. They did get us seated right away and took our drink orders, then someone else came and took our food order. Food arrived first, still no drinks. The pho broth was good but needed a lot of help - and tasted very minty to me. But still, no drinks. Had to ask a third time to receive our drinks and the staff seemed very uninterested in that obvious misstep. 

Price was ok, but honestly there is way better pho in the valley and much closer to my CenPho area. I'd like to try other things on their menu in the future, but wouldn't get pho again."}
{"text":"This is my husbands and I's go to for Pho in the Gilbert / Chandler area. Very clean, and the steak pho is amazing. The service is always good, and the prices are reasonable!"}
{"text":"We are huge fans of pho and Vietnamese food and are always on the hunt for a good spot, ever since we moved here from the Bay Area. We were so excited when we found out that this opened up closer to us. 
PROS: Very clean, lots of parking, courteous staff.
CONS: Pho broth was ok, not as flavorful as other pho places we drive further out for. Ordered a rice plate hoping for broken rice and BBQ beef short rib or at least thick pieces of BBQ beef. Unfortunately, it was regular steamed rice and basically grilled thinly sliced beef flank (pho meat). Hoping for smoothies with boba since it was on the menu, but smoothies were not yet available. Also ordered Mango Tea with Lychee Jelly (also on the menu), but no Lychee Jelly was available. Settled for Popping Lychee Boba, which was good.

Though this is closer to us, we'll probably continue going to Pho Viet Nam on N. Higley or Unphogettable or Pho Thuan Thanh on Dobson instead."}
{"text":"I'll be straight to the point. Food is decent and a bit pricey. The place itself is rlly clean though and very well designed."}
{"text":"Super amazing food at a great price.  Love their Pho.  I would recommend to anyone in the area wanting some good Pho."}
{"text":"Amazing pho!!!!! So so good. We moved here from CA and are HUGE Pho lovers. This place was excellent!  I just wish it was closer to us.  Very good! We highly recommend and will be back soon!!"}
{"text":"The best Pho in the Valley.  Highly recommend the Chicken Pho. Tender breast meat in a wonderful broth, with added bean sprouts and basil.  Great staff and service.  Nice portion size with lots of chicken.  It was so good on Friday night that I went again on Saturday night.  Will make this a regular place to dine."}
{"text":"We love this place!  The service is always friendly and fast.  The food is delicious and fresh, and it's become our favorite neighborhood place."}
{"text":"The food and service were both great! We ordered the lemongrass chicken and added beef, it came with steamed rice. Tasted delicious. We also ordered chicken pho with hot and sour broth. The waitress was super nice and made both of the above suggestions. Service was quick and the staff are all very attentive. Great place, clean!"}
{"text":"Visiting from Syracuse, NY and have wanted to try this place near my parents' home. Got take-out combination bun (noodle dish with egg roll, shrimp and pork), my go-to Vietnamese dish. Their pork was dry and I didn't end up eating much of it. The rest of the dish was great! I love the fresh veggies - cucumbers, bean sprouts, lettuce, mint. My brother (tofu noodle dish) and mom (shrimp and egg roll noodle dish) also liked theirs. Thai iced tea was yummy and finished quickly! I'd come back!"}
{"text":"First time here and all in all was pretty good. I ordered the beef and shrimp spring rolls (without mint). Was very filling and presented well. I also ordered the sweet and sour seafood pho, but made a lot of changes to my order. I asked for the soup to not be sweet and sour(just normal), no crab flakes in my soup, and also added some baby Bock Choy. The chicken broth used was kinda just average. Not a lot of flavor but alright in the end. They advertise the pho as seafood, with shrimp, scallops, and squid (and the crab flakes which I asked to be removed) but I ended up getting a bowl full of squid and I got 2 pieces of shrimp and 2 pieces of scallops (the seafood also was just a little bit over cooked) it gradually got busier and went unnoticed by my server until I was just about finished with my meal. 

Atmosphere is great but with average food."}
{"text":"Went here with friends.  Always order soup.  Wanted to try something different.  Had a stir fried pork dish.  It was absolutely wonderful.  My friend had soup for the first time.  She couldn't believe the portions.  They are very generous.  Soup was in her words \"very delicious\".  Will definitely come back."}
{"text":"Saturday afternoon, seated and ordered the appetizer sampler. 2 crispy egg roll were ok, no particular taste, but good for dipping in the hot sweet sauce. 2 spring rolls were very clean and fresh, but were all lettuce and 1  tasteless little shrimp. The 2 coconut shrimp were overcooked and tough, but tasted fresh.
The atmosphere is very nice, pleasant music, just low enough to not annoy. Clean and fresh appearance. 
My brisket pho was good. Meat was perfect, broth rather bland.
Wife's bowl of vermicelli, shrimp and pork was good, but again, I thought bland.
For spiced down American taste, this is a nice place. Service was okay.
I would rate higher, if the food was tastier."}
{"text":"Tried this place cause I really love Pho, but wow super disappointment. To start, none of the four beers ordered were not available...as I learned one by one. Then finally got to order and oxtail was tasteless and way under cooked and tough; completely not edible. Took nearly 15 mins to get someone to come back to the table. I mentioned the problem and the waiter simply turned away. I finally approached someone to return the dish and to give me the check which took nearly 10 more minutes. Yikes! Do not advise you go here. Head to Tempe or Chandler, it will take the same amount of time."}
{"text":"Our new favorite pho restaurant here in the east valley. It is pricier than other pho restaurants, but the food is quality and can definitely taste and see the difference. The inside is also done up really nicely and it's on the fancier side of pho restaurants. The broth is always consistent and tasty, they give a good amount of meat and the veggies are always fresh. The spring rolls are really good and the ingredients are very balanced. Their Thai tea is always on point and service is always good too. When we don't want to drive across town to our usual spot, we'll come here and never leave unhappy."}
{"text":"Amazing restaurant, customer service is great! Cleanliness is beyond reproach! 

What you really want to know about is The Food.... Yeah, It's REALLY, REALLY good food! I had the Bun (egg roll and pork) it was quite tasty! I highly recommend this as well as the phò! Oh and If you like coffee, You simply must try the cafe Suda! They have a great tasting coffee which doesn't leave a bitter aftertaste! Thank goodness! 

My whole family can't wait to go back!"}
{"text":"Sadly i was not impressed at all. I've been spoiled with great pho places and have had some bland not so great places and this was pretty lame. The broth was bland... the steak pho was super lame and boring... the noodles were chewy and not fresh, they stuck together terribly! The leaves were wilted and sad... the steak itself was kind of gross... bland and honesty I didn't want to even eat them... I actually didn't eat them. My husband ordered the meatball, steak, brisket, tripe and tendon pho minus tripe and tendon and he said the meatballs were gross. He said he also wasn't impressed and it wasn't worth the $30 plus we spent. The pot stickers were ok... kinda chewy and not my favorite but not terrible, maybe 3 stars for those. The sauce was the same you get with store bought pot stickers. I wouldn't go back, there's a better pho place in chandler but sadly it's closed every Tuesday and today was Tuesday. Maybe we just caught them on a bad day... maybe they ran out of the good broth? I'm not sure but I won't be back :("}
{"text":"Pretty good but pricey.  Pho is street food!!!  with inexpensive ingredients and does not justify $9.50 for a bowl.  Some of the most authentic pho in the surrounding phoenix area you can get for around $7 or less."}
{"text":"Food took forever to come out. 

We ordered salmon, they brought us out beef. They said they ran out of salmon. 

We then ordered three different soups. Their water has more flavor than their soup. 

We should've just drove the extra five minutes and went to pho Chandler. 

So disappointed."}
{"text":"Family was looking for pho for dinner and this place was the closest. I called in the order, which included two bowls of pho and a seafood stir fried with crispy egg noodle. After picking up the food and driving back home, I opened up the order only to find that they gave me seafood stir fried without seafood. Wat. Turns out they placed the order with veggie only, but I don't remember ever saying veggie only; and I wasn't going to drive another 15 minutes to get the right order. According to the guy on the phone, they charged me for veggie only which is less expensive...\"I think.\" WAT. 

Anyway, entire meal tasted okay, but I've got high standards on pho (and related foods). The crispy egg noodle was so grainy; the pho tasted decent. For the price, I'm not sure if I'll be going back, but being that this is really the only pho restaurant in my area, I'll probably find myself here again in the future. Maybe then I can update my experience with a better rating. 

Price + taste + giving a meat lover a vegetarian meal = 2 stars"}
{"text":"So I am visiting from Vegas for the holidays. 
Driving down Gilbert Rd. my Brother and Sister noticed the sign for Az. Phô and Grill 
That was Wednesday.
Since then my Brother was feeling a bit under the weather. What better cure than a hot bowl of Phô??!! 
I came down and ordered 3orders of Phô, a BánhMi sandwich and the combo appetizer togo. While waiting for my order, I met Tom the owner. We chatted and before I realized it my order was up. The server, since I asked for uncooked noodles gave me specific directions from the Chef on how to prepare the noodles at home so they were properly cooked. Came home and was pleasantly surprised at how delicious our Phô was!!!! Everything we ordered was yummy!! 
My Brother feels better, our tummies are full and will definitely recommend Az. Phô to all!!! And not to mention whenever I am back in town it will be a regular stop!! Finally a go to spot nearby!!! A must try for everyone!!!"}
{"text":"This place has the best pho of anywhere I have ever eaten, not the cheapest but the best. I ask for the steak on the side raw. And they bring more than twice what other places bring. There is a ton of tendon and brisket. The broth is simply the best ever The service is good and the place is clean."}
{"text":"Had an order of spring rolls and a large bowl of veggie pho - excellent!!  The pho was packed with great veggies.  Service was very good.  Only been open for five weeks.  Pretty busy for a Wednesday lunch.  Will be back."}
{"text":"Great great food! I had the fried rice with pork and it was excellent and the right amount of serving while my wife had the pho and it was great.  Back in Los Angeles, we had a pho place we would visit regularly and this is our new pho place when we are craving it."}
