{"text":"A friend and I decided to stop in to check out the much-lauded \"halfy hour\" specials from 3-5pm daily at Añejo, which I definitely think it lived up to in value and drink quality. We ordered 2 margaritas: a mango (at the suggestion of the server) and a guava (at the suggestion of my craving for tropical fruit), to start. The scotch-sized glasses were unexpected but for the $5 margarita special, especially potent but still very easily drinkable (actually 1.5oz or 45ml of tequila to those of you that have properly metric-ified yourselves). 

Secondly, we had to try the half-price tacos. I had 3 flour tacos with chicken, the smoky adobo pork, and the favourite of the night, the barbequed wild boar. The waitress also recommended the snapper but we're not big on seafood. The tacos were pretty filling as they were quite meat-heavy, so after 3 I was feeling pretty satiated! The flavours were good but I did find the chicken tasted either a little gamey or freezer-burnt. Might have just been the batch. However the wild boar tacos heartily redeemed the chicken ones. Delicious! 

My recommendation for dessert has to be the churros, which we split (2.5 each). If you're not familiar with this common Latin-American dessert you should google it ASAP. The insides of the churros were perfect - eggy and moist like a honey cruller from Tim's, but the outsides were sweet cinnamon crunch. And you know if it's served with warm dulce de leche that it's going to be fantastic.

Overall, I liked the location and interior decoration, and will definitely come back again to work my way down my margarita bucketlist. I'd highly recommend making a reservation on a weekend though because it seemed steadily busy. 

Transit access: 5 stars! For transit commuters and responsible drinkers, there's a bus stop serviced by buses #3/17/419 immediately outside and across the street. For non-drivers this is a great option as the #3 runs almost every 10 min and connects with the ctrain downtown within 10 min as well."}
{"text":"Oh and let me add to this. A few months ago, my friend and I went here again (yes, I believe in giving places second chances). I must say, the food taste was pretty incredible. I just inhaled guacamole! Deelish! 
BUT, when my friend and I both went back home, we both threw up and spent the night in the bathroom. May be it is just me, but my experiences here were just plain awful."}
{"text":"Probably the most Bland Mexican food I've ever tasted. The Ceviche which should be full of flavour had none! And my main dish was even worse... I had the molcajete with meat and it just tasted watery... No flavour or spice at all...

Decor... Bad Mexican tourist art...

Service was great though and it appeared that they had a good selection of tequila so  I guess it's a good place to drink."}
{"text":"I hear Anejo is one of the newcomers to Calgary in an explosion of solid restos in town the past few years. I was passing through for work and a good friend suggested we catch up over dinner here. The place has great ambience - the bar especially - the bottles of spirits are lit from behind, if I remember correctly? We had the table-side mixed guac (made with three different salts), coconut chili margaritas, fish, chicken and pulled bison (Calgary twist!) tacos and finished with chorizo (think donut not sausage) dipped in the richest warm spiced chocolate sauce you can imagine. (I'm giving this place 5 stars for that chocolate sauce alone!) As our server pointed out, they serve Mexican, not Tex Mex (ie, no cheese or sour cream or hard shells, etc). All of this for under 80 bucks for 2! Thanks Anejo, you've done well."}
{"text":"My first time there. We went during happy hour on a weekday. We had a reservation but he place wasn't too busy anyway. 

For starters we ordered guacamole which was made table-side, nice touch. It was great, and I am not sure but I suspect that the tortilla chips might have been made in-house. If they weren't, then they're darn good forgeries. They were very crispy and didn't taste like they came out of a cellophane bag. 

I also ordered a margarita special which was a Paloma and for whatever reason I got served a double, but they only charged me $6, so lucky me. Beginners luck, eh. 

For mains, we ordered an assorted plate of 6 tacos (2 each of pork, chicken, and chorizo), and a special dish of 3 pork belly tacos with pineapple salsa. They brought out condiments of a spicy mayo and a green sauce that I don't remember the name of. They made a point to mention that the green sauce was made somewhere in Quebec and not in-house. 

There wasn't much difference in the pork and chicken tacos as the veggies were all the same, as well as the seasonings. The meats are shredded in both cases, and well seasoned, but next time I would order a fish taco or something instead of having both chicken and pork, being so similar. The chorizo was spicy and nice, but was very messy and was a bit difficult to eat without getting crumbled meat all over. Maybe I'm not good at eating tacos, I dunno.

The pork belly and pineapple ones were the best, for me. The pork belly was crispy and went excellent with the pineapple. I'll be having those again for sure. 

And because it was happy hour, all our tacos and margaritas were half price, so we got the chips and guac, two plates of tacos, and three margaritas for just under $65 including tax and tip. Way cheap for the amount and quality of food that we had. I'm definitely a brand new fan and will be returning."}
{"text":"We had Pozole, tacos, coconut shrimp and guac - cannot get better for that! Need Menudo on the menu."}
{"text":"Easily my favorite Mexican restaurant in Calgary! The tacos are STELLAR, the service is great, and the salsa de molojete is absolutely fantastic! My fiance and I are huge fans and we go pretty frequently. As for their drinks - I love the paloma, and the classic margarita is perfect as well.

Service can be a tad slow, but never slow enough that it's a problem. And we've always have had friendly servers. It gives you a chance to sip your margaritas, relax and chat with your dinner companions. 

Great ambiance, food, drinks and pretty good service!"}
{"text":"I've been to Anejo a few times, the most recent being on a very warm Tuesday evening with a 7:30 pm reservation. The place was absolutely packed, noisy as hell (I had to shout at my dinner companion across our little table), and the service was extremely slow. Granted, it was very busy, but this went beyond that. We waited extremely long times to be asked if we wanted another drink, and then for them to be refreshed. And it was about 25 minutes from when the bill was delivered for the waiter to return with the debit machine. In which time the manager (we think) checked on us twice and prompted the waiter to tend to us so we could pay. 

Good: The margarita menu is awesome, and the coconut chili ones are my fave.
Bad: they are poured short with glasses so full of ice that they are gone instantly. I suppose I should ask for no ice next time. Maybe it wouldn't feel so bad if it weren't 40 minutes between drinks due to inattention.

Good: The tableside guacamole is fresh and beautifully flavoured, served in a lava bowl with a generous bowl of chips. Plus, the guy that made it was quite delicious.

Bad: We both ordered the chili rellenos and they were only lukewarm and disappointingly bland. The stuffed peppers and the sauce, both. Neither of us finished them. 

Good: The food I have had in the past includes the fresh tacos -- I have tried veg, pork and chicken and they were very good. From what I can gather some menu items are good, and others are consistently meh. I would really try working on reworking those MEH things people mention in their reviews.

The decor and location of this place is nice, but when busy the high ceilings and music create a din that is nearly impossible to speak over. 

I might go back for guac, chips and a margarita, maybe on the patio where perhaps one needn't shout to converse. But I felt the service was very lacking, so I'll probably leave it for awhile."}
{"text":"Nice busy restaurant but probably should be called a bar.  Bartender was great but food wasn't anything special. I asked about the enchilada at $24! But didn't want potatoes and was told the enchiladas were already made and they couldn't remove the potatoes. We ended up choosing a variety of tacos and they came cold! Tortillas felt like they had just come out of the fridge and the fish nicely crusted was cold.  Bartender quickly returned them to the kitchen but they came back hot on the outside cold on the inside. Microwave perhaps? Anyway, next time I'll just stick with the guacamole and drinks."}
{"text":"This is a great spot for a date the service was amazing! The servers were very helpful and made you very comfortable with their menu and about tasting their tequila flights. Our appetizers and drinks were amazing and we loved the atmosphere. The only let down was the main course not that is was horrible but is was just average compared to everything else."}
{"text":"Añejo's happy hour is the best around (but tragically only 3-5pm). $2.50 tacos? Yes please! And they aren't sad little happy hour tacos ... They're huge and have a bunch of hot sauces to pair up! Make sure you ask for the complimentary pico de gallo to throw on top!

The guacamole is as good as it gets. They make it right at your table (the awkwardness is worth it). 

If you like spicy, try the chilli coconut margarita. It's my favourite drink I've ever had."}
{"text":"Loved it, Service was great and the selection was unbelievable. 
This is a place that you will not shoot tequila and with salt and a lime.. what you get here is quality and and you sip it... we were also told the story of how quality tequila was made.
Watching the fresh made guacamole made in front of you was nice. and the taste and quality was soo good"}
{"text":"We went to this restaurant without a reservation and were surprised to wait only a few minutes to get in. We tried a few of the flavored margaritas. The fruity ones were ok, but the ginger margarita was definitely my favorite. It was a classic lime margarita with a hint of ginger and paired well with the food. I had quite a few! We also had the guacamole prepared at the table. It was delicious, fun to watch, and informative. The only regret was that it was a bit too filling for two of us with tacos and shrimp still to come. The tacos were very good as well. They were small and manageable to eat and I enjoyed that it came with a variety of spicy toppings to add. Drink service was a bit slow, likely not the waiters fault but because the bar was a bit busy. We will go back. Maybe on a less busy night."}
{"text":"We took advantage of a rare sunny weekend this summer and sat on the patio. This restaurant features a menu with more appetizers, shareable and small dishes than main courses. Given the slick yet relaxed festive atmosphere of this place, the focus on less formal dining makes sense here. The significant twists on traditional recipes mean this is neither a cheezy Tex-Mex fiesta house, nor a traditional Mexican restaurant.  And it works.

We ordered 4 non-main dishes, and I must say they were all really good.  This merits 4 stars right off the bat. Freshness and craftsmanship are at the forefront, evident in the fine preparation and artful presentation of the ceviche sampler, and of the tuna \"tartare\". The use of capers in one of the ceviches was a pleasant surprise that worked well, as was the tequila compressed watermelon in the tartare, which comfortably straddled the line between savoury and sweet.  None of the three ceviches (containing 4 types of seafood) was overly acid, sweet or salty, and the extremely fine dice of peppers/herbs/flavourings made every bite consistent.

The third dish was a pozole (pork and full kernel corn grit soup).  This preparation was quite non-traditional, including mushrooms, chorizo sausage and cheese, but definitely worked as a whole.  My only complaint would be that many people would probably like to add some heat or acid to this soup.  A simple improvement would be to provide a small side of lime wedge and a cute tiny bowl of chilli sauce. 

The final dish was a Mexican \"fondue\", which is served in a hot mortar made of lava rock (the traditional \"molcajete\").  Here some showmanship is on display, as the bubbly cheese is mixed with the mushrooms, sausage, etc. tableside, then served with warm tortillas.  Simply delicious, though it might have been nice to have the option of cilantro (this herb was noticeably absent from all dishes, which would probably add an extra star for some people, but not me).

Maybe the mains may be good too, but they are quite pricey...the dishes we had provided a nice variety, and I think were reasonably value for money.  If you can arrive before 5pm, you can get your happy hour margaritas for $5, which also eases the pain. The refreshing margaritas do stand out as a beverage choice, as they have a large variety of flavours, made with real ingredients.  For tequila aficionados, there are more available here than you can shake an oversized molonillo at.

While our service was in general quite good, one area for improvement would be consolidating or at least guiding people through the many menus.  We missed the separate taco menu completely (which is also not on the Web site), as it was lost in the shuffle of the tequila and drink menus, \"What's fresh\" menu, and regular menu.  Be sure to find them all!  I guess I'll have to come back..."}
{"text":"A loud, busy place that feels high-energy when you walk in. We had the tableside guac and while it was delicious, it was super salty. We ordered another for the table and it was better. The service was OK, but not stellar. The margaritas are a bit on the small side and they'll definitely try to upsell you on more drinks. It was OK, but I'm not sure we'll go back again soon, as it was so loud our party of 4 could hardly hear each other at the table."}
{"text":"Went to Anejo the other night for dinner and drinks. Had a pleasurable experience with friendly staff and we were started off with an excellent guacamole mixed right at the table. Drinks are also very good; the ginger margarita is a must try. Thanks for an excellent evening Anejo!

- Steve P."}
{"text":"My first time at Anejo was at night on Thanksgiving Sunday, just for drinks. It was pretty empty when we arrived and the bartender told us he was planning on closing in half an hour. We stayed for a drink anyways, and just our luck more people started showing up. The bartender decided to stay open and we stuck around for a couple of hours. The drink menu is fantastic - as long as you like tequila :) My favourite was the prickly pear margarita. Even though it was a slow-ish night, the atmosphere was still really fun. The bar area is gorgeous! 

My second visit to Anejo was for my mom's birthday dinner. We arrived at 5:30 pm to be safe because there were 6 of us, the space is small, and they don't take reservations. It started getting really busy around 6:00 - 6:15 pm, so we made the right choice coming early! 

The appetizers didn't go over well at the table. The guacamole was bland, and too small of portion for $12! I like more heat and lime in my guac. The salsa was okay, but another small portion. It should really come free to every table, like bread at other restaurants...  The coconut shrimp was good, but only 5 pieces for $16!

The tacos and the chile relleno were the stars of the meal. We ordered 12 tacos to share between six of us and sampled each type of filling. The crispy red snapper was my favourite because it was breaded and fried. The three salsas that came with the tacos were yummy, each one was very different from the others. The chile relleno was amazing, spicy and cheesy, like a giant jalapeno popper! 

I shared the rib eye with my BF. The lime butter was actually a thick spread across the entire steak. I think it may have had cilantro mixed in too? The steak tasted good, but the meat was chewy and it was served cold. 

The service was bad. We had a combination of four different servers through out the meal. They forgot to enter the salsa and my mom's main into the computer. The salsa came pretty quickly after we reminded the server, but it took half an hour for my mom's main to come out after our other mains were delivered. Additional drinks never came, side tortillas were forgotten...  

I will definitely come back for margaritas, tacos and chile relleno, but I'm going to avoid the appetizers, and hope the service improves with time."}
{"text":"The main attraction of this place is the atmosphere. A++ for the decorations, layout and music. Very well done. 

Our server was great. He timed everything well and even had a great recommendation of dessert tequila for us. Super friendly guy, very happy with him.

The food was okay. I was expecting amazing, from what I heard, and for what they charge, I was expecting higher quality. My boyfriend's lamb was dry and my bison tacos were so-so. The ceviche we got to start (for $20) felt pre-packaged. The sangria was fine... not amazing, not terrible. I've had both better and worse (but usually for less). The churros we got for dessert were cooked for too short a time at too high a temperature, giving us a dessert with a charred outside and raw inside. I honestly expected better for such a simple, traditional Mexican dish at this exclusively Mexican restaurant. 

The hostesses, on the other hand, were awful, and gave us a horrible impression of this place both on the way in, and the way out. It was our anniversary, and a very special night for us as we had heard amazing things about this restaurant and hadn't been yet. We contacted Anejo beforehand to let them know this. They said they'd put us in a nice corner table. When we got there, we got the nice corner table, but the hostess actually said to us, \"Ok, so, the next reservation at this table is at 7, so you have an hour and a half.\" Excuse me? We stayed until close to 8. On our way out, the other hostess loudly said, \"Was that the table we needed to get rid of?\" Well, yes, you certainly got rid of two customers ever coming back, that's for sure. 

Overall, there are a lot of other places I'd rather go to in Calgary t o spend this kind of coin on a meal. If they lowered their prices slightly, to match the quality of service and food, or started offering better service and food at the current prices, I'd go back."}
{"text":"-Overpriced-

Pros - neat decore, metric fuck-tonne of tequila. (Worth a visit on the tequila selection alone. Just not for food.) Awesome salsa, passable guacamole.

Cons - Service, food quality, no spice, poor service, expensive, not particularly flavourful, expensive ingredients utilized poorly, not really Mexican cuisine, drinks are three-quarters ice (and at $8.50  a pop, that's not super great) 


Once again, I'll say go for the tequila, stay away from the food.

Bang for the buck, I'd go to Los Chillitos or if you're just after food, go to Mucho Burrito, Much more flavourful."}
{"text":"Happy hour is amazing and the service is always incredible. Everyone who works there is friendly, helpful, and clearly enjoy there work. LOVE coming here. Half off tacos, margaritas and tequila 3-5."}
{"text":"Great atmosphere and excellent tequila selection.. if you are a beginner with tequila try the silver Asom Broso - really nice!"}
{"text":"Delicious food available here, and the options are good. I had the Mac and Cheese with a tequila sauce and chili panko seasoning, and it was delicious; perfect for a cooler day. The servers are friendly, and if you order the guacamole to start, they will come by and mash it together in front of you!

They have a great selection of tequila at the bar (as a Mexican restaurant should) and the margaritas look delicious. I'll be back to try for sure.

The price can be a bit steep, but worth the cost to get food this good. 3 tacos are $12, Mac and Cheese was $14."}
{"text":"As part of the Calgary Poutine Crawl 2013, this location was stop 5 of 6.  The food is great, they did their version of poutine, Mexi style.  It was interesting.  Pulled pork, with Nachos.  It was good.

For a poutine, I wouldn't go here but if I want Mexican, then definitely thumbs up!

I liked the colour and the split level seating.  Upstairs was small but can be very romantic for the right setting."}
{"text":"Homemade guacamole. Smooth tequila. Awesome atmosphere. Attentive and friendly staff. Tasty tacos. 
Do: come in the day time to get a table. Order the strawberry or mango margarita. Tortilla warmers and soft bread. 

DONT: forget to tip your waitress 20% (at least)"}
{"text":"We absolutely loved the Cherry Margarita, Chips and Pico, and freshly made guacomole at our table.  The service was incredible and the food portions were appropriate for the price.  Very authentic Mexican Food. It was fun for the whole family."}
{"text":"An anejo  \"must try\" is their chili coconut margaritas!!! Get them during happy hour for 1/2 price! So worth it!!!!"}
{"text":"Whats a fun place!  Great food and great Tequila!  Always busy and friendly service!"}
{"text":"The staff was incredibly helpful accommodating my large birthday party. The guacamole was the best that I have had to date in Calgary, period. Next time we come it'll be for a flight of tequila and a FANTASTIC margarita."}
{"text":"Kaureena is by far the best server you guys employ, I've been here over 5 times and she has given us phenomenal service.. 

Guacamole is unbelievable and the tacos were unbelievable!

Overall, the best Mexican food in cowtown!

The place however is quite small and packed. A more spacious layout would give 5 stars"}
{"text":"Very expensive for Mexican food. Food tasted great but did not live up to the high prices. 

The chilli reno tastes great but once again... very expensive for a stuffed pepper."}
{"text":"OK.  So there are many amazing things about Anejo. The Guacamole is amazing. I'm sure the drinks are lovely, but we didn't have any. I'm just consistently disappointed by the food! I've been before and had the enchiladas which were ok, and last night we shared the shrimp and pork belly tacos. Everything was just so overdone, the flavors were drowned out. Delicious pork belly with a sweet and sour sauce layered with pickled onion? Maybe i dont have a refined enough palette but it was just an odd combination. Also really really heavy on the raw onion. If you're expecting traditional authentic mexican food, this is not the place."}
{"text":"My wife & I just came to Calgary from Vancouver and wanted to go for Mexican food while my Mom was visiting. This place looked good on Yelp so we showed up. Unfortunately, they were so busy & booked up (it was a Friday night... fair enough) that we were told it was an hour wait. The super nice hostess, Jenny, called their sister restaurant to try to help us out, even though she was busy. We decided to wait instead & took 3 seats at the bar. Within 15 mins. Jenny came & said she'd found us a table. Awesome! The service was really informative & friendly (although, to be fair, our server was a bit hurried & harried) but no matter... the side guacamole chopped freshly at our table was a real highlight & delicious; the rest was tasty as well. We are, admittedly, spoiled for restaurants in Vancouver, but I would definitely go back to Anejo (although next time, I'd call ahead for a reservation! :)"}
{"text":"Great margaritas, I had the classic and my husband had the guava. Food was medium, I had chicken tacos and my husband had the fish tacos. Guac was good. Service was TERRIBLE. Took 20 minutes to get our first drink (even water) and the guac even longer. Main courses took forever and second round of drinks came 5 minutes before we were ready to leave. Server was not nice, never apologized and just said they were \"slammed.\" It was not pleasant. Food did not make up for this and we were generally disappointed."}
{"text":"Come to Anejo if you are looking for a fun ambiance and a good margarita. Don't come to Anejo if you are looking for good, authentic Mexican food. The tacos are just OK, but taste mass produced. Happy hour is the only time i will seek out a visit to Anejo, after a horrible experience this past summer in a large party. We visited with 12 people for a birthday and were forced into a set menu, that included massive bowls of dry quinoa and overcooked protein. The food for the set menu was actually quite terrible. The service was also sub-par, i tried to order an individual margarita and the waitress told me \"its so busy that if you don't order jugs of margaritas\" (which FYI are about $100 each).. \"the bartender won't have time to make you a single margarita for about 30 minutes.\" Our table was not impressed we were pretty much being told that we couldn't each order different flavours- but that we had to order one jug for the table.
Long story short- i'll return over happy hour for a $5 chili coconut margarita- which are fabulous- but won't be spending an evening dining here again."}
{"text":"How does one prepare for an upcoming trip to Mexico? Head to Anejo of course!

Figuring I'm prep my liver and tastebuds, I got mango margarita and grilled prawn tacos (tacos de camaron). My GF got the cilantro & cucumber margarita and chicken tacos.
Knowing we were gonna get dessert (a trio of churros, toffee pudding and flan), we didn't get appies or sides. However, I've heard the tableside prepped guac is an experience on it's own, so I'll have to go back I guess!

Although it was torture to see things like coconut shrimp, ceviche and tuna poke pass by while we waited for food, kept our eye on the (dessert) prize and waited for our food. And it was well worth it! Not really sure how to eat my tacos with my hands (they were presented almost like an open faced sandwich and messy), I decided to be civilized and used my utensils.

They bring you an array of hot sauces, and I'm warning you that if you don't taste the sauces before you apply liberally, you will end up guzzling your margarita like I did!

When dessert finally came, I was super excited to dig into the churros. Deep fried donut sticks coated in sugar and cinnamon? I'm all over it!

I love the atmosphere here, and Anejo did a great job easing me into my Mexican vacation. I'll be sure to come back for that aforementioned guac and try all the other tequila based cocktails they have to offer."}
{"text":"Had lunch here on Wednesday.  This was my second visit.  My date and I each had a torta, a Mexican sandwich. I had the coconut shrimp, she had the pulled pork. They were both 'ok'. Not bad, not great. My main complaint is with their Margaritas.  I  am certain they use the premixed stuff from Costco liquor store. I buy that stuff all the time - a litre bottle costs $20. I'd recognize the flavour anywhere. I noticed they have the Marg premixed behind the bar, they keep it in a Patron bottle, so it looks more 'authentic'. They pour a tiny splash of it in a short glass FULL of ice, and charge $9. I finished mine in 3 small sips. What a rip-off."}
{"text":"Anejo delivers 2 of the greatest treats in Calgary 1. Table side guacamole that is awesome. 2. Killer coconut and spice margarita. I could eat this every day, but that would be a wee bit addictive."}
{"text":"These guys have a Five star Tequila menu! I have ever seen such a selection in Alberta or BC. I ordered Two types off the flight menu and thought I would be getting 1.5 ounce of each to try but what came out was 3 0.5oz sample of each in the blanco respado and anejo varieties. What an incredible way to experience the aging of certain brands of tequila. The place is busy, good atmosphere. Our service was excellent. The handmade guac and salsa at the table was great. The taco were quite good although not as flavorful as I hoped. Great night out, a bit on the pricey side but worth it once in a while."}
{"text":"The bartenders like to short pour.  My first margarita tasted like juice so i watched the bartender the second time and sure enough it was quite the short pour.  I was going to order wine after that, but their wine list was terrible.  On a high note service was great, and the the Guacamole was delicious!  It's also got a cool vibe inside."}
{"text":"I went here on a Saturday with a group of friends for their daily \"halfy hour\" from 3-5. The value during halfy hour is great! Our server was helpful and friendly. We had a great time trying out all the different margarita flavours and tacos. They have a wide selection of cocktails. My favourites are the guava and chili coconut. The tacos are pretty basic though. I wouldn't order them for regular price. Overall great spot for an afternoon date."}
{"text":"As far as happy hour deals go, this place is right up there. Between the magical time of 3pm - 5pm there's a bunch of tasty and cheap tacos and margaritas to be drunk.

What's the deal? All of their 1 oz (1.5 oz?) margaritas are $5 (normally $8 - $9ish), bottles of beer are $5 (normally $7 - $9), tacos are half price for $2.50 (normally $5) and tequila is half price (usually $10ish and up). And if you want to double your margarita it's $10. I asked.

The margaritas are delicious. My favourites were the Mezcalarita (smokey) and the Classic (yep, no need to mess with this one by adding any other flavours). The Chilli Coconut was pretty tasty too, although actually quite spicy!

The tacos are pretty good, I recommend getting them with the more authentic corn tortillas. The server recommended the wild boar, and this was a good choice! Definitely a good deal at $2.50 each.

I came here on a Friday afternoon just before 4:30pm and the place was PACKED. And loud. We couldn't have much of a conversation but a fun atmosphere. I managed to get a table for two that was free til 6pm just by turning up, but I'd highly recommend booking ahead of time on their website (http://anejo.ca/home/#reserve). 

They were also totally slammed. It took a while for someone to come over initially and then to flag them down later on. The drinks also took a while to make for each round, so be sure to order your next one each time your drink arrives to save you looking sadly at your empty glass."}
{"text":"Must stop for tacos!!! This place is so fun.  The staff are welcoming and funny and the ambiance is trendy yet inviting.  The food is simply delicious and the marsgritas are Devine especially the mango or the coconut!"}
{"text":"Det här stället har riktigt bra atmosfär. Det känns genuint och inte påtvingat. 

Maten är riktigt bra och man får mycket för pengarna, var tvungen att ta hem resterande mat för portionerna var så stora. 

Hela upplevelsen är ett måste om man är sugen på mexikanskt i Calgary."}
{"text":"The Queso Fundido, Salsa, Guacamole & Tacos are AMAZING! 

Try the child coconut margarita as well!

Best atmosphere and ambiance, love the food and the staff is super fun and helpful.

In the Summer try to get on the patio and also has the best Tequila selection in Calgary!!!"}
{"text":"First time to the restaurant last week and enjoyed the food and ambience. Guacamole made in front of you, waitress was friendly but a few staff standing around that could of helped when we would be looking for help."}
{"text":"I threw up when I got home after eating at Anejo.  Watch out for the fish tacos - mine was rancid.  And in general the food was mediocre and overpriced.  The strawberry margarita I had was tasty but TINY!  Less than half the size of margs at better Mexican restaurants.  If all you care about is ambience, attractive waitresses, and wide tequila selection this place might be for you."}
{"text":"Service was great. Food was awesome. Table was a little small and was quite busy. Glad I made a reservation"}
{"text":"Atmosphere is good. Bartenders friendly. Good margaritas, favourite was the Coconut chili margarita was very good"}
{"text":"We went to Anejo last night for the first time, based on a recommendation from a good friend.  The appetizers were amazing!  Marguerita's were good - just too small....  the space is pretty cramped but has definite potential for people watching...we will be back but will request a larger table for sure!"}
{"text":"This place is even better than Tacofina in Gastown, Vancouver.  Sooo frickin' good.  Suddenly I love Mexican food. We shared some fresh guacamole made at our table, then I had a 3 taco combo - chicken, pork, and snapper. It was delicious!  This restaurant had a great interior with dark colours, Mexican artwork, and lots of natural lighting.  Next trip back to Calgary and I'm having lunch here again."}
{"text":"I have a list of many different restaurants to try and Añejo was one of them. We heard that Añejo does get quite busy on the weekends and that you cannot make a reservation so we decided to show up early for dinner. 

By the time we got there (5:30) it was already busy so we were glad that we showed up when we did! Once we walked in we got escorted to a comfy corner booth and were briefly explained the menu.

As I looked over the drink menu I was drawn to the margaritas (also due to the fact that the server said that they were \"the best in town\") so I thought I would try the Strawberry Rhubarb.

Let me just say that the margaritas are AMAZING. Small but strong, the mango and chili coconut are my fav. 

We ordered the guacamole that is prepared at your table to start. It was very fresh and delicious and I did enjoy the experience and the presentation. I will even say that it was my favourite choice of the night.

For my main I ordered the three soft tacos (2 with pork and 1 with chicken - we were sharing and both wanted to try the pork) with a side of lime cilantro rice. I really enjoyed the chicken but thought the pork was just alright. The rice was nicely seasoned and went great with the tacos. The other dish we ordered was the beef tenderloin molcajete, it came sizzling to the table with 2 small tortillas. We had to ask for more tortillas a couple times. The steak did have a nice flavor but it was kind of tough and I wasn't a big fan of the cactus leaf, it was very chewy and just felt like it was added purely to make the dish more exciting and didn't have much flavor. 

I loved the décor and the nice atmosphere and we will certainly come back for some tacos and margaritas.....

TIP: Happy Hour is from 3-5 and it is $5 dollar margarita's and half off tacos... SO GOOD!"}
{"text":"As an American, I was shocked by the prices, but after some time in Calgary I realized these prices seemed pretty normal. I guess with the lower violent crime rate, lower infant mortality rate, and universal health care, Canadians have more money to spend on eating- I'm jealous! 

They unfortunately didn't have vegan labeling and it didn't look like they had a lot of vegan things to choose from- but the server was very helpful and understanding. My three black bean tacos took a long time to come, and my friend's vegan salad came out with non-vegan dressing on it. The server kindly got us a new salad and comped both of those food items- which was really nice. The great service definitely saved this from being a lower rated review! 

I hope the ownership at Anejo do two things:

1) Label vegan options and provide more of them. Labeling makes it easier for customers and staff, and 13% of the population that is vegan/vegetarian will appreciate it. Vegan food is typically healthier and better for the planet, and it's a fast-growing trend, so you can make money and make our world better by offering vegan food.

2) Abolish tipping. Just read this paragraph: 

Studies have shown that tipping is not an effective incentive for performance in servers. It also creates an environment in which people of color, young people, old people, women, and foreigners tend to get worse service than white males. In a tip-based system, nonwhite servers make less than their white peers for equal work. Consider also the power imbalance between tippers, who are typically male, and servers, 70 percent of whom are female, and consider that the restaurant industry generates five times the average number of sexual harassment claims per worker. And that in many instances employers have allegedly misused tip credits, which let owners pay servers less than minimum wage if tipping makes up the difference.

Citations for those claims can be found here: http://www.washingtonpost.com/blogs/wonkblog/wp/2013/08/15/the-case-against-paying-waiters-in-tips-in-one-irrefutable-paragraph/"}
{"text":"We went to Anejo for a late-night dinner and drinks.  Being from Los Angeles I know a fair bit about Mexican food and Tequila, so we were really excited.

The tequila selection was definitely decent - I'd like to try a flight sometime, but I was really hoping to be \"sold\" on the idea by my waiter, who never mentioned it.  We settled on margaritas, my boyfriend had an original and I had a Mango.  I felt the margaritas were decent but wished they weren't so sweet.  I asked for salt on my rim instead of sugar which helped.  I will say, that both my bf and I make homemade margaritas all the time with freshly squeezed lime juice so we are spoiled.  I really wish that a restaurant that is a \"tequila bar\" would serve a real margarita with lime juice instead of sweet mix, or so much agave.

Second, the food.  We ordered the Queso Fundido, which I thought tasted like pizza in a bowl.  Was delicious, but hard to eat - my suggestion is for them to add another type of softer cheese to this to provide a more dip like texture which would be easier to eat on a chip.  I ordered the Short Rib Tacos (3), which were underwhelming - where's the flavor guys - the meat was bland, and the condiments boring.  Also, the salsas they served in the little glass bowls were really bland and I missed a real pico de gallo or a table salsa to dip the chips in.  Next time I guess we will try the guacamole.

My boyfriend had the Mole Chicken which he thought was okay, however it lacked the depth of flavor that we would have liked.  The complexity and layers of flavor of a real mole are something we were looking forward to and this was just, basically a standard sauce without much gusto.

For dessert - we had the molten chocolate cake with tequila berries which I thought was delicious and memorable.

I feel that the ambiance at Anejo is cute, they are lacking in the food and drink department however which is what will bring their customers back once the \"newness\" of the establishment wears off.  Also for the same price we could dine in a really amazing restaurant like Ox and Angela, or Una or somewhere that I find the food and atmosphere to be first rate."}
{"text":"The best Guacamole I have ever eaten!!! And those tacos weren't too bad either. 

Had pork, chicken and beef tacos on the corn tortillas and they were delicious! All fresh, shredded meat, very well seasoned and juicy. 

The waitress was knowledgeable and kind- really made our first experience a great one!"}
{"text":"Great vibe, awesome staff, delicious selection of margaritas. The portions are small so I would not pay full price, but you can't beat their happy hour! Best guacamole I've had in a long time - perhaps because they make it fresh at your table."}
{"text":"I went for lunch with my husband and baby. It was definitely hard to change the diaper in that washroom. We ordered the coconut shrimp sandwich and 6 tacos. It seemed a bit pricey for what we got. The side for the shrimp sandwich was a few pieces of spinach covered with an unknown dressing with no fixings. The coconut shrimp were crispy and pretty yummy. I enjoyed the tacos too but was disappointed that the shell on them were wheat tortillas and seemed store bought or old El Paso style. For $26 for 6 tacos I think it was overpriced. I think I'll have my next fiesta at home."}
{"text":"It's good for happy hour margaritas -full priced margaritas would be too expensive. I was here when they started (~3 years ago) and today. The crowd has changed significantly! I guess very young and hipster-like servers don't help keep a more sophisticated customer base.  Come here for a casual dinner, but nothing else"}
{"text":"Anejo graces the Mission community with its own take on Mexican cuisine. Nestled in on 4th street right next to Towa Sushi, Anejo takes Mexican food as we know it and translates it into something that is both inspired and unique. The Jalisco styled menu items are fresh and tasty, a far cry from the heavily sauced and cheesy monstrosities of bad Tex-Mex you might find in a forgotten cafe or local food court. Fresh ceviche, savoury tacos filled with slow cooked meats and crispy snapper greet you here. Vibrant colours and contrasting textures please the eyes as well as the palate in the dishes that are represented. In addition, Anejo makes some of the finest margaritas in town using fresh quality ingredients and tequila from their selection of over 100 varieties.

The food at Anejo is uncomplicated and unique. It sets the stage for a dining experience that includes friends, loved ones and a promotes a great time. I feel comfortable in the relaxed setting. The design is modern with accents of Mexico without the kitsch. Service is friendly and the knowledge of the staff on the menu and drink program is pretty good. 

Speaking of the drinks, the margaritas are refreshing and very tasty. It's remarkable what good ingredients can do to transform a cocktail. I recommend the Prickly Pear, a naturally sweet and refreshing blend of fresh fruit puree and the finest tequila... a little tart with the unapologetic presence of that signature tequila flavour. Unbelievable.

We also started things off with a trio of ceviche to get things going. Basa, tuna, and shrimp/scallop graced our table a few minutes later. What I was surprised about with these ceviches was that each one had a little different spin on flavour. Not only was it because of the fresh fish that was the focus of each one, but each ceviche also had a little different preparation. My favourite was definitely the tuna ceviche, as it had a little touch of sweet and tartness from the fresh mango capped off with a little warmth from the serrano chili.

The tacos are also very tasty and available in beef short rib, adobo pork, crispy red snapper, chicken, or vegetarian. The flavours of the meat aren't too overly aggressive as they can be dressed up with the selection of fresh salsas that also accompany them. They are also filled with pickled cabbage, jalapenos, cilantro, red onion and avocado to provide a little textural contrast and colour. What I didn't find was some fresh lime for that hit of acidity.

The Red Snapper entree is a generous portion of fish, topped with beautifully cooked shrimp and a delicious Spanish Romesco sauce. It sits on a bed of fluffy lime cilantro rice with grilled onions and fresh bell peppers. The rice has a nice light flavour that goes well with the meaty snapper. All this is brought back to earth by the Romesco sauce, a slightly sweet tomato based sauce with red bell peppers, garlic, ground almonds or pine nuts. The exact recipe here, I'm not sure of, but it's a great match for fish nonetheless.

My impression is that Anejo is doing well by keeping things simple. The menu isn't a sampling of the entire country, nor is it another reiteration of an overplayed perception of what Mexican cuisine has been transformed into by the Taco Bells and Chi Chi's of the world. The drink program is amazing and the research into the vast tequila selection shows real passion. Thanks for the great evening."}
{"text":"A very yummy meal and a pretty atmosphere especially if you sit by the window. 

The tacos... YUM. Fresh guacamole made in front of you, also YUM, and a hot meaty cheesy messy appy was also very YUM. Coconut shrimp, yum YUM. And the \"pitcher\" of classis Margarita, a classic yum. 

The music/noise level was so high that we all had trouble hearing each other, and the waitress kept trying to clear our food before we had finished. We felt pressured to leave, but considering how much food and drinks we ordered, I can't imagine why?!"}
{"text":"I've been to anejo twice.  The first time just for drinks and this time for food. We went around 4:00pm and the restaurant had about three tables already. We stood at the front door for about 10 minutes to be seated and no one came. We decided to seat ourselves. 

We waited another 10 minutes for someone to acknowledge us and when they finally did they asked who seated us. When we told them now one the waiter seemed annoyed. 

We ordered tacos and some tequila.  The tequila wasn't really my favourite but I don't really know much about tequila so not really the restaurants fault. 

The tacos were alright but they were really just a lot of purple cabbage and some meat and by the time they brought the hot sauces we had mostly finished. 

The restaurant itself is designed nicely and I could see it being a nice date night if they can pick up on the speed and friendliness. 

The waiter sat with us after we paid to tell us about tequila and what each type was like / the taste. Would have been nice to know that before hand as we'd have likely enjoyed the tequila more and perhaps purchased more. 

I'd give them another try but probably not for a while, there's much better tequila and taco places in this city for the price."}
{"text":"Overall: Great environment, good friendly service, average food, expensive prices.

Having lived in SoCal I have high expectations of Mexican restaurants.  For Calgary this is not bad.  The table side guac is good.  Come for the ambiance, not the food.  Located in a great area, the restaurant has 3 levels including a patio out front.

Service was slow, yet friendly.

The two missing stars are for:

1) Expensive for Mexican food (although you pay for the ambiance and location)

2) We finished dinner and wanted a few more drinks, but the server said she couldn't serve us because another reservation had our table!  We were not offered another table, or even to be moved to the bar - nothing.  I have never been to a restaurant that stops your service and kicks you out.  We had to go down the street to another restaurant to have a few after dinner drinks. - Strange way to run a restaurant.

Edit: came a second time and found the service still lacking and food and drinks over priced."}
{"text":"Our waiter was awesome... initially. The way he described one of the drinks when we sat down was so enticing, both my friend and I were immediately sold on it. As well as the second drink, even though it wasn't as delicious (but still tasty!) as the first. While the margaritas in other places in town may be bigger, Añejo scored points for quality.

But then as the night went on, he started to disappear more frequently and by the time our meal was over, might as well have changed in to a red and white sweater and called himself Waldo. We were constantly scanning the restaurant for him. I was on the fence about ordering the Strawberry Rhubarb margarita for dessert (since none of the desserts at Añejo are vegan, which, no surprise there... but if you're going to tell people on your menu to ask for the vegan options, actually having options would be nice), but since he took so long to come back; my food had settled and I no longer wanted it. 

Also, when he brought out our chips and salsa, he also brought out the 3 salsas that are meant for the tacos. Neither of us realized this initially, and just assumed he'd bring out more salsa for the tacos. But nope, that was it. Not a terrible thing, it just made the main course of the evening kind of bland and dry, and since he kept disappearing; we couldn't ask for more. As for the tacos themselves, since I wrote my last review, they've changed the veggie tacos to black bean. Instead of fried strips of tofu, you now get raw black beans. They're not bad, would be great if they had both tofu and black beans, and the black beans had a bit more flavor to them, but they're okay. I'd get them again. The corn tortillas seemed a little undercooked, but I'm glad they're available.

So... again, on the fence. This was really more of a 3.5 star visit, would've been 2.5 if the other staff weren't so awesome and kind of made up for our friendly, yet absent-minded Where's Waldo. Drinks were great, salsa is delicious, though not spicy (in terms of heat) at all. Probably need a third visit to seal things for myself :)."}
{"text":"I really enjoy coming here, it has a great vibe, amazing margaridas, and delicious simple food. I've never had a bad time at anejo, just sometimes it is hard to get in since it's too busy!"}
{"text":"I went to Anejo restaurant on a Tuesday night with my girlfriends for a fun birthday night out- thinking it would be a great experience.  It really was not.  I unfortunately went here thinking there would be some options for vegetarians, but only to find a couple.  The issue is, if you can't eat cilantro you are ultimately out of luck.  I first ordered a margarita which was so sweet I could barely drink half of it.  When it came time to finally order food and our server came back 45 min later I had let her know of my dietary restrictions.  I had asked her if I could just order plain tortilla shell with rice inside, but without cilantro.  She said she would ask the kitchen staff if they could do that for me.  Unfortunately when she came back she said that all the rice they had was pre-made with cilantro.  I asked if I could get some fresh rice made and she said they wouldn't do that.  She then offered me a cheese quesadilla as a different option that the kitchen could make.  I agreed as that sounded great- so I ordered a cheese quesadilla with sour cream and no cilantro.  To my surprise when it came back there was two- FOUR inch tortilla's with a skiff of cheese in the middle and cut up into tiny pieces and garnished with cilantro....nice.    I asked her if that was all it came with and she seemed angry with me that I didn't \"express how hungry I was\".  She then went on to tell me as if I were a child that I can eat that and let her know if I was still hungry afterwards.   I left feeling let down, hungry and with a bill that included a $8.00 four inch quesadilla that couldn't fill up a two year old.  I will not be going back any time soon."}
{"text":"I've been to Anejo at least 5 times each time for happy hour. It's a decent deal. Recently they have raised their margarita prices from $5 to $6 on HH. Around 100,000 people on EI  in Calgary and they are raising prices - shame. Now, let talk about food...
They are known for their guac that is tasty but how one justifies charging $14 + tax for 1,5 avocados, a bit of onion, a small tomato and lime? In addition they are pushing this guac as soon as you sit down. Tacos are half price on HH and are $7 for 3 of them. They are ok, not mind blowing and, I'll be honest, paying a full price for what you get would have been an insult. It's listed as $40 for two people on Zomato which is wrong. You will spend more than $70 because their entries are over $25 pp. Anyways, two stars for ridiculous prices and for very pushy staff (3 out 5 times) I felt as inconvenience to the server because I had only drinks."}
{"text":"If I had one tip for you, Anejo, it would be to show your customers some respect and not treat them like idiots. Just because your entire wait staff is white and your customers are white doesn't mean that we have no idea what Mexican food or tequila are. I won't be back and recommend that you do yourself a favour and go to Los Chilitos instead, their staff is Mexican and treat you right."}
{"text":"Really cute little place with a lot of Latin Sass. I liked it here! Loved the music, the vibe was good! There was a nice patio if you wanted to be outside.
Pre-drinks were in order for the birthday boy - and it was Happy Hour! So beer for him and margs for me! I tried a coconut chili one and it was deelish! Yes, I would have to agree with the reviewers on here as to how small the glasses are, (that consist of mostly ice) but I guess you can look as the drinks as \"samplers\" and try not to pay more than $5 for each one. (Happy Hour was until 5pm) I also tried a passion fruit marg and it you like it tart, it is very good too. I still want to try the classic, the ginger, the mango, etc, etc!
Food eats we kept it light as we had dinner reservations elsewhere - the waitress wanted our opinion on the shrimp and scallop ceviche. So, we got this to start. It was good - not great, but good, edible. The shrimp and scallops really needed to be fresh for this dish and not thawed from frozen. The texture of the delicate seafood was not there. BUT we ordered this amazing tortilla soup to try - WOWIE! This is a must-try when you come to Anejo. The depth of flavours, the chicken, the avocado, the crunch from the tortilla, served HOT- ohhhh, I want a bowl right now! And I did not know this until after, but the kitchen will make it spicier if you ask.
I just liked being in this place (service was OK) and it was sad to leave but there will be other times to come back. Some people next to us had chicken mole and tacos and everything that they had looked so good. 
One thing that ticked me a bit was a $2 water charge on our bill. We had never asked for water but the waitress was telling us later about a new trend in Calgary where charging for still water per person is the norm. (tap water not an option anymore)I had not even touched my water. It is not the cash aspect, I would have just liked to have been told when we sat down, or given the option to have water or not.
They do not do anything either for birthdays - I feel that they should, but they don't."}
{"text":"Only thing worth while here is the table side guac and the margaritas. Other than that I'd throw this place away if I could. 

The service isn't the best and the tacos made me upset, as someone who has had real Mexican tacos I was offended and hurt. It should just focus on making guac, margaritas and desert.

I did go back a second time but to try the desert which made me feel better about going back there. The bathroom was gross and hopefully they will get a cleaning chart up so the staff can make sure it's always clean. I think seeing the gross restroom was what added to my anger.


The dessert is still from ur establishment Kate, still doesn't change the fact the food and service aren't on the same level as other resturant in Calgary especially since I had gone back a few months ago to give it another go. So until the service gets better, and the food isn't thrown together carelessly I stand by my review. :) 
Best,
SB"}
{"text":"Great night out! The food was very good, especially the guacamole. Great atmosphere. Our server was terrific, very friendly and always seemed to be there when we wanted something. So, after such a good time the first visit I decided to go back. Ordered the fish tacos and they were tasteless, added some of the salsa but all that did was change the taste from nothing to tortillas and salsa. My server seemed disinterested this time so I didn't bother complaining. Not sure if I will go back, too bad because the location is great and the atmosphere is terrific but if the food is lousy none of the other stuff matters."}
{"text":"Went here a couple of years ago for my birthday, have not stopped going back, from the moment you walk in you are greeted with a friendly smile (okay, I get a hug now too).
The food is great, never been disappointed, I like to sit at the bar or the patio in the summer time.  
It is a relaxing place, no tv to interupt you visit with friends.

Try the luncheon special or the table side guac.
I love the martini. . . I am very specific with them and Luis, Adam and the gents make a great one"}
{"text":"Finally got to check this place out for a late Saturday lunch. I love the set up in side, it's bright and very contemporary. 

Thankfully they do corn tortillas so I was able to eat some chicken tacos, which were delish! My friends sampled a few things, and the vote was the tequila mac & cheese was superb. 

My only compliant would be the tiny margarita you get for $8. I'm used to a margarita in that type of glass, not a little hi-ball glass. Don' get me wrong it was a good margarita, I had the strawberry rhubarb, but it was pretty pricey for the small amount you get. 

I would love to do a tequila sampling and try some more food."}
{"text":"More for the bar and evening snack crowd than a dining venue, Anejo is passable...
Hardly great food, but the service is friendly. 
Not ever want to return as just nothing special sets it apart from the rest of the bar scene."}
{"text":"The dishes are well balanced and the waitress was very passionate and knowledgeable about the food! I enjoyed everything I had (Brussel sprouts, Ox tail tortellini, and Wagu beef). If the dishes were slightly larger I would give 5 stars for the price."}
{"text":"Favourite taco place. Good spot to have something to eat and pregame with the bomb margaritas. Don't miss out on the guacamole either!"}
{"text":"Went here for a second date last night. I had a cerveza and she had a margarita. We ordered guacamole based on friends recommendation and it was amazing. Served in a lava rock bowl, they bring all the ingredients and mix it fresh right in front of you. 
For entrees we shared six flour tacos. They had the perfect amount of meat and greens, we added a slight amount of hot sauce for a kick. 
The only downfall to going here for a date is how loud it was. It's a concrete jungle with music playing, so can get very loud. 
I highly recommend making reservations as it gets really busy."}
{"text":"We were looking for a reservation for 16 folks and Anejo has a great second floor which can accommodate large parties. The first floor was filled with Calgary's version of the \"trying to be cool\" scene, with a lot of people watching going on. The decor and vibe is slightly eclectic and added to the \"out of place\" feeling of the joint. 

Food and drinks were solid, with the table made guacamole being the highlight. Excellent selection of beers and ridiculous # of tequila varieties. 

Good times, will be back."}
{"text":"Hey! Guess what?! You like tequila! No really, you do. 

Possible responses:

1. \"Yeah I know I do, Dale. Tequila is the best!\" = Go straight to the food section, or better yet, just go straight to Añejo.

2. \"No way! I drank it back when I was 18. Tequila is what you buy to punish someone for having a birthday!\" = You, my friend are in for an *agave education. Read on.

The first thing you'll learn by some time at Añejo is that tequila isn't bad. Bad tequila is bad. Good tequila, however is very very good. Simple right?
It's smooth, it's drinkable, and it's downright delish!

Another thing you should know is that you don't have to shoot it, in fact you shouldn't. Throw away the salt and the lime (unless you're making a margarita) and enjoy a tasty tequila cocktail (including margaritas) or get yourself a nice sip-able tequila and just sit back and enjoy. I'm sure that in their over 100 types of tequila they have on hand, the bartender will be able to find you something you love.

Cocktails! 
This place loves margaritas and after a bit of time here, you'll love them too. When it comes to margaritas, they have 10 to choose from. Sit down, you're going to be here for a while. My favs are, in second place, the Chili Coconut: Blanco tequila, triple sec, coconut syrup, habañero and citrus. In first place, The Mezcalarita  Basically a regular margarita but like I just taught you that you love tequila, this one finally taught me that I love mezcal. Mezcal, Triple Sec, Agave syrup and lime. The smokiness of the mezcal adds some delightful complexity to the beloved margarita while still maintaining a bunch of its more refreshing, drink-them-all-day-in-the-sun qualities of the margarita.

Food!
It's been a while since I've eaten a full dinner at Añejo, but I remember quite enjoying myself. It's high end, foodie style Mexican fare. The table-side guac is good for any occasion. Especially occasions where you want guacamole! 

*Agave - a succulent plant with rosettes of narrow spiny leaves and tall flower spikes. It's what Tequila is made from! Yum!"}
{"text":"Service is great, drinks are great, food is good, décor is decent. It's pretty expensive. I'd go again! The table-made guac is awesome!"}
{"text":"The food was a disappointment. There was not enough salt. The guacamole was so plain. Maybe it is just me..."}
{"text":"Great fresh margarita selection.  They tout best margaritas in town, and I agree.  Had various selections off the menu.  Guac as a starter is a given anywhere that offers it.  Very good, prepped in the kitchen and mixed tableside.  The size is good for two to three people, but the price is a bit high.  Had the Empanadas, wonderful flavor both in and out with the crema, but they didn't seem fresh.  The empanada was a little tough, and the short rib filling a little dry.  We had a three taco selection, snapper was great, pork and the short rib were so-so.  Staff are friendly and attentive."}
{"text":"Went there for dinner last night. The guac made at the table and tortilla soup were excellent. The tacos, on the other hand, were a huge disappointment, all 4 of us ordered them and no one was impressed with them. Would go back for appys, but that's it"}
{"text":"If I ever go back to Calgary I know I will hit this place up. The food was so fresh and delicious! It was also a perfect spot to people watch on the terrace. 

Table side guacamole was so good and they asked you how mild or hot you wanted it.  The beef tacos were very good but slightly too greasy for me. I had to squeeze to drain out all the grease and then enjoy the tacos. 

Our service was a tad bit slow but a street festival had just ended and they were swamped. We totally understood and enjoyed the people watching while waiting for our drinks,food, or bill."}
{"text":"I had a great first dining experience at Anejo.  The food and drinks were soooo yummy!  We had mango margaritas, coconut tequila, chips with salsa and guacamole made table-side, and shrimp tacos.  I'm usually not a fan of tequila, but Anejo has a selection of higher-quality tequilas.  Overall good service and great hospitality.  I will definitely be back!"}
{"text":"Absolutely amazing food and even better selection of Tequila.   The ambiance and clientele change markedly between happy hour and the evening but that just makes for even more of an experience.  Wife and I love this place and even make a point to take out of town guests whenever possible"}
{"text":"June 2017
Given 4 star rating: I want to give this place a 5 because the food is so good. Its actually AMAZING! I am a big family person which means I spend lots of time with my Mom, and Grandma and Grandpa- not just boyfriend and friends. I had been to this restaurant once before and it was so good that I wanted to bring my family. I went here with my Grandma and Grandpa and unfortunately the restaurant I found to be the music to be way to loud that day and it was not that way when I had been there the last time. It was almost like a nightclub. I believe that at a restaurant the music should be moderately loud but not overly loud. People, obviously, talk and restaurants and need to be heard so the volume increases from people talking over each other. This music seems to be trying to be louder than the people which is not how it should be. That is why Anejo is losing a star- for how loud it is but the food is amazing! 
I have had under the \"Sharing for Two\" the Guacamole (avocado, cilantro, jalapeño, onion, tomato and lime salt) and Salsa De Molcajete (oven roasted tomatoes, jalapeño, roasted garlic, grilled lime and onions). Of the two I would recommend the salsa as it had more flavour. The guacamole needs more lime, but it was fairly bland. The serving of chips that comes could also be a little bigger.. They make it right at your table to alter to your level of spicy which is a nice touch. 
I have also had the Ceviche Tostadas (seasonal ceviche, lime, cabbage, avocado) which was not my favourite ceviche I have had. They were generous with the amount they put on the cracker but too generous as it was too heavy for the cracker and the cracker would break. The cabbage was not a good choice on these and again it needed more flavour. The seasonal ceviche when I went was Salmon and shrimp. 
I have also had the avocado toast off the brunch menu which was AMAZING! The best thing I have eaten there so I would highly recommend this. 
Really.. you don't go there to eat though- you go there to drink. I have had every margarita on the menu and my favourite is strawberry rhubarb or the seasonal (when I went) was pomegranate. I also like the Guava but it is too thick and my Mom's favourite is the Coconut Child which reminded me of the Mango heat slurp from 7-11... sadly. 
Therefore, if you go there you need to get at least two sensational margaritas and the avocado toast. 
They have a patio as well and it gets lots of sun which is nice but it is small. Not many tables on the patio either- mostly street seating.

December 2017
Given 5 star rating: The margarita of the month is mandarin with a cinnamon rim which is really interesting in a good way! 
I finally tried the tacos too. Overtime I go I always say I am getting the tacos and then I end up getting something else. I got the chicken, beef, veg chili, fish and calamari tacos (5 tacos all together). You have the option between corn or flour tacos and I wanted to try each so I got two corn tacos and 3 flour tacos. The corn taco shells have good flavour but are dry so next time I will just stick with the flour shells. Out of all of those my least favourite was the fish and calamari tacos because it makes the tacos really dry because they are deep friend and then put in a taco shell so I will probably stick with the beef, veg chili and chicken. They also have pork and chorizo but I didn't get those because I don't eat pork so I don't know how those would be.

March 2018:
The margarita of the month is sour cherry with almost a chipotle BBQ rim which is interesting. I don't know if I loved it or Event liked it. It's not my favourite margarita that's for sure. The tacos of the month are jerk chicken which are good. I also had the shrimp tacos again- they are my favourite!

Rather than posting every month a paragraph I thought it would be easier to just list the Margaritas of the month: 
- December 2017: Mandarin with a Cinnamon Rim 
- January 2018
- February 2018
- March 2018: Sour Cherry with a BBQ Rim
- April 2018: Pineapple
- May 2018:  Pomegranate with a sugar rim
- June 2018: Paloma (Grapefruit) margarita
- July 2018
- August 2018
- September 2018
- October 2018- 
- November 2018
- December 2018"}
{"text":"Anejo is an authentic Mexican restaurant.  It is not Tex Mex which means you're not getting enchiladas with rice and beans. That can be a bit of a surprise. That being said, the food is very good and the Mexican/Spanish beer list is very unusual and also very good.  I recommend this restaurant."}
{"text":"The brazed pork and beef tacos are excellent.  Only complaint would be for pickled jalipinos instead of raw with seeds still there, and of course for the meat to be piping hot.  Makes for a very visceral flavour.  They are at the stampede right now inside the superdogs stadium."}
{"text":"The atmosphere in this place reminds you like you just walked into a Modern Mexican tavern. There tons of stuff to look at, and the guacamole is DELISH! Its made fresh right at your table, and is to die for. There cocktail list is great, I would suggest the Blood orange margarita in a pitcher with a straw because its so good! 

We shared some tacos as well, the pork was perfectly juicy and have nice flavour, the chicken and the fish seemed a bit dry. Service has always been great whenever we have been in. I even had a work christmas party here years ago and they had a nice space for us upstairs, with tons of food!"}
{"text":"Great restaurant, but not Mexican by any means. The food here is really good and the service is fantastic and the bar is exceptional however this is far from a Mexican restaurant. I'll admit that I live in LA so I'm used to real authentic Mexican cuisine and there is nothing authentic about this menu. The food however is really good. I had the corn chowder and the caesar salad as well as the chips and salsa along with some tacos. All fabulous but calling themselves a Mexican restaurant is a bit silly. Taco Bell is more Mexican than this spot. Sorry guys, it's the truth. Great service and a very vibrant atmosphere and fun spot to go eat and drink. They have a great happy hour with descent prices. I cannot emphasize enough that this is not a Mexican restaurant."}
{"text":"Excellent cocktails, great food and good atmosphere.  A bit pricey tho."}
{"text":"Poor service! Literally waited 30min at our table and no waiter even came by. We ended up leaving. 
Unlikely to return.

Hi Kate, we came on the evening of Wednesday March 29."}
{"text":"Añejo may translate as \"aged\" but you could not find a more youthful atmosphere.

You walk up to this restaurant and you know you're in for a treat. Not only are all of the patrons happy and outgoing but it's obvious that the staff are having a great time as well. When you have the perfect trio of tacos, tequila, and great company how could you go wrong? I managed to get my party to order all of the kinds of tacos so that I could sample them all. I was impressed with all of the tacos. They were all uniquely flavored and filling (you only need three). I am not a huge fan of battered fish in tacos, so I would recommend either the chicken, beef, or pork and you won't go wrong. Also, the staff provide great service and are very nice.

If you're not already ordering the guacamole you're making a terrible life choice. Made right in front of your eyes as you drool over how delicious all of the fresh ingredients look. The chips they provide are the perfect delivery system for this tasty substance.

Do you like spicy foods? Do you like really really spicy foods? Okay then you need to talk to the staff and get a bottle of their homemade hot sauce. This tasty sauce is hot enough to spice up your tacos and provide that little extra taste that you didn't even know was missing.

Dessert time: You don't need any more food, get tequila! Grab a shot of that delicious coconut flavored tequila and keep the night going.

If you like Mexican, you can't dislike Añejo because then you'd just be wrong."}
{"text":"Drinks were a 4star, food a 3 star and service a 2star.  Fun margaritas -the chili coconut marg is spicy fantastic. The tacos were good. Not crazy good....but good. It would be nice to have salsa or guac for them. Service was horrible. We waited 40 mins each time she left for her to return and almost an hour for bill. Strange all her upsell efforts but no real effort in service."}
{"text":"I like this place, I have been a few times, most recently for the Big Taste.  The menu was good value, though i had no idea the fish I was ordering was going to be in a taco!  Luckily I like tacos, so that was fine.  The margaritas are really really good.  And really expensive if you are going to be having a few."}
{"text":"First time going to this place. I love Mexican and we wanted to check it out. It's got a cool vibe. Busy, loud, cool decorations. I had an original margarita, we shared guac and tacos. Good margarita, decent guac, average tacos. The wild boar tacos were the best! 

The service was a bit of a bust. We had a waitress who was training so it wasn't the greatest but she tried hard. She had another guy training her. We asked him about ice cream options but he never came back to tell us so we just got the bill and left. Go here from 3-5pm to save $$$ at happy hour."}
{"text":"Pretty good food, albeit weirdly dry. I had the tilapia taco, which I do not recommend. Service was good though!"}
{"text":"Wow! What a great experience! Walking into the restaurant put me in the mood for Mexican more than I previously was moments before stepping foot through those gates! The service we were gives was amazing! Good vibe and everyone felt great! Waiter was amazing always making sure we were topped up on chips and salsa! Guacamole is a must have solely for the experience and taste. They mash it up in front of you with everything measured out and it is fresh guacamole you cannot resist! Our main course was delightful as you can see in the photo. It came boiling in a very hot rock bowl! Felt authentic and tasted like real Mexican. Everything was very clean and well plated. Good food for the hands! Overall a really well established restaurant. Every staff member cares about service which is what's expected. Only complaint I have is the tap in the bathroom was rather weak and it made for a challenging time to wash your hands. Other than thatres was amazing! Would recommend!"}
{"text":"To be honest, Anejo has gone down hill since our first experience there 3 years ago. The food is unbelievably overpriced for the cheap quality it is. You pay 14 dollars for average quacamole and stale nachos and we paid 17 dollars for 5, chewy medium sized coconut shrimp. I don't understand why this place is so popular, my girlfriend and I were extremely disappointed and will not be coming back. We decided to get the bill before our main course and headed to our favourite Mexican restaurant, Native Tongue for some truly authentic and affordable Mexican food."}
{"text":"This was a belated birthday dinner for me and enjoyed it immensely.  We sat on the main floor which was a not too busy when we arrived but was quickly filling up.  The hostess let us know that a large group would be taking over the entire area (3 hours to go) and if we were still there when they arrived they would find us space over by the bar.  I've been known to linger but 3 hours seemed unlikley.  This did explain why we could only get a 515 reservation though.  Our server was fantastic.  Explained the specials, made some recommendations and mixed up a mean table side guacamole.  What stood out for me with the guac was the cilantro.  I've never had cilantro in guac and it lent a nice fresh bite to a dish I thought I knew.   D . had the bison tacos and I had the crispy snapper tacos.  We did a little mix and match and both were awesome.  The snapper was well cooked but moist and the tempura batter nice and light.  The slaw and dressing had a great tang that really complimented the fish.  The bison taco was kind of like a shredded beef taco but different....well of course its bison.  It was lean, the sauce was flavorful and the purple slaw and corn gave everything a nice a crunch.  The only drawback to our evening was the table.  We were seated a tall table for two on the main aisle whic is also narrow with 4 banquet tables right beside it.  The closeness to the  banquet  tables was painfully obvious when two women arrived to join two already at the table.  Everyone stood up to hug and greet each other all right in front of our table.  It interruped our conversation and was as if they were joining us.  I appreciate you may have close quarters and have sat at my fair share of tiny tables that you have to pull out to be seated at but this was just too close and thought I was next for the \"air kiss\".  I never like tall tables because I am short and my legs are often not long enough for my feet to rest on the rail of the chair.  This means my feet dangle and I end up feeling like a little kid and the big kids table.  It also means my feet end up going numb.  I would definitely go back as the food and service were great.  I would just ask for a low table next time."}
{"text":"Came here a few months ago and wow! Beautiful space and food is absolutely delish. Hope I can come back again as it was such a fun experience. :)"}
{"text":"Since i am not a social drinker, i take advantage of their Happy Hour for their tacos, the tacos are great, especially the Fish. I have been there 3 times and had a great time everytime, great service, great food, and from what my friends say, great drinks. The one dish i noticed while i was there on every table was the Guacamole, i had it all the times i was there, they mix the ingredients in front of you, fresh and tasty, i will for sure go more often, as the experience was always good."}
{"text":"Kim (head chef) looked after my dietary concerns and the manager Simon looked after the rest! Amazing food and amazing service!"}
{"text":"Fun Night with my girls!! Fresh made at the table guacamole- delish, cheese on fire- da bomb, shrimp, pork and beef tacos-to die for... Thx Anejo!!"}
{"text":"I've been here a couple of times now and haven't been disappointed yet! The first time was a quiet patio experience with my boyfriend. We had the tacos on special as well as their famous guacamole and chips with some tasty margueritas. Great food, great location and great service!
My second visit was with a larger group on a Saturday night. It was really busy, but still a really fun atmosphere! I had a hiccup with the service when our server took my drink before I was finished. When I brought it up, she seemed hesitant but quickly redeemed herself with the offering of a free second round. 
Overall, I love the food and their marguerita list is even better! Love this place!"}
{"text":"Can't say enough about the amazing staff and food here!! We had a large booking and Amanda set up our reservation and was so great.  The booking system they send your confirmation with is straight forward and easy to understand.
We got to the restaurant and the staff were extremely friendly.  The food is all delicious!! Best tacos in Calgary and extremely fresh guacamole.  The margaritas come in a wide variety of flavors and are all worth a try.  
Dessert is a MUST the tres leche was my favorite but the churros are a very close second.   Will definitely be coming back when I'm in town and suggest this restaurant to everyone!!! 
Perfect for groups, date night, ladies nights whatever your event.  Free parking around but catch a taxi because the drinks are great!  I wouldn't take children because it's vibrant and more lounge like for adults."}
{"text":"I'm from Southern California so had doubts about Mexican food in Canada especially since it's my favorite but couldn't stay away and wanted to try the local offerings. 

My waitress was incredibly friendly and attentive. The ambiance/decor was nice however it was so loud it was uncomfortable.  

The ginger margarita was nice.  

Coming from CA, where chips and salsa are an part of the Mexican food experience,  having to pay for it separately (in light of the already high prices in Calgary) was a complete let down

I ordered the chicken tamale plate.  The tamale was good, made well.  The red sauce came separate, was fine bland.  It came with plain white rice and beans that seemed dehydrated and were crumbled on top of the rice.  Calgary's new wave interpretation /spin on Mexican food?   

I did have the made at table guacamole which was perfect."}
{"text":"I've been here on a couple of occasions and happily enjoyed myself each time.  The music is fun, the decorations cool and the ambiance delightful.  This is a fun Mexican restaurant and a loud one so if you are looking for a more intimate atmosphere....this is not your place!  

I've tried a variety of food items and not been disappointed.  So far the chile rellenos, tacos and table side guacamole have been my favourites but I admittedly have a long ways to go (lots still to try).  Another stand out that keeps me coming back is the Chile Coconut Margaritas - on the rocks.  Holy delicious and they go down easy!  I've always preferred on the rocks to the slushy version (no brain freeze).

The staff have always been courteous, knowledgeable and helpful.  And since they finally started taking reservations a couple months back I'm more willing to come here more often.  Put it on your bucket list - good times!"}
{"text":"First try, was quite decent. The drinks are unique (ask them for Margaritta advice)  and the food was tasty. 
I couldn't find anything wrong with the service either, definitely going back to perform further studies!!"}
{"text":"I went to Anejo for \"The Big Taste\" a couple of weeks ago and had the chupacabra roll, the chile relleno, and the tres leches cake. Holy cow: what a knockout of a trio!

- Chupacabra roll: deep fried roll of ground beef, enough said.

- Chile relleno: it was really tasty but really heavy. I felt like I was harbouring a 10kg delicious brick of cheese in my stomach.

- Tres leches cake: a milky, pillowy delight. It was so freaking good!!!

I didn't have any of the tequilas but friends I went with did and really liked it. They had an anejo (spanish for 'aged', learned that bit of spanish from our server) tequila which looked fancy."}
{"text":"My boyfriend and I were strolling down 4th and decided to pop into Vin Room for a glass of champagne and oysters. Unfortunately, there was quite a long wait as we didn't have reservations, so my boyfriend suggested Añejo. I've actually been wanting to check this place out for a while now, so we gave it a shot. It was really busy when we arrived (around 7) but the adorable hostess told us we were the first people up as soon as a tabled opened, and took us over to the bar where we could order a drink and wait. 

Unfortunately, she lied. There were two other groups of people already waiting there but we weren't in a rush so we just went with it. The bar area is gorgeous. There are a ton of windows and it gives it a big, open, and inviting feel. We were led to a long table sans chairs, which kind of sucked as we stood waiting for about 45 minutes. The bartender was excellent and very knowledgeable about the drinks and different types of beer they offered. We enjoyed taking in the atmosphere and sipping our drinks while we waited for our table.

Once we were seated I noticed how LOUD it was! We were at a small table smack dab in the middle of the dining room, and I almost had to yell at my boyfriend to have a normal conversation. We were hungry though, and the menu looked interesting. I wanted to try a margarita, so I ordered the Paloma, which is basically tequila and grapefruit soda. My boyfriend went against his better judgement and ordered the mango margarita (he hates tequila) so I ended up drinking both. The mango one was amazing!! Really tasty and not too heavy on the tequila, I only wish it was in a bigger glass. The Paloma on the other hand....yeesh. I could barely drink it down - it was like pure tequila. When the waitress came back, she said that was the only margarita on the menu that tastes very strongly of tequila, I wish she would have warned me when I ordered it. She was also really pushing my bf to order a speciality tequila, which happened to cost $19/oz. That was a little annoying.

We decided on the oysters (of course), the ginger coconut shrimp, and the ahi tuna. The oysters were good, definitely not the best I've ever had, but tasty nonetheless. The shrimp was to die for, we really enjoyed this dish, it would be nice if the shrimp were a bit bigger though seeing as you only get about 5 for around $16. The ahi tuna was different, definitely not what we were expecting...it was good and we ate it all but I doubt I would order it here again. The two tortillas on top weren't enough to scoop up the ahi tuna, and although the menu stated it had watermelon in it, we couldn't detect it at all until the end...when we found the SMALLEST piece of watermelon at the bottom. Seeing (and smelling) all of the tacos whizzing by, we really wished we had ordered those! Next time I'll be sure to order them as well as the guacamole (which looked delicious).

I really enjoyed the atmosphere and decor here (the wall of rosaries, candles, and sugar skulls are gorgeous!), and the service was decent, minus the initial wait. I had a hard time deciding between 3 and 4 stars, if they added some chairs to the bar waiting area, it would be great! Unfortunately we were told we could not sit at the bar while waiting, it was one or the other. The noise level is also a bit much for me, but that's a personal preference. I'd love to give Añejo another try, perhaps over the lunch hour, when its a bit more low key."}
{"text":"Excellent Tacos! Went for lunch with my wife and two young boys (1+3). Originally felt a little out of place as it is really a bar complete with a with a wall of alcohol, not exactly a family friendly atmosphere. But the waiter made us feel very welcome and the food is super! We ordered 7 tacos between us but it just wasn't enough so we ended up ordering another three! My favorite was the wild boar and my wife loves the adobo pork. All are great though."}
{"text":"As a native Californian, I can definitely say I've experience much, much better and not shelled out $100 for two people.  That being said, the guacamole was okay but bland, and the decor and service were good.

The food however, was really bad, poor, gross, you name it.  My friend is still not over his shock from the bill.  We should have gone to Towa."}
{"text":"Met girlfriends for lunch here. We all had two or three tacos, a margarita and shared the Amazing guacamole. Highly recommend starting with the guacamole. There is a patio that looks onto 4th. Def going back for more guacamole and tacos. Wish they had blended margaritas tho."}
{"text":"Anejo... I waffled a bit on whether to give it a 3 or a 4. But alas, it's predecessor, Fuze, was a solid 3, and Anejo is a cut above it, so... 4 it is!

Love what they've done with the skylight area of this resto. Installed a full bar and high seating. Well done! Though it seems the entrance is now through the patio doors? That was a bit confusing.

It makes for a fun sharing appy kind of lunch. We tried the guacamole (mixed table side), ceviche tasting and I believe the molotes. All good, though not \"OMG!! You have to get this!\"

In my true cocktail loving fashion, I just had to have one. Strawberry rhubarb margarita anyone? Ok! The margaritas are appropriately over ice and not a big bowl full of slushy drink. And the taste was much more strawberry than it was rhubarb.

Overall, I'm happy with this locations new occupant!"}
{"text":"Having lived in San Diego I have been many to a Mexican restaurant.  And while I have been here once, I definitely appreciate how Añejo prepares the guacamole.  Very fresh and it's made table side.  Cool. 

The margaritas as previously stated by fellow yelpers are outstanding.  I chose to order the Ahi tuna niçoise salad and while it doesn't scream \"Mexican\" per say, it was perfectly prepared paired well with the hot sauces offered.  

The ambience is energetic and \"bustlily\"( I know it's not a real word ). And be prepared to be a loud talker.  Because it can get packed in there.  

Overall, I'll go back there again but perhaps I'll sit outside next time though!"}
{"text":"The ambiance, the stiff drinks, the decor, and the super fancy table side guacamole is outstanding. Now the bad news is that the tacos are subpar. It's extra disappointing when everything else is A+. Calgary needs a super dope tacos place in the style of Icehouse (Montreal) or Grand Electric (Toronto). Anejo has that potential, we just need better tacos please!"}
{"text":"I've eaten here three times during lunch. 
Service- really quick and great for the business lunch. Ambience is standard with multi level seating on high tables. Food- love the guacamole and chips and have tried the fish, chicken and beef tacos. I like the choice of corn or flour tortilla and the table side sauces- cholula, habanero, and two in-house made. I tried them all as I like the heat!  Our waitress filled our water without being disruptive and checked in on us after food was served and then cleared away dishes quickly for dessert. I had a mango sorbet that had actual mango chunks in it and my coworker had the chocolate cheesecake with a brûlée top. We loved it! Def a solid place to hang out. I'd come here just for drinks and guacamole, yummmm!!!!"}
{"text":"The food is delicious and the service is awesome. Been here twice this week already! The guacamole they make for you right at the table so it's incredibly fresh. Must have the ginger margarita!"}
{"text":"A place to experience Tequila; wide selection, extremely knowledgeable staff. Tacos were great; fresh ingredients and unique sauces."}
{"text":"Seriously DELICIOUS. The chips w guac is to die for- it's made fresh at your table and is as good as it gets. Tacos are small, but fresh and delicious. Grab a mango margarita while you're at it for the best mexican food in calgary!"}
{"text":"Service is incredible. The patio is perfect. They are great at making really delicious margarita's! I tried the Mango (the best) the white peach (pretty good) the classic (always good). If you ask nicely they can make the mango one a little spicy, which compliments well. 

The Guac they serve at the table is delicious and the tacos are unreal. 

I really enjoy the atmosphere and location of this restaurant. If you go during happy hour it makes it even more worth it. Who doesn't love cheap marg and tacos!"}
{"text":"Anejo is cool as hell! Like, I really feel like in dictionary under \"cool\" should be a picture of Anejo. 

The atmosphere is bomb! It's dark but you can still see you tablemates, there is family style and conventional seating and delicious food! This is THE place for dates or a place to chill. 

We sat family style and it wasn't bad. I thought we would be competing with the group for speaking space but that wasn't the case at all. I mean, if I wanted to eavesdrop I could but I didn't and we enjoyed our conversation and our food.

The guac was more than enough for the three of us. And they \"smoosh\" it at your table-- now that's fresh! Everything is spiced really well! Not too hot or bland. And there are several kinds of hot sauces to fit your palate's need.

I ordered fish tacos too but after the guac, I only had room for one but it was delicious too. But I think I had no room in my belly because I also had a cocktail or two :P  -- save room for that too!"}
{"text":"We went on a weeknight. And it was decently busy. Went with guacamole bc of everyone's reviews. And yup it's so amazing. The service was fast. We tried tacos and I liked their fish tacos the best. Will be back again."}
{"text":"Passing by so many times, and it seems very packed; finally got a chance to try on last weekend. As what I thought, the food was just okay.

The place is very nice, I guess that's why people enjoy spending time there hang out with friends. For me it's more like paying for the good atmosphere, but not the food.

I ordered Tuna Poke for my lunch, lacking of flavour, very flat. Especially I had a good one at another place today, big comparison. 

I was thinking if I should give 3 or 2 stars. But since I do not think I will go again, so I gave 2 starts (places with 3 starts I may go again)."}
{"text":"Their happy hour drinks and tacos are gr8- especially the guava margarita , in terms of taste and value for money . I wouldn't bother with the regular priced menu and drinks- much better places out there ."}
{"text":"Update. 

So I went in sober last week and ordered the stuffed pepper (vegetarian), chips and salsa to share, and the amazing Strawberry Rhubarb margs.

Pepper was DOPE and perfectly sized. 

Chips - ugh. We were served the crumbly bits out of the bottom of a bag - you couldn't pick them up. 

Salsa - made at the table but wasnt hot at all (we were cautioned twice) and didn't have much flavour. 

Margs - good, I had 2, but not Orgasming over them as I did last time. THOUGH, this could be because there was a different bar tender and it was a little slammed."}
{"text":"I love this place. Friendly staff, amazing food and margarita's. Also a great location to sit on the patio and people watch... highly recommended for great Mexican food!"}
{"text":"This was my second and last trip to Anejo. I didn't pick the spot and figured it's been a couple of years  since I was there last, so gave it another go. The waitress was honestly barely groomed and possibly not clean. Her attitude was that we were bothering her. The place was almost empty and she still was not interested in us. The food was less than sub-par which I don't know the right word for it? Once again the guacamole had NO taste and the staff member was so uninterested in us it was remarkable. The beef tacos were lukewarm which is funny since it wasn't busy, and again had no taste. I asked for jalapeños which I didn't get and I requested corn tortillas which I didn't get   The waitress came by to fill up water and that was about it. I'm never going back. Why do people rave about this place? Maybe no one has had decent Mexican food?? And the margaritas are marginal"}
{"text":"You will enjoy your visit at Anejo as long as you don't order food. The place is really nice, ambience is great, décor is awesome and the margaritas are delicious. The food however, is terrible!! I hope people don't see this as a \"Mexican\" restaurant because it's not. 
Had my office Christmas dinner there and they served a lot of bad dishes.
Meat is tasteless, they have some kind of \"risotto\" that was mushy, a polenta that looked like a scotch brite. Desserts were decent, that's it.
My husband and I have been there a few times and what we do is we sit at the bar, order drinks and salsa and then leave.
Go there for drinks before dinner, then go somewhere else for good food!"}
{"text":"Wow, what a crazy cool, fun, fiesta of a spot! You know a place is great when you can't stop thinking about it, telling others about it and looking forward to being able to return. The room itself is chic and comforting all at the same time. It's very rare to find a place that has got soul, a funky vibe and adorned with wickedly fun throw pillows that make you want to curl up with your rhubarb margarita and stay awhile! 

The food is just fantastic! Everything I tried was so fresh, so flavourful and so surprising for a snow covered, Alberta resto. I guess anything is possible! I highly suggest going in for dinner or even just grabbing a drink at the bar. The tequila list is fantastic and the phenomenal servers and bar staff will get you in a sunny Mexican state of mind before you know it!

Viva Anejo!"}
{"text":"The guac is very good and the tequila menu is quite good too. We would definitely come back."}
{"text":"Great margaritas!!.. And very good appetizers!.. The three ceviches were great!!.. And the ahi tuna was very good as well.. I was told the guacamole is very good, so I would like to go back to try it... In addition, The service was very friendly..."}
{"text":"Awesome place, great tacos, great guacamole and fantastic margaritas. The pork tacos are my favourite with a chilli coconut margarita. They server will make your guacamole right it front of you, and it tastes fantastic too! 
However, lousy service the last few times I've been. The water is Luke warm, and last time we waited nearly 20 minutes after asking for the bill. And then got a dirty look when only tipped 12% . The service hasn't always been bad though, only once or twice."}
{"text":"You will not go wrong with the amazing cocktails, ceviche and tacos they serve. Oh and the atmosphere is fantastic as well!"}
{"text":"Just really overpriced for what it is.  Decent mexican food, though small portions."}
{"text":"This is not a review solely through my eyes. This is a shared review between me and my Father. 

My family is a little more \"down-home\" than \"downtown\" we were once surprised with a dinner out to the Costco food court for dollar hot dogs. 

So I decided to take the family out to their first REAL downtown dining experience at AÑEJO. This was a pretty safe bet because we've been to Mexico a few times and everything in this restaurant was pretty authentic it just made us feel as if we were back in sunny Cancun. 

On a side note: I WANT to live in AÑEJO throughout the entire meal I was planning on how I would turn this restaurant into a home, the main dining room would make a great breakfast/day nook.  I would keep all the decor I love it all, all the skulls all the religious paraphernalia all of it! It is so cool and the place is so bright and full of sunshine. 

Mother and I got the Coconut and Chili Margaritas. ERMERGERD!!! So good! It was such a cool blend of spicy and sweet. And not to mention it was STRONG.

So since my brother and I were paying we went big pimping and order appies. We got the nachos with the salsa ground right at the table. 

As we ate our nachos, drank our marg's and waited for our meal all my Father could say was:

\"WOW, you know if I was single and happening this would be the place I would go. Look at all the people! This is the kind of place cool and happening dudes would go on a Friday.\"  

Along with:

\"Look at those bartenders, look at them making those drinks!!! so talented!! Look at that food. I can't wait to eat.\" 

Our food arrived. As a table we had two of the Chicken and Rice Tamales, the chicken tacos, and an order of the Mac and Cheese. 

Like mentioned before we have been to Mexico a few times and all the food we had here tasted just like the food from Cancun except you didn't have to worry about drinking the water. 

We decided to go all out and get dessert. Along with appetizers, desserts are a rare thing on account of us being a little cheap. So we went and got dessert. We got an order of the Lime and Avocado pie, and some sort of Mexican cake. I think that was the quietest we have ever been as a family. Everybody was so busy trying to get as much dessert as they could.

So to sum it all up it was a great meal, awesomely strong drinks, devilishly good desserts and beautiful decor. The only downside was the lack of parking. The road rage in Daddy-O came out a little but once in the restaurant we were all okay."}
{"text":"This was a fun restaurant and we had really good service. The food was just ok though would visit again as it has a good vibe."}
{"text":"Food & drink: So happy to find a selection of mezcal cocktails. Loved the mezcal mule they had going on! Great balance of spicy, sweet, smoky and tart! Food was okay, enjoyed the guacamole and queso dip but found the vegetarian chili taco a bit spicy and the Chile relleno a bit boring in flavour. 

Atmosphere: Fun atmosphere and decent service!"}
{"text":"I've been here quite a few times. I would always get their different margaritas and fresh made guacamole, which was delicious. I ate a full meal here for the first time got the 6 classic tacos and found them very bland. I was really expecting more from these as I loved their cocktails and guac so much. Unfortunately when trying to approach a bartender (as we were sitting at the bar) about this, he really couldn't have cared less. Unfortunately there are other places to get fresh guac, better tacos, and great margaritas WITH servers/bartenders who care for a better price. Decor and layout of the restaurant was nice."}
{"text":"I came here because of all the hype about how good it was, service was meh, food was honestly some of the worst Mexican food I've had. I had the guacamole which is something you can't go wrong with, but the tacos were awful, odd seasoning on the meat and they garnished it with green pepper which left for an odd taste. I had the chicken,pork and beef tacos and liked neither of them. I tried my friends tortilla soup and it tasted like a sauce, very potent and sweet. Definitely could not eat a whole order of it. I love Mexican and I eat a lot of it and would not come back or recommend it. This restaurant is the furthest thing from authentic."}
{"text":"The food was good (the guacamole was divine), but the seat was so uncomfortable I had a hard time enjoying my meal."}
{"text":"Went to Añejo last night in some Mexican craved madness. Oh-my-Gawd (Janice from 'Friends' voice) , soooo good!!

I'm vegetarian so, the fact that they had corn tacos was so exciting for me! Eee, and they were delish.

We also got the guacamole to start and they literally make it fresh in front  of you. I am so pleased with everything. The service was awesome and quick. The environment was also lovely. Really cool dark set up. 

5 stars!"}
{"text":"Tacos, tacos, tacos....get the tacos.  And I must say the portion size of the taco is HUGE.  Normally at these 'upscale' Mexican places you sacrifice some content for quality when it comes to tacos, not here.  This place is now in my Mexican Calgary rotation with Native Tounges."}
{"text":"Super hip vibe. 

The side guacamole could've used a bit more lime and salt to add flavor. Unfortunately, there weren't any salt or pepper shakers on the table. 

The seafood platter was pretty good. The salmon poke could've used a bit more seasoning. My boyfriend and I used the leftover vinegar meant for the oysters on the poke - made a world of a difference in flavor! 

The molcajete de carne was a lot of meat! I would recommend sharing this dish with other people. The flavor of the meat was tasty and well cooked. The side corn tortillas were served in a mitt to keep them warm."}
{"text":"Really good server. The food is not made to order. Lots of keeping warm or preheating. You can tell because chicken takes more than ten minutes to cook. Came out too fast. Tortillas are microwaved. Bad texture to them. The bar stools can not be sat on unless you are six feet tall. Food was okay overall outside of that but overpriced for microwaved and not made to order. It's hard to screw up Mexican. Not sure what happened. The guacamole was delicious. Won't come back."}
{"text":"HAPPY HOUR  !!! TEQUILA !!! YES PLEASE ! The best Mexican food in Calgary. Best music, atmosphere and service. I am blown away every single time I visit. The wild boar tacos !!! My favorite thing on the menu. 
I love the street patio, it's perfect for people watching.

LOVE IT"}
{"text":"One my list of favourites at the moment. Fresh yummy food! Guacamole was sooooo soooooo good, chicken tacos and margaritas are awesome and even the red wine list tops it off to a perfect meal!"}
{"text":"This was my first visit to Anejo and they did not disappoint! I've been following them on Instagram for quite some time and have been dying to try it out. I live in the deep south so it's not close or convenient but it was definitely worth the trip. Our waiter was excellent and expertly guided us through the margarita menu and suggested some great food options for first timers like us. The food was excellent and there was lots of it! Highly recommend sharing the guacamole dish to start. My wife loved the mango margarita. We loved it and will be back. Two things to note: One, it's a very lively and loud place, don't go there for quiet conversation or for a romantic dinner. Second, parking in this area is difficult at best so go early or be prepared to walk as you may have to park a few blocks away. Still worth it though!"}
{"text":"The most legit Mexican food in Calgary.  The drinks are great. Staff is super friendly with a crazy youthful atmosphere."}
{"text":"I must admit, I was holding a little bit of a grudge against you, Anejo.
You don't take reservations (fine, understandably, lots of places don't), but when I was scuppered showing up at 7:00 on a Friday to put my name down for a table, to find you don't even do a wait list then told to come back in 2 hours and try again then.

No thanks.

But I really like margaritas, so I suggested attempting to try my luck here on Thursday at 5:00 pm with a smaller group of friends.
Our table was right next to the shared entrance with Towa, thankfully it is a sheltered entrance so you aren't buffeted by arctic breezes every time someone enters.
We were seated along the long bench which was extremely comfy, I wanted to take an after work siesta.
One of the ex-contestants off of the bachelor Canada walked in, I didn't know who she was. So therefore I can conclude that Anejo brings in the Canadian reality celebrities, I was anxious to see if Kalan Porter or Evan from Road Rules would walk in next.

Our server was really friendly and entertaining, he applauded my drinking, which probably isn't a good thing for me. Us ladies all dived into the margarita menu, and I had to go for the classic, I wish there was more salt on the rim, but it was really tasty. Anejo's margaritas are not blended, which makes for a quick drink. Our server then informed me they do doubles, so double classic margaritas it was for me (I spent just under $40 on 3 margaritas)!

We ordered the guacamole and fire roasted salsa for the table, which are made (you guessed it) table side! It was nice, but it didn't seem to make that much, considering how large the serving vessels are, 5 of us ate it up very quickly. Maybe we were just super hungry?

Then it was time for the mains, I tried the feature taco which was crispy pork belly, these were simply some of the most mouth watering, taco goodness I have consumed. $17 for 3 tacos, I think it's about $14 for 3 if you order off the regular taco selections, but I don't care that I paid almost $20 bucks for mini flour half wraps, cause they were SO GOOD.
For those with a gluten sensitivity they do offer corn tortillas upon request.

I then further indulged and was the only one at the table who ordered a dessert, I had to try the molten chocolate cake. This dessert does take a little longer which is fine, except the rest of my party had to leave so I was left drinking my last double margarita and cramming molten chocolate and raspberry goodness into my face with just one friend left.

So, all in all, I really enjoyed my meal and experience. My one friend who did not order tacos, got the ahi tuna, said it was pretty tough, but If I do come back and decide to venture away from tacos, I'll probably try their mac and cheese and do some tequila sipping off the menu.

You redeemed yourself Anejo!

and it's my last review of the 30 day challenge!!! YAY

Review #30 of Yelp's 30 Day Challenge"}
