{"text":"We stopped in on a Friday afternoon, there were few in the restaurant but we had the undivided attention of the bartender who was great!  HH was a good deal with all wines for $6 and we tried the bruschetta...incredible.  Overall cute space, good patio, outstanding food and very attentive service!"}
{"text":"My hubby and I had a \"date lunch\" there yesterday. Despite being open only a week, they have the place running very smoothly. What A PLEASANT CHANGE FROM THE PREVIOUS OWNERS! These folks are the ones that created the original Chez Vous. Richard and Isabella know how to run a restaurant and their new partner from France, Bruno, is charming and knows the menu! We had a lovely wine and then some Bruchetta including a shrimp, tomato and avocado one; peppered salami and pickle, and smoked salmon with chives and cream cheese. Light and airy- not greasy! Then we ordered a beautiful cheese plate including a Blue Cheese (appropriately blue veined and delicious), Sumptious Brie and another white cheese from the border of France and Italy (can't remember the name). All served with toasted bread, coronations, grapes and walnuts. 

The decor has a smart, yet comfortable look. A huge update and change to it's previous look. Adding to the charm, was a group of the owner's friends who working speaking french rapidly. Loved it- felt we were back in Paris from last year.

We will be back- this is a huge upgrade to the Shea food scene. My only suggestion was that they expand the menu to include a soup. 

It was a lovely experience and Richard/Bruno were charming and lovely. Abientot!"}
{"text":"Wine and bruschetta were great. Owners were very friendly. Only one snafu - we ordered wine before the happy hour cutoff time and the order wasn't entered as two large groups of customers had just arrived. We were told that the system prohibited entering the order after the cutoff time. We were charged full price for the wine without any apology. I am sure the waitress who is part owner could have overwritten the order in the system. Service is important and you'd think they'd want to make a good impression to first time custo"}
{"text":"B&R has been open only a week and already it has turned into our \"neighborhood\" hang out. Bruno, Richard and Isabelle are great people and they make one feel quite comfortable right from the start.

Ostensibly a wire bar it has a more genuine feeling than the other such establishments that also call themselves wine bars. There isn't a shred of the snootiness, affectation and general BS that goes along with the term wine bar.

The décor is clean modern and welcoming and I have found that my wife and I prefer to sit at the long wooden bar as it makes it easy to talk with ones neighbors and B,R and I (Bruno, Richard and Isabelle).

The wine list is not extensive but it is sophisticated and has been chosen with great care by someone who knows what they are doing (I suspect B&R). Most of the wines, on an individual basis, I did not know. As I am starting to work my way down the list I have not found anything I did not like. Pricing is quite reasonable and during the long happy hour period they are a downright bargain.

The food is an eclectic and pleasant surprise. The bruschetta is served on a wooden plank and a normal order consists of nine (9) individual pieces of three (3) different types. The varieties are wide and quite appealing and go far beyond the normal tomato-garlic bruschetta that one finds often. My favorites are the shrimp and avocado and the salami, pickle and cream cheese.

The salads are intense in flavor and presented in a fashion that I will keep as a surprise. The chicken, tuna and bacon, goat cheese, pear salads are my favorites.

I have not tried the paninis but they looked good when I saw others enjoying them.

Desserts are home made and my wife and I tried the raspberry tiramisu, in a word great.

Best of all, the most expensive items on the menu are the three bruschetta at $10.

You'll quickly fall in love with this cozy place."}
{"text":"We have been to B& R 1/2 a dozen times.  the first time we stopped in just to check it out.  We were very pleasantly surprised.  The food was prepared to order, fresh, delicious and reasonable.  The staff is outstanding, especially the lovely Isabelle - she is a true delight.  We went back several more times, trying more items on the menu.  None disappointed.  The location is convenient,food great, super energy!  You need to give them a try.  They are fighting the bad wrap from Amy's Bakery - forget them and give Richard, Bruno and Isabelle a try.  You will not be disappointed.  Did i forget good, reasonable wine list and happy hour?  Give them a try!!!  Good tunes, too!  We have a service dog and they are very dog friendly!!"}
{"text":"What a nice quaint, friendly atmosphere with delicious food. Owners are nice and the staff is very gracious. Food is good and reasonable price.  Check it out before or after a movie at Scottsdale & Shea."}
{"text":"Anticlimatic - ordered the deli board which was to come with meats, cheeses and fruit.  It came with a hodgepodge of thrown together items that really did not pair well: dry bread (too heavy for a meat/cheese board), some prosciutto and salami but the cheese was chèvre rolled in cranberry an no other cheese choices, a handful of mixed nuts and some cornishons.  Also ordered the french onion soup but they copped out and just servered a cup of broth with a side of croutons and shredded mozzarella....no melted crust of cheese.  The food was edible but forgettable."}
{"text":"Love this place! Really great atmosphere, cool lighting, cozy feel, fabulous service. I love supporting small business owners such as this one! They have a great selection of wine and food, the service is top notch, and the owner is really friendly. I love stopping in here before or after the movies since it is right next to Harkins. Go ahead and have a glass of wine or some food because you won't be disappointed."}
{"text":"What a great undiscovered gem! Anyone scrambling for a mother's day restaurant should be here. Great food, lovely atmosphere."}
{"text":"Really such a cute place to come on a date after the movies. Great food & tapas!!! Love it. Will return."}
{"text":"It's our first time and shame on us! Service was awesome, food was lovely and if your not a wine drinker they offer gin, vodka, tequila and rum!  We will be back!!!"}
{"text":"Great place where my friends and met last night for wine and appetizers. We had amazing bruschetta that was incredibly fresh! Prices are terrific and the owner was very personable. Highly recommend B&R Wine and Food!"}
{"text":"So happy to happen upon this terrific lite bites, (but filling & healthy), restaurant tonite after our movie at Shea 14...and to find that Isabelle and Richard with Richard's close friend from France, Bruno are the owners was an extra bonus.
Nice wine and beer selection..and there are lite bites, hamburger, omelets, etc..Everything we ordered was delicious and very satisfying.
We'll be back.
ann a"}
{"text":"Hidden little treasure next to the Harkins Shea 14!  Richard and Bruno know French food!  The appetizer are amazing, the drinks refreshing and the ambiance so relaxing.  I highly recommend this place"}
{"text":"Why did it take us so long to find this gem? I am in and out of this parking lot 3X a week and never noticed it was here until my husband and I were looking for a new lunch spot. The shrimp salad is fantastic. Friendly service. A definite return visit for sure."}
{"text":"Amazing service to go along with the food! If you stop in try the Bruschetta and the wine is amazing. I highly recommend this place."}
{"text":"Expertise in proper wine etiquette was lacking. (Being a bit picky) 
Great friendly atmosphere. Wine is great, food is great. Ocean salad is recommended. Will be coming back again."}
{"text":"Happy hour was just right.  Relaxed atmosphere with decent wine selections and reasonably priced apps.  Didn't stay for the live music however"}
{"text":"Great atmosphere, wine selection and french inspired food! The owners always make you feel like family! And a pet friendly patio is always a plus. The apple fig gorgonzola bruchette was amazing! Also we happened to come on the weekend and they had a live pianist!"}
{"text":"It's a rare thing these days to find an establishment that accomplishes excellence in their craft, outstanding service, and perfect atmosphere. B+R is ALL of the above! Coming to you from the original owners of Chez Vous (French Creperie,) Richard, Bruno and Isabella are no strangers to the restaraunt business, and seem to know all the little nuances that go into creating a FANTASTIC experience that will make your whole day.

The food is excellent, and you can't beat the happy hour drink specials!

Even better, they have managed to create a comfortable, yet sophisticated atmosphere... It pulls you in and makes you feel at home.

I went on a Sunday afternoon with my Fiance, and everything was absolutely perfect, and we just so happened to be there for LIVE music! The pianists were very accomplished and just added to the vibe.

All I can say is we will be back next week, and this time bringing friends!"}
{"text":"Terrific place, a great upgrade for this location :-) Yummy bruschetta and $12 wines are $6 during happy hour. Loved my bruschetta board with shrimp/avocado, eggplant/mozzarella, prosciutto. Will be back soon and often."}
{"text":"The ghosts of Amy's Baking Company have finally been exorcised and the new owners (Bruno, Richard and Isabella) ensure that B &R is a great neighborhood wine bar and restaurant.    I had the shrimp, avocado and pink grapefruit salad which was delicious and very nicely presented.   Bruno, the pastry chef, made the lemon meringue pie, which was excellent.   Wine selection was good, although there could have been more French wines.   The patio is great and the inside decor very nice.    Service was very good - friendly and knowledgeable."}
{"text":"Had a lovely experience with a friend here for happy hour. So happy our neighborhood has a classy & comfortable place like this now.  The staff was outstanding and the food was on point. I shall return!"}
{"text":"Tonight was our first visit to this new addition to our neighborhood...loved it!  We'll be back. Nice wine selection, wonderful service and delightfully fresh, clean food. We shared the sliders, chicken salad and a panini. All simply delicious!"}
{"text":"Just wonderful. Food was spectacular and they offer a great happy hour. If you like French inspired cuisine, this place is it. It's so nice to have a fresh new option in the neighborhood where you can grab a great glass of wine or a full meal. We will definitely be back!"}
{"text":"Just had a lovely dinner at bnr in Scottsdale. The menu is interesting with choices for any size appetite. I had salmon and hubby had flat bread pizza. Wednesday they have music-so pleasant!! Would recommend it to all!!"}
{"text":"For anyone who has not had the opportunity to try B&R Wine & Food, you are missing out. My husband & I went for the first time last night & we are totally in love with it. Having relocated here from NY, we have found it difficult to find a restaurant that lives up to the standards we had come to expect. B&R did not disappoint. The food was exceptionally delicious, great wine list, atmosphere cozy, service wonderful & the owners are delightful. It is a must try for everyone who desires an extraordinary experience. Look for us; we'll definitely be back.
Nancy & Steve S"}
{"text":"First bite of a shrimp salad, I felt as if I were in a cafe somewhere in France. 

I came here per recommendation from a fellow Yelper and after I finished my dinner, now I know why they left five star review.

If you come between 3pm and 6pm, they have happy hour everyday and any wines on their menu is $6 per glass. While their wine list may not be extensive, their list has a wide variety. I can tell they were carefully selected and I am sure you can pick at least one to satisfy your wine needs. I picked Spanish red wine and it tasted like what Spanish wine should taste. 

For dinner, I enjoyed both shrimp salad and classic pizza. Shrimp salad is made of avocado, shrimp and red grapefruit. Who would thought these three will create such a perfect harmony, I enjoyed each ingredients texture and flavor separately and all mixed together. The sauce they used to mix three ingredients was so delicate, I sometimes think how they are made as I eat, but I just stopped thinking and focused on enjoying every bite of the salad. 

Classic pizza was excellent as well. The pizza sauce was somehow similar to what I had in Japan. The sauce, dough, cheese, ham and mushrooms, each of them were not insisting its own identity, rather each of them enhanced what each ingredient should taste without losing their own taste. Simple and pleasant are my thought as I enjoyed this pizza.

Service was very friendly and attentive. She was very pleasant to talk to with full knowledge of the each menu items. Nice decor both inside and outside, they put so much though into each decor and furniture. They are located at the same mall as the Herkins theater Shea. Parking could be difficult to find.

I surely enjoyed my early dinner. I would definitely come back"}
{"text":"Great wine list and bruschetta was solid!!  Nice decor and atmosphere. Happy hour is great. 11-6 daily."}
{"text":"Cute place and has so much potential. Great location next to the theater.  I really wanted to love this wine bar. We went on a Thurs evening with the intent of happy hour wine and apps...then possibly dinner, but left after one glass of wine and an app.

The menu is very limited and not many options. Wine list is even more sparse for it being a wine bar. Would have liked more unique offerings.

Service was ok. Waitresses were friendly, but really hoped for a more personal experience from such a small, intimate place. 

Really wanted to like this place. Looked like they had a few regulars coming in so other people do like it & return. Just too limited in wine and menu items for me. Maybe it will expand eventually....might try again some day. Expectations were too high."}
{"text":"French staff, are very nice, fresh good food and wine are divine. Perfect place before or after a movie"}
{"text":"Bruno, Richard, Delena , Isabella our Hosts and the owners and our beautiful server Delena are Outstanding !!!!!    I always go to Pita Jungle and they were so ridiculously busy we walked away and right next to the Maui Fish place here was B & R wine !   Best meal  and this patio with a glass of my wine from Spain with my friends last Saturday night was an incredible experience.   These are NEW owners , so if you tried this spot before, GAME CHANGER!!
come and have an experience that feels like a patio in your home.  Thank you , Richard , Bruno and all of the staff.   Coming back Thursday with  a new group of friends."}
{"text":"My wife and I were looking for a new restaurant to try when we found B&R Wine-Food.  We were greeted immediately and seated at the table of our choice.  The server brought us water and took our drink order.  She was back quickly with our drinks and took our dinner order.  Again, our food came quickly and was amazing.  It was possibly the best salmon I have ever had...perfectly cooked with a light cream sauce.  And the wild rice was delicious, too.  My wife had the cheese board and was very happy with that, as well.  Our server continued to check on us, and refilled our drinks when needed.  Great food, great atmosphere, great food. We will be back."}
{"text":"How often do you get to write the first review !!! 
My wife and I went here after a movie and were completely surprised at how it has been transformed into modern wine bar. We were met by one of the owners, Bruno, who was very welcoming.  The area itself is well lit, tastefully decorated and not \"trying to hard\" like some of other wine bars. The immediate atmosphere was relaxed which is also very encouraged by the staff and owner. The place reminds me of a Postinos but with better service and we could actually talk over the music level!! We ordered a few of the Bruschetta and some wine. The wine was excellent and was exclusive to their Restaraunt. The Bruschetta was crisp, fresh and not oily like other places around the valley. The service was very attentive, but not intrusive. Overall great experience and I'm sure this place will continue to get more and more busy. It is different than the other quick serve places in the complex, but that's actually a welcome choice for us and saves us a drive to old town, Arcadia or Kierland for a wine bar."}
{"text":"I just went there for Happy Hour and had the French Onion Sour and the Shrimp and Avacodo Cocktail and they both were FANTASTIC.  The staff is fantastic and very friendly and very nice.  Well worth a try and many repeat visits.  You all need to try this new restaurant.  I think you will enjoy it very much.  Everyone in the family works there.  It is quite impressive."}
{"text":"In search of a quick snack and beer, we stopped in B&R and were incredibly pleased with our decision. The staff was hospitable and the bruschetta was tasty. Their tap list while small, was quality. We will definitely be returning soon."}
{"text":"We went on a Tuesday night, and were the only ones in the restaurant. I was a little concerned that it wasn't more crowded, but we gave it a try. We had bruschetta and a salmon sandwich; all of which were amazing! The owners are very, very friendly, but not overly-invasive. They also have piano jazz every Wednesday night, which my husband and I will definitely be going back for! Would definitely recommend."}
{"text":"We went to try out this new restaurant and listen to jazz music and have a dinner. The service was excellent and and the prices were moderate with quite a large selection of both Wines and dinner. The glass of wine was quite generous and the variety was delicious. We had the salads, burgers, and the salmon and all were excellent. The price is quite reasonable and I'm sure we will go back again to enjoy."}
{"text":"Stopped in with friends after a movie for a snack. Delicious salmon and salami bruschetta, served on perfectly crunchy, tasty bread.

Was greeted by one of the owners, very friendly and informative. Will definitely come back to try the dinners."}
{"text":"Just had lunch today with hubby! We had met the owners in October at another restaurant and decided to give it a try today. We were not disappointed. Great simple food but with that homemade taste we love !! It was delicious!  We had some bruschetta, onion soup, quiches and creme brûlée /tiramisu for desert!  All of it was light and delectable!!  We will definitely come back.  Our French palettes were pleased!! Also, the owners were so welcoming!"}
{"text":"Dined here on a whim and was absolutely blown away. The staff was absurdly friendly and the environment was perfect for a casual evening of food and drinks. I will most definitely be back and would recommend it to anyone looking for a nice casual evening in a comfortable space."}
{"text":"\"B&R Wine - Food\" restaurant is a stylish & quaint wine bar and French Bistro.  One can tell immediately, from the relaxed yet professional demeanor, and warm welcome from the    owners, Richard & Isabella, that they are very experienced, and are extremely friendly, relaxed, gracious, and accommodating.  They take plenty of time to answer questions about the food menu, help with wine selections and, when asked, share details about their restaurant, previous creation, the restaurant Chez Vous, and their new partner and Chef, Bruno, who recently came from France to join them. The decor is charming, modern, and relaxing. We didn't feel at all rushed, even though we were waiting for our movie at the theatre, next door.  We each started with a wonderful glass of wine. (Happy Hour price is $6.00 from 3-6 p.m.) I enjoyed the Appoloni Pinot noir. Our delicious meal consisted of French Onion Soup (with sour cream and cheese on the side, as the French serve it), Vegetable Quiche in a crispy pastry shell made from scratch, which came with a side Balsamic Vinaigrette salad, and for dessert, we had a slice of Lemon Meringue pie in their wonderful, flaky pastry with Roasted Coffee. While chatting with Isabella, I learned that all of their food is prepared in their kitchen, on site, and all is organic. (Additionally, the restaurant and the bathrooms were meticulously clean.) I definitely will be returning again & again with friends, and I highly recommend it!"}
{"text":"What is the does the quintessential neighborhood restaurant look like? B&R wine bar should be the place to go for wine and dinner. A family owned restaurant with Richard, Bruno and Isabella behind behind the bar offering up home made fresh ingredients into dishes like wonderful assortment of bruschetta, soups and fresh grown lemons to complete your meal with lemon meringue pie!


Simply wonderful..."}
{"text":"The first time we ate at B & R, Richard, the owner welcomed us and the experience  was wonderful, so we sent back.  This was about three weeks ago.  This time Richard, the owner was not there. What a difference!  No one asked us to sit, so we sat ourselves.  All the orders arrived wrong, were sent back and some arrived again, wrong.  The salmon brochette finally came on untoasted white bread with salmon just tossed on it.  Checks arrived with additional charges for wine we did not order. .  Corrected checks arrived  again wrong with the orders mixed up. Finally, on the third try, we received correct charges. 
     Service was poor.  For a good part of the meal our server never appeared.  The first time we ate there the service was excellent.  I guess Richard, the owner, can't afford to take off a night."}
{"text":"First off I'd like to say I would definitely give this place a second shot. 

I came here last Friday night with a date and we both just ordered salad and wine. He reported his salad was \"so-so\" (he ordered a chicken salad that sort of looked like canned cat food IMO). I ordered a salad with salmon and avocado and can only say the same. It was average. 

The menu here really isn't very interesting, unique, or adventurous unfortunately. Nothing really stood out as a \"must try\". I'd come back to try pizza or maybe pasta and the taste of one of those may or may not warrant a higher rating."}
{"text":"Nice place for an after movie snack, but not as fun as when Sammy and his dingbat wife Amy was there.  They don't even have Amy's deserts anymore.  But she didn't make  them any way."}
