{"text":"If you are going there for salsa dance, try to get there around midnight. The dance floor is not that big, and if you don't know how to take small steps, you are in trouble. Don't hope for any free parking, and there are many indoor parking around, but very pricy. The dancers were mixed with pro, intermidiate and beginers.
Cover charge: $14
Beer: $8 (without tip)"}
{"text":"Was here last night (Friday) and was pleasantly surprised that cover for women is free before 11pm. So men, know where the party is at! A mix of older (50+) and younger crowd, and not packed where you're bumping into other dancers. A mix of Latin music with some hip-hop/reggaeton near the end of the night. Will be back for another Friday fix for sure!!"}
{"text":"I came here with my family for my dad's birthday. Never been to this type of place before, so we thought it would be a change of pace. Our reservations were for 7:00pm. The place was completely empty....ghost town. It didn't start getting more and more customers until after 9:00pm when it got packed. What was surprising is that there were lots of younger people here (20-30 years old). It seemed like lots of parties were happening and celebrations. The food was alright -- I asked for my steak medium rare and it came out medium well. That is a big pet peeve of mine.

The service was also painfully sloooww. It took forever to get dessert and eventually the bill. The server at the table next to us accidently poured an entire glass of white wine all over the back of a girl's dress. She was soaked, but was a good sport about it. Luckily it was white and not red wine! I felt bad for the server too. 

Service and food aside -- the live music was nice. I always enjoy live music. Would I come back here? No, and I probably wouldn't recommend it to friends. It seems like the place for special occasions, but expensive for mediocre food and slow service."}
{"text":"My friend had her birthday hosted here on a Friday night, and it was empty during dinner time, but very packed after 9PM! 

The waiters were such gentlemans - from coat check to the server - they were all smiles and very polite. Service was prompt and the food arrived at our table at a reasonable amount of time. I ordered the seafood platter for two, which was $49 before tax, and the mussels were delicious! The octopus wasn't chewy at all, but surprisingly tender. I also ordered the butternut squash soup ($9) and it wasn't as thick as I hoped, and was laden with too much pepper. 

People started gathering around for the salsa dance lesson around 9PM, with girls in one row and guys in another row facing them. I was surprised to see the girls outnumber the boys! Everyone seemed to be having fun, and the teacher was nice enough to help everyone with their moves. 

Next time, I might just pay the $10 cover to come in and learn salsa dancing. The food is a little pricey and understandably, nobody really comes here to eat. 

Overall, fun experience!"}
{"text":"This is an interesting venue for sure. I have only been here twice; once when I was in 2nd year of university and I was captain of the school's exchange committee (so I brought exchange students from all around the world for salsa-ing...sigh...) and just recently for a bachelorette. As per other reviews, this is a popular destination for bachelorette's and I can see why. It is a fun and lively place to be.

The party was slightly spoiled in the beginning by the obnoxious guy who checks bag at the entrance. First of all, I really don't understand why bags need to be checked...I felt like I was in certain malls where police use their big sticks and flashlights to seek counterfeit or banned goods. We had brought a variety of things for the bachelorette (games, prizes, balloons, etc...) and the guy said that we had to check in the bags at $2/bag. We said that the items were for the bachelorette (re-iterated prizes, games, etc...) and he responded \"why do you need all those things anyways?\" Finally, he conceded (with a HUGE sigh and eye roll) but I personally felt he had targeted us just to be nasty or spiteful. So beware - you could get grilled more than at a security check point at the airport.

The rest of the evening was better. The hostess had brought the bride-to-be a martini and the waiters were very obliging. One had to be part of a game which included girls to be blindfolded and to have \"man parts\" stuck on the waiter... 

Food was actually better than anticipated. I was not that hungry but I had a salad and crab cakes which were moist and fluffy. Portions are quite big so do not be afraid to share (they have lots of Tapas items on the menu). Signature meats, pastas (for the vegetarians) and paella's are of course available. Lots of drink options and a reasonable selection of red and whites.

The restaurant turns into a semi-club in the evening with a salsa lesson. Space is limited for the class so don't expect to be doing the Pasa Doble, however, it is fun. And yes, the ratio of women to men is 100:1 however later on in the evening, there are many single men who will either ask you kindly to dance or just grab you from behind and start grinding...be warned.

FYI. Be sure to bring lots of towels for mopping sweat. Because the dancing area is so small, be prepared to have men in their sweat-soaked shirts rub against your bare arms so that your arm is drenched...many of my girl friends also experienced this unfortunate sweat transfer.

All in all, this is a fun place for dancing and entertainment!"}
{"text":"My boyfriend and I had a date night at this place Saturday night. We got there well in advance of our reservation but the hostess was kind enough to seat us early anyway (it wasn't that busy at 830pm). 

We ordered a delicious bottle of Argentinian wine and  some apps. We shared the chips and dip plus the firecracker pastries. The chips were fabulous (Yuca, plantain and tortilla) and dips were good but could've used a touch more heat. The firecracker pastries were wonderful. For our mains, we shared the seafood pallela. The seafood was very fresh and the dish overall was cooked well but again, could have used a little more flavor (maybe more saffron?). We ended our meal with a couple mohitos, very refreshing! 

Around 930 pm the free dance class began and the place seemed to fill up very quickly. The instructor was friendly and seemed to really know her stuff. Soon after the DJ took over and the whole floor was full of happy dancers. Really good Latin dancers. 

Overall the vibe was incredible, the people friendly, the food pretty good, and the drinks delicious! I would come back here any day but, maybe brush up on my Latin dancing skills first!"}
{"text":"I should have reviewed this place when I first was invited there for a friends leaving do back in February.

Okay for starters I totally have no interest in Salsa so I was already disappointed I had to come here but since the crowd was good I thought okay this will be fun.

So salsa clubs for me has always represented the one place dudes can go and have a chance to dance with a hot chick that they would never normally stand a chance with. This place is no exception and I kind of look back in life and think whether I should have chosen to be a dancer.

Waiting outside in the freezing cold I almost thought I was watching a Scarface type movie with the amount of oiled hair, gold chains and chest hair on show and all that oil must have eventually found its way to the slippery floor. 

Okay so the crowd consisted of mainly a Latin crowd and then your salsa tourists, so lots of stereotypes I could fire out here but the plus point is that most the people here were having fun which counts and if your a chick who does not mind every 'salsa instructor' in the hood come and offer you a private lesson then this is your joint.

As a guy this place was nothing special and I would definitely not come back here and I prefer the only Salsa in my life to be of the dipping variety"}
{"text":"I don't quite get the negative reviews. So i went here last night to redeem a groupon meal and get some salsa lessons in - in efforts to make date night's a little different

When we arrived at 730pm the place was empty! I suppose not a lot of ppl come here for dinner. I came with zero expectations because that's what I do for groupon meals. Howeverrrr I was pleasantly surprised! We had emapanadas and croquet for appetizer, both were fresh and delicious though the crust for empanadas was a little too oily. For main we had the Peruvian chicken and paella - again both fresh tender and yummy. Dessert to share was the chocolate something- basically a molten lava cake!  

The place really started to fill in around 9pm. The salsa lessons were decent. Good crowd overall. I'd have no issues paying $7 and coming here to salsa, right after I learn how to! Almost everyone on the floor knew what they were doing 

For anyone visiting Ba ba luu for salsa, i\"d say go a bit early and have a bite - food ain't bad either!"}
{"text":"Who knew a place famous for salsa dancing can serve such excellent food?! I really enjoyed the quality and presentation of the dishes. Delicious, authentic, and with a modern twist is always a plus in my book. The ceviche was delectable, as a professed sushi addict, this was a new way to explore \"raw\" fish, in a nice citrusy dressing with cilantro oozing out of every morsel.  The guacamole also very tasty and a must try, especially with plantain chips . The only downside would be the hefty prices and high spending minimum imposed on weekends ($45/pp). The atmosphere is very romantic, with candle light and a live spanish band playing upbeat melodies throughout the dinner hours. This enjoyable high class hideaway in trendy Yorkville is not too be missed,"}
{"text":"I've heard about this place for the salsa dancing, but didn't expect the food to be good too!  There's a minimum spend of $45 per person if you don't want to pay the $10 cover for the salsa lesson that starts at 9:30pm on a Friday.

It was pretty empty when we came for our dinner reservations at 8pm, though it quickly started getting packed just after 9pm.  We came here for a bachelorette.  The hostess came around and presented the bride-to-be with a complimentary martini on the house.  Lots of bachelorettes and birthdays there!  Ratio of girls to guys for the salsa portion was 85% to 15% with most guys standing by the sidelines... interesting place for singles??

The food!  So good.  Definitely go for the seafood paella.  Packed full of flavour, large and full of seafood goodness.  There is a 35 minute wait for it which was actually more like 1 hour for us.  Oh well.  We weren't in a hurry.  The grilled calamari was drenched in an oil pesto, and cooked to perfection.  The seafood soup was loaded with seafood and very tasty.  Pass on the French onion soup, but definitely go for the guacamole! 

The service was very friendly and I'm definitely interested to come again just for the salsa."}
{"text":"Been here countless times. Granted not recently however this place never changes. 

Also, how you view this place will depend whether you are a Spanish, dancing person or not. No offense but it is the truth. 

If you come here for the food or the overpriced bottled beer then you are coming for the wrong reasons. There is nothing this place --even with the nice decour, that other dance clubs will not be better at. Except for the extreme accessibility due to its excellent central location in Yorkville. 

Generally speaking, this is where the non-Spanish crowd come to dance. Not to say that Spanish people don't come here, I mean, I used to come here for many years but the main draw, as I said before, was it's accessibility and maybe bachata Thursdays. However if you really want to dance some serious bachata, you are better off coming with a partner. Since true bachata is fairly intimate and other dancer might feel uncomfortable with the intimacy. Maybe...

If you are a dancer, then avoid the Friday/Saturday night combo as they are known as the \"pick up nights.\" This place gets way too packed and you can't really dance unless you enjoy bumping into people for most of the night. If you are a girl, expect to be hit on fairly frequently. 

If you like to dance salsa then you will want to come on Wednesdays and Thursday nights, otherwise known as \"dancing nights.\" These are the nights where most of the non-dancers or pick up artists tend to stay away and only people who are really committed to dance come out. 

Thursdays are know as \"show off nights,\" you can still dance but be prepared to see many very advanced couples take to the floor.  They are great to watch but there is a vibe of exclusivity which scares the non-initiated. It can still be fun though.

As you can imagine during these two nights, bar traffic is fairly minimal and thus the club will try to make money by charging cover... sometimes.. Oddly there are times where they do not. When they did, I always used to think it was because they wanted to make sure they made the rent at the end of the month! ;-)

The free classes are okay and are a draw for people who are starting but don't think much about them as they are nothing more than tasters, so do not expect to know how to dance by the end of the hour and unless you are a good looking woman you probably won't be asked to dance. Well, the truth is that if you are a man, you probably won't be asked to dance due to the culture expectations anyway. 

Hence you get a bunch of men just making a circle outside the dance floor looking in... longingly. 

If you are a man and you can't dance then I would suggest to go elsewhere because even if you ask a regular out, chances are they will figure you out very quickly and excuse themselves the moment the beat stops as they will be looking for a more advanced dance partner. 

If you are Latin and you know how to dance then this place is not bad and it is a great place to become a part of a community as you will get to know a lot of people by cheer exposure. 

Having said that, all in all, the club is just okay as there are better places to dance, like Lula Lounge for example which tends to have better music. However you still can't beat Babaluu's central location. 

If you need to get your Salsa fix, this place will do."}
{"text":"It hasn't changed in 10 years. This is one place that people (most times) come to dance, like actually dance. Salsa I'm talking about. 

What I cannot understand, is that a lot of people come here to have dinner (which I've tried once and wasn't amazing) but seem to be flabergasted when the dancing starts and they just sit and watch. Come to dance!!! 

The crowd is really mixed. Younger folks that may or may not know how to dance, older folks who are vetrans. Best way to enjoy yourself (as a girl anyway) is to be open to guys asking you to dance. This is the fun of it. Best way as a dude is to have confidence to ask girls to dance. 

On Weekends there is a cover. This Friday it was $14 each! Wow, robbery. But if you get there before 9pm it's free, and before 10pm it's free for ladies.  Salsa and Bachata mostly.

Drinks here was ample and generous but mediocre wine."}
{"text":"My friend, the salsa addict, wanted to go to hit his second salsa spot of the night. It was Thursday night and I was struggling on 4 hours of sleep and just stepping off the plane from the CA but somehow I managed to go out at past midnight. The spot was pretty dead but my friend wanted to dance so I was game and it helped me wake up.  We were the only ones of the dance floor for the longest time. Dance for about an hour but stopped when they started to play reggaeton music (sorry not a fan).   Learned from a local that Wednesday nights are better here for salsa."}
{"text":"Overall, it was great.  We came for the vibe/salsa lesson and dancing.  But we also had dinner before dancing. They have a current special until May- 2 for one dinner ($49 plus tax), which is great considering their normal menu prices. Since we don't know how to dance salsa very well, we didn't dance much. The people that come here (young and older) are pros! It's fun and sexy and its awesome to see their smooth salsa transition dancing. I'm Cuban through and through - but I didn't grow up dancing salsa, however, I DO know what real salsa looks like, and these Canadians were the real deal. It was great to watch. 

The food was just okay. And I kind of knew this going in, but with the 2-for-1 deal, it was better. The chicken and steak dishes we had were on par with a chain restaurant quality like Chilis or Fridays (so yes, tasty, but not by any means high quality). If we had to pay regular price ($33-35 per dish) for Chilis quality, it's overpriced. The chicken was very juicy, I must say. The potatoes and appetizers were tasty and quite salty. But I like they they redeem themselves with the vibe and great dancing. Once the kitchen closes, the party is live and there are places to sit for the tired dancers and a small bar area. There is a $2 coat check. If you make a reservation, coat check is free."}
{"text":"If you're looking for dance space.....like Toronto's real estate. ...its premium.
In other words don't be surprised if you're bumping into people...stepping on someone's foot..getting someone's sweat all over your arm, etc. Don't get me wrong the music and crowd is mature, and courteous in the event they bump into you lol. With Salsa, merengue and bachata playing you can dance here nonstop.  Oh and Ilona G. sorry for elbowing your head twice..I didn't mean it..I swear :( 
On weekends their entrance fee is $14 which includes coat check, I found it a bit pricey however you have to consider this club is in the middle of Yorkville.  The drinks are reasonably priced, staff are friendly as so are the patrons that come here.

I'll be back Babaluu....."}
{"text":"I'd heard about Thursdays at Babaluu and recently received word about a free Bachata lesson at 9 pm, so Abby and I decided to check it out.  We got there a few minutes before 9 pm, as recommended by some friends, and checked our coats ($2/person) but the guy at the coat check waived the fee thinking that we had a dinner reservation.  The place was very quiet and it didn't seem like the lesson was taking place anytime soon, so I just asked the maitre d' for a table and luckily they had one.  

We came for the purpose of dancing, so we just ordered a single appetizer -- the Octopus ceviche -- which I could barely put in my mouth (I really wanted to spit it out).  Abby even said it was too salty, which coming from her meant a lot.  So we mentioned it to our server who graciously took it back and not long after we had another portion, which was a lot more edible, but still nothing to write home about.  The lime margarita that Abby ordered and the malbec that I had were both so-so.  

The bachata lesson, however, was a great time and a ton of people came out -- both singles and couples -- and the place was filled with a great energy.  For those considering checking out Babaluu for the dancing, I cannot recommend it enough.  There are some really awe inspiring dancers that come out and it's a good place for a beginner to just come out and develop an appreciation for latin dance.  It doesn't hurt that there are some very attractive people here, or perhaps it is the dancing that makes them so!"}
{"text":"After a great dinner with friends, we stumbled upon this hip dance club when invited by an older gentleman we met at dinner.  While we don't know how to salsa dance, we had a blast anyway.  The bar was well stocked and the staff was eager to help the crowded patrons get whatever they needed.

We will certainly be back next time we are in Toronto."}
{"text":"Went there spontaneously with friends when I realized that I need some more Salsa in my life. Went on a Friday, and music was mainly salsa and bachata.Even though I really loved the music, the venue was crowded beyond belief, and we ended up sweating like mad and stepping on feet of fellow strangers. 
Other than that, I had my fun. If you're planning on dancing your night away, it might be a good venue. Central location, good music, girls come in for free before 11 =) Check it out and let me know what you think."}
{"text":"Lets start with what was good: 

decor, comfy seats, neat dancing

The Bad:

Food, just awful.. 

- My GF and I shared the empanadas and 3 chip dip to start. The empanadas were cold and looked/tasted like they came from the freezer an were store bought.  The dips: guacamole was bland, spiceless and very plain, The salsa was half-way decent and the chickpea dip was far to garlicky    
- We both had the Pallea as our main.. big mistake!  This tasteless mess was possibly the worst food I/we have ever eaten at a restaurant our lives.  The calamari was either over or under cooked, I had three decent shrimp in mine and the GF had none, she had a bunch of tasteless chicken and I had none.  This dish left us both feeling ill and we barely ate much of it as is was so off-putting.  There was no spice to this dish, bad flavor and needs a lot of work.. I can't even explain how bad this was.. what a waste.. 
- We shared the fruit custard Crem Brule for desert, this actually tasted pretty good but it was freezing cold and had clearly been made earlier in the day and then taken right out of the fridge. 

Service, very scattered and inattentive.  Our waiter didn't ask us how anything was and was pretty much MIA the whole time.. 

If you want to have drinks and dance some salsa in Yorkville then this is the only reason I could ever imagine a viable reason to go to this place.  Do not eat the food.. just don't"}
{"text":"If you like salsa dancing and live in the downtown area... you've probably already heard of this place. In fact, you probably told me about this place! If you show up around 9pm, they have a introduction to salsa class for free that will help teach you the basics of how to have sex with your clothes on, on the dance floor. Once the classes are over, all the hardcore salsa dancers appear out of no where and start tearing the place up! If you are an attractive girl, there are many men waiting to dance with you. If you are... pretty much any guy and are willing to even try to dance, you will have your pick of young, attractive women waiting to be flung around the dance floor by you. Every time I stood up, at least 3 very attractive women would look at me with hopes and aspirations that I would pick them. Just learn the basics and they will be happy. 

As for the food. Well the dinner was pretty good. Nothing too special. The dessert, well the dessert felt like it was made 2 nights ago and on top of that, had a long hair in the cake... no thanks. Almost ruined my night. They have a live band but I understand why no one was there until 9pm on a Friday."}
{"text":"This is the worst salsa club ever! I have been going on and off for yrs and every time I go I get reminded of why I don't go often. 
The management and staff are just plain RUDE!!! Very unfriendly and offer  poor customer service. I have so many complaints to mention.
I really don't know why people put up with this disrespectful behavior, perhaps because there are limited choices in this city for Latin clubs.
Even the clientele during the evening dancing are pretty snobby, after all it is in Yorkville. 
 I always prefer El Rancho! The staff are friendly, always have a smile on their face and the clientele are also fun and friendly. If there is a problem the management provides good customer service.
 They seem to value their customers which is more than I can say for Babaluu. I will not be going back that's for sure. Many of my friends feel the same way about this place.
Canadians are complacent and don't complain about any thing, it seems that they enjoy paying to be abused and not to be treated as a respected customer.
If you are not Latin, really young and don't know better you might enjoy this place as the music is pretty good, But I enjoy the variety at El Rancho more."}
{"text":"In terms of salsa, this place is worth visiting. There is a free class going on most of the days of the week. ifreestyle teaches on wednesday and a cuban lady teaches on the remaining days. The class is suitable for beginners. 

The dancefloor is small and to be honest the distribution is quite odd, the bar takes a good portion of the place. The floor itself is quite good, maybe the best one in the city, its perfect for multiple spins and it remains flawless throughout the night as the air ventilation of the place is quite good. 

Other things to keep in mind, is that you pay coat check, $2 per item. So if you bring a jacket and a purse(normal size) is $4 dollars in total, it varies from day to day if the lady/man doing the coat check is kind to you. You get in for free, only if you enter the place before 9pm (for men) and 10pm (for women).  

Wednesdays is the best day for salsa dancers, the music isnt the best, but the dancers are very experienced and there is sufficient space in the dance-floor to show off (cough cough). Thursdays is a bachata day. Friday and Saturdays are the \"just-not-only-salsa-dancers\" days, these days are crowded with lots of people and sometimes the space is just too limited. 

In terms of food and drinks, this place is expensive. They say the cocktails are not strong enough lol. My recommendation is stick to beers, if you want to eat then you better keep in mind that its going to be expensive and not filling. Check out the menu at their website."}
{"text":"Went here last night, food was amazing. Although it is a bit pricey, it was worth it! The service was very good, everyone was polite and helpful.  What I had:  Seafood Jalea, Beef Tenderloin (BEST IVE EVER HAD!) , and Coconut Ice-cream! and all the food was presented so nicely! and since we went on a Friday night, the salsa dancing was  a great way to end off the night.  definitely recommend the place!"}
{"text":"I walked into here with my gf after watching the movie Chef at the Varsity. We wanted to have some Latin food and this seems to be the only Latin restaurant in the Yorkville area. I was a little hesitant in going here as the place seemed rather bare with people, especially on a Friday night, but later I found out that there were more people towards the back but they were there for their nightly salsa classes.

The waitor took us to one of the tables in the front, as the back was taken up by the salsa class. There were only two other diners in the restaurant and out of all the tables he seated us at a table that was dirty and he tried to discretely to brush off the crumbs with the menus but we definitely knew what he was trying to do and saw the stained tablecloth with bits of food on top.  We pointed out the dirty table and the waitor said he will be back to change the tablecloth, which we thought was odd as he could have seated us at a clean table rather than change a dirty tablecloth after we have seated.

Ordering drinks I was extremely disappointed about their dismal wine list. I would have expected some decent new world wines, but the selection was very poor. The small thick rimmed wine glasses reminds me of cafeteria glassware, which suited the lacklustre wine.

Their ceviche of the day was tilapia, which sounded boring, but didn't want to order the octopus ceviche that was on their menu as we wanted to also order the grilled calamari. When the food arrived we got the octopus ceviche instead of the tilapia, which was fine as the tilapia would probably be a poor choice given that the octopus ceviche was mediocre at best. The grilled calamari was overcooked and rubbery and lukewarm, and I suspect was made with from frozen.

The salsa class started during our meal which was fun to watch and provided some relief from our meal. Unfortunately our waitor, and any other waitors, seemed to be absent from the dining room and was working the bar instead during the salsa class. We finally flagged our waitor for the bill after a long wait, and to add insult to injury they didn't have a wireless credit card reader and the reader at the bar wasn't working, so I had to follow the waitor through the crowd of dancers into a small room where a cash register with a wired card reader was. This was no fun.

It seems like the main draw was the salsa classes than the food which I am not surprised as the food and service was pretty bad and I am surprise a place like this exists in Yorkville."}
{"text":"Last Thursday I decided to check out Bachata Thursdays at Babaluu's. I have heard great things and wanted to see for myself. First off the line took forever, it didn't help that it was raining and cold so that killed my mood a bit. I happened to make it just in time for free Ladies and the gentleman had to pay $7 to get in. Once inside it was difficult to move. It took a while to get a drink but once we found our little spot it was golden. People were generally nice if we accidentally bumped into them while dancing they didn't make you feel like a pest. I was a little disappointed that they didn't play more Bachata considering it was Bachata Night. The place is quite average size for a spot on Yorkville. I would definitely go back to practice my moves if i am off on the Friday but I would not make it a weekly habit if I am not."}
