{"text":"I have been going for years.  Simply one of the best rotis you will ever have. My mouth waters just thinking about them. Not cheap, and not fast, but the rotis are huge. If you like it hot the scotch bonnet sauce is hot and delicious. I love me some roti and it does not get better than this."}
{"text":"It's a matter of taste but I really think this is the best roti in Toronto. The staff are great although it's really busy there often, so they can be rushed. I wish they were open Sundays!!"}
{"text":"Compared to other roti shops, the vibe of Bacchus roti is quite nice. The sitting area is quite spacious and comfortable. 
We got a double and jerk Chicken Roti. The double was filled with curried dhal, with all its deep-fried goodness. For a split second, we thought twice about our order as we saw the oil seeped through the sandwich wrap. 

The Jerk chicken was delicious. The flavour was subtle, with the right amount of heat. And the roti was fresh and not too doughy. The only downside was that there was a little more potatoes in the filling than we would have liked.

We will definitely be coming to try out Bacchus Roti shop again!"}
{"text":"Hands down, my favourite roti place in the world. Ok, fine, I've never been to India... but I'm sticking with that. I don't know what they do to their shells, but it makes me craaaave for them. I almost long more for that first bite, (that is 80% dough) than the messy venture that begins after cracking that first corner. 

However, the filling is a dream. I'm a pretty strict beef curry man, myself... but I hear the vegetarian options are delish. Have also had the goat, and butter chicken. Yum! 
The only bad thing I have to say about Bacchus Roti Shop (i would actually take a half a star off for this, if you could) is that their doubles are not greasy enough. 

And let me say this: *looks at reviewers mentioning other roti shops in this review thread*

No beef option = ROTI FAIL"}
{"text":"One of the best roti available downtown. They offer some awesome combo rotis for the adventurous. The mutton, squash and spinach is my usual order. The roti is very large, one meal if you are starving or two if you're just hungry. Friendly service and a nice dining room full of neighborhood folks."}
{"text":"BEST ROTI EVER!!!
My favourite is Squash, Spinach and Channa...
Do yourself a BIG Favour and Share a Peanut Butter Star for dessert, you'll be sorry if you don't!!
Beer is VERY reasonably priced and the atomosphere is pleasant.
For lighter appetites you may want to share!"}
{"text":"I have to admit I haven't eaten a lot of roti yet but this place is amazing and makes me want to have roti every day!

It's a small locally owned restaurant in Pardale just west of Dufferin on the north side of Queen street. 

They have spinach, sweetpotato and squash in their roti and they have meat and vegetarian options. 

I had the goat roti and my friends has the chicken roti - all of it was super flavourfuland tasty. The prices were cheap and i had two meals out of it because their portions are huge. 

I will definitely go back there soon to try something else on the menu."}
{"text":"I use to love Bacchus, they use to make really good doubles and roti. Their curry use to be nice light yellow curry, the meat was perfect and so were their chick peas, I am not sure if they have new owners but it's not as good anymore, the curry is more bitter now and all in all to me it sucks.

Unless it was their off day, but when I was there 5 years  it was amazing."}
{"text":"This isn't real trini roti. The food is mediocre at best. If you want an unauthentic exprience go here. It's a nice place and the food isn't terrible, but its also not great."}
{"text":"I was all stoked for this place after the 4.5 star average review - a rarity. Stopped by for some dinner. The place was more than half and less than  two thirds full around 8-830 pm on a spring Thursday.

Got the jerk chicken special roti (with squash and spinach). The chicken was surprisingly dry and not spicy. The veggies were bland. Nothing was hot - warm at best.

The whole dish was a dry, lukewarm, melange. I had to get a pineapple chutney sauce to give the thing a bit of juice.

At this price point, I was pretty disappointed. I may try it again - but am in no hurry to."}
{"text":"I was a little disppointed by my experience at Bacchus Roti Shop.  We tried the jerk chicken roti and the potatoes were so overstewed that it was one mushy mess.  The flavor was ok, but not spicy enough.  The decor was happy and modern, but fit more the neighborhood (hipster) than the food.  We shared one roti, and they split it into two portions for us, which I did appreciate."}
{"text":"I recently grabbed a take-out roti (chicken, squash, and potato) from Bacchus. It was one of the most fantastic things I've ever consumed. The woman working the counter was super friendly and the menu was clear and interesting. I'm a total convert and can't wait for another opportunity to get food from Bacchus."}
{"text":"Delicious roti! Loved it, not too expensive, friendly service. The roti dough is covered in corn meal flour (?) or something like that."}
{"text":"Not sure if the family sold the business or what, but it has changed.  The roti's now are sh@t.  The pita bread was so thin.  Never going back."}
{"text":"Bacchus makes Guyanese roti which, if you ask other people from the Caribbean, is not the real thing, haha, but then what is real? I have tried their chicken as well as squash-chickpea roti but I always find that something, a key ingredient, is missing in their sweet-ish curry flavouring.

I couldn't place my finger on what exactly it was (it's still a mystery) until I noticed that hardly any Guyanese (let alone Caribbean) folks get food from this restaurant. Ok, so it's customized for western palettes, like most other places in Toronto, and there's absolutely nothing wrong with that. 

Generally when I host travellers through couchsurfing, or I am recommending a place for someone who has never had roti before, I suggest this place. But for proper roti lovers, I beg to differ. Parkdale has a high concentration of Roti shops so it may be worthwhile checking them out too."}
{"text":"Great west Indian style roti. The shrimp roti is my personal favorite. Starting to get pricey but worth it"}
{"text":"I told my coworkers I  would pick up lunch for them at Bacchus today, so nobody brought their lunch. Got there at noon and they have a little sign stuck on the door that says they will be opening at 3. I called before I went and it said they would open at noon. They could have at least changed their voicemail. Now none of us have lunch. Not impressed"}
{"text":"It's pretty damn expensive. But the roti is delicious and quite filling (though recently they seem to be getting smaller - is it just me?). Actually, when I think about all the times I've dropped $30-75 to try a new place that turned out to be mediocre shite, I guess paying $15 for getting exactly what I want doesn't seem that bad!!

Eat meat? I recommend the no. 2: chicken, squash, spinach, potato. Really really good. When I feel like a roti, this one hits the spot.

If you're shy about heat, ask for the hot sauce on the side. Learned my lesson when I asked for mild and got something that, while it didn't quite blow the roof of my mouth off, wasn't the most pleasant.

Ultimately, with so few restaurants in Toronto I can say I would be happy to return to again and again, I'm grateful this little spot remains so consistently good. Also grateful they survived their Restaurant Makeover. But...dear Bacchus... Doncha think its time to get rid of those ridiculous hideous ginormous lampshade dust magnet things that \"designer\" chose for you...? I say this with love and concern. Just a thought."}
{"text":"Bacchus? The God of Roti? Who knew?

The proprietors and staff of this fine establishment seem to operate in Caribbean time - the hours are more of a guideline than an absolute and when they are busy, don't expect niceties like answering the phone.  But that just lends the whole place an air of authenticity - or so I tell myself in lieu of being perturbed.  I do this because of... the food.  

Huge portions (yes, even in my my eyes) fresh and super-tasty goodness on the cheap.  Goat roti the way it was meant to be and superb boneless jerk chicken. Everything I've ever had here is a contender for best in class.  

Seriously, what is NOT to love about this place?  This is DEFINITELY a must do on any serious Tour D'Roti in Toronto and certainly a prime candidate for the gold medal, West Indies style."}
{"text":"Prices a tad high, however customer service and quality of food quite excellent.

Been going to this venue for many years now, and it's the kind of place I go every once in a while due to the price.

The quality of the roti served at this location is quite excellent however, which keeps me coming back for me.

One of the last times I went to this venue, I realized that they were closing earlier than I anticipated, and there wasn't much time left until they closed. I called them to see if they'd be able to take my order, and they told me that as long as I were to arrive before closing, they'd be able to serve me. I hurried along and drove there (was initially going to walk, but wouldn't be able to make it in time), and I made it a few minutes before they closed. I was served with a smile, and nothing be good gestures.

All-in-all, I'm quite happy with Bacchus, and would definitely return there again."}
{"text":"Absolutely the best roti's I've had in Toronto.   The selection is perfect with various choices of different fillings for your Roti, also other great selections as well.   It's made to perfection with the right amount of spices and heat to give it a nice flavorful kick.    This is definitely a sure place to check out in Toronto.   The interior decor is pleasant for a quick drop in and sit down/take out or for a nice casual date out on the town."}
{"text":"Simply put...

Curry chicken roti WITH Cheese.

Absolutely delicious.

Plus, you can cut it in half and still be filled.

Eat it all yourself - as the taste may lead you to - and you will be stuffed.

I've tried other places, but keep coming back to Bacchus."}
{"text":"Portions are massive and delicious.  Unless you're STARVING you can definitely share one with someone.  Service was friendly and fast.  My husband got the jerk chicken roti and couldn't stop raving about it.  I had the chicken and potato roti and it was perfect for me because I don't like food too spicy.  We also got a few drinks which were very reasonably priced.  Definitely lived up to our expectations. Seriously the portions are huge so keep that in mind."}
{"text":"The interior of this place is quite nice and the service was polite and efficient.  But the food was badly lacking.  My curry chicken was too vinegary.  The coconut rice was fine but the spinach was extremely bland and tasteless.  The green beans were a bit better.  My meal didn't come cheaply either so I don't see myself returning here."}
{"text":"It was alright.  I didn't have their roti, which, I'm guessing is what they're known for.  I think it lacks the zip or life that the other Caribbean places around town have."}
{"text":"Their goat roti is super yummy, and homemade peanut shake just like my mom makes it. I like the atmosphere too! There's a lot of roti shops in Parkdale but Bacchus is where I go."}
{"text":"Best Roti I've ever had.  I tried the jerk chicken and it was perfectly spicy.  You gotta try it!"}
{"text":"i'm not a roti connosieur but i enjoyed this place quite a lot! the vegetarian selection was great. i tried the mushroom, cheese and spinach (i chose rice but i think she mixed up my order and put cheese instead. either way, it tasted great and it ended up being a good mistake). the lady at the counter was very friendly. i wolfed mine down in a matter of a few minutes! i'll definitely go back for more and try the other veggie selections!"}
{"text":"Sunny days have me hankering for island food so i decided to visit a former favourite, Bacchus Roti.

So disappointing. They get 2 stars for a clean space and efficient service, but only someone who has never had good authentic roti would think that oily mushy mess of potato, bland curry and meager servings of shrimp in one case, chicken in the other (barely discernible) was good. This is not the Bacchus roti I remember from an earlier time and this explains why it could be completely empty at dinnertime. My quest for Caribbean flavours must continue down the block   - westward, like Columbus."}
{"text":"One of my favourite Roti shops - slight twists on the classics.

Huge portions and lots of seating area .  

If they have the peanut butter stars  grab one!!"}
{"text":"When I first walked into this roti shop I thought I had stepped into the wrong shop... The decor is more what you'd expect out of a coffee shop than you would of a roti shop.  

Alas, more expensive decor does not come without a price - $15 for a Goat Curry Roti with squash, spinach and potatoes.  This is probably the most expensive roti I have ever had in my life.

With that said, I liked the fact that their roti is not just all empty carbs and that the ingredients they use are a little more on the healthy side.  At $15, the roti was pretty huge and is enough for 2 meals.  If you can finish 1 roti by yourself in 1 sitting I applaud you!  The roti itself is nice and thin, not too oily, and just the right amount of crispy and soft.  Unfortunately, it does become a little bit messy to eat when you cut through it.  I'm glad I wasn't on a date! The goat was boneless and extremely tender.

Service-wise this is a husband-wife tag team and service is not the greatest as I saw the counter unattended many times while customers piled in.  

Verdict:

Though expensive, it is quite a gratifying and satisfying meal on a chilly autumn day.  This is probably one of the better rotis I've had - rivalling Mona's Roti in Scarborough.  However, Mona's is much cheaper, and is equally tasty!"}
{"text":"Maybe it's just me, but Bacchus does seem to have slightly irregular hours, which can tend to be annoying at times especially when making the cross-city trek.  BUT... Bacchus is truly a rare find-a place that forces you to make this pseudo pilgrimage with regularity. Their tasty boneless jerk chicken offering with sides of rice n peas, sweet potatoes and creamy slaw has yet to disappoint.

I have sampled some of their veggie roti's and they were equally fantastic.  Yet at the end of the day I'm a true carnivore at heart and find it difficult to stray from the tried, tested and true jerk chicken that Bacchus does to near perfection.  On a side note, there are no salt and pepper shakers on tables-the food is seasoned perfectly, so that having them would be merely superfluous.

Word to the wise-try the peanut punch in the large fridge adjacent to the ordering counter, this Caribbean staple is primarily made with condensed milk, peanut butter, milk and sometimes nutmeg,  for those looking to get their swerve on it is also hypothesized to hold certain aphrodisiac powers.  So who knows where a meal at Bacchus may lead..."}
{"text":"You know how meeting a really fantastic person can spoil you for all others? That's what Ghandi and his butter chicken roti did to me.

So no offense to you, Bacchus, I am sure you're wonderful. But my taste buds long for Gandhi when I am in your presence."}
{"text":"Bacchus is my favorite roti shop in Toronto.  I've been going there for over 20 years and love the food.  Typically order veggie combo rotis with lotsa pepper.  Love it."}
{"text":"I'm back to 4 stars, based on the fact this place is only open from Tuesday to Friday.

They still make my favourite chicken curry roti in the city... But when I can't order it on a weekend it breaks my heart."}
{"text":"One of my fav roti shops. Great taste and huge portions."}
{"text":"Love the Roti here.I invariably have the jerk chicken because it is just so damn good.Being a carnivore I appreciate a solid serving of meat in my food and Bacchus doesn't disappoint and thet have an LLBO license for the days when you just need a beer with lunch,they are open late on weekends and the owners are super nice."}
{"text":"This place puts a lot of meat in their roti. I ordered the beef curry roti which was full. The only thing was I ate one side and there were more potatoes and the other side had more beef. not a big deal.

The staff seemed quite friendly and when I went for a takeout bag she was holding, she kindly told me mine would be out very shortly and it was. 

This is definitely a knife+fork type of roti, as I ate it I'd say it could be wrapped better, but as long as I had knife+fork I didn't care that the beef and potatoes were coming out from the sides.

Although I did not drink, they have a full bar menu and cheap too! $5 for a drink.

I'd come here again."}
{"text":"strictly based on ROTI...  average to good.  The best Roti I've had (still to this day) is ROTI HUT, unfortunately it's in Scarborough (yuck!).  Bacchus is decent for Parkdale, but definitely NOT great."}
{"text":"so you have two picks:

you can either call me \"Fatso\" from now on or \"Meatie\".  Either way, in direct opposition to the much referenced J.W. (only once but this is the third review so), I CAN AND WILL ALWAYS FINISH A ROTI IN ONE SITTING.

bacchus or not.  might i remind JW and all those interested in being a little polite about everything that bacchus is another name of that famous god dionysus, whose greek business it was to have lots of sex, drugs and rock and roll baby.  Does bacchanalian ring a bell?  well i was bacchanalianing so much over that first roti i had (filled with goat and squash - and potato i think) that i was vociferously eyeing my sister in laws leftovers.  i even had to silently tip toe around my wifes veggie roti leftovers - i was hoping she wouldnt eat - SHE HATES LEFTOVERS!!! - FATSO STRIKES AGAIN!!!

i love  the consistency of their dough. its chewy and soft.  their squash was sweet; it must have been butternut.  the goat was goat.  not sure that in that form its my favorite though.  i think goat meat tends to be a little bunched up if that makes sense.  too dense.  anyway it was overall very enjoyable and true to connie t's assessment, this place has taken the signal from other old business around the area.  theres a chinese restaurant just down from the drake that probably doubled their clientele just from sprucing.  

or maybe that was just the drake doing that."}
{"text":"I had never had roti until moving to Toronto, then I felt like I had to try every roti place! Far and above, Bacchus Roti is the best roti I have ever had. The curry is so spicy and robust, the chicken is perfectly tender and tasty. And the wrap - don't get me started! It's perfect. Service here can be a little slow, but it's always with a smile. If you are calling for takeout, sometimes if they get busy they don't answer the phone. But the roti is so good, I forgive them. Luckily I live close enough to just go there and wait. Soooo worth it! :)"}
{"text":"i came here because i saw bourdain eat here on his short layover series. i gotta admit the curry was not bad. i had the goat with eggplant and my girl had the chicken. the roti is wrapped around it like a burrito. its a huge thing to eat. for the price its on the expensive side. but my main complaint is that the roti wasnt flaky enough. having lived in malaysia for a short period ive had some really great indian roti. this was just ok for a store with the word roti in it. if youre around the area give it a try but not worth it just to come here if its out of the way"}
{"text":"We found this place while watching an episode of Anthony Bourdain. So, we put it on our list of places to try.

Well, we tried so many food spots there was no way we could eat here too. But, we decided to take a 30 minute trolley ride from our last food spot to pick up some jerk chicken roti and freeze it in our hotel fridge to take back home. Our flight was less than 90 minutes so it pretty much stayed frozen.

I defrosted it in the refridgerator and had it for lunch at work yesterday. O-M-G. Some of the best Roti I have ever had and I have been to a few spots in Trinidad. If it was this good a few days later than I could only imagine what it would have been like fresh.

At first I thought it was a small amount of chicken but not really. You can cut it up to eat with the curried potatos. The curry potatoes with a bite of the perfectly seasoned jerk chicken was heavenly. I just wished I had a little pepper sauce.

This was well worth the 30 minute trolley ride we took there and back from our hotel. Will absolutely stop by here again when I am in Toronto but this time I might buy a few to freeze. Pricing is reasonable...I think we paid $9 CAD."}
{"text":"I ordered the Mutton Roti and it was excellent. I substituted chickpeas for the potato and it was a life saver. Even without the potato it was incredibly filling. I wouldn't plan anything strenuous afterward, it will put you into a carbo coma. Netflix might be the better option... :)

I like it with a little heat, I ordered it medium spicy and it was perfect..."}
{"text":"Used to go to Bacchus all the time when I worked in the area...over 17 years ago.  They used to have a small stall like establishment.  Then they moved into a restaurant which sells beer.  Prices went up, but a real chill atmosphere with friendly and attentive service.  Nice in a busy place like Toronto.  Had the channa, spinach and squash roti.  YUM.  Bought a second one to eat today at work.  My nephew also loved it.  Will definitely keep coming back.  Loved the fact that I could get all the cold water to drink that I wanted.  Clean."}
{"text":"I'd heard so much about Bacchus Roti Shop and was really excited to go!

The roti was pretty good, but it wasn't made with dhal puri, which is my preference. The curry was tasty but nothing special. I thought the prices were pretty high for roti."}
{"text":"Bacchus Roti came very highly recommended to me. When I moved to West Queen West about 2.5 years ago, my family helped me move in. My stepdad, a self proclaimed roti fanatic drove us past Bacchus Roti Shop and wistfully told us that this was \"where it all began...\". He fondly recalled his first (and best) ever roti experience at Bacchus years prior. 

Years later, I drive past Bacchus every day on my way to work and make a mental note to try their rotis. Not doing so sooner is something that will take even longer to forgive myself for. 

Vegan options? Check.
Friendly service? Check. 
Intimate and authentic ambiance? Check.
Affordable food? Check.
Serious portions?  Check. 
The best darn roti and doubles I have ever had? Check, check, check!

Don't make the same mistake I did. Check this place out like yesterday."}
{"text":"I've been craving a chicken roti.  There was a long line-up where I usually go so I headed to Bacchus Roti Shop today for lunch.

I ordered a chicken roti and a Diet Coke.  It was just okay.  The chunks of chicken were tender and tasty.  It seemed like the potatoes were mashed rather than chunky.  Overall I wasn't crazy about this style of roti.

Dick Bacchus, the owner, was taking the orders and serving the food.  It would have been nice if he had been friendly ... he wasn't welcoming at all."}
{"text":"Love, love, love this place. Very well made delicious food. Costumer service was great too, the man working was very helpful and kind. You need try the triple toffee pudding it is to die for. As well as their chick pea double sandwich, small yet very filling. Totally recommend if you want good Caribbean/Indian food! One of the better places in Parkdale!!"}
{"text":"Delicious! Best Roti you'll find in the west end!"}
{"text":"Best roti in the area by far with plenty of options. Portions are huge and the owner is a pretty friendly dude. They are closed on mondays and have had some times I've gone by and it was closed. But all in all great roti and Caribbean restaurant."}
{"text":"Upon the high recommendation of my dinner date, I tried my first mega roti filled with jerk chicken, spinach, and squash on my first visit to Bacchus. Yummm! The enormous rotis that were served to our storefront window-side table after we ordered up at the counter were filled to the brim with deliciousness. 

Despite how much I enjoyed it though, it proved to be far more than one meal's worth of food for me. I'm pretty sure we could have shared one of these monster roti between the two of us. The piping hot meals went well with our exotic fruit juices. I have to admit that I'm not the biggest fan of artificial flavoured beverages, but the flavour of pear made me curious enough to try it at least once.

While there's no shortage of good roti around town, the extraordinarily neat and clean as well as thoughtfully decorated interior make Bacchus a nice place to sit down and stay a while to enjoy your food."}
{"text":"Got the mutton with potatoes and squash. Best roti ive had. Woman behind the counter was super nice."}
{"text":"I use to eat here regularly about 10 years ago and loved it. Now I usually go to Island Foods at King and Dufferin, but the line up was out the door, so I thought I'd try Bacchus again. Empty restaurant at Bacchus. My roti of 3 veg was okay. I think I just prefer IF."}
{"text":"The prices are a tad high but the food is on point. Service staff is very friendly too even when I got there near closing time.

I had the jerk chicken and curry chicken rotis to go.  There's a solid amount of food, I was getting a workout carrying the bag back to the car just steps away.

The rotis were full of flavour and very saucy. Would definitely be back to try the goat and beef."}
{"text":"Amazing food. Awesome hot sauce. The curry chicken with squash and spinach was amazing."}
{"text":"I know some people will strongly consider harpooning me knowing that all these years I've been chiming on about the best roti in town and espousing the perfection that is Gandhi's without ever having tried Bacchus Roti, but alas.

I have now tried Bacchus. And while I was only able to plow through about about a quarter of my gargantuan roti, I loved it. I ordered a combination of squash and potato and it was piping hot, juicy and incredibly dense. I wasn't familiar with the spicy rating at Bacchus so I was conservative with my choice. 

My favourite part about Bacchus was how beautiful the decor was (not knowing about the renovations I was expecting a total dive in the heart of Parkdale). Very classy, sophisticated and clean - not at all like some of its neighbours. Also, the person who served us (perhaps the owner himself) was very friendly and personable. He seemed like a genuinely \"good person\" - you know how you just get that vibe from some people? He was one of them.

SIDENOTE: It's important to note the discrete divisions in the roti family - there's the typical West Indies roti (like Bacchus, Island Foods, Triple X, etc.) and there's the South Asian roti (like Gandhi) which is essentially curry in a wrap/roti. You can be a fan of one, neither or both but it's hard to claim a 'best roti' if you're including both types, ya know? So I still vote Gandhi for best South Asian style roti - for that there's no contest. But it'd be tough to choose between Bacchus and Vena's for best West Indies style roti!"}
