{"text":"Truly inspired and authentic French bistro food. Excellent wine list. Polished service. Close your eyes and you're in Paris.    Thank you Bacchanal. I'll be back."}
{"text":"So glad I decided to give Bacchanal a try on Friday night - French cuisine is not normally my go-to.   The restaurant is situated in a brand new space, on the ground floor on Sudbury street - very easy to find, and lots of space once inside. The decor inside Bacchanal is extremely unique, and fits the chic vibe. All details were considered with the design, going down to the cutlery, which is gold.   The service was outstanding. The waiter quickly picked up that I did not speak French, or have a solid understanding of French cuisine. He was extremely patient and descriptive of the entire menu (yes, the entire menu) and took the time to walk through each dish. I can't say many restaurants offer this same service - Bacchanal has raised the bar.   As far as the food is concerned - everything ordered was above par, with generous portion sizes (please refer to pictures). The presentation of the food was immaculate - each vegetable on the plate was placed immaculately.   Dessert was also a home run. Lots of options to choose from, and all sounded tasty.   Looking forward to my next visit for sure!"}
{"text":"Nothing like french food! Extremely poor quality of ingredients.  The cook must clearly struggle with cooking timing. Patatoes were raw.  Owner and cook should book some holidays in France :)"}
{"text":"Well... this place is awesome.   Decor is Parisienne upon first glance but look a little closer and see more. Wall paper in the dinning room and bathroom are the best.   Started with the wonderful cocktails.   Followed by oysters, the amazing Hokkaido Scallops Cru, the sumptuous Agnolotti with snails and wild , mains were the Steak Frites and the Halibut with morels and fiddleheads. Dessert was port wine with the Paris Brest.   This was an amazing treat.  Can't wait until next time."}
{"text":"3.5-4 stars  My husband and I joined my sis and brother in law for dinner while visiting TO. We started w delicious cocktails (I had the Northman which was similar to an Old fashioned with a festive spice  twist). We all the  ordered the chefs dinner w wine pairing ($150/person). We shared 3 hors d'oeuvres: a leak dish, pate w toasts and pickles, and these amazing boiled egg halved with a béchamel type sauce and an anchovy on top. The egg was amazing. So simple, retro, and delicious. A real throwback.   This was followed by a seafood tower that was good but not as flavourful as some I've had. It had: lobster, shrimp, mussels, oysters, octopus and hamachi. These were paired w lovely bubbles. I wasn't fan of the oysters since I prefer small oysters and these were a bit too big for my tastes.   We then had a delicious small plate of mushroom and escargot pasta. My husband doesn't like mushrooms or escargot but surprisingly enjoyed this dish. This was paired with a light Cote de Rhones  and was a perfect balance.   I was already full but when they brought the Cote de beouf to share which was paired with an amazing full bodied wine (can't recall the name as by then I'd had a few wines!!) I had to make room. It was amazing!   I also magically had room for the dessert we shared a Paris-brest  and a chocolatine type dessert w Sauternes pairing. It was overall a decadent experience.  This place should be a 4-4.5 place. But it wasn't. Why? 1) the decor was a bit blah 2) the pacing of the food was off. We kept getting dishes brought before we had time to finish the first and enjoy the pairing fully. 3) Our waiter was not the best. He is wasn't bad per se, but he wasn't friendly or welcoming. Too bad as these little  differences  really affected our overall dining experience. When your dropping  $200 a person for dinner everything should be perfect, including service. The restaurant needs to brush up on these 3 items if they want to stay at the price point they are at. Or drop the price..."}
{"text":"So disappointing. Ignoring the Toronto star review and deciding to take the reviews of yelpers into consideration, my partner and I went last night. We were excited for date night and live right next door. To our surprise the prices were less than we expected, however so was the food quality. Before I touch on that, let me talk about the awkward customer service. We came in a bit early (ten mins before our reso) and everything seemed really disorganized and the host was very awkward with us. There are so many people doing all kinds of different jobs for a half empty restaurant which was confusing. Especially because it took a long time to get drinks when it seemed like there were three bartenders? The first cocktail was very nice- non, je ne regrette rien. But we both had a feeling, because of the disorganized atmosphere that we were in for a disappointing meal. Our server was attentive, nice and prompt. She brought bread which was the probably one of the best things we had that evening. We ordered the Louisiana pork and black eyed peas to start which was bland and not cooked well. I suggested we try to the gnocchi because we may have just ordered the wrong appetizer. The gnocchi was mush with absolutely no solidity to it. My partner got the chicken \"americaine\" and it was pretty pathetic. I got steak frites which was okay but the steak was cold and fries were way too seasoned. The awkward host from before came by as I was taking long with my steak which was okay but not outstanding ( the keg is better) and she said to my partner \"is she just a slow eater or does she not like her steak?\" What??? So odd. The highlight was the dessert. Delicious. Not worth the 200+tip we spent!"}
{"text":"Great new restaurant. Dropped by after seeing the Toronto Life article. As La Select Bistro is one of my go to places in the city for French Comfort food, I knew that I had to give this place a try.   The decor is well done, modern but not too over the top. We were sat by Lachlan Dennis who was personable and very attentive during the whole meal.   More importantly the food was excellent. Two standout dishes for me. The Agnolotti was my favourite dish of the evening - perfect balance of flavours with an Iodine sauce that emptied the bread basket. My second favourite dish was the Baba au Rhum - light airy cake with a delicious Rum sauce. We also had the Maigret du Canard and the Halibut which were both very solid. The Hamachi Cru had a sauce that was slightly heavy and overpowering of a very fresh piece of fish, but that was the only minor quibble to an otherwise excellent meal.   Will definitely return."}
{"text":"One of the most incredible meals I've had in this fine city of ours. Would absolutely recommend.   We had the duck and trout. Both exceptionally well prepared and seasoned. I don't know what the other reviewer was talking about with respect to the portion size, but I found it perfect. Not too much, but definitely didn't leave me hungry.  Also had the paris brest for desert. One word: exceptional. The cream was both airy and rich while the pastry melted in your mouth. Again, no idea how the other reviewer thinks that a restaurant would even go about making a complex pastry like a paris brest to order, but don't listen to him. Even cool, this was easily one of the best deserts I've ever had.   In short, give Bacchanal a try. You will not regret it."}
{"text":"Wallpaper porn!  Lovely dinner experience at Bacchanal. The interior is beautiful--the space has a modern yet classic feel. The cocktails were quite good and the service was excellent. The food is traditional French fare and overall well executed,  but the paris brest is the real star of the show.  I would come back here."}
{"text":"Came with high expectations but left a little disappointed.   It's a beautiful restaurant, nice atmosphere. We sat by the bar and had very good service.   We ordered the leeks, eggs pepin and dried sausage for appetizer. They were delicious.  Unfortunately the complimentary baguette was a bit burnt.  We were excited to try the Cote du beouf which came with 3 sides. We chose winter salad, fries and Swiss chard gratin.  They tasted pretty good.  Now, when the beef came out, we expected it to be star of the night but the cook was uneven and was definitely not medium rare. It was extremely disappointing that we didn't even finish the meat.  The dessert was the best part of the night , the Paris Brest was absolutely delicious and the restaurant was nice enough to give it to us for the disappointing beef.  It wasn't the greatest meal I had but overall it was still a good experience, however, I will likely not be going"}
{"text":"They are not particularly responsive when you leave voicemails for bookings, and other queries. Unfortunately, recommend you do it all online. They do not have the facility of corkage.  That being said, we had a very pleasant time there.  The decor is gorgeous, blue and gold throughout, spacious, huge windows letting in plenty of light. Slightly pretentious gold coloured cutlery to continue the theme.  We found the music loud for a reasonable conversation, and when requested to lower it, they turned it off completely, which was great!  The wine list is traditional, a tad expensive, but plenty of choice. We had a very pleasant Cava which was reasonably priced at $55 and good Burgundy $120.  The soufflé Gratine was excellent, hot, tasty, well executed, and unusual in that we haven't come across it in many other restaurants. Highly recommended. The Gallatine of chicken and foie gras was also beautifully made with some tasty marinated celery, small portion. The trout was perfectly cooked with crisp skin, and we had a large dish of snow pea leaves with garlic, also good. The steak and frites were standard and fine. The rhubarb gelato with hibiscus granite was simply outstanding and again not found anywhere else in our experience.  Overall this restaurant gives the impression that it is relatively recently opened and at the moment is in fine form."}
{"text":"Hands down one of the best meal/dining experiences I've had in Toronto. Really attentive, personal service and interesting menu items, we couldn't pick a favorite dish out of the several we tried. Can't wait to come back!"}
{"text":"Went here with my boyfriend for my birthday dinner and it was amazing!! The escargot in particular was delicious :) The whole experience was excellent (even the wallpaper was beautiful!!)   We had the escargot and pate to start, then had the duck and steak with a ratatouille side - amazing! The duck was so flavourful, and the steak was cooked perfectly. Excellent French wine list :) Amazing service.  Would definitely recommend this to all my friends!"}
{"text":"I was underwhelmed here. It's in such a great location for Liberty Village or Queen West crowds, but the decor still felt like a diner, the escargot was really bizarre with its bright green iodine sauce, and the steak frites were just ok. Perhaps venturing a little higher on price point would make for a tastier meal? For now, I can't recommend."}
{"text":"Came here for dinner on a Friday night last week, and it was pleasantly full around 8pm. Not overcrowded though! The decor is modern with an industrial twist, and you're not seated too close to the table next to you.   We ordered 5 appetizers and absolutely loved the egg (which surprisingly worked well with anchovies and capers), and the fois gras mousse roll. The appetizers are surprisingly good portions, and we pretty much full before our entrees arrived!   For entrees, we tried the lamb shank and pork shoulder. Both were okay, entrees at other restaurants have been better.   I'd come back for the appetizers and atmosphere!"}
{"text":"Had a lovely dining experience at the newly opened Bacchanal restaurant on Sudbury Street. This restaurant takes over the spot of Brad Moore's Recess Diner, which apparently after 2 yrs of renovations was opened for only 2 months before being evicted for owing $260k in back rent. So doesn't look like this restaurant had to do much renovations after taking the place over. As expected, this restaurant was beautifully decorated and the dining atmosphere excellent. The wallpaper used in the individual washroom stalls is very unique, so worth going to have a look...   Our server was extremely knowledgeable on the menu items, offered helpful suggestions, and was very patient with us while we decided on what to order. He came by often to check on how our meal was and was very attentive.   Now on to the food...   APPETIZERS:  Leeks Vinagrette ($7) - cold, crunchy and refreshing, slightly on the sour side but tasty.   Champignon a la grecque ($7) - cold button mushrooms, not very special. Wouldn't recommend.   Agnolotti ($16) - pasta stuffed with ground up mushrooms, more mushrooms, and snails. Was decent, but portion is ridiculously small for price. Not much taste in both the Agnolotti and snails. Personally, I think the Porchini Agnolotti at Ufficio is much tastier and better executed.   MAIN COURSE:  Margret de Canard ($31) - Two small pieces of duck with a small piece of foie gras. Very tasty and delicious, but portion is too small for an entree.   Cote du Boeuf ($75) - A 38 oz 60 day aged bone-in rib steak. Comes with three sides (Ratatouille, Haricot Vert Almondine, and Frites), which are $6 each if ordered separately, so really the steak itself is only $57. This steak was super moist, tender, flavorful, and absolutely delicious. The ribeye had some marbling, but not overly fatty. Takes about 40 mins to cook, but totally worth the wait! The portion is large enough to feed probably 3 people (or 2 hungry meat lovers). All the side dishes were delicious, especially the Ratatouille.   DESSERT:  Paris Brest ($15) - Hazelnut praline cream puff. Was good, but at $15, I would expect a freshly baked puff that is still warm and not something that was premade and served out of the fridge. Was good, but not spectacular.  So overall, dining atmosphere and servers are top notch. The food however is over-priced and not on par with some other restaurants at this price point. The only exception is the steak. The steak was so good, and in my opinion of such great value, that it changed my overall opinion of this restaurant. I would come back JUST for the steak and skip the other dishes. Had I not ordered the steak, I would have rated this restaurant no more than 3 stars, but the steak pushes my rating to a solid 4!  This restaurant just opened, so perhaps they are still making adjustments. If they bring their other dishes closer inline to the quality and value of their amazing steak entree, then I see a long and prosperous future for this restaurant!"}
{"text":"Wow!! I loved Bacchanal! The decor is Parisian at first glance but look a bit closer at the wall paper and you'll get a nod and a wink to Toronto. I love that they don't take themselves too seriously. The vibe is casual and relaxed for sure but make no mistake- the food is legit French haute cuisine.  Every morsel a melt in the mouth taste sensation.  I sipped on a 'non, je ne regret rien ' cocktail made with gin and mescal while I looked over the menu.  The waiter was very helpful giving us suggestions for wine pairings and menu selections. In the end we were happy with everything we ordered.  The oysters are fresh and served up with the classic accoutrements. The scallops were an absolute must-have if you are a seafood lover like me. Dressed in a tangy lemon sauce on a bed of crispy watercress. You have to try this starter. It was my favourite dish and one I would order again next time I come here.  The agnolotti with escargots were heavenly.  And for the main, my steak frites was cooked perfectly. Maximum enjoyment.   I WILL be back. Hopefully very soon."}
{"text":"Tried Bacchanal for a friend's birthday dinner - the food was excellent (we all had the steak frites, with the green beans and the ratatouille, and ended with the Paris Brest and coffee) but the service we had was awful ... like, just awful, from our server, the guy who brought out bread and helped serve our entrees, and from the hostess who tried to move us to another table just as we were finishing our coffees. I live up the street and won't be going back."}
{"text":"We did the Carte Blanche yesterday with wine pairing for our anniversary and it did not disappoint. Probably the best meal and service we have had. The restaurant is beautiful and the food and service is excellent and not pretentious. Everyone is friendly and willing to explain. The staff really works as a team. We will be back."}
{"text":"Hands down our new favourite spot in the city. We walked this place sooo many times, the decor is modern and funky right down to the bathrooms. I'm almost upset we didn't go sooner because we've been missing out on some of the best food Toronto has to offer, seriously!  Try their cocktails to start or finish. The Geule de Bois cocktail is delicious!  Served a hot freshly baguette with whipped butter ( my fav!)  Started with their duck jam w fat, then we tried the soft shell crab coated in a chickpea flour based on our waiters recommendation it was so good we had to go with his second recommendation which was the snail. I could've stopped at the snails and been satisfied- seriously a MUST TRY. I will order it every time, I woke up the next day and it was the first thing I thought about (I've only had escargot once before at the Keg but these ones blew my mind!)  Our mains we went for the flat iron steak & frites cooked rare and the halibut. Everything was scrumptious and I would be happy with absolutely anything from this place. YOU SHOULD GO!"}
{"text":"The Food is delicious, the wine list amazing, but it all feels overshadowed by the amateurish service. First course arrives before we've barely started cocktails. The second course arrives before we are even half way into the first. We watch another course get cold because no wine arrives when it's supposed to. Even when the food is this good, the service leaves a bad taste in your mouth."}
{"text":"One of the better meals that i have recently, though on the pricier point, it was good. Food presented nice, flavours were well balanced. Portion were on the smaller end."}
{"text":"...\"Then it was time for the universally appealing steak frites ($24). When the eight-ounce flatiron arrived with a side of amber-gold frites, it was proof that the old classic didn't need to be reinvented. Besides, when does a good steak ever need an update? The frites had been double fried, as evidenced by the crisp exterior and meltingly soft interior. As for l'entrecôte, the flavour was robust. I suspected that it wasn't given ample time to rest, preventing the juices from redistributing and yielding a lukewarm interior. The accompanying café de Paris sauce, on the other hand, was proof that the saucière was technically adept.\""}
{"text":"WHAT TO TRY?!?  The mains at the restaurant are good. We tried the duck and the halibut and both were really delicious. Each came on a plate with a different pattern and plated very nicely. Both were very delicious and juicy. The hor d'uvres were also very good. Each plate is about $7 and you can get three for $17 and 5 for more than $20 so you can try out the different hor d'uvres they have to offer. The Paris-Brest for dessert is the popular item here. It's like a zeppole with cream inside a ringed pastry! Very good.   My recommendation is if you want to try a bit of each, for two people, one hor d'uvres dish is enough, one dish from pour commencer and a main each. We ordered three hor d'uvres and then an additional dish from pour commencer section on top of the mains...but we had to cancel the dish from pour commencer because we were getting full already from the hor d'uvres.   The restaurant is pretty inside. Great use of blues, gold and ivory through the restaurant. The kitchen is an open kitchen and is at the bar area. It's quite a cute restaurant for a brunch with friends or a place for a celebration.   LAST TIP?!  This restaurant is located at the corner of Sudbury st on the bottom floor of a new condo. There is an option for sample menu for a price of $150 with wine pairings or $85 without wine pairings. This allows you to get to sample a bit of everything on their menu if you're up for a prix fixe menu."}
