{"text":"Ordered delivery. Pizza was great. Way better then any of the major chains. Love it!"}
{"text":"I LOVE the homemade sauce here...meatball sandwich is awesome and their pizzas are also handmade.  Surprised they weren't listed here already, so I'm getting it done.  When you go in yell \"BADA BING\" and you'll get a dollar off...embarrassing, yes, but it's a buck.  New owners, Allen and Bob, awesome guys."}
{"text":"I'm not a fan of pizza but it's \"tradition\" for my husband to get it every Friday. I have to say Bada Bing gets 5 stars. We usually do take out but once in awhile eat in which is my favorite. The restaurant is a small old historic building with original brick interior walls. Nothing fancy but cozy & charming. Just the right amount of sauce and oozing cheese. I usually get banana peppers & black olives. I can smell it now. Oh - and the name Bada Bing doesn't mean a thing but if you say it when you pick up your pizza you get a discount."}
{"text":"Pretty darn good, filling pizza. This is our number one choice in Painesville."}
{"text":"Catered my wedding this weekend and the food was amazing. Staff was very friendly and professional. Walter goes above and beyond for his customers."}
{"text":"Pretty good pizza, not my favorite but will order it again. Prices are average. Staff are nice and delivery was on time."}
{"text":"Stopped by for lunch and upon walking in were warmly greeted by a beautiful hostess with a glowing smile! We knew then and there that the service was going to be fantastic. We even saw the cook carry out several large pizzas for a customer who was picking up the order all by herself.   The food was just as good as the service. We had the fried cheese to start, which just melts in your mouth, and an 8cut pizza with pepperoni and banana peppers that was out of this world! The crust is one of the best I have ever had, and I've had a lot of pizza in my day. The food was so good I ordered a Bada Bing sandwich to go to have later, and was very glad that I did. I could have ordered the whole menu! Everything looks so good!   If you live in the area your search for a good pizza joint is over, and if not, it's definitely worth the drive!   Thank you Bada Bing! We will definitely be back!"}
{"text":"Excellent pizza!! We get it almost once a week! Always ready on time. Good wings and salads too. Love their luau and veggie pizzas with red sauce."}
{"text":"Best pizza in the area. Hands down. No competition. The one of a kind sauce and the asiago finish really set it apart."}
{"text":"Love this place.  Enjoy my pizza, but ma and pa shops, have the best pizza!"}
{"text":"I just called to place an order for pick up and was immediately placed on hold. After about 2 minutes of waiting I was hung up on. Called back a couple minutes later and was again placed on hold. After 10 minutes of waiting I hung up and placed an order elsewhere. I enjoy the food here many times, but the customer service needs improvement. Every time I come in to pick up my order, all the employees are rude and yelling at each other. Feels like I'm inconveniencing them with business.  I have family and friends who have shared similar experiences here. I rarely write reviews but tonight's experience has really irritated me. I'm done with this place, plenty of other decent pizza places in the area."}
{"text":"When you drive 30 minutes to get pizza based off of a great first experience, you'd think you'd get the same type of great service as the previous visit..... boy was I wrong. After arriving, 3 employees were engaged in activity and 1 was sitting inactive. Not 1 person greeted me, much less acknowledged my presence as to say, OH I'll be with you shortly. The person who finally helped after a couple of minutes acknowledged my patience (I was becoming more annoyed with the staff) and got my order. I used a Groupon  he completed the transaction and that was it. No thanks for your service, have a nice evening nothing. Needless to say, I won't be back, no matter how decent the pizza is.  Totally different experience from my first where the food was great and the staff was even better (the ones who helped the first time weren't there this time). Quality of product and quality of service go hand in hand but apparently, tonight's staff doesn't comprehend that concept."}
{"text":"my boyfriend and I ordered pizza and salad for delivery.  even though delivery took an hour and twenty minutes (which we expected because that is what they told us when we ordered) they were both delicious  I think this will be our go-to for pizza (when we don't make one at home)"}
{"text":"Great food & service! Friendly server. I had the chicken wings and the Bada Bing sub! Delicious! Homemade bread and great sauce for the wings!"}
{"text":"Wow!  Best pizza I've ever had!  We ordered 2 different pizzas and a calzone.  We fed 6 people and everyone said what a great meal it was!"}
{"text":"Ok... I've been to this place about 10-15 times now, and each and every time, I am served piping hot slices (they're made fresh, not cut out of an existing pizza.... Who makes pizza by the slice fresh?!), with toppings that I want, all within 10 or so minutes. And the pizza is always delish. And $4 gets you 2 slices (also called half a friggin medium sized pizza) with a drink (or 3 for $5).   And the best part of it all? Just shout \"Bada Bing!\" as you walk in, and you get a buck off a whole Pie.   This place truly deserves 5 stars, and is thus being upgraded... :D"}
{"text":"I recently just moved to this side of the mighty Grand River and was looking for a decent place for pizza. The first time i ordered i picked up my order. Staff is super friendly and nice. The first order i picked up was a specialty pizza the Piazza deluxe and garden salad with cheese....very good, light on the sauce and reheats extremely well (it's hard to find a piece of pie that taste good reheated but this one does). The salads are really good...fresh dark greens, taste like a salad should! The 2nd time i ordered, i ordered delivery, i ordered the Meat Monster....it was good...again light on the sauce....actually the sauce is almost nonexistent and the delivery driver was about 20 min late (on top of a 50 minute wait for the delivery). Still pretty good pizza but i'm concerned about this sauce thing! Last night ordered delivery..meatball sandwich and more salad.......i don't understand the meatball subs....to the human eye you're blown away because they're so big....oh, i should mention, delivery was on time and driver very friendly. Back to the sandwich...the 2nd half of the sandwich went into the garbage this morning...ehhhh, just not my thing...there's like 40 lil meatballs on this thing....and again...i can't find sauce!!! These nice people have an aversion to sauce and i don't know why?!?! When i walk in, instead of saying Bada Bing for $1 off..i wish we could say it to add sauce to the order! I also got 8 Spicy BBQ wings and those actually were pretty good.....mostly because THEY WERE LATHERED IN SAUCE!! So, overall you could do much worse and i think i still have some investigating to do and may see if i can just order sauce on the side to add to my food....you could definitly do much worse in picking a place...you can tell these people take pride in what they do and it shows so i'm not going to bash them, i may return...it just won't be every weekend."}
{"text":"I had always had consistently great product and service from Bada Bing Pizza up until the last several months.  My final purchase from them was on December 18.  I picked up my order at around 8:35 pm and by the time I got home they were closed.  I ordered 2 of their I item 1/2 sheet deals which used to come with wings but now it is a salad (they have not changed this on their website so be aware that it is out of date if using it to order from).  Both of the pizzas had a very strong soapy taste and had to be thrown out.  I called and left a message and also sent an email.  I have not heard one word back from them.  I basically tossed $44 into the trash.  On top of that the staff members at the restaurant were totally unprofessional both in behavior and appearance.  I wonder if the owner was there because I would have been embarrassed if that was my place.  I gave the girl who rung up my order a $5 cash tip which she threw into the tip bowl without a word of thanks.  She could not have been more rude.  People in Chesterland and surrounding areas should just stick to Guido's.  They may be more expensive but nothing like this would ever be tolerated there."}
{"text":"I've had dinner at the actual restaurant many moons ago and it was nice and cozy with great service. I recently found out that they deliver to my area and did the happy dance!  They leave all of the local pizzerias in the dust. And they deliver the goods hot & fresh in a timely manner, even on a Friday night. Even more kudos that they get the order CORRECT, unlike the morons at another local joint who screw up our delivery order every single time and who demand to take their pizza back with them! Who does that??? Thankfully not Bada Bing!   Our delivery order consisted of the Painesville steak subs, the Bada Bing sub and a Luau pizza because yes, I have a thing for pineapple with (thinly sliced) onions on my pizzas. The bread on their subs was soft, fresh and epic! And did I mention that they're huge? No wimpy subs from that establishment! And their pizza is always baked to perfection. What's there not to love? Thanks for doing Painesville a solid, guys! We're big fans!"}
{"text":"I don't have enough good words about this place.  The pizza is fantastic, they accommodate every request, including a \"Briar Hill\" (a Youngstown favorite).  The salads are loaded with leafy greens that are not iceberg lettuce (They have spinach, dark greens).  The wings are ok, but the sauces are limited to your standard pizza place types, but this isn't a wing place.  The worst pizza I have had there was one where the bbq sauce was squirted on top and not used as the sauce underneath.  It was ok, but not what I expected.  The negatives:  They are not open on Monday (which is the only time I have a craving, kind of like Chic Fil A on Sundays)  They open late on Sunday, which kind of stinks for the football games.  They take 3 weeks off during the winter.  Guys, you are killing me here.  Maybe absence makes the heart grow fonder, but man, does it suck for those few weeks.    Thank you for creating the best pizza place I have been to in this county."}
{"text":"I debated between 3 and 4 stars for a while. We got a sheet pizza, a meatball sub, and a salad with grilled chicken. The salad was fresh and good, though we would skip what seemed to be fake bacon crumbles next time and did not eat the fried shell it came in. The pizza and sub were only so-so, however. The sauce wasn't very exceptional, and resulted in an underwhelming experience. Some of our party felt that they've had a better experience here at other times, so perhaps it was an off day. We will try again in the future because everything was cooked well, the salad was fresh, and the overall quality certainly wasn't bad."}
{"text":"First time with them, I had three pizzas -- one cheese, one pepperoni, and one thin crust pep/mush.  House salad -- $27 yowch!  They upcharge a $1 for thin crust and unk as to why...but now that I had the wonderful crust; they are going on a 3 week vacation and closing.  WTF?   Hindsight I should have just gotten a large.... will try again."}
{"text":"I'm a very picky person when it comes to pizza sauces.. I resisted trying Bada Bing for the longest time, because Pizza Pan was awful. I was at Taste of Painesville and nothing in the other vendor's stands were interesting, so I bought a slice of pizza. I ended up going back for four more pieces.. two more for me and two for my mom. She liked it as well. Great pizza, not the best prices and they close WAY too early."}
{"text":"I love this place. The food is great. The pizza is original and you can tell the difference between this location and the bigger chains. I'm always pleasantly greeted when I enter. I hope one of these comes to Madison in the near future!  ...or at least start to deliver out to Madison"}
{"text":"Ok here we go. Good crust. Decent sauce. Way to much cheese on my pie. I didn't think I would ever say that but here I am. I honestly pulled all the cheese and toppings off of the third piece because I couldn't stomach it.  Would have given 4 stars but girl who took my delivery order made me call her back when I tried to pay with my card so that she could take another order. Annoying. Finish with the Customer you are serving completely before moving on to the next. Or answer other call and place on hold. Delivery kid didn't know I paid because of this. I had to assure him I paid with credit card. Chesterland not my town so it was a one time Bada for me."}
{"text":"This place is one of the best mom and pop pizza shops I have ever been to."}
{"text":"Excellent! Everything about their pizza is outstanding, including the great crust and delicious sauce. The seasonings are just right - so flavorful.  We LOVE this place! I highly recommend their pizza! The employees are warm and friendly."}
{"text":"Great pizza! We had a pineapple pizza which came out very well. They also have some very good quality low calorie iced tea. The owner served us. She was very nice and helpful!"}
{"text":"Love their pizza. From the dough up amazing!! Friendly staff and great prices! Our new favorite pizza place. We drive by 3 other pizza places to get there. Yum!!!"}
{"text":"Love the at home atmosphere, the pizza is great. If your going to order the baked potato bring a friend it is huge. If you have no friends or don't like to share, it reheats great the next day."}
{"text":"Absolutely the best wings in the area. We order from there at least 4 times a month! Their Cesar salad is also great!!"}
{"text":"The pizza is great!  I did ask for a special order and they couldn't accommodate.  Just wanted my half sausage to be on one strip of the sheet I purchased but I'm not sure why they couldn't do that.  The people are very nice that work there."}
{"text":"My first Yelp review, and to be honest, I have not been to Bada Bing yet.    I plan on going soon.    They are already 5-Star to me just because they do so much in sponsoring Lake Erie College sports.     They are a small place, but they seem to really give back to the community.   I'll be there soon, but we all need to thank them for the great work they are doing!!"}
{"text":"Wow.  Best meatball sub I've ever had!  Home made meatballs and fresh bread that doesn't get soggy!  Couldn't have made it any better!! YUM!!"}
{"text":"I work in Downtown Painesville and anytime we get pizza for lunch we pick up from Bada Bing. Best in town."}
{"text":"The pizza is good but I expected better. I guess I just had super high expectations because of all the reviews that I've read. The delivery time I was told was an hour even though the place is 11 minutes away and the driver came exactly at the expected time. I got the 8 slice, the pizza had a nice flavor but it was a little smaller than I anticipated.  I would eat here again. I will probably pick it up next time."}
{"text":"A happy discovery in downtown Painesville. Don't shy away from dining in -- there's plenty of seating and the dining area is welcoming and charming, with warm colors and an exposed brick wall. The pizza is some of the best my partner and I have had in Ohio, with a crisp crust, flavorful sauce and fresh toppings. The spring mix salad was a pleasant surprise -- It tasted fresh from the garden and looked lovely on the plate, like a salad crafted by an upscale restaurant. Delicious house-made dressings, too. Our server was efficient and endearing. This humble little place is definitely good enough for a trip to Painesville. (And there's a great and inexpensive Mexican grocery store a block away). You should go!"}
{"text":"This is the best pizza place in this area, by far.  Great service, and the pizza in always good.  Very consistent."}
{"text":"My Italian friends (Paison to the uninitiated), have long argued over whether or not the Sopranos was just a great television show or a blight on the entire Italian culture.  The one thing we always agreed on was that the scenes at Bada Bing were always more interesting than any other part of the show. Tony smashing the bartender in the head with a telephone and naked women were responsible for 99% of the testosterone production in the United States during those scenes.    So during a trip into Painesville for a high school football game I came across a little storefront with \"Bada Bing\" lit up in the front window. So I think to myself \"Hey, I am about to participate is some good clean fun at a high school and since life is all about balance I really should stop in for a lap dance or three just to even things out a bit\".  So after stopping at the bank to get a bunch of one dollar bills because I am a cheap son of a gun, I head over to the club.  BUT.....I was deceived. This particular establishment is a pizza joint.  I wonder how many pizzas they sell that are paid for with a bunch of one dollar bills from fat sweaty men who keep averting their eyes.  Hmmmm.  The good part of all this is that I had the best meatball sub I have ever tasted in my life.  Not only was it tasty, but it was HUGE. No way I was eating that whole thing in one sitting.  My brother ordered a pizza which was just as good.  The place is staffed by a husband and wife team. She works the front and he cooks.  If every place provided customer service like Bada Bing then this world would be a much happier place. Ordering was quick and easy, the food came out fresh and fast, and my $20.00 in ones was way more than I needed to cover the two meals.  I don't get to Painesville often, but if I do get back I really want to try their ribs and a calzone.  The table next to mine ordered those items and I could hear them raving about them.  So if you are ever in Painesville and need a cheap, delicious alternative then this is the place to be even without the pole dancing.  Oh, and we one the football game, too.  Woohoo!!!"}
{"text":"Ordered pizza for my daughters birthday party. This was my first time ordering from Bada Bing. The pizza was outstanding and everyone loved it. The sauce made the pizza. My only recommendation is crispier crust next time. I highly recommend Bada Bing."}
{"text":"Best pizza in lake county hands down. Excellent service and always friendly. If you like pizza you have to try this place out. Prices aren't bad either."}
