{"text":"Excellent food and service. Feel right at home with the amazing hospitality of EVERYONE.  Thank you! All three of our meals were excellent.  Hats of to the chef! Best sweet potato fries! Best fish tacos as recommended by the staff. A bit pricey,  but oh so enjoyable. Well worth it."}
{"text":"fish was  burned not gold. cole slaw had weird spice and yellow. bad. fries great. get new cook chef. try matc student cook!!!"}
{"text":"Never seen a bar (especially a hotel bar) so anxious to close checks and have patrons go away. Happened to me both at lunch and dinner; I watched same happen all around me. Too bad because beer selection was good and atmosphere was inviting. Would have otherwise enjoyed spending more time and money here."}
{"text":"This isn't normally the type of restaurant we'd go to, but they were offering Restaurant.com girft certificates, so we gave them a shot. I reviewed the menu prior to going and knew what to expect -- overpriced American food. But, with the cert. it ended up being a pretty reasonably priced meal for three (including drinks and a dessert). The food actually wasn't bad -- everything was fresh and warm. 

The service was great! Everyone was super friendly and our waitress was very nice and informative. When I realized she'd overcharged on something, she corrected it without the least bit of irritation. 

Beer prices were okay, wine was pretty high (didn't even get into mixed). All in all, I would say their food isn't bad, but you can get much better for much less a few blocks away. If it's convenient for you, it's really not the worst you could do. With a coupon, it comes out comparable to other places that don't have the convenience of a hotel."}
{"text":"We were charged on our bill for a few extra things we did not order, and when we pointed this out to the waitress she immediately groaned and walked away.  I politely asked for a manager from another passing waitress to come over to help sort this out and when he came over I pointed out the problem, and not only did he argue with me but he also swore at me.  I am literately blown away by this!
Food was mediocre at best, I can get the same bar food at any other place but I can get it cheaper and be treated better at any other bar in town.  I have no idea why people like this place, even without being treated horribly by the staff it's just a \"meh\" place at best."}
{"text":"I'm going to tell you a secret: this is my favorite bar/restaurant in Madison.

The staff is friendly, keep your beer cup filled and bring the food out promptly.

Also, the food is great and the environment is perfect for sports-watching.

The best part is that, aside from game days, this place is never super busy. It is nice to get away from campus for a bit and just enjoy a good meal and a beer."}
{"text":"This place is a bit schizophrenic.I am staying at the hotel for a week so I am here enough to say that  they serve a good breakfast with a friendly breakfast staff."}
{"text":"Just whatever you do,  don't come here before a badger game. 

The staff is overwhelmed, the place is tearing at the seams,  and the food,  while you order of the menu,  is prepared buffett style and served to you from a warmer. Not only that,  but you also have to wait a long time for the incompetent staff to assemble your meals. 

We've had the unlucky experience of stopping here for a bite to eat before a badger basketball game and this is what we observed. 

Or waitress was frazzled and we had to wait 15 min just for our water.  We were to afraid to order anything more than burgers.  We waited 30 min for our food and another 20 min for a refill on our water,  which would have been appreciated sooner as we were choking down on our dry hamburgers. 

I wouldn't even come back here again when it's not a game day because the food was only sub par."}
{"text":"Fun hotel bar.  Came here after the Badgers hockey game and it was pretty hoppin.  A little spendy but that's normal for a hotel bar.  The chicken nachos were tasty."}
{"text":"So, it's a bar that is owned by and attached to a Hilton-brand hotel. That's neither a bad thing nor a good thing. I was there on a Monday night - the wait staff considered it more of a \"bar busy\" than a \"room-service\" busy night for a Monday. I had the most delicious steak salad than I can remember. The grilled arugula hearts, the steak, the slightly spicy dressing, the avocado, it was perfect. Seriously, this was not a salad with steak, this was a steak with vegetables. PERFECT. The Wisconsin beer selection is OK, I imagine Wisconsin has about 500+ more beers to offer, don't come here if you want foreign beers as it's not happening. The bartender was Chelsea lovely. I fully enjoyed my evening. Thank you Chelsea!"}
{"text":"Nice, clean restaurant. The staff were very friendly. The prices are way too high for being a sports bar and for the location! I went at dinner time on a Sunday and they weren't busy as all. You have to try the cheese curds. They're very popular in Wisconsin and fried cheese curds are huge in bars and restaurants. The restaurant is connected to the Double Tree Hotel."}
{"text":"Painful, as a Marquette grad to rate anything in Madison as positive...  But it is a pretty good sports bar in a hotel.  I've been here a couple times and always found the staff friendly and attentive (morning breakfast excluded, and why I ding a star).  

Bar staff was amazing, friendly, attentive.  Heck they made us chicken quesadilla appetizer that was even on the menu.

Morning service (aka bar supporting hotel) not so much.  Staff in attentive and know most are on coupons, etc.  Once the buffet wasn't even open.  

But as a guy that relocated to the South...  Visiting in January...  Only option ;)"}
{"text":"Not bad for a Hotel Bar.  Plenty of beer options but the food should only be eaten in a pinch.  Typical bar food burgers, nachos and chicken fingers, just pricey for the Quality."}
{"text":"Visited 1/3/15 an hour before the hockey game. Granted, school isn't in session so the crowd was light. We weren't staying at the hotel, but went in public entrance and got a table within 5 minutes. They take \"go red\" seriously in their decor. Great badger spirit photos! The carbon 4 porter was great and it was delivered quickly. Food orders were super fast and we made it to the game just in time.

My husband got the fish sandwich and it looked overdone, but he said it was good. Two small tenders instead of just one filet. I had the veggie and hummus wrap. Absolutely stuffed-- in fact too stuffed and the liquid from sautéing ran out--so very messy but great tasting. Hummus was mild spicy flavor. The mushrooms and black beans gave a meaty texture. The shoestring sweet potato fries were great. More crisp, but still tasted like sweet potato."}
{"text":"We've been here a few times and all was good couple years ago. We went for Friday fish fry tonight. The menue has really changed. Soup salads sandwiches and wraps. No dinners. We asked if they had a fish fry and the waitress said yes, beer batter fish 3 pieces with Fries and coleslaw for 12.95. Not worth it!  It wasn't busy and it seemed we had to wait too long for our food. Maybe they were busy with room service?  When we got our food the fish was dark brown, over cooked in old oil. I've had better fries from McDonald's they were similar in size and small potion. Nothing special. The cole slaw was awful. I have never had slaw with oregano. It was bad. It's easy to google a cole slaw receipe. Maybe in Mexico or Italy they use oregano in coleslaw but not in wis. I don't think I'll be back. I gave 2 stars because the waitress Amara was very nice and attentive. 
The other thing was we noticed a smell of cigarettes which means they need their carpet cleaned. It was nasty especially since smoking has been banned in bars and restaurants for some time now. The smell of tabaco won't go away unless cleaned."}
{"text":"Me and my friends were in Madison to attend the Beer, Bacon & Cheese festival in New Glarus. We were staying at the hotel that houses Badgerland (Doubletree) and I made it up from Chicago before everyone else. I knew I was gonna do some drinking at the fest and I was a bit hungry so I thought it would be wise to get some food in me. They had some good sandwiches on the menu but I was told to go with the turkey club which was a huge sandwich. Once I looked at it, I knew I was only gonna eat half and then hand the rest to one of my friends once they arrived. Sandwich was very delicious and came with fries. I washed it down with a Spotted Cow. Staff here was very nice and helpful...good spot and you should definitely try especially if staying @ the hotel."}
{"text":"Pretty average restaurant.  It smells like an old person dinner club, very ketchupy and fried-foody.  Waitstaff is very nice and personable.  
The roasted vegetable and hummus wrap is amazing.  I wouldn't go downtown and deal with parking just for the sandwich, but if I was staying at the hotel or I lived in the neighborhood, I would head over there occasionally just for the sandwich."}
{"text":"Stopped in tonight for the first time to use some gift certificates that I had.  Taylor was very helpful, professional and couldn't have been any nicer!  My food was excellent!  The cheese curds were my favorite!!!

Thank you!!!!"}
{"text":"Delicious food and great service! Have been here for burgers, steaks, and drinks and have always enjoyed ourselves. Especially the DoubleTree Cookie sundae for dessert!"}
{"text":"Food was pretty good, but they didn't give me the free cheese curds that the yelp check in is supposed to get you. So that wasn't great."}
{"text":"Staying at the hotel so I decided to eat breakfast in their restaurant.   The breakfast buffet was modest but good with typical scrambled eggs, bacon, sausage and potato choices.  What was disappointing was the service.  The hostess was very nice and seated me promptly.  With two servers for the six occupied tables I apparently was at the 'invisible' table as no one stopped by to take my drink order.  The two servers were busy chatting with one of the other tables so after 10 minutes I approached the hostess for my drinks and she became my defacto server.  30 mins into my breakfast...still no one else has checked on me.   

Probably 2 stars for service, 3 for food."}
{"text":"Chose this place bc it was close to the laundromat and not Basset St Brunch Club. Just looking for a Bloody. While it looked like the bar was open, it wasn't staffed. A nice man offered to make us a bloody anyways. Pretty sure he forgot to put vodka in it....and at $8 a piece they probably should've, at least, had pickles."}
{"text":"This is a great hotel restaurant. It definitely has great UW pride decor and can't even imagine how fun it would be to watch an away game. It is my second time staying at the hilton, which has a breakfast buffet there in the morning. A lot of great options, both hot and cold and the food isn't half bad. 

I ate dinner here once and loved their chimichurri (spelled that right?) sauce. Also, i enjoyed their strawberry salad. So good! Their cheese curds weren't that great. They have a really great menu of local beers. It would be fun to come here and watch an away game"}
{"text":"The bartenders use any, and all, excuses to close the bar as early as they can. I was hungry for a steak and three steaks later I still got a piece of meat that was severely over cooked and not edible. No idea how they, or their workers attitude, stay in business. They obviously got a lot of work to do."}
{"text":"This business has a check in offer for a free cheese curd appetizer however the manager refused to honor it. When asked why he hasn't removed the offer from their yelp page he simply said \"it's old and we don't do that anymore \"

Menu is priced as if it was a high end regular Hilton in a prime location like New York or Boston rather than a Double Tree in Wisconsin. The decor is sports bar and hardly high end.

Side salad was very soggy and very basic (onion, tomato and croutons) and the Italian dressing was cheap and light on flavor.  The chicken pot pie was not bad however the portion was very small (came in a small soup bowl) and given the price I could not recommend it as something of value to get off the menu.

My waitress was nice enough and tried hard however given the prices, portion sizes, ambiance, and management indifference to the customer it could not be overcome and I walked away with a bad taste.

There is nothing in the menu that  jumped out at me that makes me want to give this restaurant a second chance. Next time I stay here I'll be going elsewhere - even on a cold rainy winter night."}
{"text":"A pretty casual hotel restaurant. Because it's a hotel restaurant, you'll get your meal overpriced with a limited selection. At least parking is free in the lot."}
