{"text":"We came for a brunch on Sunday, and we stood at the door for 10 minutes without anybody even greeting us.  Service is slow, I almost starved waiting for our food. After ordering, we waited for more than 30 minutes.  No fresh juices.  Place is noisy."}
{"text":"Good brunch spot.Tasty and quality ingredients make this place a good spot for brunch. Affordable, too. Service gets pretty slow on weekends, though, but the good food is worth the wait. My experience with the waiting staff has been positive so far."}
{"text":"I ate lunch on a weekday at Bagatelle with some collegues.  All of us loved our food.  It was really good.  I had a goat cheese salad with honey. Perfect!  On the lunch menu, we have an option were we can add an appeteizer and a desert for 4$.  The selection is excellent!  This place is a Bring Your Own Wine.  I will be comming here for dinner for sure!"}
{"text":"No wait for my family of 5 Sunday at 9:30. Best croissant, bacon, eggs & cheese ever! Excellent food overall and great atmosphere."}
{"text":"I had supper here last weekend.  Exceptional food, excellent service and bring your own wine. I can't say enough about the great food.  It's true it's small a place,  but good things come in small packages :)  Highly recommended if you're looking for gourmet food at a reasonable price and you can bring your own wine to make this a great meal."}
{"text":"15mn d'attente a l'entrée avant que la moindre personne vienne nous parler... ça commence bien !  On prend avec mon amie 2 formules brunch... 45mn d'attente pour les plats !!! Pas un serveur qui se donne la peine de venir nous voir pour s'excuser, en plus de ça les assiettes arrivent tièdes ! Et cerise sur le gâteau un cheveu dans mon assiette !!!!  Un service vraiment SCANDALEUX et je pèse mes mots  Plus jamais."}
{"text":"Lovely food and environment. The service was too slow. Not family friendly: I came with my 20-month baby, they put us near the kitchen."}
{"text":"C'est le fun de voir un déjeuner à la québécoise avec une touche française. Le pain de campagne ou la baguette remplaçant le traditionnel pain blanc ou brun. J'y étais hier, samedi, pour un brunch entre amis. La place était pleine. Le service, lent et ordinaire. Sans cette expérience, j'aurais pu mettre une étoile de plus à mon évaluation car la place est agréable en semaine. Pour le déjeuner ou le dîner. Mais je la recommanderais simplement pas en fin de semaine."}
{"text":"INCREDIBLE place with AMAZING food. One of the best brunches I've had by far. Good portions and worth the price!! Get in here before 1 and you'll basically have no wait, even on a Sunday!"}
{"text":"Possibly the best fries I've eaten in my life. Food came quick but tasted delicious. Waitress was patient and translated everything for us. It was busy when we got there, but understandably as the food was so good."}
{"text":"Food was very good and fulfilling for it's price. I took sandwich with chicken pesto and basil during diner which came with fries and salad and it is worth it. Price was $15 which is not bad. If you take hors d'oeuvre ($5-$6) it comes with coffee, soup or salad and desert. My friend took that and she was too full to even eat the desert. Also, the coffee is refillable. Customer service is good. Their place is a little small although it was crowded when I went."}
{"text":"Notre endroit favoris pour prendre un excellent dejeuner à moi et ma copine ! Les plats sont excellents et le service est vraiment très bon !   Je le recommande !"}
{"text":"La Bagatelle offre d'excellents brunchs et un menu du soir varié et bien ficelé. La cuisine est toujours excellente. Par contre, le service peut laisser à désirer. Les serveurs sont tous sympathiques, mais ils nous oublient, courent partout. Il doit y avoir un problème au niveau organisation. Rien de catastrophique, mais on s'attendrait à mieux vu la cuisine et les prix."}
{"text":"Un de mes endroits préférés! J'y suis allé dejeuner, diner et souper à 3 reprises, et c'est juste excellent! Tant le service que la nourriture! J'y retourne bientot, cest sur!"}
{"text":"Une très belle offre pour un repas du midi à 70$ pour deux, en plus de pouvoir apporter son vin.  Un très beau choix de plats, d'entrées ainsi que de desserts.  La joue de buf au vin blanc, fondait dans la bouche."}
{"text":"Found the restaurant via Yelp when looking for place to eat before visiting Biodome.  No English menu for Brunch but waiter was helpful and explained the dishes for us.  We got brunch one and also an egg and spinach dish, came with delicious bagget and  fresh fruit, all very tasty.  Enjoyed authentic French experience."}
{"text":"while in Montreal we were looking for a restaurant to eat dinner and came across this charming place and had superb service and a delicious menu in this cute gem."}
{"text":"J'y suis allé pour un brunch et j'ai beaucoup aimé! Ils ne prennent pas de réservation le WE mais on est arrivés à 11h un samedi et on a tout de suite eu une table pour 4 (peut être parce qu'il pleuvait aussi..). Le choix des menus est très varié, et les plats étaient très bons. Service impeccable. A essayer!"}
{"text":"This place is a breakfast & lunch establishment in the Hochelaga-Maisonneuve area, situated next to the Marché.  It's an alright place and the food is nice, and I was honestly debating between 3 or 4 stars, but it's expensive for what you get and their coffee is pretty \"watery\", so 3 seemed more fair.  Also, the service is pretty average, a vague smile here & there but no coffee refills whatsoever, and with the lightness I could've used at least one more.  Not amazing but not horrible either, A-OK sums it up well."}
{"text":"Went here with a large group for our Christmas party. I was pleasantly surprised at how good the food was. I started with a risotto with foie gras and it was one of the best I've had. Main course was a filet mignon. It was perfectly cooked and both tasty and tender.   My dessert was a cheese cake and it was excellent.  I plan to go back for the foie gras!"}
{"text":"I didn't want regular tourist food. I wanted a local spot for breakfast - and we got something local here. It's a really small place that serve some kicka** French food. My girl and I took a bike and rode east of Montreal for 30 min. before this place caught my eyes (there were a ton of SB looking place).   I ordered Le Brunch - consisted of eggs (sunny side up - good way to soak up the baguette), crepe w/ Canadian maple syrup, sausage, bacon, ham, fruits, and (my favorite) home fries that packed plenty of flavor.   The croissant was crispy and light - just the way it was suppose to be made.   *waitress was awesome and helpful - my cup was filled up 3-4 times * if your French suck - it's cool, cause they will speak to you in anglais *laid back atmosphere *was that guy wearing an Expos cap?  * cafe au lait is in a huge cup"}
{"text":"This place is a gem. The plate was plentiful. I ordered two eggs, bacon and sausage and it came with a toasted baguette, fruit (Orange, watermelon, pineapple, melon) and coffee. Our server was very nice and kept our coffee cups filled. It only cost $12.  The coffee was a great roast. Service was speedy and with a smile.   Highly recommend."}
{"text":"My sister, boyfriend and I went here for breakfast on a Sunday in the early afternoon.  It's one of the very few if not the only restaurant around this area, so you can imagine how busy it was! We waited for 20 minutes to sit, but we were not disappointed with the breakfast.   The prices are decent, the food was hot and semi-quick, and the servers were all pretty friendly.  The lack of seating is kind of unimaginable for how busy it is."}
{"text":"Excellent et abordable. Salade tiède pieuvre et chorizo: gros morceaux de pieuvre. Juste assez de vinaigrette.  Sandwich: boeuf et confit d'oignons: simple, mais tellement efficace.  Les frites parfaite...en julienne et pas trop grasse.   Je dois y retourner pour le souper pour avoir une vu d'ensemble.  Je peux dire à ce stade que c'est un resto de quartier qui rempli bien sa mission."}
{"text":"Great breakfast place!  Their salmon eggs Benedict and and breakfast classics are very good.  Won't be disappointed."}
{"text":"A nice little restaurant, yet quality is good.  I don't read nor speak French, the server explained the menu to me patiently. I ordered a Steak Frite... Add C$5 it comes with an appetiser, a dessert and coffee.   The steak is so well prepared, very juicy, it tops with some sour onion, making more layers of favour ..  The appetiser is a spring roll type thing, I don't know how to say the name in French... There is duck confit inside, with a little sour and spicy sauce, taste is special   E chocolate cake I got for dessert is SO good... I don't like thing too sweet but this cake is perfect on the spot."}
{"text":"Best place we ate hands down while in Montreal.  Went here after the biodome.  A very charming restaurant/cafe with lovely and friendly waitstaff.  Prices were also excellent.  We all had sandwiches which came with choice of 2 sides - carrot soup (husband chose this and it was delicious), a lovely green salad with a great balsamic vinaigrette, and/or fries.  I chose salad and fries (fries were great, but wish I had gotten the soup after tasting my husband's).    Children had roast beef with caramelized onions (must have added a splash of red wine to the onions --- so good, was thrilled my son didn't eat all so I could have his leftovers for dinner!).  I had veggie sandwich and husband had chicken pesto.  They also had entrees and for $5.5 CD it added an appetizer, coffee, and dessert.  If only it weren't so far from our hotel I'd go back again before we headed back home."}
{"text":"I appreciated their service, however we were seated inside and it was too hot, not enough aeration. Also, food came late and it wasn't tasty, nor generous. I ordered eggs and sausage, nothing exceptional!"}
{"text":"Je suis une fille de brunch ! J'adore me lever tard et me préparer pour aller manger un excellent repas entre amis et ce restau tombe en plein dans mes goûts ! C'est l'endroit idéal pour boire du bon café et jaser de tout et de rien! Les dej, quoique très bons, sont assez classiques! On retrouve des oeufs bénédictines, des assiettes déjeuners et des crêpes ! Si vous etes du genre plus flyé, je vous conseille autre chose !   Bref une excellente place a decouvrir entre amis ou en amoureux pour vos dimanches"}
{"text":"Excellent petit restaurant français dans Hochelaga! Venue ici un soir de semaine, sans réservation. Il y a un menu papier et un menu du jour sur le miroir, qui change régulièrement. J'ai pris la table d'hôte. Au menu: potage aux champignons, huîtres fraîches, omble chevalier et légumes et mi-cuit au chocolat.   Le potage était un délice, onctueux et goûteux; c'est bien simple, j'en aurais pris un autre bol! Avec le pain chaud et croustillant et du beurre, hum! Les huîtres étaient bonnes et servies avec sauce mignonette et citron. L'omble chevalier était bien entourée de ses légumes et de pommes de terre à la sardalaise. Belle présentation et très bon. Seul bémol au repas: mon mi-cuit était trop cuit! J'aurais aimé avoir un coeur plus fondant. Par contre, super belle assiette bien présentée.   Le service était impeccable et assez rapide. L'ambiance est chic classique, mais pas snob. Super, parce que j'étais habillée en jeans et vieux chandail!  Petit plus: c'est un apporter votre vin! Le serveur se fera un plaisir de déboucher votre bouteille pour vous.   J'y retourne? Volontiers, avec des amis ou de la famille."}
{"text":"Found this gem while walking from our apartment in Sherbrooke.  There is outside seating and the drinks, (coffee and tea) come with the breakfast.  I had the grilled cheese with bacon amd brie.  Flavorful and filling! The rush comes about 1000, so I recommend getting there around 0900."}
{"text":"Excellent restaurant pour le brunch.  Les produits sont frais et les assiettes généreuses. Les frittatas sont exquises et la salade qui les accompagne est très bonne. Les simples assiettes oeufs et viande sont également copieuses en plus d'être ultra abordables. On aime d'ailleurs que les fruits soient aussi frais! Le café est également très bon.  Le service laisse par contre souvent un peu à désirer. On doit demander pour avoir plus d'eau ou de café, on attend longtemps avant que la commande soit prise et l'attente pour l'addition est également très longue. Au moins, on n'a pas l'impression qu'ils nous poussent vers la sortie! Tout cela se produit même en semaine, quand le restaurant est loin d'être plein. En fait, le service est étrangement meilleur quand l'achalandage est très élevé.    Bref, malgré le service quelque peu décevant, Bagatelle reste une superbe option pour le brunch, tant en solo qu'en famille."}
{"text":"Très bon plat avec beaucoup de choix de nourritures. De plus, les employés sont très  accueillant. C'est vraiment un restaurant à aller pour bruncher en famille."}
{"text":"*This review is for the brunch menu*  I really like this place for a nice boozy weekend brunch . They have a nice terrasse in the summer. You can bring your own wine and buy orange juice to make mimosas. The baguette option instead of the usual square bread is great, especially if you get an Old Cheddar cheese extra to eat it with. Their crepes are also reaaally good.   Try it out, you will not be disappointed!"}
{"text":"Une très belle place, très lumineuse. Le service est très accueillant et souriant. Toutes les assiettes sont bien pleines et le gout est grandement présent. Cependant l'espace est plutôt petit et bruyant."}
{"text":"Ma collègue me l'avait recommandé et je n'ai pas regretté!! Déjà, qu'on puisse amener son vin, à proximité de la SAQ, c'est un gros plus.  Lumière tamisée, bonne ambiance excepté la table bruyante d'à côté qui jasait politique, heheh. Le service était impeccable, rapide, et connaisseur! Tout était succulent et à point (huitres, potage, canard) J'y retournerai!"}
{"text":"Bon service, bonne bouffe; j'y étais pour le brunch. Rapport qualité prix vraiment bien! La petite terrasse est vraiment mignonne. Resto de quartier chaudement recommandé!"}
