{"text":"Can't say I've had a bad meal here. Quick and friendly service. Recommends: Chicken Caesar Pita, French dip, Reuben and the strawberry rhubarb pie. Weds is free pie with a meal. Seniors know a good deal so if you want to skip the crowds go later on Pie Rush Weds."}
{"text":"Prices are steep. Food not prepared as requested. The pie slices are tiny the waitress had to be told not to hold her tray over an infants head. That's about it I had the bbq Bacon cheeseburger, which was ok my wife had the deal the comes with a free slice of pie. Which wasn't very good"}
{"text":"Don't come here for breakfast! We've never been critics on breakfast. I mean, you can't mess up breakfast, right? Wrong. Bakers Square ruined a classic Eggs Benedict. The over salted, over medium to hard eggs on top of soggy English muffins had us running for the door. Not to mention the frozen hash browns that were undercooked and cold. Even the coffee was bad. Our waitress was out of touch. She asked if we wanted soup with our breakfast. And our mouths dropped when we saw our $24 bill and had a hard time accepting we actually had to pay for this meal. For the first time EVER a dine and dash crossed our minds. 

We bought two pies to go. Fingers crossed they will be better than our meal. Needless to say, we will not be coming back."}
{"text":"This place  is going to Shi*. I called in to place order for takeout and the person who picked up (Kevin)took forever to take notes and I had to repeat myself numerous times. When I get to the restaurant to pick up my order I am assisted by a young lady who had sucker marks all over her neck pretty disgusting I tell yah! When I tell her I am picking up order and her my name they had no records of it. I placed the order all over again and waited an additional 20 minutes. When I go inside the second time and I ask if my order is ready everyone is looking at each other as if I was talking another language. I get home and my son chicken finger order was missing the fries and our burgers looked sloppy and tasted just like grease, I am Totally disappointed with this place. I will never go back. I will much rather go to Burger King before I will ever go back to this place!"}
{"text":"We have not eaten here and quite a long time but we had a coupon and decided to try it again I'm glad we did.    The service is fast and friendly and the food is fresh and delicious. I got the mac & cheese OMG. Is it good.  My wife got a salad and a roast beef sandwich you could tell it was fresh just by looking at it she said it was delicious.  Oh yeah and did I mention the prices are very reasonable won't break your wallet here.  Will see you all again real soon."}
{"text":"Many delicious memories of French Silk pie! I would come here years ago just for the pie with my mom - she herself loved the soups!"}
{"text":"My Mom and my Wife's apple pies are better, but otherwise This Is Pie City!!!
We order pies from here often, and have found good  pumpkin, great pecan, and wonderful fruit pies. 
Lunches are well prepared, but why waste calories on protein or veggies?"}
{"text":"Customer service at its best. I have not been here to dine  in years but we often order pies. This past weekend I placed an order online for two pies. Early Sunday morning I received a call from the manager apologizing that the two varieties that I had ordered were not available because of National Pie Day being the day before. He went on to explain that they would provide two pies of our choice from what they had- at no cost. When my husband went to pick up the pies, not only did we get the two free pies offered by the manager but they also gave him a coupon for a free pie! Talk about great customer service. 
And...it's not about the free pies, it's  about acknowledging the fact before we got there and making the call to apologize. 
Thank you Baker's Square."}
{"text":"delicious pies and amazing carrot cake!! :) I was craving a slice of french silk pie and this place surely fulfilled it!"}
{"text":"Great place for a quick dessert!  Great prices. Our waitress Ellie was so nice and attentive. Visit the Mentor location it's nice and clean!"}
{"text":"Tried this place out.  Cute, and surprisingly cozy, this little place was very nice.  Standard fare, not much to the menu. They need more offerings that are good.  Denny's has a better menu. 
 Sandwich and soup were good.  Pie was very good.  Worth it if you like cafe type places, but with a much nicer dining room."}
{"text":"Wish I could give zero stars. Went here for the first time ever even though I have lived in the area my entire life. I will never go AGAIN. The restaurant is terrible. The food was so bland and everything tasted like it came out out of a can. The food came out so quick and didnt taste like anything. It took longer to get our check than it did to get our food. Thank goodness we had a coupon or I would've been even more disappointed in this place. Stick with the pies only and stay far away from the restaurant."}
{"text":"I haven't been to bakers square in years. We happened to be in the area and decided to stop for lunch. The coffee was good. We has a cup of chili with onions and cheese and it was mildly spicy and tasty. My boyfriend order a Reuben and I order the chicken avocado melt on oat bread. We typically share our meals. And today was no exception. The Reuben had plenty of corned beef and was grilled nicely. The chicken avocado melt was delicious and very filling. We shared a slice of peach pie for dessert and it was excellent. Flaky crust and sweet peaches. Yum"}
{"text":"The food is great and the service was nice, except I don't why every time I came to visit there were ONLY WHITE PEOPLE."}
{"text":"You name it...they've got it.  A very extensive menu of breakfast items, sandwiches, soups, dinner entrees, and, of course, a fabulous pie selection !  You can also take a whole pie or just a slice to-go.  The Cinnamon French Toast is a personal favorite - they also have a \"Pick 4\" option of 30 tasty breakfast items for only 7.89 !!! A real deal !!  The Chicken Pot Pie is also a good bet.  Bakers Square is a great family oriented restaurant.  On Wednesdays, you get a free slice of pie with your meal !"}
{"text":"We were visiting family and stopped in for brunch. I had the crepes, loved them. The service was good and the prices were too. They give you a free slice of pie on Wednesdays and they have coupons online."}
{"text":"Service is very slow. I've waited for a server to come over for at least 15 minutes to take our drink orders. I'm not sure why, but it smells weird inside. Possibly the carpet or something?  I am not the only one who has noticed. That aside, the food is decent and to be expected. The French silk pie and peanut butter pie is great. I don't go there often but when an do, it's usually for lunch."}
{"text":"Think Perkins or Denny's. Menu and food are average. Desserts are average. Nothing that impressed me here."}
{"text":"Lots of vegetarian options.  The French Silk is to die for."}
{"text":"Called in a to go order for one turkey dinner. Since it is the day before Thanksgiving-figured I'd beat the crowd. Still a crowd for pies-not for dinners. Called in a half hour before going there and still waited another half hour for my dinner. Some lady kept saying they were waiting for dinner rolls and I repeatedly said I did not order dinner rolls. When I called in the order they told me it would total $11 and change. When they finally brought the order-no apology for the wait-just shoved the bill and a bag a5 me and ran. Then I had to get in line and wait some more to pay. The bill showed $21 and change-I asked the cashier to check it and found they had given me some Asian dinner-NOT EVEN CLOSE after all that time. Again-no apology just \"it's our busiest day of the year\" over and over. Maybe in pies-but this is a restaurant and if they are serving dinners-someone should be responsible for them. The extremely RUDE and uncaring service and their inability  to get one simple dinner right has convinced me NEVER to return here. If they can't get one dinner right-it makes me wonder how many other items they got wrong-including pies. They ruined my holiday -wonder how many others they ruined-and don't care. Went to Denny's, waited about 7 minutes and went home with the right order, generous portions and courteous service. I guess they just have competent employees-unlike Baker's Square-or maybe they just care. Either way I would NEVER recommend this restaurant any day of the year."}
{"text":"Fast friendly service. I ordered an all American Hamburger and fries just to try it out. The hamburger was cooked to perfection sooo good. I was too full to order a slice of famous pie but I will be back on Wednesday when they have the special buy an entrée and they will give you a slice of pie for free ! Free is always for me."}
{"text":"I went to Baker's Square in North Olmsted around 7:45pm on 11-11-16 with a friend for coffee and rhubarb-strawberry pie.  It was pretty good, pie served warm at wait staff suggestion.  The atmosphere is a bit grim as all furnishings are quite dark and look dated.  The place was very busy and not too noisy.  Service was good.  Prices are moderate.  This place appears to cater to an older (over 60) crowd.  Nothing trendy going on here.  On Wednesdays customers who buy a meal get a free slice of pie. They had a huge variety of pies on display and they all looked quite good and fresh.  I've had lunch here in the recent past, and while nothing special, beats a fast food burger all to heck."}
{"text":"I took my granddaughters to this Perkins for lunch and was truly disappointed.  Upon entry the Hostess was checking another customer out on the register and instead of acknowledging our presence with, \"Hello, welcome to Perkins I'll be with you in a moment\" we were left standing there for several minutes.  No smile, unpleasant and all attitude like she was having a bad day and it was our fault.  Our waitress (Ashley) was great and obviously understands customer service.  My rating was also effected by the food.  It appeared to have been thrown on our plates.  The child's Mac & Cheese looked as if it had been nuked in a microwave with the outside edges being dry and tough.  The Chicken Nuggets were few and had to be dug out of their bowl because the side order of Broccoli was sitting in the middle of the bowl containing the Nuggets.  My sandwich (The Super Bird) was greasy and cheaply made.  The bacon was old and tired, the two slices of turkey tough and chewy, and the bread sopping with grease from the Swiss cheese and or the grease from the grill.  I didn't eat it...and didn't complain...as this was supposed to be quality time with my granddaughters.  I do not recommend this restaurant unless you like poor customer service and even poorer quality food."}
{"text":"Came in for breakfast and am very disappointed. Service was great....but the food is on the less desirable aspect. I ordered the veggie scrambler and my brother ordered the same....mine looked totally different and tasted different. Had way too much feta cheese and almost zero eggs. I ordered an English muffin which arrived half burnt. This place wasn't busy at all....only 2 other tables filled. The bathroom flood is sticky and I'm not sure they have cleaned recently....but it needs scrubbed."}
{"text":"Pies- they are fabulous.  We had breakfast on a Sat morning.  Service was polite and prompt- excellent.  Food was very good and a good value.  Not sure who the nay-sayers are- try Bakers Square, it is a good restaurant, and take a fresh baked pie home for dessert- you can't go wrong."}
{"text":"A few disappointments with Bakers Square: seating to wait for a table is insufficient; most times when I go, no one is available to greet customers; the wait staff is only friendly when the present thy bill; although it's obvious I'm a senior, I have to ask for the discount when I order-- I feel the wait staff could ask if there are going to be any discounts because even coupons have exceptions, so asking in this fashion offends no one. Otherwise, I've never been disappointed with my meal and prices are reasonable."}
{"text":"Free pie day on Wednesday!  The restaurant just got a facelift.  The menu is still about the same.  There is a variety on menu.  The selection of sandwiches are larger than traditional meals.  Breakfast is all day. And the soups are really good.

But today was about Grown Up Mac & Cheese.  Penne pasta, nice cheese sauce, some grated cheddar, and bacon (about 2 pieces worth cut in 1\" - 2\" size).  Its really good, nice size for smaller menu and comes with 2 pieces of garlic bread.  For the $7.99 it a deal, but if you want more you can add chickie for $1.50 more.  The sandwiches didn't look as good on plate.  They lacked the meat part, particularly the reuben which was more sour kraut.

But Pecan Caramel Silk Pie is awesome.  It probably took fifteen minutes off my life, but hopeful they weren't good minutes."}
{"text":"This might get a bit lengthy but I just want to let everyone know about this place..

My family and I came to Bakers Square a LOT when we first moved to the area.  The servers were wonderful, always remembered us and even knew what I would order!  I'd say that's impressive.  We stopped going at one point when they changed cooks because the food was awful.  Months later we decided to give them a try and it was great!  I always ordered the same thing, Hickory Skillet with fruit.  

One day family and friends went here for dinner and I ordered my regular.. It tasted decent but something in it upset my stomach.  I ordered the Oreo Pie for dessert and started feeling queasy so I stopped.. An hour later at the grocery store my nausea kept getting worse.  When I got home that night I became VERY, VERY ill.. I was never this sick in all 26 years of my life and when I say sick, I mean Linda Blair from The Exorcist.. It was horrible!  I was sick for a couple days.. Since that experience, I cannot get myself to go back.  I'm scared to try it again because another few nights of projectile vomiting just isn't something I want to do.

So, it's decent place for the workers/atmosphere and price."}
{"text":"I doubt I will ever go back to this location ever.  My husband and I went there for lunch today and to pick up an apple pie I had ordered for dessert tomorrow.  We got there at 11:40ish and were seated quickly and told who our server would be and I don't remember the name.   We were there for about 15 minutes and no one came to serve us.  Then a couple of young guys came in and were quickly given their beverages and a family came in and were seated at the booth behind us.  The server took their beverage order and I asked her if we were in her area and she said no but she'd send our server to us.  No one ever showed up.  The other people had now received their meals and we were still waiting.  At 12:15 we decided enough was enough and left.  Then one the way out I asked how long it would take to pick up our pie and was told about 30 minutes.  We went elsewhere for lunch and came back to pick up our pie and she said maybe another 30 minutes.  I didn't wait.  This is ridiculous.  We eat out a couple of times a week and this is not acceptable serve by any stretch of the imagination."}
{"text":"My dad freaking LOVES this place, so I often meet him for lunch/dinner here.  The food is just fine.  They have revamped their menu in the past couple years, so they actually have some moderately interesting choices.  I remember enjoying the bbq  pulled pork pita, and a flatbread that had a jamaican theme to it that was pretty good.  The pie is good-absolutely, and there are tons of choices.  This is what brings this place from 2 to 3 stars, as I am a lover of all things pie.    Overall, it's a good value and the food is alright-but it's so BORING-the decor, the menu, the food.  If this is your favorite restaurant(which, if it is, you're probably not checking yelp), I urge you to branch out a little and try one of the many great local places. Most of them have better food, comparable prices, and even have lots of tasty varieties of pie."}
{"text":"Haven't been here in a long time. Food surprisingly great! Can't go wrong with pie either! Had delicious squash soup and half classic dip sandwich both were better than expected. Topped off with peanut butter banana pie which was yummy! Husband had tuna melt which he said tasted really good! Overall a pleasant experience and we will have to come back!"}
{"text":"This place is really hit or miss. I always order the same turkey sandwich with fries. Sometimes my bread comes toasted, sometimes not. Sometimes the turkey is warm, but usually cold. Sometimes there is lots of crispy bacon, sometimes a few soggy pieces. Sometimes the fries are warm and crispy, sometimes cold and soggy. The turkey is pretty good but when you get your food it's always a surprise to see what you'll get this time."}
{"text":"Several tables open and we had to wait over 20 min. It's pie day (3.14) and you guys didn't plan on the higher volume of patrons. Really.  But finally got my pb cup pie and the nice sever was kind enough to comp it since it was small but the last piece."}
{"text":"I love this every wednesday is when you buy a meal you get a free piece of pie for fee which i love that. i haven't been here lately, but i would love to come back since i'm trying to save money. i do miss the one in wickliffe though that was was really nice i'm sad that it shut down."}
{"text":"I would normally give it a 5 but yesterday I went to Baker's Square the one in North Olmsted and the manager just sucked. I only wanted two pieces of banana cream pie and he wanted to sell me a whole pie why should I pay for a whole pie if I don't want a whole pie I only want two slices and then the pie that he was trying to sell me didn't look good at all and then had the nerve to ask me well what's wrong with it I don't like the way it looked so then I just told him no thank you and I left the store."}
{"text":"My review is geared toward the whole pies specifically.  I have eaten at this diner many times and the food and service is always very good.  This season I thought I would order four pies for Thanksgiving.  The apple and cherry look great.  The pumpkin pie with cream lacks good looks for the holiday, the flat cream on top literally looks like those cheap 4.99 freezer pies.  I was under the impression (with the box being so tall) that they could make it more elegant and maybe leave a little in the center untouched so you know its a pumpkin pie.  The other issue is with my traditional all time favorite, Pecan Pie.  Nearly everyone that I know chops the pecans up and covers them with the corn syrup recipe.  Bakers Square (the pie specialty folks) fill the pie nearly to the top with a gelatinous corn syrup mixture there is not a single chopped pecan nut in the corn syrup mixture, they only place a single layer of whole pecans on the top of the pie, like a garnish.  Needless to say it is not a lot of pecans or crunchy pecan flavor, it is mostly a massive sugar rush with 90% gelatinous filling and 10% top layer of floating nuts called southern pecan.  Unless they rethink their recipe on this one, not likely to buy it again, was sort of disappointed and they conveniently did not have a picture of a slice when i placed my order.  I will not order this pie again for any holiday, and will resume making my own."}
{"text":"Pie heaven. Need a slice with a scoop of ice cream and you'll get it. Service is decent with a calm interior. The rest of the food is without complaints. But the pie is where it's at!"}
{"text":"We had dinner on March 20th and experienced a great meal. Our waitress, Tammy, was terrific.  She took our order of omelettes and they came accurate, hot and the food was excellent. Tammy stopped at our table several times and asked if we enjoyed our meal. The manager also stopped at our table and inquired if we were enjoying our meal. It was a pleasure having dinner and look forward to our next visit. This Bakers Square is a restaurant that provides customer service with great food. 
Ed and June"}
{"text":"As always and excellent experience.  My 2 year old daughter and I had lunch there.  The service was excellent and the food was great.  We even took a banana cream pie to go.  The only thing bad I could say is that my daughter got a side of avacado with her meal and it was a very skimpy portion.  She loves avacado.  I will definitely keep this restaurant on my places to frequent."}
{"text":"I'm usually not a fan of 'chain' restaurants (I prefer locally owned diners, bistros, etc.), but Baker's Square is one of the better ones, all things considered.  I like the fact that they have a good selection of breakfast, lunch, and dinner items, including a salmon dish, and a tuna melt.  There is a decent selection of various salads, soups (although I wish they had New England clam chowder), and sides as well.  And the best thing of all, if you don't have pre-diabetes yet, is their wide selection of simply scrumptious pies.  It is their pies that they're known for.  All in all, this is a very good family restaurant, with decent menu choices for everyone.  I wish they had an 'open kitchen' though, as it's cool to be able to watch the cooks and servers do their thing.  The service and servers here are excellent as well.  In summation, I recommend this place.  It's hip to be SQUARE!"}
{"text":"Stopped in for a pie menu and ended up with 3 slices for the family to try out pre thanksgiving. 
Better to try them out before ordering for the holidays.

Much like you would expect of a diner style restaurant.
Older clientele typical diner style menu, but again I didn't eat just purchased pie slices.

Decor was a little dated, but again totally my observation while waiting in line.

Coconut cream was just ok. Not a-lot of coconut and filling was just ok
Triple berry was delicious, fruity and flavorful.
Peanut butter cup got a thumbs up from my husband. 

Overall I'd say I've had better crusts but I would say based on the 3 we choose your pie experience will be solid."}
{"text":"Stopped in around 10 pm. Seated and then waited for 15 minutes before the manager finally came over and took our drink order, we were ready to order too so he tool that too. He brought coffee which was crap, weak and burnt. He said he would make a new pot ant bring more. Which he did when we were most of the way done with our food. It tasted exactly the same. Our food arrived and was ok. The servers brought our food and then the bill. I should have tipped the manager instead."}
{"text":"First let me explain to everyone not familiar with the area that there really isn't that much for breakfast in Richmond Heights / Willoughby Hills.  I know and have visited each place extending out to IHOP in Willoughby to Denny's in Highland Heights.  Some mornings I just want to go out and grab a sit down greasy spoon breakfast with out having to drive to Eat N' Park or Flavors on the Vine.

Baker's square has never let me down.  The food is savory, fun (Chicken, spinach, swiss crepe last time I went), and you never leave hungry.  They always send out BOGO or 50% off coupons too, so make sure to use those up.  I am however basing my 4 stars purely on breakfast but they do offer lunch and dinner.  For what its worth, the place seems to always have cars at it as late as 9pm.

Wednesday is free pie day so go out for a piece.  

Some people will probably tell you its starting to show age, which is probably true.  But hey, I think Baker's does the trick for us unlucky souls not in the 'close, hangover driving distance' to a true greasy spoon breakfast gem.  My next stop to try will be in Euclid, I hear there is a Fox8 Hot Spot there that I've driven by and never stopped in."}
{"text":"Here is a cute little place to check out. Apparently,  they are famous for their pies. I was going to order a piece but the thing I originally wanted they ran out of  They have those little three thing deals- like a small portion of food, with a soup or salad and then a piece of pie. I placed my order for it and the waitress came back a few mins later telling me they didn't have what I wanted so I ended up ordering their macaroni and cheese. It didn't come with pie though  I could have ordered a piece but I felt guilty as it was after I ate almost my entire plate of Mac and cheese lol So I decided against the pie. 

I'm kinda regretting it though because the pictures of the pies really did look good and I guess you should get the most popular item from a place if that's what they are famous for. Le sigh. So yea- didn't get any pie but the Mac and cheese was very good! I liked the atmosphere too. It's basically a diner so that's the type of setting you're getting. It wasn't crowded either, although I was told it gets really busy in the morning time. But I can't speak for that- only can speak for what my own eyes saw hehe 

Overall I did like the place! And I thought the food was really good!"}
{"text":"Stopped by here on my way from Conneaut back to Columbus. Food was great! Had the 1/2 Ruben,  tomato bisque soup and slice of cherry pie. Very good on a chilly, rainy evening."}
{"text":"Had dinner at Baker's Square the other night with the family.  Service was friendly and food was tasty.  The French Silk pie we took home was delicious too!

My salad was yummy and my chicken pot pie was delicious.  I'd order it again in a heart beat. I will definitely be back for more pie during the holidays."}
{"text":"this place has really gone downhill.  Although I was with a larger group, it took a very long time (40 mins)to get our food, and after my friends got their food it took almost 20 more minutes to get my creeps.  The only thing that was good were my country potato."}
{"text":"A1 customer service. No long wait. The food was fresh and very satisfying. The waiter was very personal and addressed my kids directly which was very nice. I recommend this place to everyone. Oh yeah I almost forgot never skip their pies because they are really scruptous!"}
{"text":"Pleasantly surprised after not visiting bakers square for many years. I thought it was going to be a run down dive like Denny's but I was wrong. 
We had chili for starters and it was really good. Mildly spicy and thick. 
I ordered a Reuben and for not being a deli, it was very good. My girlfriend shared her chicken avocado melt with me and it was delicious. We had peach pie for dessert and it was excellent. 
The server, summer, was attentive and pleasant which rounded out a wonderful Saturday brunch for us."}
{"text":"This review is strictly for the pies, nothing else!

Baker Square pies are my absolute favorite.  Baker Square left California several years ago, so when I passed by one in Ohio I stopped dead in my tracks and had to get some pie!!!

French silk is my favorite!!  Also European Truffle when it is in season.  They also have a mighty yummy apple pie too!!!

Baker Square come back to California!!!"}
{"text":"It was our good fortune this past Saturday to have Bridget as our waitress.  While all the servers are friendly and efficient, she was exceptional!  We've always had decent meals here and this visit was no exception. What was extra nice was the fact that they completely redid the interior seating area and the exterior façades.  It definitely looks more homey!  My only complaint is that they added TVs.  There is no need in a family restaurant for TVs."}
{"text":"They are really trying to freshen up their image after a decade of floundering.  Their pies are excellent, and the rest of the menu is solid.  There's good value here.  If you like eating typical American fare that you might find someplace like Perkins, you will be pleased with the food and service here.  And did I mention the pie is very very good?!?"}
{"text":"It's tough to go wrong with a restaurant that has good food served with a smile. That's been my experience since returning to this restaurant after many years. It had been a family favorite when my kids were little 15 years ago, so I was very pleased to find nothing had changed. 

My 16-year-old daughter needed a little cheer and some good food, so my girlfriend and I took her to Bakers Square, mainly for all of us to enjoy some pie together. My daughter revealed that she hadn't eaten much, so she ordered the Grown-up Grilled Cheese sandwich. The portion size was much larger than we expected. Most places would have served a wimpy, thin sandwich. Not here. The cheeses served were piled on heartily and the pile of fries were more than she could eat. She wound up taking half her meal home.

We returned another day, this time with my best friend along. I ordered the Bakers Club sandwich and my buddy warned me he couldn't finish his the last time he came. It was huge, and I did struggle to finish. I left a lot of fries on the plate to save room for the yummy Triple Berry pie, my favorite. My daughter had breakfast, served at 6:30 in the evening. A cheese omelette with home fries and a crepe, which she devoured...then had pie.

Service both times was excellent. We never had to ask for refills and the servers were very pleasant and cheerful.

My one and only ding on Bakers Square is their soft drink pricing. It disappoints me that they would charge $2.69 for a soda that was served with 3/4 of a glass of ice. My buddy and I each ordered sodas, so that was almost $6 for two glasses! My fault for not checking the menu on that.

Total bill for all three of us came to $48, which included the main meals and a round of pies.

Overall, a very good dining experience."}
{"text":"I worked here for five years over 25 years ago and still enjoy coming here to eat. One summer I ate a slice of French Silk pie every day. Running around as a waitress ensured I burned off the calories.

My favorites on the menu are the Chicken Stir Fry Pita, the Works Burger and the Club Sandwich (be sure to order thousand island dressing with it). The Chicken Avocado Melt is also a good choice.

And every single pie they make is good. It is hard to choose from among my favorites, which include the French Silk, Chocolate Peanut Butter Cup, Oreo, Strawberry pies, Lemon Supreme and Caramel Pecan Silk Supreme. The fruit pies a la mode are always good - as is the cheesecake and carrot cake!"}
{"text":"Bakers Square has earned---and deserves---a five star PIE review.

I've been purchasing their pies for several years now so feel my review can be trusted.  FAR better than any of those out-sourced pies from Giant Eagle or Heinens (except for H's apple-walnut-caramel).  The pies here may be a few dollars more, but so worth it for the quality of ingredients and the exceptional results.  Compared to those others---that I'd liken to a \"specialty adult line\" (if they have such a thing) offered by those inexpensive brands of colorfully boxed kiddie-type snack cakes and desserts---Baker Square pies are the closest to carefully and thoughtfully made-from-scratch versions from an accomplished home baker.    

Very few times have we been disappointed.  Instead of five, maybe a four star, but never anything less than that.  Most often I purchase for larger gatherings, family or friend get-togethers, and holidays, when I enjoy---and prefer---cooking savory dishes more than sweet.  Even though I have a favorite (and fabulous) crust recipe from Julia Child, I don't always have the time, so I really appreciate having Bakers Square.  In particular, their
.  Country Apple   Coconut Cream French Silk  
Always excellent choices.  Tried their cheesecake / apple one time.  Didn't go over well---but we prefer cheesecakes without additions.  Others, though, must love those various fruit & cheese combinations since Bakers Square continues offering, so worth trying.)

I can't speak to other menu items they offer, because it's been a number of years since we've eaten here.  I can say THIS much, however, that thanks to Bakers Square, senior citizens---who appear to be the majority of dining room patrons---can dine in comfort in a clean and spacious restaurant with a very cheerful staff, where they know they'll feel welcome.  They've absolutely earned that.  If you've never visited one, please disregard any disparaging, unkind reviews about patrons.   It's totally completely untrue.  Some reviewers have no skill at being humorous or clever, so their only resort at hoping to receive maybe a couple of \"funny\" votes---that they're so obviously desperate for---is by making fun of older diners. Pretty pathetic.  Maybe Yelp could add more voting options?  Just a thought.

.              Useful           Funny          Cool      
Pathetic      Ew...C-r-e-e-p-y      Are You Kidding?!?

Definitely a place to bring Mom, Dad, Auntie, Uncle, Grandma and Grandpa.  If they've never been here, chances are they'll enjoy it---and you, too---ESPECIALLY if you all leave room for a slice of dessert.   
."}
{"text":"Stopped here for lunch, and love this place.  I had the grilled salmon with pesto, Hubby love had an omelet.  The salmon was perfectly grilled, rice pilaf was spot on, and the portion size was perfect.  Hubby's omelet was very good, and when served to him it was still hot!  We each got a slice of pie, I had key-lime which was the best I have ever had, and he had Oreo which was very good he said.  

The only complaint I have, there isn't a Baker's Square close to my house! :D"}
{"text":"Stick to pies and breakfast foods, what Baker's Square does best! I often come here for pies for holiday occasions and for brunch on Sundays after church. However, one time I decided to get lunch and ordered a chicken caesar salad. It was quite honestly the worst salad ever. Limp lettuce, unseasoned chicken, a few croutons, and no caesar dressing or anything of the like. I am giving 3 stars due to this experience, which was really much lower than 3, but my prior experiences that include their breakfast entrees bring up my overall review."}
{"text":"I've never tried their food, but this place has a nice selection of fresh-baked, tasty pies.  The employees are very friendly and helpful.

Now to the bad part...these types of restaurants seem to be very popular with senior citizens and you can tell because as soon as you walk in the door, the odor hits you in the face!  The air honestly smells like a nursing home!  Some people may not mind it or be used to it, but I think that smell alone would deter me from dining in at this establishment.  It smells like old people!"}
