{"text":"Had this for lunch at work today! These are more like bubbles of heaven than anything else! Cant wait to tell people about this GEM of a spot!!"}
{"text":"Everything that I have tried from here so far has been delicious! The owner is so friendly and welcoming! He answered all of our questions and has a lot of passion  for what he does and it shows in the food he presents! Highly recommended!!!"}
{"text":"Awesome food awesome Chef! Also macro friendly:) There are so many delicious options to make meal prep fun! The food taste home cooked at the  absolute healthiest and freshest way possible! Definitely a new long term customer."}
{"text":"Delicious and affordable, could not ask for anything better! Their savory bites are so filling and delicious while their sweet ones are absolutely delectable! Going back very soon!"}
{"text":"Place was CLOSED. Hours on yelp and google state they should be open. Mad a special trip to check them out."}
{"text":"Very friendly owner both insightful and friendly. Great food and healthy options. They have a good amount of choices but make sure to get there early in order to get a pie"}
{"text":"This place is amazing! Honestly a great find! The food is made fresh right when you order. I ordered the love pack and it was so worth the wait. Definitely will be coming back here!"}
{"text":"Food is incredible!! The buffalo bite was amazing. I found this place by just Yelping the area to see what was there. What a great find. Owners are super cool and extremely helpful. You can not go wrong by stopping in."}
{"text":"First time here and love it!!! They have very delicious savory and pastry choices. I ended up getting the green chile pork and buffalo chicken savories. For dessert I ordered the birthday cake and apple pie pastries. Well worth the drive!!"}
{"text":"Fresh, delicious baked items to take home as well as savory little meals.  A unique little bakery in Chandler.  Prices are extremely friendly- you can't walk into a grocery store and beat them, nor know that it's fresh daily from the oven like theirs.  Definitely try G'mas bean pie or the peach cobbler.  Can't wait to come and try them for lunch!!"}
{"text":"This place is amazing! Just discovered it. The guy who owns the place is super cool and he really likes to bake and it shows. The food is delicious. He has 3 different savory baked bites and some sweet ones as well. The to savory ones that I tried (burrito and green chili pork) were delicious!  I definitely recommend this place. He makes everything fresh, from scratch. It's great to support a local business and this one is legit!"}
{"text":"This place is as unique as it gets they should call these little things heaven pockets, because from the minute i took my first bite i thought i was on cloud nine i wanted to give praise to the great god Zeus for riding his noble steed Pegasus down to earth and blessing us with theses sensational goodies !!! i tried the buffalo chicken, green chili and beef burrito bite and let me tell you they have it down to a science they are not overly doughy they have the perfect amount of bread to stuffing ratio so you don't get too much of one or the other, reminds me of a bender i went on in Vegas but that's another story  fora night of drinking!! if you don't try this place please do me a favor and punch yourself in the face because you have to be crazy not to try it at least once."}
