{"text":"I keep coming back! I've been coming here pretty regularly after it's opening in May. Because I like it :) It has a quite European feel, reminds me a little bit of Vienna.   The staff is very friendly and their coffee & tea selection is great. There are some options if you're looking for a sweet indulgence but they clearly aren't huge bakery enthusiastics (like the Viennese).  If you like black teas I would suggest trying the Marco Polo. If you come here to work etc: it is unfortunate that sometimes their wifi connection isn't working properly. Also the air conditioning is sometimes adjusted to way too cool in my opinion."}
{"text":"LOVE this location, and balzaks in general.   The last time I went I ordered the Parisian chai latte and my taste buds were in heaven. I loved it so much that I had to come back an hour later and buy their kusmi tea (St. Petersburg 125g tin, $22 - a bit pricy but SO worth it if you have time to make it at home).   I also recommend their affogato's if it's a hot day and you're in the mood for a treat, and their espressos are always good.   Staff: super friendly  Interior: always clean  Wifi password: balmks4949 If it's a nice day, sit outside on their front patio and enjoy a nice cup of coffee."}
{"text":"Great to have a Balzac's in the neighbourhood. While the location is a little small and therefore usually full, it is a perfect spot to grab a coffee to go before/after strolling through the market. My go-to drink is the cafe au lait with Farmer's Blend coffee and skim milk. A good latte is easy to find in this city but that isn't true of a cafe au lait so I'm glad to have this option close by! Also they happen to serve Shockingly Healthy brownies which satisfy my sweet tooth when I'm trying to be good."}
{"text":"Quiet, pleasant, classic European space. Macchiato was good. Darker roast beans so not so bright and fruity. That's neither good nor bad -- just depends on your preference."}
{"text":"While I enjoy their coffee and the fact they discount for travel mug users, I'm less than thrilled with the terrible customer service. I moved to this neighborhood and set my sights on making this part of my morning coffee routine before work, but I'm so disappointed with the baristas that the discount, the good coffee and the nearby location is not enough for me to make this my morning haunt."}
{"text":"Good coffee place, which they had more milk options like almond or coconut. Prices are a bit high, but I'd rather drink this that Starbucks or second cup."}
{"text":"The coffee, as with all Balzac's locations, is delicious. The service, unlike all Balzac's locations, is poor, all because of one barista. I stopped going to this location this winter, when I was \"served\" by this woman who was clearly doing everyone a favor making them premium-priced lattes.  I love Balzac's Cafe Nordique. I buy it as a treat because, seriously, $6 latte. It came with cardamom. Or it was supposed to, but the Cardamom Nazi didn't think it should. I ordered the drink, paid, gave a tip with the change, and waited at the end of the bar. The barista gave me a drink without cardamom. I asked for cardamom. She rolled her eyes, huffed and puffed, and took the precious cardamom in its glass salt-shaker enclosure and tapped once delicately over the latte. She then turned around to clean (I think - there was no one else in line ordering), taking away the spice. I left deflated but determined to get my cardamom next time.  The next time I came in, Cardamom Nazi was brewing again. I ordered my Cafe Nordique and waited at the end of the bar. The latte came down, cardamom noticeably missing. I asked her for the cardamom. She turned around, holding aloft the cardamom and tapped once. This time nothing came out. She was about to turn around but no! I asked for the shaker itself! She was horrified: \"This is very expensive you know! I don't want to put too much.\" But she relented, giving me control of the shaker. She watched me tap out half a teaspoon of cardamom -- what was likely a good 5 cents worth!  A man at the bar saluted my move. We acknowledged it was dismal service for a cafe of Balzac's stature. I left and never came back. I bought a bag of cardamom from St. Lawrence Market that day."}
{"text":"Great coffees. Great service. Must try the Zucchini chocolate muffin! So moist and heavenly!"}
{"text":"Nice addition to the neighbourhood. I like the little patio out front and the general ambience of the place. Coffee is pretty decent too."}
{"text":"Great neighborhood feel and the team is knowledgable and just a great vibe to the place. Been to the other locations.  Not too shabby for being right by the St.Lawrence market."}
{"text":"Particularly stylish, comfy coffe shop location.  All the usual Balzac menu items. All the standard espresso options, plus Cold brew, daily pastries, wtc."}
{"text":"The ambiance alone is awesome!  Lots of great options for souvenirs.  The cups have a great look and, oh yeah, the coffee is great too.  ;)"}
{"text":"Tried the Cafe Canadien and enjoyed it a latte. It was a latte (pun makes sense now) with Maple syrup involved, and has been one of my favorite specialty drinks in Canada so far.  Interior was hipster and comfy, great for focused working, dates, meetings, big groups, take out, or just hanging out. Outdoor seating too, if your heart desires some sun."}
{"text":"A great place to bring your laptop, do some work, and sip on freshly brewed coffee. The atmosphere is great and it's right next to St. Lawrence market. I like to come here on weekdays when it's not so busy.   The staff there are great at helping choose a drink from their latte menu. My personal favourite will forever and always be a cappuccino."}
{"text":"Finally a Balzacs closer to work - right beside the St. Lawrence market (South-West side).  Met with friendly and polite service. Lots of seating inside and a cool little patio out front.  In my opinion they have the best Cafe Mocha - not too sweet, just right. Medium is about $5 with tax - similar to Starbucks pricing but much better in taste.  Sweets look really good - especially the double chocolate brownie. A must try next time.     Highly recommended... a nice change from Starbucks.  BK"}
{"text":"I first heard of Balzac's on Dragons Den and it's so great to see a Canadian chain doing well!  Location: 5/5 They're right across the street from the market. The interior of the cafe also blends nicely with the European feel of Market St as a whole.  Drinks: 4/5 Tried out the toasted almond latte and the matcha latte and both were good to the last drop. The almond latte wasn't too sweet and didn't leave a syrup-y taste in my mouth, unlike some Starbucks drinks. Felt the matcha could have been blended more since it tasted grainy but nonetheless was aromatic and light.   Atmosphere: 4.5/5 I liked that they had individual round tables rather than communal tables, since you don't have to worry about knocking over someone's drink next to you, or sitting too awkwardly close to a stranger while working. Tables can be hard to get on weekends but the traffic flow is quite fast.  I will definitely be checking out more Balzac's around the city!"}
{"text":"Truly excellent - I did not expect to have such great coffee in Toronto so randomly. Basically the St. Lawrence Market next door is oversupplied with raw meats and undersupplied with delicious beverages, so I ventured outside to grab a cup here.   The Balzac's Blend was so good I bought another cup at the Distillery location an hour later, and brought a pack of the raw beans back to the US. It is a lighter blend, perhaps a bit stronger than Starbucks' blond blend, and there is a really savory and smooth finish on the tongue with the taste of vanilla and nuts.   The environment inside is very Parisian with customized Balzac posters everywhere. A lot of young  and hip student-types are studying on their laptops or reading a book. It creates a nice setting to sit, people-watch, or catch up on a Kindle book.   Bottom line: we need this in the US. It's like a better Starbucks without the pretense of Gregory's or Blue Bottle. Drink up."}
{"text":"Busy on Saturday mornings as it's next to St Lawrence Market. Amazing brewed decaf. Friendly, fast and clean staff. London fog decaf or regular is okay.  Nice atmosphere during weekday mornings. Busy but not extreme. I have had a great time getting stuff done on my computer.   Second time they confuse my order for here with a take out or viceversa.  There's parking on the street in front of it."}
{"text":"Balzac's makes reliably good espresso drinks, including the breve latte I had recently. It was supercrowded at the hour some friends and I had an planned to meet, so we went around the corner to C'est What? Which was a bit disappointing. Had to go back and get my latte later. Which was worth the walk."}
{"text":"Located directly across the street from St. Lawrence Market this Balzacs has a very comfortable and old world feel to it.  It makes me feel like I took a time machine to the 40's or something.  Besides that they have a selection of glass covered treats and decent coffee selection.  The round tables didn't seem to move so there was no rearranging of the furniture but the spacing is comfortable and not cramped.  As with many cafes you see people doing some sort of work requiring electronics and such.  Along the baseboard of the wall where the bench seating is there are outlets and even USB chargers."}
{"text":"Small cozy cafe, pretty good coffee, friendly service, price is decent, hard to find unless walking, as seen on Dragons Den reminds me of cafes in Europe"}
{"text":"Great coffee and chai latte! The organic chai with whole milk was one of the best chais I have ever had. Nice vibe. Plenty of seating. Nice staff."}
{"text":"I have visited this location several times. And to my disappointment, each of my visit was unpleasant -  Unfriendly staff and poor service.  Coffee is average, but overpriced for its quality"}
{"text":"It is in an extremely popular tourist destination. Oh, just like any other Balzac location!   The layout of the counter is a bit counterintuitive. The cash is at the far end, and where you start. After you pay, you make your way to the far end where the coffee is served. As you make your way to that far end, you get to see all the baked goods! Not terribly helpful when there is a line up/busy and you can't fully decide what you want to eat.  I ordered the coffee and the cheddar and chive scone. The scone was very near the cash register!   Because I mentioned I was drinking my coffee inside, I got lucky and the cashier warmed up the scone and served it to my table! The coffee was good. The scone was delightful. I was lucky to find seating inside. Patio seating is another deal altogether - good luck there! Show up on a day the Market is closed!"}
{"text":"The place looks incredible. Definitely has a European vibe located on Market Street, with lots of sun on their patio. It's even got a good feel when I came here the other day in the pouring rain -- place was packed with happy people.  I just come here for coffee -- I'm really simple when it comes to these cafes. The drip is always good with lots of blends to choose from. I've always really liked Balzac's takeout cups as well -- good design.  Staff has always been nice and efficient with me. I've only been a handful of times, but I'm sure I'll frequent lots more this year -- hopefully with some friends so I can stick around and enjoy the views!"}
{"text":"This place has excellent coffee and I am very particular about my coffee. The staff is wonderful! So lucky to finally have a great coffee shop in my hood!"}
{"text":"We have been coming to this location almost every Sunday for 3+ years, and today was the worst service we have ever had. We ordered two cappuccinos, and the barista gave us lattes....WAY too much milk to be considered a cappuccino and flat out refused to make them correctly, trying to explain that the ratio changed because of the size of the cup. In order to help you, I have attached a recipe card that you may find helpful to train with."}
{"text":"Great coffee, cozy setting, great for watching the activity of the Market. Get some pastries to go with that excellent coffee"}
{"text":"This Great little coffee shop carries on the Balzacs tradition. Expect great coffee, fresh pastries and that interesting twist that makes it special. The patio is full of mid day sun, and the decor is very classy.  Cappuccino's and specialty drinks are expertly made. As for pastries, expect lots of variety... Croissants, Turkish delight, Cookies, Biscotti, they have it all.  Perfect for a weekend on the sunny patio."}
{"text":"I'm always happy with a coffee from Balzac's. It's not amazing, but it's dependable. Service is friendly and the baked goods are usually tasty. This past visit I got a decaf americano which I enjoyed. This location is small and cozy and would be a nice place to sit and read and relax."}
{"text":"In my previous review, I never got to order my item because the rude barista had a long conversation with a friend. I solved this issue today by ordering off of Ritual. (Ritual is an app that lets you preorder and pay for items on your phone, and skip any lines or rude servers.)  At $5.75 a latte, this place is more expensive than typical chains or even independent roasters. Hard to justify a $6 latte that, really, isnt anything special. At least Bulldog gives me a little tye dye in my $6 rainbow latte.   But i did enjoy their peanut crunch treat, at $3.5. Their cookies are $3.85 where other cafes would selll for $2.5 at most.   The price is likely due to their location on market street which has failing businesses due to high rent and low traffic (except saturdays).  For Balzac's, 3 stars out of 5. For Ritual, a perfect 5 stars!  Jimmy's Yelp Ratings Scale for Food: [*] Disappointing. Just...no.  [**] Not very good. Will not return.  [***] It is what it is. Go enough times and you'll break even on quality.  [****] My go-to place. Rarely disappoints.  [*****] Everything on menu is good. Every time."}
{"text":"If you're a Starbucks fan... Please spend your money here instead. Quality of the coffee is x10 better, and the flavors are so much more unique.  Bonus for any other mug enthusiasts out there.. I freaking love their mugs. I need to start visiting places just to buy their designated mugs!"}
{"text":"Great expreso. Cozy decor. Friendly, knowledgeable staff. Nice location on Market Street, right by St. Lawrence Market.  Coffee to stay served in nice clear glass tumblers."}
{"text":"Great coffee, beautiful setting, but meh service.  Robotic, zoned out, and not engaging.  If I wanted that, just make your coffee slightly cheaper and self-serve.  When I asked for a receipt, I was met with a blank stare.  Loved the huge condiments bar though.  It was nice that there was that large of a space to dress up my coffee!"}
{"text":"Decent coffee. But wouldn't say its anything special. The roasted almond latte was pretty good. Overall its somewhat underwhelming as the marketing and advertising is better than the product."}
{"text":"I've heard so much about Balzacs coffee. There's multiple locations in Toronto and as someone who is always on the lookout for a great new coffee place, I'm really glad I stopped by the Market st. location. I ordered a cappuccino (with almond milk) and a pumpkin muffin. Both were delicious. It came to 7$m which is a little on the expensive side but the quality of the coffee was obvious. This location is fairly large and conveniently located directly across from the St. Lawrence market. Lots of seating but with a cozy vibe. The barista and staff were also super lovely!"}
{"text":"This place has all of the airs of a good coffee place but the coffee is poorly prepared. Staff seemed uninterested in their jobs and the taste of the coffee showed it. Ordered a cappuccino and the milk was totally overheated and the dumped into the cup killing the taste of the crema."}
{"text":"I've had several Americano drinks that were not that great recently. And the WiFi is very iffy - non-existent if you sit outside. The Everyday Coffee Gourmet inside the St. Lawrence Market lower level is much tastier for the same price (when the market is open that is)."}
{"text":"I've been going to this coffee spot for a while now and their Parisian Mist is amazing (for those of you who aren't big coffee drinkers)   If I remember correctly, the Parisian Mist is steeped tea with steamed milk and vanilla syrup. It smells almost like Earl Grey Tea.   It gets really busy around lunch time during the work week. But if you go around 2, you'll  usually have the place to yourself.   I've had their \"Magic Bar\", but I'm going to stick with just their drinks. Their pastries don't really \"wow\" me...but that's just a personal preference.   Ps. They have a patio, so take advantage of it!"}
{"text":"Time seems to slow down here. I chose my seat and sipped on a mocha chocolate drink with one shot of espresso. This place is the epitome of what every coffee house longs to be. A warm respite from a cold day and place that offers a wonderful array of flavors. They have coffees for sale as well from their own roaster. My coffee tasted perfect and it was the most relaxing environment I've been in Toronto. Excellent for ambience, service and quality of drinks."}
{"text":"Hmmm a very lively patio where the sun bits just right.  This place swarms with older retired folks, quiet crowd :).  When walking in you notice the patterns on the floor and the wicker chairs which gives is a cute quaint old school meet European-esq vibe.  The inside is certainly bigger than what you expect and has plenty of seating.    There are lots of different pastries and various gluten free blondies.  Ordered a flat white and wow the beans are strong!  And the cup  was scorching hot!  Beans a bit burnt but still great tasting   Seems like a really cute spot, but I prefer the location in distillery where the atmosphere is a bit different and much more casual."}
{"text":"Great coffee cafe to hang with friends (but expect it to be quite packed esp. on weekends). I ordered mocha and it was delicious with great cacao flavour. My partner ordered coffee, he likes it so much that he bought some beans home as well."}
{"text":"Found it by accident. Nice little shop, very friendly. They have some pastries on the counter and coffee. Plays decent relaxing music. Perfect for the rainy day."}
{"text":"We were wandering around the St. Lawrence marketplace to look for some coffee and kept seeing these yellow cups. Finally, we asked someone and they said they got their coffee across the street. Across the street we go...  Being the tourists that we are, of course we had to try the maple latte. It was actually pretty good as it was frothy and lightly sweetened. It wasn't overly sugary or had a weird aftertaste. Seems like a good substitute for honey.   Overall, it was a great vibe even though it was crowded that morning, but the ambiance and decorations were fun, modern, and classic."}
{"text":"I almost don't want to write about Balzacs since too many people already frequent it (hence the 4 stars and not 5). I love sitting there on a Sunday afternoon to get through emails and prep for the week. It can be difficult to get a table as it's always so busy but the coffee is some of the best I've had in the city. I personally love a busy coffee shop atmosphere to get things done and Balzacs definitely has that. Also a great place to pick up a coffee if you are walking around at Lawrence market. Their cortado is one of my favourites."}
{"text":"Balzacs Coffee is a popular chain in Toronto and therefore not the best coffee you'll have in Toronto. This location is around the corner from Kensington Market and sells all types of coffee and pastries. I ordered a latte and it took a little longer than normal to make and was just okay. If you need caffeine, it gets the job done, but if you're looking for better coffee go to West Dundas to Cygnet Coffee."}
