{"text":"I read all these reviews describing great service, great food. So I called for delivery service and experienced some of the worst customer service, phone etiquette i have ever experienced in my life! Everything was going well until the end of the order.. My order was $24, i was told my delivery had to be a minimum $25 because im in harmarville. I obliged, even though she lied and told me it was twenty minutes away when really its 10-12min(sat night 8:30pm no traffic). Then she asked me my last name! You ever order delivery and have someone ask you for your last name? To top it off, throughout this whole ordeal im repeatedly put on hold. After she told me to hold one last time, i just hung up. Ridiculous service, ill never attempt to order, visit this place ever again!"}
{"text":"Everything we had was excellent, including spicy Tom Yum soup (I ordered 7 on a scale of 1 to 10, and it was quite spicy), Pork and Shrimp Dumplings, Dumpling Soup, and Chinese Meatballs (with scallions and ginger). I thought it was very reasonably priced, and the staff was very friendly and attentive."}
{"text":"Great place!  I haven't had a dish yet I didn't like.  Tom Yum level 2 for a good start.  Keep it up!"}
{"text":"Excellent food and excellent service. The spice level of the spicy chicken was spot on with what I requested. Definitely glad I went a little out of my way to go to this place!"}
{"text":"Omg what a find! Not gonna lie, was skeptical, but this place is legit! I would come back just for the Tom Yum soup! If you're in the area you gotta try this place! Blew my socks off! Everything was super fresh and made to order! Can't beat that! Nice mom and pop shop."}
{"text":"Hit or miss! Fantastic the first 5 or 6 times. Best dumplings around! But the last few visits the fried food tasted like cheep old fishy grease! And our last order had undercooked chicken. They made up for it and apologized but we will not be back any time soon:( \"I will miss those dumplings\""}
{"text":"Just found this place because they were able to deliver. Very happy that I did. Rose Mary is probably the friendliest person I have met. Best delivery EVER!!  She even recommended an appetizer which is now my new favorite. Food and service both excellent."}
{"text":"I never knew about this place until my daughter told me I HAD to try it. I had the broccoli chicken with white rice. The crab rangoon and sauce was the best I've ever had, and everything is made in house, and very fresh. I tried my boyfriends Tom yum soup, and it was delicious! They ask you what spice level you want from 1-10. I chose 7, and it was pretty spicy! But oh so delicious. Next time I will order a 5. The owners are super nice and friendly, and don't just treat you like a number. If you want the real deal, you should try this place! Bonus if you like it HOT! I can't wait to go back."}
{"text":"This place is amazing. I have traveled to many asian countries and this is as authentic as it gets this side of the ocean!  The place is also very reasonable price.  Do yourself a favor and go here now!  You won't be disappointed!!!!!"}
{"text":"Very generous portions. Shared an entree with my daughter, very good food and service."}
{"text":"This little gem needs to be found! All meals are prepared fresh and quickly. The Tom Yum soup is delicious and spiced to your liking. The hibachi prepared meals are great as well as the salt and pepper chicken. The owner and her hard working helpers, her two boys, work very hard and are always very pleasant."}
{"text":"We've eaten here twice in the last week. My husband was hungry for Chinese and looked for recommendations on Yelp. This place is off the beaten path but worth the trip. When we first pulled up we were a little leery since they didn't appear to have any customers. We had to wait outside for another person in our group so we observed that they only had two takeout customers in that 20 minutes. That is a shame because we'd like to see this restaurant increase their business and stick around.   The decor is is nice but it was a little cold both times. I should always remember to bring a sweater this time of year. The owner was very friendly and explained that they make everything fresh including the sauces. Those sauces are delicious and perfectly compliment the appetizers. The sauces were better than any we've had at other Asian restaurants we've visited. We couldn't decide on just one appetizer to order so we tried several each visit - Crispy Shrimp, Shumai, Scallion Pancakes, Crabmeat Rangoons and Steamed Dumplings. The rangoons could have used a little more crabmeat ...still delicious though and perfectly cooked. I would recommend each one of the appetizers and can't single one out as the best. For the main course I ordered the House Special Lo Mein and my husband had the Mongolian Beef after reading another review recommending it. We were not disappointed. My stepson had a Char-Grilled Teriyaki Beef. We all tasted each other's meals and decided the Mongolian Beef and Lo Mein were better than the Teriyaki Beef. My stepson commented though that he did like that the meat in the Char-Grill was tender and not grisly as you sometimes find in dishes with meat pieces. The food and appetizers were so good that we decided we should also order dessert. Last week we tried the fried ice cream/banana dessert. It was fantastic and more than enough for three of us. Tonight we ordered the Chinese donuts and decided to try the the Red Bean Pancakes after the owner described them to us. Again, we were not disappointed. We highly recommend this restaurant. My husband says this is the best Asian he's eaten, and I would agree."}
{"text":"Plenty of vegetarian or shrimp options. I got the sweet and sour soup (Tom Yum) with shrimp. It used large tomato and mushrooms and onion chunks. Delicious. My friend got the hibachi beef lunch special (served 7 days a week). The quality of the beef was excellent. Friendly atmosphere but not too fancy. You can get delivery and take out. It was worth the trip and we will be back"}
{"text":"Visiting from Virginia and we happened to find this place on Yelp. The food is excellent!  We had the Garlic shrimp,; General Tso chicken and Honey chicken.  Every dish was cooked fresh and was so good that we went back a 2nd night! Owner was super friendly and helpful with helping us choose dishes from the menu.  My son asked if she could open a restaurant in Virginia,  but we couldn't convince her (lol). Whenever we're in the Pittsburgh area again, we will definitely be back here! Thank you for the great food and great friendly customer service!"}
{"text":"Absolutely amazing! I've tried almost everything on the menu and have yet to find something I didn't like! The service is great and the food is perfect.  I recommend the dumplings, which are made by hand by the owners and servers; the Tom yum soup, a hot and sour soup that is truly authentic and so full of flavor; and the garlic shrimp, big juicy fresh shrimp tossed with sautéed onions and garlic with a very light white wine sauce. Those are some of my favorites. I haven't gone more than a week without eating here in probably 6 months!"}
{"text":"The rice was perfectly cooked and delicious!  The service was excellent!! Definitely would like to come back."}
{"text":"Ordered the hibachi beef and shrimp. Love it. First time getting food from Bamboo Republic, I'm already looking forward to the next time I do."}
{"text":"Asian food at it's best! I really enjoy ordering from this place, fast and friendly service to your door. The food can not be beat, and the portions are big. I would tell anyone to try this place out."}
{"text":"Spectacular service, delicious food, clean as a whistle -- what a gem in tiny Arnold! Well worth the trip if you are craving homemade Chinese food.   We particularly enjoyed the tom yum soup, chock full of fresh vegetables, white meat chicken (or shrimp) and sinus-clearing spice. The shumai dumplings were freshly made in-house and as good as any I have eaten in the San Gabriel Valley. Americanized Chinese staples like drunken noodles and sesame beef were fresh and bursting with flavor, clearly made with quality meat and vegetables.  The service is wonderful - a friendly, family owned place where the kids help out if they've finished their homework. Everyone is friendly and the food comes out quickly and hot. There is nothing bad I can say about Bamboo Republic - it's just a treat."}
{"text":"I have to seriously control myself when it comes to this place.. I crave their honey chicken and garlic chicken daily. They have the best Chinese food in all of western PA hands down! Don't be put off by the location. It's worth the trip!"}
{"text":"1st time eating here. My son & I drove from Delmont, PA. Craving real Asian food! I'd read their reviews. Saw smiling, welcoming faces of the owners on Facebook, off we went for Lunch. 19 miles later, we drove through streets with closed businesses. Do not let the quiet outdoor surroundings fool you. This is a great little restaurant, nice atmosphere. Love that they are wise enough not to have fake flowers in vases, no cheap decor. Cute little tables, that also would dress up at night!  The waitress and the owner were more than helpful. The owner guided us every step! I don't like too spicy, my son does. They will adjust the spice of your food to taste. The owner and I both said at the same time, \"We hate those little baby corns\" They are from a can, not fresh! Needless to say, I don't think you'll get baby corns here. Their food is cut and made fresh to order. You can tell because the kitchen size is huge.  So, we started with Shrimp Tom Yum soup. Loved it! Mushrooms, onion, shrimp, spices and the broth---had to stop myself from putting the bowl up to my mouth to slirp! Then we tried Shumai.---as Kristie F said here, best dumplings ever. Honestly, perfect! I actually think I've tried on buffets before, and never liked until Bamboos today!!  The owner then asked if we liked beef, chicken, Hibatchi style? How bout all of it! She wanted us to try her authentic Salt and Pepper Shrimp. It was wonderful! We also had Beef with Garlic Sauce.---Also, wonderful! The fried rice was so good and fresh!!! We were so full.  *Bonus* just enough leftovers, good prices! Also, as Kristie F said, no upset stomach, like other restaurants!!! We especially loved speaking to the owner about where we were from and just got to know her that fast!  Normally, we do takeout at places. This was such a special day! Definitely will be back!"}
{"text":"This is the greatest Chinese food you will ever taste. Forget about your average take out. This place is the best. We have visited numerous times and every time it's better.  I strongly recommend the crab Rangoon to start.  Follow this with the tangy chicken. It's not too spicy just a little bit of kick. They also have a hotter and more mild option. As far as dessert I would not know I'm to full by the end of the meal. Don't miss out go to bamboo republic today."}
{"text":"This place blows the doors off of any restaurants  of its kind around. The food is amazing. One of my favorite things about BBR THEY KNOW HOW TO MAKE IT HOT!!!  When I say that, they do not sacrifice flavor to make it hot. I truly love this place and the people that own it."}
{"text":"Great place!  The wife got a spicy chicken and me normal beef and onion dish.  Both were just perfect.  Would go again, and again and again. 5 out of 5 stars"}
{"text":"I highly recommend this place. I eat here at least threes per week. The Tom Yum soup is the best.Try the crispy shrimp with their special sauce. No premade foods. Mongolian beef is a must here. Enjoy"}
{"text":"This place is a hidden gem.  Loved, Loved LOVED this place.  Food is amazing and the owner is super nice.  I will be going back here again and again and AGAIN!!!"}
{"text":"Amazing!! The food is absolutely amazing! Best dumplings I've ever had! I haven't tried anything I haven't liked, and they will cook it to your liking!  And seriously, deep fried bananas?!  Also, unlike most Chinese take out places, it won't mess with your stomach as soon as you're done eating!!   Garlic shrimp is the best thing ever!!!!"}
{"text":"Absolutely delicious. Great couple who owns it, wonderful service. Get the Tom yum soup, fried dumplings, and crab rangoons. We also liked the general Tsos chicken (available with only white meat which is awesome) and the garlic shrimp. Finish it up with some fresh donuts!"}
{"text":"This Ransom Chinese stop was our best yet!    The food was so yummy and fresh. We asked for specialty items and they recommended the following:  crispy chicken, honey chicken, garlic shrimp, steamed dumplings and pork egg rolls. For a place that doesn't look like much from the outside, this place was a diamond in the rough!!  Highly recommend."}
{"text":"I live in DC and was up visiting my mom for the Thanksgiving holiday.  When she wanted to go out to Chinese, I wasn't expecting much.  I was happily surprised!  A++."}
{"text":"Absolutely fantastic! As someone who has grown up eating Asian food, the selection in the area is usually pretty disappointing. However, this restaurant cooks what is probably the most delicious food I've tried outside of the city. Even my grandmother from China approves of the food! The owner is always very cordial and makes us feel appreciated every time we visit. One of my favorite places to visit and an absolute must-try!"}
{"text":"This is a little gem in the New Ken/Arnold area! I been working in the area a few days a week for about 2 years now and this is the first time I've been here. I heard so many good things about this place.   I went for lunch with some co workers and the place was empty. They do have a lunch menu where you can get clear soup or ginger salad with your meal.   I got shrimp and broccoli (asked for extra spicy)  for like $7! While I thought the sauce was a little heavy they got the spice level prefect! The ginger salad I got with my meal I wasn't a fan of. It was extra watery and too sweet. I also got the Tom yum soup with chicken. It was my favorite thing. And probably some of the best Tom yum soup I've ever had!   I would go back and give it another shot for lunch. My coworkers got drunken noodles and some sort of shrimp with white sauce. Both looked delicious!!!"}
{"text":"All I can say is fantastic food and service.  Fresh dumpling appetizer was the bomb along with the Hibachi, Chicken, Beef, Shrimp combo. Personable owner that was kind and attentive!  Highly recommend!"}
{"text":"Absolutely delicious food. The tom yum soup is without a doubt the best we've had in a 50 mile radius. We also had the garlic shrimp and sesame chicken, which were both wonderful. Everything is obviously made from fresh ingredients; even the fried food tasted fresh and clean. The decor is simple but stylish and the entire restaurant is spotlessly clean. The staff is friendly and the prices are more than reasonable. Even if it's a bit of a drive, it is well worth the travel time. Definitely give it a try."}
{"text":"The food was great! The tangy chicken was sweet and spicy, the beef with udon was cooked perfectly. The spring rolls were top notch as well. Delivery was fast and courteous, will order again!"}
{"text":"My favorite Asian restaurant around! The food is delicious, authentic and expertly prepared. And you can't get service like this anywhere else. It's hard to choose a favorite, but you have to try the Tom Yum soup, the Crab Rangoon's and the Drunken Noodles. And I love that they offer delivery too. If you haven't checked them out yet, you are definitely missing out. BYOB, so remember to bring your favorite bottle of wine to enjoy."}
{"text":"While traveling for the holidays we stopped into this restaurant after reading reviews on Yelp - great idea! Not typical to the area I assume, this restaurant was quiet but seemed busy with take-out and delivery orders. We tried most of the appetizers, hibachi and the Shrimp Tom Yum soup - all were very tasty. The staff were incredibly friendly and out-going - a family operation that seems to take pride in their work. Next time we are in the area, we will be back!"}
{"text":"I cannot wait to go back! First trip today included excellent tom yum soup and hibachi. Even the iced tea is delicious! Nice atmosphere too."}
{"text":"Excellent food and service.  Dumplings are as good as the ones I had in China.  Food is fresh and expertly prepared.  The prices are really affordable.  Some of the best Asian food I've had in the States."}
{"text":"Best Tom Yum soup I've ever had. I make sure to stop for a bowl anytime I'm in town! One of the family's favorites."}
{"text":"The greatest quality take-out Chinese I have ever had! Menu is fantastic, food quality is unprecedented, and the service is always top-notch.    The kid that works the phone is great!"}
{"text":"Just ordered delivery.   They had the food tp me quickly (35 minutes)  I ordered the salt and pepper shrimp,  scallion pancake,  and Tom yum with chicken.   The food was all spectacular.   The shrimp was a really good portion (always a concern with shrimp).  10 pieces of good size shrimp and they were delicious.   The scallion pancake was crisp and chewy,  and not too doughy,  with a real tasty dipping sauce.   The soup was outstanding as well.   I'm only the area for a few days but I'll definitely be ordering again!  Highly recommended."}
