{"text":"This is probably one of my least favorite Thai restaurants in Cleveland. I come here because a close friend enjoys the food.   To me, the food is just too salty. Nothing special for me to pay $10-15 a dish. I can go to Chinatown and get a meal for half the price and better quality.   I was disappointed with the shrimp coconut soup. Where was the coconut flavor? More salt then anything. I think there was 2-3 pieces of shrimp and they were medium sized.   The chive pancakes were more like patties and dry and as I recall, prob could have been cooked longer in the center. Definitely too much oil. The steamed shumai was good, but nothing out of the norm.   I have tried an array of the noodle and rice dishes family style. Presentation is always nice. You have an option of white or brown rice. Unfortunately most of the dishes used similar ingredients and did not have any distinct flavors to stand out from one another. Either spicy or salty or a combination of both.   We did try an interesting dessert. Banana chocolate spring rolls. It was different and tasty. The Thai ice tea was ok.   I would probably not come back if it was my decision, but if my friends enjoy it, I would make an exception."}
{"text":"I was looking to try out someplace new for a Saturday night dinner and Banana Blossom was excellent. The menu has a vegetarian section and you have the ability to substitute tofu into any dish. Food was delicious and quite spicy - which is what I want from a Thai restaurant. Dishes were also garnished with carrots folded into butterflies which always makes me happy. The service was very attentive even on a busy Saturday night. I liked the bright decor and cozy size. Be sure and get reservations as the dining room is small. I'll be returning for sure."}
{"text":"A wonderful surprise. Thai food is one of my favorites and these guys definitely stand out. Best in town hands down."}
{"text":"Banana Blossom is a solid option for fresh Thai food. While I don't have any major complaints, I found the food to be good, but nothing super special. As other reviewers have mentioned, the prices are a bit on the high side compared to other local Thai places.    The ambiance felt a little cold to me. There are a few pieces of themed art, but otherwise the restaurant is dark and plain."}
{"text":"Absolutely wonderful.  Ordered take out on a whim, and loved it so much that we have dined in a few times now.  Practically all the dishes on the menu can be prepared vegetarian and they are delicious.  Service is attentive and helpful.  Drinks are cheap.  May be better than our favorite Tremont Thai restaurant. Beware of the spiciness levels; I love hot food, but their spicy is crazy!    Really love the vegetarian Pad See Iw!"}
{"text":"The service is TOP NOTCH! the atmosphere is cozy, the food.... FRESH, flavorful and lots of layers of flavor!  We've traveled all over the globe and we give Banana Blossom two thumbs up!"}
{"text":"Got my hopes up so high from the reviews and they don't delivery. They said the Yelp isn't updated. Boo."}
{"text":"Amazing! My husband and I went here last night for dinner. We are not very experienced when it comes to Thai food, but luckily, our waitress was very helpful. She gave us her recommendations depending on our spice level tolerance. We ordered the Blossom Platter for an appetizer. The spring rolls and beef/chicken satay were delicious! When we go back, we will probably just order the satay as an appetizer, we could have eaten plates of it. The meat was so tender and the marinade had the right amount of flavor and seasonings.   For dinner, we ordered the Panang Curry with chicken and the Chicken Ginger (Rice Dish). It was our first time trying a curry dish and it did not disappoint. The spice level was considered \"medium\", which was perfect for us (we tend to put Sriracha sauce on everything). For the chicken ginger dish, that was also very good. The sauce was light but very flavorful. The vegetables and chicken were seasoned perfectly. We would definitely order a curry dish again, but we would probably try another chicken dish rather than order the ginger chicken again.   Do not let the area or outside of the building fool you. This place is a hidden gem! There was a constant stream of people coming in and out during our dinner. By the time we left at 8PM, all the tables were full! The kitchen kept putting out food in a timely manner. We took a take-out menu on our way out. We are definitely planning on going back again VERY SOON!"}
{"text":"I am not a Thai connoisseur, but I've had a decent share of Thai expereinces in Cleveland, Boston, DC.  I ordered 1) Basil Fried Rice with ground chicken, 2) hot beef with vegetables, 3) spring rolls, 4)fried pot stickers, and 5) assorted desserts.   1) Non-spicy.  Rice was a bit too textured and stiff, possibly over-fried (which some people like),   I didn't think the rice hardness and the ground chicken (which was also a bit on the tough side as lean round chicken is apt to do ) made for a good combination.  Perhaps a softer rice would have provided a cushier/more pleasing bedding for the flavors and meat.  - As far as basil fried rice goes - def had better.  3 STARS  2) Hot beef - terrible.  Price to Portion ratio absolutely absurd.  We received 8.5 (I counted) pieces of small 1 X.5 inch beef strips, and a random assortment of your usual mixed vegetables.  Nothing exotic.  Just your squashes, brocollis, snow peas, etc.  This dish was recommended to us by the waiter over the Beef pepper satay... \" a mix of sweet and sour from the pineapples with a spicy kick from the siracha\".  I was of course expecting a  flavor roller-coaster.  But instead I got pineapple sweet/ - no spice - no Siracha that I could taste - bunch of vegetables and a few strips of beef tossed in at the end of the meal for good measure...  - 2 STARS.    3) Spring rolls - 3 Stars if you like em sweet.  2 stars if you prefer a bit more sodium. 4) Fried pot - sticker - 3.5 Stars -  5) Desserts - Mango with sticky rice / Banana Chocolate Spring Rolls - standard fare.    I don't see myself  or the wife coming to this place again.  Places I would choose before revisiting.  Ty Fun, High Thai'd....  Note:  I ordered this to go and the majority of folks dining in did seem to be digging in to their noodle-based dishes so perhaps I ordered the wrong dishes, but still 8.5 pieces of beef for $13 bucks... I get a better deal and more flavor at the chop joint in the food court.  I SAID IT!"}
{"text":"I ate here on Friday June 12 with some friends who were all vegan. Everyone seemed to truly enjoy their food. Our group had planned to eat somewhere else, but when we got there, the restaurant did not have any electricity. It was really nice of the owner to accommodate us at the last minute, especially since this was a Friday night. A few in our group had been here before and recommended this place as they will insure all dishes are vegan friendly. The interior of the restaurant was very modern and clean, with a quiet and relaxing atmosphere  I had the Tofu and Veggie Pad Thai which was very was great. I also had the Spring Rolls which were exceptional. The waiter was very knowledgeable of what was in each dish and suggested that I exclude the eggs since it would not have been vegan friendly. The server was friendly and attentive but I did have to ask for a drink refill. I plan to return again for one of their curry dishes which some at the table were very complimentary of, especially since I love curry dishes."}
{"text":"An Ohio City jewel! As you approach, it's a stuccoed, street-corner building. You step inside to an intimate setting of rich warm color and elegant simplicity. The food follows suit--fresh ingredients, delicious menu items, and lovely presentation. The kitchen is perfectly willing to adjust heat levels if you're worried an interesting menu item might be too spicy for your taste. Add excellent, friendly service, great pricing--we all loved it!"}
{"text":"The food was delicious! We found this place on Yelp and we're so glad we did. I haven't had Thai food this good in a long time. I would highly recommend this wonderful little place."}
{"text":"Best pad Thai in cleveland, my boyfriend and I get takeout from here at least once a week. Their crab Rangoon is also amazing. If you are in the area you must try it!!"}
{"text":"I love this place! I live two blocks away, and it's my go-to takeout place. The people who own it are really nice, and the food is always delicious and ready in 15-20 min."}
{"text":"Amazing Thai food here! Family owned style business with a very cosy atmosphere. They do have a good selection of liquor in the restaurant too. If you feel adventurous, try the Tamarind crispy duck with rice, It's a flavor party in the mouth."}
{"text":"Waiting with my wife for a follow-up doctor's appointment at Lutheran Hospital, searching for nearby eats and am SO GLAD I found Banana Blossom. Had a green Curry and Spicy Pad Thai - Excellent!! Great service in a clean place with wonderful ambiance. Will definitely come back. Don't miss if you are in the area at the hospital or shopping at West Side Market! Fantastic Thai food!!"}
{"text":"The employees were very nice. I had the Chechen satay, wonton soup and the Thai basil chicken. The food was delicious."}
{"text":"Hole in the wall place; don't let the empty dining room fool you! The food is delicious and at great prices I'm coming back! Very accommodating to vegetarians and supper nice staff."}
{"text":"If I didn't know what I was looking for, I would've walked right past Banana Blossom. Once you get inside though, it is totally worth the search. We came for lunch around 12ish on a Thursday. We were warmly greeted and immediately sat. The restaurant was not super busy but did start to fill up with a few more tables around 12:45-1:00.  I had the pad thai. It was a generous portion for $9 and was super tasty. Waitstaff was prompt and consistently filled up our water glasses.  It is truly a hidden treasure in Ohio City!"}
{"text":"THIRD EYE OPENED  This is the best Thai in Cleveland. I got the Red Curry w/ chicken (spice level 4/5) and my gf got the Mango Fried Rice.   The spice level of 4 hit me hard, but I'm such a big and strong man that I could handle it. If you like really spicy, they do a great job getting it painfully spicy without compromising the flavor. The presentation was beautiful - the colors were so vibrant and the rice was shaped into a lil mound so perfectly. Such a deep and layered flavor - every bite and every ingredient would give me something new.   I tried quite a bit of the Mango Fried Rice. It's a fried curry rice with shrimp and mangoes, etc. and BOY DID IT SMACK. Such a beautiful balance of curry and tropical fruit and seafood - it's like nothing I've ever tasted.   It can look a little dingy from the outside, but the inside is very clean and well decorated. There's really only one guy serving because it's a pretty small place, but he's a very polite and happy guy.   Come for a life changing meal."}
{"text":"I love this place and I'm super picky about good Thai food! Their papaya salad alone is like...the best thing on the menu!!! So much flavor in just one bite. The food is cooked and seasoned well and the service is decent.   I just wish their Thai was spicier... :( The low spice level is something I've also noticed with all the other Thai restaurants in Cleveland."}
{"text":"I've had Banana Blossom Thai on my radar for a few months and finally made it here for lunch today with a co-worker.  It was a slow day in the office, so we made the drive over from our office in the 9-12 District to this quiet little corner of Ohio City, where we found ample street parking.  Arriving a little after 11:00AM, we were warmly greeted and had an opportunity to speak with several of the staff members.  My co-worker and I are spice fanatics and we discussed how the spice ratings of Banana Blossom are compared to other Cleveland Thai restaurants - Banana Blossom uses a 'dry' spice and increases the heat rating by adding 'pinches' of spice.    We started with Fried Tofu and Ohitashi appetizers.  Both were perfectly prepared and very tasty.  My co-worker suggested the Ohitashi, which is a seasoned spinach with sesame seeds - very reminiscent of a Japanese seaweed salad that you'd find at a Sushi place.  The Ohitashi was extremely tasty - I can't wait to get another bowl of this stuff!  I also had a cup of Thai Iced Tea, and Banana Blossom's version was up there with the best.  For our entrees, I got the Red Thai Curry with Tofu [spice level 3 - Thai hot] and my co-worker got the Tofu & veggie Pad Thai [spice level 6 - off menu].  I've had Red Thai Curry at just about every Thai place on the West side and near East side of Cleveland and Banana Blossom is my new favorite!  The tofu was cooked perfectly, a nice selection of veggies and perfect spiced red curry!  My co-worker loved his Tofu & Veggie Pad Thai, but even at spice level 6, it was not hot enough for him...  After finishing our meals we chatted with our server a bit more and he gave us some tips on how to order our dishes even spicier next time.  The server explained how their spice level 3 [Thai Hot] is way too hot for some people and they can't eat it after ordering.  I found it just right with my Red Thai Curry.  Now that that staff knows us, ordering spicier will be easier next time.  I'm looking forward to returning next month and trying some alternate dishes!"}
{"text":"Went here for the first time tonight an a date night with my wife. Thai is always a good vegetarian option and this did not disappoint. Appetizers were excellent - spring rolls and summer rolls, veggie style followed by spicy string beans for me and veggie masaman curry for Chrissy.  Both entrées were very good though the string beans were unexpectedly quite spicy- hot. Our only disappointment was they did not have any hot Thai tea, only iced. All in all it was a very place for a very nice date experience. Www.spousedates.com"}
{"text":"The place is in an unusual place in Cleveland, but well worth the detour.  Loved the ability to customize my curry, it was so delicious!"}
{"text":"I went to Banana Blossom for the first time with a friend the other weekend.  We got there at 7:00 p.m. and the place seemed dead, bit then was packed by 8:00 p.m.  The food was good - both of us really liked our dishes and the portions were huge.  Dinner dishes ran from $9-$15 depending, pretty much on our par with other thai restaurants in the area.  Overall, a good experience, but I have two complaints.  One, the bar's choices are a little skimpy.  One red, one white, and no draft beer.  The second is it took the server a really long time to bring us our checks."}
{"text":"Their food is absolutely delicious. I just recently moved downtown a few months ago and this has become my go to place on take out nights. I consistently order the Pad Thai. The flavor is great. I have also had their crab rangoons, delicious! The service is top notch. I also appreciate the fact that is very clean inside. I would recommend this place to everyone!"}
{"text":"I loved their pad kee Mao and mango curry tofu. I was a big fan of every dish i've had since I started going to this place. My friends weren't fans of the Thai basil chicken."}
{"text":"I always love this place but today I tried the Ginger Chicken and it was amazing!  Their green curry is always very good as well.  The only down side is that service can be pretty slow, which is why I didn't give it five stars."}
{"text":"I've eaten in at Banana Blossom one time and ordered take-out several more. Everything I've ordered has been consistently good: spicy Pad Thai, Thai Style Basil (a chicken dish), and Coriander Beef come to my mind as favorites. The menu is very extensive, so I'm sure there must be some sub-par offerings, but I haven't come across them yet.   It doesn't look like much on the outside, but it has pleasant decor and is very clean on the inside.  It IS off the beaten path in Ohio City, so make sure you use a GPS or have printed directions. I live nearby, so I happened to come across it shortly after it opened, but you aren't likely to drive past it if simply visiting Ohio City.   It is fine for small groups, but I think a group of 8 or more might be a challenge due to the small size."}
{"text":"Best Thai food in the area.  The food is always prepared perfectly.  My only gripe is that the spice ratings are inconsistent.  I go here fairly regularly and sometimes a level 1 will be quite spicy and very adequate, sometimes it will be barely anything at all, so beware.  Outside of this very minor gripe, the place is fantastic.  If you like Thai food, skip Ty Fun and come here."}
{"text":"This week I had the best and most authentic Thai food that I have ever eaten!  The chef even came out to assist my companion and I in determining the items that we might want to consider ordering. He then came out again to see is we were enjoying our selection. Quiet and relaxing atmosphere in which to enjoy a meal."}
{"text":"This place is my secret little spot that no one else has discovered yet.  The food is always delicious and comes out very timely.  The spice level is always right and I like.  I had the Spicy Pad Thai on my last visit, made a few substitutions and the kitchen had no problem accommodating.  I like it and would recommend it as a lunch spot.  The prices are about the same as other Thai restaurants."}
{"text":"Second time giving banana blossom a chance and I regret it fully. Ordered the chicken pad Thai and arguably smells worst than dog food, if not equally unappealing. Not even worth stopping for the full two seconds at the stop sign out front"}
{"text":"I came here on a Friday night. It was a little difficult to find, as I passed it up once. They have street parking, and depending on the day/time other parking lots might be available to you. We had pot stickers as an appetizer and both of us tried different curries. The mango curry was delicious! I loved the flavors. Also I had the Thai iced tea which tasted good! I would recommend this restaurant!"}
{"text":"We came in for dinner based on the yelp (and shhhhh! urbanspoon) reviews and I kind of wish we went some place else.  The food was good. Nothing too memorable but everything tasted ok. One thing is that we chose brown rice to go with our yellow curry..... And when they brought it out it had a peculiar smell. tasted ok.... But had a smell.  When I got home I realized that the smell happens whenever I try to reheat old rice that I had in the fridge for days!!! I didn't wake up with a stomach ache so I guess that's ok.   There was one server and when they werent helping tables they were sitting behind the bar on their phone....I don't know.... I don't like seeing servers on their phones.... Is that just me??  -1 rice and decent/on the verge of tasting like it came from the mall food -1 server on the phone"}
{"text":"Once I found out a Thai restaurant was opening in my neighborhood, I was an immediate fan. I love to see new ethnic restaurants open in our little neighborhood.   I have been to Banana Blossom many many times and have had a great experience every single time. The best in Cleveland...Okay okay, it's the only Thai I have had in Cleveland, but having lived in NYC for many years, I have had my share of great Thai food. While Banana may not be the best, it is pretty comparable to some of the best out there. The service is friendly and prompt and the food is consistently good.   Of the many dishes I have tried, my favorites are Spicy Pad Thai and the Chicken Prik Khing. The pad thai could be a bit spicier, but it's still good, it has a mix of chicken, shrimp and fried tofu. You get a huge serving that could easily be split into two or three with sides. The Chicken Prik Khing is so good and the peanut sauce, yummm!  I have also tried many of the apps and I think my favorite is the pot stickers (steamed). Nothing special about them, they're pretty standard, but dipped in the ginger soy sauce make them extra tasty!  This is a great place with great service. The food is consistently good for both eat in and take out.  It also heats up very well the next day (we always have left overs). Prices may be a tad high, but like I said, you do get a lot of food for the price. I will continue to frequent this place and recommend to everyone!"}
{"text":"I go here at least once a week, and never have a bad meal. You can essentially order anything off the menu and everything tastes amazing. They have great hours, with a large menu with something for everyone. Best Thai food in cleveland hands down."}
{"text":"I placed an order from here last night from Deliver Me Food. I wasn't really too adventurous, going for my usual pad thai. I did, however, add to that an order of edamame as well as some chive pancakes.  Good news:  Edamame - par for the course. Pad Thai - very good, even verging on great. The chicken was the standout. It was \"dry\" pad thai, which I like a lot.  Bad news:  Chive pancakes. HORRIBLE! The only \"flavor\" was \"fried.\" It was stuffed with chives, to the point of being nauseating (as opposed to the scallion pancakes at certain Chinese restaurants that sprinkle a healthy handful within the cakes - but don't have them hanging out there all overcooked and soggy in the middle. The chives actually tasted more like spinach - yuck! Even with the dipping sauce, they were inedible. I tossed them.  So, will I order again? Not sure. I don't have Thai too often. The pricing was significantly better than at Ty Fun, but the quality was nowhere near as good."}
{"text":"This place is amazing. best thai i've had and i've had thai from san fran, nyc, dc, slc, chicago, miami, and this place destroys them all. it is like an orgasm in your mouth every time. the service is amazing too. it's expensive but well worth the money."}
{"text":"This place is so cute and clean, on top of the food being so good! They have a huge menu with specials but decided on edamame to start with Green Curry & Hot Beef dishes. Portions are large even for lunch and the presentation is very nice! Both dishes had great flavor and the service was top notch. Will definitely be back!"}
{"text":"I get takeout from Banana Blossom about once a month. The Pad Thai is on point, but if I want to treat myself I go for the Duck Tamarind. . . It's life changing. The spring rolls are a great appetizer - the crab rangoon is good too, but almost everyone agrees the spring rolls are better!   I strongly recommend this place. Never had a bad meal. All of my friends love it too."}
{"text":"Late night Thai food run after a comedy show in the Flats.  My wife and I shared a number of dishes that were all tasty and filling, here is the rundown:  Started with a Spring Roll appetizer.  We went all-veggie which was a good choice. Extremely crispy on the outside and served piping hot from the fryer.  The dipping sauce was sweet (out front) and spicy (on the backside)...great accompaniment.  Our next appetizer is out go-to Thai favorite, chicken satay.  Their version had a mild curry taste and served with the traditional peanut sauce and sweet/spicy sauce.  The chicken was cooked just right and their sauces were spot on as well (with chunks of peanut in the sauce).  Our dinner plate was massaman chicken curry.  Their version was a bit more on the sweet side (than I prefer), but it was creamy and served with a good selection of vegetables and brown rice.  Lovely meal and a great choice for Thai in the Cleveland area."}
{"text":"I had a friend visiting me and she wanted to eat Thai, pad Thai in particular. I looked up a good Thai place and this one was the first one on the list. There is street parking easy to find in the neighborhood.   The ambiance is very good. Actually I liked it very much. Light was enough. They were playing some nice Thai music. Waiter was very nice and courteous to us. The restrooms are clean.   I ordered Thai iced tea, which was a disaster because I dint like milk or sugar in my iced tea and I forgot to mention it. It was very sweet with a good amount of milk in it. The spring rolls were small but very tasty. It is served with a nice sauce.   For main course, I ordered yellow curry with Tofu and brown rice. The quality and taste of brown rice is amazing, it is unique to this place and worth trying out. Curry was very good. My friend liked her Pad Thai too.   It is one of the very nice Thai restaurants in Cleveland."}
{"text":"Sometimes we come here exclusively for the crab Rangoons so if that interests you, it's worth it for the rangoons. The spicy pad Thai is always very good and the chili duck is incredible if you like duck."}
{"text":"Horrible and expensive. The pot stickers are clearly commercially produced and frozen, they have absolutely no flavor. The duck basil was so spicy that you couldn't even taste the duck meat.  The tender beef was good, sadly there was 95% vegetables and no meat.   I am completely lost as to why this restaurant has a 4 star average"}
{"text":"I can't believe I waited THIS long to come to Banana Blossom! Located basically right after exiting highway 2 onto W.28th, this unassuming Thai restaurant serves up typical Thai fare, but with out-of-this-world quality. I went with a group, and food came out in a timely manner with friendly service.  I ordered the Thai hot version of their vegetarian pad thai. It was flavorful, and had a little more 'sauce' than the typical pad thais I've had around the area. This really allowed the noodles to absorb the immense flavors in the dish. The tofu was of perfect consistency - fried but not oily. It too absorbed the peanuty, spicy, and tangy flavors of the dish. This was washed down with an excellent Thai iced tea.   Fair warning, they don't mess around with spice; if you want it spicy, be prepared for Thai hot. If you don't know what that is, you're probably not ready =P I'll definitely be back!"}
{"text":"I'm in love with Banana Blossom.  Let me shout it from the mountain tops.  Banana Blossom produces quality food, fast and reasonably priced. I've ordered take-out a few times now and have no complaints - their pad thai is delicious. Also of note, their garden spring rolls are drool-worthy.  Last week I had the spicy string bean dish and oh.my.gosh. was that good.  Spicy peanut sauce with snap peas, string beans, cashews and tofu?  Sign me up!   Heads up - they can certainly kick up the spice if that's what you're looking for.  I have found that they will give me \"white girl spicy\" when I order in, but what I call, I tend to get the real 5/5 level.    Banana Blossom is my official stand-by Thai place. I recommend you make it yours, too - you won't be disappointed."}
{"text":"Always great-tasting food but on this last round of carryout we received a very small portion of ginger chicken relative to the portion size of the pad kee Mao.  Next time I will check my order before I leave."}
{"text":"This is my favorite place for Thai food in Cleveland. It's an authentic Thai restaurant tucked away in a cozy side street, away from the hustle and bustle of Ohio City's main street of restaurants and breweries. I have tried almost everything on their menu, and I highly recommend the Pad Thai dish if you fancy the classic noodles, the Pad See Ew dish if you crave thicker and wider noodles with a more soy saucy taste, and also the Curry dishes if you want to add some spice into your life. Service is friendly and accommodating. If you haven't been here before, they tend to recommend you start off your spicy level at 1 out of 5. I think 3/5 is the maximum I'm able to handle. As a tip, ask for extra spice on the side. They take reservations over the phone, which is helpful for busy dinner times if you have a large party and don't want to wait. They also do carry out and close at relatively late hours which is awesome! Free street parking is located along the side road of the restaurant, which is convenient. Overall, Banana Blossom is a great place for a dinner date, a family meal outing, or a satisfying foodie experience with a group of friends in an intimate setting. Highly recommend!"}
{"text":"Best Thai in many years. Very fresh, big menu of classic dishes and more. Attention to details, high quality and fair prices. Excellent service, gluten free no problem. Will be back"}
{"text":"Updated review: Got takeout for dinner- had the red curry with beef & tofu. It wasn't a very large portion- they charged me $14.95 for the beef red curry plus $2 for extra tofu. I also asked for extra rice which was $1.50 which I thought was a little much. Overall the curry was tasty & spicy. Lots of veggies & not much meat or tofu"}
{"text":"Everything I've had here has been great and the service for take-out is usually pretty quick. The Panang curry chicken is extra delicious and I appreciate the extra care taken to separate the rice from the curry so it doesn't get soggy; I can't say all Thai restaurants do that. My husband claims the pad thai is the best he's had in Cleveland.   I just wish they would deliver."}
{"text":"This place is a great Thai food.  If you want spicy food, this place is a must go to.  Their scale is 1 to 4...2 is what most people get.  I made the mistake in getting a 4 the first time there, and it turned out that my girlfriend and I were drinking more water than eating food while smearing ice cubes on our lips.  Now that I may have scared you, I'll let you know that this place doesn't get too busy.  So it's pretty easy to get a table.  Service was decent.  The food itself and options were good and plentiful.  Overall I see myself coming here when I'm in the mood for spicy food."}
{"text":"An already known \"A lister\" Thai restaurant in Cleveland! This place is off the beaten path on the outskirts of Ohio City but it is amazing! Spice lovers- this cook knows how to bring the heat. The restaurant is small and very nicely decorated with authentic Thai decor and art pieces. The flavor, presentation and vibrancy of color and veggies is so enjoyable. The staff is so kind and thoughtful. I was given a free appetizer with my to go meals as there was a wait more than was promised!! Hand down if your looking for something different and a burst of flavor in Ohio City this is the place. I'm a big fan."}
{"text":"I was in the mood for some thai food, and found this on yelp, decided to try it out.  We ordered the Larb and spring rolls for appetizers.  Larb was way too spicy and almost couldn't even eat it because it was so spicy.  Spring rolls were fried, small bite size, there was nothing special to them and I didn't think it was that great.  Our table we ordered the pineapple fried rice, spicy beef dish, fried duck and tofu panang curry.  Pineapple Fried Rice was decent, Spicy beef Dish was good, Fried Duck was decent and panang curry wasn't good.  My curry was not that flavorful, my vegetables were slightly uncooked, I bit into an eggplant that wasn't fully cooked and that made me lose my appetitize.  I dont think I will be back, and will try to find better thai somewhere else.  I heart Sweet Mango in Strongsville is suppose to be good, and the only reason I didn't try it was bc I didn't feel like driving all the way out there.  I did like my Thai Ice tea there..."}
{"text":"Back to Banana Blossom in a group of four, back for the food and pleasant service and not disappointed.  Arrived about 7:30 on a Friday evening and was pleased that the restaurant had more of a crowd, hoping they'll continue to thrive a bit off the main drag here in the Ohio City area. Chive pancakes, pot stickers and calamari appetizers shared and enjoyed.  For entrees our group had hot crispy fried duck, pad Thai, papaya salad, and beef pepper satay, delicious!   Service was fine, all food brought out in a timely fashion, very personable server, no problems. Another fine dinner at BBTC!"}
{"text":"This is your standard, average Thai food. We ordered the garden rolls, tom ka gai, the panang vegetable curry, and the Pad Kee Mao. The garden rolls were tiny -- you get three super-skinny rolls (halved) for $6.50. A big ripoff compared to the much plumper and flavorful rolls at Superior Pho. The Pad Kee Mao was lathered in a too-sugary, too-spicy artificial-tasting sauce. The tom ka gai was forgettable. Our server was in a daze and when she finally brought the check over, no pen was included. The overall ambiance of the restaurant is nice. But there's just nothing outstanding about the food -- and it's not cheap, either."}
{"text":"I enjoyed the spicey pad Thai, crispy spring rolls, and iced coffee. The service was friendly (a bit slow though), the place was clean, and the prices seemed fair. Looking forward to returning."}
{"text":"I have been here numerous times, usually for lunch but this time it was for dinner. And it was amazing as always. Yes it is somewhat hidden but it is truly a hidden gem. Service is always amazing and the food is the same...AMAZING! This is the type of place you go to if you crave good Thai food, and if you want it customized if you have allergies, or picky eaters!   If you want great Thai food, this is the place for you! The Pad Thai, and the Masaman Curry are my picks! Thank you for your hospitality Banana Blossom!"}
{"text":"Cleveland's history with Thai restaurants is a little muddied.  It's had many decent (if not exceptional) Thai restaurants, but something about the intersection of \"Cleveland\" and \"Thai\" equals, bafflingly, \"Open at non-euclidean hours.\"  Time after time I've been told that a local Thai restaurant is good, only to discover that they're only open on Tuesdays at one o'clock after a full moon.    And so, not surprisingly, the life span of a Thai restaurant in Cleveland tends to be brief.  The hole-in-the-wall becomes a Thai-in-the-wall, and then a hole-in-the-wall again.  Alas.    So it is with great hopes that I announce that Banana Blossom seems to have sane hours, and a really nice locale.  It's not beautiful, but very stark and unobtrusive, and the food is good.    We started with the appetizer sampler platter, and got a very nice mixed bag.  The spring rolls were a little mushy on the vegetables and the sauce lacked some brightness  - but the satay was brilliant, and the peanut sauce was so good I actually ate spoonfuls of it.  The shrimp was quite nice.    The true test of any Thai house, however, is the curry - my wife had the red curry, which was very complex and flavorful, with a bright dash of red pepper splashed across it.  The masaman curry wasn't quite as complex - it was almost monotone in its peanutinness - but for a simple dish it was also damned tasty, and I finished it off without any leftovers.  Considering their portions are quite generous for the pricing, that's pretty damned awesome.    Banana Blossom's my go-to example for \"When star-based rating systems break down.\"  For Banana Blossom's right on the bubble between 4 and 5 - it's like a 4.44.  It's quite good.  It could be great, given another night or two.  So I hate giving it four stars, but five stars was just a tad too much.  Still, the average is about 4.5 stars overall, and that's about right.    Plus, they're open when you get there.  in Cleveland, for Thai, that's a Herculean effort."}
{"text":"After seeing some rave reviews for this place, I decided to check it out.  I'd have to say that I was a little disappointed... not at the quality of the restaurant, but by the lack of people in the place on a Friday night.  Judging by how good the food and the service was, more people should be going here (I blame it on it's relative isolation).  I was torn between all of the options on the menu... and I'm only talking about the duck options.  They all sounded good, so I asked the server for his recommendation and I tried the \"hot spicy crispy duck\" and I was pretty happy with my choice, although it could have been a bit spicier.  We saw the \"banana chocolate spring rolls\" on the menu, so we made sure to save some room.  They were delicious."}
{"text":"Had a craving for Thai while in Cleveland and found this Gem! The food is pretty good and the pricing is not too shabby. Definitely, a place to check out if you're in the area. I am not from the area but was pleasantly surprised."}
{"text":"Some of the best pad thai I have ever had. I've both sat-in and ordered out here. Definitely some of the best thai in Cleveland all-around!  When we dined in, we had the fried tofu and the spring roll appetizers. They were perfectly portioned for two people, and cut into managable pieces. Sometimes tofu and spring rolls come in huge pieces, and it gets so annoying to eat. We decided to split the pad thai for dinner. We requested it medium spicy. At most places, medium is actually pretty mild, so we didn't worry. My mouth begged to differ here. The medium was so spicy that after a few bites, we couldn't eat it. The waiter was more than happy to have the kitchen remake the dish as mild, which was really kind of them.  The time we ordered out, we got both the pad thai and the basil fried rice mildly spiced. The pad thai was fine, but the fried rice was crazy spicy. I left that one to the bf, and went on to demolish the pad thai.  Service when you dine in is spotty. The place is pretty small, and when we went there were only 4 other tables filled. However, it took about 15 minutes to even get water, and another 10 minutes to get the waiter's attention. He was so nice and the food was so good, however, that I didn't even mind at the end."}
{"text":"I keep ordering from here, wanting to like it more than I do.  True, I've never sat down and eaten at the restaurant, but I have ordered take out from here many times, and its consistently ok. I've had everything from the spicy pad thai (it's not spicy) to the Tofu Royal (watery sauce) to the tempura (soggy, too much batter). The curries and fried rice  are decent, but again, nothing spectacular.  On the plus side, the food is always ready SUPER fast - I've never had to wait for my pick up order.  Overall, I plan to keep this place on tap for those times when I am craving Thai and don't want to wait too long."}
{"text":"I had some curry. It was pretty spicy and a bit salty. The service was a bit slow but the food was fine."}
{"text":"Had take out, but still a solid thai experience overall.  For the area also few other options, so that helps the cause.  Nice expansive menu; had the Spicy Pad Thai, but it was nice to see a plethora of options traditional Thai and other categories for dining in with those less keen on Thai.  Menu prices reasonable, most menu dishes ~$10 with a generous portion for dinner."}
{"text":"There food is absolutely amazing! I love that you can choose the level of spiciness for your entree (it gets hot pretty fast!) and the portions are great. Parking is on the street so you don't have to worry about paying a ridiculous fee. There is a lot to do around it as well so it is great for people that are out of town."}
{"text":"A hidden gem in Ohio City. The noodles and veggies are fresh and delicious. Homemade pot stickers and sauce are savory and tender.  The piece d'resistance, however, is the Coconut Soup. It tastes and smells amazing, so much that I have been thinking of it since dinner yesterday! Do yourself a favor and frequent this family-owned authentic Thai restaurant."}
{"text":"This place is a hidden gem...if my friend didn't live by the restaurant, I would never have known this place existed. They have a full bar with many Thai cocktails. The food was good. I got the spicy pad Thai. The chicken was a bit dry, but other than that it was good. The price was reasonabl--my dinner portion of the spicy pad Thai was $11.50. Would definitely come back again!!"}
{"text":"Yum! Good food, friendly service, and reasonable prices. Plus my sister had her kid with us and the staff were accommodating and nice. I would recommend this Thai restaurant. I will go back the next time I'm in Cleveland."}
{"text":"I love duck, and Banana Blossom does an incredible job with all of their duck dishes.  Whenever I am craving Thai food I grab my friends and head to this great little restaurant.  I could say a lot more, but it's best if you just get there and try it out for yourselves."}
{"text":"If its Sunday night and I'm too lazy to cook, I'm ordering Banana Blossom. It helps that they're located just a few blocks from my apartment, but they also have great Thai food. We've ordered enough from here that we've tried a variety of dishes and for the most part everything has been really great.  The red, yellow, and green curries are good, the panang curry is the best, and the one we usually order. The veggie pad thai is delicious, but I usually order without fish sauce because I think the taste is way too overpowering. They are great about customizing your meal, and have no problem substituting or leaving something out. I've also tried the hot beef and lemongrass chicken, both of which were really tasty. All the portions are big, and leave enough leftovers for lunch the next day.  Two must have appetizers are the spring rolls and the pot stickers. The spring rolls are bite-sized, which I think is a cool take on the traditional. They're super crispy and the perfect size for popping into your mouth. The pot stickers (we get them steamed) are so flavorful and delicious. The sauce that comes with them is great.  This is our go-to take out place. Really good quality for the price. They have a really pretty dining room for eating in also, but I usually take it to go and enjoy some comforting curry in my pajamas."}
{"text":"Review update! Tried Banana Blossom again, this time for lunch. They have lunch specials and most dishes are around $8.95 (except the curry, depending on what kind of meat you get.) The restaurant is located around the corner from Hingetown (the newly existing Hingetown), right behind the hospital on W. 25th St. Great place for a quick lunch meeting.   Came here with the hubs for a lunch date. He's a returning customer because of the flavor and I decided to give this place another shot.  We ordered:  Spicy pad thai - pretty good flavor overall and fairly standard/popular dish! It wasn't as spicy as I thought it was going to be. The \"one pepper\" warning is pretty slight.  Pad Woon Sen - clear rice noodles fried with lots of veggies, chicken, egg, and shrimp. This was my first time trying the dish. Pretty good flavor and all around enjoyable.  Service - very attentive and we had a much better experience than the last time I was here.  The both of us still agree that it's on the pricy side for the portion. $9 is not cheap for lunch, but then again, most places in the Ohio City / Hingetown area are charging just as much. We'll come here again for the flavor."}
{"text":"By all means, the food is worth a 4 star!! However, the cost drops it down to a 3 star for the following reasons:  1) The taste of the food is very similar to Map of Thailand (downtown Cleveland), but the cost is higher than Map of Thailand. 2) Decor is pretty nice and elegant, but I don't think that should be the reason to make the food cost more.  We went there for dinner one night and order appetizer, main course and dessert. The appetizer was what they claimed to be Thai pancakes. But it turns out it's the same as the Chinese pancakes (pan fried dough with veggie in the center). It was made fresh, so the food came out delicious and hot. However, they diced the veggies way too much, it turned into mush. But if you've never tried this kind of pancake, by all means, go for it.  For main course, we ordered a Red Curry and a Pad Thai. The red curry was pretty standard. As for the pad thai, it was good except the noodles were a little bit on the dry side. Overall, it wasn't anything extraordinary.  As for dessert, we gave the mango with sticky rice a try. After having the original mango with sticky rice in Thailand, this one cannot compare. For one, the mango was SOUR! :( the rice was hot and sweet, which was good, but the mango kind of killed the taste.   If you've never tried this place before, it's definitely worth giving it a try. But otherwise, I'd just stick with cheaper Thai food that taste just as good if not better."}
{"text":"This was my favorite take-out go to when I lived in Ohio City.  The Pad Thai is some of the best I've ever had.  They're quick, courteous, and consistent.  I've tried a few other dishes (Pad See Ew, Yellow Curry), but I always come back to the Pad Thai.  The others were all VERY good... but Banana Blossom Pad Thai is my kryptonite.  And the Mango Sticky Rice?  SO good.  Light, and refreshing.   I've dined in a number of times, even on weekends during peak hours.  The place has never been packed.  However, the takeout counter is always busy.  Inside is clean and nicely decorated.  I miss this place like crazy.  It's a true OC gem."}
{"text":"There's a tough competition in Cleveland for Thai food, but Banana Blossom has won the best Thai food award in my opinion :)   I ordered the pad see ew and spicy crispy duck. Both were so amazing!! The pad see ew has a very authentic taste with super thick, chewy and delicious noodles :) Their spice levels are a little different from other places. I asked for my usual medium spice level, which was actually a little too spicy for me! So their mild is probably equivalent to medium in other places. And the CRISPY DUCK. Oh dear god, this is life changing!! The dish comes with several pieces of fried duck drenched with some savory red curry sauce. MmMm it's soosososoooo good! You just have to try it for yourself!   If you are a big fan of Thai food, then you need to check this place out!"}
{"text":"My make or break with thai places is pad thai. Easily passed the test. Banana Blossom is a bit pricey, but worth it. Also, the thai iced tea is pretty delicious."}
{"text":"Ordered from here while I was in Cleveland for work.  The String Bean Curry was as good (and as spicy) as some I had in Chiang Mai - and I really enjoyed the steamed dumplings.  It's my new go-to when I'm in town.  Definitely a good choice!"}
{"text":"We live right by here and are always ordering take out! I'm a vegetarian and there are a bunch of options. I've never had anything from this place I didn't like. Pad Thai and spring rolls with an extra peanut sauce on the side is a great starter order. That peanut sauce really does it! I also really like the green curry.  In person dining is intimate and fun. Nice, attentive, timely service. One drawback I'd say is that the other tables' conversations really carry across the room easily. Other than that, I have a hard time finding fault in this place! A great place to meet up with friends to eat and drink (full bar!)   All in all, I recommend Banana Blossom highly :)"}
{"text":"This was my second time at Banana Blossom and each visit was enjoyable.  On this visit, I went with a co-worker who had never had Pad Thai (what!), so of course we had to get that and we also ordered the House Fried Rice, just in case she didn't like the Pad Thai (I know, I know....what's not to like).  We also ordered the spring rolls, as a starter.   The spring rolls arrived hot, crisp and fresh with a side of dipping sauce.  The entrees arrived shortly thereafter and needless to say....my co-worker LOVED the Pad Thai.   We eagerly shared both dishes, eating until we were beyond full and satisfied."}
{"text":"Was only in this part of Cleveland for one night, but I would definitely eat here if I returned. I had the panang curry with tofu, which already comes fried if you're keeping track. Often the tofu is just raw in the curry sauce and can be difficult to stomach. Texture is everything with tofu, and this place got it so right. It was pretty spicy and had adorable baby corns, green beans, eggplant, and red&green peppers. Brown rice was good too!  It was a pick up order, but the restaurant seemed super calm and inviting. Good for dates. Price--average!   Yum!"}
{"text":"Hidden in a little spot on the upper east side of Ohio City, this cute joint has its own charm.  Fast service, decent prices, a semi-stocked bar and no wait is what will keep me coming back for more. Portion sizes could be a little larger...can go down the street to Phenom Phen or Minh-Anh and get larger portions (i.e.- two meals for the price of one).  All around good time, high-five Banana Blossom!"}
{"text":"My sister and I came to Cleveland for the weekend, were craving Thai so we stopped here. Literally the most amazing Thai food. We had chicken pad thai, crab rangoons, miso soup, and the golden chicken. The restaurant itself was super cute too, it has a nice feel to it. Service was great."}
{"text":"This was my first time at this restaurant and wanted to try some Thai food. We are here on vacation from Los Angeles California. I ordered the drunken noodle, house fried rice and the pad see iw.  I give the pad see iw a 3 out of five and the rest about a 2.5 to a 3.  The prices are reasonable, but I didn't think the food was as good as the previous folks that commented. It's clean and the service is good and quick with a smile. Neighborhood is a bit lacking. Cleveland VS Los Angeles and LA wins hands down."}
{"text":"The nicest thing I can say about this place is the food was decent. The service was appalling. They seemed to have plenty of servers, and there physically are not very many tables, so there is no excuse for the way my group was ignored.  It was at least 15 minutes after we had all put down our menus before anyone came to take our orders. 4 people had pad thai and 3 people had rice, so it wasn't a tremendously complicated order, but it was at least half an hour before anyone got food. Add to that 10 minutes from when the first dish came out until the last person got their food, and since I dine with polite people, that meant everyone else's was getting cold. Never during our entire meal did they fill up water glasses and end the night by making us wait another 15 minutes after we had finished eating and asked for checks before they brought our bill."}
{"text":"OK I don't even like Thai food but I love this place. The Spicy Crispy Duck and the crab rangoons are hands down my favorites at this place. I was seriously so addicted to this place that they knew me when I called. Yikes! I have dined in and carried out a ton of times. The employees here are always super nice. It would be easy to pass by this place because it is in a sketchy part of Ohio City but it is definitely worth checking out even if you aren't a Thai foodie."}
{"text":"The only Thai restaurant Ohio City needs.  Ambiance is slightly quaint and even romantic for a date night, and pricing is very fair.  I generally stick to the classics...a dish featuring their award winning red curry sauce or their Pad Thai.   Their Basil Fried Rice w/ chicken is quite good as well.  Now for the spice levels.  DO NOT GO PAST 2 UNLESS YOU EAT SPICY OFTEN! You have been warned, the step up from 2 to 3 is intense and 4 is almost too much for me.  I make my own hot sauces with some of the hottest peppers in the world, so take my word for it."}
{"text":"The food here is awesome!! I am Thai so I can really tell that many dishes served here are very authentic. I love Pad See Iw here very much. The Thai Basil, Garlic Chicken, and Crispy Duck basil are also amazing. The staffs and the restaurant owner are very very friendly. This is so far my most favorite Thai restaurant in Cleveland."}
{"text":"A great selection of delicious meals at affordable prices.  Cozy atmosphere with lovely authentic Thai decor.  We have enjoyed the pleasant and polite service and the excellent dishes during multiple visits.  I look forward to going back there."}
{"text":"I live close to Thai Kitchen in Lakewood and usually go there when I have a craving. I didn't know this place existed until I was stuck in the recent Shoreway closure and starting taking Franklin to work.   We placed a phone order for takeout. When we got there, we were the only ones at the counter. There was one person working in the front taking a phone call. A few minutes go by and the line behind us is getting longer. Someone finally emerged from the kitchen and started asking FROM THE BACK OF THE LINE if they could be helped. We were in the front of the line and were the last to be helped.   I would've spoken up, but this employee didn't have the presence of mind to understand how queues work. It would have been too challenging for her.  As for the food itself, just go to Thai Kitchen; they don't care about your preferences, but there's no nonsense and their food is excellent."}
{"text":"Solid Thai place. I ordered spicy string beans, and they were spicy. The menu indicated two chilies, and was accurate. The restaurant offers brown rice as well.  It seems the tofu is fairly fresh, since they ran out of firm tofu (for deep frying), and let us know that fact rather than substituting softer tofu.  Portions are humongous, plan accordingly."}
{"text":"Arguably the best Thai restaurant in Cleveland. The food is creatively displayed and you truly get the best value for your money for an Ohio City restaurant. I would say that service is generally on the slow side, but lets you have a more leisurely meal."}
{"text":"I eat here as often as possible and look for any opportunity to make lunch meeting appointments here.  The food here is always amazing and I have never had a bad dish!  Portions are generous and service is prompt, courteous and friendly."}
{"text":"So, we finally retured for some take-out and it's true. Banana Blossom is just as good at home.   And once again: Thai Spicy, baby. Thai frickin' spicy!  Pad Kee Mao? I'm all over that! Tender chicken and shrimp, crunchy veggies, basil, wide rice noodles in a brown, spicy sauce. I'm still stuffed from it, but I could keep eating more. Oh yes, I could eat this every.damn.day. Yum-ey!  The spicy pad thai I ordered for my man was also pretty tasty, but I would have ordered it extra spicy--that's just me. What I liked about it was that it wasn't super-sweet (thank God.) I'm not sure why people think this dish needs to be sugary sweet, bleh!   The Tom Yung Goong soup was sour, spicy and delicious, but not necessarily the best I've had. The shrimp was a little tough, but I'm thinking that might have been because it was sitting in hot broth waiting for me to pick it up. If I would have had it at the restaurant, I don't think it would have been that way. The beau slurped down his coconut soup within 2 minutes, so I'm assuming that was a winner. And the spring rolls were OK, just a little bland.   The service? Still great even for pick-up. Our order was ready within 15 minutes and we were helped right away. I will say the location is sort of unfortunate for their business, but I like it since it keeps it a semi-secret for us to enjoy.   This is definitely my new, favorite, neighborhood Asian restaurant!"}
{"text":"Great experience overall! We were the only other table in the restaurant which was great for us being a group of 5 at 630pm. Even though it was a Tuesday it was a nice surprise. Started with the garden roll and the steamed pot stickers, both delicious and quick! Table shared the shrimp and pork wonton soup and it was AMAZING. All of our entrees were great and had an adequate level of spice requested. Everything was served quick, fresh, and friendly service!"}
{"text":"Not the cheapest, but not the most expensive either.  Love, love, love their seafood dishes!!  The place definitely has a cutie cozy look and feel about it.  The spices are on point and their fried tempura ice-cream is to die for.  And did i mention the cute edible decor on all the dishes...."}
{"text":"I was in town for a conference and rather than going for the usual chain restaurants, we tend to branch toward small mom and pop spots. This place seemed to have good review so we gave it a try. I personally enjoyed the fried pot stickers, spicy pad Thai was not \"spicy\" at all-- though it was still pretty flavorful. The chocolate mango ice cream was just amazing. The restaurant decor is very nice, very intimate. However the location is about 5/10 minutes outside of the downtown area. Uber may be the best route :)"}
{"text":"Absolutely love this Place. Very quiet and relaxed. Low light setting. Great Vegan and Vegetarian options. There is a bar and the location of the restaurant is quiet and discreet. In the heart of Ohio city. Best Pad Thai in the city hands down"}
{"text":"I wrote a crappy review  due to bad serviceand the restaurant responded, promptly and in a manner that impressed me. We liked the food and due to the awesome customer service we will be back. thank you so much. my faith in humanity is restored!"}
{"text":"Panag curry is good.. Clean and good staff It was very small so call in before coming for room. There is bar seating so there is that too :)"}
{"text":"Today I was lucky enough to check out a new restaurant with my coworkers. This hidden gem has delicious Thai food with great vegan options! That's why it's one of my friends favorite places to have lunch (He's a vegan that loves Thai, go figure! Haha ) Anywho, I'm not a very adventurous eater so I was cautions and got the Miso Soup and Fried Calamari. Not the best Miso Soup I've ever had but the Calamari was delicious! Loved the sweet chili sauce that was paired with it. Since I was out with friends I got to try a lot of different dishes. The bite size spring rolls were the best spring rolls I've ever had! I also tried edamame for the first time and they were delish! Because my friend is a frequent patron of the restaurant they waitress gave us free Garden Rolls, all veggies wrapped in rice paper... looked like sushi, but was all veggies! All three of these were great vegan appetizer options! I also tried my friend's  Veggie & Tufu Pad Thai, delicious! I will be ordering this the next time I go. Then I tried the Chicken Teriyaki, I will be ordering this the second time I go back! Lol, as you can see. Banana Blossom has new returning customer!  Definitely I great place to dine!"}
{"text":"Very nice neighborhood Thai restaurant.  Went here for lunch and had a great time!. Good menu selection at lunch with multiple options.  Portion sizes are generous.  You must try the Thai Iced Tea!  It is too much for words.  Will plan to come back and try the dinner menu."}
{"text":"This little know Thai place was actually pretty good. I'd say it's one of the better Thai places on this side of town. From the outside it may look a bit questionable but once you go inside, and try the food it's great. The portions are a very good size for the price, and the location itself is very clean."}
{"text":"Very good food. Pad Kee Mao is very yummy as is the duck with pineapple curry (a little spicy). Definitely reccomend this place. At times however...the service can be slow."}
{"text":"Maybe it was just ordering something that is not what I usually get at a Thai place, but I was not overly impressed with my food.  I came here with some friends and got the hot spicy crispy duck, which others on Yelp have recommended here.  And, while tasty, the duck seemed less tender than I would have hoped for, and the meat's flavor was perhaps a little overpowered by the sauce it was served with.  On the other hand, the sauce itself was very good, flavorful without being too spicy (for my tastes).  It might be that I am not used to ordering this sort of dish, and perhaps it's cooked just the way it's supposed to be.  In that case, I will certainly give some other dishes a try the next time I come to this place.  I imagine the curries here would be quite good, and I admit that I would be interested in giving the pad thai a try here (which is my usual \"go to\" thai item.  So for now I'll give this place 3 stars, but I think this could change with a return visit."}
{"text":"I have yet to eat in the restaurant, but Banana Blossom KILLS IT on take out.  The prices are decent, they label everything very clearly, don't charge you extra for rice or special requests, and the food is tasty and comes fast.   They also have quite a few traditional Thai dishes that many American Thai restaurants don't have.   Bravo! Go visit them now so they can stay in the 'hood for a long time to come!"}
{"text":"Fantastic Thai food that is full of flavor and desired level of spice!  The menu has lots of variety with the Pad See Iw being my favorite as the sauce is great and the noodles are cooked to perfection.  The space itself feels authentic and relaxing, while it is also in a good part of Ohio City for quick pickup/takeout."}
{"text":"Pricy OK-tasting food. Not really worth the cost. Better Thai places in CLE for sure!"}
{"text":"Fresh and delicious food, elegantly served in reasonable portions, attentive service, serene surroundings.  The pad thai was tasty and subtle, while the spicy crispy duck was nicely browned outside, meltingly tender inside, and accompanied by a sauce so delicious that my dinner companion kept stealing spoonfuls off my plate.  The salad and drinks were also inviting.  We will definitely be visiting again (and again and again.)  By the way, another diner ordered a dish marked \"spicy\" and then complained that it was \"hot.\"  It was returned to the kitchen with no arguments and gracious apologies and replaced with something blander.  I ordered hot and would not have minded more authentic heat!  However, the goodness of the ingredients makes this restaurant a palate pleaser.  Banana Blossom is the genuine article and an outstanding restaurant."}
{"text":"I was traveling via Cleveland to Erie. Being a vegetarian, Thai works in an alien place for me. Found good reviews for this place on yelp and hence decided to give it a try. Was worth it! I ate the yellow curry with tofu. Great taste! I reached at 2.25 but the manager still let me in and he left only when I was done. Very kind of him! Great ambience and great food! Would definitely recommend to any Thai food lover."}
{"text":"I usually go to Ty Fun for Thai food, but  I thought we'd try a new place. I'm pretty happy with my decision.   For starters, we had Tom Yung soup and the spring rolls. The soup was fantastic! Great flavor and spice. Plenty of veggies!  For dinner, we shared the pad ki mao (which is my ultimate fave at Ty Fun) and panang curry, both of which had 2 chili peppers on the menu. I really wanted to try the Three Flavored Fish, but they didn't have any when I went. Oh well, next time. The waitress suggested getting the pad thai, but I think that's a little played out for me and I didn't want to have 2 noodle dishes. Maybe I'll try it another time.   Both dishes were excellent. Abundant, wonderful flavors, and best of all, a good amount of spice. Enough to burn, but not enough to make you guzzle down a gallon of water. My only negative complaint is that the noodles in the pad ki mao were mushy, and didn't seem as fresh as the ones at Ty Fun. Minus one point for that.   Overall I am happy with this restaurant and I'm glad I've found a new Thai spot to go to. Friendly and awesome service too!"}
{"text":"Food is AMAZING. I came for lunch on a Wednesday afternoon. No one here except people waiting for to go orders. Sat down and the place filled up quick! Waiter was fast and very friendly. I got the pad thai. One of the best I have had. Fresh and on point flavor. Parking is tricky as it is located on a corner in a small neighborhood. I almost drove by it. I will come back for sure."}
{"text":"Delicious vegetarian food and excellent service. The people who work here are very nice and friendly. The curry bases for all of the dishes are tasty and just spicy enough."}
{"text":"In a word: Awesome! I was on a business trip to Cleveland and Yelp-ed for food around the area I was visiting. Banana Blossom came up with rave reviews. After eating there, I can understand why. Very attentive service and the Pad Thai was excellent. If you're looking for Thai food, don't overlook this jewel."}
{"text":"So many options here!  I love Thai food and if you are looking for authenticity this is the Thai restaurant to try.  So good and so much to choose from.  I love the basil fried rice, but you definitely need to tell the cooks what spice level you want or you will need a lot of water.  For me, the spicier the better!  Must try guys!"}
{"text":"I'm going to go out on a limb and say Banana Blossom just might be the best Thai in Cleveland. I recommend the pad see ew and the steamed potstickers are a must!"}
{"text":"Honestly, the food was so good I dove right in and did not take any pictures. I am from Pittsburgh, I've also been to Thailand, and I cant find an amazing Thai place in Cleveland, but I finally did with Banana Blossom. I love spice and when i say they dont lie, THEY DO NOT LIE. I got a three out of five and it was so so hot(drunken noodles). I got the scallion pancakes to start, a thai iced tea and the pad se ew (drunken noodles). My friend got the pad thai with the default of chicken and shrimp it was so good. And I could tell some people working there were speaking thai, so authentic and my new fave place. I also love the decor, the colors on the wall give it such a warm vibe, I'm obnoxiously obsessed."}
{"text":"Honestly most Thai restaurants taste nearly identical to me, but The food here is a five, some of the best Thai that I have had.  The basil chicken was extra flavorful and really accentuated the basil.  I tried the pad Thai as well...  and it was delicious!  What really stood out were the textures though. They baked the bail to a light crisp which was delightful. For the pad, the noodles and sauce textures were awesome and the vegetables were soft and not at all soggy.  The ambience does leave something to be desired as it is just a small open room and fairly bland and the service was nothing special, they were non-descript and brought all of our food out at slightly different times... Keeps it just shy of 5 stars"}
{"text":"This is quite literally a hidden gem of a place in Ohio City. While it is well marked, the outside of this place may initially scare you as it doesn't quite look like a restaurant and with few other restaurants or shops in the area, you may not think this is a place you want to eat. You probably do want to eat here.  Walking through the door, you will face a well appointed restaurant and bar that seems to be run by a Thai family. The menu is extensive and quite well done with artistic presentation of food.  Service is fine and what you might expect from a family run restaurant with things being a bit slow from time to time, but very friendly people who want to ensure you have a good time.  After being here a few times, I'd recommend the standards (e.g., pad Thai). The crab Rangoon actually comes out wrapped like spring rolls rather than the typical butterfly fold, so be conscious of that before ordering... you get waayyyy more cream cheese than you might be used to at other restaurants.   Bottom line, I keep coming back because they are a solid stand by restaurant with friendly service... and I live close by in the area. I wouldn't travel here, but if you're hungry and in the area, don't be scared off by the austere exterior... the interior will give you a reasonably good Thai experience."}
{"text":"Best curry in Ohio city. The service was generous and welcoming. Small yet cultural, the lights could've been a bit more bright. But the dimness gave the mood."}
{"text":"Love this place! It is in my hood and it never disappoints! I love the garlic chicken and the crab rangoon. The service so friendly, too. I have lived all over the country and have sample my share of Thai food! This place ranks high! Super tasty!"}
{"text":"The waitstaff here recognized me as an avid yelper!  Very strange, yet oddly flattering...  I would give this place 3.5 stars.  It's probably the best Thai food I've had in Cleveland proper - a fair, but significantly closer alternative to the place we frequent in Pepper Pike - Peppermint Thai cuisine.    They have all of the dishes you'd expect at traditional Thai restaurants, but with some imperfections.  I tried the Pad See Ew - it was a big soggy, but flavored well.  My girlfriend had the Pad Thai - the noodles were cooked to the correct doneness, but it tasted sort of bland.   We switched plates because I was okay with bland and she was okay with soggy.  All in all, it was not the best we've had, but we were satisfied."}
{"text":"Banana Blossom is a beautiful little restaurant with very good food. The Pad Se Iw was chock full of vegetables and chicken, and the green curry was spicy and delicious. The fried tofu wasn't particularly great--it was almost rock-hard on the outside, and it made it very difficult to eat.   The service was very, very slow, however. The dining room is small--only about 25 patrons can eat at one time--so bartenders and wait staff should be able to see when you are done eating, or ready to have your check picked up. There was also no \"check in\" after our meals were brought out. While the food was awesome, I was dying for a cup of coffee, and it took half our meal to flag someone down.   While not the most prompt staff, the great food and nice prices mean I'll be visiting again."}
{"text":"Even though this restaurant is in such a random part of town and it's quaint and not all that bustling, Banana Blossom was delicious. I started my meal with a Thai Iced Tea. Perfect. Not too sweet and overdone with the milk, and not too bitter. I ordered the Lard Na with wide rice noodles at a Level 3 (Thai Spicy). I love spicy food, but level 3 was surprisingly more hot than I expected. It was still delicious, and I was able to devour my bowl, but I'd be lying if I said I didn't feel a bit warm with my mouth burning. Nevertheless, mama didn't raise no b*tch, so I killed it. The spice was nice, but I think next time I'll go with Level 2, so it's even more enjoyable without worry or sweat. Based on the taste of this Lard Na, it's approved by me. I order Lard Na at every Thai restaurant I visit, and this place did not let me down. Tastes pretty dang authentic. Yum!"}
{"text":"Very tasty pad woon sen! I substituted a few of the vegetables and they were very accommodating. My husband and I are at the restaurant - nice, simple, welcoming. My only complaint is that they didn't have any baby Bok choy and they didn't offer (maybe didn't have) any hot sauces."}
{"text":"Food and service were exceptional on a recent visit. We started with the larb (a ground chicken salad with tons of flavor); three of us had curries (red, green, and yellow); and my husband had a chili duck dish. All were done perfectly and were nicely balanced. I was tempted to lick my plate.   This place is on my way home from work, so this could get dangerous to my waistline and wallet..."}
{"text":"Excellent food, definitely order the mango fried rice.   Very friendly staff to go with the food. A little hideout, with great ambiance."}
{"text":"This place is absolutely amazing! From the service to the food!! Every time I come in here I am greeted with smiles and the aroma of delicious food!  I ate here a couple of time but have been ordering take out much more because the food is so addicting here.  I usually order the chicken pad Thai level 3 spice.  The spice levels are sometimes different depending on who made the spice that day.  Their food has been consistent every time I come here so I have no complaints! I love it here and I definitely recommend this place to anyone looking for some Asian cuisine!"}
{"text":"I had a hard week at work, so I decided to splurge on thai takeout for a Friday night dinner in front of the tv.  I spent $20 (including tip) on the Garden Rolls and Pad Thai.  The Garden Rolls say that you get 6 rolls, so I didn't think it was too bad of a deal.  When I opened the container, it's actually 2 rolls cut into 3 pieces.  I felt a little cheated.  They were pretty good, but I've definitely had better (... at Superior Pho).  The Pad Thai was ok... super heavy on the tamarind paste.  The chicken was strangely textured and the shrimp was overcooked.  There were about 5 pieces of scallion, a few bean sprouts, and that's about it.  It tasted like they had made it hours ago and it had been sitting around.  I don't think I would have been so critical had it not been so expensive or seemed a little more fresh.  Probably won't go back."}
{"text":"You have probably driven past this place and never even knew it was there! Banana Blossom is an excellent Thai place in the Ohio City neighborhood. I ordered takeout and the food was done very quickly and the service while picking up was great. The restaurant itself was very clean and had many patrons which is always a good sign especially for a late Sunday night.   We tried the Pad See Ew, Pad Thai and the Chicken Satay. Both noodle dishes were delicious. We ordered a level 3 spicy for each and it was the perfect amount of heat for someone who likes their food spicy. I can't even imagine what the level 5 spice is like. I highly recommend Banana Blossom and I'm excited to try it again."}
{"text":"Good food and neat ambience. The papaya salad was delicious. Green curry was one of the best in Cleveland, and the spicy pad Thai was good too. I liked that the bathroom was clean and the decor was neat. Will return."}
{"text":"I'm not much of a Thai fan, but this place is pretty good. The staff was very friendly, nice and accommodating. It's a small place, but there weren't that many people there when I went so it was pretty quiet. We got the chicken satay, which was amazing. Very tasty. The sauce that came with it was outstanding. The waiter did a great job of being personable and recommending something \"different\" for me. I told him I prefer chicken, and he suggested I order the chicken pineapple. Also very good. The dinner was relatively inexpensive, but the portions weren't that big. It still filled me up, and if I were to ever be in the mood for Thai food, I would go back."}
{"text":"My favorite Thai food in the city!   I usually get the tofu and veggie pad Thai, but the chicken cashew nut is amazing too! You must check out this place! A little ways from the heart of Ohio city but worth visiting!"}
{"text":"Best Thai food around by far. Great find. Food is fresh and so flavorful. Excellent for fans of spicy food. I've tried Thai options around Lakewood and this definitely wins out and it's not close. Spectacular."}
{"text":"I've lived in the area for over a year, and I finally tried Banana Blossom. I don't know what I was waiting for! It was amazing.  I got the Pad Thai, the best I have ever had, nice and moist noodles and great flavor. I also got the Seafood Thai Coconut soup, that was also great, a little spicy, but great flavor. I have found my new take out place!"}
{"text":"AMAZING pad thai in a somewhat deserted area.  Best thai I've had in cleveland -- service was excellent and friendly would definitely go back to try other dishes"}
{"text":"Possibly THE BEST pad thai in Cleveland! Definitely the best I'd had in my four years living here. I got the Spicy Pad Thai, level 3 (out of 5), and they're definitely not playing around with the heat. That thing was spiiiicy! And delicious and saucy and full of flavor. The shrimp and chicken were both cooked perfectly and were tender and not rubbery at all. I came back to visit Cleveland for five days and have already come to Banana Blossom three times!   We also ordered the fried ice cream and mango sticky rice. Fried ice cream was pretty standard (still delicious) and the mango fried rice was out of this world! Mango was the perfect amount of ripeness and the sweet (coconut?) sauce over the rice was mouthwatering. I'll be back!  Update: It's been ~2 months, I go to other thai restaurants, order their pad thai, and just miss Banana Blossom's. #takemeback"}
{"text":"Nice and quaint! The food here is delicious and the service is good. The drunken noodles, pad Thai, and the crispy duck is bomb.  I recommend the Thai ice tea!"}
{"text":"Pretty incredible. Food is amazing with a nice variety and the staff is as helpful as can be. As a vegetarian i like the options they provide me. Definitely a great place or dinner!"}
{"text":"Last week I came here after work. It is located right next door to the Malachi House, which is an awesome place. (I encourage anyone who reads this to go the Krusty's Summer Sauce Camp in August. It is a benefit for this wonderful place.) The guy behind the bar was very welcoming. We talked about neighborhoods of Cleveland, food and life. He was really nice and a pleasure to meet. The Thai Coconut Soup was a good starter. The Panang Curry was fantastic. The food was good and I plan on becoming a regular. He gave me a take out menu. The music was also pleasant. The walls were painted in bright, warm colors. The building has a lot of character. I enjoyed the experience."}
{"text":"I eat here 4 times a week. Go to is the Thai style basil; but nothings been disappointing. Simply a gem."}
{"text":"Really friendly service and a fast kitchen. Dine in lunch for two took under an hour.   The Chicken Broccoli portion was the right size for lunch. The chicken was thinly sliced and simply served with tender carrots sliced as thin as the chicken, a few mushrooms and perfectly cooked al dente broccoli. All this was covered with a mild, but flavorful sauce and brown or white rice accompanied the dish. (Beef can be had instead of chicken.)   I also enjoyed the flavors in the Pad See Iw. The Thai Iced Tea was refreshing and not too sweet."}
{"text":"Really good food. The restaurant was very hot tho maybe the ac was broken. Defiantly try this place if you haven't"}
{"text":"The food was great, i ordered red curry with chicken. Very spicy is spicy so to enjoy go with medium spicy, I went with my wife and she also enjoyed the vegetarian dish. The service was fast, area was great."}
{"text":"I ordered $40 of food to have it delivered to my workplace tonight.  I asked for chopsticks and utensils when I made my order and they did not give any.  How was I supposed to eat my dinner without any utensils? With my hands?  So I called the restaurant back to have them send me plastic silverware so I can finally eat my cold food.  The lady that answered the phone clearly just said sorry, can you call the driver and ask him to stop by and bring it?  Like seriously?  I don't have the driver's phone number!  I asked if they could bring me silverware and she just said, \"No, sorry\" and hung up on me.  So my sorry a$$ had to the nearest CVS to buy some plastic utensils.  Furthermore, the food was packaged sloppily and the sauce was spilled and leaking from the plastic bag.  Portions were small and the cold food was not appetizing."}
{"text":"Went here for the first time today at lunch time.  It was pretty quiet - we were the only customers - so I was a little skeptical at first.  However, between the food and the service, I am a fan!  We shared some Thai pancakes, which I had never had before - delicious!  I had Vegetarian Fried Rice.  What's special about that, you ask?  Undoubtedly, the best fried rice I've had anywhere.  The service was friendly and efficient, without them falling all over us, even though we were the only ones there.  Going back and taking other Thai food fans."}
{"text":"My sister suggested this place for dinner and I was a bit skeptical. She doesn't eat anything spicy and she said it was the best Thai food ever. Even though I was skeptical I obliged and we came here for dinner last night.  It's a small place and we were able to be seated right away on a Saturday night.  I ordered the Massaman Curry which is one of my fave Thai dishes. The sisters ordered the Mango curry and the Pad Thai. Everyone seemed to enjoy their dishes. I tasted them all and everything had a nice flavor.  This place doesn't make itself out to be a fancy place or anything and thats ok. The food stands up well and the server was friendly and attentive.  If I was in the area, I would definitely come back to this place."}
{"text":"I like this place. It's really nice inside. Maybe that's a problem... I'm used to the hole-in-the-wall Thai places being the best. This place is upscale *and* good... seems counter-intuitive.   We went on a random Wednesday evening and we were the only diners in the restaurant. It was a last minute decision. The food was ready in about 5 minutes and the Spicy Pad Thai was seriously spicy - in a really, really good way.   They don't have numbered levels of spiciness here. You know how when you go to any good restaurant, they don't put salt and pepper on the table? It's kind of like that. Trust them to season (or spice) it correctly.   Definitely a do-over. I'd like to see it when it's bustling."}
{"text":"I love thai food. This thai food was, as 3 stars describe, \"A-OK.\" pad se yew was good, though not the most flavorful. It also had carrots in it and that was weird.  The restaurant itself is very cute, bright, and nicely decorated. Oh, and some of their paintings are oddly erotic..."}
{"text":"I've ate here once and got take-out once. It's not bad and it's not amazing. The Pad Thai was super salty and too much sauce. The quality of the food is good. The service was good. Prices aren't bad at all. Decent spot."}
