{"text":"Order some iftar items- pyaju, aloo chop, beguni - they tasted horrible. Bland and overall disappointing. Also, the portions were so small compared to the price!!   Ordered goat haleem as well, and that was just alright.   Kinda bummed out that the only Bengali food place has such sub par dishes."}
{"text":"My favorite Indian restaurant in Oakland. Good quality spicy food! Naan is amazing and Mango chicken curry too! Would definitely recommend. Pickup has always been fast! And customer service has always been good and welcoming except one night they never picked up there phone. Masala Tea was super tasty and not curdled like I've had at another Indian restaurant."}
{"text":"I got an ad and decided to try the buffet. I had hoped to find a Kabab buffet but I found a mediocre Indian buffet. So, as an Indian buffet: very limited selection of food, the food itself was not very tasty: the chili chicken was bland, the matar paneer was watery, basically, all the dishes lacked flavor. The only good dish was the pakora. At $10, this was not particularly cheap or good compared to other Indian buffets like on N. Craig St. or Coriander's in Sq. Hill. I don't know what other places the other reviewers are comparing with."}
{"text":"The food was amazing, and it's reasonably priced.  Friendly service, plus a complimentary cup of tea at the end of the meal makes this place an easy 5-stars for me."}
{"text":"Really good indian food. The lunch buffet is definitely worth it."}
{"text":"Kinda a hole-in-the-wall place, but a hole filled with delicious food and aromatic spices!  My son and I were here for a tour of Pitt, and needed some dinner. We were greeted by the owner, maitre-d, waiter, and chef, Mr. Ahmed. He's a very friendly guy. We watched him bring some cardomom to the couple across from us, and give them instructions on how to make their own tea at home.  My son had a sheek kabob, I had lamb paneer. Yum! My son was new to Indian food and started the meal with a little reluctance, but ended the meal stuffed and very happy. I got to try some of his kabab, which was very well prepared. Both entrees were fresh and flavorful and you could tell not over processed into nothingness. My spinach dish was fresh as it still had that bright green color which had not faded into an olive drab. It was great.  Total damage for 2 entrees, rice, 2 orders of naan, a mango lassi, and diet soda?   $30, and well worth it."}
{"text":"It is the best biryani I have had in a long time. Very nice place to eat. Good service..."}
{"text":"Great authentic food. Wonderful kebabs. Biryani is delicious. The food is extremely flavorful and a must have. Customer service is excellent as well."}
{"text":"Chicken Korma Curry - AMAZING flavor!  Stopped in for a quick lunch and had Korma Curry on our mind.  The buffet looked wonderful - seven days a week til 4:00 for $7.99 - will try next time!"}
{"text":"First of all I would just like to state what is required to have a restaurant, just 2 things. Food and service, this place does have both but they are do very bad at both. I stopped in here with my family for dinner and with an empty restaurant it took 5 min before we got sat by a individual that seemed he was at home rather than work. He greeted us with no uniform and wearing sandals, and then pointed to the table he wanted us to be seated, not very professional. Next he took our order mind you wearing sandals and a toothpick in his mouth. The food was edible but as all the yelpers are pointing out its extraordinary and worthy of 5 stars, Far From It!!! Bland and boring Indian food at best. I am guessing yelpers feel pity for this restaurant and the price is reasonable that is what people prefer. I however like to pay good money for good  authentic Indian food."}
{"text":"Server was super arrogant. I asked my wife in person if she wanted to take out instead and then the server interrupted rudely \"decide whether you want to eat here or take out\". Btw, there was no one in the restaurant except for us. Food was super old. Raita was old too and it was smelly. We told him about the raita, he argued arrogantly that 10 people ate it earlier that day but no one complained. We told him to add it in the bill if he wanted to but he was did not charge for it and gave us a complimentary veg dish. Papad, chutneys and Naan were good. Fresh food might be good there though. I would personally never visit again."}
{"text":"This spot is great. I've eaten there and  got pickup. The samosa chat is amazing, be sure to give it a try. Careful with the spice level on that one though, its delicious but has a kick. The staff is super friendly every time!"}
{"text":"Real indian taste food. Goat  varieties are excellent and briyani real one like home. Atleast once a week ordering. Hope they keep up the qualtity and taste."}
{"text":"I got takeout from here and asked for a 7 out of 10 for spiciness. The food I got was incredibly bland and not spicy at all. It was also very greasy. Probably won't be back."}
{"text":"So this place just opened up two doors down from where India Garden used to be so my friends and I thought we'd give it a try.  It's only been four days since opening and the staff is super friendly.  I'm unsure if it's always going to have a lunch buffet (or Lanuch Buffet as the sign outside proudly advertises) or if it's only to celebrate their grand opening but everything was delicious.  Nothing was labeled but I recognized Palaak Paneer, Chana Masala, Chicken Tikka Masala, Goat Curry, Vegetable Pakora, and Samosas.  There were also a few things I didn't recognize.  The buffet didn't have any Naan but that was because the waiter brought it to our table, fresh from the oven. They also gave us free Mango Lassis to celebrate their grand opening.  So all in all I have to say the quality was better than both Prince of India and the now defunct India Garden, it's also cheaper than both, and the staff is a lot more friendly."}
{"text":"Just 4 weeks ago I awarded Bangal Kabab the coveted fifth star for the consistent quality and bargain price of their lunch buffet. I visited today and was sorely disappointed: the selection and quality of the food was far below their previous standard, and many of the items were cold. They did not even bring out fresh naan once during the 45 minutes I spent there. To add insult to injury, when I went to check out they informed me that the price is now $10 instead of the $8 it had been for the past six months; this change in pricing was not advertised anywhere as far as I could tell. $10 would not be unfair (although certainly not a bargain) if the quality were what it used to be, but for what I got today it was a total ripoff."}
{"text":"We visited Bangal Kabab house on a Friday afternoon for the lunch buffet.  It was nearly empty inside, however we were treated very poorly by the one member of the staff we had any contact with.  The host barely spoke to us and when he did he was quite surly.   At one point, because there was a large floor fan blowing directly on our booth, my paper napkin blew off my lap. The host came by and picked it up OFF THE FLOOR, refolded it and placed it back on our table, securing it with my bowl of gulab jamun. Unacceptable.  The food on the lunch buffet was OK, nothing to write home about, but the service was the worst I've ever experienced at a buffet. We felt decidedly unwelcome and will not return."}
{"text":"I ordered my favorites in delivery. aloo China chat (cold chickpeas with a delicious vinegarette yogurt cream, chips, potato, cucumber, and tomato) was the best I've had.   Their korma (butter and nut flavored sauce) was also the best I've had. I had the lamb, and it was perfectly cooked in there, not overdone. tikka masala is my usual favorite sauce and this was just as good as normal, but korma was extra special. I ordered the shrimp and they were nice sized shrimp. I preferred the garlic naan to the regular. baingan bharta (eggplant with tomatoes) usually has more tomato flavor, but theirs in more eggplant strong and it was creamed like a paste. my personal preference is more tomato flavor and a little more recognizable."}
{"text":"Great selection of flavorful dishes with a nice clean interior. Although it was fairly quiet which is not something I'm use to at most ethnic restaurants (could use some music) the waitress was super sweet and attentive and one of the owners actually came out personally to ask us if we enjoyed our meal. Tikka masala was rich and flavorful as was the tandoori chicken. One of the curries was bit oily for my taste but there was plenty of other dishes to choose from. Would definitely try again once I digest the many plates of food I ate in a week or so ..."}
{"text":"First time at this restaurant.   It's a small place, not much room. We had the buffet and loved it.  The naan was fresh and chewy!"}
{"text":"Edit 4/18/2015: I did not know there was a minimum charge of $10. In the future, I will be sure to return with a friend!  PRICES HAVE CHANGED. At least they must have, because I was charged $10.69 for the weekday lunch buffet even though the sign on their window still advertises $7.99. (This is more than All India's weekend lunch buffet, even without the student discount). I am still a bit put off about the fairly large difference, but I am not factoring it into the rating. Though it came as a surprise, the price was fair, though I won't be returning unless it's for a special occasion.  I walked in around 1:00 pm, and the restaurant was empty. (A couple more parties of one or two had come in by the time I left.) It's pretty small, and the decor places it somewhere a little above hole-in-the-wall. The waitress was very attentive in a quiet way, but I didn't feel any of the hospitality mentioned in the other reviews. The hot buffet had pakoras, rice, naan, chicken tandoori, chicken biryani, and six other entrees, three of which were vegetarian, including chicken or vegetables curry, mataar paneer, and chicken or vegetable tikki masala. The cold food was housed in large coolers whose lids were closed when I went, and included watermelon, oranges, rice pudding, a round sweet that tasted vaguely like carrot cake (but wetter), salad, and chutney. I also noticed a container labeled \"tea\" by the register when I paid; I'm not sure if it's part of the buffet (I didn't bother to ask).  Unlike other buffets I've tried, the food (especially the vegetable curry) is spicy--almost at the edge of my tolerance (which is embarrassingly low). I was okay with some water, though. Though the place was empty when I started eating, the food tasted fresh and warm. Everything was delicious, and there were a couple dishes (such as the biryani and tikki masala) that I took a bite of and thought, \"So this is what they taste like\"--as in, previous experiences with those dishes must have involved blander versions. I was worried about the naan since it had been sitting out, but it was still soft, if not fresh-from-the-oven warm. The fruit was sweet (and the watermelon was a nice sight after a long winter) and the salad was fresh. The rice pudding wasn't my favorite; it was on the thinner side and tasted a little like bananas, for some reason.   Side note: the bathroom is freezing cold.  Overall, I enjoyed the food. If they still charged $7.99, I'd be back without a doubt. Since I paid $10.69, though, I'll probably be going to All India on North Craig Street when I'm in the mood for an Indian buffet, not because this place isn't worth the price, but because All India is cheaper for comparable quality and variety."}
{"text":"Yelp served me well again!  This was a most yummy find. Good quality food. I was pleased that the dishes had a nice heat to them -- perfect for me, a tad hot for my friends who had not eaten Indian before. Those who are used to Indian cuisine will be pleased for sure. Next time I'm in Pittsburgh I would return for sure!  Also nice that they had a buffet in the evening which served our need for a quick and yummy meal. And very reasonable, too!"}
{"text":"I absolutely love this new place. It is the best Indian food I have had in Pittsburgh by far and the staff is extremely friendly. Cute little place and very welcoming. Would highly suggest!!!"}
{"text":"We were driving from Pittsburgh to Akron and after quick yelping decided to go to Bengal Kabab House. The place was a bit small but was cozy, food was great. We got lamb biryani, it was a bit different than the traditional Indian biryani. The quantity was good (lots and lots of meat !). I am particularly fan of their service, there were not many people to serve but they were very warm and nice to talk to."}
{"text":"I had the lunch buffet. The food was very tasty. Service excellent. Price very reasonable. I will definitely come here again."}
{"text":"The food is very good, I specially liked their beryani. What prevents me from returning is that they have a big TV screen playing music videos in their dining room. And the dining room is very tiny, it is not like you can escape it. If people want to watch TV while eating, they order take-out. Isn't this obvious? It is distracting to have a TV playing videos while you come here with someone to enjoy food and conversations. Playing some music on a reasonably low volume for the ambiance? Sure! But loud music videos playing in front of my eyes during my meal? No! It makes the whole dining out experience ruined. I would not return unless they remove their TV and subsequently annoying music videos from their small dining room."}
{"text":"Been coming to this lunch buffet any weekend I have the opportunity to,  they are by far the best Indian buffet I've tried in Pittsburgh. Their Tandoori chicken has a nice punch to it,  and is much more flavorful and tender than many in the city. The attention to quality is definitely noticeable throughout their dishes."}
{"text":"Don't let the appearance fool you. Was looking for Baja Fresh but happened across this place and was not disappointed. Food awesome and great value for money."}
{"text":"After seeing the favorable reviews on yelp, I decided to give this place a try.  I was in the mood for something spicy, so after looking over the menu I decided to go with what looked to be the spiciest thing on the menu, the Chicken Vindaloo, which apparently is a south Indian dish, known for being quite spicy.  I was a little surprised when I was asked what level of spicy I wanted the dish, kind of having assumed based on the menu that it was pre-determined.  Nonetheless, seven out of ten was my answer as I knew that south Indian food can be pretty intense.  When the dish came out it was very flavorful, and an average size portion for the price ($10.99), but there was absolutely no heat at all, which was pretty disappointing.  I'll give this place another try though as the overall quality was there."}
{"text":"I went there two times while going to Ohio from NJ and back to NJ. Their food was really tasty and fresh. Employees were very polite and well mannered. They served food on time. At the end they served complimentary tea. Five star for them"}
{"text":"Absolutely amazing. The goat dishes melt in your mouth and the buffet looks awesome. The real deal."}
{"text":"This is the best Indian restaurant in Pittsburgh that I have been to (admittedly, I have only been to five or six.) The food is absolutely delicious and is the main selling point; this is the tastiest Indian restaurant food I have had in the US. The service is great, although sometimes slow. Portions are generous and the price is extremely reasonable. They even give you a papad with chutney for free while you are waiting!  There is one complaint I have, however; I almost changed my rating to 4 because of this. I have written this elsewhere before, so I'm copying and pasting: They serve rice with almost every dish and do not allow substitutions. To be fair, this appears to be the general practice in all Indian restaurants in Pittsburgh that I've been to; this is remarkably pointless and inauthentic. It makes absolutely no sense to serve rice with a majority of the dishes on the menu, especially the dry dishes. If you work at Bangal Kabab and you are reading this, I sincerely suggest that you allow your customers to replace the rice with some basic butter naan. If that is too expensive for you, at least include an option to upgrade the rice to naan for a small price."}
{"text":"Serves great biryani and buffet. You could go for great tandoori n biryanis.very welcoming. Staff did change which could be a little concern. However on the whole, decent food."}
{"text":"WHAT HAPPENED TO THIS PLACE??  The restaurant must have changed owners.  I began eating at Bangal Kabab House when it opened up.  I would have rated it 5 stars then, all the way up until this summer which was the last time I went before today.  Today was a completely different experience.  The new staff was not friendly, but worst of all, they are serving VERY SMALL PORTIONS NOW.  The fish pakora portion was tiny.  Channa Chat in 2 to-go containers -- smaller containers and they were only half filled.  i told my friend about it and she said the Mali kofta she got this weekend was worse- 3 tiny bite sized pieces floating in 12 oz of sauce/gravy.  Everything still tastes authentic, just like Bangla cuisine. Slightly different recipes than before.. But unless they start giving people the portions they are paying for, they will not last long as a business."}
{"text":"This became my go to Indian take out spot during my stay in Pgh. Small hole in the wall restaurant that many people will miss, but this place will satisfy all your Indian food cravings! Pretty extensive menu and ugh their chicken tikka and makhani is sooo good! They give you a huge container of mango lassi if you order it to go! Either way, good portion. Quality was always good here and quick service! Only down point was that I didn't discover this place earlier!"}
{"text":"Just went here for their lunch buffet. Freaking fantastic. Everything was so fresh and delicious: naan, chutney, goat biryani, Chana masala, vegetable pakora, mator paneer, chicken masala and a few desserts...I could keep going but you get the point. Full and happy bellies. And the service was great and very nice owners. It doesn't get much better than that."}
{"text":"Ordered take out and got lamb korma and goat curry at a 9 out of 10 spice level. Both dishes were distinct and delicious. The korma had a sweet taste to it but still great. The curry had a creamy taste but still great. Different but tasty. The garlic naan could be better, it was thin and and flaky. All in all great Indian food."}
{"text":"A really decent lunch buffet, I remember liking their salad and different dressings a lot. It has a great location that is close to school, but when compared with other Indian buffets in Oakland, I don't think it is the most competitive one. Bottom line, recommend for people like Indian food and also being around the neighborhood."}
{"text":"It's one of the best Indian buffet I ever had !!  Their tea is amazing and the chicken Marsala is the best ! And the yoghurt! OMG! Five star!"}
{"text":"Went to have chat and the owner was too rude to tell us that he won't serve us only chat. He even told us to jus take away the chat and not sit on the table. I was really disappointed by the treatment."}
{"text":"So I ordered some samoas, poori, and the fish curry from here. The samosas were stale, as if they've been sitting around for a day.    This would have been okay, sometimes take out gets the food sitting around all day. But what irked me was that the poori was not a poori! It was an oily, gross, and most importantly - a FLAT - roti. A poori, by definition, puffs. It is puffed bread. When I called the restaurant about this, the person who picked up tried to mansplain to me what a poori is. Sorry, I guess in my 30 years of life, I've been eating pooris wrong the whole time; my mother, my grandmother, and every other Bengali person I know with whom I've had pooris are also wrong- I will be sure to let them know they've been eating the wrong thing their lives too and calling it a poori mistakenly.   Now, the fish curry, it's $10, that's fine, but giving me only HALF a piece of fish for $10 is NOT fine. In fact, it is highway robbery.   Needless to say, I will not be coming back here."}
{"text":"Don't be mislead by outside appearance, I was kinda hesitating to eat there but the food was awesome and beyond expectation! the price is modest. Best chicken tikka masala I have ever had!! I gave 4 star only because of poor service."}
{"text":"The best indian food ever tasted in US. But my cooking is better. Try their special seafood desi style. On top of everything they give you free Gulab Jamun."}
{"text":"So I was in a hurry when a friend and I decided to order take out buffet from this place.  We were informed that the cost was $5/lb. Well, my friend filled her box and I got about half a box.  He charged us the same:  9.00 bux.  He claimed that each was at least 2lbs just by lifting each (perhaps with the $2 can of soda it was), but he was only charging us for 1.5 lbs.  Last I checked, 1.5 x 5.00 is 7.50.  Not 9 bux.  I let it go because I had to rush back to work.    I called them back to inform them that this practice was unacceptable.  I was grossly overcharged (my food did not even equal a pound).  The manager's response:  you can go to another buffet.  Will do.  I'll be sure that everyone I know does as well."}
{"text":"After living several different places on the east coast, I became accustomed to good indian food. However, I had yet to find a good place in Pittsburgh...until now. I tried Bangal Kabab house based off of other yelp reviews. I ordered takeout, and I was somewhat skeptical given that the restaurant was so small and there were only a few customers. However, the staff was extremely courteous, and my food was ready when I arrived.  Upon opening the food when I got home, the food looked okay, nothing extraordinary. I ordered vegetable samosas and chicken tikka masala. The masala looked a little greasy. However, once I tasted the food, my skepticism vanished. The samosas were probably the best I have ever had, and the chicken tikka masala, although slightly different from other tikka masalas I have had, was extremely flavorful and delicious. I could have eaten all day. I really enjoyed this place; definitely the best I have found in Pittsburgh. I will keep going back!"}
{"text":"Excellent food quality.  Authentic Indian food.  A place, I'd recommend any day for a great Indian Meal.  The Garlic naan and Daal Makhani were simply awesome.  The waiter also offer us a complimentary Mango Lassi as they were running out of Sweet Lassi.  The Sweet Lassi is great too.    I was skeptical at first about the quality of food.  But the ambience, the taste and the overall experience was better than most Indian restaurants in the city. I'll definitely recommend this place and come back soon."}
{"text":"I would give this place a 4-1/2 stars because the quality of food was excellent for its price.    Our entire family enjoys Indian food so we try to have it everywhere we go and we've had some great and terrible Indian food.  We ordered from Bengal's for delivery, our staples: Chicken Tikka Marsala, Chicken Vindaloo, Lamb Saag and garlic naan.  Every dish was delicious, authentic and piping hot.  I ordered medium spice and I would say it came 7/10 for my taste, so go for mild or extra mild if you do not enjoy heat.    The driver called and asked me to text him my address which I thought was smart, then he called when he arrived.  He was very prompt and courteous.  There was a $7 delivery charge to Shadyside."}
{"text":"Great food. Our waiter, Desi, was awesome.  Very nice and good looking.  He didn't know where the Bengal region was but that's ok."}
{"text":"I found this place by accident half a year ago and have been going regularly ever since. The food is extremely authentic and has large portions for its reasonable prices. Service is fast and the restaurant is overall very clean. Would highly recommend."}
{"text":"An old coworker had recommended this restaurant as the best Indian restaurant in Pittsburgh so I had to give it a try. My husband and I came here for their lunch buffet, which they offer daily for $9.99. Their buffet doesn't have a huge selection, but it was enough for us. We wanted to get a taste of varying dishes since we're not entirely too familiar with Indian cuisine. The selections had chicken tikka masala, chicken biryani, tandoori chicken, fish curry, mixed vegetables, of course naan and rice, and possibly a few other dishes I might be missing. I was very pleased with the taste of all the dishes. The chicken and fish dishes were not at all dry like we expected of buffet food. They were perfectly moist and the spice was mild. With an affordable price tag and good quality buffet food, we will definitely be back for our next Indian fix!"}
{"text":"We stopped in around 5:00 or 6:00 on a Monday evening, not exactly peak hours. The place was empty, but we were greeted very warmly.  The seating is cozy, and the decor is basic. There is Indian music and it's not too loud. So the ambiance is very simple (which is just fine!).  We ordered the Chicken Tikka (spice level 2) and the Chicken Vindaloo (spice level 7) with a side of naan. The wait was pretty quick, 10 or 20 minutes. The service was consistently friendly. And the food was DELICIOUS.  The spice levels were right on and the flavors were fabulous. The portions were fantastic for the price ($9 for what could easily be two meals worth of chicken vindaloo). And oh the fluffy, delicious naan!  At the end of our meal, we were given complimentary masala tea. I don't know if this is standard at all, but it was a nice touch to be sure.  In short, it was worth twice as much as we paid and definitely our new favorite Indian spot."}
{"text":"My daughter and I were in the area for a college tour. It was so cold that we didn't want to walk to go eat out. We found this restaurant on Yelp and it said they do deliveries! Good! So I called them and asked for delivery but they told me it's not available. What?? First I thought it was because it's too cold, but NO!!! The driver wasn't available. What?? But both our minds and tummies were so ready for Indian food, we just couldn't forget about it. So guess what? We walked 10 minutes in 9F weather. We're glad we did it!! The food was so warm and good - it made our body so warm from the inside out. Warm lentil soup, curry, chick peas...it was so good!! It was worth the walk in the cold weather! The flavor from Indian spice was perfect."}
{"text":"A friend and I stumbled upon this little gem while walking down Atwood. I saw that they had the $7 lunch buffet special so decided to give it a try. The place used to be a Burmese restaurant, but now remodeled completely. I wasn't really impressed by the décor though. They could've done more to embrace the Bangladeshi theme of the restaurant. The crystal chandeliers are pretty, but kind of out of place. Overall, the restaurant is well lit and clean. The service was phenomenal and the waiter even brought a basket of fresh naan to our table.  I really enjoyed the food! Unlike the Indian food I had before at other restaurants in Oakland, the flavors at Bangal Kabab is very crisp and defined. Each dish has a unique taste with great attention to details. The spiciness level is very low and tolerable so don't fear. There are a few vegetarian options at the buffet, but not enough. If you're a vegetarian, I recommend ordering vegetarian dishes straight from the menu instead of going to the buffet.  Overall, my experience at Bangal Kabab was great. Only $7 for all you can eat lunch! Can't beat that! I highly recommend this place if you're in the area. I will definitely return again in the near future!"}
{"text":"Do not order online! Excited by the reviews here, I placed an order on EatStreet. I arrived at the restaurant about 35 minutes after placing the order (the system quoted a 20min prep time). However, when I got there they did not recognize my name and tried to take a new order down. I finally noticed a ticket on the counter with my phone number on it, so I pointed to it. They then told me \"20 minutes\" and walked away. They had not even sent the order to the kitchen to be prepared! When I complained, they pointed to the fax machine and told me it was broken, and that they aren't taking online orders. Even so, their website and accounts are still active. A full hour after leaving work I got home with my food. I'd hate to see what happens with phone orders given how difficult it was to communicate when in person.  The food was actually pretty good, though that might have been influenced by my hunger after waiting so long. The biryani was definitely more Bangladeshi, which was really nice to have. I enjoyed the curry I ordered, though it was a bit thinner than I am used to. I would usually be happy to go back based on the food and prices. However, thanks to the abysmal customer service I won't be going back any time soon."}
{"text":"This is a great place. It always smells delicious when I walk past, so I went here (for the first time) on Valentine's Day with my boyfriend.  Location is small and the prices, like most South Asian food in Pittsburgh, is a little bit pricey - but those were my only negatives. We shared biryani and lamb saag with an order of garlic naan. Everything was well-prepared and the presentation was very appetizing (which is rarely the case with spinach dishes.)  The server was very kind and gave us two complimentary mango lassi after we had paid our bill.  I am happy that this place is finally getting on the map."}
{"text":"This place was smaller than I had expected but the food is still very tasty! I went for the lunch buffet and it was only $8.99. I was deceived by the sign outside because it says student discount of 15% but when I went to pay for the buffet they said the 15% off doesn't apply to the buffet. The food was very good however we only got water in the beginning and end of our meals (which isn't a lot considering the food can be salty/spicy at times) so it would've been nice if we had some more water throughout our meal. Also, there was only one waitress the entire time and there is a minimum of $10 when paying with credit card (which is hard when you're just going for lunch!)"}
{"text":"The $6.99 lunch buffet is an awesome deal, as the food was some of the best Indian we've had in Pittsburgh."}
{"text":"Wanted to grab Indian food takeout and found this place. AMAZING AMAZING FOOD. Had the chicken korma and chicken curry along with naan and chicken samosas. All were great."}
{"text":"I was in the area for a quick visit and wanted to see what the area had to offer in the way of Indian food and this restaurant did NOT disappoint!  Nestled just a few blocks off the Univ. of Pittsburgh's campus, this restaurant sits on a quiet, residential street. A bright red awning made it clear I had arrived.  When I first walked in around 7:00 on a Tuesday, I quickly made 2 observations: I was the only patron and it was small inside. I didn't let that phase me as I quickly grabbed a seat at a small 2-person table and ordered a mango lassi. There was a large TV showing a Bollywood movie on the front wall. The other walls were brightly painted and had few pictures.  My bright orange lassi was as expected: cold and full of flavor. I ordered the two-piece chicken samosa which came out golden brown and piping hot after 5-7 minutes. I used the three dipping sauces provided to add a little spice or sweetness. I never ordered samosa's before but they were tasty and were a great precursor to the rest of my meal.  For the main course, I settled on lamb vindaloo ordered with an average spice and a side order of naan. By this time, 2 families totaling about 8 people trickled in and took up half the seating by the front window. A single man who brought a bottle of wine sat near me in a booth.  My lamb vindaloo came out looking delicious and I could smell the aromatic flavors synonymous with Indian food. Basmati rice also came with the vindaloo. I had to remind my server of my naan order which he quickly brought out. It was hot and had several dribbles of butter on it.  I don't claim to be a connoisseur of Indian food but I have been to India before and been to 10-12 different Indian restaurants around the country so I have an idea of what to expect. Bengal Kabob House was second to none. The lamb and potatoes were tender to cut and the vindaloo flavors blended together amazingly well which left no doubt the food was authentic. Each bite went down easy and the spice and portion size was just right. I enjoyed a second mango lassi with my vindaloo. Throughout the night, the server was attentive but by no means overbearing.   The prices were very reasonable and they didn't charge me for my second mango lassi although I mentioned it was not on my bill. Very classy!  Overall, I had a great experience. I went with the expectation of eating a good Indian meal and walked away feeling completely satisfied. I would highly recommend this restaurant to anyone who wants an authentic Indian meal at prices even college students can afford!"}
{"text":"Fantastic food, questionable ambience: if it weren't so far away, I'd go all the time for dinner.   One caveat: I've only been for dinner; most of the complaining reviews seem to be about the lunch buffet.  The plus is that the food is delicious. A few of my friends who generally refuse to eat Indian food will eat here. The Indians I know, who are really not pushovers when it comes to food, love it. I'd recommend the biryanis, and I really like the bhindi masala. Curries are also good.  The minuses are what you expect from a place like this, so they really don't count.  Look, you're not going to take Ban Ki Moon here or have your wedding reception here.  -Hole in a wall decor -Service is fine, but not amazing"}
{"text":"I went here for my birthday great food I got the lamb vindaloo it tastes a bit cinnamon I also got naan bread it was great. The parking wasn't good because it's buy Pitt college but there's a parking garage a few blocks away"}
{"text":"small place but pretty good flavours. shrimp curry was good. naan was also good. decent and good enough."}
{"text":"I picked up Chicken Makhani and a garlic naan from here.. it was delicious and very close to how it should be (in my know-it-all opinion) .. :D .. I am going to try a bunch of more stuff on their menu and hope to enjoy it equally.."}
{"text":"I previously posted a negative review but would like to retract.  We had ordered through Foodler and never got our food the night it was ordered.  Anyway, the restaurant delivered our food with a full refund the following day.  The food was delicious!!!  I am so happy we got to try it.  I highly recommend Bengal."}
{"text":"A small and unassuming place.... but the food is amazing! I order the chicken madras every single time... and I have never been disappointed! It is my favorite Indian restaurant in Pittsburgh!"}
{"text":"Super authentic, absolutely incredible. Really enjoyed the chicken tikka and palak paneer. Would definitely recommend!!"}
{"text":"This is authentic, delicious Bangladeshi food from the Indian subcontinent. The biryani and lamb kebabs are a must. Vegetable/non-meat dishes were okay not great but the meat dishes are what gets one raving. 1 star deducted because it is a tiny place and gets very warm and stuffy. Especially when the weather is nicer, it would be pretty uncomfortable. Good for trying out several new items. Their buffet has more items than other places and is worth it."}
{"text":"Absolutely fabulous! First day we tried a couple of items to sample, both were excellent, which made us return within a week. And on the second occasion, it was even more delicious. The goat biriyani is a must try, the naan was amazing, so was the malai kofta. We liked the complimentary papad in the beginning. It was our anniversary dinner and the quality of the food was perfect for the occasion. The only downside is probably the location, which becomes lonely at night. Apart from that, all are 5 stars! A very authentic eastern Indian / Bangladeshi food. Highly recommended."}
{"text":"First time trying out their lunch buffet. Great vegetarian selection, but I was a little disappointed in the meat selection. Great pakoras, and good naan. We've enjoyed their take out several times before. I highly recommend the chicken malai kebabs as well as the mulligatawny soup. My husband is a big fan of their tandoori selections as well."}
{"text":"The kebabs and biryanis are delicious. Highly recommend the lunch buffet. You can adjust the spiciness to your taste. Overall, it was a wonderful experience."}
{"text":"Stopped in yesterday for the buffet that everyone was raving about on here.  When we walked in neither the man behind the counter or the server sitting next to him could look up from their phones to acknowledge us. So we just helped ourselves. The food was room temperature and nothing I would eat again. Definitely not going back."}
{"text":"This is the best Indian food you can get in Pittsburgh. Yes, you heard it right, its better than Tamarind, Udupi and Yuva India. Me and a group of friends came to this place for dinner and we were ecstatic!  I ordered a chicken biryani, which was really fresh and properly cooked. They also serve great fish curries as its basically a bangaldeshi group of people running the restaurant. At the end of our meal we got free chai -- yes, free chai -- and this is real chai, not tea where you need to put creamer on top -- its real Indian chai.  The service was very kind and its the best food you can get around CMU or rather Pittsburgh. Not to forget that its not an expensive place at all!"}
{"text":"Cheap Indian lunch buffet. Food was alright although I do wish that they had more options for the diner to try."}
{"text":"Friendly staff Lip smacking curries  Best naan in town"}
{"text":"Best indian food on Pitt campus at the best price  so you can't really go wrong. Lunch buffet is a great deal. Inside is very clean. Don't let the unassuming exterior  stop you!"}
{"text":"The food here is great! I loved that the tandoori at the buffet was so moist. The service was good as well...I didn't give it a five star only because the tea could be brewed stronger :)"}
{"text":"Buffet is value town. There is also 10% student discount. All the entrees are good. Mango lassi for life."}
{"text":"As an Indian restaurant they have very few veg option as an vegetarian i didn't find any good option for it"}
{"text":"I came here for the lunch buffet on a Saturday. The restaurant is a little small so I imagine it might be crowded when its a weekday or something but when I went it was fine. I thought the food was very good. The items on the menu were all typical dishes from an Indian (Punjabi) buffet and I did not find anything that was specially Bangladeshi. I suppose this might be on the regular menu. Nevertheless I liked the quality, and it's definitely the best Indian buffet I have had in Pittsburgh. The staff is very courteous. I incorrectly assumed the masala tea at the register might be part of the meal, but they let me take a cup on exiting. I would visit again."}
{"text":"My girlfriend and I had been planning on going to an Indian restaurant nearby this establishment, though after finding out it was closed we walked a short distance and decided to try this place. It was just opening up for dinner, so the service getting the food was a little slow, though all other aspects of the service was immaculate. The food was delicious and the atmosphere was terrific. The prices for some menu items were a little high, though well worth it (in my opinion).  If you're in the mood for Indian food I suggest this place highly."}
{"text":"I had a fish curry that made me want to stand up and applause. Terrific, and so incredibly cheap. I spent thirteen dollars for a gutbuster of a meal. Also their chutneys are totally on point, you can tell when a restaurant is being lazy with the chutneys."}
{"text":"These guys serve great Biryani. The Chicken Biryani is honestly great. However I have some qualms about the Special Biryani and the Paneer Makhni. 1. Biryani is not supposed to contain random vegetables unless it is a vegetable biryani. And the special biryani has all kinds of vegetables. Thats weird. Please look into it. 2. The Paneer Makhni is terrible. The most terrible Paneer Makhni I have ever had. Not only its unbelievably sweet, I think they put in some sort of artificial flavor which makes it taste horribly bad.   Please work on them.  P.S : Biryani is also not supposed to contains Nuts/\"Badam\" unless you are putting chicken in a veg pulao. Authentic biryani is simple and aromatic."}
{"text":"(Dinner experience)   I passed this place by many many times. What drew me in initially was \"15% off dinner for students\"; sounds pretty good for a med student elbow deep with student loan ( I think I also hesitated initially because the prior restaurants  this area did not have best track records...) Anyways, It turns out that I have been missing out BIG time.   When you walk in, expect nothing from decor. This is south Oakland. No finger prints on the cup, and clean utensils, that's all I cared. I was greeted by the owner/server who was very kind and very attentive. He did not speak good English, but who cares when you know he cares. Items on the menu were pretty cheap for dinner (~10). I ordered chicken tikka malsala and fish curry. Both of them were excellent. I am no food critic but I've tried many meh indian food  (including \"Prince of...ehem\") and, there was something about the way they cook their dish that was different. I was very impressed esp with their tikka. Oh, I ordered spicy level 8 for tikka, 7 for fish curry. They were not spicy at all, and I didn't complain. This place has food thats a level above, and not one of your shitty college neighborhood food shacks.   This little joint made me a very happy person tonight. I will be back for lunch buffet or to try different menu for dinner many more times."}
{"text":"Had a lunch today in Bengal Kabab house. Buffet has probably fewer option than Tamarind. However, all the items were great and taste delicious. I will definitely visit here often."}
{"text":"Great food - spotty service  This is a fantastic hole-in-the wall type of place that I love. 8-9 tables and a waiter. Clean, but DIY.    Food - We had dinner - a la carte, not buffet. For apps we had the excellent veggie samosa - hot, freshly fried with lots of different vegetables in a bit of sauce. Some places put too much potato, but this was an excellent example. We ordered a second round.   The naan is excellent. Crispy, light and chewy with a ton of clarified butter.   For dinner we ordered the chicken tikka masala, lamb rogan josh, and chick peas. The server offered us spiced heat on a scale of 1-10. We chose 5 but it came out closer to 7 (in my opinion) so manage your selection accordingly.  The chicken was smoky and the tomato sauce nice and thick. The rogan josh had small chunks of lamb, and the brown sauce had a nice hint of ginger. Both of these standard-bearer dishes will not disappoint. The chick peas were unremarkable with a more watery sauce which was over spiced - closer to an 8.   When we ordered dinner we also ordered mango and salt lassi. For some reason the server didn't want to bring them during dinner - maybe I missed the memo that in Bangladesh they are to be consumed as dessert. After asking twice he did bring them after he had cleared our dishes. Not worth the wait. They were watery and the salt lassi was a sweet lassi which had been oversalted... Oh well.   So service, or maybe the culture of the place, and the fact that it is a hole in the wall, result in 4 stars. But stick with the standards and manage your expectations and it's a great indian meal in Pittsburgh."}
{"text":"Amazing food. Amazing host. Khub bhalo. We got the Mutton biriyani, which was amazing. Their complimentary papad is delicious with  the chutneys."}
{"text":"Its sooo rare i am impressed by indian places ( Im indian and i cook kickass indian food), but I was delighted with this one. My bf hadnt tried biryani before and I thought I would finally check that off the list. I am always hesitant to have him try indian food that i havent made him at home first. But something about this place just told me to try it. SOOO glad i did!  We ordered the chicken malai kabab and the lamb biryani. And we got the biryani at a spice level of 7 which was just right, spicy and flavorful, not just hot for the sake of hot.  There was plenty of meat in the biryani and even if there werent with the chicken we order there was no shortage of protein. The portions were so generous we had more then enough left over to have lunch the next da too. The grand total of the order was $25.66 which is highly reasonable consider it fed the two of us for two meals. And what delicious meals those were!!! If you are looking for seriously yummy indian food go to this tucked away little place ASAP!"}
{"text":"I visited with CM for lunch a week ago at 12:30.  I'm not a huge fan of buffets in general, but the positive reviews and word on the street convinced me to give this place a try.  CM was game, so we met there to enjoy some quality Indian cuisine.  As a regular at Prince of India, CM was impressed with the range of options available on the buffet, which put theirs to shame.  I was as well, with the caveat that, as Lauren B. mentioned, all the meat items were chicken-based.  While this wasn't too much of an issue for me, since I'm picky when it comes to meat, I can see how lovers of lamb and goat might find it off-putting, and even I would have appreciated the ability to try the fish curries that other reviewers speak highly of.  For a buffet, we felt that the quality of the food items was good, though nothing in particular stood out.  The only item I found lacking was the rice pudding like dish--but then again, I'm not a huge fan of rice pudding, anyway.  The price for the weekday lunch buffet is now $10--not $8, as it used to be.  As others have mentioned, the seating area is on the smaller side. It wasn't busy when we visited, however--perhaps because the word hasn't spread about this place yet?  At any rate, we were pleased with our experience here, and would return the next time we're hungry for Indian food at lunch."}
{"text":"There is very little bengali about this place... the menu is typically north indian.  We had to ask about which dish was authemtically from bengal and the waiter pointed to a fish curry.  It was OK.  The rest of the food is greasy.  I have no idea why this restaurant is ranked so high."}
{"text":"Went here for the lunch buffet recently and it is unbelievable how cheap this is. You can hardly get a decent meal in other restaurants for the same price. While I'll always miss the previous restaurant here (Burma Tokyo), the new owners did a nice job of renovating and sprucing the place up. Service was polite and friendly, and the buffet was set up nicely. There were not too many options, but it was enough variety to make the lunch worth it. Most items were okay, although there wasn't much chicken left in the curry. The goat was probably the best, and we finished with some sweet rice pudding. This place will probably have potential if they keep up the good service and food quality."}
{"text":"A truly unique Indian restaurant.. huge servings and really good food.. served by a Jamaican server with Native American playing on a video!   Quality of food is outstanding! Made to order! We had chicken makhni and lamb Korma.   In a college town this is a favorite place and now I know why!"}
{"text":"This place is the bomb.  I live right behind the place and go all the time for the buffet.  Favorite place in Pittsburgh to eat and the price is right too, $8 for all you can eat amazing food from 11 to 3.  If you live in Oakland and have not been here you are missing out big time.  Keep it up Abu."}
{"text":"I went there today for their buffet .......but I saw a worker clean off the buffet counter with his bare unwashed hands and throw the food particles that had been sitting on the counter back into to buffet food. I won't eat there again."}
{"text":"Fast forward couple of months, and I disappointed that Bangal Kabab has lost it's original charm. Went here recently for dinner, and the food tasted so much worse. The samosas were too oily, the chicken tikka  masala was not very flavorful. We decided to not go there again...  Original review: What a nice hole in the wall kind of Indian restaurant! Cheap, efficient and most importantly delicious! We have already been there twice in the past few weeks. The food is tasty and affordable. The samosas seemed to have been freshly made, and they tasted gorgeous! We tried the chicken curry, which was basically a simple chicken gravy, but was flavorful. The chicken makhani was excellent! Reminded me of dhaba style restaurants back home in India! The Biryani was delicious too, and oh, the nan is amazing! We are definitely going back there to try other dishes on the menu, and check out their desserts."}
{"text":"A small and limited buffet which lacked flavor. Many dishes like the cheese and peas curry tasted like it was old and reheated. Decor is nothing to speak of. In all, if you are super hungry and don't want to spend too much money, you could go here. Just don't expect flavorful food."}
{"text":"First time in Pittsburgh and found this place on Yelp. The Indian food was great we had the garlic naan bread - 1 of the best / chicken samosa very tasty / chicken tandoori very tender and tasty also.   Nice people and good service."}
{"text":"A decent lunch buffet in Oakland, but not as good as past memory.  - Small restaurant, with only a few trays of food. The food hasn't changed since I visited a year ago. Good if you like consistency, I guess? + Most of the trays are flavorful and cooked well. My favorite are the peas! Also, you can get your unlimited naan fix here.  - Not much to expect in the way of service... + ... but they're good at keeping your water glasses full, haha. I guess that's what's important here.  I think before when it was a newer buffet and a little cheaper, the limited variety seemed more reasonable. Even having only gone a handful of times, it feels repetitive. Still, it's a consistent option if you know that you want to eat a lot of Indian food to fill up! If I return, I'll give ordering off their menu a try.  (Extra notes: lunch buffet is about $11 with tax. Their credit card minimum is $10.)"}
{"text":"Delicious, affordable indian food. For 10 people, we ordered 6 dishes (that came with rice) and 4 orders of naan. We maybe could have ordered 1-2 more dishes, but we were super hungry.   The food was fresh and flavorful. We ordered the chicken tikka masala (2), lamb curry, lamb vindaloo, tandoori chicken and paneer tikka makni. The tandoori chicken was so flavorful!   We'll definitely come back for the lunch buffet. They also do delivery through grubhub!"}
{"text":"I almost cannot believe the price of this meal for what you get from it. Every dish, every single day is incredible. I love the tandoori chicken, chicken roast, and everything that they have to offer. If you're looking for an Indian/Bangal style buffet in Pittsburgh this is the one. The service is amazing also."}
{"text":"Came here for the lunch buffet- i had training for work in a hotel in Oakland. I saw the reviews here were astoundingly high- I had to come and check it out. I have a well developed pallet for Indian/Pakistani and all the food surrounding countries of this sort as my girlfriend is Pakistani and I have been trying authentic food for the last year or so.   Bengal Kebab was a decent experience i came alone for the buffet which was $10, the selection was not massive and the experience was not 5 star but this Bangladeshi restaurant was a good 3.5 stars - I will round up to be kind. They had an array of masalas and curries with a salad bar. I would give it a B for cleanliness and decor and a B+ for service as the guy running the restaurant always made sure I stayed full on water.   I didnt think to much of the dishes with chicken or the plain vegetable curries- there was one curry that really danced well with my taste buds it was the Moat Curry or something like that, it consisted of curry, sweet peas, and cubes of cheese (paneer) i believe. It was very good. I would imagine the dishes you get here when the lunch buffet is not active are much tastier.   It is halal if you are a abiding muslim, and it tastes pretty good.   I would return."}
{"text":"I have had delivery from here on three occasions. The food was amazing every single time! And what's even better? It was delivered on time! This is my go-to place for delectable Indian food while I'm in Pittsburgh. Can't go wrong here.   My only complaint: even when I made it clear that I was staying at a hotel, utensils and paper plates weren't provided. However, notice how this place still got five stars from me? The deliciousness of the food far outweighs the lack of proper utensils or even a plate."}
{"text":"One of the best $10 all you can eat lunch buffets I've been to. Don't miss the biryani."}
{"text":"Excellent Bangladeshi food with really courteous service. Must try the Goat Biryani, Rohu Fish Curry and Yellow Lentils (Tadka Dal)"}
{"text":"Definitely far from a 5 star..not sure why other yelpers have found this place to be worthy of a 5..  Came here with friends for a buffet..the spread was pretty ordinary..staff was pretty avg..taste wise no complaints though..but a 5 star is disappointing..  I would say this is a 3.5.."}
{"text":"I go weekly and the food is incredible. The staff are not the best with English, but they are friendly and they like to make conversation. The place is small and you might miss it if you're not searching, but it's easily the best Indian food in the area."}
{"text":"This place was SO SO SO SO good. My boyfriend and I came here because we wanted something cheap but good and this place sounded perfect. We got both the veggie and the chicken samosas- they were crispy and flaky and really flavorful. We also got a chick pea based appetizer ( can't remember the name, sorry...) and our (super sweet, super nice, lovely smile) waiter asked us how spicy we wanted it from 1-10. He asked that question for every dish, whixh was smart because my boyfriend can't do spicy food. We weren't too hungry so we debated if we should get entrees, but we decided to share a chicken tikka masala and some garlic naan. Their garlic naan melts in your mouth when you bite into it, and the chicken tikka masala was perfectly seasoned. It came with about two cups of steamed rice. We also both got mango lassis which were creamy and delicious, and at the end our waiter brought us two cups of complimentary masala tea. It was a perfect ending to a seriously perfect meal. I didn't even ask for honey or brown sugar instead of the white sugar, like I usually do, because our waiter was so kind that I didn't want to bother him. After our 10% student discount, all this food came up to a mere 27 dollars.   TL;DR   Please support this restaurant! They opened three months ago, have DELICIOUS food, are very cheap, and are super friendly."}
{"text":"Food from Buffet was good with variety. But the food was not hot, and some was slightly cold. the lady at the counter working was very rude. She was unfriendly, which mostly ruined the experience for us."}
{"text":"I come here all of the time. Excellent customer service. Comfortable dining area. Reasonably priced. The food is tasty. I've never ate something there that I did not like. Free Wifi...WHAT MORE CAN YOU ASK FOR?!"}
{"text":"Parking sucks; a restaurant shouldnt hope to make money and have customers if customers cant park: food was great"}
{"text":"Superb Biriyani! The chef is also very kind and friendly. Is not a stereotypical Indian restaurant with fancy settings. They do provide student discounts and take out. May not be ideal for fine dining but a great gastronomic experience"}
{"text":"This place is the bomb diggity. My roommate and I come here whenever we are in the mood for good food. Everyone is always so friendly! We especially come here for the kadak chai!"}
{"text":"While searching for dinner during our stay in Pittsburgh, we were lucky enough to happen across this little not-exactly-hidden gem on the University of Pittsburgh campus. Service was gracious and helpful, food was tasty and abundant. We got an order of (2) veggie samosas for our app - they hit the spot. And speaking of spots, the naan, ordered at our server's recommendation, hit the sweet spot. Our server (who may have also been the owner) lit up with pride when we praised our dishes - which we did, repeatedly. He clearly took considerable pride in his establishment, and rightly so. For entrees: the co-diner got the vegetarian aloo Gobi, and pronounced it among the best she'd ever had. I had a comparable reaction to my  goat korma. I always like to see a goat entree on a menu, but only rarely do. Here, I counted at least 4 goat entrees, prepared in a wide variety of styles.  All in all, a first-rate dining experience, made all the more welcome because it was so unexpected."}
{"text":"I have only ever been here for the lunch buffet, but I have out of the five other lunch buffets I have tried so far in Pittsburgh, this one is by far my favorite. I can't say much for the off-menu items, but as long as the buffet keeps putting out a tasty selection, that's what I'll be returning for, because it's hard to pick just one main dish!  The buffet always has naan, plain basmati rice, some kind of biryani, veggie pakoras, and tandoori chicken.  There is almost always chicken tikka masala, and chana masala (chickpeas). The rest of the selection changes a bit week by week...usually there is some kind of lentil dish and some kind of potato dish present, and then one more type of chicken. It's not the biggest selection, but I am usually a fan of every dish, so that's fine with me. The flavors of each dish tend to be quite strong, which I love, as many buffets seem to skimp on or water down the flavor of buffet items.  Nothing is every really that spicy, but that's how buffets usually are.  The ambiance is cozy - I don't know for sure, but it seems like it's just a family running the restaurant. The front door looks like the front door of my mom's house, and the inside has maybe 9-10 tables seating 2 or 4.  There is always just one waiter, and he keeps our water glasses full and clears plates as needed, so no complaints there. Sometimes there are Bollywood videos running on the TV at the front of the restaurant. I tend to enjoy them.  The dessert selection is meh for the buffet, but my obsession with Indian food is directed at curry, so that doesn't make a difference for me."}
{"text":"I went for their buffet lunch and everything was tasty and the lunch buffet was quite cheap. However, my one issue was that every single meat item was chicken! Would be nice to see at least one other type of meat dish, such as lamb or goat. I was also disappointed that they had no type of saag or paneer dish, though they did have a few vegetarian options. But I will try it again to see if they have other options next time. The seating area is quite small so it may be difficult to get a seat in busy times. Also the free tea doesn't apply for weekday lunch apparently but we did try the homemade chai at the end and it was quite good and authentic tasting."}
{"text":"I finally, FINALLY tried this place after seeing a bunch of 5 star reviews and hearing an over the top recommendation from my roommate. Since we have the same tastes, I decided to go ahead and make the trek down the grimey streets of South Oakland to find this place.  First things first, the place is tiny. As in, I'm only 5'5 and I felt like I had to duck into the doorway tiny. There was an extreme lack of extravagant Indian decor that I have come to know and love from other Indian restaurants in the area. The bright orange paint didn't feel as refined as the decor at Yuva Indian, but the place was spotless so I'll take that over ambiance any day.   Secondly, the service was just fine, but I don't expect much in the way of Asian buffets. As long as I get a hello and a refill on water when I need it I'm pretty much good to go. There was some cool music playing when I walked in and an Asian gentleman next to me was singing along to it, which only added to the ambiance in my book.   Lastly, for being a buffet, the food was excellent. I have never had such flavorful food from a buffet line before. Typically foreign dishes are watered down and bland on a buffet, but my goodness they tasted like they were all made to order. I tried some dishes that I thought I straight up didn't like because they've been so tasteless at other joints, but I enjoyed most of the vegetarian options here and was very very pleased the taste and texture of the meat dishes. I was seriously shocked.   In my opinion, the flavorful buffet puts this place world's ahead of anything offered elsewhere in the area. I may even place this spot over Tamarind due to the wider array of options. My only complaint is how warm the place was. It was a muggy day out and I felt there was no circulation in the dining room.   There is a $10 minimum charge rule and the place is DEFINITELY too small to accommodate large groups."}
{"text":"Ordered at 11:20 via Grub hub. Was suppose to be delivered at 12:20. Called at 12:30, driver wasn't there yet. Food arrived around 1. The takeout container had been sliced with a box cutter and placed back in the bag, so the mess went everywhere when I opened it. Don't order from here."}
{"text":"AYCE (all you can eat) lunch buffet for $9.99=happiness... As other reviews have pointed out, each dish has a very distinct delightful flavor and is very light in comparison to other curries from other Indian places. Perhaps it's a representation of a different region, one which does not use an abundance of ghee?  Parking is a pain but I don't feel like I can take away points for something beyond the restaurants control.  One of the things which stood out so favorably in my mind of this place is the young gentleman who was our server... He was attentive and provided one of the best dining experiences with his kindness and eagerness to make it a good dining experience for everyone there. He made me feel like I was a visitor in his home and he wanted to be the most hospitable and gracious host.  The tea in the end was the perfect ending to a wonderful meal."}
{"text":"As a person who can rarely turn down Indian food, we swing in here after grabbing some tacos next door at Las Palmas because we wanted to give it a try. They were anything but thrilled about us not wanting to do their buffet. After reluctantly giving us a menu, we split an appetizer because getting anything else would have been much more expensive than both of us getting the buffet (making it look like a good deal). It was good and flavorful, but not a 5 on the spicy scale like we asked for. I never really know how scale the food, especially with Indian, clearly I was very off.   I felt uncomfortable the whole time as if we were inconveniencing them despite being the only people in the restaurant. I really wish I had for my place to fix my Indian food craving (that happens way too often) but I will have to keep looking!"}
{"text":"BTW some other guests complained about the TV and Bollywood videos. They will happily turn the volume down or turn it off if you just ask. Sometimes we like it, sometimes not.   We've tried a couple of other Indian in town since my original review - this is still the best flavor. Well spiced and not too sweet."}
{"text":"Imagine the surprise of discovering a great place for Bengali food in Pittsburgh. This is a cozy little place on Atwood St. Staff was warm and recommended great dishes. I had the boneless lamb biriyani. Well cooked soft pieces of lamb in spicy rice with raisins. Raita (yogurt salt and cucumber pieces) on the side. Excellent meal. My friends ordered paneer and chicken tikka masala. Those tasted great too.   Overall a great cozy place for a quiet dinner. Biriyani is a must try. Staff is friendly and recommends the best of dishes."}
{"text":"Their biryani taste really good. I tried the veggie platter which comes with a samosa, panner bajji and pakados and it tasted hot and delicious. The only disadvantage to this place is the ambience and limited space which needs to be improved."}
{"text":"We stumbled upon this wonderful little Indian restaurant last night.  Although they do not advertise their restaurant as a byob, they allowed us to bring a bottle of wine and did not charge a corking feel.  The waiter was extremely attentive and helpful.  Everything that we ordered was cooked to perfection!  We started off with the chicken samosa and the garlic shrimp and they were both delicious.  We ordered the special bread basket which is a combination of three breads. All three of them were great; however, we particularly enjoyed the garlic naan. I ordered the shrimp tikka masala with a spice level of 3 and thought is was delicious, my husband ordered the lamb kadahai with a spice level of 4 and also loved it.  Our friends were also pleased with their choices. After dinner we shared the rice adding and the gulab jaman.  It was a perfect ending to a fabulous meal.  The biggest complement came from my husband who has been to India several times.  He said it was the most authentic Indian food he has experienced outside of India."}
{"text":"Very friendly employees! It was my friend's birthday and they gave everyone at the table a free dessert. I don't eat Indian food a lot but I thought it was very flavorful and delicious!"}
{"text":"The food here was richly flavored and delicious.  Totally satisfied a craving for Indian food my companion and I were having.  Chicken Tikka Masala, Chicken Madras, Goat Saag -- all very good (but don't believe the claim that the goat dish will be boneless meat).  We got take out, so hard to comment on the wait staff beyond this: they were very conscientious about asking about the spice level of the dishes, but otherwise they were a little puzzled-seeming, like they had ended up in this restaurant by accident.  Anyway, I would happily eat here again.  Recommended."}
{"text":"My first visit here was over the summer. I ordered the malai kofta and thought it was great. Overall, had a pretty good experience. However, my second visit here a few days ago wasn't as good as my first. This time, I came in with a friend for their lunch buffet. We walked in and stood there for 2-3 minutes because the only guy working was on the phone. We made awkward eye contact, but he didn't motion us to sit down or anything. Eventually, we just sat down. When he came over to pour us water, he didn't really speak to us. The food at the buffet was fine, except for the rice, which was dry and hardened and had clearly been left out for hours.  The interior is interesting. Most of it looks like a typical Indian restaurant: lots of colors (especially reds and oranges) and a TV screen playing a Bollywood film. The chandelier in the center of the restaurant is what threw me off. It is bright and gorgeous, giving the place a more lavish feel, but didn't really match the rest of the restaurant.   I think you're better off ordering from the menu here instead of doing the buffet. Their lunch buffet doesn't really stand out from other Indian lunch buffets in Oakland and service could be a lot better.   Taste | 3.5 Atmosphere | 3 Presentation | 3 Service | 2 OVERALL | 3"}
{"text":"Best Indian styled restaurant in Pittsburgh. Bangal styled food. Very fresh. Not overly sauced/oil dishes. Everything was delicious and fresh. The owners are very charming and very proud of their food.  I will make this a regular stop at least twice a month."}
{"text":"This small restaurant is a hidden gem. The menu is huge. The food is very flavorful and the portions are generous. We went on a Monday night for dinner and the service was very good. Since it's so small (maybe 8 tables) there were only 2-3 people working, but they were quite attentive to everyone in the restaurant. Would like to try the lunch buffet. We will definitely be back!"}
{"text":"When I compare this place to all the other places I have given 5 stars, I just wish I could give it 10 stars or something. Another gem I found through yelp. Although it had amazing reviews, me, my sister and brother in law were a lil skeptical as we were going for Indian Punjabi kinda food to a Bangladeshi place. But one review about the desserts being excellent, was enough to convince my brother in law, that this was the place. We reached around 3 ish. They still had the buffet. But chicken korma was a lil cold. The chef/ manager made fresh chicken korma for us and brought it to the table . How nice!  Each curry was delicious: LIP SMACKING! Every curry had a unique flavor. And the desserts, just perfect. And to add to it, the service was par excellence. I can't wait to to drive through Pittsburgh again so that I can eat here: this place took me and my sister down the memory lane to our most favorite eating joint back home in India.  So if you are in this area and feel like having some Indian, look no further: this is the place!!"}
{"text":"Food was excellent. We had samosa Chat then Shrimp tikka masala and vegetable  jalfrezi masala . We chose 5 out of 10 for our spice level, and it was perfect , though I did notice others around asking for only 2 or 3.  I guess we are seasoned Indian food tasters, being from the U.K. Highly recommend going here for fresh tasty food. The wait staff was very friendly, just wish they served an ice cold beer, had to make do with a diet Soda. Very reasonably priced too,"}
{"text":"I'm a true Bengali at heart (with Bangladeshi roots) and I can vouch for this place! I've been to this small and minimalistic place for lunch/dinner so many times that the server knows me now. Very welcoming service and fresh, palatable food. They start off by serving crispy papad (gram flour dough made thin and roasted in dry heat) which is a rarity in Indian restaurants. I love their goat biriyani which boasts of succulent bite-size meat pieces, aromatic spices, and garnishing of fried onions, almonds and raisins to die for! Their sizzling kababs are again a smooth blend of juicy chicken or meat with appropriate flavors in your mouth. My vegetarian friends have loved this place too. Their paneer and vegetable dishes give you decent number of options to choose from but definitely each one worth trying. Finally, you will want to end on a sweet note with their delicious rasmalai. Also, worth mentioning is their mango lassi. I've been coming to this place every time I visit the city even after moving out of Pittsburgh."}
{"text":"Came at 9:30 on a Thursday night and the restaurant was empty.  Felt bad but we were starving so we ate quickly and tipped heavy.  The food was outstanding!  Honestly the best Indian food I've ever had.  The Mulligitawney was fantastic and we were dipping our assorted naan in it!  Try the stuffed naan for a special treat.   We also had the beef Samosas and chicken vindaloo, both great.  There are a lot of Indian restaurants in Pittsburgh, this one stands out.  Highly recommended"}
{"text":"As someone who is 100% Bangladeshi, I can say with great confidence, that this place is fantastic. From their wonderful buffet to their food off the menu, this is as close to my mama's food as I will ever get in Pittsburgh.  The buffet contains your typical Indian fare, from Tandoori chicken to vegetable korma. Whenever my parents come to visit, I always bring them here and the owners of the restaurant treat them like royalty. We all converse in Bangla, discussing everything from politics to Bollywood music. My mom was so comfortable that she went back to kitchen to talk to the cooks about cooking techniques!   As for the food off the menu, I once ordered the Fish Curry and it was SLAMMIN'. Perfectly spicy and most importantly, tasted like home. No fishy taste at all.   Decor could be less cheesy, I think. I wish they would put more items that embraced Bangladeshi culture, but that is a small price to pay for excellent service and great food.   Bottom line: I've always had a great time here, whether I'm eating their buffet or food of their menu. I highly recommend this spot if you want to try some authentic Bangladeshi cuisine!"}
{"text":"This is the best Indian restaurant I've found so far in Pittsburgh.. And I've been trying different places since the past 6 months. I absolutely loved the Chicken Makhani, the Biryani and the Tandoori Chicken.. It was all yumm! I felt it was just the right level of spice and flavor for an Indian meal! The choice of music in the restaurant wasn't too good, but the food made up for it! So yes, I would go to Bangal Kabab again and would recommend others to do so too!"}
{"text":"I ate Goat haleem and biryani. The haleem doesn't taste like the hyderabadi one, but in the US considering it isn't easily available, I am satisfied. The chicken biryani and Bengal special biryani are good."}
{"text":"Weirdest, most frightening restaurant experience I have ever had.  There were tiny shards of glass in my mango lassi! (Details below.)  Came around 4 and was the only patron.  The buffet looked like it had been there all day, not a god sign.  Lady with baby took my order for samosas, chicken korma, another chicken dish and naan.  I paid, and she told me it would take 20 minutes.  I came back half an hour later and had to wait another 15 minutes at least.  The two staff who were there with their baby were super nice (the lady even brought me complimentary tea), so I waited patiently.  Several hours later when I got home (70 miles away), I was surprised to find my chicken korma was in the form of whole bone-in chicken thighs!  In all my years of eating Indian food, this was a first.  The chicken dishes, which I ordered 8/10 spice level, were totally bland.  But even this I could overlook, as the naan and samosas were fine.  What I can't overlook were the glass shards I found in my \"to go\" lassi (which was packed in a plastic food container that I also did not open until several hours later, as I left it to chill in the fridge when I got home).  HOW DOES GLASS-- A LOT OF GLASS-- END UP IN A DRINK???  By the time I called the restaurant,  there was no answer on the other end, so I could not even ask.  I just hope what I drank on my first sip does not cause me serious harm.  Tomorrow I will call to see what possible explanation they could possibly have."}
