{"text":"Love their pho, best on or off campus. I still remember the first time I had it, I was stuffed to bursting but still had a bowl of that delicious broth left and I honestly felt guilty about throwing it out. The rest of Thai food is serviceable but I only come for the pho. 

Word of warning: in the cold winter months this place is FREEZING because of a combination of the heavy foot traffic leaving the doors constantly open and the location in the mini mall. The doors face right into the wind which is funneled right down that corridor like a wind tunnel.  The inside is also always cramped and packed though turnover is quick so tables tend to open up regularly. I would do takeout a lot more if it wasn't such a hassle for pho (multiple containers to separate the noodles/broth/garnish and you need a big Chinese soup bowl to put it in once you get where you're going). 

The folks behind the counter are great friendly but busy so don't expect a lot of chitchat at lunch rush. They do speak Thai and you will get major brownie points if you can summon up a friendly sawat dee or kup kum krap/kah."}
{"text":"So convenient, as i live right above this place, but that doesn't add to my bias. This place is tasty."}
{"text":"This is my favorite Asian place on Green Street in Champaign. I love their daily special dinners for less than $7. You can't really beat the dinner specials on combined speed, value, and how delicious they are. My favorite is Friday's pad keemao. It's pretty spicy so be cautious if you're sensitive to that. You get to choose how spicy your dish is on a scale of 1-5. My friends who don't like spicy food get the chicken fried rice with no spice."}
{"text":"Finally, a good Thai restaurant on Green Street. It's a new place so all I've tried there was the Pad Thai with chicken. It was delicious (although some more peanuts would have been nice). The price on the Thai dishes is a little high (7-8 dollars) as that's like their premium menu, but they have a crazy cheap 5 dollar Chinese lunch menu. If the stuff on the Chinese menu tastes anywhere above average next time I go there, I'll be returning often. 

The classic Thai decor is pretty good as well, definitely a step up from the plain interior of places like Cravings. The 5 stars is because I was thoroughly surprised that a place on Green Street hit all the right notes."}
{"text":"I first went to Bangkok Thai a couple weeks ago after finding it on complete accident and I was the only one in there at lunch time. It's sad that there's no sign outside the building advertising it, because I'm sure if more students knew it was there they would go. My favorites are the chicken fried rice and pad thai. If you like spicy, this is the place to go."}
{"text":"I love Thai foods but this is the worst Thai I have ever had. The simple Pad Thai was tasteless with heavy sauce and no flavor."}
{"text":"Went to the new location today on Cunningham. Dedicated parking and they had silverware. This is a plus when eating with little ones. 

Staff was extremely friendly to our kids. 

Food and service was great. We ordered chicken satay (chicken on a stick) ,spring rolls, Pas se ew, and cashew chicken. Everything was excellent. 

Hope this location continues to draw a crowd."}
{"text":"I go there every week for the Pad Kee Mao.

It's the best Thai food on campus by far."}
{"text":"Yellow curry meets expectations!!! The spice meter is super cool and fun! #wouldeatagain"}
{"text":"This review is for Bangkok Thai:
Good place for a quick meal. At one point, I ate here more than 3 times a week. It is not the best Thai food I've had but a great place to eat at in between classes and otherwise for a good & inexpensive meal. 

My favorites are the yellow curry and the fried rice!"}
{"text":"Really, really good pho and pad thai. The daily specials are spot on. I just get annoyed coming to green street because there is nowhere to park, but if you are a student and this doesn't matter definitely go here."}
{"text":"This place has pretty darn good fast food. They have a spiciness scale: 0 to 6 (hottest), and they ask you how spicey you want your food. If you really enjoy spicey food, you'd probably enjoy level 3 or 4. This is pretty useful, compared to what most places do, which is just to have a little chile pepper next to the menu item."}
{"text":"Ate dinner here for the first time on a Monday night. It was not very busy. I imagine it was due to it being spring break but it was my first time in the area. My husband was with me and we both ordered the pho tai, the daily special which was fried rice (we ordered chicken fried rice), and an order of crispy egg rolls. The ordering process is you place your order, seat yourself if dining in, and pick up your order at counter when ready. They have pitcher of waters along with self serve of cups and plastic ware. I was not impressed with the pho broth. It had hints of spices but was bland. It tasted like the pho powder mix that is available in Asian stores. I would have liked just a little more noodles and more chiles. The crispy egg rolls tasted overwhelmingly like an onion ring. I believe that was due to them being fried in grease that had been frying onions. The chicken fried rice was tasty but wasn't unique from other restaurants. I did not try any Thai dishes. Maybe the Thai dishes are what all the good reviews for this restaurant are based because the pho fell short for us."}
{"text":"Some of the best Pho I have ever had, and I tried in LA, Denver , Chicago , etc. They had duck soup in pho and my wife was very happy. We have found a great place to eat after Illinois football games"}
{"text":"The Good:
-Food is pretty good, has decent flavor. 
-The food comes out very quickly, maybe 5 minutes from order to food. 

The Meh:
-The egg rolls were just okay. They had glass noodles in them, a little carrot, and some cabbage. Nothing special. 

The Bad:
-Unless you get a lunch special, it's pretty expensive for what it it is. We ordered the Pad Se-Ew, which comes with meat (we had chicken), wide noodles, egg, and broccoli. While it had an okay amount of broccoli, it definitely could have used more. Plus, the entree is $8.95, which is, again, high for what you get. That being said, the entree was more than enough for my fiancé and I, so really only about $4.50/person. 

Overall, I'd return again, but on a weekday so I can take advantage of the specials."}
{"text":"My score is 3/5 for the quality of the food, and an extra star for the price and how fast the food arrives. I work just off campus and come here at least twice a week for the daily $5 lunch specials. This place is very popular among students, so I try to come before 12 or after 1 if possible to avoid the crowds."}
{"text":"I have been this restaurant many times for a few years and satisfied with the food there so far. But the service recently is not very good after the clerk was changed to a new person. For example, the clerk didn't say sorry when she served food that I didn't order and I wanted the clerk to serve what I ordered. Even the clerk showed irritation at me when I asked about whether the prices of two dishes are same. Oh man, this is one of the most terrible experience I experienced in this town."}
{"text":"Worst staff ever. Extremely rude. I ordered simple friend rice from here and got a throat infection. Unhygienic and filthy kitchen area. The oil they use looks old and dirty. Don't go here at all"}
{"text":"I know very little about this type of cuisine, but boy is it relaxing to slowly enjoy a big bowl of pho."}
{"text":"Pad Thai was too salty, and it wasn't tasty..
The table was too small so we were uncomfortable to eat."}
{"text":"New and great place. The owners are very friendly and the service is pretty quick. The Pho and Panang Curry are my favorites here."}
{"text":"Ordered Shrimp Pad Thai. It tasted really sweet and refreshing. If you're into sweet food, you'll definitely love it."}
{"text":"This is probably my favorite restaurant on campus. I'm a big fan of spicy food, which is why Thai, Mexican and Indian are my favorite cuisines, and as a college student, having large portions of spicy food at a low price is a godsend. They have $5 lunch specials, the best ones being the Pad Kee Mao on Fridays and the Yellow Curry on Thursdays. For vegetarians, you can basically make any dish vegetarian by adding tofu instead of meat, and the Oriental Vegetables/Tofu dish is fantastic. While I've had meh experiences with their pad kee mao the last two times I've eaten here, I'm assuming it's more of an aberration than a trend."}
{"text":"I love this place. Honestly probably go here the most on campus.  I can't say anything about it being authentic because it's the only thai place I've been to but I think it's amazing. I love their specials during lunch and dinner. Such a good deal and I like basically all of them. The owners are so nice too. I think my favorite is the yellow curry which is on special on Thursdays. I think the fact that it's always busy shows how much other people like it too. I usually get take out just because but the when I eat there the tables are always clean and I think the rice portion is bigger.  This is a put your dish in the bin place but for the cheap price I don't mind. Also love the little turtles in the back! I'm gonna miss this place when I graduate."}
{"text":"I love Thai food, but this was literally the worst I've ever had.  I had the chicken pad Thai, it was totally flavorless.  There were no vegetables and hardly any peanuts.  It didn't even come with a lime.  If you're looking for a cheap lunch then maybe this place is a good idea.  But if you're looking for good Thai food, avoid."}
{"text":"Like other reviewers have mentioned, Bangkok Thai has a 5 dollar lunch special for every weekday with massive two meal servings. However, thats the end of the positive things I have to say about this place. I have noticed that their spice levels are very inconsistent. I have ordered a spicy 6 (the highest level) and received a dish with no spice at all. Additionally, the food is almost always extremely oily."}
{"text":"Pho Tai :D
The broth: Great, not too sweet or heavily spiced.
Meat: They drop it in right at the last minute when packing up your soup to go, so it's fresh. There is a decent portion of it. Definitely way more noodles than meat, but it's ehough to make me happy.
The vegetables: sprouts, green onion, lime, and a big portion of noodles. No thai basil included, you can ask them to add some on the side.

I recommend taking it to go, coming home, and pouring everything into one of your own big bowls at home for a more cozy feeling than eating in the restaurant which is a little divey (although cute with the turtle tank in the back and the beachy looking awning). I also snuck a little of my brother's pad thai (I'm dieting, ho hum) and it was delicious."}
{"text":"Come here for a quickly prepared, delicious meal. I've been here a few times, and I am a fan of their pad see ew, curries, and pho. However, I think that while the pho broth has good flavor, it is also heavily garlicky, so I would recommend adding more sriracha or lime juice to counterbalance the flavor if you're not a big fan of garlic. In general, it's not the best Southeast Asian food I've had (I grew up in New York City), but it holds its own. The cons are that the ambiance is lacking and the thai iced tea comes in a bottle instead of being made from scratch.

Daily specials ($4.99 lunch and $5.99 dinner) as of today are:
Monday - Pad Thai
Tuesday - Fried Rice
Wednesday - Basil Chicken
Thursday - Yellow Curry
Friday - Pad Ke Mao"}
{"text":"This is my go to place for thai. 
I can't review everything on the menu because I only get noodles (pad sewee, pad kee Mao or pad thai)... What can I say, I'm a creature of habit... 
The food that I have gotten is so good, I have to stay away for my health's sake.  

Be warned that even the \"1\" is spicy and the \"2\" is too spicy for my taste, but maybe I'm a whimp. 

The daily specials are 4.99 for lunch. I do wish they would mix it up.

The low cost comes from having no waiters, so you clean up after yourself. Is often crowded for dinner but not too bad for lunch. 

This isn't a date night place. It's a dinner with friends place that's full of students.
For a nice sit-down thai dinner that is also delicious try Siam Terrace (but of course it's more pricey, ~$10-15)"}
{"text":"This place is so so. Ordered the Panang curry with shrimp and all that was prepared was tiny shrimps in a bowl of curry with no veggies of any sort and served with a bowl of rice. Come on man??!!! WTH?!? Not even worth it!!! Also ordered the Pad See Ew and that was too salty and not enough noodles or meat. Tried to order a home made or made from scratch Thai iced tea and was referred to a can version of it! No thanks! And why would a Thai restaurant have pho on their menu??!!! Stick to your own cuisine and perfect that! Needless to say, pho isn't all that either. Everything there is over priced for mediocre food. Students beware! They think you don't care or know any better since you're college students! 
On the bright side, the fried rice was decent."}
{"text":"I'm not a fan of their seating arrangement on the inside, but their delicious pho makes up for it."}
{"text":"Delicious food & ample serving & reasonable price. I tried red curry with tofu, the cold spring rolls."}
{"text":"Having had many phonomenal phos before, this place does not measure up.

I had the P1 Pho, the broth was okay while the noodles were overcooked. They give out side of bean sprouts , but lacked the mint and other herbs. 

I also tried their yellow curry; unfortunately, it was so salty, eating it with rice did not help dilute the salt.

If you have an emergency pho craving, this place will do that, but don't expect anything spectacular."}
{"text":"This is the first place I have ever gone and gotten pho and they were the ones that got me into it. It is salty and full of acid because of the extra limes that I add.  When I am done with the meal I don't feel like I'm painfully full and mad at myself for eating too much which is always a plus. However, they are not very friendly when it comes to a little customazation. I enjoy have just the broth and then their noodles and bean sprouts on the side. 

I don't like the meat or vegetables that come with the broth and it just wastes space. I try to ask for just the broth everything and they never seem to quiet get it right. Maybe it's just a language barrier. If they were able to make it just the way I wanted it then I would have given it 5 stars. It's the only place on campus that has pho and I truly do enjoy it. 

I return a few times a month."}
{"text":"Love this place because the food is great and cheap. I came here often when I was still attending UofI. I often get the pho, pad thai, or fried rice. The broth of the pho is comparable to Tank in Chicago. For the pad thai and other noodle dish, you can pick your spicy level and the quantity is always large. Another thing I love about this place is that they have weekdays special; from monday to friday, you can order the special for about $6 and the quantity is still the regular amount. If you are too busy to cook and doesn't want to spend a lot of money, definitely check this place out."}
{"text":"Yummy. Tastes just like what I had in Vietnam, I mean pho. Fried tofu is pretty good. I like it a lot. High recommend it"}
{"text":"Honestly everytime I've eaten from here something bad happens. The first time I ate here i found a long black hair in the pho and wanted to throw up after seeing it. The second time when I ate here i immediately had stomach pains which I feel is due to the fact that the food is DIRTY. I really wanted to like this place but I'm never eating here again."}
{"text":"Came here at closing time.
The cashier was super friendly, and super nice.
We got our food fairly fast i'd say. The owner was nice to let us stay for a while and to also order more!
The food was not bad for a small town. 
Portions were not too big, and price was okay!"}
{"text":"This is probably the worst Thai food place I ve ever been to. Their service it's alright but the tastes..... Is disgusting....... I honestly don't understand why there is 4 star for the restaurant..."}
{"text":"Some of the best pho you can get on campus. Go during lunch time for cheaper prices. Don't forget to look at the special of day for added discounts. Flavor-wise, the broth is pretty authentic. I find their tripe a bit hard and chewy sometimes, but the beef balls and other meat is done really well. 

So...sounds pretty good, right? Well, everything's great until you see the price tag. In Vietnam, you can buy an amazing, overflowing bowl of pho for, get this, $1. Yep. Here, it verges from $6-9. Given that it's the only place on campus though, I would collect those dollars together, my friends. This place is totally worth that added hole in your wallet, at least once a month."}
{"text":"A good amount of tasty pad tai for a cheap price. I have a low tolerance for spicy food so the 3 out of 6 on the spicy scale was a little too much, but the 2 was perfect. However, If you happen to get it too spicy, relieving jugs of ice cold water are plentiful due to a woman constantly on staff, posting up, and refilling the jugs."}
{"text":"Best Thai food in Champaign! It's pretty hidden in regards to street view and I wish I had tried it sooner. 

Hands down the best Pad Thai I've ever had. Fair warning though, regarding the spice scale they really mean it. Spicy means SPICY! The Pad See Ewe is also really good. This is a great place to go if you're looking for a moderately priced meal and leftovers for later (the portions are HUGE)."}
{"text":"You can't beat the 5$ lunch specials! Specially the yellow curry on Thursdays :) Plus the owners are really nice and warm!"}
{"text":"The absolute best Thai food I've ever had. The panang curry and pad Thai are on point. The prices are very fair for the portions you receive especially if you catch the lunch specials. Always a great experience here."}
{"text":"My boyfriend and I came here looking for good thai iced teas and good thai food. We got the xe lua pho and it was delicious. It wasn't as authentic as some viet places back in California but it definitely filled the missing void for pho that I had. My boyfriend ordered the pad kee mao. Omg it was phenomenal. Giant chunks of noodle with some veggies. We both thought it was great. The only downsides were the spring rolls had too much lettuce and they didn't have authentic thai iced teas (only ones that came in pre packaged bottles - which still tasted fine but not what we were looking for) 

All in all, great food. Good find but those disappointments were worth taking a star off for. Highly recommend!"}
{"text":"I love this little restaurant. It has basically every type of Thai food you want at a very reasonable price. It also has lunch special every day. They used to have a secret menu including duck noodle soup, I don't know if they still have it but it's worth a try asking. I love that duck noodle soup."}
{"text":"Having been to almost every asian restaurant around champaign-urbana, I must say that bangkok thai is both my favorite and the place i frequent the most.  The pho is unbelievable. I go here more than twice a week for lunch.  Basically this place is super cheap, has great quality food, is at a convenient location, and your food is always prepared quickly."}
{"text":"The curry here is always on point and the food comes out super fast even when there's a long line. Their pad thai and pad kee mao are also good. The man at the counter is super courteous and friendly."}
{"text":"Some of the best quality food in Champaign. Wide variety of great tasting food. Very fast and helpful service. If you have any questions about the menu everyone is very knowledgeable and helpful. Always a good experience."}
{"text":"I love going to this place! The man who works there is such a nice guy and always remembers you!  Whatever you order, he'll ask you to rate a 1-5 for spiciness and it is always just right!  Their Pad Thai is delicious and is my favorite. My boyfriend and I are able to split the Pad Thai, making it a perfect portion size for two.  The Pho is delicious but I think it is overpriced.  They have good lunch specials each day so check them out.  Definitely best  Thai food on Green!"}
{"text":"The best Thai food I've ever had. The quality and quantity are more than enough for the price value, and this is my go-to in Champaign.

I would recommend starting off with spice level 2/3, and working your way up if you decide to come back. The pad see ew, pad thai, mussaman curry, and red curry are my personal favorites."}
{"text":"I ate pho here everytime and it is really delicious! The owner is super friendly, too!"}
{"text":"This place is a campus essential. They offer the perfect blend of quality, convenience, college pricing, and speed. Every weekday there is a different special: $5.99 for Lunch and $6.99 for Dinner. All the 5 specials are excellent but I'm a sucker for the Thursday special, Yellow Curry. Don't take their pho for granted, either. Most people opt for the lunch special throughout the week but if you're looking for a classic soup dish, their pho is excellent and authentically made."}
{"text":"Bankok Thai is such a hidden treasure! It's hidden in that little nook on the corner of Fifth and Green Street. It's in the location across from where Bombay Grill used to be. 

The staff is very friendly and are very welcoming! Whenever I go in or even call in, I'm always greeted by a happy face or a happy \"Hello!\"

The pho here is awesome! I always order the beef pho and it never disappoints. It's around $9-$10 for any pho and they give you a heaping plate full of additions! The broth, noodles and bean sprouts are more than enough to make you feel full and satisfied when you're done. 

Bon appétit, friends!"}
{"text":"Amazing phoo, but I had the lava beef, 5 different peppers. If you like hot hot this is the dish. So good."}
{"text":"SO LISTEN UP PEEPS!! THE REVIEWS ON HERE ARE OLD! i recently went here last week and NO THEY DO NOT HAVE DAILY SPECIALS AT ALL!! i thought maybe he misheard me and asked him almost 3 times as well as another employee...they DON'T have daily specials at all, which is kind of disappointing because based on the other reviews, it seemed like a sweet deal. i bought the chicken pad thai to go..and omg they give u huge portions!! it was too much for 1 person, it was a little dry and bland...ive had better pad thai..and they didn't include a lot of the peanuts on top but overall it was pretty good...probably won't be returning tho as its just a regular thai restaurant nothing special and no daily specials as previously quoted"}
{"text":"This is barely Thai food! The noodles they use is wrong! The taste is barely near the Thai taste. I won't come next time. It is overrated."}
{"text":"The pad kee mao dish here is a must try for first timers! Besides they provide a spice level for all the dishes and if you love spicy and hot food definitely go for level 5! The Thai curries served here are also of great quality. And all this at a cheap price!"}
{"text":"Dirty, overpriced and untasty. 
My pho tasted like one big bowl of OLD salt water.  Very little meat, no thai basil.  Honestly, the worse bowl of Pho I've ever tried (couldn't bring myself to do it) to eat. 
My dinner partners fried rice was oily with no veggies and little meat. 
Our soft drinks which were listed as \"free refills\" for $1.75 were given to us in 12oz cans, with no refills available. 
Our appetizer sampler only contained 1/2 of what it was listed to have. 
We had chosen to eat there, but all the tables were filthy. Even though there were only two other tables eating at the time we were there no employees choose to take advantage of the lull for some cleaning.. 
No thank you yelp community. You missed the mark on this one."}
{"text":"Me & one other person ordered their red curry yesterday & have horrendous food poisoning now. They made the food extremely spicy to cover up the raw/old chicken they used. I would not recommend eating here until after they pass a food inspection..."}
{"text":"If you've had great Thai food elsewhere, you will probably as disappointed as I was. Ordered Pad Woon Sen, a favorite of mine, and was underwhelmed. The spice level was good, but it was overly oily, very short on vegetable content, and the veggies that were there had the appearance of bagged frozen veggies. The egg rolls tasted like they'd spent too much time in a deep fryer, and the Tom Kha soup had an unusually funky aroma. The food was fairly quick to come up, and the free Jasmine tea was a nice touch, but neither make up for the food quality."}
{"text":"While i love Good Chicken Pad Thai and want to love their's here, i have to rate it 3rd or 4th in CU.  #1 is Golden Wok and #1a is Tharra Thai.

Now that being said, i've never had a better order of PHO than here.  Will never go anywhere else if i can help it.  Wish they were open later..."}
{"text":"I'm not sure if this restaurant is related to the Bangkok Thai in Savoy, but I think this location on Green St. in Campustown is a lot better than the Savoy location.  This is located in the little plaza on Green and Fifth.   You place your order at the window and in about 5 minutes, they call out your order and you go pick it up.  So there's no waiter service.   I ordered the Pho with rare flank steak and it was the most authentic I've had in the area.  Yes, it beats out Xinh Xinh by a LONG SHOT.   I also ordered an egg roll --- it wasn't great but it hits the spot if you need an egg roll fix.  It's more like a Chinese egg roll than those fried Vietnamese spring rolls which I was hoping that this was.... but alas.   The soup on the other hand, was delicious.  The noodles were the right texture, the beef was tender (although I wish they put more in) and the accompanying bean sprouts, jalapeno, lime made everything taste better!!  I love this place and will definitely be back now that I know that there is close-to authentic pho in Champaign now.

They do have an extensive Thai menu as well, but I would stick with the Pho.  I saw lots of other customers who had various Thai noodle dishes who seemed happy.  The only drawback to this place is that it is in Campustown."}
{"text":"I tried the Thai food here and it was amazing! Their menu is huge and can be daunting to order from, especially since the kitchen is really fast paced and the cooks are constantly taking orders / yelling out numbers. You can pick anything from their menu and adjust the spice level based on their number system.

I decided to get a pad thai and a Thai curry. I asked for the pad thai to be nonspicy but I wish I asked for a spice level of 2. After trying a slightly more spicy pad thai, I found that the spice really does bring an extra level of flavor to the noodles. Even though I ended up flavoring my dish with sriracha, the pad thai here is one of the best pad thai I've ever had. I've never successfully made pad thai myself so I always find it amazing when a restaurant gets it right. Each element of the dish was really perfect - the noodles were cooked perfectly and soaked up just the right amount of flavor. It had a really great balance of peanut to egg to protein. My pad thai was definitely a bit sweeter because I didn't add spice. If you can handle just a bit of spicy, like me, I would recommend a spice level of 3. The curry I ordered was rich in flavor as well. I don't think it was the best Thai curry I've ever had but it was pretty decent. 

The interior can get a bit hectic, especially if the restaurant is busy. You have to order yourself, seat yourself, pour yourself water, and put your own dirty dishes away. This can be chaotic if the inside is packed with people. Our table was a little dirty when we sat down - we had to clean in ourselves. Since the place was pretty full, our food took about 15min to prepare. 

Overall, delicious Thai food that is perfect for cheap cravings. Ordering to-go might be the better option for busy nights."}
{"text":"Tried the pad Thai ($8.95). Salty for my taste but not too bad. Quick and pretty generous portions. Lots if seating available. Very casual spot where you order at the counter and bus your own table."}
{"text":"Definitely my favorite place in campus town to eat at. I was very hesitant to try it out for the first time about a year ago, but I fell in love with the food instantly. I am always craving good Thai/chinese food on campus and this is exactly the place to go to satisfy that. Haven't explored too much of the menu: I've tried pad kee Mao ( favorite), pad Thai, and chicken pad ped. Been a big fan of everything I've had, it's always very delicious and service is very fast."}
{"text":"This is one of the best Asian restaurants on campus, with a much higher quality to their food than most of the Chinese or other Thai restaurants on campus. They are also incredibly generous with portion sizes, and some people could feasibly split one dish into two separate meals if they wanted to. They can also customize each dish on spice level, as per customer preference. 
The daily specials are the most popular here. Each day has a daily special that is for $6 including tax, so it is a really good option for frugal college students.

Monday's daily special is the Pad Thai. This dish is quite nice, with a very flavorful and strong peanut flavor. It is not my preferred dish of choice on their menu, mainly because I don't like the strong peanut flavor as much as other people. However, I have many friends who claim it to be their favorite dish.

Tuesday's daily special is the Fried Rice, which I think is the best fried rice that you can find so close to campus. Honestly, it is immensely flavorful and downright delicious. Craving's Jakarta Fried Rice is a mess of oily, bland garbage compared to Bangkok Thai's fantastic fried rice. 

Wednesday's special is the Basil Chicken, which is my favorite dish on their menu. It's a very simple dish of chicken that is stir fried with whole basil leaves, dried chilies, and spices, but my god it is immensely juicy and flavorful. It also comes with rice. 

Thursday's special is Yellow Curry, which is also delicious. It's made from some coconut milk, onions, potatoes, and chicken or tofu, so if you hate coconut or coconut milk, I'd stay away from this dish. Otherwise, give it a shot, because it's really nice and filling. 

Friday's special is their most popular dish, the Pad Kee Mao. It's a bold, fiery, and flavorful dish made from thick noodles, bamboo shoots, and spring onions that gives any other noodle dish on campus a run for its money. It's my second favorite dish at Bangkok Thai. 

Overall, if you haven't been to Bangkok Thai yet, definitely check it out! It's many U of I students' favorite restaurant on campus, and is undoubtedly one of the best restaurants on campus."}
{"text":"The Pho here is amazing! It's so good and they give you so much that you end up having left overs. The food comes out really fast also! A good place if your hungry and you want your food fast!"}
{"text":"I am always on the hunt for some good Thai, especially the Pad Thai! 

In all my travels I don't know if I've stumbled upon such good Pad Thai at such an affordable price. The portions were larger, and the service quick. 

It wasn't much of a place to go for ambiance, but if you're wanting good Thai, this place is a must!"}
{"text":"Great flavor and excellent value for the price. Quick, easy, satisfying. Highly recommend the massaman curry with tofu. The bite I stole of my friend's pad thai with chicken was great, too!"}
{"text":"I got the pho combination (P1), and It taste alright. It's not authentic pho, and there was no basil with it."}
{"text":"I have been on campus for nearly a year and just discovered this place and am disappointed about that.  It would be easy to miss if you walk casually down Green Street between 4th and 5th.  I only discovered it thanks to a Yelp search. I had the Pad Thai, which was amazing and relatively cheap.  

They give you 6 options in regards to heat on your dish (1 being the least and 6 being the hottest).  I like hot food, but refrained from going with a 6 (the hottest on the 1-6 scale).  I decided to only try a 4.  I found the 4 to be good and have a nice subtle heat that blended well with the other flavors.  I will probably give a 5 or 6 a try the next time. 

 The servings are enormous.  I am a big guy and half a serving filled me up.  Needless to say I have another meal sitting in my refrigerator. 

As others have said the owner is extremely nice and has a great sense of humor.  The decor of the place is lacking, but that is not a factor for me as I only rate a restaurant based on the food.  If you want great Pad Thai then this is the place to go.  I will be trying some of their other dishes in the future and possibly update this post."}
{"text":"Love these guys. Friendly cashiers - especially if you get to talk to the owner, who is often in. A wide variety of options, of which I've only had a few, but I've enjoyed what I've had so far, and much better than many other Asian restaurants (of various cultures) on campus. There's more food than I can ever eat and it reheats well, leaving me with an extra meal (or at least a snack). They recently opened an Urbana location, if you don't feel like coming to campus to experience their greatness."}
{"text":"I love the Pad Thai! Quick service and happy employees. I typically carry out, but it is always filled with diners when I'm there, so you can't go wrong either way."}
{"text":"I love this place! It always hits he spot on a cold day, or when you need a light meal that really satisfies. I recommend the P1 pho - it's beef broth based, and includes every type of beef they offer in the broth. It comes with glass noodles, scallion, and sprouts and lime on the side. I also use sriracha and hoisin to spice it up. 

The atmosphere is generally quiet, so it's a great place to get work done on Sundays - they're open till 9pm."}
{"text":"I can't believe I changed this place to 4 stars after one bad incident. That was silly. I've since been regularly coming back up to 5 times a week (definitely my favorite place to eat on campus). Good hot food at a cheap price. The dream!

I've tried several other fishes besides the specials since then. Pad lard nar is AMAZING, probably my favorite. Seafood pad ped is really good too, although pretty expensive. As with most dishes here, the sauce makes it! If the dish comes with rice, make sure to mix them up for maximum flavor! Xe Lua is also the best pho, as it comes with all the meats. Why get anything else?

Note that it is SUPER BUSY from 12 to 1 and you might not get a seat.

Everyone on campus needs to try this place at least once."}
{"text":"I first went right after it opened a couple of years ago and have frequently returned. You can't go wrong with any of the best noodle dishes, especially the pad Thai on Mondays and pad kee Mao on Fridays when they are on special. The pho is also really good when  there aren't any specials I want"}
{"text":"Daily special is cheap and good taste! I used to eat there every night for a quick dinner."}
{"text":"Solid pad Thai. Only had a level 3 on the spice level which was a decent kick but I really should've gone higher. The lunch/dinner specials are amazing. If utilize those if I lived here. Pretty cheap as well. You serve yourself which is fine, and you get to take a pitcher of water your table. I would've liked non-styrofoam cups but that's ok. 

Solid food. Solid prices."}
{"text":"Best spicy thai food on campus by far. Everything on the menu is great."}
{"text":"First the not-that-great: 
1) The yellow curry. I love rich, fatty foods but even this dish is too oily for me. It leaves a film in my mouth. Their tasty fried tofu becomes utterly unappetizing when added to this grease reservoir. I think you have to be physically prepared to handle this dish. Save this for frigid winter nights when some ultra-savory soup would hit the spot.
2) The basil chicken. This dish is SICKENINGLY sweet. I have hardy teeth and this dish made them squeak. A lot of dark Asian sauces call for sugar but this is over the fucking top... It felt like I was drinking caramel or syrup. Never will I order this mistake again. The sugar masked the flavors in the dish as well.

Now, the phenomenal: $5.95 lunch specials. While Espresso is trying to hawk their shady sandwiches for $5 (some of their employees have admitted that they would not eat them), you must make your way over to Bangkok Thai. They have different specials for each day-- and they all rock. The portions are huge. Of the innumerable times I've dined in, I've yet to finish a dish alone, and that's truly remarkable because I have a fairly large appetite. While I don't think you can make 6 meals from 1, as another reviewer attested, 2 meals from 1 is a definite, 3 from 1 is probable if you're a light to moderate eater.. and 1 from 1 means you're probably kinda fat lol, you workout hard, you're tall, or you're just super hungry. At least for the pad kee mao which is about the same size as the alleged 6-in-1 dish.

The pad kee mao, by the way, is the olio of the gods. Something about the way those fat, soft sheets of rice noodle slide down your throat feels illicit. I got this dish for the first time (at another restaurant) on February 3, 2016. I remember the date because I was born again after the discovery. I was excited to find out that Bangkok's Friday special is... pad kee mao! Awesome! So now I get it here, though IIRC it does not taste as great as the other restaurant's, but for $5.95, your taste buds adjust lol. You have to try this dish if you haven't before.

Bangkok is not the best Thai food I've ever had, and the interior is kind of seedy (just the right amount though-- it goes well with the fast, hot, sinfully heavy food and the sizzling sound of garlic on grease). But you simply cannot beat the specials."}
{"text":"I eat here at least once every week. The food is delicious and affordable. I often get an entree and It serves as two full meals for me. If you really love spicy food, I recommend going with the 6 spice and adding sriracha (depending on the dish). Pad sewe and pad Thai are my personal favorites here."}
{"text":"For my junior and senior years at U of I, I think I went here about every Thursday I was down there. Thursday's lunch and dinner special is yellow curry, and it is unbelievable. It is $5.95 for lunch and $6.95 for dinner and you're going to have two meals out of it. It is quite the deal and quite delicious. 

Their specials change every day. They've got pad thai, pad kee mao, red/green curry, basil chicken, and many others. Definitely worth a visit."}
{"text":"Some of my favorite Thai on campus!
Really relaxed thai beachy feel on campus, and really great service.

The food has ways been great - the panang curry and pad thai are two of my favorites, huge portions too."}
{"text":"The red curry is really good (spice level 4). The self service is also very convenient."}
{"text":"After finally deciding on Thai for lunch we decided on Bangkok Thai restaurant at 410 East Green #3 in champagne. After driving around a bit we found a parking spot of the few quarters in and away we went. 

But there were plenty of room once about the chairs and tables I noticed right away after walk in that they had several plastic pitchers of ice cold water and so I grab 2 cups & a pitcher of water at the table.

We were going to chicken satay, but I was told they were out of it for the day.

So we ordered an order of eggrolls and order of spring rolls a bowl of Tom Kha Kai soup, Key pad lee mao chicken Panang curry chicken and Thai iced tea and a diet Pepsi which turned out to be Diet Coke.

The eggrolls and spring rolls were quite good, each of them had their own sauce and they accompanied it well.

The panang curry add a great flavor, or serve piping hot and what is ordered as a number #2 on the heat scale which turned out to be pretty mild. It was served with jasmine rice.

The pad Kee Mao was absolutely delicious!!
I asked for a level #5 spice, but it felt like a three. Although it was perfectly delicious.

Thai iced tea was super good I could drink all day long!!

The only miss and it was a pretty big miss was the Tom Kha Kai soup, it has all the makings with two exceptions one it had tons of cabbage in it yuck, and my biggest complaint was the complete overall lack of coconut every other time or has that soup is usually white and tons of coconut flavor coconut flavor was nonexistent interested more like chicken broth.

Overall it is a four-star a great restaurant that is almost hit all the high notes, and pretty fair price with portions to fill you up."}
{"text":"I don't get this place. It's not terribly cheap and the food is not good. No vegetables, iffy meat, and bland flavors. Avoid if you are over 21."}
{"text":"Cheap (price wise) Thai food that is good. I've been to plenty of other Thai places that charge a lot more and the food is still not as good. I've stopped by quite a few times for the daily specials, which is completely worth it - good amount of food for $5-$6. Haven't tried the pho so I can't comment on that."}
{"text":"One of the best pho bowls I have ever had and I've been eating pho all over the US.  The soup had an amazing flavor and the noodles were perfection. 

We also had the #23, vegetarian stir fry and that was excellent too. 

Smack dab in college town and well worth a trip to this gem."}
{"text":"Pho broth was way too sweet. I couldn't even finish the rest of my noodles. 

But service was fast and the food was cheap. What else could you expect?"}
{"text":"The owners are pretty energetic and enthusiastic. The food is pretty good and it will fill you up. Also, you could control your spicy level so that was pretty awesome. If you like your food to be spicy, they will get it spicy. Overall, good place to eat and hang out with friends."}
{"text":"I don't know what the hype is about their noodle dishes, I was not impressed at all. However I will say their curry (red or green) is absolutely delicious. Also, it has plenty of meat and flavor.

Their tom yun soup is amazing."}
{"text":"Don't let the building and decor fool you--this place has DELICIOUS and authentic food! My boyfriend & I were searching for a good thai place around campus and finally found it. The man that works there is always so cheerful and friendly. They definitely will make your food spicy if you request it, so if you don't like your food spicy, make sure to tell them a \"0\" or \"1\" spicy level. The prices are pretty average for a thai restaurant, but the portions are generous so you can even save it for an extra meal :)"}
{"text":"Very tasty, super fast. Perfect for college students. Pho was pretty good and the pad kee mao were pretty good. The pad kee mao noodles were a little bit soft for my taste, but there were a good mix of the protein and vegetables."}
{"text":"I got pho, crab Rangoon and chicken skewers. It was pho-nominal. I will return. The entire plaza seems to be underutilized by UIUC students, which is a shame because this pho place is delicious."}
{"text":"the best thai in champaign county.

Get the pad thai or the curry."}
{"text":"A bit hidden and relatively new.. but I keep going back for their Thai food! Everything has been wonderful and freakishly quick. They are also very nice.

I think they have the best Pad Thai and Pad See Ew on campus!"}
{"text":"This is where I learned I loved Southeast Asian food! Everything I've had here is excellent. The curries are hearty and flavorful, the basil beef stir fry has a sauce on it the likes of which I've never tasted before or since, and the pho has a good broth and lots of veggies. I lost count of the number of times I went here throughout my four years of college. It's the place I always went when I was craving any sort of Asian food.

The prices are fair, especially for the generous portions you get. The restaurant isn't the nicest looking place around and is a little small, but despite that I was never forced to take my food home for lack of seating. And right on Green street, it's easy to get to from anywhere around campus."}
{"text":"Food was pretty good for a Thai \"fast food\"! We didn't love the environment but the food was a lot better than expected. Great for carry out for sure!"}
{"text":"This location is on green street so very convenient for people wanting asian food. I went there after a halloween party and want some soup type of food as well as noodles so i got the pho. The bowl of pho was a decent size and the owner gave us some chili peppers to add to the soup so that it would add more flavor so that was good. Gave the soup base more of a dynaimc flavor along with everything else."}
{"text":"Food is fine but the wait time is too much. We had to wait more than half hour to get our pad Thai at lunch time!"}
{"text":"Needless to say, this place is amazing! Really love their daily special menu going on! Love going in and grabbing my favorite dish: yellow curry."}
{"text":"My favorite restaurant on Green St hands down! The pad thai here is THE best I've ever had. The other Thai dishes like the pad kee mao and pad see ew are great too. The curry is absolutely bomb as well.
Not a huge fan of the pho, but it'll satisfy your pho craving. 
Friendly service and you get your food fast. 
Just wish they would stop using so much styrofoam and that they'd bring back the weekday specials!"}
{"text":"Only been here once, but the pad kee mao (Friday special) is amazing. Very cheap too for dinner ($6). Food is prepared fast, so I really don't have any complaints so far. Why only 4 stars? Their Thai Tea comes in a bottle, with powder residue. Very disappointing. I guess I'm too used to seeing Thai Tea in a huge glass with the tea and milk still separated. 

I'll be back, but won't be getting Thai Tea again. I overheard something about their Thai iced coffee so if that's not in a bottle too, I'll try it."}
{"text":"They got rid of the daily specials. Bring back the daily specials Bangkok Thai!!! Fifth star would be added once the specials are brought back!"}
{"text":"I really enjoy the tofu pad se ew and the vegetarian egg rolls. They do tofu a lot better here than at cravings. Definitely not a date place. Pick up and eat at home :)"}
{"text":"Tried  tom yam, pineapple fried rice and loved them ! The guy and the lady at the cash register are very friendly."}
{"text":"This is definitely the restaurant I want to go to any time of the week. The food is delicious and the service is very fast. Though the Pad Thai is the more popular choice for most people, I recommend the Pad Kee Mao (listed under the Friday special). It uses large rice noodles (about twice the size of Pad See Yu) and has a wider variety of vegetables. It's also much more savory and filling-- I can eat twice as much Pad Thai than Pad Kee Mao and still be more satisfied with the latter.

The food can be inconsistent. There are days when I find the Pad Thai too dry or even too saucy. I understand that the cooks make a lot of Pad Thai (especially on Mondays), but I find the Pad Thai inconsistent even on weekends.

I recommend this restaurant for anyone looking for a quick lunch or looking for a place to sit down and hang out with their friends. The environment is very open and friendly."}
{"text":"Best thai food on campus. The green curry with tofu is pho-nomenal ;) I am vegetarian so happy options with tofu is a big plus for me. The service is fast and the workers aren't unfriendly. When getting to go like I usually do, the wait time is less than 10 minutes for my food to be ready."}
{"text":"Absolutely love this place and would give 5 stars for the pho. The broth is incredibly tasty and it always comes out tasting amazing. Believe me when I say it warms your soul. 
However, I'm not really a fan of the Thai food. I had the Pad Ke Mao when it was the daily special and the noodles were mushy and lacked vegetables. But this could have been they were rushing and had pre cooked the noodles because of the high demand for pad ke mao that day? 
The store owners are incredibly friendly and the food comes out super fast. Definitely      a cheap, delicious, hidden gem on green street and deserves to be checked out!"}
{"text":"This place was packed when we arrived, and I can see the reason why. It took the expected time for our food to be ready, and although it was hot it was at the right levels of spicy. There was so much food from just two orders that it might have been four. I recommend getting a box, unless your exceptionally hungry, because you likely won't be eating the whole order in one sitting. But what I ordered, some noodle dish with tofu, was DELICIOUS.
I don't know if they recycle, but I would like them to."}
{"text":"How did I forget to write a review for this place???

It's delicious!
It is kind of hidden, and yes, it's a hole in the wall. But in my experience, holes in the walls have the best food!!
And this place is no exception. We had the Tom Kha soup and something with chicken (I don't remember what my husband ordered, but it was chicken and it was spicy and it was amazing.)  My soup was heavenly. Just what I had a craving for! It had just the right amount of kick.
I'd love to try more of their food.
Their staff was very nice, and they cooked the food perfectly.

Try this place. You won't be disappointed!"}
{"text":"They clearly know how to cook here. Used good quality veggies, and the chicken was good, but the dishes were clearly tailored to a Midwestern audience. My boyfriend got chicken Penang curry that was literally just chicken in a soupy sauce. I got pad ped which, instead of being a light, spicy basil stir fry, was veggies and chicken in vaguely Thai-inspired gravy. I won't be going back, but it's not a terrible restaurant either."}
{"text":"Probably the greatest addition to campus in a long time. The other closest Thai food nearby would be Basil Thai, which is on the opposite end of campus. 

Every day during the week, there will be lunch specials. For a mere $5, you can enjoy food that is enough to be considered as two meals! In addition, you can also adjust the level of spiciness to your liking, on a scale of 1-6 if memory serves me right. 

Their pho is also fantastic! Very authentic and very large portion. One no longer had to travel to downtown Urbana to Xin Xin Cafe for pho. 

The staff are all extremely friendly and am not afraid to chat with you despite their slight language barrier. They are always cheerful and if there's something wrong with the order, they immediately replace it without further questions asked. Definitely a place worthy of regular visits!"}
{"text":"Been here several times, and it's by far the best spot in CU to get Pho. Love the Pho, and the Pad Thai here, and the spring rolls are good too.  They have the most awesome daily specials too. The staff is very courteous and friendly. I would recommend this this spot for anyone wanting to try something new, or if you are a California guy like me, that loves the Pho."}
{"text":"The Yelp community let me down this time, it was either them or us...
Finish reading
http://www.thaifoodaficionado.com/2012/07/bangkok-tai-restaurant-champaign-il.html"}
{"text":"Everyone I know loves this place.  They do the Thai classics justice!  If your in the mood for curry or pad Thai or Other classic noodle/ rice dishes I recommend this place.  Very casual, very basic, no complaints."}
{"text":"Pretty good Thai food in the middle of Campustown. I sometimes come here for lunch, but it's usually packed then. Their noodle dishes are tasty although they are served a bit too hot. The texture of the noodles are a bit too soft for my liking, but they fill me up.

When you order your food, you can choose your spiciness level from 1 being the least and 6 being the most; so if you don't like spicy food, then you aren't very restricted in terms of menu selection. Personally I order my dishes with level 3, but I think that if the dishes are served colder, I can easily handle higher. I can definitely see myself coming back here again and again as long as I'm a student at the U of I."}
{"text":"Bangkok Thai 911 is my favorite restaurant here in champaign. Reasonable price, awesome foods, nice services, I will give it 5 stars !"}
{"text":"The food was really good. They didn't have a kids menu, even though there is one on their website. The waitress was unfriendly and inattentive. Probably won't be returning any time soon."}
{"text":"I had so much hope for this place but my pad ke mao was really underwhelmed. The noodle was all chopped up and gooey. Pad ke map is supposed to have mushroom but mine instead had bell peppers? Very unauthentic. The flavors were off.
Also got the shrimp fried rice, which was much better. The shrimp were nice and a good size, though tasted a bit fishy. The fried rice were nicely flavored. Maybe the advice to give here is to stay away from noodle dishes here.
The crab ragoon were ok, nothing special. The skin got stale pretty quick by the time i took my takeout home they were no longer crispy. Also the filling inside were small. Not crabby, basically cream cheese."}
{"text":"Been here several times, this place is awesome. You can't beat their prices for the lunch or dinner specials, and the food tastes excellent. I recently find myself getting cravings for this place. I prefer the Pad Kemao(thicker noodles) to the standard Pad Thai, but thats just me."}
{"text":"I always tend to have a great experience when I go to Bangkok, this instance was no different. However, two days earlier I ordered a pork fried rice (spice level 2 out of 6), and it was far spicier than I remembered it being. That said, the owner did warn me prior to ordering, and encouraged me to consider a lower level."}
{"text":"This place serves great Thai food on campus, and the daily special is a great deal (Mondays and Fridays are my favorite).  The Pad Thai, Pad See Ew, and Pad Kee Mao are all delicious - and are served in huge portions.  I've heard the Vietnamese dishes are also quite good.  The staff are very friendly."}
{"text":"This is an awesome place for cheap, authentic food with love from a hardworking family. They have fantastic pho and the price cannot be beat; the specials they have are a great way for students to come here and still stay on budget too."}
{"text":"I frequent this place for lunch and the amount of food is always something that makes me smile. For the $5.50 lunch special you get a heaping of food, and it's always delicious. It's definitely my go-to spot for lunch!"}
{"text":"Cheap and convenient. Has really good curry dish and strongly recommend the pad thai.
Never be able to finish the whole thing.
The thai milk tea is good too but little bit too sweet for me as a Chinese.
Fareast sells it too if you want to buy it somewhere else."}
{"text":"I've been coming back to Bangkok Thai and Pho 911 for the past couple years now whenever I'm back in town. 

Now this is mainly a review for their pho, since that is the staple item I get whenever I pop in. 

If you're looking for a spot in CU to get a bowl of piping hot pho, this is definitely one of the places to do it (if not THE place). The noodles are wonderfully cooked, the meat is just right (because they do the proper thing which is place the thin slices raw on top of the noodles right before adding the steaming hot beef broth right on top, so it immediately cooks in the heat, but doesn't overcook), and the portion is great. Also the broth, it has dimension, it isn't a flat tasting beef broth, but rather, you can tell it's been simmered with its probably gigantic bag of spices for hours on end. 

For a large bowl of pho, it'll cost you under $10. Even if you get the one with all the fixings (flank, brisket, round, tripe, tendon, etc). 

The restaurant itself is very much a campus kind of casual restaurant. You order from a window, pick up from the same window, bring your food to a table, and service yourself with napkins, sauce, silverware/chopsticks, etc. Hey, if it keeps the price down, I'm not complaining at all. You even can grab yourself/your table a nice full pitcher of ice water and cups! No need to wait for any waiting staff to refill your water. 

I have had the opportunity to order and try their other dishes. Their pad thai is pretty tasty and flavorful, but their pad kee mao leaves a little to be desired. I haven't tried their curries before, so I'll leave that to those more experienced. 

Overall, Bangkok Thai is a bit of a campus establishment (alongside Empire Chinese food right next to it) and I hope it'll continue to be one for years to come!"}
{"text":"I ordered takeout of chicken green curry and had high hopes for it after all the glowing reviews. When I opened it, the curry that I was craving was instead a green curry flavored soup! 
Did it taste good? Yes, but this IS NOT curry."}
{"text":"Love their veggies and tofu! They actually listened when I ordered the hottest level, I got very spicy! Also, they're fast, and their portions are huge and enough to eat for two days."}
{"text":"This is my favorite Thai place that I've ever tried. I think I'm actually addicted. It's bad. I'm trying to diet, but the Pad Thai just keeps calling my name and I can't resist. If I had to choose one food to eat in a daily basis for the rest of my life, it would be Bangkok Thai's chicken Pad Thai. I just can't get enough, and I'd recommend it to anyone."}
{"text":"Fantastic Thai food for great prices. Their pad thai is great, and it can feed two for around $8. During the week they offer specials for $5, choice of rice and meat, generous portions. Their crab Rangoon is unique and is pretty good, worth a try. The owner is a very nice guy, provides great service! If you're in the mood for thai on campus, this is the spot to check out first."}
{"text":"I've had Bangkok Thai and Pho 911 several times but this is the first review I'm writing for it.

I had a craving for Pad Thai and that just happens to be on special on Mondays. I came in around 11:15 for lunch, ordered my Pad Thai and spent my break between classes chowing down and catching up on some reading. 

There were a few people inside but no line or anything. I stepped up, ordered Pad Thai with beef, paid for it, and by the time I got my change in my wallet, checked my phone really quickly and realized what my order number was, it was announced over the loudspeaker. Talk about quick service! 

They also conveniently have a bunch of water pitchers and small Styrofoam cups so you don't have to order \"a cup of water\" with your food. There's also a selection of sauces like soy, sriracha and I believe hoisin. After you're finished eating, you need to put your dishes away in the bussing bin they have in the corner of the store. 

The Pad Thai itself was excellent. The flavor was spot on, the noodles cooked properly and not too sweet or salty. The beef was in thin slices and seemed to be of decent quality. I stayed on the safe side with my level of spiciness and ordered a 3, but I would probably order a 4 next time, since the 3 was a little underwhelming and I ended up throwing some sriracha on it.

The best part of my lunch was how much (little) it cost me. When Bangkok Thai and Pho 911 says $5.95 lunch special, they mean it. My lunch, which was a heaping portion enough for two normal people, cost me not a penny more than $5.95, tax included. And did I mention it was actually good, too?

You cannot beat $5.95 for better than average Pad Thai.

Highly recommended, I'll be back to try some other things."}
{"text":"The best Thai and Vietnamese food I've had here! The staff are super friendly. Basil chicken and pho are always on my lists to order. They are very authentic to me. I have to go there several times everywhere week! My favorite restaurant in town."}
{"text":"It was my to go to place for good. The curries are fantastic.

The daily specials are so worth it: Especially on Thursdays for the Yellow Curry! $6 specials.

Offers free tea as well!"}
{"text":"I was firstly astonished by the price here. I mean, a pho at 8.95 obviously is not a champaign stuff. But seems this is the only Thai restaurant here. The pho tastes okayyy"}
{"text":"This place is awesome because of its lunch specials in which a certain item is 45% off its normal price. I personally like their fried rice Tuesday specials. There isn't anything too special in terms of toppings for the fried rice, just onions and the main ingredient that your order (tofu, chicken, beef, and shrimp fried rice). Also note that shrimp fried rice is not on discount during Tuesday. 

What makes their food especially delectable is their spicy levels which range from 1-6. With such a wide range, it's somewhat hard to discern the levels of spicy. I've had level 5 and level 6 meals here and I can't really tell the difference sometimes. The service is fast and they have a plethora of water pitchers for water connoisseurs like myself."}
{"text":"This is some of the best Pho I've had in the area - especially the broth. So good on these cold days. The customer service was wonderful as well - maybe the best part!"}
{"text":"Went here for lunch on a weekday. 

Its a campus location, so expect students, cheap prices and a \"hit or a miss\" food. We went primarily because my SO was craving for som Pho. Reading Yelp reviews, we walked over to this place. This is in the old Zyygyz location. Cant miss the green awnings.

Its a hole in the wall. So dont come expecting a proper sit down place. 

We proceed to order a Pho and basil chicken. They have daily specials for $5. 

They have an assortment of condiments and a choice of spice level. 

Pho was a generous serving. We could not finish ours and it tasted really good.

Basil chicken was acceptable. Overall, food was good. 

There were only a few tables occupied, so the food came out fast. 

Strongly recommend this place for lunch or a quick bite anytime. No complaints about food.

Will return when we crave Thai or Pho."}
{"text":"Got the red curry and was pleasantly surprised at how great and fast it was. I have had hotter Thai food but not much better than this."}
{"text":"To me it was 3 stars but wife said 5 so I am going with 4. Good prices, like the look of the interior. I find the quality comparable to Golden Wok but less than Thara Thai."}
{"text":"Nice pad Thai but not spicy enough. Ordered spice level 4 out of 6 even though I normally don't take spicy food."}
{"text":"Usual go with Wed and Fri specials, and ask for super spicy. The food portion is a little bit less than it suppose to be in regular price, but I totally understand. Very tasty thai food."}
{"text":"Super good Chicken Pad Thai! Huge portion for a cheap price. Go there about twice a month for the same exact thing!

The food is good for about a 20 minute window however, don't try and bring this home..."}
{"text":"For the middle of Illinois.....it's quite good! Conveniently located on green street right on campus.

The chicken pad Thai I had was great. When you order you pick a level of spicy between 1-6, I don't like my food too spicy and thought the 4 was a little underwhelming do will certainly be upping the spicyness next time. 

Prices are reasonable at normal prices but if you take advantage of the daily special it's a very good deal! 

Walked in to order for take out when it was quite busy and only waited ~5 minutes. Would recommend!"}
{"text":"Cheap, easy, and fast for lunch.  Nice place over all but nothing special.  I'm a huge pho- lover but the pho here is a bit lackluster and not my favorite.  Definitely could step up their game a little bit...and it wouldn't hurt them to try and keep the location a little cleaner and nicer looking.  The self- busing is fine as well but couldn't they maybe put in a bit more money to class up the place?"}
{"text":"Good food and you can't beat the lunch specials! I've come here for the Thursday curry and the Monday pad thai and both were great at only $5! Watch out, this place can get crowded at lunch but don't worry, the line moves quick.

Can't wait to try the pho!

10/27/14 UPDATE
I just got back from eating here for lunch. They've instilled a new policy where if you order the special, its automatically served in takeout containers. For someone who goes out of their way to limit their contribution to landfills, I'm not sure if I'll be coming here often to say the least and I definitely will avoid ordering the daily special."}
{"text":"My newest addiction! I had never tried Pho before and my sister recommended it to cure a killer hangover. It worked and it was delicious. I can't resist coming back since I live so close.

The only thing I have eaten here is the Seafood Pho and it is phenomenal. It is filling, well made and absolutely delicious. It is about 10 dollars but you get so much. It lasted me 2 meals when I was moderately hungry one time.

The staff is very friendly, it seems clean and everyone always looks happy with their food. I love this place, definitely try it if you haven't."}
{"text":"Best. Pad. Thai. Ever. I came here for food almost twice a week for the daily specials but I heard those are gone now. This place was such an integral part of my college life. I can't believe I won't be eating here for a while now."}
{"text":"Consistently great Thai food,  and pretty cheep (everything is about $8 but lasts me two meals). It's a no frills,  basically a take-out place but one of my favorite places to get food on campus.  Pad Thai is the best but they also have really good curry and pho. Also offer water pitchers for the table."}
{"text":"I always used to come here and order level 10 anything. Did the job."}
{"text":"I love to come here during dinner. I always end up ordering their special, which is also super cheap. Normally I would expect for this price to get very subpar food portions and quality. However, I was in fact quite wrong. The food tastes amazing and they give you a large portion which often takes me two meals to finish. I highly recommend this place."}
{"text":"My experience here was just okay. I ordered Pho and the broth just didn't cut it for me as being good but it was just alright. My boyfriend ordered the cashew chicken for the first time and he loved it. My friend got chicken fried rice and that was good as well. The price is fairly cheap for the portions at this place which is great for college students. I would come back here for food but not for the pho. 

I'm only giving three stars because of two reasons. One of them is that I ordered the Thai iced tea for almost $3 and I expecting to have some refreshing authentic Thai iced tea, but instead it was a really small bottled one from the fridge which was pretty disappointing and not worth $3. The woman behind the cashier said \"I'm too lazy to make a real one,\" as her excuse. My second reason is that the restaurant was way too humid and hot with the doors open on a humid rainy day. I was sweating uncomfortably while eating my hot pho and it was unpleasant. There were workers fixing the ceiling tiles or something nearby too, which I thought was unacceptable for when people are eating around them only a few feet away. 

The food was good, the atmosphere not so much. I will still be coming back for a quick Thai fix because it's so accessible and conveniently located on Green st."}
{"text":"I have been to this place only once, and that was enough for me. My husband and I ordered chicken satay, papaya salad and pho with seafood (I think p6) . Chicken satay was ok, nothing great. Papaya salad tasted fine but my mistake that I ordered it with a spice level 5. Now pho, I love pho and always look for good Vietnamese restaurants. I was super excited to visit this place, only because they serve pho. Also, they had good options to choose for pho. I was expecting pho to have deep seafood flavor, with  well balanced flavor profile. What I got was, bland broth with overloaded sweetness and some questionable seafood. I couldn't eat more than few spoons. It tasted really bad. Probably the worst tasting pho, I have ever had."}
{"text":"This place is great! I've tried a few of their noodle dishes (haven't tried their pho yet) but they were both really good. Pat see ew and the pad thai are delicious. You can get various spiciness levels. I've gotten the 5 (out of 6) and didn't find it super spicy. Maybe they skimped out on spiciness.

They have pretty cheap lunch specials too ($4.99) for lunch. Quick service and yummy grub!"}
{"text":"I love their fired rice, pad thai, and pad see ewe.
Their lunch and dinner deal are steal! I went their almost every other week just to get the lunch deal. And they give a very large portion of food. I usually go during lunch and I would have enough food to last the rest of my day."}
{"text":"Restaurant review:
Eh, maybe I should have went with the curry. I was craving asian food and decided to come here for dinner. This restaurant reminds me of the Hong Kong dai pai dong food stalls where you order and they call your number to pick up your food. My wife had the pad thai which was a good value and tasted like pad thai. I ahd the pho and it was 2 thumbs down. Even though it was the combo pho with everything, there was not a lot of protein items and the noodles were overcooked. The worst thing was the pho broth which is usually a highlight. I don't know what they used to season it but somehow it tasted like dish water. There was no clear broth flavor with star of anise or hint of cinnamon. It just tasted very off and I could not stomach more than a spoon of the soup. If you want cheap food then the lunch special looks like a good deal, but stay away from the pho at all cost!

Pro: inexpensive, no tip you bus your own tray, lots of seating

Cons: terrible pho soup, not good at all

Hidden gem:
I have not been here for lunch, but for 5 dollars that seems like a steal with good portion sizes per other reviews."}
{"text":"I have been here several times now and every time it is astronomically delicious!  Though, to be 100% honest the only thing I ever get there is Chicken Pad Thai and Crab Rangoon.

The store itself is hidden in what seems like an apartment complex right across from a laundry mat.

The owner of this location is a nice guy with a open and joking personality.  when I first went their and ordered Pad Thai he got this evil/mischievous smirk on his face and asked if I like spicy food.  Though I had already been forwarded about their spicy level and stated my preferred starter number which was 3 to vary how spicy I could go and one day when I feel nice a stupid I'll go up to 6 but I am not a young man anymore and I WILL regret that act of bravado. 

If you love Pad Thai go there on Monday as it is on special for $5.99"}
{"text":"Stopped in to get some milk tea bubble tea because all the other bubble tea places were closed on campus on Sunday and it was AMAZING. 

Haven't had the food yet but I want to try it the next time I'm in."}
{"text":"Did I get the wrong thing? Did I read incorrect reviews? I was a bit confused.

On a recent Friday, popped in for lunch and ordered the special (pad kee mao). My dining companion ordered the pad thai. Albeit $5 is a super-affordable lunch charge, not sure if it's worth it.

Super basic dining experience - order at the counter, they call your number, pick up at the counter, then bus your own table. Both dishes consisted of an over-cooked clump of noodles and very little else to break up the monotony of texture and taste. Went with the spicy level of 4 for both, which barely registered on the taste buds.

Perhaps something was awry on our visit...but awry enough that I won't be visiting again. And I had such high hopes. Sigh."}
{"text":"??????daily special????????????????"}
{"text":"I think this place is on the verge of 5 stars for me, I just have to come back and try the pho first to be sure.

I will say that the panang curry was amazing. I had them replace the rice with noodles and it was pretty great, and very inexpensive. The thai iced coffee was great too. And my boyfriend was really happy with his green curry. I definitely would come back here!"}
{"text":"Probably the best pad Thai I had since coming here. They weren't stingy on the shrimps and the fried tofu tasted like I like it. The place is clean and you get your food within 5 minutes. I like that you can add your level of spice!  So while some places you gotta order drunken noodles to get spice, I got it with the pad thai. I'll definitely be coming to get my pad thai."}
{"text":"I have had it a few times and it was fine. But I went yesterday and asked for a 1 spicy and it was so spicy I couldn't even eat it. Wasted my money"}
{"text":"Mia Za's used to be my favourite restaurant on campus until I came here. I wasn't overly chuffed with it replacing Zyggyz, but one visit later I was a frequent customer and a fan. Their pad thai, pad sew, pho and yellow curry is worth going the distance on Green street. Fairly priced too, I am a regular visitor on Monday's for the pad thai and Thursdays for the yellow curry (daily special, around 5-6 bucks). Spicy too! Can get it non spicy, but then where's the fun?! but there is the option."}
