{"text":"If you enjoy happiness and good food with amazing staff. The food was amazing and the staff and owner checked in on us and made sure the food quality was up to par. It is amazing to be treated with so much respect. Food was fresh tasty and the fact that they are packed should be a sign that they are good! Thanks for taking care of us and making us feel like family.
So many options including the vegetarian, meat and great snacks and appetizers. We came here for a light snack and had to stay for dinner because it was on point!"}
{"text":"Incredibly salty with very strong MSG taste and also very greasy. It tastes like Thai Express. Definitely not authentic Thai food like it claims to be. The food tasted almost like premade microwave meals. The portions were also very small.  Would definitely not recommend as the food court is just around the corner and has a lot better fast food than this place."}
{"text":"If your craving really clean, healthy, but amazing tasting Thai food, then this is the spot. I eat tons of Thai food on my travels and I'll say this place can hang with some of the best. I highway recommend giving it a try. You won't be disappointed!!!"}
{"text":"Went with my gf to give it a try! The portion is small compare to the price we pay for!  It's tasteless and not much ingredients were given!  The service is slow as well! Would never go back again!"}
{"text":"I love this place.
I don't care that everything is $10.00
You get a perfect potion of delicious Thai food.
Today I had Red Curry with chicken.  You can taste the grilled chicken.  So very good.
I also got an order of Siam spring rolls.  3 for $4.00  no grease.  You can see and taste the ingredients.

This is how food should be.

If you haven't been here.  Stop what you're making for dinner and go for a tasty morsel."}
{"text":"Delicious food. Gluten free noodles. Available cauliflower rice, but no brown rice. Serves even late. Comfortable seating, fast service. 3 spring rolls to an order. Clean and courteous. Yum! I give it a 5 for mall fast food."}
{"text":"If you love spicy Thai food than this place is for you. All the ingredients are laid out for you to see and they are fresh. Although the ingredients for each dish is already set, you can ask to replace one item for another and they are happy to do it for you. You get to choose either chicken or tofu at no extra cost to accompany your dish. Although there is an extra cost for beef and shrimp it is well worth it as they are marinated with different Thai flavors. I'm not a big eater so the proportions are just right, but I can see how the proportions may seem smaller than your average meal.

There is no kids meal on the menu and there are only 2 choices on the menu for non-spicy. This is the only negative that I can see. Even the non-spicy dishes were a little much for my little one since there was a lot of black pepper in it. Despite not having a kids meal, the employees were super accommodating and made a special rice bowl for my little one. She got something that resembled a teriyaki chicken bowl. 

The food is good but the customer service is beyond any other that you would find at any fast food restaurant. The owner came out and spoke to us. He was super friendly, sincere and generally wanted to chit chat with his customers and make them feel welcomed. The employees came around to clean tables and ask if the food was ok. Although it is fast food and in a mall, it was great that they had their own sitting area. I would definitely go again and I would recommend this to my friends and family."}
