{"text":"Good bao, but stick to the basic ones. Pork is good, sausage is terrible. The red bean is ok, other places are better. Wide selection and ease of access is best. Drinks are ok too."}
{"text":"Adorably made Bao baos! I thought the little piggy one was filled with red bean paste. Instead, i was pleasantly surprised to find it was chocolate! Their lotus leaf sticky rice is flavorful and generous with meats and shitake mushrooms."}
{"text":"Cutest little dessert buns, literally so precious that i don't want to bite into them. I'm a huge carbs person so its no surprise that i love steamed and baked asian buns. 

   It's a great place for picking up that saturday afternoon snack before dinner. I don't see how you could go wrong with $1.50."}
{"text":"This establishment specializes in asian pastries/bakery, and they make an immense variety of bao's. The \"Dim Sum\" in the name is a little bit misleading in that there are actually no seating areas for a full Dim Sum spread; there are only a few items (specifically many types of Bao) for take out, but no table service. The establishment is actually an amalgamation of two: One is a pastries/bakery and the other is a take out place (for the Bao and Dim Sum) with an immense selection of bubble teas and other Asian drinks.

The curry beef Bao is excellent, the black sesame seed Bao looks adorable, and the Hong Kong style egg tarts are amazing!"}
{"text":"Such a cute little shop in Montreal's Chinatown!  They have all sorts of steamed buns that are in too cute for words buns!  They're also too cute to eat!  They also have some staple HK/Canto Style foods along with a plethora of bubble tea/drink options.  

The place is nice and bright and clean.  It's a perfect little spot for a snack or meal.  

One word of caution though, you have to come during the main part of the day, not too early or too late because not all of the baos will be available.  I learned the hard way =("}
{"text":"Such a cute place and the prices were pretty great! If in the area and are wanting something amazing to try come here!!! We got the BBQ pork bun and a strawberry chocolate bun. Both very good! The strawberry one looked like an angry bird, but there wasn't really strawberry, guess that was the 'flavoring' of the bun?? So good will be back for sure!"}
{"text":"Buns are good. Taiwan style fried chicken is not real taiwan style, eveb worse than supermarket frozen chicken."}
{"text":"The buns here are soooo good!  I took a bunch of them home to Philadelphia with me!  I tried all of the savory ones (cha siu, pork, curry, etc) and every single one was so delicious.  The bun itself is so fluffy and slightly sweet and pairs very well with the savory filling.  I wish there was one of these near me!  Next time I an Montreal, I will definitely be going here!"}
{"text":"I love the cute Baos here! Very good! Almost too cute to eat! Definitely try the green tea bao with red bean filling! You can taste the green tea on the bun and it's not too overpowering!"}
{"text":"I loved their cute and surprisingly yummy baopao. They have lots of cartoon characters with different fillings such as black sesame, red bean paste or even custArd. Thumbs down for the mean and unfriendly cashier that makes our frown faces."}
{"text":"OMG, the cartoon shaped steamed buns here are so cute!  I had to pick up some to bring back to Ottawa for my little niece (and I got a couple for myself as well, lol).

I got 2 Hello Kitty (custard), a Keropi (the green frog) (red bean), an Angry Bird (chocolate and strawberry), a Hedgehog (taro), and a Yellow Chicken (mango coconut).  The buns actually have very little filling and are mostly just bread, but they are soft and fluffy.  Hey, the truth is I bought them because they are cute and look nice in pictures, not because I thought they would be delicious.  They didn't taste bad, but just nothing special.

All the cartoon buns were $1.99, except the Angry Bird one, which was $2.50.  Prices already include tax. 

This bakery also sells bubble tea and regular buns and pastries.  It's in Chinatown and is similar to other Chinese bakeries in the area (and in Chinatown in Toronto) except they are the only one I know of that make the cute cartoon steam buns.  Oh and they also sell Dim Sum.    

I only tried the cartoon buns.  5 stars for cuteness, 3 stars for taste, so overall 4 stars ;)"}
{"text":"The cute animal faces are a great way to draw you into ordering these bao zi. I'm glad they did because it was very good! Not too sweet which is the way I like it! I had the sweet potato bao zi. There are many flavors and cute characters to choose from. They are fresh and prices are decent. Can't wait to try other flavors both sweet and savory!"}
{"text":"This shop is part of my weekly Chinatown routine. I usually drop by right after groceries on St. Laurent to grab a bao or two. 

There is a huge selection of sweet and savoury baos, sticky rice treats, dim sum items, etc. Although the prices are low, I can't help but think that they would have been at least five time cheaper in China. Oh well. 
As with Chatime, Bao Bao Dim Sum can be understaffed, resulting in long waiting times at peak hours. It also happened quite a few times that requested items were no longer available.  

Overall, the shop does a good job at marketing products that would otherwise be difficult to approach by unfamilliar clients. 
It's a nice - and cute - introduction to chinese munchies."}
{"text":"This place has very cute treats and a nice selection of domain. I tried the har gao, stocky rice, and the red bean paste bun. The dim sum wasn't too bad, it had flavor. The cute buns you see by the window are quite filling so I would recommend sharing. The one I got, green tea with red bean could've been stronger in terms of flavor. But with the price I paid, I'm not mad. I would recommend this place if you are looking to try some typical Chinese breakfast foods and are looking for something quick and on the go."}
{"text":"Huge selection of buns for about $2 and some other little eats such as curry fish balls and chow mein . The buns were super cute and affordable but they weren't super tasty. I definitely ordered one cause they were adorable. Still worth it for the ig lol!   I ordered the hello kitty one which was custard filled and my bf got the angry birds one which was chocolate filled. Note they only take cash and debit cards like most of stores and restaurants in Chinatown. Be sure to bring cash when visiting Chinatown"}
{"text":"I went in on a whim to this place in china town. I went to my right since another bakery is to the left. I chose this bakery judging from the pictures of \"baos\" posted up on the window. I was in the mood for steamed buns and this place offered a large assortment of that. They also offer a lot of dim sum items and variety of bubble teas. I like that you can get dim sum takeout. The price for the baos are pretty much the same as everywhere else I've had from Toronto to Montreal, around the $1.50 mark / dim sum items should be a bit cheaper since it's takeout to me. I ordered a few steam buns with these fillings:  lap-cheong (Chinese sausage), BBQ pork & terriyaki  chicken. They were all tasty & had a good amount of filling. I tried their har gow( shrimp dumpling)  decent - took care of my craving. There was enough shrimp filling it was the rice dumpling that was a little too mushy. Bubble teas are good & comparable to places I've had from. I would definitely go back as this place is great for a quick lunch or snack to go. Counter help were friendly. Glad I stumbled on this place."}
{"text":"Came here several times to grab their cute buns. ;)
They make them all fresh in house with tons of flavours, from traditional buns to the dessert style ones with all the cute sanrio characters.
They also have some traditional dim sum that you can get a la carte or in a combo.
Decent quality too! The chow mein was very oily though. 
There's not a lot of seating so you'll have to take it to go. I like to steam it back up at home to eat hot. They also have bbt I think? Never tried.
Afforable food to grab on the run!"}
{"text":"We walked by the cutest animal shaped steamed buns display and had to go in and get one. There's several different types -- piggy, hedgehog, hello kitty, keropi and chick. Each is a different flavor, either sweet or savory fillings. 

Can't speak too much about the other selections as we went to another bakery for non-cute pastries and baked goods."}
{"text":"Got the green tea and red bean bun (Keroppi) as well as the custard filled one (Hello Kitty). The bun to filling ratio was not ideal. It could've used more filling and less bun. You can taste the green tea in the bun, but the filling was not a good match with the green tea. The custard-filled bun was better. They only accept cash."}
{"text":"Decent, inexpensive Chinese fast food in the form of buns and bubble tea. For $1.50 you can get a bun filled with meat or sweets, and 3 or 4 of them is filling enough for a meal!

The ingredients taste fresh and is on par with Chinese food I've had at other places. Located near the convention centre and having a good price, what more can you ask for?"}
{"text":"Their steamed buns aren't like traditional buns. Firstly, they're HUGE. And Secondly, they're lighter and fluffier which I like better. They have a variety of fillings too."}
{"text":"Une des meilleures pâtisserie dans le quartier chinois! Toujours frais et à petit prix!"}
{"text":"They had me at Keroppi!!! Small bake shop in Montreal's Chinatown with the cutest bao's (steamed buns) I have seen! They had a great line up of Sanrio character baos. They were cute and very tasty as well! I recommend stopping by if you
like cute things!"}
{"text":"Cute dim sum! Didn't think that was a thing until I came here. The animal dessert buns are pretty cute and taste pretty decent if you have a sweet tooth and want the carbs. 

Food is definitely worth the stop. The bbq poem bun is exactly what you would expect. The bread for the buns are pretty thick which adds after a while.

I've never had the Hong Kong Milk Tea before but it awesome! Like a black tea version of a Thai ice tea"}
{"text":"Silly, playful buns will draw you when you see them lined up in the window.

The pork buns were decent - sweeter than I prefer, but good.

The dessert buns were hit and miss. We tried a few of them, with the chocolate ones winning over the fruit.

Would like some of the bun designs to have different flavorings, but alas, that's how they sell them. Ie. I wanted to eat the \"red angry birds\" one, but didn't want the strawberry filling.

Not the best bun you'll find in this Chinatown, but still, a fun place to grab a bun for the road."}
{"text":"This shop sells dim sums and steamed buns next to Patisserie Harmony. 
The dim sum are okay and they have quite a few choices for the buns as well both savoury and sweet. However they are a bit hit or miss in my opinion, the bread tends to be heavy and a bit dry and they aren't always hot. The sweet ones are really cute though! Definitely worth a try!"}
{"text":"Small place selling their cutesy bao buns I. The shapes of cute animals plus a pretty diverse offering of small dim items and snack food and bubble tea right next to my fave Chinese bakery (Harmonie) in Chinatown MTL. I've sampled a bunch of items here. I took home a few of their sticky rice (lo mai gai) plus some of their dim sum items (har gow and siu mai). The dumplings were in my opinion a bit on the pricey side $1 each (4 for $4). Ahhhh Lordy, I can remember getting 4 dim sum pieces in Chinatown Honolulu for $1.75 each. However this is close to twenty years ago so I clearly need to re-calibrate my brain for 20 years of inflation. The flavour was nothing amazing just ordinary. The sticky rice was okay when I brought it home. A very large serving size for around $5. Good pork offering, mushroom in that gooey soya based sauce. Their snack offering is quite large so I'll come back and test out some other items. Overall a decent 3.5 in my mind."}
{"text":"I don't know where to begin with my experience at this place. Yes, the bao bao is cute earning the one star rating. Food and taste wise is horrible. All the 4 and 5 star ratings from other yelpers had me dispirited at this point. The bao IS big with very little filling. We bought five different bao character cos of the different fillings. We were excited to devour Hello Kitty as our first option. We each took two bites and gave up because it's literally just bao with a pinch of filling in those bites. The boa taste like any other bao, nothing special about it. We also ordered 'Cherng Fun' (and other items on the menu) which is known as steamed noodles. If you grew up eating this, you know it's the fresh steamed noodles, sweet sauce, peanut sauce, and a sprinkle of roasted sesame seeds that makes you smile. OMG, this 'cherng fun' is nothing like that. The noodles were old and a bit hard, peanut sauce is liquidity, and NO SWEET SAUCE (did we travel to a different planet?)!!! Took one bite and didn't want to look at it any more. Overall, if you only care for the cuteness of the bao and Instagram purposes then you should give this place a visit. IMO, it's not worth my stomach space."}
{"text":"This was my first time having Bao and I loved it! I bought the chicken and the bear ones and they were delicious! We also bought a red bean bubble tea and although it was good, it was too sweet. However, the Bao won me over and I can't wait to get more!"}
{"text":"A quick order and go Chinese dessert and snack spot. They have a huge variety of sweet and savoury buns and pastry! If you like cute and fancy buns - this is a very good location for it.

I highly recommend their Hong Kong Style Milk Tea bun combo - $2.99 special that comes with a bun of your choice and drink. It's a very unique tea flavour milk tea drink and with a bun is a great snack on the road. 

If your kids like Japanese anime characters such as Hello Kitty, be sure to bring them here for a treat!"}
{"text":"Cute little snack joint in Chinatown with great prices. Their buns are always steamy and very tasty. :)"}
{"text":"Their bao is OK. Their flavors are good and well executed, but not something special. I think what gives this place hype is the cute characters they make for their bao. 

Good for pictures, not very good if you're looking for something that will be fulfilling. 

If you're going to buy their bao, make sure you get them hot, and eat it on the spot. They won't taste as good if they're not hot."}
{"text":"Love love love the cute buns and they are tasty too. Since my visit to hongkong summer 2016 I have been longing for cute scrumptious buns . And as a fan of hello kitty, I had to try this place for my visit to Montreal Chinatown. Some of the buns are savory, and my favorite is the red beans.  The shop however is a bit small. They also sell bubble teas and other pastries. A must place to visit."}
{"text":"I'm a sucker for cute things.  I saw the cute character buns and purchased 3.  While cute, they were extremely disappointing.  The bun to filling ratio was off.  It was very doughy.  We took a bite of each and threw away the rest. 

Their regular dim sum and buns were pretty good though and that was what saved them from a 1 star review.  Their pineapple bun was delish and I wished I had bought more.  

Note: they don't take credit cards. They take Canadian debit cards. I didn't exchange my USD to CAD yet, so I feel I got swindled.  Order came out to be 15 CAD but bc I only had USD, they said it would be $15 USD."}
{"text":"Located inside Chinatown Montreal. 

Small little shop that sells cute buns, pastries and bubble tea. They are probably most well known for their adorable cartoon buns. All their buns are fresh and hot right out of the oven when your order them. 

All the buns are adorable and the fillings are tasty.  
I love the hello kitty custard buns here! It's soft and delicious. Buns are relatively cheap around $2 each. I've also tried the melting custard bun. This was actually melting inside. But I prefer the regular custard one better. 

I bought a total of 9 bun at once one time and they stuffed them into the boxes. In one box they put 4 buns. All the buns ended squished and deformed looking. Be careful when you buy multiple buns. You should ask them to bag then separately instead. That might be better than boxing them. 

Overall, decent place. Nice presentation of buns. 

There is limited seating. The shop has only a few chairs. Can probably sit up to 5 people."}
{"text":"I couldn't help but squeal when I walked by this shop. The buns they make are adorable! For the price they sell them, it's actually pretty good. I almost couldn't eat them 'cause I felt like I was torturing them. My buns were hard though when I ate them so that was a little disappointing. The dough was also on the thicker side which meant more chewing. I wished they would have reheated mine or told me to microwave them. Cute place though!"}
{"text":"Ahhhhhh!!! The Baos were sooo sooo sooo cute! It was almost too cute to eat it, but for the purpose of yelp. I had to eat it. It was okay, the custard was a good balance of sweet. The dough was a bit dry."}
{"text":"Located in Chinatown, the location of the bun shop is quite convenient and easy to find. It is next to Cocobun and offers a more steamed versions of buns compared to the baked ones in Cocobun. The highlight of this shop is the cartoon-style steamed buns that come in different flavours: I tried matcha red bean (frog), taro (porcupine), mango coconut (chick), sesame (panda). The best is mango coconut according to me. The price is a bit high, but the buns are really filling, which balances it out. I love how cute these buns are!"}
{"text":"This is the cleanest Chinatown I have ever seen and bao bao is great. Big selection, fast service. Only takes cash though. The bao are very good and priced right. We found a nice little park back down the street and enjoyed a nice snack there. Recommend."}
{"text":"Loved the big selection of buns!  I had a chicken and Chinese mushroom one that was amazing!  And then I also bought 2 sweet buns.  The Mango Coconut (chicken) and the melting chocolate (piggy).  They were all delicious.  Have to come back to try more"}
{"text":"Located in the heart of Chinatown Montreal, this is a super cute and cheap place for not only buns but drinks and snacks! All of the buns are sweet flavored, but that totally aligns with how cute they are! Definitely one of the most creative bao places I've been to. They also have a huge selections of bubble tea, slushes, juices, etc. Every bun goes for about $2, which isn't terrible because they are pretty large. 

They were also having bubble waffles with ice cream and toppings all for only $5! The egg waffle was sweeter and softer than a lot of the other ones I've had, but for sure it was filling. If you're in the area, I definitely recommend stopping in!"}
{"text":"Un riz collant bamboo excellent et beaucoup de patisseries très amusantes. 

La file d'attente est parfois longue surtout l'été.

Oubliez la gaufre avec la glace qui est tout simplement dégoûtante. La gaufre est trop légère et la glace n'a qu'une seule boule contrairement aux 2 affichées sur leur affiche et goûte tout simplement l'eau. Ils essayent d'imiter ce qui se fait un peu plus loin dans la rue mais clairement ils n'arrivent pas à leur cheville et mettent un temps fou  !"}
{"text":"Super cute little shop in Chinatown Montreal with trays and trays of delicious dim sum savories and sweets, at a fraction of the cost of most other bakeries and bao places. The best part? They have these ridiculously adorable and cute animal bao buns (think bunnies, chicks, frogs, bears, and even, yes, Hello Kitty). They can be fit for desserts or breakfast options because they have delicious innards such as: mango and coconut, red azuki bean, and sweet potato. Their bao bread is soft but also very dense, so one bun is a meal in itself. However, these are super reasonably priced at about $1.79 CAD so you can easily get a dozen for a party or brunch without breaking the bank. 

They also come hot as well, so if you want to eat on-the-go, you can get one from the oven cases. 

Haven't yet tried any of their traditional dim sum items, but this place is a definite must-return for me. Check it out if you're in the neighborhood."}
{"text":"Bought two of the BBQ pork bao and although the buns were OK, the filling was disgusting.  Very little meat and mostly a sticky, gelatinous goo which was quite unfortunate. Imagine a pie filling, but savory, and you'll get an idea of what I'm talking about.  Every other bao I have had was filled with more meat and was only slightly moist. 

Being a visitor to Montreal, maybe this is the local style?  If so, please know that this is not what bao should be."}
{"text":"It hits the spot I'd you are hard up on getting a steamed bun. I had the melted custard one and it was not melted enough, but flavor WAS good. The pork with preserved veggies was just OK. I thought the ratio of bun to filling was only a little heavy on the bun. 

Probably won't return."}
{"text":"Some delicious Bao Bao! I ordered 15 buns! They were too cute and looked too delicious, I couldn't resist. Literally stuffed my little travel backpack. I had enough for everyone and their mom for lunch and a snack! 

The buns are so adorable. The teriyaki and bbq pork are forever my favorite to eat. 

They're so ADORABLE - I just wanna SCREAM! 

Located in Montreal's China town. So many flavors and so cute you may not even want to eat it."}
