{"text":"I visited bar burrito yesterday and I was surprised as to how similar it was to Mucho burrito. The restaurant itself was very clean and the staff was friendly. I ordered a chicken quesadilla, it was good. I just wish they offered more than a mild salsa- where's the Mexican heat?! They had a lot of jarrito flavours compared to most mucho burritos so that was cool. I would go back if I was in the area."}
{"text":"Best burrito i've had in a long time. Been there twice and both times has been awesome. Staff is also really pleasant :)"}
{"text":"Food was terrible & service was even worse. Will NEVER got to this barburrito again, the one on Hurontario was just fine so I will be taking my business there."}
{"text":"New burrito spot in Newmarket, I have been waiting on one of these as I am a fan of the Toronto Burrito Boys franchise. Located in a busy plaza this place will have a lot of traffic, something I noticed on my first visit. Assuming this is a franchise I didn't expect there to be the level of disorganization I experienced. They were out of chicken for the burritos and running low and everything else. Staff kept running back and forth between the front and kitchen looking flustered and lost, and food was being prepared at a snails pace. This place could use a solid manager, currently it's not even close to the level of its Toronto competitors, with the wait times as they are they may miss out on the lunchtime crowd who have to get back to work. 

The food was decent, but it was not up to par with its GTA competitors. Some of these complaints may just be starting issues, but the spicy burrito was far from flavourful and were noticeably smaller than expected. However the ingredients looked and tasted fresh so I will make a return trip in hopes of trying the chicken burrito and some nachos."}
{"text":"I love coming to this place when I'm hungry and need a quick bite it's amazing only because they give big portions and tastes good"}
{"text":"Very poor quality .. They Really cheap out on the chicken its full of beans and rice.. I would stay away from this place if your looking for a authentic Mexican burrito... Save your money"}
{"text":"These are Big and good."}
{"text":"Bar Burrito is hidden in a strip mall where other fast food restaurants in the middle of Heartland.  I decided to check it out with a friend to see if it measures up to the other burrito chains.

Similar to the other chains, you can get your burrito in various sizes.  Again, I opted for the tacos as I was on in the mood for burrito.  The tacos were ok, fresh and tasty nothing really memorable though.  I got a side of chips and salsa, chips were a bit bland and salsa was just meh.

Overall, Bar Burrito is average.  If you are craving a burrito in the Heartland area, it will be worth it to stop by."}
{"text":"The staff seemed kinda rude. Toppings are under metal lids, so I couldn't even see what they put in my taco. The lady charged us $2 for the tiniest amount of guacamole. Also, there's no certain price for guac listed. Food is ok."}
{"text":"When you find a restaurant close to your office that is as tasty as BarBurrito it is difficult not to come back again and again.  I started coming here many months ago and though it was time to add a review after turning in my second buy 10 burrito's and get one free card.

The restaurant offers a variety of Mexican food from burritos, quesadillas, tacos, salads and sides (chips, fries, bowl of rice). My usual includes a chicken and steak mixed burrito \"nacho styled\" which basically has broken up nacho chips mixed in with the usual rice, corn, beans, lettuce, cheese, etc.  I add guacamole as an added kick and have it seven up spicy.  Always tasty and always hot.  The burritos come in two sizes - regular and large and usually more food then one person should finish in a meal. 

For those that need and adult beverage, they have a liquor license in addition to a  variety of pop, juice, and Mexican soda.

The owners have to be some of the nicest people I have met and always greet you with a hello and a goodbye. Like most \"regulars\", if I am ordering the usual, they know it better then I do myself and have it typed into the computer quicker then I can ramble it off.  

I will be back in again soon."}
{"text":"They are the best fast-food taco/burrito place in town. The fish tacos are to-die-for and great vegetarian options."}
{"text":"My favorite burrito place in Newmarket by far (fast food wise). I always get the Soy Tacos with all the toppings, and I'm never dissapointed. Very delicious with tons of taco options at a decent price. Would reccomend to anybody looking for a quick bite or a full meal (their extreme fries are also very delicious, fries are crispy and they load on the toppings). They also serve beer if you want to have a cold one paired with your tacos or burritos."}
{"text":"Just like your Mucho Burr1ito clone.... its closer to where I live so its great .... exactly like Mucho though. Love the Chorizo!"}
{"text":"I can think of no reason to eat at Taco Bell when there is a Bar Burrito close by--unless I want KFC maybe?

I had a big, fat, juicy Chorizo Burrito, with a variety of options and hold the rice.  I particularly like the guacamole.  This place will cost a couple bucks more, but for 3 times the taste, substance and quality.  The bottled imported sodas are also really tasty, for about the same price as a normal fountain drink.

I can't compare this to Taco Bell, but if we had Taco Time in the area, it would be closer in substance, but BB is still far better in terms of freshness."}
{"text":"Good service but the food is just ok. Mucho burrito and Quesada are much better and have a lot of flavour. Sorry, but wont be visiting again."}
{"text":"A quick bite between some serious box store shopping, Bar Burrito was a better option than Quizno's, McD, Subway, etc.

If you compare this place to the variety of Burrito places around Toronto and the GTA, this is your standard stock - not special store. 

Honestly, the food was fine, the place was messy, some staff were rude, some were nice, the quantities were inconsistent, the food flavourful enough.

For fast food, this is a decent enough place. I would give the store 3 stars for fast food, but they just seem a bit disorganized and messy. Bad timing or opening kinks."}
