{"text":"Went here with some colleagues for some cocktails and bites. The interior design is lovely and the location is great, across the street from Dupont station.   Fancy cocktails aren't really my thing, I'd rather a glass of wine or a beer but I did enjoy my gin cocktail \"The Sun Also Rises\".   We shared the salt cod croquettes which were tasty, like a crab cake, but I didn't find there was enough cod flavour it was a bit potato-y. We also had some tasty olives, bread, and a cheese that I can't remember but was served with honey and baguette.   All in all a nice spot but not my cup of wine."}
{"text":"I really enjoyed the food and service here. It's a lovely addition to the hood! It's a bit pricey but it feels like a dining experience. The deserts were incredible and I my daughter enjoyed the oysters."}
{"text":"Food is on point and ambiance is great. I'd give 5 stars if it wasn't for the tight space. If you have an opportunity to expand current space, please do!!!"}
{"text":"Amazing!  We went there for lunch and was very pleasantly surprised. I ordered the eggs benedict and it was the best eggs Benedict I have ordered at a restaurant. The side of potatoes were amazing as well. Fast & friendly service with great atmosphere. I can't recommend enough!"}
{"text":"I once wrote a very negative review of Big Crow, which was unlike me as I (a) love food and therefore rarely find cause to complain; and (b) don't like to put down harsh comments. But my experience at Big Crow was so bad that I didn't think I'd want to step inside another Anthony Rose restaurant. When I read the first highly positive review of Bar Bergonia, I thought to myself, here we go again, this fellow Mr Rose must know how to play the folks in the media. Then I read more good things about Bar Bergonia. Not being a stubborn type, I decided to check out this new resto and ended up really enjoying the food. Since then we've gone back several times more. The menu is small, so it's not hard to try out most of the items after a few visits. It's a very creative, interesting set of dishes, visually attractive and delicate in taste. The service is (purposefully?) funky like at all Anthony Rose restaurants. I can put up with that when the food is this good."}
{"text":"Had the grand Aioli and steelhead trout, among a handful of other dishes. Pretty underwhelming flavour wise, and given that you are looking at small bite size portions, just way over priced. Happy to pay a premium when the flavour is like bar raval, but bar raval this is not. That being said, the folks were nice. A little frustrating you can't put your name down for a wait list - maybe text me? Call me? We have these wonderful cellphone things ... Let's use them?"}
{"text":"As a local and a huge fan of Rose and Sons, I was looking forward to the opening of a bar on the DuPont strip. While the food is great, the service has been consistently poor. We probably won't go back.  Would recommend Anthony reevaluate the culture and try to recreate the level of service found at his other restaurants."}
{"text":"I've been meaning to check out this joint since it opened and am overall very satisfied with my dining experience at bar begonia.  In my opinion, it has a very similar vibe to black hoof or bar raval...good drinks, tapas style dishes meant for sharing, small intimate space...just a good place to drink, chat and snack away.  I don't think they take reservations so there might be a bit of a wait at peak hours and/or on the weekend, especially given the size of the place.  We were able to snag a table for two on a friday night around 7, but by 8:30-9 there seemed to be a few groups waiting for tables.   Our server was very friendly and helpful with recommendations and also very knowledgable about everything on the menu.  We ordered a couple of dishes from each section of the menu and I would say that there were a few standout dishes but the rest were average.  My favourites were the gougeres, sardine tartine, salami savoie, and the chocolate ganache dessert.  I think my least favourite dish was the duck rillettes.  I've heard many people rave about the beouf bourguignon but I honestly thought there was nothing special about it.  It was tender and nicely seasoned but I've made braised beef at home before that tasted just the same. I didn't find it to be a standout.  We ordered beer and wine so I can't comment on the cocktails but I will say that the bar was definitely poppin.    I would come back for drinks, the gougeres and tartines."}
{"text":"Having read good things about Begonia, we were looking forward to our visit. We had a sense that something was wrong when we arrived at the empty restaurant with the loud blaring music. We asked them to turn it down, but it crept back up although there were only two other women sitting at a nearby table. The menu was limited. We chose the sweetbreads, which are one of my favorite dishes and seldom available. They were just okay, with a heavy batter and a few slices of yellow beets with a red beet puree. We thought the service, given the empty place was terrible. We sat with our empty plates and no one bothered to ask if we wanted dessert. We had to ask for a dessert menu and one was slapped on the table. The server was joking with his friends and we had to call him to ask for the bill. We skipped dessert and left. We have just come back from two weeks in London, England, eating at everything from Ottolengjhi to old tried and true spots. We would not come back to Begonia."}
{"text":"Went here for lunch as I've been eyeing this place for months.  Food was great, but service was awful.  It was our first time there so we needed some guidance on the menu. I mentioned this to the server, but she offered no help at all.  It wasn't even busy.  We ordered 4 dishes and after we finished 2, she thought we were done and asked if we wanted anything else.  We had to remind her that we still had more to come.  Those are not the only examples that totally turned us off, but too long to mention.    The chef and cooks in the kitchen seemed to have a much better attitude than the server.  In fact, one of them greeted us when we first came in, as our server didn't show up until a few minutes after we were seated.  Due to this awful experience, my hubby swore he would never eat here again.  Me?  I would give it one more chance.  I did enjoy the food."}
{"text":"Overall experience: 9/10 Food: 8/10 Atmosphere: 8.5/10 Service: 8/10  The friendly happy face greets you outside and the cozy, dark atmosphere keeps you feeling good once you walk in the door. Sure to be an annex staple, the place is buzzing, so there is no doubt that Bar Begonia has got the vibe part down.   Food is shared. My party of four had a number of dishes from each portion of the menu. Whitefish bouillabaisse is delightful, as was the duxelles tartine. Gougeres, which I had seen photos of, disappointed me by being cold and underwhelming. New Brunswick oysters were being served, which were delish!  Cocktails are definitely part of the schtick here. They have negronis on tap! I also tried The Sun Also Rises (think gin, grenadine, sparkling wine) which was citrus-y and refreshing.   THE BOTTOM LINE: food's good but can be underwhelming, but the place makes up for it in atmosphere and a feel-good vibe."}
{"text":"Cool bar, we had a large party for a birthday. They handled the party very well. The food was quite good, drinks were better. Prices were reasonable too."}
{"text":"I loved it!  The food was really delicious (great for sharing!) and the service was really great (super friendly and knowledgeable staff).  The prices were not cheap but to be expected for the quality of food they serve. I would definitely recommend it and will be be back soon!"}
{"text":"A really nice addition to Anthony Rose's empire, with a French-inspired menu. The ingredients were really good quality and prepared well. I really enjoyed most of the starters (sardine tartine, steak tartare and raw trout were all really well flavoured), though the cauliflower was a bit disappointing. I shared the duck confit, which was good but got a bit less interesting after a while- definitely a good sharing option, probably not a great choice if you're having it on your own. I also shared the steak frites, which was well seasoned but not anything special. The portions were a decent size generally. The prices are a bit high, but that's to be expected for a French restaurant in the Annex that makes good food.  The drinks selection was good, and the prices are pretty standard. The servers were friendly and helpful, though they were quite busy."}
{"text":"A fun and fresh interpretation on delicious french countryside snacks. Cocktails are given some thought as others have noted and the dishes are rich and interesting accompaniments, and also quite visually inspiring at times - bonjour, le grand aioli!   It's been open for a few months, but BB still feels like a place that you'd have to know about as it's not immediately obvious from the outside how to enter and what exactly this space is used for. (Although, with that being said, it may be a bit unusual for a serious Torontonain to be unfamiliar with Anthony Rose's spots at this point I would think)   Anyhow, they should probably work on the step situation... perhaps I'm already a senior-in-training but I managed to trip on the way in AND on the way out. Now that's talent!"}
{"text":"C'est fantastique! Such a lovely restaurant, with great staff! The restaurant itself is fairly small, although it appears that they are building a patio outside which will provide additional seating in the summer months. J'adore this little french bistro avec tout mon coeur! The impressive focal point is the large horseshoe shaped bar with marble (or maybe it's granite?) counter tops. I recommend sitting at the bar to observe the baristas and chefs in action!  The walls display large sketches of naked (and shapely) women.  The large Edison light bulbs combined with tea lights on each table provided the perfect ambiance and dining experience.  We ordered le Petite Grand Aioli (nothing special, but delicious nonetheless), the Flat Iron Steak with a parsley butter (cooked medium rare to perfection) and the Duck Confit (similar to a cassoulet).  The meal was simple yet elegant, and the glass of 2009 Bordeaux enhanced all of the flavours. For a sweet treat, we ordered les beignets au beurre salé (salted caramel). I am a big fan of salted caramel, however I recommend ordering something a little lighter if you're feeling full after your meal. Et voilà. C'est sûr, je retournerai!"}
{"text":"We went to Bar Begonia shortly after it opened, and found it to be fun, good food and cocktails, and noisy. Now, over a year later, it has maintained all of those qualities.  I had an excellent Vieux Carre to start and we moved on to a very reasonable  Pinot Noir for $60.  The Guinea Hen Terrine was wonderful with rich taste, and interesting mustard accompanying it. The Veal Tarine was a cold dish, unusual and yet full of taste with again and interesting mustard included. Recommendable. The Turbot, not often seen on menus, was outstanding with a great sauce. (I have to admit a certain prejudice in thinking that Turbot is one of the best fishes there are). We very much enjoyed the duck, crisp, accompanied by good hot french fries. And then, against our better judgement, we decided to have desert and had the Paris Brest and we were very glad that we did. Again unusual, interesting tastes and well executed.  There is no doubt that this is a fun and lively place. However, at the same time it is loud. It is still clearly an 'in' spot, well worth visiting."}
{"text":"Came here after an underwhelming dinner - friendly staff and great snacks. Interesting cocktails. The Manhattan on tap wasn't my fav but a cool concept none the less"}
{"text":"Friday night with my bestie at this inspiring place. They have delicious Salt Spring BC mussels served with bread.  What a wonderful plump and briny treat! I made the mistake of overordering as I also got the Pomme Dauphine and frites.  The Dauphine was inspired little potato croquettes with anchovies and bird chilis and the frites where textbook perfect.  It was a carb loading evening.  But what is more apropos with my dear bestie after a long week!  Service was friendly and they were very accommodating.  Delightful to look forward to come back here when the patio can be taken advantage of!"}
{"text":"Underwhelming. I didn't find the food spectacular, just okay, nothing special. The steak tartar was bland and unmemorable. Foie gras was good but not anything different or special. The tartines were good but once again not memorable. The one thing that bothered me was that the menu just had names in French with no description. I'm not 100% bilingual but I can get by with my French, and even after translation you still couldn't really figure out what it was.  For example, \"le grand aioli\" which translates to \"the big aioli\".  What exactly does that tell me about the item?  When asked, it's an antipasto plate...how does \"le grand aioli\" let me know that?  A little pretentious.  Food was okay, but I would rather go elsewhere."}
{"text":"The good: Great French inspired spot and a welcome addition to the neighbourhood. French tapas style food. The gougeres were phenomenal and the Tartines certainly standout! Drinks and cocktails are on point with a varied and innovative cocktail list to please anyone. We had a consistency issue with the Manhattans coming with a cherry one time or an orange peel another, but both were great and flavourful so no complaints there.   The ok: the \"grand aioli\", their sort of French Antipasti wasn't so \"grand\". The steak tartare was good but not exceptional and its flavours were  overpowered by the chips it's served with (We probably had high expectations for it).  The bad: nothing was truly bad but the service was a bit slow (very friendly though) on a busy Saturday and remained so even as it emptied out. So order your 2nd drink the moment your first arrives. It's only been open a few weeks so will update if the service changes on our next visit.   The only sight disappointment was the Beignets' apple sauce, not the beignets themselves, but as the menu is supposed to change seasonally that apple sauce will not be missed if changed."}
{"text":"Steak tartar and root celery and apple were very good. Nice happy hours pricing.  Great atmosphere and music.  Unique gin and tonics. Great to try.  Lots of pommes frites to help with that pending overhang."}
{"text":"French food and French attitude. Another customer service fail at a place with such great potential.  A large front patio with an outdoor space in the back and a tasteful high quality menu with a great looking bar.  Our server was rude all the way up until it came time to collect her tip. Typical at all of the rose & sons related venues. Good food, bad people.   I would come back to enjoy the patio but my expectations for quality service are nonexistent."}
{"text":"Went to Bar Begonia with a couple of friends and managed to get the last table of four available during a busy dinner service - what a great atmosphere to walk into!  The simple but tasty looking French menu covers all the bases of appetizers, entrees, and desserts, but really brings the noise on cocktails. Our group wanted to try practically everything, so we ordered at least 2-3 from each section of the menu, as well as a cocktail or two each.  To start: the drinks are strong and delicious. What more can you really ask for? I ordered the Brooklyn Cocktail to start, which was a great balance of sweet and smokey, with just the right alcohol kick. After that, I followed it up with the house draught Manhattan, which I wanted to gauge the quality of something made en masse, and I was not disappointed. Am a huge fan of Manhattans, and considered finding a way to serve draught Manhattans in my own home. To myself.  Now, the food. My goodness the food. I won't go into every detail, but we ordered gougeres, pommes frites, salt cod croquettes, duck rillettes, steak tartare, tartines, beef bourguignon, and duck confit for the apps and entrees, and ended our meal with a creme brûlée and beignets. My favourites were the pissaladiere tartine, duck rillettes, fried egg with wild mushrooms creme fraiche, and the duck confit.  Would highly recommend going there for a night out with friends, and splitting as much of the menu as you humanly can. Can't wait to go back!"}
{"text":"I came here over the weekend and ordered the below items 1. Gougeres  - alright  2. Steelhead trout - it looks really good but it was way too salty 3. Duck Confit - the duck was juicy but I didn't like the sauce on the white beans and the escarole. It overpowered the duck. 4. Foie Gras & Liver Parfait - the patee was good but they skimped out on the brioche 5. Sardiness - alright...  The service was attentive and quick. I don't think I need to come back but interesting flavours overall.  p.s. I think they need a new dishwasher, every plate I used had some left over crust."}
{"text":"I came here with low expectations and was blown away! First off it's a cool location. The service was next to flawless, the drinks came quick and were a fair pour. The wine was delicious and I can honestly say that the steak was in the top class of steaks I've ever had. I know, a big statement but true. I had the steak frites and never had a meal prepared this way and was absolutely delighted. The seating is tight however, I could t hear other people's conversations. It was just a wonderful experience and I will definitely be back when I'm in Toronro next. You'll need to make a reservation as the restaurant was packed. It's clean and really fun. Trust me on the steak! I kid you not...just incredible. The waitress and rest of staff were very knowledgeable too! Can't go wrong!"}
{"text":"Great place for a casual dinner with friends! Tables and portion sizes are small as you can tell from the $7 price tag on most items. We got 6 plates between 3 people for dinner.  Order one of the signature cocktails, they are so creative and well presented!  Lost a star because I showed up before my friends and the host awkwardly asked how long they would be because he wanted the table back for other guests. Rude as there wasn't even a line, just one other group waiting!"}
{"text":"Have become almost a regular here due to their fantastic cinq-a-sêpt menu (which is actually available from 4 to 6pm). Oysters, bubbly, escargot beignets, all from $5 to $7 - what's not to love? Enjoyed elsewhere on the menu: frites, mussels, foie gras terrine, all delish. Charming frenchy decor and a lovely summer patio. So glad to see something in this spot that was empty for so long!"}
{"text":"What a great little spot with a French cuisine inspired menu!  Mixed drinks are a little pricey but nice sized. The  hors d'oeuvres are well portioned and very well executed.  Transition to a salad before the mains - the duck confit slightly out flavours the flat iron steak. (Barely!)  Deserts such as the apple tarte tatin and the beignets are great choices.    service is very friendly and the only down side is it's rammed with people and loud!   They have great music playing too. LoL weird thing to report on, but it matters !   I'll be back sometime soon to try more of the menu.  Many pics posted for your Yelpucation.   Anthony Rose has done it again!"}
{"text":"We had a grand ol' time at this French bistro / cocktail bar...the drinks, atmosphere and food were all on point. We sat at the bar and greatly enjoyed the experience.  The following yummies were consumed:  French onion soup - very tasty...it was smaller and less overpowered by cheese/bread than onion soups tend to be. Sometimes an onion soup is like a meal in itself but this was nicely balanced.  Chicken liver & foie gras parfait - a fantastic pate that was even better on their homemade potato chips (which we ordered for $2 extra when we ran out of crostini)  Flat iron steak with mushrooms and cream sauce - something about the combination of steak with mushrooms/cream is just irresistibly good  Frites with aioili - hot and crispy...just excellent  All in all, this is a great addition to the Dupont strip!"}
{"text":"Had the fennel salad, brussel sprouts, mussels and duck confit.   Fennel salad was very fresh and well balanced with dill and a tangy vinaigrette.  Brussel sprouts were very hearty, cooked in comte cheese and cream.  The mussels were delicious and the duck confit was balanced with sweet flavours.   The dessert was decadent. Bar Begonia had a very French bistro feel. The wine menu was quite good.   We will come back."}
{"text":"Great new place. They have captured the essence of a French bistro. Tapas style servings with great cocktails. Likely to be a hot spot in the city"}
{"text":"Meh. My second attempt at a Rose joint. Service was quite slow despite being almost 2pm.   The steak tartare was missing something - capers, I think. The texture was fine. The size of the yolk was too big for the amount of beef there was. Needed one more itsy bitsy tablespoon of meat for the amount of yolkiness.  The country terrine was stiff and not appearing like the pics I've seen online. It was served with 3 small crosscut baguette slices. 3. Not even long diagonal cuts, but 3 almost stale baguette pieces that would be better suited to top a bowl of French onion soup. Even if we cut the terrine into 3 equal ridiculous slabs, they'd still be too big to top the 3 slices of baguette provided. We had to ask for more bread.  We also wanted a sardine tartine, but the power went out so their toaster oven didn't work and according to the waiter, they could do it in a pan but that would \" just take forever.\"  That does not take forever. Making a grilled cheese takes longer than it does to toast 1 slice of bread in a cast iron skillet. Bitch, please.   We left unsatiated in more ways than one."}
{"text":"I am a little conflicted in writing this review.  I love the atmosphere of this place but the food was a big miss for us.    Their three distinct spaces all offer different feels.     The front patio is pretty and great for people watching.  This was where we sat and were lucky enough to have experienced a nice breeze to help cool us off.  The vibe I took from this space is one of a lazy, cocktail inspired, catch up with friends.     Their inside dinning room has a view to the kitchen and certainly more of a restaurant feel to it.   More on their food later, but I don't really think of this as a dinner location so would probably not choose to sit inside unless it was deep winter and I was looking for a lazy, cocktail inspired, catch up.    Their back patio is covered in white gravel stones with picnic tables and has a slight downwards slope, along with a handful of outdoor games, ball toss, boccee etc.    It doesn't seem to fit with the rest of the space and reminds me more of a university bar (which is cool if that is your thing but certainly gave a different feel that the other spaces).   The cocktails are amazing, amazing, did I mention they are amazing?   We had a mint julep and their black betty, with black betty being the winner.   They serve crushed ice with their julep, which if you don't drink it quickly, melts and dilutes the drink too much.   It does make for a pretty presentation though.    I loved our servers.   We were served by three different gentlemen over the course of the evening and they perfect, which is saying something because the place was packed and it was BOILING hot, like desert in the middle of summer hot.    If the review was based on just the above this would be a solid 5 star, however, their food was such a fail.   I don't know if the chef is on some sort of diet where everything needs to be overly acidic or pickled, there was a heavy hand of both in most of what we ordered.   We ordered:  Gougers - okay, felt like there was something missing although I couldn't say what.   Oysters - they were fresh and yummy but only arrived with one mignonette - no hot sauce, no fresh horseradish, although both appeared after asking for them   Artichokes - ah,  I like artichokes but these had a pickled taste to them which became way too repetitive.  They were served with a watery aioli which also had too much acid.    We would have enjoyed them more if the aioli had been creamier.    Lyonnaise Salad - this comes with a poached egg, although, one would never know this based on the description on the menu.   We only knew because we saw it go to another table which peeked out interest.    This salad was terrible.   It is very difficult to mess up a salad, but messed this salad was.   The egg was over done and greens too acidic to the point of being inedible.   So bad.   Duxelle Tartine - mushrooms on what tasted like a rye toast.   I love mushrooms and I love bread and I did not even like this dish.  Again, seems as though there was an acid on the mushrooms.  There is not enough fat this dish to require squirts of lemon.     We planned on staying longer and eating more but just couldn't do it based on our last three dishes.   Service great, cocktails great, atmosphere great, food - definitely not for us."}
{"text":"Really great spot for a night out if you're in the area. Appetizers were all delicious, ingredients were fresh. Prices are a bit high, but that's to be expected in the Annex. Highlights being the raw steelhead trout, which had a nice variation of flavours and textures. The sardine tartine was also a surprise winner, a little bit fishy but mixed well with the fresh herbs and chili on top and random bursts of saltiness. The mains were good but not that memorable, I had the steak frites - the fries were good and steak was well seasoned and cooked medium rare."}
{"text":"Anthony Rose's domination of the Toronto food scene continues with Bar Begonia, a cozy and charming little joint made to resemble a French bistro.  I knew walking into the place that I had to eat the French Onion Soup au Gratin. If it's on a menu, I'm eating it.  It's an above average variation on the dish, for sure. The broth is rich and thick, and the bread and cheese are typically delicious. (I could've used more cheese, however.)  We started with an order of the Steak Tartare, Gaufrettes, and that too was very tasty. The tartare, when mixed with the accompanying egg yolk, was rich and flavorful, while the \"gaufrettes\" (basically just waffle chips) made for an ideal vehicle.  I closed out the meal with an order of their Creme Brulee and I will easily admit this was my favorite dish of the night. The burnt crust was probably one of the thickest I've ever encountered but it was delicious. The custard inside was irresistibly creamy, addictively so.  The ambiance is pretty nice, too, so I'd say Rose has another winner on his hands."}
{"text":"Great new addition on Dupont and to the cocktail scene in Toronto. Very cool, warm and inviting space. I didn't try the food; came late and we were seated at the bar. Fantastic back bar and cocktail menu including a killer Lot 40 Manhattan on tap. Super nice staff and very cool crowd. Will definitely go back for the food very soon!"}
{"text":"Went in for a couple of cocktails and some appetizers. We had oysters, the olives and steak tartar. Everything was vey tasteful. Our bartender was very friendly and gave us good suggestions on things to do while in city."}
{"text":"Both the interior and patio looked very nice and inviting.  The food was pretty good, but would not say it was amazing. Prices are fairly reasonable. The steak tartare came with fresh made chips and was pretty tasty. The escargot beignets were decent, but not a stand out. The best dish of the night was the Cornish hen. It was moist and the sauce was delicious.   Service is awkward and a bit slow. I ordered a ginger ale and they asked if we wanted a straw and ice. When the drink came, they waiter repeated \"ginger ale with a straw, no ice\". We asked for the bill and they waiter forgot."}
{"text":"Very charming place with a very cool vibe. It has a nice front patio. Note that the patio closes at 1130 due to local noise bylaws. They make great cocktails. However as a vegetarian there is literally nothing that I would eat at this place. They do have fries but I am very tired of fries. If there is a vegetarian in your group I do not recommend this place for food. Drinks only."}
{"text":"Anthony Rose is doing something different (again). This time he turned an oddly shaped edifice (was once a pretty good sushi spot, then a weird moon themed place that nobody went to called nite caps). Here we have a brilliantly decorated French inspired bistro snack spot. Sorta a French-Bar Isabel. 100 seat space opening in the back should inject some youth into this place, still searching for a demographic identity. Lots of fancy older people enjoying fine meals inside. Big patio space in front. The back space is mostly gravel, picnic tables (bocce ball area and bean bag throwing game incoming). Excited.   Food: fois gras dish (not too salty) and mushroom duxelle dish are both phenomenal. Lots of flavours. Both served w/ or on nice bread. I'll be back. Dupont represent."}
{"text":"Noticed the raised patio and knew I wanted to check it out. The inside was unexpectedly fancy! I immediately regretted showing up in sportswear after playing two hours of tennis but hey, I needed food and beer. No one seemed to mind except maybe the cute girl on the patio... I probably stunk too. She probably has a boyfriend anyway.   Bar Begonia, a VERY pleasant surprise, probably my favourite find in the last couple years. We had beef tartare, my buddy had the horse steak, I had the (beef) steak, and we shared a side of fries. I tasted his horse and it was very nice... but seeing as how I am obsessed with beef, the highlight for me was my medium rare, sliced & delicious cut of meat. and you know what... the fries are the best I've ever had. That's a pretty bold statement because I've had a lot of fries, but these were perfect. I would return JUST for them. If you think I'm making this up, try them.  I didn't get a chance to try any cocktails, but our bartender said it's what they are known for. And when I try them out, I'll update this review. Pretty high expectations at this point because of how great everything was. I like the layout inside. Sitting at the bar, you have an attentive bartender right in front of you. Behind him, you see a line of cooks. It looked pretty clean back there, and the cooks appeared extremely focused. Very nice to see! Can't wait to come back."}
{"text":"This is my favorite brunch spot in Toronto. The best part is that it's somehow never too crowded to get a table, despite how it's clearly the best brunch spot. I feel sorry for all the folks lining up in the cold for inferior food.  Everything I've had for brunch so far has been exceptional. It helps that their menu isn't huge, so I don't have to agonize over decisions. The side dishes that come with most of the brunch options are also weirdly good. They're not just garnishing your plate. My favorite is the fried eggs with duck confit.  They take their coffee seriously. No diner coffee here. Toronto isn't a city for cocktails, but this is one of those places where they get it right."}
{"text":"This place it great, wonderful menu (food and cocktails) and great service!"}
{"text":"My husband & I took a friend for dinner there last evening. After a brief spell at an inside table, we were moved outside to a table next to the fence abutting Dupont. I was seated right next to the fence. On the sidewalk, about 4 ft away was a row of large garbage bins waiting for pickup. There were probably a dozen bins. I had noticed them on the way in. Once seated on the Bar Begonia patio, I could immediately smell the garbage. The stench was awful. I didn't say anything at the time as I hoped that our friend, who was seated a couple of feet further from the edge of the patio, couldn't smell the garbage &, my husband can't smell very well. Also, by this time, there were no empty tables outside. The restaurant really needs to do something about this. The smell of the garbage spoiled, for me at least, what would have otherwise been a lovely dinner."}
