{"text":"This place is excellent, from the service to the wine (especially the wine), to the food, to the stunning minimal interior design that seems to take you far away from downtown Calgary, not to mention they even have some interesting spirits.

The food here is really good, we had some Comté cheese with sourdough bread and the Beef Tartar all of which were beautifully presented and prepared. Lots of flavor and attention to detail.

We intended to come in for a bottle but they were pouring some excellent wines by the glass that we couldn't pass up all of which were at excellent prices. From some killer Riesling, to a fun and oxidative Chardonnay from Jura, to an delicious Red Burgundy, the wine selection here will not disappoint. 

Did I mention the excellent interior that made you feel immediately welcome and as if you had been transported to Copenhagen?

Thank you Thomas and Will for the excellent service, the good juice, and the excellent experience overall, we can't wait to come back."}
{"text":"Nice little place.  Very friendly, great wine selection.  Try their Shishitos peppers with yogurt, so good!"}
{"text":"What was unsuspecting at first quickly delivered a superior quality of unique wine and food selection that I could not find probably anywhere else in the city. Do not be fooled by the downtempo casual vibe, these guys know what they're doing and it is worth jumping on the ride."}
{"text":"I'm really on the fence with this place. I want to like it because it's hip and new but then you experience it and it's just . . . meh. 

I get it, these hipster tapas places are what's cool. You get the quaint, intimate settings and quality ingredient dishes. But for ~$20 a dish, I expect to be full! 

We ordered the scallops (which came with persimmon, pumpkin and dukkah), bison tartare (with sunchoke and sunflower seed), sweet potatoes (granola, mole and herbs) and PEI oysters with cucumber relish. 

We devoured the beef tartare, the earthy sunchoke and sunflower flavors were great with the beef. We contemplated getting another order after we finished the other dishes and were still starving. 

This place is marketed as a wine bar, so maybe it's more geared towards snacking while you sip and we shouldn't have expected a substantial meal?

They say don't knock it till you try it. Well I did, and this place isn't for me."}
{"text":"Donald Trump would love this place. Von Der Fels is just as arrogant, just as self righteous, and just as delusional towards the truth as this ersatz President of the United States.

Von Der Fels is hipster Heaven, and that 
nonchalance, aloof, cap on backwards, \"I care more about myself than you\" attitude reigns. This restaurant is doing all its patrons a favor by allowing us to partake in their food and service. 

With a reservation, we were still asked to wait since our table was not quite ready at the appointed time. The table happened to be the worst in the house, all the way in the rear, close to the toilet. Our server had a supercilious affect, adding descriptions to certain wines that made me cringe. As we went through our menu questions, he loved everything, but explained that everything would most likely come out in any order, since food is served when the kitchen finishes the dish, no matter the sequence. The first dish served to us were the French Fries. Huh? Nothing tasted real good. The fried chicken was greasy. The spaghetti Bolognese was extra sweet, with too much sugar added to the sauce. Bread was mediocre. Remember, there was no sequence to the service.

I have dined at 3 star Michelin restaurants in Paris, London, and Hong Kong, but never encountered such haughtiness as what resonated at Von Der Fels. Arrogance doesn't always carry a Louis Vuitton bag. We left angry, depressed and disillusioned. Von Der Fels is so unlike the soul of Calgary, which is natural, down to Earth, without a hint of arrogance. Von Der Fels is an alien manifestation in this city."}
{"text":"Fantastic, unique food. Try the donuts and broccoli and lamb pasta dish. Skip the stuffed chicken wings. The wine menu was outdated so we couldn't look at their selection. Apparently it's good."}
{"text":"Small wine bar in downtown Calgary, creative small plates and one large steak for sharing on the menu. I had an exceptional pea dish with goat curd and smoked marrow that was incredible. The food took a while to arrive which is totally fine considering they only have two chefs in the kitchen at a time to serve 30+ guests. They generously comped the dish which they didn't have too which I thought was great hospitality."}
{"text":"Cozy new wine bar in Calgary that pays attention to the details. Will and Thomas have put together a great culinary experience. The charcuterie and baked oyster are must haves. As for the wine, just let either of them guide you to the perfect glass."}
{"text":"Bar Von Der Fels isn't for everyone. If you are content with happy hour house wine, this place isn't for you. I had a few bad experiences drinking house wine at restaurants and now have sworn off that vile stuff. I purposely came here with my buddy to enjoy a glass of wine and some bites. 

I tried two wines that I really enjoyed. Each glass was $16 - which I thought was very fair considering how much I'd pay for that same bottle at my liquor store. There was one that I am trying to buy by the case but my liquor store said it was quite exclusive and hard to get. Grr.

The food is delicious. The Chinatown oyster was so fresh tasting, it was ridiculous. There really isn't anything I've tried that I wouldn't order again. The staff is helpful, so just talk to them about their recommendations for wine and food. I like that I get to taste some wines before committing to a glass. 

For two people - expect to pay over $100 for two glasses of wine and 4 small plates. Not cheap but I felt it was worth every penny."}
{"text":"This place is hard to spot and I honestly would never have noticed this place driving past as there are no noticeable signs and the door is quite plain. 

Street parking is available all around here, and I can't imagine I'd visit this place any earlier than 6pm so free parking after 6pm all around! :) 

Made resos for the place and glad we did as the space is quite small. It didn't look as pretentious or fancy as I thought it would have looked based on the reviews I read prior to visiting. I like the dimmed lighting and the plain decor; overall ambience felt pretty casual and intimate which could be excellent for dates!

Food is delicious here but I wouldn't ever come here to have a full dinner, unless you don't mind spending all the $$$s and plan to order one of everything on the menu. The portions are small and are meant to be eaten to compliment your wine (which they have a huge selection of) and definitely don't fill you up to leave you stuffed. 

The wine menu here is extensive and to be honest, a little intimidating (for me anyway; I know nothing about wine). Our server was pretty good at making recommendations but I couldn't help kind of get the vibe that he was a little condescending. Maybe he was annoyed at the bajillion questions I asked and recommendations I asked for, or just was having a bad day. Meh. 

They said the menu changes quite regularly here so I'd love to give this place another visit for a special night out and/or a fancy date night. If you are super into wine, and looking for a place to sit at with drinks and some good food, I'd recommend this place. If you just like to drink to get drunk and you don't wanna spend $$$ and you wanna leave stuffed, then this is most def not the place for you. You've been warned! :)"}
{"text":"I love this place. The staff are very professional and knowledgeable. The wine \"list\" is amazing,... They are adventurous and keep mixing it up - there is  alway a new wine to try from their amazing collection that samples options from all over the world. In terms of food, the fries are awesome. I haven't gone there for a full meal yet but plan to soon!"}
{"text":"Interesting dishes and small menu - they know what they're doing. Surprised that their soda was $3.50 for a small glass, likely half a can? Intimate setting. Would rather have drinks here and go eat down the street at Foreign Concept."}
{"text":"Great experience at Von Der Felds.  We asked for the tasting menu and it was unbelievable.  Started with the smoked olives, hibachi roasted shiitake mushroom and brocolli and then the veal tartare.  Wow.  Finished off with the linguini al dente and stuffed deboned chicken wings.  À grest expérience with great recommended wine pairings."}
{"text":"Beef Tartare best in Calgary!!!  Nice and intimate spot. Drinks were delicious!!!  Our waitress was great and recommended dishes to us. Everything was so good. We had calamari, stuffed chicken wings, smoked olives, charcuterie plate and the beef tartare. We will definitely be back."}
{"text":"I honestly have no idea what all the hype is about. These guys need to seriously get over themselves. The last time I experienced such arrogance was in Toronto and never at this level in Calgary. The gist of this place is a small space lacking any real ambiance (maybe hipster heaven meets your uncle's diner?) It feels small but not intimate, decor is meh and lacks any real character. The server/bartender was beyond arrogant and condescending in answering questions and explaining the wines. The Old Fashioneds we ordered were adequate but not mind blowing and the wine, although not typical, was better than average but also priced at $15/glass. The food was hit or miss and very pricey for tapas. The hand rolled pasta was good, although small portion size, the grilled broccoli was cold when it arrived, the sunchoke beignets were quite good paired with the caramelized yoghurt and the hickory smoked olives were tasty. For me, after reading all the local media hype, I was quite disappointed. One great dish paired with arrogant service and a hefty dinner price doesn't add up to the value I'm looking for."}
{"text":"This cozy little wine bar only opened up last summer in Vic Park. I've had my eye on it for awhile and finally had the opportunity to try it out with some friends.

While we didn't partake in any food options this evening, our wine experience was above par. No wine list here, only a few spots at the bar accompanied by a handful of tables, we were greeted by Thomas with questions as to our wine preferences before he personalized a selection for each of us from one of the 10-12 bottles of red abs white wines open at the bar. The offerings change throughout the evening as bottles are consumed and new ones are opened.

Whether we were in for a red wine suitable for a cold winter night to a white that was sip worthy without breaking the bank, there were plenty of choices to be had with equal amounts of knowledge sharing on the grape and region. 

Bar Von Der Fels is a must try, making for an approachable and enjoyable wine bar experience. If you need a wining partner, I'm in!"}
{"text":"Unique wine bar located in the Beltline!

They had small dishes that are great for sharing. I tried the shishito peppers, roasted broccoli, beef tartare, and the spaghetti! All four dishes were full of so much flavour!

I wouldn't recommend large groups for this place. It is good for groups of four or less. It's pretty small, but cozy. 

I look forward to visiting and tasting more wine offerings!"}
