{"text":"This is our favorite burger place on the Westside. Great vegetarian burger and you build your own-- including sauces and fixins! Large beverage selection to accompany the great food and appetizers!"}
{"text":"Went here with my family in the 5-6pm hour.  Was surprised to not see too many people in the restaurant, maybe half dozen tables seated at best.  Given the limited number of patrons in the place, you'd think service would be quick...think again.  The food at Bar 145 is relatively simple fare, with burgers as the feature menu item.    So with 3 of 5 people in my party ordering burgers, I wouldn't see it taking more than 10 minutes to order and receive food.  It actually took 20 - 25.  To add insult to wait times, the french fries clearly had been sitting under a heat lamp (i.e. - not fresh from the fryer).  My wife's veggies burger was also lukewarm.  The sauces I asked to be on the side were actually put on the burger (no harm...but that wasn't the ask), and my kids burger didn't come with the tomatoes he asked for.  This level of service and quality surprised me for two reasons: 1) the place was almost empty, and 2) Bar 145 has been open now for at least a few months, which I would think quality and delivery times would have been worked out by now.    By the way, this was my second time here, and service was really slow that time.  So, for the prices they charge for \"premium\" burgers, my expectations are a little higher.  This place will be put on the \"maybe, likely not\" list going forward, unless I'm absolutely craving overpriced and lukewarm food."}
{"text":"Saturday evening and not crowded, not surprised after we saw the service.  Out of multiple menu items.  Had one kids menu in entire restaurant.  Even if you have to wait 30 minutes somplace else worth waiting and skipping Bar 145."}
{"text":"Build your own burgers.  For my preferences this place is right on point, but it is not for everyone.  You have to know what you want to eat in order to be successful in your order.  The fries are great.  Charcuterie also great.  Management and staff here are very nice and attentive.  Food is consistent and above average.  I frequent this place and my best recommendation is to not spring for the Kobe beef.  The bison go for it, but not the Kobe."}
{"text":"Had high expectations for this place. Unfortunately, it let me down. Kindly greeted and sat promptly with numerous open seats around the restaurant. About a third of the way through our meal, the staff seats a very large inconsiderate group right next to us. Remind you, I said numerous open seats but the staff felt the need to seat this large party right next to us even though at 5 pm the place was wide open. Back tracking, our meals took some time to arrive as I watched the three servers huddle in a serving room by the bathrooms chatting it up. Eventually when the food came that was the let down. Tempura beans were good but had better. My sherry onion soup was the worst. The only taste to it was the sherry and it was unappetizing. My build your own burger was cooked to order but the grade of the burger was poor and very greasy. Also on the small side. They need to go with just a bit leaner better quality burger to fix that. After my meal the entire plate was dripping in grease. No complaints on my wife's salad. After dinner took awhile for a check and the server never came back to see if we were ready to cash out, left or bill on the table and left. Poor all around but the beans saved it from a 1 star score."}
{"text":"Stopped in for happy hour. Service was terrible, slow and rude waitress. The food was ok. It was so smokey from the kitchen my eyes were burning and after leaving all of my clothes smelled. Won't be going back."}
{"text":"My wife and I just had dinner here (2-27-15). I had burger that was mediocre at best. The mac and cheese was good, but not great. My wife had a black bean burger that was lukewarm and flavorless. The potatoes she had were just as forgettable. Not much of a reason to go back."}
{"text":"Bar 145.  Wait time to be waited on was unacceptable and there was minimal business.  Wait staff did not know what they were doing.  Did not know how to take an order.  The place needs a manager that knows the restaurant business.   Never saw a manager. Training is lacking.  The food was acceptable at a minimum."}
{"text":"Awesome place for smokers. The patio is the garage door style and apparently people can smoke at the bar and tables because all the doors were open. Very disappointing since it was a nice night to sit outside.  The food was ok. I ordered the caprese salad with salmon and realized I'm a traditionalist when it comes to caprese and pan fried salmon. The salmon was moist and broken up like tuna from a can. And there was more arugula than anything. Not my style.  On a positive note, the truffle oil fries were delish and I think my husband enjoyed his party melt."}
{"text":"The good: place is nice and new -very trendy look, very good craft beer selection, great burgers, and salmon sandwich.  The tempura green beans were terrific - nice spice from the peppers.  The bad: the poutine was terrible - it was more like poutine soup.  Honestly, you just drizzle gravy over poutine folks.  You don't soak the food in a bowl of gravy.  The duck confit in the poutine fries was more like pot roast - it had no texture from the gravy soak.  Prices are a tad high.  Service was good.  Music was fun.  Lots of TV's. Overall, we'd go back since the area (Avon) lacks a decent gastropub."}
{"text":"Unfortunately their quality and service have dropped since my previous review. Last two times I've been there with my wife, the server forgets to bring us silverware. Our app comes in and we have nothing to eat it with. The second time happened exactly the same way (I didn't notice again, but I'm just there to eat so..) and it took the server so long to check back on us, that I decided for her to just take the app back. Actually, she didn't check on us, she was bringing our entrees. By the way, we ordered the Duck bar wings, and they actually didn't look very good.  First few times we ordered them they were adding a touch of hot sauce, which made all the difference when paired with the blue cheese and capers sauce.  For the entrees, I ordered a burger and it was pretty good. I think my wife also liked hers, but it came in a little sloppy (it was a burger with mac and cheese). Maybe the whole idea sounds good, but it's hard to execute? Anyways, in summary, the service is our main concern now. I'm even a little hesitant to go back :("}
{"text":"Great service, great food, great drink menu and loved the atmosphere! The brussel sprouts are amazing- even those in our group who don't like brussel sprouts dug into them at Bar 145. The veggie burger option was delicious and is not your typical frozen veggie patty option you will find at most burger joints! Definitely recommend and make sure to try the truffle fries!!"}
{"text":"My first review to say this place is the BOMB.COM   - routinely has a live band. Outside patio/covered is a great option. Service is excellent. Draft choices are excellent. Price is modest if a slight bit above average. Now if you've read this far - read closely. Get the street tacos. The salmon and pulled pork tacos are awesomesauce.  If you go with your wife tell her to order her own cause to you won't want to share.  In fact, bring your In-laws and forever be their favorite.. Even more than their own son or daughter. I speak the truth. And remember Bob Barker says, please have your pets sprayed or neutered."}
{"text":"Really like the energy and atmosphere of this place. Decent drink list. Delicious sides like the tempura green beans and fries Brussels sprouts. But after three visits, the burgers continue to be lacking for me. The innovative menu choices always intrigue me, but the finished product tend to be mediocre  at best. Guess that's what is to be expected from what is essentially a chain. Not horrible but not the quality I expect from a local restaurant."}
{"text":"HORRIBLE EXPERIENCE. I will NEVER go back.  Cleveland has way too many other great food options.   We really liked the place at first. We were excited that we had found this place, and we were sure it was going to be one of our regular spots. WRONG. At the suggestion of our server, I spent the extra money to get the Kobe burger. When she was talking about the burger, she said that it was important to get it either rare or medium rare because if it's cooked more than that it's ruined and wouldn't be any good. She said it was basically like eating a steak. I ordered the Kobe burger medium rare. When it arrived, it was nowhere even close to medium rare. As a matter of fact, it was way more than well done. It was inedible -- like a hockey puck. When I was finally able to flag down our server (service is VERY slow), she offered to send the manager over. When the manager arrived, I showed him my burger, and he said that the burger was definitely overcooked, especially considering that it was a Kobe burger.  That was it. He didn't apologize for the error, or for the fact that the burger was inedible.  Nor did he offer any type of renumeration. When he left, I noticed that our bill had been left on the table. I checked, and my burger was on the bill. We kept thinking that he would come back with a new bill, but nope. Nothing. Our server came back, asked us if the manager had been there, and we explained what happened. She offered to send over the General Manager, but we declined.  First of all, we shouldn't need the General Manager to deal with an overcooked burger, not to mention the fact that she shouldn't have needed to ask. She should have taken the next step herself, and told the GM that she had some very unhappy customers who weren't helped by the manager. We even told her that we wouldn't be back because of our experience. She told us she hoped we would change our minds. Really????  Other than that, our server was a very nice, helpful person. But...seriously???  Bottom line:  If you don't mind slow service, overcooked burgers, undercooked fries, and half-witted, uncaring managers, then go ahead and give this place a try.  Otherwise, I'd stay away. I'd give this place negative 5 stars if I could. I actually left the restaurant hungry..."}
{"text":"Trying to find a casual place that was convenient for everyone, we chose Bar 145. I had read the reviews and found them to be all over the map and decided that many of them sounded like initial start-up pains. We were so disappointed. To begin, why would you place the patio on the west side of the building where you patrons are fighting a hot summer, setting sun?  We also felt there was no attempt made to manage the flies and bees. The service was fine, the server was attentive. We all ordered the waffle chicken sandwich. While waiting for our order a young man, who did not introduce himself, came to our table to apologize that our order was going to take longer as they had burned the chicken. When we got the sandwiches we found them lacking. We don't think a new batch of chicken went into the fryer but instead, they salvaged pieces that didn't look burned. There was more breading than chicken and both the breading and chicken were over done and hard to chew. The waffles were no different than any grocery store brand and the sandwich had very little maple syrup. The mac and cheese was tasteless and added little to the overall appeal. The fries were very tasty. There won't be a 2nd visit."}
{"text":"Best execution of a basic burger and better than basic fries I have experienced thus far. Staff was friendly service was quick. I know my review is shorter than most but there isn't much more to say."}
{"text":"Friendly staff. Live tunes. Great beer. Great burgers. Simple menu. Definitely a burger joint. Live music Weds through Saturday! Bam. Enjoy."}
{"text":"Frozen and formed hamburger patty and stale onion bun.  For 3 people, I paid $44 (includes tip as our server was excellent) but wish I would have gone to 5-guys.  My wife recommended we go as she had an excellent meal a few months ago but this visit left much to be desired.  I like the concept but I can't see this place surviving if the food tastes like my meal."}
{"text":"So I came in here thinking, \"I'm about ready to have good burgers!\" I had  the pork and cheeseburger.   I loved the flavor combination until I realized one HUGE detail- they don't use actual buns, they use some phony impostor sliced bread that you can just pick up at your local gas station.The fries were crispy.  The service was friendly and prompt.  Besides the bread, I enjoyed our experience at Bar 145 in Avon. PS  My nephew wrote this.  This is not my review!"}
{"text":"I can't review the food because three servers walked past our table on Sunday afternoon February 8th around 12:15. Waited 15 minutes. No offer of water or asked by anyone if we had been helped. If the restaurant were busy, we would have understood. So we walked out and told the hostess we hoped the next couple she seated would be seated where they could get service. She looked surprised we left!"}
{"text":"This is a brand new building and it looks to be fully designed for the concept. Everything was clean and organized. They will be ready for the summer with garage doors that open to the ceiling in one section.   But enough about the facilities. Food and drink is what will draw me to this establishment. It seems that this is an upscale burger place with a drink focus on bourbon and craft beers. I decided on one of their signature burgers, the \"simpleton\".  I was offered the choice of doneness on the burger and quickly chose medium rare. For the most part, that is what the name means - 145º is the temperture of medium rare beef. They did miss the mark slightly, but the burger was still exceptionally juicey. The burger comes with a side of truffle fries. The freshly chopped rosemary was a great addition.  Being so new, I thought that  managers would be out visiting tables and gathering feedback. They might have known that I thought my burger was slightly overcooked and that I enjoyed the fries. And, I would have liked to ask a question or two about the concept.  I will be stopping back. The burger was good, although slightly overdone. I never call it quits after only one visit.  I look forward to visiting in the summer to experience the open dining. I think this could be one of my westside favorite burger spots."}
{"text":"Whoa!  This apparently still is suffering from startup issues. The menu is comparatively simple but the orders either arrived  incorrectly or cold.  A cold burger is not a good thing!  Our friend received an incorrect order and after getting it back a third time, it still wasn't right!  The worst part was that the cheese was missing and they simply slapped on a cold slice of American cheese and brought it back to the table!  The manager said he'd \"take care of it\" but never apologized or suggested what he had in mind. And, we never saw our server during the meal to ask for water or to get the bill!  Bottom line, there are so many great restaurants in the area; Unfortunately this is not one of them."}
{"text":"The restaurant is aesthetically pleasing and the outdoor bar area is very nice. Unfortunately, the service was slow and the food was average at best. We had to wait 5 minutes to get napkins, mustard and silverware. We won't go back."}
{"text":"I will not be back to this restaurant. I was very offended when I order a Moscow Mule and they wanted to keep my ID because I might steal their mug. Every time I come in here they pull a confrontational attitude. The staff is polite but the company policy will ruin this place  They treat you like criminals they need to keep in line."}
{"text":"This place sucks. Every time I go no one wants to serve me. They all stand around finger popping each other's assholes. Bad service. Left and went to mulligans."}
{"text":"terrible wings. so overcooked like eating jerky. oh charge me an extra buck for 2 tsp of blue cheese. $12 for crap wings and another buck for hot sauce on side and a buck for the tsp of blue cheese. wont ever be back."}
{"text":"One of us got food poisoning.  Was told it would take an hour to get seated,  but was seated within 10 minutes. Had to ask for silverware after being served and water a couple times. Two of the four people we went with got sick and vomited,  one had to go to the hospital. Was vomiting every hour 5 or 6 hours after eating. Narrowed it down to the brussel sprouts that were bad. Other than that the burgers were undercooked but tasted okay. Wouldnt recommend because of food poisoning, undercooked burgers, and bad service."}
{"text":"My husband & I both liked our meals.  I did the build your own sandwich. I ordered chicken with herb goat cheese,  bib lettuce,  caramelized onions, pickels, & balsamic aioli. It was delicious! My husband got the sweet pepper flatbread. It had some heat to it, very tasty.  The music was not to loud.  We will be back!"}
{"text":"What an interesting place. The food was good the service was not so good and the place is awkwardly set up in my opinion. I know that they have a stage but there are a few random tables in the middle of the floor when no one is using the stage. It's almost if the place is too big and they didn't know how to fill the space.   I wanted to like our server but he just didn't seem to be trained well enough. He didn't seem to know what was on tap or if there were any happy hour specials- things that seem pretty basic to me. I specifically asked for a side salad with my black bean burger instead of fries and ended up with a full size salad and fries with my burger. He fixed my check so that I was not charged but he didn't seem to understand my order. I also asked for no raw onions on my burger and got them anyway. The reason for the A-Ok review though is because I actually loved the salad (especially the croutons) and I really liked the black bean burger. It really is one of the better ones I have had in the Cleveland area."}
{"text":"Went in somewhat skeptical about the place (because of others people's reviews) and left more than happy. Their food is excellent. I wanted to buy a bucket of those green beans (yes, they are that delicious), everything was tasty, fresh, and cooked perfectly... and oh my.. duck confit for $9.. you can't beat that. Excellent service, great ambiance, clean, what else can you ask for?? Maybe for the chef to come home and do some cooking for you... LOVED it"}
{"text":"Wow, I just have to say wow. I heard so many great things about this place...And they were all wrong. Let's start off with the service. Our waiter was a pissy douche bag, and as soon as I decided not to order a whiskey and coke (because they don't serve coke products) he started to give me his attitude. He had bad body language, a stupid look on his face, and was short and rude with his sentences. When taking the menus he snatched it out of my girlfriend's hand like she was stealing it or something, like, wtf dude, it's a paper and she was still reading it to look at desserts...you can probably guess we didn't order dessert. Then the manager was rude as well, he asked how we were doing, we said fine. But when he walked by the second time I went to ask him where the bathroom was and about our food...dude was 3 ft away from me, looking at me, seeing my mouth move...but totally ignored me and walked outside.   Now on to the food. We waited about 40mins for 2 cheeseburgers and some fries (they were not that busy). My girlfriend took a bite out of hers and saw our waiter in the distance staring with what she called an \"evil\" smile, as if he had done something to he food...that was very unsettling, then she realized her burger was damn near raw. We gave it back and didn't order another. My food wasn't that bad, but I could've gotten a much better tasting burger at 5 guys which is like 2mins away from there (that's what I'm doing next time we want burgers). The fries were very good and the salad was alright, but nothing was special, nothing stood out, and nothing was worth anywhere near the price tag, or the bullshit from staff.  The place looked really cool when we walked in, but we soon learn just how pretentious it was, the place was full of irritating hipsters and even the simplest things were gentrified. None of the employees looked happy to be there. Also, my girlfriend almost slipped and fell on the way out because the floor was wet in the middle of a walkway...no one was trying to clean it, or put up a sign, and no one seemed to react when she almost slipped.  The best part was the super liquid shits this place gave me...nothing like good old fashioned diarrhea to brighten your day. (laden with sarcasm)(yes this really happened).  We will never be dining here again, and my personal recommendation is to just hit up 5 guys or fast food, and if you're going there for drinks...save your money and go to 2bucks down the street."}
{"text":"One star for the server - she was nice and wasn't the one who made the food. The food on the other hand was disgusting. Burger was over cooked, fries were cold, and the burger buns were hard and flakey. Not a place we will ever go again."}
{"text":"Went on a mid-afternoon Friday when the restaurant had just a few customers in it.  The overall experience wavered from odd to poor with flashes of enjoyable.  That's why it was tough to assign a star value.  I actually lowered the star rating as I typed the review since I realized so many things were messed up.  Noted they only list 4 or 5 beers on tap on the menu with the \"Ask for seasonal selections\" mentioned.  I asked our waitress, who did a sensational job the entire time, and she rattled off a whole host of others, including Fat Head's.  Since it said seasonal, I asked is it their Holly Jolly beer.  No, it's their Head Hunter.  Odd, that's not a seasonal.  Anyway I truly have no idea how many tap handles they have.  Ordered a starter of Fried cheese curds - very enjoyable.  Ordered a maple-bacon mac-n-cheese (this was very tasty) and a side salad, 2 Burger Specials of the month which was a turkey burger stuffed with cranberry, brie, spinach and red pepper (I believe?) on a red pepper/garlic bread.  One of had a side salad and the other ordered a side of truffle fries.  I wondered how they would prepare a stuffed turkey burger since turkey burgers are lean and don't lend themselves to binding well let alone being stuffed.  We asked the waitress and her eyes lit up as she explained how great the turkey burger looks cut in half.  When the Special of The Month arrived it was what I referred to as a \"deconstructed mess\".  It basically looked like dried out meatloaf that had fallen apart and was stuffed under 2 thin slices of bread.  There was nothing appealing to it at all.  An adjoining waiter saw our expressions and immediately came over to the table.  After a couple of bites to affirm our thoughts, we told him this really is not anything resembling a burger - it's dry, it's falling apart, etc.  The manager showed up minutes later and after a short explanation they were properly removed from our table and taken off the bill.  They graciously asked if we wanted anything else.  Since we already waited quite a while for these meals with the restaurant hardly occupied, we were afraid to ask for anything else so we politely declined.  Overall comment - management handled this 100% proper!  Kudos to them - remove this mess and ask if they could provide something else.  Noted only one of the two dinner salads had onions in it.  Unfortunately the onion lover received the salad that had no onions it.  Again, just odd.  Getting back to the burger a waitress told us the burger had looked fantastic up until about a week ago.  The restaurant was training cooks for another Bar 145 opening in NY soon and they speculated the new cooks don't have it down yet.  My personal comments - Burger's are your \"bread and butter\".  This burger is your December \"Burger of the Month\".  If this is your signature, better make sure it shines!  Finally there is no way these burgers should have made there way out to us.  Someone should have stopped this.  Final odd point.  When the burger was delivered it had fries on the plate.  The customer told them they ordered a side salad though.  They took the fries back but came out later with the fries to say fries come with the burger.  That's not listed anywhere on the menu.  If that was the case, nothing was said when I ordered fries with my \"Burger of the Month\".  Again, just odd.  I'll be honest, I'm not sure they know what's going on there.  I don't know if it's staff just working a few hours a week so they don't know what's going on.  Maybe it's lack of training.  Regardless, these are 3 customers that will probably never return!"}
{"text":"Started out hopeful by ordering shrimp and grits. Wanted the \"soul of the day\" but there wasn't any; in fact they had one soup - beef something so I wasn't interested. After about 10 minutes of waiting I Found out they run out of shrimp and grits. Okay, no problem, I'll have the chicken panini and fries. 40 minutes later my panini comes out cold, accompanied by cold, stale fries. I agreed to have the sandwich reheated but after another 15 minutes decided to simply walk out. Ridiculous! And btw this was on a Monday night so you can imagine how busy they were."}
{"text":"Owner should know that we have been here 6 times.  The bartenders will not pay attention to you unless you get there attention.  My food was served on top of our menus and the burger was not what I ordered on the fill out form.  He looked it up and didn't care because it was the kitchens fault.  We had to ask if we could have a second drink because our glasses were empty for 10 minutes.  We had to ask for silverware and napkins.  There were only 8 customers there.  If management cares they will show up.  They are not not oriented to customer service and do not care if your there or not.  We were there last at 8:30 on Sunday night may 17th.  Customers had to ask for the bar to be wiped clean.  He should get a government job.  I might add as I write this we waited another 10 minutes for a drink.   Glasses empty, 8 people at the bar.  He doesn't really care!!!!!"}
{"text":"Been here before for drinks nice patio but couple sundays ago stopped in for drinks and appetizers, Mr Aloof waited on us with maybe 6 others in whole place, got first beer, and at 5:45 my beer empty decided to order Appetizer before happy hour over and 2nd beer, well Mr Aloof to 20 minutes to make his way back over to the bar where we were sitting, well then when we paid he had the gaul to say you ordered after 6 so full price...........oh ya we waited for 20 minutes doofus, oh well thats the last time"}
{"text":"Had a dinner with my boss here while in Avon, Ohio for a project.  The decor and building were very cool.  I loved the glass garage doors that opened to allow for a fresh-air dining experience.  The huge TV screens were a bit distracting but I understand they are what the customers want.  Beer selection was great.  I ordered a side salad, veggie burger and the fried Brussel sprouts.  Out of everything the salad was my favorite, I loved the bright balsamic vinaigrette dressing that I chose.  The veggie burger was okay, nothing to rave about, and the fried Brussel sprouts were over cooked, kind of hard to chew, wouldn't get them again, but possible they are not normally like that.  Maybe I just got a bad batch...our server said they were very popular, so hopefully it was just a bad night for them.  Also, our server was great, provided wonderful service and was very personable and knowledgeable. I would return to try other menu items but for my first visit I can't go higher than three stars.  If we return again, since we work in the area a lot, I will write a new review about that visit."}
{"text":"Went there last night to drink and dance! The band was amazing and the drinks were delicious, also responsibly priced. We had a big group and plenty of space and the most fun! I love having a place to go out late in Avon!"}
{"text":"Very cool looking burger joint in Avon.  We went on a cold rainy Sunday afternoon and there were not a lot of people probably due in part to the weather and also because this is not a Sunday after church kind of place.    Martini was fabulous and the decor is A+.  TVs everywhere which is OK but I don't understand why a number of them were on an infomercial channel.    Had to try the burgers since waiter said that was their specialty.  Had the Simpleton burger since I like mushrooms, onions and bacon on my burger.  Ordered salad as the side instead of fries.   Burger was good but they should skip the citrus cream cheese. Made the meal a sloppy mess and overpowered the rest of the toppings.  Also the bacon was rather overcooked.  A bit pricey but will probably return on a nice day to enjoy the outdoor patio and other items on menu."}
{"text":"We sat at the outside bar and waited so long for service that I died and was reincarnated as someone who just went to 5 guys instead. It was not busy. There were SO MANY workers. Y u do dis"}
{"text":"STAY AWAY!!!!!!  I asked if they were out of any bourbons and was told \"Yes, so many\".  I had a problem with the burnt fries, and when I spoke to the manager he raised his voice to me. I was told I had \"a chance to do something about it.'  I wish I could say at least the service was good, sadly I cannot.  I sat at the bar and my glass was dirty.  The bar tenders were talking about a broken bottle in the ice, not that they emptied the ice they were told to pick out the broken glass.  I would give LESS than one star!"}
{"text":"Service was terrible, we ordered our burgers medium rare, which to me is pink through out and a little red center. These came out raw through out. Wasn't thrilled with my overall experience there. The Brussels sprouts were really good though. Defiantly won't go back."}
{"text":"Terrible! The food was gross. Someone is obsessed with maple syrup, it's in practically every dish, even when it doesn't make sense. Patty melt was unlike anything I've ever seen, severed on wheat bread that wasn't grilled. Burgers were underdone and there were only two other tables in the restaurant. Still waited 30 min for two burgers. None of the wine on the menu is available. Very sparse liquor selection. The only good thing was Codie the bartender. Lol see you on W 25th!"}
{"text":"We have eaten here twice.  First time during the first week open and during the third week.  Consistent service and food quality.  We enjoyed the pork nachos, nice and spicy.  The burgers were well done and had a okay choice of sides.  Salmon was over cooked and my side dish didn't arrive at the same time as the entree and the waitress followed up only once and then completely forget by the time she offered dessert options.  Place has a nice atmosphere and vibe, food quality and menu options need to be increased or rotated with specials to keep us coming back for more. The location is great, so hoping this place stays around."}
{"text":"By far my favorite burger/bourbon franchise on east coast. As more of these pop up; it's harder to find a legit spot as quality gets watered down.  Bar145 has once again shown quality and quantity; with great ingredients and awesome quality burgers. Don't sacrifice guys as you have the winning combo in an ever crowded market. Sorry BSpot you have lost my vote.  Kudos to Mike the bartender who was attentive and knowledgeable in bourbon as well.  Finally if u want to eat healthy and gluten free these guys rock an awesome burger over greens. Kitchen came correct...  Definitely worth a visit"}
{"text":"This place is okay. Burgers are overpriced but decent tasting. The bar is huge but the drinks are weak. The atmosphere is great except the smoke from.the burgers overtake the restaurant and the noise level is outrageous. Good place to go with friends when you are already drunk."}
{"text":"A group of 8 of us came here to eat and see the Spasmatics.  There was no hostess when we arrived so it was a free for all trying to find a table.  They did not have enough bartenders and waitresses.  The women's bathroom had 4 stalls with only 2 open.  It smelled like sewage and there was no toilet paper. Then they started charging people a cover charge.   Ridiculous since you couldn't get a drink anyway.   First and last time coming here.  If I could rate this place a 0 I would.  What a joke..."}
{"text":"As promised in my last review, I am writing a new one on my second visit to Bar 145°.   I ordered the Fried Chicken and Waffle sandwich with Maple Bacon Mac and Cheese and loaded with Maple Syrup...and my God was it everything I hoped for. It all worked together in the best way possible, satisfying every craving on texture and taste...everything expect for the healthy aspect, but like the bar tender said, It isn't time for resolutions just yet.   Came with rosemary fries which I will take home to cut up and fry with eggs tomorrow morning. All for around 11 bucks. Not bad at all. And the Mac and Cheese now uses shells instead of orincihetti (spelling? I don't feel like googling it right now) which as improved the Mac in my opinion.   A much improved experience, and I will be back a third time!"}
{"text":"Went here on a Friday during  lent so I tried the black bean sandwich.  I have had better ones. Now on the other hand the burgers are delicious.  You can try one of their signature burgers or you can make your own.  Now when it comes to the drinks this place is known for their bourbon.  I tried the champagne bourbon and the copper and gold. Both very tasty.  The beer menu is not bad either.  They do offer craft beers. This is place is super busy on Fridays because they do offer live music."}
{"text":"Service is horrible, they're always short staffed it seems lately and the servers can't get orders right. Timing of food isn't the greatest and the broken glass in the entryway seems like it's been broken for a year now. Can't say I'll be back unless something new comes in."}
{"text":"Drinks are ok, depending on what you get, and if the bartender can pour proper portions. The first time I came, it was way over poured and wasn't an enjoyable cocktail. We gave it another try today, and my cucumber, jalapeño, lemonade was awesome. Food menu is expensive and not that great. If you get an app, you get much less than expected for the price. Menu is very limited too, it's mostly a burger place. Atmosphere is fun and it's lively. They have a great patio bar.  Fun place to get some drinks before you go somewhere else."}
{"text":"The good: The burgers and fries are ooooooh so good. Make sure you get it cooked medium...Medium rare was VERY rare for me. Truffle fries are tasty and fresh (but a small portion).  The bad: Had some bad service here...and the beer can be very OVER -priced for the Avon area...I wish the fries came WITH the burgers...also wish you could bring well-behaved dogs onto the patio and that they stayed open later."}
{"text":"Very pleasant atmosphere,nice patio.  The server apologized for slow service because people were sent home. He gave great service. Nice bar selection . We chose the build a burger. i got mine on spinach,  great choices, and was perfectly cooked.  We also tried the onion soup and fried Brussels sprouts.  The truffle fries had the rosemary oil but weren't greasy. Definitely will return with friends."}
{"text":"I wish O would have found this place before the day I was leaving town.  Had the duck taco and onion soup. Wanted the beef cheek tacos but they were out.  Soup was just alright.  Duck taco was very good.  I would go back."}
{"text":"Went in on a Sunday evening. They were not busy and the hostess sat us right away. The music was a little loud for the crowd and time but not so bad you can't talk. The wait staff was great. Very nice...and I like the shirts they wear that say \"red chucks...white China\". All the staff are wearing red chuck Taylor's. It's a good look. Otherwise an odd place in my opinion, it has a bit of an identity crisis. Is it a cocktail bar? Is it a burger joint? Is it a sports bar? Even a music venue, there is an elevated stage so they must have live music at some point. The beer selection is ok. The draft beer options are a little light. The menu reads like a burger place but elevated and different. Which I generally like and search out. However I was a little put off when the burger came out because I ordered the burger with pulled pork on it and a side of truffle fries and the burger had no bun. I felt like I was on Adkins diet. It was more like a beef and pork slaw salad. To be fair it was good but it was not a burger. The fries were ok on their own but the sauce they send out with the fries make them. Now that I know what the place is...kinda, I will have to go back in and try it again. It really just made we want to go to Hecks in Ohio city or to streat burger in Lakewood. .  I forgot to mention.... $8.00 bottle of beer. I am a self proclaimed beer snob and don't mind paying a little more for good beer but 8.00 is too much."}
{"text":"One of my favorite places to eat around. It's always a fun time in there with the bands and the people a super friendly. They aren't too overpriced either for being a little more upidy than 2 bucks or something."}
{"text":"Went out for a great night with my gal only to be put to the test regarding lack of service. The burger was good and the Devils eggs were awesome but we lost our server after the first round and from then on it was self serve by walking up to the bar. We have been here several hours and still waiting on the band to start. Not sure what their deal is. This is our second visit. Not sure yet if we will be back."}
{"text":"$17 dollars for a kobe burger with cooked onions and arugula accompanied by a side of truffle oil seasoned fries. Sounds like the perfect price and description for an item at a fine dining restaurant. Unfortunately, that was the furthest from what was delivered tonight at bar 145. I don't even know where to start with this train wreck of an experience. Perhaps the dirty table my wife and I were seated at? Maybe the server with nothing to do, wrapping silverware in the empty booth directly behind me? Maybe the layer of crust in the middle of the table staring me right in the face? Perhaps the fact my server couldn't answer a simple question as to what the flavor profile of the beer is that  I was asking about? I dunno, so many choices. Certainly, I wouldn't start my review with how I felt about the over priced, over cooked, under seasoned, horribly presented, $17 dollar \"Kobe\" burger would I? I mean, it says Kobe, it says $17 dollars, it says fries that have truffle oil drizzled all over them! There's no way I could complain about that right? I think it might be easier if I just listed a few facts: 1. Service was surprisingly good! I don't remember his name, but the male server was attentive and kind. It was obvious he was a veteran and cared about his job. The fact he didn't know the beer selection that well will be overlooked for now. 2. The burger was absolutely FLAVORLESS in every possible sense of the word. I had to cover it in sea salt and pepper (luckily they were already at my table, seems I'm not the first patron that needed to do such) just to make it not taste like it was a frozen patty hurriedly cooked in a microwave. 3. Burger was drier than the leather of my son's baseball glove. Jack links beef jerky from the corner get-go would have been a better alternative for the protein between the buns of this epic, miserable failure. 4. The calamari-esque looking bouquet of oily, stuck together onion slop that obviously wasn't shaken while in the frier, almost caused me an early death, from the near choking experience I encountered upon my second bite.  5. The bun could have been good, but who cares about the bun, when every other part of the sandwich was failing on every other front? 6. The fries reminded me of the time back in 9th grade home economics class. We cut up potatoes and fried them in a pan with some no name vegetable oil, when we thought they were done, we discovered they were over cooked by the slight burnt taste of the skin, and the California raisin shrivel throughout. Thats exactly what i receieved tonight at bar 145. Shriveled up, over cooked, underwhelming, horribly presented, over priced failure on a plate. I think if my teacher was there, she would have had the cook start over and try again. 7. My wife's lobster mac and cheese for $15 dollars. Oh where, oh where do I even begin? Kraft foods (yes I said Kraft) boxed-style shells n' cheese for $.99 cents at the local Walmart would win the Pepsi challenge against bar 145's bowl of misleading disappointment any day of the week under any circumstance. And yes, they use little shells in theirs. Probably cheaper to get from their food vendor. Maybe it's time to switch to sysco or gfs? The Marc's discount store across the street isn't cutting it anymore.   Stop laughing. I know it's unbelievable. What i find unbelievable is that they have any repeat business from anyone with a functioning brain! Many people including the server said this place is \"known for their burgers\" that's like saying isis terrorists are known for their kind and warming compassion toward all races and religions. Before I close this masterpiece, I'd like to give some tips to the owner.  1.Fire your chef, if you have one. 2. Hire a restaurant consultant. 3. STOP charging fine dining prices for food done better by Burger king and Five Guys.   It's not good to mislead your customers. I hate knowing I paid $50 dollars for something a fast food restaurant can do better than you umpteen percent.  I await the day bar 145 can be something to be proud of in Avon, Ohio. Until then, I'll continue to drive 255 miles south to Cincinnati for White Castle burgers. Because they are better than you."}
{"text":"Good burgers. Awesome berry mojito. Would of gave a 5/5 review but the service was lacking. We sat at the bar around 4pm,it took about 30 minutes for the food to come out, we had the build your own burgers. Our sides came out a couple minutes after our burgers. The only part that I found really annoying is asking 3 times for the check and waiting several minutes after our plates were cleared. Besides mediocre service everything else was good."}
{"text":"Visited the new Bar 145 in Avon to see my favorite band, That 80's Band, and even though it was crowded, was pleasantly surprised.  The food was better than the typical bar food I expected. I had the black bean burger and fried Brussels sprouts, which were outstanding. My friends loved the burgers. My only complaint is that it is noisy even without the band playing."}
{"text":"Food - good, beer wine selection - awful, service -terrible, noise level with band playing- atrocious. With everything else available in Avon and surrounding burbs - skip this establishment"}
{"text":"Good was good but service was a little slow. We'll try it again. $10 build you burger lunch was good.   Burger with a lot of bells and whistles, Green Bean Tempura and a drink...not a bad deal."}
{"text":"Good atmosphere. That's the only good thing. Overpriced and below average. Really complacent staff that didn't seem to really care."}
{"text":"Been in here many times since the opening for both lunch, dinner, and the live music. Have not been disappointed! It's in a great location, close to all the shopping, but you can avoid all that traffic! The food is super delicious. I highly recommend the duck wings, gravy fries and the fried Brussels sprouts. They have many burger selections, but the build your own burger option is probably my favorite because you get just what you are craving! They also have a lot of unique options on the build your own burger menu that you just can't get at an average burger joint, such as duck confit and bourbon sauce as toppings! The service does move a little slow, but I consider that new restaurant opening kinks, not a problem you will see in the long Run, besides the staff is extremely friendly and pleasant. The live music is a nice bonus creating a fun, late night atmosphere you just can't find anywhere else in the area. The bands I've seen have all been entertaining, playing a wide range of music from 90's cover, boy bands, alternative, rap and country. The music does tend to be a little loud for conversation, but again, I think it's just working out opening kinks. All in all I love the place, and always look forward to the next time I can go back. Even my out of town friends comment how the next time they visit they want to go to \"that bar by my house\".  And ladies for an added bonus the entire bartendering staff is cute, attractive male bartenders, so go in for a drink and admire that eye candy! If you haven't tried the place, def check it out! If you have tried it and been disappointed I hope you realize that they just opened and no store is going to be perfect right off the bat. Give them another try !!!"}
{"text":"Slow service for 20 patrons, food barely warm. Some random girl in red hoodie wandering around doing nothing could have helped run the 15 or so plates on counter.  Props to the guy working for waiting all his tables and being the only person running food that sat under heat lamps for over 5 minutes."}
{"text":"After hearing ads nonstop on the radio, my wife amd I decided to finally check it out. Wasn't bad at all, I must say. I got the Bacon Mac N Cheese with my Patty Melt. The patty was cooked medium and was absolutely perfect. The toppings companied the burger perfectly. A slight messy but I'm a guy so its all good!  Now the bad (not much)  Our waitress BARELY paid any attention to us. She got our food, and shortly after checked on us. But that was it. Despite being nice to us, she was to busy at a POS terminal by the bar most of the time. I had to get another server to get our check. They werent even that busy, which shocked me a little. And worst part, we had a movie to see, so we were on a time limit.   Thats all I really have to say about it. If you're looking for good food, and a great atmosphere, Bar 145 is definitely for you!"}
{"text":"I given this place at least 10 tries, but the service is consistently bad and food is sub-par. The employees and managers seem oblivious to issues. This place has potential."}
{"text":"The service was attentive and responsive. The food was tasty and affordable. The menu was a xerox copy on plain paper which was illegible, Sotheby's bartender had to describe the menu. For a Friday night, it was very empty. A live band came on stage, which was so loud we literally left because I had lean In and yell to hear for my friend to hear that I was making sound. Not impressed with draft beer list either."}
{"text":"After spending the morning doing some Black Friday shopping, my sister and I decided we were in the mood to get burgers. We decided to give Bar 145 a try. It was around 1pm and it looked fairly empty. We were seated immediately in the bar area at a high-top table. Our waitress, Alyssa, was great. She gave us enough time to look over the menu but didn't leave us hanging for too long either and was very nice. Personally, I think there's a fine line between feeling almost harassed by waitstaff or completely ignored and I was really happy that she was able to take care of our orders but not hover. I ordered a Christmas ale and the Americana burger, medium-well. Our food came out fairly quickly and everyone got the correct order (we all ordered the same thing with slight variations on toppings). The burger itself was great, but what I was really impressed by were the truffle fries, which come standard with the burgers. They were to die for. Just based on my lunch experience, I'd definitely come back."}
{"text":"I love the Toledo location, so I was super happy that when I moved back to the Cleveland area, that I could come to Avon and get my Bar145 fix. I literally crave their truffle fries and the roasted red pepper aaoili is addicting. So I was super happy that when meeting up with one of my gal's I could drag her with me to check out the Avon location.   They have a pretty great happy hour, which features some great drink specials, and half off certain appetizers, and a couple dollars off of the flatbreads. We also went on $5 dollar Build Your Own Burger Night. We got an order of the house truffle fries and soft pretzels to start off, then we both built our own burgers. My friend loved her burger and her tempura green beans. And I absolutely loved my burger and brussel sprouts (the brussel sprouts are seriously so good). You can't pass up building your own burger on $5 burger night. Because hello who doesn't love a good deal like that one! But when it's not $5 burger night, the apple pie burger is seriously SO good. Like the flavors are amazing! The Balsamic Blue Burger is also an honorable mention. Typing this review thinking about Bar 145, really made me crave it, so looks like I need to head back and get my fix again."}
{"text":"Good beers, good burgers, better bourbon. The music coming though is awesome, and plenty of room to cut rugs."}
{"text":"We had the deviled, which we great, the tempura green beans which we OK for apps.  My daughter and I had make your own burgers and the wife had wings.  All our main entrees were excellent."}
{"text":"My husband and I are so disappointed in this place. The joint is poorly ran from the front door to bar to kitchen. We will never go back. When greeted we were told to sit wherever and never received menus. When we finally got a server she greeted us with \"has anyone been with you yet?\" \"Oh, can I get you drinks?\" We never knew her name. She didn't know the beer list and after we ordered our drinks they were out of my beer. The service was beyond slow and terrible. When she got around to taking our food orders all she had to do was take our papers that we had written our own build a burger on. I don't know how but our orders were still somehow messed up. The burger itself wasn't even good once they fixed it. They took the meat back and slapped some cold cheese on it and didn't even bother to melt it. Our Mac and cheese was basically Velvetta with some Maple flavor added. Overall they didn't hit one mark of being a successful restaurant."}
{"text":"The three of us decided we had enough home-cooking over the holidays and decided to check out Bar 145 in Avon.  It was Saturday so the place was packed. Sat at the bar to save the 45 minute wait. Service was good considering the volume. Really enjoyed the Kentucky Bourbon Ale on tap. The build-your-own burger was underwhelming. I found the burger dry (ordered medium) and not real tasty. My companion ordered the Signature burger and liked it much more. Fries were good, grilled Brussels sprouts were better. Although I'm sure the patio will be good when the weather gets better, it still will overlook a parking lot and budget hotel. I really dislike the industrial, unfinished ceiling look and polished concrete floors- it's not hip, it's cheap. Noise level was way too high because of the aforementioned surfaces."}
{"text":"Been here many time.  My option has changed greatly.  The consistency of dishes is bad.  Portion sizes change.  The taste of items and how they are prepared changes day to day.   Very disappointed with the execution     poor service sometime depends on who u get."}
{"text":"If I could give zero I would because I had zero experience with this restaurant because we were ignored.  Went in on a Sunday evening with my boyfriend and a friend.  No one greeted us at the door so after a while we decided to grab a table. After about four or five minutes the one server who appeared to be working, walked out of the bathroom at a snail's pace.  The bar had a few people sitting at it and there were three other tables with guests.  The bartender didn't acknowledge us and the server never looked up to see us...slowly walked over to the open kitchen to talk to them...and then headed over to a table on the other side of the bar and plopped herself down never even realizing she had a table of three guests looking for food and a drink.  Womp womp.  I'd be willing to give it another shot but know my boyfriend will always go back to this first negative experience so chances are I won't be back."}
{"text":"The food was excellent as well as the selection of craft beers. Our only complaint was the loud music playing in the background. We were there just after 6pm on a Saturday and although they have live music later in the evening, they had the volume so loud I couldn't even have a conversation with my girlfriend and the waiter couldn't even hear me for my order. I enjoy music but a few notches down on the volume would have made this perfect. I may try this again but if this is how they decide to run their business, it would be my last time."}
{"text":"I was worried about eating here as well. We ate here on a Sunday evening with a family of 5. Being our first we had many questions. Our server was great.  Patient and easy to talk too. She did forget to bring us a beer, but apologized and got it right away. No big deal. It happens. The food came out in a timely manner. 4 of us ordered the Make Your Own Burger all on pretzel buns. Everybody LOVED their food!  Burgers were juicy. Buns were perfect. Sauces were all good. Fries were great as well. Portion size was also filling. I would definitely eat here again. So many buger combinations would make coming back very interesting."}
{"text":"7:30 and there is a reason why there are plenty of tables... Band starts at 10, drinks I'm sure are cold but pass on the burger and fries.  Wings were way over done and hard.  Sorry but just saying."}
{"text":"Saw Tricky Dick with family. Believe that half of Avon was there! Great bar, will come again!!"}
{"text":"I'm only giving 3 stars based in the salmon I had in my house salad. The salmon was great. Cooked to perfection. The romaine lettuce in the other hand was horrible. I got all the ribs with no lettuce leaves. I usually throw those away at my home when I use romaine. Also and this is BIG... I ordered a Kentucky burbon beer and it was served to me in a 12oz glass. I asked why ( all the others beer are served on 16oz glasses) and first was told that it was a state law because it was 10% alcohol they put it in a smaller glass. Then the manager  came over and she said it was the restaurants policy to serve in a smaller glass to monitor the people who ordered it because  it had a higher alcohol content. I have never heard that reason before. It might be awhile before u come back here for that reason alone!"}
{"text":"Being located in a hotel parking lot, I imagine many a business traveler comes here. Maybe even as a single diner...   As was I this week... I was not asked if I wanted to sit outside, which clearly is the draw, was placed at a 4-top, straight on from the entrance, in the middle of an empty room.. Save for the couple with 2 small children that were clearly not having a  good evening.  While perusing the menu, listening to the murderous screams from a child and hilarious henpecking from the wife, the choice of whiskies began to make my mouth water..  7 minutes in... No server to greet me yet or take my double Bulliet order.. Just as I started to feel sympathy for the Dad, the other child decided to race her shadow across the room. Sad to say, a table corner beat her to the finish line and celebrated by bitch slapping the little girl in the temple.    At this point, I realized that the server wasn't coming, because this family made him rethink every life decision that had led him to this point...  Weeping softly out back sucking a cancer stick was way more appealing than serving at that moment..  When I mentioned to one of the hostesses that, \"there was a lot going on over there,\" and that, \"I was just going to head out,\" she gave me a snotty look that I could have interpreted as disgust towards me.. Looking back, I believe she rolled her eyes because I could leave, but she couldn't..."}
{"text":"We decided to give this place another try. Sorry but the burgers are just so dry and overcooked! A burger place really needs to have quality cooked burgers especially for the price."}
{"text":"It seems like the bar restaurants are just exploding in the west side suburbs. I'm not a huge fan of the idea, but if I had to embrace it this would be the place. The building structure and televisions lend itself to a loud setting. Our waitress was nice and rolled nicely with my dad's unique personality. Pricing was reasonable and it's nice to have a cheap dinner option once in awhile.  When in a bar you must try the drinks so I started with a sangria. I liked the flavor, but it definitely tasted more like a drink from a dive bar you go to with friends to get drunk. It wasn't a restaurant style sangria.The food is definitely a step up from the average bar food. I had the chicken panini with brie, jam, and spinach on a flatbread. It was generously portioned, but not the best. I was expecting a panini to be hot and have flavors that are melted together. I really enjoyed the truffle fries with red pepper aioli that came with the panini. My parents both had the cranberry and apple chicken salad which they loved. I tasted it and it was really good. I'd definitely order this next time. I liked the twist on the typical chicken salad.  Overall, a step above the usual bar restaurant at reasonable prices. I wouldn't choose this place on my own, but I wouldn't argue if someone else wanted to eat here."}
{"text":"I am sorry I had to give this place even one star. As you might of figured out I,m not an employee of the place or the owner or a friend of either.  I'm a off the street costumer that has tried this place three times now and each time has been an experience in restaurant (bar) failure. The food has been Bad for all the same reasons(COLD, cooked the wrong way).  The wait staff was not educated in the food choices and the bar tenders are to busy trying to HOOK UP rather then wait on you. The Bar 145 in Norwalk, Ohio runs circles around this one. So if you want to have a bad night out or just throw your cash away... Give this place a try?"}
{"text":"We've been twice since this fun place opened, and will definitely go back soon. It is a great vibe (lighting is cool, servers are helpful/happy). We have seen two bands play here, and both were great! The food is delicious, especially if you like burgers (they have many options, plus build-your-own). Beer options are decent, cocktail options are top notch. In the summer, when the outdoor patio opens, it will be a blast to sit outside and listen to the band playing."}
{"text":"After driving by many times, we decided to give bar145 a shot for lunch. We came by on a Saturday and service was very slow for only 4 tables being frequented but they were friendly so I can't complain. I had the chicken and Brie panini and it was pretty darn delicious! Their sirarcha fries stole the show, I highly recommend them. Perfectly seasoned! The inside of the bar is pretty large and spacious. Would love to come back for some drinks one night soon!"}
{"text":"It took 10 minutes to be approached by our waitress after being seated to take our drink order.  Staff was friendly, but would disappear for extended periods of time.  5 minutes after ordering, my waitress informs me they don't have the bread that comes with my burger.  Food arrived a solid 20 minutes after we ordered - but no big deal as we were not in a hurry.  I soon realized that my Mac n cheese was ice cold, so I asked my waitress if it could be warmed up.  I then proceeded to watch my mac n cheese sit under a warming light for 15 minutes as my waitress Heather stood around the drink station and served dishes to tables far across the restaurant.  While waiting, I ate my burger (ordered medium rare - more like medium well) - it was good but not as good as B-Spot or The Rail.  When Heather finally returned, without my Mac n cheese, I simply asked for the Mac n cheese to be removed from the tab - which she did.  2 kids meals, a salad, a burger, and two soft drinks add up to a very poor $50 lunch."}
{"text":"There's nothing like a perfectly cooked medium cheeseburger topped with a perfectly cooked egg, over medium.  I could go on about the maple bacon Mac and cheese that I thought would be too sweet but instead was just enough maple to add a unique note to the savoriness of the dish, the kind of dish you immediately insist everyone try.  I could go on about our hilarious and super friendly waitress, who was attentive without being obvious.  I could even talk about the loud volume when walking in the door, which would have made for a meal without conversation, except it was significantly quieter when seated.  But ultimately, for me, it's all about the burger. Is it cooked right?  Is it flavorful? Does it require a formal chalkboard strategy to figure out how to attack and devour it?  The answer here, to everything, is a resounding yes.  I had to edit this review to include that my mom volunteered that the bacon maple mac and cheese may be the best she has ever eaten, and my wife scraped the cheesy bowl."}
{"text":"Fantastic place. 2 adults 1 child $50.00 with 2 spec. Cocktails. Very good service and the food was great.  The truffle fries are addictive."}
{"text":"Servers are doing well for a spot that just opened. Food came out hot and relatively fast. Plenty of room, nice beer list, and inviting patio area. \"Riff raff\" pricing is in effect, so don't expect a cheap night out."}
{"text":"I first went to the Kent version of this smallish chain, and I really liked that one. To me, the Avon version is the same, and that's  very good thing. They make a great burger to the proper temperature (true to their name), have strong tap and bourbon selections and offer plenty of creative twists. I'm not a huge fan of the soulless stripmall location, but it's a good option when I find myself in the neighborhood."}
{"text":"I always wanted to try this place because I see it going to Avon Commons. I'm one and done! The menu is limited and all Chef food. The food was delicious. My problem is this god awful band playing right now. I'm going to pay them double what the bar is paying just to stop playing!!"}
{"text":"Ordered basic burger and fries to go and seriously came in around 9:30 on a Sunday night took about 20 minutes The burger was excellent and fries were good as well"}
{"text":"I've been here a few times already...and I don't recall what I've had, food wise. Nothing memorable in a good or bad way, so take that for what it's worth. It's definitely spacious, with a pretty cool patio. Both the inside and outside bars are big, so plenty of room to belly up. There's a stage area for bands, but I've never been when it's in use. I'd imagine the place rocking though."}
{"text":"Great spot for a young crowd. Attended on a Saturday night around 10pm some friends all in our mid-20s. I did see some older population as well. I ordered chicken & waffles with maple bacon mac, it was fantastic. I cleaned my plate! Two of my friends had the same but didn't like it as much. Great waitress named Brittany and great band that knows how to bring it! Be careful on the floors in the winter... Very slippery! Tots heard that two chicks fell right on their behinds! Very crowded and hard to get a table but well worth it!!!  check it out!"}
{"text":"Call me old school but if the wings are more than a buck a pop they better be the WHOLE WING, smoked, confited, free range, or dipped in a thin layer of a precious element of some kind- like gold. These wings featured no such specialness and the sauce wasn't garlicky enough!  Ugh. Next time we are stuck in Avon I'm just eating myself sick at Mitchell's."}
{"text":"I would have thought third time here is a charm but was again disappointed. This time I sat at the bar thinking the service would be better but waited ten minutes to get acknowledged, then another ten minutes to receive our drinks (the place was not busy when we first came in). I ordered their manhattan and my mom ordered their old fashioned. Let's just say we should have gotten a bottle of beer. First off the bartender did not know how to make their signature drinks and had someone else make them then the drinks say they come with  Woodford but I watched her pour cheap whiskey that I have never heard of into the drinks. When receiving the drinks I asked if it was Woodford in them and she said yes...shocking...secondly the old fashioned was a mess...it said it came with cranberries and there were non insight and tasted like cinnamon... So needless to say a bar that claims to be about bourbon cannot make a bourbon drink...  Now let's see how long it takes for me to get my tab so I can celebrate my birthday properly...well once I got my tab 7 minutes later the bartender told me I didn't order my specialty drink properly and that they gave us normal drinks..please keep in mind we were pointing to the speciality drinks menu while ordering..you would think a place would automatically upsell to the signature drinks..which I said that and she said no that's too confusing then I watch her go bitch about me to the other bartenders... I needless to say I'm not going back to place that lies about what alcohol they put into your drink,tells me I do not know how to order a drink, and lacks professionalism...now off to celebrate my birthday somewhere else!"}
{"text":"It pains me to write this. I LOVE the burgers here. I always do build my own and have a pretty basic burger with fairly boring toppings, but I love it!!   The other food is good here. I've had the chicken and waffles and appetizers. They're all average to above average. The appetizers are small portions for the price, but I don't even care. That's not why they get stars docked.   Here's the bad news: The staff is HORRIBLE. There is one male server who saves the day everytime we are fortunate enough to have him. I'm so sorry I don't know his name. Otherwise, it's deplorable. The hosts are fine. Slow, but fine. The wait staff is literally painful. I think last night may be our last, unless I choose to go alone or with people with a lot of time on their hands. It took nearly 2 hours to have a dinner. Of burgers.   It takes forever to be acknowledged by your server. Is this poor management or simply servers who don't care? Not sure. Last night was sadly typical. It took forever to be acknowledged. The food was slow, but that is the fault of the kitchen, which has staff lined up waiting for orders constantly. Then comes the wait after you ask for the check. My goodness I just ate a giant burger. Let me leave so I can walk around a little!   I will try to make it back here because I do love the food. I just really hope they address the staff."}
{"text":"I've been here several times and have yet to be disappointed! Recently took an out-of-town guest here for lunch and we had the street tacos and sliders. Everything was delicious!"}
{"text":"We recently moved to the area, and decided to try Bar 145 - so glad we did!  I had the Simpleton(?) burger with fries, not only was the burger delicious the fries were also so good (not typical fries - I think they had parmesan cheers and rosemary on them).  Hubby had fish and chips and not only was the fish delicious but the chips (which I believe were made fresh) were also very tasty.  One of the better meals we've had since moving here.  The beer was under $3 found out it was happy hour which was a nice perk.  Lauren our server was so helpful and friendly - and we got to dine outside.  We will definitely return to Bar 145, so glad we tried it, as I said one of our better experiences since moving here!"}
{"text":"We received average service with decent food, I expected a reasonable check. After reading the check I saw the prices we were being charged were nearly double what the menu told us. If I didn't ask to keep the menu at the table after ordering, I would have not noticed this. We asked our waitress about the prices and she answered \"that's a good question\" and brought the manager over. After being informed by the manager that  he would take care of it the waitress came over with the new check and said \"I know he didn't take care of this correctly so I charged it togo to give you more of a discount.\" This still did not compensate for the incorrect prices. If you are looking to get food in this area, this is the last place I would recommend."}
{"text":"We came here mid week when there was no band because I like being able to hold a conversation at dinner. We ordered the duck confit which was really good. We chose the hot honey garlic sauce and we're not disappointed. The burgers did not disappoint, prepared perfectly and tasted great. The only low point was the Cobb salad, there was no chicken avocado or cheese. It was basically a big house salad with bacon on it. I could go to Red Robin and get a real Cobb salad for less $$.    The service was fast and the drink prices are fair."}
{"text":"Do you know why the name Bar 145? Apparently, 145 degrees is the exact temperature of a perfectly cooked medium rare burger. This is important because, while Bar 145 may think this is the only way to prepare a burger, their diners may not agree. More on that in a moment.  Met some friends for dinner last night, despite the fact that I've heard some bad reviews. I walked in to a haze of heavy burger smoke. I wish I was kidding but you could actually see the smoke blanketing the dining room. It only got worse as we sat. My coat, 2 days later, still smells of burger. It was not appetizing and very uncomfortable. Service is the part I was worried most about, but our server was delightful. She was friendly, efficient and accurate.  The food was all very presentable- nice dishes, decent portions, ample side salads. I don't particularly love rosemary, but the rosemary truffle fries with WHATEVER dip that is were delicious. I snuck a bite of my bf's tempura green beans and they were heavenly. Perfect crunch, not too battered and I love the spicy Asian sauce that's drizzled over them.  My burger though. I asked for medium well. I don't really care to see pink, but I don't want it grey and overcooked. Sadly, this burger was very undercooked. I would estimate it to be about, oh, 145 degrees. I couldn't see so well when I first cut into it. (I sound like I'm exaggerating, but honestly, it was so dark and hazy I literally could not tell how undercooked it was). I took a few bites and decided it wasn't worth waiting for a new one.  Overall, the food was tasty. But I had to go with 3 stars for not being able to prepare a burger as ordered and the weird burger smoke blanket that swaddled us all night. Open a window."}
{"text":"I wish I could give this place 0 stars. I have tried to give this place a chance because they have good bands that come here that I enjoy but the service is always awful. I work in the business so I understand there are times when you can't always get every customer what they want or need when they want it but not being acknowledged by a single person for over 20 minutes is just not acceptable. Prices are also too high for dealing with a wait staff that refuses to smile or even greet customers. I say go at your own risk."}
{"text":"The first Bar 145 that I went to was the one in Toledo by the University, and the crowd was a lot different than the one in Avon (as expected).  It is a great place to go for lunch, although I have not been to this location at night. I am assuming it is pretty fun but just a little less rowdy then the location by UT.   The few times I have gone with my co-workers we got the lunch special. It is a great price and good amount of food ($10 for build-your-own chicken or burger, with a side and drink). I personally get the \"build-your-own\" grilled chicken with no bun and instead substitute the iceberg lettuce bed. This not only eliminates carbs but also doesn't make you feel like you want to take a nap when you get back to the office! The truffle fries are really good and come with a bit of rosemary for flavor.   All of the glass garage doors open up around the bar when it is nice out making the restaurant have an open air feel! Great for warm weather!"}
{"text":"Went here a week or so ago for lunch and enjoyed the salad and was able to have a conversation due to the quiet atmosphere.  The next time we sat at the bar and I was astonished how poor the service was.  With literally 2 patrons per bartender you'd think they would be attentive but that was not the case.  It actually got worse as the night went on to the point we found humor in it knowing we probably would never come back.  The customer next to me left in disgust after trying trying to get a bartender's attention with no luck. Two of us ordered burgers and for the price it was small and nothing special.  I hope the place gets better but they are digging a hole early."}
{"text":"Happy to see a  new, contemporary offering in Avon. The decor and energy are great - especially the indoor/outdoor patio. The drink menu is large, and certainly unique from any other offering in the area. Unfortunately, after 3 visits, I can firmly say that there are better places in the area for a burger. Especially Heck's, which is right in their front yard. I was reminded of this just last night when I got their burger of the month. It was cooked to my liking, but the bottom bun was so soggy I couldn't even pick it up. Also, despite the toppings, the lack of seasoning on the burger and the overly-charred exterior couldn't be overlooked. Stick with patio drinks and their truffle fries."}
{"text":"This is a very upscale place in the up-and-coming suburb of Avon, OH.  I grew up in this area and was here due to a plan to meet old school chums in a local bar (not this one).  The food here is all hamburgers and apps...but they do a great job with both.  They have nice choices, but you are not allowed to substitute any items on your burger.  Fear not, though...they have a build-your-own option!  I had the not quite Patty Melt, which was juicy, cooked-to-order and served on Brioche bread.  I returned later in the evening for a nightcap after meeting my friends.  The place was packed and a live band was playing.  The acoustics are not great, so I'd suggest the band play at a slightly lower volume in order to allow the musicianship to show through.  This is a cool place and a great addition to the area.  Get.  In.  Here!"}
{"text":"PLEASE PLEASE PLEASE TAKE DOWN THE LIGHT THAT SHINES IN YOUR EYES ON THE TOP BACK LEFT AND RIGHT OF BAND STAGE!!!!  It's blinding and doesn't allow you to watch band!  Also please turn the volume down a hair.  I left feeling like I couldn't see/hear!   Burgers were good though.  First time here was a Sunday: Don't ever go hear on a Sunday evening/night.   The street sweeper comes buy and blows dust all over you if you are sitting on the patio.  There also appears to a group complete loser rednecks that love to talk junk about every female.  Complete losers!"}
