{"text":"It breaks my heart to see anything but a 5 star review for Bar Henrietta. We had a fabulous time and loved everything about it from the playlist, to the wine selection, to the ceviche and roasted jambon. So lovely, such a delight. It was the perfect way to begin our evening."}
{"text":"Just discovered this place. Such a Great vibe and friendly staff. The cocktails were original especially the Goldeneye! I tried several plates and loved the variety and the fact that the kitchen is open late. I Will be back and this time with a date!"}
{"text":"Extra nice. We has the clams and they were killer. Great service, they were still building the outside seating when we came in the first time. Great spot."}
{"text":"I hadn't been here since it was Baldwin's barmacie. We were looking for a calm place for a drink on a Saturday night and decided to check it out. I love the look and decor - the long communal table running through one side of the place is well done. The music (authentic Latin) was great albeit a bit loud and the ambiance waa nice. There is an extensive wine list (most choices available by the bottle only) as well as a cocktail menu. Drinks were good - olives we ordered to nibble on were a tiny portion. We didn't eat but the choices looked interesting. Service was just ok - waitress was lovely and took our coats but waiters who subsequently served us were a little cold."}
{"text":"Thoughtful staff (especially our bartender Nadia). We had a Goldeneye and an Atlantic, I would definitely recommend both. Food was way overpriced, considering both its quality AND quantity"}
{"text":"The llita was a perfect post-dinner drink (it has chartreuse ... and gin, prosecco and cucumber). The aroma of popcorn with shaved cheese, lemon and chili pepper was amazing, so I would definitely love to be here again with an appetite."}
{"text":"Aesthetically it's beautiful, but it ends there. Astoundingly overpriced white bread/ Kraft cheese sandwiches with no distinguishing extras. Don't get the food."}
{"text":"Wow...very bad...very bad. Where to begin??? Don't like the decor....service ....heuuu what service????!!!  There are no fun reasonable possibilities to accommodate 4 people....what kind of seating concept is this??? I was told that they don't take reservations ...but the place was 3/4 empty....and were told that we had to move from the only reasonable table / banquette that could accommodate us...as it was reserved at 11:00pm(????)....as we left at 10:55pm...no one, whom allegedly reserved that specific banquette, was to be seen...never mind.  Cocktails: We love cocktails...None of us like any of our cocktails...dunno what to say really.  Food: very decent! Carpaccio, mini octopus, grilled cheese. The popcorn, cheese etc thing...abort!! Very oily.  Nope we cannot be back...we much prefer Barmacie, on all aspects."}
{"text":"Two friends and I stumbled upon this place because where we intended to go was closed for a holiday. We got beer and food and everything we ordered was amazing!! 2 of us are vegetarian and the grilled cheese, cucumber feta salad, and fresh goat cheese toast were all incredible. The beers are local and so good that we almost ordered every single one on the menu. It was a small beer list but very well-selected."}
{"text":"Bar sympa, ambiance tamisée, service agréable Large choix de boissons, petit choix de bouffe Prix corrects, musique sympa (j'ai même entendu de la salsa me semble..) A essayer!"}
{"text":"Beautifully decorated bar. Drinks were tasty but quite small. Very small selection of food. But good place to have a conversation. Would recommend to to others and try. Waiters are also all nice and speak but French and English; they even offer to hang your coats up in the winter."}
{"text":"Henrietta is a great place to have a good drink and have a good bite with friends. Their tuna is really good and their Goldeneye cocktail reminds me of Jamaica. The decor is cozy with lots of wood. Its a good place to have fun and drink wine at an affordable price. Will definitely come back again."}
{"text":"Endroit à la mode du jour, décor frais et chaleureux, accueil et service A1 ! Nourriture excellente, de style \"à partager\" entre amiEs ou entre amoureux. Superbe découverte à refaire prochainement."}
{"text":"Exquisite decor, tingling music, and above par drinks. Henrietta provides a good place to gossip with friends. The hustle and bustle doesn't take away from the great service with its ever smiling and welcoming staff. Maybe not a good choice for a first date since the high decibels can interrupt a flowy conversation.  The cocktails were flavorsome, as you would expect from a decent bar. However, I think there is room to improve the originality of the beverages which explains the last missing star.   PS: Taxes are included within the menu which is, I thought, a nice feature and goes along with the European concept of Henrietta."}
{"text":"This place is vey cute, great vibes to go out. Quiet but not too quiet, never too loud. Amazing cocktails, great food and very very good service. Definitely my go to place to have a bottle of wine with a few girlfriends!"}
{"text":"I haven't eaten here since the change from Barmacie, but I did swing by after dinner recently and just loved the look and feel, the friendly service, and the affordable and dry and lovely glass of cava they had on the menu. We were able to cozy in with our friends who were already there, a kind person came and offered to tuck our coats away in the closet which made the small space feel not cramped. We were also able to order and pay promptly which helped since we were running to a show.   The lighting is soft and romantic, the vibe is just right for a chill date or a friend hang with intimate overtones, or for laughs on Laurier with new friends.."}
{"text":"Je suis présentement chez moi et j'ai un gros craving pour un cocktail du Bar Henrietta. Plus précisément, le Betty Flanagan fait à base de bière au gingembre. Je pensais qu'en faisant la critique d'Henrietta sur Yelp, j'allais pouvoir me distraire et par conséquent calmer cette envie soudaine. Mais j'ai encore soif."}
{"text":"Ambiance lounge détendue. Un peu bruyant le jeudi soir étant donné l'achalandage.  Menu tapas varié. Vin, bières, bulles et cocktails créatifs. Belle terrasse à l'avant."}
{"text":"I wish I could say \"the king is dead, long live the king\", but somehow I feel Henrietta is still in search of its identity or I simply miss the bar that used to be at the same location: Barmacie. The ambiance  was nice, the music was happy, although the place became slowly noisy with the Saturday crowds. We were party of ten and the only available table for us was long and narrow with stools without back support that I find suitable for very short visits. I think what made me sad is the list of cocktails. I bothered trying the Goldeneye, which would have been a hit, if the glass wasn't full of so much ice to dilute to maximum the intended spiciness. On the other hand the Bloody Caesar was soooo spicy that my lips were burning while I was drinking it, although it was made Russian strong as per the wishes of one of my friends I wouldn't feel the vodka. Had to order another beer to wash the heat. In a matter of fact our host offered a substitute when he heard my complaint, which is in line of what a good service in a bar should be. Prices of the drinks are overall reasonable, but my less than ten olives appetizer did not deserve a five dollars charge. I hope the cocktails in Henrietta will improve over time as I would love to come back, sit at the bar with my date and write more excited review!"}
{"text":"Nice ambiance, really cute patio, I enjoyed the wine and apps I tried, but this only gets 3 stars because our waiter was really bad. I tried several VERY different types of wine and he re-used my wine glass each time! This is supposed to me a wine bar, isn't it? The person I was with even said \"you're re-using the same glass?\" and he either didn't hear or didn't react. And then proceeded to not bus any my partner's empties. Really weird."}
{"text":"I used to come here before when it was Baldwin Barmacie, and Henrietta does make an impressive change in terms of the decor and ambiance of this cocktail bar. We came here mainly to try their \"tapas-style\" menu. As we walked in, the place was pretty packed and we were able to grab a \"2 seat\" table but we were 3 guests so we kinda had to squeeze in. The table is quite small. It took a while before we got to place our order and the service was horrible. The server/bartender didn't take the time to greet us, smile, or show any type of interest in what we wanted to order. We got our drinks first and I would definitely recommend a Mojito. It's served in an stainless stell glass with a snowball on top. Quite a cute concept. Our food arrived after 25 minutes and I must give them 4 stars on the food. Everything is delicious and I would recommend the ceviche, the batata and the sausage. YUMMY! We wanted to order more drinks, but no one ever came back to see if we wanted anything else/how we were doing. We ended up just grabbing the bill and leaving. The server never thanked us or showed any emotion.  I am giving 3 stars based on the crappy service we received. Other than that, it's a great place to catch up with friends and grab drinks."}
