{"text":"Exelent service!!!!!!!!
Delicious food, thanks. 
That's was a great time 
Ill see you soon."}
{"text":"Incredible. My new favorite Charlotte restaurant. Every dish was unique, well prepared, and so so good. Will be back many times to come!"}
{"text":"Great atmosphere, paired with great, fresh ingredient small plates and wine. Highly recommend the oysters, beets w/ goat cheese and the trout!"}
{"text":"We came here to celebrate our 5 year anniversary. 

The pros:

First off, the place is gorgeous and intimate. It looks like you walked into West Elm. When we arrived, we were the only guests there, except for a single diner at the bar. We were the only guests the entire time until we were paying our check and another couple entered.

The food was great! It's a tapas/small plates concept, which some love and others hate. We enjoyed all our our meals. As a vegetarian, I appreciated the options even amongst the small menu offerings I was still able to get a full meal.

We ordered a few of the mocktails, since the restaurant is still awaiting its liquor license. They were all well crafted and enjoyable.

The cons:

My partner ordered a beer and it was not cold in the slightest. Not sure if this was due to them just getting their beer permit or not.

The music - the music itself was great, but we were interrupted twice by pandora ads. And not just quick ads, but 1 minute+ advertisements. This would have been fine had we not been the only ones in the place, so it was very distinguishable. 

Service was pretty much great, except a few hiccups that I'm sure will be taken care of as they work through some of the growing pains. We twice ran out of water/beverages and the waitstaff was congregating at the bar chatting quite loudly (it's a small place, and again we were the only table - so took a little away from the experience, but nothing too serious!) 

Bottom line: 

Will return again sometime. Hope this place does well and works out a few of the minor kinks!"}
{"text":"My husband I have been dying to try Bardo since they opened. And let me tell you, it was INCREDIBLE. Immediately when arriving, the owner Jayson greeted us and made us feel right at home. The vibe is super chill and the staff was friendly and very knowledgeable of the menu. 

 This was by far one of the best meals of my life. Mike, the CO-owner/chef is dynamic. We started with cocktails crafted by incredible staff. I highly recommend the Mint 75. 

We indulged with shishitos, beets, beef tartar, sea trout, octopus and we wish we had room for more.  Next time I can't wait to try what we didn't get around too. 

We can't wait to come back!"}
{"text":"Arrived at the all new bardo restaurant in the gold district and was immediately welcomed into a warm and inviting space. 

The impeccable decor and eye for detail is apparent at every corner.

We were greeted with great warmth by the owners and Chef Michael took great care and concern over my allergies.

Their menu is a true culinary artisan experience!

The food.... where do I begin!!!! 
Every bite is a new experience, a new flavor, a new journey!  

The finest ingredients and worth every penny!"}
{"text":"Got a chance to try out Bardo during opening week and we are just so thrilled to have this place in the Gold District!  The menu includes beautifully-plated small plates by Chef Michael Noll and phenomenal cocktails by Amanda Britton.  Our favorite cocktail was the Putting Down Roots with Muddy River Rum, Sombra Mezcal, yellow beet, carrot, dill, ginger and lime. So fresh and so tasty.  The beef tartar is amazing, as is the Crudo Kampachi and the Smoked Beets.  

The restaurant itself is cozy and intimate, with modern decor. The design includes an open kitchen so you can see the food being prepared. 

It is a small restaurant and they don't take reservations, so get there early or plan on getting a drink from the bar while you wait.  

Great in concept and in execution."}
{"text":"We went here for an anniversary dinner last Saturday. We actually had reservations elsewhere, but when we saw that the cocktails here sounded a lot better, we decided to change our plans. 

This is now one of my favorite Charlotte restaurants, and I have eaten at 120 places here in the last year and a half. 

We started with shishito peppers, which had a very yummy sauce on them. Next up was crudo, which was one of the best crudos I've had. We followed that up with beef tartare (very good) and brandade (a new dish for us -- it's basically a warm cod and potato spread that you eat over bread). But the BEST dish was the 60-day aged beef. Mind blowing. It was so flavorful and tender...I could've had about 10 plates! For dessert, my wife had the carrot cake (paired nicely with ginger ice cream), while I had charred peaches. 

Drinks are very unique, and the bartender was really nice and even came over to help me choose my second cocktail. 

Service was outstanding. Our waitress provided excellent service and was attentive to our needs. No one was snooty or pretentious, although it's clear everyone takes pride in their work. 

Decor is super cute. It did get difficult having so many plates on the small tables for two, but that's a minor complaint. Open-concept kitchen and bar is nice to see, too. 

I can't wait to come back here!"}
{"text":"excellent food.  went there on their first opening.  had a great dining experience.  we ordered couple courses to share.  

the oyster.  fresh and delightful.  the yuzu sauce doesnt overtake the freshness of the oysters and the oysters were fresh and yummy.

shishito pepper w/ xo sauce.  its spicy and crunchy, not extremely spicy which I like.

Spanish octopus.  crunchy outside while its soft and tender.  the diced sausage and the sauce compliment the octopus big time.  a very thoughtful dish.

the steak with some kind of rice.  mix them!  the rice is a bit salty by itself.  but the dynamic changes upside down when u eat with the steak.  steak is cooked perfectly.

lamb belly.  I have a thing for belly.  this rates top of my list.  the belly has layers of flavors bursting out on and after your first bite.  it's a must order item.

the service is attentive but not overwhelming.  the chef owner even came out to explain his creations.

I usually don't rate 5 stars for restaurant unless it shows their passion, great service and good food.  this one has all of above.

must return and highly recommended."}
{"text":"Welcome to the neighborhood! 

My husband and I walked over tonight for dinner. So awesome to have this so close! 

We were greeted with a warm welcome, and the space is nice and inviting. 

Drinks: 
professor plum and putting down roots. Both excellent and well balanced. The mixologist was very kind and knowledgeable. She made sure to come over and say hi, which made us feel welcome. 

Food:
Sea trout - our favorite dish of the night. The corn puree was so delish
Lamb belly- tie for second favorite dish. The cocao nibs were an interesting touch
Ricotta tortellini- our least favorite dish of the night. Needed more seasoning and flavor overall. 
Shisito peppers- tie for second favorite dish. The smoky char and sauce over the peppers was so great! I could eat these forever. 
Tart- underwhelming and not the finish we expected our meal to have. 

Staff was kind, but I felt as though our waitress didn't have great knowledge of the menu. She seemed to dodge every question we asked. I anticipate and hope this will get better with time. 

Lastly, the food is so fresh and definitely high quality, but dang is it expensive. I feel with the size of the plates they could step down the prices a bit. 

We will be back, but we can't afford to be regulars."}
{"text":"Loved this place. So happy it finally open! A little pricey but everything was delicious. Will definitely be back."}
