{"text":"Buy a mop, hire a janitor, please do something.  I love the food, drinks, location and vibe but I'm giving up after being a regular customer for 3 months!  It's gross.  Tables are sticky, railings and fixtures are covered in a thick layer of dust, the floors and stairs look like they have never been swept much less mopped.  Swarms of fruit flies around the dish return and trash cans.  Today the flies drove me to the competition and I won't be back."}
{"text":"Extremely pleasant and helpful staff who really know their coffee. Each day there are two different coffees  (medium  and dark roasts) plus a decaf. They open early at 6am."}
{"text":"Delicious coffee drinks for reasonable prices. The interior of the shop is nice and spacious. There is a bar with stools and plenty of tables on the first floor. The second floor looks like it'd be a quiet and cozy place to get some work done. I tried the baby grasshopper coffee drink and it was perfect- chocolatey and minty but not too sweet. It wasn't cheap but it was a generous size for the price. I can't wait to go back and try some of their food!"}
{"text":"I don't like the 5 dollar uncorking fee.  I really dislike it.  They also make you buy food too.   Even if you just bought something ten minutes ago, that doesn't count.  You need to buy something else.  On the same receipt.  No, you can't show them the old receipt, with the time stamp on it.  

VERY IRRITATING  

 But apparently it doesn't hurt their business, as even on weekdays you see groups of students gathered around a bottle, so, what the heck.   I guess it seems cool to get a whole bottle of wine and drink it in a coffee shop.  (Residents of BYOB cities will find this whole drinking a bottle much less impressive.)  

Otherwise, the typical coffee shop fare will leave you pretty unimpressed.  Sandwiches, cookies, scones, etc.  I dunno, I don't like paying 8 bucks for a tuna sandwich and chips.  But lots of people seem to love the food here, rave about it.  Ho hum.  

I tend to this Barriques is about as chic and pretentious as Wisconsin gets.  Take from that what you will.  I'll take another sip of this wine."}
{"text":"I've been to a lot of coffee places around town, and I'm pretty sure that Barrique's is the best of them (at least the location on W. Washington). Everything I've had here - coffee, baked goods, sandwiches - has been really good. You can also get wine and beer here; in fact, the wine selection is extensive and one of their specialties. The place itself is palatial - two floors of seating, with a very cool layout - and I've never had a problem with the free WiFi. Staff is pretty friendly and helpful, as coffee-place staffs go. So, what more could you want?"}
{"text":"I buy a large drip coffee here most weekday mornings and for the past month my coffee has been filled with coffee grounds. Please change the way you are making coffee so the coffee grounds don't fill up my cup. Thanks."}
{"text":"I have spent a fair amount of time at the various Barriques locations studying. 
This location has the following virtues: conveniently located downtown, Good size tables for studying, built in water cooler so there is an endless supply of water to help yourself to (as opposed to a pitcher). However, this is my least favorite location because of the combination of no comfy leather chairs to snuggle down into, no fireplace and the staffing. There was trouble with their computer system and they couldn't accept credit cards. 
The people ahead of me had already ordered and their orders had been made, but they had no cash. The staff just gave the people a hard time about something that was caused by the coffee shop's system. No \"its our fault, here have it on us\"- just continually pushing the people about not having cash. 
This was followed by me attempting to pay in cash. The cashier couldn't figure out what to do, had to reboot the computer system, didn't put in my order and then rung up my order for a larger size than I ordered. No apologies for all of this and the extended wait."}
{"text":"This is the place I always get coffee before work in the morning. I always judge a coffee place by their black coffee, and Barriques always has fresh and delicious coffee throughout the day. They have raw sugar available, which is a must for a coffee snob, along with half & half, 2% and whole milk . Along with greet coffee, they also have a great wine selection ranging from $12-40."}
{"text":"Haven't been in many coffee shops that offer liquored coffee drinks. The one I tried tasted great. I can't speak to the regular brewed stuff, but it seemed good."}
{"text":"I live near this location and love being able to walk over at night for some wine. I think $15 to enjoy a bottle on the premises is a pretty good deal. I don't mind the corkage, since they are providing glasses and atmosphere. 

As far as selection, I'm a big fan of the Wall of 100.  It takes the guesswork our of finding a good cheap weeknight bottle of wine. If you're looking for a nicer bottle, you'll probably have better luck at their Wine Cave on Monroe Street. 

I've also tried some of the food, desserts and coffee and I was happy with all of them. My main complaint is that people go there to study, which is fine, but they take up a 4 person table for hours at a time. If you're standing there with the food you just ordered, that's pretty annoying. 

Other than that, I think Barriques is great."}
{"text":"Of all the coffee shops in Madison, this is probably my favorite one to do work at. On my spring break adventure to Madison, Barriques was a must-revisit. The clientele is a bit older than the other campus-area shops (which is kind of nice), largely due to its proximity to the capitol. In a pleasant way, its a little bit less of a scene. 
They play good music, the employees are friendly, there are outlets throughout for their free WIFI and if you don't have a computer, they've got a few that you can do internet searches and check your email from for free. In my world of coffee shops, they have the most ideal tables- Large enough to spread out your papers/laptop/food/coffee and still *be comfortable*. yay
Any of you who need to get out of the house to get work done, Barriques is like a gourmet, un-sterile library. And I mean that in a good way..."}
{"text":"Coffee may be great but service and pricing is terrible.  

I ordered a large (3 shot) americano in a small cup and they charged me for a small with two extra shots (almost a dollar more than the large). When I complained they said they charge based on the \"cup\" you actually get and that I had created a small \"custom\" coffee. I was told that if I wanted a 3 shot for the cheaper price that I could order the large and ask them to only fill up the cup with half the water. I informed the manager that the theory they were using was completely flawed from a common sense perspective....she responded with \"sorry\"

WAKE UP AND FIX YOUR PRICING. I WILL NEVER BUY ANYTHING FROM YOU AGAIN UNTIL YOU DO."}
{"text":"In a town full of coffee shops, this is my favorite place for a meet-up with a friend or for some writing time away from home. The coffee is fantastic, and I can even get a glass of wine if I'm in the mood. The sandwiches are great and the staff is friendly and attitude-free."}
{"text":"I love this place I drink here coffee everyday! 

The stuff super nice and it always clean"}
{"text":"They serve great coffee and its got a very trendy vibe to it. The  barista's know what they are doing and will make you a very good coffee drink of any kind. They are also fairly knowledgeable about the wine selection available to you by the glass or bottle. 

If you are a college student beware when it's busy you may have difficulty finding a plug for a laptop, but if you are smart and bring a power strip with you, you should have no problem finding a table and sharing the outlet. 

The food is also really really good here. I have never been to Barriques for breakfast, but the sandwich, soup, and salad menu is great. I'd go for the Hook's Melt any time. Great cheddar and the horseradish aioli combine for a lip smacking good sandwich."}
{"text":"Barriques is exactly what it should be: a great coffee shop with some nice food and snacks available. I enjoyed the \"Wisconsin Dip\" (grilled cheese) with tomato basil soup, that came with a side option (can't recall all the choices but I think it was pasta salad or greens). While I wouldn't exactly call the staff there terribly interested, helpful or friendly, they got the job done, and left me alone. It's a dim place (in a pleasant way) and other reviewers have noted the tendency for patrons to sprawl out with work, school work, laptops, etc. and camp for extended periods. It was perfect for coming in out of the rainy farmer's market and leisurely enjoying lunch and a latte, doing some people watching, and sending a few emails. Lovely spot, will definitely be back to enjoy this respite."}
{"text":"Awesome breakfast sandwiches.  Great staff,  although some crew members could be a bit happier."}
{"text":"We were in town for 3 days.  We came here about 5 times.  Yes, it is that great.  I am so sad I didn't take more advantage of Barriques while living in Madison.  The staff is friendly and knowledgable about their offerings.  During the day, it is a great spot to grab a cup of coffee and relax.  At night, it is an awesome spot to grab a drink and kick back.  

Wine is ever so reasonable priced (most around $4.50 per glass with a very generous pour!) and very decent quality.  For the non wine enthusiast, an ample beer selection awaits you, with good seasonal selections I might add. 

We only sampled the breakfast food, specifically the egg, cheese, and meat sandwich.  I went with sausage.  Husband went with bacon.  Both were delicious but the sausage is where it is at.  

I can't wait to come back.  If you haven't been, go.  If you have, go again.  For me."}
{"text":"Food review: We tried the tuna melt and the bacon ranch wrap with pasta salad. Both the sammies and the pasta salad literally tasted like they were from a gas station. Very poor quality. I'm disappointed because a Barriques is going into our neighborhood on the East side. Bummer!"}
{"text":"This is a great place to warm up with a cup of hot tea, as Wisconsin is apparently freezing in both November and June. They have an excellent drink selection, and I especially recommend the ginger pu erh with a bit of whole milk. This seems like it would be a great place to study or meet up with friends as well."}
{"text":"Of all the coffee shops downtown Barriques is my favorite, and not just because it the closest one to my house.  I usually just get brewed coffee, but their lattes are good, and they have a big variety of teas.  Their sandwiches and salad are good too(a little pricey); I like the tuna sandwich, and the hummus sandwich.  Their cookies are really good too, especially the Cowboy cookie.  

I also use Barriques as my wine shop.  I can always find something I like, and the staff are usually very helpful with suggestions.  

My only complaint about Barriques is that it can be hard to find a seat during the day on the weekends and on some evenings."}
{"text":"Great coffee, decent food, free wi-fi with plenty of seating on two floors in an eclectic and unique setting just off the Capitol square. Very \"Madison\" (that's a good thing for you unfamiliar with Madtown). 

The upstairs balcony seating is the best, especially if you can score a table by the windows overlooking the streets below. Nice people watching spot. 

Oh, and they also serve and sell wine (by the glass or get a bottle to go). Makes knocking out that last work email of the day a little more challenging then usual at times..."}
{"text":"Lots of unique gifts and everyday coffee/tea enthusiast accessories.  Sort of a new and old, dark design which fits the style nicely.  
I was merely popping in for a quick coffee.  The coffee I got, but the quickness, not so much.  This, obviously, can be expected in busy coffee shops from time to time, so i'm cool with it.  The coffee was quite good, but i'd be remiss to pop in if there was a big line."}
{"text":"Not a coffee connoisseur, but I loved the Biker's Dream Wrap and enjoyed the great atmosphere.  I'll be back, as this proved to be a great (LOCAL!) place for informal small business meetings"}
{"text":"Located just off the square and open late, Barriques is a fine place for lingering over wine or coffee, getting some studying in, or chatting with a date.  Evenings, both floors are often packed--stake out a place to sit first before you order at the counter.  There's a selection of coffee, teas, and cold drinks, as well as salads, sandwiches, and pastries, not to mention beer and their wall of wine.  Staff can sometimes be more attentive to each other than to customers, but are friendly overall."}
{"text":"This is a very decent coffee shop. Certainly not the best cup of joe in town, but one of the better places around the capitol square.

They switched from Alterra to roasting their own beans in house a year or so ago and are starting to hit their stride. It was very disappointing for the first few months but has gradually improved. There has also been a complete turnover of staff; this seems to have resulted in better brewed coffee -- now it always tastes fresh and like it has enough grounds -- but somewhat less impressive espresso drinks.

They finally put in more power strips, so there are enough places to plug in laptops. It's an excellent place to chill out and work when it isn't packed with other people doing exactly that.

They continue to have a good wine selection at some of the best prices in town. They have a handful of tap beers, also at very good prices.

The food isn't great, but it's ok in a pinch or if you're sick of the other quick lunch spots around the square. Food preparation seems to have sped up considerably of late, which is a welcome change."}
{"text":"I stopped in here with my wife to meet a colleague for a meeting that ended up lasting a couple of hours. The coffee was again incredible and I was taken away with the little shop. I wish that every town had such a great cafe at its heart. Barriques has really grown on me, and it now ranks as one of my favorite cafes anywhere. 

About me: I've roasted coffee for the last 9 years and own two professional espresso machines along with pro grinders and a lot of other equipment, so it's rare that I find cafes that can prepare coffee on par with what I make at home."}
{"text":"This two story cafe tops them all (barriques, and other coffee spots!), with quaint-ness, unique-ness, and flair.  i love the option of the outdoor cafe, shaded, and with the captiol view.  2 thumbs up, easily."}
{"text":"Nice atmosphere and location, but fairly mediocre coffee.  Had a traditional cappuccino...meh."}
{"text":"Good coffee, good sandwiches, great location and environment.  What more to love?  Barriques downtown is one of the best coffee shops in Madison."}
{"text":"It's almost useless for me to go to a coffee shop, let alone review one since I'm strictly a strong-black coffee kind of gal.  However, their iced coffees are amazing- not something I usually get, but refreshing and yummy, even if they have 8 zillion calories.  Caramel sea salt latte- get one!"}
{"text":"I absolutely adore Barriques. I work from home, and whenever I need a break from the home office, I work out of here. The staff is friendly, and it's a really airy, open place to work, especially if you sit on the top floor. While I'm pregnant and can only have decaf right now, their coffee is fantastic, and I LOVE (highly recommend) their Honey Lavender Latte. They also have a really nice selection of food, and I'm a big fan of their Tomato Soup and Lemon Poppyseed Bread."}
{"text":"This is strictly a review on their lunch sandwiches, which are mediocre. Coffee is coffee, gets the job done here. I made the mistake, however, of ordering a California Turkey sandwich...at $8+ I expected more. I wouldn't be happy if I made that sandwich at home, let alone buy one. Go to Subway or stick to coffee, just not good at all, for sandwiches. Stale bread, tiny sandwich, two slices of turkey, one tomato slice, and a tablespoon of avacado. Most importantly, not even tasty, basic, basic sandwich. I'll pass..."}
{"text":"Really, what's not to love about this place?  It encompasses my two biggest in one spot: Coffee and wine.  Wine AND coffee?  In the same place?  YES.

A few of my girlfriends and I stopped in Barrique's before hitting the Farmer's Market at the capitol building Saturday morning.  It was freezing cold and on the verge of an early season snowstorm, so we were not only amped to fill our rumbling bellies, but we were craving some hot, yummy drinks to start the day.  Since you never know what you're going to get at the Farmer's Market, we decided Barrique's was the best bet for some tasty delights before perusing all the produce at the market.

The coffee menu has all the right stuff like lattes and cappuccinos, but since I'm off the coffee for awhile, I decided on hot tea.  \"I'll take a green tea, please,\" I tell the gal behind the counter.  \"Which one would you like?\" she says.  Umm... MORE than one green tea option?  Yay!  I settled on a lovely, fragrant orange blossom green tea that was so delicious I was actually a little sad when it was all in my belly.

The eats aren't too shabby, either.  I ordered the granola and I was happy to see it was jam packed with a great variety of dried fruits.  Add some skim milk and I was full and content.  While I didn't indulge in the pastries, my friends assured me they are fabulous.  My girl Steph was eating this blueberry pastry thing that looked incredible.

Oh, and did I mention this is ALSO a wine store?  They have a huge variety of wines (including organic options - hey, this IS Madison) so I can't imagine someone wouldn't find what they need.

Keep up the good work, Madison and Barrique's.  You're tops!"}
{"text":"The redesign is awful and very sad looking. This used to be such a neighborhood treasure and now it's just.... not."}
{"text":"Friendly service. Tasty cupcakes and probably the best iced tea in town and anywhere! Good place to work. Free wifi."}
{"text":"Coming from fitchburg and comparing the two locations, I am pleased with BOTH. I am glad that each location has their own feel and they aren't quite the same nor are the too far apart. Great place to do some homework and hang out with friends, a little more college-student friendly this one. A little more going on rather than the more \"elegant\" atmosphere of the fitchburg location. Staff is a little nicer there as well."}
{"text":"I had \"Miel\".
It's a great coffee with cinnamon and honey, but it would be better if it more milky than this.
Staffs are really helpful and cute.

And this shop have so many various of coffee and wines.
Great place to hang out and doing homework !"}
{"text":"My heavens, their truffles are good, too!

And another star for consistently courteous and calming staff."}
{"text":"excellent atmosphere.

love the comfy couches and chairs.
during the summer, outdoor seating is available.
many outlets for laptop charging.
free wi-fi.

average coffee.  not the best coffee connoisseur actually, but the mochas are good -- and the mocha shake when they have it.  

the cheddar grilled cheese is to die for.  and the potato salad that comes on the side is delicious too; there are pieces of bacon in it!

extensive collection of wines.
love coming here and sharing a bottle of wine with a friend for conversation and catching up.

sometimes it can get crowded and it's hard to find a seat.. but overall, a 5 star experience."}
{"text":"Blown away. The coffee is so so so so good, the service is great! Half priced cookies after 8, plenty of seating, and of course- they sell wine! Veggie friendly too. A++"}
{"text":"In our effort to try out local favorites in any city we visit, we went out of our way to try this \"local\" cafe for breakfast and coffee.  Upon entering, we loved the decor and the fragrances from the walls of coffee beans wafting through the air.  We immdediately ordered a local brew and a cappuccino.  We were also intrigued by the food menu and opted for the avocado jack which included avocado to make the gf happy and jack cheese to make the bf happy.

The full bore brew was delicious and tasty.  The flavor was dark and did its job to wake me right up.  The sandwich was tasty, light, hot, and complete.  All the flavors tied together so well.  There wasn't any complaint from us.  

As we travel throughout the city the rest of the weekend, we then noticed several other Barriques locations and realized this was not as small as we thought.  Even though there were other locations, they all seemed to be local offerings which kept its small town feel that we loved."}
{"text":"This coffee shop offers the perfect perch for people watching with a balcony that rings the main level.  The cafe was bustling on a Saturday afternoon but I was able to snag a table without a problem and happily while away my time reading.  The atmosphere is relaxed  with lofty ceilings and lots of natural light and it's not too loud, making it a good place to read or catch up with a friend.  But don't worry, it's not one of those overly quiet cafes where you feel uncomfortable having a conversation because everyone is studying and giving you the stink eye. This is definitely a place I could hang out at for a while. Next time I'll just be sure to go back on a Sunday so I don't have to repeatedly interrupt my happy-cafe-reading time to keep running out to feed my meter!"}
{"text":"Barriques is the perfect place to cozy up with a cup of whatever you fancy (I'm a huge fan of their coffee) and let the time slip away! The tables make it an ideal study location, it's always clean, and the noise level is kept at a low roar...all qualities I look for in a coffee shop. The West Wash location is my personal favorite, maybe due to its easy downtown access. If you're tired of State Street's cafe offerings, I'd highly recommend a visit to Barriques! (The blueberry goat cheese salad is delicious, fyi...)"}
{"text":"I had a lavendar honey latte and a blueberry lemon scone. Both were satisfactory, but the latte was beautiful. The atmosphere is quaint and cozy, and I sat at the window facing outside. Since today was Sunday, there weren't any people walking past, so the view was quite peaceful. The employees were nice, not overly friendly, but just fine. I got a breakfast sandwich to go for my wife. Even though it wasn't hot by the time I walked back to the hotel with it, the sandwich was still delicious. Stop in here if you want something a little different."}
{"text":"Great place to hang out or read a newspaper or book. It's clean. Table is wide. Noise level is average but acceptable.

Good coffee selection. The internet is good but can be slow. I can often find parking in the evening but the ones right outside are not usually available. I need to walk a couple of blocks."}
{"text":"Uh, yeah. If you don't love love love Barriques, you should probably find another city to live in because loving Barriques is what living in Madison is all about. 

Why?

Because students. Your stack of books on Plato makes me feel great about being a yuppie who did once have but no longer has to have a stack of books about Plato.

Because free internet and yummy lattes. Snowman shaped foam decorations.

Because people watching - what leggings are in style? Oh galaxy? Okay.

Because wine of the month club. Okay, I'll take a short walk to my wine of the month and take you home tonight.

Because adorable baristas and baristos. 

Because proximity to concert on the square.

Because reasons.

Love it."}
{"text":"I have yet to find a cafe' americano that is comparable. I throughly enjoy the mini mediterranean experience due to the amazing nicoise olive tapenade with hummus. I like the fact that you can look at wines and coffee essentials while you wait for your food and drink."}
{"text":"I've frequented this Barriques location more than 100 times. The service is nearly always pleasant or better, even during busy times. The maple pecan scone and breakfast sandwich are my favorite menu items!"}
{"text":"I have been coming to Barriques since about 2007.   The have great food which changes over time but is consistently fresh, tasty and relevant.  The veggies are always fresh the meats are awesome.  The portions are plentiful and anytime I've had an issue they are always prompt to find a solution.  It's not my favorite latte or espresso place, but I love their tea and black coffee.  I really like that they're open late for a tea and or wine and a snack.  Overall very good and consistent."}
{"text":"Consistently great coffee. That is what you need to know.
Depending on location, quality food: breakfast, lunch and dinner: sandwiches, salads, paninis, scones, cookies, etc.  
Wifi to stay all day, hang out, and atmosphere at all locations is always interesting.
My favorite might still be on Hwy. PD.
Staff is always polite.
I will never turn down a chance to go to Barriques."}
{"text":"I'm a big fan of this place, where you can get a cup of coffee and a glass of wine at the same time. There are also sandwiches and other premade snacks in their display case.

This place is huge, making it a good option for hanging out or getting some work done. Outlets are abundant. There's bar like seating downstairs and larger tables upstairs and you're a quick walk away from the capital.

I've never had trouble finding parking either but you will have to pay. There are meters lining every surrounding street and a parking garage not too far away"}
{"text":"Great recommendation from my hotel clerk... Cool coffee shop with an awesome breakfast wrap! One block from the capital, I will be back for sure!! Free WiFi and cheap coffee refills!"}
{"text":"Some of the best coffee in Madison!  Very good service and every employee knows how to make coffee!  The food is great and the atmosphere, wonderful!  Very pleased every time.  Never had a bad experience over years of being a customer."}
{"text":"It's not far from State Street, yet manages to avoid that annoying, overcrowded feeling all those coffee shops get every night (IMO). It's pretty much everything I could ask for from a café: nice atmosphere (dark tones), good coffee (fancy pantses be warned, I only drink lattes), good food, and spacious - but not too spacious."}
{"text":"I'm not a coffee shop kinda guy, and I don't think I ever will be.

However, if I were, Barriques would be my go to place.

The service here is extremely friendly and interesting to talk to. I love asking the baristas for their favorite drink, because they definitely know what's up.

The decor is pretty nice, with a modern and classy(ish) vibe. 

Once in a while, I'll wear my scarf and some large rimmed glasses, and pretend to be a hipster. 

Oh, and their tea is wonderful. Aromatic, diverse and flavorful."}
{"text":"Barriques is one of those quintessential elements of Madison that made me fall in love again and again with the city. All of the cafes are quirkily decorated, but the one on W. Wash is my favorite, followed by Monroe St (which was recently remodeled).

If you're looking for a Portlandiaesque coffee shop where the baristas are too hip to treat you like a human being, go elsewhere. While the baristas are typically pretty plugged in at Barriques, you won't find pretentiousness here, which makes it even easier to like. 

First of all, the coffee is excellent, and the baristas know what they are doing. If I ask for a dry cappuccino, I get a cappuccino with foam so well done that it doesn't matter if I need to attend to other things at work for 15 minutes before I can sit back and enjoy it over tedious emails. I've never had a bad cup of coffee here either - in the summer, the cold press is my favorite farmers markets option, and I'll wait in line for it over the watered down but luke warm options waiting outside. The baristas are also very friendly, and willing to chat with you about their favorite options if you're feeling adventurous and inclined to ask.

The food is quite nice too. I haven't eaten a ton here, but their baked goods are heavenly (try the scones or the cowboy cookie). The sandwiches are fabulous, and the dishes are more well presented than they have to be. I'm impressed when someone takes the time to make a beautiful looking meal, and the food here is always elegant but comforting. If I didn't enjoy packing my own lunch, I'd probably be eating here every day.

Finally, the wine. It's a nice wind down to my Friday when I can do a wine tasting with a couple friends at Barriques. I usually opt for the one on W. Wash because it's so convenient and I don't have to worry about driving. It's affordable ($10), the guy running it is more than happy to speak with you effusively about the different qualities of the wines being sampled, and he has an amazing mustache. The Wall of 100 is selected through a rigorous vetting process by one of the owners who has arguably the most refined palate for wine in Wisconsin, but definitely for Madison. I've also done wine tastings at the Monroe street location, which is very good, but a bit more staid. 

The Monroe street location also has beer on tap, and it hasn't disappointed yet. Most recently they did a coffee infused porter from Wisconsin Brewing Company that was very enjoyable for the beer sophisticates and novices alike.

Why anyone in the downtown area is hitting up Starbucks (unless a relative bestowed a gift card - I get it) for coffee when they have Barriques is a mystery to me."}
{"text":"Great local coffee shop!  I go here every time I am around.  
It's a really cool setting, with shady outdoor seating.  
The coffee is excellent!  Way better than Starbucks.  
It's the kind of place you want to keep secret, but since I'm there only once a year, I can deal.  
I highly recommend it."}
{"text":"I had gone to a few really nice restaurants during my stay in Madison, I was exhausted from the event and was just craving a delicious sandwich and maybe a juice. I walked to Casetta during their in between lunch and dinner break when they don't serve, so I looked across the street and saw there is a coffee shop that also advertised sandwiches, so I figured I'd grab one there. Upon entry, I was very impressed what I saw. I loved the ambience, the smell of the place shows you that the coffee there is amazing. Of course it was after 3 PM so I don't drink coffee after that. The service was pretty good. The guy who was helping me explained that there were seven local Barriques around. Unfortunately, I could not find them on Yelp when I was researching restaurants. Maybe because it's identified as a coffee shop. Otherwise, I would've probably tried them for coffee or breakfast at some point during my stay. I ordered the goddess pita which is a chicken, Mediterranean inspired wrap with mixed greens. I also tried the brain food bar as my interpretation of dessert. The sandwich and self was just OK. It looked yummy but it lacked something. The brain bar felt the same way about. I would go there with my computer and grab a coffee and maybe a muffin and work all day. But, for a grab and go style it blow my mind. I complimented them on a nice restaurant and also asked a woman who seemed like she was in charge with the big building outside was. I assumed it was the Capitol building but I just wanted reassurance in case I posted a picture online. She looked at me like I was an idiot and answered \"the Capitol building.\" That didn't sit well with me. Overall, this place is definitely worth trying out for the environment and I'm assuming the coffee, not so much for the food."}
{"text":"Sat in for a sandwich and a honey lavender latte on a Sunday afternoon. It was a full house! Seemed to be pretty popular with the university crowd. The sandwich was a turkey club with avocado, quite tasty. I can't say enough good things about the honey lavender latte, very smooth, without being overly sweet. REALLY delicious with almond milk. Would definitely hit this place up again next time I'm in Madison!"}
{"text":"Good. I've been to every barriques in town. I love their decor and atmosphere. Their serving of alcohol gives them a more rustic(?) vibe. 

I don't think their coffee or lattes stand out though and their service isn't as friendly as Colectivo or other coffee shops I tend to go to so I only go to Barriques locations if it's more convenient Han going somewhere else.

I also wish they served a non dairy milk on their counter; I think that's quite the norm these days."}
{"text":"1 star: great coffe/tea/AND wine 
2 stars: cowboy cookie (DO IT, LOVE IT)
3 stars: Wisconsin Dip (Grilled cheese made with aged cheddar on sourdough bread with soup and greens?? AMAZING)
4 stars: adorable and friendly baristas
5 stars: Incredible atmosphere, great seating and chill music, people of all shapes, sizes, and professions... definitely a great study escape from the typical library atmosphere that is UW Madison 

Barriques you will always be my go to spot!"}
{"text":"The type of place you could get a cup of coffee and spend all day \"Working\"

What with the generous outlets they placed around many of the bars and tables, why wouldn't you?  Your laptop could go all day while you \"work\" outside of the office.  And by work, I mean play WoW.

Oh yeah, and the coffee.  Good stuff, indeed.  Very pleased with the medium roast and the cappuccinos.  

Great atmosphere, great location, great coffee.  Love this place."}
{"text":"Ok, seriously, the Sprocket smoothie is A MUST. It is SO good. I could drink one of those every day. I'm going to try to replicate it at home -- I live in Chicago so coming here whenever I want isn't exactly an option.

This smoothie is thick, has strong flavors, and is filling. I wasn't hungry for hours after I drank it and it left me super satisfied. For $5, I am overly pleased.

I also tried the Honey Lavender Latte, which was good but didn't leave a lasting impression.

5 stars goes straight to that smoothie."}
{"text":"Love the work atmosphere here. Lots of space. Large tables for big study groups or small tables for just you (and possibly a friend). Seating available on two floors. Good iced tea and coffee drinks. Staff is always pretty friendly. Wide selection of wine by the bottle if that's what floats your boat. They have some good food selections as well, though I mainly stick to solid desserts. Their snickerdoodle has a nice crisp to it while still being a pretty thick cookie. It has pretty much everything you could ask for in a work cafe. This is definitely a spot that would be high on my list when I'm planning for a longer work session."}
{"text":"At time of writing, current favorite coffee shop to work in Madison (clearly the working part is important to me).  I have no qualms with the coffee here, though I never get the drip - usually a latte or something of the sort. The food is alright but not out of this world (like JPH). I usually get the bikers dream wrap (bananas, peanut butter, jelly...) because although I kind of hate wraps it's what I like the most in the menu with the exception of the breakfast sandwich which is tiny and cheap.

The best for me here is the bar that faces the outside of the shop. I find it really calming to work here and knowing that everyone can see my computer is an extra incentive to keep working :) The staff is always friendly and helpful. Also they have both yelp and belly rewards.

Finally, they just made their bathroom private so that you have to ask for a key every time you want to use it. I never realized it was a problem."}
{"text":"LOVE this place. So sad I didn't get over here more when I lived downtown. It kind of feels tucked away, and forgettable in that sense, which is a shame.

First of all, the outdoor seating is sublime. Aside from Colectivo's open air patio, this takes the cake. The Barriques is in such a unique location compared to the other coffee shop locations, that it almost feels like you're in a very different neighborhood - something that feels more Chicago than, \"Hey, you're either on the square or on State Street because you're in Madison.\" I like that.

The indoor seating is great as well. It feels small, but there are actually quite a few seats, whether it be the bar seating, the big tables, or the upstairs section (don't miss this option if you're looking for somewhere to sit inside!).

As far as drinks, I love Barriques because they have the most original selection. They have alcoholic options, which I never realized could or should be mixed with coffee - it's like legal speedballing, if you think about it, which I do whenever I get the adult grasshopper (basically a mint mocha made with peppermint schnapps). However, I really come here for the Mexican mocha; I can't believe this is the only place I can get one in town, and they pull no punches when it comes to loading it down with spice- LOVE."}
{"text":"The food and drinks are decent. Have had a pretty broad spectrum of the menu and they do fairly well to sate your hunger. Like wraps over sandwiches but that's personal preference. 

The atmosphere sucks if you're not a student or a hipster holding an Apple product. The staff tend to act annoyed if you order plain coffee or something easy to make. 

It's a better place to hang if you have hours of work to do."}
{"text":"Friendly baristas, relaxed and warm atmosphere, natural lighting, loose leaf rishi tea, Vosges and other chocolate, some good gift options-- overall a lovely place to spend the afternoon!"}
{"text":"Cute cafe, but they totally forgot about my sister and my drink!  They told us to not have outside food, yet we watched other people eat and they didn't say anything. Not sure if I'll return."}
{"text":"I like this spot - they're friendly, the coffee is good, and their burritos are pretty darn good.  Costs are reasonable. The last two times I've visited were really disappointing though. Last time, for lunch - the sandwich I got was 90% bread, 10% filling (the tomato slice took up like 1/8th of my bread) and I left feeling hungry and disappointed. That was about a month ago so I took a break. Today I didn't have lunch and decided to order their Monona market bowl because I have had them before and they're really good! But today I ordered my almost $10 bowl and it was about half the size if the last one I got.... I have no food at with today so this thing was supposed to skate me through the day, and I made it exactly 45 minutes until I started getting hungry again. It's too bad because they have such healthy, awesome options and they cater to dietary restrictions really well! I just really expect to have a full meal and I probably won't get lunch again soon at this location... Sad because I work so close and this was my spot for months."}
{"text":"Kind of like stepping into a Harry Potter book.

This location is dark, with a clubby type atmosphere, somewhat claustrophobic with seating on two floors.  Lighting up high, and not to much.  Lots of windows, but you don't get much sun, with the floors, tables, ironwork railings and cabinets just seeming to suck the life out of what light comes in.   I like it.

Coffee is excellent, food is better than Starbucks (low bar, I know).  It's different - which is a good thing."}
{"text":"Tried this coffee at the statehouse and just had to go find a bag to take home! Smooth flavors and their lavender honey latte hit the spot. Love it!"}
{"text":"Great cup of coffee right on the Square. Wasn't too fussy or stuffy and it was reasonably priced for being a cafe in downtown."}
{"text":"My office recently moved to a new location just down the street from Barriques. I've been there for lunch several times now. The food is consistently good. I really like the pesto chicken salad. I have had a few of their wraps and they are great also. I didn't know that I had to grab my own chips when ordering a sandwich. They are kind of hidden off to the side. I got back to the office without chips. So be sure to grab them. :)

The staff is friendly and there is plenty of seating upstairs. They also have a wine shop with a nice selection of wine.

I'm sure I'll be back regularly for lunch."}
{"text":"Excellent coffee, free wifi, great vibe, and friendly staff. Great bagels and the breakfast sandwich is delicious."}
{"text":"My favorite coffee shop in the downtown area. I like that they have good wines as well as excellent cappuccinos. I work here frequently. The upstairs is very conducive to work. The food is a bit pricy for what you are getting but the cheddarhead sandwich is quite good."}
{"text":"Stopped  in today after being away for almost a month.  I live above the coffee and due to the bad service and slow service I started going to Collectivo. Read my prior reviews. 

 YELP you should really consider a negative score in this case I give them minus -5 
 
I  was running late so I thought I would stop in, I wish I would not have.   Coffee Machine was done, no back up plan, did not offer a discount on a premium drink, very matter of fact attitude from staff.   Lots of upset customers and staff like..... oh well. 

 Management is clueless and seems to be a revolving door.    Wake up and Smell the coffee if you can get your machines fixed.

Lots of coffee shops in Madison we are greatly for that!"}
{"text":"Grown up coffee!!! Barriques wins over Starbucks any day!!! Good coffee, great atmosphere and friendly customer service!!"}
{"text":"Got their mexican hot chocolate and it was good! I wished it was little less spicy...they put a little too much cayenne pepper."}
{"text":"I would expect at least a good tasted coffee from a place named \"coffee trader\" but their iced coffee drinks tasted yuk, not even meeting the average expectation. Mine was a sweet one (Iced Mocha) and I could manage to finish it. My wife's was not sweet (Iced Coffee) and she threw it away after sipping a couple of times. I am usually reluctant to throw food/drink away and so I tried to take over hers. But I agreed with her after sipping once. The coffee (probably only iced ones) had a strange disgusting smell and taste. I tried this place and Bradbury's Coffee on the same day. Bradbury's was way better. Not even comparable.

Probably they focus more on selling wines?"}
{"text":"My favorite thing about Barriques...going out for \"coffee\" when I really mean wine. :) 
No seriously, my husband and I really like Barriques. Here is what we like: 
There is plenty of seating, indoor and out. 
The coffee is good. I haven't had a brewed coffee here yet, but all of the lattes and chai's have been good. 
There is a decent selection of wine. 
Parking is not too bad. 
The atmosphere is relaxing, indoors and out. My favorite is outdoors at dusk in the summer. 
The staff are helpful, I have taken to asking for their favorite wine or beer selections when there. 
If you are out downtown, stop in for a drink of your choice."}
{"text":"Barriques was my place to go and hang out with my friends when I lived on Wilson st. This cafe is beautiful and the food and coffee are all tasty. This place totally perfected the details that make a coffee place amazing. The decor is a beautiful iron-worked beautiful artwork. They also sell wine and cards so if you need stuff for a party, this is a great place to stop. 

Anyways, if you are looking for a spot to do some work or catch up with some good friends, this is the place to go."}
{"text":"I was a little disappointed in the veggie wrap.  The sauce was great and the avocados where ripe and delicious.  Unfortunately the veggies left a lot to be desired.  The carrots were dry and because there were grated, they just clumped up.  Maybe they should mix them with some dressing before they put them in.  The tomatoes were a little mealy and flavorless and the cucumbers were cut large and, because they still had their skin on, came out of the wrap with every bite.  That being said the staff was kind and efficient and really, really lovely.  The location was homey and feels comfortable and sweet.  The chai frappe was one of the most delicious things I have ever had in my life and I am now addicted to it and I will have to visit on a regular basis because I loved it so much.
Overall, great job!"}
{"text":"I went to Barriques for the first time today. I used to live here in Madison, and it opened right around the time I left. While I vaguely remember seeing it once or twice, I never went there until I came up to visit and the friend whose futon I crashed on raved about the sandwiches. I'm a total sammie nut, so of course we went. We got there around 1pm, so it was lunchtime but getting towards the end of it. It took us probably 20 minutes to get a table, which normally would speak to the popularity of a restaurant and I would not take off stars for that. Busy usually means good. This time, however, it spoke to the douchiness of the clientelle.

After we'd been there about 5 minutes and decided to go somewhere else once another friend got there, we saw two people get up. It would be a tight fit, but we thought that if we were all willing to be cozy, we could fit 4 people around the table. When one of us went to claim it, though, two girls who had been sitting nearby said that they had already called it. They were going to push the two tables together, because they needed the space of 8 potential people for 2-3 people. There were a whole bunch of people sitting by themselves at tables that could easily fit 4 or more people, and we were forced to sit across the balcony from each other, which kind of defeated the point of going to eat together.

This kind of sucks for me, as well as the many other people I saw come in and leave when they couldn't find a seat. If Barriques had a sign asking people to share tables, or not take up more room than they needed, I probably would have given them at least 4 stars, probably 5. But as it is, their silence on the matter seems almost like approval of the people sitting at a 4 person table just reading a book. It's rude and inconsiderate, plus if you're encouraged to share tables, you can totally make an awesome new friend. It works at a coffeeshop where I live down Chicago way."}
{"text":"Great coffee shop...great by Madison standards and would be great in any city.  The reasons for loving this place?

Outstanding tea (Loose rishi tea, properly brewed--epic win).  Free, reliable wi-fi.  Good baked goods.  I'm not a coffee drinker, so I haven't sampled this, but they also have Yerba Mate.  Great layout with two levels, and a diversity of workspaces, from tables of varying size to single seats for solo people working.  A bit of a dark atmosphere--dark floors and walls, but there are nice big windows overlooking the street.  Great both as a community space or a semi-private place to work.  Great location in the heart of the downtown near the capitol.  They also serve food.  And the people working here are friendly.

You simply cannot go wrong with this place.  It's a great asset to an otherwise boring block of Madison's downtown.

BTW, if you would like to review individual teas that Barriques sells, check out this site that I've created -- http://ratetea.net/brand/rishi/3/ -- it's an interactive site like Yelp, where you can review individual teas.  I'm pretty sure that all of the teas (and Yerba Mate) that Barriques sells are listed there too.  No coffee reviews, sorry!"}
{"text":"Was very much of a pleasant time to be at the Barriques. I had an espresso frappe. The staff was so nice and friendly. The drink came out delicious. And it wasn't much of a wait on a Saturday afternoon. It has plenty of seating and even outdoors in the summer. I have to say what is lack compare to my most favorable coffee shop is that the view of the cafe just isn't really that much exciting. Being two blocks away from the Capitol does really make a difference if u enjoy people watching as much as I do. It is just a personal preference I would say though. But everything else was so pleasant."}
{"text":"Great vibe - friendly and comfortable place.  Coffee was a bit of a disappointment though.  No latte art and too much milk.  Definitely not a third wave experience, but drinkable."}
{"text":"i have a very lopsided relationship with barriques

i see barriques as the ideal cafe, if a little full of itself
- berry berry smoothie
- blueberry blue cheese salad
- real ice coffee

but, alas, barriques has no eyes for me. and, in fact, resents my very existence. or at least the loud conference call part of it"}
{"text":"I LOVE this coffee shop. I used to hang out here every weekend when I lived in Madison. Great location, nice baristas (except one or two now and then). Great food, great drinks, great coffee.. hell, I don't have any negative things to say about this place. Very nice place to sit and watch Washington Ave. Perfect to get a cuppa if you're on the Capitol for the farmers market. My favorite drinks here are the daddy grasshopper and the Miel. Very good vegetarian options too. Great place to get work done -- I wrote my PhD thesis in this coffee shop."}
{"text":"This is a general-order review for all of their locations, and I've been to all of them. A great cafe with much better than average cafe food, and (happily) wine. 

They have a nice range of sandwiches from very heavy morning fuel (egg, greasy meat, heavy cibatta) to light snacks. Their tuna sandwich quality depends the location. The South Park one is great, the West Wash one has too many large vegetable chunks and gets a little gross. Their vegetarian sandwich tastes fine but is a bit skimpy with content. Similarly their basic egg sandwich is as big as a thimble so if you're hungry don't be fooled by its low price. You get what you pay for.

They use Rishi tea and provide reasonably good portions per order. And they roast their own coffee. In the past I used to think that they had the absolute worst coffee in Madison, but the past 3-4 years they've become a legitimate coffee force, occasionally surprising me with the best cup of the week. A recent Sumatra roast tasted like berries and was fascinating. 

Sometimes a good place to work, other times way too busy. But a great place to meet and talk and chill by the square."}
{"text":"I'm a professed iced black tea fanatic. Like, seriously. I will drink 3-4 glasses at every brunch place I go to. And, as that iced tea fanatic, I can confidently say that out of all the iced tea in Madison, Barriques is my favorite. Perfect balance of floral and nutty, not too strong not too weak, I can have 3-4 glasses without getting my weird iced tea headaches (okay, I might drink too much of it), and, best of all, it is CONSISTENT. Every single time I've been there the iced tea has been on point, no matter which Barriques I go to either. I never have to wonder if it'll be a good day today. #winning. Also, it's semi reasonably priced!

A couple of notes on the atmosphere: This particular location is way preferable to me over the one on Park or the one on Monroe. The two levels helps it feel open and not horribly crowded with the added benefit of a lot of tables as options! Fairly good access to outlets, lots of windows, and nice people. They don't make you feel like a bad person for parking there for a couple of hours to plow through some work. Love. It."}
{"text":"Still the best Cold Brew Coffee, I have ever had EVER!  

ICED COFFEE
If you're like me and you drink Iced Coffee year round, this is the place to go!  During my graduate school days I survived on their cold brew to keep my morale up when I was broke, cold and had piles and piles of work to do.  The taste of the brew is distinct, rich and lasting.  

THE morning bun
I called it THE morning bun because there is NONE like it.  To try it you need to get there fast first thing in the morning!  They get it sourced from a local baker and run out of it by around 9am.  On rare occasions you will find it saran wrapped and waiting for consumption after noon.  Its gooey on the inside with melted caramelized sugar and cinnamon.  Its good heated up or room temp.  The bun has the perfect amount of chew and texture from the dry sugar.  

STAFF
The staff is amazing and they remember your order and a few times I forgot my wallet and they let me pay them the next day!   Also, they were great at consoling me during the days I was too late to get the morning bun."}
{"text":"Great atmosphere.  Nice to grab some coffee and do some work on a laptop or catch up with a friend.  Some locations offer food while others don't.  Also offers a wide variety of wine to purchase."}
{"text":"I have been going to Barriques for a while and this is my favorite location. It was an all girls team this morning and they rocked it. I've been a barista for several years and have had every type of coffee espresso possible. So when I go to get coffee, I ask the barista to make me their favorite. Black coffee to cinnamon roll or berry sweet: I like it all. They know their menu, they know the best to offer. Today (coincidentally my birthday) I was greeted to fresh fun faces and a discounted drink. Several employees had pondered before one brought up the dirty chocolate chai. So good! So recommend. Thanks ladies!"}
{"text":"Really cool vibe here! Very hipster madison spot. You can also buy bottles of wine while you sip coffee and eat your breakfast sandwich ;-) coffee is offered in unique flavors like lavender, and has a nice rich taste. However, I think their breakfast sandwiches could use a flavor makeover. Just a little bland from my experiences with the egg and cheese sandwich and the veggie breakfast burrito."}
{"text":"I love this place.  The two levels, the tables of varying sizes and locations, and the broad menu for both food and drink combine for a very pleasant experience.  This is a great place to settle in for a long haul, either working alone or with colleagues...  and the students definitely benefit from us grading in a location that offers wine by both the glass and the bottle.

I really like their miel, the latte with honey and cinnamon, and we've had a number of very nice wines there.  Their food is very good, but especially the breakfast menu--I find that lately I just get the huevos wrap every single time because it is SO GOOD, if somewhat messy.  (One of my proudest moments this semester was finally eating one without using upwards of five napkins during and after.)

Finally, the internet is reliable and speedy, even when the place is relatively full."}
{"text":"Nice space, good coffee. Can't wait to try the mocha shake! The service was pleasant with a touch of coffee-snobbery (in a good way)."}
{"text":"Loving this Barriques! Friendly staff, central location, lofty well-lit space and tons food and coffee options.

Generally the atmosphere is pretty relaxing and quiet. Lots of studying, a few quiet discussions and the like. I had some time to kill and read for an hour almost completely undisturbed, which was awesome. It's definitely a great space to spend some time and unwind. 

The best part? They started serving almond milk! I totally appreciate that they offer it as I prefer it leaps and bounds to soy milk. I am so pleased to see more and more coffee shops stock that sweet sweet almond milk. +1 Barriques!"}
{"text":"Overheard at Barriques: \"Its really amazing. They do a fantastic chai latte.\" I can't speak to this, but I can say that the coffee is my idea of right and the avocado egg wrap makes me feel some type of way. 

A great place to work with delicious food and a calm atmosphere. Good vibes even for those who aren't here with work to do. Perfect for a weekday glass of wine and catchup with a friend."}
{"text":"Neat place; nice, interesting decor, well done coffee, although that's all I can judge the place on."}
{"text":"The Barriques off the square is my second-most frequented.  In the past few years, I've graduated to Barriques on Monroe, which could fit three times over in the cavernous, two-story space that the Barriques on West Wash occupies.  

The downtown Barriques has its own distinct vibe, as do all the locations.  Here, the busy times give it a hustle and bustle that none of the other locations ever quite muster. It can be overwhelming to come in on a Sunday afternoon, prime homework time, and be confronted with tables piled high with law casebooks and laptops at every outlet.  

That having been said, a relaxed summer evening is a great time to drop by Barriques for a glass of wine on the outdoor patio.  The Capitol corridor streets can have a windtunnel effect, and the constant beeping of the crosswalk signal can be irritating, but with the right group and a relatively breeze-free day, the patio spot can be one of those great Madison places to see and be seen.

Inside, the coffee drinks are as consistent as they are at all Barriques locations.  The local chain scores points for their choice of Milwaukee's own Alterra coffee, which results in fine espresso beverages of all kinds.  The vibe at Barriques is laid back and mellow when you are there off-peak, and you will have your option of sunsoaked window seats or more removed seating in the balcony area upstairs.

The downsides here are the same as I mentioned in other Barriques reviews: baked goods that don't live up to the promise of the other food items and trouble getting seating at busy or peak times (based on UW campus schedules).  The upsides are many: a fine and varied selection of reasonably priced and good wines, good consistent coffee drinks, helpful and friendly staff and generally good vibes.  

Bottom line: The Barriques outlets are some of Madison's best and most reliable cafés and we are lucky to have so many flavors of them from which to choose."}
{"text":"Pretty good cup of joe. 
Great service and staff.
Menu looked appetizing as well. 
For me, the roast is mediocre, but the attention to detail is good. 
Nice place to sit and read or study."}
{"text":"This place is rustically awesome.  It has class & character yet relaxed.  Its fits all crowds from upscale to college hipster.  The wi-fi is good and the second level allows for more privacy.  The staff is friendly, there's always people there but never crowded.  If i remember correctly they serve their tea in teapots, which is exceptional.

Go to chill, converse or work!"}
{"text":"there's a few things that'll start to give u stars before i even walk in the door:
1. windows, lots of windows, i love sunlight!
2. on a corner - partly 'cause that means more windows and partly 'cause i have a thing for corners

and there's a few things that'll give u stars before i even try your food or drink:
1. staff that don't look confused when i order a wet cappuccino
2. staff that don't look annoyed when i say \" i'm trying to decide between the chocolate cherry or the cranberry walnut biscotti\" but rather enjoy the opportunity to suggest and connect and say something like \"pssht, gotta go with chocolate, right?!\"
3. staff that then lightly engage in a free choice vs. destiny discussion when they accidentally plate up the cranberry walnut biscotti.
                                 enlightening conversation. no extra charge.

and then, the imbibing.....
when i take the first sip and say \"oooooo, God that's good\" OUT LOUD and people look over their laptops at me before i can stop myself  - that's good coffee! 
when i take the first bite and realize it's a true biscotti, not just an elongated cookie masquerading as a biscotti....points!

i'm docking them a star for taking away the alice in wonderland chairs."}
{"text":"If I wasn't leaving Madison, this review wouldn't be going up because I would want to keep this place a better secret. But because I am and I want this place to definitely be around when I come back, up it goes.

When I think of Madison, I will forever associate it with Barrique's because it's just so perfectly representative of the city in coffee-house form. It's laid back, charming, relaxing and mellow. Plus, there's no music playing--which is fantastic for someone like me who prefers to study/work in silence.

I'm not a coffee drinker, so hell if I know anything on that front. But the Italian sodas here are the best in Madison. Everyone else can sit down, Barrique's has got this one on lock. Do yourself a good deed and get the cherry flavored one; it's my favorite and while it's sweet, not overbearingly so. In addition, they also have wine and are willing to put some alcoholic beverages inside of your coffee or other ones. Boozy hot chocolate in the winter, anyone?

For food, the pastries are wonderful. I am also in love with the Blueberry Jubilee salad; the mixed greens are fresh and firm, the blueberry vinaigrette isn't overwhelming--just the right amount to add some taste, the blue cheese adds a nice kick and the walnuts and apples are just the icing on the cake. The true mark of having good food is to not need to have anything to dip it in/add to it--and with the bread I got from here, it's definitely the case.

I'm so disappointed I didn't find this until very recently, but when I come back to Madison, you know where you'll be able to find me."}
{"text":"Awesome coffee joint. As another Yelp reviewer already said, their grilled cheese is THE MOST! Super delicious. Also really good is the \"sport\" iced tea. I was happy about the variation in available seating. We were specifically looking for a spot with outdoor seating, but inside there is a long bar that looks out on the street, with many outlets for laptops and there is mezzanine level seating, as well. All around great atmosphere. Also, they offer the Yelp 50% off coupon for a coffee bev. Will be back to this spot."}
{"text":"Love the coffee and the food menu!!!  I love this place and the atmosphere!  My only complaint would be that the tables are ALWAYS full with people doing some type of work.  I just think there should be an area that is for short term customers!"}
{"text":"Sure I'm going to love this place if I'm a poor college student who needs a homey cozy study spot.  I can stake out a big table upstairs, spread out my books and laptop, plug in my headphones, and sip my one cup of coffee all afternoon.  

What makes it really great is even when people come in to eat and circle around the tables looking for a place to sit, I don't have to leave!  Yeah, I know they're giving me dirty looks, but hey, the management doesn't care!  And I need these extra chairs to put my feet up and hold my books.  I don't get why that group of four people doesn't just split up and sit at counter seats by themselves.  That lady over there looks pretty happy drinking wine all by herself.  

I heard a lady ask the girl at the counter if there was any protocol for getting access to a table and the girl just shrugged!  It was great - I've had this cup in front of me now for about five hours and there's a bunch of other kids up here doing the same thing.  There are eight people with plates of food wandering around looking for a spot to sit.  The staff here is so chill.  I LOVE it!"}
{"text":"I'm not sure if this is actually the largest Barriques (actually, that might be Middleton?) or if it just feels that way, but the double-level coffee shop is great at not feeling as cramped as many of the other downtown spots. 

I tend to gravitate here in the fall and winter for hot cider (with the optional caramel addition given into on occasion) and the Mexican hot chocolate - you definitely feel the kick in the back of your throat by the time you've reached the bottom. 

Like other locations, they've got a healthy selection of wine, and I love that they've had some quirky small gifts/candy near the counter for as long as I can remember. There's also a food menu - I haven't eaten at this particular Barriques but I've enjoyed several items at their other locations. 

Service can be a bit slow, but it's always been friendly and I've always gotten exactly what I've ordered, so I'll take it."}
{"text":"Good strong coffee with a classy-rustic atmosphere to match. Bright, but cozy. And the service is pleasant."}
{"text":"Coffee and wine :). And cheap good wine! Nice place to chill with friends.  Good food too, so it's a nice place to just hang out."}
{"text":"Barrique's is like my second home! It has everything you need if you're a late night studier like myself. They have free wi-fi (although it can be slow when a bunch of people are using it), coffee, lattes, WINE, food, excellent scones and slices of pie. I would eat there more often but the food is a little pricey, although delicious. I think their yogurt parfaits are the perfect snack, and go great with a coffee. I've tried studying at several other coffee shops, but Barrique's wins the prize everytime."}
{"text":"First time at Barriques was a success! I love the atmosphere that this shop has;two floors and very cozy! My sister and I had the chai tea and berry smoothie (pictured), both were very tasty! This was the perfect place to finish up my work! Will definitely be returning!"}
{"text":"A coffee shop that serves wine?!  This is pretty much what I've been waiting for all my life.  I do prefer the locations with fireplaces and comfy chairs, so I can't give this one 5 stars, but this is definitely my favorite coffee shop/study spot in the area.  The high ceiling, plants, and decor make the place feel really relaxing.  

Noise level can get high, so bring headphones!"}
{"text":"In terms of places to study, Barriques is just ok. There is an uneven distribution of outlets (a ton at the bar in front of the giant window downstairs, which is by the door and is super drafty and cold in the winter. Not a lot of outlets upstairs, which is where the four tops are.) Another annoying thing is you have to ask for the bathroom key from an employee. Not great if you have a small bladder.

The baristas are nice though, and they are open til 11 (which is pretty good for a Madison coffee shop, for some reason all the other coffee shops that are not on State St. close ridiculously early). They have the standard tea and coffee options, and standard cafe offerings (sandwiches, soups and salads). I've been told their grilled cheese and soups are pretty good. I can only vouch for their tea and oatmeal raisin cookies though."}
{"text":"I've only been here for morning coffee but simply walking into the place you're affronted by a huge wall of wine! The coffee is great, the baked goods are equally good and the atmosphere is nice and relaxed. Can't ask for anything better in the morning!"}
{"text":"This is a place where you can feel comfortable once you sit down.  The coffee was serviceable, though more homogenous tasting than Colectivo on the other side of the Capitol Square.  Menu prices and portion sizes of menu items accurately reflect the neighborhood's faux upscale intention, right down to the rather honed down looking slices of key lime pie under the glass counter display.  While the stone cold demeanor of the barista would normally be a potential deal breaker, my lucky break was to get an outstanding and more reasonably priced cookie for the road.  My day was now improving after all."}
{"text":"I was just looking for my review of this Barriques to suggest it to someone in Madison and realized I hadn't written one... which is strange because I've been here a couple of times. And---let's be honest---I review EVERYTHING. 

Anyway, back to Barriques. That's what we're talking about today. 

You'll find Alterra Coffee that's roasted in Wisconsin and brewed up here in the proper way. This works for me. It really does. 
The outdoor sidewalk right off of Capital Square also works for me.
The cafe fare and wine. Yep. Workin'.
The cute artsy interior with two levels of seating and lots of free wifi for my laptop to soak up? It all works for me too.

Also, if I remember correctly, Barriques had a Yelp check-in offer set up when I was there last... so watch for some little discounts there on your app!"}
{"text":"The best coffee next to Lazy Jane's. If you enjoy your espresso strong and your cafe filled with bike parts, Barriques is for you. The staff is always friendly."}
{"text":"I really like Barriques as a business overall, but this isn't one of my favorite locations.  Being downtown, it's usually fairly busy, which makes it noisier than the other locations.  This wouldn't always be bad things, but the service slows down, the espresso pulls and tea turn out bitter due to distraction, and their frustration becomes palpable.

Their wifi is free, but flaky, and while the have weekly wine/liquor tastings at all of their locations, these make the place even busier than usual, and more chaotic, as the tastings seem primarily self-led, though there's a staffer there to answer questions...if they happen to know the answers (some know a lot about the items in the tastings, others have only basic knowledge.)

The seating can also get a bit interesting -- the layout is a bit awkward, and there aren't many tables larger than a 2-top. The few that there are are constantly filled by solo students with their stuff strewn about who couldn't be arsed to consider that their laptop and textbook could fit perfectly well on a 2-top if they sat their backpack on the floor, so if you're looking to get a drink with more than one other person, plan on getting it to go.

...or visiting one of their other locations instead."}
{"text":"Great location, great decor. That's it. The food's fine, but the atmosphere is stuffy and full of pretentious people who take up a table for four when all they need is a table for one. That MacBook sure takes a lot of space. The prices are high, the service slow, and the staff are barely competent."}
{"text":"Cute little coffee and wine shop. Rotating gourmet coffees (eg a great Ethiopian yirgacheffe. Over 100 wines by the bottle almost all between 10-20$ (priciest I saw was 32-a nice Chilean cab). Friendly service. If you are near Capitol dome or at the farmers market and need some coffee it's a nice spot and sure beats the nearby Starbucks!"}
{"text":"A unique coffee shop near the state capitol building in Madison. They have alcoholic coffee drink in addition to the regular coffee drinks. 

The daddy grasshopper was a Yelp favorite so my friend decided to try it. The drink was..interesting..very minty and towards the end, it got really strong since the alcohol sank to the bottom. 

If you want to try the daddy grasshopper but don't want the alcohol, then the baby grasshopper is a similar drink.

I tried the lavender latte and it was quite fragrant. I thoroughly enjoyed it and it helped me continue my long drive for my road trip. 

This location is 2 story so there are lots of seatings and they offer wifi. I did notice that there's a law office on the second floor...so that was interesting.

Note: if you need to use the restroom, you'll have to ask for a key from the barista."}
{"text":"This establishment has it all, excellent coffee & tea and pretty decent service. (They sell Alterra products.  Try the mint green tea, I rarely get anything else... it's that good)  The lofty structure gets lots of lovely sunlight. What sets Barriques far and away from all of the other coffees shops in the area is that their sandwiches are AMAZING, and this is coming from someone who has distinct sandwich apathy.  Additionally, they have a variety of scrumptious cookies (check out the Cowboy cookie!), a fairly priced yogurt parfait, and tasty tasty scones.  Like Super M said, it's also serves alcohol so you can reward yourself with a decadent glass of wine for your hard work. (be it writing your thesis or finishing your sandwich all by yourself)
The Wi-Fi is reliable but can be slow when the place is packed.  For those of you who are students and dwell in coffee shops with your lap top-- Barriques is no longer a secret and this place fills up quickly.  You may have a difficult time finding a place to sit. Come early, bring a power strip."}
{"text":"Just visiting Madison, but god, I wish we had more coffee shops like this in San Diego.  A very chill, quiet, coffee shop with really good coffee, plenty of seating, wifi and ambience.  

The kind of place where it's such a nice place to study or just sit and read a book that you go ahead and buy that dessert you had your eye on to help make sure it stays in business."}
{"text":"I've been coming to this barrique's at least once a week for the past year, and.can't remember a single bad experience. The coffee is consistantly excellent (the miel is amazing!), the food is so tasty (breakfast sandwich with bacon-quality ingrediants make a simple sandwich so fantastic, the soups are always worth trying, and all the wraps and sandwiches are super), plus the baristas are all friendly and competent. Love this place."}
{"text":"Finally. A Barriques that barreaks the mold of Barriques in Madison. (You get all that?)

It's clean. (Yay)
There's usually parking right outside. (Yay)
Plenty of space to work solo, or larger tables if you're there for chit chat. (Yay)
Let's talk about how it's clean again. (Double yay)
They offer 50% off an espresso drink when you check in on Yelp (cha-ching)
Bright sunny atmosphere is awesome if you're working and need some vis stim. (Yay)
It's clean, there's that. (See where I'm headed?)

So far out of the ones that I have been to, this Barrriques tops them all. If you're feeling like a tea-se grab their iced Rooibos. Tasty in the mouth, antioxidant charged for your bod."}
{"text":"Barrique's is a wonderful coffee shop - ample seating, a wonderful loft-like layout, and of course, solid coffee. This was a standby coffee shop for me as a college student, and years later, it's still serving quality espresso in a laid back atmosphere perfectly conducive to sending your afternoon emails or studying.

I ordered a single macchiato on my most recent visit, and I was impressed at the strength and body of the espresso. This stuff will wake you up - in a good way! I did not try the food, but they offer a decent selection of sandwiches and salads, and the pastries looked very tasty as well. 

For me, Barrique's on W Wash is a must-stop while in downtown Madison."}
{"text":"I had a latte.  It was a good latte.  The espresso gave the beverage a nice blend of roasty sweetness and robust flavor.  The barista clearly knew how to make a beverage.  However, when I ordered I felt a little like I was bothering them."}
{"text":"Barriques has got to be one of my favorite cafes in Madison.  This location is a bit out of the way for me but, I do like it.

he service has always been friendly, I love the interesting decor and two stories, and the location is hard to beat for people watching...."}
{"text":"3.5 stars. This is my new favorite coffeeshop in Madison. 

The music is good and not so loud that it's distracting. There are lots of tables (and they're large!) and plenty of outlets. Oh and free wifi! The coffee is good and there's a pretty wide variety of food and drinks. They serve wine and bottled beer, which is awesome, and they have a section of their coffee drinks that are alcohol-infused (ie mocha with peppermint schnapps and latte with irish creme). They also have a wall of cheap but good wine bottles and other interesting coffee, chocolate, tea, and alcohol related things for sale. 

The issues are: it's pretty packed during the day so even with the upstairs area it can be difficult to find a table, the lighting is poor so once it gets dark out it's not the best place to do work, and the food is just okay and a little pricey (I guess that's expected at a coffeeshop though). Also, the place doesn't have good heating downstairs so it gets pretty cold. 

Overall great study spot during the day and really nice ambiance. I would come here for a low-key afternoon or evening with friends or to study (when it's still light out). Be aware that if you spend a day here it will end up being pricey."}
{"text":"Neat little coffee shop by the Capitol. There's so much VARIETY and choice (that's what usually gets me). They have the usual coffee, then their interesting specialty drinks (Mexican mocha, German Chocolate Cake, etc). They have soups, salads, sandwiches. They even have alcoholic choices. They have upstairs and downstairs seating and an eclectic assortment of goodies- vintage looking gum, mugs, trinkets. The servers are really friendly. Overall, a cute little place (though they can definitely crank up the heat here in blizzardy Madison!).


EDIT- they REALLY need to do something about their fruit flies. They wouldn't stop hovering around my food."}
{"text":"Great downtown location, quiet, and there's wall outlets for charging everywhere.  The Daddy grasshopper- espresso, mocha, milk, and peppermint is one of the best coffee drinks I've ever had and I fear the end of my cup.  Food is pricy for the size, but typical for this area/niche."}
{"text":"I really enjoy this location of Barriques. I like how it is slightly off the square! With this Barriques, I love how there are too different levels of this cafe. The first floor has a lot of merchandise, alcohol, and where you can place your order. There's also a few tables on the first floor. The second floor has mainly seating for people to use. In addition, I adore how many outlets they have at this location. 

The service is nice and it is also very clean!"}
{"text":"Love it!

Wenn ich in Madison bin, kann ich nicht ohne deren Kaffee leben. 
Das Personal ist immer freundlich, egal zu welcher Uhrzeit, und man bekommt jeden Morgen den perfekten Kaffee.

Tipp: zu Halloween gibt es einen Spezialkaffee mit Kürbisgeschmack! Unglaublich lecker!!"}
{"text":"It was a very chill place to go and sit for a couple of hours to get work done. I got a cold coffee and it was pretty good! I'm hoping to go back soon to try out their wine selection."}
{"text":"This place has potential. It could be better. Everything is reasonably priced. The food isn't over the top and the coffee is okay. I usually get tea because they have a nice selection."}
{"text":"Love this Barriques. Coffee is good, and wine selection is stellar. I can't say enough about the versatility of this place. Great place to go for coffee or glass of wine, with friends or alone. Great patio too!"}
{"text":"Loved this coffee shop and it doesn't hurt that they had a 50% off Yelp check-in special last week.  Woooohoooo!  Great tasting coffee and iced lattes.   Seemed to be a local crowd and had higher end decor for most coffee hangouts.  Would definitely be a daily stop for me if I lived in the area."}
{"text":"Nice place to idle time away or to work on your school papers for the whole afternoon."}
{"text":"Barriques is by far my favorite local coffee shop in Madison! The West Wash location is spacious with two floors and plenty of tables to accommodate the many visitors there to study, converse, etc. 

I've had several of their drinks, including their cafe latte, the honey lavender latte, chai latte, Blueberry rooibos tea, and chai tea. Honestly I've never been disappointed with anything I've ordered from there! In addition, they've got some great food and bakery items as well! As a rewards member, I was given a free cookie or scone with my next drink purchase, so I picked up one of the chocolate chip scones. It was SO good!!! There was an espresso glaze drizzled on the top of it, and it was heavenly. I'm definitely looking forward to having another one of those again! I think just about any of their bakery items would be really great. 

Overall, Barriques is amazing. The staff is friendly and personable, the drinks are great, and the food is delicious. Thank you for being so lovely, Barriques!"}
{"text":"The only reason I'm giving Barriques 5 stars is that it will always have a special place in my heart, since I pretty much lived here during the last 4 months of my PhD dissertation writing.  

And there was nothing better than writing straight for 7 hours, downing 5 cappuccino skim extra shot and soup for lunch, then rewarding yourself for doing such a good job with a glass of wine at 7pm.  Yes.  This was my pattern for the aforementioned time period.

Also, coffee shops should realize that (besides having a liquor license) PEOPLE NEED OUTLETS for their laptops.  Barriques has listened to our plea, and not only has outlets every other table, but has extension chords with multiple outlets also, leaving everyone with extra choice of outlets.

Comfy chairs, rustic tables, loft style open layout makes this place inviting.

Of course, what sucks is that everyone knows about it, and if you go after 11am, the place is packed.  This of course, forced me to get up earlier and write more... So good for them!!"}
{"text":"Awesome place to get some work done or meet a friend for coffee. I love alcoholic coffee beverage offerings and the avocado jack wrap, which is a breakfast item. No cause for alarm though, they serve breakfast all day.

Although I've never bought any of their bottled wine, but they have quite a hefty offering. If you're that type of connoisseur, I would imagine you might find yourself entertained for a while.

Definitely worth checking out on your next free Sunday afternoon."}
{"text":"Good coffee, great big space, not too loud so it's a conducive work environment. Love this place! And the pesto grilled cheese was delicious as well!"}
{"text":"Good quality food for lunch but continual issues lately lower my rating.  I went to get a hummus wrap but they were out.  Next time I didn't have cash and they were having a problem accepting cards.  I've also noticed longer wait times which makes me wonder if they have enough staff for the lunch rush."}
{"text":"Finding a cafe like this one that serves good coffee AND has plenty of places to sit and study is a rarity. The first time I went there, the barista recommended I try their crab dip. I did, and it was arguably the best decision I've made in 2016- SO GOOD. I'm now verging on \"regular\" status there."}
{"text":"Great selection of coffee, snacks, and wine. The atmosphere is a win as well, with plenty of places to sit (upstairs and down) and a lot of outlets for your phone and computer.

Cleanliness is Barriques' only strike, as there are always a swarm of small flies near the bussing stations. It's so bad upstairs that the flies find their way to your table, and don't leave your food alone. Last time I visited, I killed at least 7 while trying to get my work done."}
{"text":"Convenient location downtown and ample seating across two floors. Their honey lavender latte makes pumpkin spice latte seem like a neglected middle child, and I'm ready to spoil the hell out of this welcome addition to my basic bitch palette."}
{"text":"Standard cafe. Claim to fame is probably the food, a bit different from the regular cafes. They've hummus stuff for vegetarians and sumptuous wraps. They've a pretty good decor going, if you're into that sort of thing. Lots of wines, teas and good vibes."}
{"text":"Holy cow, my cortado is sweet. I ordered a cortado because it is a good way to judge coffee quality, but I can't even taste the coffee because of how sweet it is. The agave nectar combined with the natural bitterness of the drink creates a really bad aftertaste.

To empathize with the shop, I know Starbucks ruined most customers' taste buds to expect sweetness with any drink but a black coffee. But seriously, don't make a hybrid. Be like Starbucks and make all your drinks into sweetened lattes or keep it original.

Customer service was good. Overall great atmosphere. And free wifi is great. I would be willing to give this place another chance if I needed a place to work, but I would likely order a latte next time and expect a Starbucks taste."}
{"text":"I used to come here with my study buddies to spend the whole day to read and write our papers. Graduates students ourselves, we loved this place to the point we were sad when they had to close (We surely hoped they'd open 24 hours, LOL). We just love the ambience and the atmosphere of this cozy place. I used to sit facing the window so I could enjoy people walking and the traffic. I appreciate their accommodating gestures by setting up some outlets near the tables. Very convenient. I couldn't remember what I had- most likely it was hardcore coffee, as I needed to stay awake for my readings and my writings. 
Now I no longer have my study time here. I occasionally visit the one on South Park but haven't had a chance to study at the one on Monroe. 

The memories of Barriques at W. Washington remain sweet and unforgettable. My two buddies are now on their field research out of countries. Hopefully, we can have our reunion sometime soon here.

If not, I'll come and enjoy my cup of coffee while looking at people passing by. It's always a sweet feeling and a cup of coffee from Barriques just brings my imagination to a perfection."}
{"text":"The food is good, but they're terribly slow. I just went there for a grilled cheese and a cup of tomato soup and I was there for over twenty minutes waiting for my sandwich. I'm pretty confident that I could've made the sandwich myself with a Bic lighter if they'd handed over the ingredients. And I wasn't the only one waiting. There was a woman behind me pushing 15 minutes for a cup of soup, another pushing 20 for a salad. The thing that really blows my mind about the wait times at Barriques is that they don't appear to be understaffed.

What's up, guys? If you want the business that Bluephie's Diner's departure could yield, a grilled cheese is going to require less wait time than half of my lunch break, which is exactly what I wasted there today."}
{"text":"I love studying at Barriques. They have a great selection of espresso drinks, and a very nice ambiance. It is also a good place to meet for study groups."}
