{"text":"I stopped in here today to take some swings and get rid of years of rust.

They have about eight cages.  The two on the left are fast pitch, then there are a couple hybrids and the two on the right are softball only (with the far right fast-pitch only).  

A token costs $1.25 but you can get 10 for $10, so it's not a bad price.  I used all 10 myself and left with some blisters (despite having batting gloves on).  Maybe it's my technique... or maybe I should have taken breaks in between rounds and gotten some custard or some iced cream."}
{"text":"We swung by (get it?) and picked up a bat bag's worth of tokens, got tuckered less than halfway through, and ended up distracted by the ice cream for the rest of the night.

OK, seriously, this is a good place for the money.  The facility was opened over 25 years ago and is in really decent shape.  The business seems to be holding their own which is great to see in the face of all the decrepit and defunct storefronts throughout the area.

Cages include slow pitch, fast pitch (softball), and select-a-pitch (30, 45, and 60 MPH).  70 and 80 MPH cages are also available.  Helmets and bats are available.

With 24 homemade flavors to choose from, the attached ice cream shop offers a selection from the simple (single scoop) to the complicated (banana split, brownie pie, etc.).  About half of the patrons the weeknight we were there were there just for dessert.  Hot items such as burgers and hot dogs are also on the menu. 

The gentleman running the place was really friendly and accommodating - I think he was the owner.

Yes, we're coming back to finish off our bag of tokens and will definitely buy more when we run out.  But first... an ibuprofen, please!!"}
{"text":"Do you know how hard it is to find batting cages? Thank God for this place in my youth and high school days. Where else can you get consistent pitching for $1?? I live in Iowa now, trust me this place is a blessing to those who are serious about baseball.

They have all levels of baseball and softball speeds, they machine itself is fairly easy to time making it a good choice for a pitching machine.

They have delicious ice cream as well that is 5 stars in its own right.

Whether you come here for fun, to train, or to eat this is a great choice to spend a little money to get a lot out of your time!"}
{"text":"Went here for a bachelor party with a group of 10 guys. I called a month or so ahead and they gave me a great discount on tokens ($100 for 100). We stayed for awhile and had a blast. The workers were very nice and helpful. Heavily recommend!"}
{"text":"Great place but tokens are now SIX for $10.00.  =(  One token gets you 10-15 pitches. \"It sound like a lot but it goes quickly,\" the staff said.  They were right."}
{"text":"Nice little neighborhood spot for a little family fun. But I've also taken whole teams there to practice. They offer baseball & softball. Fastball up to 80mph.
People working are always friendly! Ice cream is a little pricey but it's delicious. Very satisfying after spending a hot summer day in the cages."}
