{"text":"I ordered take out and enjoyed the satay beef. They also make great hong kong style milk tea, but added too much sugar. I will ask to add the sugar myself next time, or specify how much I take. This is a pretty good place for takeout! They packed the noodles and beef separately so that it didn't get soggy."}
{"text":"It was 6 o'clock by the time we decided to go out and eat last Friday night. I was craving Chiu Chow oyster congee, so we went to Chiu Chow Man. We expected it to be busy, but it was REALLY busy. Same with Chi's Congee.   So we stumbled upon Bayview Garden.    My family and I dined at Bayview Garden when it first opened. (Looking at the dates of the older reviews, it was probably way back in 2011.) We did not enjoy it at all...the food, nor the service. We also never heard good things about it after that. So...we never returned.  But last Friday, we figured we'll try it again. We were starving...   The restaurant is a lot bigger than Chiu Chow Man and Chi's Congee, so we didn't have to wait long for a table. It was busy, but the servers were friendly and quite attentive throughout the night.  There is a 'combinations menu' in which you can choose up to 6 dishes from a list of meat, seafood, and vegetarian dishes. It comes with soup and dessert (or fruits) as well. We chose 4 dishes (half a steamed chicken with ginger and green onion sauce, thousand island pork chops, string beans with pork jowl, and spicy eggplant with minced pork in a clay pot), and we added an order of deep-fried squab.  The soup was decent. The portions of all the dishes were smaller than expected, but we were pleasantly surprised with the taste and quality of the food. Not salty and not oily. Besides the squab being a bit overcooked, everything was great. As for dessert, I was expecting the usual red bean soup, but we got tofu pudding and it was pretty decent! (It's one of my faves.)    All things considered...we will definitely be back! There aren't many good options for Chinese food in Mississauga...so I'm glad we decided to give Bayview Garden another try.  By the way, there's even a separate party room by the front of the restaurant (with a couch!) for a big group for anyone interested."}
{"text":"My family reserved a private room of 3 tables for a dinner on a Saturday night. There is a couch in the private room, next to it, piles of cases of pop, and some watermelons. Next to that was an old dirty looking fridge which contained more watermelon and mysterious looking packages in the freezer (meat?). I doubt this is in accordance with the health code.  Before all of my relatives had arrived, the waitress insisted on squeezing 26 people into 2 tables meant for 22, even though we had reserved 3. That was the first misstep. Then we realized that the ceiling was dripping water, so we didn't sit in some of the chairs.   During dinner, a ceiling tile fell down. The staff then came in to clear the fallen, soggy ceiling tile, without apologizing or asking to see if anyone had been hurt (it almost fell on a waitress). An employee then attempted to remedy the situation by climbing up on a ladder and covering the hole in the ceiling with a sheet. Appalled by this (we were eating), some of my family members told the worker that that would not work, as there was an active leak. They later put a dishpan down to catch the water. The water that the dishpan caught was quite significant, and it was a yellowish colour. I just lost my appetite. I can't believe anyone would want to eat in an establishment like this. The service was terrible, and food OK. But the experience was something I will never forget. Needless to say, I will not return."}
{"text":"Very poor customer service at this restaurant. We reserved a table for 6 pm but we didn't get our table until 30 mins later. When we finally got seated, they did not give us any chopsticks, napkins and tea until our food came which is another 20-30 mins later. We even have to go up to the cashier to remind them we're missing a dish almost at the end of the meal. Well at least the food was good. Their lobster and beef were very tasty."}
{"text":"The worst customer service ever!!! this restaurant located at 1177 Central Pkwy W  Mississauga, Ontario!!   From past experience, I have seen the owner of the restaurant pick up my fiance cousin's baby and carry it around, away from the parent while holding onto a hot teapot. She should be thankful that the baby was safe otherwise she will be sue. Also yesterday my family came to this restaurant to celebrate Mother's Day, we've make a reservation and still waited for more than half hour. That was fine, they told us to sit at a table while they were cleaning it from previous customers. So my family of 15 including me, sat there waiting for them to clean and set up the table, all of a sudden the owner came over and ask us to switch table. Making everyone including my grandma who has trouble walking (because she had stroke from before), walked to the other end of the restaurant at a table next to the door where it was cold with her walking cane!! What is the point of asking us to sit at the 1st table!! I made a complain to the owner and she just said that's because you have 15 people, blah blah blah (but the 1st table we sat on fit just fine) asking us to move to a smaller table without apologizing and without looking at me!! WHAT KIND OF SERVICE IS THIS!! I don't mind me walking to the other end of the restaurant but asking an elderly to walk to the other end of the restaurant squished into a smaller table and without apologizing! I WILL NEVER COME HERE EVER AGAIN! And to all moms out there, be careful of ur babies in this restaurant!!!"}
{"text":"The combo dishes are well worth it-I mean you get a peking duck dinner set for $50.00 that will easily feed a family of 4.  Although the size of the dishes are small-ish, it's still good value.  It's not Michelin star food, but it's decent family style Chinese food."}
{"text":"Some of their prices have increased, which was kinda annoying because those changes had not been reflected in their menu. The food is still good and solid for a Chinese restaurant in Mississauga.  In the past I tried their lobster set menu for dinner, which my family liked, however I see that the price has been upped a little ($40.99 for 4 dishes which is still not too bad).  The steamed free-range chicken is a MUST order for lunch or dinner, it is so tender, succulent, and has a nice \"chicken-y\" taste to it that is sometimes lost. Their hot-pot rice (takes 20 minutes to make) is also a nice option, mmm very fragrant, nice crunch but not totally burnt rice. Another dinner item is the fried egg tofu with meat sauce - it is simply delicious.   For lunch I usually go with something simpler like squid ball noodle in fish soup, which doesn't have as much squid balls/topping as I'd like, but something I can't complain for like $7.99 and a drink on their lunch menu."}
{"text":"used to be good.... ordered take out (5 dishes) for 6 ppl (made rice at home) for $48. when we got home to eat we realized the portions were so small we would be lucky to feed 3 ppl Safe to say we will not return"}
{"text":"This place is okaaaay, it's very typical of a small Chinese restaurant. The food is fairly tasty but I have to agree with other Yelpers that the portions are on the small side...for a Chinese restaurant.   Where this place loses points is customer service. While we were ordering we inquired about a certain dish and instead of helping answer our question the server barked the price at us, snatched up the menus and told told us to \"think about\" whether or not we wanted the dish as she briskly walked away. I found this to be a common occurrence here, the servers would walk away mid-sentence or not even bother to wait for an answer.   BTW, she also gave us the wrong price for said dish. It was more expensive than what she said.  UPDATE: I came for dinner and ordered Shanghai noodles. The noodles they used were more like spaghetti and not Shanghai noodles at all."}
{"text":"Inexpensive restaurant. But quality and service is low. Food is greasy. Manager is rude. Gave us the wrong bill and refused to refund until we argued. Would not go back."}
{"text":"I met up with some friends here tonight, and since I haven't been in Mississauga very often, the place is new to me. But the restaurant is nice, it's very clean and well decorated, and the food is good. It's a mish-mash of a restaurant serving foods from different regions of China, but the prices are very reasonable. The four of us ate a 3 plate meal + a giant steamed scallop rice dish for $50, including starter and dessert soup.   The dessert soup was extremely thick and had a slight jello-y consistency. But it was black sesame, which is already a bonus for not being red bean. The food isn't very greasy, and well sauced. I wouldn't mind going back here again while we're still in town. :)"}
{"text":"This is one of the go to places I go with my parents on Friday night. We normally get the combo dishes, which also comes with soup and Chinese dessert.   In terms of the food quality, it's good. They have a large variety of different dishes from sweet sour pork, spicy eggplant with pork, fresh tilapia fish, and oysters. Quality is pretty consistent with the exception of one time where I felt like the vegetables were very old. 4/5  In terms of customer service, it really depends on how busy it is. When things are a bit slow, they're more attentive and food comes out quickly. When things are very busy, you may run into the problem of them forgetting your order, so you have to check with the waitress if it takes too long. Staff is friendly. 3/5  Overall, I do give this place a 3.5/5 and would recommend going here. It's one of the better Chinese restaurants in Mississauga."}
{"text":"It's been awhile since I've been here, more precisely, the last time we were seated in this side room along with a couch and cases of pop stacked against the wall.  That time I thought we got haphazard service because we were forgotten in this room.    Apparently you get haphazard service no matter where you sit.  There are all these waitresses running around at a frenetic pace but it seems chaotic for no reason.  The food is good whenever they get around to taking your order, in our case we waited over 15 minutes.   The first dish arrived after 10 minutes and then we waited ... And waited... And waited.  Final the 2nd dish finally arrived at 2:15... We arrived at the restaurant at 1:25 pm to give you perspective.    So the food is good but I'm not sure it's worth the crappy service to get there.    We ordered a lunch special which was a stir fry and rice.  Huge mound of rice and a small portion of stir fry so it's about worth the $7 they charge you.  The beef and bean sprout noodle dish was delish and a generous mound of noodles with beef and sprouts and plenty of wok hey which gives it that great smokey flavour.  So the food is worth a 4 rating but the service is a 2 and that's being generous."}
{"text":"I want to give this place higher and may in a later review, but a few things don't appeal to me.  Decor: 3/5 - okay for a Chinese restaurant  Ambiance: 1/5 - how is it you say that decor is 3/5 and ambiance is 1/5?  The music and what the waiters were wearing (ugly pink aprons).  The music was depressing and it was very dark outside.  When I left the restaurant, I was like \"wow, it's nice to be outside\".    Food: 3/5 - tried the eel fried rice and not much eel.  Maybe I'm spoiled but any Congee Queen or Congee Dynasty is better.    Service: 3/5 - they were informative, but what I didn't like was that they posted lunch specials and I had to pay an extra $1 and the reason was \"eel has gone up in price\". They should at least update their menu.n  Price: 4/5 for their specials.    Not bad and might visit again, but the ambiance was such a mood killer."}
{"text":"It's \"authentic\" Chinese food. Which is different than what is available at what's knows as regular Chinese food at mall food courts - it was a unique experience, exact food as they eat back home in China."}
{"text":"The service has changed and the price on the menu has been accurate. The lunch special are the best value. I would recommend it."}
{"text":"Don't order from the set menu, it's sad. We all feel a bit disappointed. Small portions and tastes just ok. The other Chinese restaurants around golden square are way better."}
{"text":"The review is written on the Android phone. Each new paragraph represents a new update during my experience at the restaurant.   Arrived at the restaurant and was greeted by a server. Waiting for our table to be ready.   After a couple a minutes, we were seated. Our server set up our plates, chop sticks etc. very quickly. We ordered our food and the server was attentive. The house daily soup came quickly. The soup was bland and was not seasoned.  The steamed chicken came minutes after that. The chicken and the ginger and onion sauce were average. Ordered two bowls of rice and came quickly. The rice is mushy and did not taste fresh. The bolay tea tasted okay.  The sweet and sour pork tasted crispy and fresh. The xo chives were spicy and was full of flavor. The beer tasted even better with a refreshing taste.  The spicy beef and broccoli tasted good and had a good 'wok hei'. The dish goes well with rice.  The décor is average but is welcoming and matches the cuisine of the restaurant. The service is average and is sometimes attentive.  Bayview Garden is a restaurant that had high expectations before my visit. Unfortunately, it did not impress me but has the potential to become an excellent restaurant. I would recommend this restaurant to everyone who is looking for dinner to eat."}
{"text":"This place is pretty decent for set menus/a proper Canto-sitdown meal.  It was approx. $40/3ppl with leftovers.  We arrived around 5pm, so the restaurant was completely empty.  Server was kind and patient, unlike a lot of the Chinese servers that I've encountered lately.  They have a special on fresh tilapia on M-Thurs, $9.99 steamed.  It was pretty tasty.  Set meals come with soup and red bean soup for dessert."}
{"text":"The Steam Free-Range Chicken is a must-try. The combo dishes is what you need to go for, because they are the best values. Also, they uses MINIMAL MSG in their food, if any. So, all their food are authentically taste, not artificial like many of the Chinese Restaurants in the area. There are people who complain about their service being bad, it must mean they haven't been to enough Chinese Restaurants, because their service is above average. As for parking, people need to know, it is much easier to find parking in the rear as there are always plenty without having to wait or fight over spaces. Unless you've called ahead to reserve table, after coming in from the rear entrance, go by the country to make your presence known and let them know how many in your party, then wait by the front entrance. There are more space there and that waiting area is not as cold in the winter."}
{"text":"Stay away from this place, there are plenty of better alternatives.  My family and I came here for dinner and boy were we disappointed.  So when we ordered food we named 4 dishes then ordered the two lobsters with ginger and onion.  She said lobster is more expensive today....today?  We asked how much, as if she didn't need to tell us how much.  She said $12 more expensive.  Then she recommended we that instead we go with a 4 course combo (that included 2 lobsters) instead that's maybe another $20 more.  We asked how come the combo isn't more expensive if the 2 lobsters alone is more expensive?  She just shrugged.  We ended up not ordering any lobster as we suspect she just threw in the $12 to up sell us to the combo.  We did see others order the combo and glad we didn't because portions were super small.  So we ordered a shrimp dish, a fish dish with king oyster mushrooms(no bones), Peking duck with lettuce wraps, and honey oysters.  The honey oysters were the best tasting dish of the night, but there was only a few of them stacked on top of a mountain of broccoli, almost as if we ordered broccoli and oysters was the garnish.  Oysters tasted good but people had to share one oyster.  Shrimp dish, same thing, a few shrimps on top of a mountain of broccoli.  Fish dish even worse, a few fish fillet on a mountain of celery.  We were like is this the right dish, there's no mushrooms in this.  Turns out there's like 4 slivers of mushroom underneath the celery.  Not enough to even create one whole mushroom.  Peking duck, initially it was okay, not too fatty.  When the meat came back for the lettuce wraps there was so little duck.  We suspect they kept most of it to make the soup they gave you at the beginning of the meal.  After this meal we literally went straight to another restaurant to eat.  If you read my other stuff I am usually not this long winded but this experience deserved some extra time to go into the details.  Go next door, plenty of other decent places around."}
{"text":"Very authentic and the food is delicious. Love their daily soup of the day!"}
{"text":"As Christmas was around the corner, most restaurants were closed. Friends and I went here for dinner. The place is not as crowded as before.   As they claim it is holiday season, they do not offer group meal. We ordered four dishes. Food came really fast. The food portion is really small. One of the dishes is beef with black pepper sauce. There is only 4 piece.   The most disappointing part is the dessert. They normally give tofu pudding. It is my first time seeing this dessert without water in it.  If I have an option, I won't come anymore."}
{"text":"The best part about this place are the prices. The food is good too. Get the cashew with shrimp and veggies dish. The streamed fish dish is also nice."}
{"text":"What to eat?   Try their steamed fish on special from Monday to Thursday. Normally $14 dollars, it's on special for $11 to save some money. Usually the food here is pretty good and affordable. If I had one dish to recommend, it'll be the green bean and pork neck slices in XO sauce. Got a nice kick to the dish.   Last tips:   Ordering from their combo menu can save you some money on either 3, 4 or 5 dish combos. Or their set menus A,B or C is good too!"}
{"text":"Amazing! Amazing amazing priced and delicious meals for groups!  My mom kept saying get C get C, something must be good about it... something about Peking. I will report back once I figure it out."}
{"text":"Went back for a second try - not by my choice, mind you...  ... and my rating's still the same: 1 star.  Again, food was okay. But service was just as brutal as the first time 'round - if not WORSE because this time, we sat in a smaller dining room. So I guess if they can't see you... you ain't getting served.  Oh, and this time? No mustard at all. Not even Frenchies...  If this place ever deserved an award it would be for: Consistency in Poor Service!"}
