{"text":"This is an interesting story.  Bought pretty high end grill from a BBQ Island COMPETITOR.  I must say, I had some trepidation, but the sales person was solid, so I bought.  Though there are some warranty issues with these types of stores, they all should stand by the product they sell, regardless.  One of my items (a Fridge), conked out in about a year or less.  Coincidentally around the warranty time, but there had been issues all along.  Aside from a phone number for the manufacturer, the Retail Store was not much help, nor did they really have an interest in caring.  I gave up. (on a $1,000 piece of equipment that never worked right).

On a whim, and after almost 3 years of aggravation, and because I still felt gypped, I stopped into BBQ Island (Which was NOT opened yet when I made the purchase.)  Spoke to Steve A, who IMMEDIATELY took an interest in my issue, especially since they sell the same item, even though I did not buy from him.  

He stuck with me through a process of him finding the rep for the company again, pushing the issue with them, and taking the time with a potential customer (me), again, EVEN THOUGH I DID NOT BUY FROM HIM.  Fortunately, he was able to push the right buttons and the manufacturer will now replace my fridge.  Now that would not have happened without Steve taking a vested interest in the situation, standing behind a product he does sell, convincing the manufacturer to do the same, and helping out a DEFINITE customer from this point forward.  Huge difference between the two places and how they service their customers post sale. See Steve for all of your grilling needs!  Thank you BBQ Island!"}
{"text":"I recently purchased a Big Green Egg from BBQ Island and have been a regular customer since. They had a fantastic selection of products and a helpful staff to provide all the information you could need.  I have been to both stores (Tempe & Scottsdale) many times and would highly recommend you visit!"}
{"text":"I don't really do reviews but I went to this store to look at egg smokers and I was more than impressed. Josh introduced himself and showed me the smokers with no pressure to buy at all. It was very unusual to me because the other stores in the area I went to seemed to hound me as I walked through, only suggesting the high priced ones without even checking what I needed.

I explained how I wasn't satisfied with my current seasoning mix and Josh showed me their wall of spices. He didn't just push one, he gave me lots of options and invited me to a free cooking class that I later attended. 

The class showed me how to spice and different options for spices and rubs. He showed how to set temperature, different options for different smokers/grills, and how long to let it rest. I even got a taste of the meat he had finishing up in a smoker! Free sample! It was amazing. I didn't know how bad I was doing until I saw how it was done right. My family loves the new spices and rubs i've been using. 

They are good guys down there at BBQ who know their stuff. I'll be back."}
{"text":"I bought a grill and sideburner from bbq island and couldn't be happier. They didn't push me to top of the line grills, and found exactly what I wanted. I will be back."}
{"text":"Very knowledgeable staff, great selection and good prices.  This is the place for all your grilling and smoking needs."}
{"text":"Smoking Meats is a favorite past time for me and I've had my share of smokers. Side box, Electric, Charcoal, you name it. But not a Pellet Grill / Smoker yet. Well I could not resist and had to get one for my Fourth of July Party on the patio.

This location has got to be one of the better BBQ stores in the valley. The selection of product that they have on the floor and the excellent service is literally amazing. It feels like Christmas time all year long when you enter this place. Nice!

Picked up a Green Mountain Daniel Boone Grill /Smoker. Had to upgrade to the WIFI version and can actually operate this bad boy right from the couch. It does not get much easier than this and the food came out with the quality of a top notch BBQ joint.

Just fill up the hopper with the Hardwood Pellets of you choice and SET IT and FORGET IT. The phone app will beep you when your temperatures are met or if the pellet hopper starts to get low. It even tells you the inside temperature of your meat.

Smoked some Pork Spare Ribs for my first test drive and used the 3-2-1 method @ 235 degrees (Google it) with some Hickory, Sugar Maple and Cherry blended pellets. We were so impressed with how easy they were to cook. The Smoker did a fine job at keeping the selected temperature within a couple of degrees and left a beautiful smoke ring and flavor profile.

Did I mention the free 20# bag of pellets that they will give you each month for making a qualified purchase? So many different delicious flavors to check out. I had to pick up some Pecan, Oak and some Apple for my next adventure. See you there next month. PARTY AT MY HOUSE!

5 STARS"}
{"text":"The Mecca of BBQ!  So many amazing options from grills to smokers to you name it.  The guys that work here are fantastic!  They know the BBQ game and are not pushy or up your ass at all.  Thy have a passion for BBQ and are there to give there expertise.  Amazing lineup of rubs and injections to all the wood you would want.  They are my go to BBQ place and I live in Pittsburgh pa.  Nice job guys keep up the great work"}
{"text":"The staff that works here is super helpful. I had recently received a smoker as a gift (from another retail outlet) but dropped by BBQ Island to pick up some accessories and wood chunks to get started with my new hobby.

Josh happened to be working that day and spent a lot of time giving me all sorts of solid advice. He's a real pro that actually does a lot of competitive BBQ'ing and has helped me avoid a lot of mistakes.

Plus, I've e-mailed him several times, including pictures of some of my briskets, and he's taken his time (on his own personal time, no less!) to respond and give me feedback and advice on how to make improvements.

That's real service. I will continue to return to BBQ Island for all my bbq needs."}
{"text":"been a customer of the Tempe store for years. They opened this store and are continuing with the great service and selection I have become use to at their other store.

Well worth your time to check them out."}
{"text":"Great place. Steve is great, very helpful. He was very forthright on his opinions and advice"}
