{"text":"been here once, nothing special, does not seem scandinavian at all the drink is imported from the us.... they sell scones like everywhere else, etc.... but they were friendly and its a cozy cafe"}
{"text":"Cute, cozy and Swedish!  I loved the gluten-free salads and sweets to eat, and frozen loaves of gluten-free bread for sale, too.  Having the bread on sale but not serving sandwiches with on gluten-free bread is such a TEASE!!  But I certainly did not mind because the quinoa salads were delicious and filling.  I did taste the cinnamon buns (swedish and authentic!), cookies (yum!) and quiche (moist and tasty!)... and I especially love that you can bring your own mug and get a discount for your cup of coffee.    Otherwise, The atmosphere is warm and filled with neighbourhood locals. Everything from the worn in tables and chairs and colourful drapes just makes me want to come back again :)"}
{"text":"Cosy little bake shop with charm! Store owner was super friendly.   We popped in quickly today (baby in tow) and purchased three items for about $9.00.   Cinnamon buns - a must try! Not sticky sweet, but great dough consistency with some sugar on top. A really great treat, and you don't feel too guilty after.   Salted Caramel Shortbread cookie - each bite was great with buttery and salty goodness!  Apple Cinnamon tart - just baked for thanksgiving, the usual one is lemon with icing. Just a few bites, but does get you into the fall spirit!  Definitely recommend this place if looking for a treat!"}
{"text":"You cannot leave this shop with empty handed! The cinnamon roll is a must try! Anna, the shop owner was very nice! She spent time to get to know the guests while preparing some orders."}
{"text":"I picked up two items here: the Sara Bernard and the \"Swedish Cinnamon Bun\". The Sara Bernard is dynamite. It kind of looks like a chocolate-covered madeleine (though it is gluten-free, so its texture is different). The Swedish Cinnamon Bun kind of tasted like bread that was lightly dusted with sugar and cinnamon. It wasn't bad, but not a priority item.   There aren't as many Swedish options at Beaches Bake Shop as I was anticipating, but with the Scandinavian presence is lacking in T.O., it's probably is as good as it gets."}
{"text":"I love their cupcake and had the most positive first visit to this store 10month ago.  While I have been a regular customer almost a year I have continued to purchase different baked items.  Love their cupcakes and cookies !!  4 stars because I love the food, minus a star for the their espresso coffee is not that great.  I love their customer service and their vibe.  They are located in the beaches area where i love so much.  It is tiny, cute and pretty bake shop. I love their decor of outside of shop as well.   They have also gleten free and soy free and vegan product so that is another plus.  I love their atmosphere And staffs are so friendly and kind."}
{"text":"The best cinnamon buns in the city that this Swedish girl has ever tasted. Not too sweet, which is central to a cinnamon bun. Lovely café with very nice people."}
{"text":"Ok. You have to go and try those cinnamon buns. I mean really. But do not complain, once you have tried them once, you will be back for MORE. I absolutely love this place. Baked goods are super tasty. The service is good. The decor is super cute (and Swedish :) ).  Even though I gave them 5 stars (those cinnamon buns!!!), two things you need to know - th hours are not super convenient. Also the food is European. It is flavorful, healthy but in my opinion could use just a little kick. A tiny hint of spice. But that is just me. You may love it."}
{"text":"A lovely little place, we just stopped in for a coffee and juice before a wedding.  The atmosphere was friendly and family centred, there were a couple of 10-year olds selling Swedish cinnamon buns out front as it was Swedish Cinnamon Roll Day. I was impressed by their selection of vegetarian foods, but saddened that they didn't have anything dairy-free on hand. When I asked, they were asking each other back and forth, then brought out a big binder with all the recipes, which was nice, but not something I had time for. I guess I sort of assumed that a place that had a lot of vegetarian and nut-free foods might also readily have dairy-free stuff. Ah well.  It's a cute spot and I might return, but only if I was in the area."}
{"text":"A small piece of Sweden in Toronto! Their \"swedish cinnamon bun\" is authentically swedish! And so is the interior and candy! I can't stress enough how cute this place is! Warm and inviting it's like walking into an old-fashioned swedish kitchen.   Just wish they served more food from the homeland!"}
{"text":"I love the people that work at this bakery.  From the Finnish baker to the Canadian front counter staff. But I am taken by their Swedish style cinnamon buns.  You can't go wrong ordering them.  They also sell great coffee so this is a perfect place for fikka in the afternoon"}
{"text":"Currently enjoying a cup of dark roast coffee and ginger cookie for under $5. The cookie is perfect, would recommend! Only trouble is that now I want to take everything home with me."}
{"text":"I am so thrilled to have found Beaches Bake Shop, tucked away in a strip on Kingston Rd between Main and Vic Park. I commend them for being able to thrive during all the Kingston Rd construction, which I can imagine would cause lots of local businesses pain and reduced revenue, due to the amount of noise and road work.  Anyway, on to the good stuff. I was looking for a place to order lunch for my staff. I had originally picked FOOD DUDES because they were close to me and I saw a variety of options that would cater to my staff. After walking to their pantry to find out that their Facebook operating hours were incorrect, I set my mind out to find something else with basically no notice. I came across the Beaches bake shop webpage and Facebook and saw that they had good reviews, and had a nice selection of salads.  At 9am on the morning of my staff lunch, I spoke to Anna and she said she could accommodate my group for my requested pick up time of 11:30 - full quiche and two large quinoa salads, all made fresh to order!!!!! I was mind blown, I thought I was just giving her good business, but in fact,  she was catering to my needs.  I arrived promptly at 11:30 and my quiche was cooling and waiting for my arrival . She packed it up in a pizza box, along with my two tubs of quinoa salads I. One with broccoli, bacon, and almonds, and II. The other with tomatoes, snap peas, feta, and corn. Everyone was so friendly, and she even gave me additional gluten free options for my future visit.  As an added bonus, I could not leave without trying one of their highly rated Swedish cinnamon buns.... Soft, fluffy, without glaze, but loaded with just the right amount of cinnamon and definitely hit the spot.  My staff said the food was delicious, and I watched some of them grab second servings. Everything was wiped out quickly and my only regret was not ordering more food.  can't wait to come back again.... Thanks again!"}
{"text":"Beautiful owner and staff. Great pastries and awesome selection of Swedish goodies. Wish I had this little spot near our place to enjoy."}
{"text":"This place was recommended to be by other shop keepers in the area, so I went to check it out. First off the staff is SO nice and accommodating. When you walk in, it honestly doesn't look like much and the baked goods look sort of generic and plain. Don't be fooled.  They are very willing to let you try out pieces of their baked goods and you will not be disappointed. I ended up going twice in two days. The first time on the recommendation I picked up a few cookies. They were so good that the next day when I had to go back to the area to return something, I went back again and got some other stuff. Everything I have had there I have really enjoyed. I tried a caramel cookie (sort of shortbread-y, but with a subtle caramel flavour) and just about died!  I ended up bringing home way more than I should and I wasn't the only one. Other patrons are clearly regulars and they were all doing the same thing. Don't be shy! Go on in and say hello and try something out!"}
{"text":"I heard that the Beaches Bake Shop currently ranked as having one of the best cinnamon buns in the city.  Being somewhat of a cinnamon addict, I was eager to visit the small shop to try out this Swedish gem.  I have never been a huge fan of the overly sugary, gooey, doused in icing monstrosities that are sold by Cinnabon (no offence Cinnabon).  The Beaches version of the cinnamon bun was incredibly soft and light.  You can tell that a tremendous amount of attention to detail went into the preparation of their dough.  The sweetness factor was not a kick in the face that overwhelmed the cinnamon but rather a pleasant balance that was complimented by the addition of cardamom.  The staff were incredibly friendly and walked us through nearly all the other items in the bakery display  I would go back in a heartbeat!  Well done!  5 Stars."}
{"text":"A fantastic cafe filled with scrumptious food and great service.   The salads and soups are healthy, tasty and fresh. The baked goods are a triumph of pure ingredients made into truly delectable treats. I love the seasonal Swedish specials like saffron buns and semla buns.   The owner is generous and her staff friendly. They build community through special events.   Catering is also available.  The adorable seating area also has a highchair and a small selection of children's toys."}
{"text":"The Beaches Bake Shop is the only Swedish bake shop I know of in all of Toronto so I will happily tell you that it is the best Swedish establishment I have been to in the city (and that's including you, IKEA).  I rolled in one day and was impressed by the diversity in foods, particularly in the salads. I'm an out and proud vegetarian so I can't say that Swedish food particularly comes to mind as a staple cuisine but they had a lot of salads that looked amazing. The chickpea one stole my heart.  But you go for the pastries. For every holiday they make a special treat, like Swedish cinnamons buns (I'll spare you the unpronounceable name) and offer cooking classes for both children and adults.  It's got ample space, coffee worth drinking, and a very lovely staff as well. Even if it's out of your way, I'd recommend going just for the novelty of a Scandinavian bake shop."}
