{"text":"Great ribs...

Stopped by yesterday on a friend's suggestion and I'm really glad I did.

I got the half slab of ribs and though I ordered the 'ribs only' option,  I still got a big side of French fries (nice surprise).

Price was about right for good ribs... so they ended up being a great price for really great ribs. Your ribs will be sauced, so if you like them dry,  be sure to let then know when ordering.

First bite was that perfect bite that cut the meat away (see the picture) and the flavor of the rib was only beat by the flavor of the sauce.  The sauce is not too sweet with just a little heat to it and is really great. I used the extra sauce for dipping my fries.

The lunch specials are super cheap and with my daughter going to school at Chandler High just down the street,  she will be heading up there soon to try out the burgers and mac n cheese."}
{"text":"We tried this new BBQ place this evening and we've got a new favorite! It was the best BBQ we've ever tasted. The brisket is fall apart tender and has the most addictive smoky flavor. It was so good I never bothered to add the sauce. The ribs were equally tender and flavorful with just the perfect amount of BBQ glaze. This little gem is still undiscovered so check it out before the rest of the world gets there!"}
{"text":"I absolutely love when family businesses open. It gives me a chance to show my support to hard working families who I know have dedicated time and money in to sharing their family home cooked meals. 

I originally found this place just from driving by near my sons school. My son had the pleasure of trying their food during his school lunch and he was extremely satisfied so we decided to try the food as a family dinner. The owner and another gentleman greeted us and gave us a run down of the menu. They were super helpful and friendly with answering our questions about portion sizes and all their variety of sides for our order. While we waited for our order we talked to the gentlemen and got to know more about how they got started and how they came up with the name \"BEAT E'S\". Come to find it, the business name are all initials for his kids and wife. I couldn't remember the names but I thought it was a pretty clever idea. 

We ordered ribs, fries and green beans mixed with potatoes. ABSOLUTELY incredibly. I could literally \"taste the time\" that was spent on making these ribs fall of the bone. They were seasoned just perfect with just the right amount of sauce. The fries were fresh and the green beans mixed with the potatoes was just like my grandma's cooking. I will definitely be back to try other things on the menu as well as recommending to friends and family."}
