{"text":"Petit resto sans prétention, menu varié, service rapide, prix abordables, livraison exacte. Bien!!"}
{"text":"Leur petite poutine est ridiculement grosse. Mais ce n'est pas tout: tout les ingrédients sont délicieux, en partant des frites parfaitement croustillantes en allant jusqu'aux ingrédients spéciaux comme du poulet en fines tranches ou des morceaux de smoked meat. Ils ont une incoyable variété de repas, environ 200 choix. De plus le service est rapide impeccable. Les serveuses sont sympathique et l'ambiance est le fun. Je suis content d'avoir déménagé à 2 min de ce restaurant, j'y retournerai souvent!"}
{"text":"Chicken on the run  I stopped in here for takeout recently. It had been a couple of years since I was last here, and I was interested in trying this place again.  On the menu, there was a 1/4 chicken special advertised in two places. One was a breast and leg for a price, and the other was chef's choice (alternating breast and leg) for a lower price. Since I wanted two dinners, I asked the waitress what the difference was in the two specials. She had to get someone else to come and explain it: With the chef's choice, it wasn't guaranteed you would get one breast and one leg. You could get two legs, or two breasts. With the other special, it was for sure there would be one breast and one leg. Feeling frugal, I went with the chef's choice.  I only had to wait about 5 minutes for the food. During this time, I was entertained by a television overhead, and I had a glass of water. Bags are not provided with the takeout boxes.  And as expected, I did get one breast and one leg. I hope to go back at some point."}
{"text":"I give this place 4 stars, for the price.  $24.99 for a large pizza??  Wow!  Almost $3 for a can of Sprite??!!  Wow!  Maybe I'm just used to the pizza prices in the United States, but wow.  Yes the pizza was delicious and the chicken and shrimp plate I got was also yummy.  The waitress was very nice and friendly.  If you want yummy food and don't care what you spend, ok go to Beaubien Deli."}
{"text":"Déli Beaubien est un mélange entre un deli et une brasserie. Restaurant de quartier typique de Montréal, on y sert de tout: de la nourriture de tous les jours, du poulet rôti, du steak, pâtes, pizza, viande fumée, salades, sous-marin, poutines, etc.  C'est un grand restaurant spacieux, super pour les groupes. On vous offre une nourriture de qualité à prix raisonnables.  Cette fois j'ai pris le steak, mmmm! Délicieux, cuisson parfaite et bonne température (considérant que nous étions un groupe j'attendais un steak froid). Le dessert: belle tarte à la pacane, que j'ai demandé réchauffée avec une boule de crème glacée. (Est-ce possible de le manger autrement? ;) )  Je vais définitivement explorer les autres plats."}
{"text":"Wow ! Première fois ici et pas la dernière! Il est mentionné sur leur site internet qu'ils ferment à 1h am le jeudi soir, je me présente à 12h40, on m'accueille avec un grand sourire! (contrairement à plusieurs restos ou on se fait faire des gros yeux lorsqu'on arrive trop près de la fermeture ..) Je commande pour emporter, un sous marin 10p all dressed + extra bacon avec une boisson gazeuse , le total est de 20$ dont 3$ pour l'extra bacon Je suis surprise et trouve ça cher ... Rendue chez moi, je suis très surprise, mais du bon côté! Le sous marin est très bien garni , de grosses tranches de tomates, de la salade (pas fanée du tout ;) )  Je suis encore plus surprise à ma première bouchée! Il y a tellement de viande !! Plus du 3/4 du sous marin est rempli de viande ! Encore plus surprise ! J'ai 5 tranches de bacon dans mon sous marin ! Ils ne coupe pas sur le bacon eux ;)  Finalement , le tout vaux son prix ! J'adore les sous marins en late snack et j'ai bien aimé mon expérience"}
