{"text":"I've been in here on a few occasions and have yet to find something that I didn't fall right in love with. The juices are purest ambrosia. The puddings and cheesecakes are fit for divinity. The sandwich is absolutely the best sandwich I have ever had. It obviously came right out of Eden. If you need to remember that God is real, visit Beet Jar because he sent his prophets Joseph and Molly to feed his people from the fruits and vegetables of His paradisical garden."}
{"text":"I love everything about this place. Amazing quality and always the best service from Molly & Joseph. You can tell they love what they do and want to make people happy! Obviously the juice is great, but even the chia seed pudding, cheezcake, and sandwich are all amazing, vegan and raw."}
{"text":"Beet juice bar's salad and sandwich was bomb! Lots of avocado on the sandwich and it had a really good cashew (I think) spread. The salad had lettuce, avocado & coconut flakes with a dressing that was really good and had a nice kick to it. 

The place itself is small, but has seating for maybe 5-10 people. The inside is very cute and the owner was nice. :)

Most importantly, the sandwich was bomb."}
{"text":"They have some of the best raw cashew cheesecake, raw pudding, cashew milk, and delicious juice blends.  And OMG the salads.  They are huge & packed with so many different things.  I love when they make them w/ raw falafel or taco salad.  Beet Jar is owned by awesome people, and everything is made that day or the day before.  I like the decor and it's a very comfortable place to eat and drink juice.  To me, it kind of doesn't make sense for people to be reviewing based on your personal preference/ ability to pay this much for juice.  If you cannot afford/ do not care about designer clothing, do you fault the retailer for charging the going price?  I would buy this stuff all the time if I could, but as other reviewers mentioned, for some it is a treat.  However, there is not a HUGE mark up or any \"price gauging\" going on here.  Grocery stores carry 16 ounces of cold pressed juice and cashew milk that were not made in your city, during the last 48 hours, for $9 or $10.  There is another local business nearby that carries non-cold-pressed juice for $1 more than Beet Jar's cold-pressed variety.  Raw food and cold pressed juice are very labor intensive."}
{"text":"Once you juice, you'll never look back. It will change your life! The space is vintage industrial and super cute. The choices around 9 am were plentiful. I chose the seagreen serenade for breakfast and the drumbeet for lunch. The girl at the counter was friendly and helpful. I drank my seagreen in the car since it was a 15 minute drive back to the burbs. Is was sooo freaking delicious. I thought the juices I made at home were good, until I swilled on this beauty! When the clock struck 12, I eagerly sipped down the drumbeet- equally delicious! The juice was so seriously so good I ordered up a cold pressed juicer to replace the centrifuge style juicer I currently have. It is so nice to know that there is a local place to get delicious, organic juice for the many days I am short on time or feeling lazy about prep and cleanup! The place is cute, the people are friendly, and the product is awesome! Juice on!"}
{"text":"I love this place! Everything is delicious, especially the gluten free version of the bravacado. And the cashew cheezcake is heaven, like nothing I have ever experienced before. Mmm just writing this review makes me want to go back."}
{"text":"Like everyone else on here I have become addicted to their Bravcado sandwich. People here are very friendly. Also sweet potato salad is great!"}
{"text":"I loved the atmosphere at beet jar! The flowers in recycled bottles, earthy furniture, and bright colors gave the whole place a cool bohemian vibe. I got a chia pudding and my boyfriend got an everything bagel with the cashew butter. Both were delicious! Especially the cashew butter which the cashier told us was made in house. Even though it's super small inside we decided to eat at one of the tables which was a great decision. The guy behind the counter was very friendly, answered our questions, and chatted with us and the other customers the whole time. If you're in the neighborhood (or not! We drove from university heights to try it) I would absolutely stop in!"}
{"text":"Very nice shop with very nice owners. The Grapefruit Moon blend of grapefruit, orange, lemon, and cayenne pepper I had was delicious. They have cashew milk which sounds cool. The shop has a fun interior with wire hung lights.

But HOLY COW it's expensive. We're talking $9 for a bottle of juice. It IS made fresh from only organic fruits and vegetables, and it's a business, I understand they have to mark it up a bit, but man, that's a rough price. $8 for a bottle of cashew milk.

If the price doesn't phase you it's a lovely shop. For me, it'll be a rare treat."}
{"text":"Ok--- where have you been all my life? I went to The Beet Jar Friday for the first time. I bought a flower power juice and the raw strawberry blueberry cheez cake. Both heavenly. Some people might think $9 for juice is a lot of money, but trust me after having my own juicer $9 is a great price- especially for all organic ingredients. I just love this concept and the staff is super sweet as well. I felt so great after drinking my juice--- can't wait to go back!"}
{"text":"Are you even kidding me?! This place is wonderful. I had pretty much the best smoothie of my life here. It had strawberries, bananas, cacao, dates, and cashews. Holy moly, was it good. 

I also tried the Bravocado. Obviously. Because they were just sitting there by the register, little packages of awesomeness wrapped in twine. Hilarious. But so goddamn good. I savored that coconut like it was going out of style. When a piece of avocado fell out of my (perfectly textured) bread, I used it to pick up some fallen coconut flakes and shoved it in my mouth. I'm not usually a fan of raw red onion, but something about the use of it in this sandwich was just right. It gave it a savory kick. Sooooo good. 

Yeah, it's pricey, but then so don't go there every week and you'll be fine! What do you want to spend your money on, anyway?  ;)"}
{"text":"Cashew milk is to die for! Loved the sandwich on gluten free bun! Chia pudding just isn't my cup of tea though. Very polite staff! Will be back for more cashew milk!"}
{"text":"LOVE the juices and desserts. Along with chia puddings, but I'd wish they'd stop using salt in their nut mylks. Amazing place I'd go time again."}
{"text":"So glad this place came to the neighborhood. The owners were very polite and a pleasure to talk to. Yes, the prices are a little steep but you get what you pay for.  There are some amazing juice combinations. Overall thumbs up!!"}
{"text":"My go to is the bravacado sandwich... so good. For guilty pleasure I get a slice of the varying raw cheesecake's; I think the last one was pomegranate with blueberries? It was amazing...  Molly and Joseph make everything with love, so it tastes even better."}
{"text":"One of the best sandwiches I have had in a very long time. The place itself is adorable. Definitely stop by here if you get the chance!"}
{"text":"Great atmosphere, and great customer service. The Blueberry Lavender Smoothie is highly recommended."}
{"text":"Everything at the Beet Jar is delicious and if you don't think so you're probably stupid. Or maybe you have no tastebuds? Have you tried the chia pudding yet? No? Why the hell not? It's friggin delicious, just like everything else at the Beet Jar. They have sandwiches for all the Brah's that love avocado and toasted coconut and yes, they're delicious too. Kale chips, delicious. Cheese cake, it's vegan, just like everything else and you better believe it's super duper delicious. Don't even get me started on the juice and \"Mylk\", the variety of flavor combinations of fruits and vegetables never cease to please the palate or the eye. 

Aside from all of their original creations, they have a variety of great snacks and beverages from other great companies as well. 

And last but certainly not least, The Beet Jar is run by two of the nicest people in all The 'Land. Joseph and Molly always greet you with a smile and after going there pretty regularly for the past few months I'm proud to call them friends. 

Now go check it out, people! 

Kale chips!"}
{"text":"It looks like everyone has already discussed the Bravocado, but in the interest of making my opinion heard: Yes, it is really as delicious as everyone else says it is! Just go for that.  Actually, don't just go for that, because it makes it sound like the juices aren't worth mentioning. In fact, the juices are pretty darn delicious themselves. Very fresh, with interesting flavor combinations. The only downside for me was the price. I bought two juices and a Bravocado, and I kind of had to bite my tongue when they told me the total. But then I reminded myself that this is healthy, fresh food, from a local shop, and I dutifully handed my credit card over. And as soon as I ate/drank my order, any lingering thoughts about the price washed away. Definitely recommended!"}
{"text":"This place is freakin' amazing. Consider that you are in Cleveland, Ohio--then close your eyes and imagine that you have been transported to a hip, clean, gorgeous beach somewhere off the coast of Highway 1 in California. 

This is a restaurant you would encounter on that stretch of highway. This is worth paying for. 

I love the sandwich they have here and get it whenever I can. It features toasted coconut, avocado and other delicious vegan toppings served on lovely fresh toasted bread. The cashew mylk with lavender is my favorite drink so far. I went in today looking for carrot juice. They had a delicious offering of carrot/beet/pineapple/ginger/red pepper cold-press raw juice. It was awesome. It was not cheap. It was totally worth it."}
{"text":"Some of the best vegan food in Cleveland. The cereal cashew milk was incredibly smooth and just the right side of sweet. The vegan avocado and coconut (!) sandwich was a great mix of savory and sweet, between hearty pieces of toast. The staff could not be nicer and cooler. This is a go-to place for anyone looking for some delicious, adventurous vegan eats."}
{"text":"Fresh, organic, delicious, amazing, yumminess! That's about all that needs to be said about Beet Jar. They cold press their juices using the freshest organic produce available, and it shows! Wow those juices are delicious. They also make a mean smoothie- The Cayenne West is a personal favorite. 
And lest I forget to mention...THE BRAVOCADO. I mean, come on, no sandwich should taste that good. You can pretty much put avocado on anything and I'll gobble it up gladly, but this sandwich is just another level. Every ingredient works so well, its perfect harmony in my mouth. 
Yeah, yeah, yeah it can be a little pricey. But you're paying for amazing quality and a business that actually cares about the quality of food they're serving. I gladly hand over my $25 for two juices and a sandwich and I'm on my way to flavor heaven. Just think of it as a once a week \"Treat Yo Self\"."}
{"text":"Just when here for the first time after spinning class at Harness and I am in love with this place.  Amazing smoothies for a decent price. The lavender and blueberry with cacao thrown in was just what my body needed after 45 mins at Harness.  Also do yourself a favor and grab the Chia pudding. You can thank me later."}
{"text":"I absolutely love this place! I would come here everyday if I could. Best fresh pressed juices in Cleveland. Also try the avocado pudding and the bravocado!! Amazing."}
{"text":"The juice was good and so was the sandwich but it did not blow me away and for $17 it really should have.  I just can not get past that price for PREPACKAGED food.  I would totally be ok with the price had this super simple meal been prepared fresh for me but I'm just not into their set up.  Also there really aren't a lot of options - if your not into their one sandwich you are out of luck as far as food goes.  There are just way better options right around the corner - fresh, more reasonably priced options - Herb and Twine (amazing sandwiches).  The OH City Grocery (great juices). . . . . just to name a few."}
{"text":"The Bravocado sandwich is one of the best things to eat in Cleveland. I wish they offered a gluten free bread option for this sandwich. 

Most of the juices I've had were well balanced and all were fresh and wonderful. Another wish I have is that they would offer the option of making juices a la minute so customers could have whatever juice combination they desire- like a juice bar. We don't have that option in Cleveland and I would love to see it at Beet Jar."}
{"text":"CASHEW MYLK, CASHEW MYLK, CASHEW MYLK

I go to Harness Cycle, a few doors down, and they aren't open later in the evening. While this place has been bookmarked for over a year, I finally went a couple of weeks ago after being able to attend an early spinning class.

I walked in, and it's a small and cozy place. Joseph was wonderful. He greeted me, walked me through what they offer and helped me pick out my first Beer Jar purchase. I bought the mylk, lavender infused (I think they also offer orange?). Anyway, I left and took it home with me. I took my first sip and didn't understand the hype, I actually didn't like it at all. I put it in the fridge. Next morning, road trip. I took it with me and thought I'd give it another try, well I'm glad I did. I LOVE THIS STUFF and drank the bigger bottle in less than 10 minutes into the drive. I think I must have eaten something the day before that altered my palate or after sweating it out for 45 minutes but damn was it good the next day. 

It is rich in flavor and you really can taste that well. The only thing is the prices are a bit high, but you're getting quality. I look forward to going back and getting more cashew mylk and I'm dying to try their sandwich! NEXT TIME! :) 

Don't forget to try the CASHEW MYLK, CASHEW MYLK, CASHEW MYLK!!"}
{"text":"Awesome place- even though the menu only has two items, everything in the fridge looked AMAZING! The sandwiches are fantastic! If you're an avocado lover, you will die...they don't skimp on it at all. They even make fresh ones for you :) super cute place, eco friendly, and great food!"}
{"text":"I've been to Beet Jar a few times for their juices to-go. I love how easy it is to stop by and grab a juice when I'm out and about for the day. The juices are always fresh and tasty and of course, guilt free! If it's healthy and it tastes good - I'm all about it! I've now made it a habit to stop by every time I am in the area for my juice fix. I would love to go back and try some of their food sometime because it looks delicious! I really don't mind paying 8-10$ for a juice/smoothie that contains well over 8-10$ worth of fruit and veggies. I will definitely be back!"}
{"text":"Feel guilty about spending $17 on the bravacado and the beet/watermelon/lemon cold pressed drink but that's my pleasure! Worth every penny!"}
{"text":"Fresh, organic food a block away from my apartment. It reminds me of a place that I would stumble upon in NYC in the East Village when I lived there!! Totally awesome. I had a sandwich with avocado and cashew mayo and it was the perfect little lunch with a fresh cold juice! The cashew milk was soo delicious and would be the first thing I reached for upon going back.

I only have a few complaints-- the hours. The hours are a tad sparse (they close kind of early and aren't open on Sundays.) I would highly enjoy taking a stroll there on a Sunday, but that isn't an option. Also, the selections are not that vast and while I realize you are paying for organic, quality products-- it still is a tad pricey. Not horrible for what you are getting, but high enough to where I wouldn't be able to afford coming here on a weekly basis."}
{"text":"I've been waiting forever for a cold pressed juice bar in Cleveland! 

We stopped by for food and juice (note: sandwich served between 11am-2pm) at 3pm, and weren't disappointed. I walked out with 2 green juices, a lemon, a cashew mylk, a chia pudding, and my mother got a blueberry lavender smoothie. Topped off with some ranch seasoned kale chips. 

The juices are amazing. Exactly what I wanted but better. The smoothie was so good my mother almost went back for a second. I can't stress how good fresh food is, and this place is spot on. 

I tried a kale chip, and they were fantastic. Crispy and flavorful (everything my own homemade chips were lacking). 

The owner is super friendly. I can't wait to go back for the sandwich and more juice, and I know I won't be disappointed."}
{"text":"Holy Moses (or in this case Joseph...that is the owner) this place is worth all the hype. What an absolutely adorable little vegan spot located in OC. Picture people wearing hemp, burning some incense and sitting on a crate eating chia pudding and laughing. That is what it feels like in this place. Organic, simple and just plain comfy. Joseph has an amazing personality and is super nice. He really takes time to get to know ya too. Rocking it Joseph?!

The Chia Pudding Jar is my new lover. Creamy, sweet and packed with simple flavors and fresh berries....this jar is a container of heaven. Seriously, it rocked my socks!!! I love the fact it comes in a mason jar to take home. 

The Peanut Butter and Tart Cherry Energy Orbz are a fun little treat. You just feel amazing after the first bite. CAUTION: Do not try to fly after eating this product. From personal experience, you do not gain that superpower....although you will feel like you can! I love that these little balls of goodness aren't too sweet, have that nice cherry tang and a very organic and earthy feel to them!

I will definitely be back. Love this place!"}
{"text":"I'm done. I am officially throwing in the towel. This foodie will eat no more. Why you might ask? Well isn't it obvious? Nothing will ever be as insanely delicious as Beet Jar's coconut bacon sandwich. So what is the point in living if you've already peaked?

Ok ok, so that's a bit dramatic. But seriously though, have you had this sandwich? If you haven't you need to literally stop whatever you are doing, put some shoes on (if you aren't wearing any), but some pants on (again, if you aren't already sporting some) and get yourself to Hingetown, STAT. I think I saw my life flash before me when I first bit into this sandwich because I am fairly certain my heart stopped for a moment.  I don't know if it is the perfect avocado to coconut ratio, or the beautifully toasted bread, but this sandwich should be illegal it's so addicting. 

The sandwich isn't the only reason to go to Beet Jar though, as you may have guessed by the name, they have juice too! I got the grapefruit/cayenne/lemon/orange juice when I went and it was so refreshing I had to force myself to not down in all at once. 

Basically, if you are human/breathing/alive you need to hit up Beet Jar. If I could I would give them way more than 5 stars so seriously: Go. Now. 









I'm serious."}
{"text":"I think my vegetarian heart is in love! If only I was richer... The food is fresh and delicious. I love that it's completely raw and organic! So healthy! The juice selection has a night range and last three days with no preservatives. There are unique and traditional options. I will say it is a little higher in price than the avg. takeout place, but that being said, the quality is far better. I will be back!!!!"}
{"text":"I would give it 3.5 but as we all know that doesn't exist. Stopped in around 1:30 to grab some juices and gf treats. They had a few selections of juice in the fridge and cashew mylk which I picked up. Disappointed there weren't any \"gf treats\" in the case only vegan scones which looked good but obviously couldn't have. I came in for the raw cheesecake but again-out of it. I would have thought for sure this place would have a bit more options throughout the day and not only in the a.m. Super disappointing and that's one of the main reasons the lower rating-I mean you should have stock all day and not run out at 1pm!! Not everyone can get up there first thing in the morning. 
The cashew mylk was good-honestly too sweet! It has dates and agave- I wish they made pure cashew mylk w/out any of the sweet additives and added sugar! I mean dates and agave! My teeth were hurting after a couple sips. Stick with the natural dates and get rid of the agave crap. I mean yes it was delicious but for the reason of having so much sugar and taking the health benefits lower because of that, I wouldn't buy it again and it's still in my fridge because I can't have all that sugar. 
I will go back in the a.m to see what they have stocked and hopefully grab a juice that isn't sweetened with added sugar - I mean fruit is already sweet- do we really need to add more sugar for the masses??  I assumed this was a health conscious juice bar-maybe I missed the mark on this one?"}
{"text":"After taking a spin at Harness Cycle you have to walk to doors down to fill your belly the healthy way. I had the best vegan friendly sandwich of my life here.

Avocado, cashew mayo, coconut flakes, red onion, and field greens together make the perfect experience in your mouth. Make sure you try it. 

Also the beet juice was excellent,  it has grapefruit juice in it that taste so refreshing with the earthy taste of the beets."}
{"text":"You'll be hard-pressed to find a better cold-pressed juice bar as good at Beet Jar. That was the best pun I could think of. 

I'm not juice-cleanse gal--well, at least not week-long, juice only ones. But I think replacing a few meals once in a while with some fresh, local, organic, cold-pressed juices can be a great break for your body. And these folks do it right--no pasteurization in any way, shape or form. Just pulp squeezed to smithereens for the nutrient-rich juices which are then expertly blended for your enjoyment.  

For those of us who want to just stop by, grab a quick juice or two and move on with our day, this place is awesome. There's not a ton of space inside to hang out, but there is a large table up front with about 8 or so chairs. They also have freshly-made vegan sammies, desserts and raw cashew mylk! 

While it is quite pricey--I think you really get what you pay for here. I don't know if I'd ever do a complete cleanse with these or more than just a few meals a week. But again--great for those few replacement meals along your day."}
{"text":"I eat here everyday that I'm in town. Best organic raw vegan takeaway I've ever came across. Obsessed. Looking for a promo girl? Contact me anytime! I'd love to rep Beet Jar!"}
{"text":"I've only had the juices here but I've been elated with them each time. I usually go after a spinning class at Harness Cycle down the block. The juices are a good late morning drink and will hold you over for a couple of hours. They are a little pricey at $9 a bottle but the fresh ingredients and energy they provide are well worth it."}
{"text":"I've been here three or four times since the last time I left a review, so I just want to say it is still awesome!! Thank you Cleveland for keeping these guys in business; I visit from Philadelphia and this is always a stop for me. :-)"}
{"text":"Their juice, yum. I had the all vegetable green juice and it was alright (probably just me needing a little more sweetness). The grapefruit, orange, lemon, cayenne was so tart and spicy that it was super refreshing. Green juice with some citrus was good too. They sell a brand of coconut water I'd been looking for too. All organic here. You'll pay a little more, but quality and taste are top notch. Worth it. I'll be back when my grapefruit craving strikes (soon!)"}
{"text":"Went in for the first time this Saturday to try some juice. Not only was the Grapefruit/Cayenne juice exceptionally tasty, but I was even offered a free one of their sandwiches to try. Everyone there was extremely welcoming and kind. An absolutely outstanding experience, and I will be sure to return again!"}
{"text":"The bravocado sandwich is soooooooo delicious!!!!!!  I also got the cashew mylk... Mmmmmmmm good!! Will definitely be back!"}
{"text":"Excellent! My boyfriend, sister, and I stopped in on a whim after a spinning class and decided to order smoothies. We ordered 2 Berry Manilows and 1 Phat Beets. Both were delicious. I look forward to stopping in again soon and trying one of their juices. Highly recommend."}
{"text":"I stopped in here by chance for lunch. I will say after eating the Bravocado sandwich, my visits here in the future will not be by chance. This sandwich was very unique and absolutely delicious!  Will be back again...very soon!"}
{"text":"This place has the tastiest smoothies and juices! It's kind of hidden off the main road but i am so glad i found it. Staff is super friendly and the orange tumeric \"cheesecake\" was to die for"}
{"text":"This place is great. They know how to make amazing raw foods and you can taste how high quality the ingredients are. The juice and smoothies are on point. If you're the type that likes organic and raw foods I definitely recommend this."}
{"text":"I fully enjoyed my visit to Beet Jar! The staff was very friendly when I walked in and explained the menu to me. All of the smoothies are made to order and they have a selection of juices in the fridge.

The location is a pretty tiny store located off of Detroit in Ohio City, that being said it could be hard to find. Also, there isnt a lot of seating.. just a few bar top seats. 

I had the Berry Manilow smoothie (acai berry, strawberry, banana, blueberry, spirulina, coconut oil and cacao). It was very tasty and filling!

I plan on coming back next time I am in town!"}
{"text":"This place is one of my favorite locations in hingetown. You can't get fresh juices in too many places in Cleveland, non the less cold pressed juices. Molly and Joseph hold down the fort and make fantastic bright juice combinations with a few gluten free/ vegan treats. My favorite is the green juice, vegan chia seed pudding, and a ginger shot to get the day going. The interior is adorable and bright to match Molly and Joseph's cheery demeanor."}
{"text":"Great juices, friendly owners and staff, eclectic look. What's not to love?"}
{"text":"I love Beet Jar. Since writing my first review in March 2016, I come here all the time. Lunch? Come to Beet Jar. Craving something healthy? Come to Beet Jar. Hungover? Come to Beet Jar. Under the weather? Come to Beet Jar. You get the idea.

All of the smoothies are named with a music theme. My favorite is the Blue Reed with blueberry, banana, lavender, maca, date, and cashew. It has a naturally sweet kick to it while also being healthy. However, my go-to's are always the juices. I regularly get their Cashew Mylk (cashew, date, vanilla bean, sea salt) and the grapefruit/lemon/orange/cayenne cold-pressed juice. Its the one time I don't feel guilty when eating out. Gimme that juice all day.

The vibe here is beautiful. They have cool lighting, exposed brick walls and tons of local art. It's an inspiring environment. If you're hungry, they also have a few snacks available in the cooler. My favorite is the Chia Pudding - their house-made chia comes packed with berries and granola in a mason jar and is to-die-for. When I have their chia, I'm full most of the day. If you return the jar, you get a $1 off a future purchase. 

I still do wish they had more comfortable seating other than stools because otherwise, I would probably stay here all day and work. Regardless, Beet Jar has my heart. The owners are very kind people, their juice is healthy and delicious and the vibe makes me want to quit my life and open an art gallery."}
{"text":"New favorite place? NEW FAVORITE PLACE. I'd heard great things about Beet Jar but hadn't made it over there until I found myself in Hingetown for the first time, obsessing over Rising Star Coffee (across the street). Now, I'm making a nice little daytime habit for myself - work from home in the morning, grab lunch at Beet Jar, then work from Rising Star for the rest of the day. Perfect! 

Beet Jar only had one - you read that right, one - sandwich on its entire menu, but luckily, that sandwich is incredible. The Bravocado is smoked coconut flakes, avocado, greens, red onion, & house-made cashew mayo on toasted Sicilian bread (vegan bread option available). Yes, smoked coconut flakes. The flakes mess it a bit of a mess to eat, but it's worth it because it's literally one of the most delicious sandwiches I've ever tried - & I'm not even a vegetarian. They make a limited number each day, & when they're out, they're out, so get there early.

The only smoothie I've tried so far is the Blue Reed, made with blueberry, banana, lavender, maca, date, & cashew. It's too thick to suck up with a straw, but it sure is tasty - & so healthy! I'm looking forward to trying, like, every single thing on their menu. 

Give Beet Jar a try... or don't. More sandwiches for me!"}
{"text":"Loved this place! The salad was amazing! Fantastic juices too! The owners were so friendly and helpful! This is just what Ohio City needed!"}
{"text":"Dear CLE - get with the program and get down with cold pressed juice!

I'm a juice-a-holic. Green juice. Beet juice. Cashew mylk. I like them all. They're a delicious way to replace a meal, do a juice cleanse, or just refresh your insides with an overload of healthy goodness.

Beet Jar has a smorgasbord of juices and mylks in addition to vegan and gluten free snacks and sandwiches. On the day I dropped by, they were nearly sold out of everything (hooray for a great opening week!) but I was able to get a cereal cashew mylk and my boyfriend got a lavender cashew mylk. Both were delicious. (If you're not familiar with cashew mylk, it's like dessert in a bottle - but good for you!) And if my memory serves me right they were $8 or $9 - or $3 or $4 less than you'd pay for similar mylk/juice/etc. at Whole Foods. (and it's local - SCORE!) Sure, this is a littler pricier than the processed, not as good for you juices you'll find at Giant Eagle, but there's really no comparing cold pressed juice to any other juice. 

This neat little juice bar in Hingetown is worth checking out whether you're a juice head like me or just want to try some cold pressed juice to see what all they hype is about."}
{"text":"We went here on Saturday the 28th and found the place closed. Needless to say, we were not happy campers. They had posted a notice on their phone but of course, one has to go there to see that notice (that irony is probably lost on them) No notification on their fancy website (perhaps they should spend a little less on designing a space-age website and a little more effort on making sure Customer Service 101 is met). And since they don't have a phone, no one can call to confirm either. Lastly, this just reinforces what we have come to believe through first-hand experiences all over the country - you would be hard-pressed to have this kind of experience with a \"regular\" eating establishment like a burger joint or a steakhouse or a pizza place. This is something we've only ever witnessed with vegan/raw places. If we weren't forced by our medical condition, we'd probably never visit these places."}
{"text":"Delicious and nutritious fare, fresh juices and nut mylks. I absolutely LOVE the \"bacon\" bravocado sandwich. It is stacked with nutrients and the coconut \"bacon\" is very interesting. This place also has amazing raw vegan cheezcakes. Just be prepared to spend $$."}
{"text":"I went here extremely hungover after an extremely hungover spin class next door at Harness.  I needed something for my nausea and STAT-I got a carrot ginger juice and bravacado sandwich.  It was around 1145 on a Saturday and no one was in the place, but I hear the sandwiches sell out quickly.  The prices were a little steep but so worth it-the sandwich was amazing.  The juice was just okay, but I'm not a huge fan of cold pressed juices.  I would like to go back and try the cheezcake and a few other things there, but the hours can be a little strange and they're closed Sunday and Monday."}
{"text":"vegans everywhere
hard pressed juice and cashew milk
i kinda like it

Westside Market aside, Ohio City is becoming quite the hotbed of edible and drinkable goodies.  Here's another new kid in the hood, and what a cute and sparkly shop it is.  Pricey some people say, but you get what you pay for, and they do have rent to pay. And utilities. And insurance. And packaging. And equipment. And organic product... So, get over it. 
Great juice flavor combos, salads, and some crazy vegan sandwiches with stuff like smoked coconut as opposed to tempeh (blerg) and tasteless tofu.  

Carry on.."}
{"text":"I love the feel of this cute, trendy cafe. The juice, although slightly pricy was pretty good. I ordered the carrot, ginger, and orange, however, some of the juices are less tasteful. 

I would recommend this location for the great aesthetic and trendy feel, however it is not a place for picky eaters."}
{"text":"SO in love with Beet Jar! I was visiting Cleveland for the weekend and stopped in for some cold-pressed juice after a spin class a few doors down at Harness Cycle. The space is nice and bright with super cute decor. 

I had the green juice, which was fantastic, and also got the Bravocado Sandwich made with smoked coconut, avocado, red onion, cashew mayo, and mixed greens on toasted sicilian bread. This sandwich knocked my socks off-I'm a meat eater and would probably never order a sandwich without meat if given the option, but this sandwich is now the exception. It was so tasty and delicious, I'll be craving it all the way from Chicago!"}
{"text":"What a fantastic little find in Hingetown - we stopped in around lunchtime on a Friday afternoon and immediately fell in love with the avocado and roasted coconut sandwich we ordered. It was so tasty and flavorful I want another one right now just writing about it. We shared a bottle of juice (green, can't remember what all was in it) that was delicious, and then I purchased a chia pudding which was - you guessed it - also delicious. I hope this little spot does well - we will definitely be back!"}
{"text":"Beet Jar Juicebar & Takeaway is the perfect place to go if you suddenly go on a health kick and want your soul to feel just as healthy as your food. The entire place reminded me of a juice bar that would be found on the show Portlandia. I really enjoyed this because Portlandia is one of my favorite shows!

Walking in, there's a lot of beautiful, quirky and hipster artwork on the walls. The juice bar also has all kinds of preserved flowers placed throughout the space, which I thought were beautiful. 

I bought the cold pressed apple, orange and ginger juice, which really had a predominant ginger taste with undertones of orange. Although I enjoyed my drink choice, I probably won't buy it next time I visit because there were so many other great looking smoothies that I wanted to try them all! Many of the smoothies had puns in their names, like \"Blue Reed\" or \"Berry Manilow,\" which I thought was really cute. 

I was very happy with my trip to Beet Jar Juicebar, and will definitely be back next time I'm in the area."}
{"text":"After my workout at Harness Cycle I was famished but didn't want to undo all the good I had done in spin class.  A couple of doors down is the Beet Jar Juicebar.  I tasted the grapefruit/beet juice and the cashew milk.  They both were good if you actually like the taste of those things.  Either way they tasted so fresh and so clean and although pricey I would recommend it.  I asked the owner about the sandwich of the day.  He proceeded to tell me it would change my life.  At that point he sold me.   The sandwich was  avocado, cashew mayo, red onion, salad greens and toasted coconut on Sicilian bread.  It was amazing and my life was in fact changed.  Again it's a bit pricey but why not splurge.  They also offer a raw cheesecake that they sell out of just about everyday.  I will return to try it!"}
{"text":"Smoothie shop located in OC, vegan and organic spot. This place runs on the pricey side. Two of the bravacado sandwiches and three smoothies ran about $50 bucks. Worth the try if you are in the neighborhood!"}
{"text":"ERRMAGERDDD you guys. Fresh juice in Cleveland. 

I used to have to pay ridiculous amounts of money of express shipping to get my juices delivered from NYC or LA. Then I bought a juicer and had no idea how to make good juice. Now I'm SOOO SOOO happy that Cleveland is picking up on the juice/raw food trend! 

I've been here a bunch of times and everything has always been spectacular! Not one thing I didn't like!! Definitely a huge fan of the cashew mylks. The lavender and cocoa ones are the best. I also had some kind of pineapple/mint juice that was really good! If you're going to go for the raw food, I'd suggest the raw cheesecake! So yummy, filling, and HEALTHY!!

I know people are saying how expensive it is--but the prices are pretty standard for a juice place like this. If you go to any of the juice places in NYC or LA, you'll find the same prices...so I don't think I'm getting ripped off here. I would be surprised if it was cheap--the high price is just a sign of the high quality juices/food. You have to pay premium for a premium product! If you bought a juicer and fruits/veggies each week to make your own juice, it would also probably come out to the same price per bottle!

This place is pretty far from me and kind of out of the way--but guess what, I'm going to be a regular!"}
{"text":"First time in and had the black metal which was delicious! Met Molly who was very polite, helpful and awesome! Very cute place; simple and clean. I'll definitely be back and I want to try out the cleanse."}
{"text":"The hands down absolute best sandwich I have ever tried. Seriously go try this place, go NOW!

The place is small but that's one of the things I really liked about it. You can either eat there or you can get the delicious food to go. 

Lets talk about their sandwich.
Yes, you read that correctly...sandwich, not sandwiches. They only make one sandwich, yep only one....you might think that's crazy but honestly why would they need to make any more sandwiches if this is the best sandwich in the world!? The bread is perfectly toasted, the avocado is perfectly cut and ripe, the coconut is perfectly toasted made to taste almost like bacon. Oh man oh man was this sandwich delicious. 

Seriously though, go try this place out!"}
{"text":"Organic, cold pressed and friendly staff. Had their famous sandwich which was really good. Also had a couple of their juices that were good too. 
Don't be a hypocritical bitch by supporting animal abuse, go vegan!"}
{"text":"Love everything about this place!! Best juices and cashew milk around. Also, they are always coming out with something new and changing up the menu. Wish I lived next door!"}
{"text":"I have to say the fresh juice I drank was very good. It was pineapple, apple and mint flavour. I'm glad someone thought to create that combination because I sure wouldn't have. It came out to be a yellowish colour, but was really tasty - the mint was clearly present and made the drink smell great too! The bottle had no nutrition info it however....if someone from Beet is reading this I would recommend using a site like http://nutritiondata.self.com and putting basic a nutrition info sticker on the bottle as I image some of these can be high in sugar/carbs. Everything is organic and Vegan. Since that means there is no lactose in the milk they offer, which is raw cashew milk, I think I'll try that next time. 

Anyways, it was very good. I will return earlier in the day next time because when I stopped in around 16.30 on a Wednesday there were only 2 flavours left in the cooler. The really helpful man that was working in the shop when I came in told me all the juices are made fresh daily and do sell out. My drink was $9, which when you think of the work that goes into that and the amount of fruit required to make it isn't that bad at all. 

Also note that the 1 sandwich they sell is only available during lunch time hours, so it was not for sale when I stopped in around 16.30."}
{"text":"Overall a nice rustic eatery...great location. Staff is nice . Prices are reasonable."}
{"text":"Im on the fence with this place, i agree with Cara, it is an amazing hard-pressed juice bar. Yes. It is super-duper expensive too. Everyone told me it was going to be and I even knew the prices beforehand, it was not until I was at the counter paying that it got to me. 9$ for a juice?!! Really? Ya, its all organic, I get it. 

I understand the best places are built from the ground up, so like Drake says, \"start from the bottom.\" You don't even have a legit looking establishment and you're already digging into peoples pockets, shitty economy and all. They're like Hulk Hogan in No Holds Barred, coming for your head. Start off low and then sky rocket your prices once the little people such as myself get a little taste.  

RZA said,\"ya best protect ya neck.\" Well, if you decide to come here, I'm saying',\"protect ya wallets.\""}
{"text":"This place is yummy and healthy. I give it 3 stars because $10 for a smoothie is outrageous!"}
{"text":"I kind of hate it here, but I also mostly kind of love it. 

I hate that I'm spending $10 on a freaking smoothie, but I love how delicious and unique they are. 

I hate that the staff is often snobby and somewhat unfriendly, but I love their punch card incentive. 

I hate that this place is right next to Harness Cycle so I feel like I have to stop in afterwards to lock in that healthy vibe but I also sort of love their mutual symbiosis. 

I hate that there's barely any places to sit, but I love that the lack of seating keeps this place from becoming a hipster hangout. 

I'll keep coming here and handing over my money for their delicious, delicious smoothies that I love so much, but I'm gonna keep on secretly being a hater."}
