{"text":"I for one am tired of the Uzbek restaurant trend in Calgary, but grudgingly checked this place out anyway.  Just kidding, I'm pretty sure this is the first Uzbek restaurant in town, and it's great to have some new cuisine to add to the city's repertoire. Having never eaten Uzbek, I can't comment on the authenticity of the recipes, etc. but what I can tell you is that they have all the stuff Wikipedia lists under Uzbek dishes, and moreover, everything I had was really good.

The meal got off to an auspicious start with a trio of samsas, which are pastry dough in different shapes, stuffed with savoury fillings and topped with blackened sesame seeds. The potato was good, and the meat one delicious, with some offal flavour and lots of long cooked garlic and onion.  The real star was the pastry: flakey, golden and many-layered. It was their opening week so these were a steal at 3 for $5 for the opening special.

I tried to get the honim (a crescent dough mixed with meat, cabbage and other fillings), but it had been a very busy day for them and they'd run out. Instead, I got the chuchvara, a traditional dumpling soup. The 15 or so dumplings had the shape of large tortellini, and were filled with lamb (no pork as Ubzeks are largely muslim) and a good hit of caraway. The liquid was a slightly thickened tomato broth topped with a generous amount of parsley. Quite tasty, filling, and once again part of the $5 opening specials.

Finally, I had the lamb kabob. Served on a 2+ foot long metal skewer.  Kabobs can be dry and tough, but here the meat was moist and tender, slightly charred but still slightly pink in the middle and flavoured with coriander seed.  It was served with rice, which although plain was I must say very high quality long grain rice cooked perfectly (it is surpirising how many places get this wrong). Supposedly rice in various forms is essential to Uzbek cooking, and I look forward to coming back for more, especially for one of the incarnations of the national dish, plov.

Overall, the food was tasty, varied, and had some distinct spicing but without heat. The server was very nice but overworked due to the unexpected rush that day, and apologetic, discounting the meal even further. I'm sure as they get into the groove service will be quicker and they won't run out of items, so definitely check this place out for something different! Was wavering between a 4 and 5, but decided for 5 based on uniqueness of the offerings, good prices, earnestness of the staff, and those awesome samsas."}
{"text":"This restaurants food will feed you an a friend! So very delicious!  Leave room for desert and take leftovers home!"}
{"text":"Food made from scratch with love is what they serve here.  Simple ingredients prepared with thoughtfully balanced spices to produce flavours I've never tried before.  A healthy and hearty fare.  It was awesome.  The family running this restaurant  are warm, welcoming and very happy to tell you about their homeland.  It's a rare treat.  Like travelling there and having a local family invite you into their home.  Immerse yourself and explore a new culture without leaving Calgary!  We are definitely going back."}
{"text":"Great food, good service and super value for money. If you want to try something different, this is the place. Our 1st time trying Uzbek food and we will be back"}
{"text":"Great food and friendly staff. We were a party of seven and tried many things on thw menu. Beef kebab, Somsas, Chuchvara,  and a few things. Too bad that Manti (that we came for in the first place) are only available on Thursday. 

Holvaita for desert was definitely an acquired taste."}
{"text":"Amazing chicken kababs. Uzbek Osh was surprisingly good. Highly recommend this place."}
{"text":"The best food ever!!! Extremely hospitable service, outstanding taste!!! This is a brand new place, highly recommended!"}
{"text":"For clarity, this is not an Afghan, but an Uzbek restaurant (category reads afghan right now). 

Run by the most sincere and hardworking family, and the effort and integrity shows in the food. Nothing amiss, everything was perfection, and there is something to eat for every kind of picky eater, too. Definitely call for a reservation as its a small, beautiful dining room, and the line on busy days is right out the door (pretty much every day but Wednesday!)."}
{"text":"Very good cuisine, all freshly made in the kitchen, healthy and tasty. It's a big fat from the center but I strongly recommend it. Best foodI had in Calgary!"}
{"text":"This is a first Uzbekistani restaurant in Calgary and first me trying it too. The place is small and cute. People who are running the place are really nice and friendly . They welcomed us with big smile and made sure we were comfortable. Menu was short and lot of things were not served for lunch time or just that day so we were left with minimal choices. we got their sambosa which is very similar to east indian samosa only less spices and thicker dough.  Also got their dumpling soup, it looked good but there was no taste. No taste of salt, sweet or spice. So we were not sure what exactly it was suppose to taste like. Then for a main course we got their special rice with meat. Meat was very dry and so was rice."}
{"text":"Begim Uzbek is a tiny Uzbekistani restaurant located in an old house just off 17 Ave in Forest Lawn. Having never tried anything from Uzbekistan, I was excited to see what the native cuisine was like. 

The restaurant is run by a mother/daughter team. As they make everything (or at least most things) in house, the menu is small and every day there is a risk that some items will be out. Eager to try as much as possible, my dining guest and I shared the following dishes:

- Beef and lamb kebabs: the meat was chargrilled and served in the skewer accompanied by a salad with pepperoncini, olives, and a savory vinaigrette. The meat was rich but I had a hard time differentiating between the beef and lamb.

- Meat somsa: a cousin to an Indian samosa, the meat somsa is a large, triangular puff pastry filled with spiced meat and onions. The pastry was thick and rich and the meat was nicely spiced.

- Tok-osh: the highlight of the meal! The tok-osh is a platter of grape leaves stuffed with spiced ground meat and rice. These are served hot and dressed with diced tomatoes and a generous helping of cilantro. The filling was delightfully savory and the toppings added brightness to the dish

- Uzbek osh: spiced rice pilaf with lamb, carrots, raisins and chickpeas. I could have used a bit more spice to this, but otherwise very good. The chickpeas added a nice texture as they were on the crunchy side and the raisins offered  subtle sweetness.

- Honim: this dish is a casserole of sorts of julienned potatoes and onions, wrapped in pasta then steamed. A large slice of this is then served with raw onions, tomatoes, and parsley. Comprised mainly of potatoes and pasta, this dish is on the heavier side. I recommend sharing this dish, as 2 slices are too much for one person.

My one complaint about the dishes is that they were all fairly heavy with oil. With several of the items, excess oil pooled slightly under the dish.

All of the above was plenty for two people with large appetites as we brought a few portions home as leftovers. Total cost came to $42 before tip.

For what I perceived to be \"home-style\" Uzbekistani cuisine, definitely stop into Begim!"}
{"text":"The outside is really off putting and the neighbourhood is not great but don't let that deter you away! The food and service is really great! The decor is cultural and fun. Enjoyed this place a lot and would recommend to others"}
{"text":"You heard of Uzbekistan food? Yeah, me neither. That just means it's the perfect time to become acquainted with a new cuisine. Uzbek food is a mix of Asian, Persian, Middle Eastern and Russian. If you look up where Uzbekistan is, it'll make a lot more sense to you; it's linked to the Silk Road (the ancient trade route). Hence, all the different influences. I randomly stumbled upon this gem when I was looking up new places to try! They've only been open for a few months but it sounds like they're doing very well.

We came after my soccer match and we're the only ones there on a late Friday night. That meant some quality time chatting with the owners as we met the father and daughter who were doing double duty cooking and serving. So friendly and genuine. Apparently, they speak Russian, Turkish, English and who knows what else. Amazing!

We wanted to try everything on the menu but your best bet is to consult with them firsthand. Not everything is available as it is made fresh.

- Plain ayran ($3.00) - if you've never had this before, it'll take some getting used to. I see these all the time in Lebanese/Middle Eastern places. It's essentially a sour yogurt drink.
- Green tea teapot ($3.00) - they just received shipment of their teapot's straight from the motherland so we decided to try a pot of tea. No tea leaves in it as it's already been filtered. Smooth, aromatic and calming. We were able to all drink a couple cups.
- Honim ($4.99) - spiced potato and onions wrapped in pasta and steamed. The honim reminded me of potato latkes but obviously, not of the deep fried variety. Super tasty and a really generous portion. Love the use of parsley, green onion and dill. So much fresh herbs.
- 2x Dolma ($12.99) - stuffed peppers with beef, roasted potatoes, carrots and dill. The potatoes and carrots were incredibly tender. O absolutely loved this dish so we had to get a second round. These aren't on the regular menu. A little pricey for three but they were delicious.
- Chuchvara soup ($4.99) - essentially, dumpling soup. You get about 15 or so lamb filled dumplings. Again, love the use of dill here. The dumplings are small bite size but well made and homely. Same for the broth; reminds me of eating at grandma's place.
- 2x Osh ($6.99 each) - traditional Uzbek pilaff with rice, lamb, carrot and spices. This is Uzbek's national dish and it is delicious. It was originally only available during lunch but it was so popular, they changed it to all day. It was so tasty that we had to get another plate. That's pretty much a whole clump of roasted garlic on top! So much flavour, it's a must try.
- Achichuk ($2.50) - tomatoes, onion, basil and chili pepper. It's a traditional salad that you're supposed to eat with osh. The ingredients are so basic (just tomatoes and onions) but it's satisfyingly light and refreshing. Dill shows up again but it really enhances the salad.
- Begim ($4.99) - tomatoes, mushrooms, cucumbers, sweet pepper, pickles and mayo. I'm not sure how they came up with this combination and decided to make it into a salad. The pickles and cucumbers adds a nice crunchy element.
- Lamb kebab ($11.99 full) - we got two full orders of meat. The first one, lamb, was nicely grilled and well seasoned. Very reasonably priced too. If you were to get this at a Persian restaurant, it's waaaaay pricier.
- Chicken kebab ($11.99 full) - our second order of meat, chicken kebabs, was just as tasty. A blend of chicken wings and breasts. I was pleasantly surprised by how good these were. The whole platter also included a generous portion of raw swirly onions, side salad, olives and charred jalapeno peppers.
- Uzbek bread - our waitress asked us if we wanted to try some Uzbek bread. Silly question, of course we did. It turned out the bread was a bit bland and dry as I assume they made this earlier on in the day. But we didn't have to pay for it so that was a nice bonus.
- Chak chak ($2.50) - Uzbek crispy sweet dessert with honey and some nuts thrown on top for decoration. This is so similar to one of my dad's favourite Chinese desserts. Eat it with your hands.

Awesome introduction to Uzbek food. I can't come back fast enough to try the rest of their menu. Do me a favour and check 'em out."}
{"text":"Very flavorful, clean, and authentic. Super cozy, warm, and friendly. Can't wait to come back and have family and friends enjoy the experience!"}
{"text":"Authentic and yummy. Been inside, was ordering takeouts as well - never a problem.

Portion size is not just abundant, it is humongous! Menu may seem a bit on a brief side, but - again - is very authentic. Granted, one may have thrown in a pizza or a KD into the mix, but hey, why not to enjoy what's good for real?

One drawback for this place would be location - definitely not the nicest part of the city. Just maybe watch around for an occasional drive-by shootings, and don't leave your car unattended for too long...

Hmm just though, next time there I'd make it a take-out. Which is a pity, as the service was simply adorable - helpful and friendly.

Anyhow, highly recommended, if only for the food itself!"}
{"text":"Worst place to eat at . There is nothing authentic in this place . Wait times are about 45-1.5hrs and you will get half of all the food you order . STAY AWAY"}
{"text":"I came here with a group of 5 a few weeks ago.  I really like the decor but the place is small, so a group larger than 6 would be tough to accommodate.  Our sixth person actually couldn't make it, so It would have been very cozy, that's for sure.  Our table was completely full of plates as it was.  

Service was super friendly but very slow, so just understand that you need to be in dining mode rather than in a rush.  

The food was amazing and they serve the best green tea I've ever had.  I could have just eaten somsas and nothing else.  It's nice that the menu isn't large so choosing unfamiliar food is an easier task.  Dolma was my second favorite dish.  I didn't order desert for myself but sampled several kinds thanks to my friends.  Personally, I wasn't a fan of any of it and would skip desert here.  I'd definitely return though and recommend it."}
{"text":"The food is amazing. It takes a while to get it but well worth the wait. We were lucky that they had the meat dumplings which they only make on thursdays (even though we went on a friday). We also ordered the kababs- we tried chicken, beef and lamb. All were amazing but the chicken one was extra special. Dessert was ok. I would definitely recommend this for people looking to try a new cuisine. Similar to Afghan and Persian food. Service is great, slow but great- super friendly. One of the owners came out to explain to menu to us. My only suggestion to the restaurant would be that I wish all our food came out at the same time.  It felt weird when half of us had our dinner while the other half just waited."}
{"text":"Great place. It feels like you eat at home as the restaurant is converted from a house. Delicious meal friendly staff. I found it a little bit pricey."}
