{"text":"I called in an order here during their lunch hour (which is a cheaper menu and smaller portions). When I arrived I was charged for the dinner special and was told I had to be specific on the phone in regards to whether or not I wanted the lunch or dinner portions. Very dissatisfied."}
{"text":"This place has great food ,and is always tasty. If you're looking to fill up on lunch without spending the normal $10 bucks, you can easily fill up here for about $6. I recommend the boneless spare ribs."}
{"text":"The orange chicken was on the chewy side but had a decent taste, the pork fried rice was very bland, the pork egg roll was pretty damn good but very greasy.   I eat a lot and the combo plate filled me up, and was about what I expected to pay. The sanitation issues in this restaurant are remarkable, and I believe are the reasons I spent the next day on the toilet.  When I come into your business with money in hand I expect that at the very least you will welcome me. I am very choosy at where I spend my money, but am not hard to please, customer service is paramount. With that said due to my experience at this place, I doubt I will be back."}
{"text":"This is one of our go-to take out places. The food is always tasty, and fresh. Their delivery takes long sometimes, so if we're in a hurry we pick up instead. My favorite is the Mongolian beef and their Wonton soup."}
{"text":"2nd time here, now my last.  Just because you're  Chinese doesn't mean you should open a Chinese restaurant. 3rd rate food, DON'T  waste your money.  Plenty of other joints putting out much better food. Dried out, unappetizing, probably going to regret tomorrow  morning   !!! LOL"}
{"text":"We eat a lot of Chinese.  This is by far the worst Chinese food we've ever eaten.  I was very hungry and one bite of the General Tso's took my appetite right away.  It tasted like fried chicken drenched in ketchup. We also tried the vegetable plate.  Veggies were soaked in oil with no decernable seasoning. We also tried the seafood soup.  If you like imitation crab/other, this is your dish.  The broth of the soup was very well seasoned, but that was it. We didn't even try to eat the food, rather left and went to Sing Pandas."}
{"text":"Really good food that is hot and delicious. THIS IS NOT PANADA EXPRESS (Thank goodness) It was great not to consume corporate Chinese cuisine created by the not so skilful hands assisted by a corporate training manual. Beijing is different, you get cooked to order well prepared food, made by hands that actually give a damn. The food is ridiculously hot and well seasoned so you don't have to douse it with a quart of soy sauce, even the simple things are good, and you cant say that about alot of restaurants. The Egg rolls and the Wor wonton soup are simply fantastic, and my must pick up when i get under the whether. The decor is simplistic, the food is good, and they are priced pretty good, can you ask for more?"}
{"text":"Luv it here! Just a tip tho cuz they so busy all da time. Order when u get there and not ahead of time.  Had a cold, almost tasted old dish one time.  Easy fix cuz jus order and wait....play some zynga poker choohoo!"}
{"text":"Their fried rice is the best I've ever had! Take out is ready in 10 minutes. Courteous staff."}
{"text":"Food used to be better definitely has gone down hill. Service could be better the only nice clerk is Adrian"}
{"text":"1st time& other Chinese rest. didn't seem worth while So I ordered the sesame chicken & general tao with fried rice. My only problem was I expected the general to have a bite to it. I normally need a glass of water right by me. It wasn't the case so I will return and try something else. The large size is made for 2 people!!!!"}
{"text":"Great food here.  Ordered the Singapore Chow Mei Fun with no meat add Tofu.  It was excellent along with the Veggie Fried rice with no egg.  It definitely hit the spot and is some of the best tasting chinese food in the valley."}
{"text":"I don't write reviews much, although I should - because this place deserves a great review.   We've been in the valley a few years, tried many places, NONE of them as good as this one.   Great food, great service, fast delivery - some of the best crab rangoon you'll ever try.   Good NYC style Chinese."}
{"text":"I was born and raised in NYC. This place reminds me of takeout places back home. I have been a customer for a couple years now and will continue to be. By far the best Chinese takeout food in the area."}
{"text":"I've been living in the valley for 3 years now and I love everything about this place, except the Chinese food!  I have been nothing but disappointed up to this point.  Everyone claims to have NYC Chinese and none of it is even close.  I just happen to be in chandler and happen to stop by this place.  It was a toss up between the safe bet (the bbq spot next door) and this joint.  After carful thought I decided to give this place a try.    Everything about the inside reminded me of home but I need to try the food to be sure.  I ordered the basics; shrimp fried rice, orange chicken, and beef and broccoli.  To my surprise, the food resembled NYC Chinese food!  The orange chicken looked normal, not like sweet and sour chicken balls.  The sauce had orange peals and red chili peppers.  Could this be?  Is this the real deal? I've learned to inspect and taste the food before I leave.  I'm happy to say that after one small bite I was blown away.  I took one bite and was back in Brooklyn at the So Good Chinese Carry out.  This is hands down the best Chinese food in town, so good that I drive 40 miles to chandler once a week to get a taste of NYC.    If your from the east coast and love NY style Chinese food, this is the place to get it.  NO WHERE  in the Valley can come close to this place, I want them to open more locations around the valley!"}
{"text":"I have been here several times and LOVE it!! Ordering delivery for the first time. Took my son who is a HUGE guy (football) player and he consumed every single piece of rice on his plate! Am a big fan of this place."}
{"text":"Since my move from NY I've always had trouble finding good Chinese joints. Just a little place for a quick pick up. I'm glad I came across this little nugget. The food tastes great and you cannot find a better lunch special!"}
{"text":"Yummy!  Just moved to the area and got it delivered since I had a long day.  My youngest son will be so happy I found a Chinese place close by.  The food was fresh and a huge portion, especially the soup. My order was delivered before promised as well. Oh and reusable containers :)"}
{"text":"Everything tasted like it was cooked in a crock pot, everything is bery stewy.  Very disappointed"}
{"text":"Great food!, unfortunately I would highly recommend the staff need personality, smiling, greeting, Customer service training. I have been there several times a week for 4 months but not even once I was greeted or thanked. They are straight out rude when you even try asking them a question or when your ordering. Sad!"}
{"text":"Best chicken fried rice in the Valley...as long as you opt to pay the extra two bucks for extra chicken.  Unlike most Chinese places, they thankfully don't put carrots, peas, etc in the fried rice.  I usually prefer Vietnamese fried rice, but this place is a clear exception to that."}
{"text":"The service is pretty rude, but the food is very good. The garlic chicken and fried rice is always a favorite for us. Every time we have called, however the people on the other end have never been pleasant, to say the least. Honestly, it's a good thing their food is so good, otherwise we would have moved on after the first go around."}
{"text":"Pretty darn good, it's hard to find good Chinese food in arizona.  I think a previous review of this restaurant from another user hit the nail on the head when they called it New York sttyle Chinese food"}
{"text":"Great food, friendly people BUT, they have removed the CHOW MEIN menu??!! Very confusing to order that now? Ples put the CHOW MEIN menu back in!"}
{"text":"This place has a pretty extensive menu for just $4.99 however, I ordered the Kung Pao Chicken and it was sooo flavorless!  The egg roll was way greasy and the fried rice was kind of hard.  I won't be back and that's for sure."}
{"text":"This place used to be a lot better than it is now.  You have to search for the pork in the pork fried rice.  If you actually want a decent amount you have to pay extra.  The boneless ribs used to be excellent but now they are very fatty.  The staff at the front counter is rude and needs some lessons in customer service.  I phoned in an order a few days ago.  The girl who answered the phone and took the order said $6.43 pick up in 15 minutes and hung up (no thank you).  When I went to pick my order up she was texting and gave me an annoyed look because she was interrupted.  I gave her my credit card, she swiped it, turned her screen around for me to sign and went back to her texting.  The screen said \"error\".  I said to her \"the screen says error\" but she kept right on texting and ignored me.  I said \"HELLO the screen says error\".  She gave me another annoyed look, fixed the problem and went right back to her texting without so much as a thank you when I left with my food."}
{"text":"Good food at a reasonable price.  Can't beat the lunch specials and have always found the meats are of very good quality."}
{"text":"Beijing is good, nothing real special about it but the good lunch prices. I honestly have never eaten there for dinner simply because I don't feel like it's worth the whole price. I do like the people though, their usually pretty friendly and give me a 10% discount for working in the complex."}
{"text":"Beware- the prices on the yelp menu are probably at least 5 years old, if not more. When I picked up my order the total was almost double what I expected to pay based on the prices on the yelp menu. The food is ok and was ready quick. There are better places around."}
{"text":"I love this place I've been eating here for over two years they do delivery all the time for us they are fast and the food always comes hot the spareribs are to die for and I like to eat clean and they cook my food the way I want with the sauce on the side to me this is a five-star Chinese restaurant"}
{"text":"What kind of restaurant doesn't have ice tea? You make hot tea....put ice in it....then you have ice tea. Put it large drink container."}
{"text":"Took my family there because people had recommended it to me; note to oneself...\"TAKE OUT\"...not dine in! The food was good overall...fried rice was a bit dry and not as flavorful as I would have expected for house fried rice, general tso's chicken was nice and the sticky white rice was good. It deserves another try because it was good!"}
{"text":"Beijing is our go to place for tastiest and fastest Chinese food in Chandler Area.  We have been ordering from Beijing in Chandler for over an year and half now.  Food is consistently good. They have the fastest and cheapest delivery service too. We always order Delivery and it comes in less than 20 minutes.  Its not a fancy place to go sit and dine , but if you are looking for Tasty and not so greasy Chinese food - Beijing is your answer.  Their Vegetable Fried Rice is Yummy and their Curry Chicken is to Die for.  Curry chicken is something we always order and it is delicious every single time.  They now have an APP too where our order can be stored and repeated with a click of a button or two."}
{"text":"omg!  food not bad, good egg drop soup, but dayum, they sure are rude here.  i walked in with a friend, all staff ignored me until a lady came over and says \"wat u want\"   not a please or a thank you...if you can put with the fact that this place treats you like thye are doing you a favor by serving you, by alll means, stop on by !  ps, food served on paper plates"}
{"text":"I've been going here for years and their food is the only reason I go. They suck at customer service and cannot understand you well. I went in today for lunch Togo and ordered 4 orders of crab ragoons and they thought I said four crab ragoons. When I got home and found a half order of it instead of four I was upset. I called them And got three orders and they expected me to pay and when I said no it's their fault they refused to do anything about it. I'm extremely disappointed in this restaurant and wish I could say it's been a better experience."}
{"text":"I might have given them another half-star if that were possible, because the quality of my cashew chicken and beef with broccoli entrees was very good with fresh ingredients, but the internet ordering and appetizer experiences were profoundly disappointing. I found this restaurant as the result of a Maricopa County-wide search for COLD SPICED SESAME NOODLES, a staple appetizer of all Chinese restaurants in the New York metro area that is next to impossible to find in Arizona. Well, I do give this place some credit for trying to make it. Unfortunately, they make it very poorly. The sauce is too thick, dry and dark and lacks sesame flavor. The worst is their egg rolls. I've yet to see an egg roll in Arizona that is HALF the size or quality of egg rolls in the northeast, but this place has the most sorry-ass looking over-fried grease-turd excuse for egg rolls in Arizona. Now if they fixed their INTERNET SERVER so that it wasn't excrutiatingly slow as molasses, I would give them points for an excellent website design that really allows a highly customized selection of their menu items. As it stands, their website will drive you insane because it takes forever to render content."}
{"text":"Definitely more of a takeout place. We dined in.... paper plates, plastic utensils. That would've been ok; if the food had been outstanding.... we weren't impressed. The egg drop soup looked like a bowl of grease. My Orange chicken was dry. The crab Rangoons however were very good!  Very doubtful we'll be back."}
{"text":"Tried this place a few times definitely a hit or miss. Feel like when you walk in and order you get better/fresher food. The sweet and sour chicken is burnt 90% of the time. Their vegtable fried rice was good. Chewy chicken and clumpy sauce though...that's when I just throw it out, and don't go back."}
{"text":"This place is great for takeout or delivery. I order from here often and highly recommend. The food is ready fast and delivery is even faster."}
{"text":"Better experience the second time around! The girl answering phones and working the front counter spoke English and was very helpful. It's a busy place because the food is consistently good."}
{"text":"Best Chinese in the East Valley.  Fresh ingredient, the friendliest service, speedy delivery, it just ticks all the boxes. I personally can't get enough of their chow-fun but the house specials in the middle of the menu are all great, really not a single bad dish.  For the quality price is very competitive and they have great catering and lunch pricing if you are looking for something fresh yet frugal.   Now, my five stars are based on my own tastes, which I will admit are very Americanized. This is not the most authentic Asian diner, so if you're looking for a true taste of China you might look elsehwere, but if you're looking for a true taste of Chinatown make the call."}
{"text":"Super yummy general tso's chicken! Nice people there as well."}
{"text":"Very much like the Chinese takeout I remember from NY. Many dishes available as pints or quarts - nice when you want to try a couple different things inexpensively.   Beef and snow peas: tender beef, mostly crisp snow peas, bland sauce (where's the ginger and garlic?). Shrimp and veg: big shrimp, mostly crisp veg, bland sauce (brown sauce, not the light sauce you'd get on shrimp in a Cantonese place). Sauces were oily, which surely contributed to the blandness. Egg roll was delicious. Chicken fried rice had thin tender strips of what looked like white meat chicken, bean sprouts, and onion -- no peas and carrots (hooray! finally a place that doesn't load up the fried rice with P&C!).  All in all, if they'd punch up the flavor in the sauces, this place would be very good. I'd go back for the egg rolls and fried rice."}
{"text":"In order for any restaurant to receive a 5-star review from me it needs to have four major components covered,   -Good, friendly service -GREAT food -Consistency -Reasonable prices  Beijing has got all of these easily covered...I was introduced to Beijing just over a year ago and will not consider any other place when looking for good Chinese food. Consistent with most restaurants in NYC, this \"New York\" style Chinese restaurants sits in a little hole in the wall that you'd drive right past if you weren't looking. Do not let their appearance dissuade you. This place is legit!!   With lunch combos at $5.75 and dinner combos at $8.00 you're getting your money's worth...The fried rice is actual fried rice, not the white rice mixed with peas and scrambled eggs that get at most Chinese joints in AZ. Comparing Beijing to a place like Panda Express is like comparing McDonald's your favorite burger spot. (Unless McDonald's is your favorite burger spot, and if that's the case, what are you doing on Yelp in the first place?) It's hard to name a \"favorite dish\" when everything is so good, but I can at least list some of my most ordered items...For appetizers, the boneless spare ribs and the pan fried meat dumplings are amazing. If you're looking for a \"heavier\" item (and like peanuts sauces) The Szechuan Dumplings are incredible.  Entrees, there's too many to name...Chicken in Garlic sauce, Szechuan Chicken, Mongolian beef, Boneless Spare ribs (entree) just to name a few...I've literally not had a bad meal...  Place is always busy, so there's no fear of it going out of business anytime soon...Go find out why!"}
{"text":"Pretty good Chinese food for the west valley. This has became our standby since our favorite went out of business early this year. I would not hesitate to recommend this place and we'll be back for sure."}
{"text":"Hubby and I are pretty satisfied with the food we've been getting from this place.  It just about one of the only 'delivery/take-out/dine-in' fast chinese food place in this part of town, so we were hesitant it would be any good.. .turns out it is!  We've had it in the past (like over 4 years ago) but I can't say I recall how it was but recently were craving chinese food delivery and got it already a few times in the past 3 weeks and I gotta say that it is top of our list for to-go/delivery food.  Here's what I've ordered: \"Weight Watchers\" - aka steamed - veggies and shrimp and was impressed with the soft shrimp (not over-cooked) and the bright, fresh-tasting and crispy broccoli and other veggies... plus the portion was huuuuge.   Hubby had a pork dish (don't recall) but he really enjoyed it and neither of us had that gross feeling afterwards (typical of greasy fast chinese food). I got the cashew chicken the next time and I had 2.5 meals out of it!  The chicken was soft (how?? not sure) and the sauce was not overly sweet and there were plenty of cashews and bright, crispy veggies.  Seriously, we're impressed... hope they keep it up so we can continue getting delivery and to-go.  BTW - I've never eaten-in, so I have no clue about the decor, cleanliness, etc... sorry."}
{"text":"The reason this has 4 stars is because the food was excellent. I was surprised how delicious it was. I got the lunch special which is a great deal, only $5.75 and you get a lot of food. I got Orange Chicken, Pork Fried Rice, and an Egg Roll. However, the service was poor, the man who served me when I came in was practically silent with no people skills. And when you go into the restaurant you kind of immediately get lost because there is no clear menu or anything to direct your attention. Also, the food was served to me on a paper plate... So that was a little weird. I know these are small details, but they make a big difference. Other than that the food was super great, and an awesome value for what I paid. Would totally eat here again."}
{"text":"My husband and I ate here for the 1st time today and we'll definitely be going back. The portions were large and the food was delicious! Not the most aesthetically appealing place to sit down and eat, but I'm there for the food!"}
{"text":"This place is alright. Not really something to blow my socks off. Probably would've given it 3 or 4 stars but found a hair in our food. Please check your food before eating it."}
{"text":"I have ordered from here many times, service has never been great but food was ok. Until today. I ordered orange chicken which is usually amazing but today there was a problem with it and I called to complain. The lady who took my call was so rude that she even hung up on me. She insisted on picking up the remaining food in order to get a refund. Won't be going back ever again."}
{"text":"We've done both take out and delivery from here.  Both have been good experiences. I think the piece that makes this place really stand out is the appetizers. Their dumplings are so good. They seem to be homemade and not the bulk frozen kind. I enjoy the crab rangoon also. Spring rolls and egg rolls are also very good. I am still working on finding a favorite main dish but the dumplings keep me coming back for more!"}
{"text":"Not a big fan of this place. I was looking for some good old Northern Chinese food. I think everything here is a little off. The beef noodles were very bland and the rest of the dishes didn't have much flavour. The tea is very watered-down.  There also isn't much service either. You need to constantly flag them down for tea and napkins even when the restaurant is not busy.   The only positive is that the restaurant is in a fairly convenient location. If for some crazy reason my friends want to eat here, I would come back, but I would never return on my own."}
{"text":"I'm sorry I have no idea why they say they do Chinese food NY style! The food was bland at best. We ordered the sweet n sour pork and it was too sweet no sour. The orange beef was soggy, and finally the general Tso chicken had no spice or flavor to it. Please stop saying you're serving NY style Chinese food it's just embarrassing! Yes I'm from NY"}
{"text":"I think the ownership changed in the last 3 months or so. The food is good but the portions have gotten smaller. The layout of the front cashier area is different too. Whatever was working before is missing now. I wonder what brought about the changes."}
{"text":"We have ordered from this restaurant multiple times and I would say this was your run of the mill Chinese restaurant. Nothing great and nothing terrible.   Overall, it's pretty average. However, the one item I do not like is the lack of consistency. Often, the food is either really salty or really bland. I have no idea what goes on there."}
{"text":"I've been a long time customer, and although, I haven't ordered in awhile, they were usually pretty consistent.  Not sure if the staff/management has changed since my last order, but the food here was completely flavorless.  The chicken fried rice was dry and had a funny odor as if the rice was old.  It looked like \"brown rice\" and they threw in chopped chicken as an afterthought. The lo mein was extremely dry.  Now, not to say I like super oily noodles, but you don't expect the noodles to stick together.  The eggroll, even though it's just an extra that's thrown in for the combo, was inedible.  My family and I were very disappointed and will not order from here again."}
{"text":"Great for hole in the wall Chinese restaurant slightly bias as i really do like them.  Lunch is great you pay very little for a lot of food.  I have two bowls and a huge plat for 6$!!  Ever place like this i grade the pork fried rice. And this place does it right"}
{"text":"As others have mentioned, this is essentially the same as La Mere (with a better layout inside)  I loved the food at la mere and I really like this place too. In particular, Lamb noodle soup: this is one of my default orders at noodle places, and I really like the one here. The noodles at some other locations are probably better, but this one has a great combination of flavors.   Lamb pancakes: really tasty   Pork house specialty: pork is really tender  and delicious. This dish is great value too.   Dumplings are decent. Better at other places, but not bad     Cash only"}
{"text":"It's been a long time since I have eaten here. The service is prompt yet cold.  The food though is good. It's New York Cantonese. Not quite as good as Chicago but close.  I always get a combination meal as it's always a pretty good value.  Today I  had the Shrimp wit Garlic Sauce.   5 or 6 good sized shrimp and a good mix of vegetables.  I was not disappointed.  I had the BBQ Pork Fried rice which is also better than average. As one other person put it. no carrots or peas. It should be scallions and bean sprouts. There were scallion but no sprouts.  The egg roll is not great but no worse than any other Chinese place in AZ.  We also had the szechuan dumplings. They were ok. basically steamed won tons with a peanut sauce. I prefer their potstickers.  Their best deals are lunch specials. Pretty much the same thing you get at dinner but $6 instead of $9."}
{"text":"Don't use their online ordering system!  Doesn't work or get your order right. Then they put onions in everything even add on fried rice, when I asked for none gross! I got sweet and sour chicken when I ordered Kung Po.  We may try them again, not sure at this point.  Sweet and sour chicken was very bad, like little balls of leather. Kung Po would have been so much better...that's why I ordered it :)"}
{"text":"I've ordered from them now 4 times over the past 2 years.  Each time the food is GREAT and the price is reasonable.  I appreciate them."}
{"text":"This is my favorite quick go to place for a take out. The food is very tasty and hasn't changed over the years. The prices are very reasonable and you get a good portion size for the price you pay. I normally get their home style tofu dish with garlic sauce. Their combo dishes come with soup and fried rice. Its not a fancy restaurant but a small place with a few tables and it's always busy with to go orders piled up. You can normally call ahead and by the time you get there your food will be ready. I would highly recommend folks to try this place!"}
{"text":"Typical run of the mill chinese, that's it.   I don't really have a problem with the food or restaurant itself, just the staff. Mainly the young guys that work there. Call me crazy but when someone is working in a public restaurant setting and they are wearing a hat that says \"F U C K\" on it, that doesn't exactly say class or professionalism. It says this employee should be fired. Seriously have some shred of decency and present yourself like an adult. Wearing shirts and hats that say F.U.C.K. and other choice words is for punks with no sense, it's pathetic okay. I won't be back because frankly that low quality of character is not worth supporting."}
{"text":"We ordered shrimp egg rolls and shrimp  fried rice. Egg rolls were greasy. Customer service was horrible. They watched me the whole time like a hawk. The plastic utensils were minimal and cheap. I am from the east coast and I don't think it's nothing like NY. Will never go  again. They don't appreciate my hard earned money."}
{"text":"Since leaving NY in 2010, I haven't seen Chinese food that compares. The Chinese food in Arizona is weirdly breaded and soggy, and anything close to good is Panda Express (not my first choice, ever). When seeing reviews for this place and there were mentions of \"NY Style,\" I saw a glimmer of hope that all was not lost. I wasn't let down.  BEST CRAB WON-TONS! They were crunchy and there was more cheese/crab in them than I've seen in a long time. Plus you get eight, which is quite a lot for an appetizer. The sesame chicken and orange chicken were both crunchy and full of flavor...and exactly like I remember from restaurants back home. I have yet to try the fried rice, but the white rice was cooked to perfection. You have to specifically ask for the fried rice otherwise they will automatically give you white, which is the only reason I went that route. I don't regret it, it was a good option!  The inside is very small, with only ~4 tables for people to sit at, so I would recommend take-out and eating at home. They were also very busy, but the food was out quickly and everyone was in a good mood that I talked to.  I will definitely be going back, and trying the fried rice this time."}
{"text":"This is by far my favorite place to get Chinese food.  When I order their take-out, the food arrives in under 30 minutes, and I've never had them mess up a single order.  The menu is pretty standard for the type of food that it is, but I personally find that most of the items are cooked with much more flavor than at some asian places.  The garlic green bean chicken and fried dumplings are two of my favorites, along with the rest of my family's.  I didn't expect much out of this place the first time around, but I was pleasantly surprised!"}
{"text":"Really good and cheap new york style chinese. My last favorite chinese place closed down, so for about 2 years I didn't have a chinese place I liked. I don't live near here, but I work nearby, so I tried it one day at lunch and I've been hooked ever since. Since I'm not aware of a good chinese place by my house, I'll sometimes stop here on the way home from work for takeout.   I'm a seafood fan and so I mostly get their shrimp dishes since their shrimps are large and generously portioned. Veggies are varied, fresh and plentiful.   The prices are so cheap that if you live in the area, you really should check them out.  PS - they have a website now!"}
{"text":"Walnut shrimp was good. Sesame chicken was over-fried orange chicken with sesame seeds sprinkled over them. Noodles were too dry with not enough gravy & too salty. Don't recommend eating there."}
{"text":"Beijing is one of the best Chinese take out places I've ever been to. It is not only delicious Chinese food, but they deliver in an extremely quick manner. Their prices are also pretty fair. I used to live 1 mile from them and would order on a regular basis. When I moved, I was sad when I realized I would have to find a new delivery place. I drove over to them one day and was told that they would deliver to my new location which was 8 miles away! Most delivery places do not go that far out of their zone. I was so thrilled. An amazing staff, amazing food. I haven't ordered from any other place since."}
{"text":"We love this place. It's awesome delivery service. We have eaten here for 3+ years and the food is always very good, especially for the prices. When we order, they always tell us about 30 min for delivery but then show up in 20 min with very HOT food. The restaurant itself is not anything pretty or nice. If you can look past cosmetics, you will enjoy the food."}
{"text":"You eat off of paper plates! Food is below average and customer service is non existent."}
{"text":"One of my favorite places.  I am Asian, so I have high standards when it comes to eating Asian food. This places makes authentic dishes. Everything is hand made, even their wontons. I always leave satisfied and full.  Don't be fooled by its looks. This place really gives top notch Chinese food a run for its money   They even have quite decent prices!"}
{"text":"We have gotten take out from here a few times already.  Their lunch specials are $5.75 ($6.50 for shrimp)...they are very good.  I highly recommend their Chow Fun Noodles this is not on the lunch special menu but very good.  Service was okay...they weren't personable but not rude."}
{"text":"1) I walked in this dingy little place and approached the counter. Glanced at the menu for a moment and was ready to order. The woman behind the counter seemed utterly indifferent to the fact that a customer was standing right in front of her. \"Ahem... I'd like to order some food.\" I ordered, paid and sat down at one of the paltry tables. (This place obviously specializes in take-out.) 2) The surly guy who stood in the kitchen sneered, then began cooking my order. He later served it to me as if I were a convict in a prison cafeteria line.  3) The food itself, which was supposed to be *sesame* chicken but looked like sweet and sour (*red* sauce?), wasn't the worst Chinese I've ever had, but it was darn close.   That's three strikes. You're out, Beijing."}
{"text":"My favorite hole in the wall.  If you are looking for great NYC style Chinese food, then this is the place. The lunch special is a bargain."}
{"text":"I LOVE LOVE LOVE this place! I'm eating my chinese leftovers from last night as I write this... For a traditional chinese delivery place, I think this is about as good as it gets in Phoenix. They deliver quickly and the food is always delicious. Things that I've tried that I like include the Kung Pao Chicken, Chicken with Cashew Nuts (Kung Pao is better though) and the Sesame Chicken. I'd recommend getting the combo platter that comes with fried rice and an egg roll (I substitute and get a spring roll in its place - they're really good). Very reasonable prices, most meals are around $7-$8. Give them a shot!"}
{"text":"Their Chinese food is pretty yummy.  This is our favorite place for delivery.  They give you a new scroll menu each year which is handy when you want to order out.  We like the chicken curry and the crab rangoon.  If you want to order it extra spicy, they can make it really, really spicy which we love.    Food is really fresh and the meat is good!"}
{"text":"Best Chinese in the area.  Basic little hole in the wall but great variety, service, and flavor!"}
{"text":"Was driving around looking for a Chinese take out place that looks good.  Saw this place on yelp and decided to try it out!  My background: I am half Taiwanese. I was born in Hong Kong and was raised by my 100% Taiwanese mother. I know how to cook authentic Chinese dishes and have high expectations when it comes to take out.  I got the hot and sour soup and cashew chicken dish.  ITS SOOOO GOOD!!! This is one of the better places that I have been to. And the staff is actually Chinese and speak Cantonese as well"}
{"text":"Worst Chinese food I have ever eaten.  This place is dirty and the food was bland.  They served basamati rice instead of regular rice.  I would never eat here again."}
{"text":"Great food at a great price.  Perfect Chinese Restaurant for take out or delivery.  Not a good place to eat in, as this Restaurant is not designed for that."}
{"text":"Always top totch service when we order delivery or in house at this lovely place. They are authentic new York, Asian cusinie peeps! Not sure what all these terrible reviews are personally I'm offended and think these peeps have something wrong with there taste buds lol ! So yelp reviewers don't listen we have been eating religiously at Bejing for over 10 years. We always get our food to us extremly fast when we get delivery and have never had an order wrong once, nwver gotten sick, food always been piping hot , perfect order, taste perfect. Faimlys  mostly from the east coast and hard to please so that is saying allot. If your looking for a go to Chinese place that will NEVER disappoint this is your place! So yelp readers and reviewers don't be haters to this place because they do go above and beyond and if you know anything about what it's like to run a business its not easy and they rock it!  Things that are KILLER and must try on the menu that my faimly loves!! SPARE RIBS AWESOME MUST TRY CRAB RAGROONS  GENERAL TSO''S CHX, BEEF ,SHRIMP LO MEIN ( ANY ) PORK FRIED RICE ALL THE SOUPS  PRETTY MUCH EVERYTHING ON THE MENU Hope this was helpful WERE LOOKING FWD TO OUR DINNER TONIGHT IM HAVEING BEEF AND SHRIMP W FRIED RICE AND HOT AND SOUR SOUP THX STAFF AT BEIJING !!!"}
{"text":"Would not recommend, customer service is huge in my eyes and this place was disappointing.  Poor customer service, the cashier was awful and wouldn't make eye contact, did not hand me my receipt so I had to grab it off the register myself and did not want to help me decide what to order. I ended up ordering the house lo mein and paid 10 bucks for a tiny box of noodles that ended up being extremely dry. This was my first time here and will definitely be my last."}
{"text":"I am in Phoenix (Chandler) visiting a friend and doing some business so everything here is new to me. I found this place through yelp and I am so thankful for yelp's reviews to guide me to the great places that this city has to offer.   Beijing Restaurant is great! better for takeout (not alot of seating or atomosphere) but the food is really great and well priced.   Here are the foods that we've tried so far and loved them all: Crab Rangoon(8)  3.75 - Just Plain YUMMY! Cold Noodles with Hot Sesame Sauce  4.50 -Just as good the next day cold and huge portion! The Generals chicken and Mongolian beef are great and just the right amount of spice for my taste (which is a little bit of heat overall with an occasional zing of hot pepper that takes you by surprise and sends you running to the kitchen for water. Perfect! :)  The interactive menu doesn't always work for me, which is a little disappointing, but that could be a browser conflict and there is a PDF menu download that resolves that problem so it really isnt much of a problem at all.   I look forward to trying many of the other tasty looking dishes on the menu and I imagine that this is going to become one of my favorite places for takeout during my stay here in Chandler.   Highly reccomended."}
{"text":"This area has an abundance of restaurants. Choosing one can be pretty overwhelming. I mostly chose this place because of the potsticker picture on the window outside lol.   My bf and I were hungry but not starving so we shared wonton in chicken broth, beef pancake, and cucumber and garlic in soya sauce. The cucumber dish is cold and came out first. Cold cucumber is refreshing, especially on a hot summer evening. Anything in soya sauce and sesame tastes good so this dish tastes as expected.  The chicken broth for wonton is very mild and light, as most flavour comes from the wonton itself. I thought the dish was average but my bf liked the wontons.  The beef pancake took the longest to be served and came out piping hot. It was crispy, had the right amount of meat to dough ratio, and the best tasting dish of all the ones we ordered. Just writing this review makes me want to go back for the pancakes!   I'll definitely come back to try other dishes."}
{"text":"I am just ahh soo impressed with the random little find. $4.99 lunch specials, good portion size, no charge extras and the most durable to go containers I have ever seen.  It was a hot day of moving rock and laying pavers at my friends house when the question for lunch came up. Some how Chinese became the idea on the table. After a quick search on yelp we found a place but a mile away from where we were toiling.  Their website featured their full menu which is allays nice. I ordered the lunch special home style tofu with brown rice. It was a great mix of rim well textured tofu, crisp vegetables a light brown sauce and a few red chillies. It could have been spicier but not bad. You get a choice of a side, egg roll, or one of many soups, (I don't think any of the options are meat free however,) or a drink.  It was great to see that brown and fried rice were the same price as the white.   Note there are a few meat free dishes on the lunch special menu, a real plus.  If you work in this area or are looking for a cheap good dinner, give the place a try, I sure which I had one of these near my office"}
{"text":"I will occasionally grab lunch here; which I did today. Their 4.99 lunch specials are great. There are over 20 items to choose from and it comes with rice (white, fried or brown) and a choice of either an eggroll, fountain drink or soup (egg drop, wonton or hot & sour).   My favorite is the General Tso's chicken, but I'll only order that if I have time to dine in. Otherwise, by the time you get to your destination the chicken is not crispy anymore. Especially since they put it in those plastic bowls that seals it shut.  Today, I had the beef lo mein. There was a good amount of beef it in and the dish wasn't too salty as most places would serve. One thing I found odd was that it also came with a side of rice beneath. I mean the menu stated that all lunch specials include rice but usually when you order a noodle dish at an asian joint, that does not apply. No worries, I ate all the noodles off the top and tossed the rice. The noodles alone was plenty."}
{"text":"This review was meant for Beijing Express not Beijing Restaurant. I pass this place on my way home from work and decided to try it, after reading reviews on Yelp naturally. Took it to go. I can't tell you how many places I've tried to find what I think of as good egg foo young and egg rolls. I'm originally from the Midwest and the Chinese food is done differently back there. I have to say this is the best egg foo young and egg rolls I've had since moving to AZ.  We also had fried shrimp, beef in garlic sauce and beef lo mein. All of which my husband loved. Beef fried rice was a little dry.  Other then that we were very pleased.  The staff was very pleasant. Will definitely go back. Also we got a free lite of soda with our order."}
{"text":"I came here for dinner. The price was decent and the food's pretty good. I had chicken \"lo mien\", which I was surprised to see on the menu. This seems to serve more take-outs than sit-ins. I wouldn't bring a date here though, but for a quick bite, this place does it."}
{"text":"We were very hungry for Chinese tonight and had driven by this restaurant for years so we finally decided to try it. Looked at the menu, called to order (the guy on the phone was rude and seemed like we were wasting his time) and went to pick it up. The lady at the counter said that the prices were higher than they had listed because they changed their prices. Weird. Paid anyway because we were super hungry.   I got shrimp with lobster sauce which I cannot believe anyone could even eat. It was shrimp in a soup tub of congealed clear goo. I've never seen lobster sauce clear. And I'm asian. There was absolutely no flavor. When I'm hungry, everything is usually delicious. Not this time. Not for almost $11 for this dish alone.   My friend got lemon chicken which I tried a piece of it. It came with a container of jelly again. The chicken was kinda like katsu chicken, but so flat that i wasn't too sure if there was any chicken. Just breading. So disappointed.   The rice was the only thing edible. The lady at the counter looked like she was the owner and couldn't care any less so we just threw the food away instead of calling. Stay away from this place!"}
{"text":"I ordered take out from here yesterday and I did the Mongolian beef (special combo) comes with rice/soup of choice for the boyfriend. Meanwhile, I ordered the beef chow mein (special combo). We both chose wonton soup.  Kudos on the speedy delivery however; there were no silverware or napkins and no crispy wontons. Who does that? The crispy wontons are like oyster crackers to clam chowder. With me being on crutches, I was very disappointed. That meant I had to hobble to put the stuff down, paper bag was leaking had to try to hurry to toss that in the trash, then go grab silverware and napkins.  Good news is that the boyfriend approved on the Mongolian beef spiciest he's ever had! My noodles were very bland and dry. Wouldn't recommend at all.  The wonton soup was pretty good. Could've been better with the crisps. Overall, try it out !"}
{"text":"I'm constantly pleased by the quality of food coming from here, and am never let down when it comes to service. As a tip, if you place your order \"to go\", make sure you keep the containers as they are quite durable and reusable to take your lunch to work in. As for the amount of food you receive, I bet you can always have 1/2 or a little less left over for another meal 90% of the time."}
{"text":"Had the very unfortunate instance to try this place for the first time last evening.  I had been to the little Deli next door so decided to try some takeout.  Ordered the pan fried dumplings, pork fried rice, and Moo Shu chicken, bill was almost $30.  Arrive home and was excited to try the offering.  Opened the dumplings and found (6) soggy shriveled blobs of greasy nothingness, the meat gob inside had an indescribable \"taste\". Opened the \"Pork\" fried rice but to describe this as a protein dish would insult the pig, in a small order there was maybe 10 minuet pieces of BBQ pork, and drenched in the most tasteless brown sauce ever.  NOW we get to the MOO SHU CHICKEN, this abomination was so \"nothing\" that the only thing that had any flavor was the \"pancakes\" that you used to wrap it in.  Once again to call this a protein dish is to insult the chicken, the meat was tiny slivers and mixed in what appeared to be a diced and sliced mixture of greasy lettuce and cabbage and drenched in the that \"famous brown sauce\".   I contacted the restaurant and asked to speak to the owner/manager and was transferred to a female who advised me she was the manager, i told her how terrible the food was and that it was uneatable and I wanted my money back.  She responded that if i wanted my money back i would have to bring back the food to insure that we hadn't eaten it.  She didn't try and offer a replacement or even suggest that this might be an anomaly that evening and they would like to keep us as a customer.  Since all of the containers had been opened i deposited every single morsel in the brown bag it came in and took it back to the Manager, she wouldn't even talk with us and had someone else handle the return. I have seen other low ratings and given my experience in this business it may not be long term.  I will take my business elsewhere. :("}
{"text":"WE had lunch here because we were in the neighborhood.  Not really our part of town.  We had the $5.75 lunch special, there were 35 choices available!  The restaurant is next door to Chandler BBQ and a nail shop in the Fry's strip mall.  It had half dozen tables but did a bang up take out business.  The place was very clean and the padded chairs were comfortable.  You help yourself to plastic tableware and your cold drinks, straws and fortune cookies.  A similar but much better restaurant would be The Red Dragon about  5 miles north on Alma School Rd.  We had the Orange Chicken which was made with dark meat chicken instead of breast and the sauce was not spicy as indicated on the menu.  It came with 2 tiny pieces of broccoli.  We also ordered pork Egg Foo Young, getting 2 approximately 4 inch pancakes filled mostly with onions and a few tiny pieces of bbq pork.  The brown sauce was served separately  in a paper soup bowl, was a bit pale and didn't have that rich taste I am accustomed to.  The egg foo young was tasty.  With both lunches we chose the pork fried rice (tasted nice, not greasy, large portion) and egg rolls (hot, crunchy, not greasy and rich tasting).  Overall the management was friendly and efficient, parking was easy.  I might go back and try some different dishes, they rate 3 to 3 1/2 stars."}
{"text":"Our first visit to this place.  We were optimistic since it has four stars here.  I ordered the szechuan chicken, my wife had the lo mein.  I will let my wife describe her lo mein experience in her review.  The szechuan had a picture of a chili pepper next to, implying it was hot.  Well, it wasn't.  Not even a little.  The flavor wasn't bad.  But nothing special.  And not spicy.  The decor and ambience was divey.  Very low class.  But seemed clean enough.  Overall I'd really give this place 2.5 stars.  Better than \"meh\", not quite \"A-OK. But that's not an option.  So three stars it is.  If we come back I will update my review."}
{"text":"Alright, enough of these whiny, poorly educated reviews. I'll set the standard for you right here-- THIS PLACE IS A SOLID 4 STARS. Don't bother with these other misinformed citizens.  FACT: I'm Asian, grew up in LA and have lived in NYC and SF. By NYC I don't mean Williamsburg, I'm talking straight up Chelsea, Manhattan. I didn't screw around in SF either-- solid 3 years in the Tenderloin too.  In short, I know Chinese food.  Let me break down the other reviews to you. Let's see... I see three most recent reviews are all 1 star each: Bobbie gave it a 1 star because \"cashier was awful and wouldn't make eye contact\", \"did not want to help me decide what to order\".  Emily, who implicitly claims to know the authentic \"NY Chinese food\", gave a 1 star review since didn't get any \"sauces for the apps\", and \"our meal was mostly apps\". Hong wanted to give this place a 1 star because he/she \"waited for 2mins and no one told me how to order anything here.\" and ends the review with \"Hehe\".  OK. Y'all are all f&@#ing adults here. None of this should be a surprise if you've made it this far in life. There should be no confusion on what to do--- walk in, walk up to the counter (as indicated by a cashier machine) and look... There is a menu on the goddamn counter as there is on any other restaurant you've been to. Hell, even McDonald's have them sitting flat on the counter.  Pick out what you want. If this is confusing, just pick Orange Chicken. Once you are ready to order, you have to use this thing called voice. Shit, even Helen Keller figured that out.  You're here for Chinese food, not career guidance counseling. The Chinese lady is there because she knows how to cook good Chinese food, and not there for \"eye contact\" and your feelings. If you truly know NY Chinese food, then you wouldn't be ordering \"mostly apps\" anyway.  Who the F&$* eats just apps?? That's like me complaining about Five Guys Burger after ordering just a bunch of fries.  So whiny.. I can't even. a real Chinese food connoisseur has his/her own sauces at home anyway.  If you got the time, read the short review by David S on 1/6/16. He's right on."}
{"text":"Had to down grade Bejing. The Pork fried rice used to be great, now it is old and tired. Seems like they make it the day before or something, Gray in color, not flavorful. The chicken is all thigh meat now and fatty. They are on the band list for now, so sorry Bejing."}
{"text":"Great NY style takeout. Chicken with Broccoli always good. Wonton egg drop is tasty. Crab ragoons are full and tasty. BBQ spareribs were a little tough but flavor was fine. We always do fried rice. A little greasy, but we always order.  Food is always consistent, I like the Kung Paco."}
{"text":"Very good food and at a reasonable price.  The only criticism is that at the time of sale, they rarely smile and the checkout system asks if you want to tip???  To pickup an order?  Is this the norm now???"}
{"text":"I was disappointed after reading all the positive reviews.  I ordered crab ragoon, chicken lomein, sweet and sour pork, and steamed meat dumplings.  I got delivery, which was fast & courteous.  Overall the food was extremely greasy, I mean literally dripping with grease.  I'm wondering if they need to increase the temperature of the deep fryer and or wok.  I'm no chef, but I've read that if the oil is not hot enough that the food will retain too much oil. The filling for the crab ragoon was as another reviewer mentioned some of the best tasting I've ever had, but it was ruined by the dripping grease.  The sweet & sour pork was almost all breading with very little meat.  I'll be trying another restaurant next time."}
{"text":"Our family really enjoys this restaurant.  We normally do take out and the service is very fast.  The friendliness is ok, sometimes a little short.  But I don't come here for the service but the food. Our favorites Crab Ragoons Lo Mein Noodles with any meat (our kids favorites) Cashew Chicken Orange Beef Happy Family meal Pan Fried noodles with the combo meat  Only thing we didn't care for was the lemon chicken (don't order) and the egg foo young.  A ton of choices and there are others items we've had there that were good but didn't make our favorites list.  (shrimp in lobster sauce, kung pao chicken, etc..)  give it a shot"}
{"text":"Great General Tsaos Chicken and everything else is great also. They are a tad more pricey however they by far make up for if in flavor."}
{"text":"Very good for fast food & I'm very picky. This is one of the only fast food places I will eat on the rare occasion that I do.   Food quality seems pretty good and the flavors are excellent. If you do Chinese take-out you should at least try this place."}
{"text":"I had been searching for a new Chinese restaurant ever since my previous one of many years changed owners and degraded in quality.  I found Beijing by chance and stopped in to see if they could be up for the challenge.  I ordered Orange Chicken and the Crab Rangoons, took them home and was blown away by how delicious everything was.    Beijing is now on my speed dial and has definitely earned my business for the foreseeable future."}
{"text":"You know there as a unique experience waiting by the lack of English text on the menu, but lots of big pictures!  I stopped in for a quick lunch after a meeting, knowing there was a Chatime in the same mall.  I was really looking forward to noodles, but not Pho today.  Beijing is a small place, but with a big menu.  I perused page after page of large, glossy, full color photos and realized I need more time and a bigger appetite!  I settled on a Wonton soup, knowing it would not be the typical \"Mandarin\" wonton.  It was a simple dish with a very refreshing broth, and 10 wontons with baby shrimp and dried greens.  Very good!  I also ordered a new dish for me: a cucumber in garlic and soy sauce.  It came cold, with large chunks of cucumber and the space that was almost a marinade.  I figure it was simply soy cause, capped garlic, sesame oil and maybe a bit of sugar.  It was delicious!    So, I cleaned it all up, hoping I still had room for Chatime. There are more items on the menu I want to try when I have a bigger hunger on..."}
{"text":"I have been coming here for years with my co-workers and we all love it!  There is a bit of a language barrier but the food is awesome!"}
{"text":"I've been eating @ Beijing for a couple years now & I highly recommend it. The quality of food is fresh, hot & delicious! Delivery service is prompt & courteous."}
{"text":"Used the built in ordering menu function!   Ordered 3 combo meals Beef chow mein  Orange chicken Kung pao chicken With  Sweet and sour soup Egg drop soup. Wanton soup 3 egg rolls.   Asked to have it delivered, to Chandler regional hospital, and it was hot, fresh, vegetables el dente, perfect seasoning, great end to a very rough ordeal for our family.  It was delicious!  Thank you so much!   Felt it was a great value for the $ also!"}
{"text":"The food is just ok. We ordered 2 dishes. They got one of the dishes wrong. For amazing stir frys check out Pho Chandler. This is where we should have eaten. I'll keep looking for great Chinese take out."}
{"text":"I always have trouble finding Chinese food places that are good in AZ! However, this place is sooo good, and reasonable priced!"}
{"text":"For my wife and I the bill usually comes to 30 dollars or so before tip. This allows for leftovers to take to work for lunch.  Always pleased. They usually deliver much faster than quoted time but we are also only 1 mile away.  Have not oredered anything we did not like. Delivery guy is nice but they are not too welcoming when you go in for pickup."}
{"text":"So...this is a hard review for me. I just had amazing Chinese food this past week....maybe New York is different?   I ordered delivery. He told me 45 mins, which I hoped was like pizza and really showed up in 20. Nope, 45 mins exact almost.   The food was packaged nicely, and was warm.   It was a little soggy...which I understand cause it is delivery....but you can get Panda, drive 45 mins, and it still is crispy.   I got the orange chicken, and the flavor was good. Some times I had that....\"what am I eating\" moment. Especially with the egg roll. I am not sure what that was. That was not fresh and or good.   When I started this review I was thinking I would give them another shot....but I rather just go to Panda. It would have saved me $5.   They were very nice over the phone!!"}
{"text":"Amazing food. Just moved into the area and was looking for our Chinese place of choice, and we found it on the first try. Their food was amazing. They have a great selection and really good prices, and to top it off a wanton egg drop soup, which is the best of both worlds!"}
{"text":"What happened to this place?  The prices went up, the food got bad.  It was so bad the last 2 times I went here.  I am so sad to see them taste like all of the other Chinese Fast Food places.  The fried rice was greasy and no flavor.  Not returning."}
{"text":"Food was ok. Large portions. Employees there were rude and everyone in line felt very rushed to order (Wasn't even busy). Also place didn't seem very clean."}
{"text":"Decent food for decent price.  Not the best I've had but very satisfying.  I love their vegetable dumplings and many other things on the menu. Usually get take out and they're pretty fast with orders.  I'd rather have good food at a reasonable price than fancy decor and they provide exactly that."}
{"text":"This is my favorite Chinese food period. The chicken and broccoli is what we get everytime and the crab ragoons are amazing as well. The food is always done when I order. This is a more order out place not a sit down restaurant too much. The only complaint I would have is the lady that answers isn't the most polite and hangs up right after the order...but the food is amazing and so I will continue to go back and I live all the way in phoenix. I order it and make a trip to chandler to go get it before heading back to phoenix..."}
{"text":"I want to give u a zero. Really bad, I waited for 2mins and no one told me how to order anything here. I asked but no one answers, seems everyboy is busy working in tje kitchen.  Hehe"}
{"text":"This place is awesome.  The food has great flavor and the portions are perfect.  The staff is very friendly and welcoming.  Any chance we get we order from here.     Their TSO shrimp is awesome."}
{"text":"This place is solid.  Whenever I'm hungover or just don't want to cook, this place hits the spot.  Delivery is swift and the food arrives hot.  Love the lunch menu too!"}
{"text":"I love the food here. Everything i have tried seemed fresh and delicious and tastes good cold the next day for lunch too. My only complaint was the egg rolls. I love egg rolls and they are not very good here so I wouldnt order them for sides. If you like Orange chicken you will not be dissapointed."}
{"text":"I absolutely love everything I get from this place. All of the food is really good and the price perfect!     That being said, my only complaint/warning would be the online ordering. I have ordered egg drop soup as my add-on for the lunch special several times now and have ended up receiving an egg roll. After calling the restaurant to let them know what happened, they asked for the egg roll back (I declined in fear it would make its way to someone else's order). I would recommend calling an order in if it contains soup."}
{"text":"I liked this place.  I like the clear spicy noodles and the beef pancake, tasty yet not TOO greasy.  Keep in mind this plate is usually really greasy so in comparison to other restaurants the grease level for this was good.  I also ordered grilled pork buns ??? and spicy chicken soft bone, these dishes were average.  The grilled buns can't really compare to China but for Canada it's pretty average.  Interior pretty traditional China Chic, small restaurant, but I really liked it."}
{"text":"Been getting food to go from here for over 3yrs. My wife usually tend to get the same items. Why fix something when it works.  She always gets the Mongolian Beef lunch special, or dinner. Every once in a while we indulge in the Crab Rangoon. I tend to alternate between the Singapore Noodle, Chicken Fried Rice and the Chow Mai Fun.  It's not the best Chinese food I've had, but I never had a complaint regarding the quality and quantity of my food. I've never had to wait longer then 10 mins to pick up my food as well.  They recently raised the price on their lunch specials by $0.50, but it is still a killer deal at $5.49.  Good food, good prices."}
{"text":"Do you like customer service?  Do you like chit chatting with the staff to figure out what sounds good?  This place is not for you.  The food is straight up goodness. Combo platters are the way to go, however I've never been pleased with the pork egg rolls as its just cabbage inside no pork.   Kung Pao, Mongollian, etc is all super good. Just be prepared for the total lack of disrespect when it comes to being acknowledged as a customer.   One more thing, if you order to go you gotta grab your own sauces...which is totally fine just don't forget!  Oh and I wish they made their own spicy mustard. The Panda packets they give out taste like they've been there for decades."}
{"text":"Whoever thinks this is \"NY style Chinese\" has never been to NY or had Chinese food. Absolutely disgusting. Definitely don't get delivery, they don't provide sauces for the apps and our meal was mostly apps. But beyond that, the General Tso's chicken was beyond awful, cooked terribly, overly breaded, disgusting flavor, and we all feel nauseous. The egg drop soup both tasted and smelled like a barn.  STAY AWAY - FAR FAR AWAY!!!!! I've never said this but I wish I could give zero stars."}
{"text":"Delicious! I ordered delivery from here tonight and the food was fast, fresh, tasty and the portions are generous. Will definitely be my go to from now on!  Ordered orange chicken, fried rice and crab ragoons."}
{"text":"Penny pinching people.   I have purchased food for a year at Beijing restaurant yesterday I purchased noodles and other items and I had the noodles today it tasted rotten, I called to see about getting a discount because the food was tasting right like its spoilt. I always buy singapore noodles so why does this one taste bad. I asked why it tasted off. The guy that picked up the phone has poor customer service and rude. Refuse to give the names of the owners and refuse to give me a discounted meal or if possible return it. I was prepared to buy another on discount and buy broccolli and  more food and show them the original singapor noodles. I will never purchase anything there. The food is just OK. The only reason I go there because the other chinese restaurants are not near my home."}
{"text":"Overall 3.5 stars.  Beijing Restaurant is located where La Mere used to be.  We came for a Saturday lunch.  The manager/server was super friendly, polite and helpful.  We were provided a beautiful menu with picture for almost every dish.  Being not knowledgeable with Beijing food, the picture menu was helpful to me.  The menu looked similar to the one La Mere used to have, with maybe a few more dishes.   We chose a fish ball noodle soup, a spring roll dish and a jelly fish dish.  The spring rolls looked very pretty and photogenic.  They were tasty, refreshing and filling.  There wasn't much meat.  There might be a bit too much bean sprouts inside.  I would want more types of vegetable.  But maybe bean sprouts are the Beijing way, so my opinion might make the spring rolls unauthentic.  I don't know.  Lastly, as a northern Chinese dish, I found the spring roll rather \"healthy\" and non-oily.  I think I would order the spring rolls again.  The fish balls were more like fish meat bits, not balls.  They were hand made from paste.  The fish balls were fresh.  They were slightly bouncy to the bite.  The noodle was smooth.  The soup was quite mild.  You could add chilli oil and soy sauce to add flavours.  It is well priced at $7, making it an affordable lunch selection.  Again, with the mild soup and fish meat, this dish is a healthy choice.  The jelly fish was a cold appetizer.  It turned out to be the strongest flavoured among the three dishes we ordered.  The dominate flavour was garlicky.  The jelly fish was nice/decent.  I liked the taste, but I must forewarn you that if you had this at lunch on a working day, you probably should brush your teeth before returning to work.  As we didn't like the oiliness we experienced at La Mere (at this location), we purposely ordered relatively less oily dishes.  We enjoyed the meal.  We would definitely return to explore other items on the menu."}
{"text":"Good food and fast delivery  The brown sauce is very tasty & I love that their Triple Delight has beef instead of pork  Friendly staff and I would definitely recommend"}
{"text":"The Chinese food that you can find in Arizona love the chicken with broccoli great crab Rangoon love the chicken noodle soup mmmmm very good"}
{"text":"Kinda pricery, but portions are good.  Tried the General Tsao.  It was just average tasting."}
{"text":"I love this place!  I eat here around 3 times a week during my lunch break from work across the street.  It's cheap and a lot of food.  The lunch is $4.99 plus tax.  A few of my favorites are the lo mein (shrimp is my fav.), shrimp or chicken and broccoli, kung pao, and chicken with cashews.  Usually I'll ask for everything extra spicy and they have no problem doing that.  I've tried almost everything on the lunch menu, and only not cared for one item, but it's just because it's not my thing.  Everything is made to order and is delicious.  As for the sides, the fried rice is great and the egg rolls and wonton soup are awesome.  The people are extremely friendly as well.  They've gotten to know my name as well as my coworkers.    The seating is limited, but it's all about the food there.  I usually pick it up and go.  They also deliver!  I'll continue to come here until I move.  It is one of my favorites!"}
{"text":"If you are not very specific but want to fill up your tummy with some Chinese food..this place is good. If you like Americanized Chinese food like pei wei or panda express, you will like this place too.. Want good Chinese food ? find another place.. This is not it.. But, the people here are good..I have bought quite a few times when I am lazy to drive far.."}
{"text":"My first time here I bought the chicken and broccoli, Kung pao chicken, crab ragoons, and egg drop soup for takeout. It was amazing, every bit of it. On top if that, the food is relatively cheap (especially for lunch!)  and the service is quick, even for how busy they can be. I crave their food all the time now."}
{"text":"Ignore all the bad review regarding the customer service,who cares you're there to eat like get over it. Anywho they have some amazing deals for lunch combos for $6 for like 3 things which are your choose of soup,egg roll or drink, your main entree & choice of your favorite rice. Definitely a nice little joint, food Is always made fresh right after your order is placed, & very affordable, make sure to stop by & check out there \"lunch time deals\" they're usually during particular hours I believe 11am-230pm not completely sure, regardless still check it out,you won't regret it & if you do what's there to loose $6 bucks? ..."}
{"text":"Local restaurant for Chinese food. Reminiscent of NY. They except debit/credit with chip. Also, Bitcoin for online orders. Check them out for take out and delivery. You know it's legit when the family is chatting and cooking the food with the sounds of the wok"}
{"text":"Do not eat here!!! The tables where ALL dirty I had to wipe it down myself. The container where the plastic spoons & forks was also dirty. The customer service, we'll if you want to experience the stereo typical rude inconsiderate asian here is your opportunity. The food was served in paper plates. When we finished our meal we where yelled at, that the trash can was behind the counter, to bus the table, even though two employees where just standing there. RUDE, RUDE, RUDE!!!"}
{"text":"This was our Christmas Eve dinner and it was terrible! The egg drop soup was thin, tasteless and had too much pepper. How do you ruin egg drop soup?!? The spring rolls were greasy and just tasted like cabbage. The mu shu chicken hardly had any chicken and the pancakes tore when touched rendering them useless! Will never go here again nor will I recommend this place!"}
{"text":"A rather smalller restaurant. Can seat around 30-40 ppl? It was not packed on a Saturday afternoon. Dumplings we're okay. I ordered 3 dishes for 2 ppl. More then enough. One noodle dish it was too garlicy. The noodles were hot enough... the pot stick dumplings were good but smaller then normal. I also ordered a sesame pancake as a dessert. The food didn't come in order. The sesame pancake came before my pot stickers...   Over all it's okay. But probably would go back to another dumpling house instead."}
{"text":"Well, I read most of the reviews here and let it inform my decision in my search for Chinese tastiness.  We got the General Tso's, pork chow mein, crab rangoons and pan fried dumplings. My husband's rice was burned and a lone, singular piece of bacon MAY have traveled through the land that our fried rice came from - but that was the extent to which it contained pork. The upside? The containers the food came in are great and reusable. If you are looking for something flavorful, your search will continue."}
{"text":"Good food restaurant is noisy would not eat at restaurant delivery is a good thing customer service needs to be improved"}
{"text":"3.5 Stars. Friendly staff and inexpensive, however the space was a bit stuffy so I ordered take out. Potstickers were good, their pork bone noodles soup, though flavorful, was a bit salty for me.   There were other interesting items on the menu I think I will give it another try."}
{"text":"Another hit.. LOVE THIS PLACE!! Their wonton soup is loaded and delish. The General Tso's chicken and the steamed meat and their veggie dumplings  are so yummy! You will NOT be dissapointed!"}
{"text":"3.5  Pros: One of the best meat pancakes in the city  Cons: Portions could be better for price  As most have already stated in previous reviews, Beijing Restaurant is a re-branded Le Mere restaurant chain.  If you've been to Le Mere in the past, this place will be very familiar to you in more ways than one.  The menu and layout are more or less the same.  I think they have actually added more seats since I was here last.  The main thing that has changed in my opinion is the price.  Everything is a bit pricier than I remembered.  In the menu, you can see they used stickers to cover up the old price and just put in the newer prices.  Basically everything has gone up in price.    As usual, when you come here, you have to order the mean pancake.  They make one of the best in the city.  Also ordered was the braised beef noodles, pork bones and pot stickers.  Like I said, everything food wise pretty much remains the same.  The braised beef noodle did not have the spicy sign on it on the menu but it was easily one of the spiciest I've ever had.  A little disappointing since I ordered with my little ones in mind.    The meat pancakes are still the best.  I always get beef but you can't go wrong with any of them.  The pancake itself is got a little crisp to it and it's not overly oily like others can be.  I could just come here and order 2 of these things for a meal and be very satisfied!   The main issue for me now is the price increases.  The noodle is now $11.  For that $11, you get 6 or 7 small pieces of beef, some bean sprouts and the noodles.  The bowl itself isn't the biggest either.  For the money, I was expecting more.  The food itself is very good.  The value part for me just isn't there anymore.  I would recommend this place for the meat pancakes alone.  I recommend everyone go there just for that.  There was a table across from us where they just ordered 4 or 5 meat pancakes and that was it.  I could see myself doing that as well!"}
{"text":"Customer service: none Food: full of sugar and salt... Most dishes made with the same sugar sauce. Delivery: AT YOUR OWN RISK! If you like eggshells in your egg fu yung... Ummm... Oh and if you like a chunk of pink ham in your vegetable stir fried rice ;)"}
{"text":"I've only been here once, but that will change. Right down the street from me and plenty cheap!  Their lunch specials are $4.99, which is the cheapest I've seen anywhere. I had the Triple Delight.  Immediately upon opening my container, I knew I liked this place. HUGE shrimp and strips of meat...THROUGHOUT!  They do not skimp at all.  The taste was great and everything was fresh.  The veggies were cooked just right and all the meats were tender. This wasn't a combo, so I didn't get to taste their egg-rolls or fried rice.  I'm not a big fan of either, so no big deal. The service was polite, and the wait time was about 10 minutes.   Dining in is an option, and if you do, you won't be wowed by the interior.  Its just some chairs and tables setup along the wall...white tile on the floor, and white walls.  Decor isn't their main concern.  But who cares? Bottom line is you get a lot of high quality food for a great price (my order was $9.25 for a house specialty).  This is now my neighborhood Chinese food place."}
{"text":"I have eating at several Chinese places in the Chandler area.  This place is by FAR the best. Super fast delivery, excellent portions, and fresh ingredients.   I had Mongolian beef and my wife had an order of pot stickers and crab rangoons.  Everything was perfect super crisp green onions, nothing soggy.  The beef was real beef, not processed grey meat product."}
{"text":"House special chow mei fun, bombdigitty. A little weak on the meat, but it's still a treat"}
{"text":"Very good take out Chinese! We usually get the genreal tso chicken, and chicken lo mein and crab rangoon. They are consistent, and fast!  Never have any problems! Im a fan."}
{"text":"I have tried MANY Chinese take out places. And have yet to find one whom comes close to \"NY style\" until today. I order the shrimp lo mein and crab ragoons for delivery. The guy that took my order was a little stuffy at first and almost put me off ordering. But he turned out to be pretty helpful when i needed an opinion in portion size. Anyway, he quoted me 30 mins and the delivery guy was almost right on the dot! Now, the food.   Let's just say. I have always ordered crab ragoons and they are typically very basic. But I always order them just kind of out of habit. I just started assuming they all tasted like Panda Express ragoons. But holy cow. These ragoons were AMAZING! I had to stop myself from eating the whole bag of 8 in one sitting. And the shrimp lo mein? Cooked to flippin perfection! Usually I expect to have over cooked shrimp, but no it was literally perfect. And the price was very reasonable. I'm so glad I decided to give them a shot instead of going with the other place that's really close to me that has Panda Express-ish food. I will GLADLY order from here again!"}
{"text":"This is my favorite Asian take out in the Valley hands down. I love the broccoli chicken. The thing that suffers in most Asian take out is the meat. This spot has excellent quality meat products and recipes. As long as they can keep the quality where it is they have my business."}
{"text":"The orange chicken , sesame chicken and pork fried rice are really good. This is a lot better than Pei Wei . And delivery is fast. Good lunch specials."}
{"text":"This is not real Chinese food!  Americanized gravy covered food. Wontons are frozen and dry, and \"dumplings\" are wontons covered in sauce. Szechuan is just stir fry covered in sauce with no real Szechuan peppers in sight. Everything came out on paper plates or in paper bowls like a back yard bbq.   I was hoping for a replacement of Chou's kitchen when they were closed on a Wednesday, but this did not fill the void. :("}
{"text":"Beijing does everything about Chinese takeout perfectly: fast, fresh, affordable. Try the $5.75 lunch specials. There are about 30 dishes that all come with your choice of soup, egg roll or fountain soda. Beware: the soups are THICK"}
{"text":"Very disappointed with my orders--   moo shu pork became stir fried shredded cabbage , where is the wood ear mushroom?   Pork with garlic sauce -- totally different from last order--taste different and look like vegetable stir fried   Kung pao chicken -- the peanuts are raw"}
{"text":"My mom and I ordered delivery a couple nights ago. The man answering the phone was very friendly and accommodating, however it took a while to get my street address and credit card number right because he kept confusing the numbers, and I had to repeat it at least 2-3 times. That was a little frustrating, but other than that, it was so quick, that I was surprised when I heard the doorbell ring.   I like that some menu items (on the dinner menu) have a small and large portion available. My mom got the small and that gave her two meals! We got an order of Crab Ragoons (8 for $3.75) my mom got a small portion and I got a large portion, all for $20! SO much food, for a fantastic price.   I wish that their whole menu listed descriptions of the meals, what kind of sauce, what specific vegetables were in each dish, etc. Overall, great place, and if I ever want to order in again, I'll go here :)"}
{"text":"Had a Christmas lunch here since our normal place we go to was closing early. Nice little place in the Fry's shopping center. It's a small place with tight seating. I tried the Kung Pao chicken with fried rice and won ton soup. I really enjoyed the soup, The Won Tons are big and meaty. The Entre was good but could have been just a tad spicier. It wasn't crowded, so we had pretty fast service. Every thing was served on paper plates and plastic dinner ware. A little weird."}
{"text":"Never again! I just left Beijing & am now expecting to be up at 3am with some kind of stomach bug. It wasn't just the food that didn't taste good, but the cleanliness of the staff was horrible! When we walked in there was a man smoking our front. He came inside while we were ordering & began handling plates & food & utensils. I mentioned to my sister to watch him while I pay & note if he washed his hands. I guess the lady taking our order heard me & yelled to him to go wash. I do have to say the crab rangoons were great...however I'm not even sure why I ate anything after the no hand washing incident. Anyway, Broccoli & Beef was no good & the Kung Pao was the worst I've ever had. Then on the way out, I had a folded napkin blow off my dirty plate as I took it to the trash & a female employee picked it up & put it back neatly in the stack of new napkins that are kept on the shelf on the left of the entry to the kitchen area. I knew then that I could expect to be puking in about 8hours!!! Yes, I saw it with my own eyes & if I'm not sick I'll be completely surprised. Disgusting place!! I'll NEVER EVER go back.  7/12/16 Somehow I didn't get sick. Amazing!! But that doesn't change my mind about never going to Beijing again. Yuck."}
{"text":"I'm a Chinese food fanatic and this is the best so far. I live in Gilbert (have tried every restaurant out here and this place beats them all) and drive out here 3 times a week just to get decent Chinese at a decent price.  Must say though they used to have this really rude guy working there who would yell at all the customers but I think they got rid of him since I haven't heard or seen him around lately, Good move!"}
{"text":"Some of the best Chinese I've had and they deliver!!!! You don't realize how hard it is to find good Chinese food for delivery until you live somewhere that it's difficult to find like Mesa! So happy that we moved back to Chandler and are close enough for this place to deliver now! :)"}
{"text":"Fastest delivery! Consistently hot, fast and fresh food!"}
{"text":"Their number one with BBQ pork spare ribs is by far their best entree and one of my favorite meals! Besides that everything else is good."}
{"text":"Very good food, but the inside of the restaurant didn't seem to be very clean. Especially the bathroom."}
{"text":"Here we go once again food delivered on time and earlier, food hot and all there, sides there soy sauce and so on , packaged correct to me 4 STARS,  but the delivery driver WOW straight attitude as soon as i opened the door . I greeted him with HELLO HOWS IT GOING, no reply just an upset look like i hate my job, ok I mentioned to him FIRST time we had ordered from here no response, asked if i needed to sign anything he said nothing but TIP. Ok i haven't gotten there yet making sure all our food is there and such, he said you didnt give tip when you paid. I said hold on let me she what my wife did. he looked upset and frustrated i asked him if he was having a bad day no response. First of all we don't have to give a tip second of all with an attitude like this your not getting one with that face and smart attitude. I tell you this tip thing is way out of hand you give a tip for courtesy, prompt and good service not a rude driver with an attitude as soon as you open the door demanding one. I even called him back he said your good in a smart tone.  You know the worse thing about it you messed up my lunch with your negative attitude. Thanks"}
{"text":"This evening, my wife and I went to Beijing based on her experience ordering food from them for lunch this past Friday.  I tried the noodles she had for lunch and found them quite tasty.  Fast forward to this evening's experience.....  a) I have never went to a Chinese restaurant that wasn't Panda Express where I placed the order at the counter when I was eating in.  We had to order our food before we could sit down.  b) The egg rolls were tasty but the steamed broccoli and chicken I ate was quite cool in some spots.  When notified, they did warm it up.  However, the rice was also not warm.  I tried my wife's fried rice and it was better but seemed to be missing something.    c) The food was served in paper plates.  Want silverware?  You had to go to the counter for that.  Drinks were served in styrofoam cups.  c) I happened to turn my head and noticed that the green beans were being prepared upon a public table.  Can we say potential health code violation?  d) When we were leaving, we were reminded to take our own trash to the garbage can by the front door.  With that said, the chances of me returning to dine here are pretty much slim and none."}
{"text":"great food, great prices, and fast. have been going for 4 years.   yummy !!!"}
{"text":"Great food, and delivery is a definite plus. The only tip I have for this business is to be more consumer friendly on the phone. They are very accurate in delivery time as well, and the food tastes really good and it reminds of me the Chinese restaurants that deliver in Chicago so that was also a big time plus for me."}
{"text":"Ordered House Friend Rice ..You can't go wrong with that right ? Almost $ 9 for a regular size box . When I opened it the box was packed full of rice and I kept searching for the chicken and pork and shrimp and no eggs . First thing I thought of was Tai Pei brand frozen rice for $ 2 and I was right. Literally it was almost the same quality and the same type of meat in it . Well I counted 4 medium sized shrimp and the chicken and pork was very little and was in tiny micro pieces ?  So I called them back and asked to be accommodated with a credit to get something else . She told me next time to ask for extra meat? Didn't say she wouldn't charge me for it just ask for it ...WoW !  I am not a racist by any means but I hate literally eating from small mom and pop operations like this there is no customer service respect or guarantee.  Stick with the big chains at least if your food is bad or you are not satisfied they will accommodate you. They obviously know what they are doing and don't care . But charge the regular price like most Asian places .  I would seriously avoid this place they are here to nickle and dime you and very stingy with the servings of meat. Don't call something house fried rice if its just rice ...Skip this place if you want this kind of quality just go to the frozen section and pay $ 7 less for Tai Pei ....Good luck with your business ."}
{"text":"This is our favorite take out restaurant. Service is fast and serves up some great Chinese food!"}
{"text":"Pretty sure this is the new la mere restaurant, same restaurant but renamed since the food is exactly the same.  Tofu and Preserved egg ($5.99) I'm not a fan of you but surprisingly this tasted pretty good. The presentation doesn't look great but I guess it's taste that really matters. Strong in flavor, and a lot of green onions.   Pork Meat pancake ($5.50) 6 pieces of fried pancake stuffed with pork meat inside. I like how the pancakse was thin, not thick so it was slightly pan fried crispy but eventually becomes soggy from the hot juicy pork meat inside. Tasty.  Slow braised pork bone hand pulled noodle soup ($7.99) The slow braised pork was amazing! The meat was so soft and tender, falls off the bone. It's like eating korean like bone soup but Beijing style. The noodles were thin, slightly chewy - typical hand pulled noodles. Not too big of a fan of the soup since it kinda had a herbal taste to it. Really tasty!  Fried lamb bites ($13.99) A basket of fried lamb, each piece on a tooth pick. Perfect snack to nibble on with beer. Slightly expensive but I suppose it's because it's lamb meat. Not enough flavor, really relies on the spicy powder. Nice and crispy in each bite!"}
{"text":"Terrible. I went there for the first time today based on the reviews here. Bad service. The young guy up front wouldn't even look me in the eye. I just asked him a couple of simple questions abt the diff between NY style chow mein and lo mein and he was getting all frustrated and rude. I asked him I wanted noodles that had veggies but I ended up with a big brown bowl. No veggies. Taste of the lo mein is so bland even with hot sauce and the spring roll was hard, chewy and tasteless. A bit thick as well. Basically I wouldn't go back there and won't recommend it at all."}
{"text":"I order from Beijing about once a week. The delivery is very quick and the food is always hot! Ask for the spicy chicken soup if you have a cold! Food is great! And I've seen the owner at Sprouts getting fresh produce."}
{"text":"This was an all around terrible experience. From the surly staff to the styrofoam cups , extremely small flimsy plastic utensils, paper plates.  The hot and sour soup was tasteless. The pork fried rice tasted like it had been cooked in rancid oil.  Listverse really didn't you can write one star. One of the worst Chinese restaurants I've ever been to."}
{"text":"Ok that's it. We are done with this place.    The food has turned to crap. Teriyaki chicken was as tough as shoe leather.  The duck was literally all soggy duck skin and 90% vegetables. For $14!  They have started filling every plate with tons of veggies and you have to search for the meat. Not good.   We won't be back and we have been coming since they opened.  God forbid you get delivery and they screw up your order. They simply deny it on the phone until you get so frustrated you hang up. Such a joke!"}
{"text":"We were hungry for Chinese food tonight. Beijing is fast, friendly, and very good for delivery. We had the Mongolian beef and and my husband says it is awesome! I had steamed dumplings and I am equally happy. We also got a large wonton soup, which is full of flavorful brought very tasty and very tasty and has good croutons on the side."}
{"text":"We have been here a few times now and they have been consistently awesome ..  We usually get takeout n eat at tumbleweed Park..   We usually get Low Mein and Orange chicken for the kids,, really good and not overly sweet like some places. I swap a few times n get different items, and all have been good.. This is about the Same food like Red Dragon.. Definitely one the best on the east side of town !!"}
{"text":"I've been eating at this place for over 6 years. The food is amazing and nonexpensive. They are always great on time. Delivery is fast and so is pick up. Great place!"}
{"text":"Very typical Chinese restaurant - delivery is quick! It's close to us and we know what we are getting every time. There is an older lady that will not take any sass, all business. It's kind of comical. Like answering the phone with, \"Hold on.\" Or telling my BF, \"Not yours!\" while he grabs a to go bag in front of him.   Our go to's are hot and sour soup, General Tso's shrimp, walnut shrimp, pork cha siu. Is it the best? No but it's good, bad Chinese food when you just want to watch a movie and order in."}
{"text":"If i could give it negative stars i would.   When this place first opened it was awesome.   Over the last 6 months it's gone downhill.  We haven't had it for about 6 weeks and then ordered delivery tonight.   The food showed up and chicken was cold, dry and overcooked, the pan fried dumplings were hardly warm and were soggy, the low mein had a bunch of wilted lettuce in it, and the sweet and sour sauce was coagulated.   It was literally like jelly.   We called and spoke to the manager, she said they're not replacing our order but instead said (no BS) \"box it all back up, someone will come get it\" and hung up on me!   All i gotta say is you lost a LONG TIME customer, not to mention I will be sharing this experience with my neighbors and family close by.   All you needed to do was show a little customer service and not be so condescending."}
{"text":"Beijing Restaurant is the rebranding of La Mere Restaurant. Same location, Same Menu. The only change aside from the name is probably the pricing and the seating layout.  I usually just order the Meat Pancake which is always consistently good. The Pork Pancake was for $4.50 back then now it is $5.99. The meat filling seems to be less. Still tasty and juicy. But I doubt I would want to pay more for that.  I do like the new layout. It just make the space more opened up instead of having a roll of table of 2 in the middle of the aisle.  I would still come back if I have craving for meat pancake when I am in the area."}
{"text":"I like this Chinese restaurant! I have been eaten in this restaurant for a couple times. I seldom write reviews about restaurants. But I think they deserve a 5 stars., because they really make fresh delicious food. Their orange chicken and General Tao's Chicken are amazing! The house special lo mein is also great. Sometimes I like to order lunch special, because they have decent price and good quality food. By the way, their beef is the best among all the Chinese food that I have tried. I usually ordered beef broccoli and pepper steak with onion. Sooo yummy!"}
{"text":"I moved to Tempe, AZ in August from New Jersey and this is the only Chinese restaurant I will eat at.  Thankfully my friend who has lived here longer works by this location so I was told about it.  Everything I have eaten has been very good.  I tried the beef chow fun, general tso's chicken, beef with broccoli, chicken with broccoli, and some other dishes.  I also like their pork egg rolls and pork fried rice.  This is a small place where one would usually get take out from.  They have a very large menu and reasonably priced combination platters.  They have a lunch menu which comes with an egg roll, soup, or soda and rice for just $4.99 including weekends.  The only day they don't have the lunch menu is on major holidays.  I probably eat here every 2-3 weeks.  I'd probably eat here more often I lived closer to it."}
{"text":"My favorite chinese take-out. We're regulars here and have never had a bad experience! I love this place... I get the chicken and broccoli combo. :)"}
{"text":"Ordered egg rolls, Orange Chicken, Pork Fried Rice & Shrimp Low Mein.  Food was great, egg rolls were NOT greasy and delivery was fast.  Well worth the $1 delivery charge."}
{"text":"The first time I came into this place, I felt like they wanted to throw me in the wok. And yes, this is a 5-star review, so let this be a lesson in perseverance. The place is unassuming on the inside, although much nicer than it once was. The food is served on paper plates, the soup in Dixie bowls. In short, it is as unpretentious as possible, and they aren't going to win you over with personality (although they warm up to you once you get to know them, and they're actually pretty awesome).  That being said, even if they insulted my grandmother, I'd keep coming back. This food is that amazing! There are two local chinese places me and my wife frequent, and this is my personal favorite. That Dixie bowl egg drop soup with the bag of crunchy noodles is the best I've ever had, and they have Sriracha hot sauce at the table just to kick it up a notch. It is a huge serving, and it comes with all of the combos. My work friends swore by the Cashew Chicken with white rice, and my wife prefers the Lemon Chicken with white rice (and both are quality options), but I go here for the best Orange Chicken in town, with the best pork fried rice. This stuff is to die for, and the servings are so big you will never leave hungry.  Of course, the crab puffs are amazing, and some of the other options have been good as well. I don't know that there has been a meal we've been down on while we've been here. They do everything right!"}
{"text":"The appetizers were great. But I ordered kung pao chicken and got a mild dish with big chicken slices and no chili peppers in sight. When I called to state that, I got nothing but advice to mention that next time. Sad!"}
{"text":"I love this place! I always go for the chinese barbcued pork. I love their lunch and dinner meals as well! Very worth the price! The food is always consistent and the staff very friendly. Their egg rolls are also very delicious and I'm hard to please when it comes to those! My suggestion is go there for the 4.99 lunch meal that comes with very generous rice, egg roll and main dish!"}
{"text":"I wanted to go to the previous restaurant in the same location, found out the name has changed. I was hesitant to go in until I saw the review saying the food pretty much the same. It is true. They got same menu except adding a few more items such as dumplings. We ordered our favourite pork bone meat with pulled noodles, it was as good as before!! We also got the green onion pancake, wow those are super fresh, not too greasy or salty. It is a must get!!  I deducted one star for the seating, I prefer the previous seating arrangement instead. Now they put more tables but a bit tight between each tables. I understand they want to fit in more customers, it is not a deal breaker as I usually go during not busy hours."}
{"text":"Egg drop soup is super yummy! The Dixie bowls are a little unsitely for dine in, but I'd probably return to try other options."}
{"text":"went here based on reviews ... worst Chinese food ever !!! very greasy, tasteless, rice was hard seemed old .... very disappointed ... we paid $24.00 to throw up later .... want good Chinese ... go to Totts it's worth the drive !!!"}
{"text":"I love this place.  The Chinese food just has a great flavor!  Some of the best Chinese I've tasted period.  Sure not everything is perfect.  Their hot and sour soup, for example, is not quite as good as it used to be when I first came here but other than that, you can't beat this place.  Has to be one of the best, if not the very best, Chinese place in all of Chandler!  And I noticed they now have an Android app called \"Beijing Chandler\" on Google play which they are promoting which makes ordering ridiculously easy!  I love it.  Thank you Beijing for the great food and now the convenience of mobile ordering!  I plan to use this soon to order my lunch from work!"}
{"text":"This is a diiirrrrrttttttyyyyy restaurant.  The combination of open space, small size and constant wok cooking (yes I know it's a Chinese place and that's how the food is prepared) fills the air, furniture and fixtures with grease.  Not enough cleaning goes on to stay ahead of the dirt/grease/whatever combination that coats the tables, chairs and whatever else.  Now all of the above being said, the cooking area in the restaurant is relatively clean...so good news there.  So regardless of how dirty/greasy/whatever the place happens to be I decided to eat there any way.  Food was ok.  As a matter of fact it was better than just about any other Chinese place I've been to in the immediate area.  I just kind of think this is a carry out place versus eat in.  Gave it a 3 because the food was halfway decent.  If I went on cleanliness it would probably be a 1."}
{"text":"Best Chinese food I've had in Arizona so far. Grew up with a Chinese step-family who owned Cantonese restaurants so I have certain standards. Back in the midwest, they use quality chicken and beef tenderloin. Here the meat seems to be poor quality--has a spongy texture. The chicken here is certainly better than others in the area and there's good flavors.However my husband ordered the beef and it was gross. I've ordered twice now and enjoyed my chicken dishes both times. Will order again because it's still better than the other places we've tried."}
{"text":"I have been their regular customers for a few years now. Although they say that the delivery time is usually between 45 to an hour, I usually have my food delivered within 30 minutes or so. They do serve authentic chinese food (unless...of course..if you prefer orange or kung pao chicken..yike). If you haven't tried their singapore noodles and you can handle spicy food, they do cook up a good one. Their best dishes here is definitely the dumpling. I normally order a small dumpling soup with a main dish - it is just absolutely delicious. I believe this is a family owned business and would love to support them for as long as they are around."}
