{"text":"I am giving this place 4 out of 5 stars because the place itself is a bit dated in atmosphere and design, and because I have only ever had their pizza...but trust me, their pizza is so good that this review should get 5 out of 5 stars! And the price of this pizza is a great value, you absolutely get what you pay for. I hate cold pizza, and Bella is the ONLY pizza I can stomach cold, now that's saying something!
So before you buy that flat Dominos or stay in to heat up that flavorless frozen pizza, go to this place and get the Hawaiian with shrimp and feta added to it. All i can say is \"You are welcome!\"

No doubt in my mind that you will enjoy your meal."}
{"text":"Came in from Cranbrook yesterday. Was told by a friend that it was best pizza he's ever had. I have to agree. Decent prices. Lots of topping and the cheese. Omg so much cheese. We had the number 12 with green peppers. I highly recommend this.. and a number 17. I will definitely be or ding from here next time we come back into Calgary. Awesome job."}
{"text":"I'm pretty biased on this one, as I've eaten \"The Bella\" for years.   I grew up in the neighborhood, so this was always our source of pizza delivery, or our place to pop in for a quick meal.

A lot has changed physically with this restaurant over time.  Various incarnations and renovations between the restaurant and the lounge have taken place.  And generally speaking, today it's not unlike many other \"neighborhood pizza places\" that dot strip malls around the city.

But one thing that has always remained a constant is the GREAT pizza.  

I'm going to narrow it down further, and say that if you like pepperoni and mushroom, or beef and mushroom, you'll love their take.  This place makes my absolute favorites.   

So allow me to discuss my true passion:  the pepperoni and mushroom! 

For me, this is all I'll ever need.  It's the perfect blend of flavors between the sauce, and the type of pepperoni used.  

It's not hard pepperoni discs thrown on top, like some places do it.   Nope, it's a soft pepperoni layer underneath the cheese, that perfectly combines with--and complements-- the sauce and mushrooms for flavor perfection.  A good amount of cheese tops it off, making for slices with decent heft.

Now, I'm not concerned about \"authenticity,\" or ambience, or anything of the sort in this review.  I'm just saying, for me, a slice of this is about the most satisfying slice of pizza I've had.    So even though I no longer live in the neighborhood (far from it), I do make a point of getting take out now and then on the way home from work.   A quick detour into Lakeview from Crowchild south, and I'm there.  

I really don't dine IN at Bella Roma anymore, but I can say it can get pretty busy.  They do a LOT of takeout and delivery on top of restaurant and lounge sales.   The staff on hand are often running hard.  But I won't punish them by knocking off a star for being popular.  They are still my favorite."}
{"text":"It was a Thursday night in November = -4 degC weather in Calgary. 

In spite of that, the place was busy and service was excruciatingly slow. Food was hot, generous, fairly tasty and expensive. 

Nice but not nice enough for me to brave the cold for. An underwhelming 3 star experience"}
{"text":"One of if not the best pizza in the city of Calgary. I love sing the older gentlemen playing cards in this cozy dated local pub. Waitress that usually Serves us is quick witted and gets the job done effectively."}
{"text":"I've been driving past Bella Roma for a couple of years now, but it doesn't look like much from the outside so I never really paid attention to it until I read some (really) positive reviews on another food review website.  We finally went for pizza and beers last night, and MAN was I sure missing out!  This place has really good pizza - a nice Greek-style pie, which isn't my favourite style but they do it really well.  They put a TON of meat on their pizzas.  I can usually slam a half of a pizza myself, but their pies are so thick and filling that I was way too full after 2 slices.  Many of the reviews I read said that this was the best pizza in Calgary.  While I wouldn't say it's the best Greek pizza in Calgary (that title is reserved for Atlas), it is one of the better Greek pizzas in the area. (anni's on 37th St SW and Starlite on Heritage Drive SE are also nearby and have equally great Greek-style pie).  When we were there, I saw probably 15 or 20 people coming in to get take out pie, so this place is certainly popular.

Bella Roma is a typical 1970s-style steakhouse, and is divided into restaurant and lounge areas.  We sat in the lounge, which at 6 pm on a friday night was PACKED.  Somehow, though, the tables are arranged so that it feels like you have a bit of privacy and can have a conversation without the rest of the place overhearing it.  The crowd was a nice mix of ages, from mid-20s all the way up to about 70 or so.  It was kinda cool to see kids in UFC shirts and grandparents in floral moo-moos.  Our server was excellent, super nice and did a nice job of keeping up without being overbearing."}
{"text":"I only grabbed take out, so I can't comment on service or atmosphere. The food was yummy and well made, a good mix of flavours, and it wasn't too expensive."}
{"text":"Husband and I shared a large pizza called Bella Roma Special for $20.    It was just the right portion for two.   There was nothing special about the crust, didn't seem like homemade.  The pepperoni and ham on it was the poorest quality meat I have ever seen.  I couldn't eat it, I picked it off.     The mushrooms and peppers were scarce.     The radio played the worst pop music.  When I go out to eat, I don't want to hear radio ads during dinner!!  If you: (Bella Roma)  are going to play the radio then choose a station that plays the classics and not pop garbage.  There was no one there under 30!  The decor was totally 1980's but who really cares, just mentioning it.  The server was pleasant but when I mentioned the bad meat quality she had no comment. There is no reason to go back when this place offers nothing better than McCain frozen pizza in a time-warp atmosphere."}
{"text":"This place has wicked pizza! It's old and it needs a facelift but it's also a Lakeview community staple. Pizza, spaghetti, beef dip...all good, decent price, average customer service. Waitresses have been there forever."}
{"text":"I have to agree the service here is brutal. it's not staffed enough so if you are a server and eat here its hard to watch. Also hard to get drinks. The food is great love the pizza it's amazing.  And the server dropped off an empty parmesan shaker at our table luckily some cute older lady gave up hers. maybe order take out"}
{"text":"A regular hangout for years and will continue to be!  Good food, especially the souvlakis.  Service generally very good and the beer is cold.  Yes it is stuck in the 1980's but is that really important when you're enjoying everything else?  Not really. Bar nice for watching CFL and NHL games.  Will be back in near future."}
{"text":"Great Food, Great Prices, Great Atmosphere.
The only complaint I would have is it is understaffed, some times you'll walk in on a busy night and they'll have only one server/waitress on to deliver food to the entire restaurant.
As a result you'll be waiting up to 30 minutes to order or for a drink refill.
The Pizza is amazing, the wings are great and the place is warm and pub like.
All in all a great place, just don't go when it's busy."}
{"text":"Bella Roma has become a regular haunt for my dragon boat team when we train from Spring to Fall.  It's fairly decent as neighbourhood steakhouses go, with the usual expected menu items such as steaks, pizza and pasta, but what differenciates this place from any other pizza place is the crust.  It's definately home made, and one of the best in the city (sorry Cate, maybe it was an off night?).  It simply has flavour and body, and doesn't taste like something from the freezer bin.  The consistency is rich, and they pile on the meat and cheese like Rome is burning now and there's no day but today.  Needless to say, I enjoy my summer nights with pizza, beer and good friends.

The place is separated into two rooms, the restaurant on the right and the bar on the left.  The restaurant side has a slightly different menu than the bar, but the bar has some excellent daily and all week food specials, such as the large 2 topping pizza for $11.95 (one of the best deals for the quality in town).  Drinks are good, the waitresses are friendly and though I find the layout a little tight.  Still, if all you want is a place to go to and relax with friends, it's a good place to be.

Outside of that, they do take out (I'm not quite sure about delivery... I don't believe so), and I really don't have much idea about the rest of the food outside of the usual pub stuff (I personally think their fries is a little overpriced).  Still, whenever I'm in the area and have the opportunity, it's a place I consider a neighbourhood gem just like I consider Al's Pizza in the NW to be.

Review #5 of Yelp's 30 Day Challenge 2012"}
{"text":"Very unimpressed with the service at this restaurant! I've been here many times and I've never had a good experience! The staff are extremely rude and food is always over priced and underwhelming. I suggest that the staff learn a thing or two about customer service"}
