{"text":"For an airport hotel, both- food and hotel were wonderful. Nice menu and service was outstanding."}
{"text":"My wife and I live in the Pittsburgh. We saw the great reviews on Yelp and figured we would try Bellfarm. What a disappointment. I am not a harsh food critic ( see my other reviews on Yelp). Hands down this is the worst place I have dined at in over 25 years. Horrible experience. The local Sheetz gas stations have better fare. 
The service was lousy and slow. The cutlery was not clean. The food ( I had the veal and my wife had seafood) was virtually inedible and had not flavor. This place must survive on patrons from the hotel who are captive without other options. Even if you are at Hyatt for overnight stay do yourself a favor and Uber to nearby Robinson Town Center ( 8 minute drive) which has many other better restaurant options."}
{"text":"Wow, this was an unexpected pleasure.  Colleague and I had dinner here at this hotel restaurant.  I was able to taste her pork filled ravioli and it was utterly define.  Made me drool.  I had a great chicken minestrone soup and splendid salad.   Was wishing I ordered some other items on the menu, but there's always next time.  For dessert I just couldn't decide.  So many items to choose from but I ended up with an old favorite - Cream Brûlée. It was excellent."}
{"text":"Had a quick overnight in Pittsburgh and stayed at the Hyatt connected to the airport which is incredibly convenient.  Not a lot of options outside of the airport and the hotel restaurant.  Overall, had a great experience.  My server, Sequoia, was so sweet, though trying to figure out if everyone in Pittsburgh calls women \"honey\".  Anyway, had a great Mediterranean salad chopped full of garbanzo beans, lentils, fancy olives, feta and cucumbers.  Plus at $8 for a large salad, it was a total steal.  They had some other items on their menu that looked really good.  Also recommend the local \"Church\" brew if you are a fan of beer."}
{"text":"2nd time to eat here. Have had the fish and chips and Caesar salad with salmon, really fresh and big portions! Food is delicious and wait staff is awesome. Have had Holly both times and she is so sweet! Great place!"}
{"text":"This place is fantastic! It's beautiful inside and the food was fantastic!! The waitress and hostess were so nice as well! I would definitely go there again!"}
{"text":"This is a very good hotel type of restaurant.  Unfortunately you are kind of forced to eat here because this is an airport hotel which means alternatives are limited.   As is expected the prices are more expensive than they should be and the service is very corporate.

I ordered a filet for dinner cooked rare.  The meat was of good quality and cooked perfectly. It is hard to get a perfectly cooked rare steak but they did a good job. I also had 3 glasses of Pinot Noir.  I had the house version which was adequate, but definitely more affordable than the other wine offered.

I had their breakfast as well.  It was the typical hotel buffet.  This is nothing special but pretty much the same as other hotel buffets.

The bottom line is this is your typical hotel restaurant.  It is generally good but overpriced with a definite corporate vibe.  I will eat here when I stay at this hotel, but I would not seek it out."}
{"text":"This place acts like they're doing you a favor by waiting on you. The bartender, Matt, is especially unfriendly and crass.    If not recommend this place except if you're staying at the hotel there isn't any where else to eat save the airport.   Pass on this place if at all possible, especially Matt"}
{"text":"Came into Pittsburgh for a work related day-trip focused on tourism and business travel. Our hosts from the airport scheduled lunch for us at the Hyatt's BellFarm restaurant. The place featured a farm-to-table menu and the food was outstanding. The staff was very friendly and the prices were reasonable.   I had the Yuengling-battered fish and chips (Yuengling is a western Pennsylvania beer producer)."}
{"text":"I traveled to Pittsburgh on business last week. Traveling from California is not easy. It was my first visit, so I asked a rental car agent if there is any restaurant serving a breakfast ( it was close to noon) or should I get a deli sandwich at a shop in the airport facility.  I was advised to go to Hyatts. He was right about it. Among all the Hyatts I have stayed, this restaurant is by far the best for the price! The space between tables is spacious enough to leave my suitcase. I got a cup of coffee immediately. It was really good. I decided to take a buffet.  Every item was fantastic.   Sausage, pancakes, eggs, Cheese casserole hash brown and bacon were cooked wonderfully. I believe $18 plus sales tax is reasonably priced, especially considering that this restaurant is located in the airport Hyatts.  
The service was super good.  My waitress came by many times to make sure everything is OK.  It is very rare to get a good service at restaurants located in the airport hotel.  Travelers at the airport are captive audience. 
I am very happy that I did not grab a cold deli sandwich at the airport convenience store.  After my presentation, my business partner in Pittsburg liked me and invited me to come back soon. I look forward to having a breakfast here again."}
{"text":"Nice job Hyatt! Of all the Hyatts I have stayed at this restaurant is by far the best, at least for food!

The decor was modern with very nice table spacing that did not make me feel cramped. Brightly lit and rather spacious the place never became loud despite having fairly high ceilings and a good sized dinner crowd. 

I ordered a lemon drop martini and the fish and chips. Now, I'll admit I was envisioning what I had seen in most places - many little pieces of fish and some fries. Instead what came out was a very large fish fillet that was breaded very lightly and plenty of delicious fries. The fish was fantastic. It was cooked wonderfully, the breading was crisp and salty, and the fish itself was flaky. It was amazing. 

The service was below average. Our waitress came by only twice - to take our order and deliver the check. Someone else delivered the food and as I charged the food to the room I didn't even see who took the bill. Our water glasses and our martini glasses were emptied without anyone offering to refill our water or ask if we wanted another drink. No one else checked on us. I would normally be more forgiving if they were packed and extremely busy but they were only moderately busy and I saw plenty of staff, but they were rarely in the dining room instead frequently disappearing in the nearby kitchen often with nothing in hand and ignoring my pitiful attempts to flag someone down. 

The food was easily a 5, the drinks a 4, but the service was a 2 at best."}
{"text":"Nice place to visit while at the airport.  This is not a go to destination but good service, decent seating, and ceilings that make one feel in a much larger space.  Liked the menu.  Nothing special but still firm.  Good bar and preparation.

Roy"}
{"text":"This place deserves more than 3 stars! I had a veggie burger and was impressed with the quality. Definitely one they made in house rather than a quickly fried frozen one like you find at most places. 

Generally I'd say it's 4/5 stars but let's bump it up considering it's an airport/hotel restaurant and those have a tendency to be awful. The fact that this one is good at all pulls more than 3 stars in my book!"}
{"text":"I just ate the worst thing ever at this hotel/restaurant.  It was duck over ramen noodles with snap peas, mushrooms. I asked the waiters if it was like a soup. She told me no, thats more like a sauce. It sounded great since you can never go wrong with an asian style duck over noodles and asian style veggies. Instead i got a bowl of ramen noodle soup with shoe rubber textured duck. This dish lacked taste, creativity and anything that should be asian. Chef should be ashamed to have that on the menu. Never again."}
{"text":"In town for the Steelers - Patriots game and stayed at this hotel.  Love the decor and overall setting.  The food was pretty good.  We both had the burger with some fries.  

The service was great.  Our waitress was friendly, funny, and efficient.  The people working the bar were also great and they turned the TV to the Cub's game.  For an airport hotel and bar, this place was pretty spectacular.  We'll definitely be back next time we're in Pittsburgh."}
{"text":"Staying at the hotel and being unfamiliar with the area, didn't want to venture far. Came in for lunch and sat at a cozy table with pillows, which was very comfortable seating. Service was quick and friendly. I had the shrimp po'boy which had a flavorful sauce on it and overall was very good. Also had fries and side salad. In general, food was good and better than what I had expected from a restaurant in an airport hotel."}
{"text":"This place is very convenient if you are flying in or out.  Good food instead of the late night open fast food. My family flew in for the Steelers vs Greenbay game and are on our last night... we are still on Hawaii time so it's nice that they are open so late when we were hungry. Servers are really pleasant. Food good"}
