{"text":"My husband and I visited this restaurant a few weekends ago and were very impressed. The food was exceptional. The portions were a perfect size. We are already planning on coming back in a few weeks."}
{"text":"I can't say enough about this restaurant. I have zero complaints and I can't normally say that
The service was impeccable the staff was super friendly and genuine and made sure we were well taken care of. 
The food was sooo good. My husband and I shared the caprese to start and it was so good. The bread for the table was fresh and delicious.
For our meals we had the grilled salmon which was the best I've had so juicy and full of flavour.
We also had a dish I can't pronounce or spell but but it was pasta with seafood with pizza dough baked on top... to die for. 
Everything was presented well and the atmosphere was warm and pleasant
We will be back and in fact will probably be regulars"}
{"text":"This restaurant has become a favourite of mine. Every time I come to Kleinburg, I hope to visit. They serve an amazing baked eggplant pasta, as well as incredible calamari and a wide assortment of pizzas. Staff are all incredibly friendly and welcoming. A great atmosphere, perfect if you want a nice romantic date. It's a beautiful traditional Italian restaurant, with absolutely stellar food. If perfection was a restaurant, this would be it."}
{"text":"Good  attentive service and food was really good. Ordered the seafood linguine (wrapped in pizza dough). We were at the bar so had a chance to see the kitchen hard at work. Enjoyed the first time at Belsito Trattoria"}
{"text":"Every things are nice with friendly staff.the dishes are so tasety but the prices are a little bit high."}
{"text":"Excellent from start to finish. Arrived late for our reservation and were seated right away with no issues. Our waiter Brian was amazing. Very personable and knowledgeable. Checked on us frequently to make sure we were ok and topping up our drinks. Food was fantastic. Started with the arancine and they were simply delicious. Wife ordered the gnocchi and I had the seafood risotto. Both were perfectly cooked and just the right portion size. For dessert we shared the apple crumble. Came to the table piping hot like it was freshly baked. Chef/owner Gino came by to chat and make sure everything was okay. Will definitely be back many more times."}
{"text":"Good food good service good atmosphere
Would like to see some pasta dish without meat"}
{"text":"Was there for dinner with girlfriends, had a reservation for 6 but only 5 made it. I didn't realize they had a patio and when I got there before the others I noticed tables open and advised I wasn't sure where everyone wanted to sit but they quickly told me inside as they would have to put 2 tables of 4 together so that wouldn't work. Ok moving on inside it is.

The service was great, no complaints there.  The others liked their drinks, my margarita was just ok didn't taste fresh, the lime juice was too \"chemically\" tasting, that's fine, the wine with dinner was good.

Our appetizers were good no complaints there.  The complaint I have was the main dinner I had gnocchi with lamp shank mixed in and it was stringy, too chewy and not very tasty I don't think the lamb was fresh.  Two had the eggplant ragu pasta and I think they enjoyed it and 1 had the veggie risotto again I think she liked it.  I noticed there weren't many vegetarian options.  Another friend had the sea bass which was a special and didn't realize as she wasn't told all the skin was on it and the tail eww so they were nice enough to take it off for her but she said it wasn't great when we chatted about it later, didn't enjoy it.

I don't think I would be back unless for drinks/appies it didn't offer anything that blew me away."}
{"text":"Summary: Service and ambiance is very good. Food is good but not great. 

We had the calamari and Thai tiger shrimp to start. Maybe 5-6 calamari rings and 2 tiger shrimps grilled nicely topped with a bed of salad in a sweet balsamic vinegrette dressing, likely to make the dish look more full of food. They also provide warm bread with hummus and olive oil and balsamic vinegar to start. We ordered the seafood risotto and spicy calbrese pizza as entrees. Risotto was good but it was more like a paella rather than what I was expecting for risotto. Pizza was thin and crispy but for some reason a bit tough to cut despite them giving me what resembled a steak knife to cut it up with. What I really liked was their chilli oil. If you like spicy, ask for that. It's apparently made in house (what the server told me). Best part of my meal was their chilli oil. 

Since I was just at Basilico restaurant last week, I can easily compare the risotto and pizza to Basilico's. I would say Basilico had better food. BUT, I enjoyed the service at this restaurant. Wait staff don't seem to be assigned to just \"their\" tables. They help each other out and just service your table as needed and as they see fit so you don't wait long for service. Also, food comes out way faster here vs Basilico. Within 5 minutes we had our starter and within 15 minutes of ordering we had our entrees (but maybe it's worth the wait at Basilico since the food was more well prepared). Dessert came in 5 minutes of ordering. 

As for alcoholic drinks, I wouldn't recommend the old fashioned. Missing brown sugar, orange peel, and overall doesn't get close to what a good old fashioned tastes like. TheB-52 coffee was good, though - shot of espresso mixed with Bailey's, Khalua and one other liqueur (escaping my mind at the moment) and topped with whipped cream. 

For dessert, we had the apple and cranberry crumble topped with ice cream. I wouldn't recommend it. It's OK but too much sauce and not enough crumble and I don't even recall tasting much cranberry. 

Overall, a good experience and I'd come back since I live in Kleinburg and it's minutes away and located in the Kleinburg Village."}
{"text":"Eating at an authentic Italian restaurant always makes me feel like a bit of a foreigner. For a non-Italian person, the menu always looks like pure gibberish at a glance and you will probably feel a tad out of place compared to the rest of the crowd dining in. Nonetheless, I still love Italian food and usually have a pretty good experience - Belsito Trattoria was no different!

The restaurant was beautiful inside and out, located in a small little plaza in Kleinburg, Vaughan. The service was good - our server was attentive and friendly, and food came out fairly quick. 

As for the food, I had the \"fior di latte e pomodori arrostiti\" to start, which is described as fior di latte mozzarella, 24 hr. oven roasted San Marzano tomatoes, and peppery arugula salad ($14). This appetizer was just okay in my opinion - nothing too special. I thought the cheese was bland, but the tomatoes were cooked really well. It was however overpriced for the amount of food you get and I probably wouldn't order it again.

For my main course, I ordered the pasta casareccia al forno - baked casareccia pasta with roasted green zucchini, charred peppers, caramelized onions San Marzano sugo/asiago, and mozzarella cheese. I really liked this dish! The pasta was made just right, not too hard or too soft and the tomato sauce, cheese, and veggies definitely made everything taste flavourful and delicious. Yum!

Overall, this restaurant was a decent choice for an authentic Italian dining experience. It was more of a one time thing for me though, as I did have to travel a bit further than usual to get here. I can see why other people like this place so much (based on other Yelp reviews), but I probably wouldn't return as nothing really \"wowed\" me. It seems like it'd be a great place for hosting intimate events as well."}
{"text":"The portions are small, however they do have good flavour. Would like to see bigger portions for the price. The service is alright. They were very attentive at the beginning, but then left us unattended for an hour when we were trying to get our bills. So we had to get the server ourselves. We had 3 different servers serving us."}
{"text":"Enjoyed a lovely lunch with my mom here on a weekday.

Our server was lovely and very attentive.

We started with the mushroom appetizer to share - it was delicious. Roasted wild mushrooms with frisee lettuce, and savoury cheese, so good! Our server also brought us some fresh bread with a little bit of house made hummus, olive oil and balsamic vinegar.

For my main, I went with the spelt veggie spaghetti with ricotta and pesto - amazing! My mom selected the pizza with spicy salami and she loved it.

The restaurant itself was beautiful and I think would be excellent for a date night as well. 

Absolutely will return again!"}
{"text":"My sister and I thoroughly enjoyed Belsito Trattoria. That atmosphere was very pleasant and the food delicious! Pino, our waiter, was charming and directed us to a wonderful wine and meal. Definitely worth a return visit!"}
{"text":"The most amazing experience I have had in a long time - we will be back frequently.
Spectacular atmosphere - A1 Service 
Would give 10 stars if I could!!"}
{"text":"I can't even begin to tell you how amazing this place is.  All the food is so fresh and absolutely  delicious.  The 4 if us had pizza, pasta, goat stew, surf 'n turf, and a few desserts, all made in house! Service was amazing.  By far one of the best restaurants I've been to, and can't wait to go back again!"}
{"text":"Food and ambiance were both beautiful. The floor manager ended up waiting on our table and he was engaging and a delight to be around. Best wishes to him and this lovely restaurant."}
{"text":"Overpriced, mediocre food. Had birthday lunch with some friends, My friend's beet salad was a disappointment. They claim it was roasted beets, tasted like rubber over cooked parsnip. My own meal was also nothing to rave about. And we spent more there for lunch and left hungry. 

It had so much potential with its location. Very disappointed and will never go back."}
{"text":"the perfect family night out. 

 we've been out here before and we've enjoyed it . we had gotten here at 6 o'clock. The place was slammed with not a table left. 

 the salads are very tasty and plentiful. the house red is a beautiful Merlot, I highly recommend. 

The pasta dishes were a hit. 
Truffle gnocchi was an A.
Spelt Pasta was an A
Seafood Pasta was a B - would have liked a little more seafood and a little less pasta.

Service and Staff are an A.

Looking forward to my next visit."}
{"text":"My husband and I just recently moved into the area and were looking for a great local restaurant. We found Belsito Trattoria from the yelp search and thought it looked fabulous and couldn't wait to try it out. Unfortunately I wouldn't be able to tell you how the food taste because no one ever came to take our order. 
The restaurant hours show that they close at 10pm and we walked in just before 9pm. While we were being seated a waitress stopped us to tell us that if we're planning to order food, the kitchen staff is closing the kitchen. I said if the Kitchen is closed then it's okay we'll come back another time and she said no but they're \"closing real soon, REALLY SOON\". We assured her that we will quickly look through the menu and order. We sat down and watched as the wait staff served everyone else for the next 15 minutes without looking over at our table.  We made the decision to leave at this point. The lack of service upon our arrival and then while we waited for our (rushed) order to be taken have left a negative impression of your restaurant - which is unfortunate considering we live down the street and would have love to come by often.

We walked a couple of doors down and went to another restaurant. That restaurant closed at 10pm as well but when we asked if they mind if we sit down for dinner they said \"there's plenty of time\" (what a difference in attitude).

My husband and I do enjoy going out to dinner and we read Yelp reviews on restaurants to understand the atmosphere and get an idea of what to expect. As you can see I don't write many Yelp reviews myself but I really do want others to understand what happened. Regardless how delicious your food might taste, your lack of service really cheapens the place."}
{"text":"Nice place, very good food!!! decor is beautiful!!! will be coming back again. Perfect place for brunch!"}
{"text":"Really good food and great service.  Beautifully decorated place and perfect setting in Kleinburg.  Only wish they had more vegetarian options.  Otherwise a great place to spend the evening!"}
{"text":"Gave this place another try and I have to say my opinion has really changed. The service was top notch and the food was exceptional. Will definitely go back for business meetings or a nice night out with the family."}
{"text":"First time dining at this restaurant. I booked it for a friend's 50th dinner celebration and it exceeded my expectations. Location is great in quaint Kleinburg and I can't wait to return on a warm summer night to enjoy the ambience that brings. They allowed us to bring a cake which was a great start. Service was great from beginning to end, prompt, attentive and apologetic for a tiny mix-up. I usually judge a restaurant by the bread they bring to the table. Two thumbs up for the warm bread and hummus that was also replenished during the evening. Perhaps an olive tapenade would have made me even happier. My friend and I ordered the gnocchi with a sauce substitution of wild boar instead of the gorgonzola on the menu. They were very accommodating and we are still raving about how delicious it was and how tender the meat was. One friend ordered the salmon, which she says she will return for, she loved the root vegetables and drizzle that came with it. Another friend had the baked pasta with vegetables. It tasted better than it looked. The only reason I gave this review a 4 and not a 5 is because the pizza was good but not great. The dough was tasty and crisp but perhaps bocconcini instead of mozzarella would make it special. Overall, we had a wonderful experience and plan to return again and again."}
{"text":"Nice atmosphere. Food was good. Me and my friend ordered pizza and rigatoni with eggplant. Sauce was amazing on both the pizza and pasta. No complaints about the pasta. The pizza was good, could have used a little more toppings since it was $18, it also had too much flour on the bottom and crust of the pizza."}
