{"text":"My family has had quite a few dinners here, and has never been disappointed. We usually get the Bento boxes which contain a good variety of items, with tasty sauces.The shrimp tempura is good. The restaurant is very clean and food is consistently well prepared. Never had a bad meal. The meals are topped off with those interesting little ice creams. Just a good experience."}
{"text":"Best Chinese in the south hills! Wait staff is always attentive and prompt, sushi has never disappointed. You will never have to wait to be seated, but I can't understand why beni-chop isn't always packed with people?"}
{"text":"My fiancee and I used to visit Benichopsticks on a monthly basis. The sushi they offered was of top quality, and their prices were very reasonable. However, on the last 3 visits, we've noticed a remarkable decline of both quality and quantity of our typical sushi orders. 

The size of the fish on the nigiri has dwindled significantly, and the cuts have been rougher. The fish in the maki has also decreased in size; one of my staples was the \"Rainbow Roll\", but the order I received during our last visit was roughly 1/4 smaller than what we were accustomed to. The sushi chefs have not changed, so we're thinking that they have been told that they were being a bit too generous in their portions and are cutting back a bit. 

Additionally, the last time we visited, there were a large number of fruit flies in the dining room, and we were constantly waving them away from our food.

We will visit again at the beginning of the new year, and I hope I can report that this was just a series of unfortunate dining experiences. This is/was one of our favorite restaurants in the area and we'd be sad to stop visiting, but if this downward trend continues, it's unlikely we will visit in the future."}
{"text":"We loved our experience here! They explained everything to us! The waiter was really polite. The chefs did an awesome job with our food. There was a lot of detail in the food preparations. We will definitely come back!"}
{"text":"Very fresh fish, seafood and sushi all set in a pleasant & helpful environment. Great for business power lunch or an intimate evening out with family or friends."}
{"text":"Decent.  They are one of the only chinese places around that deliver to where we live.  The service is always good (take out or delivery).  Good moo goo gai pan, veggie lo mien, sushi is good but they roll in salmon eggs so if you are like me and don't do salmon eggs you need to let them know or you won't be happy.  I am not sure I would dine there only because I don't dig the vibe.  Net-net good fresh food reasonably priced and they deliver!"}
{"text":"The food is very good and of high quality, yet the service is...for lack of a better term...quirky.  I thoroughly enjoy going there and have never second guessed the quality of their Sushi.  However, sometimes I feel like I am under the ever-watchful eye of our server, who moves like a shadow in broad daylight throughout the tables, only to pounce and refill my Iced Tea!  But then again, that has seemed to be part of the charm of this place.  Oh well...I will  be back!"}
{"text":"This is quite possibly the worst restaurant I have ever ordered from.  I should have just lit my thirty dollars on fire, because my dinner was completely inedible!  Absolutely disgusting. Oh and I said \"no meat\" 5 times while ordering, I'm a vegetarian, and was served meat regardless.  Call Sesame Inn instead! While you still can!"}
{"text":"It pains me to write this review. I have eaten there on many occasions over the last several years and the food was awesome. When you drive 50 miles one-way just to eat at a restaurant, that should tell you something.  Its been a year or so since my last visit. I was excited to be eating there again. My guest and I placed our orders and eagerly awaited our food.  After that first bite, we were both disappointed. There was no flavor to any of it. It tasted watered-down and the ingredients were not fresh, and not good quality.  The waiter hovered around our table constantly. Not refilling drinks or asking if the food was okay, but seemed to be eaves-dropping on our conversation, or worried that we were going to dine and dash? It was very uncomfortable.  I used to really like this place, but no more. I dont know what caused them to lower their standards, but it really shows."}
{"text":"Don't let the location (strip mall) deter you from coming here.  Delicious sushi! We loved the crunchy tuna roll, rose roll. Yum!  Nice small restaurant. Good fast service too!"}
{"text":"I don't see a lot of Chinese/Japanese places in Southern CA.  We have plenty of both I guess... Anyway, I can only comment on the Japanese side; the sushi in particular.  
I like sushi bars when I'm traveling since you can usually sit at the bar solo and not feel uncomfortable or out of place like you can when you're alone at a table.  Benichopsticks was great for this and the sushi chef was very nice.  The waitress who took my drink order was also attentive and friendly.  The only short-coming was the overall quality of the sushi.  The fish itself seemed fresh enough, but the nari (seaweed) was just a little chewy.   Sort of like when you eat leftover sushi the morning after you bring it home.  Certainly not enough to keep me from finishing it, but by LA standards this was just on par.  
Not sure when I'll be back in the area but if the mood hits more for sushi, I'll probably be back.  The service really was way above average."}
{"text":"Very very good. Try the stir fried general as an option to the original version. You will not be disappointed."}
{"text":"Definitely a fan of this place! For somewhere to go for quick, good chinese food it is definitely a winner. The entrees are very large so big enough to share along with a sushi roll or a salad or something. Ginger salad, philly roll, and amazing chicken were all very good yesterday! The only negative was they gave us these odd ice cream balls wrapped in plastic instead of fortune cookies. I look forward to my fortune cookies! But other than that I recommend."}
{"text":"I have been to this restaurant and do their take out often.  I recently did take out out and was very, very disappointed.  The chicken lo mein was awful.  The noodles were stuck together, cold and dried out.  There was hardly any chicken at all.  The California rolls were a little better but not much.  Needless to say, I will not order again from here.  There are too many other places where I can get better quality food.  I'm sad that the quality has gone downhill."}
{"text":"Best Sushi in town!  Johnny is the best.  Great food, suishi and service."}
{"text":"The food is always pretty good I have no problem with that but when it comes to take out they told me 15 minutes and it's now been close to an hour and I'm still here waiting very unhappy about this if you are busy give a longer wait time so I'm not sitting here wasting my time"}
{"text":"So I am writing this review because I don't want the owners to think that I gave it a bad review just because their Groupon ad was not clear. I had high hopes going into this place. The atmosphere was nice and bright! The staff was super friendly and extremely attentive. However I know my Chinese food and when you can taste that the meat was boiled first and then just tossed in the wok with sauce, that is when I don't agree with the amount they charged for the plate. We ordered the imperial beef, house special tofu, and chicken fried rice. The tofu was good but again it's a plate of tofu with sauce poured on it. The snow peas and carrots were barely cooked. The imperial beef was extremely disappointing, sounded great on the menu, but again the beef was chewy, tasteless once the sauce was all gone and then you can feel and taste the boiled meat. The chicken fried rice was the same. Chicken was slimy and without taste. I would have preferred no meat fried rice if I had know the meat was poorly cooked. So I will never go back to this place because the food was bad, not because of the Groupon that they didn't accept. I don't mind paying for GOOD food, I do mind paying for inedible food."}
{"text":"Chinese food is ok.  Sushi was ok.  Nothing to rave about....  They do have those glutinous frozen ice cream balls that they serve after your meal. That is a nice treat.  They have strawberry, chocolate & green tea to name the ones I've tried.  Definitely try the place out"}
{"text":"My husband and I are HUGE fans of this sushi restaurant.  The quality of the food served is top notch and the staff is very friendly and accommodating.  The décor is outdated and could use some newer modern touches, but we try to make it at least three times a month.  Loves this place!!"}
{"text":"I met my boyfriend here for dinner one night after work. He grew up in this area and remembered the restaurant, although it had been years since he was here.

He got a bento box and sushi boat, and I ordered off the menu. Portions were good and the food was also good. I liked the ice cream balls they served after the meal.

This is a good option if yo're looking for Asian food in the area. I'd come back again."}
{"text":"This place is a great find.  I first tried out the dining room.  The atmosphere is that of any other sushi place in a strip mall - nothing fancy, but appropriate for what it is.  The sushi boat was great.  Ample and fresh, with good rice and a nice variety.   Service in the dining room was good.   All in all, a great meal.   

They also do takeout/delivery.  Awesome!   I ordered a bento with general tsos chicken.  Prompt delivery, well packaged, no complaints.   $13.95 for an incredible amount of food.   I ate the tempura, the dumplings, and the sushi roll and still have a good two meals worth of salad, soup, chicken, and rice left over.  Yum!"}
{"text":"Pretty good sushi. Chinese run, but they know what they doing.

We were driving through Pittsburgh area and needed to stop for food. Yelped this place and it was a good choice.

Sushi was good, sushi rice was very tasty, I just wanted to order more. Salmon was nice and fresh, other fish was good too. Udon was rich and tasty. Not much else to say.

It was difficult to understand waitress, but she was trying, and service was pretty good."}
{"text":"Delicious! We have been looking for a place to get different sushi rolls. The Sweetheart & Mama's rolls were outstanding. The sushi box was amazing - the best fried rice we've had in the area by far. At the end of the meal we got ice cream balls - chocolate and green tea. The ice cream was surrounded by a soft dough shell which was both odd and interesting. It was pretty tasty and a fun surprise to end the meal. We will definitely return."}
{"text":"Very impressed, and I usually don't care for Chinese.  Large portions, very fresh.  The kids loved the \"chicken fingers\", which was sweet and sour chicken they could dip themselves.  Pleasant surprise with a complimentary ice cream ball (I can't remember what it was called) at the end.  The General Tso's chicken was fantastic.  Great value for the price."}
{"text":"I went to Benichopsticks on a Saturday afternoon to meet a friend for lunch. I was pleased to see both Chinese and Japanese options on the menu! Even though they had reasonably priced lunch items, I just wanted some sushi, soup, and salad.... I also got an order of the crab rangoons and they were delish! The sushi was fresh and beautifully displayed on my plate. The ginger dressing on the salad was delicious as well! I had a lovely first time experience at Benichopsticks and will surely return!"}
{"text":"I feel bad giving such a low review because the host and waiter were just so nice and friendly and at your service.
However the Orange Chicken that my mother order came out WAY faster than my two veggie rolls from the sushi bar, and the chicken was discolored and very fatty and un-delicious in my opinion.
The lunch menu prices were very reasonable thought."}
{"text":"Got stuck in a hotel on Mother's Day night with limited delivery options other than pizza. I didn't want to eat pizza that night, OK? So sue me. JK. I went through the options (of course on Yelp, D'uh!) and this seemed like a good combination of quality and value. When I learned they do deliver to that Hilton, all was set. I had veggie bean soup, veggie roll and Lo Mein. Delivery was on time that they specified (maybe a bit sooner). 

All dishes were good, and the Lo Mein was delish. They just didn't give any plasticware to eat with. And, I wish I had asked for more duck sauce. Solid 4 stars."}
{"text":"Had a nice lunch here.  Hot & Sour soup was fantastic - light and fresh.  Eggplant in garlic sauce was also fantastic.  Lots of different vegetables with the eggplant and plenty of food.  Tea was free, and so was the delicious ice cream ball at the end of the meal (in place of a fortune cookie).  Service and atmosphere was great too!  A great deal at a very reasonable price."}
{"text":"Best sushi in the area. 5 star rating based on sushi only. I've eaten here over 100 times. Highly recommend Dinosaur egg and sushi sandwich. Pricing is very fair. $7-8 for basic 8 piece rolls, $11-$13 for deluxe/specialty rolls. All you can eat sushi on Mondays. Chinese food is just average."}
{"text":"Best sushi I have had in the pittsburgh area. The rolls are creative and delicious. Fish is fresh. Wonderful staff. They will remember you if you start going frequently. Sweetheart roll and Christmas roll are my top picks. Prices are reasonable and well worth it for what you get. I believe they have an all you can eat option on Mondays but I haven't gotten it. This place is proof that not all of the best restaurants exist in the city- worth a trip to the suburbs!"}
{"text":"Giving them one star is actually being very generous, I come from the LA area where we have a large Asian population and let me tell you their food does not even compare to anything in LA. Matter fact some of their food is tasteless and some of it I almost barfed up. I ordered glazed walnut shrimp I don't know what they gave me but it was definitely not glazed walnut shrimp. I know what chop Suey stands for noon pig food in the stuffed and doesn't even qualified to be that good."}
{"text":"Best Asian food we've found since we transferred into the area. Best Japanese. We've tried takeout and it was delivered hot and timely."}
{"text":"We got take out sushi and it was so good. Fresh, tasty and good combos to choose from. The mushroom tempura sushi was like nothing I've ever had. I love avocado tempura but the mushroom was awesome. And FINALLY a place in southwestern PA that makes decent spicy mayo. Finally. Will def be back."}
{"text":"Absolutely, the most uninspired and cheaply prepared Chirashi sushi dish I have ever had. I wish I took a picture to submit with this review. The fish were paper thin pieces of the least expensive types available and placed over a small mound of flavorless sushi rice. Sashimi pieces of fish are the norm in this dish but what I received were the leftover slivers that wouldn't make it to a piece of nigiri. To make matters even more insulting, the owner stops by and asks how it is. I asked he he really would like to know my opinion. When I politely told him that the fish was not what is traditionally used and very disappointed, he said theirs is different and less expensive. $16.00 is not a cheap price and I would prefer to pay a couple of dollars more for standard type sashimi meal. At this point, most owners or managers would ask if meal could be replaced or at least make a gesture of good will. Nothing here except to turn and walk away and then say something in Japanese to sushi chef so both can turn and look at meDon't ask the diners opinion if you are just looking for compliments. I would go elsewhere if authentic sushi is what you are after."}
{"text":"Great All you can eat sushi on Mondays!  Comes with soup and salad!  Very fresh and the staff is really nice!"}
{"text":"One of the best sushi spots around the Pittsburgh area. Amazing lunch specials. Great place overall."}
{"text":"We were in the area and wanted sushi, so we looked on Yelp and found Benichopsticks. We only ordered sushi: a couple special rolls and eel over rice. I'm not usually an eel person, but their eel is very good. One of the best I've ever had. Really liked the rolls as well. They gave us two complimentary ice cream mochi to end the meal (vanilla- and coffee-flavored). How nice! 

Service was great. Our server was very sweet and always had a smile on his face. We ordered two rolls to go and specified we didn't want any sauce on one of them. He came to show us what the rolls looked like and asked if they were okay before closing the box and putting it in a bag. When boyfriend was on the way to the bathroom, they had a brief chat about Clash of Clans (haha). 

Only complaint though is that the food--at least the sushi--was pricey. Our rolls were $12-13 for just 8 pieces of sushi each that are kind of on the smaller side. The eel over rice was around $15 for a pretty small portion I thought. 

Taste | 4
Atmosphere | 3
Presentation | 3.5
Service | 4
OVERALL | 4"}
{"text":"The freshest sushi in the suburbs of the Burgh.  It doesn't look like much from the outside, but don't let that stop you.  The food is really good!"}
{"text":"My go to for sushi in the area. I usually start with a miso soup and seaweed salad. My husband and I share crab ragoons and then I always order the triple tuna roll! It's to die for!!! Highly recommend."}
{"text":"Great sushi and lunch special in Canonsburg. The staff is friendly, the restaurant is immaculate and the sushi is wonderful. Will definitely be going back to enjoy some different rolls!"}
{"text":"Service is a little slow but definitely worth the wait. Probably the best sushi in town! They also offer Chinese food for those that aren't into raw fish."}
