{"text":"Good food, good service, close to home... This was our first time at Benji's. I had the wedge salad, fried shrimp, seasoned fries. The portions were very generous, blue cheese dressing was good, breading on the shrimp was tasty. My husband had a Caesar salad (flavorful and huge) and shrimp linguine. He enjoyed both. We took home a slice of chocolate cake which was also good. Service was excellent,  and we felt it was a good value. We will definitely be back."}
{"text":"Have eaten there four or five times and find The food to be excellent quality and the portions more than adequate.  When I return to a restaurant for the second or third time the main thing I am looking for is consistency, this restaurant has it hands down no problems whatsoever. It's a very nice place, service and staff is great, and they pour a nice drink.  Over all I think this is a great restaurant with great food at excellent prices.  Great place for adults as well as kids and grandkids, will go back often."}
{"text":"Have had 2 great experiences here so far and will continue to return! Both times my girlfriend and I ordered a Vinny roll- very delicious. Have had a \"special\" of blackened yellowtail and scallops. The yellowtail was good, but the scallops were great! Also, warily tried a surf and turf burger in order to see if the crab cakes were decent here (could still eat just the burger if not), and it was delicious!! Will gladly order burgers and/or crab cakes again. Service has been quick and personable each time."}
{"text":"Benji's opened a few weeks ago and we visited during the first week.  At the hostess stand we asked if they had WIFI and no one had a clue.  It turned out my six year old was able to locate the WIFI signal before anyone could answer the question.  Not a big deal, but someone should have known if they had free WIFI to customers given the connectivity of everyone and especially with kids with new IPads and IPods for Christmas.  Now for the food.  We ordered the calamari for an appetizer and it was horrible.  Completely fried to the core and had zero taste.  No dipping sauce either.  I ordered the \"special\" which was grouper.  The fish was okay, but the sauce on top was terrible.  I had to take a napkin to clean the fish of the sauce before eating.  The wait staff seemed to be disconnected from the kitchen or vice versus since all of our food came out at separate times to the table and they completely forget our daughter's dinner and we had to ask twice.  Overall, the first impression was not good.  Hopefully they will get it together since they are located very close to our neighborhood and it would be nice to have another restaurant choice on Eastfield road."}
{"text":"Love, love, love!!  Sushi is fabulous and the hamburgers are by far the best I have ever eaten!  Will definitely be back for another round to try something new!"}
{"text":"Temper this review with a spot of skepticism; the joint is new, afterall. It was a late afternoon when \"the man\" decided to let me leave for the day.  Heading home, I saw the glowing sign of a new restaurant right around the corner from home.  Not having any other plans, I decided to stop in, snap a shot, and belly up to the bar for a bite to eat. Being new, Benji's Grill was hopping with early adopters; the wait for a table reached an hour.  Being a party of one has its advantages, so took a spot at the bar and chatted with the barkeep (starting, of course, with \"What's on tap?\"). The menu was large, and ranged from sushi to steak.  I opted for the house's special Crab Dip as an app and the Fish n Chips for the main (it was Friday after all).  When both arrived, I had to blink twice, and not in a good way. The Crab Dip was little more than melted cream cheese and sporadic (and minuscule) scraps of crab.  It was covered with an unidentifiable melted cheese that added more chew than taste.  It was served with fried wanton chips that, sadly, were the best part of the dish.  After sampling enough, I turned my attention to the Fish n Chips.... Four pieces of fried cod no bigger than a Snickers Fun Size were atop microwavable seasoned fries.  I was shocked at the portion size-to-price ratio; at $16, it was by far the least amount of fish-n-chips I've ever had before me.  I decided to reserve judgement until the first taste, hoping for something salvageable in this experience.  Sadly, my hopes would go unanswered.  The batter was generic, the fish was slightly under cooked, and the fries, well...I've had better out of my freezer.  The cole slaw was about the only thing I raised a delighted eyebrow to. There are two things to remember about this review: 1) The place is new and they should age like a fine wine.  I'll certainly go again (due to the proximity of home) and try some new things, preferably when not as crowded, and 2) They had a decent sushi list that may just be their salvation.  The service was outstanding, and every member of the staff was super delightful.  Their barkeep was really cool, and she mixed drinks the old fashioned way!   Benji's Grill has all the ingredients of a cool little neighborhood spot, they just need to work on the recipe! Noosh! Ray J."}
{"text":"My partner and I decided to give Benji's another chance since we got a free dinner coupon in the mail (on our first visit, we were not impressed with the food).  Big mistake!  At any price, this place is not worth the time to visit.  We waited 30 minutes on a not-so-crowded Saturday night for the following:  I ordered the Shrimp and Sausage Pasta.  Other than the bits of sausage, it had absolutely NO taste.  Everything was cooked well enough and the presentation was good, but there was no flavor at all.  I tried salting it to no effect.  Nothing was going to save this bland dish.  My partner ordered the special, Fried Chicken with Macaroni and Asparagus.  The chicken was a little over cooked and was too salty.  The mac and cheese and asparagus had NO flavor.    We did order an appetizer, the shrimp tempura.  As this appetizer generally does not have too much flavor anyway, they mastered it.  Although Benji's is conveniently located for us (we live in Highland Creek) and although the atmosphere is upbeat and inviting, there is no way we will ever visit this place again.  They could offer me free meals for life and I would not go back.  In our book, two strikes and you are out."}
