{"text":"Holy cow! These slices are bigger in person than on pictures! I ordered their Oct special which was the smoked pork pizza and my friend ordered pepperoni. Both are delicious. I will come back to try their other ones! Best pizza I had in a while."}
{"text":"Literally the best pizza in Charlotte if you like thin crust the size of your face!! When you walk in the people are super nice and friendly. It's been a date spot for me and my lady when we want a chill night. And they are open late!!"}
{"text":"Great first experience at Benny's!  Staff was friendly and helpful, prices were very reasonable, and pizza was perfect!  Also grabbed myself a craft root beer to wash it down.  Will definitely be back."}
{"text":"So good! The pizza is soooooo GIANT and DELICIOUS!!! They have drinks. (Buy a snapple) it is so good! They are open on the weekends until 3 AM! So, the pizza. I got a pizza box. It was so big I had to lower my window, and move my seat all the way back laying down for the box to fit. The pizza barely fit on my big plate. I was so amused and confused as to why I did not eat it yet. My pictures will tell you it all."}
{"text":"I don't like to complain about restaurants but this is the worst of the worst. Horrible service, staff are bullies, and the manager is an alcoholic mess. Do not bring children here as mine were hooted on by drunks and disrespectful staff. The cashier was rude and charged me $1.35 extra and I didn't notice until after. Never go here I beg of you!"}
{"text":"Awesome pizza but the service is lacking in a big way. I ordered online via Grub Hub (which the Benny's site referred me to). GH indicated would be ready between 5:25-5:35. Arrived 5:35 and they had no record of my order. I was asked how I ordered it, if I had paid (which GH requires), and was asked to show my order from my phone. Almost as if the employee had never dealt with an online order. I'm currently sitting 15+ minutes later still waiting for my order. Save yourself the hassle and just walk-in. My husband ordered via phone a month or so ago and arrived and they'd given his pizza away to someone else. Clearly the staff can't handle phone or online orders. Disappointing because their pizza is good but I likely won't be returning when we are 0-2 for service."}
{"text":"Awesome pizza at an even better price!! Huge slices and great service! I will keep coming back!!"}
{"text":"Don't even think about tipping. You receive zero service. I can't say the last time I encountered such horribly rude staff. No employees there cared about anything. They were just rude, obnoxious stoners that don't care about you or food cleanliness."}
{"text":"Service was bad - took 5 minutes for someone to take my order despite no one else waiting. Pizza was good overall, huge slice. Got the garlic mushroom and hard to see why it is called \"Garlic\" on its own - couldn't taste a bit of it. They did have garlic powder available for me to dump on it.  Mushrooms are canned, not fresh. I'd probably go again if I was in the area but can't say I'd go far out of my way to go back."}
{"text":"Soooo good. Best pizza in charlotte. Wish they'd get a soda fountain though, no refills on cans."}
{"text":"I have been to this place several times now.  It's all the slice!  First off, what a fun way to have a slice of pizza.  The building itself is also pretty cool."}
{"text":"I have heard about Benny's for a while, but my wife and I finally got over to check it out. The atmosphere is fun and relaxed, and in true NODA fashion, a little bit funky. The size of the slice is worth the visit.  It was massive, and I tried to down two slices, but didn't make it through the crust.  The pizza has a great taste. It seemed like the pizza was made from high quality ingredients, and I enjoyed the slightly sweet tasting sauce. Definitely will go back, and the next time our family is in town we might just order a full pie, which would probably feed six people."}
{"text":"I'm a NY'er and a pizza snob!!! This place hands down gets it right!!! From the size to the service to the taste this is the place!!!"}
{"text":"The crust. OMG the crust is to die for. The grab and go drink station is also cool. Plenty of choices"}
{"text":"So delicious!! They have picnic benches outside so you can bring your dog, but you can't take beer out there with you. But great pizza!"}
{"text":"Here we go. Okay...so you know how sometimes you will look up the reviews on a restaurant and pretty much everyone is RAVING about it? But then there are 1 or 2 people that say it is horrible...and you think to yourself \"well it's just those few people...the majority of people love it!\" so you try it out anyway and then wish you listened to those people? I'm going to be that person. Listen closely. To put it shortly for those that don't have the time to read a long rant: it's TERRIBLE do not go here! Go to Pure Pizza instead! It's only 10min away from this place and is amazing! Okay so for the rest of you here is my long rant. My husband and I went to go try this place yesterday (and before you think to yourself...\"oh they're probably just some old married couple with no sense of taste...we're actually 26 and 28yrs old), we got there around 4:45pm and no one was in there...which was to be expected during that time. We ordered our pizza (I got the buffalo chicken and my husband got the garlic mushroom) and then sat down. All of the tables were GROSS. It had a \"we're such a cool and hip place that we don't need to put any effort into cleaning\" type of vibe to it. This place just opened I think about a week ago...you would think they would put more effort into cleanliness. And like I said, it was dead during this time so there was no excuse for someone not to be going around and cleaning the booths and tables. There were about 6 workers here during this time. There was powdered cheese all in the crevices of the table as well as all in the booths, I had to wipe it down before I sat. Even after this I still had hope...I can look past those things if the pizza is amazing. So the pizza came and the slices are huge...but that's where the positives end. I could tell right away they used cheap and poor ingredients. The \"chicken\" they used on my buffalo chicken pizza had those fake grill marks on them, you know what I'm talking about. Also it was just a slice of cheese pizza with the \"chicken\" buffalo sauce mixture piled on top. Like...the chicken wasn't actually baked into the pizza. Same goes with my husbands slice. It was a slice of cheese pizza with the mushrooms just piled on top. Super cheap ingredients. Low quality cheese. To top it off I asked the girl for a side of ranch and she told me it would be 50cents. I thought this was super tacky considering we had already sat down. To make it better I tried the ranch and it was not homemade ranch! I paid 50cents for bottled ranch! Horrible place and I'll never go back. Pure Pizza is 10min away from this place and they have amazing fresh pizza. They use very high quality ingredients. They source everything locally and both their crust and sauce are made from organic ingredients. Do yourself a favor and go there instead. Yes they are more expensive but there's a good reason why. I'm sure this place will flourish anyway. People who think they are hip and drunks will keep this place alive. End rant."}
{"text":"Touring band VINILOVERSUS this is our first time playing in Charlotte! Amazing pizza! Better than what I have eaten for this year (pizza wise) Great place totally recommend it!!!"}
{"text":"Excellent location with great pizza. It was so great, I left after eating one piece, came back and got another one. Fine, fresh and HUGH!! Likely a number of the greatest pizza I Have had in all of Charlotte. I am thrilled for a pizza location like this in the NODA region. In the event you would like great, fresh and truly BIG pizza, this is actually the place to really go. Will definitely be coming back!"}
{"text":"I usually dont leave comments unless i really like or hate the place. Stopped in after a run and grabbed a slice. Prices are great and the pizza is really good. Looks to be still getting in the swing of things. I saw that beer is coming soon. If they can keep pints reasonable this seems like a great Friday after work meetup spot to start the night in Noda."}
{"text":"Love the big slices and quick service. Reasonable price and chill atmosphere. I'll be back."}
{"text":"the cheese pizza is probably the best thing they have. whatever toppings you order on the slice will just get thrown on there and reheated. our toppings were still cold. Their slices are large but cost 4 to 5 dollars per slice. thin crust and crispy but definitely not that flavorful."}
{"text":"Amazing! Best NY style pizza in Charlotte.  You only need a slice unless you are weak, then order two."}
{"text":"Definitely Jersey-Style boardwalk pizza. Huge delicious slices with great crunchy crust and just the right mix of sauce and cheese. Our only disappointment after two visits there was the very unclean rest rooms. Sort of an appetite-killer if you're eating in. I hope that they read this and step up on the cleaning duties."}
{"text":"I think this may very well be my newest favorite pizza place in town. One slice is pretty filling! It's certainly worth trying if you haven't already. PLUS, they have an excellent local brews selection!"}
{"text":"Benny's is the best spot I've found so far for slices. Order a slice, wait a few minutes, and they holler your name. The drink selection is pretty cool with some stuff you don't see everywhere. One slice is filling. My only suggestion/complaint is there isn't enough cheese. More cheese and spread the cheese to the edges more."}
{"text":"I have to say, this was my second time here. Enjoying it the first time around , I can't say the same for the second. People really don't understand customer service.  There was two televisions in the place in which neither one was on, I asked if they worked and he said yes, I then asked if he could put the Red Sox game on considering its sports season and the panthers were not on yet. He told me that he could not turn the television on because there were people sitting there. (Remote control, doesn't everybody use that) he then told me he would turn it on after they left, but he didn't.  Worst experience, people really don't go out of their way to please u.  No sense of urgency or caring. Will never return based on that experience."}
{"text":"I have never been so disappointed. I eat here about 3 times a week and have previously loved it. Tonight all my girlfriend wanted was a slice of pepperoni pizza. We drove 40 minutes from Mt. Holly to get a slice and even called them before we left to ask if they were busy. They said they were not. Shortly after we left and even called them to pre-order our pizza. They told us they would not do a to go order, so we simply said okay and hung up. After arriving at 11:30 and standing in a line for over 20 minutes (after they said they weren't busy) and was then told they ran out of food as we finally reached the counter. We went home and ordered Papa Johns."}
{"text":"The best pizza in town so far! And a very chill location! Price is good!! I love to go there.. good place to hang out.  I definitely can't stop going there! Looooove it so much. And you feel like your young again !"}
{"text":"Decent pizza. Decent service. Decent atmosphere. Not a terrible place and the prices are good. 1 $5 slice is good for most people. But with so many other truly great pizza places nearby, I don't see a real reason to go to an average place."}
{"text":"I wanted to like this place. I really did. We got pizza and it was pretty expensive. Bigger than average Charlotte default size slices, sure, but...  They pride themselves on big slices that cost 5 dollars but these are no bigger than even a mediocre NY or Nj slice. If the pizza was less than 12 hours old and reheated, I'd be shocked. So dry. I'm guessing the five stars given to this place must have put on their own sauce like we did to make up for for the poor quality and poor taste. Money better spent at a real pizzaria in town, or dare I say... Frozen pizza from Harris teeter. This place just isn't good at all. Seriously."}
{"text":"Awesome New York style pizza, and holy crap the slices are big!  It's tough to find a good pizza-by-the-slice place in this area, and these guys nail it.  Great soda selection too. The location next to Heist is perfect, because there's nothing better than a slice of pizza after getting a few beers."}
{"text":"Delicious, HUGE, crispy pizza that will not disappoint! Simple spot- soda in cans and $4 slices makes for a perfect lunch."}
{"text":"Huge portion pizza, a really fair price and a super positive attitude by the entire staff. They have a huge selection of beers and that you have to see this pizza, it's"}
{"text":"This location is within walking distance, which is very dangerous in regards to the amount of money I spend and pizza that I eat.  Friendly staff and generally quick service.  I have eaten here several times in the past few months.  I would love to give Benny's a slightly higher rating, and on certain days I probably would, but my most recent experience was lukewarm re-heated that might have been from the day before; we were eating it for lunch last Sunday.  We will certainly try again as we love the curst and the enormous serving size, but it is tremendously better when it is fresh and not re-heated."}
{"text":"This place is awesome!  Creative, delicious and HUGE slices!  Be sure to try one of the special pies.  I've yet to have a bad one."}
{"text":"Solid late night pizza spot. All of the other restaurants in the NoDa area seem to close at 2 a.m., but Benny's is open until 3 a.m. serving both slices (pepperoni and cheese only at late night) and whole pies.  The slices are enormous. $4 gets you a 13\" behemoth with well browned cheese and a nice, crisp bottomed crust - solid value. At the time of my visit, they didn't have beer sales yet (really the only reason for no 5-star), but I assume they're getting their licensing in order to fix that. Overall, good eats."}
{"text":"The pizza is good, not great. Definitely worth $5 for that giant slice though. Hella yuppies on the weekend, it's a little uncomfortable. It's whatever, keep crankin out those slices fam"}
{"text":"Can the pizza box fit through the door without tilting???......this is the game you will play when dining at Bennys!  Came to Bennys for dinner one night with a cool group of Yelp peeps. It is located literally right beside Heist. It is open very like on the weekends. Like 2am or 3am. I can already tell this new found place is going to be a problem in my life!  As they are fairly new, they don't have their beer selling licesnse yet but are working on it. I ordered the monthly special- queso chorizo and my hubby ordered the monthly special- curried banana peppers. When the slices came out, they had to use two plates each cause the slices were so large. Like, picture holding a slice of pizza up to your face and then adding a few inches at the top and bottom!! One slice was waaaay more than I needed. The queso chorizo was absolutely freaking amazing! Had a bite of the curried banana peppers and, being someone that doesnt really like curry alot, loved it.   Good luck Benny's! We will be back!"}
{"text":"Great atmosphere, good selection. You only need to order one slice at a time. VERY BIG PIECES. Not so much gourmet, but if you don't care about carbs, this place will satisfy your cravings."}
{"text":"We walked into this place thinking it would be pizza by the slice like in New York where the pizza is waiting on you. Instead, we were waiting in our slice. And waiting. And waiting.  We waited at least ten minutes for a slice. We ordered the monthly special: pesto and sun-dried tomato.   The place has a decent assortment of sodas but no beer, yet.   When our pizza came, they were nice enough to cut it in half for us. Was it cheesy? No. Cheap? At $5 a slice, no. Delicious. No.   We won't be back."}
{"text":"This is just the place NoDa has needed for forever, simple, good pizza by the slice. I'm surprised it took this long. I thoroughly enjoyed my pepperoni and mushroom slice, and the staff was great. I'm sure I'll go back a bunch."}
{"text":"Perfect amount of sauce, cheese, toppings. Crust was good. Thinner crust. Perfectly balanced. Monstrous sized."}
{"text":"nice pizza, look for more non pork options. and maybe seasonings on every table???"}
{"text":"Nothing really special about their pizzas except for the size at a decent price. Maybe I'd change my opinion if I ever got a chance to have a fresh slice, but every time I've gone it's the same stale quality as Fuel."}
{"text":"Its fine. I would go here if in the area and needed pizza but I'll never make a trip out of the way for it. This is my standard 3 star review."}
{"text":"Splooging w/ flavor this was the ultimate zaaaaa. Spend all your money here.  Super dope and chill and stuff.  This pizza is fully torqued."}
{"text":"This place was recommended so I thought to give it a try. Got a dried up over done cheese pizza. I ate it cause I was starving, asked for a cup for some ice water, they dont have ice so my water was warm in 90 degree weather smh.... I will NOT be returning.."}
{"text":"Huge slice! Definitely 1 is all you need. I commented that $30 was crazy for 1 pizza, but the pizza I saw go to the table next to us was almost 3' across! Could feed ten people. Nice pizza by the slice NY style walk in place. Good selection of craft beers and soft drinks."}
{"text":"One word: NO!  This pizza is quite honestly the worst I've EVER had and I've eaten a lot of pizza in my day.  It was one of those meals that when you look back on it, it makes you physically ill.  Plus, the girl who served us was so rude i considered cancelling my order, which in retrospect i wish i had."}
{"text":"This is one of those reviews I kinda hate to write because I didn't actually get to try their pizza/food. Some friends and myself were enjoying a Saturday afternoon and I wanted to give Benny's a try since I've never had a monster sized pizza before and thought it would be nice to spring for one as a novelty treat for my friends. I called in to place our delivery order and come to find out Benny's does not take call in orders and you can only order through grubhub. OK. I'm a sport. Even though the person took the time to answer the phone and explain to me the ordering process that, in all, took up as much time as it would have to write down a order it's all good. So, moving along I fire up the grubhub app on my phone and begin searching their very limited selection. It seems as though if you want anything other than a pizza with anything except a small selection of toppings offered (pepperoni, cheese, mushrooms, sausage etc) you are out of luck here. Not wanting to give up I called back again to try and get some real time help with the pizza dilemma we were facing. I could tell the guy answering was, even though it was out of the norm for them, going to try and accommodate so he asked me what I was after. I told him green peppers and onions. He said \"we can't do that\" and that was the end of that conversation and my attempt to get a pizza from Benny's. The real kicker is that the special pizza that day was listed as \"vegetable\" lmao....It struck myself and my friends as funny that they couldn't pull together a phone order for a veggie pizza even though the special for that day was a vegetable pizza. What the hell is on their vegetable pizza then? Why is taking a phone order so complicated?.....I'd like to give this place another try sometime but it seems as though their business model isn't very flexible so I will know my next attempt will have to be on their terms and their terms only."}
{"text":"This place is great!  The slices are huge and delicious and the have a diverse selection of craft beers.  The staff is super friendly and easy going."}
{"text":"Huge slices of pizza and they are amazing! They sausage slices were thick and the chicken bacon ranch was great too! Super friendly staff as well!"}
{"text":"Amazing! Great prices great pizza great environment very clean great for family nights out kids will love this place!"}
{"text":"Biggggggg slices! Good beer selection. If you want a late night no frills pizza slice this place seems like a great choice!"}
{"text":"My FAVORITE pizza in Charlotte! If they ever have the chorizo and fried onion pizza on special, definitely try it! Can't go wrong with a simple pepperoni slice though. Worth a drop in if you're around."}
{"text":"Pizza was really good. Love how big the slices are. The crust taste really good and love how it's crispy. Yuuuuum over all the pizza is great."}
{"text":"After all of the great yelp reviews, I decided to give this place a try. The slice of pizza I got was huge and very affordable but the taste was just not hitting the spot.. The crust was dry, had barely any sauce on it and the cheese was burnt. It left a bad taste in my mouth all night. Maybe I just went at a bad time but this place did not impress me at all."}
{"text":"Wonderful place with great pizza. It was so good, i left after eating one slice, came back and got another one. Nice, fresh and HUGH!! Probably some of the best pizza I've had in all of Charlotte. I'm ecstatic for a pizza place such as this in the NODA area. If you want good, fresh and really BIG pizza, this is the place to go. Will definitely be coming back!"}
{"text":"LOVE this joint...delicious, GIANT slices of pizza, huge 28\" pies if you really want to dig in as a group, and the people have always been pretty cool. Can't go wong with the cheese pizza. Another of my favorite spots to get pizza from. Very New York-ish...LOL!"}
{"text":"This is how you get the most out of your cheat day!   Oh and check off another bookmark for 2017!!! Whoop!   I ordered the monthly meat special a slice of Lei'd (see what they did there?!) which comes topped with bacon, ham and pineapples.   It doesn't get any better than that!   It came out nice and hot straight from the oven, I topped with cheese and red pepper flakes and I couldn't have been happier.   Oh and did I mention like all the other reviews have that the slices here are ginormous! :)   Nice job! This pizza makes this Virginia girl very happy."}
{"text":"This new-ish establishment in NoDa is sure to become a staple. The pizza is HUGE. 28\" pizzas make for 14\" slices. They offer your basic cheese or pepperoni, and then have two special choices they rotate monthly. No beer/wine/liquor here, so don't come planning to throw back a Peroni with your pizza. Benny's is open late-night, so it's a sure-fire place to get your drunk-food fix after a night at Heist or Growler's. It's NY Style (to me) that's pre-baked, and then thrown back in to heat up upon your order. So if you love that, this is a great choice.   Sidenote: There are no sides/breaksticks/garlic knots offered, which was definitely a let down for me. I love me some breadsticks with my pizza. Literally just pizza and soda/water served here."}
{"text":"I have discover really good pizza in North Carolina and it's \"HUGE\"! Hard to believe, I know. Not since Uncle John and Aunt Sugar were putting out quality pies in Lumberton have I had such good pizza in the Tarheel state. Located in the trendy NODA district of Charlotte are a bunch of bearded hipsters spinning some giant, quality pies. They also have a really nice selection of local craft brews to wash it down. A whole pie will run you about 30 bucks, but it is the size of almost four normal sized pizzas. Worth every penny. And this coming from a guy from NJ who knows his way around a pizza."}
{"text":"Tasty, huge and simple slices! We love a  place that carries not one,but  a few different brands of root beer.:) Staff is efficient  and prices are just right."}
{"text":"This pizza is awesome! Huge slices! Nice and thin! Garlic Mushrooms are superb! I will be a regular!"}
{"text":"Finally a place where I can get a late night snack after work. Not many places in charlotte where you can get something to eat on the late night during the week. I had one slice of pepperoni and mushroom and it was good and huge. I'm glad I didn't order 2. I think the guy ringing me up at the register told me they have 6 different options for your pizza."}
{"text":"amazing pizza one of my favorite spots to go on a saturday and drink a beer with the girl .....But i sneak in there on the weekdays for lunch some time but cant tell her cause she will get mad i didnt go with her."}
{"text":"Pizza is AMAZING! Just don't like how the sliced to go is put in a bag from the counter. Other than that I love their pepperoni. The slices are HUGE! Took me literally two days to eat two slices of pizza."}
{"text":"Best pizza in Charlotte! I'm from The Bronx NY and we are very particular about eating pizza at just any out of town pizza parlor. And just to reiterate, it wasn't the size of the huge slice! It was the quality! And after searching for a decade, ice finally found what ive been searching for!"}
{"text":"\"Pizza the size of my infant son!\"   -Me, upon my first visit  I highly recommend taking advantage of the monthly specials. Most of the time, the flavors are rather adventurous and tend to offer quite a range of flavor for a pizza. Also, the beer selection is worthy of being paired with some good pizza."}
{"text":"Pizza is excellent, and their prices are even better! You definitely get a good bang for your buck at this place. One slice of pizza is more than you can even eat."}
{"text":"Great pizza by the slice for $5. Can't beat it. Ordered a while one topping for $38. It seems kinda pricey but if you ask them cut in more than the traditional size you get a lot of mileage out of it and could easily feed 6-8 people with one."}
{"text":"Had the pepperoni pizza and it was SO good! Great staff, good prices and did I mention? the pizza is HUGE."}
{"text":"Blown away by the pizzas. 1 slice is bigger than my forearm. Great beer selection as well. You won't leave hungry."}
{"text":"I was fairly impressed with this place to say the least. Not knowing what to expect, I strolled in here thinking this would be one of your typical southern pizza joints that make a good cardboard and ketchup pie with some wacky toppings- Not. The. Case.   After taking a quick glance at the menu, I was drawn to the Curried Banana pizza. Sure, I'll try it, why not. I ordered just a slice as I wasn't terribly hungry. Little did I know how big these pizzas were. I've seen my share of large NY style pies, but this had to be THE largest. It's just stupid big. The to-go boxes can barely fit out the door. Love it.  The pizza itself had a great flavor, really enjoyable. And as you would assume, even though I wasn't really hungry, that didn't stop me from finishing the monster slice. I'm definitely looking forward to trying out their other recipes.  I LOVE that this place is here in Noda, it really fits well with the theme and atmosphere. Good stuff all around. GET THAT BEER IN HERE!!"}
{"text":"Updated because the pizza was well worth the wait. Two stars originally because DoorDash deliveries require the driver to arrive and sit in the restaurant while they prepare the pizza. They will not start to make the pie until the driver arrives. Thanks to the driver for informing us. Must be nice to have enough business to keep such a policy. Papa Johns next time I want a pie delivered."}
{"text":"After stuffing my face, I'm ready to write a review.   Benny's ... the place to be if you just want to chill with your friends to watch a ball game. You can't beat that big slice of pizza for just five bucks!  The place is pretty unique. The vibe ~ it feels like I was transported back in college days. It has a touch of industrial feel with a cool exposed brick on the wall. The pizza ~ reminds me of  Brooklyn pizza in NYC chewy and tasty."}
{"text":"Best pizza in town hands down! Always fresh and every month they have different specialty pizzas! They also have a freezer full of king of pops as well!"}
{"text":"The slice of pizza is literally the size of my forearm. It is huge. The good thing is there is no loss of quality in taste and texture in the pizza this size. I think Bennys does it well and offer great basic pizza as well as good new flavors. If you are in NoDa and been drinking - this slice of pizza will feed the whole squad!"}
{"text":"We actually went here by accident trying to get to Heist Brewery (which is around the corner) and no we weren't already drunk, LOL.  I ordered a slice of plain cheese ( adventurous, I know) and my mom ordered the chicken, bacon, ranch slice and of course we got a few locally brewed beers. The pizza was ready pretty quickly and being the ranch connoisseur that I am, I ordered 2 cups extra.   The pizza was HUGE and delicious! They also have a pizza contest running: whoever can eat and entire pie wins $500! I highly doubt I could even come close to doing that but I'd like to see the person who would"}
{"text":"Huge, fantastic slices of pizza- I'm picky about my slices so that says a lot from this New Yorker! Two paper plates to hold one slice says it all- must try it!"}
{"text":"Solid late night pizza joint. Nothing fancy, just giant slices of pizza. Best to buy it by the slice, and entire pizza runs you roughly $30 and unless you have a truck you may not be able to fit it into a regular car."}
{"text":"Great big slices, cheap prices, best selection of can sodas in the history of the universe (Tab, RC Cola, and Fresca? What?)...great cool atmosphere..awesome place!"}
{"text":"Excellent pizza and great friendly customer service.  This is a great spot in a trendy neighborhood with an uber great atmosphere.  The slices are large as other Yelpers have commented. The pizza is flavorful however not 5 stars but I am biased since I grew up in NYC and am used to the NY slice. This is pretty close to NY style  so I give this place a high 4 for food.  This is my 2nd time in Charlotte and my 2nd time at this spot. That says alot!!@  This is a must if you are visiting and a what are you waiting for??  if you live here."}
{"text":"First time at Benny's. The pizza was delicious. Unlike any other pizzeria in Charlotte, this pizza was the most similar to NY pizza. The slices are huge. We split one slice and we were full. No need to post anymore. If you're hungry and want pizza--- go to Benny's."}
{"text":"I enjoyed my Huge slice of Pepperoni Pizza for $5 a slice. I was thinking hmmmm.... for $5/slice I could get a small pizza, but not here! The slice of pizza was basically like a small pizza and totally worth the price. The staff was friendly and the restaurant was clean. The ambiance is very eclectic and perfect for the NoDa artsy laid back scene. Most pizza places give you huge slices of dough where they skimp out on the toppings but not here! The dough wasn't thick and the sauce to toppings ratio (if that's really a thing lol) was perfect. Buen Provecho! Mama Ragu signing Out! Peace"}
{"text":"During college, I frequented the $1 slice places where the lines get more fun & interesting the later you go - I imagine Benny's to be the grown up, more sophisticated big brother of one of the college places.  Benny's sells pizza by the slice and by the pie - but don't think that you're going to eat your regular number of slices here.  The pies are 28\", which means a slice has to use two plates.  Its a bit ridiculous.  Its New York style pizza, thin crust with just the right amount of sauce and cheese.  I've only tried the cheese and pepperoni, but they do have other toppings as well.  Benny's is a great NoDa addition, they have some awesome murals on the walls (and front of the store), and it will be a great stop if you're headed out to a brewery or two (or three!)."}
{"text":"I am sure this place kills it late-night on the weekends. Their slices of pizza are only $5, and they are absolutely huge. They sell t-shirts that say, \"Can you handle our 28 inches?\" Saw the box that the full 28 inch pie fits in, it is the biggest pizza box I have ever seen!   We both ordered a slice of the Garlic Mushroom, and a ranch dipping sauce. The ranch was very good, definitely above average. The slices came out about 10 minutes after we placed our order, and we used the small station at the front to get our red pepper flakes and parmesan cheese. It took me a while to get through mine and still could not finish. When I asked if I could have a to-go box, I got handed a brown paper bag which I thought was a little odd. It ended up working out since I could just put my remaining pizza slice between the 2 paper plates they are served on, and then put that in the bag. So no worries there.  Tap water is served in a cooler directly behind where you order. They also have a cooler full of bottles and cans of beer and soda. Noticed they carried some harder-to-find sodas like Tab and Squirt. Was asked if everything was good before we left, and said it was. All in all, enjoyed the experience!"}
{"text":"Great pizza! Slices so big, def worth the price! First time I went they forgot to call us for our slice and we waited a while( which didn't upset us since we were in no rush). Manager noticed we waited a while and gave us cards for a free slice! Employees are friendly and I love the vibe. The next time we went we got hot pizza super quick! Great place, especially late night! Have tried buffalo chicken, pepperoni and sausage. All great choices!    *whoever is in charge of the music there has great taste!"}
{"text":"Oh my goodness the pizza's in the place are ginormous!  My son and I were walking around Noda waiting for the donut spot to open and we came here while we were waiting.  We were immediately engaged when we came through the door, the guys behind the counter were very welcoming asking if it were our first time and just making recommendations, etc. They have a few tv's, and wooden tables in the front and back.    My son ordered a slice of cheese pizza, and here the slices are massive, and I still had to beg him to share with me........smh.  I thought the pizza was good though it did seem to lack cheese in several spots.  They also have a little seasoning table with cheese, oregano, red pepper, etc.  Cute little spot to have a slice of pizza, but just add a little more cheese please."}
{"text":"One of my favorites in NoDa by far for pizza! Great option for take out or dine in. Very casual pizza joint atmosphere. One slice takes up 2 plates, so be prepared for a huge cheesy slice of deliciousness. They change their 2 speciality slices monthly, so keep an eye out for their new options (other than cheese and pepperoni). Oh and their garlic butter dipping sauce is pretty bomb too.  And finally for us Charlotteans, Benny's carries King of Pop popsicles....so save room for dessert!  In response to some other reviews: -Don't be deterred by the $5/slice for their specialty slices because Benny's is worth every dollar.  -Parking lot may be full, but Benny's shares a lot with the brewery, so don't let the lack of nearby spaces change your mind. I've never had to wait in line to order before."}
{"text":"2 words.. good and simple...  Benny are known to serve up their 14\"inches Slice pizza. And I wonder why it took me so long to finally  dine here.   Why it's good? Their crust. It's not to thin, not to thick and have a nice semi crunch to it.. which I seem to love. The sauce is not too much. And the ingredients are all good.   Why it's simple? They offered 4 basic pizzas...pepperoni, cheese, sausage, and garlic mushrooms. Then there's a monthly meat and monthly veggies. Those the the \"specials\" of the month. That's it.   You can't be a Starbucks customers here. Meaning you can't customize anything. What you see is what you get.. And for some reason I find this refreshing.. they don't do anything fancy., everything is served on paper plates. You order, they call your name, you pick up the slices. Self serve and bust your own table. Done.  They offered an awesome variety of can drinks. Local brewery to soda etc.   A nice cozy informal hang out spot with some good ole awesome pizzas.."}
{"text":"I get the hype about the big slices. I even get the hype about the quick service, especially when there's an extremely long line. But I don't get the flavor. My homie did tell me the flavor of my slice was off. I got cheese btw. However when I tried his man's slice, I still wasn't feelin it. Nope not for me!   But imma give them a second chance. Because orders were gettin mixed up, people couldn't hear there names being called, one guy left out with the wrong order, pizza dude trying to chase him down, pizza dudes and check out dude were shaking their heads with the amount of customers flowing through the door. It was too much going on.   I can't imagine this place being any different on a Saturday night after people have been drinking. All the greasy food joints are going to be packed. And they in NODA too where all these places around them are jumpin? Come on now.   I'll check them out on a weekday and see what they're talkin about."}
{"text":"I think if one is looking to fall of the diet wagon, then make the fall memorable.  Benny's does that for me (as does Duck Donuts).  Big slices served piping hot remind me of the many divey pizza joints sprinkled like oregano all over the Northeast.  The pizza both smelled and tasted great; it also folded nicely and crunched oh so gently when taking a bite.  Mmmm . . . so good.  Ingredients were fresh, prices low, and ambience just the way I like it for fresh pie:  humble, divey, hipster, and cozy.  I say \"Give 'em a whirl!\""}
{"text":"Holy pizza slices. Honestly, I don't know what I was expecting when I came here...we were diving through Charlotte and this place was open later than most places, but by the fate of Yelp reviews, we found this amazing place.   Now, my fiancé and I LOVE pizza. This has to be one of the best places we've been to in a long time. Not only are the slices GINORMOUS, but the quality is really solid. They were large slices, not once were they soggy or cold! That's saying a lot. I got the fiesta chicken (yumsssss and totally recommend) & the fiancé for the sausage. We also got a side of garlic dipping sauce (super clutch).   Definitely check this place out (& grab a beer next door!)"}
{"text":"The 20 minute wait for two slices of pizza was almost unbearable due to the terrible screamo music being blared.  The booths are so ripped and worn out that they look like a tiger used them as a scratching post. Pizza is yummy though! Please play different music!"}
{"text":"Thank's to Benny Pennello's I am now a size queen.  I remember growing up in the dirty jersey and hitting the shore for giant slices of pizza.  Benny's are even bigger than these slices.  Not only can you be full off of one slice, but good god the pizza is actually good.  This might be my new go to pizza place."}
{"text":"Biggest pizza you have ever seen. One slice and I was done. Had the jalapeño and bacon pizza.  It was the perfect thin crust. This place has a college campus feel - without the beer??  (Hopefully they get that fixed soon). Drinks are cans out of a cooler.  Definitely a cheap date kind of place, but the pizza can't be beat!  I will def be back."}
{"text":"Welcome to New York, Charlotte! These pizza slices are roughly the size of New York State, at least. Myself and three friends split a large pepperoni and there was still some left over. Mostly because I didn't want to embarrass anyone with my extreme ability to consume pizza but that's a different story.   Slightly strange counter service type atmosphere but once you get the idea, it's a nice place to hang out. They offer some unique beers and a few domestics. It's not an easy place to get to on the weekends since the parking in the area is a challenge. If you are within a mile or two, I suggest you walk.   Really delicious, New York style pizza and I've had a few pizzas in NYC. Definitely comparable."}
{"text":"Home of the $5 extra large slices! I mean the slice is the size of a baby but probably more delicious than one. There's always a great special but the tried and true plain cheese or Italian sausage slice is a solid pick. There selection of local craft beers isn't too shabby either. Benny's is a great spot for picking up a late night bite after the bar too!"}
{"text":"I kept it simple on my 1st visit and ordered a pepperoni slice with a side of ranch and a vanilla coke. I'm glad I only ordered 1 slice because the slices are huge! They sell 14\" slices and 28\" pies. I was full before I even finished my slice. Other sauces they offer for dipping are marinara and garlic sauce.  They have monthly specials, so that will keep me coming back to try all the delicious combinations they come up with.  If after eating your pizza you are craving something sweet, you can grab a King of Pops Popsicle to curb your sweet tooth.  Benny's does not deliver, but they are open late night 7 days a week."}
{"text":"I don't do a lot of reviews but these guys earned it. Great pizza, huge slices, ranch sides, canned cokes. Just what you need after a session of imbibing. As if all those accolades weren't enough the guys are super friendly and playing Gangstar. One of my favorite places in Charlotte so far."}
{"text":"Love, love, love this place. Cool atmosphere, great staff who remember you when you come in and phenomenal pizza. I'm from NY and picky about my pizza, but these slices are thin and crispy with lots of cheese and toppings - just the way I like them. And the slices are huge. Don't order more than one unless you don't want to eat for days. Love walking here with the dogs and sitting at the picnic tables outside. Don't miss this place. You won't be sorry!"}
{"text":"SO happy that Benny's is now in Charlotte. I have eaten at both their Radford and Blacksburg, VA locations as that is where I used to live. You can go in and grab a huge slice of pizza for a round $4, perfect for lunch. They always have cheese and then pepperoni but each month they feature a special.  It looks like the Charlotte location is actually going to make sure to do 1 vegetarian special as well as 1 meat special, not 100% on that though. The Charlotte location is also bigger than some of their other locations which is nice. It's super delicious classic pizza, a slice the size of your head... what's not to love?"}
{"text":"I love pizza and wasn't a fan of their garlic mushroom slices. Mushrooms had no taste of garlic or period but the slices were huge and I'd go back for cheese pizza if my top choices were closed."}
{"text":"So I've been coming here for about a month since a friend turned me on.  The pizza is really good but one of the staff members that works there always seems to have an attitude when I visit.  Look I get it we all have our bad days but seriously the last 3 times I've went in this dude is a total douchebag not to just the other employees but towards the customers as well.  Even my friend that was with me was commenting on how angry the employee was.  The last time after I got my food I wanted a ranch cup with it the same guy was working and he told me it would be 50 cents so I'm like sure.  I asked him for the ranch and the guy snaps back at me in a rude tone \"no he will get you at the register\" even though he's standing right in front of the fridge that has the ranch cups in them.  My food is getting cold and there was about 3 more people waiting in line.  So I go and sit back down to eat since I'm obviously not getting this ranch anytime soon.  I wait on the line to clear out and once again go up to pay for the ranch.  The guy at the register ends up giving me the ranch free which was cool but he has to wait for the rude employee to move out of the way of the fridge to even get me the ranch.  Like really they need to watch how they come off at me because next time I'm probably going to lose my cool and cuss you out for the disrespect.  Today I went in for some Joes Tea I asked the same guy how much the drink cost and the attitude starts.  There is about 5 people waiting to checkout so I ask if I can just leave the three bucks and go because I had an order to deliver so the employee with a bad attitude decides to yell back no you have to wait for him Pointing at the other guy running the cash register.  I'm livid at this point because I don't know who the hell you think you are talking to with that tone of voice.  It took all I had to not come across that counter.  I even asked you how you were trying to be nice and yet you still cop an attitude towards me.  I'm done trying to be nice so the next time I go if the same guy starts with the attitude I'm not letting it slide I will make a scene and give that attitude right back you.  You have to give respect to get respect with me and right now this guy is on my bad side.  If you don't like your job or don't want to work QUIT I know plenty of people who would love to have your job.  No need to come in and make everyone else's day miserable by being a total dick.  Keep that ass at home boy with that nasty attitude of yours.  I don't remember or care to know your name just know I know your face that's all that matters.  If the pizza wasn't so good I'd choose to go somewhere else.  Whoever he is please get him some proper customer service or hospitality training."}
{"text":"I've heard about Benny's for a while now and their ginormous slices of pizza ( seriously 14\"!!), and decided to give it a try after 5 drinks deep at happy hour.   First of all, it's located right by heist brewery in Noda which is a perfect location! It's also open till 3am so it's great for that 4th meal. They do not have alcohol, but are planning to have it available within the next month.   The pizzas are premade (New York thin crust style), however they cook the pizzas with the toppings fresh each time. So be prepared to wait 5-10minutes. Slices range from $4-$5, but trust me 1 piece is enough. You can get two if you feel extra frisky. They also offer full pizzas (28 whopping inches!!) around $30-38 depending on the toppings. Pizza is the only thing on the menu so don't expect to get garlic bread, etc.   I tried the monthly special which was curry banana pepper.The pizza had good flavor, but I was expecting more. I was unimpressed with my choice. It was good, but nothing to rave about. The crust is surprisingly good- however ask for a side of sauce or ranch. It gets a little dry.   Keep in mind this pizza is New York style. If that's your thing you will love Benny's. For me this was more of a drunk food/late night kind of place. However I would like to return and try a different flavor. That might change my view on Benny's.   Overall, for the money, it's a great deal and you can never go wrong than pizza!"}
{"text":"Ok, as it's been stated, the slices are ridiculously huge... so I'll comment on the pizza of day ...chorizo and Queso...great flavor and an appropriate spread of ingredients, it's the type of slice you either need a knife and fork or you fold in half and devour., I went the latter.  It's all good.  It's almost worth the show of when they bring out the pizzas from the back room, you will say OMG.  Enjoy!"}
{"text":"Always heard about this place. And the rumors about how large the slices are. The slices are GIGANTIC and they are only $5. Good and friendly customer service. Large variety of can sodas to choose. They have brands and flavors I haven't seen in years. Read one comment about the pizza not being warm. The slice I was served came out the oven piking hot. Definitely will be back again."}
{"text":"Best Pizza Ever. I go to Noda just to eat here.  I even gotten it from Postmates even though I live in South Park.  I'm obsessed."}
{"text":"Great little dive pizza joint. It's the type of place you would expect by a college campus. The slices are huge and cheap which appeals to this mom of all boys."}
{"text":"Benny's is awesome! Opened up not too long ago and I've already been 4 or 5 times. Cheap, delicious, GIANT slices of pizza! They always have cheese, pepperoni, and sausage but also have 2 monthly rotating flavors. Super friendly staff and great atmosphere. This place will only get better once they start serving beer! Looking forward to coming back again and again!"}
{"text":"NODA desperately needed a pizza by the slice place.  And the nice combination of a great crispy crust combined with a huge slice is perfect after enjoying some of the nearby craft breweries.  The sauce was not particularly memorable, but when you buy a slice it's all about that crispy crust.  Instead of being dense, tough, and chewy, the crust has a perfect snap with a light airy texture.  Just what I like in a re-heated slice :) I really appreciate the simplicity of the concept.  You can order a giant pie or a giant slice."}
{"text":"If you're looking for something to fill your stomach after a night of drinking, look no further - because that's pretty much all this pizza is good for. After consuming a few beers in NoDa, I decided to try Benny's because it's relatively new to the hood. I ordered a slice of the mushroom and garlic pizza and the service was rather prompt. The sizes of the slices are quite massive, however the quality of the pizza was lacking. The mushrooms were luke-warm and tasted like they came straight from a can, I barely tasted ANY garlic, and couldn't eat it after a certain point because there was so much dough! Needless to say, if I'm looking for a place to get some post drinking food - I'll stick to Beagles or Fud. How this place received so many 5 star ratings on here boggles my mind!"}
{"text":"BIG New York style pizza made my belly happy today for lunch  if you haven't checked out Benny's, YOU should"}
{"text":"Hole in the wall pizza place. SO. GOOD. Extremely affordable and always consistent. Biggest slices I've ever seen and it never disappoints."}
{"text":"Hands down, one of the best pizza by the slice places. They have art, enough breathing room in the restaurant that you're not like on top of people, and it was very clean. The whole pies are huge and great for groups. I had the classic pepperoni and cheese but they also have amazing other variations and slices. A great spot for a date, not to mention it is right next to Heist Brewery."}
{"text":"I don't eat pizza often but when I do.... Seriously, this spot is awesome. I eat a cheat meal once a week....and it better be good. Nothing is worse than wasting my cheat meal on hot garbage so I take it pretty seriously. I was in the mood for pizza. Whenever I want to try a new place, I check out the Yelp reviews first and I stumbled across Benny's. The reviews and pics were so awesome I had yo try it. And I'm so glad I did! I went on a Friday night around 8ish. I expected it to be crowded but it wasn't. Here's my humble review....  --Pizza - Incredibly huge slices (see my pic and no it wasn't \"enlarged to show detail\" the slices really are that big)! Thin crust. Delicious, local, fresh and piping hot fresh out of their big ole oven. Nothing like a chain. Go hangry and you'll leave very satisfied.  --Atmosphere - Laid back, chill, groovy background music. Order your food at the bar then sit wherever you like. Diverse crowd which was great.  --Staff - Super attentive. Checked on me a couple of times during my visit and I love that.   --Drinks - They only had beer which is great for beer lovers but I'm a vodka girl. Nonetheless, I wanted to sip on something other than water so the sweet server chatted with me to get a sense for what I might like. She recommended an apple cider beer and it was on point! Again, I love the staff.  --Parking - Dicey. Even though Benny's wasn't crowded, it's next to Heist Brewery which was packed. I guess I had good parking mojo that night b/c I landed a spot smack dab in front of the joint.  -- Last Words - Pizza lovers, you should def check this place out. I've never had pizza in New York, but I imagine this has to be pretty close? You decide....."}
{"text":"This is now my favorite pizza place in Charlotte.  I really hope they bring the spinach and artichoke pizza back, soon! Usually huge slices are limp and sometimes all of the toppings slide off when you pick it up.  Not the case here, the bottom is cooked perfectly and maintains a great crunchy texture.    I'm a ranch with pizza kind of girl and usually judge places based on their ranch.  Benny's may be bottled, which I am not a fan of, but the pizza is so good it completely makes up for it - I just know now not to bother with the ranch.    Really great selection of beer as well.  I usually tell the cashier what I like and have him pick one out, haven't been disappointed yet."}
{"text":"Friendly staff and huge slices. Great spot! I will definitely be back. I'm looking forward to when they serve beer. Maybe put up a few TVs, then it will be complete."}
{"text":"I have been wanting to try this place for a while. As stated by others, the slices are HUGE. I ordered a slice of cheese and a slice of pepperoni. You pay and they call your name when your order is ready. Served on a paper plates, condiments on the counter and napkins for you to pick up. I think it's pretty legit pizza. The sauce is on the sweet side, the pepperoni creates just enough grease on the cheese but not too much. The crust is thin and crispy. I ordered an extra side of pizza sauce, perfect for dipping the crust in. I couldn't finish both slices but they sure were tasty. They only offer pizza, by the slice or whole pie as well as a few beers.  The dining area is pretty cool with a bar top and stools at the window looking out. There are also a few picnic tables outside.   Cool place-definitely check it out!!!"}
{"text":"Chill environment with super cool and friendly employees. Definitely gives a good vibe 100% of the time. It gets pretty busy late at night on the weekends but it never takes too long to get your pizza. The laugh music definitely adds to the vibe of the whole place. The food is just as amazing as the experience!"}
{"text":"HUGE PIZZAS! This is my favorite Pizza spot in Charlotte. Don't expect a fancy or even multi topping pizza, just straight cheese or pepperoni. They sell by the slice which one slice is the size of 3 of most places slices. Thin, crispy, just the right amount of greasy.   Great to stop here after a night of drinking in NODA. Seems like they are always busy.  They don't deliver so you have to use Postmates to get it delivered to your place which is the only thing I dislike about Benny's. Also if you order a whole pizza make sure you can fit it in your car, you may have to put a seat down or tilt it to get it through your door..no seriously it's that big."}
{"text":"Hands down best pizza in Charlotte! Slices as big as a newborn baby! I love to come here any time of day! The windows out front give it an open feel. More privacy in the back. Great music. Laid back. Wide variety of beer and non alcoholic beverages. Definitely a place for ALL walks of life!!!!"}
{"text":"Ok. I'm going to make a statement. A pizza statement. Are you ready?   I'm going to judge you if you cut this pizza slice with a knife and fork. Have you seen the size of these things?! This pizza slice is the size of your face. Eat it with your hands! Fold it in half!   I get the cheese pizza slice, it's $4 and you can get full off of it. Perfect. And not only is the pizza the size of your face, it's very good too. Like genuinely good pizza. I love this place. I'll be back. and in the mean time I'll be trying to rationalize driving the whole way to NoDa for a pizza slice. :)"}
{"text":"Maaaaaan  this pizza is good af!!! And the atmosphere is really chill. Talk should  come get some slices. This that new York style  too... Whhhhheeeeew."}
{"text":"One of my favorite pizza places in Charlotte! Not only is the pizza good, but the slices are enormous - like 3 times the size of my face. One slice is all most people would need, so you're looking at a $5-6 lunch or dinner. Not bad! The interior looks kind of crummy, but once you try the pizza, you'll forgive them and be back."}
{"text":"So the pizza was awesome, as expected. Massive New York style slices which you fold in half and eat like you're back in the city.  The potheads who work there, however, could use a little more attention to detail. They had to do our slices a few times before producing one that wasn't messed up. Nothing against the extracurricular activities, just maybe a little less before serving me my lunch would make the whole process easier. ;)  Overall, it was delicious, and they have an awesome beer selection too. Literally all they are is a pizza joint, and I think they should keep it that way. While I do love salads, etc with my pizza, sometimes simplicity is bliss. :)"}
{"text":"I thought I was coming in for a pleasant 2nd experience. Little did I know, I would be discriminated against and not even fed. Me and my 2 friends came in around 1230am and there were 5 people in the place. They were already eating. We each ordered 2 slices, bought 4 sodas, and sat down. As soon as we sat, a crowd came in. 15 min later, my 2 friends got 2 and 1 slice, my ticket and the other half of my friends ticket was not served. 20 people got their slices of pizza, after we asked repeatedly for ours for the next 30 mins. Finally, when I asked for my money back, the lady behind the counter hands me the last 2 slices sitting behind the counter. I felt so looked over and so disgusted by the way they ignored us repeatedly, promising our order over and over after serving everyone else that came in after us. I have never been a person to look at the color of skin, but I do feel that this was strongly a part of their decision not to serve me at all, and only serve half our other orders. I will never return, and being born and raised in Charlotte, this is a HUGE deal. God bless you."}
{"text":"Slices bigger than your face for chump change. Can't beat Benny's for a quick bite. The pizza is not only huge but it's tasty."}
{"text":"Being from the greater tri state area I've been looking for good pizza places to eat at. I believe I found one at benny pennelo. The slices are huge and reasonably priced. One slice can fill you up, and a whole pie can feed a entire party. I definitely will be a regular here."}
{"text":"A pizza generally comes down to three things, cheese, sauce, and crust. You can have deep dish, pan pizza, square pizzas, whatever shape or size; your satisfaction generally comes down to the quality of the cheese, sauce, and crust. The size is largely irrelevant, other than a novelty.  The cheese is the worst and leaves a weird processed after taste in your mouth. The sauce is flavorless and dry. The crust is ok (hit or miss), although it has improved slightly since they originally opened.  There are so many pizza places in Charlotte that do a better job, granted costlier. I guess if you are wasted and just need something to soak up alcohol, Benny's will do. Otherwise, it may be better to eat actual pizza from places that don't try to sell you by the novelty of the size of their pizza, but by the quality of the product."}
{"text":"This is the best pizza place in Charlotte! If you want to come here for a late night craving, this is it! This is not the place if you're looking at portions. One pizza slice takes up two plates! This is the best pizza for the low! It's a bomb ass local Spot with good beer and even better pizza! The staff is amazing and the venue is dope! I have zero complaints"}
{"text":"Wonderful spot for a slice and a beer ($10 total). Huge slices, limited menu, very casual atmosphere. Ca$h money prize for eating an entire pie!!"}
{"text":"Benny's is a fantastic pizza place.  Their pizza is all served primarily by the slice and is a slice of astronomic proportions.  The pizza is all this cracker crust style as well.  I got their pizza of the month with the pulled pork.   It was very good and only $5 for the slice.  The pizza was really good, I will probably repeat in the future especially considering the price.  The service was very welcoming and friendly as well."}
{"text":"Pizza is massive! They have a vegetarian and a meat special monthly, as well as a few staple pies. We came here with a big group before going out and one slice was enough for dinner. It did take almost 20 min from ordering to getting my slice, but I didn't mind."}
{"text":"I do it for the ZA! Pretty solid slice of pie! Cool little environment for an after work slice or a little dinner date with grandma: would recommend a little more sauce but ingredients were top notch. Can't beat the price. Quality is as good as quantity my friend."}
{"text":"I hate pizza and i want to eat here everyday.  That says something. The crust is amazing, so much flavor. There is no beer yet, but heist brewery is next door. Easy parking too."}
{"text":"We stopped in here for a late night slice with friends...and fell in love!  Amazing NY style and HUGE slices.  I lived outside Manhattan the 3 years before moving to Charlotte and this is very close to the real deal!    Cheese slices are $4 and $5 with toppings.   The slices are so big 2 would be pushing it for me to finish.  It would take effort.  Large beer selection with excellent prices.  Lots of shakers with yummy garlic powders and Parmesan.  We will make our way back...even before drinking!  :)"}
{"text":"Benny's has the biggest and most scrumptious pizza in Charlotte! The huge slices are not only fun to eat but they are well made with quality ingredients. The employees are always friendly and attentive and the owners are amazing! They also have an excellent choice of drinks and prices are excellent. Always a pleasure to come in and see the monthly specials."}
{"text":"Divey pizza spot in NoDa that is quite busy on weekend late nights. Huge pies are being made here, local beer is on tap and cans are available too. I had a simple slice of cheese and it definitely hit the spot."}
{"text":"I not only liked their pizza, I liked their overall vibe. Some laidback dudes manning a counter with industrial accents and some really awesome giant wall murals. Seriously, I spent part of the time while I was waiting for my pizza just staring at the one in the back.   Anyway, on to the star of the show - the pizza. I really enjoyed it. It was like flatbread and New York style pizza had a baby. All of New York's size and strength of character, refined with a more crisp crust, less sauce, and higher end ingredients. All of the flavor with much less greasiness.   My girlfriend got the pepperoni pizza and it tasted like a more sophisticated, less greasy take on the classic pie. They offered a bunch of pizza toppings, from hot sauce to onion to some kind of oil, so she added parmesan cheese and red pepper flakes. I tried one of the two special monthly flavors, bacon jalapeno. The bacon was thick cut strips of real bacon and the jalapenos added a little kick and flavor without actually being overly spicy. I chose garlic powder and parmesan for mine, which elevated its flavor even more.   I love that there's a late night option so convenient to NoDa. I'll be sure to check them out again after a late roller derby practice. :)"}
{"text":"It's not the size that counts it's the... The size of the pizza and the late night hours has me thinking they are catering to a different demographic than the one I fit. I thought the pizza was ok.  Ordered 3 slices.   Mushroom - pretty sure they use canned 'shrooms, I'm not a fan of canned mushrooms.   Artichoke and spinach - good balance of toppings to pizza.   Cheese - they didn't skimp on the cheese but it also wasn't excessively cheesy.   The good - topping balance  The bad - the sauce, couldn't find much at all.  The ugly - the sauce doesn't taste good,  I felt it really detracts from the pizza. I had to ante up an additional fifty cents to get a comically small cup compared to the comically large pizza."}
{"text":"Way better than the pretentious hipster d bag establishment next door (Heist Brewery).  Pizza slices are large."}
{"text":"Hungry in NoDa and love pizza... say no more... go to Bennys.   Very simple menu, five or six choices of pizza max for anywhere between $4-$5 each a slice. However, the slice is the size of a small country. They only make 28' pizzas (ie: four times the size of a regular large pizza). One maybe two will definitely fill you up. They have a good selection of beer by the can and it's a very laid back atmosphere.   They have a pizza challenge, an entire pizza in one hour, I'm going to try to do it one day. Wish me luck."}
{"text":"Horrible service, and Dbags run this joint. I gave this place a great review last year but took it down to 1 star. Same assholes run this place. Get some new servers already. Won't ever recommend this place to anyone anymore until they get new staff that don't think they are above everyone else when all you do is serve pizza."}
{"text":"I'm giving it a one rating because when I called for a to go order the gentleman decided to tell me to wait in fucking line like everybody else. I have money which everybody worships and I'm willing to give out every bit of money and love but this one guy decided to be hateful."}
{"text":"One of the best places to get pizza in all of Charlotte. The taste is impeccable and they have two unique flavors every month to change things up! It's $5 for a cheese slice or $6 for a slice with toppings. You'll only need one slice and it's well worth the money. If you go, download Stealz, you can get a free King of Pops popsicle your first visit through the app!"}
{"text":"As my husband said \"Going forward this will be the only place we order pizza from anymore!\"  We ordered a full pie a little late in the evening (after midnight) and it was fantastic! The pizza was terrific & almost had no grease (which is hard with pepperoni).  The crust was cooked perfectly.  I have absolutely nothing but great things to say!"}
{"text":"Definitely time to update my review!  Really happy to see Benny's thriving in NODA - they've become part of the landscape!  Love to come here with my kids when we're hanging out or running errands - they can split a $4 slice and be full - that's just how big those slices are! The monthly specials add a little \"spice to life\"! They've added beer and have a nice selection of local beer at a reasonable price.   Keep up the great work guys and gals!! One of my favorite pizza joints in Charlotte!"}
{"text":"Oh boy!!!!! Time to pack on the pounds. This pizza is awesome! The crust is perfectly crispy and the slices are HUGE! I am so glad a pizza joint came to the neighborhood. The wife won't be too happy about this good stuff! They just opened tonight so come check it out!"}
{"text":"Cute place!  Pizza is thin crust but you get big big slices. It's a great stop with the many wineries and breweries around."}
{"text":"Benny's was awesome! Such a neat spot in Noda and hands down the largest slice of pizza I have ever had!  Benny's had a really neat vibe and you could tell they were used to pushing hundreds of people through every weekend. When I first heard $5 a slice I was asked my friend if it was worth it: then I received the slice on 2 plates!   This place is unique and I most enjoy experiencing the unique local spots. I had a meatball pizza that was on special and was more than enough food, plus a lot of local craft beer.   I definitely planning on coming back to Benny's when I work up my appetite again. Who know...perhaps I'll give their hour pizza challenge a try!"}
{"text":"The absolute best pizza in Charlotte. I am absolutely sure that no pizza place in Charlotte can too Benny's. Huge tasty slices at a great price with great beer too. You gotta come check this place out"}
{"text":"Benny's is a gem in noda for that quick bite you need. The slice is huge and their pepperoni and cheese hangs with the best of them. The weekly special is a creation that can be a unique slice, as with any new menu items the special can be hit and miss. Random fact they have a huge selection of canned pop for only $1."}
{"text":"Found this place and had to come check it out you might think a place serving slices this big what the all about novelty and not so much on flavor but that's not the case here the prices were fantastic the people were very friendly the restaurant is very clean and they're very proud of their product they have an interesting collection of beverages to choose from and the pizza to be quite honest is probably the best we've had outside of New York City itself we've gone several times now I look forward to going again."}
{"text":"Having eaten at Benny Tudinos in Hoboken, I had to stop in and try Benny Penellos. I'm not sure what's in the name, but it seems as if the name Benny is synonymous with huge slices. I grabbed 3 slices, all different, all I think fairly priced for the size.   My impression on the taste? Very salty, but not horrible. Absolutely perfect place for stopping after a night out drinking. I would classify it as munchie pizza. I won't be going back unless i stumble out of Heist Brewery which is next door."}
{"text":"Great pizza! I'm a Chicago pizza snob but this  is such a nice crispy pizza ( not a typical thin crust). \"Cheese and chips\""}
{"text":"Waste of time, money, and calories. After the pizza stop I was recommended to go to was closed, I googled the next closest place.  Honestly, I should have just ordered from a delivery service.  For one, the guys behind the counter were incredibly rude to me and other customers that came in. They never gave me my drink and when I asked after waiting 15 minutes for it, they ignored me. They also openly made fun of a girl who didn't know what the ordering process was.  Next, the pizza itself was not good at all. Yes, the slices are huge which is their \"thing\" but I'd rather get a smaller slice that is better quality. The dough was awful and salty while the cheese and pepperonis were bland and had no flavor (I tried each part individually trying to figure out why it tasted so bad).   The only reason I am giving them 2 stars is because the interior was visually interesting with exposed brick and the music wasn't awful.  Other than that, this place just isn't worth it unless you want to watch frat boys turned hipster chug PBR and hit on girls that are so intoxicated they are falling off the bar stools."}
{"text":"Great pizza place.  Size is unbelievable.   Price and taste are great   Will bring my friends here soon"}
{"text":"I googled the best pizza in Charlotte and Benny's came up amongst others. I no longer eat commercial, chain pizzas so I was excited to try something different. After looking at the pics on Yelp, I decided that Benny's would give me the most bang for my buck. A medium sized dwelling right next door to Heist brewery. They sell local craft beer and old school soft drinks in cans!! The pizza was phenomenal! A giant slice served on two paper plates. Hot, crispy on the bottom and delicious. I usually enjoy more than one topping on my slice but this thin crust pizza is so flavorful you don't miss the additional toppings. I'm going back tmrw for two more slices. My new pizza place. Thank you Benny's Penn's in NODA!"}
{"text":"I think this place deserves 5 stars because of its simplicity; sometimes I just want a good, basic slice of pizza that is the size of my car*  And the pizza is plenty good. I tried the sausage as well as the mushroom/garlic when I went. Both were good but the toppings were scattered more like a after thought so I ended up eating them with a fork before eating the actual slice of pizza. They would've otherwise tumbled right off.   With a varied, yet not overwhelming choice of soda and beer to round out your meal, plus a bare bones layout, this is a nice, no frills, low key place, which I personally like. Definitely check it out.   *slight exaggeration, it was only 1/2 the size of my car"}
{"text":"Stopped in here today for lunch based off the Yelp reviews. I've been in town for business for about 3 weeks and have only had one other pizza place in town.  Benny's was a bit out of the way but certainly well worth it. The place had a cool vibe and you just ordered at the counter and then took your seat. I was a little skeptical at ordering just one slice...but wow they were HUGE.   Overall it definitely lived up to the hyped. Not quite 5 stars...but for the South it's about as good as it's gonna get."}
{"text":"When my girlfriend and I drove to this place, we saw that the parking lot was completely filled and there were people standing outside.  I thought that would mean that this place was so hopping that there was not any room except for outside the place (room we would have gladly taken).  Upon entering the establishment, however, we realized that the energy that was emanating was coming from the brewery next door.  This place was definitely way more low key.  As we do in most new establishments to us, my girlfriend and I were going to take our time taking it all in and reading the menu, deciding all of our options and making the best meal possible.  The cashier, however, seemed incredibly expectant that we order immediately, for the menu must have been simple for him and it therefore should have been for us.  I was not necessarily held up on the amount of choices, but rather the price.  $4 for a slice of cheese pizza is outrageous, I do not care how big or good it is.  When I finally decided that I would try this place's food, just in the spirit of being adventurous, I ordered two slices of pizza, two drinks, and a dipping sauce.  The entire process involved a lot of uncertainty, now on the part of the cashier and not me, for everything I was doing seemed to be wrong.  He took our name, and when the pizza was ready, I was called up to get it.  Upon returning to my table, I realized that the order had not even been completed correctly, for I was missing my dipping sauce.  Upon asking for it, I received a garlic sauce that had been purchased from somewhere and was nowhere close to the quality I was expecting when I paid for an extra sauce.  The pizza is nothing special, honestly.  So what if it is as big as a baby, or as big as a head, or whatever you wish to say?  The crust was dry and crunchy, and there really was not much cheese on the pizza at all.  I like my cheese chewy, but not because there is barely any on the pizza.  I felt like all I was paying for was the phenomenon of it being a large slice of pizza, and for someone who is not interested in falling victim to marketing, it was nowhere near worth my time.  The attempt of the physical environment (possibly artsy?) ended up making the place look like it was completely falling apart.  I do not know what kind of person would enjoy the appearance of that place. My girlfriend noted that there is a better pizza place she knows about, where it will most likely be cheaper.  This is the type of place that expects a certain behavior from you.  That is the reason why I do not particularly like going in Chipotle, for, as I have always said, they treat you like a burrito.  They expect for you to come there knowing immediately what you would like to order, even though that is nearly impossible on the first time.  They expect you to play along with the way that they act towards you, and they expect for you to have a good time, enjoy the pizza, and leave wanting to come back.  The employees seemed incredibly wrapped up in themselves, and I am pretty sure that they failed to realize that their service was what would have led me to like the place more (even though the pizza is not the best).  The cashier did thank us on the way out and tell us to come back, but by then it was too late."}
{"text":"HUGEEEEEE...!!!!  I came here with a group of friends after a Hendrick's Gin event. Before I begin, I should let everyone know that I LOVE PIZZA. Obviously, after a night of drinking, I love pizza even more! I really like the fact Benny's is a \"NY Style\" pizza joint. Is it the best NY Style pizza that I've had outside NY? Nope. But they get an A+ for effort and coming extremely close. Thin slices, good amount of sauce, good crust...  Back to the slices. They are ridiculously big. I know a lot of people out there pride themselves in claiming they can eat a whole entire pizza pie (in which they are usually referring to dominoes or papa johns, etc.)   I can bet ANYONE a meal at Benny Penello's, that you have a ZERO percent chance at finishing 3 of their slices. I would even say there's a slim chance at finishing two slices, but I was actually able to pull that one off myself (I blame the night drinking and no dinner lol).  Anyways, make sure you check this place out. It's conveniently located right next door to heist brewery. If you like Pizza, you wont be disappointed.   Come hungry, order once slice and then leave happy."}
{"text":"My husband dragged me here, but I'm really glad he did! Legit pizza! I'm from up north, and grew up on pizza from some of the greats--- and the slices at BP's really stacks up! Great prices, great atmosphere, great selection of drinks, nothing fancy but solid in every way ;)"}
{"text":"So I'm from NYC and if nothing else we know pizza! Moving down south it's been hard to find a pizza place that compares! So I was more than delighted to find Benny's. I went in the afternoon around 2pm.  There was plenty of parking and no wait at all. I've heard that people frequent this place mostly at night after leaving the brewery next door lol. I ordered a pepperoni slice. It was $5 which was decent. Honestly it's probably the biggest slice over ever had. It took up two plates! The wait wasn't long either. I probably waited 5 minutes or so. There was nothing that I didn't like about the slice. Huge, not too greasy and it had a nice crisp to it. Even though the slice was bigger than most it was no match for my hunger. I finished it all! There were other choices like cheese and they had a special for spinach and artichoke that was pretty tempting but pepperoni is just so classic. Next time I will definitely try another slice. Maybe I'll come in the evening and see how it compares. Either way great pizza and great staff. Must try!"}
{"text":"I visited a few days ago for this yummy huge slice of pizza I heard about. Unfortunately, it was a HUGE miss. 1) the dough tasted similar to the smell of play dough (Not even sure how that's possible) 2) the cheese had an odd taste as well. 3) Because it was so hot outside I asked only for a cup of water, well the water cooler was out of water, so I politely brought it to two of the workers attention, and their response was pretty much like I was being a pest and that was a task they didn't want to do. Even if the pizza was the best thing I'd ever tasted, I would never come back because of that type of attitude!"}
{"text":"My wife and I have had lunch here several times.  You go here to have pizza, if you want something else, go somewhere else.  I wouldn't order more than one slice either or you're probably not going to finish it.  When someone orders a pizza to carry out, they have to tip the box sideways to get it through the door.  :-)  Cool place, good music, great variety of drinks.  Nothing fancy but that's exactly what's so cool about it."}
{"text":"Great pizza, great price!  It is sooooo big...and cool.  Purchased for my daughter's birthday and everyone loved it."}
{"text":"Pizza in Charlotte sucks.  Benny's is one of the few people doing it right.  $5 is the average cost a slice.   There isn't much to this place inside other than a couple busted booths and a bar area.  Still, it works big time.    One awesome thing is the Benny's Challenge.  If you eat a full large pizza in one sitting you win and get a $500 check from them on the spot.  Don't get too excited and start counting the money too early.  We did the math and the large pizza is the equivalent of four large pizzas from a Papa Johns in area."}
{"text":"Holy Pizza! This place is amazing! My first time visiting of course.  New Years weekend I brought my parents here around 6ish or 7pm. I love the NoDa area...you can always find the most interesting places.   So my father, the pizza  connoisseur selected 2 slices. Ummm that's a LOTTTT Of pizza!!! I was hesitant at first....Im assuming the pizza slices are stored in a refrigerated area or something. I didn't see any pizza sitting out in the open (comforting) I've gotten sick once before from pizza sitting out to long.   I decided on the Monthly special (bacon, some other pork) Amazing of course! Oh and a Beer! Perfect combination!!!! My parents both had the Mushroom and Sausage pizza....Dad ate 2 slices. Everything was great, oh and there was no wait! If you don't know already. The slices are 28inches...4 slices cost $30...I think someone got additional toppings. Slices \"as is\" are $5 I think. Hope everyone has a chance to stop by here!!!"}
{"text":"So last week a coworker was raving about this pizza place somewhere in NODA and mentioned the pizza was a little on the large side.   I would like to consider myself a little bit of a pizza enthusiasts and had to search out this little hidden gem.  For starters, there is only one size of pizza - you guessed it? It will not fit in your car....I had to bring the Expedition.  It literally had to be tilted sideways to fit in the passenger seat. ( too much stuff in the back).  I can see why they do not deliver, because the boxes barely fit through the front door of your home.    This is a good pizza, I had the plain boring cheese pizza, but what a pizza........(where was this concept when I was in college?)  Do yourself a favor and if you want to impress your friends, buy a pizza and deliver it yourself.  They will be talking about this for days.  Kudos to Benny Pennello's."}
{"text":"So soooo good and open late night. The mushroom is my fav and slices are huge! It's like 2-3 sixes put together. Customer service is great and the guys working here move fast!"}
{"text":"Excellent pizza in a gr8 location. Their specials are always interesting and A+. 10/10 would recommend."}
{"text":"Great people and decent pizzas that are so big that you need two plates for one slice. I bet the pizzas are even better after a few drinks next door."}
{"text":"Just left and can't wait to go back. The Philly cheese steak pizza was HUGE and amazing for only $5! They also had a beer  special for $1 and sodas for $1 so we both ate for $12, cheap date night right in NoDa! Loved the prices, service, and quality of food."}
{"text":"I really like Benny Pennello's! I'm giving it a 3 because of quality for the price.  Very affordable and the pizza slices are huge. My only recommendation is to stick with a Cheese Slice. The toppings are a bit underwhelming and take away from the pizza. The taste and quality of the cheese pizza can stand alone and will satisfy any pizza craving that you may have and not to mention, it's cheaper to stick with a slice of cheese This chain is growing. I'm originally from Virginia and had it for the first time in Roanoke. I'm very happy to see them expanding their reach."}
{"text":"I write this review as someone who could literally have pizza every day and not get sick of it. I have traveled hither and yon seeking out the perfect vehicle for cheese and mighty toppings. This place is definitely one I'll return to.   You don't get many choices in this place. I think they only had four or five options. But it's cheap. A slice is $4 or $5, depending on what you get. You might be thinking you need like three slices to be full. Not so, friend! I am a tank, and one slice was sufficient for me. One slice takes up two paper plates.   The pizza itself is thin and foldable. You don't get Chicago style here, which is good because I hate that kind anyway. They've also got some beers on tap, and a decent selection of soft drinks.   What knocks my rating down? The pizza was a tad greasy. I'm sure you could blot it off if you're so inclined. But I mostly disliked the atmosphere. I get that it's a no-frills place. I really do. But all of the tables were dirty with crumbs everywhere, and the booth seats were ripped to smithereens. It's kinda gross to sit down and just see inner booth contents protruding everywhere, along with someone else's Parmesan cheese remnants.   Still, solid food, and conveniently located next to Heist so you can get more beer when you're done. Or another snack. Not that I did that."}
{"text":"We ordered four slices;  pepperoni, mushroom, Buffalo Chicken(monthly flavor), and Garlic Mushroom (monthly flavor). Slices are $5, but are about 2-3 normal-sized pizza slices. A large pizza w/toppings  is $38 but is ridiculously large. I finished A single slice and was stuffed.   My favorite part of this pizza is that it's crisp on the bottom. No soggy sad pizza here : )  My one big disappointment was the canned mushrooms. You're better than that Benny.   Just a reminder to those who need it, this place is a pizza joint. Pizza has dough. Dough contains Gluten. Probably not the best choice for someone who has an intolerance of this nature. To give a poor review because they make a dish with a main ingredient you're allergic to is kind of crappy. That would be like someone with a lactose intolerance expressing dismay at an ice cream parlor .. you mean they serve dairy with lactose here? --shocking. Just my opinion. I think sometimes our expectations are a bit over-inflated especially because there are a lot of places that do cater to allergies...which is certainly nice, but shouldn't be expected."}
{"text":"Coming from New York State, pizza in Charlotte is not usually up to par.  Benny's is the exception.  Great food, HUGE slices, great value, always friendly and a hometown feel when you walk in the door.  It is a must try if you haven't."}
{"text":"The most amazing pizza house discovery drive by ever! And open until 3am! WHAT? !  You are genius!  After a certain time at night they only offer 2 slices of pizza. Cheese or pepperoni. When I tell you this is the biggest pizza I have ever seen in life, in person, I  not exaggerating it's HUGE the slices take up 2 paper plates and totally worth the $5 a slice.  This is my own personal rhing, I rarely eat the bottom or crust of a pizza, I take a bite of the tip and that's good enough for me then I just eat the topping but after just biting the tip I had to eat it all it was perfectly crisp on the bottom and soft to support the toppings. Oh happy day!! It's perfect late night out food or just leaving the club food, if you find this place you have struck gold!!"}
{"text":"If you like jumbo slices of pizza, you gotta try this place. Their pizza is thin and the crust is crisp... So if you are a Chicago or pan pizza lover, this might not be for you.  They always have cheese, pepperoni, sausage, and a special. The last special I had was cheesesteak - it was good and I think there was wiz on it (like a proper cheesesteak would have), but it was a bit too much cheese for me with the mozz already there too. I usually just get the regular cheese - a slice is $4 and it's worth every penny.   Bring your appetite, fold the slice in half, and enjoy!"}
{"text":"two words: DRUNK PIZZA    I don't even know if that makes sense to the average Yelper but this is our go-to pizza spot for my boyfriend and I. Correction: this is our go-to pizza spot that we drunk walk to after stumbling out of NoDa 101 or JackBeagle's.   Its legit New York style thin, awesome flaky crusted pizza. The cheese is always good enough for me and one slice alone does the job to soak up all the alcohol. I mean, the slices are H U G E. Its worth the money.   The crowd is always eclectic and everyone is always happy. You'll see kids with their families, old folks, young folks, basically everyone enjoys this place. They also sell beer too! Pizza is cheap and tastes fantastic.   Definitely makes living in NoDa even better knowing that Benny's is the local go-to pizza joint!"}
{"text":"So.... I have found my favorite pizza place in charlotte. Directly next to Heist brewing is this gem. It's definitely a hipster joint. The pizza slices are about the size of half a large pizza. No joke- it comes on two paper plates! I had the meatball pizza and my husband had the pepperoni. They were both amazing. The crust is thin and crispy and the sauce is tasty and the cheese gooey. It had a thick end crust. I recommend getting ranch dipping sauce. We will definitely be back!"}
{"text":"I just tried them today and I loved it! Giant pieces of pizza, beer, soda what else could you want for a cheap awesome lunch?! I definitely will be back"}
{"text":"Forget New York style or Chicago. Debate's over really. I'd never heard of the Virginia Slice, but I'm a fan now! It's huge, but that isn't nearly the most appealing thing about it. The taste is amazing. The crust all the way through is delicious. The worst thing is when you open up a piping hot fresh pizza only to find with your first bite that the center is soggy right near the tip of the slice, like it just wasn't cooked long enough or at the right temperature. Not a concern here. It's thin and even and cooked all the way through. Benny's maintains a nice crust - not too crispy, not soggy at all. Then, right where the toppings meet the crust, there are pleasant melted cheese bubbles. Do you know what I'm talking about with the cheese bubbles? Those make me happy for some reason. So not only are the pizzas delicious, they're also fun and make me happy. Food should make you happy. Eat happy. Eat Benny's."}
{"text":"Best pizza in Charlotte by far and definitely the best bang for your buck. One slice puts you in a well enough food coma for a while."}
{"text":"I decided to celebrate National Running Day yesterday by not running and going here to eat pizza instead. #amidoingitright  This place is right next to Heist. My friend Sammy, aka the pizza expert, has been talking about about Benny's for what seems like forever. He went to VA Tech, so he knew all about the Virginia slice concept.   The slices are the size of your head. Actually, they're bigger than your head. By the slice, it's $4-$5. It's so large that it needs two plates. As for the pie, it's 28\". TWENTY-EIGHT. I'm not even sure how they heave these things into the oven. Cheese is $30 and topping types $38.  I decided to get a piece of each monthly special, the buffalo chicken and the garlic mushroom. Did I need two pieces? No. Did I finish them both. Nope. Not even close. I love the crust. It's thin, crisp, and perfect.   This place just completely changed the late night scene in NoDa. Benny's is open until 2am on Thursdays, 3am Fridays and Saturdays, and midnight all the other days.   They just opened a couple nights ago, so they do have a few kinks to work out in the beginning. Pretty cool to see a King of Pops cooler right up at the front. Congrats and good luck Benny's! We are so excited to have you here."}
{"text":"Wow these slices are huge!!! The menu may be simple but the taste is amazing!!! Had to order the monthly special (bacon cheeseburger) and two other slices (garlic mushroom and pepperoni) to share with a friend. After eating two half slices I was completely full. The pizza is very flavorful and the cheese is powerful.   The service was quick and the atmosphere is divey. There were what it seems like only 3 employees in the whole place and everything seemed effortless. Looking forward to seeing what the other monthly specials are!!!"}
{"text":"Pizza so big u gotta pay property tax on it - on fleek tho with the buffalo chicken sauce and pepperoni. No beer right now, but the old fashioned bottled cream sodas and root beers make the knees quiver. Late hour spot is just what's needed a little away from noda's main drag."}
{"text":"There's always been a debate on whether size matters. Benny's shuts down that debate and proves that it DOES. Benny's is a 'za spot that creates gigantic masterpieces and is a must visit if you're in Noda...not only is the size unreal but the price you pay for a slice also makes it a steal."}
{"text":"Great Pizza, staff is amazingly friendly, they got things down to a system! If you're in Noda and want some pizza definitely check it out. The quantity won't disappoint. The late hours are really useful for those who get out of work late and want to sit down."}
{"text":"My roommate and I decided to stop here after drinks next door Heist Brewery. The pizza was HUGE and we ordered 3 slices, 2 pepperoni and one \"pizza of the month\" which was \"philly cheese steak\". The pepperoni was pretty good outside of it being salty. The \"philly cheese steak\" was just steak on cheese pizza. There wasn't anything special about it and was pretty disappointed in it. I would go back for just the pepperoni. The total for all three huge slices were $15, which isn't too bad."}
{"text":"Wow - where else can you get a giant slice of pizza cooked to order for $5!  First time I went, I ordered two slices and barely made it through the one slice.  No worries though, it was great heated up for lunch the next day.  They also have a great selection of beers available to drink with your pizza because there's no greater combo that pizza and beer!"}
{"text":"I decided to check this place out because I had seen it in passing and I wasn't disappointed. The slices are HUGE! Think true NY still thin crust pizza. The crust on the pizza was flaky on the outside and the cheese they used was great. My only gripe with this place is that a slice is $4. Seems a bit steep but I'm not going lie, I'll probably pay it again for another amazing slice."}
{"text":"Holy cow! I can say I was thoroughly surprised with the quality of the pizza here! Coming from a person who has been spoiled by New York pizza his entire life, I would have never associated Virginia with having a quality pizza slice. The crust was almost perfect, and the sauce/cheese ratio was just right as well. I like my pizza thin crust, not too much cheese, and full of fresh flavor. This pizza stepped up to that expectation. Only request I would have, is that they would be a little bit more generous with the toppings when ordered on a pizza. My Fiance ordered the Chicken Alfredo pizza, and wasn't very satisfied with the amount chicken that was put on there. Looking at the pictures seen on the Yelp page though, it seems it wasn't very consistent in person than it was in the pictures seen. Overall, this place has gained a fan! Did I mention that they serve craft beer, and they are open late?! I don't live in NoDa, and it is a little bit of a hike for me, but rest assured I will be back in the near future."}
{"text":"awesomely music! Really chill places to hang with friends! Really hipster place in NoDa. Walked around more, more cooler arts."}
{"text":"The pizza is always great but today (July 26th, 2017 8:35pm) the young man at the register was fairly rude. Not sure if he was having a bad day but he surely made me feel unwelcome. SN: I still left a tip."}
{"text":"You're gonna need two hands for the size of a pizza slice here! Benny's is delicious and completely fairly priced. Usually pizza this size looses it's quality, but Benny's is the exception. Some of the best pizza in the Charlotte area for sure.   This place keeps it simple and to the point - pizza and beer."}
{"text":"Worth the drive to get there.  Huge slice of pizza, great taste.  Will definitely be back again!"}
{"text":"I wanted to try Benny's bc a coworker raved about their pizza. Just to throw it out there I'm not the biggest pizza fan , it's defintely not my #1 must have food, but if I do crave it , it's usually a deep dish. This pizza definitely is quite large for a slice so I think that appeals to a pizza lover , but it lacked in sauce and hearty toppings . There was dipping sauces you could purchase , and we opted for the marinara .  I liked the monthly special and combination of jalapeno and bacon but it was a little too thin and crispy for my taste buds, I felt like it was close to the consistency of a flatbread  vs. A pizza slice . I think if you like that really crunchy, thin crust pie texture,  then Benny's is your spot ."}
{"text":"Live close to here so it's dangerous for my diet. Perfect place to grab a (huge) slice after a night out. They usually stay open after bars close so you can grab another brew from the fridge and/or stuff your face (like I do) with some awesome pizza. Just don't mistake the Parmesan shaker for the salt shaker like I did last time"}
{"text":"Great vibes, and affordable! Right in the heart of noda."}
{"text":"I have never understood those people that say pizza is their favorite food, but Benny's has changed my mind.  1 slice is enough for my dinner- it is huge!  I don't think they serve anything other than pizza but it is so good, I don't know why you would ever want anything else anyways!"}
{"text":"Okay, this place is a good option if you are on a budget and you're strolling around NoDa. For five bucks you'll get a huge slice of pizza and, of course, not the best pizza you've ever had but still pretty good."}
{"text":"Best Pizza place I ever been!! And it's very cheap. Their pizzas are insanely delicious and huge!!! Definitely recommend and I'm coming back! No regrets"}
{"text":"So bad and so good that is right next to my house. I go then more often that I should but the pizza is not just big but also very good.  Every month they change the specials and I always try the veggie special, as I don't eat meat and is kind of cool being able to try different stuff, sometimes is very creative.  I always get there when I am starving thinking I could eat the whole pie but I have never done more than 2 slices, they are sooooo big!"}
{"text":"The pizza here is gigantic. I can never finish a slice. I think it is mostly good, but at times thin and greasy.  It just depends on the day.  Inconsistent is not good, but 4 stars for convenient hours, location, price and beer selection. The service is always good also."}
{"text":"Awesome. Pizza was great and a great price. Tax included. I honestly can't wait to come late at night to end a NODA night here. Keep it up!"}
{"text":"This is the closest I have come to \"boardwalk pie\" or Jersey style pizza. The crispy crust on the bottom that crunches as you fold it (and yes, you fold your pizza) and the gooey melty cheese brought me right back to my hometown. The slices are massive, as in two paper plates massive, but so delicious. I also love that it's not downing in pizza sauce, the pizza lets the cheese and toppings do the talking. Even writing this review I want to go back there and get another slice.   It's $4 for a plain slice and $5 for sausage/pepperoni or garlic mushroom."}
{"text":"Holy humongous pizza! I'm an pregnant and extremely picky right now, so I ordered the plain cheese pizza.  The pizza was made to order and was ready within 10 minutes.  These pizza was so big that it needed 2 paper plates to be contained.   I love thin crust pizza, but hate when it gets all floppy and hard to manage.  Luckily, this was not the case here.  Their crust was thin and crisp so it was not floppy, but also not so crisp that it turned to crumbs whenever taking a bite.  We will definitely return here!"}
{"text":"Excellent pizza by the slice! And a good bargain for lunch too. One slice was enough to fill me up. It was huge! I'll definitely add this to the regular lunch rotation and I'll be bringing my family by for dinner soon."}
{"text":"Big slices cool for a picture and eating while drunk, but after reality kicks in the pizza is flavorless honestly. Fuel pizza is a better choice for late night pizza eats."}
{"text":"Good pizza. Not amazing, but solid. Huge slices. The atmosphere is cool, especially the music. The customer service is excellent. The decor is far from a 10, but it fits the NoDa vibe. There are several tables inside, most of them large, but some of them are near the bathrooms. There are two picnic tables outside, but they're next to the parking lot. If you want to chill outside, go to the brewery next door.   Overall, I wouldn't go out of my way to eat here, but it's definitely worth a visit if you're in the area."}
{"text":"I've seen this place on various social media sites and picked it for a recent date night. Parking was easy. Ordering was easy. The guy behind the counter was super friendly. The ambiance and vibe inside is cool.   My fella and I both ordered a slice of mushroom garlic and a drink. I think this place is reasonably priced, especially considering what you get for the money. The pizza slice was HUGE (as all of the pictures on Yelp depict) and it was sooooooo yummy. It was hard for me to finish one slice but my man said he could have eaten two slices. I don't know about thaaaaaaaat but I do know that it is delicious and you should go! We are looking forward to coming back!"}
{"text":"Great late night spot. The slices are massive but the topping options are limited and the rotation of pizza options is random. If the pesto chicken is an option, go for it. Aside from that, you can't go wrong with the mushroom."}
{"text":"So the pizza itself is fine.  A nice big piece and the crust was nice.  My issue is that they take cheese slices and then put on whatever toppings you want and bake it.  So the toppings aren't integrated in the pizza.  For example, the garlic mushroom was a cheese slice with a pile of mushrooms (the slimy kind).  In addition, the mushrooms were only lukewarm.  I didn't order the BBQ chicken but I saw it and it looked like a cheese slice that had BBQ sauce and chicken on it.  In my mind, that's not what a BBQ chicken pizza is."}
{"text":"My new fave pizza place. One slice is more than enough to fill you up. Any pizza that needs two plates is well worth it. All of the staff were really nice. Added bonus they have outlets to charge your phone at the bar . They have local canned breweries but it's also next door to Heist Brewery. It's about a 7 minute walk from the 36th St Lynx station. Will be back"}
{"text":"Benny is a weekly visit for us. It's delicious. It's cheap. It's fast. You can't beat that. We usually visit on Friday or Saturday around dinner time and even though the place is small, there's always somewhere for us to sit. I promise you one slice is enough. We got a whole pie once and couldn't eat it in a week, it's 30''! Had to put it in the trunk of my car! We eat for two for $11. Two slices, two sodas. We leave full! You really can't beat that! Best pizza in CLT, hands down and now we drive from Mount Holly!"}
{"text":"We went here one late night since we were hungry. I got a slice of pepperoni pizza, I have to admit it was pretty tasty and as you can see from all the pictures the slices are huge! Even though it was good, it wasn't the best I've ever had, I'm not sure if it was the lack of sauce or the fact that the cheese wasn't as \"pull-stringy\" as I expected. It's definitely a good late night joint and will hit the spot!"}
{"text":"Pizza is ok, but have been sitting here for 36 minutes waiting for my order of one slice."}
{"text":"Great place for after bar hour pizza.  Left a local bar and was in desperate need of something good, greasy & quick. New to the NoDa area and I've seen this place a few times and their the first place that came to mind. The place was pretty busy with locals so that was a positive sign. Having moved from NJ/NY I'm use to a $1 pizza spot so not really expecting much. The pizza here is average but man the slices are huge. I've page $4 a slice for a cardboard pizza in NY and it's a basic slice, this place the slices are HUGE and good drunk food. The whole pie goes into a box that doesn't fit well out the door. Again nothing special about the pizza but they have a nitch with the pie & slice sizes which I was wow'd about. Could have been the alcohol since I was taking pictures with other folks pizza but it was fun. I'll definitely come back again but note to self, I only need one slice lol."}
{"text":"Best pizza north of uptown and best pizza by the slice in Charlotte. All you need is one slice and a local beer and you'll have a whole meal in front of you for 8 bucks. If you don't need the beer the price is 4-5 bucks a slice. So back to the point. The Virginia slice is literally the biggest slice of pizza you'll ever have. They serve it on two paper plate and it still hangs off the edge.   They have 2 specials every month as well as the basic toppings. I've never had a special that I didn't like. Everything is made right in front of you and you can choose to sit as a booth or table or at a bar. They even have a picnic table right outside for the nice days.   Located right beside Heist brewery this is an excellent stop while in NoDa. You can also order to go and be the hit of any party/tailgate by bringing a 30 inch pizza with you. Talk about an easy way to make friends. But seriously go check out Benny's"}
{"text":"If you're looking for New York style pizza, this is the place to go. For $5, you'll get a slice of heaven bigger than the size of your head.   They don't serve beer yet but Heist brewery is next door with outdoor seating. The sliced sausage topping is delicious!"}
{"text":"Fantastic, massive, delicious pizza slices!!! This place knows how to do pizza! Not to mention, they are open on the weekends until 3am!!! They should open another spot in south Charlotte! I had a pepperoni pizza with garlic cloves and garlic sauce. Isn't not possible to OD on garlic, right? So good and so cheap!! If you're in the area and need pizza, this place! Do it!"}
{"text":"Yum!!! Delicious big slices. Stays open late on weekends. Reasonably priced. Fast service too. Only cheese and pepperoni available late night. Crowd is definitely free spirited. Staff isn't the friendliest."}
{"text":"Chill place with delicious pizza! The pizza is seriously enormous!  One slice will get you full even if you're a giant. I love the inside..super laid back. I also love their large selection of can drinks...not many places you can get cherry coke or cherry Pepsi! Or Vanilla Coke! What what!  Nice parking lot too and easy to get in and out of! Always a plus in Charlotte..."}
{"text":"The pieces o'pie are HUGE! $5 average so it's worth it! However, there are some flavor challenges. I ordered Chicken Bacon Ranch and eh, it was just okay. My daughter ordered the cheese and she didn't care for it either. I like that the crust is thin! I like how much pizza you get for the money! Flavor wasn't horrible but it definitely was a little lackluster! I like flavor, especially if you're going to go outside the norm with CBR or even the Mushroom Pesto posted. It was kind of uninviting when we entered. No greeting or acknowledgement! When we were ready to order we had to ask if we could. Dude had a chip but oh well. We ordered then grabbed a seat at the bar. He didn't give us our drinks so we had to ask do the drinks come out with the pizza or nah. Dude had a chip, no acknowledgment, just sat beers down on bar. Pizza was done, dude sat pizza on to go counter instead of in front of us then pointed at it. Wow! This kid has issues clearly soooo...BEST part of the visit was the music! Old school rap and R&B! Plus, the guy who took and filled my order for a second beer was super friendly and knowledgeable about the Wicked Weed out of Asheville. He was cool! Not too sure I'll return to Benny's but it's not because of the kid with the chip."}
{"text":"This is hands down the best traditional slice of pizza you can buy in Charlotte. They also linked up with postmates for delivery! Everything at Benny's is hot and delicious. They even have a great selection of local craft beer"}
{"text":"It was okay I suppose. Pizza are \"HUGE\" and they are made to order. You seat yourself and they call your name when it's ready so you can come get it. They have a variety of can sodas for $1, $3 energy drinks and $2 Snapple. They also have a variety of beers. One thing I did not like was it was hot almost like the A/C wasn't working. Would I make a special trip, probably not."}
{"text":"Huge slice, great price. A work friend recommended this place and I'm so glad I stopped in.   This place is pretty solid. The atmosphere definitely fits the NoDa vibe- laid back and carefree. Staff was nice and friendly. While waiting for my pizza, I met some really cool people and mingled while waiting.   The pizza itself was pretty good. Actually, it was great and much better than expected. They stay open late which makes a great place for a random trip with close friends, date night, or if you just want something special.   Definitely recommend!"}
{"text":"One of the Worst Customer Service Experiences Ever! We often go out to eat at many different places for new experiences. I've dropped in Benny Pennello 2 other times to grab a slice on my way home from work and was very pleased with the pizza. We were in the area at a Network Event with my husband and decided to grab a slice of pizza and eat it dine in. My husband has never been here before so I was excited for him to see how large the slices were! I don't think the worker in picture below knows how to handle the non drunk guest very well. We ordered and told to have a seat and that's what we did. We sat down at the bar so we could see them make the pizza pie because I was fascinated by how large they really were. Not to mention they were NOT BUSY AT ALL! When our pizza was ready yelled our name than looked over at us instead of just handing it to us. No big deal husband got up and grabbed both our slices. Once he brought it back it was burnt tasting and also looked burn on bottom. I asked Nicely if we could get two different slices, comment was \"I've been working here 2 years that's how they always look\", instead of just saying no problem. Three minutes later 2 more slices were handed to us from the other gentleman that was working and looked just like I remembered not burnt. Which I know a pie was not make special for us in 3 minutes. Last thing to top the bad customer service experience there, when leaving wasn't aware of the clean up your plates policy and same rude worker in picture below yelled \"clean up you mess\" super loud and rude. We were shocked and my husband turned right around and grabbed our plates and drinks and threw them away! This was a horrible experience and probably will never return unless we are in area and she's HES not working! He might need a new job he enjoys and doesn't hate so much!"}
{"text":"Hands down best pizza I've had in the Charlotte area thus far. Something about the fluffy, yet crispy, crust is just phenomenal. Each month they have both a meat and veggie specialty pie, alongside their already phenomenal regular menu options, all of which can be ordered by the slice. Not only is the 'Za amazing, the staff is equally just that as well. Super friendly and personable.   Bottom line- If you're from out of town and just looking for a good slice, come here. Or if you're a local just looking to broaden your pie portfolio, this is your spot. Orrrrrr if you're on the fence about checking this place out, what are you waiting for? Just do it already!"}
{"text":"I love pizza, and what I love even more is pizza by the slice ! Benny's delivers! They only offer pizza, and only a select variety. But, when it's as good as it is I am fine with that.   On my recent visit I went with the pepperoni, the slice was amazing. The perfect temperature, crisp but soft crust and the cheese ratio was on point. Although the slice was gigantic, as you can see from all of the photos, I had no issues finishing it! And, as others have said, I love the old school soda options, and they recently started serving beer, yippee!! I definite stop for me again when I am craving a slice of pie!"}
{"text":"Amazing pizza by the slice , fast order times, and great customer service . And great location by Heist Brewery!"}
{"text":"This pizza is really good. I am from NJ and picky about pizza, but this is the real deal! The cheese blend is awesome and the slice is a great value, I'll definitely be back!"}
{"text":"Best Pizza in NODA.  Since Revolution closed it's really the only pizza in NODA now.  It's great pizza though.  Very simple, basic, good pizza.  The dough, crust, sauce, cheese and 5 or so toppings are solid.  It's not joke, this is the biggest pizzas I've ever seen.  I couldn't fit the box in my car without opening the trunk.  It's $5 for a slice and that's all that most people should need.  Great pizza for a great price.  Wish they had more toppings and the beer selection is small but that's not why I would go there.    ***  I live in the middle of NODA and have been everywhere in the neighborhood many times over the past years. These reviews are a culmination of lots of visits so it's more of a consistency rating than anything.  If you are going out in NODA I've got reviews up of all the places in the neighborhood if you're looking to compare.  ***"}
{"text":"So I was craving pizza & started reading some reviews on different places. I had already heard some good things about Benny's and after reading the reviews it was time to try it! I heard some great things about the Buffalo Chicken pizza so had that set in my mind. But little did I know I would be a bit disappointed. So Benny's only offers pepperoni & cheese slices and then two monthly specials. (Buffalo Chicken was only offered the month they opened.) This month (Oct) the specials were Smoked Pork and Spinach& Feta. Even tho I was set on Buffalo Chicken I decided to stay & try it out. And when I say I'm glad I did! The smoked pork pizza was soooo good! At first I was taken back that I couldn't get any other toppings but that pizza needed NOTHING else! It was perfect the way it is! And they offer the Virginia big slice so one slice is definitely enough. I also had a great beer to wash it down called Estrella (And I'm not a big beer drinker.) I really do love the concept & will definitely try to be back each month to try the monthly special bc you can't go wrong with pizza & beer!"}
{"text":"There are several wins here:  1.)  It's pizza 2.)  It's huge 3.)  It's pizza 4.)  It's in NoDa 5.)  It's pizza 6.)  It's open late 7.)  It's pizza 8.)  It's inexpensive 9.)  It's pizza  Seriously, this place is great.  The concept is super simple.  Gi-huge-ic pizza by the slice for only 5 bucks!  Get a whole pie if you need to feed the Brady bunch.  Just be careful.  The box won't fit in your car.  You'll need a few bungee cords to strap it too the roof!  Benny's is open late every night.  They rock it out until 3AM on Friday's and Saturday's.  It's pretty genius when you think about it.  Everyone getting kicked out of the bars at 2AM just floods into Benny's for a slice before heading home.  Late night herb enthusiasts can get their midnight munchie fix on too.  A better business model does not exist.  #nailedit  Don't expect a 5 star dining experience.  It's four walls and a pizza oven done right."}
{"text":"This is pizza at its finest..well maybe not finest but, Benny's is pretty bomb pizza joint. The slices are GIGANTIC, they hand it to you on two paper plates its so long. A slice of cheese is $4 vs. a whole pizza $30.. extra for toppings of course. This is super satisfying NY style pizza you just fold and stuff your face with. I love the crunchy crust. It also has a great sauce to cheese ratio. The best drunk munchies if you stumbling over from Heist.   Local brews and other drinks are available as well. Staff is nice. We will be back for sure. Cheers!"}
{"text":"I don't know why this place isn't always full with a line out the door. Huge slices of pizza, local beer and vast soft drink selection (cans/bottles), sweet mural action and stellar location.  I'm a huge fan of their plain cheese pizza. Simplicity wins the day here, folks. I appreciate that there's always a vegetarian option among the 2 monthly specials.  I've always been impressed with the service...for a joint like this, the staff is super friendly and helpful.   Parking is...well, you know. It's NoDa. But the lot is shared with Heist so you can usually find a spot."}
{"text":"Wow! I loved Benny's while at Virginia tech but this is a whole new level! Great atmosphere and pizza!  Awesome murals they are putting together inside too"}
{"text":"Delish pizza! Giant slices so you only need one."}
{"text":"Came here on a Saturday night about 11 ish.  Was excited that a pizza place was open so late in the Charlotte area  that offered pizza by the slice . I have to admit I'm used to NY's pizza and NY's Pizza prices . I didn't expect to pay the same as a NY slice  but not 5$ either . So yea , I was a little shocked to see that it was 5$ a slice .  I'm pretty sure the pizza place at the epicenter isn't 5$ a slice but anywho... Despite the price , the pizza was good enough even though I'd probably only buy 1slice at a time . I just couldn't see myself buying 2/3slices at a time . After saying all that, if I was in the mood for late night pizza I'd definitely   swing by again due to convenience and availability . So I guess that breaks down to  a decent slice + late night availability +convenience =5$  Also side note, I think the mushrooms on the  pizza my friend had were canned which is no bueno. Canned mushrooms are never ok .."}
{"text":"This place is only cool for the crazy oversized slices and pizza boxes and that's it.  If your looking for actual good tasting pizza and really know what that is - keep looking.  Staff is pretty rude and not very helpful.  Parking is a pain as well.  Was hoping some good pizza actually moved into the neighborhood.  Anyone saying this is like NY pizza really needs to spend more time in NY."}
{"text":"Compared to the other ratings I see, 3 stars may feel like a slap in the face. I was really hoping Charlotte finally had a place that could figure out pizza. But it looks like we'll still have to stick to BBQ. The pizza was fine. Definitely not bad.  I was just hoping for more.   The slice is huge, but more of average doesn't always equal great (i.e. The Golden Corral model...if I eat a stack of newspapers, I'll be full, GC, but that doesn't make the newspapers worth eating)  Also, you pay for the giant slice ($5), so it's not the greatest deal. *sips haterade*   and did anyone check out the price of a full pizza from Benny's?!?!.....I know it's NODA, but do you know how high I would have to be to order a $38 pizza from this place???...I mean...damn...a family of 12 could live off dominos for 5 yrs for that price."}
{"text":"Great, huge, tasty slices of New York style pizza. Love it! Staff is easy to talk with. Great place for a quick bite before a night on the town!"}
{"text":"This is a place that is different from normal pizza places.  They have a limited number of choices for toppings and sell huge slices of pizza.  The price of whole pizza are priced high enough that unless you have a large group that wants the same topping, you are best to get it by the slice   I got the cheese because that was the only topping that I liked. The pizza is good, but I live in an area that has the best pizza in the country. It also has the topped rated pizza restaurant in the country ( Frank Pepe), so it's hard to give this place 5 stars if I compare it with that I get back home.  The reason for my rating is that this place lacked choices for topping and it's oven is not hot enough ( coal or wood brick oven) to blacken the crust.  However the crust is very thin, which I like. Also the restrooms were not the cleanest.   However for North Carolina Pizza it's very good.  They also play oldies , which I love."}
{"text":"Great NY Style pies!! And the slices are the largest I've ever seen. Fun place with $2 PBR pounders as a bonus."}
{"text":"Slices bigger than your face X 2!!  Benny Pannello's is a pretty cool joint, definitely a good stop during a bar crawl or just any day you are craving pizza (for me that's pretty much every 2 hrs).  Every time I come here I still have to laugh at the size of their pizzas... especially the boxes since they pretty much take up the entire width of a small sedan.  I may even have to put down the back seat in my Prius to get one of those babies home.  Pretty straightforward place.  Booths and tables, bar seating and the options for slices hanging behind the bar/register.  While you are waiting for your slice, you can watch the friendly and dedicated workers sling pizzas into the oven, slice them up, and serve them up on a double paper plate.  DOUBLE PAPER PLATE... that's how long the slices get.  I think they have 4 different slices (usually)... and of course you can order full pizzas of those choices.  They have specials per month.    Call ahead or order in.  You can bide your time with a wide beer selection or a Popsicle from King of Pops.  Parking is shared with neighbors Heist Brewing, usually not an issue to park here (which is a plus - especiallly in NoDa)."}
{"text":"This was a cool place with absolutely GIGANTIC slices of pizza. Had a sorta hipster vibe and there was a nice brewery next door in case you want to enjoy the best combo ever."}
{"text":"This may have been the biggest slice of pizza I've ever had, so it was definitely worth the money ($5).  It was a bit doughy, but an ideal slice to eat after a trip to the bar."}
{"text":"At first - I was like it's just big pizza. It's not that big of a deal.   The slices are HUGE! Most people can definitely eat one slice, but if you attempt for 2nd - I guarantee you won't finish it.   I have been utilizing Benny's for our work functions. I order 12 whole pies for work and every time it is a hit at work. While they don't have a big variety of pizzas compared to national local chains, what they do make is pretty awesome. They change up their specialty pizzas by the month I believe.    Whatever kind of sausage they use, it's big round flat slices of it and pretty tasty. But my preference is their Garlic Mushroom Pizza. It's so freaking good. It was that pizza that makes me such a fan. It is perfect. They also make the dough themselves and you can taste the difference.  They have only limited space in their oven so depending on your order - it could take a while. They always do a great job at accommodating my large orders and make it work."}
{"text":"Hands down !! Best place for pizza in Charlotte. The slices are huge and absolutely delicious!!! I wish my stomach was bigger so I could eat more. Super trendy and hip and nice place to meet for a quick bite. Thumbs up!"}
{"text":"Great pizza at a great price! The slices are huge and their menu is fairly simple. We were greeted with a smile and our pizza was ready in about 6 minutes. I don't think it can get any better than that. And to top it off the pizza crust was crispy and actually could support the above average sized slice."}
{"text":"Holy Pizza! I knew I had to try this place from the size of their pizza slices. I never go to any pizzeria and not order 2 slices for myself, but when I saw how big these were I stuck to just one slice. Good thing, because I struggled to finish it off.   Lots of seating, good service. I rarely travel to NoDa, but I'll be back to have another single slice late night."}
