{"text":"Went there last night, and got the 4 course tasting menu. 

Amazing, and really creative uses of ingredients.

The muscovy duck and the hen egg are must tries! 

We will definitely be back and highly recommend Bero to anyone who wants an innovative/creative dinner.

P.S. Service there is also amazing, and the Chef actually came out and presented half of our dishes!"}
{"text":"A highly impressive dinner all-around. Fourteen beautiful and well-composed dishes for under $80 (we got the 8-person family-style option) makes this incredibly accessible and worth checking out. Though only hinting at Basque country, the menu and inventiveness is more reminiscent of my experience at Eleven Madison Park - and that was my most memorable meal of 2012.

For me, the first half of the meal superseded the second half. I really, really loved the colourful parade of dishes that celebrated the flavours of summer in a way I haven't experienced on the palate in some time. 

Favourites:
--- White Gazpacho ---
Shallow bowls cradled a cluster of compressed cucumber infused with orange blossom. Against these vibrant shades of greens and yellows, a single leaf of sorrel sat, its red veins in colourful contrast against the verdant backdrop. With its pulpy texture, coffee-soaked chia seeds that sat hidden below gave an interesting dimension to the creaminess of the soup. The gazpacho itself was devoid of the traditional chunky texture that comes from processed bread and nuts and retained a subtle garlicky tang. Very refined in composition and lovely way to kick off our meal.

--- Heirloom Tomato ---
Waiting for us next was the heirloom tomato duo. Part 1 was a soft, spongy marshmallow of tangy tomato and a salty smear of parmesan cream. The intense and bright tomato flavour played well with mallow's delicate texture. Really fascinating to eat with it pushing my expectations.

Heirloom tomato, part 2. An eye-popping course in shades of red, green, and yellow accompanied the marshmallows and would usually be plated together. Fried capers burst with briny explosions against the more subtle flavours of kaffir lime-compressed watermelon and the sweet acidity of heirloom tomatoes. Rings of golden kumquat lent a floral citrus note and along the edge of the plate, quenelles of blue cheese mousse added a subtle hint of earthiness. A truly crazy pile of flavours that worked deliciously well.

--- Nordic Shrimp ---
Nordic shrimp sitting with a burnt scallion purée and rolls of compressed romaine hearts. A chermoula sauce (often made of a mixture of herbs, oil, lemon juice, pickled lemons, garlic, cumin, and salt used in Algerian, Moroccan and Tunisian cooking) with spongy banana \"biscuit\" and cilantro. Delicate and delicious shrimp along with the joy of sucking the shrimp heads were the standouts on this dish.

--- Bone Marrow Gnocchi ---
Bone marrow gnocchi, with celeriac cream, parsley purée, fried garlic, parsley, and snails. Everyone just about lost their minds over this dish and I am pretty certain we could have all eaten a bowl to ourselves. The rich and subtle flavour of marrow with the soft gnocchi and chew of snails - unbelievably good. I loved the tint of green in the gnocchi that came from the addition of parsley.

--- Mushrooms ---
Mushroom lovers take note: golden brown king oysters, yellow hues of chanterelles, and a timbale of cremini and shiitake. Raw peas and a mint purée provide a fresh foil to the earthiness of the mushrooms. Bright yellow mounds of vanilla sabayon gave the dish a sweet creamy touch that could have doubled as dessert if it were on its own.

Leslieville is a great neighbourhood and Bero adds a relaxed sophistication to the already impressive stable of restaurants in the area. With good food and an atmosphere that invites conversation, Bero should have a lock on the locals and with people further out.

NOTE: I did not experience any ventilation issues, so I assume that's been corrected given an earlier Yelper's review.

Visit the blog for photos!"}
{"text":"Partial review:
.......Kantor's menu options at Bero are relatively simple- four courses for $52 or a full 7 course tasting menu for $84 and a choice to add beverage pairings for an extra $32 or $54, respectively.  For those unwilling to commit themselves to a lofty flight, there are glasses ($9-17) and bottles ($37-130) of local and international wine (mainly Spanish, Italian, and France), beers in bottle and tap ($5.95-10.95), and a list of classic cocktails like Negronis, Old Fashions, Martinis and the French 75 ($12).
Food items showcase the farmers market's best with a vast variety of proteins and produce represented in the \"ingredient list\" style description.  The website suggests that Bero is \"influenced by Basque and Spanish culinary\" but that they do not limit themselves to only one style or cuisine. Essentially, Matt told me that they had started the Bero concept thinking Spanish was their approach, but in the process simply aimed to do excellent food- Spanish or otherwise. And while I think Spanish food is my favourite cuisine right now, with a handful of already excellent authentic Spanish restaurants in the city, a little diversity and culinary creativity is certainly welcome.  Wanting to experience that creativity as much as I could (ie. try different dishes than my dining companion), I asked a wee-favour of the chef. Could each of us get wine pairings along with the 4 course menu each, and then add a foie gras and cheese course each (meaning 6 courses for each of us?) - yes, yes we can. Unfortunately, I meant to ask our server for the list of wine pairings so I can't speak in detail to what those were (and after 6 glasses, I kind of forget).  However, I will note that both myself and partner (a bit of a wine snob) were quite impressed with the pairings.  There wasn't a single wine we didn't like, and feel didn't match well with the food. And speaking of food, here's what we tasted.

Heirloom Tomato: Watermelon, Kumquat, Blue Cheese Foam, Tomato Marshmallow

A really well balanced few bites. The watermelon was crunchy and sweet, balanced out by the bright tomatoes, the acidic kumquat and the pungent yet creamy blue cheese foam.  The highlight for me, however, was definitely the cushiony tomato marshmallow, which had a light ethereal consistency to balance the more assertive textures on the plate. A lovely summer dish.

Peach Gazpacho: Caramelized Onion Beignet, Pistachio and Fennel Tuile

It's hard to pick a favourite dish of the day, but this one was right up there. We were instructed to break the delicate tuile into the cold soup, acting as a flavour-packed crouton and delivering the much-desired crunch factor. The gazpacho itself was sweet, tangy and literally made my taste-buds tingle. Oh man- and that beignet.. damn. Imagine a buttery doughnut filled with sweet caramelized onions. I really could not think of a more welcoming bite.

Bone Marrow Gnocchi, Garlic Roasted Snails, Celery Root Puree, Parsley and Fried Garlic Chips

With the extra lusciousness from the marrow, these gnocchi were surprisingly even more angelic than your standard pasta. They were light, super moist, and literally dissolved on my tongue into a pool of flavour and not gummy flour.  I also enjoyed the mild sweetness of the celery root puree, played up by the roasted snails and golden brown garlic chip garnish.  It doesn't surprise me that Matt said this is a very popular course.

Octopus with Chorizo Chips and Sea Bean with Potato Whip

Another favourite dish- the octopus was flawlessly cooked- I mean, I have NEVER tasted octopus so tender and moist- even Alinea's suffered from an unpleasant chew. The impressively thin and crispy chorizo brought a desired element of salty heat and the potato whip was a creamy, luxurious dream. Solid.

Seared Foie Gras with Puffed Quinoa, Apple & Celery Sorbet, and Sherry Gastrique

You can't screw up foie gras- that's been my experience anyways, and Bero was no exception. The foie gras was beautifully cooked and paired nicely with the sweet gastrique, and I appreciated the refreshing flavour of the sorbet. It was a little sweet, a little acidic, and somewhat vegetal as well- but the flavour was just pronounced enough to let the foie gras shine and to simply cut it's richness. I also really liked the satisfyingly crunchy texture of the quinoa, which added an appreciated textural contrast with the sorbet. 

Lamb Saddle with Avocado Puree, Wattle Seed Dust, Apricot, Zucchini and Purple Potato

Another flawless preparation- the lamb was so tender and juicy, I barely needed a knife. And while lamb and avocado curtained seemed like an odd pairing, it actually worked surprisingly well. Very simple, but because it was so well executed, I couldn't help but wish we had more.

Duck Breast with Duck Confit Leek-Wrapped Cannelloni with Corn Pudding and Freeze-Dried Corn, and Black Garlic Sauce

Okay so we're back at the favourite dish game again- this one was a no brainer for me because ....."}
{"text":"Came here a few months ago after a few different friends raved about it and have been meaning to review. Had the four course menu -- the flavours were sophisticated and refined, the dishes were all incredibly creative. The service was remarkable. We had a great sever, so friendly and well-informed about the restaurant, the chefs, the wine and the dishes being served. We were even served by our chef and the pastry chef at the end! Great experience without the pretentiousness! Looking forward to coming back soon."}
{"text":"I feel very torn about how to review this restaurant. My husband and I went here for my birthday and had the 4 course meal. You get to choose two appetizers, an entree and dessert. We had the ceviche, the gnocchi (because everyone raved about it on Yelp), the octopus and a mushroom dish as our appetizers. I had mackerel for my main and my husband had duck. Everything was cooked well. The chef uses lots of different sauces and foam, and lots of unique ingredients. For example, mushroom dish had 4 different types of mushroom, none of which I had ever heard of. The chef came to the table for most of the courses and explained all the ingredients and answered our questions which was nice. We also shared an additional cheese course which was delicious. The gnocchi and the octopus were highlights for us. The ceviche was good, but I've had better elsewhere. 

Total bill came to $200 for the two of us with the extra cheese course and 3 drinks, which I felt was reasonable for this type of restaurant. However, we both walked out and were starving, to the point where we had to stop for food on our way home. I have never done that before! If I'm going to go out for a nice meal I want to leave feeling satisfied, so for that reason I can only give this restaurant 3 stars. I would only recommend this place if you are going to splurge and do the 7 course chef's choice meal (i think its around $80). Unfortunately, because I am somewhat picky we chose not to do this."}
{"text":"I am unlikely to go back but if you are looking for a unique tasting menu (and don't mind paying for it) then Bero is worth a visit.

In my opinion the tasting menu was unique but at the same time unmemorable. The food was all very well prepared but there was nothing outstanding over the seven courses. They use some light molecular gastronomy techniques that are absolutely novel (at least for me) but did not seem to add a lot to the meal.

The wine pairings were solid and the service really great but the space leaves a lot to be desired. For a top end menu that is meant to be eaten leisurely the space is too small and cramped. We were seated at the back just outside the kitchen which was certainly part of the problem. For a $500 meal for two I would have hoped for better and would suggest they kill that table off."}
{"text":"My wife and I went to Bero on July 20th and both had the 7 course meal with the wine pairing.

As many have already outlined the amazing food here, I won't go into detail, repeating what has already been said.

Overall, this was one of the most creative and well balanced meals I've ever had the pleasure of eating.  Each dish was so well thought out and the extra attention to details in the plating should really raise the bar for Toronto restaurants.  I also felt the pairings were very well done.

It was a really nice touch that Matt Kantor served us each dish and explained everything to us (full disclosure, I have worked with Matt professionally before) and answered any questions we had.

The meal left us in a state of euphoria.  My wife and I talked about it with each other, raved about it to others, for days after.  I still recommend highly to everyone."}
{"text":"Wow, was really impressed by the creativity and flavour combinations in pretty much all the dishes I had at Bero.  I was here recently for the chef's menu ($98) and did it ever deliver.  Each dish was better than the last, I was so sad when the meal ended.

As many others have mentioned, the bone marrow gnocchi is deliciously awesome. It is so soft and fluffy and has that subtle bone marrow flavour that well, you can only find in bone marrow.

Other favs of mine included the lingcod on brioche, and the muscovy duck which was done amazingly well.  Even the little appetizer/amuse-bouche they brought in the beginning, which contained mik and black garlic, a combination I would never have though tasted good together in my life, was amazing.  There was only one dish that didn't sit so well with me, and that was the foie gras, as it wasn't pure foie gras and it was a bit too salty and had a strong flavour I didn't enjoy.  The duck fat bun it came with though, was heavenly.  And I never use that word.

I've heard Bero described as having Spanish/Mediterranean influence, I think because the executive chef has a background in that type of cuisine, but really I thought that the menu was agnostic to any particular type of cuisine.  It was more of a locavore-meets-molecular-gastronomy type place; a good mix of everything with some old school thrown in with the experimental.  It was honestly the best meal I've ever had, and was worthy of something belonging in a much more expensive restaurant.  RUN, don't walk, to Bero, before Bero gets so famous that there's a months-long reservation wait list!"}
{"text":"Great meal. Attentive staff. Wine pairings inspired. Really like that we have such an amazing restaurant in the hood.  

My only caution is when training new staff always accompany them. This price range deserves educated servers.  

The gnocchi was a pillow from heaven."}
{"text":"The food - everything was superbly done with great flavors that were sophisticated without being overly complicated.  If you're a real foodie, you'll appreciate what they are doing, but somebody who just likes delicious food won't be confused.  I hate when restaurants think complicated always means better - lots of technique to appreciate here, but they don't hit you over the head with it.

The best dishes I had were the bone marrow gnocchi and the foie gras with watermelon.  The gnocchi had very deep flavor with the marrow but were also light - they didn't sit like lead in the stomach.  I never would have thought watermelon went with foie gras but boy does it!  I think they said the watermelon was compressed - which would make you think mashed but it wasn't mashed - intensely flavorful and delicious.  As I think about it now, damn i wish I had some more tonight.  Hope that dish sticks around.

Octopus dish was pretty awesome as well - this had smoked mashed potatoes (I think that's what the called them) that were perfect with the octopus and the whole thing looked cool enough I took a picture. 

There was small dessert plate with a few things on it, but I was stuffed by that time and didn't touch it.

I had the 7 course with the wine pairing.  I'm not usually a huge fan of of wine pairings, but decided to get it after talking to the bartender & seeing some unusual wines on the list.  This was the best wine-food pairing I've ever had!  Excellent job by whoever did it.  They also pour just the right amount per course, so you're not trashed by the end of dinner, or sending back half-full glasses to keep up.

One criticism is the dining room is a bit too dark.  The food should be a bit better lit - I would have taken more shots, but didn't want to disturb other tables.  Also, nobody was sitting directly behind me, but the space looked tight enough that it might have been a bit close if there were somebody there.

Dinner here was truly excellent and deserves every bit of 5 stars.  Wanted to try a new restaurant while in Toronto for the weekend and so glad I did - not to mention this dinner in D.C. would have been $200+ easy with the wine flight - I'll be back."}
{"text":"Was really hoping this would be great as I live near by.  It wasn't... They are charging top notch prices and neither the service or the food measured up.  Mine was OK.... just OK, certainly nothing I would need to have again.  The menu is quite vague in it's descriptions which is fine, but when we asked for a better description and were told a dish was prepared a certain way we expected it to be that way.  Not even close, person I was with was turned off by it completely.  She felt the need to mention it and someone who I assume was the owner came over to discuss... his attitude was quite flippant.  To me that was the biggest disappointment.  If they charged half of what they do it would be a little more acceptable...If you want/expect a fine dining experience I suggest looking elsewhere."}
{"text":"We've been to many highly reviewed restaurants in Toronto and most of them fall short of expectations - except Bero. The food was delicious and well balanced. Definitely better than I expected and lives up to the hype. One of the only restaurants I would recommend to others as a memorable and good meal. 

The decor and music leaves a bit to be desired, but otherwise, a new favourite."}
{"text":"We came here for a friend's bday and all I can say is that i have never had such an innovative/creative dinner before.

Bone Marrow Gnocchi? Ya he did!

Loved how the Chef came out and presented every dish too, on point.

I will be back for sure."}
{"text":"We are hardcore foodies and love to try out new establishments, so when we heard about Matt Kantor's Bero we were excited to try out the spanish/basque style cuisine he is known for. Leslieville is not known to have a happening dining scene, so we were hoping that making a streetcar trip here was going to be worth the time. It's hard to tell from the street what's going on inside and while we were dining we had a few curious onlookers peep inside. There were couple of issues right off the bat as we got seated at our table
* The restaurant was filled was smoke (the obnoxious kind), apparently due to ventilation issues
* The seating space is cramped (literally not an inch of movement), they could perhaps put one less table to make it comfortable for all guests. 

Nevertheless, there were no apologies from the staff and it was business as usual for them. The smoke was unbearable at times and I would have much appreciated an upfront apology from the staff apprising customers about the inconvenience. The wine menu is limited and I did not find a white wine that would appeal to my palate. Anyways, despite the not-so-memorable start to the evening, the food was the saving grace. 

They offer 2 set courses (4 courses for $52, 7 courses for $79). Both me and my wife opted for the 4 course menu with different options for each course. The portions are tiny but they the focus is on quality here and not quantity.

Some of our favorites were
* Gnocchi-bone marrow*snail*celery root
- By far the best dish of the evening. The gnocchi was tender and not very rich. I could easily order this again

* Halibut-escabeche*lemon*dates
- Simple yet flavorful dish. Halibut was well cooked and the escabeche had nice flavor and color

* Strawberries-black malt*white chocolate*milk sorbet
- The meringue version of the strawberry was a nice surprise and overall a well composed blend of textures and flavors for a dessert dish

Solid dishes
* Nordic Shrimp-chermoula*cilantro*lettuce
-The chermoula had a nice kick to the delicate shrimp.

Dishes that completely missed the mark
* Mushrooms-pea*egg*red onion
- Absolutely dry with no sauce to the bind it all together. The ragu was flavorful though. We did not finish the plate since the mushroom was a bit charred as well.

There were issues with service in terms of consistency of attention but I can cut them some slack given that they have recently open. The food is simple yet creative but unless they fix their space and ventilation issues, it's not the kind of romantic place that it promises to be. We walked out with smelly clothes and instantly put them in the washer once we got home, not pleasant at all !!!"}
{"text":"Lovely, well-constructed, delicious food.

Did the four-course menu on a Saturday night for $59 each. The boyfriend added on a wine pairing per course for $36 (well worth it - full-size servings per course), and I added on a cheese dish for $12. 

Starters: hamachi was excellent, light yet complex. Carrot soup was soft and creamy, but not a stand-out. 

Second: we both had the bone marrow and escargot gnocchi. Wow. Delicious, melt-on-your-tongue flavours that were deliciously complex but very light. Favourite dish of the night.

Main: deliciously cooked duck with a very interesting vegetable composition. Boyfriend had the lamb saddle with avocado and potatoes. Perfectly-portioned dishes and perfectly-cooked meat.

Cheese: creamy and excellent, paired with honey, red wine reduction and meringue. Can't remember the variety.

Dessert: the creme catalan with blueberries and crumble was good, but not a standout. Boyfriend had the chocolate tarragon chocolate with Turkish coffee icecream(?) - wow, beautiful and rich flavours. 

Service was lovely, but a tad slow at the beginning. They didn't explain the wine/food pairings, which would have been great. Also, if you're looking for a cool place to eat on a Saturday night - this probably isn't it. But if you want great, uncomplicated food in a classy and peaceful environment, this is your place. Well worth trying!"}
{"text":"Awesome. Attention to detail, complexity of preparation, creativity of ingredients and quality of service were all outstanding. Leslievillle truly now has fine dining. Bravo"}
