{"text":"I was graciously invited to the soft opening of Bestellen Friday night and walked away thoroughly impressed. Situated on a derelict strip of retail on College just east of Dufferin it's definitely got that \"out there\" and \"first\" kind of vibe that the restaurants on Dundas and Ronces have--if that makes sense. Anyway, its cool. Let's leave it at that.

I walked in at 6:30 to a full house, they had two cameramen shooting promotional footage and I thought that was pretty swag. The restaurant is pretty big and deep in comparison to the site of the storefront. I'd say its about 60 seats. The decor is what you'd expect from a new restaurant in this decade: lots of found wood. We got reclaimed wood ceilings, reclaimed wood tables; it's all reclaimed. I dig the look, I always do. The menus, which are mounted on wooden boards reminiscent of  a gussied up cutting board, tie the whole meat+wood aesthetic together.

We were told the menu was limited because it was the soft opening and the reviewer below me has done a pretty good job at describing the standouts. I personally split the 30 day aged striploin with a friend ($40) and ordered a side of duck fat fingerling potatoes with it. If the meat locker in the restaurant is any indication, this place is going to be a serious spot if you like beef. The striploin was easily one of the best pieces of meat I've tasted...I'll go ahead and put it above BONES in Atlanta (best steakhouse I've eaten at personally). Other standouts were the fried cheese curds with smoked ketchup ($7, and be sure to save the ketchup for your frites!), the brussel sprouts and pork belly ($6), and even though I didn't have it I saw a lot of burgers ($18, dry aged beef, carmelized onions, raclette cheese, brioche bun) on tables.

Wines are divided into three price levels (nice and easy) $45, $65, and $85. Beau's on tap (swag).

Overall, I thoroughly enjoyed my meal wish Rob and Ryan nothing but the best--they've got a real winner."}
{"text":"Went for Summerlicious. It was highly mediocre - charcuterie was decent, hen was too salty for my liking. Dessert was very good though - lemon pistachio cake with candied lemon on top. Service was great, but just so you know - sparkling water is $6.50 a bottle. Also a little loud inside. Overall there are probably places where you can get a better meal for $35."}
{"text":"We have always wanted to try this resturaunt. However, one thing is holding us back. When we walk by the window and see the chairs set on top of the table with the chair legs planted on the table already set for the lunch menu, we are grossed out. We can't believe that anyone thinks this is in anyway proper. So no thanks."}
{"text":"I created a Yelp account specifically to review this place. I work in the industry and have never felt the need to go so far as to actually take the time to create a profile and review but here it is... 

This place is incredibly pretentious. I went here for the buck a shuck wednesday special. The oysters come as is with nothing but a lemon wedge and horseradish, which is fine but considering the overtly pretentious vibe, you'd think you'd at least get a side of garnishes and sauces. I asked if they had any of that and they said it would cost 2$. Ok? Sure. Better be good. Nope.

We also ordered classic dirty martinis which came in the most pretentious miniature glasses with the liquid dripping over the brim. and the 2 olives on a skewer in a shot glass next to it. WHY? The pompous vibes are not in sync with the product at all. 

THEN THE BILL: the martini was 15$ each. Im drinking what probably max 2 ounces of gin and some olive brine? Why should I be charged 15$ for that??? It's not a damn cocktail. It's the most basic martini.

I like spending money on quality meals and I don't even mind small portions but only if the quality is there. 

THIS PLACE LACKS QUALITY CONSIDERING THE PRICE
AND LACKS HUMBLE MODEST VIBES. 

The bill in total cost 100$ and it felt like i had consumed the most expensive luxurious-yet-not-actually-luxurious air snack. 

Service was great.

Never again."}
{"text":"The dinner at Bestellen was fantastic.  The cocktails were delicious and the wine was flowing.  The restaurant was packed and pretty loud, but definitely not Grand Electric loud. There was one stand out item for the \"plates\" section of the menu and it was the côte de boeuf, roasted bone marrow, choice of two sides, which I split with my friend.  The steak was cooked perfectly and the presentation was splendid. The bone marrow was extremely tasty and the sides were the perfect addition to the meal. The sides were definitely not your standard vegetables that would come along side a steak, there was a lot of creativity put into them.  To start our group of six shared the charcuterie board and the crispy pork belly, which was definitely for a little taste with our cocktails.  My wife had the steak tartar, which was one of the better tartars I have had and it was quite a plentiful amount for the \"taste\" portion of the menu. Even after all that food I stuffed my belly with, I saw that there was a butter tart for desert and I LOVE butter tarts and had to order it.  Our table also ordered another butter tart and a chocolate mouse with salted caramel, which was also apparently amazing, but I ensured that the butter tart was just between me and my wife, but mainly me.  It was topped with ice cream, which was different, but it was runny and sweet and one of the best butter tarts I have had in this city.  It was a perfect end to a great meal.  I would definitely recommend going here and I would come back again.  The only small annoying thing is that it is a shame that they charge for bread when you are spending over $120 per person."}
{"text":"Good dishes, nice atmosphere, not so crazy about the chairs.  We were seated in front, a little uncomfortable."}
{"text":"If you're someone with any aversion to meat, then just stop reading now. No seriously, because this post is just going to be a graphic description of meat consumption. In fact, my experience at Bestellen consisted of a family-style sucking pig dinner. 

Bestellen, is probably one of the few places I know in Toronto where an entire suckling pig can be ordered, so it was definitely an experience. 

The meal began with multiple courses of appetizers and side dishes (of which the Arancini and the Lentils were most memorable. Yeah, I know. LENTILS. Trust though, it was dripping with delicious fat.). 

Not too long after, the waiter brings out the entire suckling pig, and allows us to marvel at it's beauty before bringing it back and hacking it up into manageable pieces. The waitress thought it was necessary to name our pig to give it some character as she presented the whole roasted suckling pig at our table. Might've been the name and the cute face, but I really felt bad for it's consumption!

But that guilt quickly went away after it was dissected and the aromatic steam coming out of it made my stomach grumble. The meat is succulent and tender, exactly the way it should've been. The only one disappointment was the skin, which was rather tough. And if you were wondering, yes we did eat everything,...including the brains. Tasted like foie gras!

NOTE: Make sure you give 72 hours notice if you want to try out  Bestellen's Suckling Pig Dinner!"}
{"text":"My husband and I went here for brunch over Easter weekend.  It was pretty empty, which was nice.  The music was old-school hip hop which my husband absolutely loved.  The atmosphere was laid-back and calm.

I had the breakfast benny and my husband had the full english breakfast.  The benny was to die for!  It was rich and flavourful and the ketchup was also divine!  It had a nice, tangy kick to it.  My husband said his dish was good, but just okay compared to mine.  We passed on the donuts because we were both way too full to even think of sweets, wish he had gotten them anyways since the reviews are so great.  Next time, for sure!"}
{"text":"We visited this restaurant on a Sunday during summerlicious. Jaret, server/manager anf hostess were very attentive. 
The food was amazing. We had two different appetizers  (calamari and baby romaine) and both were delicious. The main was perfectly cooked and seasoned, and the blue cheese butter added the perfect balance of flavor. We ended our meal with a ginger peach cake that was delicious but too rich in flavor for summer. We will return to try something new."}
{"text":"Being a Foodnetwork junky I watched Top Chef Canada when it came out, so took an interest in Rob Rossi opened up a place.
 
I finally made it there on Saturday - the food was all about the meat, here's what we had:
Beef tartare - simple and delicious, topped with a couple of anchovies and quail's egg, rimmed with an intense garlic aioli
Charcuterie board - a lot of it cured in house, served with a killer grainy mustard that was also made in house
Duck breast - with a cherry sauce, cooked to a perfect medium - medium rare
Butcher's cut special pork chop -  I can't remember the name, but the description makes me think it's the \"kobe\" of pork; served on the richest, creamiest grits I've ever tasted
 
Service was on point, my dinner date described our server (Dillon) as the perfect amount of in your face/banter, food and bevvy knowledge. The restaurant itself was open, every table had a view of the open kitchen, and the man himself was cooking with four others (this was another key point for me, if I go to a restaurant for a specific chef I want to see him cooking my food). Music was lots of 70's early 80's rock - CCR, Cream, Police, etc. Also, bonus points for a very hot tatted up hostess.
 
I'll be back at least two more times to try their cote de boeuf, and in force for the family style suckling pig."}
{"text":"I had one of the more ridiculous service-related experiences at Bestellen last night. The server improperly communicated the market price for the Cote de Boeuf, which we discovered when we got the bill. The manager refused to correct the error, and insisted that as long as we had a good experience with the food that's all that matters. I don't think so, Mr. Manager - service and experience is 2/3 of the battle in the restaurant industry, especially when a bill is $350+.

The customer may not always be right, but I cannot endorse a restaurant that treats the customer with such disregard. Classless staff and the food isn't close to good enough to warrant that kind of treatment. 

If you want a great Cote de Boeuf experience, go to Cote de Boeuf on Ossington. They treat you with respect, the food is superior and the experience is top notch."}
{"text":"Ah!mazing!  A little pricey, but perfect for a hot date or special occasion. The food is absolutely to die for, and the staff is helpful, friendly and efficient. Strongly recommend."}
{"text":"The service was great, the food was clean and nice, and a buck a shuck between 6-7. 

Enough said."}
{"text":"3 words:  tartar, pork belly, welsh rarebit.  With 1/2 priced wines on Sunday id suggest the nebbiolo unless you want to drop 85 on the regular.

Amazing place, even have suckling pig for parties of 6 or more (says 8 on the menu though)"}
{"text":"looked at this place for months before arriving in Toronto.  it was our friends 50th b day  so what to say  OMG WOW what an amazing evening  first off barrel aged negroni is by far the best we have ever had (and we have had many over 3 continents) We started with pig ears  oysters oxtail and buratta  really great   was going to order more however our waiter wisely advised us not to as we were ordering the cote du beuf (thank god we listened to him)  For dinner we had the best piece of meat i have tasted in such along time  better than any wagau i have eaten.  perfectly seasoned great sides  oz for oz one of the best pieces of beef i have had in a really long time.  the evening went amazing waiter opened our minds an pallet to interesting beverages an give the birth boy a going away gift  this place hits all the notes perfectly  (taste selection service and experience)  if you are a carnivore then this is the place for you.  No pretenses just great food done by great people for friends (as the make u feel like a friend more than a customer)  nothing else to say or can be said"}
{"text":"The food and drinks at Bestellen are delicious and amazing (we had shishito peppers, crispy pigs ears, oxtail croquettes, gnocchi, steak and maple squash) but the service is not and unfortunately it ruined the experience. Our server left us feeling abandoned most of the night. It started with it taking 10 minutes to order our first drinks and appetizers. It took us another 10 minutes to get our order for mains in (as we had to wait for him to return again to hear the cuts of meats available that night). When we ordered the mains he asked if we wanted any starters, which we had already ordered. It then took 25 minutes before our appetizers arrived (he probably hadn't entered it the first time) and then we had another really long wait between appetizers and mains. We also sat with empty drinks for about 20 minutes during which time we would have loved to order more. Maybe our server was new and inexperienced but if that was the case someone should have been helping him keep up with his tables."}
{"text":"This place is gorgeous. It's so nice to be in a restaurant in Toronto this isn't over crowded. The design is perfect. 

I would go back here for cocktails anytime. My bourbon sour was exquisite. I also thought the wine list was well done. Nicely split up into sections by price and some good choices in there too. 

Sadly we were disappointed with the cut of beef we were served.

Would not rush back to Bestellen for dinner."}
{"text":"They offered chef specials they had ran out of at 830 pm on a Saturday almost empty restaurant. Took 40 minutes for main dish. Completely unapologetic even blaming us for it. For money you spend find a place with better service.  It's not a coincidence the place was empty. The food was mediocre at best."}
{"text":"I was at BestEllen on a Saturday night, 7pm, reservations for 12.
18% automatic gratuity, no issue, the server was upfront about it, and wanted to make sure we didn't double tip. Thanks.
Service: Amazing. Everyone, and I mean everyone, FOH, bar, wait, bus, and kitchen was friendly, and helpful.
Noisy? Yes. Super loud, No. There are other places in Toronto that are much worse.
Be sure to try: The Burger (really good, but a bit too salty for me). The House made chips, and the Oysters.
Booze: Great selection of everything.
The place was clean, the food hot, fresh and tasty. Water was refilled consistently, and plates cleared promptly.
Don't go here if you're looking for value. But items are priced right."}
{"text":"Food was tasty.  It took awhile but that let us have some good conversation. It's a bit loud to go with older parents."}
{"text":"I'm a huge Top Chef fan. I love the US edition as well as the Canadian addition. 
When Dale beat out Rob last year in the Canadian edition, I wasn't super happy, I thought Rob's cooking was much more consistent and much more my taste (ie. What I like to eat).

When Bestellen was announced, I was excited to finally be able to taste his food.
Went on a Sunday night, typically a slower night in restaurants in the city (even newer ones like Bestellen with a lot of buzz). Called for a reservation a week out, looking for a 7:30 or 8pm seating. I was told all they had was 6:30pm, which we took. 

Arrived at 6:30pm to an almost empty restaurant (maybe 35% of the seats full). The restaurant stayed that way for our entire meal, which lasted until 8:30pm. Why we couldn't be seated at 7:30pm or 8pm remains a mystery.

Drinks: Pimm's Cups ($12) all around. Very good, super boozy. 

Appetizers: We were all pretty hungry. Appetizers ordered included: Caramel  
Popcorn ($5), Steak Tartare ($13), Scotch Egg ($6), Micro-green salad ($10) and Salt Cod Cakes ($10). Caramel Popcorn is tasty, though a tiny portion. Steak Tar-tare was a huge disappointment; totally under seasoned (no salt) the meat was tasteless, the scotch quail egg was an interesting touch, but the egg was overdone with very little yolk (which is my favourite part of steak tartare). The Scotch Egg was the clear favourite at the table, cooked perfectly, wrapped in ham and battered . My only issue with it was that it could have been warmer, it was a bit on the cold side. The salad was good, tiny but super fresh and well dressed.

Mains: Everyone told us to order steaks. We did not, mostly due to the price (starting at $38). I had the Orata ($24) as did one of others in our party.  It was a perfect dish, the fish was light, skin crisp and sides were delicious. Was a pretty small portion.  The other two in our group had the Burger ($18) and the pasta ($18). The burger, like the steak tartare was ruined by the fact that it was not seasoned. It was cooked perfectly medium rare, yet tasted like nothing. Toppings didn't really add to it. Disappointing. The pasta was good, spicy sausage. 

Dessert: Ordered two Pots De Crème to share. Amazing. Dark chocolate crème with Crunchy-like honeycomb on top. Good that we only ordered two, they were super rich.

Overall: Great décor, good service. Food, was very inconsistent. Would I go back? No, probably not. 

Actual Yelp Rating: 2.5 Stars"}
{"text":"Great restaurant! Came here on a Thursday and had an awesome meal."}
{"text":"CHECK YOUR BILL AND BEWARE OF WHAT YOU ORDER TO DRINK!! 

The food was good, and the hostess and our waitress were very friendly, however I will never eat at Bestellen ever again. 

My husband ordered a vodka & orange juice, and when our bill came, we saw they had charged us a ridiculous $16 for one vodka & orange juice. When we spoke to our waitress about the charge she said it was a specialty cocktail which is why it was so expensive. We found this answer to be unacceptable (since when is vodka plus a mixer considered a specialty cocktail?!) so we asked to speak to the manager. 

When he came to speak with us, he already had an attitude and seemed ready to argue with us. He was extremely unprofessional and combative. Eventually he reduced the cost of the drink to $10, and essentially threw the new bill at us, and said \"Here! Never come back here again\". I was completely shocked that someone in the service industry would think that was an appropriate way to speak to a customer. 

They are not transparent about the cost of drinks, and will gouge you if given the opportunity. Other people we have spoken to about this have experienced the same. I will never be returning to Bestellen."}
{"text":"A vegetarians worst nightmare but oh so fantastic. The Cote de boef with narrow was absolutely amazing, possibly one of the best cooked and tasting pieces of beef I've ever had. Charcuterie was very good, oysters were great, roasted beets were potentially the best I've eaten, steak tartar was very tasty, service was top of notch."}
{"text":"I had the oysters here and it gave me food poisoning. The oysters were milky opaque and smelled bad. In hindsight, I should have stopped eating them instead of trying one more and one more to determine if they are actually that bad, because they were that bad."}
{"text":"We went there for summerlicious. The place was just OK. The service is extremely slow. The food was alright - I took the grilled squid for starters (underwhelming!) , steak for entrée (the steak itself was good... Bit salty but I liked it. The mint sauce underneath it ... Was like \"Why would you do that to the steak!?\" ..)  for the dessert I took the lemon pistachio cake. It was good! 

Tip - try the Cornish hen from the summerlicious menu. It was really flavourful.  

P.S. Liked the server who took care of us though. He was friendly."}
{"text":"Came here a few weeks ago after spotting it around the corner from my place. Best decision ever - me and my boyfriend came here with no reservations and we sat at a cute long shared, kinda picnic table with barstools feel to it. We were sharing a table yet had more space then some other restaurants who cram 8 2-seater tables within a 10 foot space.

I had great service, great wine and a fantastic meat cut of the day. My boyfriend had a lifechanging burger. Also a great small portion charcuterie plate. I literally had no complaints."}
{"text":"Every aspect of Best Ellen last night was Eggcellent !

Service was great- I had a million and one questions for the server and he patiently/happily answered all of them. 

When we stayed longer than 2 hours and the next party came to claim our table, our server moved us to another table but have us 3 desserts on the house for the inconvenience of moving.  They were Divine!!  

The oysters, steak tartar, rabbit pasta and flank steak were all incredibly delicious. 


The drinks were eclectic and scrumptious as well. 

I am definitely going back to try the burger."}
{"text":"Trekked out to College west to check out Bestellen on a Wednesday night. Glad to see the area is growing and Barraida has company. The space was great, cool design and a super casual feel. Love the look and function of the meat locker in the dining room, lucky kitchen! 
The menu was relatively simple, and very pricey. The $1 oysters were a nice option. We opted for two of the specials, the lamb and the bavette steak. Although a small serving, the tenderness and flavour of the bavette was a 10 out of 10. The lamb, an interesting flavour profile, unfortunately wasn't our thing. 
Overall I couldn't get past the shock of the sticker price of the food - $37 for mains (precious in size) was too rich for my blood, and felt more like fine dining restaurant pricing with pub like feel. I left hungry. 
I will however give it another try, possibly in a group setting for the porterhouse dinner or roast pig. 
it's hard to justify spending that much when competition is so fierce in this city for great food."}
{"text":"Fantastic meal, great design, excellent service. Even though the Yelp description says its not good for kids, our six and half year old had in his words \"the best pasta dish he has ever eaten\". Its a great place to eat with larger groups as well."}
{"text":"Top Chef finalist's Rob Rossi and co-owner Ryan Sarfred have opened Bestellen (which means 'to order' in German) the College and Dovercourt strip.  The space, a former IGA grocery store, has been transformed completely with reclaimed wood and exposed brick to give it an intimate rustic feel and a glass encased meat locker for patrons to gawk at all the cuts. Towards the darker dining area, there is a wall dedicated to meat with different cuts and whole suckling pig painted on it.  At the back is an open kitchen so you can watch all the food porn you would like being prepped and cooked for you.
Ryan, who manages the front of house, brings us over their house made charcuterie board to enjoy over our cocktails.   All the cured meats are their labour of love and they all have different flavour profiles which is great.  On the board were salumi, sausages, terrine, thin slices of lard, and pickled vegetables.  We especially enjoyed the terrine with pistachio as it gave a good crunch and texture and I loved the lardo for the 'melt in your mouth' richness factor.  
We move to our table in the busy and noisy dining room.  We find it harder to have an intimate conversation here as it's hard to hear each other For our main, we decide to go for it and order the piece de resistance - their $105 serving of a 32 oz cote de boeuf with bone marrow with an order the duck fat fingerling potatoes. We are already a bit stuffed from the board but our main arrives and is well presented. We asked for the chef's recommendation on how we would like the meat cooked - this was my friend's suggestion as I would prefer all meat cooked as rare as possible.  The boeuf came mostly medium rare with some pieces on the medium side.  I found it tough to tell as the dining room is very dark so it's difficult to see what you are eating on your plate and was disappointed with it as there was a lot of fat in the boeuf as well. I know the fat is there for marbling and more flavour but it was extremely fatty.  The bone marrow was more gristly and greasy than I had expected and add the duck fat fingerling potatoes and you have a very decadent meal.   We thought this dish was sub par for the value of it but we realize that this is their first month of opening so they are just working out the kinks. 
Anyway I hope to come back and try a few more items in the next months as they do have a great wine list and it has all the right ingredients to be the next 'hot spot'."}
{"text":"The food was great. We had the cote-de-boeuf, medium rare. Perfectly cooked, juicy, very tasty. Perfect for two people with a big appetite, or 3 if you're not so hungry. Took the broccoli and brussel sprouts as side, less than perfect, the broccoli were overly cheesy and you could not really idenfiy any discerning taste to both plates. 

The service was good. The server seemed somewhat upset at first but warmed up through the evening and ended up being pretty nice.

The only downside is that, probably because of the tiled/stone floor and brick walls, this place becomes loud pretty fast. 

Overall bill was around 175$ with tip (18%) for: Cote-de-boeuf + 2 sides; olives appetizer; wine around 45$, 2 coffees. 

I would recommend for: outings with friends, date with somebody you know well (because of the sound level)."}
{"text":"I'm never coming back to this place !!!!

Let me tell you why...

Turns out that we really wanted to go and check out this place, and for secret reasons we were running late and needed to have a late dinner, well, their website clearly reads: \"Hours: 6 pm - Late\", so it was perfect, right ? unless we don't understand what late means...  now hear this, we even call this clowns before going there, just to check if they were going to be open, and we specifically axed ... at what time are you guys closing the kitchen tonight? we are thinking about late dinner and we want to head over there... and so the deception begins, they told us they were not closing the kitchen until 11 PM (take note) 11 PM !!! OK, perfect!

We take a taxi to go aaaaaall the waaay there,  and so we show up at about 10:20 PM, all looking like idiots.... guess what???? Kitchen was closed !!!!!  why would you do this to me ???? I'm here on business !!!!!!!!

So we were just standing there, feeling like dog feces and talking to the hostess, explaining to her that we were on the phone earlier (like half an hour earlier) with her, and she told us that the kitchen was going to be open... and her response was a simple \"well, they changed their minds\"  !!!!! ????  : |       excuse me???? they changed their minds ?????  dafuuuuuuuuqqqqq ?????  oh ok.... 

So, never trust this clowns.... for all we know it may not be open today (even though it is supposed / advertised to be) , or they might could close early, how about closing today at 7 PM??? sure, why not! or maybe it's going to be 10 PM .... you never know.... because  THEY CHANGE THEIR MINDS frequently..... 

What a joke!!!! I declare this place a big pile of feculence !!!   in other words:  this place is NOT ALLOWED !!!"}
{"text":"Friday night, dinner for two.  Bestellen, College and Dovercourt. 

Atmosphere
- Surprisingly slow for a Friday night.  Bestellen is quite a big restaurant, but there were only maybe 5 tables occupied.  Decor is top notch.  Overall, a good, relaxed vibe lacking in intensity.

Service 
We were well attended to all night.  Server was earnest and appeared knowledgable, and was not in our face too much.  Recommended a very good wine.  But forgot to ask how I wanted my steak cooked (although admittedly I should have remembered to tell him).  Met the standard but didn't exceed it. 

Food & Drink 
Ordered:
 - 2 glasses Cava as we sat down - showed up immediately in the proper stemware ($10 each)
-  2 barrel-aged Negroni's - by any measure an excellent cocktail. ($14 each)
-  Charcuterie board - 3 types of meat, some toasted bread, grainy mustard and some pickles ($13) - This was just ok.   Amidst the recent trendy wave of charcuterie (think Black Hoof), this board failed to deliver any strong flavours, raised eyebrows or any wow factor.  
- NO BREAD - The best thing about the above charcuterie board was that I was just happy to get some bread.  In a restaurant at this particular price point, as soon as I order my food I should be presented with homemade bread and interesting butters.  Nary a morsel of bread to be found.  
- Scallop with corn and smoked bacon - this was actually spectacular. One of those moments where you take a bite of food and for an instant, the world is perfect.  
- Bottle of 2007 Calabria Murto - a great wine recommendation for beef.  $65. 
- 16oz striploin (cooked medium rare after the server came back and asked).   I believe Bestellen is holding itself out as a steakhouse, or at least a restaurant that is a serious contender in beef.  Therefore, the steak should be sacred, treasured, carefully selected and the chef should agonize over the product.  The server didn't explain anything about the beef (it's origin, grazing, etc) so I can't provide details on that.  Overall it felt like this strip only took me halfway home.   It was a thick cut (I'm thinking slightly less than 16oz but who's breaking out the scale).    Sufficiently rested and seared. My main issue with the beef was that half of it had a ribbon of elastin (i.e. gristle) going through it, which was about as enjoyable as trying to chew and swallow my cloth napkin.   A good steak chef will be able to spot that issue and make adjustments to the cut.  The bites that were edible were tender and the sear offered a good boost of flavour, but the beef itself seemed to lack any interesting character.  It was definitely decent beef, but I didn't walk away feeling like I eaten something special. 
- After sharing the above dishes there was some room for dessert so we shared an \"upside down peach cake\" which was an interesting, rich little summer dessert served with fresh cream. Would have been better if it was served a little warm with the sugars a little stickier, but I really enjoyed the plate.

Overall Value for Money - 4/5 (being generous, as I want to encourage places like this and I want to see them continue to improve).
Final bill, including tip was $250.   Granted, we went heavy on the drinks, so I suppose its fair enough.  But for this price point, Bestellen lacked some of the special little surprises that leave you impressed and wanting to brag to your friends. I'll likely go back some time, but it likely won't be the place that I insist my friends go for steak.  I think there's enough potential here to make this place truly great."}
{"text":"Was here for a private function and the food is outstanding.   Staff is phenomenal and the steaks are incredible.  Was able to sample the pastry chefs brownies that would make your mom's brownies taste like store bought.  Child friendly on their less busy days.  Wish I could give then more than 5 stars."}
{"text":"This place gave me food poisoning.  I believe it was from the oysters. My wife and I went and both of us had food poisoning the next morning.  Service was just ok.  Waited a long time for our drinks.  Not worth the price."}
{"text":"Decor is nice, dimly lit, romantic. Music is a bit loud. The meat locker is a nice thing to see passing through to the back room and open kitchen. 

Right, decor and atmosphere aside, lets get down to the point - the food!

Started off with a nice pint of the Krombacher Wheat beer - nice, crisp, citrusy, brought out promptly by the server.

First course was the steak tartare - very good. Caper berries and house made aioli round this dish out with some beautiful, briney, peppery and creamy flavours and textures. They don't overpower the flavour of the fresh beef that spread across the palate. A good size portion, easily enough for two to savour together. 

Next course was the burger - straightforward, simplistic, flavourful, with good texture and cooked to a perfect medium rare. If you like toppings and lots of stuff on your burger, this is not for you. If you want to taste good quality beef, some nice melted cheese and a bit of greens for colour but not so much flavour, this is a great burger. 

The french fries that accompanied the burger, however, were horrid. Over-cooked to the point where I could not put my fork through one without the fry breaking in half. Poor execution for such a simple side that should be banged-out effortlessly.

My table ordered some other items such as the Côte de Boeuf. It is a beautiful thing to behold in size and presentation. Flavours were nice. The steak is under-seasoned. However, my guess is that you are meant to spread some of the marrow that it comes with. This is just a GUESS because we never got any instructions or explanations from the server. At this point in the evening she gave up and rarely offered any quality assistance or service - shame shame.

I also tried some of my friends Tuna dish. The tuna was heavily smoked, too much smoke flavour for such a delicate piece of fish that absorbs all flavours like a sponge.

Oysters were just OK, fresh and average.

The star of this restaurant is the Squash dish. I would come back just for the squash - there are better steaks and burgers to be had in the city."}
{"text":"Came here very recently for a friend's birthday. Coming in, the place looks very nice and upscale, with a meat locker in full view. The decor is nice, fancy without being pretentious. The service was great - attentive and personable. The food, however, was good but not great, and definitely not worth the price. We got the charcuterie board to start, and then the 32 ounce dry-aged steak (medium rare). The charcuterie board was very nicely laid out, but the taste was underwhelming. The bread that came with it did not really complement the meats. The steak was ordered medium-rare, but came out more rare. I am not sure if they dry-aged it to the proper timing, because I didn't taste any of the delicate and unique flavors associated with dry-aging a steak.

Overall, acceptable but would not return."}
{"text":"Extremely impressed with my dinner. The lamb tartar was amazing, better than any steak tartar I've ever had. The 32oz Cote de Boeuf with bone marrow is a must try if you enjoy meat."}
{"text":"I was (thankfully!) invited to preview Bestellen at the soft opening last weekend. I have been looking forward to checking it out since chef Rob Rossi told us that he was leaving Mercatto. 

Bestellen (which means \"to order\" in German) Is the new venture of Top Chef Canada finalist Rob Rossi and his parter Ryan Sarfeld. They are both young but have some decent experience and apparently quite the eye for design. The space looks gorgeous. Rustic reclaimed wood, a \"peek-into\" meat locker, chalkboard walls and an impressive mural comprised of meat bits along the wall of the dining room. Part apocathacary, part lumberjack shack and at the same time very modern, the decor is thoughtful and was well received by my party. A large harvest table (seats 12) sits adjacent to the open kitchen along the back of the space. 

My friends and I rolled in at just before 9 and had a seat at the bar. Being a soft opening we had a choice of 2 beer and 3 wine, or two cocktails. I chose the house red and it was a good choice. Once seated, we perused the menu (a condensed version for the occasion) and basically ordered one of everything. 

Charcuterie was fantastic. Really Really good and a steal at $13. We will definitely be ordering this regularly. For starters, the other stand out was the fried cheese curds with smoked ketchup, that were so great we ordered a second round. Caramel popcorn was decent but more of a bar snack. 

Also ordered by the party were the burger and fries which came cooked medium on a fresh baked brioche. A little under seasoned, but really good none-the-less. Benefited heavily by the smoked ketchup we had sent from the kitchen. The brussel sprouts and duck fat potatoes were tasty sides. For the non-meat eaters, there was a delicious pasta dish and (on special that eve) a trout which was perfectly cooked. 

Even though we are all completely stuffed, we tucked into two bread puddings baked in mini mason jars for dessert. Bottles of wine ran us $45 a piece. 

Service was exceptionally good. Prices were extremely reasonable. The one $40 main (an aged steak), we were assured, was large enough to feed two people. The others were all in the $18-25 range. We ate and drank like complete fools (wanted to try everything!)  with several bottles of wine, beers and cocktails and the bill was about $150 a couple. 

This is just the beginning for Bestellen which is amazing. If mediocre \"hot spots\" like Enoteca Sociale can be completely full every night I can not even imagine how popular Bestellen will be. I am really excited to see how this goes. 

This place reminds me very much of  my favourite restaurant in Montreal La Salle À Manger and that is a very good thing. 

Highly Recommended."}
{"text":"I'm writing this review because I'm still a little ticked off by my dining experience at Bestellen. We had a NYE reservation for the 10pm seating. We arrived on time and were quickly shown to our table, then we waited and waited. After 10 minutes someone finally noticed us and proceeded to take our water order - $2.50 for sparkling and another $2.50 for tap. Seriously, you're gonna milk us for tap water? Anyways, 15 minutes after we had been seated our waiter makes an appearance and attempts to engage in conversation. Usually I'd be game but Bestellen is damn loud and I could barely hear his attempts to make chit chat. He took our cocktail order and the waiting game began again... It took two hours to receive two courses. The bison carpaccio we were served was tasteless and the scallops that arrived after were seared on only one side... I had tacked on the optional wine pairing and none of my wines arrived on time. I had to grab someone to request the wine that was supposed to come with the steak main. The table beside us called over Rob Rossi (the owner) to express their disappointment with the service times. The situation escalated and got pretty argumentative - i was torn between appreciating the cheap drama and being annoyed by Rob's attitude. After all was said and done they even screwed up the bill and tried to stick us with a $85 bottle of wine. They corrected their error and I tipped the obligatory 15%. Mr Rossi, your FOH and bar seemed understaffed and your kitchen was in the weeds. Maybe think about closing on high volume days if you can't handle the traffic. It's better than offering a room full of people a disappointing dining experience."}
{"text":"Excellent cote de boeuf! And the range of bourbon's is intense. Came here with clients and we definitely worked through a bunch of them. 

Easy to get a table and the ambience was good for talking."}
{"text":"Came here as a double date after a Jay's game. Our good friend had made a reservation as he knew we loved our meat. We were greeted and sat right away by the window which was nice. I have to start by saying our service all night was exceptional, our waiter explained everything on the menu to us, our drinks were never empty  and our server was extremely attentive. We started off with the charcuterie board, it was really nice, a good selection of meat and some killer mustard. We decided to share some apps, the burrata with asparagus and ramp pesto, the grilled octopus and the crispy pigs ears. The ears weren't my deal but the burrata was killer, so creamy and the pesto was delishhhh. Now for the main event...the bestellen burger.... I have dreams about this burger. Dear lawd it is killllerrrrr. One of the best burger I've ever had in my life, yup I said it and it's true. The sharp raclette cheese, the sweet caramelized onions on a freshly made (like 3 hours earlier according to the server) brioche bun. I can't even tell you what my husband or friends had because I was too busy eating. If you go to bestellen get the burger. We finished off with the panna cotta and something with chocolate. They both rocked. On the way out we were lucky enough to run into owner rob rossi (although I didn't know he was a famous food network star!). He was very nice and ensured we had a great time. 
Overall great meal! Price could be an issue for some but for a special occasion bestellen measures up."}
{"text":"I, like most, enjoy a great burger but this is by far the best burger I have ever had! It was tempting to try a few other options on the menu but after hearing about the burger I am happy we went with it . Highly recommend!"}
{"text":"4.5 / 5 
Congratulations Bestellen, you have become one of my top two meals of 2014. This place is a carnivores delight. If you like beef and pork, do yourself a favor and make a reservation. My favorite dish was the crispy pork belly, unlike anything I have had previously. The cotè de boeuf with bone marrow was excellent and prepared a perfect medium rare, as requested. Don't forget to try the deviled egg, incredible. This is a great group, date, buddies, or pass by, dinner spot."}
{"text":"Ate a dog's breakfast at this restaurant. Literally -- my meal was comprised of various parts of various animals. That being said, if this is what a dog's breakfast is like, I would happily go into a canine training program. 

The sous vide cote de boeuf was an absolute pleasure. I would recommend it to meat eaters without hesitation, and possibly even to vegetable eaters. Cooked sous vide, then seared to make a seasoned crust on the outside, served with two bones of marrow and two side dishes. Sides of cabbage and sausage, and fregola pasta were good, but compared to a lovely piece of dry aged, medium rare beef, they were just accompaniments. 

The pig's ear salad to start was good, not excellent, but the house-made charcuterie was a hit. Salty, fatty, melt-in-your-mouth, spicy, sour, rich, all served with no-knead bread. I could have piled every combination onto the toasted bread for the whole evening. 

Two desserts on offer. An ice cream sandwich and a chocolate budino. Ice cream in the ice cream sandwich was creamy, lovely, flavourful, but the cookie was just okay. Budino had a very deep flavour, and was set off perfectly with salted caramel. 

Hospitable and attentive service, neat meat locker at the front, and a warm, meat-centric atmosphere. Return visit ahead."}
{"text":"I've passed by this College West store-front too many times to count and never even knew it was there. Thankfully, a few guys picked this place for a bite and a few pre (and post) cocktails. 

As the menu suggests, it is a very meat -friendly environment. Pass on by if you're of the tofu society ..

I'll be perfectly honest, we ordered a few plates to share which were all good, it's just the fogginess of my order eludes me at this very moment. I do recall the terrine board & charcuterie was delicious, the steak tartare although good to standards, just not my fortay. 

Four guys split two 32oz cote de boeuf w/ bone marrow, a couple sides of rapini and potatoes. 

Incredible. Seriously. 

All gents were generously full after the meals, the bottle of red and a few pre-pints no doubt helped. 

I'd definitely recommend this meat house and give it two thumbs up. Nice atmosphere, great staff, and the food's worth every penny."}
{"text":"Had an amazing experience here.

The food we ordered (squid, tartare, burger, and tagliatelle) were all amazing, extremely fresh tasting and not overly heavy. 

The service was attentive and friendly. It is a very inviting place to bring a date.

Have to say it is by far my favourite burger in Toronto. Until next time."}
{"text":"Stopped by the soft-opening for Bestellen this weekend and was pretty excited. I've been waiting for months for the place to open, Rob Rossi's one of the hottest chefs in town, and the premise of the menu sounded very appealing.

The dining area is very spacious, no part of it feeling crowded (which is tough in most places in the city), with a large meat locker across from the bar where you can watch your meat age (if you've got a few weeks, I guess). Pretty cool. Open concept kitchen at the very back of the restaurant and that adds to the liveliness of the place.

The menu is pretty simple and straightforward (starts with about half a dozen side dishes... the most attractive looking like the fried cheese curds with gravy and the Brussel-sprouts with pork belly for 6$).

Next was on the menu was the sharing section which was a charcuterie board of all pork (terrine with pistachio, some cured cuts, three pieces of toasted bread, mustard, coppa, and a small bowl of pickled vegetables) for 13$. I believe on the menu it listed as coming with chorizo as well, but I didn't see it on our board. 

It was a good starter to share and cover us while we were picking our mains, but nothing jumped out as especially unbelievably delicious.  

I opted for the burger and fries, as several people polled said that those who had eaten it claimed it to be one of the best, and a side of the brusels sprouts. I would say there were maybe 5 or 6 brussels sprouts total...so it was a little bit of sad looking side plate/expensive- they were delicious though. 


The burger was served on a brioche (which is made in house and perfect), with some cheese, and caramelized onions (also perfect). The burger was made medium-rare. What I liked about it was that you could actually taste the freshness of the beef...not something you can really notice in most burger bites. I had eaten at Burger's Priest earlier in the afternoon, so maybe I was spoiled...but this one didn't really do it for me in terms of flavor...a little plain.

The fries were disappointing and only served tepid (and when I mentioned this to the server, he said \"haha, oh that's how we serve them...it's the new cool thing\" - Not exactly the response I was hoping for on opening night or ever).

My DC went for the ricotta nudi (similar to a very soft gnocchi) and was reminiscent of really good mashed potatoes. They were very tasty.

Beau's Lug Tread is on tap, so that's pretty good. 

I think that this place could get pretty good - still hasn't FULLY opened, so this review should be taken with a grain of salt...but overall it seemed awfully pricey for an only OK overall experience. 

Excited to see how they develop over the next few months."}
{"text":"Had dinner at Bestellen on May 24, 2013 with my wife.  

The food was excellent!  

We had the menu item called \"The roof\".  Aged steak on the bone with two sides.  It's carved for you and wonderfully presented, even with the marrow.  

For dessert, we had chocolate pudding with meringue and whip cream.  That too was excellent!

The decor was great!  Very nice design.

I am a whiskey/bourbon guy... they have an excellent selection.

Will definitely go back."}
{"text":"Amazing service and staff. Friendly environment. Great food and delicious desserts. Definitely a good place for a date or group of friends or family."}
{"text":"Having nom'ed my way through Toronto, Bestellen is my favourite restaurant in a city if great ones.

Food? Off the charts. The famous cote de boeuf, the burger - phenomenal.

Service? Brilliant. Friendly, welcoming, funny, engaging. 

The vibe? It's a hip place without the hipster dip$hits. It's the best of both worlds.

Highly recommend. For the win."}
{"text":"Came here for Friday dinner. We had the steak tartare (excellent), crispy pork belly (good) and cote de boeuf & roasted bone marrow (the meat was exquisite although I found the marinade to be a little too buttery).  I've heard the burger is also very good, although I didn't try it. The decor is quirky with the butcher shop theme. Overall a very nice place if you like meat, but you should come with several friends if you order the cote (their signature) since it's a lot of food."}
{"text":"Food ***** 
Cote du beef -lovely. Med-rare cooked perfectly and the sides all complimented the show stopping beef. Suited for a group of 4 to share. 

Atmosphere ***** 
Romantic but also relaxing setting for groups of 6-10 (you can talk without shouting), great music, clean bathrooms, amazing murals. Luv how they show off their huge store room of meat where they cure everything on their menu. Seating was nicely spaced so we didn't feel too crowded.

Service *****
No complaints. Food was hot, drinks were chilled and all were prompt. Staff were friendly and knowledgeable.

Came to celebrate my birthday. Was not disappointed."}
{"text":"I went there last night on a date and it was fantastic.  The food was amazing (try the fried olives - so interesting).  The burger was hands down the best burger I've ever had.  I ordered it medium rare as the chef suggested and it was perfectly done, not dripping all over the place, but still a handful.  

The drink menu is very interesting and creative, as is the decorating.  Our server was professional and helpful with suggestions.  I would certainly go back!"}
{"text":"Restaurant: Bestellen
Cuisine: Canadian
Location: Little Italy
Address: 972 College St
Price Range: $15~25

1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 4
Service: 4
Ambiance: 4
Overall: 4

Extra information:

* Open late night
* 18% gratuity on groups of 8 or more
* Famous for their burger

I've been meaning to check out Bestellen for awhile, I really did. But then again I don't even know how many restaurants are on my list, it is that long. So I was glad that bunch of us food bloggers and couple foodies got together and decided to try the Whole Roasted Suckling Pig from Bestellen. They require 72 hours notice and it is prepared for minimum 8 people which costs $59 per person plus tax and 18% gratuity (automatically added on since it's group of 8).

Inside of the restaurant is a little rustic and industrial with raw paintings on the wall and dim lighting.

One of the things to look out for (or you can't miss) is their dry aging room where all the house cured meats and aging steaks are hanging by the window for you to see.

$59 includes all the side dishes that is served family style which is quite fitting when you are sitting around a whole suckling pig.

Before they brought out the pig, we were served Arancini Balls which is basically a deep fried risotto ball with some garlic mayo. It was served hot and cheesy, just what I was craving after a week of tasteless congee! Also, we were served some mixed green salad with pecans, butternut squash and pancetta.

We had a friend that was allergic to pecan, so they made another salad for her without it (do let them know if you have allergies and they will cater to you)

They brought out the pig so that we can admire it and take photos before they took it back to the kitchen where they chopped it all up for us.


It was chopped into a rather large chunks so we still had to use tongs to grab the meat. Thankfully the meat was soft and tender and it easily fell off the bone.
However, it was quite a work trying to hold a large tong trying not to get pig fat everywhere and I got the finger cramps after. Meat was somewhat seasoned on it's own but it was even better with the gravy that was served on the side.

As a side, we were served some stir fried rapini, roasted butternut squash with garlic, lentil salad, brioche bread and gravy. I really enjoyed the stir fried rapini as well as the roasted butternut squash, they complimented the meat balancing out the greasy'ness. Roasted Butternut squash was sweet and creamy with the garlic perfectly cooked, I could just order this on it's own and have it with some bread!

I also really enjoyed the brioche as well, cute presentation and it was so buttery! 
Apparently it's the same bread they use for their famous burger which is sold for $18.

All of the side dishes were done so well that although the suckling pig was obviously the main star of the evening, the side dishes were so amazing on it's own! I could really tell that they put a lot of effort and thought into each side dishes and that really blew me away.

By the end, all 8 of us were stuffed to the max and there was still so much food left! everyone ended up taking leftovers home at the end.

The meal was finished off with individual slices of pecan pie and real whipped cream. 

Summary: It was my first time trying a whole suckling pig and yes, it was an amazing experience.  If you love pork and haven't tried anything like this yet, I say go for it and it is def something you should experience once in your life time.
The food was amazing and the service superb throughout the entire night.
Personally, I was amazed by the whole suckling pig and impressed by their side dishes. This shows that Bestellen does their food right. I can't wait to go back and try their famous burger."}
{"text":"\"Nailed it\" as they say. Bestellen is a gem worth returning to. 

Service: Upon arrival, we were directed toward a table unappealing to us and asked to sit somewhere else. Without hesitation, we were happily granted two seats at the bar. The bartender greeted us with a smile, info about the menu, suggestions and everything else a great bartender should have. 

Drinks: The cocktail list is creative. We commented on this, then were revealed the repertoire of the owner...Cocktail Bar! Aha! No surprise. The cocktails were an A+. Balanced, boozy and bold. We had the New Money and the Southern Dandy. 

Food: We had the straciatella, steak tartare, chorizo and the pork belly. Everything was presented beautifully, seasoned accordingly and tasted great. My top dish was the chorizo, which came with some out of this world fried cornbread. I'll have a plate of just that, please. The ONLY issue with the food was the fact that the pork belly seemed overcooked and a bit too tough. For dessert, we ordered the chocolate budino to go and we killed half of it in the car, saving the rest for later because we weren't ready to say goodbye."}
{"text":"I've only been twice, so not a huge sample size. 
I've also never had the steaks, which is supposed to be their main thing (though ordering from the other parts of the menu can reasonably be expected to bias me AGAINST the restaurant, insofar as I have avoided their key strengths).

The stuff I've had has been stupidly good. The menu is on trend without being trendy. (If that means anything). 

It's meat heavy...you're often tempted by the meat offerings to go all meat. The charcuterie plate, particularly the house-made nduja and the pig's trotter fritter, were terrific. 

Despite the meat heaviness, we had two very reasonably priced veg sides (jerusalem artichokes, and escarole) that were flawless comfort food. 

It's a place where the thrills come from the tightness of the execution, and the subtle, thoughtful bits of creativity that enliven the dishes. 

I've had the scallops twice, and they have both been excellent. 

To have this place as a neighbourhood restaurant is something that would not have even been conceivable in Toronto five years ago. 

Gotta get back for the steaks and the large format dinners. YES!"}
{"text":"Came here for NYE and was pretty underwhelmed with my experience considering I've heard raving reviews about Bestellen.

I made my dinner reservation weeks before New Year's Eve, but the restaurant was pretty empty on the night of. I appreciated the quiet and spacious seating and the speedy service, so no complaints there! 

On the way to our table, we walked by the aging room that had numerous beef on display. So when I had to pick from the list of entrees on the prixe-fix menu, I chose the flat iron steak! 

Now, I am a HUGE steak fan and on all special occasions, I treat myself to some good steak. The flat iron steak I had at Bestellen doesn't even come close to \"average\". The steak was hard to cut into, overcooked and rough to chew. I made mention of this to the server and all she said was \"Oh that's too bad, sorry to hear you didn't like it\". 

This whole time, the \"celebrity\" chef, Rob Rossi kept walking by our table to chat with his friends at the front (he wasn't even cooking), and not once did he make eye contact with us or asked how was everything. It certainly isn't necessary but the personal touch would have shown that he at least cared. I'm pretty sure my displeasure with my steak made it to his ears, and still nothing. 

For the price charged, I expected service and food to match. I wouldn't come back - just not worth my money."}
{"text":"So impressed with the service, they worked as a team.  My wife and I decided to share a bunch of dishes and every few dishes they changed our plates and utensil.  They regular came and filled up our water can really sure make we were well taken care of.  Service is comparable to Michelin star in the US and other then Alo I haven't had better service in Toronto!  Trust me I been to some of the best in the Country! 

My fav was the steak tartar!  A surprising experience!"}
{"text":"Love love this place. It is a bit on the pricey side, so we only usually go when there's a special occasion, but totally worth it! Staff are lovely and the meat is incomparable."}
{"text":"Yummy food, especially the starters! ; )

We got the grilled octopus and the deep fried brioche.  The brioche was especially tasty.

For my main I ordered the Bestellen Burger.  The patty itself was not the best I've had in Toronto but the the brioche that it came in made up for this. It was so buttery and yummy and worked well as burger bread. The brioche is what distinguishes this burger from others in Toronto. 

I also tried the beer braised lamb shank from my sister and the steelhead trout from my uncle.  Both were tasty, but I preferred my burger.

The bottle of wine we got here was something else.  I am regretting so much that I forgot the name of it : (  It had a really nice aroma. 

For dessert we had an assortment of sorbets.  All very delicious and a perfect way to end the evening ; ) !"}
{"text":"It's been a while since I've been out and about. I don't know what that is - maybe the explosion of new restaurants was just too much for these old bones. Whatever the case, I had not ventured outside of my comfort zone (my known knowns) for way too long. Thank god it was Bestellen that broke me out of my funk.

Bestellen is an unimposing front on College Street right beside Black Skirt, which I accidentally walked into at 8:00 believing I was late for my reservation. The owner did not seem surprised to have to send me next door so perhaps my stupidity isn't atypical. 

Inside, however, Bestellen is lively and exciting. A large fridge along one wall displays their various meats, all of which have been finely aged so that beef tastes like BEEF. A large bar looks so fully stocked it's surprising that it can hold all the bottles - an OCD bartender's wet dream. There is no wine menu per se (the waiter arched an eyebrow when we asked for one). As the wines change weekly/monthly they're scrawled upon the long blackboard walls to insert new labels more easily. Our reservation was for 8:00 on a Friday. It was the chilly day of winter and snow was falling, so that could be the reasoning for the low turnout. Regardless there were plenty of seats open, which was a bit of a letdown because we'd hoped to eat a bit earlier but were told that couldn't be accommodated. 

But forget about minor annoyances - you're here for the steak. And what a steak. The \"Best Steak in Toronto\" is a title bandied about with some regularity. Admittedly I don't eat out enough to properly judge. But I can say that they do an excellent job here. Steaks are cooked Sous vide, which is a 70s french style of cooking that brings the meat to a perfect medium rare temperature before it's quickly seared and served. The result is a massive perfectly cooked steak. And yes, we went for the most massive of all. All of the food is great, and the smaller (relative term) plates all looked fantastic. But if you can get three or four people together, go and get their $96 steak. It easily feeds four, has a delicious side of marrow (I recall three bones but it could have been four) and comes with two sides, making it cheaper than three mains with sides on their own (or at least comparable).

We splurged on wine, going for a $60 bottle of red - the selection is split into three prices, $45, 60 and something higher we didn't really look at - $90 probably. This makes the selection much easier and helps you dodge having to choose the second cheapest wine. The wine was fine and the waiter was knowledgable about it. Our second bottle was in the cheaper range and you could taste where the $14 had gone. We may have just chosen a bad bottle, but for those looking up and down the cheapest list, it's worth busting out your LCBO app for helpful hints.

Dessert is prepared by the day, so the two or three options are typically scrawled on the wall above the open kitchen. A chocolate volcano-type dish and gingerbread pudding were both good but nothing to write home about.

All in all an amazing meal. This is not a cheap night out, but if you can get a good double date going you'll find it pretty manageable. The ambience is nice (we had an unfortunate table of hoodied dudes arrive as we were leaving, but aside from that it was nice groups and couples) the service great and the meat is to die for. All in all, and easy Four Stars."}
{"text":"Dinner 

Ambience: 4/5  
Food: 4/5 
Service: 3.5/5 (Friendly)
Value: 3/5 
Repeat: Likley"}
{"text":"I thought Bestellen was going to be a spatzle serving German eatery, or at least that was the rumour prior to opening. It's not -- it's better. 

Part steakhouse, part charcuterier: the oh-so meat-centric decor includes a huge windowed meat locker and the mural on the opposing wall spans most of the dining room to the back where the open kitchen let's you peak at celeb cheff Rob Rossi's team at work.

We started with bacon wrapped dates (Devils of Horseback) and then proceeded to order a number of small plates in an attempt to try as much as possible without committing to a steak dinner. Everything was beyond amazing; the house-made charcuterie was perhaps the best I've sampled since the whole trend started. The steak tartare was served with a fried quail egg and salty olives (good combo) and the ravioli filled with ricotta and runny egg was rich and decadent.

We had a great night. Everything exceeded our expectations: the food, the service, the music we're suberb. They even made me an exceptionally good Amaretto Sour."}
{"text":"Poor communicationna skills, everything said was very out of the textbook \"unfortunately this unfortunately that\" repeating the same words over and over. For the amount of food you get is definitely not worth that much and was ridiculously over hyped. I was told they specialized in meat and was very disappointed with everything. The waitress forgot our menus and barely came to our table to check on us and when she did it was extremely fake and sarcastic. After we had paid the bill we were sitting, talking a bit and drinking the rest of our water, we hadn't even left the table and the lady started wiping the table and setting it up again it was quite disrespectful. Wouldn't recommend."}
{"text":"Went here for diner last week, Ordered the fritto misto, lamb, and strip loin. Surprisingly the fritto misto was better than the lamb. Strip loin was ok. Waiter wasn't that friendly but maybe she was having a bad night...

Food (3.5/5)
Service (3/5)
Price (3/5)
Ambiance (4/5)"}
{"text":"Pros/ Cons : Bestellen

Three word summary:
YUM
Flavour
Energy

I've only been here once for a birthday ( 4girls 4 guys) and it was a great experience.. Primary due to the people I was with and a little because of the staff too.

3.8/5 - Service

Pro: friendly staff. There's one guy that looks very serious but if you talk to him he's actually really laid back. He took our orders with patience and was very informative when we asked about the menu \" combos\" and recommended dishes.

Con: we reserved a table for 8pm but got seated at 8:50pm and didn't start eating until 9:45pm... wasn't too happy about it but at least the staff wasn't rude or dismissive .

4/5 - food/ portion/ flavour / price

Pro: we ordered many dishes to share based on the quantity the wait or recommended. He did a good job because we were all stuffed !! The steak we order came  juicy and very flavorful which I find is rare to find in that combination. We ordered the mushrooms and potatoes as the sides and it was absolutely delicious!!! I STILL remember what those taste like. Everything was leaned towards the \" pricier\" side but recommend you try because I didn't regret it.

*I hear MANY mixed reviews about the steak quality and honestly sad to say but i have a feeling it just depends on the day. 


Con: the steak temperature it came in was \"cool/warm\". Again, teeny bit on the pricey side.

4/5 - Ambiance/ parking 

Pro: loved the setting. Dark and suggestive decor- I dig it. We sat right by the kitchen so we were a separated from the rest of the restaurant which we asked for. We parked 1 block away which wasn't bad because it was prime dinner time. Good energy!

Cons: nothing. I'd say parking is a problem but that's the guests fault for not finding parking along the street or arriving earlier.



Overall it was a great time! 
PS: There is a bar diagonally across the street for $3-4 dollar shots. Recommend you head there for drinks then go to Bestellen for dinner. ;)"}
{"text":"charcuterie board, oysters, scallops as appetizers were very good. My main was a lamb shank. I was a bit dissapointed as the lamb was a bit muttony and fatty. Perhaps, the beef would have been a better choice. 

The ambiance is great, nice decor. 

Waiters were a bit confused about the menu."}
{"text":"Hot damn. This burger. Cooked medium rare, juicy, sweet, buttery. I felt like I died and was granted thirty delicious minutes in burger heaven. 
Price-point on the drink list feels a little steep to me, however I was happy to pay the $19 price-tag for that perfectly cooked, meaty goodness, mmmmmm."}
{"text":"- 2.5 stars
- it's a LARGE space. and also LOUD. almost excessively so.
- charcuterie plate and fried cauliflower app is very very very good
- our waiter seemed a little douchy and couldn't be bothered to smile. really felt like he was constantly reminding our table that they had another reservation after us. that alone knocks a star off.
- wont be back for a while. lot of other places to try to make my list of \"lets check it out again!\""}
{"text":"I had a fantastic experience here for Summerlicious!

Although some people may complain about the timing, i can't help but appreciate that the service was not trying to rush us out, and i got to enjoy my dinner and actually have a full conversation all while fully relaxed and enjoying my drink.

The Cornish Hen was absolutely PERFECT. the outside was crisp and the inside was incredible moist & juicy. I could have not asked for a better main. 

Will definitely be back for a full charcuterie plate - the selection i had for my starter was absolutely delicious. And I've heard people rave about their burger too. Will be back to try them both for sure

:)"}
{"text":"Bestellen knows how to do dinner. 

I went to Bestellen last night for summerlicious, after checking out their menu online. 

First off, the setting. It's in a pretty cool neighbourhood, just on the edge of Dufferin Grove. It's got a welcoming feel with its friendly staff, and the meat-themed artwork lets you know that you're in for a treat. 

The food was delicious, each and every course. We started with the Charcuterie board and grilled squid. Highlight of the charcuterie was definitely the duck prosciutto, although the other meats weren't far behind. The grilled squid is nicely cooked, and the accompanying romesco sauce compliments it perfectly. For entrees, we ordered the Cornish hen and the strip loin. The hen was served with delicious mushrooms and bacon, adding a unique flavour. I wasn't a big fan of the peas, but still a great dish. The striploin was medium rare and served with a salsa verde, and came in a little behind the hen, though it was still a good choice. We made it to dessert and ordered the chocolate budino and lemon pistachio cake, both of which were the perfect end to a delicious meal!

Definitely a restaurant I'd go back to, though I'd try to catch it during summerlicious since the prices are much more reasonable!"}
{"text":"I had been wanting to try this place for a bit, and finally got the chance to try it this past week. 

This place is deceptive...it's actually quite big inside! I had a delicious cocktail while I waited for my friend to arrive (the June Bloom). The service was really friendly and our server was really patient with our million questions.

The only issues I had were that it took a weirdly long time for our steak to come out. But, c'est la vie, it was extremely tasty when it finally arrived at our table. Our server explained that the menu items were mainly meant to be shared, and our 16oz steak was definitely shareable, and was cut to facilitate this!

The other issue was the noise level. Seriously, it is too loud in here. I am not some old curmudgeon, but when I am at dinner at 8pm on a weeknight, I want to talk to the person I am eating with and not have to rely on a combo of lipreading and shouting!

p.s. That said, I am still dying to go back with 7 friends to try the roasted suckling pig."}
{"text":"Pretty dead on a Wednesday night.

Buck a shuck oysters from 6-7 pm every day.  These oysters were aw-ful.  Shucked horribly.  They looked disgusting.  We actually ordered a dozen but only ate 10, and probably should have stopped at 5.  They come with some horseradish, and a bottle of Tabasco, but no other vinaigrettes or accoutrements.  This was so disappointing.

I ordered an aperol spritz.  It came in a HUGE red wine glass.  It was like a lbs of liquid!  I've never seen anything like it.  Awkward.

Burrata cheese dish was great.  Beef tartare with pesto was quite nice.  Charcuterie plate was fine, but didn't have pickles on it like the menu suggested, and the bread it came with was burned to the point it was black.  I mean - if this was a $60 meal I'd be more understanding.  Final bill was $123.  We were left waiting to be able to ask for the bill (tables around us getting served, but servers no longer looking our way, ever) for 40 minutes.

Overall, I was sad, because the reviews are so glowing.  Maybe an \"off\" night."}
{"text":"Fantastic meal here during the Toronto Film Festival. I meant to post a detailed review back then but, well, didn't.  Amazing food, good wine, really nice people, cool vibe. I want to come back."}
{"text":"Terrible way to end 2013.

Went for dinner on NYE and had literally the slowest service I've ever experienced in my entire life (and we're major foodies).

If the restaurant management had been even remotely apologetic I wouldn't be posting this, but since they had an attitude problem on top of the slow service I feel like this is warranted.

2 hours to be served only 1 course of a 5 course meal is outrageous!

They really need to focus on how to manage a poor customer experience.

As an example to the restauranteurs on how to appropriately deal with a mishap :  We had a recent experience at Bannock where the steak served was undercooked - the server noticed this without us even mentioning it.  Not only did the server not charge us for the dish but also brought over a bowl of soup to ensure no one left hungry.  Again, all of this was completely voluntary on their part without even a word from us.  Kudos to them for proactively putting the customer's needs first.

To close - take responsibility of your errors and right your wrongs."}
{"text":"Stopped by for their Wednesday buck-a-shuck oysters and was pleasantly surprised with my experience here. I wasn't sure what to expect after going through the Yelp reviews but I'm happy they didn't deter me from visiting Bestellen.  The service here is phenomenal! The host and our server were on the ball - very friendly, attentive, and answered any questions we had.  

The space is very charming. Front of house is smaller but as you walk past the bar area the space really opens up. 

Initially, we had only wanted to try the oysters but ended up adding a charcuterie board to our meal.  The board comes with their incredible yummy sourdough bread, pâté, different meats that melt in your mouth like butter, and pickled veg. Great portion for sharing or starters - I would definitely recommend.  Oysters were delicious as well, and they were just flowing out of the kitchen. You can also get the sauces on the side for an additional $2, it includes their housemade hot sauce and a garlic vinaigrette. Both sauces compliment each other and the oysters very well. 

So two dozen oysters and a charcuterie board later we're fully sated and very content. I'm excited to return and try the other items on their menu. Great experience from start to finish."}
{"text":"We are on the hunt for the BEST BURGER in Toronto! Stop #7: Bestellen

Bestellen is a European tavern on the west side of the city. It has a bit of a dark and sultry feel, so I'd say a good choice of venue for your next Tinder date. They seem to specialize in high quality beef and pork, fresh to def ingredients, plus they apparently have a roof top garden.

Now I know this is the Burger Hunt, but I came here with a friend who treated me to some fun dishes that deserve recognition. First up we had their oysters served with horseradish. Not much to say here; they were nice. Then came the Pig Ear. They serve these guys as little slivers of (likely) deep fried goodness. The crispiness and salty temptation of these made me understand how easily I could become obese. Next up came the Burrata, which is generally a mozzarella outer shell filled with cream. It was served with candy cane beets, blood orange, and a green of some sort. The cheese was surprisingly light, and the sweetness of the blood orange gave it a welcome accent. Lastly, we got the oxtail croquettes. They were served with celeriac yogurt, and a stupidly fresh tasting salsa verde.

On to the main show! I walked into this not knowing anything about the menu, and when I saw that their burger selection was a single burger... put simply, I was concerned. My worries were briskly eased. The Bestellen Burger features a picturesque brioche bun that stands out from your typical bun in a great way. Once you really settle into that first bite though, things get a smidge emotional. They serve this bad boy with caramelized onions, raclette (a cheese), and a beef patty that rivals Toma's. My goodness was that a thick patty, and thank God because that tender meat melts in your mouth oh-so well, especially as the raclette and onions do the same.

By the end of it all I had big dilemma. Bestellen serves up a burger without a lot of the fanfare of the other restaurants on the Burger Hunt, but damn did they do the basics proud! As of right now, Bestellen has muscled Holy Chuck and Wahlburgers out of the #2 spot, and made Toma feel a little unsafe at the top spot. Still though, Toma is the Truth. Anyway, the hunt is almost over! Loved the experience Bestellen! (And much appreciated chef Jordan)"}
{"text":"Such a great time! We were there with a group of 6 guys celebrating a bachelor party last weekend and they did such a great job, food and service-wise. 

The meat was the best and best prepared I had in the Toronto weekend and the two girls working and guy that served us were really nice and spot on. The server even drew us a little map with bars to go to afterwards with little captions to let us know what the vibe was at each. 

And again, the meat was top-notch."}
{"text":"The burrata with beet salad was delish!! Had the tagliatelle and my friend had the rigatoni... Both were amazing!!! Next time, I'm bringing more friends so we can order the suckling pig!! 

Dessert selection was limited but that's OK, we were too full from dinner!!!"}
{"text":"You'll never eat a better burger in your life. You pay for what you get, and this burger will help you understand that! The food on their menu is a little frightening if you're not used to eating out at creative/classy restaurants, but don't let that fool you. Their food is amazing. 

It genuinely has unique flavours. I hear they also have $1 oysters. But definitely a fun place to go with friends/family/partner. Pricey, but so worth it."}
{"text":"My neighbour recommended that I should try Bestellen as being of good quality and she was absolutely right.

It has an interesting menu, very flexible and understanding service, good wine list and is a pleasant space.

We started with the octopus which was soft, tasty, spicy and served at about room temperature which was fine, and it had an interesting texture of popcorn crunch to it.
The chicken liver pâté was well executed with plenty of good brioche.
The steak tartar was clearly hand cut and  the meat was excellent. It was slightly overpowered by the strong truffle oil and missing a bit of a bite/hot sauce. There was plenty of it and it was soft and mild.
The papadelle with rabbit was delicious, the rabbit very tender which is often hard to achieve, and the rapinni we chose to have with it, deliberately slightly charred, was good.
The Cornish hen was beautifully cooked with crispy skin, and a lovely rice base. We had dark and rich Jerusalem artichokes with it.

Unfortunately at this point one of our party who had not been feeling well had to leave. The restaurant cancelled our steak frites without any hesitation whatsoever.
I will be back to try these! It is just an example of how attentive the service was throughout.

We had brought our own champagne, corkage $30, I tried a glass of a very full and soft sauvignon from the South of France and we drank an excellent Burgundy ($95).   All the wines on the list seems reasonably priced.

A very pleasant experience."}
{"text":"We've been planning to try this place since it opened and we finally got the chance tonight. I took my fiancé here for his birthday dinner- and it was the best decision I've made. (Ok- next to deciding to marry him lol). This may quite possibly be the best meal the both of us have ever had in TO. First I must acknowledge the impeccable service. Our server was fabulous- from his suggestion of wine to the starters- everything was beyond expectation. (Might I add it was half priced wine night). He never let our water glasses go empty and service was superb from the extra bread for the tartar to the mains (steak and pork) cut in half for sharing purposes. The cocktails we started with - him a barrel aged boulevardier and me a negroni- were perfect. (We are very particular about our cocktails). The food: charcuterie to start- amazing: housemade everything, including the mustard and pickles; the steak tartar - we could've licked the plate clean; and the squid- perfect mix of grilled and crispy squid with housemade kimchi. Everything was delicious. The mains- steak and pork chop - cooked to perfection. We forced ourselves to make room to finish it all. Given it was his bday- we had to have desert- and let me tell you: mouthwatering. We had the chocolate in a mason jar with salted Carmel and meringue. Every bite better than the previous. Bestillin has now made it's way to the top of our eat out list."}
{"text":"I've been searching for the best burger all around the world for sometime now, and I've got to say.. Bestellen is the place. Perfectly medium/rare burger with minimal toppings. A classic."}
{"text":"Bestellen had been on my radar of must-try restaurants for awhile, but with so many new restaurants coming out of the woodwork - a food blogger really has to sprint just to keep up!

The namesake of the restaurant is German, meaning \"to order\" but don't expect any schnitzel here.  Top Chef Canada runner up Rob Rossi and business partner Ryan Sarfeld stray far from being a typecasted restaurant.  Rossi sites German, Italian and Spanish cuisines as influences for his meat-filled menu.   Like the founders over at the Social Feed, Rossi hopes to bring communal dining to the masses.  This is reflected in larger cuts of meat (unless you can take on a 32 ounce steak on your own) and lots of sharable options.

The focal point of the restaurant is the meat locker featuring all the aged cuts of beef and house-cured meats.  The recollection of Mark McEwan's meat locker at Fabbrica had but crossed my mind when the celeb chef himself walked past me!  Talk about coincidence.

The decor is interesting with its Edison-inspired lighting, wooden church pews, and mural of cuts of steak.  Opposite that, you will find their wine list neatly scribbled on chalkboard.  The only downer is the garish beam of fluorescent lighting that emanates from the open-concept kitchen towards the rear of the restaurant.

For starters we opted for the Small Charcuterie Platter ($13) for the table.  It consisted of Coppa (a pork shoulder salami), Mortadella with black pepper and pistachios, Housemade Spanish Salumi and pickled Enoki, pickles and radishes.  It was served with a few slices of their house-made brioche which was very good!  Having your own meat locker really does make a difference as the charcuterie board was fresh, and the meats were all delicious.

We also sampled the Pork Belly Croquette ($12) which sat on a bed of lemon \"tartar\" sauce, topped with a fried egg and accompanied by a radish slaw.  Pork belly is something that I'm quite particular with, seeing as Chinese restaurants have no shortage of them and they're all usually very juicy, succulent, and mouth-watering.  The croquette, for me, had a rather dry exterior, with a protective barrier to the pork belly filling.  The dish was beautifully plated, but for me, was lacking in pork flavour.  I also found the meat itself was on the leaner side and therefore, not as tender.

Our server had informed us that to truly experience the goodness of their aged steaks, that the 16 ounce striploin or the 32 ounce côte de buf were the way to go.  Unfortunately, my belly was already quite full so instead I opted for the Bestellen Burger ($18).

I was surprised when we were asked how we'd like it cooked.  I recall having read an article not so long ago stating that Canadians are deprived because the \"burger law\" dictates that our beef patties have to be cooked to a level of doneness that pretty much ruins a potentially good burger.   Further reading indicated that restaurants who grind their own meat in-house are clear of the \"All burgers must be cooked medium-well and can't have any pink in them\" nonsense.  Phew!

I will tell you now, that nowhere else would I fork out $18 for a burger, but it is so worth the splurge at Bestellen!  The house-made brioche made a repeat appearance as a hamburger bun, housing the succulent burger and caramelized onion raclette.  The fries were equally delicious, and no doubt double-fried.  I almost didn't need to dip them into the Smoked Paprika Ketchup.  But for those of you who know me - I never say no to ketchup, and I definitely couldn't resist this one.  The smoked paprika kicked things up a notch!

To finish off the meal, we couldn't say no to the Coconut Donut ($7) which was served on a bed of creamy and luscious lemon curd.  Again, nowhere in sanity's reach is $7 a price I'd pay for a donut but for these - I'd promise my first-born.  This pillowy-soft creation sprinkled with toasted coconut, coupled with the smooth lemon curd was dessert heaven!  I definitely recommend you hold off and save a little room for this if you dine at Bestellen!

V E R D I C T

Bestellen has definitely won me over with their unique decor, yummy food and stellar service.  Chef Rossi is talented for sure, and the front-end staff are stellar.  Our server was very attentive, helpful and knowledgeable about the menu.

I had actually ordered a cocktail (which I didn't like), and she was happy to take it back and bring me a new one (and I wasn't charged for the first one).  I would happily recommend you try the Desert Mule cocktail.  It is a refreshing quaff.

I live in the east end of the city, but would gladly hop in the car and drive on down to eat at Bestellen."}
{"text":"I loved the atmosphere.  The lighting was warm but not too dim.  Music volume was perfect.  Wait staff was attentive and friendly.

Food was tasty, unique and bold.  We had the steak tartar, oysters, octopus and strip loin.  Apart from the oysters (which are what they are) everything tasted very unique and interesting.

That said, this is a meat/fish/flesh lovers restaurant.  If this doesn't sound like you, you probably won't like it.  I was served almost no carbs on my initial orders, and I ordered some fries so I could be full.  However, if you're trying to watch your weight this could be a good thing and I'm 6'4\" so I eat a fair amount.

A unique and tasty experience.  I would go again."}
{"text":"I came here with a couple of friends and we all ended up getting the same thing: the Bestellen burger with fries. We all agreed that while the food was pretty good, we have all enjoyed better burgers. We were surprised to see the large and long restaurant quite empty. There was a family closer to the kitchen that seemed to be enjoying their family style pig roast meal.

Our server was a young girl who was very friendly. We were seated at a high table right by the front window and the chairs were a little uncomfortable. Otherwise, I had a nice night out catching up with friends!"}
{"text":"Finally! An answer to my question: WHO DO I HAVE TO MAKE FRIENDS WITH AROUND HERE TO GET A MEDIUM RARE BURGER!?

Turns out, it's the fine people at Bestellen. We are definitely friends now. 

We went at 6pm to avoid the crowd and start things off right with buck-a-shuck oysters (every night from 6-7!!).  They were nothing fancy, served simply with fresh horseradish and hot sauce. I'm a firm believer, however,  that if the oysters are good quality, that's all you need. And they certainly were. 

We enjoyed them with a white wine they had on special during the same timeframe. I don't remember what it was called but it was $5/glass and it married perfectly with the brininess of the oysters.

Once we finished our \"surf,\" we moved on to \"turf\" and split the burger and fries. 
The meat is ground fresh everyday so we felt good about ordering it cooked to the recommended medium rare. It was juicy, rich, and delicious. Fries were good too and so was their house made ketchup!

We'll be back for sure!"}
{"text":"I've been to Bestellen twice in my life, and both times have been entirely different experiences.

Having first gone for a cocktail hour, Bestellen was a great setting to mingle and enjoy a post-work brew. However, having dinner was completely different.

My family made reservations for Summerlicious. Although the food itself was good, (the oysters in particular) the service was extremely slow.

Our waitress seemed to forget our table and it took on average about 2 or 3 reminders before our food or wine would appear.

Although the restaurant itself was nice, the service really did put a damper on our evening. Would recommend bringing a neon \"Serve Me\" sign next time."}
{"text":"Came here to experience their Sous Vide prepared steak.  What a disappointment.  It was cooked all the way through and not what we expected.  Tough steak with absolutely no seasoning.  They didn't sear it before or after the Sous Vide.  They have this beautiful meat freezer with all these Cumbrae meats aging for all to view.  What a disappointment since they butcher (no pun intended) their steaks.

Not just that, but all our dishes were over salted to the point of being inedible.  Clearly someone back there doesn't  understand how much finishing salt to use.  Our beef tartare had so much Fleur de Sel we couldn't eat it.  And trust me, I love beef tartare, so that almost made me cry.

I so much wanted to love this restaurant, but left in disgust.  The waiter never even asked how our dishes were, even after leaving all of them half eaten.

The reviews on this place are all wrong.  Either they had a REALLY bad day, or nobody knows what a good steak is."}
{"text":"Came here for dinner on my business trip to Toronto this past week. The servers were extremely friendly and very hipster enjoyed the vibe. It was on a Tuesday evening so was a bit quite but they played some great old school music.

Steak was amazing and perfectly cooked. Great seasoning on the outside. Super soft on the inside. 

But the most memorable thing was the crispy pig ears. That is a must! could have ate 2-3 orders myself. Had to fight myself not to. 

Will def be back and hopefully more than once. 

PS the chocolate pudding with cream on top for dessert was perfect as well! Left very very happy!"}
{"text":"Fantastic. Ambiance, service, presentation, quality of ingredients. Just simply fantastic. Worth every penny."}
{"text":"The good - the food is delicious. We've been three times so far and never had a bad dish. We've tried everything - steak, burger, pork, gnocchi, charcuterie, etc. 

Two of three experiences were great. The third was not as fantastic, mainly due to service. A comedy of errors starting with a mix up on the beer delivered and being told whoops! Oh well. To being asked if we were ok not having bread with the charcuterie board because they ran out (as it turns out they got some in from their friends down the street at bar Isabella). Then when asking if we could have another slice of bread (4 people - 3 slices of bread) the answer was - you can purchase some for $4. 

Then the kicker was waiting almost 2 hours to be served our mains without a word from our waiter. When he finally did serve us no apology. We are a relatively easy going bunch but honestly really confused by the lack of ownership and service. 

The guy who seemed to be in charge did try to fix it in the end by comping dessert and some after dinner drinks but it makes me think twice before bringing friends there again. With so many other restaurants to try in Toronto I'm not sure we'll be back."}
{"text":"The food and service are good, prices expensive and the atmosphere is for people in their 20's and 30's who enjoy blasting rock music making it difficult holding a conversation with the people you are dining with."}
{"text":"It hurts me to give this Rossi establishment a 3/5 but I have to! 

The decor, casual and comfortable is definitely accented by gruesome meat drawings on the walls and the meat fridge on display that give it the accent it needs to have a personality. The chairs are super comfy and it's something all of us noticed immediately! 

We were fortunate enough to be seated right near the kitchen, where I witnessed Rossi at work and eating quite often, so that was kind of amusing. His shy demeneaour won't get you the Chef that comes to your table to entertain you experience if that's what you're looking for.

I had to look this up because initially I was under the impression the server was his partner, but turns out that the person serving us was just some arrogant server who was just walking around the joint with owner's snobby aura.

Most of us were having cocktails at the table and I personally ordered and kept ordering the Sancho Sour - it was refreshing and delicious and the consistent feedback at the table was that the drinks were great. 

Our table was clearly a mixed bag of foodies, we ordered from the bar menu and had fried cheese (very bland) and some prosciutto or bacon wrapped fig (the best thing I had the entire night), we also ordered the charcuterie board, which I thought was bland for home cured meats and surely when there are six people you can afford to at least bring six pieces of bread.

Bland is actually my consistent feedback on the food. I shared the steak tartar (lacking acid and flavour), grilled octopus (that was good) and some pork thing (not tasty either) while my friends seemed to gravitate to the Burger, which looked juicy with fries (those were the softer kind but good) and the rapini, therefore green, orecchietti, which didn't get any feedback at all.

We closed the meal with mini donuts and a chocolate pot. The chocolate dessert was excellent and other than the fig wrapped in prosciutto or bacon it was my fave.

My general feedback would be that the menu was lack luster and confusing. It would help to have the menu explained at the beginning of the meal and unlike what the douchebag waiter suggested, these meals are not family style, the Wellington options on the menu are likely family style but what we ordered was not.

Finally, we tipped generously and found the waiter to still be in a bad mood, kinda disappointing. I really hope they turn this menu around and infuse rhyme and reason for the content.

Rossi - I'm still routing for you but I'll wait til you pair with another chef and open something better before I come to your resto again."}
{"text":"Very small restaurant, very small menu. Every dish was pleasant. The meat dishes were amazing! I'm guessing the chef must be a meat-lover like myself. He cooked all the meat dishes perfectly. Thin layer or charred crispiness on the outside, and perfectly juicy and well-rested on the inside, to provide different tiers of flavours and texture to every bite of the steak and burger. The vegetable dishes however, were pretty standard. No wow factor. But nonetheless cooked right, not too soggy, retained their natural juices and still al dente. Could have been more adventurous with flavouring though. If you come try this place, you have to get the burger, don't share either, you'll want the whole burger to yourself."}
{"text":"WE HATE RESTAURANTS:
- which are so dark that you cannot see what the food looks like on the plate when it is served.
- which use 8 point font when printing their menu so that you cannot read the menu
- which play the music so loud that the 6 women at the table next to us were yelling so loudly to be heard that we could not speak to each other.
- which charge $18 for a hamburger which is not as good as a Five Guys Burger which is half the price.
- which purport to have a Butcher's Daily Cut of Lamb for $29 which I had difficulty cutting with the steak knife provided and was tough and chewy.
- which offer ketchup for the French Fries and don't bring it to the table.
- which have only spicy house ketchup and can't be bothered to have a single bottle of regular ketchup in the house.
- where the server fills the water glasses at the table next to ours and returns to the kitchen without looking at the completely empty water glass on our table.
- where the server brings water to the table, accompanied by a glass of ice cubes, and then does not refill it with ice and leaves the empty ice glass on the table throughout the meal.
- where the server delivers the food and waits until you have finished eating each course before asking if you have any problems with the course."}
{"text":"The service was great. We had a group of 20 for a birthday and they did a fantastic job. The food took a while to come, but what can you expect with that many orders going in at once? The server stayed on top of our drink orders and was very charming and good fun.

As for the food: don't order the ravioli...there's 5 small pieces for $22. A friend who ordered it was luckily a tiny girl, but even she was disappointed and hungry after. The other food (steak and lamb shoulder, which were specials of the day) was just OK and nothing special. They were extremely overpriced. I will definitely not go back."}
{"text":"Met some friends here for brunch; I would reccomend it if you're looking to indulge. 
Beautiful space is comfortable, warm, sunny. Service is attentive, friendly and professional. And the food is mouthwatering. 

I had 

SPECIAL CEASAR AND GRILLED CHEESE WITH BACON JAM - $15 
Awesome drank. 
One of the best grilled cheese I've ever had. Should be on the regular menu!

The grilled cheese was 'app size' and didn't quite fill the bottomless pit that Saturday night had brewed in my gut, so I decided to order breakfast off their regular brunch menue in ADDITION to this. It was an insane choice. Not a bad one. Not one I regret. Just insane. I obviously found out my pit was not bottomless and had to take most of it home to eat it later. 

POACHED EGGS WITH SPINACH AND TOMATO HOLLANDAISE. 
Hollandaise was amazing; the veggies were nice and necessary to break up all the hearty meat and eggs. 
The eggs were perfectly poached. 
For yolk sopping, thick slices of bread were brushed with olive oil and grilled; absolutely delicious and a nice change from the typical toast. 
The cotechino sausage was so good. 
I did find the meal too salty; most of that salt comes from the sausage, but combined with the hollandaise it was almost overwhelming. I said almost. It was still amazing; good enough to eat leftovers 4hrs later, which is pretty much unheard of for breakfast foods."}
{"text":"There's nothing better than the afternoon before a big dinner. The expectations.. the possibilities.. the idea in your mind.. it's great because its this catalogued fantasy just waiting to be fulfilled ..until it isn't. My friend and I have been waiting to try bestellen for quite some time due to referrals and blog posts alike. 

Real quick we had. Pork ears. Dozen oysters. Burrata. Burger. Cote du boeuf and tagliatelle. 
Pork ears were tasty and well seasoned. Fried and bite sized.
Oysters were malpeque. We were upsold 2 dollar in house hot sauce. (Meh it was Sriracha mayo)
Burrata was great.. but only three slices of toast to spread it on. Burger meat.. looked good. Didn't taste as good.
BURGER BUN was very good. Meat tasted overdone in spite of looking cooked perfectly medium rare. Very clean burger for purists. 
COTE du boeuf had a nice subtle flavor but was very tough. Even at medium rare.
Pasta was a mixed hit. Great taste. . I've had better but my friend really liked it so..

Don't believe the hype. Go in with low expectations. It's a nice place regardless. Excellent service and staff"}
{"text":"Fabulous brunch...the eggs baked in tomato sauce (not something I would usually order, but they already ran out of the 'Bestellen benny' which is apparently their most popular dish) was seriously divine. I'm docking a full star because by 2pm they'd run out of the benny and the donuts :( 

Still, adorable little space...I'd definitely come back for brunch again, and dinner."}
{"text":"Came here because I heard the burger was outstanding, but I wasn't as wowed as I expected I would be. Overall the place has great vibes, upbeat, good crowd and feels classy but in a casual way. I only tried the burger and local burrata to start so would need to come back as the rest of the menu sounds really good. The meat in the burger had a great taste, but the rest of the burger lacked creativity and the fries were subpar. Presentation was also lacking. The cheese was pretty good, with the candied beets. The drinks list seems great, I especially liked their Amber beer on tap. I'd love to give a higher rating, but again would need to come back to give the rest of the menu a try."}
{"text":"I went to Bestellen last night with a girlfriend for drinks and snacks. We sat at the bar.  The vibe of the place was lively and the decor gorgeous. The music was awesome (Deerhunter, Lykke Li, TV on the Radio) and piped into the bathrooms. (I really liked this at the time... I'm not sure why) 

The service was attentive and the staff are all very attractive. We ordered the unexplained \"devils on horseback\" at the recommendation of the bartender, which are actually dates wrapped in bacon. Pretty good ($6 for four). The only downside to this place is that it is pricey- my vodka sodas were $9 a pop. I can't comment on the food, but I'd like to come back and try it sometime when I am feeling carnivorous. 

Check it out!"}
{"text":"I LOVE their burger! I would say my favorite, after Harbord Room.  Very tender and meaty. It's the only thing I tried there (I've been there twice) and only thing I will probably end up having again if I go. Best burger in TO? Possibly. Quite possibly."}
{"text":"Bestellen is a fun, cool restaurant that is well worth a visit or repeat visits.

The star of the menu is meat. They offer specialty cuts of beef/steak, as well as about 5 different main course attractions.

The must try item is the burger. At 18$ it ain't cheap, but it could be the best burger in Toronto. (With all due respect, there are not loads of \"amazing\" burgers in TO. This one certainly is.)

The burger is served with fries. They are good, but nothing special.

Service here is above average.

Bestellen has a respectable cocktail menu with great creativity. There is also a solid wine list and great beers on draft. Prices on alcohol are above average, but fit with the quality of the restaurant.

The only negative here is the uncomfortable chairs. Maybe this keeps patrons from hanging out too long."}
{"text":"Came here twice for some good quality BEEF! :) the meat here is absolutely AMAZING. love the ambience, and i love walking by their meat storage where you can see them aging the meat IN HOUSE :) so far everything I've ever tried there was very delicious and so good. bone marrow, yum. the giant rib steak shared between 6 people... SO GOOOOD. WE ordered their burger, it was ginormous but juicy in every bite. Also tried their meat platter, their salamis were yummy and i don't usually eat pickles, but i ate their pickles - also made in house. if you're ever in this neighbourhood it is definitely worth checking out! we had dessert there as well ans it's as good as it is described. STaff is very knowledgeable about their menu and drinks and also very good with suggestion for wine too. Definitely worth coming back!!! :)"}
{"text":"Was told when we called that the place was family friendly . Waited over an hour for a plate of pasta for the kids. However our food was good."}
{"text":"My brother introduced me to this restaurant for my birthday.  He wanted to take me to a steakhouse..first thing I thought was The Keg or Baton Rouge..but he and his fiance took me and my wife to this little gem in Little Portugal...Bestellen.

Location:
Right on College St between Ossington and Dufferin, street parking can always be a little bit of a hassle, but nothing out of the ordinary for the area.  

Service:
Upon walking in the main bar is located to your left, either the bartender or servers are quick to serve and seat you.  Very laid back and casual. 

Restaurant:
Wood tones throughout the restaurant, back bench seating at the tables really add to the casual nature of the restaurant.  When your enter you see the main bar to the left, then to your right you see the Meat Room. Exquisite cuts of meat are curing and aging in this area. A glass window shows off all the wonderful and varied choices of meat.  An open kitchen concept tops off the back of the restaurant.

Food:
My brother mentioned that you have never had a steak like this before.  I have heard that statement before about other dishes and meals, but he was correct in saying this.  I left the ordering to him and his fiance, but he said that he and I would be splitting the \"cote de boeuf,roasted bone marrow and 2 sides\"  I was intrigued by the choice, espcially the roasted bone marrow.  I always thought that bone marrow was the stuff that my dog loved getting out when I gave her a bone.  I never really thought of eating it myself.  He ordered our entree along with a Bestellen burger for my wife and wonderful salad for his fiance and these amazing deep fried chickpeas (very addictive).  Our \"cote de boeuf\" (steak) was cooked \"sous vide\".  Basically it was boiled in an immersion circulator.  The steak was medium rare the whole way through, so you just don't get that medium rare portion in the middle of the steak.  Our food arrived and i tried the steak, it was done perfectly, as for the bone marrow..all I can say is now I am a convert..it spreads like butter, melts like butter, tastes like heaven...sooo good on a steak. My wife liked her burger, but she was not a big red meat eater, so she ate what she could.  The salad looked very tasty as well, but the star of the show was the \"cote de boeuf\".   We opted out of desert for more wine..

Impressions:
A great little place in Little Portugal, nice casual trendy atmosphere.  Small menu with tasty selections.  Excellent cuts of meat and I highly recommend the \"cote de boeuf\" and the deep fried chickpeas mmmm"}
{"text":"I've given this place two chances, and both times they've failed me. The first time I ordered my steak medium, and it came rare. I sent it back twice, but it was still bloody. The second time I ordered the oysters, and they were probably the worst quality I've ever had in my life. They tasted like they were about to spoil, and came on ice with no lemon, remoulade, hot sauce, or horseradish.  Had to use a lemon from my drink. Avoid this place."}
{"text":"Enjoyed Summerlicious tonight at Bestellen.

I had the organic greens, Cornish hen and budino. The toasted hazelnuts married well with the lemon dressing of the salad. The Cornish hen was a portion of a Cornish hen rather than a whole hen, very tasty. The budino I had was much smaller than the one pictured here but very delicious. 3.5/5

My husband had the charcuterie, strip loin and hazelnut gelato. He really enjoyed the charcuterie, found the steak portion very small and nothing special (I thought it was tasty) and also enjoyed the gelato. I thought his gelato was very delicious and might have had several bites. 3/5

The service was excellent and nice ambience. I would go again if we lived closer."}
{"text":"If you're looking to host a large party, highly recommend you to come with just two ppl to scope out their food first before inviting all your friends.

Our set menu which had the pig as the main course was dry and flavorless - that's why they give you gravy to mask it. Mixed veggies were ok- but nothing stellar. The dessert a lemon pound cake was something similar in taste and texture to clear plastic box dessert from the grocery store.

For those that want to enjoy a good cocktail with their meal--- this place is a disappointment. $15 for watered down Old Fashion.  Wines are sold by 3oz (why do they have that even in the menu??? It's a drop of wine), 5oz or by the bottle. I'm more annoyed that they basically price it so you have to order the bottle. As well For a Saturday night they ran out of every type of whiskey because they only stock one bottle of each? For this type of restaurant they should've been better prepared for large group."}
{"text":"If you are a meat lover, then look no further. I can't rave enough about this place. I've been back a handful of times and pretty much tried everything they have to offer. Haven't been disappointed yet!

The burger may be the best in the city - medium rare suggested...."}
{"text":"Fab brunch here - just be sure not to come when you are starving because the service can be really slow. My DC and I came on a Sunday ~2pm, so most of the brunch rush was actually over and there were lots of empty tables. Still, it was nearly 45 mins. before our food finally arrived! Service was okay, but it would have been nice if someone popped by to reassure us that the food would be coming eventually. At one point, we got worried they forgot our order, as the table next to us (another table of 2) had sat down after us, yet got their food, ate, and paid their bill all before we had our first bites! 

/rant

Otherwise, Bestellen would be a winner for brunch. Lots of seating, atmospheric (gotta love the meat-inspired art work on the back wall and the large fridge with meat on display across from the bar), interesting menu and killer brunch cocktails. I had the homemade biscuit smothered in sausage gravy and served with fluffy scrambled eggs and collard greens. The gravy was amazing... Total comfort food. The collard greens were just a tad too salty, but I tend to like things less salty than the average person. Portions were huge and I couldn't finish my plate, even with my DC helping out! I also had the Red Rooster - a mix of gin, strawberry, basil, and ginger. Delicious!! DC had the corned beef, which he scarfed down. Their ketchup is homemade and has a nice kick to it. They also have great hot sauce - kinda sweet. I'm not sure what kind it is or if they make it in house. They brought it out in a tiny dish. 

I would give Bestellen another chance and come back to try their dinner options. It also looks like a nice place for drinks. There is a pretty long list of bourbons and whiskey's on the wall, as well as lots of wine. 

Other than improving their timing/efficiency, my only other advice to Bestellen would be to switch up their music selection. Rustic interior, hearty comfort food, and... \"Baby Boy\" by Beyonce ft. Sean Paul? Something doesn't match...!"}
{"text":"Straight up my favourite restaurant in Canada for steak. Take it from the girl who grew up in Tx.

Try anything with a side of marrow.
Seafood options are fantastic if you don't want meat.
Order appetizers only and you won't be sorry."}
{"text":"Probably my most favourite restaurant in Toronto. Great meat centric menu. Great beer. Great laid back decor. Great service.

Been here twice so far. On my last visit we ordered the charcuterie plate, a pasta dish for my son, and the Cote de boeuf. Charcuterie plate was done well. The pasta dish was sooo good. Pasta was done in house. The cote de boeuf was just out of this world. Good lord. It was a meat lover's dream come true! They take a big chunk of meat. Sous vide it to the perfect temperature of your desire. Then it appears they pan sear it to get the browning on the outside. They cut it up, and serve it with roasted bone marrow! It is just chock full of beefy flavour. Finished off the meal with a chocolate bread pudding. Again executed very well."}
{"text":"I came here on Saturday for my bday Pig Roast. We were a party of 15 and super excited as we've heard good things about Bestellen. Alas, sometimes it's best to hear average reviews or nothing at all. It's about managing expectations and ours were a bit too high it seems. 

Overall it was a disappointing meal on all accounts. Food was not great, service lacking, and pacing completely off. Details below.

Background -- For the Pig Roast they charge $59 a person for the pig which they say up to 16 can eat. But if you have 8 peeps minimum u still get the whole pig so if you're gonna go for the roast go for a smaller number in your group -- better bang for your buck. We had 2 large tables from 7pm til about 9ish when they were expecting another big party. 

The Experience --

Food took a while to come out and when it did it come it came in dribs and drabs. After having the salad and risotto balls to start (both of which was good) we sat around for a while as they prepared the sides to go with the pig. Finally a really lovely looking challah bread arrived, sadly I didn't get to taste it as they only made 12 rolls. To be fair, my original reservation was for 12, I had called a few hours earlier to up the number to 15. Unfortunately when I asked for some extra bread the server (not our server but a different guy) was super annoyed that we asked for additional sides. I told him we didn't have enough for the table so he relented and went to ask the kitchen. He came back and told us we couldn't have the challah because they were out then brought us a plate of burnt thick sliced french bread.

We sat for a while longer then some sides showed up for cooling on the table. They were: chard, parsnips and green beans. The portions of the sides are extremely small. They brought one of each per table of 8 which was clearly not enough. We tried to wait for the pig to arrive, but most of us were so hungry we just dug into the sides. The chard was buttery and tasty. The parsnips salty to the point of inedible. The beans were good. The pig's arrival was pretty fun. We got to have a photo op with it before they carved it. The pig was tasty though no crackling. Instead the skin is tough and leathery but the meat is moist and juicy. 

We asked if we could have some more chard to go with the pig -- our server was totally hesitant and said he would ask the kitchen. It turns out it was allowed but round two of chard was saltier than the parsnips -- disgusting actually. I'm parched just thinking about it. 

We carved our pig and ate it, but by the time it was time for dessert (a light carrot cake more like a muffin than cake) we were all pretty much over the experience. Luckily for that because we were rushed out of the restaurant so they could prep for the party that wasn't there yet. Before we left the server did manage a, \"Oh, it's your birthday? Happy birthday then.\" I shrugged, said thanks and went on to have a great night elsewhere.

So, to recap. If you're gonna try the pig roast, go with 8 people. The pig is tasty. The sides are hit and miss (mostly miss) and they are super skimpy with the portions and will not be impressed if you ask for more. 

Bang for buck -- I'd say not. They treat this as a prix fixe menu, if you're looking for family style go to Ruby Watch Co. It's cheaper, consistently awesome, you can have all the sides you want, service is fantastic and you'll probably go back again."}
{"text":"Went with a group for New Year's Eve dinner. Although we were on time for our seating, our table was not available. After being told several times that it would be \"3 more minutes\" we were finally seated, almost 30 minutes late. Apparently this caused issues with the timing of our meal as 2 hours in, we had still only been served our 1st course. When we asked about the delay, we were told it was because we had a \"late seating\" and there was nothing they could do. There was no apology, and none of the staff seemed to care that we were unhappy.

Of the 5 course menu, the highlights were the pasta course of Ricotta Cavatelli, and the Chocolate Budino dessert. I had been looking forward to the steak; however the medium rare steak I ordered was overcooked to borderline medium-well. Had we not waited almost 3 hours for our mains, I likely would have sent it back.

Overall, the evening was a disappointment. I can forgive slow service if the food makes up for it, but in the case of last evening, it definitely didn't. I probably wouldn't go back, and wouldn't recommend Bestellen to anyone else."}
{"text":"Headed down to the west end of College with a burger and only a burger in mind. Hearing of this spot for the first time from a top burgers in Toronto list, my friend and I descended on this quaint, old-timey-blacksmith-shop-that-a-hipster-renovated-type-spot with top quality beef in mind.

We dined on a Sunday at 6pm, so the place was essentially empty when we arrived. I often find that when a restaurant isn't busy, the service is slow and the waitstaff non attentive. Not the case here. Our server was delightful, knew the specials like the back of her hand and was always there when we needed her. In fact I tipped her 20%, and that ladies and gents, is not a common thing. You gotta work your buns, and that she did. But I digress. 

The burger: Boy oh boy is the patty sweet, juicy and cooked to perfection. And yes, you can have it cooked to your liking. I found the medium just perfect with a hint of pink. The caramelized Onions and Raclette brought a sweet and crunchy texture to the patty, and the egg brioche bun a light sweetness that really set off the finish of each bite. The burger comes with a side of fries, dusted with black pepper and a side of housemade ketchup that is mixed with paprika. If I could bottle this and take in home in a keg, I would. It adds the perfect punch to the fries, and being homemade, lacks the artificial sweetness of Heinz.

The beer: Not a lot on tap, and the waitress admitted that the availability of what is on offer is often out. They are apparently more of a wine spot. I was disappointed that my favourite bottle (Anchor Steam out of San Fran) was also sold out, but I did try the Beau's Amber which was comparable (and avail. on tap) and a German brew that came in a Octoberfest-style mug, which more than made up for any Anchor Steam woes.

The dessert: Oh. MYGod. The burger and fries is more than enough to satisfy, however I couldn't say no to the house made ice cream - Bourbon Whiskey-Smoked Vanilla Blueberry. For a mere $3, you get a scoop of sweet vanilla with wild blueberry, and a whiskey-smoke aftertaste. Genius. Not sure how often this is available, but if it is, DO IT. Holy smokes (pun intended).

The price: Expensive in burger terms ($18) but definitely worth it. Quality comes first at Bestellen."}
{"text":"The service and food is amazing. The grilled peaches and steak tartare are tasting as starters. The wine list is strong. The steak is the best I have had in Toronto since Odd Fellows closed. The critics of this place had small issues but the big promise is a great meal that you won't forget."}
{"text":"I usually don't feel inclined to write a review unless my experience was exceptionally great or grotesque.  Bestellen was neither but was disappointing middle of the road good for us only.  I think it's still trying to find the formula.

We came on a Friday night right at prime time and the place was not even half full.  Chef Rossi was in the house but appeared to be entertaining family or guests at another table and was not actually working.  Maybe that was the issue.

Our experience can be summed up by mediocre execution and communication between the waitstaff and kitchen staff, which by the way on Friday night the place was very well staffed in terms of number of people working the tables and kitchen.  I've seen half as many staff execute in fine fashion to a much larger group of patrons at other establishments.

Anyway onto the food.  We had the charcuterie board (3.5*) to start.  It was well executed, meaty, and tasty.  But it seem to lack range or variety as most pieces were a derivative of some type of salami.  We expected more variety especially since we ordered the larger board.

Afterwards this where things started to go a bit in disarray.  My two companions had ordered appetizers as mains and I went with the obligatory steak...opting for the smaller sirlion tip option.  We also decided to add 4 side dishes, zucchini flowers and garlic scapes (4*), chichorron (4*), roasted beats (4.5*), and fries (2.5*) to go with my steak.  But timing of dishes coming up seemed come out at random.  The zucchini flowers and chichorron came together...OK...they are a good munchies.  But then one of the appetizers-mains beef tartar (3.5* - tasty and beefy, but in our opinion the creamy caesar style mix was not our favourite plus the side chips were over salted) came on it's own.  The waiter realized the mistake afterwards.  But we still needed to wait 10 min for the scallops and steak.  The scallops (3.5*) are bumped down a * for again being oversalted.  My steak was the star of the night (4*) very tasty, perfectly medium rare with a chimichurri sauce...but this time around was a bit lightly salted.  The bigger issue was they plated it was the side of beets instead of the fries...which we needed to waited another 10mins for and were a bit overcooked though the side of homemade smoked ketchup and mayor were good.  OOPS?? 

The restaurants been open for several months now and given the room was at best half full at any given time and there was ample staff to handle everything, I found the lack of execution and poor communication to be quite disappointing. Maybe it's time for Chef Rossi to get a better handle over his staff...otherwise he may see more sparsely packed Friday nights.

Final note.  I've been fan of Mercatto prior, during, and now after Chef Rossi's tenure.  It's a testament to a well run and managed operation that the food and service can transcend a single person.  Hopefully he can apply his learnings there to BestEllen."}
{"text":"First time going to Bestsellen last night for a late dinner at 9pm...loved it.  The layout, decor and ambiance was great.  Not too loud and fantastic service.  

Ordered a small terrine board with house-made charcuterie as well as the charred octopus to start.  Just enough to share between two people.  Delicious...couldn't wait to try our mains.  I would've preferred not to order a burger and fries, but after reading some reviews before our dinner, it sounded like it was a must order here.  And I'm so glad we ordered it - I have to agree that their burger is one of the best in Toronto in my opinion.  Ordered medium rare and enjoyed and savoured every bite!  We shared the burger as well as the tagliatelle pasta with confit rabbit.  The pasta, although slightly too oily, was still delicious.   For dessert, the house-made sweet plum ice cream was a perfect way to end a great meal.  

With two glasses of wine and two house cocktails, the bill was not inexpensive, but we really enjoyed the evening and meal from the moment we arrived.  Our servers took the time to describe each dish as it arrived, our water glasses were always filled without having to ask, and alcohol refreshed promptly.  The great service, ambiance, and most importantly your food which had me oohhhing and ahhhing, merits 5 starts for me.  Thank you Bestsellen...I will be back and will be recommending your restaurant to my fellow foodies!"}
{"text":"Went back to Bestellen for a Valentine's dinner and was quite pleased. Reservation process was easy and the did follow-up by text when we were running a bit late. 

I'm always a bit worried about going to a restaurant for 'event' nights like Valentines, but overall things were fine. We both ordered the Endive and Radicchio salad and it was fantastic. Fresh, good mix of sweet and bitter and well seasoned (5*)

We ordered the 20oz strip steak special with two sides. The beef was not aged but was properly seasoned and cooked perfectly. I would say 'good' but not 'great' and not the best steak I've had for the money ($100 for two). (3* for taste vs value)

The sides were mixed. The wild mushroom with tarragon butter was delicious. Good quality mushrooms, not over-cooked. The roasted cauliflower was overcooked - soft and mushy with no real mint 'pop'

Dessert was very good. Chocolate 'pudding' with a lovely salted cream topping. 

Wine menu is good - quite a few sold out so the list needs a bit of a refresh. Pricing is at the upper end ($100+)

Service was solid - a bit scattered with multiple servers (not really sure who our server was), long delays at times but pleasant and not too intrusive

Good place to go for a date but be prepared to spend some $$$$ (our bill for 2 was $3xx with good wine)."}
{"text":"Our party of five visited on a busy Saturday night.  We were seated promptly and service remained steady throughout the meal.  We did, however, wait too long for our cote de boeuf to arrive.  I realize that it takes some time to prepare but when you get toe tapping and staring at the kitchen wondering where your food is, you've waited too long.  The beef itself was just fine, not on par with New York's  Minetta Tavern's cote de boeuf (which I always use a reference point for the dish) but tasty enough especially the bone which we cast aside our manners to devour!  The sides are SMALL... super small.... and suggesting that we could share 3 amongst 5 hungry people was a bad move by our server.  One little carrot and a slice of onion each doesn't work.  We had steak tartare, octopus and oysters for apps and they were all tasty with the octopus being a bit tough.  The cocktails were also very good and we also enjoyed an after dinner bourbon with what I consider to be the highlight of the meal... the homemade cookies and booze infused milk.  Cool dessert that made it a unique experience.  The cheque for 5 was pretty pricey given the amount of food we consumed.  Next time I think we'll perhaps opt to each order the burger (which looked amazing) and then go for the cookies.  Overall, Bestellen was indeed A-OK... good but room for improvement."}
{"text":"Well tonight was a bit of a disaster. New Years Eve and I realize it is a busy time. We got there for our 915 reservation and were seated at 935 because our table was occupied when we got there. That seemed to set the kitchen off completely as our dinner service was incredibly slow. 2 hours into the service we were only on course 1. We had to complain rather loudly to get things moving. The dinner itself was ok but I was disappointed in the main steak dish. This is admittedly odd as the last time I went it was delicious but I expect more from a New Years meal, as do my friends."}
{"text":"The sides were delicious and better than the mains. We ordered the cote de boeuf which was decent - not worth the price. The grilled octopus, Argentine prawns and beef tartare were fantastic. Same can be said about the roasted cauliflower. Drinks were good as well. Our server was a little sassy and put a damper on things. Will try the burger if I decide to give it another shot"}
{"text":"Bestellen is all kinds of awesome! If you ever decide to try to place, gather your friends and order the family style whole suckling pig (Min 8 people and 72 hours notice required)

The whole roast suckling pig family style dinner starts with a vareity of sides (veggies, potatoes, brioches) to get the appetite going. Then, a whole roast pig is plonked in the middle of the table, with head still on - this is the moment when everyone bust out their cameras.

They then proceed to cut up and portion the pig to make it easier to serve amongst ourselves. Near the end of the meal, Bestellen served us not one, but two very delicious casserole sized apple cinnamon pecan bread pudding....OMG! There's not a single person left hungry at our table, and there was still plenty of meat left at then end

We all left very happy, doggy-bag in hand with enough leftovers for another yummy meal the next day. I was super impressed with the service as the server was attentive enough to split all the gravy into little containers for each of us, and also portioned and placed the desserts in a seprate box.

Bestellen is a must-try"}
{"text":"What can you expect for a $600  meal at Bestellen? To feel humiliated by the end of the night. 

Our party of six was excitedly anticipating an evening at Bestellen. My family, who was visiting from out-of-town for the weekend, had been gushing about celebrity chef Rob Rossi, and to celebrate a milestone family event, we were going to dine in style. 

Instead, we had what I honestly have to say was the most disappointing, disrespectful and tactless dining experience I've ever had in Toronto.

To be fair, the evening started out well - my father ordered some delicious wines and we began with a tasty charcuterie board. In our party of six, we had dietary restrictions for one person (who was vegan) and made this clear in a phone call beforehand - to which they said was no problem.

When we let the waiter know, he offered her one salad option, which was essentially a few mixed greens.

We understand that this is a meat-heavy menu, however, at a restaurant that boasts an expensive menu and the sophistication of a renowned chef, sautéing a few veggies or coming up with an oil-based pasta, isn't rocket science.

Here is where good old-fashioned customer service can be used to mitigate and prevent an uncomfortable situation. All the waiter had to do from the get-go was offer to speak with the kitchen and get back to us. Instead, we had to insist on this (which our vegan family member felt guilty about because she didn't want to put anyone out) before the waiter offered to do so. 

A small setback, but that's fine - we moved on.

Let's get to the meat - the star of the show. After the waiter discussed the specials and highlighted a $200 42-ounce steak to share - the four meat eaters at the table decided to take on the challenge. The waiter contended this would be more than enough food for four people. Perfect.

And then we waited.

Forty-five minutes later - no food, and no waiter to be found. In fact, he seemed to be zipping around the tables, talking and laughing with about three or four other tables, who at this point, arrived after us, but all received their entrees before us. 

A bit odd, we thought. It started to feel like every time we tried to make eye contact with him to understand what the delay was, he looked past us - in fact, it felt like he was actively avoiding us.

After about an hour and 15 minutes, we tried to vocalize our concern to our server about the delay. Instead of simply apologizing for the wait - which would have made us feel acknowledged and that they hadn't forgotten about us - he started to defensively rattle off excuses. In fact, two of our family members, who have worked in the service industry for over 10 years, were taken aback by his hasty and cold demeanor. 

Finally, after an hour and a half, our steak arrived - if you could call it that. I wish I was over-exaggerating about this next part:  The plate was a mini-mountain of bones.

In a 42-ounce steak, we collectively ate about 18 ounces. Personally, I had one strip of steak that was about 3-4 ounces. Unacceptable. 

After struggling to scrape the final bits of steak off the bone - we were truly at a loss for words. At this point, we just wanted to get the bill and leave. Which is what should have happened.

But our story continues: A manager - who should have come out an hour earlier to apologize for the wait and service - came to our table with a bottle of liquor to try and smooth things over. 

While I can appreciate the sentiment this manager was trying to offer, it came off as insensitive and insincere. In doing so, he actually minimized our experience and didn't really try to understand why we were disappointed. We weren't looking for a handout - free drinks or dessert - we just wanted someone to listen to why we were upset.

After my family had collected their coats and paid the $600 bill, I waited while my husband had a few final remarks with the manager and chef near the back of the restaurant. 

While I waited at the front of the house for him, our waiter - the person who was mostly responsible for our unpleasant experience - started distributing our uneaten dessert to patrons near surrounding tables as they laughed about the \"difficult table\". 

I felt humiliated. This restaurant not only under-delivered on their food, service and overall dining experience - my good and kind family was now somehow the punch line of a nasty joke. 

Bestellen ruined our evening, embarrassed my family and left us baffled (and hungry) - all for the price of $600.

I would never return to this restaurant and before you do, please consider the type of business and people you want to support. Because patrons should never feel the way Bestellen made my family feel last night."}
{"text":"We couldn't have asked for a better place to grab a casual late dinner on a recent weeknight. The food was fantastic, the service superb, the drinks inventive, and the atmosphere laid back. 

After patiently waiting for us to take a glance at (and approve) the menu, the friendly host gave our party of three the choice of a table in the front or back. Having chosen the latter, we were pleased to find the surprisingly spacious dining area abuzz with cozy tables full of happy diners basking in a warm glow.

Our cocktails arrived quickly while we perused the menu. Everything from my half dozen PEI oysters and flavour fiesta of a steak tartare to my dinner dates' gigantic juicy seared scallops and unapologetically fatty striploin was absolutely delicious.

Service was beyond efficient. A shiny new fork was delivered onto my napkin moments after I dropped my original. A new candle was brought to the table the second the first burnt out. Water refills were automatic and came unprompted. 

I can hardly wait to come back and sample more of the menu. Now, to find seven other people to share a whole roasted suckling pig with..."}
{"text":"I wanted to dislike this place. When we made a reservation we were alerted that there is a two hour time limit for tables booked before 800pm. I found this to be extraordinarily tacky for a restaurant with their prices. It's usually low end places that want to turn tables and high end ones that charge you for the experience. I felt like Bestellen was trying to have their cake and charge you double for it too. Which they might be. But...I loved their food! 
The staff was amazing and attentive and the cocktails are in my ranks for some of the best in the city. The only thing I will say about the food is that the pork belly was overcooked in their attempt to get a crispy skin(which they did) but it ended up having a texture similar to ham. Other than that I wore a smile on my face in between bites. As mentioned before the prices are steep for the vibe of the place, which is something I never complain about if its warranted, but it does seem a little conflicting, and I think worth mentioning. Caught between fancy and chill, with dish selections that appeal to the masses (nothing exotic or jaw dropping), I would recommend that they decide on their identity. That being said, there are a handful of restaurants in Toronto that I'll ever come back to and Bestellen is one."}
{"text":"Underwhelming! Where does one begin?

I really wanted to like this place, and for a multitude of reasons it just did not pan out how I imagined it.  I'd walked by this place and read somewhat positive reviews and figured it would be a good place to try.  This is what Toronto's Summerlicious is all about, trying new restaurants. It is like Restaurant Week in New York just in case anybody was wondering.

I went with a group of seven people, by the end of the dinner the overwhelming opinions were pretty much the same.  Disappointed that our expectations were not met.

The first course was the grilled squid with Romesco sauce, shaved fennel, and charred scallions. Squid is best served simple, think classic Greek and Spanish.  The Bestellen squid consisted of three tiny pieces accompanied by a spicy romesco sauce and what seemed to be lightly vinegar fennel and some charred scallions.  The tastes were all over the map, like the chef tried to use opposing flavours to work together.  Meanwhile, those who ordered the house charcuterie plate had a better experience.

The main course, a measly four ounce dry aged striploin was hit and miss at best. Consider the restaurant cures its own meats and ages its beef onsite is encouraging. The striploin was tender, well aged, but too salty.  Disappointment.  The salsa verde which was minty in flavour was smeared on the plate as a decorative accent - it looked horrible like a diaper smear.  Kind of like the chef threw greens into a blender and then smeared the remains onto the plate.  Aesthetically a big turn off.

The dessert, chocolate budino with caramel and sea salt worked well and ended the meal on an upswing.

Beyond the food, service was slower than molasses.  We walked in at 7:00PM, ordered by 7:20PM, received our first at 7:40, mains at 8:30...you get the idea.

It may sound nit picky at this point but our table did notice the wait staff did not use trays to bring out meal plates.  Fingers were all over the plates. It would make sense for wait staff to use trays. 

At this point, I don't know if I'd go back - but I would one day like to see what Bestellen is capable of when their game is tighter."}
{"text":"We had the market oysters, beef tartare and Bestellen burger.  The beef tartare was excellent and I think the burger was perhaps the best I have had in Toronto.  Definitely go for the medium rare.  We arrived without a reservation and it was busy.  They were kind enough to ask a couple at a 4-top to split it into 2.  None of the attitude and pretensions typical of most west end eateries these days.  I will definitely go back."}
{"text":"So I rarely give ratings of 1, and only do so when the meal was so unenjoyable that I would have been happier eating a bowl of cereal for dinner.

To note, I am not a picky eater at all, and am just as happy going out for pho as I am going to a 5 star steak house. I just hate when you go to a somewhat upscale place and the food is worse than street meat. For the price we paid, I could have happily eaten congee wong take-out for a month -___-\"

Appetizers: Grilled squid with some greens and sauce - all you could taste was salt. Charcuterie plate - this was pretty good, good cuts of meat with some bread and mustard to dip. The only decent dish of the night.

Mains: Sirloin (which, by the way, they are supposed to be known for) - we all ordered them medium, and all were done closer to medium well/well. All tough, chewy, unflavourful, slabs of meat that went unfinished. The potatoes accompanying the main were undercooked, and the greens were so salty they were un-edible (they seem to love salt at this place). My friend ordered the chicken and it was also very dry and had an odd taste to it. 

We would have brought this up to the server (especially the funky smelling/tasting chicken and leather-cooked meat), but alas, he never stopped by to check on us during the meal. 

Head to Bar Isbel down the street if you're in the area. 10000000X better and you will spend the same :)

Would I return? - Definitely not
Parking? - Street parking (paid on College, free on residential) and Green P's in the area
Value for $? - Poor
Space? - Mid sized restaurant/decent waiting area
Ventilation? - Good
Service? - Poor"}
{"text":"I absolutely love the food and drinks at Bestellen. I had the pleasure of sitting at the bar and got to witness the precision that went into producing a single drink. 

We didn't have to wait long for our starters to come out and the mains were perfectly timed and arrived after the starter was cleared. 

Though I didn't order the burger, I did get to take a bite and it might just be one of the best burgers in the city. The ravioli was amazing! The flavors of the mushroom and artichoke went so well together. 

I am very much looking forward to my next visit!!"}
{"text":"For my bf's birthday, I took him to Bestellen for dinner, though truthfully I was the one craving for a good burger. Having heard some good things about their steak and burger, I was eager to try for myself.

We started with fried zucchini blossoms ($7). The cheese was a little salty, but the snack was otherwise enjoyable. 

The Butcher's Daily special was an 8 oz sirloin tip with chimichurri ($29). The steak definitely wasn't the most tender cut of beef, but it was extremely flavourful. I personally prefer more tender cuts, but at the same time, I was totally in love with the fattiness of the sirloin tip, especially that distinct layer of fat beneath the seared crust. We also had a choice of side, and I went for baby beets and greens. The beets were delicious, but the greens got a tad greasy from all that beef fat. 

And of course, I had to order the Bestellen burger ($18) with caramelized onions, raclette, house-made bricohe and accompanied by a huge pile of frites. 

The burger patty, cooked to medium-rare, was moist, extremely juicy and just bursting with flavour. The brioche bun held up quite well, so that the whole burger wasn't a mushy mess. I personally prefer burgers to be sweeter, so I really enjoyed the caramelized onion component. This was definitely a very good burger, and the fries and house-made smokey ketchup were excellent accompaniments. At $18, I find it a little pricey, but not to an unaffordable level. 

The only disappointment of the night came in the form of dessert. We decided to share a funnel cake ($7), expecting an elegant, refined version of the Wonderland staple. Unfortunately, the dough here was completely over-fried to an unappealing dark brown, with some parts being outright burned. Furthermore, there was a greasy, unpleasant aftertaste to the whole thing. In fact, I found this funnel cake even greasier than the Wonderland version.

The dessert disaster was such a pity since the rest of the meal was highly enjoyable. Nevertheless, I was extremely let down by the dessert and really wished that we had just gone somewhere else for ice cream instead!"}
{"text":"I was drawn to this place by the menu, it was different and I really wanted to try different foods being in a city which offers so many different food cultures. 
I wanted to try the chicken hearts and the bone marrow as these where items I have never come across on a menu.
I was really pleased with the chicken hearts but the bone marrow wasn't really for me, so I can't fairly criticise it. 
I was really impressed with the drinks choice and found they served my favourite beer hofbrau! 
When we got there it was full so we was offered a seat at the bar and was served by a knowledgeable and friendly cocktail waitress who mixed us up some really nice cocktails, I always drink an old fashioned as it's my favourite and she made it well.
I was impressed with our waiter, a helpful guy who had memorised a long specials menu. Once I told him I hadn't enjoyed the bone marrow he suggested I scrape out the marrow and use the bone to drink bourbon. A very unique way to end the night!"}
{"text":"Killing two birds with one stone here. My first time at Bestellen and my first Yelp review! Honestly? I'm more excited about Bestellen. Came here a few days ago after a coworker told me it was a meat lovers paradise. 

I was a little skeptical at first but decided to give this place a try. After walking in the front and seeing their dry aging room proudly displayed, i realized that my coworker was, if anything, understating the matter.Being Friday, the place was unsurprisingly busy so i found a seat at the modest bar and ordered a drink

Now, I'm pretty picky about A. my drinks and B. the person making them. The bartender this evening is named Alex and he's one of the better bartenders I've come across in Toronto (TTS exempted). He made great recommendations based on my palate and kept things moving with stimulating conversation. I noticed that they also do barrel aging here and asked if i could sample his current concoction. While not ready (according to Alex), the mixture was sweet, savoury, very well balanced and smooth. Can't wait to try it again in a few weeks.

After glancing over the menu and listening to Alex's sage advice, I decided on ordering the burger, cooked medium-rare. After waiting patiently and consuming my second whiskey sour, my meal arrives. My friends and I have begun doing a burger tour of Toronto so all the well known places have been covered (Drake, Harbord, Marben, etc). This burger destroyed them all. Rosy red interior, big beefy flavour complemented by the raclette and onions... I'm getting hungry just typing this.Dessert was a salted caramel and chocolate pudding which may seem rather plain by comparison, rounded off the mealy nicely.

Alex, you're an amazing bartender and I look forward to drinking more of your creations. Darren, thanks for the laughs (and the rescuing my sheepskin coat from the floor...). Great food, great drinks and great staff. 5 stars."}
