{"text":"Honestly not sure what to say.

Went there around 9 and walked out at 9:40. Very understaffed. 
Ordered the chicken tikka masala which tasted like Thai Curry. The green peppers in it were huge chunks.

The chicken tandoori was ok. Nothing spectacular. 

They need to renovate. Looks Very bland and uncared for.

I wouldn't recommend this place to anyone."}
{"text":"Finally I found a place that serves me food like you are supposed to feed a human. I have gone to almost all the restaurants in the area and they just take your money and give you left overs from weeks before. I went last night to give this place a try and I was very happy with the food. I ordered the biryani and kabab combo and the biryani tasted home made and fresh. I had to tell the person taking order to please make it like she would eat or feed another desk person because every time I go to  eat Indian/Pakistani food they think I'm white and they water down my flavours in the food so I'm left eating bland food. Please please please don't change the way you cook the food because I want this to be my go to place for yummy food."}
{"text":"Never been there. Called them  to make a phone order of veg thali . Receptionist didn't know which veggies I could get . Puts me on hold comes back in 2 mins and says sorry let me go ask tgan comes back after 5 mins. Instead of giving me options of veggies so i canpick she picks it for me. Tells me I can't substitute any veggies. In Veg thali u always get options of veggies. Not sure why they have this concept. They Lost a potential customer."}
{"text":"We got the meat platter, paneer, naan,and  chicken biryani. Food was amazing and the price point was relatively low. Customer service by the lady was great! The only downside is that it IS a hole in the wall joint and right now they are going through some renovation so the place doesn't look all that great."}
{"text":"The place has got a dark dungeon like facelift recently compared to the spacious welcoming atmosphere it had before. The effort to make it a dim-lighted fine dining atmosphere had horribly gone wrong. Today (Sep 2, 2017), my wife and I had the most 'rudest owner of a restaurant' experience. I cancelled the order and just walked out. Yep, never going here again and \"Taza Taste\" down Hunontario (Hunontario/Dundas) is better in customer care, great tasting food and cheaper.

When we walked in to BG, there was no one to greet. Had to wait a couple of minutes until someone noticed and came out. The person who was clearly not the host, took our take out order and dashed back in. Not knowing where to wait, we sat at a table waiting for our order. A few minutes later, a man comes from out side (pretty much acted as the owner) and asked us whether we were taking a table for two. When we said we ordered take out, in a very rude tone said \"then go sit there\" and pointed to a table at a corner. Next, he proceeded to meddle with his phone. My wife felt embarrassed and looked at me with such great discomfort to be there. We simply canceled the order and walked out.

Once upon a time, this restaurant did serve great food and the hostess named Jessie was consistently exemplary with her care for guests.

This message is to the owner of the restaurant: Service Excellence is not only about the service you are selling. It is also about the care you extend. You can mess up an order and that can be corrected but, hurt your patrons feelings and you can be rest assured that it is going to hurt your business. See, service is about the emotional connection you make with your customers, guests, passengers, or clients, however you may categorize them."}
{"text":"Tried this place yesterday for take out. Everything ordered tasted amazing. Definitely would order from here again. 

Ordered: chaat papdi, saag lamb, shahi paneer, chicken tikka masala, chicken biryani and garlic naan"}
{"text":"Great biryani and chicken dishes ...extremely delicious food. The staff is very friendly and I have tried so many eateries around but could not find any eatery as good as this one at affordable prices ."}
{"text":"Just got take out from this place! WOW! 
Ordered the Butter Chicken and Chicken Biryani with Garlic Naan! The food was made to order, hot, fresh and delicious! Portions are huge! Highly recommend their Butter Chicken!!!yum yum!"}
{"text":"Been at this place a few times. The food was good.But recently I was there for take out and was seated until the food was ready.At the time the place was empty.The owner walked in and asked us to stand up .He was very rude.So we cancelled our order and walked out .We are never going back there."}
{"text":"Best food I ever had in Canada.  If you are Nihari lover then you must try this place.   Best restaurant in Mississauga 

Keep it up Bhaijaanz Grill Restaurant"}
{"text":"I was here on the Valentine's Day.. weekday ! The taste was awesome.. we had ordered some chicken parathas and garlic naan.. and the chicken vindaloo gravy was mouth watering.. also the kebab rolls was great . Worth the money spent on each grain of food here !"}
{"text":"My bf and I went here on a whim, based on a few Yelp reviews.

When we first walked in, the restaurant was completely deserted. Which usually scares the crap out of me. The lone employee explained that their A/C had broken down for a few days and had literally JUST been repaired as we walked in. Phew.

We ordered from the basic looking menu, again, not quite sure what to expect. We apparently over ordered as we were unsure of portion sizes, so overcompensated by buying too much naan. But, since when is that a bad thing?

 Food came out amazingly fresh and made to order. We ordered the lamb korma, karhai chicken and channa masala, plus both regular and garlic naan. Oh man! The lamb korma was amazing! Hitting a nice balance between creamy and sour, with fork tender meat. I found the channa masala a little heavy for my liking, but was still very delicious.

That night, I texted everyone in my family to visit Bhaijaanz for delicious Indian food. You should go too!"}
{"text":"Bhaijaanz has great food and quick service. We went there for a Saturday night dinner and the place was empty! We ordered almost everything off the menu as we were a large group.

The group favourites were the Chapli kababs, garlic naan, butter chicken, lamb curry and the chicken biryani. We ordered some gajar halva which was great. Options for vegetarian are limited. 

The portions are small but the taste is amazing and VFM! Shall surely return back for more!"}
{"text":"New restaurant in town!
They have really good briyani and they will served you piping hot briyani. 
Butter chicken really nom...nom...!"}
