{"text":"Deffinetly my new favorite spot! Everything about this place deserves a 5 star rating. Customer service is great, the layout of the place is very spacious, open, not too over whelming, and last but not least the food is amazing! To those who love trying new things and is looking for something tasty and full of flavor, this is the place to try. The best part about it is that you get to choose what goes inside your own bowl and they have many options to choose from from the meats, vegetables, sauce, and toppings. I recommend the spicy pork bulgogi bowl with avocados, corn, kimchi, bean sprouts, broccoli, shiitake mushrooms, an egg on top (of course), seaweed, sesame seed/oil, and last but not least the sriracha mayo sauce. Perfect match made in heaven. Seriously though really give this place a try and I promise you, you will not regret it, matter fact you'll do yourself a favor."}
{"text":"This is the new hot thing. Step aside KBBQ & Korean Fried Chicken and all that BS. This establishment is like flamebroiler on crack except that would be less healthy so its more like flamebroiler on korean herbal medicine... if i could eat the purple hot stone bibimbap with spicy pork or the rice burger with beef bulgogi, not only would i be happy but incredibly healthy as well. Shout out to the owner mr   for being genuinely caring about the quality of food, presentation, and customer service"}
{"text":"Delicious and healthy. I ordered the beef with the sweet and spicy sauce and it was amazing. I know I'm going to be craving it All. The. Time."}
{"text":"Absolutely love this place! The food is delicious and the atmosphere us very relaxed and chill. I got the purple rice, which I highly recommend, and their kimchi is really good too!"}
{"text":"Are you kidding me? 6 veggies es of choice on a hot stone with purple rice? All the flavor in the world + healthy. Clean, gorgeous space. I could eat here every day!"}
{"text":"Stopped by for the first time today for dinner. Got the classic bowl with purple rice and beef bulgogi.   Had to get the fried egg topping of course.    Was really impressed! The kimchi was legit. Really tasty and the price was good too. I'll definitely be back."}
{"text":"As an avid fan of sushi/poke bowls, I was excited to hear about a new kind of bowl - the bibimbap bowl! It does not disappoint whatsoever. The service is amazing and the food is even better! Can't wait to come back here more often to try out more combinations."}
{"text":"We got this to go tonight. It was so good! The proteins are tender, we did spicy pork and beef. The veggies are crispy, the sauce is delicious, and obviously everything is better with a fried egg on top! We'll be back!"}
{"text":"I did not understand how fast service with bibimbop would taste and when I got there I was still leery, how it would all come together; but it was beyond delicious and exceeded my expectations.  Fast, friendly and helpful.  Don't forget to add the fried egg!!!"}
{"text":"Vegan friendly and really yummy. I've made my own bibimbap because it's such a great Korean dish in the past but it's time consuming. This place is a great place to stop and grab lunch or dinner in a very cute and casual environment. Spicy sweet sauce and original spicy sauces both taste great. Had the regular bowl last time while hubby tried the stone bowl which he said was great so will be trying that on my next visit. :)"}
{"text":"Being a vegatarian and my love of Korean food , I used to love going in.  Went in today and was so disappointed.   Not only did they switch from paper bowls to plastic .  (FYI , When you put hot food in plastic containers , the hot food melts the plastic , and whatever is in the plastic will go into your food ).  I do not want to eat plastic .  Untill they switch back , they have lost my business .  The owner responded and explained about the plastic  being microwave and hig eat safe .   Unfortunately from all the research I have done in 7 years  there is no heat safe plastic .  The plastic still goes into your food and I do not want that in my food .  I appreciate the response though.  Thank you."}
{"text":"Low key the place smells. Sometimes it doesn't sometimes it does. But the food is good. I recommended beef and original spice"}
{"text":"Just came back from Korea last month and we were craving some more Korean food. Really wanted to check out the rice patty burger but it's not available yet so I got a hot stone bowl with spicy pork ($12). The hot stone comes with a free miso soup. It's set up like a Subway or Chipotle and you choose what you'd like. Cute ambience and very clean and there are little cubby's that hold Korean books. The food was good and the hot stone made my rice perfectly crunchy on the bottom. I wouldn't say it was authentic but it was good. A little pricey though, 1 hot stone, 1 regular bowl and a water was $24 but we were stuffed afterwards."}
{"text":"Finally, a place where I can get my bibimbap to-go FAST.  I've been here twice so far & I love it! The veggies are fresh.  I've gotten the beef bulgogi both times so I have yet to try the other meats. The beef was very flavorful & easy to chew.  I've had it with the purple rice which is bomb. Luv me that purple rice!! I'd really like to try their stone pot so I'll have to go back sometime to see how that is.  The restaurant presence is clean, cute & have a cozy feeling to it.  Kpop playin' in the background.  Oohhh yeah to Kpop!!! lol. The staff was nice.  No problems.  So far, so good!!! I'll definitely return"}
{"text":"Amazing!   The hot bowl is the way to go. Do not hesitate to get the black rice- it's wonderful.  We traveled a half hour to get here and it was totally worth it. Fresh, healthy, delicious and fast.   Possibly the best meal we have had in Vegas. And last night we spent $200 at Mr Chow!  This is totally amazing food. You MUST try it."}
{"text":"I've only been once so far, but I enjoyed the food here.  I went with a couple friends from Korea, and they said the food here was some of the most authentic Korean style bibim food they had eaten outside of Korea.  The food was fresh, with decent prices, and I enjoyed the flavors.  I got the spicy sauce, which I didn't find very spicy.  Definitely a place to visit again."}
{"text":"I so badly wanted this to be a new go-to spot, but for the price for lunch I can't justify it. I got the pork bulgogi in the hot stone bowl. The food was great, veggies were fresh, and it was definitely sizzling hot! But with a bottled drink, my bowl, and a tip, it was a $17 lunch. This mama is on a budget sooo I'll have to look for another tasty Korean lunch joint. You can get the same meal in a regular bowl for $8 versus $11.95 though, so I may try that first before totally saying bye bye BIBIM!"}
{"text":"Stopped by for a quick, healthy lunch.  This place has great food!  You build your own healthy bowl.  I had the beef which was very tasty!  I am definitely coming back!"}
{"text":"This is an affordable and healthy option for those who want to try something new! The store is similarly setup like Chipotle or Cafe Rio, where the ingredients are laid out for the customers to choose what they want on top of their bowl of rice (white or purple). If you have to option, I would order the hot stone bowl because the rice on the bottom becomes crispy and adds a new element of excitement to each bite."}
{"text":"Love this place!! Bibimbap is one of my favorite foods and to have a place so close to home makes me ecstatic! The place itself is very clean, open and  overall pleasing. The place itself is similar to chipotle where you go down the line and pick your protein, toppings, and sauce. I got the tofu with veggies and sweet and spicy sauce. Overall very delicious and will be coming back!"}
{"text":"I've heard of this place from my friends so I had to go! It was really delicious, both the classic and hot stone bowl. The amount was much more than I expected. I can't wait to go back soon!"}
{"text":"Food is really good. And the employees are very friendly and helpful. Will definitely come back here"}
{"text":"Great concept in town!! The hot stone bowl was amazing. Try it with the purple rice, it is healthy and tastes wonderful. You also get to pick 6 veggies!!Appetizers are also very authentic and delicious. Staff are super friendly. Nice place! Will definitely go back again! You should check it out!!"}
{"text":"Between here and HUMMUS, Eastern Ave is killing the build-your-own game!  Bibim Kitchen is reasonably priced and very vegetarian friendly. This was my second time here and I have no idea why I haven't already added this to my regular rotation of quick dining spots.  Get the hot stone bowl... do it!!"}
{"text":"The Build-Your-Own meal trend continues to explode and this time its bimbibap at the #HOTandNEW Bibim Kitchen here in Henderson.   What's unique is this Korean DiY bimbimbap  has an option to serve your creation in a hot stone bowl.  You all should know the drill by now of BYO meals.. Pick this, then that, and so on, so not going to elaborate on it.   FYI - the purple rice..it's mix of brown, white and black rice..(turns deep purple when cooked)  -Hot stone bowl for additional $ it is the way to go. I didn't think spending $11 was that pricey. Compared to the prepped meal that costs the same ( at Fix8).. this place much better choice for healthy meal with protein.  When the staff was making my bowl, it looked like they were skimping on bulgogi and toppings but when I got my sizzling hot bowl, I was really impressed. So good! And even ratio of rice, protein and toppings.   -Service welcoming, friendly, the time I visited was just about 2 weeks new so still sparkling clean.   Location is in the former spot by Trader Joe's. The spot that used to be a pizza, then Mediterranean, then French, then Greek.. Korean cuisine's turn now."}
{"text":"I really love the concept of this place - you make your own bibimbap (mixed rice) & choose everything right in front of you in an assembly line. There was another place in Henderson called Korean BBQ & Rolls that made really good bibimbap but since that place closed down a long time ago I haven't had it since then so I'm glad this place opened up with bibimbap that is just as good. I appreciate how they also offer purple rice here instead of just white rice. I highly recommend getting their hot stone bowl (although it's a bit more pricier than their classic bowl) and try their beef bulgogi along with the original spicy sauce. Their vegetable & seafood pancakes are delicious as well. If you're looking for a quick eat but with quality too come here :)"}
{"text":"Best bibimbap place in Henderson! Fresh and delicious made to order ingredients.  so many options and wonderful staff."}
{"text":"The food is fabulous delicious. The flavors just pop in your mouth. I'm Vegan and I am happy to have another Vegan friendly restaurant in Henderson. I am in love with this place. Think Chipotle but Korean style. I haven't had Korean food in two years and I truly missed there flavors and now when my friends from Seattle come to visit we can break bread Korean style. There is something for everyone. Did I mention it's healthy so if your watching your diet this is your place."}
{"text":"A build your own bibimbap restaurant..how I've longed to find one in the area.  Ordered: Classic bowl with purple rice, spicy pork, assorted veggies, and topped with a fried egg, sesame seeds, sriracha mayo, & seaweed strips. $8.95 + $0.99-- A fantastic price for the portions & flavors.  Complimentary Infused water and hot corn tea are a nice touch when the spice kicks in.  Regrets: Should've ordered the hot stone bowl ($11.99) as I had dined in & my food quickly became cold with the addition of the chilled veggies. Hot stone bowl also comes with a serving of miso soup.  Seating: ample seating for couples...our group of 3 had to pull a chair up to a 2-seater as all the larger tables were occupied.  Cleanliness: we ate slightly after the lunchtime rush & found no clean tables to sit at. The floor area was sticky under our table and by the trash. Our chairs also needed to be wiped off (rice & sauce)."}
{"text":"Just went to this place for the first time this evening. LOVED IT! Can't wait to go back. Only wish it was closer to our house. Great value, large portions and everything tastes oh so very fresh. Get the hot stone bowl - this is the only way to go!"}
{"text":"I came here the week they opened and have been back a few times since. Now that they are up and running the service is smoother and the food is even better. There aren't many places that serve this dish in town, and the easy customization of the rice bowl is a plus.   The only way to go is with the hot stone bowl. I also think the dish goes from good to great when you add the egg.   Will continue to come back as long as the food remains this quality at this price point. $12 for a filling rice bowl is a steal."}
{"text":"Bibim Kitchen is one of the latest fast-casual spots to hit Henderson, and the healthy slant of the menu is much appreciated. Fans of Korean bibimbap will be happy to find the grab-and-go version available here, customizable with your choice of rice, protein, greens, toppings, and sauces. Those with specialized diets are easily accommodated with salmon and tofu offerings for pescatarians, vegetarians, and vegans. The space itself is comfortable and cute, with competent service.   I came with a friend and we opted for two Classic bowls- one salmon, one spicy pork, both with purple rice and a variety of toppings. Though the topping portions are inconsistent between staff, the overall portion sizes are quite generous and the flavors mix well together. Favorite toppings included the shiitake mushrooms and avocado. They only have a few sauces, but you can mix them for the right balance of spicy and sweet. For a $1 more you can opt for a hot stone bowl or add an egg on top!  Happy to have yet another healthy option to hit up after a workout at the Eastern LVAC. The only downside to this location is that they're closed on Sundays, so if you live across town you may have to plan ahead. Hoping they do well enough to expand to the west side, great concept!"}
{"text":"Such a great idea! If you haven't been here, you need to! Try it out and you won't be disappointed."}
{"text":"This place is legit!! Bibimbop was super delish!!! Being a Korean I get very picky when it comes to Korean food, but trust me, their bibimbop was great. I was actually very surprised. Keep it up!!"}
{"text":"I ordered to take out and it was delicious!  I want some more today and they don't open on Sunday. I really appreciate that they don't work on Sabbath's day!!!! Great restaurant, it's gonna be one of my regular spot in the future!"}
{"text":"yummy food and excellent service!!! i've been waiting for another restaurant around my work where i can get my lunch at and i'm so glad it's this   i will probably be coming here at least once a week because  its soooo good thank you!!!!"}
{"text":"Excellent bibimbap in a nice atmosphere. It's great to have some good Korean food on this side of town, BibimKitchen is a fantastic spot for lunch or dinner, affordable (splurge on the hot stone bowl if you're dining in, bibimbap is best that way), friendly, and oh so delicious. The ordering options are great! I'm an \"everything with an egg on top\" kind of guy, my better half is a \"plain rice with beef\" kinda gal, so we were both able to get exactly what we wanted with none of the hassle of asking to add this or leave that - you just work down the line and choose your toppings!  Quality was excellent and service is quick. Reminded me of when I lived in LA and got spoiled by the ease of acquiring excellent Korean food.   Free corn tea (mm mm mmmm) and strawberry water, with Korean TV programs on. Decore is contemporary and welcoming, kind of a homey feel without feeling like you're in someone's house. Friendly service!  Perfect rainy day food :)   We will be bibimBACK!"}
{"text":"Bibimbap, I love Korean food but the sound of all vegetables doesn't appeal to me. But the flavor definitely brings it all together especially because there is a scoop of protein too that packs a ton of flavor. I love it, especially because I don't like kimchi or a lot of pickled foods, but because we get to choose what we want. 6 different types?! It's a steal. If you like spicy, get the original spicy. Gochujang is to die for in this."}
{"text":"This is my favorite Bimbimap spot in Vegas. Why? Because it's healthy, affordable, located walking distance from my work, and the food here is tasty!  The interior decor is simple, yet very cute. There are books to read, ranging from how to speak Korean, KPop culture, Korean cook books, and even Korean slang. It's adorable, lol.   The staff are always kind and ready to help customers out.  The set-up is similar to assembly style/build-your-own spots. First, you pick whether you want a classic bowl or a hot stone bowl. You then order a base (white or purple rice). Select a protein (beef, chicken, spicy pork, organic tofu, salmon for an extra $1.50). Choose your veggies, and then top off your food with the final touches.   I get a classic bowl with purple rice, beef bulgogi, spinach, zucchini, fried egg, sesame oil, sesame seeds, and side sauces of sriracha mayo and teriyaki.   Will definitely be a regular at this place. I'm addicted to BIBIM Kitchen."}
{"text":"This place is awesome for getting quick and easy bimbimbaps without having to sit in a restaurant. Sadly I think their hot stone bimbimbaps are dine in only though which is the better version of the rice bowl. But the cold ones not bad either. They also offer sides. So the layout is pretty much the same as your subway/Chipotle/blaze Pizza style places. You start on one side and pick your proteins and vegetables and pay at the end. Must haves are the white radish, carrots, fried egg and sesame oil sesame seeds seaweed garnishes."}
{"text":"Amazing place to go to if you're ever feeling something on the lighter side. Super cute place to go to with friends and family. I enjoy how they play Korean tv shows on the TVs and play Kpop in the background.  If you're ever in the mood for bowls this is the place to go to."}
{"text":"Such a great little place! Tons of flavor in all of the ingredients. Today I tried the regular bowl instead of hot because I had less time, just as good. Love the purple rice."}
{"text":"Delicious Korean rice bowel on this side of town! You get so much food for a reasonable price. Definitely recommend to try"}
{"text":"Now, I will start by saying that I do not have much experience eating bibimbap except for this place and when I made it once at home so I can't speak for it's authenticity.  I will say that I enjoyed it and I really enjoyed the atmosphere although I wish a few things were explained to me.   I wish they would've told me the hot stone bowls were to partially warm the food since it is served essentially lukewarm.  I also wish they would've let me know about the side dishes and other apps they have besides the dumplings. That being said though my experience was very pleasant and the food was quite good.  I got a bowl with purple rice (how awesome is that?), chicken, and a myriad of veggies which included avocado (which wasn't extra!) and the original spicy sauce.  I quite enjoyed it but I just wish I would've paid a little more to get the hot stone bowl so my food would've been a bit warmer.  I also got the beef dumplings and to tell you the truth, I didn't really care for them.  They were way too oily and that came out in the taste.   The place itself is very cute, bright, open, has free fruit-infused waters and corn tea, and has K-Pop playing over the radio.  I would definitely go back.  Go ahead and try yourself some bibimbap regardless of how authentic it may or may not be."}
{"text":"Probably the best korean food on this side of town. It suffices if you are craving korean food and don't want to drive to Chinatown"}
{"text":"It's not the stuff that my mom use to cook but definitely worth a try. Korean food with the fastfood Twist. If your new to Korean food give it a try and if you like ,hit China Town and try an authentic spot."}
{"text":"This place is delicious. It's healthy and tasty a combination which is hard to find. Can most definitely please a range of eaters from vegan to meat eaters. I definitely recommend this place it will not disappoint."}
{"text":"We checked out Bibim Kitchen on a Friday evening. There were a few other customers, but not that many.   The decor of the place is nice and comfortable. The service is competent and friendly.  The food is really great and tasty. You pick and choose what you want in your bowl from a wide assortment of foods and sauces. Our bowls were unexpectedly quite delicious. I'd recommend getting the HOT STONE BOWL. It keeps your food hot and tasty for the whole time you're eating it!  This place offers quick really tasty and healthy-ish food at very reasonable prices. There's really no reason not to give this place a try.  Updated. Sorry, had to take a star away for not being open on Sunday."}
{"text":"Loved this cute little Korean spot that's assemble line fast service (Chipotle Mexican Grill style), this was the first Korean food style I experienced like this in Las Vegas. I came here with girlfriends on a Saturday brunch time, it wasn't too busy and that was nice because I didn't feel stuffed dining. The dining area, I loved - felt fresh, unique, modern.  There's different options in the menu, you can either do a hot bowl (for a couple dollars more than the basic bowl ) which I recommend, I didn't do it - my friend did and her food remained hot. I honestly feel like it gave her bowl that hearty, hot meal taste. I did the basic bowl, and it was good as well. You choose whatever protein, rice, veggies, toppings, and sauce ( which are house made ). Customer service was great! The cashier/order taker, very helpful!! The place was clean and they also carry high chairs for babies if any parents out there were wondering, and I also ordered a side of noodles for my son and it came out nice and hot. I'm honestly in love with this place. There are too many sushi burrito assemble line places, this is nice place to grab a quick bite of Korean flavor. It also felt healthy, so I felt like I wasn't cheating on my diet, and also location wise - it is near a Trader Joe's, so hellllllooooo double brownie points."}
{"text":"Good and quick!  If you like rice, ask for more.  Too much side items and not enough of base.  Will be back!"}
{"text":"SOO GOOD! The last time I had Korean food this good was in KoreaTown in NYC. I've been to Bibim Kitchen a couple times and the food quality is magnificent! The staff are very helpful with folks new to Korean like my friends I brought.   You REALLY need to try the purple rice, as other have recommended. It's a perfect combination of black and white rice. It's so tasty and cooked to perfection.   The spicy pork and beef are outta this world good! I haven't tried the other proteins.   They have a wonderful selection of high quality vegetables and you get to pick 6. Get the stone bowl and eat it. It's so nice and keeps your food super hot. I like the sesame oil and siracha mayo. The latter is spicy, so taste it before you mix it in.   Bibim Kitchen serves up the best bibimbap in the Valley IMHO. You should go now. :)"}
{"text":"This is my favorite lunch joint.  The classic bowl with purple rice, spicy pork, zucchini, mushrooms, sprouts, avocado, radish and kimchi with sweet and spicy sauce is amazing!!!!  I eat here at least 2 times a week."}
{"text":"So talking about taking classic Bibimbap Korean dish to not so much another level but a different approach. Bibimbap is one of my favorite Korean stable dishing on any Korean Menu not all you can eat style. It right there with japchae. When I heard all the buzz about the quick or more ready to eat style version peaked my interest. I was on the other side of town and was like perfect time knock off another bookmark. Yay me! LOL@@!!!  The menu if pretty straight forward very similar to any build your own bowl concept from poke style, or the many other seems trending building your own whatever. You start with the kind of bowl. I would HIGHLY recommend the Hot Stone Bowl cause if want authenticity there really is no other way. The only catch it for dine in only. Hello not like you want take hot bowl to go. LOL. Next step is choose base. I went with traditional white rice although the purple rice did intrigue me (not many places that use purple rice or my experience). The Proteins few choose from but went with Chicken. The Veggies LOT to choose from and if you want can just about pick all of them. I just went with three or four of the traditional ones. The next step is choose sauce again went with the tradition style. I really enjoyed \"The Original Spicy\". The last step toppings again traditional if no fried egg on top why bother. Really the egg yolk porn adds so much overall flavor combine with the sauce. Winnah all around. Warning the fried egg is extra charge but nothing that going kill you. .99 cents. If you do dine in with the Hot Stone Bowl comes with miso soup. It was good miso soup appetizer.   All the ingredients especially the vegetables looked fresh, all tasted fresh, not overcooked at all but on point, and the proteins same. The fried egg kind of weird that they would do some ahead of time. The egg yolk porn would be so much more true is made to order. The proteins in steam table totally understand part of the concept quick to go style Bibimbap. I had the chicken cooked perfect, moist, and got no complaints. I feel would add another element if cooked proteins to order. They have three different flavor waters that believe are free. I ordered soda so not sure. They looked super refreshing. The stamp card program is pretty cool. After certain number get free soda, free appetizer, and fill the card free bow. Different.  The restaurant not that big but for small place has some personality. The staff is friendly, explain all the steps being my first time, and made it great first time experience. Bibim Kitchen is place if looking for something on the go. Healthy choice with lot of options one that really never go in have the same thing twice. Great choice. One that if I lived in Henderson would stop by more often. If in the area would go back again."}
{"text":"Great atmosphere. Had lots of choices for toppings, sauces, meat, etc. the purple rice is good. I would definitely recommend the stone pot so the rice is a little crispy on the bottom! I would definitely go again."}
{"text":"This was a fine experience but I've had much better Bibim at other locations for the same price.  The table was dirty but they serve the food on trays so that wasn't such a big deal. I had the spicy pork and my wife had the beef, we both had the stone bowls which made the rice nice and crispy.  The do not have a soda machine and had a very limited selection of \"regular\" drink.   They are very careful not to give you too much of an ingredient but i did feel full when i got done"}
{"text":"Great spot when you're craving Korean food on the go. Meat is freshly cooked (they ran out of beef but I'm sure they'll adjust based on demand). Somewhat of a Chipotle style ordering system (pick your base/meat/veggies/etc.). I ordered a bowl and serving was on the generous side. Service was excellent. Will definitely be back."}
{"text":"Food is delicious, service was fast, even the hot stone bowl only took minutes.  IMO flavor is authentic, protein combinations great for post work out."}
{"text":"This healthy Korean bowl was extraordinary. The food was even better than the aesthetic. When I first tried BIBIM I didn't know what to expect, to be quite honest I was doubting it at first. Little did I know I was in for a surprise. If you're a first timer, I suggest you order the classic bowl; comes with more food. The hot bowl is actually smaller and doesn't hold as much food."}
{"text":"I'm so glad I found this place! I love the concept! I had the beef bulgogi in a hot stone bowl. It definitely stays hot!! The guys working when I went were really nice and gave us suggestions on toppings and sauces. The decor was clean and cute! Loved the crates they used. The bibimbap was really good too! The portion was kind of big for me but I don't eat much to begin with. Maybe they'll consider doing different bowl sizes in the future. Other than that, it's a good place for a quick meal!"}
{"text":"This place is amazing! I got a hot bowl and it was delicious! I also received a free hot soup with a purchase of the hot bowl, but you also have the option of making it a regular cold bowl. I've never had something like this before. It's like a make your bowl. You get to choose your own toppings. The food looked and tasted great. They have complementary infused water and tea. Our server Alodia was super nice and made our food look just like the picture. Brandon came around and picked up our food when we were done and was super helpful. Definitely will return here when on this side of town. I would even make the trip down here just eat. Loved it!"}
{"text":"I spent a semester abroad in South Korea and fell in love with this dish. I hadn't found a place in Las Vegas that can satisfy my Bibimbap craving until now. Make sure you go hot stone bowl and the fried egg is a must. Nothing better than mixing the egg, sauce, and veggies in with the rice and meat to make one of the more tasty dishes that exists.   The one thing that makes this place stand out is the fressness of the veggies. I went with brocolli, radish, carrots, spinach and bean sprouts. Everything was done perfectly.   Really wishing this new place well. Look forward to being a regular!"}
{"text":"This place was wonderful so happy we decided to try it.They need to open a location in Hawaii so I can have more LoL.So flavorful and fresh.And I was surprised when I wanted to buy water the cashier invited me to have some complimentary fruit infused water or tea.I love this place it was like a party in my mouth!!!!"}
{"text":"---*Vegan Survival Guide*---  - GET THE HOT BOWL! Even if you are not veg, just do it. The crispy rice nirvana that awaits you...uff, yum. It comes sizzling. It's a Korean Molcajete!!!!  - The purple rice. It's PURPLE, do you hate fun? Plus, it's all whole grain & sh-t.  - Obvi. get your tofu on. It's soft, if you are wondering.  - The KIMCHI is vegan (woohoo!), as well as all of the veggie topping dishes (you get to choose 6). I picked spinach, bean sprouts, kimchi, shiitake mushrooms, carrots, and radishes.  - Don't miss all of the toppings - sesame seeds, sesame oil & crispy seaweed.  - We picked the Sweet & Spicy sauce, because teriyaki is not Korean (WHY is this an option?!) & mayo is obvi. not vegan-friendly.  The etiquette is a little weird, so here is our experience to save you some awkward neck-rubbering to figure it  out: They give you a little order number placard, but they will bring you your hot bowl, even if you are outside. And when you are done, you can bring your tray in to the trash area or whatever.  I felt totally nourished afterwards, so this is a great place to feel satisfied, but not like you just sabotaged your diet/lifestyle. I thought it was on the expensive side, but the portions were pretty decent."}
{"text":"This place is really good.  I was referred here by an employee at Trader Joe's next door and I wasn't pleasantly surprised.  I love the Korean beef and the purple rice is really delicious.  It's a very simple process and the menu is easy to follow.  The family that owns It is very nice."}
{"text":"Tried this a couple months back and tried it again and love love love it. The portion is pretty huge, both dine in and takeout. My husband and I started living a healthy life style back in January 2017 and totally recommend this place. The people there are very welcoming and they take their time with you even when  it's super busy."}
{"text":"A chipotle-styled Bibimbap place!  I love it!    The friendly staff welcome you and help you decide what to order the moment you walk into this super cool, modern, food spot.    First you select your meat option, followed by toppings, sauces, and seasonings.   My spicy pork was plentiful and very appeasing to the appetite.  My wife was impressed by her beef bulgolgi dish.      The toppings were all fresh and satisfying.   Kim chee, bean sprouts, avocado, and carrots, were just a few of the plethora of options to choose from.   Sesame seeds, sesame oil, and a fried egg on top made the food even better!  We also ordered a side of japchae noodles for my daughters and it, too, was delicious.    Seriously, Chipotle watch out, if this ever decided to become a chain, it would spread like wildfire.    I'm already licking lips thinking about my next visit here."}
{"text":"First time to eat in Bibim Kitchen.Food  is so yummy  with good service.  Rate I will recommend this restaurant to my friends."}
{"text":"I had high expectations for this place first time time going was good saw this on unlokt on Instagram so I got the hot stone bowl and there meat is not good quality chicken or beef so that right there is a point against them its 2017 why not have white meat chicken they happen to overcharge me. I did go again to get a nice meal before my workout and I asked the worker if the veggies are warm they said yes so I got my regular bowl sit down take a bite and there ice cold so the guy comes up to me ask if there's a problem I told him yes there is you have hot rice your meats are hot but your veggies are ice cold he basically told me you have to get the hot stone bowl which is almost $3. Difference just to have warm veggies that's ridiculous why would you want to eat cold veggies with hot food very disturbing especially because I'm a foodie and really take pride in my food, also when there giving the veggies they are the smallest portions also a red flag I'm telling you they could make this place a homerun but they are nowhere near it and need to figure it out end of story I will not be going back there and I dont think they stay for more than a year."}
{"text":"First off, this place is great. Only reason I didn't give it a 5 star is because I wished they had a bit more topping options. The decor is clean and nice, and the service is great. There was a young guy helping me, I think he was the owner, nevertheless, I respect this guys hustle and trying to make this business work. The food was great, fresh, tasty. I got the sauce that looks like the korean spicy sauce, and that was the game changer. If you like korean bibimbap, give this place a try. It will definitely hit the spot"}
{"text":"Very friendly and helpful staff. I've never had bibimbap but will definitely have this more often. It's a healthy alternative to the usual fast food places. You get to choose the ingredients for your bowl and everything is fresh and delicious. I got the purple rice with beef, sesame oil and the sweet chili sauce. Definitely returning soon."}
{"text":"It was very fast and delicious . My boyfriend had the spicy beef and I had the tofu for protein. The purple rice was very filling as well. The hot stone bowl cooked the vegetables. Definitely recommend the place and we will be back :)"}
{"text":"Very healthy and tasty Korean food!!! It's fast too! You can definitely get full for a late dinner without felling greasy."}
{"text":"Came here the other night and I'm quite impressed with everything. I kinda wish they didn't charge an extra $3 for the hot stone bowl though. But other than that, this place is definitely my new go-to spot."}
{"text":"Stumbled upon this place after going to Trader Joe's. Love this concept. Cute decor. Food was good but can easily be recreated at home. Staff was super friendly and because we went after their soft opening, they explained the whole concept to us and gave us free sides. Will definitely come back when I'm around the area and is looking for something, quick and healthy."}
{"text":"I think this might be my new favorite pick-it-yourself-bowl place.  I was a little concerned some of the items I picked wouldn't meld together but they totally did once the bowl and rice was hot.  Every bite was delicious... and in fact, I finished my mom's bowl too.  Ha ha!   First you pick the type of bowl you want... then your rice (white or purple... I went with purple of course)...then your protein. I ordered the chicken... because I like to play it safe the first time out.  It wasn't dry and was chopped so you didn't have to worry about big chunks in your bowl.  Then you can pick up to 6 different veg... woohoo!  Pack in the nutrients!  And then you pick your toppings... like add a fried egg for a $1 or sesame seeds or seaweed strips... I went with the seaweed strips because I like seaweed.  Next time I'm totally adding that fried egg... I think that would take the bowl up to the umami level.  And then you pick your sauce which they give you on the side which I love because I don't like having a ton of sauce on my food, and was a little iffy on what it tasted like anyways.  But it was all good .... it was like a sriracha sauce so I was happy camper because that stuff makes everything yummy.  Well... that and bacon!  They have a couple of flavored waters that are self-serve.  Last night they had Lemon water and Strawberry water. They put fresh slices of strawberries in one dispenser with water and another had fresh cut lemons with water. I mixed them.... they weren't super heavy flavor... very light and it was so refreshing.  I need to start doing this at home.  The inside is simple... nothing fancy.  I'm not a fan of the chairs but whatever.  They are metal and really cold on your tush when it's 45 degrees outside.  Totally putting this place on the rotation for places for a bowl of yum."}
{"text":"Interesting concept, seems like these kind of places are popping out everywhere but with different kind of cuisines.   The restaurant itself is very cute, they have nice free fruit infused waters and hot corn tea, just a nice touch i guess, most places dont even care to give free water.   The classic bowl was about $8.95, and the stone bowl was about i think few dollars more, you get more food in a stone bowl!   The food itself was fresh, but like my friends and i both said it is not a place we would think about and crave for it, because it is just simple and not any unique flavors, overall the food quality was good, fresh and fulfilling!   In picture is the beef bowl with kimchi and corn and spinach"}
{"text":"At $12 for a hot stone and a side of Miso soup, this restaurant is decently priced and very clean. Not too many menu choices, but they have the important stuff."}
{"text":"Not enough meat n veggies are keep in a steam table overlooking,  veggies look like mushy vegetables. Save ur cash..."}
{"text":"this place is awesome! deliciously fresh array of all my favorite bibimbap veggies, sauces, and rice!! they have the old school dolsot (stone bowl) style of bibimbap as well! genuinely one of my favorite fast grab an go style places in town!!   you pick your rice style with bowl, protein choice (get the beef!!), 6 fresh veggies to top it, & sauce option! you can garnish with seaweed & egg too! great price point for what you get and honestly the best bibimbap in las vegas! i definitely will be back for some great bowls in the future!   my best friends shared a dolsot bowl with similar fixings and my boyfriend tried the chicken with the purple rice! everything was delicious and service was pretty prompt. boys behind counter were nice, but they don't speak korean much. there is complimentary water in the spot and outdoor seating too if you want to bring your pup!   definitely give this spot a try if you love korean style food modernized in suburbia!"}
{"text":"Been seeing Bibimbap everywhere lately and wanted to give it a try while on vacation. They have a Subway-style setup allowing you to put your bowl together picking which protein and toppings you would like. We saw other people's orders and they seemed huge, so Hubby and I decided to split one of the Stone Bowl versions ($11).  It takes a few minutes then as they fire the Bowl on the stove and you are served a piping hot bowl of goodness. We got a paper plate and extra fork to divvy up our lunch and it was more than enough food for both of us. The fried egg on top really brought all the flavors together. Bonus points for the 2 containers of complimentary flavored water on the front counter!"}
{"text":"We have been to this joint a couple of times and have not been disappointed.  I will keep it short.  Tasty and healthy food.  Great service by a helpful staff.  Clean dinning area.  We like the purple rice and the variety of veggies available.  We will keep coming back."}
{"text":"It's unique in that there aren't many other places like this around Henderson. Other asian restaurants are mostly sushi and korean bbq. The food here has various vegetables and meat that you can choose from. You can make the bowl to fit your taste :)"}
{"text":"So excited to find a place that serves Dolsot (hot stone pot) Bimbimbap that is vegetarian friendly and very reasonably priced. I got the hot stone bowl with organic tofu, purple rice, sesame oil, carrot, broccoli, bean sprout, zucchini, spinach, kimchi, and fried egg with the sweet and spicy gochujang.   Everyone was very friendly and helpful. I wish there were more locations! So delicious, will definitely be back."}
{"text":"Every time my family comes here we enjoy the food! Especially the hot stone bowl! We'll be back for sure"}
{"text":"I didn't order anything because I had eaten earlier.  My daughter had been wanting to try this lil place out so I took her.  First, the atmosphere is awesome.  I love the vibe we got when we walked in.  Good music playing, Korean TV shows on the television.  The seating area is cute!  There are \"learn Korean\" books and flash cards, which is a fun touch.    My daughter is enjoying her bowl as I type this.  She ordered a bowl with:  white rice, organic tofu, bean sprouts, zucchini, lettuce, carrots, kim chee, and broccoli.  She topped it off with sesame seeds, sesame oil, and teriyaki sauce.  She also ordered some vegetable dumplings which she likes as well.  She says it's all delicious and more filling than it looks.  They don't skimp on anything.    The young girl that took our order was really sweet and helpful.  We will be going back soon."}
{"text":"Omg! What a cute spot. I got a classic bowl with beef and all my fave veggies. I did the siracha mayo sauce because I'm sort of a wimp and can't handle too much spicy, by I enjoyed so much! Loved the little water pitchers with different fruits and corn tea (complimentary). Definitely would recommend. Oh and a great price!"}
{"text":"Really interesting and unique idea that I hope catches on across Vegas.  Really nice ingredients that are fresh.  The concept is very generous, offering 6 veggies and unlimited sauces.  Rice and protein come with every meal and an egg is just a small $1 or so upcharge.  The stone pot is definitely worth it if eating in, and comes with miso soup (though pretty plain and mediocre; no tofu. just soup).  My meal, the spicy pork bibimbap, cam full with broccoli, bean sprout, corn, mushroom, zucchini, and spinach.  Healthy options but full of flavor.  The gochujang sauce was very good, as was the sesame sauce addition, adding a nice saucy flavor fusion.  For $14, it might be steep for every meal, but affordable if you opt out of the fried egg and stone pit.  Bibim Kitchen is top notch in the area and I really hope they expand westward. Free water and tea and quick service; in and out in 45 minutes or less.  This is my new favorite fas casual cuisine."}
{"text":"Tasty chipotle-style Korean bowl.  First time there, they had a super chemically bathroom smell that kept me away for a while.  It's now gone - easier to focus on the food  Easy to load up with veg and protein - love the spicy (original) sauce.  Price is comparable to chipotle/cafe Rio style salad bowls, around $10 ea."}
{"text":"I first walked in and found the place very cozy. Had an Anaheim District type of vibe (if you have ever been there; you'd know what i mean). The menu was small, short and simple. Which is great. The less, the more. It's easier for people who are indecisive like me to decide. I have tried the classic bowl once with purple rice, beef and pretty much everything on it. I was amazed at how fresh everything was. But the one that got me dancing in my seat as I was eating was the purple rice! It's apparently really healthy. And usually for me, healthy food aren't as appetizing as junk food! But this was different. I could come back here often. I mean after all, I am a big fan of bibimbap!  For my second visit, I got the stone pot. Which is better than the classic bowl. I prefer my bibimbap hot than cold! Add some sizzling egg on top and you just sent yourself to heaven. Make sure you add the sesame oil. Gives it more flavor!"}
{"text":"Honestly I never had Bibimbap before and this was bomb omg. Shout out to Brandon too for guiding me through it, excellent customer service and excellent food"}
{"text":"Not bad, good value and flavors, like a chipotle version, build your own bowl, more like 3.5 stars but not enough for a 4, been a few times, feels healthy and good portion size/value"}
{"text":"This place is so cute! It's the Korean version of Chipotle (but replace burritos with rice bun burgers and tacos with Japchae). They serve the classic Korean comfort food with quality veggies which are super fresh and good. I definitely recommend the hot bowl bibimbap with an egg! KOREAN PERSON APPROVED! My only suggestion is for them to add some sort of Korean soup like soybean stew or radish soup () for the full Korean bibimbap experience."}
{"text":"Love this place. Lots of good options. 1st time today, but definitely coming back for more. I recommend the hot stone bowl. So worth it."}
{"text":"The food here was great. The price was very reasonable and the service was good. I tried the hot stone bowl with bulgogi meat and the original spicy sauce which was hot and fresh. We ordered a veggie pancake as well, the order was forgotten but the server was nice enough to refund the order and still gave us the order. Great place to try."}
{"text":"Great concept for the infamous Korean bibimbap. They have a lot of options to create a healthy bowl. I got the hot stone because I love when the rice gets crispy from the heat, yummmm. It's super clean and cute inside and the service was great! It's fast since everything is made before hand, unless you opt for the hot stone (a few more minutes to get it hot).   Definitely should be on your go to list if you are in the Henderson area."}
{"text":"SO GOOD!  Definitely order it with the hot stone and with the egg on top. I normally don't even like eggs, but it mixes so well with the ingredients and the sauce (we tried original and the sweet and spicy).  It doesn't taste too \"egg-y\" at all. The purple rice was also really good. I love that there is a variety of sauces to try.  Everything was very fresh and super clean. The whole staff was friendly.  I loved the flavored water too!"}
{"text":"Service was amazing. I have celiacs and was having trouble ordering, after I got to the table with my meal, the chef realized there was a potential contaminant in my order.  Someone came and told me and remade my meal for me right away. That was the most amazing thing I've experienced in my years of being Gluten free this was a remarkable and much appreciated act. I will be telling everyone I know and going back.  Also, the food was amazing!!"}
{"text":"Super Fresh, really healthy, generous portions and quickly and friendly service. Love this place! So helpful to be able to grab a super fresh healthy meal on the go, I'm a regular now!"}
{"text":"Korean craving satisfied! I love bibimbap and was super excited to know there was a place that opened in Henderson. The menu is very limited, serving only bibimbap bowls and some side dishes.   I tried the regular bowl with white rice, tofu, and the original spicy sauce. the portion was bigger than I thought and all of the veggies were on point. I also got the fried add to top it off, after all that's a main ingredient in bibimbap! The original spicy sauce is comparable to any Korean hot sauce, a thick paste with a kick. Mix together all the veggies with the rice, sauce and egg... mmmmm it was so good.   We got there about an hour before they closed and they were already out of chap jae and Korean pancake so we got the pot stickers. It was made to order so we knew it was fresh.   All the staff were friendly and welcoming, and the inside was neat and clean with a little bit of Korean pop going on. Definitely worth trying out if you're away from Chinatown."}
{"text":"Korean food, normal service, normal food.  I ordered the bibim bop because of the name.  I was not disappointed.  I could be going to too many Korean resturants, because my baseline expectations are no longer reasonable, which is why I still give them 5 stars to help them out."}
{"text":"This place is so so good!! You can build your own bowl there! Food is super authentic and delicious!! Their sauce is bomb- I highly recommended Original spicy and bean paste sauce. Portion is good and actually with a lot of toppings. Definitely come back in the future!!"}
{"text":"This place is great! I like being able to choose which ingredients go until my bowl. I highly recommend you check out Bibim Kitchen."}
{"text":"Had their Hot bowl.  So fresh, authentic and portion was pretty good.  I was full, yet still unable To finish my bowl. Would totally come back again and again!"}
{"text":"Love this place! Their food is delicious. My third time here and so far, no disappointment . Definitely recommend everyone to try them out."}
{"text":"This place definitely deserves the high praise given in other reviews. The food is extremely fresh, healthy, and delicious. It is worth paying extra for the hot stone bowl and miso soup. Beef and spicy pork were both great. We will be back!"}
{"text":"Food is not very fresh. Everything is pre-prepared and scooped to order. The sauces and utensils shouldn't be given in plastic if we're dining in. Not sure why they don't have a non-plastic bowl option classic for dine-in customers like you get with the hot stone bowl. Organic tofu is the only vegan option."}
{"text":"\"Nobody\" by the Wonder Girls is one of my favorite Kpop songs...EVER!  I always associated this happy song with good times. https://youtu.be/qFjP-OJ7Bh4 I've always associated bibimbap with a sit down restaurant experience...now I can take it home in under 10 minutes flat...??? say whaaat....! =)  Service:  The girl who helped walk me through the process was so friendly and broke down how to put my classic bowl together.  I'm glad I took her suggestion on the Purple rice as now I'm a big fan of it. The cashier got me checked out quickly.  My classic bowl to go total transaction time was under 8 minutes and that's with me being indecisive, fantastic!  Food:  I'm not a bibimbap expert but I do understand that the freshness of the ingredients are key in ensuring a great bowl.  The ingredients here is just as good as any sit down bibimbap restaurant I've been to. The 6 step process is simple: 1) Pick a Classic Bowl, Hot Stone Bowl or Rice Burger 2) Choose a base/Rice...I went with the bomb Purple Rice (*Mix of Brown, Black & White Rice) This as my first time trying it and it definitely won't be my last. 3) Choose protein.  I went with the Spicy Pork Bulgogi was tasty and spicy but not too spicy for the spicy sensitive.   4) Choose Veggies: My favorite part!  You get to choose up to 6 different veggies or double up on our favorites.  I doubled on the Spinach, and the (eat) shiittake mushrooms. Bean Sprouts, and corn (tracer rounds) finished up the veggies in this bowl. 5) Choose sauce: The Original spicy for me..I like spicy sauce and personalities.. 6) Toppings Time: I went with seaweed, sesame oil and paid the extra .99 for the baby fried egg. The bowl is big and the portions were generous.  I could have just eaten half and saved the other half for breakfast or lunch but I was feeling extra fattie tonight.  Great bibimbap!  Value: Classic Bowl is $8.95, Hot Stone Bowl is $11.95 and the Rice Burger is $5.95.  Amazing value for the quality of the ingredients, portions and convenience.  Ambiance: Casual sit down area if you want to hang out.  I'm on the go go go so I'll be taking it out most of the time.  Restaurant quality bibimbap, excellent value, friendly efficient customer service that gets me out the door quickly makes this an easy 5 stars.  A build your own bibimbap is a great concept and I'm looking forward to checking out the Hot Stone Bowl, Rice Burger and the appetizers.  It's places like this that spoil the Vegas Valley foodies when you get great value, convenience and concept in one place.  This is a place to try if you're bibimbap rookie like me or a seasoned pro..enjoy yourself! =)"}
{"text":"Amazing food, great ambiance, fantastic service. I love this place! And so does my boyfriend.   So if you've never had Korean bibimbap... it's a bowl mixed with rice, meat, veggies, delicious seasoning and sauces served very hot. Here you choose the type of rice, protein, veggies, toppings, and mix in sauces or seasonings. Personally, I like to add fried eggs on mine.   I got mine with bulgogi (the best seasoned beef), purple rice, tons of veggies (like corn, spinach, broccoli, spices, and fried egg all served in a hot stone bowl. My boyfriend got something similar and both got yogurt fruit drinks and our total was around $30. We used the Groupon for 15% cash back and got about $6 back.   They serve complimentary waters, tea, and coffee here"}
{"text":"If you've watched the ceaseless popularity of raw fish bowls and wanted something a little more meaty and cooked, then look no further.  Bibim Kitchen is one of the newer entrants to the rapidly diversifying Henderson portion of Eastern Avenue. They're one of several businesses adapting the business model of the poke bowl fad but applying something from a different cuisine. In this case, you're getting customizable bibimbap, a Korean rice dish with rice, meat, greens, and sauce. There are also \"rice burgers\" and various appetizers on the menu, but those weren't what drew me in for a quick dinner.  The restaurant is located right next to Crepe Shack & Waffles and in the same plaza as a Trader Joe's. Parking wasn't bad in this large lot, and the brightly lit interior was welcoming (and quite suitable for photos). The menu explains itself, but as I've done before, I'll lay it out here:  1) Choose a bowl (or burger). A classic bowl ($8.95) can be taken to-go while a hot stone bowl ($11.95) is only available as a dine-in option - not that you'd want to carry something scorching hot with you anyway, right? The burger sounds interesting at $5.95 as a light lunch or something, so perhaps I'll revisit that on a future trip.  2) White or purple rice. White rice is frankly really boring, so I went for that mix of brown, black, and white rice and loved it.  3) Protein. You can get beef, chicken, or spicy pork - presumably all marinated - as well as tofu or salmon (+$1.50). I had to have my beef.  4) Veggies. Limit of 6 for a bowl! There are 11 choices, and I kept with simple with carrot, bean sprouts, kimchi, shiitake... and a couple nontraditional items in corn and avocado. Yeah, I'm weird, sue me. Call it a \"California\" bibimbap if you want, or ignore that and pick from the other choices: lettuce, zucchini, radish, spinach, broccoli.  5) Sauce. I went for original spicy, which seems to be a traditional gochujang and has two flame symbols next to it for some reason. Turns out that I was wise not to use the full portion (I like that, by the way - helps you keep it even). The other options are sweet 'n' spicy, sriracha mayo, bean paste, and teriyaki, but some of them sound quite obviously borrowed from other cultures.  6) Toppings. Bit of an issue for me here: it's $0.99 for a fried egg?! That always gets served with traditional bibimbap, and as consumer of eggs, I know it doesn't cost nearly that much. You might as well add a dollar to the price of the bowls and call it a day. Oh, and you can get sesame seed, sesame oil, and shredded nori too.  If you order the stone bowl, your food will get taken to the stove for some quick heating before it's placed into the hot stone bowl. The idea is to recreate that crispy rice on the stone edges, but it's not that successful. Also, there's a complimentary soup that didn't particularly delight me. It's like the miso soup but without the miso. If you ask me whether the $3 premium is really worth it, I'd say no.  Now if you order the classic bowl, you can dive in right away - or after you follow tableside instructions to pour the sauce in and mix thoroughly. Lack of mixing is one thing that I hate about some poke bowl places, and although I'd rather that they do the mixing for me, I guess the spiciness control and having sufficient space in my bowl works well enough.  Finally, the verdict on the food: every bite was delicious. The rice had character, the beef was tender, and the veggies were crunchy (when applicable - mushrooms were tender, thank you very much). The traditional sauce was a great touch too, making it sweet and spicy. The food wasn't as piping hot as it was  in a stone bowl, but it was warm enough throughout.  They seem to provide complimentary \"infused\" waters and hot tea, but I wasn't enamored with the flavor of any of the offerings. I've had delicious complimentary citrusy waters - sadly, at a now-closed business - as well as stronger complimentary teas. These seemed almost like an afterthought.  I'll definitely return to Bibim Kitchen when I'm craving something fun and tasty. I'm glad that we're getting so many new options for fast, quick food like this. Definitely check this out if you're in the area and aren't married to seafood or vegan dining."}
{"text":"If you're craving Korean bibimbap, great spot to try in Henderson.   Staff is friendly.   Restaurant is clean.   Service is fast.  Typical side entrees to choose from.   Located next to Crepe Shack."}
{"text":"DIY bibimbap. What a concept. I've been craving bibimbap and searching for places to try. Bibim Kitchen fit the bill. I was sold on the hot stone bowl option as well as that DIY aspect. So for my customized meal I chose the hot stone bowl with purple rice, bulgogi beef, carrots, zucchini, bean sprouts, shitaki mushrooms, kimchi and corn. I skipped the egg. Partly because I don't always care for eggs and partly because of the extra charge. I did top off my bowl with seaweed strips. Mix in a little of the original spicy sauce and off we go.  I was confused at first. The hot stone bowl was not hot. Turns out they heat it after its filled. They place it directly on a stove top burner then bring the bowl to your table while its still sizzling. This is when the sauce goes on and gets mixed in. The menu even tells you what to do. I did have some bites which were not mixed but mixing it all together does elevate the dish. And if I am not mistaken the name means mixed rice. So for the love of all that is foodie, mix it!  Every component of my bibimbap was equally important. The carrots and the zucchini are a cool and refreshing contrast to the hot rice and spicy sauce. The kimchi gives that pungent slap in the face. The corn is sweet and crisp. The beef gives you that protein to round it all out. You don't get a whole lot of any one item (aside from the rice) but all of it combined makes for a big bowl of yum.  Service is friendly and the flavors are strong. But I am troubled by having to pay $3 extra for a stone bowl over a plastic bowl when I got the same amount of food. I guess they have to cover the cost of the bowls. If I go back I think I'd just stick with the regular bowl. The point of the stone bowl is to make the rice crispy which didn't happen today. I'd rather save the $3 dollars. Other than that, this place is a good option for the next time I get a bibimbap craving."}
{"text":"I've been waiting for a place like this to open. This place needs fountain drinks and it would be perfect. Also need seaweed. Service was okay and fast. I just live across town and happened to be in the area."}
{"text":"Bimbimbop is definitely one of my favorite Korean food. They definitely do it justice. The purple rice is delicious and you would have never guess that it's healthy! The flavors are on point and familiar.   The staff is friendly and kind. Although I do have one complain, what's up with not giving extra spinach? Asked for an extra scoop of spinach and they won't give it! We even offered to pay extra and still got shot down. Why?"}
{"text":"Finally, \"Chipotle style\" Asian food that isn't poke.  With that being said, sure you can eat here, but I see most people taking out. It also smells a little weird... which is really my only complaint.  Choose your base (white rice or purple) then choose your protein (spicy pork isn't very spicy, but I enjoyed the ground-ish beef). You get 6 sides (avocado, carrots, zucchini, shiitake, spinach, kimchi, etc.) and toppings (sesame seeds, sesame seeds, seaweed- unlimited). The sauces- 3/5 of them are spicy. The 1 hot pepper sign was described to me as a 2/10, but boy was it spicy. Extra charge for fried egg.  They also have some Korean drinks.  There's a cute Japanese crepe shop next door and Trader Joes as well. Sounds like a perfect place to spend Friday night to me :)"}
{"text":"Food is great when the place is open but it is very unreliable and pretty much keeps it's own hours regardless of what's shown on the door."}
{"text":"Was looking forward to trying this place out but left disappointed. I did the hot stone bowl for $12 which was dine in only. It's 99 cents extra if you want a fried egg added. Normally, I eat bibimbap where they crack the raw egg and mix it but here it's already fried. You pick out the ingredients which I thought was a cool concept and then they have someone warm it up for you. The bowl was probably medium size. Smaller size than the traditional bibimbap bowls. My food came out and it was average. I would say I wish there was more flavor or something to bring it more together. I think it's a bit pricey for the stone bowl because I can go to a traditional Korean place and get it for $10-11 where they don't charge you extra for an egg. I will say that my experience was okay/average. I like the concept but the flavor and taste was lacking for me. I rather go to a Korean restaurant and order bibimbap because it taste better for me. At least I got to experience it."}
{"text":"I enjoyed every selection step of my bi bim bowl. Choice of rice (purple was tasty, just sayin), protein, veggies, toppings and sauce. Clean and sleek interior of restaurant.  Enjoyed the help yourself fruit flavored water and hot tea. I also liked the environmentally friendly serving dishes."}
{"text":"I would call this place the Korean chipotle. Many restaurants call their dishes healthy when it's really not. Luckily, i found a place that IS. They offer what's called a purple rice which is a mix between brown and white. But i'm pretty sure there's other stuff in there. The purple rice was a bit hard for my taste. You're allowed one meat and 6 sides. I got 1/2 tofu and 1/2 beef and 3 sides but asked they double it. If you add an egg, it's an extra $1.00. I came here around 7pm two hours before they closed and they were out of chicken and guacamole. They also do not offer fountain drinks, but i liked how they had fresh water on the side for anybody that didn't want to purchase a bottle drink."}
{"text":"A great new place to get a healthy, customized meal quickly. An inexpensive option too. The inside of the restaurant is very clean with a minimalist style. Simple, but comfortable.   Here's how it works. First you pick from three meal options. The choices are a cold bowl, a hot bowl, or rice burger. Second you'll choose the rice and the third step is choosing a protein. Fourth is the best part which is choosing six vegetables. The final steps are choosing a sauce and any add on like a fried egg. At the end the cold bowls are ready to eat after stirring in the sauce. The hot stone bowls get placed on the oven and brought to the table when ready. There are sodas and bottled teas for purchase at the end of the line. The restaurant also offers complimentary water, infused waters, and hot tea. They offer to go cups so these can be taken with to go orders too.   I ordered a Hot Stone Bowl with Beef Bulgolgi and really enjoyed it. The purple rice was tasty, the meat had a nice flavor, and the vegetables tasted fresh. I really liked the sweet and spicy sauce flavor. The bowl provided a nice serving for the price. My husband had a regular bowl that he enjoyed, but he would get the hot stone bowl next time."}
{"text":"Today's challenge was to ask a random Las Vegas resident their last place they ate.  The person I asked said BIBIM KITCHEN!!!! So off I went to Henderson! Long story short this place was great."}
{"text":"Randomly decided to try this out. Loved it. They give so much good quality ingredients in a $10 bowl. Most bowl places charge extra for a decent amount of avocado or give a small amount but they gave me a huge scoop. I wasn't expecting the shiitake mushrooms to be so good. The beef was surprisingly flavorful. All of this with the nice decor and atmosphere made this a great place I highly recommend and will definitely come back to."}
{"text":"Omg their hot bowls are amazing. Never thought vegetables would be this good but this spot makes me like to eat my veggies  great portion the bowl was big enough for 2.  Really great place to eat"}
{"text":"Found this place on yelp and I absolutely love it! Brandon was so nice and alodia made my hot stone bowl so pretty and delicious! Hot stone bowl with spicy pork and salmon"}
{"text":"I've been growing tired of my usual vegan spots and this place was a nice change. The food was soooooo good, and really filling! The interior was really cute too. Definitely coming back here again, especially since they have a stamp card :) only downside for me personally was the non friendly Apple Pay POS, but I'm not too picky on that."}
{"text":"Great new neighborhood restaurant next to Trader Joe's.  Simple menu, healthy options and super tasty .  We'll definitely be back"}
{"text":"Awesome find! Great addition to our Henderson community! Staff was friendly and helpful. Place is clean with a cute design. The food did not disappoint. Love how you can customize your bowl with a meat, 6 veggies and a sauce! I highly recommend the \"Traditional\" hot stone bowl which is heated so the rice and ingredients are warm and crunchy! Price is just right! Will definitely be coming back many more times!"}
{"text":"Best time at lunch that i thik i've ever had. I think it better than korean town. My husband highly recommended it."}
{"text":"The lovely little lady working behind the counter is always so kind & friendly. I love the freshness of their food & how customizable the bowl is. I always feel great after finishing my meal. Doesn't give me the impending feeling of regret & bloated-ness. Definitely converted me into a regular."}
{"text":"Ordered a hotstone bowl with a choice of rice, protein and 6 sides to add to it and a choice of sauce. Added an fried egg on top for $0.99 extra. It was delivered steaming hot to the table on a wooden trivet ready to be mixed. Everything i had was awesome. And i give it 4 stars just for the fact they are just getting started as a business. I thought it could use a little more meat for the portion size. Will definitely be back."}
{"text":"This place is really good. I haven't eaten all day, and I ordered the classic bowl, which made me full. Worth every penny! Customer service was great, the place was very clean, and the ambience is nice. I would definitely come again, explore the menu a little bit more and try out some different combinations! 5 stars"}
{"text":"A traditional Korean comfort dish! It's build-your-own style, with a casual and fun atmosphere. Great for lunch and dinner, and also for those who prefer healthier options."}
{"text":"So I'm not an expert on bibimbap by any means. I've honestly only had it once or twice before, but Bibim Kitchen has changed my mind on the popular Korean dish.   First off, if you want to get the full experience, the hot stone bowl is a must have, both for the aesthetics, but also for the practicality. It keeps your food hot for a long, long time. The latter is a double edged sword since it takes a while before it cools down enough for regular human consumption. If you can take the heat, then I applaud you for your immunity to pain.   But it's the taste of all the ingredients that tops everything else. Once you mix everything in your bowl, every bite is a taste of perfection. I'm still blown away on how good this is. The flavors are not complex to any degree, but simplicity triumphs this time around.   I just really, really wish the hot stone bowl wasn't so pricey compared to the regular bowl, but it won't deter me from getting it again."}
{"text":"This place was so delicious! I highly recommend having the stone bowl so your food is super popping hot. The service is friendly and the place is cute and clean. I'll definitely be going back for this again."}
{"text":"Nice clean restaurant. Big portions. I only wish that the vegetables were served hot, since they aren't, they put cold veggies (brocolli, bean sprouts, zucchini, spinach, etc) on warm meat and rice which ends up making everything cold to eat. Flavor was good though. I think for the future I would get take out and then microwave it at home before eating so everything was hot."}
{"text":"I love Korean food, well let's put it this way, I love any type of Asian food. In Hawaii my wife and I ate at so many Korean spots but nothing like BIBIM Kitchen. I love how you can pick your own veggies and type of meat that goes into your BIBIM bap. When you go to other Korean restaurants you get stuck with whatever veggies they give and sometimes it's not the ones I like to eat.  The atmosphere when coming here is welcoming and makes you excited for the food, not to mention the prices are great. $8.95 for a classic bowl and $11.95 for the hot stone bowl (dine in only). I love eating here just to get the hot stone, it sizzles and keeps the food real hot just how I like to eat my BIBIM bap."}
{"text":"Build your own Bibimbap. I love it!   Reading other reviews and looking at the pictures made me hungry, I knew I had to try it for myself.   The restaurant is very clean. It's got a very simplistic feeling.   All the ingredients looked so fresh and yummy as I made my way through, building my bowl. I got purple rice (which I highly recommend), organic tofu, corn, bean sprouts, kimchi, daikon, shiitake, broccoli, and an egg on top.   The bowl was amazing. The ingredients were flavorful and fresh. I especially liked the bean sprouts and the kimchi.   I know that I will definitely be coming back to try other ingredients and combinations."}
{"text":"Went there for a quick lunch. It's delicious. It's different and not the cheapest but definitely worth trying. It's not heavy and lots of vegetables to choose from. The spicy pork and the purple rice were yummy! Their dumplings were really good too."}
{"text":"Oh my gosh these bowls are so good! I literally talk about this business as a must try to anyone that will listen. You have your choices of different Bulgogi meats and the meat is tender and flavorful. I'm picky about my Bulgogi meat because you can tell when cheaper meats are used that are grainy in texture but not this place! So good! The purple rice is a nice treat with so many different topping to add into your bowl. The bowl may look small but my boyfriend and I are always full. I can never finish my bowl so I have left overs that I can enjoy later and I always do.   Do yourself a favor and check this place out. They're already looking into a second location due to the popularity of their bowls."}
{"text":"I love this place! I was craving for some bibimbap and came across this place, and I'm so glad I gave it a try! You get A LOT of food for what you're paying for, and I love how healthy it is."}
{"text":"I love the bean paste & the food is good but wouldn't come regularly, too much for too little."}
{"text":"More like Bi-BombASF-Kitchen. Okay, so the service is amazing. The staff is attentive and very kind-everyone was smiling and inviting ! Now the food, sooooo yummy. It's legit a Chipotle for BiBimBop. My suggestion, ALWAYS get the stone pot and the purple rice, you won't regret it !!!!!"}
{"text":"Love this place! My kids love it too. I like the convenience and freshness. I always have to get the stone bowl. The experience isn't the same without it. The staff is always friendly. I just wish they offered kids portion/prices. I usually do steam rice with chicken, corn and a cooked egg for my son but I think $11 is a bit much for just those items. I would frequent more often if my bill wasn't easily $40 - $50 for a family of 4. We go when we can."}
{"text":"Well it really is the Chipotle of Korean bibimbap. The concept is fantastic and in the end it is a great product. The atmosphere is pretty cool with the Kpop playing in the background and Korean shows playing on TV. The prices are pretty reasonable for the decent portion sizes.   I had the regular bowl with the spicy pork and purple rice. I really like the flavor mixed with the original sauce. The original sauce is like a 6 in spicy level. I also like the idea that they offer complimentary tea and infused water with lemon and oranges.   I enjoyed my meal and will be back to try the hot stone bowls next time."}
{"text":"Make sure to get the hot stone bowl! The beef and veggies were portioned well and tasted delicious! Will be back!"}
{"text":"I finally made it here.  I wanted to try this restaurant since it opened,, however, never made it till now.  This is a really cool place, and note I am reviewing this as a fast food restaurant, not a sit down, relax, order restaurant!  As a fast food place, the staff seem to be mostly younger staff who work behind a food bar.  Here, you are working your way through a line of food starting with the classic or hot stone bowl, then your carbs, protein, veggies, topping and sauce.  1. The carbs - loved the Purple Rice choice beside the white rice.  I never had purple rice before and it is very tasty and I loved the texture.  2.  The proteins - Beef, chicken, no more salmon, tofu, pork, it has all the proteins you want and even though I thought they did not give enough, the scoop they provided was quite filling overall.  3.  The toppings - I rather enjoyed all the toppings and it was cooked in a way that I find is great when eating Bibimbap.  I don't like the veggies to get in the way of consuming my Bibimbap like a hoover.  So, the veggies were the perfect texture, size and easy to eat. Plenty of veggies and I think the sliced shitakes were the bomb.  4.  The sauces - they have plenty of sauces from teriyaki to original and of course, to me, it had to be the original.  Bibimbap is meant to be eaten with gochuchang. And, me likey two helpings of this sauce.  5. Hooverability - I do have to admit, that like fried rice, when it comes to Bibimbap, I tend to eat this super fast with a fork in one hand scooping portions to my spoon in a conveyor like setting.  Not sure why I do that but man, this was definitely hooverable! Yes, I was like a vacuum cleaner.  Overall, well designed, clean and well lit restaurant.  It is a fast food place, the bibimbap was cool, not hot, not cold.  If I want it hot, and with a bunch of banchan and all, I would go to Jun's still.  The pricing at Jun's is comparable to this place and of course, it the bibimbap at Jun's is the best.  I would come back again, for sure!  By the way, took my daughter here who is vegan and she enjoyed it, also had our younger cousin as well and she is very young so we had the basic rice, chicken with teriyaki sauce so she was able to enjoy it as well.  Here they have food for all kinds of taste!  GK says, check it out."}
{"text":"Sad it took me a month to come check it out but glad that I finally did!  Just as the name suggests, this place is \"healthy\" in the sense of controlled portions. People will definitely complain \"it's not enough food\" but for the people are used to \"just right\" to where it kept my stomach full until the next meal, it was perfect.  My \"base\" I went for their \"purple rice\" which consists of a black rice and white rice blend.   My toppings included kimchi, squash, bean sprouts, spicy pork bulgogi for my protein and topped by a fried egg . They just barely opened for lunch time but they didn't have avocado available. Bummer. My dressing was bean paste. To finish it all off, I had it on the traditional hot bowl which took a few minutes to come out because they literally heat it up over the stove!  Once brought out, it was completely devoured because it was just that GREAT! Everything was washed down with a melon soda that I wished came in a larger can but oh well.  Definitely another great \"build your owl bowl\" concept, one that I can jump on board for!"}
{"text":"Chipotle style Korean bowls. Pretty cool concept.  Got a tofu bowl. It was okay, nothing amazing. Added fried egg for additional $1. Picked 6 veggies. I do want to try the vegetable pancake and veggie dumplings they have as additional items when I come back. I thought it was a bit pricey for tofu with egg $11 bowl."}
{"text":"If the word \"healthy\" generally scares you into thinking the food won't be tasty, fear not! This place serves delicious authentic Korean dishes. The Classic Bowl is served at room temperature, which is refreshing for a daytime meal, especially if it's hot outside. The Hot Stone bowl is also great. We did not try the rice burger. For the bowls, you choose your rice, your protein, your veggies (up to 6), your sauce and toppings such as a fried egg, sesame seed, sesame oil, or seaweed. All toppings were fresh and delicious. They also have side dishes such as japchae, seafood or veggie pancake, and fried dumplings. It is awesome to finally have a Korean restaurant that serves something other than BBQ, since the Korean cuisine has so much more to offer!"}
{"text":"Soo good id eat it twice and then multiply that by my entire life's worth of cravings!   I was never really into Korean cuisine, I know right? Not even Korean bbq! The flavors just aren't my jam! But my heart had this place bookmarked for months! My number one rule, try all things you bookmark on yelp!   I reviewed the photos and was hesitant, but because I was pressed for time, I figured either try it or spend another 15 minutes on yelp looking for something more appetizing!   Let me say, I'm glad I didn't pass this place up! TWAS DELICIOUS! And I'm all for options, this place allowed me to create my own bowl! And I'm always extra excited when things are customizable! The food was amazing! Definitely tasted clean! I didn't feel pudgy or fat after enjoying my hot stone bowl so for all the reasons above, it's definitely one of my new go to's for a delicious satisfying rice bowl!"}
{"text":"This is my first time having a healthy style Korean BBQ bowl. It's so delicious, especially their choice of sauces. They have the option to get a hot stone bowl, which keeps your food super hot the entire time (almost too hot) but it's still nice. Also you have to keep mixing your food or else it'll get stuck to the bottom. And Don't touch the bowl!!!!  I like the number of sides you can get and their selection of protein. Although, when you get a hot bowl and ask for tofu, they tell you it will be fried but it's not-- it's still steamed. Still yummy though.   I would go here all the time if I could. My favorite sauces are the siracha mayo + sweet and spicy. The staff is friendly and helpful as well."}
{"text":"I've  never had a koren rice bowl before, and I'm sure I'm ruined from having one from anywhere else but here. The meat was great, the sweet and spicy sauce had just the right amount of heat to it. I highly recommend giving this place a try, a new favorite lunch place for the foreseeable future"}
{"text":"I went here a few days back and was impressed with the food. Just like Chipotle, Sweet Poke, Blaze pizza or a Subway, you get to build your own food. There was a decent amount of options and the ingredients seemed fresh with lots of flavor. Ordering was fairly simple for the keen eye but if you weren't familiar with the food, you could have trouble deciding what to order.   I had a classic bowl with purple rice, beef, broccoli, kimchi, spicy cucumber, radish, sprouts, fried egg and there original spicy sauce.   Overall pretty good."}
{"text":"I love Korean food and the build your own bowl concept. I've tried both the rice bowls and stone pot and prefer the stone pot when dining in.  The stone pot is served hot! The proteins are all tasty and marinated well. I love picking your own sides for the bowl. You get six choices. My go to: kimchi (double), mushrooms, spinach, and bean sprouts, and spicy cucumber. Other options include: broccoli, corn, and carrots.  I've tried a few sauces and favor the house sauce (spicy) and the bean paste (non-spicy). It has the right amount of spice for me. Other sauce option: teriyaki and spicy mayo.  I always ask for extra sesame oil too and finish it off with a fried egg on top. They have some side dishes like jap chae (noodles), mango (dumplings), and spicy rice cake. I like that they offer infused waters."}
{"text":"I'm a big fan of bibim bap and this one is pretty solid. Unique dining experience for sure as you get to pick and choose from a lot of different mix ins. Service is very friendly and the food is pretty healthy. Wasn't the best bibim bap bowl of all time but pretty good.  4 stars"}
{"text":"I can tell you right now that Bibim Kitchen is going to be one of my new go-to spots. I LOVE Bibimbap!  This is essentially the Korean version of Chipotle or all the new poke bowl spots that have been opening up. But this is better because it's bibimbap! Like I said, I love the dish so the fact that this place opened and I can customize what I get is so awesome.  You've got to eat in and get a stone bowl. It is more expensive, but it's the way to go. Your rice will get crunchy and your food will stay hot (not warm, but actually hot). I got the typical options: stone bowl with white rice, beef, spinach x2, carrots, shiitake mushrooms, bean sprouts, radish, seaweed, sesame oil, sesame seeds, an egg on top (with an upcharge), and the original sauce. It tastes pretty darn authentic for being prepared in a non-traditional manner. It almost makes you wonder why this hasn't been a thing for longer and why it's not everywhere yet.  My boyfriend got almost the same thing but added salmon (with an additional charge of course). It was good, but it's not like a filet on top. It's more like salmon salad (tuna salad, but salmon). I would only get it if you really like fish or really can't eat the other stuff.  Btw, for getting stone bowls, you also get a free side of soup! It's just broth with green onions, but it was pretty good.  On top of that, they have different types of infused waters and hot barley tea for free, just as it should be in all Korean restaurants. But if you want other drinks, they do have a refrigerator full of other drinks as well.  The decorations are super cute! They have a wall with a bunch of crates stacked as if they're little cubbies, and each one has a unique piece of decoration in it. They also have smaller stacks of gray painted crates between the counter and some of the tables that create a barrier but double as book shelves for miscellaneous Korea-related things, like Korean cook books, etc.  It's on the expensive end for bibimbap, but it's definitely a place to check out! All the hipsters can take hipster photos with the crate wall and eat good food at the same time."}
{"text":"Tried this out for lunch and it was such a disappointment.  No lunch specials and a classic bowl with rice and 6 vegetable items is $8.95 plus tax.  My husband tried the sizzling hot bowl and was still hungry because most of it was rice, which he didn't eat.  The only difference with the classic and hot bowl is that they warm up the food for you, charging you $3 extra.  They filled the bowl with so much rice as compared with the vegetables.  They don't even mix the teriyaki (or sauce of your choosing) in during the warm-up.  My husband said too, that the teriyaki sauce was watered down.  Both entrees were plain.  Oh, and I even bought the potato noodles appetizer and boy was that bland.  $7 for a leftover portion appetizer.  Lastly, not trying to be rude at all but they must have been having a sewage problem because the first thing we smelled when we stepped in was sewer.  I wanted this place to work since there aren't too many good Asian restaurants along the south end of Eastern but it was not worth it for us.  I really hope they can do better and survive."}
{"text":"Good, healthy, and fast! Their items are cooked to perfection and leaves a person satisfied."}
{"text":"Bibim had the friendliest staff. They answer all my questions and have great recommendations. I got the chicken purple rice hot bowl with sweet and spicy and teriyaki sauce which were both really good together. I'm going to try it with their bean paste next time. Also add the egg on top because it makes everything better. It's definitely my  alternative to poke bowls now."}
{"text":"Great place, kind workers, healthy food, my kind of food. Love Korean food. My advice is to try the classic bowl before getting the hot pot."}
{"text":"First time here. The food was good. Portion was good. I got the stone bowl and an egg. I do not think the stone bowl is worth the extra $ 3. The egg certainly is not a .99 add on. Most places that do this type of food provide the egg. Value for the money is not good for the stone bowl and egg. If money means nothing, go for it. Staff was very friendly and welcoming. I will go back but, no stone bowl next time. I see little need.   Please note that the cold vegetables are put on top of very hot protein and rice underneath so when mixing, some may be luke warm and not hot or cold."}
{"text":"I love bibimbap. It's my favorite Korean dish....and it always tastes slightly different everywhere, which is why it's so fun to get. I figured going to a place that literally names itself after the dish would be a great idea (or really disappointing if I ended up not liking it). Welp, this place rocks. I can easily say that this is as good, if not better, than many other Korean places in town when it comes to bibimbap. Super fresh, great flavor, loves the choice of sauces and toppings to do it in your own style. The kpop playing the whole time while eating is pretty fun too, if that's your thing. Service was fantastic too. My one and only critique is that the stone pot, while delicious, just doesn't \"fry\" up the rice to that level where it's all crispy, where it gets that special flavor. I let it sit for quite a while, and some of it juuuust got there, but the majority was just piping hot. Which is great. Just not crispy. So while that's disappointing, it by far is still an amazing place to go, for selection alone. Highly recommend, will definitely go back again and again (if they had stamp cards available when I went, even moreso, but they're out right now). =( Anyways, recommended!"}
{"text":"I'm all for supporting local businesses, really wanted to love this place.  I wish I could give it a 3.5 star rating, but I'll round up due to the service and cleanliness of the restaurant    Located in the traderjoe shopping centers on eastern and coronado, bi bim kitchen is a great concept.  Pick your own toppings etc for your Korean rice bowl.    You have 2 choices of rice.  White or purple.  I chose purple.   Protein.  Spicy pork Toppings.  Aka Korean style veggies 6 of your choice and you can add an egg for $.99.     Honestly, bi him bap isn't complete without the egg.   So definitely get an egg  The food tasted good, except that everything was ice cold.  The rice was cold, veggies, meat, and egg.  For reference.  We were the first ones in the door when they opened and they already had 3 fried eggs, done and sitting on a sheet pan.   I don't know why they would premake over easy eggs.  It takes a minute on the stove.    Bi him bap is supposed to be hot.  The rice is normally piping hot, so is the meat and egg.  The veggies can be room temp or cold.  But the rice has def have to be hot.     My whole meal was so cold.  I wish I could have put it in the microwave.  I hope that they start keeping everything warm so it's a better tasting meal.    I'll try one more time since I love the concept and the food.  Just please.  Serve everything hot!"}
{"text":"Honestly super happy that a bibimbap place has opened up near my house. This restaurant is super yummy, fresh, and fast! If I could I'd go every other week"}
{"text":"Good food and good service, the portion size was just right. Will definitely be back.   1 star off for the beverage selection/situation (I dislike picking my drink out of  a refrigerator) and not removing the IKEA stickers from the wall decor."}
{"text":"The food is very delicious and the service is excellent, first day opening, hope they will add the spicy tofu soup in the future, I'll be back to this restaurant again"}
{"text":"This is a great place for having a classic and fast Korean food. There arelimited choices about the food, but sometimes too many  choices are not a good thing, so these choices are good enough.  Food are all delicious. The staff are welcoming and all friendly. The environment is also very clean and cute!!! Had a good time at here."}
{"text":"First time having bibimbap in Vegas. I tried the purple rice and spicy pork bulgogi with original spicy sauce in a hot stone bowl. Was very tasty. Definitely recommend. The hot corn tea was also very good."}
{"text":"My boyfriend and I always go to this spot for our bibimbap fix. We were in South Korea for a few years, so we've been dying for a place like this to open. You can get either the hot stone or classic bowl. You choose purple or white rice, protein, six toppings, and sauces. I get tofu or chicken. He gets beef. You have options, so I typically get zucchini, spinach, mushrooms, carrots, and extra bean sprouts for that crunch. I also get seaweed strips, sesame seeds, and a fried egg on top which come with it. Definitely worth a try when you don't want a typical salad! They have free lemon water and hot corn tea too. They also hand out stamp cards. I highly recommend this place."}
{"text":"Came here last Thursday. Friendly staff.  The food I got was pretty good. I wish I got the stone bowl so that my food was warm, but it was still really tasty. My boyfriend got the stone bowl. If you do pay the extra $3 for the stone bowl, I suggest leaving your food for a while to let the rice crisp. You don't get to keep the bowl though.  They give you a lot of food for a place like this and I really love the spicy mayo sauce! The place has a rustic hipster aesthetic which is really cute!"}
{"text":"Think Chipotle meets Bibimbap ! You get to choose between a hot stone pot and a regular bowl which is then filled with rice, noodles, veggies, meat, and sauces to your liking. I always get the hot stone pot because the burnt rice at the bottom of any pot is usually my favorite thing to eat in the world.   There's complimentary lemon flavored water and hot corn tea! The Korean TV shows were also very fun to watch while enjoying my delicious meal. Check it out!"}
{"text":"Wait:  Came in at 8:08pm on a Friday. Four other parties were there, so no wait.  Service: Knew the servers/cashiers from high school! Super friendly and nice- no bias.   Food: Basically a Korean Subway but for bibimbap. The board tells you how to order and gives your options. Limit of 6 veggies and you can get all of the toppings. Lots of vegan options! :) And yummy. Again, I inhaled my food in 2 minutes.  Overall: Super fast and tastes good. Worth trying! Would come again."}
{"text":"Great food and Great staff... the setting is your typical \"cafe\" look with lots of places to sit... (probably 30 people - comfortably).  the food was really really good and the portion was more than fair.. price is manageable.. next time ill try the stone bowl to get the full experience..   i had to wait for a little while because there was only one person serving.. and people who never had bibimbap before would ask questions like.. whats this.. whats that.. etc.. but i didn't mind the wait as i seen the girl serving was making an effort to accommodate the Bibim-beginners and working hard and as fast as she can..   be back for sure.."}
{"text":"Took 40 minutes to order, you guys need to hire more people. The one who's preppin the food, works as a cashier too!!!! 15 people in line, seriously!!!!!!! So annoying!!! Good food but bad service!!!!!!!!!!"}
{"text":"Happy to see Korean food gaining in popularity, I just hope this fresh bowl concept is a genuine thing and not just a fad or trend. He good here is pretty good! The purple rice was tasty as a base and the bibim toppings were delicious as well. I went with the spicy pork and was not disappointed. I Topped it off with a their sweet and spicy gochujang sauce and a fried sunny side up egg. Very good. My only complaint was that the photo shows the fried egg but turned out it was actually a $.99 upgrade which knocks down some of the value for me. Overall though it was good and I'll be back. Except maybe I'll fry my own egg when I get home. :)"}
{"text":"Good, healthy, and good-size portions.  The purple rice was not heavy and the beef/bulgogi was lean without a shred of fast.  This will be one of my go-to dinner places."}
{"text":"Not much food for the money, radishes are flavorless, minimal meat. Here just isn't much flavor at all. Also the kimchi is not very good, very soft and soggy--no crunch"}
{"text":"This place is great. Food was amazing. My mom had the tofu and I had the beef. I have some co-workers that get this a lot for lunch and it always smells so good. I had to try it. I'm so glad we did. It's going to be one of my new go to places!"}
{"text":"I was very glad that I came across Bibim when I was yelping around deciding what to eat for dinner. I like the concept of build your own bibimbap. In addition, the prices are very reasonable and the service was excellent! As for the food, the portions may look decent however very filling. The sauces mos def have a kick in them but in a good way. I also enjoy the purple rice! They also offer two free appetizers during their soft opening, which are also very delicious snacks. I will be def coming back!"}
{"text":"This place is a hidden gem! The service was great; the employees were very helpful and friendly. I got a bowl with beef, white rice, zucchini, bean sprouts, corn, avocado, kimchi, and mushrooms topped with spicy sriracha sauce. So yummy! Also, the decor is super cute and quirky, not to mention everything is extremely clean and organized. I think I found my new favorite lunch spot!"}
{"text":"This is my new favorite, quick eat restaurant. It is poke bowl/Chipotle style ordering. First you pick hot stone bowl or classic (served in a to-go bowl). Then choose white or purple (mix of black, brown, and white rice - delicious & my choice ALWAYS!) Next you choose your protein, then 6 veggies. I love the spinach, bean sprouts, shiitake mushrooms, radish, kim chee and avocado. You can also add a fried egg (perfectly sunny side up!) for an extra charge. Finally, you choose a sauce. My favorites are the sriracha mayo and the sweet and spicy. Don't forget to add the sesame oil, sesame seeds and a dash of seaweed!  If you are vegan or vegetarian, this is a great option. The rice is made with water and none of the veggies are made with animal products. Just choose tofu for your protein.   Bonus: they offer amazing strawberry water and lemon water along with regular water and corn tea (haven't tried that yet) for no additional charge if you dine in. AND they have a frequent buyer card.   If you are allergic to soy or sesame oil/seeds, you may want to inquire first before going.   You won't regret this choice! I've been here 5 times in 2 weeks."}
{"text":"It's new year ..new eating habit..! you can start here @Bibim Kitchen ..food is fresh tastes great and healthy for you..a whole lot better than fried fast foods!!  Check it out and let's eat wiser.!! plus the staff is  service with a smile :)"}
{"text":"All servers are good looking guys n girls!!!!! And all with good service!!!! Come if u want to have a good meal with a wonderful dining environment!!!!"}
{"text":"This is my first time here and I am HUGE on bibimbap ever since my sister made it. We've also tried it at a little mom & pop shop by the other Trader Joe's on the other side of town.. which that place has since closed  so when my boyfriend this place I just knew I had to try it..   Nice & clean, friendly staff.   You get to choose from white or purple rice. I chose white this time. You get to pick 6 toppings & you can either add fried eggs for $1 extra. I went with the original sauce because that's how I like mine. But they have different sauces.    In my opinion it tasted a bit bland (easy fix) add salt. But that's just me. As far as drinks we weren't able to get any from the menu because the guy said it was seasonal and also because they had just opened. Not much choices on the drinks with the fridge they had there so we just got Coke. But we will definitely come back."}
{"text":"Stopped for lunch after shopping next door at Trader Joe's. Everything was great and everybody was friendly. Food was.good as well as sauces."}
{"text":"Love this place. Good size potion for a great price. You can either order the Classic Bowl for $8.99 or Hot Stone Bowl for $10.99. Hot Stone Bowl is dine in only and you get a small cup of soup. You basically go down the line and choose your rice, protein, veggies, sauces, and toppings. I wish it was closer to work but I don't mind the travel."}
{"text":"As I'm walking towards the restaurant, I was greeted by a waft of cigarette smoke from employees that were on break.  I'm not too familiar with the smoking law in Nevada, but it's annoying that it's done close enough to the front entrance.  Bibim is a draw with the new trend of having an open kitchen concept and the allure of being able to pick toppings to build a bowl. Everything is served in portion size with ice cream scoops.  The ordering process starts with 2 scoops of white or purple rice, 1 scoop of bulgogi marinated protein, then the rest of the 6 vegetables equally and carefully placed around the bowl with a tong.  The classic bowl is just under $10 and is worth the extra $3 for the stone pot?  I didn't try it this time around, because the stone pot can only be dine-in for obvious reasons.      The meal is full of sodium and the chances of using the original spicy sauce was nearly impossible.  The amount of protein to vegetables and carbs is not ideal, as I hoped for more protein in this dish.  My take, I came, I ate and I think it's just okay.  Maybe opting for the authentic stone pot and adding the fried egg will make a difference."}
{"text":"I really am digging this new hot spot! It's conveniently located on Eastern, right in the complex where Trader Joe's, Home store and etc. the parking isn't bad, there's plenty of it, even if you have to park far, it's not an inconvenience. I actually parked by the restaurant and ate first then went grocery store shopping at Trader Joe's (Cookie Butter Time)  Upon arriving I noticed the delicious aroma the parking was filled with, and officially knew Dinner was going to be fantastic. As I entered I was immediately greeted by the staff and asked if I needed any help understanding the menu, the worker even said, this is a Korean food version of Chipotle. I thought nice, easy and good! I can customize my bowl the way I want and not have to eat veggies I have no desire to eat. I carefully examined the menu and immediately knew I wanted the stone bowl ( keeps the food hot)  My next step was picking out my choose of protein, I opted for the Bulgogi Beef, and next was my rice- I love white rice, but don't love the starch, so I opted for the purple rice a combo of white,brown,black rice- and it was amazing (loved the flavor and texture)  Next onto my veggies- so many to choose from, and you get up to six choices- so I opted for bean sprouts,zucchini,spinach,carrots, and mushroom, Next was my sauce (soybean sauce) and to top it off I got the egg!   So after paying I was told to sit down and they will serve me my bowl. I waited a few mins and they brought out my hot bowl and instructed me to be carful when handling the bowl.   I am definitely coming back again, I need to try this bowl again with Salmon, Chicken and Tofu, and all the different sauces they have available!  This is definitely a win,win,win for people who love rice bowl style food!  I don't know about you but, I love rice and I can eat it with anything or even by itself"}
{"text":"Concept is great, execution was okay. Babe wanted to try out the place because it's brand new. It's a chipotle style Korean BBQ type of thing... who wouldn't want to get a bowl of that delicious bulgolgi? Especially if it's pretty healthy with a bunch of vegetable options! The price is pretty good for the portion you get but it's one star away from a solid four just because my food wasn't that hot. When I eat Korean BBQ it's usually straight off the grill and so it would taste much better than the meat in my bowl which was pretty cold after two bites. Maybe we should have gotten the hot pot option but we wanted to try out the regular bowl  first which seems to be the more popular and affordable thing. It wasn't bad as far as taste and look wise, just wishing the temperature of the food was hotter. I don't like eating cold meat or rice. We'll most likely be back though because babe likes it, it's more of a healthier option."}
{"text":"We are lucky to have so many dining on options on Eastern Avenue and Bibim definitely ranks up at the top.  Free miso soup? Free fruit infused water? Free tea? I'm in!   Described as a \"healthy Korean bowl\" restaurant, Bibim is located on Eastern avenue and Coronado in the Traders Joes shopping center. They are open Mon-Sat from 12:00-8:00 with ample parking in front.   It's very similar to other bowl places where your pick you base, protein, toppings and sauce. One unique option here is the traditional stone bowl. For an extra $3 it comes with free miso soup and is warmed up on the stove before they serve it to you. I got it my first visit to try it, but will stick with the regular bowl on future visits. All of the ingredients looked fresh and delicious.   My bowl consisted of beef bulgogi (a little dry and bland for my taste), purple rice, zucchini, shiitake mushrooms, carrots, bean sprouts and broccoli. I added seaweed strips and sesame seeds and chose the teriyaki sauce. I haven't added the fried egg yet but definitely will on my next visit. When the bowl arrived I added the sauce and mixed it up as recommended. Some of the food was super hot and some was luke warm.   Overall I really like this place. Fresh, healthy ingredients and very friendly service. I will be back to experiment with different proteins and toppings. A great choice for lunch or dinner."}
{"text":"What an awesome concept. Build your own bibim bap bowl.  First, choose the style of bowl you would like, classic or hot stone. Second, you get a choice of rice, either white or purple (mix of various grains). Third, choose your protein (beef, chicken, spicy pork, tofu or salmon) Fourth, choose your veggies, up to four. Fifth, choose your sauce (original spicy, sweet and spicy, sriracha mayo, teriyaki or bean paste). Lastly, top it off with sesame oil, fried egg, sesame seed or seaweed strip.  And that's it! If you chose the hot stone then there is a little wait while they heat the bowl up. If you got classic then you'll get your bowl right away. Infused water is complimentary along with some sort of corn tea.  The only suggestion for improvement would be to heat the stone bowl more. This way the rice gets cooked to crispy which is why you would get the stone bowl. Other than that, a great find for healthy and quick food that is reasonably priced. A must eat for me when in Vegas."}
