{"text":"This is one of my favorite Places to eat. Food is always consistent an their family  always greets me with a warm welcome. I always get the Italian sub (HOT)one of the best in Charlotte, a must try! 
I can't speak enough about the family that owns Big Apple that are passionate about what they do and work very hard at it. Give this place a try you won't regret it."}
{"text":"Really good. Waiting at the DMV? Treat yourself to this place. I had the buffalo chicken pita and potato salad... it was good!!! Not fried."}
{"text":"Delicious Rueben. It was packed with corned beef. Also the pecan pie was very good. Loved how fast I got my food."}
{"text":"Was in the mood for a Gyro!!!! Haven't had one since I lived in NY......so I went to the closest place I could imagine and found........wait for it........wait for it.......BIG APPLE DELI!  Located right next to the infamous Compare Foods who offer stickers for their molded food. Well it didn't necessarily feel like the Big Apple, but it was one of the most delicious Gyros I had in 4 years. Maybe it was delicious because I have not had one in 4 years, none the less the place got a mention from me on Yelp! In the area....want a Gyro.....here you go."}
{"text":"We went to the deli on a Saturday afternoon with two adults and four kids. We had the flounder sandwich, bologna sandwich, kids chicken fingers, two double cheeseburgers and the Italian sub. 

The cheeseburgers were cooked well, the sandwiches were generous on the meat and size, the flounder sandwich was made well and super hot-which I love. 

The menu was extensive and all the food was good. 

A few odd things that took one star off: they had no bathroom- not good for kiddos. No lemons or water cups- only bottles of water for sale. 

We would be back- maybe for take out or a quick stop for lunch."}
{"text":"Read the reviews and decided to go because I wanted a gyro. When I walked in and did not see the gyro meat hanging on a spicket (or whatever you call it), I should've followed my instinct and walked out. Ordered a gyro, fries and small drink for $10. The gyro sucked, but the fries were hot and fresh. I would've been better off going to Showmars! If you're a gyro aficionado as I am,  go elsewhere!"}
{"text":"So a few people told me this place is pretty good for lunch on the go, I was in the area so why not.  I ordered fried chicken and fries.  At first I was really disappointed because the chicken came naked, no breading or seasoning.  Management was great though, when I went back in to explain this is not what I had in mind he offered to refund, I opted to try something else so I ordered hot wings.  Really, really good!  Wasn't in the mood for them but they were some of the best hot wings I've had in a very long time.  The sauce was perfectly flavored, (not over the top hot but definitely had some kick) chicken crispy and juicy.  I gave 4 stars instead of 5 because their was a major communication problem when I placed my order (could have been language barrier).  But still very frustrating.  Everyone their was friendly and food was fresh and tasted good, I'll definitely be back.

O and just a tip, the area is not as bad as some of the reviews make it sound.  It's not Ballantyne by any means but it's definitely not the worst side of town."}
{"text":"My dining mate and I decided to try this place for lunch. The place was packed. One orders at the counter and waits for ones number to be called to pick up ones food. 
The menu  sign is above the counter featuring, a large variety of deli meat sandwiches, subs, salads, burgers, entrees, sides, kids menu etc. 
I ordered the chicken salad side plate, my dining mate ordered the buffalo chicken wrap with fries. 
I was notified they were out of chicken salad so I replaced it with the tuna salad. Thought this was odd since the menu features chicken salad subs, salads, plates .
 My dining mate enjoyed his wrap and the delicious fries which we thought were hand cut and fried. 
Sadly I did not enjoy my tuna. Definitely not albacore quality and not tasty  at all although the plate presentation was nice and portions adequate. Prices moderate, restaurant is clean. staff friendly.
Atmosphere a bit crowded .
I was hoping to  order soup but this deli offered none.
I would probably return and try another  different lunch.
No comparison to the New York City delis but a good  decent lunch place for the area."}
{"text":"Shortly after arriving at our hotel after a 7 hour drive, the Wife and I decided to go grab a quick bit for dinner.  The deli was only a mile away and gave the opportunity to get something simple and quick.  

Now, the area that it was in is not that great, and the strip mall seems to be dying a slow death.  And the place looked like a dive.  But you know what, the Ham and cheese pita I got tasted great.  And it came with a side of fries for $4.50  And it's not like they skimped on the meat or anything.  There was a good inch of ham in that pita.  

If you're in the mood for a quick lunch sandwich, you can't go wrong with this place.  Just don't go after dark."}
{"text":"Came here with some work friends on a business trip. It was day one and we had no idea where were headed.   Driving around aimlessly we found this joint.   Had the gyro which was probably frozen meat but great flavor and tasted great!  The other 2 had a club sandwich and a cheeseburger.   They both enjoyed their meal too. We never made it back because the goal was no repeats.   But would suggest for a good cheap lunch.     But the area seems sketchy-agree with posts about not going after dark."}
{"text":"I work close to this place, and that's the only reason I even found out it exists...but boy am I glad. Got the triple decker club combo and this NY transplant will definitely be back. Sandwich is huge, fries are good, and the price is great for the portion you get. Happy that I stumbled upon it!"}
{"text":"Still the best place in Charlotte for Greek salad, and their other salads are phenomenal as well. Better than New York-based Chopt!"}
{"text":"So it's another rainy day and I was feeling a sandwich...  I got a grilled cheese and fries and I must say that it was tasty  :-)  And again the sweet tea was good, the place was clean and the staff was friendly  :-)"}
{"text":"The food is wonderful, service was fast and the place is clean. Prices and food are better than the chain delis. Family business and their pride in their business is apparent."}
{"text":"I was with Nicole B on the business trip.  My club sandwich was huge and delicious. The bacon was cooked perfectly.  I don't normally eat fries, but they were good as well. Large servings for the price. Nicole B had the gyro which she enjoyed, and a 3rd party had a burger and fries.  I would not go after dark due to the sketchy location, but it's fine during the day and a good place to go if you are in one of the hotels nearby."}
{"text":"This deli has been around for quite a while I can truly say that I've never had a meal here that I didn't enjoy. I usually get a sub sandwich  and regardless of the type they are all delicious.  The staff is always courteous,  prompt and friendly. I highly recommend this deli as a lunch location or for a good meal to go."}
{"text":"GREAT WINGS... like you can just order the wings and be good.. UNLIKE some places where you'll have to remember to order your wings... \"EXTRA CRISPY.. or FRIED HARD\" just to make sure they cook them all the way.. NO PINK BONES....YUCK!!

The salads are HUGE.... fries are GOOD... Service is FRIENDLY.

As far as the location... NO WHERE IS SAFE. So be carefull wherever/whenever you go ANYWHERE. Crime isn't specific to one side of town, county, city, state or country!!!"}
{"text":"I love this place. The location isn't great but for the price of the food it's well worth the visit. I eat here for lunch at least once a week."}
{"text":"My first time going to this place and I must say the food was good I got the gyro combo .I can't wait to go back"}
