{"text":"Been coming to Big Sushi since university. Great rolls at decent prices. If you like Salmon and Avocado try the caterpillar roll. Their bentos are also good value."}
{"text":"I came here one day during because there was a huge lineup outside Sushi on Bloor and I didn't feel like going to New Generation because I was recently there.  I must say, with all the sushi restaurants on Bloor Street, I don't really think that there is anything special or good to say about this restaurant that sets it apart from the others.  I had their chicken teriyaki and it tasted like microwave-cooked chicken. It was too dry; there were no signs that it even touched the grill.  Overall, just horrible and not worth your money.  Just go to some other sushi restaurant on Bloor Street; there are plenty."}
{"text":"Above average taste, low cost, and adequate portions, but nothing exceptional. Ingredients were often substituted with cheaper products such as kani (imitation crab meat) or cucumber. Service was a little lacking but waitresses were very friendly. The seats are spacious and comfortable."}
{"text":"The vegan options are the best! Here would have veggie soup... The salad is wonderful too. So much cheap and good food. I'm going to there about 4 or 5 times!  Congratulations!"}
{"text":"They have amazingly cheap sushi party tray. Ordered a 54 pcs party tray and it only costed 35 dollars"}
{"text":"I usually don't go for all-you-can-eat (\"AYCE\") sushi, but that doesn't mean I don't like it. I have to be in a particular mood (very hungry, obviously) and I need to crave it - I have to be in an I-want-to-try-everything-now! state of mind and want nothing else but to devour large amounts of uncooked raw fish. Don't judge, alight? There's a time and place for everything, food included. Sometimes I long for fancy omakase, and at other times a standard sashimi and maki \"love boat\" will do. When I'm in no mood to deal with people I'd get a take-out party tray and call it a night. It all just depends.  When it comes to AYCE sushi, I feel like I have a love-hate relationship with it simply because I'm ridiculously happy once my craving is satisfied. I feel like I can conquer the world with all that yummy goodness inside me (\"conquer the world\" usually means \"I get a really good night sleep\"). But right after, more like the moment I walk out of the restaurant, I would hate myself for wasting my precious calories on medicore, run-of-the-mill quality AYCE food. That is what you can expect from Big Sushi."}
{"text":"Their sushi is amazing especially the deep-fried sushi however their egg ramen was a bit underwhelming.  However as the name suggests this place is for sushi and the sushi is good!"}
{"text":"This is my to-go place when I have to meet a friend for lunch.  The price is affordable, food delicious, and the booths are very comfortable.  The service might seem a bit slow as some others mentioned, but on the flip side, you never feel rushed out of the restaurant when you are having a serious conversation.  I like the rolls here and especially the tempura.  Highly recommended for an affordable, quality meal."}
{"text":"Good value. There could have been more shrimp in the dynamite roll but the avacado and cucumber in there were very fresh and delicious. Will be back to try some of their hot items."}
{"text":"Pretty decent sushi for a good price. I've come here a lot over the years and the food has been pretty consistent throughout. Today our service was pretty bad but overall big sushi is a good place to eat."}
{"text":"Great value for your $. But if u r watching your diet, not one of my favourites. Alot Of items are Fried , ex. Asparagus and sweet potato roll.... Even though not listed as fried. And rolls are ginormous And sloppy. Even certain items ex. Spicy salmon roll.. Keep you guessing as to what's in them... Good for students, budgeters who don't care much about what their eating as to getting fed....terrible service, we payed a 45 dollar tab with a hundred dollar bill and got 5 dollars back! the server insisted we gave her a 50 and wasnt going to give us our money until we stood there and fussed for 10 min til finally they got annoyed with us. :("}
{"text":"I've enjoyed this place more often than not. The food is consistently good and the service is too. You never will leave hungry or with bill shock at then end of the meal. The decor is a little faded and the music that plays is always almost elevator brand soft jazz, neither of which bothers me too much when the food is as satisfying as it is."}
{"text":"I've been to several diff Japanese restaurants, from low to high priced, but this place has the most delicious sushi for the price.   Sure, there will be tons of restaurants with better sushi, but u won't find any place that sells such decent tasting sushi for their low price. Not bad at all!   I've never had any funky smelling fish as I occasionally did from other sushi places downtown.  Cheap, fresh,and yummy, very impressive..."}
{"text":"The name is very fitting. Rolls here are bigger than usual.   I had the combo. Miso soup wasn't good, and the salad was made entirely of lettuce that was browning, with two slices of cucumber on top...I didn't eat any of it (no oxidizing lettuce for me, please), and it dampened my appetite.  However, the rolls themselves are passable. I could taste and see that a lot of ingredients were not that fresh, though.  The lunch special is not a bad deal (2 large rolls for $7-8 with not-so-good miso soup and brown salad), but this is in an area with even better deals (better food and good quantity for price) all around."}
{"text":"After dining here for almost a year now, I must say this place is pretty great!   The service is always quick and courteous here. The people may not be the most sociable even after coming here so often, but they've never been anything but polite.  The food is pretty tasty. The maki is indeed on the big side. I find I often leave here pretty satisfied with the portions. They don't serve many different types of raw fish, but the rolls are well done.  The best feature of this restaurant is the price, though! You get a lot for what you pay for, especially at lunch! I definitely recommend the lunch specials - you can get 2 rolls, soup, and salad for well under 10$!  I also like that they use yellow (aka un-dyed) pickled ginger. Wasabi is also on the strong side."}
{"text":"This is the only sushi place I keep coming back to with friends. There's plenty of restaurant space, the staff's always, ALWAYS super friendly, the food comes fast and it's inexpensive, plentiful, and yummy. Oh, and I'm a little addicted to their hot sake. Sigh, I'd like one now..."}
{"text":"This is a decent place.  Me and my friend were looking for an all you can eat place but ended up here instead.  No worry.  For 35 bucks total we were able to get our fill.  The unagi and dynamite rolls were good.  Bear in mind when you order the rolls are quite  big.  It really does live up to their name.  I do wish the fish to rice was better but what are you going to do.  One thing that worried me about this place was how empty it was when I went.  I usually try to go to busiest sushi restaurants because that gives you a better chance have fresh fish (which is a big deal when you're eating raw fish!).  At the end of it my stomach was perfectly fine.  It might actually be a plus if you want to have an intimate date with a lovely dining partner."}
{"text":"Good value for money. I regularly visit this place. However, I think they make better sushi for the dinner hours because the sushi rice at lunch time felt like a leftover."}
{"text":"This restaurant is large in size although it doesn't look like it from the outside. The service was alright, the waitress took a while to come to our table though. The food was average tasting, however it was large portions."}
{"text":"Been there quite a few times, really delicious and  great staff. Their special sushi menu is really diverse and their lunch special is right on target. Definitely head over with friends or large groups, the service is also fast in addition to being tasty!"}
{"text":"I love Big Sushi a whole bunch.  It was the first sushi place to break me out of the New Gen/Sushi on Bloor loop, which often means waiting in line a lot.  But \"Big Sushi\" isn't a lie - this place has a huge amount of dining room space, and as such, you are virtually guaranteed a table if not when you walk in, then certainly soon thereafter. You might be deceived by the front dining room seeming so small until you head to the back of the restaurants, with roomy (yay!) booths lining the hallway down to another, larger dining room.  It may sound silly, but one of my favorite things when I sit down at Big Sushi is to order a Coke.  Usually at sushi places I will just have tea and/or water, but at Big Sushi, they bring you a can of coke and a sort of old-timey soda shoppe glass to pour it in.  And the class has been nicely chilled and filled with ice.  Silly, yes, but it's the little things, right?  Next up after a tasty cola beverage is an order of the crispy tofu.  This dreamy squishy tofu is deep fried and then drizzled with a sweet honey-based sauce.  An order comes with three or four pieces and at just a couple of dollars its a great way to start your meal alongside your usual edamame or salads.  Next up on the menu, I enjoy the variety of so-called \"specialty rolls\", of which Big Sushi features prominent menu pictures (seriously, they have more photos in their menu than I maybe have seen ever, it's practically a children's book).  The vegetarian-friendly choices such as their sweet potato/asparagus roll are pretty delicious.  The servers are always pleasant and efficient, and I really enjoy a trip to Big Sushi because you can hang out a bit without feeling anxiety that your table is prime real estate."}
{"text":"My go to place for the taste and price. It would be perfect if the servers actually came by to check on our table just once or twice after delivering the food. However, from my experience, they don't really check up on you except on some rare occasions. Overall, love this place!"}
{"text":"Meh.   The price is pretty cheap, and the service is whatever. The food is edible to say the least, but nothing that will make me want to recommend this to anyone else or go back for."}
{"text":"I went here last Friday and I was very impressed.  I eat Sushi a lot and I have tried many restaurants around Toronto.  Big Sushi has been the best so far by a long shot.  My girlfriend and I ordered a Sushi combo for 2 and there was plenty for both of us.  It also came with Miso soup, salad, 4 chicken skewers (which was not in the description so it was a nice surprise) and edamame.   The service was excellent - very friendly staff and it was easy to get their attention.  It was a hot evening when we went and we chose to sit out the back, which was a great choice because it was lovely and cool - good air con.  The atmosphere was very nice and we felt that it was excellent value for money.  We often walked past Big Sushi and chose somewhere else so we're glad that we decided to stop by.  We will definitely be going back."}
{"text":"I had Katsun Don here. The portion was great, but I wish the Katsun was not so saggy since I was craving for something crispy that day. Next time I will just stick with the Bento box!"}
{"text":"Excellent food, merely okay service. The place wasn't even that busy and still there was a long wait.  Bento boxes are tasty, and agreed with the other reviewer Neil they are relatively inexpensive and generous. The lunch special is also great."}
{"text":"If you like your meals big this is the place to come! Huge potions at a low cost! What's great about this place is that the food is actually pretty good. I've had a veggie combo, yakisoba and a soup... all have been delicious!"}
{"text":"Average food, Terrible Service   We visited this place based on good reviews but were sorely disappointed with the experience. The place seemed understaffed and the waitress forgot half of the items we ordered. The starters arrived half an hour after the sushi. We were provided with cutlery only after several  requests to multiple servers. We were billed for the soup which we did order but was never actually served us since the order was forgotten. When we pointed this out and tried to speak with a \"Manager\", we were taken to someone who did not clearly understand English and started yelling that we have to pay for everything we ordered. Thankfully, the overworked waitress was able to explain the situation and removed it off our bill. Given the location of this place in a highly competitive area, they could definitely improve the service quality and hire more people to stay in business. Overall, this was one of my worst dining experiences in Toronto."}
{"text":"Amazing! Lunch Specials are to die for! Good quality and great price. Worth the trip to this place. Better than New Generation sushi and Sushi on Bloor in my opinion. It just tastes a whole lot better! Cheap but excellent sushi!"}
{"text":"I've gone a couple times normally around 5~ to get the lunch menu (for dinner). They have insane value with my favourite order being Udon with a Cali roll ($10) - chicken teriyaki bento is pretty great too. The service is mediocre, as I've had to flag down the waitress but the food is ultimately really great."}
{"text":"Seating options: sit at the front where on sunlit days it is very bright and cheerful or go down the hallway to the back where there are many booths. Price range: very decent. Example: Around $10 for Bento B, a combo with good portion of teriyaki chicken, rice, 8 pieces of regular sized sushi, and tempura (1 shrimp, 1 brocolli, 1 seaweed, 2 sweet potato) and an artistically cut orange. Bento B is usually enough for me to be full. My mom and I on average spend $20 per visit. Decor: good, not ugly, or imposing, feels like a place you can just relax and talk with your friends. Food: I think the food there is delicious. You don't even have to buy a drink! Free rice tea (which I think tastes great) refills. They come along every once in a while with teapots. Wait time: good, gets your order to you before you get impatient or wonder why it's taking so long. Service: the waitresses there all seemed very nice and helpful. Washrooms: Down a steep staircase, which they had thoughtfully put rubber (?) treads on to prevent slipping. Washroom very clean. Not smelly or dirty like the washrooms you usually find in malls. Toilets are nice also (I'm speaking for the ladies' room); not those big toilets you find in schools, TTCs, and malls which are annoying. I always hate going to washrooms in restaurants because dirty or smelly but this washroom is great. Overall: nice atmosphere, cheap prices but not at cost of quality, big portions, delicious food, nothing bad about service, nice washroom."}
{"text":"The Annex. Filled with the young-end-of-the-20-somethings, students, and anyone trying to stretch a buck. Easy to do in this neighborhood, especially since most places offer a $5.99 (or close) lunch menu.   I'm not a huge fan of any of them, to be honest, but when I meet with my university friends to remember the annex days long past, we always select Big Sushi.   Don't be deceived when you peek in the door, there is alot more room in the back. As mentioned by other Yelpers, they have booths (!) and can accommodate parties of 8 or so.. plus they will take reservations.   The lunch specials are \"meh\", as per most of the cheap lunches around here, but they aren't terrible. At dinner, the combos creep up to the $12 range, and they have a decent selection of options although nothing overly creative.   Big Sushi gets an extra star for having my favorite (MAMMOTH) Green Vegetable dragon in the city. Tempura Yam, Avocado, Teriyaki sauce!! It is gigantic, seriously like two-bites-per-piece. ($7.95)  For a while, they were using the white ginger, last visit they were back to the pink. (grr) - 1 point.    Quick, Decent service, Takes Reservations, Cheap Lunch Specials. Not bad.   3.5 Stars."}
{"text":"Big portion, Big Flavour, small prices. Best Sushi on Bloor Street. Don't be put off by the less than sanitary décorit is clean, just a bad choice of carpet. The services is friendly and quick, although i'm not to sure how sushi can be slow when there is no cooking involved.  The pros of this place are that is always space, and a back area for parties, as well as trying to serve adventures sushi, rather than watered down westernised 'fusion' sushi"}
{"text":"If you're into piles of sushi and Japanese food at affordable prices then this place is for you.  Dropped by here a fair few times and found the bento boxes to be excellent value and offer a good selection of what's on offer.  Service was very awkward the most recent time I went there but it was more in a funny way than anything else.  All drinks are incredibly cheap including beer, which is only $4 each.  If you're on Bloor want a cheap lunch or dinner then definitely give it a try."}
{"text":"Go here all the time. Great price for the amount and quality. Service is always quick. The food can be hit or miss, but the portions are larger than average and the staff are always very nice. When taking out, the turnaround time is usually 10 minutes, which is great!"}
{"text":"BIG portions for the price, fish is fresh compared to other places.  Good for a quick sushi fix."}
{"text":"Service is friendly usually and food always comes quickly. My only real complaint is the man who sits beside the cash register who literally does nothing except play on his tablet. I went up to him asking if I could pay, and he just waved me off and told me to wait for a waitress."}
{"text":"I had the Bento-B box and Crunchy Salmon Roll.  To be quite honest, the most flavorful thing was the terriyaki chicken. The Californian roll was bland and a tad simplistic. The Crunchy Salmon Roll had only a slightly sweet tinge. Pretty much dipped everything in soy sauce. The tempura did not seem freshly prepared and was not fried all that well.  It was an economical meal, but not that amazing in terms of quality."}
{"text":"My new fav sushi place in the annex.   After the line ups and noisy atmosphere at Sushi on Bloor  this is a quiet alternative.  You can take your time and eat.    Classical/soft music was playing in the background - there was no one to rush you or clear you out while you're half finished eating.  I had a bento box here and my friend had one of the sushi rolls.  The size was just right.  I wished I visited this place earlier."}
{"text":"We stumbled across this place on a night out on Bloor, and I'm so glad we did. Everything we had was so fresh! My favorite roll was the spicy tempura roll with salmon. So delicious. The service is a bit slow at times but the food definitely makes up for it."}
{"text":"This place has a super cheap lunch special that rivals even non-sushi hotspots in the nabe.  Their lunchtime meals average $6-7, which includes miso soup, iceberg lettuce salad, and unlimited green tea.  Big Sushi's rolls are definitely big.  Their Spicy Maki Combo ($10.50) has got to be one of the most filling on their menu.  It's just rolls upon rolls of spicy salmon/tuna stuffed with tempura bits to add crunchy texture.  For dinner, my boyfriend and I split this dish with their Veggie Maki combo ($10) to make a complete meal for ~$20 (includes soup and salad for both).   The front of the restaurant is deceiving as it looks quite small.  But their back area is huge and if you are a \"OMG! I love booths!\" type of person, this place is your friend.   Unlike 'New Generation' and 'Sushi on Bloor', Big Sushi actually de-veins their shrimp!  I stopped going to New Gen because I was so sick and tired of losing my appetite over Dynamite rolls that have little black dots of poop and silt in the cross-section of the shrimp.  Yo, that is gross.     I agree with the first reviewer--At peak times, you may feel neglected.  The wait staff tend to get flustered during prime dining hours.    I offer 4 out of 5 because it's not highly sophisticated sushi.  But for their location, portions, and comfortable seating, it's a deal!"}
{"text":"For quick, cheap sushi, you've found your place! I picked up a classic bento box from Big Sushi the other week, and after calling in, they said it would be ready in ten minutes. Crazy!   The bento box was enormous. Could be for one extremely hungry person, or two peckish people. Came with a full California Roll, vegetable and shrimp tempura, a green salad, miso soup and chicken teriyaki and the final price was under $15. Sometimes I forget how cheap things can be when you don't order in...   While, it's not competing to be the best sushi joint in the city, Big Sushi definitely delivers great value and is decently fresh for what it is. Enjoy."}
{"text":"The price to value ratio is insanely high... possibly higher than you could imagine.  My wife and I have been here about 30 times... we call it 'date night'.    One time my miso soup was a tiny bit sour... that gladly brought me out a new bowl.  I often over eat here and my stomach aches ;)  They tend to sell out of soft shell crab quite often (our favourite)."}
{"text":"So disappointing, don't know if it's the change of owner or management but the take out portions have severely shrunk along with the quality. Not worth the trip there (as I have moved from around the corner of this place) or the price (dropped around $80 on the order). At least I had the many years of awesome sushi-good bye my once go to sushi spot!"}
{"text":"Big sushi, wow.   Cheap and huge portions, isn't that a perfect combination? I know the quality is just okay, but if you're hungry and a bit on a budget, this place is awesome for you.  We ordered their soft shell crab roll and the spicy white tuna roll. They were HUGE. The soft shell crab was huge as well.... mmm. Definitely will go back."}
{"text":"It's one of those places where I don't expect anything much from food or service.  Their rolls and sushi aren't too bad and the price is cheap enough. That's probably the only thing you should go for  The seafood udon was so plain! Basically noodle soup and bunch of small shrimp thrown in.  Service is just meh. They're nice enough but don't expect anything above average.  3 stars cause their rolls are big indeed(but I suspect they got smaller since last time I went there)"}
{"text":"I called up Romeo.  Yo bro, you like sushi? Yah man! I even know a place, let's go! Nice, I'll pick you up!  Romeo is Portuguese, and I was completely surprised by his enthusiasm for raw fish.  We drove down to Bloor and approached the restaurant from the West, which meant we had to put up with the overcrowded jaywalking bicycle peddling hipsters causing horrendous traffic.  It was through this event of people watch did I learn the term \"hot pants.\"   It was uhh...important for me to learn this...to become more cultured..   We arrive at Big Sushi and I immediately realise that this is a hipster restaurant, we were sat at the rear of the restaurant, which consists of six booths and three tables which were meant for larger groups than the patrons at the front.  The floor is waited on by two Korean waitresses who were very friendly, but always occupied.   Romeo ordered deep fried california rolls, I ordered everything else.  Thinking Romeo was familiar to sushi, I ordered as if I were with an Asian friend who liked sushi as much as I do, not thinking twice about it.  Three different types of sushi (28+ rolls), a bento box, 8 deep fried rolls and teriyaki chicken.  I ordered Agedashi tofu a few minutes later, and the pretty waitress lady said to me:  \"Uhh, you know..you ordered a lot of food already.\"  With a pretty smile. \"Yeah, I want more.\"  Winking at her.    The california rolls came first, and Romeo dug into it like a hungry hungry hippo.  When the spider roll, green dragon roll, sashimi, spicy salmon rolls and the tofu came..he looked at food in confusion.   \"Bro, that's raw fish man.\"  Romeo says with a screwed face. \"It's called sushi Romeo,\" I say.  \"you're the one who brought me here, you said you like sushi.\" I forced Romeo to try everything, and it looked like I was forcing a man to eat his own child.  I never seen so many gag faces on a man.   At the end, I told him that I'll finish everything, and all he has to do is try the ginger.  I promised him that he'll like it, but it was just my cruel joke on him for making me finish all these food.  As soon as he puts the ginger in his mouth, he spits it out.  The waitress saw him and we both had a good laugh.  I ate about 36 rolls of sushi--not just any sushi, big sushi.  It's not just a name, the sushi here were actually huge.  Each piece is a mouth full.  Then I had to finish the tofu, some of the chicken, all of the sashimi.  Surprisingly, I ended up as only comfortably full, not disgustingly stuffed.  Romeo thought I was crazy.  It cost a total of $89 between the two of us, and I secretly paid for it telling the waitresses that it was his birthday.  When we wobbled out of the restaurant with our full bellies, she wished Romeo a happy birthday.  What a cute woman.  Did I mention that it was Romeo who brought me to this place?  The guy got a hard lesson from me about what sushi really is.  What a guy..  All you have to know, is that the sushi here are big in size, and big in taste.  Prices are as like any other sushi house.  But this one will fill your apatite."}
{"text":"Never go to the grocery when you're hungry... And that's why I always end up here whenever I go grocery shopping at the Metro on Bloor and Spadina. I've been to Big Sushi a few times already. For take-away, dinner, lunch, dining with friends or dining solo. Always great attentive service. Make sure to call ahead for take-away so ur not waiting around when you pick up. I'm always impressed by the size of their rolls and it's not over-filled with rice.  Price is very good for the food that you get. They have a lot of seating at the front and back of the restaurant. Decor need updating, but i'm not here for the decor ;)"}
{"text":"Quite good but with occasional mistakes here and there- there is no shrimp in my shrimp udon today!"}
{"text":"During my undergrad, my friends and I would constantly find ourselves eating here. The food is super good, especially the volcano roll. We stopped eating here (and hence the 3 stars) because we read somewhere that they had food code violations. And since then, we've been a little hesitant.  If you do go, try the volcano roll. You won't be disappointed!"}
{"text":"The husband and I really liked this place. They are new, so there were a couple kinks they still need to get work out, but that is to be expected. Others have said they didn't like the fact that it was in such a small area, but I really enjoyed that part of it. It made the feel seem much more intimate and the servers more attentive, which was awesome. We took advantage of the 1.50 a plate deal, so we definitely got our money's worth in sushi. The conveyor belt was always full and had quite of varieties available. Loved trying the different kinds they had, and they tasted really fresh, which I loved. I was so wrapped up in eating the food I completely forgot to take photos to show! We will definitely be coming back here and recommending it to others as well."}
{"text":"I love this place!  One night my friend and me were both really hungry and I remembered seeing some good ratings for Big Sushi. So we decided to give it a try. When my friend looked at the menu, \"so cheap!\" was his first comment as everything was around $5-$9.  We ordered 3 types of sushi rolls (2 for my friend and 1 for me). The sushi rolls are huge ( they don't fit in my mouth) and they all taste really good!   I would definitely come again as I love the satisfying feeling of eating gigantic sushi rolls :D"}
{"text":"Price is great but you get what you pay for! Went there for lunch and my friend and I left after eating a few plates to go eat somewhere else because of how dissatisfied we were. I had salmon which was fishy, tuna which was a little dry, and a fried roll that was SUPER spicy. I'm giving the place 2 stars because the server was friendly and the atmosphere was clean and well decorated."}
{"text":"I enjoyed this place a lot. Although I've been here 3-4 times, it never fails me on portion size. I only tend to get the sushi, not so much the bento box.  I usually spend about $15-$20 dollars, because I order about 3 different kinds of sushi.  However, this place is good on the wallet.  I am usually satisfied by the time I'm done.  The sushi isn't AMAZING.. but its good for the price.    The crowd is usually college/university students but also some couples ranging from 25s -40s.   The restaurant is pretty big, and has a lot of booths. Ideally it's good for a group of 4. Great place to chill and talk too, but if you are the type that choices atmosphere/ design of the restaurant over food.. then I think this isn't the place for you, as the place is a little weary.   Service is pretty good, they always keep on refilling our tea.  The waitresses are kind."}
{"text":"It was my first time going here and it was an exceptional experience!  As soon as my friend and I walked in, we were quickly greeted and seated right away. The waitresses served us a choice of either tea or water while we were ordering off the menu. They were very polite and were very happy to help. When we ordered our food, everything came out so fast! When we finished one plate, another two would come out and so on. We ordered a lot too and everything came out just in time if not even while we were finishing a plate. I loved that our sashimi came out quickly and fresh as well. Generous amounts. All the dishes were good quality, hot and or fresh! The sashimi just melted in your mouth. Just thinking about it is making my mouth water! LOL. The rice and fillings for the rolls and hand rolls were perfect proportion. Again the waitresses were very attentive to you, checking up on their customers and asking if we needed of anything. The price is about average, if you bring cash it's 10% off as well! The price is good with the quality and service they're providing. Would highly reccomened to anyone to experience!! My friend and I were very satisfied by the end and we are definitely coming back for more!"}
{"text":"It's my favorite place to get sushi rolls in the area. Large sushi rolls for a decent price. Just higher quality rolls in general. Can't comment on the other dishes they have since I haven't tried them."}
{"text":"There's so many sushi places on Bloor - i've tried a couple of others like Sushi on Bloor and New Generation - but Big Sushi remains my go-to for fresh, value for money, quick food.  I can't speak to the seafood and other meat menu options, but there's a great range of vegetarian options ranging from sushi specials, regular rolls, noodles and bento. (Be warned if you are vegetarian/vegan, the miso soup at Big Sushi includes a fish-based dashi).  The best option, I find, is to get a mix of rolls - my favourites are the avocado (always fresh and great quality avo) and the tempura yam rolls. Excellent sized portions will leave you stuffed, but wishing you had room for some veggie gyoza or vegetable tempura. Lunch specials are a great deal (for money and for variety of foods), definitely worth a pit stop if you're wandering the Annex on the weekend.  The place itself is a little worn, but it's got a nice charm and is an equally great place to go with a bunch of friends as it is to pop in for a quick bite or takeaway on your own. It can get busy, but their turnaround is pretty good - and there's plenty of booths up the back which they do a good job of fitting everyone in.  I would say, don't take a risk shopping around for a sushi place on Bloor when you have this place as an option!"}
{"text":"Big Sushi is my favourite \"everyday\" sushi spot in Toronto.  Fresh ingredients.  Good portions.  Solid presentation.  Definitely well priced.  It's like they took a page out of Goldilocks and the Three Bears.  Sushi Island on College has better veggie/vegan options, there are definitely higher-priced joints around town that offer better presentation and ambiance as well. But, on a random run-of-the-mill weekday, Big Sushi's holds it down.  Do it!"}
{"text":"Ate here once on a recommendation and got food poisoning. The people I was with didn't, but still. Can't say I'll be going back."}
{"text":"If you come in here with the mind set that you want to eat delectable sushi, you will probably be disappointed with this place. BUT if you come here looking for an affordable and filling lunch/dinner with decent quality food, I think you will really enjoy this place. I ordered one of the bentos, which I believe is about $10 or so. Came with a heap of tempura, chicken breast, well portioned rice, california roll and an orange. Plus there is salad and miso soup as well. From all the affordable bentos I've had I think Big Sushi beats out most of them with their large portion size and competitive pricing. Sure the teriyaki chicken breast was pretty crappy, but hey, I more or less expected it and I think they made up for it with their tempura anyways. Will definitely come back when I'm in the mood for cheap Japanese food and skipping class."}
{"text":"I was very impressed with the quality (and quantity) of sushi at Big Sushi. For the price, one can't find better in Toronto. It was so delicious I drove back for lunch the next day.   The only negative for me was that the edamame wasn't very salty. This could be a positive for some people!  I had the caterpillar roll (spicy tuna) and the spicy tempura (shrimp) roll both days and they were delicious!"}
{"text":"Came here at 4:30 and was still able to get their lunch special. For $8, I had the California and dynamite rolls (plus soup and salad). It was good. Their spicy mayo was pretty spicy. Yum!"}
{"text":"Average sushi, but the reason I'm reviewing this place and not the other sushi places I've been to is the price for a certain takeout special, that makes me consider this the best place for my casual sushi fix. For $10 (no tax), you'll get 20 pieces of sushi in a large box. That combo comes with barely any fish, and is mostly california and yam maki, with a few fish nigiri, but it fills the cravings when I just want vinegared rice with wasabi and fillings to stuff myself with. If you want more fish in your sushi, the $20 32 piece special is what I get when I want some quality while still not splurging (Yes, $20 is not cheap, but that also includes no taxes, so it's more like $17 at other places, and I'm comparing the price to normal sushi). Anyways, average taste otherwise, but the price pushes it to a 4/5."}
{"text":"Another revolving sushi bar in town! I like those because there is the possibility of trying any type of sushi available without breaking the bank. As we walked in, we were greeted by a very nice hostess that ended up being our waiter. We tried just about anything on the menu and walked away full and satisfied.  When visiting sushi revolving places, you have to walk in open minded. These places are like buffet restaurants. Some are very good but not top places. I will definitely return to Big Sushi."}
{"text":"Literally big pieces of sushi! I love this place I come here a lot. Normally if I'm eating sushi ill go for all you eat but this is an exception because the portions are a good size and the price is right. Good service too, very friendly staff."}
{"text":"Went again with friends and did not disappoint. For the price, they ae pretty good. Ordered sushi combo c and got all that. It's not bad at all."}
{"text":"As most of you know Toronto has three main types of 'Japanese' restaurants.   * Cheap sushi places -- Sushi On Bloor or New Generation Sushi and dozens upon dozens of dozens littered all over Toronto.  * Expensive sushi places  -- Ja Bistro, etc  * Japanese cuisine restaurants -- Guu, any XYZ Izakaya, etc   Big Sushi lands on the cheap end of the scale. Where you do not go for the decor nor the orgasmic taste of fresh butter fish. Nope, you go there for the cheap bento boxes, salmon on everything items on the menu, low priced lunch specials and if you are up to it, paycheque friendly booze.  The proverbial ace on their menu lies on the first word of the restaurant's name: BIG. Their rolls are big. They are big... if you compare them to the competition within the restaurant station within the hierarchy of sushi restaurants... of course. :-P   The prices are low and the servings are well sized and the venue does have a bit of a homey approach which many may like and there are booths everywhere. Just do not even think to come in groups larger than eight, you will NOT fit anywhere.   However at this price point there are some details that are noticeable. For example one of my guests ordered the Chicken Teriyaki and showed it to me, it had been preheated... thus not freshly cooked and very dry... and so was mine once I got my order as well. So it was not an one off. New Generation on the other hand cooks their chicken fresh. Salads are a bit on the bland, watery side. Rice servings are on the small side and you have to continually ask for tea instead of getting a pot.  So, is this place going to win any awards? No. Is their sushi the best? Not even close.   Is it cheap? Yes. Is it 'hands on' authentic? Hahahaha! I crack my self up.  Is the sushi okay within the price range of the restaurant? Yeah, they are alright.  I would say it is a decent place to try, if perhaps New Generation Sushi is packed or if you are on a tight budget."}
{"text":"I totalyl thought this place would be gross but everything about it is pretty awesome.  Its got a nice clean interior- comfy restaurant.  And the lunch specials are cheap.  and it IS BIG sushi. I'd give it 4/5 if I didn't come from Vancouver (where we're almost snobbish about the availability of raw fish) = )"}
{"text":"great deal on bento lunch special. tempura was unbelievably crisp and light. really impressive, the salmon sashimi tasted a bit off and needed a big plunk in soy sauce to go down.  cali roll tasted weird, not bad, just like the typical harmonious blend of a good cali roll.  was it too much cuke? something was amiss. service was friendly and accommodating. i'd try again if i was nearby but wouldn't make it a destination"}
{"text":"just as in its name the sushi and rolls are massive here.   I was pleasantly surprised to find a veg option in the specials menu (veg dragon rolls or something of this kind). in general the menu is pretty small but oh the veg options!  the service was a bit slow and we received appetizers well after the main dish and water even later.  I also found it cute that they served both of our orders on the same huge plate assuming sharing=)"}
{"text":"Not much I can add to what others have said. Value, good. Big fat honkin' sushi rolls. But the were the sloppiest loosest (is that a word!?!) pieces of sushi I'd ever eaten. They sort of disintegrated on contact.   That being said the flavour was fine and my take out order was very, very fast. The portion if seaweed salad was also on the hefty side. A seaweed salad and an order of spicy tuna rolls (24 pieces) came to 20 bucks and was ready to go about 5 mins after my call."}
{"text":"I came here today after school. At first, I wasn't liking the idea of walking from college to bloor in the cold just for dinner. However, I'm glad I did!  Friendly service as soon as my friends and I walked in. We sat near the door although there were more seats inside. Pro: we were near the washroom. The washroom is average looking and fairly clean, which I did not expect at all based on the aged decor and location.  My two friends ordered the Maki combo ($13) while I ordered the Phila Volcano roll ($5.95 for 8 pieces). I was very full by my fourth roll and I'm usually one who could wipe out AYCE restaurants. It was exactly what it was said to taste like: crunchy, creamy, sweet, spicy. As for my friends, neither of them could finish and had to pack to go.  Definitely will be returning!"}
{"text":"First of all, a bit more expensive than sishi places around. Second the only affordable dish was bento boxes. We ordered bento box b with chicken teriyaki. The worst chicken teriyaki had in TO. Boiled chicken breast, no good taste drowned in teryaki suace.  I am very dissapointed. I don't recommend this place."}
{"text":"This is probably the best bang for your buck non-AYCE sushi places I've ever been to. For a super price conscious eater like me, good value is a big deal to me. Their rolls range from $5-$9 and their sizes are BIG. Some sushi places give you 6 pieces for rolls. This place's rolls are 8 pieces. 8 Large pieces.  We ordered a chicken teriyaki bento box and an udon. The bento box was huge. It came with really LARGE califoria rolls. Generous portion of chicken, rice, half an orange and lots of tempura. This is good value for $10. The udon was pretty big too.   How is the taste? It's fine. If you're looking for very refined, high quality sushi, you need to shell out $$$ to get it in Toronto. Toronto simply doesn't have fresh raw fish at good prices. So either you go to really high-end places, or you go to a generic place. If you're going to a \"generic\" sushi place, you might as well get something with good value.   I like the tempura here. Not too oily. Their chicken tasted a little hard in terms of texture but I overlooked that because I was hungry.   Good value shouldn't be confused with being cheap. Good value means a good price to quality ratio and Big Sushi is definitely good value. There are places that are really cheap but also scam you on portions and quality. There are places that are really high quality but also ridiculously expensive. Big Sushi is a good \"generic\" sushi restaurant that I'd visit again if I'm in the area."}
{"text":"I haven't eaten in the actual restaurant yet, but I've grabbed takeout 4 out of the last 5 nights.   Comparatively to other sushi places on Bloor, I'd argue Big Sushi has the greatest value in terms of quality of fish, generous portions while still be pretty cheap.   Favourites so far are, T2 take out special, spicy salmon tempura roll and the Chef's special Roll A.  This was a weak review. I'm sorry."}
{"text":"This place is brand new and the concept is really cool you can pick up your sushi. But the quality wasn't that great. The salmon was not that great. And they could have better variety."}
{"text":"Checked this place out randomly this weekend and we really enjoyed ourselves! The $1.50 special is unbeatable and gets the job done when all you want is cheap sushi. Big Sushi is no frills, but is what you'd expect for conveyor belt sushi.  Staff is super friendly. Establishment is very clean. Belt is constantly being updated with options. We are fans!"}
{"text":"I came here for a quick bite. The server told me to sit anywhere so I chose a booth directly behind the servers area.   The server that greeted me, had a 5 minute conversation with another server while I sat for an additional 5 minutes without a menu. I finally caught her eye and she looked surprised when I asked for a menu.   My table is dirty and there are fruit flies hanging out on top of the soya sauce bottles. Not the best.   She took my order after I asked what \"beer teriyaki\" was. She said \"Oh. That's beef teriyaki\" I ordered a bento box and some green tea.   My miso soup and salad came first which I quickly finished.   I never did get that tea and when she delivered my food she placed the bento box on the corner of my table and walked away leaving the empty salad and soup dish for the fruit flies to enjoy.   The empty dishes still haven't been picked up and I'm just finishing my aggressively mediocre bento box now typing out this review.   This place seems to be more concerned with takeout orders than serving the humans that choose to dine in.   I'm still sitting here with a table full of empty dishes.   Oh, she finally came by to ask if I was finished and ran the dishes and then dropped the bill on the edge of the table without slowing her walk to the back of the restaurant.   #worstbehaviour   That's my first and last time going to Big Sushi."}
{"text":"Been here many times for take out. Service is always fast, and the food is very good! All the rolls are very reasonably priced too"}
{"text":"The sushi's generally fresh and the food reasonably priced. The service, however, is TERRIBLE. Every time I go I have to wave the server over to order a drink, to order my meal, and to pay my bill. I've had better service at McDonalds. That being said, I'll be back because I like a good sushi deal. I just won't tip my typical 20%."}
{"text":"This place is pretty decent.  I wouldn't say they're the best, but they have a huge assortment of lunch specials from Monday to Sunday and go until 5 pm.  I like the fact they have more vegetarian rolls than just the standard California or avocado rolls.  They had a vegetable dragon roll, and it tasted just like a normal dragon roll. It was delicious.  I also ordered the vegetable udon lunch special.  It was okay, a bit salty, but it filled my tummy.  Verdict: If you want cheap Japanese, this place is pretty decent."}
{"text":"Just found out about this place and went around lunchtime, 1130am. The quality of the fish was good, a bit small, but understandable. At times, there was a lot of variety on the belt, at times, there was very little. Not sure what the policy is on putting out plates back there. I really enjoyed my first time at Big Sushi though and will definitely come back again. Take advantage of the 1.50 plate special while you still can!"}
{"text":"We're so excited this place opened near us! Selection was great- first thing the server told us was that we could order anything if it wasn't going around on the belt. We were happy with the basic selection which included the normal offerings plus a few we did not necessarily recognize. Chatted with the server afterwards and she confirmed that the conveyor belt had more simple offerings due to the $1.50 plate special, but Dragon, Rainbow, Caterpillar and many others were available for ordering for more like $2-3 per plate, and will be on the belt after 6/30/18 when the $1.50 special ends.  I also liked that the place was smaller- only about 10-12 booths. While it may be harder to get a seat once it gains in popularity, I like that in a conveyor belt sushi so you can see that other customers are not tampering with the plates and have a clear idea of how long items have been going around. The tempera shrimp was hit and crispy, the salmon was soft and had great flavor, seaweed salad was good. Everything seemed pretty fresh when we were there during early dinner time. The service was very nice and the decor was modern and clean. We will certainly be back!"}
{"text":"The name may fool you into thinking this is just another one-of-the-mill, Chinese knock-off sushi joints on Bloor, but this place is legit, run by Koreans who have an innate appreciation for properly prepared sushi and quality fish. There is a great, budget-friendly special lunch menu from 11am-4pm. The dining room situated in the back feels isolated and getting the attention of your server is difficult, but otherwise not much to complain about this delightful restaurant."}
{"text":"Mediocre. Sushi was falling apart, Vegas Roll was tasteless and dumplings were cold and hard. Desserts were better."}
{"text":"Service was great, attentive, food was good. Not a lot of roll options like your standard Las Vegas, Philly, dragon, etc. Also there were no signs out on the revolving sushi so you don't know what anything was, you had to guess and hopefully you'll like what you get.   Overall good experience, only open for 2 weeks so I'm sure improvements are to come."}
{"text":"This place was excellent. Great service and great quality. Will most certainly be coming back."}
{"text":"On a hunt for good Indian food closer to home than Etobicoke I decided to check out the places around Lansdowne. Of course it being Sunday they decided not to open. I headed east and ended up in the annex sushi strip. I walked around for a bit and settled on Big Sushi because they had pictures in the window and I like pictures.  The place is nice enough on the inside. As everyone else said, tons of huge booths. The service was ok. Slower than I wanted it to be in an almost empty restaurant but not slow enough to truly complain about. The price was right. Specials starting at $5.99 (lunch specials go until 5 PM). I got the california roll and sweet potato roll special that comes with soup and salad. It was on the cheap end of the specials.  When the salad arrived I got ready to be angry because it was swimming in liquid. I HATE when sushi restaurants don't dry the salad properly. Luckily it was just over-dressed. That would also annoy me but the dressing was good. Very tangy. The soup was delicious. It was a sodium bomb for sure but I love salt. The rolls arrived and they were huge! They were 8 pieces instead of 6 like everywhere else and it wasn't like they just stretched out a 6 piece roll. The pieces were big like futo maki elsewhere and not a bunch of excess rice, they maintained the proper filling to rice ratio even with the size. Very impressed.   I was happy enough I decided to splurge on ice cream. It was like three bucks for two quite large scoops of the green tea. Delicious. I will definitely go back. I'm sad I didn't go for a special that had raw fish for me to rate, but I honestly didn't think the place would be as good as it was. I'll update after my next adventure there."}
{"text":"This place isn't mind blowing or anything, but it's consistent, fresh, super friendly + the portions are big!! I never really have a \"go-to\" but I find myself here at least once a week. This place is on par with lunch specials around in this area, but the variety is on another level (8 pieces cali, 3 pieces salmon nigri, tofu tempura, protein, fruit) for 1 price?! If I go to new gen or sushi on bloor or some other places that offers bento - I can't have all those things for under $10 - I just get 3 pieces of cali (if lucky) protein, rice and fruit for the same price."}
{"text":"This is my favorite sushi place in the Annex area.  The portions are reflective of its name -- BIG!  Unlike other sushi restaurants on Bloor, the raw fish is actually edible.  I never understood why New Generation and Sushi on Bloor were such hot spots.  For the same price you can get better portions and quality food at Big Sushi.  The bento boxes are all very generous and inexpensive, but my favorite are the special maki rolls.  Spider roll, dragon roll, spicy tuna or salmon rolls, unagi avacado rolls, etc. are all recommended.  The servers are quite nice, though when it is busy, you may be slightly neglected.  Excellent value sushi and the best in the Annex.  I call it 'the best of the worst'."}
{"text":"Big Sushi is all about good sushi at affordable prices. You won't find outstanding sushi here, but it's the best I've had in Toronto for around $10. The combos are filling and include miso soup and salad. My favorite roll there is the spicy salmon."}
{"text":"I really like this place. Although I've only had  vegetarian dishes, I feel like it's cozy in the back room, service is friendly, and food is delicious. I've only found hair in the food once and had an order confused since the server didn't understand me well, but it's all good.  The prices are also good."}
{"text":"Good value and decent price. Better than discount sushi places on spadina but nothing too special in terms of taste. F yo are hungry and in the area, stop by. Wouldn't go out of my way to eat here  Fast service and easy to get a table"}
{"text":"This review might be confusing - I've given the place 4 stars based on the excellent price for value, the deliciousness of the sushi, the diversity of options, and the definite likelihood of me returning or recommending this place.   But I've taken off 1 star because the service was SLOOOOOW. Think that sloth guy at the DMV in Zootopia slow. I got a table for 6 but waited 15 minutes before members of my party arrived. During that time, I was given menus and then ignored (no water). And then when the rest of the party came (we ended up being 4, not 6), they took a good 20 minutes to even approach our table!!! That's extreme, right? We had to loudly say \"where's our server\" before someone paid attention to us. The place wasn't busy and didn't look understaffed - 2 other tables were being attended to frequently enough. All in all, the servers weren't RUDE, just really slow and inattentive. After receiving our food, they didn't come to the table to check on us (and my friend who wanted to order more) until we flagged a server down like 20 minutes later.   So, overall, I would come here again (because affordable and delicious sushi always wins), but not if I was in a rush!!"}
{"text":"Staff are friendly and accommodating. Ample portions for affordable prices. Food is good. Definitely a quantity over quality type of restaurant. Will come back again if I'm in the area and I'm super hungry. 3.5 stars."}
{"text":"It must've been an off day, because this place served the worst sushi I'd ever had. Worse than that pre-packaged sushi you get at crappy food courts. The dynamite rolls were cold and tasted like nothing. I'm not a picky eater and I don't like to denigrate restaurants but it was so bad I couldn't finish it."}
{"text":"Best bargain bento box lunches I've found in TO Decent quality, it's not top end so don't be moaning $9 bento lunch and I'm stuffed Good tempura  Good service (except they never refill tea) Sushi isn't high end, but nothing to complain about, it's Korean owned and ran, as are many in TO. You get what you pay for, and I go often for bento lunch..... Love the shrimp tempura, and sweet potato tempura the most. Not many $10 meal places left these days,... Hope it stays this way."}
{"text":"We were passing by and saw the new place and their promo of $1.50 for each plate. Walking in the folks were very nice, place was clean and great ambiance. Casual environment.  Now with this review it's a new place so looking forward to change and assuming they are starting with some things before being more well established. The selection was not slot. Different dishes but wish they had more of a selection.  There were no signs at the moment to know ehT was ehT. When we asked the guy he said just for their opening promo they took them down and will put them back up later on. Not questioning it if that's how they want to do it, In my wife's case and mine we have been to enough places to know what is what. Other people may not be as lucky.  The mini cake were good, but warm, wish they were colder so they didn't fall apart as much. The Las Vegas rolls we liked though the batter around them were a little doughy?? Maybe not fried enough??  The serving sizes were small but every plate was also on sale so its understandable.  O stall we liked it. We will go back and wanted to go to the coffee shop attached to it next time."}
{"text":"This was a decent Sushi restaurant dressed up like a dive Sushi restaurant.  Upon first entering, I was ready to turn around.  The layout was a little awkward, the fixtures and furniture dated and the wait staff all seemed a bit frazzled but we decided to try it out anyway.  The selection of food was decent and the portions were generous.  The beer was luke warm and served in what looked like an Ice cream Sunday glass dish.  The presentation and taste were a little above average so if it not for the general feel of the place I would have given a 4."}
{"text":"First things first: the sushi.  I've come here a few times, and the sushi has never really impressed me all that much.  I'm sure I'll come back again because it's good enough, but it's certainly not my favourite place to grab some sushi.  What's good about this place?  Line-up are usually short or non-existent.  The staff who works there is friendly, and the environment is comfortable.  You never feel rushed or anything of the sort, and unlike other sushi places, you actually get service once in a while.  It's nice to see the staff come by your table once every so often, you know?  Overall this place is a mediocre sushi spot, but a fun place to sit and grab a bite with your friends."}
{"text":"The restaurant is very small but this actually works as chefs are constantly adding fresh sushi plates on the conveyor. Even the hot plates go out fast and are still hot when you eat them. They have a good selection too. I loved that they have some Korean style items like chicken wings or kimbap rolls which are also as delicious as the regular sushi. Staff and very friendly and attentive too. And only $1.50 per plate! We will definitely come back."}
{"text":"Read as 1.5  The food here is slightly below average - quality of the sushi can sometimes dip, and their sushi rolls have a tendency to fall apart while their fish can sometimes not be very cold or fresh...  The price is fairly standard for sushi joints in this area, which likely attests to why the food here is slightly sub par quality.  The service is horrible, it takes forever to flag down a waiter/waitress and get anything done - get water/tea, get your order taken, have the bill, etc.  The servers here can also be extremely brusque and rude.  I've also seen waiters glaring at customers at their tip, if it isn't that substantial.  But honestly, how do you expect that much tip, if your service was so poor/almost nonexistent?  If you're in a rush, this is honestly not the place to do, they food doesn't come that quickly and getting a waiter/waitress to get anything done will take up most of your time!"}
{"text":"I have been loyal to this place for years. I went to UofT and this was walking distance, cheap, and gave generous portions! Every now and then I like to come back. I recommend the deep fried volcano rolls! Definitely very unhealthy, but VERY delicious!"}
{"text":"The sushi displayed on the belt was just average and didn't really have much of a selection, but the Arizona roll from the specialty menu was pretty good. We also ordered the flaming dragon roll, a few party members and I enjoyed the dragon roll but my favorite would be the Arizona roll. A fair warning about the Arizona roll is that it has a small kick of spice to it. The service was a bit slow and disorganized but we did bring quite a big party and the gentleman who served us was new. I think he might have been the only server working at the time we ate here so that could explain the slow service.   I wouldn't mind coming here again, 4 stars for the quality of the food and pricing."}
{"text":"No doubt what everyone else has said is true. Looking in from outside Big Sushi doesn't look big at all. You see 4 or 5 tables but once you get seated, you take a walk through a never ending hallway to a huge room in the back! Almost makes me feel special, being taken to the \"back\" room.. or wait, maybe that's not such a good thing haha.  Regardless Big Sushi delivers on their food as well, large portions with cheap prices and actually very good food! I got their black dragon roll as well as a lunch special and not only was I completely full for most of the day, I absolutely loved the black dragon roll!  Service is a bit slow though so don't come here if you're in a rush. But servers are nice, food is good, prices are great, and the place is usually filled."}
{"text":"The sushi was okay, but i think need a little bit seasoning. with a cheap price it's not the best quality sashimi that you'll get. Overall it was okay, if you just wanna satisfy your craving for sushi. And i think the lunch special is a great deal too!! Try the bento box."}
{"text":"Big Sushi is a sushi restaurant located in the Annex on \"sushi row\".  Big Sushi offers competitively priced sushi, tempura, teriyaki and other dishes found at a sushi place.  It isn't an all-you-can-eat restaurant.  Big Sushi offers more vegetarian selections than the typical cheap sushi restaurant.  With some discussion and negotiating, many sushi rolls CAN be made vegan.  There's LOT of seating in the back of the restaurant, but the aisle you walk down is narrow.  The bathrooms are located down a flight of stairs and are gendered.  If you're looking for an inexpensive place for Sushi on Bloor, this place is great.  As previously mentioned, the rolls can be ridiculously large.  However, if you're someone like me who wants \"a lot\" of sushi but can't necessarily eat enough for all-you-can-eat sushi to be worth it, this place is great.  You can get a very nice sushi dinner with rolls, soup, and salad for $10 plus tax for dinner.  Their $6.99 lunches are also a steal and worth trying."}
{"text":"Thank you so much, Big Sushi!!!  This was DELICIOUS!!!  I'm always a bit \"iffy\" on raw food.  But, if Big Sushi was in my neighborhood, I'd eat it every day!!!  Fabulous service, beautiful restaurant.  Thank you!"}
{"text":"Came here many times during undergrad, and although its still a nice place for japanese food, it has changed over the years.   Okay so I have some top favourites from this place:  - avocado salad  - california rolls  - most of the tempuras   Now I love miso soup as well, however over the years, their miso soup has changed. Back a few years ago, the soup was thicker with more seaweed and tofu, however now there are only a few strips of seaweed. Also I am not a fan of their teriyaki chicken, its kind of dry. However I come here mainly for the california roll, which always tastes great.   Also their presentation is nice and service is faster than expected."}
{"text":"Came here with a party of eight before a show.  Got the Spicy Maki Combo B and it was a lot more food than I expected.  The food was pretty decent and the price was attractive, so no complaints!  Will come back here in the future."}
{"text":"You can't go wrong with a large sushi platter (take out) for $35  taxes included! The quality of sushi is average, but comparable to sushi on bloor and other all you can eat sushi places in the Annex. The staff is friendly and you can pay with credit card.  Definitely a bang for your buck!"}
{"text":"To update, this has got to be one of the cheapest sushi places in the GTA. I was with 2 others for lunch this afternoon (specials run until 5pm btw) and received a MASSIVE amount of food for something like $35 after tax. We got 4 of their cheap signature Big Sushi rolls, and hell they aren't exaggerating on the size:  Volcano Roll ($5 est.) Crunch Roll ($6 est.) Spicy Salmon Roll ($6 est.) Dynamite Roll ($5.50 est.)  They were packed with all the good stuff in the center (didn't skimp on avocado and fish) and the tail pieces were probably larger than some chihuahuas. All good ingredients, all tasty.  In addition, we ordered the Teriyaki Chicken Bento Box A: ($7.95 est.)  - Miso soup and salad  - Generous serving of sliced chicken breast served atop sliced cabbage and smothered in a gooey but super tasty teriyaki sauce.  - 8 large pieces of California roll  - 6pc of deliciously crispy veg. Tempura  - Steamed rice and half a juicy orange  We had to take home 12 giant pc of sushi, and some tempura.   To rehash, I wouldn't say it's the most authentic Japanese food but if you stick to the Big Rolls (not the sushi combos) and the Bento Boxes, you are in for a cheap and tasty feast.  * May induce the itis."}
{"text":"The gf and I had dinner here tonight. Ordered the Bento C and she had sushi combo A.   Bento C was composed of 8 salmon rolls, 3pcs shrimp tempura, 1 onion ring tempura,  2 sweet potato tempura,  1 mushroom tempura and 1 broccoli tempura. Also had a scoop of steamed rice and a generous order of beef bulgogi. $12.95  Gfs order was composed of 8 california sushi rolls, 3 salmon sushi, 1 white tuna and 1 red tuna sushi. $9.50  Both meals had miso soup and a side salad.  Good value for what you pay for. Cheapest sushi in Toronto"}
{"text":"I love Japanese food, and have eaten it happily at many locations across Toronto, North America, and Japan. This was one of the least satisfying Japanese meals I've ever had. I ordered a Bento box. The Teriyaki chicken tasted boiled and was overcooked with a very blunt sauce and a pile of mushy, soggy unrecognizable something (cabbage maybe?) underneath, and no rice to help with the excessive saucing issue. The salmon sushi was almost completely tasteless. The California rolls seemed actually salty. I have had much better from the mall. The gyoza and miso soup were both below average.   Other things: the table was sticky when I sat down. There were two bottles of soy, both said \"less salt\" but one was not. The server was pleasant, and the meal was very inexpensive. The food came quickly - too quickly in my opinion, because clearly it was all pre-prepared."}
{"text":"Sushi is just ok. Nothing special. The rolls are very good, and a fantastic value. I am the kind of guy that loathes to fork over $6-9 for a stupid roll, and I usually get a sashimi deluxe, or chirashi, or a la carte when I get sushi. Having said that, the rolls seemed to be the stars here, so I tried some sushi AND the rolls.  What I didn't realize is that the rolls here are not the regular rolls where the diameter of the roll is approx 3 cm. These rolls are BIG. Not only are they big, they have quite a bit of fish and stuff, and not much rice. (As opposed to New Generation or some of the other places I peeked into).  I really like their Catepillar roll, and one of their maki combos, I forgot the name of it.  For guys (even big eaters like me), 2 rolls will do you good, for girls, 1-2 rolls. (order 2 for her, and then steal her stuff).  Overall, not the fanciest place in the world, but tasty filling eats."}
{"text":"Decent place in the Annex.  Street parking and green P parking a block away.   The decor is a bit outdated but I loved that they were playing 80's music when I was there.   Booth seating throughout the restaurant , with most of it being towards the back.   Now the food.  I liked the fact the the sauces used in the tempura dip, salad and salmon teriyaki was not full of salt and sugar. Most other places overdue it that I get so thirsty. These sauces were well balanced.   The salmon teriyaki was a decent portion. However, in comparison to other sushi places the salmon was a smaller piece and the rice portion was also small. For me it was fine but for regular eaters, it may not be as filling. They did serve my Bento B box with 8 good sized California rolls and several tempura pieces which included sweet potatoes, broccoli, mushrooms, seaweed and shrimp.   Overall, it was nice, and the food was good. We were served by attentive waitresses.   This place did get busy with groups of people on a Saturday night.   I will return again as they have booths along the hallway that allows for a more private dinner."}
{"text":"Big Sushi has big sushi. What more can I say?  It's good, and it's definitely worth it's price."}
{"text":"Big Sushi! This was our favourite sushi place in university. I can't say it's my favourite place now, but it's fairly consistent. I always get the same things: spicy salmon maki and green dragon roll."}
{"text":"Probably the worst sushi I've ever had. I ordered the spicy handroll set, which were not spicy at all and the fish was slightly warm. I guess you get what you pay for here, the quality of the fish is not great and the rolls taste bland and mushy. With so many other sushi restaurants nearby I would suggest sticking to Sushi on Bloor or New Generation."}
{"text":"Very yummy! I am so happy to have another conveyor sushi option so close to my house! I ordered off the menu, and then grabbed a gyoza plate off the belt. Great pricing and the quality of the food is very good. I hope their business thrives and they can expand the menu a bit! My husband likes sushi a little, but prefers the gyoza/appetizer type things and to have a fried rice option maybe?  Or crab puffs, those are both our favorite.  The decor is super cute, would be a great date night place!"}
{"text":"Amazing value & freshness, especially when you get the lunch special (which conveniently enough is until 5pm)... Takeout is ready in less than 10 minutes. My staples are: California Roll & dynamite roll (I substitute the California roll for a spicy salmon instead- only $1 more!) & Sushi Combo C. Both come with a salad and miso soup. And I ALWAYS have leftovers for later! Never had dinner here, but I imagine it is just as good!"}
{"text":"Trust your gut instincts. I have yet to find a better bento box than at Sushi on Bloor. For $10 you can have the best salmon or beef teriyaki bento box. The bento box at Big Sushi, as well as at many other sushi places I have tried, is totally dull and uninspiring. The chicken teriyaki had the consistency of erasers and tasted as such. This bento box did not taste fresh. One thing I will say where Big Sushi trumps SOB- they have better music."}
{"text":"We came shortly after they opened for the day on a Saturday morning and were seated right away. Plenty of comfortable booths and the staff was really nice.  We found a reasonable amount of vegeterian options on the menu. I ordered the Ramen & California rolls, my wife ordered the Udon & California Roll combo, and my daughter ordered the Vegetarian Bento box.  Every dish was super flavorful and filling. we will be coming back again!"}
{"text":"Great find! The sushi here tastes very fresh to me. I've eaten here on multiple occasions and have never had any issues. Starting in July, the promotional from the grand opening will be over. Not all plates will be $1.50, but I still plan on returning. It does seem like they only have a couple of staff members to work the floor, but they are very attentive and move quickly.  For me and my family, this is a great place for sushi!"}
{"text":"Decent Japanese Food, Great Service  Big Sushi doesn't have the most modern interior however the prices are cheap and the service is very good, The feature a number of maki rolls and your basic Japanese bento boxes, sushi and sashimi, noodles and soups.  The Rainbow Rolls was good but assembled very loosely. The Spicy Salmon Rolls seem to not have much salmon in them and the Salmon Teriyaki in the Chef's bento tasted pre-cooked and dry. The Miso soup was good.  They have booths in the front, running along the side and at the back. There are few areas where you could fit a group of 6 or more together. The interior is a bit dated, however this place has great value."}
{"text":"This is a sad copy of taharu sushi. Conveyorbelt sushi, but no signs, sushi that was fried was cold, water out of a cooler. Prices right now are fine for their grand opening but the prices will be ridiculously high. We won't be back but good luck to ya!"}
{"text":"I have never posted a review on Yelp mainly because I've never had worse service before. It was shocking the quality of service we endured.  We started off a group of five being sat at a dirty table, which could only hold four. After squishing a bit we finally just pulled another dirty table to make it more comfortable. We sat there for a long time before any greeting occurred after finally waving the server down she grabbed our order. Few minutes later she comes with two of the five drinks ( conveniently only the drinks the two males ordered). Anyways, after another wait food finally arrived which was yet again all the stuff the men ordered. Us ladies got our food eventually, but our drinks only got delivered after asking again. We sat there hoping to get any service. We had to ask MULTIPLE times before receiving any chopsticks, plates or napkins. These are normal standard things a tables requires when dining. And, of course, getting the bill took 15 minutes of the server avoiding eye contact until finally we yelled for her. We couldn't wait to leave.  Also, while we sat there all other tables that left never got cleared, the severs would disappear for long periods of time. And it wasn't just us who were unhappy all the tables around us were audibly complaining. In fact, the table beside us whom had children had to physically go find napkins. That's rule number one for tables with children, they are going to need napkins.  To be honest I don't know if the servers were really under staffed, one of the servers mentioned that the 'other girl was new'. But that didn't excuse HER service. I am a server and based on the number of tables it honestly didn't make sense how behind they were.  In the end I couldn't even enjoy my food, sure it was alright. But when you're getting such awful service where everything is a struggle you can't really just sit and relax. Therefore, I'd never come back.  Best part, as we walked out we saw a man just sitting casually at the front talking to the chef ( probably the owner) as the servers struggled."}
{"text":"Best sushi on all of bloor!! Vegetarian rolls are amazing, service isn't the best but it'll do."}
{"text":"I get excited when I see new Asian restaurants pop up in the East Valley and I always feel the need to try them out. This was no different. My mom noticed this restaurant after shopping at LeeLee so we decided to try it out for lunch.   I have been to several conveyer belt type sushi joints in AZ so I kind of knew what to expect. Big Sushi kind of disappoints with the lack of selection. The sushi selection seems to be the California roll, Philly, and old looking nigiri. The rolls are mainly rice btw. But for $1.50 a plate what do you expect right?! The service was great though. I just hope the food gets better."}
{"text":"My sister and I went here for lunch today and I must say it wasn't too bad. There was a decent variety of sushi on the belt. Other reviews had me kind of concerned, but the sushi and fish was more fresh than other's have mentioned. May have been switched not long before we arrived. When ordering soda you recieve a can and a cup with ice, not the worst. I'm hoping they get a soda machine in the future. All plates are a $1.50 for their grand opening, not sure how long that will be going on. I'll definitely be back."}
{"text":"Pros: The price of only $1.50 per plate cannot be beat. The staff were trying their best to be helpful and accommodating. There appeared to be several happy diners enjoying lots of sushi on the evening when we visited.  Cons: The seating area in this restaurant consists of only two rows of perhaps five booths each divided by one conveyor, which is about 20 feet long. Consequently, the variety of plates on the conveyor at any one time was relatively limited. The seating was also a bit tight compared to other sushi restaurants we've visited. This location would probably be fine as a Boba tea shop or a café, however we felt it was too small for sitting down for sushi. Although the staff were clearly making their best effort to take care of all the customers, they still seemed a little short staffed.  Verdict: Having a conveyor belt sushi restaurant in this plaza is a great idea. However, we thought the space was too small to pull it off successfully. Still, we were willing to award 3 stars for the effort made by the staff to accommodate their customers"}
{"text":"Big sushi? Well, more like two-bite sushi... I guess I was under the impression that it was going to be bigger, but I guess that's guys for ya - always over-selling the size factor of things.  Ahem. Nevertheless, the rolls were the main selling factor of this place so we decided to order a bunch.  Spicy salmon, spider, dynamite, california, dragon, some deep fried one, we practically tried their entire roll menu! They were all very good, it's just that they all taste like california roll.  They all had the orange fish eggs, the cucumber, many of them had the avocado and many of them also had the spicy mayo.  These ingredients were used as filler to make the sushi bigger. This place would be great for someone who has a newly discovered love for california roll and wasn't so sure about trying anything else or, for a bunch of really hungry people.  Not recommended for sushi enthusiasts."}
{"text":"There are quite a few sushi places in this area (Annex), and I think Big Sushi continues to be a returning favourite of mine for its environment, food portions, and value. You normally get quite a bit of food for what you pay, so A+ for that. The food (rolls and bentos) are average quality but huge, so it's not like they skimp on quality for quantity.  They also have a few signature rolls that are fun to try. I normally order a bento + roll, but have yet been able to actually finish that."}
{"text":"My husband kept referring to this place as the carousel sushi bar which conjured up images of little nigiri and sashimi bobbing up and down on a merry-go-round, chasing each other in a circle. I would definitely go on a sushi carousel but the fish on the carousel would mysteriously go missing and I would have a full stomach.   Big Sushi is currently holding a grand opening special that ends in June where all their plates are $1.50. otherwise prices range from $1.50 to $3.50 on the conveyor belt. They also have a separate ordering menu. We stuck with the stuff on the conveyor belt.  The sushi itself consists mainly of rolls. Most rolls either had some minced spicy tuna, spicy salmon mixture or imitation crab mix in it. There were some nigiri on the conveyor belt, sliced as thin as you can get away with for serving.   One feature of this conveyor belt sushi restaurant that is different from others I tried is that they also offer Korean fried chicken. I tried what looked like a big piece of chicken with an accompanying gyoza to find out that most of the chicken was bone and not a lot of meat but at $1.50 what do you expect?   Service was good and plates were taken away as needed. For lunch our total ended up being around $20 for two.  The one thing I found weird was that periodically the conveyor belt would stop for a few minutes at a stand still. I've never encountered sushi conveyor belt traffic before but there's a first for everything!  Overall it was a decent meal. If you go in with expectations that you are get what (little) you pay for it's not bad for quick and cheap sushi."}
{"text":"Place is nice decorated, server is nice, but the food... fish are not fresh, portion of each plate is so small. Looks like they just slap some leftover fishes on tiny rice balls and called it nigiri.  $1.5 seems to be a great deal but if you compare the size and the quality of the dish you get, totally not worth it. Very disappointed."}
{"text":"Ugh why is this place horribly overrated? I hate it when people put sauce all over ever type of sushi.. It overwhelms the flavours inside.  If you like BIG sushi you will like this place but I personally prefer the opposite so I have never understood the hype about this place."}
{"text":"The lunch deals are pretty similar to the other sushi joints in the area. I got the lunch bento C wih gyoza, salmon sushi, 6 piece California roll, and hockey teriyaki.  The sushi and gyoza were decent, but the chicken teriyaki was pretty terrible, I barely ate half of it."}
{"text":"One of my all time favourite sushi places in Toronto.  The quality of their fish is great, an important factor for me since I'm a big fan of sashimi.  Their prices are also consistently lower than surrounding sushi restaurants, especially their lunch specials that end at 5pm which include 16 piece sushi combos under $10. Their dining room is massive so larger groups can easily be accommodated and wait times are nonexistent. Don't expect fancy decor or hip atmosphere, but if you're looking for well priced, good quality food and quick service, you've got to check this place out."}
{"text":"If you're on a budget and looking for decent sushi, this is the place to go! I made a reservation for a Saturday night, but the place wasn't very full, so making a reservation probably isn't necessary.  I ordered the vegetarian dragon roll. It arrived promptly, and it was really good. My friends ordered multiple dishes, all of which arrived quite quickly. The sushi was definitely decent. I'm not a connoisseur of sushi, and I suspect it isn't exactly the best sushi in Toronto. However, if you're a casual sushi fan, it'll hit the spot. The sweet potato on top was my favourite part. The portion size was very generous. From the looks of the dishes ordered at my table, the special rolls are the way to go.  The service was nice, if a bit awkward. The sushi was similar to the service: not top tier, and the rolls were a little awkward, but it was nice for sure. The waitress was very polite, although a little slow with the bill.  This is a really good place for people looking to save some money that want to satisfy a sushi craving. Sushi aficionados will probably be disappointed, but broke university students most likely won't be."}
{"text":"I like this place. Their bento boxes are good, also very affordable and filling. The interior is a little outdated and the quality of their food is not the \"best\" however, considering their location and unbeatable sushi prices (in comparison to other places in toronto) you get more than what you pay for. Will be going back soon."}
{"text":"It's our favourite go to for quick and cheap takeout.  $35 (tax included, cash only) for 54 pieces of take out sushi.  It's nothing fancy or over the top, and we've never actually had a sit in meal, but their sushi is fresh, tasty and quick!"}
{"text":"Decent prices, big portions... The sushi is okay - not phenomenal but decent. The best part of Big Sushi is the nice spacious booths in the back where you can sit and talk easily over a nice lunch..."}
{"text":"If i'm in the area, I always go to Big Sushi. Good Bento Boxes, huge rolls...but besides that pretty standard everything for good prices."}
{"text":"Really really enjoyed my dining experience this afternoon!!! I love how small and quaint this place is. It's all booth seating which I usually dislike but it was surprisingly comfortable. We stopped for a quick snack; our bill was just under $12 with tax. The options were inline with what I'd expect from a place like this. Really enjoyed the gyoza dipping sauce; it has jalapeño in it. Only complaint was the options were not labeled clearly, which was a minor issue for my husband who doesn't always get the same thing. Save room and get dessert next door, you'll be glad you did."}
{"text":"We just got done eating here! It was super clean and the server was so sweet. The sushi was fresh and delicious! It was a great Fathers Day meal!  Thanks guys!"}
{"text":"The dumplings were awesome but the quality of the sushi matches the price. Room temperature sushi isn't something I want to dine on, but it's on a conveyor belt so I wasn't surprised by this either. So we ordered rolls from the kitchen hoping they'd be a little bit colder but they still weren't cold, which is slightly disturbing. Great friendly staff though so that was nice."}
{"text":"It's defin quantity vs quality. If u are just looking for a quick and cheap sushi I can defin get it here.. grand opening special $1.50 all plates will the end of June.. it's next too unPhogettable and snow time"}
{"text":"I need to say the service was good. They only had couple of servers. It was $1.50, so the price is just like other places of this kind. However, they need to improve on variety in both nigiri and rolls. They also need to add 1 more piece to their rolls. If they want to succeed, go to Teharu and learn."}
{"text":"Yo dawg, this was the ILLEST sushi joint I have ever had the pleasure of dining at! The selection was on point, the belt was never empty, and it was all DELICIOUS! The chefs and staff were all super helpful and courteous, and I couldn't have asked for a better experience!"}
{"text":"Nice selection of plates, everything we tried was delish, the sushi on the belt was not \"big\" but maybe the rolls off the menu are? Service was pretty much non existent, maybe growing pains since they just opened but we'll definitely be back! The kids loved it too!"}
{"text":"I should start saying that to me, the place deserves 3.5 stars rating not 3, not 4. I've been there based on the reviews here looking for a place that serves \"All you can eat Sushi\". I couldn't find one, but still this place was close to it. The sushi rolls are not expensive I would say. And prices being on the cheaper side, the rolls are actually better than you expect of such a pricing point.   I went for Big Sushi plate having 39 or 40 rolls (can't remember it what a shame) including sashimis, 4pcs of gyoza, edamame and miso soup. The price was $36 without tax. This definitely checks out as close as to all you can eat Sushi. Almost 20pcs for 18 per person. Of course I could have eaten more considering my size, but stayed on the human side this time.   The service was OK. The decoration and tables were of a boring color and type. Not a bright and fun place to eat. Dim lights were there, big mirrors too, but what's lacking is the atmosphere here."}
{"text":"If you strictly eat California or philly rolls and enjoy browning fish, then this place is for you!  We came in because we saw the $1.50 per plate special as we were passing by. $1.50 is a pretty good deal so we decided to try it and felt like we had nothing to lose.  First off, there wasn't much variety in the sushi offerings. Lots of California rolls, philly rolls, sometimes shrimp tempura rolls, fried vegas rolls, salmon nigiri, and a crunchy roll. Mostly California/philly rolls though which was disappointing as those are the most basic rolls ever.  Sashimi can be ordered for +$5.99 but I'm not sure how good it would be since the rolls that had fish in them were browning and didn't taste good at all.  We were lucky enough to try a plate of shrimp tempura but we waited 30 minutes and more plates of it never came out again. :( sad because that was the most okay plate that we tried. Of course everything fried tastes good lol.  There were a lot of mini desserts like cheese cake, cinnamon rolls, and little bite-sized cakes. Didn't try them.   Overall, I wouldn't come back again. There isn't much variety and if you try something you like besides Cali/philly rolls, it might not come around again. Also, the fish, specifically the salmon had a very strong smell and taste and was also discolored. I'll update the review later if I start not to feel well because I ate the sushi here with a full assumption of risk. Eating here was definitely a gamble on my health lol"}
{"text":"Was very surprised with how large the rolls were. The udon came with a decent amount of chicken pieces and the sushi tasted fresh. The service was also friendly and attentive."}
{"text":"Big Sushi is my second favourite on the Bloor/Annex strip.   Things that make it unique from the others:  1) The BIG, comfy booths! Oh yeah. (At Sushi on Bloor I can get crammed into a small table and chair and have to sit near the doorway with 15 people waiting in the queue, talking loudly. This doesn't happen at Big Sushi. I get a huge booth with padded back rest far away from the entrance)  2) The waitresses actually wear kimono tops  3) Relaxing music (jazz usually) playing in the background  4) Plates shaped like a big fish (what can I say, I'm easily amused)  The menu has some unique maki options but for the most part it's a pretty standard menu. The lunch specials aren't *as* cheap as some others, there are a few specials for $5.99 but most are a few bucks more.  I also find the rolls are a bit more plain/basic looking than Sushi on Bloor makes them and the sushi bar area up front isn't as exciting as other places (like New Gen) where you can actually sit and watch things being made."}
{"text":"Overpriced. Had the bento and the chicken teriyaki is dry. It's just boiled chicken with pre made sauce."}
{"text":"Walked in here by chance as there is another sushi place right beside it. I ordered the Pink Lady Roll ($8.95) and it was great! The rolls are big, I'd say it's a perfect amount of food. It wasn't too busy early evening, so they let us sit there for a while and the waitress even kept refilling our waters. With tax and tip total came to just over $11. Not bad for a decent sushi meal! I will definitely be returning."}
{"text":"cheap and delicious. it's my go-to place on bloor that i've been to many times, dined in and to go. i especially like alaska roll and dynamite roll, but they have lots of others too. its great to split a bunch of rolls in a group of people"}
{"text":"I always come here after yoga class, it's the best value you can get around the neighbourhood! Amazing sushi for great price!"}
{"text":"I just went to Big Sushi for the first time and I love it!  I hadn't ever been to the carousel-style sushi restaurant before, and I like how it makes it possible to sample a variety of things that I would normally have to try over several visits.  It also made the dining experience a little quicker than the more traditional format, which will be nice when I want sushi but don't have a lot of time (which is pretty often).  The service is very friendly and attentive, the quality of the food was excellent.  Everything I tried was delicious and I'll definitely be back, soon and often!    My only criticism is that I wish they had reusable metal or even plastic chopsticks instead of disposable wooden ones.  I hate the idea of a pair of chopsticks going to the landfill every time I want some sushi, so I might just bring my own next time."}
{"text":"Ah, Big Sushi. Quite big in comparison to all the other sushi spots in the area.   Came here for dinner last night and was impressed at the service and food that the restaurant offered. Our waitress was extremely attentive, and our food arrived quickly and it was all delicious! The sushi rolls at Big Sushi taste fresh and are very filling, as they are quite large in size. Sashimi was fresh, too. Appetizers are great here as well. Loved the miso soup- yay!   Probably my new sushi place on Bloor!   OH- don't be fooled by the front of the restaurant; there is a huge seating area at the back! Check it out some time. :)"}
{"text":"This is my all time favorite budget sushi joint to go to. You get the most bang for your buck in regards to Japanese food. I'm a regular at this place.  Basic rolls are $5.50~ for Dynamite, spicy salmon, volcano, Philadelphia rolls etc  Special rolls are $9.00~ for Black Dragon, Special Roll A / B, Caterpillar, Spider  Bentos are about $10~ during dinner time. Bentos aren't that special. I recommend the rolls over this.  The rolls are super huge and are stuffed! They don't skimp out like some other places that put a lot of rice so you definitely get your money's worth. One roll is usually enough for a meal itself. I recommend getting a few of the Special Rolls and sharing it among friends.   Rolls I recommend are: spicy salmon, Special rolls A or B, Caterpillar or Black Dragon. I don't recommend Spider roll or Rainbow. It's just not as good as the rest."}
{"text":"I'm so full after eating option Sushi (D). $8.95(~$12 after tax and 15% tips) is good for sushi. 4 salmon sushi, 1 shrimp, 1 butter fish, 1 tuna, 1 something I forgot, and 8 cali maki. The makis aren't great, it's probably just there to fill you up for cheap.   There's something about the salmon that I really like. I've tried those higher quality kinds and some in Japan and I didn't get why my friends and family say that /those/ ones were really good. But this one I like somehow."}
{"text":"Just checked out Big Sushi tonight for dinner and I really liked it! They were doing a special where all plates were $1.50 which was nice. It's a conveyer belt sushi place, but you can also order from the menu. They offered edamame, a variety of sushi rolls, and dessert. All of the sushi rolls were super tasty! I'm picky about sushi and really enjoyed all of the rolls. It's nice to sit down and be able to eat immediately. I'll definitely come here again!"}
{"text":"This place is GREAT for takeout. Fresh, consistent and affordable. I've never been disappointed ordering their sushi. Tip: Their karage and Korean chicken are generally good but not as consistent as the quality of their sushi and some portion sizes for the boneless Korean chicken are disappointing. Other than that, this place is my go to on bloor and most faster and friendlier service than sushi on bloor or sushi couture."}
{"text":"Because our go to sushi place on Bloor, Sushi on Bloor was too busy we decided to try Big Sushi. Located on the north side of Bloor just east of Brunswick the place is in a long narrow setting that has an odd physical arrangement. In front facing the windows looking out on Bloor Street are a few tables. Then along the western wall are small two people booths which sit across from the kitchen which runs along the eastern wall. In the back past the kitchen and these tables is another square dining room featuring booths on both walls and a few tables and booths down the centre. The layout is odd and makes you wonder why it was laid out in such a manner. Once we read the menu I realized why we had never tried it before. Too often Toronto sushi places drench their poor quality sushi in mayonnaise compensating for a lack of flavour. Beyond the mayonnaise you can always tell when the menu features Korean or other asian dishes rather than Japanese inspired options. When faced with such menus I usually opt for a bento box, but here even this was odd. Sadly, the teriyaki salmon was overcooked and the tempura batter tasted stale like it had it been left out to sit too long. The sushi which I had and which my friend had absolutely no flavour at all and tasted of the freezer and nothing else. It was to say the least disappointing."}
{"text":"I could eat my body weight in sushi so if you're serving up big sushi, count me in!  Big Sushi opened today. Woohoo! Grand opening specials, babie! Finally a conveyor belt sushi place close to home. It's like a never-ending catwalk of sexy fish waiting to be devoured.  We had a variety of different kinds of nigiri and they were all pretty satisfying. I especially enjoyed the salmon and the halibut. You can order more nigiri, sashimi, rolls, and handrolls off the menu. The size of the rolls are on the smaller side so don't come here looking for more than just a snack. They also sell alcohol here as well.  It's bright, it's clean, and the people are friendly! They have a doorway straight into Snowtime and from what the waitress told us, they're family to the owners of Gogi and Snowtime. It makes sense! Get your raw fish here at Big Sushi and then go next door to get a fish cone with soft serve. Perfecto! 3.5 stars."}
{"text":"A friend brought me here once. I was hesitant to go because there wasn't a long line at New Gen but I decided to try something new. I can't exactly recall how I reacted to the food, but I think it was overwhelmingly positive and enthusiastic.  Being a typical Bloor sushi restaurant, it doesn't score many points on decor, but the servers all wear kimonos and the bathrooms are nice.  Everything about this place is big. The menu has a big selection of special rolls (which are amazing!), the tables and the booths are big, and the sushi is BIG. Plus the price is pretty small, and that is big, too.  My friend and I split edamame and three special rolls. I can't recall their names (the veggie caterpillar, perhaps?) but it they each had various combos of avocado, sweet potato, and maybe salmon. They were wonderful!  The service here is a bit slow but I wasn't in a rush. It's generally lightly packed and I think for our four items, we paid $34 with tax and tip. Not bad, eh?"}
{"text":"I had a fruit fly circling my miso soup. That says all.  We went there for a Saturday lunch and the restaurant temperature was pretty warm when we came in (similar to the outside temp). The boyfriend was worried that the fish might not be fresh since, well... it was warm inside the restaurant. But he went on and order Sushi Combo C, which consisted of 8 pieces of sushi and 8 dynamite rolls. I ordered Bento A, which had chicken (breast) teriyaki, veggie tempura, and 8 california rolls.  Like other have mentioned, this place is a good bang for your buck, especially for students. Our tab came up to be less $20, which is pretty affordable. Unfortunately, we got what we paid for. The chicken teriyaki was bland and the sweet potato tempura was tough. The california rolls were ok, though they put A LOT of rice in them (they did the same thing with the bf's dynamite rolls).   I've had much better experience at other \"cheap\" sushi place, so I will not go back.  On the plus side, the waitresses were nice and chirpy."}
{"text":"This is a new revolving sushi place in the same plaza at Lee Lee International. We happened to be in the area and saw the Grand Opening sign and decided to give it a try. Very polite, friendly staff greeted us. The interior has a modern, minimalist feel which is very light and attractive. We grabbed a booth next t"}
