{"text":"$5 for a large cajun crust pepperoni pizza? Yes please!  With Big Jimmy's you're gonna get the best bang for your buck!"}
{"text":"I saw this yesterday online - http://blogs.phoenixnewtimes.com/bella/2012/02/now_open_jimmys_five_dollar_pi.php  So I went to get a couple of pies for the office.  The location leaves much to be desired, but the inside is clean...the workers super friendly.  As for the pizza, I ordered 1 pepperoni and 1 cheese and picked a butter cheese crust on both.  It was gone just as fast as I could get it into the office.    The dough makes all the difference!  I'll be going back for sure!"}
{"text":"Went here for lunch the other day. The girl at the front was very friendly. I got 1 Slice of Reg Pepeperoni Pizza and it was delicious.  Great spot for a cheap lunch!"}
{"text":"Great pizza for 5 dollars Little Caesars has nothing on Jimmy's pizzas!!!  I love going here to eat whenever I am at ASU Tempe Campus.  Great food for really cheap I'm a happy camper"}
{"text":"Overall the pizza is pretty good I think it's better than Little Caesars just a little bit perturbed that they charge you $0.49 to use your debit or credit card.... And they no longer charge $5 for the pizzas it is a dollar more. All advertisement that I see says $5 but when you get there."}
{"text":"The pizza is decent. Middle of the road, New York style. Not the issue.   The Managers have horrible costumer service skills. And will curse You out on the phone and tell You to come get your pizza yourself.   I ordered a pizza, total was eight or nine dollars. First question I was asked was if it was for delivery. I said yes, then gave my address. Two hours later, I almost forgot entirely, I call and ask about my Pizza. I first asked if the order went through, I'm told it did, then I asked why it didn't get delivered, I was handed over to the GM, by this point I'm antsy, I ask who took my order and where is my pizza. The GM tells me the assistant manager took my order, and then when I asked why it didn't get delivered he cursed at me and told me to come pick it up myself and that I owed him money for the pizza and he wasn't remaking it. I hang up. Call back and ask what the minimum delivery order is and the girl tells me 10 dollars. I then asked if the assistant manager usually answers the phone, she said no.   I wonder who messed this up. Sounds like the GM never trained the Assistant manager...."}
{"text":"Pizza is cheap and tasty too, even I am not American, I don't have any experience to distinguish which is good, just from taste, I feel it is enough to try more times here."}
{"text":"Worst customer service I have ever received. I work in the food industry and Im so appalled by how they treat thir customers. I called THREE TIMES and they hung up on me. Ive also tried to order late and they always tell me obscene wait times. No way a pizza and delivery four miles away should take an hour. The one manager I tried to talk to about this horrible service was 'ty' and he personally hung up on me twice. Worst service ever. I hope this piece of shit establishment goes out of business. Ive never been treated so badly."}
{"text":"Great pizza and salads. Great price. Quick delivery.   We saw a flyer and decided to try something new. We are very pleased with this new discovery. Will definitely tell everyone. Great job!"}
{"text":"Really cant complain its only a 5$ pizza. Although I think the pizza would be alot better if they didnt overwhelm it with seasonings. Id much rather have little ceasars for 5$ ..."}
{"text":"Being open till 3 am is clutch, they were about to close the doors and still let me in to get food. Good customer service"}
{"text":"This place is well worth the chance you are taking. Got a few $5 pizzas for the office. Pizza showed up hot and fresh. They even went out of their normal delivery radius for us. Great customer service and a great pizza. We will be back.  Long time review. Just update my app so I can post from iphone."}
{"text":"Forget Little Caesar's (if you already didn't).  Forget Hungry Howie's. Go to Big Jimmy's if you want a five dollar pizza. Coming back from a bar on the light rail, my boyfriend and I noticed the \"$5 PIZZA!\" sign hanging in front of this restaurant.  I was drunk and had the munchies hardcore, so we decided to get off the train and walk over.  To be honest, I wasn't expecting much.  It was a cheap hole in the wall pizza place, right next to Food City. Surprisingly, I found the pizza to be pretty frickin' delicious!  The sausage had wonderful flavor, the cheese seemed like REAL cheese (unlike that weird yellowish stuff on Little Caesars pizza ;] ) and there was just the right amount of tasty sauce.  The free seasoned crust was better than Hungry Howie's.   Actually, the entire pizza was better than a Hungry Howie's Pizza.  And we all know where Little Caesar's sits on the totem pole, so of course it was better than any Little Caesar's pizza also. \"Am I just drunk or is this actually really good?\"  I asked my boyfriend at one point.  He replied, \"no, this is actually pretty damn good.\"  I had my suspicions, however. I recall one drunken night, I even found Gus's Pizza to be tasty.  I know, I know.  I had a lot to drink that night... The next morning my suspicions were cleared.  We heated up the leftovers and ate them and the pizza was still super tasty. I have been back several times since, and have been itching to try their other menu items such as the wings and sandwiches.  This is the best place by ASU campus to get $5 pizza.  Actually, since I discovered it, I haven't ordered pizza from ANYWHERE else, so I can actually say this is one of the best places to get pizza in the Tempe area."}
{"text":"TL; DR version: Pretty decent if you want pizza and well-sized subs on the cheap. Taste pretty good, but not a lot of bells and whistles. Three stars because I like bells and whistles.     Actual review: I tried this place for the first time via delivery and ordered 2 buffalo chicken subs, one chicken bacon ranch sub, one steak and cheese sub and a large 3 topping pizza (green peppers, sausage and onions).   I ordered via Eat24 and the order took about 35-40 minutes to arrive. My order total was $37.52, just shy of $40.00, and fed three hungry teenagers and one adult. Not bad.   In the spirit of giving a good review, I should disclose that I love food and have  very discerning taste, but unlike other foodie reviewers, I know how to scale it down and keep my reviews relative to the type of food I'm eating. Okay so, bottom line: this is street food. If you're used to artisan pizzas, well seasoned layered sandwiches and fusions galore, then this place may not be for you. However, if you frequently try to eat on the cheap (Little Caesars) because you have kids or you're in college or whatever, then you'll probably appreciate Jimmy's.  Personally, I feel the menu has a pretty decent selection of foods; the pizza is a fair size and price and the sandwiches are large. I'm not big on pizza, but for those of you who prefer minimal marinara , good amounts of cheese and well-sized toppings, you might dig it. Like I said, I'm not into pizza but I actually liked theirs and found myself eating three slices. Not bad.   What stopped me from giving this place more stars were the sandwiches. I just moved here from dtown Phoenix where we used to order from the Italian Spoon, who offered a variant of subs as a meal with fries and a drink for $7.50. The subs are about 4/5ths the size of Jimmy's, but they're rich in flavor. Add to that the fact that you get a 8 ounce drink and plenty of fries, you can't help but call that a good deal. Unfortunately, though Jimmy's subs are a pretty good size, I didn't feel mine was that great. I had the Chicken, Bacon and Ranch, and though I felt the sandwich had a hearty amount of chicken and bacon, I found myself put off by how dry the chicken was. I recall ordering this sub specifically for the ranch, and maybe there was ranch on there but I didn't taste it. I don't expect succulent chicken from a street pizza joint, but if they splurged a little on more ranch I probably wouldn't have noticed or cared about dry anything. The bread is a ciabatta type texture, so that mixed with the chicken on each bite added to the dryness. Don't get me wrong, the bread is actually pretty good, but I thought to myself, \"why isn't there at least some shredded lettuce on this?\"... \"and maybe a couple slices of tomato?\" I'm just saying it's the little things... If they had hooked that sandwich up with a few more works, they could have squeezed those last two stars out of me, but instead I'm over here kicking myself for not having ranch in my fridge. As a suggestion, when people buy subs, they want loaded, dripping, hot messes filled with that nasty-good stuff (veggies, chili beans, cheese upon cheese upon cheese, BACON, etc). I forgive y'all for not struggling to be excessive, but for $7.50 a sandwich at least throw some ranch and lettuce in there, please.   You can't beat the pizza price so I'll order again, but tbh I'd give the steak sub a try and will probably pass on the rest from now on.  Update: The steak sub is a lot better :). Thanks for reading."}
{"text":"This place used to be the best value pizza I knew. I first tried it three years ago on a monthly basis. A year ago something changed about the food, & the service was awful. I didn't go back until today. It was completely horrendous, like it wasn't even the same place.   I ordered to go, one pepperoni, one cheese bread, and one pepperoni & sausage. (Pies were still cooking when I got there, so I know it was fresh). I live in Tempe, about ten minutes from the store. I got home, got the pizzas out to see that the boxes were DRENCHED with grease. Opened up the box to grab a slice, the pizzas aren't even cut properly.  I begin to eat it and the crust is dry, tough, flavorless, and seems to be overcooked.  Toppings and cheese were measly (even the two topping that I paid way more for)   Death to a once great pizza shop.  Never coming back again."}
{"text":"Fodd is definatly inconsistent. the first time we came here the pizza was great, so we tried something different and ordered the toasted sub which are great, had a pizza delivered this weekend not so great, it seemed to be half cooked and the side of the pizza was smushed like the driver was driving crazy to deliver. also this time wings were not so good. to bad little ceasers were closed :("}
{"text":"I ordered a large pizza with jalapeños and on one half I added steak and accompanied it with some garlic bread sticks. I did recieve what I ordered and it Looked okay(nothing special, didn't even hit me with a smell that made me want to eat it) but wasn't as hot as I would like to enjoy my pizza. I wasn't surprised as it had been nearly 50 minutes when I called to check on an ETA for my order and they then told me an additional 40 minutes average. I was surprised when the driver called me 21 minutes after that when he was at my door...(good on that part I guess) I paid the man and I was just so excited to get my food that I even left the man with a 4 dollar tip(considering they did rush after I called.. Still more than usual), I was just hungry at this point (3:15 am, ordered at 2:01 am). I started eating my pizza but the taste was very much not what I was expecting(I'm used to Papa Johns). The ingredients (the cheese and idk what else) tasted cheap and lacking freshness and my sides were falling off as I ate my slice. There was a very strong flavor of oregano that I tasted making me really not want to keep chewing. Ugh it's 3:45 am now and my stomach is cramping up I feel nauseas and I am gassy just after barely being able to finish 2 slices with that odd flavor that I did not for one enjoy, and did not order whatsoever.! I was trying to order something since 1 in the morning but my apps' were shutting down and giving me hard time and then this is what I get.! I really regret even ordering through this app and can't believe how shitty my experience was. Disappointed for sure .."}
{"text":"this place is horrible. the delivery guys are crazy. this rude rapist looking guy knocked on my door at 2:45am like the police for 5mins. due to me not answering he should assume he has the wrong place. i have insomnia nd epilepsy but his man wakes me up 3 hours before work over some pizza from a place i never heard of! And he had the nerve to have a rude look on his face when i answerered."}
{"text":"The only reason I'm giving them a 5 star is because the first driver did not want to help us at all. We tried to reason with him .....he could not be reasoned with . We did not have our ID for the original order . I have the same last name as him and he said they don't care.... they will take it out of my check.....?  VERY RUDE! We called back and the gentleman MATT  was very helpful !!! He got us a pizza here very quick with a very respectable driver who knew what she was doing. Thank you guys for making it right for us out of Towner's . After all the problems and confusion ....they made it right for us. Thank you ."}
{"text":"$5 large pizza that ISN'T Little Caesars? I'm already a fan. Add the fact that they flavor the crusts and offer bomb wings AND breadsticks? I'm sold. Delivery is slow, but what do you expect when it's good food on the cheap coming to your doorstep? Well worth the wait."}
{"text":"I can't really give a review about the food since we ordered delivery and never got the food. when we called they said they couldn't find our apartment so they went back. we asked for a refund and got no issues with that. Unfortunately two days later we were charged for the food anyway. when we called in the manager said it was marked as delivered but after being brushed off for the day the manager finally gave in and gave us our money back."}
{"text":"Ordered here a couple of times and never got what I wanted. They Always forgot the flavored crust. They have always been about 10 to 20 minutes late. Pretty sure the delivery guy was on something. I give big Jimmy's a huge thumbs down. Boo!"}
{"text":"My how things have changed.   I have been a fan of Big Jimmy's since their first week open. The pizza has always been awesome for $5 (heck, I'd even pay $10 for it). But tonight went completely different than the other 20 or so times I have ordered from there.   First, the guy taking my order over the phone had to have me repeat literally everything. I started to wonder if it was joke! Then when I went to pick it up, the girl at the counter did not even look at me or say hello. She just said, \"What can I get for you?\" and seemed extremely pissed off to be there. The pizza was not a good as normal, there was too much cheese (so much that it wasn't completely melted), the pepperoni seemed undercooked as well. The garlic parmesan seasoning for the crust literally covered half of each slice and was a mess. I also decided to try the boneless wings.....poor choice! Basically cheap frozen chicken nuggets with hot sauce poured on top of them (Not tossed or anything).   I have never had a less than perfect pizza from Big JImmy's and the college guys that usually are working are sooo friendly, funny, and professional. What the heck has happened??? I hope it's not a normal thing from now on. Big Jimmy's will get 1 more chance and if things are the same....I'll just pay the extra for dominos."}
{"text":"Ordered from them and was told an hour and ten min wait. It took well over an hour and a half and the people on the phone were short and didnt take any information from me when I called to tell them about the gate code. I had to remind them to contact the driver but it made no difference. They had one elderly driver due to what was told to me was because the younger people didnt want to work late. My pizza was hardly warm and I feel bad for the elderly delivery guy running pizzas."}
{"text":"They're in this weird transitioning period where the menu pricing contradicts the pricing written on the boxes. Besides that, pizza was average, nothing too crazy. If it's late and you want some cheap pizza,head on over. I'm sure I'll find myself there when I get that late night craving. 3 cheesy slices out of 5."}
{"text":"I've been getting pizza ads on my door a lot lately, and Big Jimmy's is the latest newcomer. I decided to try to find the best $5 1-topping pizza in my area. While Big Jimmy's is OK, it didn't win. I'm not going to tell you who won (here).  Big Jimmy's $5 deal is for a 14\" \"large\" 1-topping pizza.  Normally everywhere else, a large is 16\". The crust is fluffy and merely barely painted with cheese, creating an illusion. It's not bready like Little Caesar's, which is good. If I want bread I go to the supermarket. Not much cheese, but the sauce is OK, not overly salty like Hungry Howie's, and the pepperoni is ample. They also offer crust flavorings sprinkled on -  I recommend the cajun.  Overall the pizza was satisfying, didn't give me heartburn later that evening, and didn't piss me off like Little Caesar's. Give these guys a try, they're trying to make it, and every little guy deserves a fighting chance. They also have a $10 Jimmy's Special pizza which looks promising! Lots of toppings. I would've gone for that if I wasn't doing the $5 pizza challenge. They deliver late, with a $10 minimum order. Spartan seating. Located next to Food City on Apache by the Dorsey light rail station."}
{"text":"Name and price change.   No longer $5 for a one-topping large pizza. At that price, this place was viable. At $7.50 for a large cheese (0-topping) pizza, it is not a good value.   With SO MANY places to choose from, there are better values to be found."}
{"text":"Update: In response to the \"stop whining about them raising their prices a dollar\". I used to get a large 1 topping pizza for their deal for $4. Now if I get it in the evening it's $10. That's a 250% increase  Used to be amazing. Great deal. Went here all the time, even though I live in chandler. Came at 2:00 am, lunch, on my way home from work. Got multiple pizzas. I'd probably get come here at least once a week, if not 3 times. Then they jacked the prices way up and gave it to their name. Haven't set foot in it since February."}
{"text":"Terrific. The pizza is close enough to when I lived in Philly, and the flavored crust is great. The chicken is great, I tried the hot."}
{"text":"a large pizza is $5 here, and it was delicious for that price, but of course I've had better tasting pizza that cost way more than that. I'm rating the delivery service; I placed an order via Yelp and it came only 5-10 min past the expected delivery time. I had already pre-paid and tipped though Yelp. The delivery guy came DIRECTLY to my door; I live in a condo complex and no other delivery person has done this while I've lived here so for that alone, 5 stars from me. Food was hot, yummy, cheap and fast. I would definitely recommend for late night deliveries in Tempe."}
{"text":"For a $5 large, 1 topping pizza this is fantastic! It's cheap, and it's good! Delivery and taxes came to about $4 which isn't terrible either. The quality of the pizza is just fine, but don't expect anything gourmet...great for ASU students and ASU alum who want delivery on a budget!"}
{"text":"This place is home run!! Had some drinks at the casino, decided we wanted pizza, found this place on yelp, and we were not disappointed. We thought we heard them wrong when they said our large 3 topping pizza would be $8.50, but that was it! The pizza had great taste, and the people were very friendly. Plus, they are open until 3am. This place ROCKS!!!"}
{"text":"Ok so I've been meaning to write a review for this place for a while. Awesome. For the price you deff get your money's worth. It's not like the \"5 dollar little Caesars pizza\" that looks and tastes like shit. These pizzas even surpass some of the more expensive spots in the area. The crust is good and the toppings taste fresh. I would recommend."}
{"text":"Great prices for pizzas loved it thanks for having great deals I know I will be coming back here sooner or later."}
{"text":"I don't see what the complaints are all about. If your expecting a gourmet pizza for $5 then there is something not quite right with your expectations. The question is, \"is the pizza worth $5 bucks?\" Yes, in my opinion it is. Hell, people pay a lot more for a lot less at other places. Why not be creative and add your own toppings to the $5 pizza at home?  I actually ordered 2 cheese pizzas and a steak,cheese & mushroom sub which was actually pretty good. At home I added sliced tomatoes, spinach and feta cheese to the pizzas and drizzled a little cold pressed extra virgin olive oil on it. Broiled on low for 3-5 mins and I had a masterpiece pizza. I'm giving 3 stars because I am combining value + product + the super fast delivery. Thanks!"}
{"text":"Use to be a hook up but they one again changed the size of 5 pizza smhhhhh. Glade I'm moving away"}
{"text":"Order from here all the time, good pizza for the price. Only complaint i have is once in awhile the cheese bread would be undercooked and would have to finish it in my oven but other than that it's all good."}
{"text":"There is a reason the large pizza is only five dollars. Lacking in seasoning, covered in grease, with crust that tastes of cardboard... you get what you pay for. The only remotely redeeming thing was the bread sticks and even those were disappointing to say the least."}
{"text":"I went here at about 3am and ordered a large pizza, some bbq hot bone in wings, and the cheezy bread. Everything was delicious! The cheezy bread was the best I've had in a while and they even have flavored crust."}
{"text":"Pizza is always tasty. And for the price, yah can't beat it. The counter girl is always real cool. Fast, cheap and hot: just the way it should be"}
{"text":"This place used to be a good deal. You would get 2 large one topping pizzas with a flavored crust for just 10 bucks and the large cheese pizzas used to be 5 bucks. I called today for a pick up and was told that there's a new owner now and all the prices have gone up. The medium pizza is now the one that is $5. I'm not down with that. The large pizza was already small as it was, so a downgrade to a medium for the same price isn't as good of a deal. I guess back to little ceasars and pizza patron I go. Bye bye little Jimmys."}
{"text":"Nothing to see here folks, keep on moving. Big Jimmy needs some big help. The pizza is more like a doughy bread with toppings on it because even during a reheating process, the crust never gets crispy, it remains somehow amazingly bready and bendable. The crust had slightly more flavor than Howie's, but i also had a 5AM surprise with Jimmy's that was very exclusive to this pizza. This lasted several hours and now at noon, I am finally ready to start eating again. Keep your expectations low and keep an extra roll of TP on hand for the full Jimmy's experience.    Jimmy knows TP."}
{"text":"The is the perfect spot on a weekend night after having a few drinks. The pizza isn't gourmet but it is 5 bucks and delicious. You can choose from several crust flavors and to add toppings it's cheap. Definitely not the place you want to take someone on a first date but if it's late night and you have the munchies this is your spot."}
{"text":"I'd give them negative stars if i could.  Whoever answered the phone MULTIPLE times tonight (10/26/13 between 3:45 and 3:52) picked up and said, \"Big Jimmy's we're closed\" then hung up all three times (they claim to be open until 4 AM). I called AGAIN and the guy picked up and I immediately said \"I'd please like to place an order for delivery\". He rudly said \" so you'd like to place an order 2 minutes before we close...\" I said yes. He hung up on me.  When I was in the pizza business, we accepted orders up until our CLOSING TIME. He hung up on me. I will NEVER order from this place again.  If I could give them anything less than 1 star, I would. I would actually give them a \"hope this place closes down.\"  The pizza is decent, but if that's the kind of service you get, i think it should be SHUT DOWN... or maybe someone should just get fired.  The pizza is alright, but i'd rather deal with a customer-comes-first kind of company."}
{"text":"As always, you can't get a better pizza for $5.00.  This time I also ordered an antipasto salad and it did not fail."}
{"text":"I love big Jimmy's when they don't burn the crust!!!  Great drunken pizza- good crust, sauce and cheese.  However, the burn the crust about half the time we order from them.  If they were consistent with their cooking times, we would never order from anywhere else.  Awesome wings too."}
{"text":"I ordered the Big Jimmy special with pineapp le instead of mushrooms and garlic butter crust.  It was the best cheap pizza I've ever had.  They weren't skimpy on the toppings and it reheats well in a toaster oven.  I will order from them again!  I do want to try their other items.  The delivery guy said Big Jimmy no longer owns the joint, but I give high praises to the new owner.  Thank you!"}
{"text":"What happened to big Jimmy's $5 pizza? I don't know if there is new ownership or what but I will not be going back. This used to be a good place to go. I was always treated with food service until recently. I went online to check their hours and the website still says Big Jimmy's $5 pizza but they don't have a pizza under $6 anymore. When I went to go pickup my pizza I was surprised by the price change since they are known for their $5 pizza. Not only was I paying extra for the pizza but the worker also charged me for using a card and for ranch. I went in expecting the pizza to be $5 and some change and left paying $8. This is nowhere near a pizza that should be worth $8. Not only did the prices changed but the quality of the pizza did as well. I got barely and pepperoni on my pizza and the crust tasted like cardboard. Bring back the old big jimmy's."}
{"text":"Good! It came pretty quickly and was exactly to order. Not mind blowing but definitely tasty."}
{"text":"If you're in the market for a five dollar pizza (and let's face it, we've all been in that market), Big Jimmy's is THE place to go!  Hands. Down.  Is it the best pizza in Tempe?  Probably not.  Is it some of the best pizza in Tempe?  Arguably yes.  Is it the best value?  By far.  For five dollars you get a great large pizza with one topping and (if you're into it) a flavored crust.  As far as the pizza goes, it's REALLY REALLY GOOD!  Yeah, it's a five dollar pizza, but setting aside the price, it's still a very, very yummy pizza.  The crust tastes great, and unlike some other five dollar joints, the crust serves as more than just a cardboard-like medium upon which to transport cheese, sauce, and toppings to your face.  Big Jimmy's crust actually tastes great!  It's nice and soft and has nice pockets of crispness.  Plus, you can get it \"flavored\" (basically just seasonings on the exposed outer rim - like Hungry Howie's if you've been there).  The sauce is also quite good, and they put on the perfect amount.  Some cheap pizza joints go way to easy on the sauce, but these guys keep it in proportion so it play's its proper role.  The sauce is very nice, and has a bit of heat and spice (not too much, anyone will like it, but it really adds to the pizza).  The toppings are also very fresh and flavorful, and the cheese is generous and melty (what else can one say about pizza cheese?).  The service was quick and the staff was very friendly.  If you're in the mood for more than just pizza, they also have wings and subs (which I have yet to try).  Plus, if you're really hungry (or need to feed more than just a couple people), they have great combo deals, or an 18\" 1 topping pizza for $9.  They do deliver, and they're open until freaking 3AM every night (4AM on Friday and Saturday).  So, in summary, if you're in the mood for some damn good pizza, Big Jimmy's is hard to beat unless you're willing to spend a bunch more and do something like Spinato's (which is better, but Big Jimmy's will still hold it's own against them).  Skip Hungry Howie's, skip Little Caesars, skip Domino's, please god skip the frozen pizza aisle, and hit up Big Jimmy's.  Your tummy and your wallet will thank you!"}
{"text":"Let me clarify.  It is NOT the best pizza I have ever had (shocker, I know).  But as far as $5 pizzas go (and even most quick take out places, i.e. Dominos, Pizza Hut, Little Ceasar's), it is definitely one of the best!  Being so close to ASU's Tempe Campus, the location is perfect.  This is a great place to grab a cheap bite to eat (for students or staff)."}
{"text":"Big Jimmy's recently opened in the complex on Apache, a couple doors down from the Food City. Their main thing is $5 large, 1-topping pizzas. Though they have other stuff on the menu, like wings, salads, and sandwiches, and specialty pizzas for $10. Since they are brand new and within walking distance, I decided to give them a try with a nice standard - a large pepperoni $5 pizza.  The dough was nice and soft, with a bit of chewiness, and they didn't skimp on the one topping; there was plenty of pepperoni on it. They also offer free crust flavorings (butter, butter parmesan, butter garlic parmesan, and some others I'm forgetting), which was a nice touch. I know Hungry Howie's also does crust flavorings, but I find Hungry Howie's crust to be almost unchewably tough, so Big Jimmy's beats them there. The main detractor I think was that the pizza was a little greasy, but I've had greasier. Overall the pizza was good, cheesy, and my boyfriend and I made short work of it.  As for the business, the guy on the phone was friendly when I called to make the order, and woman behind the counter when I got there was also friendly. I was only in there a few minutes to pick up my pizza, but I live nearby so I know that the unit was previously empty, and so everything inside is pretty much brand new and sparkling clean. They've got a few tables inside to eat there as well.  I'm sure I'll be ordering from Big Jimmy's again. There's simply no getting around the fact that a $5 pizza (with tax: $5.44) is a hell of a deal, and it's pretty tasty pizza. Another bonus is their hours - they're open until 3am during the week, and 4am on Fridays and Saturdays."}
{"text":"I just order online for delivery. she said 45min -1 hour. I order 9.53 the pizza came at 9.58. Just 5 min. That's find but when I open the box. Pizza is very cold. My husband ate some pice and I have some bite that is very dry. I try to eat because I never return the food all in my life before, but I can't eat that all even put some sauce on. I'm very hungry,but I have to return. It's over cook. They never check food before delivery I think. They told us we should order somewhere else when we call back to tell them about problem. Then why don't you put the big side on your store. \"Somewhere else better Pizza\""}
{"text":"Great pizza fair price quick pick up. Sign on the door says they're looking for drivers"}
{"text":"Definitely better than little ceasers. AND free seasoned crust!? Big thumbs up. The garlic parm  crust has a lot of flavaaaa"}
{"text":"i tried to order a pizza late night. since they are the only ones open. they were very rude over the phone when i was joking around with them. i made one comment and they put me on hold in which the manager didn't respond at all. i had to call back to get him to answer. i would caution everyone to not eat here. they are offensive and they are extremely rude. i will never eat here again, i am going to try to contact the owner to let him what an ass the manager is."}
{"text":"fresh delicious pizza! their not stingy with their toppings,  I like that about their pizza. the crust is probably the best part too. delivery is quite fast!"}
{"text":"Pizza is above other 5$ pizza places in the area but the boneless bbq wing sauce taste more like cocktail sauce to me they also put wayyyyy too much bbq sauce. Besides that the place looks clean . :)"}
{"text":"When I saw that it was $5 for a pizza, i wasn't expecting anything all that great, but this was not the case at all! Their pizza was amazing! and we did't have to wait more than like 15 minutes to go pick it up! I'll be getting my pizza from here from now on."}
{"text":"It's not the best pizza in the world, but for 5 bucks for a 14 inch one topping pie, it's pretty darn good! Their steak and cheese sandwich and wings are pretty tasty too and also are very affordable. They deliver really late (I think 3 am?) as well and have a decent delivery radius. The staff is always friendly and nice. They have a few tables but I consider it a strictly carry out or delivery place."}
{"text":"Although I'm Leary of their flavored crusts This is a very hard deal to beat. The pizza is pretty big and they deliver for when you don't want to get caught in their parking lot at night."}
{"text":"I love going to big jimmmys and I love  when Jeanette help she is very kind and friendly! The pizza is a great price and fast."}
{"text":"ordered: - $5 medium pizza, bacon  pros: - cheap, fast, tasty - usually, pepperoni is my go-to topping but the bacon here is awesome - friendly service  cons: - location is janky - i feel like i'm cheating on little caesar's  protip: - if you feel the need to leave a one star review because they've increased the price of their pizzas by a dollar or two, you probably need to up your income game fam"}
{"text":"Good food. We don't actually live in Tempe but will drive here for late night pizza. Medium-sizeish pizza with five toppings for 10$ is a good price to me. Chewy crust and good thickness overall. Ham was one of our toppings and normally I don't like ham, but this is a thick cut and smoky ham... So now I always get ham here.  It's best warm and doesn't taste great reheated. We found that out trying to take it home. (But maybe that's true for all pizzas!)  The wings are great, too. Crispy slightly and meaty. We got hot BBQ and it was tasty but definitely wasn't hot at all. I think the wings could be cheaper, though."}
{"text":"The chicken bacon ranch pizza was really good. The chicken was a wee bit too dry but the garlic buttered crust was so yummy! Delivery showed up on time from what was estimated."}
{"text":"*warning*   This pizza is better than you will anticipate. I know your like me. Your thinking 5 buck for a pizza, no way is this gunna be great.  We picked up a few nights back and I am glad we did.  I actually like there flavored crust also. Puts a smile on my face when I can grab a pizza for a couple bucks and easily feed two people. If you need to feed 3 people it's only 4 bucks more for and extra large.  Call them up - order some pizza, and then thank me later.. :)"}
{"text":"Two letters. OK. Maybe 4 RUDE."}
{"text":"Pretty good! I ordered a $5 pizza, hot wings, and Greek salad for delivery which didn't take too long for lunchtime on the weekend. Pizza was pretty ok- have to say I think I prefer Hungry Howie's by a bit for the same price (just personal preference), but I loved the wings and salad. They were both awesome. Wings had plenty of meat and sauce and salad was large with lots of toppings. Try it out"}
{"text":"So pros for this place is delivery was quick, ordering was easy, but when it came down to our food...things went downhill very quickly. There were 3 of us, so this wasn't just me, but our breadsticks literally tasted like a salt shaker was broken on top of it. I love salt, I will eat the salt off of the bottom of a pretzel bag, but these breadsticks were completely inedible. My friend even rinsed if off in the sink! The pizza was decent. Again with the sickeningly salt crust however. The toppings weren't generous and the overall taste wasn't anything to write home about. We usually go with Gus's for late night pizza delivery and maybe will continue. We have a lot of leftovers that I think we will have to throw out now."}
{"text":"when it was $5 large 1 topping it was worthy of 5 stars in terms of value and taste. now its 3 cause its just another normal priced place with above average pizza. really dropped the ballsacj on the more than $5 thing what a crock kf shit. oh well i still eat there when im shit faced lol"}
{"text":"So I place a delivery cancelled the order and the delivery driver still shows up so I give the guy a tip and buy the pie out of spit thinking everyone would be happy we looking at the pizza and it looks like it was drop and sat in the box for over an our the cheese and the sauce was cold  call bad asked for a credit or the driver to bring my cash back which he never showed. We didn't get to est cuz the pizza was freezing... Come your to cheap to give up a 1$ valued..... Pizza  then he says I have to come get the cash if I want the return wat a. Rude manager he was working Monday night December 6 I called before 10 he didn't come till 11 08 .it's complete bs that I have a right to my money being retired and I will be In touch an extremely furious. Cuz I'm stuck with two cold pizzas and out 16$ way to go big Jimmy's you need to check your staff and hire a new and more delivery drivers"}
{"text":"I was impressed.  I had really low expectations and it turned out to be one of the better delivery pizzas around here.  Would recommend most definitely."}
{"text":"When it comes to cheap pizza I am always on board. I found Jimmy's during a yelp pizza search and am glad I did. Their $5 (well $5.46 with tax) is one topping and includes one of ther flavor crust options. I got the parm/butter/garlic this time, but it was a little too much for me. I'll go with just the butter/garlic next time. The cheese is flavorful and the pepperoni that perfect mix of spicy and sweet. This pie is greasy, make no mistake. I went through a good number of napkins sopping it up. But it's so yummy!  I would recommend this for an at-home movie night. The decor is basic white walls and simple chairs. It's not a place to sit and hang out. Take this home and cuddle up with someone. Or alone, as I did. And if nothing else, they deliver until 4am!  Enjoy, Yelpers!"}
{"text":"My turkey club was pretty bland and dry, not to mention it had one small slice of tomato for the entire huge sandwhich. The $5 cheese pizza was equally as bland and dry. Not the worst, but I won't be rushing back."}
{"text":"First time ordering from here.  Not fancy, but hot, filling, and tasty!  Order taker was polite and efficient. The food arrived in 35 mins, piping hot. The delivery driver was polite and friendly. We got three pizzas and a sub.  The consensus on the pizza was that the toppings were plentiful and well distributed. The crust wasn't fancy (we got it plain), but had a nice texture and flavour.  The sub was, \"Really good!\" was the most detailed response I got from spouse.  We will order again."}
{"text":"As far as $5 pizzas go, Big Jimmy's is among the top two for the area. The toppings were generous and the pizza was delicious. Just enough cheese and just enough sauce on top of a surprisingly satisfying crust.  I got my pizzas after 2:00 am and the staff was super friendly, and although they said 20 minutes, it was closer to 10 minutes."}
{"text":"Excellent and friendly customer service, food is always ready on time and quickly, great food. Great prices, obviously."}
{"text":"Decent, for a $5 pizza joint. The sauce definitely had that pre-made, paste texture; which is a pizza sin. Although, the cheese was surprisingly fresh.  However, you're better off spending your $5 and getting a slice or two at somewhere else."}
{"text":"Their pizza does taste good when it's fresh, but you get what you pay for.  It is greasy, and not top of the line, but it's super affordable.  Definitely hits the spot and we used to go here pretty frequently, although we haven't been in quite some time.  We usually go here when we are going to get some groceries at Food City next door."}
{"text":"The 5 dollar pizza is a great deal! They treat customers very great and the place is super quick and the pizza is yummy! Love that they keep their prices low for those of us college kids on a budget. Will definitely come back for that deal!"}
{"text":"Ordered a pizza at 12:25am. 1:50am rolls around...still no pizza. Called asking what was up, they said the game let out so deliveries were running late. Not willing to offer a discount or anything for it running way over. Then they said they wouldn't be delivering the pizza. And the employee and manager were rude to boot. Terrible customer service. Have no interest in finding out the quality of the food. Won't be bringing my business here, which is unfortunate because I'm all about supporting local businesses."}
{"text":"They make a pretty dang good pizza, especially for $5 (if you pickup).  It's good stuff, and reheats well. The best I've had so far since I moved here."}
{"text":"Let me just start by saying I wasn't expecting much in a sketchy looking strip mall with a sign that said $5 Large Pizza at 2 in the morning on memorial day weekend, you would think that you would get bad food poisoning instead of good food, this time I'm happy to report that Big Jimmy's was hands down the best pizza I have had in awhile. I ordered 2 large pizzas ( a sausage and pepperoni), unlike the douche bags on here that ordered 5 or 6 minutes before closing time I walked in. The guys behind the counter were patient and polite. I've worked in pizza on and off for a total 6 years so I know all the hassles and dealing with unreasonable customers. It took 13 minutes which is about the correct time for a pizza to cook all the way thru, the sauce was amazing not overpowering or not enough, the amount of cheese on them would have made a fat man giggle, the pepperoni did not come from a cardboard box marked hormel, and there was enough sausage on the other pizza it would have Hannibal Lecter reconsider his choices in dining. I would have taken a picture however that would be impossible since every single slice is now gone. Lastly there were no bubbles in both pizzas. In short this was well worth the risk will definitely go back and highly recommend"}
{"text":"I love this place. I have been ordering pizza from here since literally the first week it opened. It is affordable and much better than anything you will get from Hungry Howies, Dominos, or Little Caesar. The best part is that they deliver $5 pizzas with only a $2 delivery fee. You get a one topping pizza for 5 dollars and they do not differentiate between what is a premium ingredient or not. For example, you can get a feta cheese pizza for the same price as a pepperoni. In the beginning the crust was a little inconsistent but now that they have gotten into a groove it is my go to place for a late night za."}
{"text":"While having a pretty crappy night without water at our recent hotel getaway, we decided to try any random pizza place that we could find. This place nailed it. Fast,tasty, well worth the price. We will definitely go back again."}
{"text":"I'm not usually a fan of the flat bread pizza but OMG I could have at the whole pizza! I got the supreme pizza on the thin crust. It was so good. There were no left overs. We usually end up taking pizza home or tossing it but not with big Jimmys pizza. We destroyed it! In fact... I think I'll order another right now"}
{"text":"Can't go wrong with this place, especially when you're on a budget. A medium cheese pizza for $5 and it was delicious NY style. Staff was super friendly and they had it ready in 10 minutes. I ate it too fast to take a picture."}
{"text":"surprisingly above average pizza at a low price. Way better than the other better known alternatives for budget pizza, but even better is that they are open Late!"}
{"text":"TL;dr Same price as Hungry Howies, but better pizza just by a little  I always pass by this place because I take the light-rail. At some point I decided that I should probably check it out on Yelp, and if the reviews are positive I would make a quick visit here.  Thanks Yelp! If I didn't read some of the positive reviews, I probably would have never stopped by what sounds to be a sketch pizza place next to Food City. I think Big Jimmy's stole \"mucho sabor\" (lots of flavor) from Food City and put it all into their pizza. It was great, especially for $5.  More topppings than Hungry Howies, a healthy amount of greese, and a perfectly well-done crust make Big Jimmy's my new favorite $5 large pizza. I'd say that HHs and BJs are very close, except HHs crust is always a slight task to eat, where as BJs crust was very soft and more enjoyable to finish.  Of course, I might have to go to HHs just because my friends might not want pizza from a place that sounds so sketch. Its not sketch, its just amazing pizza."}
{"text":"This place is soooo good! Mmmmm yummy!! New guy with the hat is super cool! Go get a pizza already....."}
{"text":"It was 2 am, we were drunk/hungry, and happen to need dairy-free options. I called approximately 10 late-night pizza places, and this is the only one without dairy in the crust or sauce! Yay!   We got a large cheese-less pizza with 3 toppings (double olives and jalapenos) for $8. Not a bad deal at all. It was ready in less than 15 minutes. The toppings were scanty at best, which is always disappointing; however, we were ravenous, so only a few complaints were exchanged before digging in.   It's not the best dairy-free pizza I've had, but it's not designed to be, so I can't make a legitimate complaint about that. I'd eat this pizza again."}
{"text":"I had a flyer on my door when I got home from work today and since I didn't feel like cooking, I decided to give them a try. I checked their website out online and then gave them a call for delivery. The guy who answered the phone was very friendly and patient while taking my order and getting the information he needed. The pizza arrived in the quoted time and the delivery guy was also friendly and professional. The pizza was worth the price and you do get a lot for your money. I would order from them again."}
{"text":"I can't believe the reviews on this place. We recieved big jimmys flyer in the mail so we thought we would stop by and try them out.. First off it was gross watching people cooking the pizza eating while preparing the pizza's and answering the phones  Not once did I see someone wash theirs hands and its gross to be eating while you have customers in the store watching you but they didnt seem to care.. We got home with the pizza's and bread stick  EUCKKKKKKKK the pizza was doughy  the sauce had a horrible taste to it.. My husband ended up throwing it all up we wasted a whole and half of pizza no one could eat it.. the crust had so much garlic on it you could not enjoy it at all. This place is a knock off of hungry howies which I am not a fan of but I'd rather eat howies than Big Jimmy's.. The reviews from others they must not have taste buds at all......NASTY NASTY NASTY....we were so looking forward to a good pizza but this place ruined it for us.."}
{"text":"No longer $5 large one topping pizza. In fact, they even removed the $5 part of the sign outside."}
{"text":"AAAAAAAAAAAAMAAAAAAAAAAAAZZZZZZZZZZZZZZEEEEEEEEEEEE. $5 for a very tasty, nicely made pizza PIE.  wooooop!!! Fast service, quality ingredients.  Their website is kinda meh, but their pizzas rule for the price!!!  Mostly a to go place.. they also sling toasted subs, salads, wings, etc. Also, big awesome? Their Mushroom pizzas use FRESH MUSHROOMS.  no slimy canned fungus!  woot!"}
{"text":"Gotta love Big Jimmy's.  This place hasn't been open for very long, but it is quickly becoming one of my favorite take-out/delivery pizza places (watch out Hungry Howies, Gus', etc). They have the same deal as most other places nearby--$5 for a large and you can choose from a variety of crusts, including garlic parmesan (personal favorite right now) and cajun (may be a bit too salty for some people). I've eaten here about 5 times so far and have only felt sick once afterwards--a pretty good ratio for me in regards to take-out pizza in Tempe.  I live the perfect distance away (0.7 miles according to Google Maps): I can start to walk to my car, call Big Jimmy's, place my order, and it'll be ready by the time I pull into their plaza. They don't have parmesan packets ready, but they will fill up a small to-go container of parmesan if you'd like some.  You can see the entire kitchen when you walk up to the counter and they seem to keep it really clean. There is a light rail station across the street and Park and Ride parking nearby. Can't miss the sign from the street."}
{"text":"I attempted to place an order here tonight and was shot down by the person taking the phone because I was on the other side of their border for delivery. Even after offering to order extra items and add another delivery charge on top of it. Good Job of throwing away a 50 dollar order and at least 15 dollars in tip for your driver."}
{"text":"The guy that took my order over the phone sounded like he was not havin it. It was kind of like he was trying to get me off the phone and didnt want to talk to anyone! See how my food turns out....."}
{"text":"This is a great $5 pizza that blows little skeezers out of the water. Their flavor crusts are delicious, and pick on up, and I promise you the smell will intoxicate everyone you walk past.  I was hesitant, but after a long day in phx, I got off the light rail and picked up a big jimmy.  The boneless wings aren't too bad, but really if you want a cheap pizza that will treat you right go Big Jimmy, go home."}
{"text":"Nice!  Cheap, fast, great pizza.  $5 will get you a one topping large, and $9 will snag an extra large.  For the price, you can't beat it.  They'll do pizza right, and deliver it to your door in less than an hour.  I would call this more of a delivery or pick-up place than anything else.  They have only a few tables, so I wouldn't recommend this as a sit down pizza joint unless things are slow--they fill up very quickly.  The floors and walls are concrete or brick, the table and chairs are spartan.  Never mind the furnishings or the decor.  It's all about the pizza here.  Service is great."}
{"text":"I liked the thin crispy crust. The wings needed to be more done to me. But those that were did have good flavor."}
{"text":"Honestly my go to spot on a late night or because I know they'll be open and their pizza will be hot. I never have to wait long what so ever. And the workers are friendly and fast. Just what you want after a night out."}
{"text":"This was the first time I've ever ordered from this place and I'm wishing I had just ordered from somewhere else. My order was only an oven baked Sandwich and a 2-liter of Sierra Mist. About ten minutes later after I placed my order, I get a phone call saying they're out of Sierra Mist, which is no biggie. Then I was told my order would be about 30-40 minutes which I was fine with. My order doesn't get delivered to me after more than an hour and the delivery driver even asked for a tip. I still tipped the guy (mostly because I'm also in the service industry) and was just relieved I finally got something to eat. As soon as I pull my sandwich out, it's almost no longer warm. I should have just ordered from Dominos that way I could have at least gotten a sandwich that has its cheese still melted. Never ordering from here again."}
{"text":"Delivery was fast.  Driver was rude as she thought I was not going to tip her because I chose not to prepay the tip when I ordered online as she explained we live on our tips. I just wanted to give her cash and who gives a to before service is rendered!  Food was cold and she didn't give me a copy of receipt.  Called the restaurant was put on hold for 6 minutes.  Told them food was cold they told me there was no way. I would avoid this cold greasy food and poor service!"}
{"text":"Big Jimmy's = big deal for what you pay. I needed cheap-ish food in Tempe a few weeks ago to feed a group of 12 for dinner at my house. $5 cheese pizzas caught my eye and I looked further into their menu and deals. Looked too good to be true and it was totally legit! Without tip, I spent ~$60 for 4 or 5 pizzas [a cheese, a pepperoni, and a few special pizzas] and bone-in wings.   The girl with whom I spoke with on the phone to place my order was kind and helpful. She went thru their specials [including their $5 cheese pizza] and repeated back my order a few times to make sure it was accurate.   I'm not sure why recent reviews say that they no longer have $5 cheese pizzas because she told me so a few times.   I asked if they could deliver in a 30-minute estimate time frame and they were able and certainly did. My neighborhood is a little tricky so the deliveryman called me a little lost but nice to extend thanks for the directions. The pizzas and wings were piping hot and everyone enjoyed them. It's not gourmet hipster pizza, but for what I needed in a pickle Big Jimmy's delivered."}
{"text":"The three stars is more about the price than anything else. For $5 you shouldn't expect much. Their large is pretty much a medium anywhere else. If you've had a Little Caesar's hot and ready, you've had this pizza. It looks and tastes the same. If you're down for a cheap/quick pizza, this is your place. If you're expecting good pizza, you should probably go somewhere else. The people working the place seemed nice."}
{"text":"Rude as hell!!!!!!! Im sorry but no matter what time of day im calling for a pizza i deserve the same customer service that everyone else gets. So rude.. i decided not to place an order in fear that they would probably do something foul to my pizza.  You all messed up treating me like crap...lost a lot of  business. Straight disappointment.  Had to physically call to even find out about their menu since their website didnt even provide \"menu\" information.  Horrible...just horrible experience. .i could go on..but im done with this establishment #byefelicia"}
{"text":"I LOVE PIZZA!!! My friend and I ordered a pepperoni pizza for carry out. The pizza was sooo good! I love the crust, it's thick and buttery. I do have other favorite pizza places, but for the price this is awesome food. I'd order again."}
{"text":"Pizza was little caesars quality, service was very disappointing. We just ordered ordered one large cheese and one large supreme pizza. We received one large pepperoni and one large supreme. When I asked to have another one delivered due to religious restrictions, the man on the phone replied \"I can't understand a word you're saying...\" And hung up on me. Sorry you messed up my order and caused us the inconvenience but you didn't have to b rude about it. A simple apology and a cheese pizza would suffice."}
{"text":"Don't let the fact that it's a $5 pizza fool you - this pizza is awesome! Best crust in Tempe. The wings could be better, though.  I've ordered from here several times, always delivery. Fast and friendly. If only they had online ordering. (2013 first world problems!)"}
{"text":"Very average pizza with fairly speedy delivery. The garden salad I ordered was more like the sub toppings chopped a bit smaller. Now that I ordered I can clearly say this would be my last option for pizza and salad if others were available and/or if there was a zombie apocalypse."}
{"text":"I had the pizza it was just okay. I tried the cheese bread it was just okay. I was a little disappoint because I expected a little more. But the plus is that it did arrive looking like a pizza, instead of being on one side of the box. Kudos Big Jimmy's"}
{"text":"Great pizza for the price, 5 dollar medium and 6 dollar large can have it delivered also"}
{"text":"In my entire pizza career I have never seen a pizza this good for $5.   If I was still going to ASU I would still be going here. I used to eat at Howies but these are the same owners from the old Howies right around the corner.   I would highly suggest that you try them out since their whole family has some serious experience in the industry."}
{"text":"This is the first and last time i will order from this establishment!  I waited over an hour an a half for my pizza and wings! I am very unhappy with the service and communication from Big Jimmy's $5 Pizza."}
