{"text":"Not impressed with this place! The service is great, but the food, No! Started with rissoto balls. They were way to mushy, had the brisket sandwich and fries. A complete joke. I have had better fries at McDonalds. Will not be back!"}
{"text":"First time and probably the last time I've dined there.    VERY noisy,  slow service.   Food was okay though a bit salty.   Lots of menu items listed garlic.  One large roll to split between my wife and I.   It was very good but the second offered roll never came."}
{"text":"Abby is the best!!! She made suggestions on what to get and how they taste best and she was 1000% right!! Great friendly service. Ask for Abby if you go!!"}
{"text":"Terrible. First time here too. Dry dry pancakes eggs were bland and sausage taste different than pork sausage. Won't be coming again"}
{"text":"Excellent service and delicious Eggs Benedict. Enjoyable experience. The server was gracious and efficient.  The food was hot and tasty."}
{"text":"On two separate occasions the customer service was horrible. The second time I even had hair in my food."}
{"text":"Decent enough place, but nothing overly special. The restaurant itself is stylishly laid out and nicely decorated, but ultimately that's where the attraction ends. On the whole the food is pretty generic and a little overpriced for what you get- if you're looking for a true diner experience (particularly if you're set on a good breakfast), I much prefer the Park 51 Cafe a few miles away.  The only real plus I can give Big View is their dessert menu. It's a nice stop if you're out late with friends and get a hankering for a slice of pie."}
{"text":"Stopped here for breakfast this morning during the morning rush. 15 minute wait was not bad at all. We were seated in the bar area which was nice, ordered coffees and placed our order for breakfast. 40 minutes later we were still waiting for our breakfast. Once our scrambled eggs and eggs benedict arrived, the food was room temperature and blah with no flavor. Eggs benedict had firm centers, and was served with ONE of the smallest pieces of asparagus I've ever seen. We were not impressed.   It's too bad the service was slow and the food was really disappointing. It's hard to mess up breakfast, but they succeeded. The restaurant has a really nice atmosphere and setting, but it's too bad it can't produce the service and food necessary for me to come back."}
{"text":"I have eaten here twice - dinner and breakfast. Both times the food exceeded the expectations I had based on past reviews.  The entree salad with quinoa was outstanding. The Farmer Tom veggie omelette was loaded with fresh veggie and made me feel less guilty about eating their outstanding grits."}
{"text":"Went there for the first time in a long time for dinner. Have gone a few times for breakfast. Our server was very attentive and prompt. Very interested in what we wanted, very personable, etc  We first ordered the calamari and then the fried risotto balls. Both were great. My son is a calamari freak, but these have chili line sauce and not his style. I ate the whole thing.   I had a big burger with immense onion rings. I couldn't finish it, but it was great. Wife had a salad with grilled chicken. Pretty plain, but she enjoyed it.   Decent local draft selection. NoDa, Triple C, Birdsong and OMB all on tap which is important to me.   Overall, a solid evening with the family."}
{"text":"Went on Friday night with my wife.  The wait was 20 min, or immediate if we sat at the counter, which is what we did.  My wife ordered the BLT, which was outstanding...it was a bit different than typical BLTs; it had cheddar cheese, three slices of bread, good tomatoes, good crisp bacon, and a little pesto.  This was served with home made vinegar chips (could barely taste the vinegar).  I had the Peppered Chopped Steak, which was outstanding.  Meat was tender and flavorful with peppers and onions, served with mashed potatoes and a side (i got green beans).  Food rated 5 out of 5 for what it was...good comfort food.  The only real negative was the service.  It was a bit slow and our server seemed a bit ditzy.  Also, there seemed to be a 4:1 ratio of managers to servers.  Lots of guys standing around in ties, when a couple of more servers would have been better for the dining experience.  Will definitely go back again."}
{"text":"The service is great, but the food is less than average.   Three out of four meals missed.    I had scrambled eggs, bacon, and toast:  scrambled eggs were almost completely white as if there was no yolk.  toast was black (can't believe they served it.) bacon was good.  Wife had: grilled chicken salad.  chicken was dried out, and drenched with dressing.  she could not eat it.  child had: spaghetti with butter.  for some reason the salt content was through the roof.  we are not that picky.  wife and i both tried it and it was as if someone dumped salt on it.  the server handled this well, apologized and was fast to fix it.  the 2nd attempt was good.  the first attempt was not even edible.  child had: chicken fingers/fries.  very good, however i will note this child ordered water for a drink, (no one else had water.)  after my kid complained about the water, my wife and I both tried it to see if this was a real complaint.  well, it was not drinkable.  it either had remnants of detergent in the glass, OR they need a new filter.  it tasted like the worst tap water I've ever had.  also, it's over-priced.  could have went to so many other places in the neighborhood.  the floor staff is outstanding though.  very well trained in that regard.  i do like this place because of the staff, hopefully they get their kitchen in order."}
{"text":"Shoddy, over compensating food. French onion soup? More like onions and bread with some actual soup. Would be way better if they simplified their food and condensed their menu.   Best part is the milkshakes and the service. Always nice, polite and smiling.  Don't come in if you're hot and just want a glass of water though. Everything is over-priced and the breakfast menu is the best one. Good for a family experience like brunch, not much else."}
{"text":"Tables were not clean. We were seated and not offered drinks for at least 10 minutes. We had only 2 interactions with our server. The first was when she took our order. The second was when she brought our bill. We were never offered refills nor asked if we needed anything."}
{"text":"Enjoyed this restaurant with family a couple weeks ago, and we all loved it and can't wait to go back! I ordered the braised beef brisket and it was the most tender piece of meat I have ever tasted. The only thing I found odd what that the servers were dressed very formally as was the atmosphere yet many of the patrons were very casual... not sure if the place tries to be upscale or not. Otherwise, the food is great!"}
{"text":"I wanted to like the food at this diner but it was nothing special at all. Our server told us the chef could prepare fish and chips since it was not on the menu and two of us had a craving! Chips were nicely served, but ordinary. Fish? Cold and batter very disappointing. Ketchup and tarter sauce were served in tiny plastic cups and half filled at that.  Turkey club was piled high but just an average club sandwich.   I think we will pass on this diner the next time the 4 of us go out for lunch. Service and decor was ok. Prices for this kind of food a bit high."}
{"text":"Talk about a disappointment. We walk in and it looks busy. They tell us it's a 15 minute wait. No problem. So we look over the vast menu and marvel at how good the desserts look in the display up front. When they get around to seating us, they put us at a bar table that was open the whole time. They could have sat us right away!  So then we order. The waiter seemed overly nervous and we could barely even hear what he was saying. I ordered a sweet tea and it tasted like sugar water with a hint of gym sock. Uh oh. But we were hungry and still ordered. My girlfriend ordered the fish and chips while I got the classic diner cheeseburger.   The food was awful. The fries were not fresh. They had the consistancy of leather and probably had been sitting under a lamp for a while. This was on a Saturday night... no excuse for getting old food. The fish was garbage. It was lukewarm and soggy. Telltale signs of food that had been sitting out. The only thing that was any good was the burger... but it wasn't anything I couldn't have gotten at a Chili's or something.   At this point we decided we should probably pass on dessert. There was an entire plate of fish and chips with barely anything eaten and the waiter asked if we wanted a box. Yeah... maybe one to barf in. Hmm, maybe he should have thought to mention to a manager that it looks like one of the tables didn't like their food.   So if you like clueless service, old food and a generally sucky time, then take your ass to Big View pronto!"}
{"text":"More like big waste of time. I would have liked to been able to write a review based on food quality, but we never got our food. Yep, you read that right ...never got our food. My boyfriend and I were looking for a new place and since we were in the area we decided to stop. It was your typical friday lunch scene, not overly crowded though. Sat down and ordered drinks and heard a welcome speech delivered from who I believed to be a manager about how \"great\" the upscale diner was.   Within minutes we ordered and now fast forward 30 minutes later, still no food. Manager and waitress practically run pass our table and avoid eye contact. This order was for a burger and a wrap, mind you. I know kitchens get busy and nothing is perfect but acknowledge us. Bring us bread or something . Nope. Instead we were told by the manger that\" two twelve tops came in at the same time.\" Okay and that would be a huge problem if your place had seating for 50, but not for over 100. poor excuse, poor customer service. One star only because no stars won't register."}
{"text":"I've eaten here several times and am always impressed with the service and food. The menu has food for the hearty eaters as well as the dieters.  As a low-cal gal, I like the egg white burrito. It has veggies, fruit, and turkey sausage. Yum!"}
{"text":"Great service and DELICIOUS food! Our server was fantastic. Greek salad was to die for. Highly recommend! Great service, great food and great atmosphere."}
{"text":"I've read the reviews and while most are very good, there are some that are just way out of line. We took the kids to try it out. Don't let the 3 stars fool you. This is a true blue diner.  Kids had the pancakes and bacon, and of course they weren't steered wrong. Accompanied with birthday cake milkshakes, how could you go wrong.  I had the the turkey club, which isn't on the menu. Tasted great, just what you wanted the day before Christmas.  Again don't let the nay Sayers push you away. We really enjoyed the place and will be back soon."}
{"text":"Good food, friendly waitstaff. Solid diner in my opinion. I got the mushroom omelette, and it was done just right. Try it out!"}
{"text":"For starters, the food is always really good.  The service.....drives me nuts and makes me not go there as often.I truly appreciate fast service, but consistently being asked if I want to order dessert while I'm only 1/2 way through dinner makes me feel incredibly rushed. Not to mention when they clear my plate while my wife is still eating dinner makes her feel rushed. Now, if we go there at all, all we think about is whether the waitress is going to rush us out of there.  I understand its a business, but this is not good service, faster is not always better.  I'm from NY and we like things fast, except when we are trying to enjoy a nice meal.  Solutions??"}
{"text":"Great food and service! Went with traditional Greek salad (all tomatoes cucumbers) no lettuce and topped with broiled salmon - really good and healthy so ended with the Camilo cream cake ( a big slice ) of chocolate cake layered with mars alone and whipped cream  Lots to choose from in the \"diner\" meat and potato categories too"}
{"text":"The food is amazing.  I went for my lunch break one afternoon and the service was quick and pleasant.  The hostesses were very friendly and wait staff knew their stuff.  I ended up ordering the calamari as an appetizer and the taste was like no other.  What a different idea they had with that besides your typical fried calamari with marinara sauce.  My main meal was the Spaghetti and meatballs.  The sauce was so delicious.  They were not missing a thing.  The meatballs were tender.  I would recommend the Big View Diner to anyone!  You will not be disappointed.  The place on the inside is just beautiful!"}
{"text":"We sat at the tall counter near the kitchen and we were able to get a behind the scenes look at what's going on in the facility. Good waitstaff. Cooks working nonstop. Girl working the bakery dept = bad attitude, picking up food with bare hand after handling money, put on glove then picked up dirty cleaning cloth and wiped down counters and picked up food after with the same glove on. Employees picking ice cubes up off the dirty counter and putting them back into the pile to be distributed into glasses. Inside of glasses being wiped with dirty towels then filled with drinks. Decent food, but not sanitary. Would not recommend a piece of cake, milkshake or anything else from the bakery."}
{"text":"Big view is a good place for family or friends.  The menu is huge!  Get about anything you want anytime!  Enjoy!"}
{"text":"Terrible experience. They didn't have our reservation in the computer, but there were plenty of tables available so no big deal. Then It took our server 15 minutes to even show her face at our table and there was no smile in sight. When we finally got our food, my daughter asked for a plate for her shrimp tails and it took forever to get one. When we ordered dessert it took over 10 minutes to get it. The topper was when we gave an Amex gift card for payment and the server came back to say she was sorry but their system didn't recognize them. When we refused to pay any other way she had a manager come over to repeat what she said. Our daughter had to explain to them how to run it and state that she works at a restaurant so she knows what she's talking about. Another 10 minutes goes by and guess what?  They figured out how to run it. In all, it took 2 hours to eat here. It was really hard to leave a tip with this terrible service but we did."}
{"text":"St. Louis burger was very good. Nice clean decor .. However... They were advertising a special on each table... \"August 24 -National Peach Pie Day- Individual Housemade Peach Pies with Vanilla Ice Cream-$7\" when asking about the special.. Waitress said that they forgot to make the pies today... (When she asked the manager we observed he pounded his fist on the counter and went straight to the bakery) Really? Terrible management...wow.."}
{"text":"Beyond horrible service. We have tried this place 3 times now but this past visit was our last. This is NOT a diner similar to NY/NJ style. It's slow slow slow. We get there and was told there would be a 20-30 minute wait or we can go to the bar. So we decided to go to the bar since we didn't want to wait 20 minutes. we sit down and notice a good 5-7 empty tables around us that could have been cleaned off for those waiting to sit. We ask the hostess if we can sit at one the the tables and she looks at me like I'm insane and points to the crowd of people waiting and said (with an attitude) \"all these people are waiting for tables. You can sit at the bar or put your name on the list and wait for a table.\" We decided to stay at the bar. We order our food and another 2 couples sit at the bar with us. After about 20 minutes later they get their food and we are still waiting for ours. I ask the server if our food is coming out shortly and she yells back \"we're just busy, baby\" with an attitude. Didn't bother to check on it or anything just yells it back to us.   We are sitting at this bar without food now for well over 45 minutes and half cups of cold coffee. We ask the server to check on our food. She looks at the computer and says we are one table away from getting our food so we stay... another 10 minutes go by and nothing. We ask again for our food so she goes to the kitchen and looks. My husband has the completely WRONG order. Missing eggs and bacon. I ordered over easy eggs and these were fully cooked eggs completely dried out and cold. Both meals were complete cold. Like inedible cold. Pancake was a puck and sausage was still ice cold in the middle but we tried to make the most of it and just eat so we can leave. I took a bite of my husbands pancakes and realized it was completely dried out. So I ask the hostess to send over a manager and she gives me an attitude. A manager came out asking what the problem was. Literally asked what OUR problem was. I explained the situation and he looked like he could care less. He offered us a gift card. I explained again how our meal was inedible and we will not be paying for this meal. As we were waiting for him to credit our meal, another gentleman comes up to the manager saying they have been sitting without menus or drinks for well over 15 minutes and said they will walk out if they don't served soon. What is going on there??? There was a ton of employees just standing around so definitely not short staffed. It is poorly managed!!! Totally inexcusable. The place was far from busy!!! As we left there was a crowd of people in the front waiting for seats while a ton of tables were dirty as employees just gathered around or walked past.   I can't believe this place even has 3 stars. Food is horrible and service would have been comical if we weren't so hungry. We left and went home to make breakfast. What was suppose to be a nice breakfast out to celebrate a life event turned into over an hour ordeal without even eating. I looked at my Fitbit, we were sitting for a total of 75 minutes.... 75 minutes to get breakfast that was cold."}
{"text":"It was crowded, on about a 20min wait. Sat in the bar area, got great service and a fantastic burger!"}
{"text":"THIS RESTAURANT SUCKS!!! We went here and were waiting for 2 hours!!!! They sat multiple people in front of us. This is RIDICULOUS!!! Then when we FINALLY got seated. We ordered and waited ANOTHER HOUR!!!! The food wasn't good either. It wasn't as bad as the service (which isn't saying much) but it's below average. PLEASE DO NOT GO HERE!!!!"}
{"text":"LOVE the Big View Diner. Have visited for both breakfast and lunch. Although this place can get quite full during peak hours, we have never had an unreasonable wait (10 minutes max). The food is delicious and the servers are all very friendly and attentive. Desserts are amazing (though HUGE - would recommend sharing)."}
{"text":"Update: Too much of a good thing is a bad thing. The service and food seemed to trail off during the holidays, and just after Christmas we were sold extremely stale and old cookies from their bakery. Because of this we will take our time before trying them out again.  Previous Review: The hubby and I eat here about once a week. Have had a ton of things on the menu and everything has always tasted great. Breakfast plates, french toast, pancakes. Shrimp & grits, chicken souvlaki, spinach pastry, greek salad, crab cake. All tasty! And we love their bakery. The service is generally very friendly and on point. Don't recommend eating at the bar in view of the kitchen because it gets chaotic, but otherwise enjoy dining here. Definitely recommend."}
{"text":"Yuck. So disappointed. I love Ilios Noches and Nolen's Kitchen (same owners). I've tried this place twice and both times it was crawling with noisy children, the staff seemed stressed and unfriendly, and the food very average. It has an IHOP feel about it. Not going back."}
{"text":"Great place to take kids. My son got both the spaghetti and the pancakes with eggs and bacon for dinner (post football practice) and I got a delicious goat cheese turkey burger lettuce wrap with basil veggies. Abby was our waitress and she was very helpful! We will def be back!"}
{"text":"Good family-friendly restaurant. Expected a diner, but it looks like Cheesecake Factory on the inside. Service was a bit slow on a Friday night, but it was busy."}
{"text":"What a huge dissapointment.  The service was slow, the food was bad, and the cost was high.  We were seated pretty quickly, especially for noon on a Saturday.  Then we waited 15 minutes for the waitress to take our order.  Then we waited another 30 minutes for the food.  When the food finally arrived it was greasy, salty, and poorly cooked.  My daughter's grilled cheese wasn't even cooked long enough to melt the cheese and it was salty (how is a grilled cheese salty?).  The fries were stale, like they were fried 20 minutes ago and baking under a heat lamp until they got to my table.  I was really looking forward to finding a good diner in South Charlotte, this was not it."}
{"text":"This place is just ok for me.  Sort of a hit and miss kind of a place.  They have a large menu with lots of selection.  The kids menu is decent and my boys enjoy the food.  Kids do get a free cookie at the end of the meal, which is always a hit.  For some reason it's always cold in this place too.  I know that may sound odd, but my wife actually plans ahead and brings a \"light jacket\" when we eat here.  It's always chilly."}
{"text":"The food IS really good esp the desserts! The service is good and the establishment is nice. Its a tad pricey, but you do get decent portions on MOST dishes. Not the fish tacos...that portion is too small."}
{"text":"We come here all the time. We decided to try breakfast this am and we had the worst server ever. She could not be bothered with us. The service was horrible, she had an attitude as well. Might have been nice if she checked on us. I guess they have the \"B\" team on in the morning because this was not the same service we get at night. The best was I thought I was in a restaurant but when she told me I could take my check up to the front to pay was the kicker!!!!"}
{"text":"Like this place very much. Will come back often! Recommend the breakfast pastry basket if u wanna sample different pastries."}
{"text":"I LOVE BIG VIEW! They have a fantastic breakfast/brunch menu, as well as an extensive lunch/dinner menu. The menu is always changing so there is always something new to try. The staff is very knowledgable about the dishes they serve. They have a bakery as well so there are cases full of treats that are delicious. There's really nothing bad at Big View - the people, the food, and the Bloody Mary's are all fantastic!  update: the best part of Big View is that they really pay attention to the customer - the changing menu is dictated by what patrons ask for and what they're no longer ordering. However, even when favorite dishes fall off the menu, they'll make them for you if you want them!"}
{"text":"Service is pretty good, although I had to keep asking for things like cream and silverware, etc. The ladies restroom is mostly clean but unkept with paper and waste strewn about. While I was in there another lady got locked in the handicap stall and I literally had to kick the door in to let her out. I went to tell the manager about the problem with the lock and found him standing in front of the food service line, eating food and took plated food to another customers table still chewing whatever was in his mouth. I believe they did address the bathroom stall. Food is ok but I think a little pricey for its value and it took forever to come out of the kitchen. They also served burnt French toast that needed to be sent back and my son said the chicken Apple sausage was inedible and switched to bacon with the next plate - this plate was much better but he had to get it boxed since the rest of us had already finished our meals."}
{"text":"This place does have a lot of options just like a diner should but every option here is expensive. The parking here is okay the food is average at best."}
{"text":"Decided to eat dinner at Big View tonight. Big mistake! Arrived around 7:15pm and seated right away. It was a moderate crowd. After being seated at our table, we waited at least ten minutes waiting for someone to take our order. Just as i was getting up to find a manager, our server showed up. By now it was 7:30pm. We ordered two sodas and calamari appetizer. She (our server) brought us our drinks and took our dinner order, chicken souvlaki and chicken parmesan. After about twenty minutes, our appetizer had not arrived. My wife was starting to get irritated thinking we would get our appetizer with the entree. Finally the appetizer came. The calamari was lukewarm and chewy. However, the sauce was delicious and why I am giving one star on this review. My wife's salad arrived soon after and brought to us by a manager. We forgot to ask for refills and instead waited on server to come back. Another mistake. We could see her chatting behind the bar with same manager (red shirt). She was making gestures like she was choking him and he did the same back. Having a big time. Meanwhile we are watching many tables finish meals, pay their bills and leave. My wife was beside herself. Our drinks had not been refilled once nor had she come around to check on us. At 8:15 our entrees arrived and was brought to us by the manager not the server. My wife complained about the lack of attention and time it took. The manager was obviously patronizing to my wife with a total lack of empathy. She let him no that as well. He just walked away. The server came over with menus apologizing and offering free dessert. However, we were disgusted at this point and declined. We paid for our meal and left. Food ok but horrible service. We won't be back."}
{"text":"I'm not one to post negative reviews but after our third poor experience I don't feel I have much choice. We love Big View Diner, eat there quite regularly and have never had a bad meal - the food is always delicious - however the service is quite bad. Disappointingly so. The managers are wonderful and do their best to be accommodating but thirty minute ticket times (on more than one occasion), wrong orders, empty beverage glasses and missing checks kind of takes away from the experience."}
{"text":"We love this place! Food was great and our server Abby was so upbeat, funny, and helpful! Thanks for making my bday dinner a great night with more laughter!"}
{"text":"This should be called Big Pew, they have no view poor service. They have a poor attitude . The food tasted like they emptied a container of salt into it. I had the roast turkey the white meat was pink? When I asked the waitress about it she didn't care at all."}
{"text":"Poor service right from the start we waited 45 mins for table when they told us 15 mins max, we were there for breakfast at 9:30am when we left it was time for lunch. I give it another year and they will be out of business you have to turn over tables quicker then every 2 hours. Food is fair to poor. S U C K SUCK SUCK SUCK!!!"}
{"text":"This is a very high class diner. I had the Antipasti salad. Wow was that fantastic. The decor was elegant too."}
{"text":"I can't tell you to try this or that because every time I trynsomething new and I loved every meal. But I do suggest you try their strawberry cheesecake . And the service (dinning in or takinngnout)  is a 10/10. Thank you TEAM BIG VIEW!"}
{"text":"Great food and great menu! I come here for personal and business reasons and the food itself is fantastic.   Service is sub-par, at best. My last visit was very irritating, you be the judge.  I placed a carry out order and they forgot to put my dessert in the bag. I called them when I arrived home and they said they would give me an extra one for the inconvenience. When I got there, they only have me one. I didn't bother asking for a free one. Shouldn't the manager go \"above and beyond\" and at the very least insist on something free for the inconvenience?  I'm not looking for a free handout, I'll certainly return since I love their food. But, the restaurant industry is so competitive and I know other places would feel as if they should've done something for the customers inconvenience. That's my two cents!"}
{"text":"First time in the Charlotte area... staying nearby and my husband and I stopped in. Was looking for a little something to hold us over for dinner and the Food was really good.  May not even eat later... lol Sat at the bar and service was good as well. Will definitely visit again when in the area!"}
{"text":"I've been to the Big View Diner often enough because it's close to home and what restaurant doesn't want a regular (uh... not Big View)!  I would now go somewhere else because of the  inconsistency in the final meal coming to the table...  my family has experienced dining in/out and meals have been good to bland because the cook left out an ingredient. You can tell the server about a bland dish but they don't know what to do about it.... they stick you with a meal without flavor ultimately. So, if you ask for the manager (because you must).... The on sight the manager never comes back to the table after talking to the cook and when you call in about missing ingredients you get the brush off.  Why have a manager???  I did like Big View Diner when it was good... but, I don't like the brush off I got when something that was bland!  Sorry Big View Diner you are no longer on my list of good places to go eat!!!"}
{"text":"Love this place!  Awesome food, lots of options and good prices!  Service was also amazing.  Bakery is delicious!"}
{"text":"I visited big view diner the night of march 10th I ordered jambalaya with a ceaser salad with whatever dressing came with it, and a garden salad with blue cheese dressing. Along with a cup of ice cream water and a lemonade I was told my order would be ready in 20 however I came in 35 to 40 min  and when I got there my order was never made . I understand mistakes are made and sometimes order tickets don't get turned in but the lady was acting as if it was everyone else fault but hers. 10 min later we finally got our food, we were expecting maybe a certain percentage off our meal for compensation of our food not being ready when we got there.  And the lady offered \"an extra scoop of ice cream will that make you happy?\" \"And I gave u your drinks for free \" oh really a water and lemonade ? I wasn't aware water cost nowadays. We just went back to our place for the night ready to sit down and eat and my food was placed in the box so messy that the juices basically all the flavor from my meal was spilled and gathered at the bottom of the bag,  I ate it anyway didn't taste too good but it was food. I decided I would talk to the manager first thing the next day and that's what I did. I called he was nice and cooperative and offered me a free appetizer and dessert my next visit  which I was thrilled about so I finally came in for my free starter and dessert tonight march 20th. I got strawberry cheesecake and disco Fries we got home the cheesecake was good my mother ate the disco fries and received a crunchy surprise a crouton in the disco fries! She said the fries tasted and looked old like they took left overs from someone's plate in the first place but she decided to give it a try anyway and that's what she was greeted with we will never be visiting big view diner again."}
{"text":"I love this place! Perhaps because it's super close to where I live, but let's be honest, it has a very warm feel to it and the people there are very helpful and pleasant to be around. I love that they serve breakfast 24/7 (not gonna lie, I've been there at 9pm and ordered the pancakes because they're to DIE for) and they have a huge variety on their menu. Their milkshakes are delicious and their bakery is adorable with tons to choose from. They give large portions and it's relatively cheap! Not to mention I can't take my eyes off of the light fixtures every time I'm in there. Big View Diner is up there on my list!"}
{"text":"This is a regular restaurant we go to all the time.  They are usually very busy (that's a good sign) so we call ahead.  We enjoy eating on the outside patio.  Have never had a bad meal here.  As a side dish, the onion rings and the hush puppies are really good."}
{"text":"We have been eating breakfast every Saturday at the Big View. Imagine our surprise to find out all the prices have gone up by at least $1. That's right even a short stack of pancakes up $1. Now I had no idea the cost of pancake batter was so pricey. The coffee is so strong you can walk on water after one cup. Big View has lost 2 customers and my friends who dine there are going elsewhere also. We can go a few miles down the road to Park Place and get full breakfast for $4.45 plus a great cup of coffee. You should check it out, we have been very pleased."}
{"text":"Truly, truly a disappointment. I looked forward to Big View's opening, as I live very close to it. Hearing all the bad reviews, I figured I would order carryout one night. The way I looked at it, I couldn't get bad service if I didn't have to deal with a waiter.  Surprise - they managed to royally screw that up too! In fact, Big View Diner screwed up every single step of the way.  When I called, I asked for a menu item I found online, only to be told they didn't have that anymore. So I ordered something else.  I showed up and informed the hostess I was there for carryout. She told me nothing was ready and asked me to linger by the sweets display. I loitered in the area, making eye contact with staff who immediately looked down and went on their way for 15 minutes, watching the register area like a hawk to see if they were preparing anything for carryout.   FINALLY I went up to ask about my order. It had slipped my notice that my order was hidden to the side of the cash register, and had been sitting there for as long as I had been there! The cashier didn't even say anything about the fact I had stared at her for 15 minutes expectantly.  The food was cold by the time I got it home, 5 minutes later. And it was awful. I ordered the \"hush puppies\" which the menu said came with some kind of butter, but instead I got this thick, cheese sauce. For hush puppies??  I like Nolen Kitchen and Ilios Noche. I am baffled that this disaster of a restaurant is owned by the same folks. If I were Stratos, I would be humiliated to have my name and reputation attached to this \"diner\" with its horrible service, misrepresented food items, and sub-par food quality. In fact, my experience at Big View diner makes me wonder if I should bother going to ANY Stratos Restaurant Group establishment again. Were the others just flukes? Because it takes EFFORT to be as terrible as Big View Diner was in my first (and LAST) experience."}
{"text":"Honestly, I'd prefer to give Big View 3 1/2 stars, because neither 3 nor 4 stars are accurate ratings.  We started coming here when it first opened, and were immediately impressed...then the service and food suddenly went down the toilet. I chalked up the bad juju to a case of too much, too soon; eventually, once the appeal wears off, a restaurant's true colors will be revealed.   However, there have been some positive changes made to the menu. The menu is smaller now, and, most positive of all, there's a wide variety of healthier options now available. I enjoy their salads, actually; the Waldorf Apple salad is a tasty and eclectic mix of spinach, lightly grilled chicken, pine nuts, apples and a light vinagrette that will leave you stuffed.   The jury for me is still out on some of their dinner plates; the lemon chicken and their pan-seared fish seems a bit dry for my palate.  If you're bringing the little ones, Big View's management has also improved on their Kids' Menu; the sloppy spaghetti and cheese-soaked Mac n' Cheese has now been replaced with gluten-free hot dogs served on whole grain wheat buns, and whole wheat penne with mixed veggies. Who says kids can't enjoy a healthy meal out? Nice touch from BVD's management...well done!  And there there's the fabulous homemade desserts, of which the strawberry cheesecake is simply divine. You'll be hard-pressed to not savor any of their fantastic desserts...even if I've had to force myself to do so, because I'm watching my girlish figure...  Atmospherically, it's first-rate, giving off the feel of a retro diner, complete with plush leather benches and some fine pop-art touches. There's also a spacious cocktail bar, stocked with high-quality liquors, and their beer selection is quite impressive - lots of local craft beers and imports.  Overall, it's a satisfying experience. I'm glad Big View has improved."}
{"text":"Menu has some strange meals, got chicken parmesan and it was very dry. Been there twice over the last few years but I think I'll wait even longer before I go back IF I go back."}
{"text":"Service was not rude, but slow and unattentive. When asked what teas were available, answer was: \"sweet and unsweet\". The waitress has to be hunted down for coffee refills and any other requests. Food is a hit or miss depending on the items chosen. The greek omelet was good, but the farmer tom (veggie) was completely tasteless and the only thing i could taste in the breakfast potatoes was black pepper."}
{"text":"I have lived around the corner from here for far too long and it was finally time to check this place out.  Truthfully the lackluster reviews kept me away.  I went after church with a friend and my daughter. We were promptly seated, the waitress was very kind and professional and even helped me narrow down my burger selection.  I think at any diner the first place to start is with a burger and for me that's how I decide if I'll return.  I ordered the Texas Grande (angus steak and smoked bacon stuffed with pulled bbq brisket, cheddar, crispy jalapenos) with a side of fries. My daughter ordered the buffalo wings and the Caesar salad. I absolutely, positively loved, loved, loved my burger and fries.  No complaints, it was delicious and my food coma began before I even got up to leave.  I don't know if I will be brave enough to try anything else since I know this tastes so yummy. But for the good of yelp, I shall try. I tried one of my daughters wing and they were tasty. Not amazing but definitely up to par and worth ordering again.  She said her salad was good but some of the pieces were too big and chunky but nothing a knife and fork couldn't take care of.  The menu here is extensive and since my first experience here was a good one, I'll certainly go back and try other menu options but it's also cool that you can hit up their amazing bakery and just take some donuts, cakes, treats home with you to enjoy.  I can understand now how the reviews are all over the place because one, taste is subjective and two, with such a big menu I gather it's impossible to do all things well.  I believe the owners are Greek and I may try some of the Greek items to see how well they do them.  As of this review, I recommend you give this place a try, everyone in your party is bound to find something they like.  That is all!"}
{"text":"Big View Diner is perfect if you are a buffalo looking for a nice salt lick. The chef was very heavy handed with the seasoning, almost to the point where the food was inedible. The diner was very pricy and did not deliver when it came to the \"local yumminess\" that diners often offer. Though the cake was divine, we will not be returning."}
{"text":"We went here the other night for dinner.  The diner's theme is cute - it reminds me of all the Long Island Diners I grew up going to.  The menu isn't as big as the LI Diners I'm used to, but those can be intimidating anyway.    Our appetizer was these pretzel bites and it was pretty random.  It came with 6 pretzel pieces and two sauces to dip them in.  I wasn't in love with this course.  I got the Spanikopta (Spinach Pie) and it was perfect!  My food was better than everyone else's though - I ordered well :)   Someone ordered the cheesecake for dessert and I tasted it.  It tasted way too lemony to me.  Overall, I'm not sure if I would return."}
{"text":"Visting my family for Thanksgiving. I was the only one who wanted turkey so I picked up a take out dinner.  It was great, good portion, food was good quality and tasted delicious.  The vegetables were yummy and a good variety. Only negative was the stuffing was soggy instead of moist and fluffy, this may have happened bc the gravy got mixed in.  I would suggest requesting the gravy in a separate container. The chocolate chip cookies were so delicious as well as the cherry pie. I will be back to visit for breakfast.  I am surprised at the other reviews for this place and other local restaurants.  I lived in Charlotte before moving to CA and have been to many of the local restaurants. Maybe its just me but Charlotte folk seem to be very critical of their local eateries. I am referring to a review left a few days ago about the condition of the restaurant.  There is a huge sign when you walk in stating that they are refurbishing the tables, booths, etc. As for the review about the under cooked omelet,  if you weren't happy you should have requested a new omelet and potatoes.  I would love to have these restaurants close to my home with fresh local produce.  Please try to support your local restaurants and give your feedback to the restaurant so they can work to improve what you dislike. At the end of the day they are here to serve you and make sure you are happy ;)"}
{"text":"Went there for breakfast.  Half of the home fried were not cooked and the sausage would have been better suited to resole shoes, tough and dried out.  Service was also nothing to write home about."}
{"text":"I really like this place, nice and cozy. I went on the weekend of mother's day and everyone seemed to enjoy their food. I had the crab cake on the bun it was good but the sauce that comes with it was not tasty. The barbecue chicken wings were very good as well. The desert we had was the strawberry shortcake and it was OK.   Overall I want to go back to try out the rest of their menu."}
{"text":"This was my 3rd visit to BVD since it opened. The first 2 times we were there I was unimpressed with the food, but my family wanted to try it again, so we went this Sunday for brunch. The \"all day breakfast\" menu was all we were allowed to have since the regular breakfast menu ends at 11am. While disappointed, we understood. We were seated in the bar area after a brief wait and initially, service was good but went downhill fast. Our server was also bartending, so wearing 2 hats began to affect our service, we ordered my daughter's milkshake 3x. I give our server 5 stars though, he had a great attitude and was very nice, apologizing for our wait. The pimento stuffed jalapenos are HUGE!, but lacking in taste in a big way, no kick and the pimento cheese was runny and bland. The corned beef hash left my NJ, diner loving fiance unimpressed, as did my own greek omelet that was overcooked. The home fries really aren't \"fries\" but smushed greasy potatoes. Neither of us ate ours. On a brighter note, my teenage daughter liked her sliders and fries. We waited a long time between apps and our main dishes as well. I hate to give poor reviews, especially to Xenia, as we are big Ilios Noche fans, but after a third unimpressive experience at Big View, we won't be back."}
{"text":"Watched 5-6 tables of recent arrivals be served outside because that is where they chose to sit and wait to be called.  Seating and serving new arrivals without offering those tables to the crowd of people waiting inside is baffling.  We left after waiting over an hour and will not be returning."}
{"text":"A fresh take on Comfort food. I normally don't  love restaurants with expansive menus because I don't feel a restaurant with  a big menu can focus on everything to make everything good. This place is the exception. One of the first places we found when we moved to Charlotte something for every one can be found her. From Brisket and Black Bean Burgers to Salads and Pasta dishes this place has it. They have great specials and everything tastes fresh I don't know how they do it. They also have a wonderful bakery and make their own ice cream. You can even get Thanksgiving dinner in July."}
{"text":"The food is consistently mediocre. Not worth the price.  We will not be going back."}
{"text":"Had breakfast here this morning. Arrived at 9:30, party of 2, was seated in 10 minutes. Service was fast and friendly; I had coffee within 2 minutes of being seated. The Greek Omelette was great; loaded with ingredients. My dad had the pancakes with strawberries and whipped cream and they were AWESOME. Took a bit longer than it should have to get the check, but overall, it was great. I'll definitely be back."}
{"text":"Service is very poor. After waiting more than 30 minutes and party after party being seated we finally ask if we are coming up. They confirm we are, but 5 minutes later they admit they missed us. No apology, nothing. Never been impressed with the place. Don't go there."}
{"text":"A major disappointment, overall.  I'm from the north, and we love diners, so I was excited.  Unfortunately, I was sorely disappointed.   The first 2 times I went there, I had appetizers because I wasn't very hungry.  They were both pretty bad.  Still, when invited to join some friends for lunch, I accepted, hoping that maybe I'd find something yummy if I order an actual meal.  Again, I was disappointed.  I ordered a chicken gyro.  The chicken was tasteless (except for being overly salty) and very tough.  It was an extremely small portion too.  I'm glad it came with fries, although they were cold and very greasy, even for fries.  We were a party of 9, and no one liked their food at all, except for a 14-year-old, who ordered the chicken parmesean.  Even she admitted she's had better.  One guy at the table ordered a burger, and asked me to try it because he couldn't believe how awful it was.  I must admit, it was without a doubt the absolute worst burger I've ever had, hands down.  The meat was extremely hard and dry.  It was really inedible.  He was hungry, so he ate about 1/2 of it and left the rest.  Also, for a diner, it's pretty expensive.  I think the place is very attractive and comfortable, strictly from the standpoint of aesthetics.  Unfortunately, I'd rather have great food in a 'hole-in-the-wall' type of diner.  I don't go to a diner for the ambience.  I go for good, old-fashioned diner food.  It is not hard to make good food diner style.  I really hope they can step up in the future.  Maybe their breakfast food is good.  The only way I'd try them again is if I'm in the mood for breakfast.  I'm always looking for a good place for a lazy Saturday morning breakfast."}
{"text":"Had brunch.  It's ok.  A little upscale from Denny's.  price was ok but was expecting more.  Had the western omelette, thought the ham, onions, peppers should have been cooked more before being added to the eggs."}
{"text":"The food is super inconsistent. Sometimes is pretty good and sometimes it's terrible. The chicken noodle soup and chicken fingers are big the best items on the menu."}
{"text":"... I had previously stated, in an earlier review, that on my first visit, with others, which was on Dec 16, 2017.  We waited while everyone else and some, were seated before us, 35-49 minutes later, when we were told we'd have only a 10 minute wait.  We were then seated in a dark corner, where we had to use our flashlights just to see our menus.  Then we felt rushed by the waitress, who later brought our entrees.  After eating, leaving and attempting to do do additional Christmas shopping ALL 3 of use were forced to find the nearest restroom. This happened throughout the ENTIRE evening into the morning for all of us. Not much Christmas shopping was done. Now tell me that, that was just a coincidence?!!!  We took dog bags home and are deciding whether we should get the contents examined.  SMH!   ---------------------------------------------  Since this review was previously posted.  The owner and I have communicated.  I have since visited the establishment 2 additional times with friends and family.  Both myself, and the visitors I had invited agreed, the ambience, and the service was impeccable!  The food was also delicious, but the desserts where even better!  I would definitely recommend a visit to those of you who have not done so already."}
{"text":"Great variety!  Something for everyone.  My family has gone several times.  Many tempting desserts to choose from!"}
{"text":"I really had high hopes for Big View Diner.  I have gone regularly to their Ilios Noche Restaurant and never had a bad meal there.   I have not found a good diner in Charlotte, and looked forward to eating there.  I went with a friend in June 2009.  Both of us were extremely disappointed with the food.  I ordered the chicken parmesan over pasta.  The pasta was cold, the chicken was tough and the sauce was runny and completely tasteless.   Even the bread was disappointing.  My friend ordered the meatloaf with mashed potatoes.  My friend also thought the meatloaf was tasteless and awful.  How could a diner get meatloaf wrong??  I was going to order the meatloaf too, but wanted to get to different things to be able to try.  The food was so bad, I decided not to return."}
{"text":"We have been here twice. It's a nice diner on the fancy side, definitively a step up or three from an IHOP or a Denny's.  The menu was large had something for everyone in the family.  If you are Gluten Free they have many options available which we found to be a pleasant surprise. On both occasions we found the staff to be pleasant and the food to be good."}
{"text":"We ran into the Big View for some drinks and milkshakes for the kids. We had some time before a movie and the restaurant was packed. With that being said the staff was wonderful, helpful and very friendly. Abby did a great job of taking care of us and if you ever want to get a great milkshake you should swing by. They will take great care if you, the manager was wonderful as well. Thanks for the great service."}
{"text":"Locally owned family restaurant in the Ballantyne neighborhood. A very diverse menu and upscale diner, these are prevalent in New Jersey and Charlotte is fortunate to have Big View. The desert selection was comprable to a bakery shop menu, fresh and large portions for a reasonable price. We love supporting restaurants like this and will definitely return."}
{"text":"Waited 45 minutes for our food. Had noticed waitstaff chatting it up with customers at other tables. Had to flag down waitress for everything. When food came, the waitress that brought it barely spoke. I ordered broiled seafood platter. It came swimming in grease. I ordered mushrooms instead of rice. They brought rice. Spinach was a grease bomb, too. Restaurant was not that busy.  Lousy, lousy experience all the way around."}
{"text":"We originally went just to use a gift card.  I was very impressed with the service, our server Cary was very engaging, and efficient.  The whole atmosphere was intriguing, as we got closer to 7 pm the Diner began filling up. The food was great. The variety was my favorite, with prices staring from $8, and healthy options like my Black Bean, and Quinoa Burger that even won over my carnivorous sister.  The complimentary bread was a highlight at our table.   I am definitely looking forward to going back."}
{"text":"I ate here last night for my first time, it was a wonderful experience! The service was great, everyone was so nice and friendly. The restaurant was clean and decorated nicely for Christmas. The manager was on the floor which means a lot for me to see him helping out his team. I'm sorry I didn't get his name but super cool gentleman! The food was ready in good time, it was delicious. They have a nice menu, it was hard to make a decision. I will definitely be going back and will bring family from out of town here as well. Not a negative thing to say, great restaurant!"}
{"text":"I was shocked that there are so many poor reviews for the Big View. I like the variety on the menu and it is a kid friendly establishment without feeling like you are in the midst of a playground. The desserts always look delicious and it smell wonderful the minute you walk through the doors. The servers are very friendly and the service has always been great."}
{"text":"The food was good. Really big portions. The tables and chairs in the bar area leave a little to be desired, but no big deal. Milkshake was good. It was the blonde bartender I had issues with. She had the worst attitude I've ever seen. She cared more about the tables she thought would tip more than me. When I asked to sit at a booth that looked a little more comfortable, she made a face and told me she thought it had reservations. I'm not sure it did, but it sure didn't seem like it when it was sat. Then at one point she ditched my table and a completely new server took over. (She was great.) I don't think I'll be back because of the treatment I received, which is a shame because i think I would've liked it if I received better service. That young lady needs more training or a non customer facing job."}
{"text":"This was not a great place for lunch. I went with my mother in law who is gluten free and the options were not great. Also we had to sit outside because the inside smelled like dirty socks. Hopefully that was a random occurrence but I will not be returning to find out. Food was sub par."}
{"text":"I've been hearing about Big View Diner for some time but its kind of off the beaten path for me so I hadn't had the chance to try it until recently.  I have to say, I wasn't that impressed.  It seems like this place can't make up its mind.  Am I a diner?  Am I a bakery?  Am I a bar?  Who knows?    My dining companion and I tried it out on Labor Day.  Because of the holiday, they were offering brunch in addition to the regular menu.  Yay!  I am a big brunch fan!  There's a good mixture of breakfast and alcohol...what's not to like, right?  I ordered a mimosa and he ordered a Seven and Seven.  Waitress trips off to the bar and returns to tell us that they do not have the first of those Seven's.  Okay.  No problem.  How about Crown Royal instead?  Off she goes again, returning with a small rocks glass containing just the Crown Royal.  Apparently, the second of those Seven's got lost in the confusion.  We called the waitress back and asked for the mixer, which was graciously provided, albeit in a really large glass which diluted the drink to a very weak consistency.    Now, for the food.  I had the Eggs Florentine Benedict with home fries.  Nicely done, the poached egg was perfect and the ratio of sauce, egg, tomato and spinach was quite good.  Home fries were okay, nothing to write home about but a very acceptable side dish.  Dining Companion had a burger and fries.  Nothing spectacular to recommend either but the burger was a good size and was cooked well.  The fries were crisp, salty and not even slightly greasy.    Altogether, the meal was okay.  Not good enough to have me traipsing way back out there but....good."}
{"text":"We met a group of friends at the Big View Diner for dinner last Friday night.  The exterior of the restaurant alone is impressive.  Then you walk in and you're even more impressed.  It reminds me of a 60s diner (not to be mistaken with a chrome-saturated 50s diner).  There is a lot of dark wood used, the writing/signage is an Art Deco font, and the booths seem to be a high-quality leather.  You might find the cast of TV's \"Mad Men\" at Big View Diner.    There's a large bar/lounge area when you walk in, perfect for having a cocktail before dinner or just hanging out with friends.  Then there's a dessert case and bakery where you can stare at the endless, delicious possibilities.    Our party of 9 was seated in a large round booth, which itself is very cool because it really added to the atmosphere.  Looking around, everything seemed very new, neat, orderly, and clean.  I was very impressed.  I loved the 60s retro feel.    Although we had just dined at Ilios Noche (Big View Diner's sister restaurant) the weekend before and I had a gyro/lamb, I wanted it again.  It's rare that I have the option at restaurants to enjoy a gyro and typically only get to savor a really good one at the Greek Festival here in Charlotte.  I ordered the Gyro Platter instead of the Gyro Pita sandwich.  What's the difference?  Well, I thought it was just that I was getting a Greek salad on the side for only about $1 extra.  Turns out the gyro on the platter doesn't come with anything on it but the meat, so I basically ended up putting a lot of the Greek salad inside of it...which is almost what the gyro pita sandwich is, minus the kalamata olives and feta cheese.  Next time, I'll probably just go with the sandwich that already includes lettuce, tomatoes, onions, and tzatziki sauce.  The meat was delicious, though.  It was sliced thick, whereas the gyro from Ilios Noche contained chunks of lamb.  I ordered some extra tzatziki sauce on the side, both for the sandwich and as a dipping sauce for my fries (which also had good flavor).    The service was very good, and everyone at the table had a great time and enjoyed all of their dinners.  There was a lot on the menu from which to choose, so it seemed like just about anybody could find at least one thing they'd like.  (I must note here that the meatloaf dinner someone ordered looked fantastic and very hearty!)  When we go back for dinner sometime, I'd also like to try the NY \"Disco\" Fries as an appetizer.  They sound heavenly.   I think the next time we go back to Big View, it will be for breakfast, though, first.  Isn't that what diners are for?  The breakfast options on the menu look very diverse, and the pricing is extremely reasonable."}
{"text":"Great normal american dinner. Really nothing more to say. Pretty much everything is good for a dinner."}
{"text":"Great diner food may sound simple but this place has a dish for everyone in your family.  I like the Greek food like the lemon chicken, which is delicious, or the spinach spiral pie, which is like a spanikopita but larger size.  Their burgers are tasty too. I also have tried the breakfast food and think it's super.  If you need to find a place where everyone can order a different type of food, this is your diner.  I have not tried the milkshakes, but they are huge and look yummy.  Their beer and wine list is good too."}
{"text":"good food good service chicken n waffles are good. n my wife ordered southwest chicken wrap she loves it."}
{"text":"Came after soccer camp to enjoy the advertised family meal deal on Tuesday, and they claimed it was not available. Disappointed and won't come back. I've eaten there before, and the food is fairly good. Service is average."}
{"text":"The very best without out a doubt.  Have dined here at least 20 times.  Always fresh hot and delicious.  Consistent always perfect and very reasonable prices.  Ownership on premise working it.  Great breakfasts lunch dinners!"}
{"text":"I like this place, but don't go very often. Not sure why. The bakery items are huge and amazing. The menu has a wide selection with very large portions and good flavor. There pancakes are great. The Hot Coco is always served hot!!!  It isn't a place I would go for dinner, but they do a good job with breakfast and lunch."}
{"text":"When you step into The Big View Diner it's like you stepped back in time. The place is retro but still current. Very cool! The menu is huge so be prepared! Loads of stuff to choose from and the serve breakfast all day. Our meal was good. Salmon was a bit over cooked but still very tasty. The beef brisket stroganoff was excellent and the manicotti was also good. Service was also good. Someone was always coming by asking if we were ok and needed anything."}
{"text":"We're regulars here. It's had some up and downs, but is a solid diner with a large menu and good portions. The lunch specials are awesome! I really enjoy the sesame salmon sandwich. They make their salad dressings in house- you've got to get the creamy basil. I always have my go to menu items here, I just wish the breakfast menu was a little larger."}
{"text":"I went to the Diner on a suggestion from a friend, and I was surprised afterwards to find a lot of poor reviews on Yelp and other sites by people who had gone there for dinner. The menu is quite extensive and really has something for everyone. While I've been told by fellow diners that some of the more \"homestyle\" dishes (ones that you usually only let your mom make for you) left more to be desired, I've found most of the typical restaurant/bar food to be excellent! The sweet potato fries and brisket cheese fries are to die for! The salads (particularly the cold plate!) are also really good. Plus, the sandwiches are all well-made and worth the price. They also have pretty decent drink specials (especially for beer drinkers) and they make a point to carry a lot of local brews on tap. The bar manager is a great guy and definitely takes care of you! The only time I had an issue, which involved tweaking a dish on their menu, and the food came out wrong, the manager had them fix the food AND take it off the bill, which was surprising but very nice! Overall, I think this is a great restaurant for dining with friends or just catching a quiet drink :)"}
{"text":"Over the years, we've tried several times to like this place. Each time, we were disappointed.  We decided to give it one more shot this morning for breakfast, our favorite meal. Unfortunately, this was our worst visit yet.  It started out ok - we were seated promptly, although we did wait for a bit for a hostess. Our waitress came over and rudely said \"what do you want to drink?\". No standard \"hi my name is so and so and I'll be taking care of you today\". After plopping our drinks on the table, we had to point out that we didn't have silverware, cream, or sweetner. Time to order. She plops a notepad on our table and begins writing - a big no-no from my experience as a waitress. We don't see her again and have to ask for a coffee refill (for which they took my cup away to refill - do they not have carafes??). Husband never got a refill.  Our food comes out we dig in. Potatoes were dry and flavorless, eggs weren't cooked throughly, bacon was mostly fat. But the worst was the biscuit. Hard and so dry it broke into crumbs when we cut into it. And it tasted awful.  Bill was plopped on the table with no thank you from the waitress. But by that time our minds were made up - NEVER AGAIN.  This area has so many good places to eat, any of which are better than Big View."}
{"text":"This place has so much potential to be wonderful, but just lacks the wow factor. The desserts, which are displayed at center stage of the place, tasted old and just bland.  The food was okay, but nothing to write home about. The service was just so-so. Half of the restaurant was empty when we went and there was still over a 15 min wait for a table. I just was not impressed. We will not return."}
{"text":"Went here for lunch today and waited 45 mins for two burgers to come out,tea glasses went empty while we were waiting and never refilled until we asked,doubt I would come back."}
{"text":"The food at their restaurants might be great (our neighbor thinks Big View is very good) but don't order a gift card online on their site unless you want the world to know your credit card information. When I ordered a gift card for our neighbor, not only was the site not secure (I did not notice at the time) but the confirmation email they sent had all my credit card information fully exposed in it: number, expiration, even security code. To top it off they did not even send me my card nor respond to my emails asking about the status or exposing my credit card information. At least they did not charge my card, but now half the underworld know my number and would have charged my card had I not cancelled it and got a new number. I hope the service in their restaurants is better than this!"}
{"text":"More a restaurant than a diner.  Restaurant is comfortable and clean.  Servers are friendly and efficient.  Food is much more in line with a restaurant, than an inexpensive diner.  Big View is marketed as a New York Diner, and, as a former New Yorker, I can attest it meets that mark - especially at the way in which they price their offerings.  I think it's a little too pricey, when compared to their southern counterparts.  If you visit, you must try one of their spectacular desserts...especially the cheesecake."}
{"text":"Not your standard diner. Fresh, homemade, unique food for a good price. Our server Marcus was very attentive. Decor is really nice. Fresh doughnuts and cakes. My wife had the spinach pie made with a light phyllo dough (excellent), and I had an omelet with a side of large homefries crisped perfectly. We will be back for sure!"}
{"text":"I took my daughter and 6 of her friends here for her 17th birthday. They had a great time celebrating. The food was perfect for everyone. Each girl got to order what she wanted, salad, breakfast, pasta, etc. A great place for large groups with all different taste buds.  The bakery made a delicious cake to finish our meal!"}
{"text":"I haven't been there in a long time but the food is great. Nice staff: my only downside is they took the tuna sandwich off the menu a while back but still awesome"}
{"text":"They have clam chowder on Sundays - best I've ever had! Kids can eat breakfast for dinner which is great for my pickiest.  Overall great food and staff! We will try again!"}
{"text":"I was in here on 1/6 and ate at the counter!  Watched kitchen in action and the \"manager\" that was putting finishing touches on food---sauces, gravy, parsley etc!  Manager was a tall guy with dark hair looked to be early 40??  Anyway with each plate he used this towel that was lying there and wiped plate around the edges--I then saw him use that same towel to wipe his hands and counter with!!!  UGGG!  Kept waiting for John Quinones guy from What Would You Do to pop out and ask me why I was not speaking up!!!  So disgusting will never return!  Unclean kitchens and staff should not be on open display when that display is just in bad taste!  This manager was also checking his txt messages every few minutes and then complained about a couple of customers that wanted to share a plate!!  Told waitress----get rid of them!!!  This guy needs to go!!!"}
{"text":"Food and service very good.   Overall we love decor but place is getting run down.   Many seats have large  tears which look terrible.   I hope they fix this ASAP."}
{"text":"This was our first visit in quite a long time.  They have a new menu and finally serve b-fast foods after 11am.  I noticed that they finally have added quite a few \"comfort foods\" that you would expect to find at a place that calls itself a diner.   On this visit, I had the Spanish omlette  (which I had also tried on a previous visit).  It has corn, black beans and chicken cooked in a mole sauce... Yummy! The potatoes were fresh and cooked just right with just a hint of crispy goodness.  It was served with toast.  I like the coffee here as well. David had a bagel with cream cheese & salmon - which was good except they forgot the capers.  On this visit, there was a 20-30 minute wait for a table, so we opted to eat at the bar.  The service was good and overall we were pleased with our visit. We'll be back to check out some of the other new menu items!"}
{"text":"What's the big deal on Big View?  It seems to be polarizing, and I fall into the fanboy half. Our server, James, was entertaining without stretching too far to make jokes. I thought his recommendations on the food were helpful, and he seemed to know quite a bit about the extensive menu (a near overload of breakfast, comfort, Greek, sandwich, and salad choices).  I got a gyro, and even though I have a limited experience of the Greek sandwich, it was delightfully cheap and delicious with a side of cole slaw. It might be the dressing or vegetables in it, but I thought their cole slaw was a step up from most places.  The atmosphere is very busied, and the decor is not your typical diner glint and kitsch. Instead of newspaper clippings or plastic flowers, they have a very 60s looking dining room. Round booths, globe lanterns, and metallic chandeliers: it looks like a trendy restaurant in a Pixar movie. The food is pretty great, but a lot of my praise comes from how grand of a setup a diner can have, so maybe that's where the Big View comes in.  It's a little more upscale than Denny's, but this is a very kid-friendly restaurant with a more gourmet (and healthy) children's menu. I was surprised to see \"spaghetti tacos\" and edamame pasta next to the ubiquitous chicken fingers.  You absolutely must save room for their award-winning dessert case. They have house-specialties like baklava and ice cream, but if you've got the space, go for an over-the-top choice like pineapple-coconut cake or a cannoli cake. You won't be disappointed, and I think I may try to go for just dessert sometime."}
{"text":"Excellent ribs, Caesar Salad, fries, Gryo Platter and complimentary bread.  This is the most upscale and amazing diner I have ever visited, I will not normally eat at diners but this is the exception to the rule.  Service was excellent with two very friendly ladies that were as nice as could be to my son and I.  Very good wine list, they have my favorite 14 Hands Cabernet from Washington State.    Wayne Gorsek Founder INC 500 Hall of Fame Company"}
{"text":"Owned by the same group as Nolen Kitchen, Ilios Noche, and Maverick Rock Taco, Big View is the one that stands out most to me. These guys are trying to embrace a dying breed of \"diner-style\" eats with the combo of the classic bakery alongside the diner burgers, fries, swing-style soda shoppe atmosphere and include a full bar. I grew up with Fuddruckers and Big View is definitely reminiscent.   The food is mediocre. Nothing too out of the ordinary. I tried the Hickory BBQ Burger - standard applewood smoked bacon, onion straws, and bbq sauce. Nothing like I haven't had before. Definitely reliable when in a burger frenzy or in a pinch for something familiar.   What I will say sings foreground for these guys is the bakery. Goodness gracious is it awesome that you can get a gigantic, NY-stle b&w cookie here. The milkshakes (coffee and chocolate has been my favorite thus far) are wonderful. They have tons of cakes, pies, cookies, and so on. The best part is that they are all in the classic display case and a nice glass window so you can see into the kitchen. These guys may not be a 5-star French bakery, but they are cranking out some American favorites that have yet to be less than spectacular, in my opinion. Definitely worth the pilgrimage for dessert.   The interior is pretty big, too. Tons of booth seating, which is always a favorite, bar stools, tables, and a cozy waiting area.   Though these guys are laid pretty far off of 521 outside of Ballantyne, it's worth the novelty of checking it out."}
{"text":"Usually their food is excellent but not on our latest visit.  Veal meatloaf tasted like beef jerky - did not taste anything like meatloaf.  Chicken potpie - huge disappointment and sent it back.  Crust was flour and water (no taste) they put zucchini and  summer squash in potpie, along with just chicken broth and a very few slices of turkey lunchmeat (no creamy inside no potatoes no peas - they need to revisit their recipe).  Turkey dinner was better but don't put turkey on top of potatoes and stuffing and turkey was sliced like lunchmeat.  Broiled seafood dinner was ok, crab cake wasn't very good and had too much seasoning on top of shrimp and fish.  One of the reason people visit your establishment is because they want \"comfort food\" from diner.  On a positive note, our waitress was excellent.  Maybe we just visited on an off night."}
{"text":"I'm not sure why everyone enjoys this place. The service is mediocre and the food is not seasoned well at all. Below par for the company. Desserts are hit or miss too.  Great concept just poorly executed."}
{"text":"Ok, as other have  said the service is not always the greatest.  I have been 5 times, and two of times I had bad service.  But the food and bakery are pretty good.  On appetizers, the calamari is some of the best I have ever had, it is succulent.  The chicken pop pie is good also.  Prices are reasonable for the amount of food give, and the atmosphere is nice.  This is one of my favorite restaurants regardless of the sometimes poor service.  Also they have something called a movie night for kids where they show all the kids a movie in another room while the parents enjoy themselves, not totally sure how it works but its an awesome concept."}
{"text":"Absolutely the worst food ever... I'm sorry as someone from New England I just can't stand this!"}
{"text":"Good food, but pricey. Nice service. Not up to the standards of a NJ or Long Island Diner."}
{"text":"The food at Big View is decent but the service is slooooooooow. Like, unbelievably slow. Not just during one visit, but on all of them. My parents also agree, they started going to Big View in hopes of something similar to the NY/NJ diners they were used to, and quit going because everything took way too long. Very disappointing."}
{"text":"Not sure how to rate... If I had done my review on Friday, my first visit, I would have definitely give 5 stars! I was in the area and popped in and bought 2 confetti donuts and 2 apple fritters. They were EXCEPTIONAL!!! So much so, I planned a return visit with my family for Sunday. I purchased 8 donuts to take home. When we sat down with tea in hand, these sent me into total SHOCK! They tasted NOTHING like the light airy donuts from the previous version. These were dense and heavy but not cake heavy, just off. I was really taken a back as it's quite a ride to Ballantyne from Harrisburg and about $18 for 8 donuts.  They do offer a punch card 1 free for every 6. Of course, I forgot to present it the second time around. Not sure if or when I might do a redemption visit but they offer an extensive menu of items which includes breakfast all day."}
{"text":"This is one heck of a diner. Their menu is expansive! From southern comfort, to all day breakfast, to Italian, to Greek...they got it all. And at the ginormous portion that one would expect from a diner.   Tried their apps - their hush puppies were great, and the spinach/artichoke dip was probably the gooyest cheese I have ever had. The entrees come with a huge portion of salad, and by the time the actual entree came, I was too stuffed to eat anymore.   Make sure to save space for desserts. They do taste as great as they look on display at the diner entrance."}
{"text":"4-5 stars for service but that food is dismal. Wow. French toast is not that difficult but wow. Challah bread is yellow not white. The bread is the main thing that can make a break French toast. Then the custard has to be right with the correct amount of saturation. Big View Diner has it all wrong. It was painful because the server was trying her best to excuse the lackluster FT dish. To be honest, the southern USA has issues on how to make a decent Challah bread anyway. Oh well...Nyc here I come again for FT!"}
{"text":"Big View is a great bakery and restaurant. I have enjoyed everything I have ordered from there. I especially am a fan of the corn beef hash. I would say it tends to be busy and can be a little dirty looking because they are not bussing fast enough. But other than that,I do not turn down a trip to BVD."}
{"text":"In the past I have taken the place for granted as a good spot for breakfast or a burger and fries but yesterday I dropped in for lunch and ordered their meat/fish and two sides for under $9. I had the salmon and spinach/garlic plus their mixed vegetables. It was all great and a real value; the spinach/garlic was good as it gets and their mixed vegetables turned out to be asparagus spears, grilled sliced squash, grilled sliced zucchini, and roasted peppers. Not your usual peas and carrots mixed vegetables. Salmon piece was extremely generous. All said they certainly are much better than I ever had at a \"dinner\" and I am not sure how they do it for the price. As to those folks who wrote reviews pointing out failings in their service I would say please try them again as you are a missing a Charlotte gem. My service was flawless but service sometimes depends on just luck."}
{"text":"I have been to Big View Diner on several occasions now.  My husband and I have been to watch football games, eat dinner and grab bakery items to go.  Each time we have been we have left satisfied.  The menu prices are a little on the high side, but the food is always great and you can usually find a drink special or two.  The deserts are amazing and I am not sure why I haven't tried them before this week."}
{"text":"Excellent food, wonderful service, Good Specials! The first thing you'll notice when you walk into The Big View Diner is all of the desserts in the case.  They are THE BEST!  There is a Chocolate Cake Type Concoction that is 14.99 and if you finish it, then it's free!  I asked my waitress and she said that no one had ever been able to finish it, so maybe this is one for the Man Vs. Food or something.  The menu is fresh and up to date.  Honestly, my wife asks to go here just about every time we go out to eat.  I believe that she has stock in The Big View that I don't know about or something.  According to her, whatever you're craving, they have it on the menu.  I can honestly say that I've never gone away disappointed, or hungry for that matter.  The only complaint that I have is that the salad dressings that they have are the weirdest concoctions I've ever heard of.  For example, you can' t get an Italian dressing that isn't creamy.  It's creamy with some other things mixed in with it.    The owners are so friendly.  I don't think I've ever eaten in the place without them coming around the dining room to see how everyone is doing.  The prices are reasonable, also.  The decor is befitting of an \"Old School\" diner.  They really put a lot of time and effort into it.  It's not like a cheesy Applebees or something with all of the weird knick-knacks on the wall."}
{"text":"I'm avoiding dairy and soy due to nursing a baby with an allergy. The manager at big view was so helpful and really went out of his way to make me a great meal. Our server was great as well."}
{"text":"I didn't grow up going to diners. Some restaurants in Southern California may say it's a \"diner\" but it's more of a concept than true execution of a \"classic American diner\" - so my review is going to be somewhat of a \"diner neophyte.\"    My husband and I tried Big View for a couple of reasons - it's close by and their throwback-classic-diner-style sign was appealing to us.    We were pleasantly surprised.  The menu is large - there's something for everything and the portions are huge!  I ordered the open face brisket sandwich and my hubby ordered the chicken souvlaki platter.  Both were delicious.  The brisket was tender and flavorful.  The portions were so big that we debated - for a brief moment - whether or not we had room for dessert - but who can resist that amazing bakery!  We ended up with the Vanilla Raspberry Napoleon and it was a perfect ending to our meal.  I look forward to our next visit - maybe for breakfast!"}
{"text":"If you are looking for a kid friendly restaurant and menu this is the place to go.  They have everything and it is good old home style cooking like your Mamma makes !  The portions are huge so you can take left overs home for later.  They have a bakery there also. The restaurant is very large and take large groups like soccer teams etc.  The wait staff  are very nice and courteous. Be careful easy to over eat."}
{"text":"Every Single Time .... Delicious food + excellent service + affordable prices = best place to eat  two thumbs way up"}
{"text":"We were here last Saturday night for late dinner, service was great,the food,not so much.  The atmosphere kinda reminds me of cheese cake factory. Their menu is like the combination of Cheesecake Factory and IHOP.  My bf ordered the chicken paillard,and I ordered the Greek meze platter and a piece of pancake.   The pancake was really tasty and it's served with warm syrup,I would definitely order them again.   My bf liked his dish, it's grilled herb spiced chicken with jasmine rice and arugula salad,   My Greek platter, however,  I didn't enjoy it much. The chicken \"kabob\" is basically 2 pieces of grilled chicken and its seasoning is not great and a bit too salty for me. The red pepper feta spread is meh, and the tzatziki sauce is a bit too tangy too. The pita bread is also too flat and almost crispy like pita chips. The Greek salad that comes with it is pretty good , other than that I didn't like anything on my plate.   I think I will give them another try next time, hopefully it won't be disappointing again."}
{"text":"Last night's service was horrible from the food to the service. Definitely not I've been accustomed to. The Chicken and Waffles for both my wife and I were bland with little bacon bits and the waffles were very doughy and soft with little taste. The service by our waitress was unpleasant, unfriendly and awkward. The last couple of trips to Big View Diner has been like this trip in regards to the food so we'll hold off from visiting until they bring their service and standards up. Very disappointed in Big View Diner.  Xenia Hospitality reached out to me as a show of PR but we're absolutely uninterested in hearing my comments about how they're processes could be better and have validated that real customer service is a ruse. Don't be fooled."}
{"text":"Big view diner has a large menu, which makes me a little skeptical.  Anyway I tried the Crispy Zucchini Fries with sriracha ranch for appetizer.  I don't like zucchini but I really enjoyed these fries.  They are fried strips of zucchini and the sriracha ranch made them taste even better.  I like the sriracha ranch a lot.  For the entree I had the maple dijon chicken without the bacon with fries.  The chicken sandwich has swiss cheese, lettuce, tomato and maple dijon glaze.  I like the sandwich a lot.  The dijon flavor gave the chicken sandwich a lot of flavor.  The fries were good as well and I ordered another side of the sriracha ranch to dip everything in which gave it an extra kick.  At the end I ordered a oreo cookie shake.  The shake was not good at all because it was runny and not thick at all.    Overall this place is good and I would go back.  The service was really good as well."}
{"text":"This is my spot! They use gulf shrimp here!!! The food is just good! The desserts are good. It's always consistent. Don't sleep on Big View!"}
{"text":"The host's desk does not seem to have trained personnel.  They kept us waiting though no other customers needed their services.  Then they seated my young daughter and me in the bar section; do they not like children?  When we returned to be reseated, they said they were cleaning a table for us (there were lots of free tables), then finally sat us in a booth.   The head hostess seemed so cold toward us; the others were nicer.   Lots of bad bodings even before we're were seated!   Luckily the food was OK (the napa salad was actually great!).  The waitress was good and fixed our problems quickly.  I hope they improve their front personnel."}
{"text":"Went for lunch yesterday.  It was after 1:00 and they were not busy.  Server took my drink order.  it was probably a good 15 minutes before she took our food order, mind you we are on our lunch break.  In fact, the other person dining with me had on her work badge.  We finally received our food and no one came to check on us until it was time to bring the check.  Food was good but service sucks.  Please do not go if you are on your lunch break and have to get back to work.  We were both late due to the slow service."}
{"text":"Nice diner with lots of food options. Have had mostly good service staff every time I have frequented the establishment. Have maybe one let down out of the multiple times I've been. I go on many dates here and would recommend."}
{"text":"Seven of us here for an early dinner (4:30)  Couldn't have asked for better service and the food was really yummy.  Chicken soulvaki, corned beef, chicken parm, brisket stroganoff, kids' meals - all were tasty!  Had chocolate cake and cheesecake for dessert to share...........took 4 doggie bags home with enough leftovers for lunch tomorrow!  Will definitely be back - come early, it started filling up at 5:30."}
{"text":"I love the atmoshere, the menu is pretty extensive and the food is good.  It's family friendly and we had a great time here on my husband's birthday.  The bakery in the front of the restaurant is nice too.  I ordered take-out twice and my order got messed up so the staff isn't quite 100%.  That was the only downside."}
{"text":"Food is awesome here! The cocktails are surprising good, and they're fairly accommodating of vegetarians. The Mac and cheese is my favorite and the portion is so big that you could eat it for three meals! Big View isn't your typical diner."}
{"text":"Huge menu with lots of choices! I ordered the balsamic chicken which was delicious...asparagus, goat cheese and balsamic made the dish! My boyfriend had the thyme chicken. It was dry and stringy and his plate was chipped.  When he told the waitress she laughed and asked if we wanted the dessert menu (?) The manager then came by and asked how everything was. Same response oh thats unsusual...sorry. Nothing more than that! He ended up eating the rest of my food."}
{"text":"Ok so we went back to give Big View another chance--- Home Run this time, service was great, bartender served us on the patio did an awesome job. Frank the owner came out and greeted our family. As always the food was great.  So with this visit we again rate Big View with five stars.   Thank you Frank and staff"}
{"text":"If you want good bread and some decent soup then this is the place to go. For food, don't bother."}
{"text":"Pros: * they except reservations *friendly waiters  * a lot of options on the menu *serves breakfast all day   Cons:  * not the cleanest * food was okay.  In my opinion, the food was quantity over quality."}
{"text":"We were traveling through and stopped at this diner as a party of 3. We waited over 10 mins, meanwhile many tables were empty. We were seated and our order was taken promptly. When our food came the portions were pretty large but the food was expensive ($14 for a chicken and rice dish). The food tasted okay, my chicken was good but the corn and rice were not so good. I think I could find a cheaper option that tastes better."}
{"text":"Been here for Breakfast, ordered take out for lunch in the past and just had dinner here.  Big View Diner has a very unique architectural design. When we first drove by it, it was like a building from the 50' or 60's. It is from a different time frame. You really want to stop and check out the place.   Yes, this is a diner but more of a fine dining aura. As you walk in the door you are greeting by two hostess in the center. To the left is the bar area and to the right is the display area of all the cakes and deserts. It's like a bakery. We had a slice of the opera cake (definitely to be shared by two).  As for dinner entrees, there was a good selection to choose from. We really lucked out this evening. Two delicious entrees.   -Beef Stroganoff- the brisket blended with the dill and the creamy sauce they used made it so scrumptious. Just brings back memories of my travels to Eastern Europe. Like something rich and hearty when I was in Budapest and had authentic Hungarian Goulash.  -Spinach pie- feta cheese drapped all over the spinach  and to end the evening off with a gigantic slice of Opera Cake. Too bad no Cappucino nor Expresso."}
{"text":"It held great promise, had a great menu and sincere servers, but failed miserably in delivery.  The kitchen is very disorganized with meals coming out willy-nilly.  Save yourself the agony of watching tables seated after you getting and even completing their meals before yours arrives.  Despite your continually apologizing server, they are helpless when it comes to getting your meal out in a reasonable time.  Ahhhhhhhhh!  Went here for breakfast and dinner.  Same-o same-o.  One of the culprits appears to be Hector, who just can't get things right the first time.  In our case I ordered an omelet, my wife blue berry pancakes.  Could it be any more simple?  Apparently not, as Hector completed my omelet, putting it on the heating plate and heat lamp window as he prepared pancakes without the blueberries.    Well, when the error was pointed out by our server, Hector re-did the pancakes, but they were raw in the centers and my omelet, that had been sitting on the hotplate for well over 20 minutes had the cheese melted to oil by the time it was served.  But the plate was hot, so hot that the server could not pick it up from the tray without napkins to shield his hands.  We had been seated for 40 minutes when our meals arrived and were too hungry and too angry to do much more that wave off the server's apologies and eat our meals.  Not good.  Oddly enough we did not suffer enough abuse, so returned for dinner with our son, his wife and two grandchildren. Why, you ask?  Because the menu had everything for everybody and it is a noisy, busy place perfect for children.  OK...ditto the breakfast experience, but we had wine, beer and booze, so that took the edge off of our frustration.    Food is just OK, but hey!...It is a diner, so what do you expect? Gourmet it ain't.  whether Hector was there or not, I did watch and there was a white-jacketed supervisor or coordinator of sorts , but apparently he must be part of the Hector Club of incompetents, so no help for the hungry.  A shame as it could be a great place.  We might try it again, but most likely not.  With the 10s of thousands of \"Hectors\" coming into the area it would be our recommendation to fire Hector and hope for a better replacement.  As for the kitchen supervisor, knock his nuts together to hopefully get his attention and motivation to get the kitchen to follow some form of order."}
{"text":"This is a place where you will find something that you like regardless if you're a picky water. The smell of fresh baked bread is instantly smelled as soon as you walk in. The breakfast, lunch, and dinner us all good! They have a dessert bar and let me tell you how good is it. We ordered my sons birthday cake from here. We ordered a Ghirradeli chocolate cake that was to die for. This place will keep doing well because if the quality."}
{"text":"Big View Diner in worth it! But the wait can definitely be long :( they are busy throughout the day, and the service is decent. Their breakfast is the best out of everything! I usually get the same thing ( for breakfast) which is the grilled cheese with bacon, egg, and American cheese, but once I ordered it and the toast came out burnt!! The waiter tried to tell me that it always comes out like that, and she had an attitude!  Overall besides that incident, Big view is a good place to dine."}
{"text":"We've been to the Big View Diner before but normally later in the day.  Have an early Dr. Appointment so we were out earlier than normal.   We walked in a few minutes after 8am and they were already busy.  Hostess immediately seated up and brought us menus and took our coffee orders.  She was back in a couple minutes with two cups of outstanding fresh brewed coffee and asked if we has made up our minds on Breakfast.  My wife order Crab Cake Benedict with a side of fruit. Been awhile since I have had Lox and Bagels so the fresh salmon bagel with cream cheese, tomato, onion, and capers sounded close enough  While we waited we reviewed the room. Lots of glass and dark wood, very modern design. It's a good restaurant and has a great fresh bakery section.  By this time our breakfast had arrived.  Serving portions are large and probably explains why I need to loose about 10 extra pounds.  My wife enjoyed her Crab Cake Benedict. Fruit was good and was a lot more than just cheap melon that some restaurants serve. The Benedict's were large and very flaky with a lot of crab and very little filler. They were very large and my wife ended up taking one home for later.  The Salmon and Bagel was excellent. Salmon had a nice fresh taste. The tomatoes tasted like a tomato should and the capers were a nice contrast.  In the end, a very enjoyable meal and we would come here more often except for the commute from Lake Norman is about 30 miles. She's already hitting me up to come down for the lunch menu so she can get the Veal Meatloaf."}
{"text":"Came her for an early Saturday lunch after a pop warner football and I'm so glad we did. We've been here before for breakfast but have never tried lunch.   I had the Thanksgiving Turkey plate and it did not disappoint. Yummy slices of sage seasoned turkey placed on top of creamy mashed potatoes, brioche herb stuffing and all of it smothered in a flavorful gravy. It was truly all the smells and taste of Thanksgiving which also included a side of chilled whole berry cranberry sauce.   The kids enjoyed their all day breakfast menu along with large muds of hot chocolate. So if you ever want an adult meal but the kids want simple and good food, this place will offer something for everyone.  PS the cakes on display at the front counter look and smell amazing."}
{"text":"We truly only go here because their kids menu is impressive.  Where else can you get baked salmon off the kids menu.  As for everything else, well it's just ok.  To date I have had the fish sandwich, which was dry and lacked flavor, and the southwest salad, this was good.  I have yet to try breakfast, which is served all day.  That's a plus."}
{"text":"I've gone about five times now for some Sunday lunches and was only pleased once in all those times.   Like some of the reviewers, I'm originally from the north where diners are nice and plentiful but I was looking for a good diner in SC. The food here was always ok to just bland (save for their french fries which were always good). The one thing I got that was amazing was a bbq burger that they removed from their menu for some reason.    Service has always been terrible. You'll stand around waiting to be seated for a long time and by the time you sit the servers take 15 minutes to greet you and you'll only see them maybe 3 more times from there. The day I had the bbq burger the air conditioner was dripping (it dripped on me a few times) and their solution was to have their dish boy mop the vent over the customers. A lot of dust came off those vents despite the condensation.   Their prices are also a little higher then other restaurants. For the price and quality you might as well go to a chain restaurant."}
{"text":"We have eaten breakfast lunch and dinner here. Food is great and they don't mind us picky eaters with substitutions and special cooking instructions. I've yet to try the desserts but hear they are to die for."}
{"text":"BIG VIEW is our go to Diner for all ages. Everything is made in house right down to the bun on your burger at a reasonable price. We have eaten here since it opened. We have never had a soggy chicken parm, or a single piece of old lettuce. Nothing but quality comes out of this kitchen and the staff is excellent. My favorites are chicken and waffles, fried zucchini,  the big Greek salad, and their fresh made cannoli. They also have an amazing bakery that you can get just about anything you want from! If they don't make it you can bring them the recipe and they will make it especially for you, because they aim to please. That's what I like about this place. They are all about the customer and if god forbid something were to go wrong it seems they would go to their grave to make it go right for you. Love this place!"}
{"text":"This used to be 4 stars, but unfortunately the food quality has really dropped in the last couple of years.  The corned beef hash is still awesome and the selection of desserts is good, but most recent dishes I have tried are not what they used to be."}
{"text":"We waited 45 minutes for a booth on a Saturday night. Both bars had open seating. We started with the Kung Pao Calamari and it was awesome!  Very tasty and they gave us chopsticks :) fun! Our waitress was friendly and witty at first. Then as she had to cover a party of 10, she became laser focused on their needs and neglected us completely :( Our meals came missing items promised and we waited for quite a few minutes to have them retrieved. Drink refills took a couple requests per refill. (But she kept them coming for the table of 10! I felt like taking our glasses to their table) My turkey Reuben was ok... it was thick sliced turkey meat instead of deli meat which would have been preferred. I would not order it again for sure.  The sweet potato fries did not live up to the waitress's description and I wouldn't order them again either. My hubby got the Challah french toast which was good but it doesn't compare to the Midnight Diner's french toast. He enjoyed the grits and said that the scrambled eggs with cheese were \"alright\". The apple smoked bacon was too crispy and not memorable. The decor was pretty interesting and unexpected as you walk inside. Not your typical diner decor! Despite the obvious issues found on this visit, we will return and try them again. The menu is vast and we would like to give it a few more tries!"}
{"text":"I visited big view diner for third time tonight and have to say I was very disappointed in the food.  I think there was not even 2 ounces of meat in my stroganoff and what was in there was tough and stringy.  For what I paid for it, I expected it to be good.  It was definitely a letdown and made me think the extra 20 minute drive I took to get good food should be in another direction from now on.  3 pieces of mushrooms and a tiny piece of what was called \"brisket\" was definitely not worth it.  Service was great which was only reason I put 2 stars!  Too bad food didn't match."}
{"text":"As always enjoyed the great diverse menu and the friendly service.    There's something for everyone.  From fresh pastries and juice to biscuits and gravy and chicken and waffles if you have a breakfast favorite chances are you can find it here.  Only drawback is that the massive post church rush on Sunday's makes it tough to get a seat without a wait.   By far the best breakfast place in South Charlotte"}
{"text":"We've been here many times and every single time has been great.  What I love the most is that the menu is so diverse that everyone in my family of 5 can always find something that they like.  Although my boys ALWAYS have the chicken and waffles.  I tried something different this time: salted caramel sweet potato french fries.  Now these things are so rich that you have to share them. 3 people easy.  Delicious.  If you don't like sweet, don't even go there.  My husband had the seafood platter for his meal which he said was okay, but he raved about the calamari we had for an appetizer.  We order calamari at every restaurant we go to and he said this was the best he's ever had.  It's just the rings, flash fried in a sweet and spicy sauce.  Sarah was our server and she was so engaging, professional and helpful with the menu.  Almost forgot about the made from scratch desserts.  Great family restaurant."}
{"text":"This place was so great when it opened. We went there very often, and then the food and service started to go downhill, so we took a break. Well, we went back tonight, after about 10 months and our server was great...attentive and friendly.  However, the food left a lot to be desired. The hamburger was served cold, as were the fries.  The chicken parmigiana was cooked to the point where it was chewy and dry...more like chicken parm jerky!  The plastic covered menus are dirty and falling apart.  Peeling plastic piece fell on the table when I opened my menu.  All in all, it was a disappointing experience, and we will probably be on a permanent break from going there this time."}
{"text":"Stopped by for the 2nd time on Friday with my sister and my nephews because the 6 y/o stated he wanted grilled cheese and not our normal pizza and we knew they had it from the last time we were there.  We were sat right away.  Our server wasn't the friendliest but she made sure drinks were refilled and she stopped by a few times to check on us.  I tried the Californian chicken sandwich this time and it was really good.  It was basically chicken with roasted vegetables and melted cheese on an onion roll.  The roll was soo good, it was soft and chewy and I liked it a lot.  The bread they bring to the table is good too, 2 rolls and 2 pieces of cornbread, all warm and very tasty.  Kids enjoyed their grilled cheeses, but my sister was not happy with her BLT, it came with cheese on it which she didn't know and she is lactose intolerant, and it had hardly any bacon.  Also, we opted to do salads instead of fries with our meals and our server said it was an upcharge to substitute and we said fine.  When we got the bill it wasn't an upcharge they just charged for a regual salad, thought that was a little lame."}
{"text":"Visited this restaurant with my sister for only the second time as I haven't been to Charlotte lately. It was as good the second trip as it was the first. Our wait for a table on Sunday morning was about 30 minutes, but this gave me time to review the menu and peruse the bakery case. Once seated we received great service and food, but the cold draft flowing from the air vents in the ceiling was uncomfortable enough that I went back out to my car on a drizzly and cold day to get a jacket. This is why I can't bring myself to give 5 stars, because I am not a polar bear. After a flavorful meal, I did purchase several pastries to bring home. Fantastic stuff!! The peppermint scones were Out Of This World fantastic. Crave worthy!"}
{"text":"Booths and chairs recently got new upholstery. Looks much better now. Now you can actually bring someone here on a date."}
{"text":"We are regulars in this joint! I'd say there are days when orders and food are perfect and days when things are out of hand, but nothing really major mistakes! Little details that we always let it go! you can't always complain when there's nothing wrong with the taste anyway!   I always get the Salmon, I have given up on some of their items on the menu as they do not seem appealing to me look and taste wise! but the salmon, they can't exactly ruin it? if they do- well, I better find another place, right? The Devilled Eggs, nothing you can ruin either! simple boiled egg, and mix the yolk with a lil touch of mayo, dash of pepper and so on and on.. simple! but yesterday's Devilled egg? OH MY GOD! It's like eating a snot, no flavor, whatsoever! Must be the chef working yesterday morning! and the rice? how could you ruin a rice? -- yes by serving me the rice from previous day!   Otherwise, this place is decent! but expensive! :P"}
{"text":"Slow service and food is nothing spectacular.  Always busy which seems odd for the food being boring! Too many options may be the problem!"}
{"text":"First time here with family. Service was good. The food was not. My lamb gyro wrap was filled with very thin slices of lamb that were over cooked.the side order of onion rings were over cooked. The waitress was kind enough to bring another dish of onion rings, but they to were so crunchy you could chip a tooth. One of our guests had the pot pie and said it was so so. I gave them two stars for service and ambience."}
{"text":"Been here several times and the service was ok. Today my daughter and I were seated at the bar tables and we were the only customers this side. The waiter didn't come to ask for drinks for almost 15 mins. I ordered chop steak, jasmine rice and sauted spinach, and the rice was hard as rock.  The waiter never came back so I had to as the bartender and talk to the manager. This was 3:30 and the place empty.  Horrible service!"}
{"text":"Had not been back in almost a year and was looking forward to the great food and service we had experienced previously.  My first inclination of dread was when I saw the catering van still had the name of restaurants that they had closed.....but in I went. My wife and Granddaughter were already there.  While waiting for a table some people walked in and were immediately seated? When we were finally taken to our table it was in the back of the restaurant where wait staff were constantly walking back and forth with food and drinks and dirty dishes.  My Granddaughter would be sitting in a high chair directly in the path. I told this to the person seating us and asked for another table. I was told that we could not have a booth, with a highchair, because of fire regulations. Side note...ate New Year's Eve at another restaurant at a booth with a highchair! We finally were seated at another table.  Our waiter came by,  took our drink orders and promptly brought them back....well he got one of two right! He took our order and disappeared.  The table next to us filled up with eight people and a wait staff person took their order. Now the wait began....and continued and continued. The table of eight got their food and our wait continued. Finally a runner brought our food....well two out of three. Evidently they didn't read my order correctly and made my Patty Melt with Beef instead of Turkey.  They rushed the refire and my food came out fairly quickly.  Having been in some sort or food service for most of my life I knew the trick...the top bread of my Patty Melt was nice and grilled.....the bottom soft and greasy. The dressing was on two thirds of the bread. I pulled the bottom bread off and ate that half. Thought Patty Melts had Grilled Onions...guess not here. Had Onion Rings instead of Fries.....never seen Onion Rings that dark and crispy... OVERCOOKED! Let's tally up the scorecard.. Drinks 50% correct Food 66% correct ------------------------------ Final Score...It'll be another year before we go back... MAYBE!"}
{"text":"The service is always great and so is the food! Love coming here. Keep up the geat work!"}
{"text":"We have tried Big View many times over the years and it never improves. Will not ever be back. The bakery looks good but every item we have ever tried has been dry and tasteless. Don't go expecting a yummy diner experience. Save your time and money and go elsewhere."}
{"text":"I was very excited to try this restaurant, but left highly disappointed.  I got a Cesar salad and lobster bisque soup...pretty basic, right? Apparently I was wrong. I am not a picky eater at all, but wow...both of these items were terrible.  I didn't complain and kept trying to eat more thinking maybe it was just me, but then my husband tasted the soup and I have never seen him respond like he did. His response, \"that soup is disgusting.\" Oh and along with my food being terrible and my husband's fries tasting like they were soaked in oil without being cooked, the air conditioning unit consistently dripped onto our table (and the table beside us had another A/C unit drip all over them too).  Mmmm yummmy addition to our food.  Gross. We also had to wait until our food came out before we were given a high chair for our one yr old.  What a nice dinner it was."}
{"text":"We were just driving into Charlotte and decided to stop here for dinner. Had the best Blt ever! It came on grilled sourdough, with avocado and a tangy pesto mayo, Yum! and sweet potato fries on the side ( it also came with a well done egg, but i had them bring it on the side for my doggie)/"}
{"text":"The food is consistent, hot and yummy! Service can be spotty but isn't usually a problem. Going on a Sunday morning? Plan to wait a while...Excellent breakfast choices, Try the blueberry pancakes and best grits I've had around the area. Lunch is even better! Side spinach is freshly prepared. Great place, all around."}
{"text":"Went here for breakfast, hoping for actual diner options. I could not be more wrong. Their selections are mainly eggs, with a side of bacon, toast, hash or pancakes. There are one of each main bfast staple: waffles, pancakes and french toast. But again, I don't eat eggs that are not cooked into another dish, so options are really limited here. This place does get crowded on sunday mornings, and as huge as it appears outside, the dining space is small. Also, sitting near the kitchen, I started to get allergic reactions that I normally get from a cat (sneezing, watery / itchy eyes, runny nose). I didn't inquire but why would they tell me the truth since cats aren't allowed in food establishments."}
{"text":"Mediocre food and horrible service. The Big View is obviously the weak link in the Xenia Hospitality Groups' otherwise stellar offerings.    I have been to the restaurant a few times and always leave saying I will not return. I will not repeat the mistake of giving them another chance.  If you are looking for a big plate of food you won't be disappointed as long as you aren't picky about quality and don't mind overpaying for it or the poor service provided.  Two thumbs down Big View."}
{"text":"I have been back a several more times since it's so close to work. The management and staff are very friendly and helpful. I enjoy that they are constantly updating parts of the menu to keeps things fresh. A few of my friends love getting their breakfast items for dinner. Food is also good. I think I was a little harsh when I rated it as only \"decent\" in my previous review. Finally, they got a really nice bar area and a private room in the back that's great for really large groups and private gatherings."}
{"text":"A Diner with a restaurant identity crisis or is the other way around either way it stands in a VERY good way.   I've put off stopping here purely because of location.  NO LONGER!  I've been missing the diners of NJ and was in the neighborhood.  The growlings of a homesick foodie are put at bay.   The initial pungency of sewer gas/grease trap/trash at the front door (hey, it's summer, in the south. No worse than the smells of Elizabeth, NJ but, notable) was a put off until the gates of baked goods shangri la opened and you are encased in the aroma of cinnamon rolls and whatever goodies were baking this AM.  Not only are you greeted by a host/hostess you are treated to the classic clatter of coffee cups and plates behind the glass case of cakes, pies and pastries (OH MY) had me planning dessert before seeing the lunch menu.    Planning on a burger or club sandwich, you know, \"the tell' for any diner worth its chops in the NE (or is it the meatloaf and gravy?). Seated in the middle of the larger dining room (there are two sides) it is minimally decorated, which is a good thing as it focuses you on who you are with, whether it be a book or your lovely spouse, I was with the latter. Not the tome of a menu you expect in a diner but enough to sample from all that you could desire and BREAKFAST ALL DAY! Coffee is elegant and flavorful. I did not have breakfast but, too notice of other plates as they went about the dining room and they looked to be standard: eggs, omelets, bacon , sausage, golden hash browns/ home fries and  thick slices of toast.    We started with the thick cut onion rings. Thick, tender and sweet onion, crunchy and not over battered or greasy served with a savory remoulade that made me want to order another batch as a side.  I opted for the feature of The Skyliner, a pound of (tender) corned beef, (perfectly) roasted turkey and (glorious) pastrami topped with swiss cheese, grainy mustard and horseradish between two slices of first bite to last (yes, I REALLY did eat the whole sandwich) hold it all together, not soggy, airy GRILLED rye bread. My lovely bride chose the steak burger (excellently cooked) bright pink medium. Speechless was the rest of the meal except for the \"how is it?' and that was almost ignored. Not a sample bite was offered on either end (wife does not like and to her regret, pastrami or corned beef) and she was enjoying her burger to much for me to risk losing a finger. The fries are crisp and hot and almost an afterthought considering the in house made bread and rolls the sandwiches are served on.  Consider another side from the regular fries, like the sweet potato fries or mixed green salad. The Chef checks on tables in the downtime of his expo. duties and is genuinely interested in your delight.  Dessert was not eaten (I just ate a pound+ of meat and bread come on give me a break) but, the Triple D was considered and will be happening sometime soon. Miranda (our waitress) was knowledgeable, polite, quick and at the end of the meal offered \"roadies\" of water or coffee.   Well worth the visit and I will be going back for my own burger and the Triple D!!"}
{"text":"My family went for a late lunch. We were told 35 mins, but surprisingly only waited 15 mins before being seated.  For a group of 5 the table was a bit small but we made it work.  Menu was limited because it is Easter Sunday. You could not order off the everyday menu. Drink orders came, but after bring it up to my nose it smells like mildew. It was on the cup, and in the ice. Water lines need to be replaced. Yuck. Most likely the soda machine needs to be cleaned out also. Food was really good, but service was very lacking. After we got our food she just disappear. My mom had to track down a to go box."}
{"text":"Sorry to say this place disappointed me.  not a diner over priced underwhelming salty food and poor service.   Would not recommend .  Important to note if the menu is longer than a page. There's probably not much good.   1 star for the thick milkshake.  1 for the great looking desert case."}
{"text":"I hadn't been here in at least two years but decided to take the chance again since we are BIG fans of Ilios Noche - so glad I did!  Decor is loud NJ diner - if you grew up in the Northeast or Chicago it will bring a tear to your eye - loud flour, big bakery case, dinettes and neon as far as the eye can see. Totally over the top but awesome.  Service was brisk (it was Sunday night). We started with a round of drinks and started with the  yuca fries. Served with chimichurri sauce, they were crispy, salty goodness and the sauce was a great accompaniment.   For dinner we covered the vastness of the menu (it has everything from greek to burgers to pasta to salads). I had the lamb gyro platter, my daughter had the sliders and my son had the gluten-free ravioli. All three were excellent - the greek items are straight from the Ilios menu and the attention shows (in particular the pita bread and tzatziki sauce). The ravioli's and sauce worked very well together and the portion was generous. The sliders were pretty much what they were - good size mini burgers served with fries.   We also had a slice of the crazy large chocolate cake - enormous and enough for three to share!  Overall this is a great option if you are with a group and can't settle on what you want - the food is high quality across the board and the decor is fun."}
{"text":"Well, I'm from the NY metro area originally and was hoping to find a northern diner experience here. Although the food wasn't bad, it just lacked that northern Greek Diner touch. The one thing that totally turned me off was them bringing our meals to the table without  them being complete. So I sat there with my burger getting cold, waiting for my french fries. \"They'll be out in just a few moments sir.\"  A manager stopped by to ask if everything was ok, to which I replied, \"It would be nice to eat my french fries WITH my burger!\"  Bringing meals to the table before they are ALL complete is one of the cardinal sins in the restaurant business.(another one is clearing the table before EVERYONE is done eating).  The burger was tasty and cooked as ordered. The portion of meat was about half the size you would get up north though. Ketchup was provided in a small cup(no bottle on the table) and of course there wasn't enough to finish the fries with. Real diners provide the bottle on the table so the patrons can use as much as they like. DON\"T SKIMP on the ketchup for goodness sake!  Although I may seem overly critical, the restaurant is the closest to a diner that we have in these parts. I would not drive half an hour just to go here again, but would come back if I was close by."}
{"text":"Waited over an hour and fifteen minutes for our appetizer. Which was only chicken wings. No refills on our beers. Had to ask and then wait for another half hour. Waited too long that we had to even cancel our main courses and make plans to go elsewhere. Husband ordered the chicken and waffles. Didn't even finish it. Said it was the driest chicken ever. Said he preferred if we would have went to Wendy's. Beer was greater than 1/3 foam for a local craft brew. Mentioned this to the bartender which is where we were sitting and she said they always have foamy taps. She gave us one beer total on the house for the wait, yet charged us for it on the bill. It was Thursday so half price wine bottles. Conveniently sold out of the cheapest/most affordable bottles. First and last time visiting despite living less than 2 miles. We will always be loyal to DBs tavern!!! Never disappointed there."}
{"text":"THE BEST!!! I live in the big apple (NYC), and have visit this diner frequently whenever I go to see my parents who live in Fort Mill. The food is always excellent.  Anyway, my mom & dad both got the flu.  I called all around for take out, and then I remembered this place. Well, the manager, Brittany, delivered 3 large containers of soup to my sick parents.  I just want to say something about Southern hospitality here.  It is everything that they say it is and the BIG VIEW DINER, is living proof.  Thank you Brittany.  You have just made a major investment in Karma.  To ad, all of their soups are made from scratch not cans, and they absolutely have the best burgers around.  All of their deserts are to die for as well.  I am a New Yorker and fussy to the max.  This place gets a 10."}
{"text":"We stopped in for dinner, the menu was good with plenty of choices. I ordered the Dijion Maple Chicken sandwich. Did not taste the Dijion, Maple worst sandwich I have had the chicken was dry and my fries were soggy. The used hickory smoked bacon, instead of maple cured bacon. My wifes food was worst and the chicken she ordered had no taste I mean NO taste. She was trying to eat it and just could not eat it. They maybe able to make breakfast but dinner is not good. There were some older couples there and I asked them about thier food and they were not to happy either, but the one guy said you come here you get ue to it. Well not going back. our wairtress was outstanding and was very attentive to our needs but the kitchen was not plating food that had any taste.  Sorry I know my food and how to cook and the food that was plated for us, I would not even send out of the kitchen."}
{"text":"First time we've been to this restaurant and I must say I wasn't impressed at all. We were seated right when we arrived, but were put at a booth/table which was very close to other people. This would've been fine, except we have a baby and needed room for him. The server arrived promptly and got our drink orders. When it came time to order, she pulled out her note pad which caused her to drop some change. She then proceeded to say we are her last table. I've worked on the industry before and would never tell my table that. My boyfriend ordered a salad. He received it with our meals. The food was ok. He didn't like the sauce for his brisket, it was sweeter than most. Not that big of a deal, but I ordered a wrap. They really should put more meat in their wraps. All of that aside is one thing, but the server never asked if we need anything? At the end of our meal, she didn't even ask if we wanted dessert? She could've gotten more, but she just wanted to get out of there. Which you could tell, especially since she basically was pushing us out the door. We will not return."}
{"text":"This place has taken a turn for the worse. Tables falling apart, booths ripped up, paint peeling from the sides of tables, tape all over--wow. Food has gotten worse, too. Unfortunately, I can't recommend BVD anymore. Hope they can fix it."}
{"text":"Food is just good. The service is good anywhere but in the bar area. Had bad service in the bar area several times."}
{"text":"Always pleased, service is spot on, and food is delish! Can't go wrong with the Greek salad and salmon. Yes, Greek salad in a diner. If you know anything about upstate diners, they make the best Greek salads. Forever I am missing NY and Jersey diners. Everything here is good and fresh to order. Yummy."}
{"text":"Stale blueberry muffin. Asked if I could get one that was made today. The waitress said definitely not. For a place with a bakery, this was a bit surprising. Asked about the fresh squeezed orange juice on the menu- yeah, it comes from a carton according to the waitress. Eggs were good, bacon was ok (not thick, but not totally paper thin). Ordered an English muffin- cane cold and soggy and not buttered. Not great service either..... it was just ok."}
{"text":"I'm a Charlotte native and this is my favorite diner in Charlotte. I stop in anytime I'm in the area. The prices may seem high to some but the portions are generous and the quality is there as well! The service has always been good when I have been. This is a well run diner! Some of my favorite dishes are the turkey dinner, the spinach pie, the pot pie and the balsamic chicken. Of course, all of their Greek dishes are great as well! They have their own bakery so the desserts are to die for!  They have a different soup of the day and drink specials every day of the week. They have lunch specials Monday-Friday 11AM-4 PM."}
{"text":"Went back for lunch/dinner and have to admit that we did not enjoy it as much as we did our first visit....however, the desserts were still outstanding!!!"}
{"text":"I really like this restaurant. Large, clean, well lit with a huge menu to appeal to any palate. Soups are delicious and everything is wonderful."}
{"text":"The food here is good. We came for brunch one Sunday and luckily found 2 seats at the counter.   The reason it doesn't get more stars is because of they way they speak to their employees. Servers had to literally drop what they were doing to answer to the owner (?). If they didn't come to him fast enough he yelled louder. Very offputting and offensive. I actually tipped my waitress better because of this.  Making your customers happy is top priority, but so is treating everyone with respect. I was with my young son and I don't think we will be back, unless we are sitting at a table. I didn't like him to hear all of the yelling and the way others were treated.  However, if you do go, get the Spanish omlette."}
{"text":"I've eaten at Big View probably 15-20 times and most of the time the food's pretty good. But I just finished a cannoli from there and had to sign on to Yelp just to tell you it's the best cannoli I've ever had. Whoa, whoa, whoa."}
{"text":"Something that really irks me is unpleasant and poorly run front of the house management. We came here at the recommendation of a friend on a Sunday for brunch and were greeted by two grumpy and rude hostesses. Additionally, there were tons of empty tables and a huge wait, not great for customer morale. After a 30 minute wait we were seated in a booth next 4 empty tables and the hostess didn't say a word to us. The 4 tables were all filled up immediately after we sat. Our waitress was friendly and attentive when she could be, since she was dealing with 5 tables at the exact same time. I ordered the Greek omelette and hubby got French toast with eggs and sausage. They messed up my husband's order but our waitress had written it down correctly and immediately brought out the sausage and eggs which were omitted from the original plating. The food was pretty good, the French toast was very tasty and I really liked my biscuit. I was about to rate this place 3 stars until I went to the bathroom and there was a nasty nasty mess in one of the stalls. I think some training on hostess staff and regular bathroom checks would greatly improve guest experience. Might try again at a less peak hour in the future."}
{"text":"Ordered the Cuban Pork Sandwich. Very dry and not grilled on a press while the pork was flavorless and dry the point I had to add water to it. Flaccid fries were the high point of this extremely poorly prepared \"diner\" fare.  Was seated in the lounge area near a obnoxiously loud bartender and her drunk friends. Needless to say I will take a bigger view to find a better place."}
{"text":"Ate here for the first time today.  Very eclectic place.  Cool diner with lots of atmosphere.  Plates come full of tasty treats.  Hard to clean them by yourself.  Have already found my next meal on a very full menu of items.  Turkey Burger rocks!"}
{"text":"After several visits, the food is consistently on point and the the service from Jamie today was extraordinary!  It's beyond refreshing to see a server that so clearly loves what she does! Hats off to Holly and her team! Keep up the awesome work!"}
{"text":"I had never heard of this place, but my boss loves it so he took me when we were in Charlotte on a business trip. To quickly summarize my experience, it was great! Service and food was all top notch. Their menu is quite diverse, so I can almost guarantee you'll find something you'll love. I had the grilled salmon in a reduction sauce with asparagus and mashed potatoes and it was amazing! I got to meet one of the owners, Angelo, and he was a great host. He talked with us most of the evening all while supervising his very busy kitchen. I would definitely recommend giving this place a try if you are in Charlotte."}
{"text":"I am now and forever will be a part of the BIG VIEWER fan club!!! A great selection, perfect size and the desserts are soooo super duper scrumpdillyishous! Whether you want a simple soup and salad, or light and tasty salad with homeade dressing, a sandwhich that eats like a meal, or a nice choice of finger foods, this is the place. Love the party room and the fact they accommodated our large group.  So hard to find restaurants with good food, pretty things to look at, and reasonably priced (given that side of town), not to mention the excellent service.  I also love that the head Chef, Frank walks around to say hello.  I even looked in their kitchen and bakery and knew this was my favorite because the floors were clean.  No employees smoking in fron or on the side of the building and the bathroom, though it was crowded to capacity, DID NOT remind me of a horror movie...... I was happy that my critical group of picky eater girlfriends were all satisfied with he selection and we definitely had a GREAT time...."}
{"text":"We've been to this diner a few times since we've moved here and would have to say that the food and service is consistently OK. The bakery by far is the best feature of this place and breakfast is good. We have ordered birthday cakes and they were well made and tasty."}
{"text":"Haven't been in a Long time but It was AMAZING  when I Did dine there. Im not sure why I have not returned however,  I do recall the food being slighty pricey for the items that I ordered.  Hmmmmm Im going tomorrow and hopefully I wont have to come back and change anything!  #FoodWasGoodTho"}
{"text":"We were in a celebratory mood (more on this in late March for my fellow Yelpers) and we've always had a good experience here.  However, one of the orders didn't meet expectations.   Overall,  the food was decent (3.5/5) except for one meal which brought the rating down.  That was the Reuben sandwich.  Now, it passed the eye test but did poorly on taste.  The corned beef was too fatty and the thousand island dressing tasted stale as did the bread.  Just not a good example of a classic sandwich.  The other dishes were fine (4/5) I had the steak salad and the beef was very good and the chicken pasta dish garnered good praise.   The service was excellent (5/5) and we had this waitress before and she was consistent and friendly.  We'll dine here again but it may be awhile before we do."}
{"text":"I've eaten at the big view Diner many times.  I love the desserts there . They're large and they are delicious New York style  95% of the time the food is delicious other times I have had cooked  vegetables that were raw, coffee that was cold and   a skirt steak that was tough.   However the majority of the food is well portioned and attractive and served hot. The servers are generally friendly and attentive.   Today we ordered  a  Greek salad , roasted turkey cobb salad a chicken gyro,  lamb pita and New England clam chowder  All entrees and salads were delicious. However the clam chowder was thick and pasty with little clam flavor.  A good menu, reasonable prices and generally good food keep me coming back"}
{"text":"Dined here tonight and had a pleasant experience (as usual) Our waitress checked on us when needed, and food was good. I got the Ranchero bowl but there's a variety to choose from on the menu. This place is definitely one of our go-to spots!"}
{"text":"Big View is my 'go to' diner. Their breakfast is great. For dinner, I like to get their Gyro. For dessert, I get the cannellonis. Big View has a great bakery. The staff is very friendly and always remembers me."}
{"text":"The service was nice but the food was mediocre at best. The food took a long time to come out even though it was not busy. The salads were pre-dressed with watered down tasteless dressing. Other toppings on the salad were skimpy. All of the food needed seasoning. The prices were very, very expensive for the quality and the quantity. We will not return."}
{"text":"The atmosphere, selection, and prices  are not the Only thing that make this place wonderful! We had the best waiter named Russell and loved the enormous menu choices. This place is amazing. Our food looked so pretty, we Didn't want to eat it. This is definitely my all-time favorite restaurant. From the all day breakfast with red velvet waffles and fresh omellettes, to the walnut crusted salmon and endless desserts. You can not loose at the Big View Diner.!!!!"}
{"text":"The most fun thing about this place is the aroma that smacks you in the nose the minute you hit the front entranceway.  Somehow they must vent in those sweet bakery scents, which reminds you that this is a good place for desserts.  Today, however, was about a late breakfast for me and it was very good. A lot of food for the money.  My lunch companion had ordered salmon with mixed veggies, but instead got salmon with sweet potatoes.   They quickly corrected this when we told them.  At the end of our meal, the server asked us to remind him what we had eaten so that he could ring it up.  That was a first for me and I left wondering if this was his normal way of ringing up his orders.  I should have told him I had eaten the stir fried coon."}
{"text":"My boyfriend,  his son & I went here for Father's Day. They had awesome eggs & the server was very attentive. The atmosphere was nice as it was a cross between a diner & a restaurant."}
{"text":"Great breakfast! I like that it looks cartoony, it drives people who judge a book by its cover away. Fast friendly service, and the coffee is actually great. I love Greek run diners"}
{"text":"Food was good however service was lacking...  had to get a waiter to get ketchup, steak sauce and ice after our food was delivered to the table.  We ordered a pie to go and waited 15 mins before we went to the front ourselves to pick it up.  Management issues?"}
{"text":"Extremely disappointed with my late evening dinner. The veal meatloaf had a tremendous amount of filler which caused the dish to have a grainy mouth feel and a very bad Chef Boyardee meatball taste.  The cannoli cake and strawberry short cake were the highlights of the meal."}
{"text":"Came to this restaurant with no expectations because it was our first visit. We were dressed in casual wear of tshirts but we're still very presentable. As soon as we walked in we got dirty looks from the hostess on our appearance and once we actually sat down we were never served. After 10 minutes of no service or even acknowledgement from the multiple servers that walked past our table serving those around us, we left. I do not recommend this establishment if your hoping for respectable service."}
{"text":"This was my first time here and I loved it! I had the Spanish omelette, hands down one of the best omelette's I have ever had. Our waitress, Jenny was super friendly and adorable. The best time to get there is before 9:30, it's pretty busy. This will definitely be our new Sunday morning breakfast place (sorry OPH)."}
{"text":"This is a really cute place! Very eclectic in it's interior. The dessert case to the right of the entrance is very enticing and appears as if the desserts would be great. I believe they are made in house. This place does boast a wait, and aggravating the fact is that they don't give out any hand held devices that buzz when they are ready to seat you, but call your name instead. We waited about 15 minutes early Sunday morning, as this place is very popular. Hubby and I enjoyed our breakfast and our waitress was on top of things the whole time. Our coffee cups were never empty at all.  Hubby went with the Cajun omelet with potatoes. He immediately commented how appetizing it all looked and confirmed that after having a bite of each. I had the eggs Benedict which I had been craving for awhile. I ordered your standard eggs Benedict but was less then thrilled with it, it was just very standard and didn't taste any better then the one my hubby makes for me at home. The potatoes were good, with nice seasoning and bits of onions and peppers to add to the flavor. I also had a side of corned beef hash and that had a spice in it I couldn't identify, but it added a nice flavor to it. We would definitely go back again for both breakfast, and dinner. Hubby and I both love diners and to find a good one is rare, and we look forward to visiting again."}
{"text":"Second Chances are always worth it.  I had eaten at this diner about 6 years ago and did not have a very favorable meal. Never went back and never gave it much thought. Then I was invited to a Baptismal Luncheon there for my Granddaughter. It was in a separate room which was nice and we had a very good server. Food had really been stepped up. I know that it is owned and managed by Illios Noches which I do like, and it seems they have made the food and the service much better. Usually a large group,  which this was , Is hard to take care of of, but it was service on!  I ordered ( from a limited menu) the Chimichurri Steak. I ordered it rare and it was served cooked perfectly. The sauce was very flavorful. It was served with fresh green beans. Everyone ( 26 People ) had pretty good experiences. Desserts were fun and delicious!  So it goes to show you...Second Chances are worth it!"}
{"text":"Another incredible meal & service from what has to be the best diner in Charlotte area. The Balsamic Salmon & Argentinian Flank Steak are great. Good service from people who care."}
{"text":"We have always had decent service here and the food has always been good. The variety is the best thing about this place... besides the BAKERY! Holy god, everything from the bakery is heavenly. I gave this place 4 stars out of 5 because a water vent was leaking and dripped on my family and I and we had to request to move; the waitress didn't apologize. Otherwise, we go here often."}
{"text":"Hit or miss...  Food quality isn't consistent.  Took them 3 tries to make a scrambled egg w cheese for my daughter- we just stuck with the dry pancake.  Overpriced.  I wouldn't waste my time here when there are so many different restaurants in the area that are worth the try!!"}
{"text":"Collectively my husband and I give this a 4 Star. I've been here before, for a bridal shower. We sat in the \"sun room\" in the back. It was a nice experience then. On this occasion we sat in the regular dining area. The wait to be seated wasn't that bad, but my husband felt like after we were seated, we waited a while for our waitress to come check on us. The food was good though. My husband got the full house: 3 eggs, bacon, sausage, potatoes and pancakes. He's a big eater! I got the banana foster French toast. It was a huge portion, but very tasty! They also have mimosas which are my go to for breakfast! Overall it was a good experience!"}
{"text":"order waffle. TWICE IT CAME OUT COLD.  Waitress channel stay away from. Ask to tlak to manager he never came to table. Anthony the manager gave me 9.00 for the waffle. I still went home and cooked myself dinner. Husband was made I complained. Wouldnt you?"}
{"text":"Bad service, horrible attitude, and overcharging.   I ordered the smoked sausage breakfast to go; at pick up Alex made me wait and stand over 7 mins while she played with the cash register; when she finished with the register, she charged me a $1.50 up charge for the smoked sausage breakfast which is listed at $7.95 on the menu and online.  I thought that was a little off and showed her where it said $7.95 on the menu for the smoked sausage breakfast; she got the manager. Mgr Ashley started talking very loudly AT me with a condescending attitude and said it was because I wanted smoked sausage in my smoked sausage breakfast (HUH???) that I was assessed an up charge. Then she changed her mind and said it was the poached eggs which were up charged a $1.50 fee. I let her know I've never been charged extra for poached eggs in all the years I've bought from them. Then she acted like she wanted to be magnanimous and do me a favor and give me a discount \"just this one time.\"  No one could show me an up charge for poached eggs on the menu. I asked for a higher Mgr and none was in the restaurant.  I just decided to leave, I wouldn't enjoy the food at that point."}
{"text":"I can't eat somewhere that's not clean and the Sunday I went it was so gross, I haven't returned to eat there. Which is unfortunate because it's convenient location. Their portions are generous & their baked goods are excellent. I have special ordered desserts - especially pecan tarts! So, the bakery rocks!"}
{"text":"We have been coming to Big View Diner for about 5 years now, and today was by far our best experience.  The hostesses were very friendly when we arrived, and while one set up our table, the other talked to my 5 year old daughter and treated her as though she was her best friend.  Our waitress was great, and very helpful when it came to dealing with my daughter's dairy allergy.  She took the time to inquire about which foods she could eat, and we didn't even have to ask her to do it.  The kitchen staff was very accommodating to the dairy allergy as well as the gluten allergy for someone else in our party.  The food was delicious, and all of us cleaned our plates.  We will definitely be visiting again!"}
{"text":"My family and I have been eating at Big View since it opened and have always enjoyed the food.  We just ate there this evening and were disappointed with our meals.  My son ordered the steak burger and only finished half of it because he said it was flavorless.  I tried it and agreed it definitely could use some seasoning.  My daughter ordered the sliders and the top bun was harder than it should be...under the heat lamps too long?  Stale?  I ordered the spinach pie and while it was just ok that is just a taste preference.  The issue I had was they put the cold salad on a hot plate which in turn wilted the lettuce.  Another thing I noticed is that most diners had a basket of bread which we were not offered. Wondering if it depends on what you order or just the whim of the server as to whether you get bread.  There are so many places to eat in the Ballantyne area that a restaurant really needs to be on their A game at all times.  Tonight Big View wasn't even close.  I probably will give them another chance but it will be a very long time from tonight."}
{"text":"Very nice place. Too nice to have diner in the name. Very classy. The calamari was awesome and the crab cake sandwich was good. Friend had patty melt she said was awesome. The fries were awesome shoestring type. The classy atmosphere had a classy price but I would definitely go again when in the area."}
{"text":"I know, I know, my last review says I won't be back.  This time I mean it.  I was persuaded by a friend and succumbed to the pressure.  I'll get this out of the way, the service was fine.  Nothing to complain about.  Even though we complained about 2 of the meals we had they handled it with professionalism.  I had the turkey burger, which sounds great on the menu.  It was bland, flavorless and had way too much bread.  In the industry they call this \"bun coverage\" and this freaking burger didn't come close to covering the footprint of the bun.  The people they have cooking in the back obviously don't know how to check a burger for doneness since there was a big hunk taken out of the burger where they hacked it with their spatula.  My buddy ordered the steak wrap (whatever it's called on the menu) and it was served \"burrito style\" (note there's a difference between a burrito and a wrap) with so much rice in it and virtually no steak.  For like $11.00 he complained and they fixed it.  My sweet, innocent baby girl who only eats pizza and French fries shared my way too salty French fries that were served with my burger and had to order a flatbread off the menu for $9.00 which had a big hair in it when it was served.  Since we complained about the \"wrap\" the Manager came over and said \"Yeah, the waitress said there was a problem and asked me to come over?\"  We told him the deal on the pizza and he asked \"did you send it back?\" and when we responded he just walked away.  That's it, no apology or anything.  So, we ordered a cheese flatbread with nothing else for a kid were charged full price and got an extra hair in our serving?  The people that own this place are \"professionals\" right?  What the heck?  Train your Managers how to handle issues when they come up.  Plus the outside dining area was unkempt and very dirty.  French fries and food debris were all over the place.   Flavorless, overpriced, but PACKED.  I think people want this type of restaurant, but Big View IMO doesn't execute well at all."}
{"text":"Came in last night just for dessert.  I gave 2 stars because the place was clean and the staff was very friendly and the service was good.  The desserts were not so good.  I had a slice of strawberry shortcake and I could hardly get past the second bite.  The cream was hard (not refrigerator hard) and it did not taste fresh. The cake portion was also hard.  It tasted stale. My husband had the cheesecake which also tasted stale.  We were up all night because of these desserts."}
{"text":"After initially being excited when I heard this place was going to open a few years ago, I decided against even trying it after all of the very mixed reviews. Eventually, I forgot about the diner and went about my business. It's not exactly right next door for me, so that was easy to do. This past weekend a friend wanted to do lunch and I wanted some pecan pie. I suggested The Landmark Diner, which I enjoy a few times a month. She said it was too far. The Big View Diner popped into my head and we were off.  I liked the decor, with all the stations labeled and everything looking like a modern day version of fifties eatery. The lighting is interesting as well as the wall color and the booth seating. I was that jerk snapping photos with his cell phone the other day ... sorry.  She had been there a few times prior and had not the best food experiences, but she didn't bother to tell me. But, she's finicky, I said to myself. I wasn't sure what I wanted, so the server suggested several things over the large menu from burgers to salads to the $20 ribs. (Sorry, but I go to Texas Roadhouse for my $20 steak and ribs, and that is a different review that I have already written)  I eventually settled on the steak and eggs with home fries for thirteen dollars. Not bad. She got a gyro with specific instructions on how she wanted it. Like I said, finicky. The food arrived in a decent amount of time and was tasty. Nothing fancy, but it was hot and there was plenty of it. The steak was much larger than expected and I could have -- nay, should have -- taken half of it home. And I am not a huge fan of lots of spices in my food usually, so I was pretty happy with what I got.   My lunch mate got hers with seasoning on her fries, against what she had requested. They were very nice about it and she was able to exchange for some home fries and didn't charge her for the mistake. Otherwise, she was happy with her meal. We also got two deserts, the pecan pie and silk chocolate pie. Both were tasty. The server suggested a scoop of ice cream with my warm pecan pie, I think now I should have taken him up on it but I was so full at the time I didn't think it would fit in my belly.  I left there with a satisfied and full stomach with the open possibility of returning."}
{"text":"This is one of my go to spots! On those nights you just don't feel like it.... this is a reliable staple. Whether you are hungry for breakfast all day or you need comfort food.... this place has got it all!  I am one of those people that if I'm going to eat out or unhealthy it has to seriously be worth it! That being said.... the pancakes are not just pancakes..... they are fluffy, crispy deliciousness! The French toast has this amazing flavor with the perfect amount of batter. Again, soft in the middle but crispy on the outside. My last breakfast fave is the salmon bagel. Always fresh & light! Can you tell I like breakfast?!  My absolute favorite meal is beef stroganoff though. I get it with a French onion soup to start. It's so much food that me & my hubby started splitting it!   Then of course there is dessert! What can I say about their dessert?! There really are no words! We will come out after having dinner at home just have dessert & coffee.  The service is always spot on. Oh & if you love bloody marys..... this is the best I've found in Ballantyne! Just sayn!  Love, love, love this place!"}
{"text":"Good food, especially for a diner. I enjoyed the ilois spinach dish which comes with a very good Greek salad. My guest had the chicken & waffles which was served with warm syrup. The best thing about this place is how clean it was when I entered!"}
{"text":"It took 45 minutes to get an appetizer for the table, over an hour for two side salads to arrive, and still after 75 minutes no dinner.  The positive would be that the salads and egg rolls were tasty. We enjoyed them while we watched 4 tables seated after us enjoy their food.  Seems like poor service is a common theme with this place.  Major disappointment, really was looking for a local spot to enjoy."}
{"text":"My niece and I visited on a Sunday morning. The place was packed so we thought it had to be good. We were seated in a party room with two other large parties. We were the only two besides the parties. There were no condiments on the table. The scrambled eggs were under cooked and runny. The sliced tomatoes were old and not good. The chicken sausage was not tasty at all. On the flip side, the coffee, rye toast and real butter were great. It was expensive for breakfast. $25 for the two of us. I will not return."}
{"text":"Service started our good, place is clean and well laid out.  The food was excellent and made better by the before 11 specials.  2nd time here and would visit every day for breakfast.    Love the the grits, next time biscuit instead of toast.  Sausage was great.  Very good coffee."}
{"text":"I am seriously pleased to see all of the 1 star reviews and the same statements I would have made (really excited when it was being built, looked forward to it opening, related to Nolen and Ilios Noche so it HAD to be good, yadda yadda).  We went ONCE.  That's all it deserved.  Let me share our disappointment:  1. Frozen vegetables... why? 2. Instant mashed potatoes?  I mean WTF?  You can't actually cut up and boil potatoes in a diner? 3. Chicken piccata with no capers. Ummm, what do you mean the kitchen ran out? THERE'S A ****ING HARRIS TEETER IN THE PARKING LOT, SEND A BUS BOY TO BUY A JAR. 4. Not exactly cheap, either.  The desserts looked good.  We took home a piece of something... it was OK.  If you have the late night munchies for sweets, stop in and get a slice of cake... otherwise, dine at Ilios Noche or Nolen.  UPDATE: My wife had to do a business dinner there recently and said \"it didn't suck\".  Possibly Big View has figured it out and has decided to stop skimping on ingredients.  It's still WAY overpriced for what you get, though.  Review remains at 1 star until I taste improvements myself."}
{"text":"Well, I haven't been here in quite awhile so decided try it again tonight.  I had the Stroganoff, very disappointing. Reminded me of hamburger helper. Very bland.  My girlfriend had the Seafood Fra Diabolo, I thought it was extremely spicy and took away from the seafood taste.  The Red Velvet cake was regular chocolate cake with regular creme topping, not the usual cream cheese mixture.  Portions were very good. Service was very good.  Will not go back"}
{"text":"Had dinner there the other night for the first time. Their sesame salmon sandwich was to die for. Easily the best salmon sandwich I've ever had. Atmosphere is great as well. Staff is very friendly. No real complaints at all."}
{"text":"I've been here twice. The first time was really good.  The chicken and dumplings were great and normally thats something I'd never order out.   We also had the open face roast beef which was also good.    The second time we went my mom had the lemon roasted chicken which she said was dry and tasteless.  I had the fish and chips. The fish was good but would have appreciated it if they had warned that there were bones.  I got one stuck in my gum.  I also had the eclair. I couldnt wait to sink my teeth down into it.  Well, it was the most tasteless eclair I've ever had.  I threw it away.    I'm guessing my two visits were it."}
{"text":"Huge menu with so many choices that it takes 30 minutes to figure out what you want.  First time here, I ordered a salad for lunch. The salad with chicken. Salad was good but chicken was too salty.  Second time here, I ordered fish for dinner. Fish was really good.  I think you would come here for variety."}
{"text":"This place is hard to miss if you ever go down Johnston Rd... can't remember if it turns into Lancaster before you hit the restaurant or not - but it's at the corner of Audrey Kell.  First impressions from the street make it look to be an upscale diner, and when I walked in I had the aroma of breakfast hit me in the face.  I love breakfast - but it was dinner... actually it was time for a drink (after a rough day).  The wait staff greeted us nicely and we asked to sit at the bar.  The bartender was over the top (in a good way).  Very nice young woman with tons of energy named Marci.    She took our drink orders - and we also decided to eat so I tried the open faced tuna melt.  It was a lot of tuna, but good... fries were good.  My friend had a ruben and that thing never stood a chance.  I'm guess it was good as well.  I'd say I'm a fan for now... but I rarely get to go to this side of town so I will try to make it a point to give this place a couple more visits and update my review."}
{"text":"I've been here twice for lunch. Both experiences were quite opposite. Both experiences I ordered breakfast. The first time I ordered their jallah friend toast and the 2nd I ordered the breakfast platter (can't remember what name they called it).  Service wise, the first time it was just average. The server the second time was really good and friendly but messed up part of my order. The food is slow making it from kitchen to table.  Foodwise, the jallah friend toast is excellent. Their bacon is good. For the platter, the pancakes had an odd baking soda taste to them. The home fries could have been fried a little more. They were a bit mushy. The eggs were good but it's hard to screw up a fried egg. I did receive grits with mine even though i ordered home fries. They were flavorless and unappealing.   So judging by my 2 visits here, I'd say this place is hit or miss. Could be great one time and average the next. But isn't that what we love about diners?"}
{"text":"Good price, good family atmosphere. But most loved for their desserts! All fresh and made in house. Get the TRIPLE D if it's your birthday, most elaborate ice cream plate I've ever seen. Plus the owners are Greek so I advice trying their Greek plates, you'll be surprisingly impressed"}
{"text":"I'm giving this place 5 stars because they did a AMAZING job on my 30th b-day cake. My sister ordered the lemon raspberry cake in the shape of a 3 & 0! OMG it was the most amazing looking and tasting cake. All my friends were wowed by it and it was so MASSIVE I took the 0 to work and by the end of the day it was gone it rave reviews. I'm can't comment on the food but the desserts (and drinks) are to die for.  This place did my cake justice that no other bake/cake shop could do and I recommend your next dessert extravagance be the Big View Diner!!!!!!"}
{"text":"If you're in the Ballantyne area and are looking for a family-friendly joint with great breakfast or homemade desserts, this is your place. Their omelets are delicious. I'm not sure what they put into their grits, but it works! It's also one of the best dessert places in the area. The peanut butter brownie cheesecake is awesome.  I think someone who works there is an iCarly fan because they put spaghetti tacos on the kid's menu. That satisfies the little ones. :D"}
{"text":"Tried the roasted turkey Cobb salad, the ranchero bowl, and a crispy Carolina flounder sandwich. The turkey in the salad was a little dry but the rest of it was good. Nice crispy bacon for texture. The crispy Carolina flounder sandwich was huge and cooked really well. Juicy and very crispy. The ranchero bowl was presented well and had nice crispy chips, however would have been easier to eat if they weren't so long. The rice in the bowl had a subtle lime taste which wasn't too strong. Fresh avocado with seasoned chicken. Overall, the price was good for the amount of food. Also the food was tasty.  The setting was a little deceiving, originally I thought it would be a casual diner. The inside and presentation is a bit more classy than a classic diner. A bit thrown off and a bit under dressed. The service could improve. Not as attentive and rarely checked in with us to make sure we were doing fine or if we needed refills. The place wasn't packed either"}
{"text":"I really wanted to like this place. It's close to home. So close. And I L-O-V-E Ilios Noches (same owners). If I could, I would have given it 2.5 stars. I have had a couple of business lunches there and they were good. I had the spinach pie/salad combo. Their spinach pie is excellent - maybe the best I have ever had. Though it always tastes a little better at Ilios Noches.   Last night, we gave it a shot for dinner. Disappointed. The descriptions of what I ordered (bbq burger on brioche) sounded great. The execution: not so great. The brioche bun was stale, the burger tasteless, the fries cold. Service was slooow. We requested more ketchup 4 times before finally receiving. Then they tried to rush us out, so they could seat another party.   Like I said, disappointing."}
{"text":"I really enjoyed the food here.  We actually went twice, two days in a row.  HOWEVER we noticed the servers did not know the menu at all, I mean after 3 months employed you should start to be familiar with the menu.    It's a little pricey, BUT if you come Monday thru Friday at lunch, they actually have a $7.99 menu, which again, the servers couldn't figure out whether that included a drink or not, an extra vegetable with the entree or not.  It changed depending on who you asked and what day.  \"THAT\"S GOOD MON. THRU FRIDAY.\"  Then on Monday, that's not the menu for today etc... constant runaround.    They have like three different menus and specials depending on when you go.  We ordered and then they came back and said that wasn't the menu for Sunday lunch and did we want to change our order?  Um, no.  The same items were on the Sunday menu, so I don't know why we would need to change the items.  So we paid several dollars more for the \"Sunday Menu\" portions (i.e. the SAME thing, right??)  The servers got to be a running joke with our group.  Every server answered questions, \"I THINK...\"   \"I\"m NOT SURE...\"  \"I BELIEVE...\"  IT SEEMS LIKE IT WOULD go with that...\"   It's like doesn't anyone actually KNOW what comes with what.  The three menus are confusing, when does one get which one on what day? etc...  especially since the menu items are the SAME.  Definitely a lack of knowledge on the servers' parts.   The management needs to step up.     The food was wonderful!  Great entrees and desserts.  I would still return just for the food.  So I don't get the bad reviews on the food."}
{"text":"My husband and I really like this place for lunch. Breakfast is served all day and there is a huge selection (bonus for him) and everything is made in-house with fresh breads and farmers market veggies etc. (bonus for me).   The service is always very friendly and even what it's slammed we are usually able to get in and out fairly quickly.   Three quick tips...  Save dieting for another day because they have the best ranch ever.   Do not bother with their mixed-greens salad side option ...it's just plain lettuce with dressing (not even a mixture of lettuces') .   Also bring a sweater because they BLAST the AC."}
{"text":"Food here is tasty and well done. Cleanliness is another story. Went for breakfast with my 12 year old daughter and we sat at the bar. Food on the placemats. Food all over the footrest-bar. It was old food - as if they'd cleaned, but didn't do it well enough...multiple times.   I've always liked the food. Service is fine. Let's hope the mgt improves the cleanliness."}
{"text":"Excellent dinner!  Best spinach pie ever!!   The Service was attentive and warm.  A truly delightful lunch experience!"}
{"text":"The burger I got was not good, it had absolutely no taste and the patty looked like it came right out of shrink wrap and was just heated under a light. The fries were mushy cold and undercooked. Had to send it back and go somewhere else. It's a shame because the place looks pretty good. But I won't be back."}
{"text":"Overwhelming menu, but good food. Nothing to rave about, but always pretty satisfied. Their dessert selection is extensive too!"}
{"text":"Very humid inside. Chicken noodle soup was not hot. Chicken pot pie veggies weren't cooked enough. It's a large waffle house at best."}
{"text":"The Big View Diner is a ways out if you're coming from Charlotte, but for those on the south side, it could be relatively convenient. What I'm really not sure about is the view - there really isn't much view there, except of the inside. The place is huge. I mean gigantic. Yet it's still packed to the gills so much that you may have to wait at certain times. Luckily you have the option to take a look at their amazing desserts just waiting for you while you hang out waiting for a table. Luckily, the wait for the table isn't generally too long because they have so much space. That's the good news.  The bad news is that service, while friendly, really isn't that good. I don't know if they are understaffed (doesn't look like it) or just have issues, but whatever the case, it takes a really long time between being seated, being greeted, being served, getting your glasses filled/refilled, getting a check, getting the receipt after paying, etc. I mean it takes a long time.  As to the food? It's reasonable. There are plenty of options, both here in this same parking lot and all around the Charlotte metro, so it's probably not somewhere we will venture to often, but it's worth checking out if this is your thing. And it's not really a diner, so keep that in mind. Also, I will give them props for mentioning, even in the chaos of a huge room, and lack of service at the table, those at the host stand actually told us to have a nice day as we left. By name. That was a nice touch."}
{"text":"This restaurant is huge! I've always wanted to try this place because it's so noticeable from the road. We came here for brunch one day. Hostesses at the front were not the friendliest. I have a 4 letter last name that's pretty common. She asked me what my last name was and I told her. She asked me to spell it for her and I did. She asked me again to spell it for her and I did again. My husband walked up next to me and asked again what the last name was. My husband told her and spelled it out for her again. He then chuckled and told me he saw it spelled wrong.   We got sat at a booth. Server came and got our drink order. One of my friends got a large orange juice. When the server came to the table, she had two glasses of orange juice. He asked her if the two glasses was one order of orange juice and she looked confused and said \"no?\". He told her he only wanted one glass of oj. She still looked confused and took it back. We all gave her our orders. I asked for a side of salsa and and asked me if I wanted turkey or regular. I looked at her confused? I told her I just wanted a side of salsa. She understood what I said and said ok.   The food was good. Big portions. I did get the western omelette. It was good BUT there was hardly any ham in it!   The service from walking in to leaving is just ok! Not sure if I will be back again. Maybe one day though."}
{"text":"This diner is the best dinner, lunch, and breakfast spot for great affordable food. Every dish is well made and fresh. These are the same owners of ilios noche where the food is amazing as well. The best way to describe this place is a diner with restaurant style food. The jambalaya is the best! Highly recommend if you have a big party to keep costs down and still get a great meal."}
{"text":"If you don't want the details, it was great.  If you do want the details... The wait at dinner time was not as bad as we would have expected for a seat. There were 4 families in front of us and we sat in the 15 min they quoted. Our server was very fun and helpful. We split the caprese chicken sandwich as we wanted to leave room for the \"triple d\" desert. The sandwich had to be one of the best sandwiches I have ever had. The quality of chicken was great, but I guess I had never had that combination of chicken, tomatoes, mozzarella, basil and balsamic (I know one of you are yelling at me for never having this). The wait between getting refills, ordering and receiving the check might not have been as quick as some other restaurants we have been, but to be expected out of a traditional diner, I didn't mind. The atmosphere is definitely upscale for a diner, but similar traditional menu items plus some new favorites. The only thing I found strange is the sports bar in the front room....that's not very diner-like and they had sports memorabilia on the walls from what seems like any team that has nothing to do with Charlotte."}
{"text":"Decent Diner/Lounge place - interesting decor and exceptional service.  I came here for a work team lunch meeting and the food was surprisingly good.  Lunch portions were big, even the chocolate chip cookie I ordered to go was as big as my face. Will prob return with the fam to check it out for dinner."}
{"text":"Hubs and I checked this place out for a casual lunch during the work week. It's pretty impressive from the outside - a massivo diner that looks like a '60s diner on steroids.   Inside, it's nicely laid out with a large cocktail bar up front and a long sit 'n eat bar on the side. We had to wait a few minutes for a table on a Tuesday afternoon (which was a bit odd) but were pleasantly greeted and seated in no time. As for the menu - it's pretty extensive. There are quite a few options that will likely satisfy a variety of palettes. I went with the grilled chicken and veggie sandwich and hubs chose the Reuben.   Overall, the food was good but nothing spectacular. My sammie was pretty tasty - the veggies were grilled, albeit a bit soggy, and the chicken was tender. I tried a few of hubs' fries and they were pretty good - thicker cut fries with the right amount of salt. I just wish they were crispier.   It's a decent spot to stop for a lunch...I'll give it another go with a different menu item. I also really want to try their shakes and desserts!"}
{"text":"Been here a multiple times in the past 6 months and the food is good but the service is horrible, I always sit at the bar since I'm alone and have never gotten good service.  I always have to ask for a refill after my glass is empty for 5 minutes.  I have heard the bartenders complain multiple times about their tips and I honestly think that is so rude in front of a customer.  I have never walked in and been greeted either by the bartender they will continue their convo and then finally acknowledge me.  Good to get to go food but def not the worth the service"}
{"text":"I'm a big fan of big view and I have been coming here for a while now, but lately the quality of service has declined tremendously. Specifically, the bar service.  We all know bartenders have a stressful job and it can get over whelming,  but it should never be shown to your customers. A bad attitude is a sure deterrent. Also, not only did we have to wait 30 mins which is really ok for a table but we waited another 30 to place the order once we were sat. Maybe the view is short on staff today. But Ya disappointing. We may not come back for a while.  GET IT TOGETHER!!"}
{"text":"Big View Diner is a great place for brunch. I have only been to the restaurant for brunch, but after going a couple of times, it's towards the top of my list. I tend to get a western egg white omelette but it has so much flavor that I forget it's all egg whites. The English muffins are great and the side of fruit is fresh and delicious. I have also had the challah french toast which is amazing! It's so light and fluffy, and with a side of bacon, it's perfect.  I love the atmosphere of the restaurant. It's partially reminiscent of diners up north but with a more modern feel. It is also so difficult to resist all the wonderful baked goods on the way out - they all look so good! I always keep my eye out for rainbow cookies - they're my favorite!"}
{"text":"Had absolutely wonderful service tonight! Walked in with a party of 9 and our server, Amanda, was beyond accommodating and so delightful!  We had two toddlers with us and our server made sure their food came out with our starters so they would stay happy!  Amanda really went above and beyond explaining menu items and making sure we were taken care of!   Ate the balsamic salmon and it was INCREDIBLE and cooked perfectly!   The host were another story as when we walked in one rolled her eyes when we said we had no reservation but our service more than made up for this bad taste at first."}
{"text":"Not great service and it's my second time here. Food is OK but if you sit in the middle of the dinning be prepared to be blasted with Italian music. I couldn't even hear the server ask certain questions.   Not a place I would recommend."}
{"text":"Excellent dessert case.  One of the few places I have found with chicken and waffles that has boneless chicken."}
{"text":"Ehhh....it's alright....  The restaurant is a lot larger than I anticipated so we were seated quickly. The server was prompt in taking our order. I ordered the chicken and waffles. The server asked if I wanted the salad that came with it. I answered yes and she raced off, while I sat wondering what dressing she would bring since she didn't ask. Well....it comes tossed in a balsamic dressing. The salad was soggy as if they just make up a big bowl of it and let it sit all day. So two bites of that was enough. The chicken and waffles were okay, I wouldn't go there specifically for that but it wasn't bad. The waffle was actually pretty good it tasted fresh. The chicken was two thin chicken breasts with a very coarse texture. Not really sure how else to describe it. Getting out was a challenge. I had to ask for my check even after my plate had been taken. Then I had to figure out if I paid the server or up front. I decided to pay up front because it seemed like the server was never coming back. We did get a slice of key lime raspberry cake....I didn't chose it. Anyways, it was not good. The icing, the cake, no part of it was good. It was pretty though....."}
{"text":"I highly recommend going here for lunch. I get the salmon and not only is it fantastic, but it's only $8 or so. Perfect spot for a meeting or nice meal."}
{"text":"Great place! I went for dinner and ordered fettuccine alfredo with broccoli. The Caesar salad that accompanied my dish was huge and delicious! I was surprised by how big it was. Also, in my Oprah voice, I LOVE BREAD and the bread basket was amaze-balls! It was warm and croissant-like. The other dishes ordered looked good too. I tasted a bit of my husband's chicken and waffles dish and it was really good. I also thought their chicken diavolo dish looked amazing. I'll probably order it next time. Unfortunately, we were all so full we didn't order dessert. But the desserts all looked to die for.  The service was great too. Will definitely return"}
{"text":"We've become regulars - good spot for breakfast, lunch or dinner - waitstaff is friendly and good is always fresh and hooray, CONSISTENT - I tend to get the same omelette for breakfast and it's always as I want it... They make awesome bread, pastries and desserts and the Greek influence is reflective in their appetizers/meal offerings. Fresh greek (yes, real greek) yogurt and fresh feta.... YUM!!! Love Big View and hope to be a regular for many more years."}
{"text":"I had Sunday Brunch at The Big View Diner. I arrived at 1100 and the wait to be seated was about 30 minutes.  Once seated the wait to be served was almost as long. The food was very good and within the price range for a \"diner\" breakfast. No complaints and I ll go back the next time I'm in the area."}
{"text":"You just cannot beat Big View Diner for the food,service,atmosphere and the desserts...oh yes the fantastic desserts."}
{"text":"We never leave disappointed! I ordered the smoked salmon, Swiss, tomato, and onion grilled cheese with home fries and my husband ordered the chicken and waffles with a side of scrambled eggs with cheese. My sandwich was tasty but different from my beloved smoked salmon bagel. I'm not a huge fan of sandwiches on toasted bread because I don't like how it scratches my gums (I know it's weird, don't judge me) but the sandwich tasted good! I didn't know the home fries would have peppers in them. I'm not a fan of peppers but they were still quite tasty. Now let me tell you about my husband's dish. Yummy in my tummy!! The chicken tenders tasted like it was fried similarly to Chinese fried chicken. SOOO TASTY!! The next time we go, I will be ordering this!!! The service is good also!"}
{"text":"The food was great. We started off with appetizer quesadilla. Nice and I  had the pasta with creamy tomatoe vodka sauce plus shrimps. My son had a burger with fries. Was a great meal but looking forward to breakfast."}
{"text":"The food looks great, but it didn't taste fresh, my daughter's first time tasting chicken and waffles and the chicken had to be cooked in old oil."}
{"text":"Okay-so I am a Queens (NY) boy and grew up going to diners as a big part of my life. I have found it impossible to find a \"real\" diner outside of the New York area. Well-I found it!   Came here while visiting family down south. We were a group of 9 and everyone enjoyed. The atmosphere is fun and energetic. It is very open and appetizing. Billy was our waiter and did a wonderful job with nine people to serve including 2 children. He was patient and kind.   They have a \"normal\" diner menu. Basically it has anything you could ever want on it. The food was good - very good. I can vouch for the broiled Mahi Mahi, skirt streak salad, calamari and chicken pretzel (don't ask). Everyone at the table enjoyed their meals including burgers, fish, etc.   It is not overpriced and our meals were presented nicely.   They seem to specialize in desserts and our table had everything from chocolate silk pie (mini pie) to a chocolate & cherry milkshake. It was all good.  They are located in the south so yes-they do have sweet tea and grits if you want but don't waste the trip here-order real diner food! Although, my wife loves sweet tea and they have unlimited refills so she was happy (happy wife, happy home if you know what I mean)."}
{"text":"unfortunately last night's visit was terrible. my \"stuffed flounder\" contained a scant, 3 finger width of actual flounder, propped up to appear like more by mostly cups of rice.  then, a group of 12 came in just after we started eating....and we never saw our waiter ever again. We waited 20 minutes during which we asked 2 other waiters to rescue us.  When our check was presented, it incorrectly included desert which we never received.  To add insult to injury, it took another 15 minutes to remove the desert cost.... which they were unable to do correctly."}
{"text":"Best selection, best quality, best prices...Frank and Angelo make you feel at home. You can go in your sweats if you want! Best in Ballantyne!"}
{"text":"Excellent food and service. The banana pudding is great!  My main entree was the steak burger which was excellent as well.  We had to wait about 25 minutes for our seat, but it was worth it!"}
{"text":"Just had a great dinner at Big View.  This was our second visit, first time was just for a burger which was nothing special.  Tonight was really good.  They told us there would be a 20 minute wait, but it was only 10.  Love the fact that they started off under promising and over delivering.  We were promptly met by our waiter, Russ, although the place was packed and he had several tables.    The menu is intense as well as enticing!  Russ allowed us to take our time checking in without being hurried or impatient.  I ordered the chicken fettuccine had a house salad with the house vinaigrette.  My husband had the chicken Marsala.  We received fresh challah bread and butter and soon after our salads.  Once we finished our salad (vinaigrette was a bit tart) our meal came.  My fettuccine was really creamy and fresh with a great flavor to the chicken breast that was served sliced on top.  The chicken Marsala came over a bed of mashed potatoes with mushrooms, roasted tomatoes and asparagus.  It was a very nice presentation.  We will be coming back!  We also brought some eclairs home for later, cant wait.  The dessert menu is extensive and I cant wait to try it all!!  Downside:  There was a party with a few children who were allowed to run the restaurant, almost running into servers several times.  No one said anything and it was quite distracting.  Kind of gave the evening a McDonald's playground feel."}
{"text":"As soon as I walked in the servers were super friendly! Apparently my laugh is quite infectious and they were all happy to see me. Sweet! Now...let's get to the food!   I tried the chicken and waffles, and while not the best I've ever had, it was yummy! The waffle was delicioso! It was light and crispy, just how I like it! And guess what! They had bacon maple syrup! Mmmmmm!  The chicken was ok...it was pretty much a chicken tender set on top of the waffle. While well seasoned, I've had better. They were massive though, and made for a perfect midnight snack later after a night out.  All in all, I enjoyed my experience here and will return to try some of the other yummy sounding offerings on their menu!"}
{"text":"We had a quick group work lunch at Big View Diner, and it was the first for all five of us. The restaurant, belying its name, is a big, spacious, airy diner, with a nice buildout and great relaxed feel (nothing loud or harried about it, although it was fairly empty at lunchtime).   The restaurant is very clean, it has a nice bar area and big encased dessert display. Service was very friendly. We split two apps of falafel, which came out like twohuge crab cakes, surrounded by pepper sauce, taziki, salad and pillowy wedges of warm pita bread (very tasty). We all enjoyed the falafel.  The menu is quite diverse and a little perplexing, ranging from Greek and Middle Eastern, salads, sandwiches, pastas, to traditional American breakfasts and southern favorites like chicken 'n waffles and pork chops with stuffing. The \"pick two\" selections looked hearty and generous (whole toasted sandwiches or salads served with big bowls of soup). I opted for a chicken souvlaki wrap - it was big, tasty and fresh; the chicken was tender and juicy if rather underseasoned.  Very good place to stop for lunch, at reasonable prices."}
{"text":"Breakfast this morning. Wait wasn't terrible but the service was. I hate to write bad reviews but this was just so unexpected based on what we had read. We got sat in the bar area at a super small table. Waiter was extremely slow and not engaging at all. Food was meh. Wouldn't suggest it."}
{"text":"We eat breakfast and sometimes lunch here often. The quality of the food is ready good and the service is quick. Well usually get Omelets or sometimes I get the spinach Greek thing (forgot what it's called)."}
{"text":"Since my job moved into this area recently this place is really close, and I had been wanting to try it for Lunch.  I had always heard great things.  Big View Diner is a good size place and the Decor is also really nice for what you would normally see in a Diner.  One you first walk in you smell the freshly baked goods they have at the counter which includes Cookies, Cakes and other many goodies.  I almost wanted to just get dessert and then leave....lol.  The menu offered a good variety.  I ended up getting the Chicken Salad sandwich on Whole Wheat Toast with a Pasta Salad as the side.  I have to say it was a little piece of Heaven.  Very yummy.  The waitress we had was also very good and attentive.  I definitely recommend this place, and will be going back soon for Lunch."}
{"text":"My favorite place for breakfast.  They have done great with hiring wait staff, food quality is consistent, and the atmosphere is wonderful.  Great weekday deals on breakfast, and other meal entrees are tasty."}
{"text":"Food was terrible.  Hamburger was very greasy low quality. French onion soup was as piece of bread soaked in salty beef bullion very over cooked fake cheese.  I would recommend this restaurant"}
{"text":"The ambiance is fun and the servers are attentive. I have it 3 stars only because there omlette, albeit good, wasn't anything I couldn't get anywhere else and the toast was barely warm... The butter didn't (couldn't) melt. I think this might be due to the fact that it appears the toast is made in batches and placed on one's plate as that order comes up. So I guess if your order occurs when the batch first comes out, you'll be a lucky one who gets to have toast with nice melty butter. Clearly I like melted butter on my toast.  My husband, however, had the chicken and waffles and loved every bite of it."}
{"text":"pretty good food . fresh breads with dinner . fresh veggies. great soup."}
{"text":"Been here many times.  I really do actually enjoy the place but can't quite give it 5 stars.  I would say that it more about location (close to my home) than food only because I find it to be a little expensive.  $10-$12 for an omelete is a little steep for this guy.    Other than that, I ventured away from the omeletes and got one of the eggs benedict choices.  Eggs Benedict Crabcake style!  That was a perfect mixture of crunchy crabcake, muffin and hollandaise sauce.  Great call there!  Overall, you will enjoy.  Just avoid the crazy busy times like Sunday brunch after church goers start rolling through.  Yikes!  -Ian M."}
{"text":"Never had a bad meal here!  Huge portions & terrific value!  My favorite things are the Spanish Omelette (breakfast served all day!) & the Chicken Marsala.  Service is great."}
{"text":"The food has always been spot on. The Spinach Pie is actually the best I've ever had! Outstanding food at a fair price--check it out."}
{"text":"We were really looking forward to dinner at Big View tonight because we had been several times and the food is really good. Unfortunately the service ruined the entire experience.  Our friend called in for call ahead seating and when we arrived we were told 20-25 minutes.  Ended up waiting 1 hour for our table. Absolute waste of time! The service continued to be slow because we were seated in the bar (with 4 kids under 12) and the bartender was our server. Our dinner took over 3 hours..totally unacceptable with 4 kids. Food is good but not worth the time."}
{"text":"Awesome, quick lunch experience! Had the carrot cake pancakes with cream cheese and they were delicious!! Can't wait to come back and try other dishes on the menu!"}
{"text":"Back again - 3rd time this week.  Simply can't get enough -- so much to choose from but my go to right now is the soup and grilled   **updated March 24, 2018 Well - all good things come to and today was it. We raved about Big View and took our out of town guests. Seems anytime you brag about a place, the next trip is terrible. Got here at 2:30 and it wasn't busy. No wait, except for service. Our waiter had to be new. Ordered food, wife's salad comes out wrong - no problem as he took that back. 15 minutes later, a new salad, that went with her soup, appeared. He sat it down and left not staying long enough to find out our friend's onion rings were burnt, yet somehow cold. We flagged another server and said there is an issue with her rings. He didn't ask, just to the plate. The problem was she was holding her sandwich - now, no where to put her sandwich down. And oh yeah, no silverware for the table yet either. 20 minutes pass by and our normal server came by - which we say we're all out of drinks and her rings never came back. He leaves and returns quickly with the rings. Guess they were sitting in the window for awhile.  After 1.5 hours of ordering and eating lunch, the waiter returns to check on us. We decide to order a piece of cannoli cake - wife is crazy about them.  Well, guess he didn't hear as he brought us the check about 10 minutes later - all on 1 check versus asking about splitting between the 2 couples or even asking where the dessert went - since we never got.   Well, this was the first bad experience here - and it was brutal. I'm sure we will go back at some point - but will be taking a break."}
{"text":"Big View offers so much variety it's a great place when you have diverse tastes amongst your group or family to appease!  Something for everyone & all delish! Excellent value, we often get two meals out of our entrees. Dinner & lunch for tomorrow?  Hey, I'm down with that!  The beef brisket stroganoff is wow...SO good & the shrimp & grits- fabulous & unique from other versions I've tasted.   Also, we met with Tina in the Big View's Bakery regarding our wedding cake. She was super helpful & kind and made the process pleasant and simple!"}
{"text":"If Jay Gatsby and a hipster teamed up to renovate IHOP, it would look like this.  The food is traditional but there is some effort made to make it elegant and unique.  The bathroom door squeaks, the Charlotte Observer box is broken, and the booths are a little small.  But by comparison to the closet sized IHOP or the older breakfast haunts, this is still a brilliant place."}
{"text":"Excellent service and the Asian pork was amazing!!! It was on special but they are putting it in the menu!! Reminds me of NYC!"}
{"text":"I've been here a few times and I have never been let down. Service has always been great and the food has always been great as well. For breakfast The Belgian waffles, the chicken and waffles, and most of their omlettes are really good. For lunch the veal meatloaf is absolutely amazing as well as the jambalaya and a few other things. For sides the whipped potatoes are a must they are awesome, their sweet potatoe fries are also really good. If you're in the area and don't know what to eat try this place out. They also make pastries and cakes however I haven't tried any of them yet, they look really good though haha."}
{"text":"3.5  I was here for breakfast/brunch a few days ago.  Its pretty hard to botch eggs and bacon so I can't speak to their culinary skills but everything was pretty good.  I kept waiting for that defining moment...for something to happen that would boost this place from good to amazing but it never quite happened.  I was looking for a basket of biscuits to be served with the meal or for a special jam to spread over my toast but I was left with the basics and a hefty ballantyne pricetag to boot!    I was in the middle of my Christmas cookie eating marathon so I didn't try anything from the bakery but it all looked incredible!  I agree there is a shortage of diners here in charlotte and this place certainly gets an \"A\" for effort but lacks the feel of a true, authentic diner.  For one thing, the menu is not very extensive (real diners have 3 huge pages of breakfast items), they r pretty overpriced (regular diners will offer a huge breakfast for less than $10 but not so much here), there was not any fun memorabilia on the walls or anything \"50's\" about it...which you have to pay homage to..that's when diners existed!  Sooo..ok, I get it...this is a more upscale diner...it has many positive points and certainly serves up a good standard breakfast.  Nothing crazy, nothing special, just predictable.  I wouldn't run out of my way to go back but I am not opposed to returning if in the area.  I am curious about their bakery.  All of the baked goods looked amazing but I have consistently heard that it is not good at all.  I'm going to need to investigate that a bit further.    Consensus?  Take it or leave it"}
{"text":"This updated review and rating hurts me to do...  My Mom lives in the area and this is her breakfast of choice on Sunday mornings.  She is a creature of habit, unfortunately. So, over the last few months although the food is good, I have seen a lack of flavor and presentation to our meals.  And, more importantly, the service has taken a complete turn, for the worst.   Sunday mornings are typically very crowded, but I find us sitting for long periods of time, waiting for the waitress to take our order, waiting for our food, and waiting for our check...Very disappointing.   And, one side note for anyone that has enjoyed their Bloody Mary, they have changed the recipe.  They previously used a pre-made mix, Zing Zang, but have decided to take the plunge and make their own.  And, it was horrible!!! All you could taste was horshradish, I even sent my back and sent the second one back and finally just went with a mimosa. Unfortunately my Mom smelled like horshradish the entire day.  Please go back to Zing Zang!!    I know I will be back so I will keep you posted on any improvements, or not, that I see."}
{"text":"Here again on this very hot day. The coolness of the Diner I believe brings more people in. There is a very big crowd here on Sundays."}
{"text":"This is my third time here. Straight Ridiculous. I discovered it by accident and they have over delivered each time. Excellent food quality, great service, a mix between fine dining and diner menu. Try it and thank me later."}
{"text":"We went on our first date trying to start a romantic and nice conversation while we were eating ,but the waitress did not stop interrupting by asking every 5 minutes  how was what we were eating!! really guys? so anoying!!. I understand that they try to be attentive to the client but there are limits to the respect. Good food, no good for first dates."}
{"text":"For months I've waited for this place to open- the sign on the outside advertised Big View Diner and Sports Lounge.  What a colossal disappointment!  First the highlights- the food really is very good, and I certainly do not want to take away from the diverse menu or good tasting food.  However it really is more of a diner than lounge, let alone sports lounge.  I was there at 8:00PM (they will be open for breakfast) on a Thursday night- they did have all of the TV's on sports channels, however there are only 4 TV's in the bar.  The other detractor from what has the potential to be a cool place was the 8 kids under the age of 10 (I was actually looking for the ball pit or slide) I counted in the bar and the word diner seems to have attracted the over 65 crowd- which is surprising because again it was 8PM.   The service was really slow (bar and wait staff) and they have no concept of how long it takes to turn tables but I will give them the benefit of the doubt since it just opened.  Overall if you are looking for a place to get a good meal on that side of town- this is the place, but if you want a little more fun and excitement don't waste your time."}
{"text":"We've been here a total of probably 8 times so far and the food is good, portions are huge but the waiters are slooooow! I mean every time we're in there we're in no rush which works out but geeze!"}
{"text":"Born and raised in Queens, NY, I spent almost every weekend in a diner. There's a certain vibe to New York diners them that is hard to capture here in the south.  Big View nails it, with everything from the dessert case, to the set up, to the diner smell (NYers will get it). The breakfast is great and is all I ever order.  The staff is awesome too!  Ps another great option for NY diners is Landmark Diner on central Ave. Not as good as Big view, but def the ny vibe."}
{"text":"GO HERE FOR BIRTHDAY CAKES! They give you amazing custom cakes for a realllly great price. You will be so happy you did. Just give them a detailed description & a few days advanced notice.   The deviled eggs is where you should start. Who doesn't like bacon topped deviled eggs?   I get the south western salad with blackened chicken. It has never disappointed. My gf gets the jambalaya & we split it. Make sure you ask them to take the tails off of your shrimp ( nothing more annoying than picking them off or accidentally biting one) also ask for extra sauce.  Cody the manager is always on point."}
{"text":"This was first time at Big View and I will definitely be back. When we first were sat the hostess sat us at a small table by the bar which I wasn't too happy about. I asked our waitress if she can move us but only if we were able to keep her as a waitress. She was able to move us to a booth and she was still able to be our waitress. We order the hand cut zucchini for apps and they were really good. I ordered the chicken and waffles dinner and my husband ordered the Thanksgiving plate. Both meals were really good."}
{"text":"Love this place for breakfast. Great option on menu for all meals and good vibe inside.  Awesome desserts!"}
{"text":"First time here and will never be back. The hostess was enough to make me not want to stay. Apparently there's not enough menus to seat people on a busy Sunday. And she will \"get fired\" for seating people without menus. I was told this after watching a table of 10 get sat without menus. People were getting sat coming in after me claiming to have reservations. The hostess made it seem that if I had called to ask for a table I wouldn't be waiting as long, but because I was already at the restaurant I would be further down the list. The hostess was frantic and very rude. Will NEVER be back. I guess if you plan on going to this piss poor establishment you may want to call them before walking inside to avoid waiting."}
{"text":"Their breakfast is the best although you really can't go wrong eating there anytime of the day such a big variety."}
{"text":"Me and the rest of my family were hungry so we saw this place and went to it , we then came in and sat down. We then realized the menu is F*UCKING EXPENSIVE. ITS LIKE F*ICKING 15 DOLLAR FOR A FUCKING 2.5 OZ FUCKING BURGER . but anyways I digress. after we ordered it took GODDAMN 8 FUCKING HOURS just to get our food. but I digress. Overall I dont recommend this place the wait time is shit , food is overpriced , service is crap. Go to ihop instead"}
{"text":"Restaurant quality food at a diner!  This place reminds me of New York/Jersey diners, but the food here is generally better.  Big View should please everyone with a wide variety of choices.  It's simple, reliable, and delicious.  I have tried many things on the menu and it is all good but I prefer the lunch items over breakfast.  I really like their soups and salads.  They market their desserts here with a big display at the entrance.  I have only tried couple of them but they were very good.  Last year I ordered Thanksgiving dinner here for my whole family.  Everything was delicious and we all loved it.  I am planning on doing the same this year.  Thanks Big View!"}
{"text":"When did customer service die? I have no idea but it does not exist here. I had an interview in Ballentyne and I had some downtime between appointments. I went here to do a little work on my laptop and enjoy a light lunch. I waited until well after the lunch rush around 2 PM. Since I was there on my own, I sat in the bar area.   My order was not terribly complicated. I ordered a grilled cheese sandwich and turkey chili combo. My food arrived after a moderate wait and looked appetizing. The grilled cheese sandwich was well prepared but the turkey chili was repulsive. Think about Hormel chili being dumped out of a can and then over seasoned to the point that it was inedible and you have an idea of how bad this was.   The problem was worsened by the fact  that my server did not check back on me once during the entire meal. My tea was never refilled and nobody came by to ask \"How is your meal?\" which is generally considered to be Restaurant 101. My server seemed to be more focused on chatting with friends and doing her side work so that she could punch out on time.   When someone arrived after the meal was clearly finished, she finally asked if everything was ok. I told her that the chili was inedible. It was clear that I had only taken one bite and then pushed it aside. She apologized and then brought the check which included a charge for the uneaten chili. I had an appointment scheduled and decided that $5 worth of chili was not worth dealing with drama. I paid the check and left. At least I know a restaurant to avoid the next time I am in Charlotte, NC."}
{"text":"Ah, where to start. How about with what I liked.   I loved their chandeliers and general decor. I liked their display cases and numerous desserts. My most of the  meal was pretty good and my husband liked his food as well    And what I didn't like.   The service was TERRIBLE. It took ages to put in our order. Our waitress forgot to put in my son's meal (we ordered for him as soon as we could because he was hungry and cranky). All of our food (except sons) arrived cold. I had a Cesar salad with my meal that was just awful. I told the server and she didn't offer to get me something else (like the soup). We ordered deviled eggs that weren't very good either. My husband ordered a milkshake to go and ended up throwing it away. How do you mess up a milkshake?"}
{"text":"I  have never been disappointed when I've dined here. today was no exception. We had a family baby brunch event and out server, Allison was the best! The mimosas are on point and always great .FROM the homemade corned beef hash to the Thai chili wings, there's something for everyone's pallet! if you happen to have room left after your meal, then YOU MUST HAVE DESSERT, OMG!! You can bet your last buck it'll knock your socks off!!"}
{"text":"This will be my first segmented review because parts of this restaurant just didn't jive with each other. To frame this review properly, I will note that we visited Big View on a Sunday at around 7:45am (well before the breakfast rush).  Service: 5 stars for Julie our supercharged waitress from Chicago. She was friendly & inviting from the very first moment. Despite being given tables in a haphazard manner, scattered throughout the diner, she was still on top of things while making sure we had a good time. Hands down she was one of the best parts of the entire experience.   Food: 2 stars. I wanted to give them more because the grub is damn tasty, but the kitchen screwed up on my order in such a basic way that it was obvious laziness. I had a breakfast quesadilla with chorizo & chipotle mole sauce in it. Guess which two ingredients were missing. Exactly. They fixed it, but it was a schoolboy error to begin with & not acceptable when we were eating long before the breakfast rush.   Atmosphere: 1 star. Other than our awesome waitress the rest of the place gave us the cold shoulder. I don't know if it was because we weren't regulars or because we were only 2 people at the big round corner booth, but the stink-eye was hurled in our direction when we weren't otherwise being blatantly ignored.   What really pissed me off was the manager guy (pink button-down shirt & glasses) who walked around greeting regulars & refilling coffee skipped us TWICE even though our cups were empty. How do you make new \"regulars\" if you treat first-timers so shabbily?  In spite of all this I would give them another chance.  The menu has a great variety and the food, when correctly made, was great.  Also, their baked items are rock solid.  I just know what to expect now and will be appropriately guarded next time I go.  Also, if Julie's not in then I'll hit somewhere else"}
{"text":"Private parking lot Stopped by around 3pm, power went out at work, so go get cake! A couple of people at the bar and in the dining area.  Was greeted with a friendly hello and then I jetted to the restroom.  Restrooms where very clean and easy to locate by the bar.  I headed over to the bakery section.  Oh my decisions to be made, so many choices.  I had been craving a good and moist strawberry shortcake (hate dry cake) and they did not disappoint.  This cake was so moist and packed with fresh strawberries.  Huge slice for just $5 and I got the carrot cake as well.  Packed to go nicely and with care.  I will definitely go back for more cake and hopefully will have time to dine in one day soon."}
{"text":"The food is ok. The service unfortunately leaves A LOT to be desired. It's actually a hit or a miss. Sometimes you get attentive waiters/waitresses other times you get stuck with some that probably don't want to be there. I was there about 2 weeks ago and had EXCELLENT service, a waitress with a smile, made suggestions on entrees, brought out nice warm bread and was very attentive throughout our meal. Went back this past Saturday and was very dissappointed. Again, ordered 2 entrees - never any mention of bringing bread to our table. Ordered 2 coffees and the girl brought them out on 2 napkins (ALL the other tables had a plate under their coffee mugs). I tend to put a the empty cream, sugar and spoon on the plate. I asked her for 2 small plates for the coffee and she looked at me like I had 2 heads. Even asked \"you want plates for the coffee cups? - like it was the strangest thing in the world\". From then on - the service was super slow and then waited forever to get the check. Ordered disco fries and did not get to finish them so we asked to get them boxed up. When I get home I realize she packed up the top plain fries and did not add the cheese or the gravy that must have stayed in the bottom of the dish. These probably aren't huge things to complain about but they things that sort of turn you off from returning to a specific establishment - as is the case here."}
