{"text":"I really expected more when I came to this restaurant for the first (and last) time. It took about 20 minutes to get menus for the table, a subsequent 20 to get a drink order - all in all it took us about 3.5 hours to eat. Keep in mind this was just the servers inattention. The table shared a bottle of wine, however I don't drink so I asked for sparkling water. You guessed it - 20 minutes! There was a packed house and it seemed like service was really backed up (go figure). When we finally got our plates, it was a joke really. One slice each of \"seasonal vegetables\" (beet, sweet potato, green beans, carrot) and a bloody duck breast, with its serving of 2TBSP of rice. My husband received 3 scallops. Three! (Keep in mind the plate was ~$25) I've been to upscale restaurants before, so I was under no expectation that I would get a large portion of food. However when the (barely 200calories) worth of food came out on my plate, I was a little put off. Realizing that the vegetables had no flavour, and that the blood from my duck breast had completely ruined my plate anyways (imagine a swamp of blood on the bottom of your plate) I gave up. By this point the server had mixed tap water into my sparkling, and completely disappeared. It took her about 20 minutes to replace the water she ruined, as she plopped the bottle down on the table, unopened, and walked away. As I've said, I have eaten and several \"fancy\" restaurants (as well as have worked in them) and this food + service was unacceptable. I'll never go back, and I've already told many of my family and friends about my experience there."}
{"text":"Came here on a Saturday morning for breakfast. This restaurant is really small but cozy - even so, I could tell it's popular among the locals.   We ordered an eggs benedict with pancetta and \"French toast\" with a spicy chili mixture (forgot the name) on top. Both came with a piece of yam, slice of orange and two slices of pear. The eggs benedict were perfectly cooked and pancetta was thick and crispy. The French toast was really just the chili mixture of tomatoes, onions and spices on rye toast but the flavour was really good!   Would love to come back for their lunch and dinner menus sometime."}
{"text":"Delicious...every part of dinner..chicken, duck,caesar salad,wine. Good value..will definitely return..Yum!"}
{"text":"Went for lunch today , it was incredible  We had crab cakes with Tamarind for app Mango chicken and Moroccan Salmon entrees And desert as who could resist Pavlova and also  A delicious semifreddo , food phenomenal  Very small restaurant and extremely popular so you need reservations . Can't wait to go back"}
{"text":"This place is a bit of a joke ... anyone who rates it 5 stars obviously hasn't ever left their small town and hasn't ever had a proper 5 star meal ... hilarious we spent $400 and the owner had the stupidest attitude all night ... food lacked taste and presentation - when I asked questions about the menu so we could feel some excitement ... the owner was like \"it's exactly what the menu says - scallops in cream - it's exactly what the menu says tomato and avocado \" omg it was like eating at your friends parents house ... a total joke not a bit a complete joke won't be returning needless to say."}
{"text":"Really good place to have dinner with the family. authentic and charming Will definitely be back again"}
{"text":"The term \"hidden gem\" is so overused that I hesitate to ever use it. Bijoy however is THE definition of this term. I took my lovely wife and daughter to Bijoy for our wedding anniversary and while I have had great visits here before, they really nailed it this time. The service was spot on, the food was simply outstanding with the most pleasant ambiance. Enough gushing, the details: I had the Moroccan soup to start. It was layers on layers of subtle flavors. I had the sea bass with chili oil and lime. Not for the faint of heart with pretty serious heat but right up my alley. We also had the scallops with fennel cream and the pork chop with apple. Both were of the finger licking, sop it off the bottom of your plate varieties. There was a choice of sides but we all choose the risotto. I'm a bit of a risotto snob but this beat any of my own renditions hands down with a creamy texture and hints of tomato. We had the Pavlova to wrap up. Sharing is highly recommended although you may fight for the last bite.   I highly recommend!"}
{"text":"Delicious food, very cozy ambience ,  good recommendations from the chefs , between 2 p.m. and 5 p.m. it is closed, but you can go in and sip tea."}
{"text":"This restaurant should on \"You Gotta Eat Here\" . We went to Bijoy's for lunch and were so impressed. The dining room is small and cozy and overlooks a small garden where you can watch the birds and chipmunks. The food was fantastic and the staff lovely. We loved our meal so much that we complemented the two ladies in the kitchen as we left. GREAT PLACE!!!"}
{"text":"another aurora's best resto find! small yet cozy. lunch selection is great including its dessert. should visit again. used to come here when it had just opened. i used to come when i used to attend yoga for life. i should go back again. their bread looks good. havent bought yet though"}
{"text":"Great spot in Aurora. Small, intimate and unique dishes that highlight the unique experiences and personality of Chef Bijoy.  It's hard to characterize the food - and that's a good thing. Truly unique. Old world European influences, Always seasonal and local, Canadian personality and hints of India with subtle uses of cumin, coriander etc.  The care and passion is there. The use of prime ingredients is evident. The atmosphere is cozy and quaint.  I don't think you could go wrong with many choices here - but I loved my Rack of Lamb.... and my wife's Haddock."}
{"text":"Wow, is all I can say. Wow. Wow.. This establishment isn't big, actually it's very small. It has roughly 10 tables on first floor and I'm not sure if upstairs was being used for restaurant purposes.  Came for our late Valentine's day dinner and it's definitely a hidden gem in Aurora. Hmm, so where should I start? The good food? The perfect service? What sets this place apart from others is undeniably the service. The restaurant is small and only one person is responsible for the entire floor, so it may come slow. But when it does come, you will be pleased by how well Andrea handles things. She was straight up professional, very kind and extremely helpful. I always say food doesn't have to be perfect, the service needs to be - Bijoy's restaurant is exactly what I mean. The food was great, don't get me wrong, it just isn't my first time having something like this.  We ordered the mussels to start, lobster tails and veal chop entrées and the mango creme brule to end off. The mussels came warm, but I thought it wasn't hot enough. The sauce tasted very delicious, with ginger, tomatoes and other ingredients. I said before that the mussels didn't come out hot enough.. As it turned out, it was slightly undercooked (some of it). Andrea was very apologetic about it and notified the kitchen/chef about said issue. She explained to me how it was made and perhaps couldn't cook the top portion of the mussels properly, hence being undercooked. We were in no way upset about it because things like this happen, but she was so sorry about the ordeal, it made me uncomfortable telling her about it lol  Our entrées came promptly after and it was such a delight. The veal chops I ordered was amazing in all ways. It was delicious, not over salted or charred, though I should've asked for medium rare instead of medium. It was still good nonetheless - meat so tender it almost melted in my mouth. For the side, I ordered scalloped potatoes but I ended up with the risotto. I notified Andrea of the mistake and she apologized again (making me feel bad lol) and came over with a plate of desired potatoes. So now I had a full entrée + extra side. In my head, I was thinking it doesn't get any better than this. The lobster was also fantastic. Everything about that plate was right and tasted awesome!  The night ended with a mango creme brule, my other half's favourite fruit. I'm not a huge fan of the dessert department, but how wrong was I? I would come back here to get JUST this, that's how good it was. Crispy torched coating on top and the mango part was borderline heavenly. This is the dessert you must try, MUST!   We asked for the bill and Andrea came over. With both hands she handed me the bill and said, \"I'm so sorry for all the issues tonight. That's why the creme brule is on us.\" I was kind of shocked, since this isn't a big restaurant. I wasn't expecting a gesture such as this. I told her that it's ok and it's not right since only a few were undercooked. She pushed back and insisted, so I gave in. I didn't want to give her a hard time, again..   Moral of my review: BE KIND!  For all you other restaurants out there, take note of this. Food quality, presentability and money aren't the only things that make a successful restaurant. If your staff sucks, so will your restaurant.   Ps - portion here was also good for the price :) I WILL be coming back. See you soon, Andrea!"}
{"text":"One of the gems of the city. Not just of this beautiful town of Aurora Newmarket but the entire city of Toronto. The food served here is every bit as good as any fancy restaurant I've ever set foot in. Why? Because it is what I would consider a Canadian omakase.  Let me begin by saying this isn't truly \"leave it up to the chef to decide\" as they do have set menus. However, the herbs, spices, fruits and vegetables served with every dish are always based on what's in season. The owners aren't afraid to make small changes and mix how a dish would be traditionally made in order to serve incredibly fresh foods.   The breakfast is worth the drive just to try. If I lived in downtown, I would drive all the way here just to have it. Served with pancetta or peameal with egg Benedict and your choice of flavored rice or English muffin topped with hollandaise, this stunning sandwich is so well balanced and flavorful. It so comes with juicy, in season fruits.  The other breakfast item worth trying is the fluffy pancakes. The pancakes are baked and are truly really really fluffy. Most traditional pancakes have a more floury taste to it where is this one seems to have more of a slight egg taste. It is cooked perfectly every time answered with just the right amount of icing sugar, fresh fruits, and maple syrup.  While the dinner menu doesn't offer a large selection, I believe this is done with intent. It allows the chef to focus and perfect cooking what is available as opposed to offering many good but not great choices.  Surprisingly, I have yet to try to lunch menu. If you do, please write a review and let me know if it's just as good as their breakfast and dinner. Bon appetit"}
{"text":"This spot is the perfect place to relax and enjoy the finer things in life. High tea, delicious homemade food, great atmosphere and friendly service."}
{"text":"The food was fantastic though I would try a different side than the scalloped potatoes. Friendly, quick service. Cute little place, bordering on too cozy."}
{"text":"We ordered butternut squash soup, parsnip and pear soup, haddock entree, rack of lamb entree, apple crepe and pavlova. Everything was delicious. The ingredients are seasonal, fresh and cooked to perfection. We loved the amount of seasonal vegetables served with the entrees. Excellent pricing as well. Service was great. We chatted with the chef for a while after dinner as well. Nice people. A must try!"}
{"text":"One of my favorite restaurants in Aurora. I've loved everything I've eaten here. Seafood potpie, ratatouille crepe, and the pavlova is a must try!"}
{"text":"Came in for brunch multiple times; we've ordered: - french toast with additional bacon and egg (delicious but wish it automatically came with it as a set instead of an additional charge),  - puffy oven pancake (extremely light and delightful but one is not enough),  - eggs Florentino (perfectly cooked; hollandaise is slightly more tart than I'm used to but is still delicious) - eggs benedict with pancetta (hollandaise is still slightly sour but goes perfectly with the poached egg and the pancetta) - cheese chili tomato toast (homemade bruschetta with a nice kick on toast - simple but delightful) - cheddar apple crisp (literally cheddar in apple crisp - the perfect blend of saltiness and sweet - I don't like overly sweet things and this was quite nice) - pavlova (sounded overly sweet, looked overly sweet but has just the slightest amount of sweetness to have you inhale the entire thing and still look for more!! Definitely my most favorite thing on the menu and has me making the trek just for this!!!)  All in all, a very good brunch place for approximately $10-15 for brunch including a warm drink and tax. Nice service and ambiance.  Flavor is spot on but serving is slightly lacking... the brunch items comes with 1 small roasted potato - wish there were greens or more potatoes with the brunch items to make it feel substantial.  One thing for sure is you will no have that gross greasy feeling you'd normally get from leaving a breakfast diner when you leave and will be very glad you came."}
{"text":"What a Gem! Had the eggs benidict with panchetta and was impressed with the contrast of flavors and the portion was perfect for breakfast.  The service was friendly and fast! Exactly what I'm looking for! A great quaint restaurant that I will be returning too!"}
{"text":"Skip the chain restaurants. This place is the best. Home cooked food that tastes great. Good menu and reasonable prices."}
{"text":"We arrived at Bijoy's today, party of 7 that they weren't expecting (our bad). They were so helpful in accommodating us regardless. All our meals were delicious and several people in our party commented that they would definitely come back. An enjoyable time was had by all. Thank you Bijoy's !!"}
{"text":"We had the opportunity to revisit one of our favorite restaurants in Aurora for lunch: Bijoy...and we weren't disappointed! The variety, quality and price are still delightful. I had the wonderful parsnip pear soup, a delicate chicken crepe,and a decadent lemon curd/ fruit  pavlova, with Buckingham Palace garden tea. This still remains our top choice for dining in Aurora."}
{"text":"Great food, amazing tea list, and always met with friendly and attentive service. Love it!"}
{"text":"This cute little restaurant is very cozy and homey.. the food tastes fresh, delicious, and well taken care of.. The people working there seem as though they want to be there.. you will be treated better than most other restaurants for sure.. we went for lunch, had the soup sampler because we wanted to try a few, and they were all good, I especially liked the carrot lentil soup, my friend liked the pear parsnip most.. then we had the beef stroganoff and Moroccan salmon.. both were delicious, well seasoned, and very tender.. the portions were not big, but satisfying, and left room for the amazing desserts they have! We had the pavlova and a spiced cake soaked in really good creamy toffee kind of syrup (can't remember the name).. Can't wait to go back there again and try other items!"}
{"text":"My husband and I chose to celebrate our anniversary at Bijoy's after I had read Cherrie T.'s review describing it as a secret gem in Aurora.  Wow, what a homecoming we were in for.  Bijoy's is the type of place that lead me to explore and try out and review restaurants in the first place. It is a small establishment that seats 27.  The hostess at the front doubles up as the waitress.  They have a lovely windowed dining room that is both intimate and busy when filled at the same time without the need for mood lighting or anything else. (We came during lunch).  We ordered the soup sampler (mango & yam, apple& parsnip, cranberry & beet), paella, Moroccan salmon, and pavlova for dessert.    We opted to share both the starter and the dessert.  ----- This is going to be a long one.  While we waited for our food - Garlic focaccia cubes dipped in sweetly spiced olive oil with just the amount of salt granules. *lip smacking*  It goes well we've been married so many years that we wanted each other to savor the tastes.  My husband's favorite soup was the mango & yam, mine - the apple & parsnip.  But we finished all three samples.    Everything tasted incredible and looked fantastic.  The paella was made with a South Asian twist, the Salmon well dusted with cinnamon.  Flavors were strong.  I must note, the paella - the salmon or fish that it contained was delicate and moist - cooked to perfection.  This is often overcooked/baked in such a dish.  I was impressed.  The pavlova was a treat.  Just the right amount for two featuring kiwi, strawberries, whipped cream and lemon curd on top of a crusty (but soft on the inside) meringue.    We ended the meal with a coffee.    I want to go back just to try the other menu items.  I also want to bring my mom with me.  I also want to bring my neighbor with me.  I want to go back with my sister.  Such was our experience that.. I would like to go back."}
{"text":"Eaten there three times and have never been disappointed (*Update - my wife has been there at least 15 times - it's the go-to place to take anyone from out of town). A little tight, buy cozy. The pavlova is a fantastic dessert. The appetizers are all good and well priced.  Realizing now... it's been over a year since we've been back... we've gotten too busy I guess, but I can honestly say it is the one restaurant I miss. We're going to have a date night soon...."}
{"text":"Love this place, it's such a gem! We've been a handful of times and everything has been delicious  The service is amazing and the ambiance is wonderful! It's truly become one of our favourites. You won't be disappointed"}
{"text":"A secret gem in Aurora that I actually want to keep it as a secret lol. But Bijoy's Restaurant truly deserves our support and recognition :)  I had a fantastic dinner experience at Bijoy's from beginning to end. First heard about Bijoy from Alfred A. who was very impressed with the vday dinner with his fiance. I went the next day to check it out and I was seriously blown away.  It is a small house in Temperance Street. Limited parking at the back of restaurant. Street parking is available. We were greeted by a very nice lady; she took care of us and the entire restaurant by herself... amazing work! The menu is very extensive - Canadian food made with fresh herbs and ingredients - I had a hard time choosing my dish! Oh and be sure to save room for dessert... you don't want to miss out ;)  Now, compliments to the chef and the kitchen crew!  The baked brie with pear marmalade was impressive. It was a very generous portion of brie. My husband was SO happy because he loves cheese lol. and it paired very well with the sourdough.  Scallops with fennel cream sauce was SO delicious. I literally want to drink the sauce lol. Portion is a bit smaller with 3 scallops but they give a fair amount of veggies and choice of a side. It was a nice portion for me since I eat very little.  Pork chop with apple sauce was a nice combo. Nice piece of pork... some parts were a bit overdone, however, the overall taste was still very tasty. Alfred A. said their veal chop was very good... need to go back and try them out!  For dessert, we ordered the popular pavlova - it had a crispy meringue base with a nice lemon curd inside and topped with a mountain of seasonal fresh fruits and whipped cream - sounds very sweet but it was actually quite a nice balance :)  If you are living in or visiting someone in Aurora or if you're just passing by the Town of Aurora... be sure to check out Bijoy's Restaurant. Highly, highly recommended. Make sure you make a reservation as well.  Lunch is available Monday to Saturday Dinner is available Thursday to Sunday only. High tea is only available Wednesday and Sunday.  ^ If there are any changes, please let me know! Can't wait to come back for brunch/lunch with my family :)"}
{"text":"This place is quaint and unique. Aurora needs restaurants like this! They do have a small dining area and quite close to your neighbours but the food is good and the staff are friendly. The dessert is great as well. I'd recommend lunch!"}
{"text":"This is one of my top 5 all time restaurants to go to.  The building is small but very charming and the staff are super like-able and friendly.   The decor is really nice inside once you sit down also.  I've tried almost all of the appetizers which arent large portioned but are fairly inexpensive so you can try a few.   They have all been delicious.   The main courses are beyond delicious.   When considering taste vs expense, I think Bijoy's rates #1 for quality for your money.   It is cheaper than the Keg with a better cook and food.    Some of the menu items have a bit of an Indian flare, so make sure you know what you are getting before you order something.  I have been there 3 times so far and every meal has far exceeded expectations.   The desserts are equally as delicious.  I have absolutely nothing negative to say  in any aspect of my dining experience here.  At one time parking was limited but a lot opened up across the street so even that isn't an issue now.    For me, this is one of the top 5 restaurants that I have been to in the entire GTA.   Do yourself a flavor and give it a try.  There are very few places that I am a repeat customer of, and Bijoy's happens to be one of those few hidden gems."}
{"text":"Really disappointed by this place. Service is great, and portions are large (if that's what you look for), but their menu is extremely confused and they haven't mastered a single item on it (except the little bread & oil they served at the start, which was sadly the best thing served from all appetizers and mains we ordered). All items our table ordered were either under or over cooked, most came lukewarm temperature and tasted like they were made 5 hrs earlier and just kept under a light. Suggestion? Pick a few dishes to master and be able to serve hot and freshly made for customers, instead of trying to do 20 different things at once and precooking a bunch of sides that \"go with everything\".  Serving smaller and better perfected dishes will actually make the experience nicer instead of feeling like you're getting a meal from ikea."}
{"text":"Super local and cute brunch place. You get a good portion of food and its GOOOOD food. I love how it's a local mom-and-pop shop!"}
{"text":"Cozy place, amazing food, excellent service! Great choices for vegetarians too! Great for lunch and dinner with family and friends ! 5 stars."}
