{"text":"Amazing food! We had tandoori chicken, butter chicken, chicken samosas, saffron rice and naan bread. The chicken samosas were perfect, just the right spice and it complements the sauce that goes with it. If you want to add more spice you can dip it in this sweet spicy sauce. The butter chicken was great as well, they have followed our request to have it mild as my husband doesn't like spicy. The butter naan bread was really fresh and the chicken was alright but I suggest it'd be a little moist. Overall, the experience was great and the service was great too. He greeted us when we arrived and said thank you when we left. He even made the suggestion to order 1 plate of saffron rice as 2 plates would probably be for 6 people. Will definitely be back!"}
{"text":"What an awesome experience! My family of 10 dined here and we were so pleased! Pakoras, samosas, sizzling chicken cream tikka - all great starters. Then we had lamb curry, dal, spinach paneer,  of course Naan and absolutely the best butter chicken and biryani we've ever tasted. All so delicious. I had to also get take-out for some of the family that couldn't make it tonight. We HAVE to go back! Worth the drive for us, we live in the south part of town. Friendly service, run by family. Thank you Ajay, Dimple, and Sanjay. See you again soon.  There will be more of us next time."}
{"text":"Quite delicious! Had various meat and veggies curry, rice and nan and loved it all. The service was fantastic, and staff was very friendly. This will be my go to Indian place from now on!"}
{"text":"My husband and ordered from Billoos and were not overly impressed, on May 22nd 2018.   We ordered Chicken Korma, Rice and Garlic Naan. It should be noted with Billoos that the portion sizes are very small. We had around 7 pieces of chicken in the Korma and a very small portion of rice. For the price - it's a little expensive for what you actually get, and although the chicken did taste good -  beware of the small portion sizes!  The naan bread was also very flat and not very tasty. Infact, we didn't eat it all and usually we don't have a scrap of naan bread left.   We may give this place another shot at some point as it is so local to us, but this particular order we were quite disappointed."}
{"text":"I've driven by this place in Sage Hill but never ordered until tonight, after some Friday evening shopping. I ordered Butter Chicken and Garlic Naan for take out. I liked and appreciated how the butter chicken was vacuum sealed in the container to avoid spillage in transport. The lady on phone asked if I wanted the level mild, medium or spicy (I told her medium and it ended up being the perfect level and the chicken chunks were moist and tender). It was really delicious and flavourful. Friendly service on phone and in person. When I walked in, the restaurant smelled delicious!Ambiance was nice and cozy with dim lighting- perfect date place. I would go back and try other menu items!"}
{"text":"If you want good Indian food in the Nolan Hill area go here! Butter chicken was delicious. So much depth of flavour and try it with the garlic naan, you won't be disappointed! The goat had a wonderful spicy kick to it and I kept wanting more and more. The lentils were wonderful as well. Nice little spice at the end but didn't over power the dish at all. All in all very tasty meal. Staff was fantastic as well!"}
{"text":"I just landed in Calgary and was recommended this place.We placed an order we got the order in 30 mins .There was an extra item in the order .I called talked to Ajay and he was apologetic he offered a refund I told him that we will adjust next time so service is 5 Star now food well packaging is excellent very rare in an Indian restaurant and food .... Just like my grandmother will cook so 5 stars nothing else to say each dish is excellent.... Must Try hope they open a branch in Dallas TX or I will have to move here."}
{"text":"The food was fresh and delicious.  They accommodated our dietary restrictions.  Very family friendly.  The servers are very friendly.  The chai is to die for!"}
