{"text":"This was my second time coming to this place. I will admit, the waitress was very strange. She did stand next to me while I looked at the menu, but I told her I needed more time and she actually left! She was kind to me when I paid, and I didn't really mind the awkwardness. 

Now for the food. When I first went there I ordered korean ginseng tea and kimchi, which was perfectly fine! Not below average but not amazing. I should also mention that the waitress wasn't there the second time I went. The man who served me seemed to be the owner as well as the cook (or one of them perhaps). He was very very nice and I had a nice HOT cup of tea. I asked him several questions about the menu, which he answered! I ordered the natto bibimbap. I really had no idea what to expect, I just wanted something weird and healthy. 

I was presented with four cute side dishes, miso soup, some pink stuff that might have been cabbage and beets, lotus root and cucumbers with seaweed! I really liked every one of those side dishes. It was so weird but they all had strong but wonderful flavours. Then my bibimbap arrived and it looked like a rainbow in a bowl! I don't even know what half of the vegetables were but they were cool! I like that they use weird vegetables. It also came with a little side dish of brown rice mixed with some kind of bean. I'm not going to lie, natto is absolutely disgusting. But I was able to eat it with the rice. The mushrooms were awesome, and the other little weird unknown veggies were cool tasting and crispy (raw)! It was all vegan. Honestly I think it's pretty straightforward knowing whether certain items are vegan or not. Overall, it was a nice and cute experience. The dude also gave me some of this fermented apple juice to drink for free! It was nice. Good price for the quantity. :)"}
{"text":"Service needs to be improved, food is simply okay.  Won't go back."}
{"text":"I had a bad feeling walking in because at 7 pm on a Friday night, we were the only ones in the place. The only reason why this review gets one star is because the food was actually good. The service was beyond bad, actually laughable, The \"waitress\" was the rudest server I ever encountered. She was absolutely no help in making suggestions, did not even know what the appetizers were when she brought them to the table, nor did she offer to ask. Tea was brought to us cold. When asked to warm it up, was told that wasn't possible. When I asked to put in the microwave, she came back with hot water. And the final, most shocking and angering part of the evening, is when she came back to the table three times to see if we had paid. We left the money on the table and began to leave, when she very rudely asked us if we paid. I WILL NEVER GO BACK. Clearly this is why they are empty."}
{"text":"Mom and pop run Korean with a healthy spin. I got the seafood bibim noodles and the very fresh veggies and sprouts complimented the noodles very nicely. Lots of banchan (side dishes) including daikon, kimchi and lotus root. Been here twice with co-workers and both times we were the only ones there. I don't think many people know this place exists. Definitely recommend a visit if you are in the area."}
{"text":"Very nice hidden gem. We checked this place out because of a review we read. Drove by many time but the exterior and sign does it no justice!

Very strong commitment to health. They make their own tofu and kimchi. All GMO free and everything made in house. Wheatgrass growing everywhere. Salt lamps provide ambiance. Tastefully decorated. Fantastic food!

If you love fresh and healthy food you have to check this place out."}
{"text":"The most awkward service I've ever experienced. Server tossed the menu on the table and just stood there. So i decided to ask for a recommendation for lunch. was told they don't do any recommendations just look at the menu.

Server literally did not seem to know how to put food or other items in front of me. Getting the bill and paying was also very awkward. It's as if she's never even been to another restaurant and seen how one acts!

Shrimp noodle Bibim was mediocre, huge portion though, although on the pricey side."}
{"text":"My food was OK, but I was hoping for more guidance on what was/was not/could be made vegan.  I personally thought it was 4 stars, but the other 3 people at the table thought it deserved less.  So 3 it is."}
{"text":"As the other review pointed out, the service at this place is beyond awkward.  When I entered the place, there was a girl on the phone behind the counter, and not another person in sight.  No other customers.  I asked if it was open; it was hard to tell.  She seems genuinely surprised to see a customer, at least that was the impression she gave me. I wish I would have just left.

She said I could sit anywhere.  Now, the restaurant is actually a physically nice space.  From the street view, one would not anticipate how nice it is inside.  Although, being empty, it had a very weird vibe.  Classical music played loudly on the speakers.  It is rather dark. There are too few tables for the amount of space.  It was weird, but also nice and clean.

The menu I was given was a crumpled and dirty, plastic covered, binder clip bound paper.  Some menu items were crossed out in pen.  Prices were crossed out with new prices scribbled in their place.  She placed the menu in front of me, and stood two meters away, staring awkwardly in space.  I made my selection and waited. I pulled out my phone and pretended to read while I waited.  Several minutes passed. Time stretched.  Should I say something?  What was she looking at?  I sat, she stared.  I wondered if she'd notice if I left.

She snaps out of her trance for a moment to take my order -- Udon Noodle soup with seafood.  I admit, perhaps this item is an off-the-board selection for this place, but it was cold and I wanted soup.  Her reaction was so weird, like she was surprised they even had it. In almost disbelief, she asks me point to it on the menu.  I did and she gave a smirk at my ridiculous order.  I asked if there was a problem, if I should order something else.  She mumbled something and walked away.  I truly felt as though I was mocked for my selection.  

The soup was bland.  It had some cut up vegetables, little bits of squid, and noodles that I wouldn't call Udon.  The broth was watery, the vegetables (cut up bits of green and red pepper and broccoli) were mushy.  The noodles seemed limp and over cooked.  They would break apart at the slightest move of my chop stick.  I ate about half of my soup, estimating generously.  I couldn't get another bite down.  

I walked to the front to pay.  She acted as though I was interrupting.  Without saying a  word, she rings my bill up in the cash register.  It came in at over 16 bucks.  I was shocked, but didn't even ask her to clarify.  I believe the soup was 13.99. I also had tea.  The prices at this place are quite high in general. 

Truly, it has been a while since I've ordered something and couldn't be bothered to eat it.  But the service at this place will be what I remember.  What an odd little restaurant."}
