{"text":"Had an amazing evening! We decided to try this spot for a meet up with some dear friends. The atmosphere was great, quiet enough that you could have a conversation without straining to hear. The service, food and beverages were excellent! Our server was constantly ahead of our own thoughts, offering excellent service with little hassle.  The food was amazing and I can'r wait to go back and try a few more dishes. The mixed cocktails were fun and delicious, but go easy, the may be strong.  Wine list is probably the only thing I have a somewhat negative comment on, as it was smaller and didn't offer a huge variation of blends for my unrefined palette.  Dessert is a must have. Leave room for 1 if not more, its splendid.  Easily recommended and can't wait for another opportunity to return.  Perfect for business, date nights, special occasions."}
{"text":"I love the mount pleasant strip! This restaurant is SUPER pricey but it's so good. Every once and a while I'll pull over to the side of the road just to pick-up a muffin to enjoy on my ride up to Richmond Hill. The owners are amazingly welcoming people which is so hard to find in the City now. They put their clientele. Check out the bank-vault in the back - it's such a treat!"}
{"text":"Great bistro. Staff are very attentive and great at advising. Cocktails were fantastic. And the desserts are spectacular!"}
{"text":"I found it expensive for what you get compared to other French bistros in Toronto.  The burger was very good, fries just okay.  Comp toasted baguette slices were really good.  $200 after tax and tip for 4 of us.  Only 2 people had drinks (one beer, one wine). For that price, I wouldn't go back.  Too many other good restaurants in Toronto that are less expensive."}
{"text":"Went with some friends after they suggested this place.  No idea what people are eating at this place that would warrant anything but more than 1 star.  I ordered the pork chop after the waitress raved about it.  Not only was it overcooked, the 'bed of leeks' was not nearly cooked enough...and to top it all off, they decided to load up some pickled onions on top of the chop, along with an ounce or two of pickling vinegar.    I called the restaurant the next day in an attempt to discuss what happened with management, left a message - no call back.  Too bad Celestin is no longer here, they were far better.  This place, and its owners, are the pits."}
{"text":"Been here for dinner once and brunch yesterday. The service and the food are excellent. So much so that I already booked a dinner in Feb with them yesterday. I will post a detailed review of the February one. When I was at brunch yesterday for the better part of the morning it was just me and my friend. I was shocked!! Most places in Toronto are packed for brunch. This place is a must try. Do not miss out!"}
