{"text":"One of our favorite neighbourhood  bistros. We have been coming here for over a decade. As a matter of fact we came for dinner the night we decided to get married and wrote the guest list on one of their napkins. Service and atmosphere are friendly. Prices are high but the food is good."}
{"text":"We ordered a NY steak and an omelette. The steak was too well done, and as tasteless as the omelette. Very weak food and not worth the price. Good music and good ambiance, so it may be good for drinks."}
{"text":"Excellent service, beautiful atmosphere and fabulous food! I had the onion soup and the crab cake which were both exceptional. As well I enjoyed the caramel carrot cheesecake. Wow!! Apparently, everything is made on site. We were treated very well from the owners who doted on us and I the servers who were wonderful. We'll definitely be back!"}
{"text":"I found the place while wandering Westmount for the first time on a Friday afternoon. We were staying at a hotel closer to downtown and had been to the usual places around Sherbrooke/Centre-Ville. We went the next day for a Saturday brunch and had an excellent meal of eggs Benedict, waffles and crepes. All were done very well in an environment much more elegant and better service than the trendy places downtown without the annoying wait and the noise. If you want excellent food, very good service in a quiet place to enjoy brunch at a very reasonable price, this is the place."}
{"text":"Good location.  Nice atmosphere.  Good service.  Okay bistro food."}
{"text":"We went to the Bistro not knowing it had recently been renovated by new owners (Dec 2016).  Outstanding ambience and our server, Troy, was courteous, knowledgeable and attentive. Excellent wine list, reasonably priced.  Our calamari app was delicious and perfectly prepared with a light breaded coating. Our burger and Caesar salad also were delicious. If you haven't been there lately, highly recommend you do so soon. You will be pleasantly surprised!"}
{"text":"I don't know what this place has become but my review will apply to what it once was.  When the Bistro first opened, they had some of the best food, drinks and ambience in Montreal. From their Goat Cheese Filo to their Chicken baguette served with this marmalade chili dressing to their perfectly cooked Steak/frites - it was one of my favorite restaurants in the city.  If I ever return, I would love to go again although it seems like they don't stick to that old menu anymore. Perhaps since their reviews are so terrible, they might want to go back to their roots and figure out what they did well back then.   Also music, lighting and beautiful server Lydia lol...I can still recall all of it..."}
{"text":"Nice place. Overpriced food. Very poor service unfortunately. And when my cousin clearly didn't eat her way too spicy salad, they pretended they not only didn't see it but barely listened when we said it. Also, we had to continuously ask for water or even the dessert menu.  AND they made mistakes on our bill, adding things we never got. Bad. Too bad, great location and nice ambiance."}
{"text":"Came here on a Thursday night for dinner with wifey for a special occasion. It was really surprisingly excellent. It's basically an upscale pub. Very understated, and, honestly, the best and friendliest service I have ever had in Montreal. Though it comes with a price, but I think it caters to the local crowd who all seem to be regulars and love it.  Together we had French Onion Soup, Potato+Leak Soup, Spinach Bacon and Mushroom Salad, Grilled Atlantic Salmon, and NYC Strip Steak. Everything was really really good. So tasty and friendly and understated.  It is on the pricier side though, about 15% more on average, but for aforementioned reasons. I would return if I was a local, though I'm not, so it'll just remain a lovely memory."}
{"text":"OK! There's been talk about this restaurant. We went there tonight and had a great meal. The food was terrific the service just as good. Great to have another local place near by."}
{"text":"Un endroit chaleureux de la bonne musique. Je suis allée avec mon copain et c'était super bon bien assaisonné de bonnes portions et de qualité. Nous avions acheté un forfait sur VieUrbaine et le menu affiché sur le site était pas le même que celui offert au resto alors un peu plate de ce côté, mais c'était un bon coupon étant donné la vraie valeur des plats. Miam! Le service était de bonne longueur, on s'est bien fait répondre."}
