{"text":"I was expecting it to be another sushi restaurant. I was surprised that Japanese chef can cook good French cuisine and their price so low. I was impressed the food was like the Japanese product sold which was carefully made with all fine details. The many kinds of appetizers serviced together to satisfy your desire to try it all. The lamb rack I ordered was so tender and cooked just right. Even the veg serviced on the side of the main course was carefully cooked and selected. The fork and spoon for the dessert were brought over on a tray covered with a cloth then handed over instead of left on your table or set on the table. Hot water in different pots was serviced continuously without being asked until before you leave. Thanks, I enjoyed the waitress (Hatori's daughter I was told) dedicated professional service as well as her friendly smile. I will definitely come again. It was a very impressive experience which I did not have for a long time."}
{"text":"Bistro Camino is a gem hidden on the Danforth between Main Street and Dawes Road - definitely not the stretch you would go for a nice restaurant experience, like the area near Chester. But Bistro Camino surprises me every time I go there. The chef knows how to cook French. The waitress is amazingly friendly, patient and polite - unlike the majority of waiters in Toronto. The prices are incredible. $32.00 for a prix fix? If you go there, don't miss the croquettes. Another detail: the washroom is incredibly clean. You can tell the quality of the restaurant by looking at their washrooms. If they are not properly cared for, you can expect the same treatment with the food."}
{"text":"Great food, witty server and inexpensive. Wish I had known about this place a long time ago."}
{"text":"Have been coming here for years even before it was a French restaurant.  The same cute, cozy, inviting family vibe is present.  Super friendly and accommodating.  The food is very good for the price.  Everything seasoned perfectly and cooked just right.  I came back mainly because of the tempura ice cream (currently a secret menu item from when they were a Japanese restaurant).  Decor is nothing new but I like it as it is nostalgic to me.  Some may call it dated and I can see why, but I think it's perfect.  Great to see this little gem is still alive and well :) been coming here on and off for over 25years!  Side note: just had the tempura ice cream.  Still no other attempt from any other place even comes close to the tempura ice cream here.  Yes, ACTUAL deep fried ice cream.  Look at the pics.  Remember in a Ratatouille when Anton Ego eats the ratatouille and gets transported to his childhood?  The tempura ice cream here is my ratatouille.  :)"}
{"text":"Amazing place first time at a French style restaurant, and it was very welcoming and cozy! Waitress was amazing has the cutest laugh."}
{"text":"I know it's a strong statement but this place is what all the reviews say, a diamond in the rough.  Service 10/10,  Food 10/10 Presentation 10/10 Price 10/10  Decor 7/10 Likelyhood of returning... 100%  To get the service we did for those prices and this neighbourhood was totally unexpected. This family run business has charm and likeability. Best Profiteroles I've ever had, and a fantastic H'orderves selection. Give it a go you won't be disappointed!"}
{"text":"It's Japanese French bistro at the right price.  Sure, it's not exactly in the most-accessible neighbourhood and sure it's not exactly in the nicest neighbourhood, but if you like solid, retro'ish comfort food, then Bistro Camino is the place for you.  I think I had the $25, three course fixed price and each time was better than the previous. On my first visit, I started with a sesame beef tapas dish, a sweet potato soup and finally the duck confit. It was fatty, salty and downright delish. The second visit, if I recall, was rack of lamb cooked to perfection (sorry, the sides escape me)  The food here isn't going to change the world. It's simply solid value that the own prides himself upon."}
{"text":"Went today for lunch.  Had fantastic fillet sole and Japanese style beef.   Excellent presentation of food and service.    Prices unbeatable at $9 per entre (before tax/tips)."}
{"text":"That's it!!! 5 well-deserved stars!!!!   This place got even better when I visited with my Mom on the eve of Mother's Day.  They had a ridiculously delicious prix fixe menu with so much food for only $32!  In honour of Mothers, they had a diamond dinner set featuring a platter of 6 apps, which included lobster bisque, beef carpaccio, smoked salmon and lamb in sugar cane.  The platter presentation was haute cuisine and so was the taste.  Then you get to choose for your entree either Filet Mignon with shrimps in Bearnaise sauce or Lobster Thermidor.  By golly you could not go wrong with either.  This was the best filet mignon I have ever tasted and I got to sample the Lobster Thermidor and it was soooo very good.   For dessert you get 3 types which included a custard with fruits and divine raspberry mousse.  Why did this meal have to end?    My mother was so impressed with the food and service.   I am so very glad that she had a great time and it did not break the bank too much!  I will come here again and again because this is truly a gem!"}
{"text":"***1/2 stars  Bistro Camino is the right kid on the wrong block.  Located on the no-man's-land strip of Danforth (between Victoria Park and Main) amid a local flower/grocery shop and a few stores that carry odds and ends - you wouldn't think anything of it.  The wine list could use some sprucing up (and you'll just have to ignore the ones crossed out in pencil).    The decor is more outdated than classic - reminding me very much of a Prohibition era pool hall with its dark greens and wooded interiors.  But that is forgivable given chef and owner Hiro Hatori's goal at providing quality, wallet-friendly meals.  With two prix fixe dinner menus ($25 and $28 respectively) and a handful of chalkboard daily specials - the options are plentiful.  Since it was my dad's birthday and we had a birthday cake waiting at home, I opted out of the prix fixe menu (which includes a choice from 4 daily appetizers, mains which you can order à la carte) as well as a dessert.  Warm bread baskets were brought out for the table with butter, olive oil and balsamic.  It was light and had a nice crust with a pillow-soft interior.  I opted for Lobster Thermidor ($20) off their daily specials which comes with a choice of soup or salad.  I opted for the house salad which came with a choice of 5 dressings.  I settled on the Seville Orange vinaigrette.  It was a colourful presentation but  just a plain old salad. The dressing was a tad on the salty side.    My sister had the Duck Consommé soup which was very flavourful, without being murky.  It was clear as water with a few raisins and rosemary.  The lobster was delicious, topped with cheese.  For me, the most interesting part were the plethora of sides that highlight chef Hatori's Asian roots.  Gracing the plate was a bean purée, corn, balsamic-marinated shiitake mushroom, roasted red pepper, watercress in a Japanese peanut butter dressing as well as broccoli and cauliflower with a citrusy Hollandaise.  An unusual cast of sides, but yummy to say the least.  It was a nice touch when the man behind the food came out to say hello and asked us how our meal was.  From the food to the service, I enjoyed my dining experience at Bistro Camino.  With all the formalities aside, the food is worth coming for - and at these prices there really isn't much to complain about.  I should also mention that Hiro's daughter (who man's the front end) has an impeccable memory as she managed to take our orders down AND bring everyone their respective orders without the use of pen or paper.  The bonus is that parking is plentiful and mostly free after 6PM."}
{"text":"Don't worry about the neighbourhood or the decor - come for the food and the captivating Maya as your hostess!  The food was outstanding.  Can't imagine it any better.  I will be back, and back, back."}
{"text":"This is the type of place i root for and wish could do well--especially since our neighborhood lacks decent dining options. As others have noted, the decor is subpar and the neighborhood is lacking. Unfortunately, the service just wasn't very professional (not bistro-level); the server was nice, but the resto really doesn't quite have its act together.  The food was OK but a bit muddled--a slightly confused mix of classic French with some odd Japanese elements. The chef was nice and inquired about our meal, but i didn't have the heart to tell him it wasn't quite up to snuff. I would give 2.5 stars. I wish them well but wouldn't return."}
{"text":"A funny place, in a funny neighbourhood, but with incredible food. I love this place. Last time I was there, my friend and I ordered their (very affordable) prix fixe dinner which included duck confot and lamb chops....deeeeeelish"}
{"text":"Valentine's Day 2011 - Our first time eating out in the new 'hood!  Made the reservations weeks in advance, read every review in existence, all signs pointed to a wonderful evening. I was SO EXCITED!  Mr. Rosie S. even put on a dress shirt! He knew I had been looking forward to this trip for a loooong time - since we moved to the area Jan. 1, in fact!  So, we got there and there was literally ONE vegetarian option on the menu. It was a seaweed salad. My heart sank, my face fell. Not exactly my idea of a gourmet Valentine's Day dinner.  The waitress offered to ask the kitchen to \"throw something together\" for me... \"vegetables au gratin or something\"...   Thanks, but no thanks. When I eat out somewhere like Bistro Camino, it's because I know about the chef and his/her style and I want to sample some of their well-thought-out and composed menu selections. I don't want to eat something just \"thrown together\".  If you're not going to put your menu online, you MUST have at LEAST one vegetarian entree option on offer. PLEASE! This is 2011.  So basically, I burst into tears and we left. We went home and I (sulkily) made dinner for us (though I had lost my appetite and couldn't eat any)... so much for that.  Our landlord then came and helped us install a new toilet instead. Great timing! Very romantic.  Happy Effing Valentine's Day.  They get one star because there was ample street parking that's free after 6 p.m."}
{"text":"\"Sasuga\"!  Three weeks ago I was still on the hunt for a place to hold a memorial lunch for my father when in desperation I turned to yelp. Having been led astray by reviews before I was going on instinct alone. Finding a reputable place for 50+ people is a harrowing responsibility.  I first contacted BIstro Camino by telephone and was pleased to hear from Miss Maya who told me \"no problem\" confidently. First star.   My  original guesstimate of 35 people soon turned into 45 - 48 - 50 and at one time swelled to 55 but last minute illnesses kept us at a manageable 50. Maya rode out the erratic final number reports from me with expertise and compassion. Second star.  Choosing a menu for a family comprised of half Philipino half Anglo, throw in a few picky eaters and vegetarians is no easy feat but again, our Miss Maya and staff ruffled naught. Star number 3.  Despite a few late arrivals and the somewhat bawdy atmosphere created by the guests not once did I doubt that the BC crew were in control. Serving staff weaving effortlessly and at times ninja-like through the throng was impressive to say the least. Level up, Star 4.   As for the food (we had a custom menu created for us) I will just say that whatever your tastes or preferences may be, Bistro Camino can deliver in spades and a unanimous thumbs up was given by everyone who attended this day. A restaurant's reputation is made up of multiple components so the fifth and final star is for chef Hiro Hatori. No coincidence that his name rhymes with \"hero\". Many thanks to everyone at Bistro Camino."}
