{"text":"I like to poke in here when I'm in Inglewood and I love the atmosphere. Prices can be a little steep for groceries but it's excellent for its food and bar area.   I was pleasantly surprised today that they now sell kombucha by the howler (1000ml -$10 for the bottle) or growler (2000ml -$12 for the bottle) size, to take home! It's about $15 for 1000ml, but you get 50% off the kombucha when you get a bottle. All said, this was about $17.50 worth of fresh local mojito-flavoured kombucha. Delicious for mocktails! I may start making my own, but this is great if you want a quick batch for a house party or during a busy week when you want a little extra probiotics. For those of you who haven't tried it before, this is a great place to try it out - it tastes a lot like pop or cider but with undetectable healthy gut bacteria in every glass!   They also now have a fiasco gelato ice cream bar! It is one of the few places where you can grocery shop while digging into some passion fruit and rosemary sorbetto while you check out some of their unique products and ogle their incredible desserts and bakery goods.   I love the idea of having a pint of kombucha with friends and I like that they offer the perfect environment to chat with friends with all different tastes, from the coffee or tea lover, to cider/wine/beer lover, to the kombucha lover. And their food and snack options always seem to exceed expectations in terms of flavour.   Transit rating: 4 stars. Bus stop for the #1 is about a minute's walk and it runs about every 20 min to downtown to connect with the ctrains. However I've had drivers be a little inconsistent on this route (they passed the stop by accident or were early), so it's worth it to make sure you're a little early just in case."}
{"text":"There are some hits and major misses here.  Some of the bad experiences: -Once ordered a chicken quesadilla took it back to work and there were bones in the chicken. I called and let them know because it would have been pretty awful if someone got one stuck in their throat or something. The manager was apologetic and said the next time I was in my meal was on the house. Next time I was in it was really busy and I just let it slide, my meal that time around was good so I really didn't mind.  -Ordered a seafood soup a few months back and it was overly salty and somehow also void of flavour.  -I ordered steak and potato soup recently and threw it out after two spoon-fulls. The potatoes tasted old, really gross. If I had more time I would have returned it, but I just could not be bothered to go through calling again.   The good: -Lots of choices, you can pretty much get just about anything. Salad, lunch and dinner entrees, pasta, sandwiches, sushi, smoothies, snack plates, etc. You can get a good sized meal or just a little snack or something to suplement a home style lunch. This is a restaurant/grocery store so there is tons to choose from.  -I like the grab and go case they have set up now, you can pick something up without waiting for someone to get it prepped for you out of their deli case. You can just grab something and head to the check out.  -Their Kale ceaser salad is really good when it isn't over-dressed. I've gotten it a few times and it has WAY too much dressing on it. I've even taken it home add added more of my own kale in order to make it edible.  All in all, I am getting less and less interested in visiting Bite because half the time the food has been pretty gross. I just can't be bothered to risk wasting $10.00 on a lunch when I am not sure if I'm going to throw out the majority of it."}
{"text":"We stopped for lunch one day when we were in Calgary and were dazzled with the lunch that we received.  Perhaps we are deprived coming from the north (we live in Whitehorse) but watching someone saute duck breast for a sandwich that is then served up with a side salad of greens and pomegranate seeds was pretty fantastic.  The food was every bit as good as it looked and worth every penny."}
{"text":"I love the location of Bite, and the fact that they have coffee and sandwiches to order, plus a great front area to sit out on(as I did) on a sunny day. I have to say though, I find the store cluttered with too much, not displaying all the delicious (and expensive) products they have to offer. It tends to be dark towards the back. If you are new to the store, you could easily miss that they do offer coffee, lattes etc.."}
{"text":"Best breakfast in town! Great food at a great price. There's lots of room, so no lines and they have a nice patio."}
{"text":"This place gets 4 stars just for carrying two of my favorite hard to find foods: Poplar Grove Blue Tiger cheese, and Nefiss Lezizz olive oil.  Great selection of charcuterie items, and gourmet foodstuffs like foie gras and truffles products. Got a sweet daily deal coupon too, making it double cool.  This store has more fresh/frozen items than Cookbook Company Cooks.  I have head it through the grape vine that Bite will be undergoing a transformation soon, to be more like a complete grocery store (a la Sunterra), but keeping it's nicer selection of gourmet products."}
{"text":"I went there on Saturday with my 7 monh old baby son. We had just gone to baby swimming lessons and were tired and hungry. I was looking forward to something special and filling and willing to pay the bit extra I knew it would take. It was 12pm and there was a brunch menu offered. I did have to check with the lady at the checkout counter to see how it worked as it wasn't clear. Even though the sign hanging from the ceiling said 'restaurant' I would call it a cafeteria at best. You order in the middle part next to the desserts, get a number and can pay then or pay later. Then you can find your own beverage and find a table to be delivered your selection. I ordered the Classic breakfast, as it looked like the most filling and healthy with a choice of bacon or sausage, two eggs, toast, hash browns and fresh fruit salad.  My breakfast was delivered to me and right from the beginning it was an underachievement, I could have done better at home. The presentation was slap dash and the plate was too small. Two eggs fried together as one entity and about 3 millimetres thick. Cheap white bread, two slices, no butter. I asked one of the cooks if they had butter and he had to run around opening and closing fridges to find it. Two thin strips of bacon and some sad looking cubes of fruit skewered on a stick with a sad, brown grape at the end. I ate it, I was starving. My baby was fussy and it wasn't until I was ready to pay that I realized why I was still so hungy, they had forgotten the hash browns. At this point, another lady who had just been given her food went back to tell them they had also forgotten her hash browns. So I wasn't the only one. For $13.50, this is not an experience I would pay for again. I did tell the girl at the checkout that I didn't think I should pay $13.50 when I didn't get all I had requested and she shaved $1.50 off the price. I also said I knew it wasn't her fault, however, I would not be back. To which she smiled and nodded. Okayeee. Such a shame, I think I will stick to my side of the river in Bridgeland."}
{"text":"The staff is personable, knowledgeable & the vibe is great.  Love the daily sandwich selections, fresh ingredients and killer finished product!  The Groceria part is high end and definitely for a more gourmet outcome, goodies like me love this place. 4 Stars for sure, leaning toward 5."}
{"text":"I wish this place had the food that matched the atmosphere.  I love the décor and vibe, it makes you feel like you are not longer in hicks ville Calgary.  Sadly the food is bland and lacks flavor.  I really really wanted the food to be good... but it is not.  I will say ...the coffee is delicious."}
{"text":"Third time's a charm for the lunch counter at Bite. After a couple lackluster stops a tasty Wagyu (?) burger did a lot to salvage what was otherwise going to be a pretty :-/ review.   * This is really a review of the lunch counter and prepared items. I haven't spent much time in the grocery store, just browsed before or after lunch. From what i have seen in the grocery, prices on pantry items were well above what can be found in most supermarkets and specialty ethnic stores (I'm thinking of you $10 mason jar of rolled oats or the $7 bottle of salsa that can be had for less than half that at the Unimart). On the other hand,  prices on meat, cheese, and deli items seemed on par with other high-end grocery stores and even top-quality products from the local co-op or Safeway. So if they they carry a favorite product you can't get anywhere else, it may be worth a stop.  Eating at the spacious deli and hot-line in the back, I've had a similar hit-and-miss experience. A late weekend brunch offered an omelet, made to order, but otherwise unremarkable. Sandwiches to go have been more miss-than hit. A number of pre-made sandwiches are wrapped in a cooler alongside the deli salads - fine if you're going to throw it into a sandwich press, but not something I'd jump at paying $10 for cold. When asked what they were making to order, the chef behind the counter proudly described a smoked bison with wasabi slaw and a chicken bocconcini club, so we ordered one of each.  The thinly sliced smoked bison didn't bring much smoke or meaty bison flavor, but thankfully the wasabi in the daikon slaw had a light touch and didn't overpower. Pea shoots or micro-greens (I don't remember now) where a nice touch, but the overwhelming thing I remember from this sandwich was the mealy winter tomato. I get that people expect a tomato on a sandwich, but if this is chef led or chef inspired cuisine, then you really should be thinking about everything that's going into the meal. Heck, I don't think even a decent tomato would add that much to this sandwich, so why not try something different.  The last visit however, turned things around somewhat. A $13 wagyu burger came juicy, with great flavor, on a nice egg bun. The included salt and pepper fries where above average, the other sides in the hot trays looked pretty good too. The eat-in space is bright and comfortable, and take-out containers looked solid enough to survive a trip back to the office.  I don't think I'll become a regular (for groceries or for lunch) but I'd have no problem cycling this place into my stable of reliable lunch options."}
{"text":"Used to be good not sure what's going on lately but the staff seems short handed and uninterested."}
{"text":"Bite has an amazing array of gourmet food. From honey to mustard to coffee to fresh and frozen meats. Very pleasant and helpful staff. The store will soon be moving to a larger location across the street."}
{"text":"Walking through the halls of this unique store brings me back to when I was in Europe. It has really neat stuff and I have to say, being a foodie and loving to cook - this place is trouble on my bank account but hey, it's not like it's a waste when I get to eat what I buy right?  Clean, wide selections and nice people... go check it out!!"}
{"text":"Bite groceteria is a cute little gourmet grocery store in Inglewood. It's quite impressive when you walk in and the first thing you see is a gigantic crystal chandelier. They've got an espresso bar on-site, along with a mini meat & cheese deli, as well as shelves stocked full of a variety of imported items.  Lentils, spices and biscuits galore.  What's the problem you ask? The prices! Everything in this store is insanely priced. You can buy a jar of lentils for $9 here, or you can head to the N.E. and pick up the same amount of lentils for less than $2. What would you do?  Definitely a cute store, but it's more the 'look but don't touch' kind."}
{"text":"I reordered their special today fish cakes on Jasmine rice in a yellow pepper sauce. i find the food here is always bland. I never enjoy my meal there. I ordered a pulled pork sandwich which was a disappointment. I won't eat there again in the future. Save your money."}
{"text":"Love this place for both lunch and grabbing a delicious meal for dinner. The grocery store is filled with little gems and uniquely yummy items.  Customer service has always been great when I have visited. Just a warning: the desserts are amazing and the carrot cake and date squares are huge and wickedly delicious."}
{"text":"I give the service and food a 5, the prices a 2.5.    I love browsing the shelves - there are so many incredible looking foods, but the prices are often missing so I'm afraid to touch anything, and when I do see a price, it's scary.  I bought a salad dressing without knowing the price, only to be astonished that it was $15. The lady at the til felt bad for me and gave me a free gourmet tin of shaved salt!   Sometimes I drop in for a sandwich at lunch. There's always a very tasty special, but at $9 a sandwich, it better be good (and it is)."}
{"text":"\"Come in for a latté.\" The sign said.   \"Okay,\" says me as my feet turn right and head towards the caffeine siren call. I walked in after lunch elsewhere and ordered 2 small lattés. While I waited for that, I did a quick revolution and slowly filled my hands with different Italian candy bars and candies. An entire block of marzipan! I heart marzipan (and not just because she's Homestar's hippie girlfriend).   This little store is so adorable it hurts. I'm glad it's all the way in Inglewood though, or I'd probably eat my weight in Italian chocolates on a daily basis."}
{"text":"Nice place to wander and find something for dinner but if you go with something specific in mind, they probably dot carry it. I've gone in for romaine lettuce, nothing. Sausages, all gone.   They have 17 different kinds of nuts but no peanuts. I think you get the idea.   They carry vegemite, which is impossible to find. They have some great prices on vegetables, which really surprised me. I assumed it would be all so overpriced, but it was quite reasonable."}
{"text":"What a great find in the heart of Inglewood! You walk into a heck of a market area where I found the prices reasonable enough that I was picking things up to buy when I had only intended to go inside and take a look! The rear of the huge store boasts a cafe with quite a bit of seating - the menu is on a colorful chalk board which changes daily. Except for a popular hamburger they keep on all the time. I found all staff in all areas friendly and helpful! I missed lunch by just a couple of minutes (closes at 3pm) but apparently gets quite busy over the lunch hour.  The food Gods were against me as I had just missed out on some Thai Coconut soup! Next time.  So. I cannot comment on the prepped foods however the professional looking kitchen and staff gave me confidence that I would like to come back to give it a try. They have a build your own salad bar! The chicken breasts I bought from here are marinating right now, very happy so far with what I purchased, lots of Italian Imported foods. The produce looked very fresh and the cheese selection is also impressive!"}
{"text":"Not quite Café, or cafeteria, or grocery store... It's a groceteria! Is that seriously a thing? Is this a made up word? The world may never know, but luckily after reading this review, you'll know that it's a good place to go if you're looking for any of those things!  FOOD! They've got a really solid kitchen, pumping out tasty goods to eat there or take away with you, and they're often bustling about getting ready to cater some fancy-pants party. (Fancy-pants party throwers take note.)  GROCERY! If you're looking for a really great selections of all things adult (excluding \"beverages\" and \"entertainment\") ...I'm talking adult food here, like, stanky cheeses, olives, charcuterie, forcefully fattened duck/duck/goose liver, (fois gras,) and fungi that can be found only by trained pigs, (Truffles!), you're in a in a great place. Sorry for making all these things sound less sexy than they really are, they're all by far my favourite things to put in my face, ever.  They've got a decent, little selection of organic and local produce and meats as well making it a possible to do a fully high-end product refrigerator restock.  COFFEE! They've got a full on Café section complete with Barristers. Objection! I mean Baristas - that will making you a smoking cup of joe so tasty it should be illegal. Is it? I don't know - time to let the other guys step in.  It's a great place to meet for a quick lunch, take a meeting and pick up some Mans Eggs. It's a local supplier. Settle down. http://www.galimaxtrading.com/manseggs.php"}
{"text":"I went recently and the store looks great. There is a ton of staff and everyone looks like they are working hard but its a bit disorganized waiting for food and paying for it at the till. Looked to me that everyone was trying really hard but just needed time to find its groove.   I ordered a grilled vegetarian sandwich which was pretty tasty. There was a big hunk of feta that tasted really good and the vegetables were nice. My buddy's breakfast sandwich looked plain and tasted alright. Our sandwiches were $8.00 and it was tasty. My sandwich was reasonably priced but the breakfast wrap wasn't really worth it. Next time I would probably head to Spolumbos instead..."}
{"text":"This place is a chef's (or aspiring home cook's) dream!  Reminded me of roaming food halls in Europe. Bite is packed with tons of specialty and harder to find items. I finally found figs! And heirloom tomatoes! And pints of Fiasco Gelato! And it wasn't full of screaming children and pushy adults a la the Farmers Market!  I will definitely be back for specialty items...probably not back to the deli though. I got the Greek couscous salad - it was yummy, but nothing better than I could have made myself (and I would have skipped the onions!).  Other than that - good location, quiet, adorable decor - who doesn't love chandeliers and antique mirrors at the grocery store?!?"}
{"text":"I remember Bite from it's old location as a scary little store with almost no prices and expired items all over the shelves.   When I rediscovered Bite a year ago,  they had moved and had transformed in a hip alternative grocery store that I actually enjoy hanging out in. Now I'll stop in for a snack in the cafe when I'm not really interested in a big meal and there is usually something interesting in the deli case that's new and worth a try.  Not everything is great but it's better than most delis.  Obviously chef driven both there and in the pastries and the prices are still pretty ok.   Bite is far from me,  but when I'm around I like to stop in."}
{"text":"this Grocer is a bit out of my way but i was here for an event with Culinaire magazine. The staff was really friendly the food that they provided was all in house made and really good. the place had a really good vibe and lots of different things happening in the business.  I will have to return for brunch and some Sunday shopping if they get a pretzel in. I had a craving for pretzels and hummus and I walked the entire store and could not find a bag of pretzels I thought this would be a common item but maybe not.  The in house hummus was still good!"}
{"text":"stumbled across this place when I needed to find a spot to eat in the inglewood.  It's a pretty large space with a grocery store + really cool cooked options plus a sit down (diner?) during regular hours.  great selection of items, $13 for a dinner plate (fish and a few types of vegetables, so not unreasonable).  didn't try to the dessert options (several gluten-free options too!) regrettably.  will need to go back!"}
{"text":"falls firmly into the \"meh\"  This place came out of the gates strong when they moved across the street and had a change in management. I haven't purchased any grocery items, mostly I have stopped in for lunch.  3 out of 3 visits have been a hair below average in my opinion, and if this place were in anywhere but Inglewood (where competition for quick pop-in and out lunch spots is scarce) it wouldn't last...  The concept is great, but they need new staff or more attentive management. Staff seemed confused, and were goofing around while i waited patiently for someone to notice there were customers around. As in, I wait here patiently for chef 1 to finish his story to chef 2 about how wasted he got last night...  Food has potential to be good, but falls flat... I had a salad with smoked salmon on it, the greens were mixed according to my order and were really good, but the smoked salmon was at least a week old and had that \"fridge\" taste things get when they've been sitting in the cooler a little too long... I didn't risk eating much of it (i am not a squeamish eater by the way, I eat from street carts around the world and don't have problems eating bugs or the scary bits from the insides of animals, but  at the same time, why risk it when something tastes funny?)  tried cream of mushroom soup on another visit- taste was good and had lots of wild mushroom bits, but they kept it too hot or something and the cream curdled... rookie mistake I would expect a place of this caliber to avoid....  Third time got a stale \"scone\" -really it was a southern style flakey biscuit with fruit in it, not the same thing as a \"scone\" but that's semantics I suppose, the point is that it was fully stale. Probably it was pretty good when it was fresh...  Three swings and three misses, this place will be off my map for a long time. It's a shame, because inglewood really needs a place like this, but someone on the inside there is dropping the ball and cutting the wrong corners..."}
{"text":"While I found most of the groceries to be really expensive, they were of very high-quality. The cafe was more reasonably priced. They serve breakfast all day, but they close at 5:30 p.m. We had a date bar as an afternoon snack. It was enormous. Almost too big for two people to share. It was made out of dates oatmeal sugar and salt. I think that was it. Very fresh. The young man who helped us was very friendly."}
{"text":"Bite is definitely hit or miss, and for a while last year it was great. We used to go there at least two-three times a week for lunch at one of my jobs. The salads used to be HUGE and fresh and delicious... lately the salads are 6 pieces of lettuce either doused in dressing (in a to-go box - so they are wilted and soggy) or barely dressed. Every now and then if you are lucky the dressing comes on the side for your take-out salad. The inconsistencies are astounding, and the food is not cheap.  I know currently they are under renovations but the quality control should be what is under renovations. The soups are a definite hit or miss some have been great, and others have been inedible.  The customer service is severly lacking, which is also a shame. I ordered a salad to go with a piece of salmon (it took over 20 minutes to get to me) - and brought it with me to my job, only to find the salmon was not cooked at all ... I called the restaurant (no answer) e-mailed (no-response) and messaged on social media, only to finally get a return phone call a WEEK later..... I was offered a replacement salad and a refund as the salad was $15.... the replacement \"salad\" or \"snack\" as I will now call them was 1/4 the size of what they used to be.  We have started going elsewhere for our work lunches because its just too inconsistent....   Go back to being a hit Bite - we miss you"}
{"text":"Great variety of food choices. Laid back atmosphere. A bit difficult to find parking. Polite staff. Excellent value."}
{"text":"Bite Groceteria, finds its way on the Inglewood strip as an importer of fine foods selling wholesale as a high end specialty restaurant supplier. Bite offers the Inglewood and surrounding community coffee, tea, fresh seasonal produce, breads, milk, bulk flours, mustards and all original specialty imported items from Italy, Peru, Hawaii and France.  I decided to take in a sunny day on the patio outside and have the smoked duck breast on whole wheat and a simple latte. The sandwich was around 8 dollars and the latte around 3 but I was greatly disappointed.  The sandwich came out looking like half a sandwich and the latte was in a small cup.  There were no other clients at the Groceteria but I had to return twice inside to get napkins and a stir stick.   The prices were too high for the lunch I was getting and the service didn't even exist.  Perhaps they work better as a gourmet store?  Bite is an appropriate name for their establishment however, as my sandwich was only \"bite-size\""}
{"text":"What a great spot. Ordered a sandwich and soup. Service was fantastic, fast and friendly. Our meal  was delicious and of a generous portion. We followed it with made in house apple pie. You have to try it, fantastic! When we finished we wandered around this little upscale groceteria and purchased a few local products!! Love to support local in whatever city I visit.  Free hour and a half parking and great location in the heart of inglewood."}
{"text":"I'm happy to report that me and the meat freezer at Bite are becoming fast friends. I popped in a few weeks ago to stock up on a little lamb and some farmers sausage, only to discover that Bite is now carrying bison sausages as well, which the young man at the front counter assured me would knock the fleece off my farmers sausages.  At any rate, those farmers sausages kept me happy all week long, but my freezer is now empty. Bison, here we come!  April Underdog Challenge: 7/30"}
{"text":"The new Bite is 'bite-alicious' good. And if you've ever been to Eataly in NYC, it will take you back to those moments strolling goodie-filled isles and the sweet smells of cured meats and candy.   It's a beautiful shop. And I dig good design. This place puts a smile on my face every time I go it. I love the bright airy feel, white walls, interesting decor and fun food-piles here and there.   When I ordered a sandwich, the staff were attentive beyond my belief. In a split moment, right after sitting down, a glass of water and serviette were in front of me. Thank you for giving a damn!  The beautiful flower on my table... just icing on the cake.   My only complaint was the $8 sandwich I could have easily replicated at home. I'm not saying I'm a great sandwich-maker, but when I'm dishing out nearly the same cost of 6 PBR's, I was hoping to be impressed. Far from it. Maybe next time I'll try the pasta bar."}
{"text":"Bite's a nice option when you want to grab a quick and healthy lunch in Inglewood. They remodelled this year and made a sit down, restaurant style on one side and a cafeteria side on the other. It's usually pretty busy (in a pleasant way) so it's also a good opportunity for people watching. I usually get one of the fresh salad's and then something from behind the counter like the salmon cakes, chicken breast or roasted vegetables."}
{"text":"Sometimes when I find a good place to dine that doesn't have long lines, I don't like writing reviews - only because that means there is a possibility that the next time I show up there may be a line..   BITE. There... I said it, Bite Groceteria is a locally owned independent grocer and everyday eatery. Some don't know that there is an eatery inside the grocery store...NOW you know!! They're located in the heart of Inglewood and they just had some renovations done to their dining area and it's AMAZING. Before, they had more of an open concept, you had to go to the till to order and pay then have a seat. Now, there's a wall that makes things a little more intimate as well its more restaurant style where a server comes to you. The décor is great, super sweet, simple, and casual. Booths are comfy.   Their kitchen is open until 6pm on weekdays and I believe they only serve brunch/lunch on the weekends from 9am to 3pm! I usually hit up Bite on the weekends. This past weekend I went and was really impressed with the renovations, I really liked the atmosphere and how they changed things. It was around 12:45pm on a Sunday and there were 3 of us. There was no wait! A server quickly came to attend us and offered us coffee and gave us menus. We were all feeling brunch so two of us went with a breakfast burrito and one went with a classic bacon and eggs with a side of sausage.  The breakfast burrito had scrambled eggs, cheese, spinach, pico del gallo, sour cream and beans wrapped in flour tortilla and came with hash browns. We got the sour cream on the side. The classic bacon and eggs looked really good, came with hash browns, toast and house made jam that changes every other week. We all seemed to enjoy our meals, the burrito was simple but tasty - I love sour cream so I slathered my bites with it and the hash browns had a nice crisp.   Service was good, our lady was really friendly. After we ate and paid, we strolled through the grocer, places like these always have really neat things you can't find in your ordinary grocery store. They have a bakery tucked in the back with fresh made goodies and loaves of bread!   I'd highly recommend stopping by BITE for a bite! Great simple affordable brunch that won't break the bank or if you're in a rush and need a grab and go, they have a ton. Oh, and they have AMAZING cake pops....you're welcome ;)"}
{"text":"Upon Several visits to Bite, let me say this place is: a definite MISS.   My roast beef Sandwich had Unchewable rubbery cheese skin intact which was left on - and which I removed.  That aside, the sandwich wasn't anything to write home about.   I mentioned this (problem)  to a higher up manager and he looked at me dumbfounded. He acknowledged, yes that outer should have been removed but didn't do or say anything else.    Also: The Prices in the grocery section for many items are DOUBLE that of identical Items  sold elsewhere.   For example, a 750 ml San Sellegino sells for $2-$2.25 elsewhere SELLS FOR $4 at Bite.    The same double ratio applies to many other water brands  & grocery items.   A 750ml Perrier is $4.5 a bottle compared to $2.25 most everywhere else.   Service: for the most part: it seems Most of the staff:carry on as if they don't really want to be there.    This review is based on a minimum 3 visits."}
