{"text":"This place is kind of hidden. It's in the same plaza as Shabul and Conbul, and equally if not more invisible if you're driving by. It's a decent restaurant for Korean food.   We came with a large party and ordered a bunch of stuff. The items I got to try were a) Spicy Whelk (conch?) with veggies and noodles ($20) b) Spicy Rice Cake with cheese ($10) c) Don Katsu with cheese ($10) d) Large Dumplings    Everything was good except for the rice cake which I felt was a little small for the price.The conch dish was the most notable. It's meant for sharing and good for 2 people but can split 4 ways as a appetizer as it comes with 4 rolls of noodles. You mix the noodles with the spicy conch veggies and eat.   The large dumplings remind me of Man Du Hyang (now called kkot hal mae). They are much larger than your typical Chinese dumplings.   The don katsu was MASSIVE for $10. A lot of places don't add cheese. The simple addition of cheese makes it super awesome.   Service as usual is a non-factor to me in an Asian restaurant. Nothing bad happened. The server did his job and that's all I really need.   Overall this is yet another fine restaurant for Korean food. Prices are generally on point. Quality is good. The only down side is that the menu selection is shorter than most Korean places. But hey, it's not like you're eating at a buffet so it shouldn't matter. They have all your standard stuff. Recommended!"}
{"text":"Looking for Song Cook's Korean restaurant along Steeles Avenue and found Biwon instead.  Bet this is an authentic Korean restaurant coz everyone here spoke Korean.  There were tofu and dumplings on every table.  We too ordered these two; which seemed to be their signature dishes.  Tofu was firm and rich in soy milk flavor.  It came in warm and it's so fresh!  Could tell it's homemade after the first bite.  It's served with special sauce.  I saw others putting a spoonful of sauce on the tofu and ate them together.  I tried....... but..... just too spicy for me!   The dumplings were huge and they were filled up with meat and veggie.  The best dish was the mung bean pancake.  It was mung bean with ground pork and fried to perfection.   Haven't had this in any Korean places.  It was hot, crispy and I just love mung bean.  Service was excellent!"}
{"text":"We stumbled across Biwon Korean restaurant by chance.   It's nestled towards the back of  the plaza @ 350 Steeles Ave West.   The inside of Biwon Korean restaurant features a nice modern decor. The server was both quick and polite and wait times for food were minimal.  Between my mother and I, we ordered the kimchi stew and 2 portions of stir fried bulgogi, and dumplings. Traditionally in Korean cuisine, each dish comes with several side dishes to compliment it. These include: bean sprouts, seaweed, tofu, and kimchi.   The only con, is the limited size of the menu.   Overall, we enjoyed the food and will definitely be coming back for more!"}
{"text":"3.5 Star  Biwon might be another Korean restaurant in the area.   Family owned and you can see the care in the preparation, use of ingredients and even every little details.  We shared:  MoTofu ($5.99) Fresh tofu with special sauce Dumplings ($7.99) Steamed home made Korean Dumplings Bajrak Kalguksu ($7.99) Noodle soup with Manila Clam  Everything so fresh and made in house, including the tofu and hand cut noodle.  The banchan were all tasty and have this really delicate and clean taste.  Here the crowd is a little older compares to the Yonge and Finch area.   I will be back!"}
