{"text":"Excellent service, decor and food was amazing! We had The rack of ribs and steak! All halal! Must go"}
{"text":"OK for food and price ratio. Not bad for a halal bistro, given the choices of halal bistro places are very limited in the Scarborough area.

We went there for a work lunch to accommodate a halal food critic co-worker :)

Service (food) was slooow !!

Would I personally go back? Nope."}
{"text":"Finally got to check out this place. Came down here with family, party of 6 + 3 kids. We were greeted promptly and our table was setup fairly quickly. Menus and water were set right away as well. We went with the week day special 2 can dine for $39 which is a very good deal. We got an appetizer to share between 2, 2 main course dishes and a dessert to share. For appetizer we got the beef sliders. These were the perfect size and the sliders were cooked just right. We also got the beef brisket poutine - hands down one of the best poutine's we've had!!! For the main course we got to try beef lasagna and lamb papadalla. The lasagna was good and loaded with cheese. Loved the lamb dish as well, never had a lamb pasta dish before so this was real good. To end it all we got the creme brulé, loved the creme brûlé!!!  All in all we'll definitely be coming back here for another visit."}
{"text":"Yesterday me and my wife decided to celebrate her birthday at this restaurant. we made reservation around 5pm and once we arrived we were welcomed by the manager, he was very helpful at the beginning

Food:
I ordered Juicy Lucy burger (17$) 
my wife ordered GRILLED CHICKEN FETTUCCINE and chose steak instead of chicken (27$ dish)

Kids ordered kids menu burger and chicken nuggets

My burger had a huge slap of fried mash potatoes, it was messy and falling apart, I couldn't even hold it without being completely melting down on the plate, so it was a mess...The mash potatoes didn't go well with that burger, I had 10 times better burger which costed me 5$, it was tasteless and a mess, I guess only looked good in the picture (don't ever order that burger). My kid burger tasted better...

My wife dish also was tasteless, the steak was good but for sure it wasn't worth the 27$, we had better Italian dishes  

Service: 
As mentioned above service started amazing but after they got busy with more customers we were completely left alone, my wife mentioned at the beginning that we wanted to order dessert but the manager seems ignored us (they were not short on staff but their staff seems running around doing nothing, they act like they all managers...)  we waited over 20 minutes and then with no help so my wife and kids left, I waited another 10 minutes by my self just to get the bill, I asked some one (not our server) to get me the bill and finally got it 

we felt like they didn't want us there, it was weird

anyway first time and last time for us, we drove from Mississauga for tasteless expensive food with good service at beginning and very bad service at the end

maybe they have better other dishes that we didn't try, but avoid the ones we mentioned above"}
{"text":"The bistro is located In a small plaza close to the highway. Great location.  Minor tidbit: when exiting the plaza you can't make a left turn on Markham. 

The food is good. Not great. 

I got the bacon wrapped scallops. They come four or five in a plate. The scallops are good size and tasty. 

I also ordered a 7oz steak. Here is where things went a bit downhill for me. I ordered it well done. It came as medium rare. I specifically said well done. Didn't bother to complain as I didn't want to wait for another one. Steaks usually take a while. 

Other than that it's a nice small bistro. Decor and furnishings are beautiful. Staff is very friendly too."}
{"text":"Friendly waiters. Design was OK. I had the filet mignon medium rare with butter sauce and it was very good. The chicken wings and brisket poutine were delicious. I will come back here again!"}
{"text":"When I first went to this restaurant, I wrote a great review for them. That being said, my second time there was a horrible experience. After waiting half an hour to be seated (which is fine), we were left on the table for over 25 minutes without any server coming back to ask us if we had any questions about the menu, if we were ready to order, or to even give us glasses for our water. At which point I had to get up to tell the server that we've been waiting for a while and if someone could take our order. I went to the washroom and my friend asked ANOTHER server if they could take our order since the one I said it to did not acknowledge our request.

Finally they took our order. It was taking really long, but we  gave them the benefit of doubt because we liked the food the last time. We decided to wait a bit longer. The thing that frustrated us was that 45 minutes in, not even our drinks came out. No server had came to acknowledge us or apologize for the wait. Our food was no where to be seen. An hour later we finally got out app. It was the roadside sliders. The meat was raw in the middle, it was lacking flavour and it was cold. I think at that point we were really hungry so we ate it anyway, but looking back I can't believe we did. Still no drinks. No server to check on us. It was MORE than an hour later and no entrees were in sight. 

Severely disappointed, we put $15 on the table and left. Our whole experience there felt like us giving them chances to \"wow\" us like last time, but that was hardly the case. In fact the service has always been slow at this restaurant, and I even mentioned in my last review. This time was a whole another level though. 

We won't be going back. It's great that they have high traffic based on hype in social media recently, but they've hardly been able to maintain standards with food and service. The least advice I can give them is to hire more servers so orders can actually be taken, diners can actually be acknowledged, and food can actually be served in a timely manner."}
{"text":"This restaurant is definitely a different kind of halal restaurant.. There are very few formal sit down haha restaurants in the GTA and this definitely is one of them.. The ambiance is nice... It has a wide variety of non alcoholic drinks which are not watered down and are delicious... One of the best in fact I have had in a long while...... We ordered 
1.The deep fried macaroni and cheese for Appetizers.... This was a disappointment as there were really bland and lacked flavor.... They are very filling and come in 6-7 pieces.... Which is a lot between two ppl... So if ur a larger group and wanna try them I'd say go for it.. Otherwise be prepared to take them home.... 
2. for mains we got the stuffed chicken - the sauce it came with was a tomato based sauce... Extremely flavorful and the chicken was not dry....,  my husband got the lamb pasta which was also very flavorful.. The pasta was well cooked and the lamb was well done and not chewy... 
3. For desert we got the Creme Brule... By far one of the best I have had in a very long while.... This was light fluffy and not super sweet... Was a really good ending to our meal.... We also got the dark chocolate cake which was very rich and super chocolaty... Good for the chocolate lovers...."}
{"text":"I came in for a New Years reservation yesterday. It was a Thursday and they had a $38 two person 3-course meal deal but it didn't apply because of their new menu. Suffice it to say that we paid a lot more but our meals left something to be desired. Our two* courses and two drinks came to about double the amount. 

Pina Colada was the best I've ever tasted
Out of romaine lettuce for our Caesar Salad
Tacos were pretty but bland
Stuffed Chicken was tough to chew on (we couldn't finish it)

Black Ox is great for steak lovers and appetizers but we just weren't blown away."}
{"text":"This restarunt has stopped accepting groupon, but continued to sell them days ago. They tell you last minute when they're calling to confirm your reservation. I had to find a new restarunt last minute because of this. Shame on you black ox for screwing over your customers last minute."}
{"text":"Had the wonderful opportunity to dine here the other night with a friend and I must say, it's really nice to have a great facility in Scarborough.  The place had a very casual and warm atmosphere.  Servers were also very hospitable and you can tell that you genuinely love to work here.  This of course includes our server Ahmad.  Service alone receives 5/5 from me.

Piña Colada - If you like piña colada... and getting caught in the rain.. sorry, I couldn't help myself.  But seriously, if you like piña colada, this is a must-have! It was a little bit more on the coconut side, but it was delicious.  I was so torn as I didn't want to fill up on the beverage and I also personally don't usually have a cool drink during my meals or right after my meals.  This time was an exception, though.  I would've asked for a to-go cup if I didn't find that a little too embarrassing, though I wouldn't be surprised if they had catered to my request because their staff is that wonderful.  5/5

Raspberry Mojito - Another delicious beverage that you need to dry especially on a hot summer day/night.  Was a little on the sweet side but it was very refreshing.  5/5

Mango Avocado Salad - If you've read my other reviews, you may have come across the fact that I despise cilantro.  Truth be told, I did try my best to avoid the evil green when I tried this salad and the salad was very tasty and refreshing.  Had a very light vinaigrette, however, I guess it was enough to give your tastebuds a little kick. 4.5/5 

Black Ox Brisket Poutine - This can be found under there apps menu, but with its generous size, you can have this as a meal.  I personally prefer my fries, especially if it's poutine, fresh cut.  However, after seeing the amount of brisket, their cut was a very suitable choice (steakhouse fries).  The gravy was absolutely delicious and when blended with their brisket sauce, it was even better.  Oh and of course, they used cheese curds, which I always stress that is very important when making poutine.  I do wish they added a little more poutine and it was a little more melted rather than having chunks of it. 5/5

[Meathead Platter] - Great platter for meatlovers.  This platter can feed 3-4 people!

Buffalo Wings - Although the buffalo wings were pretty average, the sauce was nice.  Size of the wings were also pretty decent. I'm pretty picky with my wings but I'd still consider ordering these again. 4/5

King Rib - When I saw this, I automatically thought of the Flintstones.  This thing was huge! Meat was very tender, juicy and was nicely coated with their sauce.  Some parts were a little too fatty for my liking but if you like to eat fat, then you'd be in heaven.  5/5

Top Sirloin Steak - I don't eat red meat much these days but when I do, it has to be perfect.  And they always say that  when you order your steak, order it a level below of what you normally would order as most places tend to overcook it.  But when I order medium-rare, I expect it to be medium-rare as the chef/cook should know the difference.  It really all depends on where you go and just by looking at this establishment, I had complete trust in the cook.  The steak was PERFECTION.   Mind you, I would prefer to have a little bit of blood underneath it but considering it's Halal, I very much respect their ways of preparation and it tasted just as good as any other.  It was by far, the best steak I've had in a while, probably since my trip to Argentina which is steak capital of the world.  5/5

Fried Quarter Chicken - I love me some fried chicken and when I saw this platter, I immediately eyed the chicken.  It was fried to a golden brown and the size of the quarter was gigantic! Now, I'm assuming that because of its size, it was fried a little longer than it normally would have because it was pretty dry.  Though the outside was nicely crisp, it had no flavour.  Either the chicken needs to be brined a little longer and/or it needs more seasoning.  As excited as I was, I was a little disappointed with this one. 3/5

Pulled Brisket Baked Potato - I'm personally not a big baked potato fan so this was just pretty meh, to me.  Perhaps if the shredded cheese was melted a little more and there was a little bit more garnishing on top, I would've enjoyed it more.  If I were to choose between this and the poutine, it would be poutine all the way. 2/5

Garlic Mash - I also love me some mash potatoes and this one was also a little disappointing.  Although he garlic butter was delicious, the potato itself was too starchy and gelatinous.  Perhaps it was their choice of potato? Yellow or gold potatoes are the way to go when making mash. 2/5

Triple Chocolate Cheesecake - Fingers crossed, this will be on their menu permanently because it was just so good.  It had more of a mousse texture and it wasn't overly rich. Must-have for chocolate lovers. 5/5

Crème brûlée - A little on the liquidy side but it was still very good.  Caramel was perfectly torched so it wasn't bitter.  4/5"}
{"text":"My fiance and I came here for dinner on a cold Thursday night.

Upon entering, it was a real surprise that the place was absolutely rammed with people, to which the manager had told us was a daily occurrence.

Black Ox was a bit of a bumpy start as we first entered and both the host/hostess were on their cellphones and took them a moment to notice we had come in. A little unprofessional on their part but I let it slide. We were then quickly seated after confirming our reservations.

The first thing I had noticed was the clean and incredibly modern design of the restaurant, it's hard to miss. Has almost a romantic feel to the atmosphere.

We looked through the menu, and a lot of the food looked really great! My fiance had settled for a mango lychee shake, meathead platter and a creme brulee for dessert. I had taken the surf and turf route with the lobster (there's another option with prawns i believe) and the pecan cheesecake, which was not on the initial dessert menu but was provided as an alternative as their original cheesecake was not available. We also ordered their roadside sliders as a shared appetizer. 

Like I said the first beginning stages were a little bumpy as it was a little difficult to flag a waiter down, but after being approached by our waiter he was INCREDIBLY educated on the menu going as far as to describe the origins of their fresh ingredients, the flavours we'll be expecting and was happy to answer any questions and suggestions we had wondered about on the menu. I really should've gotten his name, but he was the most excellent waiter I've experienced in quite a while, it was very refreshing. Even being kind enough to change our seats into booth seats once they became available, which was another plus.

Overall, our food DID take a little while to come out, but it was well worth it! We started with the sliders which my fiance didn't take much appeal to, but I personally thought it was cooked to perfection and the flavours were mild really letting the juices and umami of the beef really shine through. It was a great start! The mango lychee shake had also arrived and my fiance loved it, however it wasn't really tickling my fancy. I think for me personally, it just wasn't sweet enough and a little on the tangy side, furthermore, I couldn't taste any lychee flavour at all!

Then came our entrees, which, just like the starter, did take a while.

Starting with my surf and turf, the lobster was done perfectly or maybe I just hadn't had lobster for a while. But it was juicy, buttery and wholly seasoned. Now hear me out, I'm not really a fan of NY steak but Black Ox had managed to turn a piece of meat I don't take a liking to, into this juicy, delicious piece of food. Right underneath my steak was a creamy and fresh potato mash and underneath that was a grilled and wonderfully seasoned medley of zucchini and carrots which all in all complemented and elevated the lobster and steak even further.

I hadn't really tried any of my fiance's meathead platter, but it sure did look great! From what I recall, he had enjoyed a lot of what was provided (especially the huge beef rib) but didn't find the fried chicken much to his liking. From what I could see, it did look a little on the dry side.

Then came the desserts. This was a huge highlight of the night. I've tried numerous creme brulees in various restaurants, but none of them could hold a candle to Black Ox's creme brulee. I don't even know how to describe it in words to give it enough justice to how great it was. A signature creme brulee is topped with that crispy caramelized sugar on top, but what took the cake was Black Ox's recipe for the custard underneath. It was so incredibly light and at the perfect sweetness to the point where it still let that sugar crust not lose focus on the whole dish itself. When speaking to the manager in charge about the creme brulee, he had spoken very highly of it and obviously took pride in their procedure and recipe of their creme brulee, which was very invigorating. My fiance and I loved it so much, we for sure are coming back for a dessert round of just creme brulee to order up!

I had then wanted the lemon zest cheesecake, which I was told by our server was unavailable (or out of stock i think), but did offer many other cheesecake options, so I went for the butter pecan. The flavours were great, THOUGH, it was a little on the extremely sweet side, still great though.

With our tummies full and fabulously satisfied with the great desserts, my whole take away from the Black Ox experience was mainly a positive one. Like I had mentioned earlier, there were a few bumps in the road, which if smoothed out could've been given a 5 star rating. Nevertheless, Black Ox is a place I would highly suggest visiting if you are looking for a great experience with knowledgeable staff who speak highly of the food they are administering to you, which in confidence I can say you don't get that a lot at many restaurants."}
{"text":"Let's just get this out of the way now- they don't serve alcohol here. 

OK that being said, did you see what we ordered??? Meet lovers rejoice! We got the Meat Head platter for $45 and that was shared between 2 grown people.
 I say this because it was massive and more than enough for us! I ordered green tea to help all the protein goodness go down. It was all delicious! A variety of Halal meat goodness!

I really appreciate this joint. Mostly because where else can a Halal bistro joint like this pull this off than in Scarborough??? Yayyy!!

If you're tired of the same old steakhouse franchise fare check this place out! I know I will mos def return!"}
{"text":"Came here for a friend's birthday. The service was great, food was reasonably priced and delicious (although portions were a little big). The setting is very intimate but suitable for large groups or a few people. I would come back again."}
{"text":"This place is great if you've never had a steak before.

I came here with four friends... three of us ordered a steak. all three were supposed to be medium and they came out rare... I had blood and raw meat for dinner. Ruined my appetite.

never again."}
{"text":"Had a great time here at black ox with my husband. They have a romantic and modern ambiance. Beef brisket poutine and lamb ribs were the best! Service was top notch. 

We came here on a Sunday evening, our reservations were made by a 3rd party vendor who invited us here to sample the meal. The place was conveniently located. The plaza was not too busy, had lots of parking. Storefront was easy to find with a bright lit open sign outside. Upon entering we were instantly greeted by the hostess. For some reason our reservation was not in the system but the manager John quickly came over and was still able to accommodate us. The restaurant was indeed packed and they had many reservations even on a Sunday night. 
We got seated in a booth. The booth was a bit small and tight in terms of spacing but it was sufficient for just 2 adults.  They seem to have lots of seating and came accommodate large parties. Around 15-20 tables. 
We got acquainted with our server Chris and he was very friendly and knowledgeable about the menu. He recommended the mango lychee mocktail to me. And it was amazing! We also got to try the raspberry mojito, it lacked flavour to me. My husband enjoyed his pina colada (pineapple juice, coconut cream, nutmeg). The presentation of these drinks were professional! 
We started with the buffalo wing apps, they were really really flavourful. If you enjoy tangy flavours you'd enjoy the wings here.  
Next was the beef brisket poutine which I enjoyed the most! It's quite unique!! The fries were really good! Had amazing and very filling cheese curds. Gravy was excellent. The beef brisket was shredded and was good, but some parts a bit chewy if it was a larger piece. Id recommend the beef brisket to be shredded more for the poutine. 
We then tried their lamb ribs which came in a large wooden block. Presentation amazing again! It came with mash potatoes and steamed vegetables. Both were excellent sides. The lamb was very very good! Fall off the bone! I'd definitely recommend this. 
Lastly we ordered a creme brûlée to share. It came also In a very nice presentation block with dessert decoration. The creme brûlée was good but very thin custard layer.  
In between courses the manager and server always checked in on us to ensure we had everything we needed. They were extra attentive and had cleaned the tables between courses and had even refreshed our side plates. 
We noticed that the servers and hostesses were also very friendly to other tables. Some talked to their server for a long time sharing names etc. The hostesses who seated guests were also very attentive and friendly too asking if it's their first time at the resto, and ensuring guests know where the washrooms are located etc. As well they mention to all guests while they are seated that the restaurant serves non-alcoholic drinks only. They provide great drink suggestions.

Their washrooms are fairly clean and quite modern. There are 2 stalls with doors. 1 larger and has a baby changing table. 

Overall, we had a stellar experience and will definitely come back again!"}
{"text":"I went to this place during Ramadan. They offered free drinks... One of the most tastiest lemonade I ever had! 
There were 8 of us and they brought our food fairly quick except my friends salad took forever and came when we were ready to pay but that was because she ordered it late however it still took a lot of time for a salad... I believe they forgot about it. 
I had asked for veal bacon bits on my steak which they did not add however the manager did apologize. 
The steak was good... I had filet mignon... I enjoyed it however I felt like they could have given more veggies. They were very hard... Could have steamed them properly. Mashed potatoes were yummy. 
Set up was good
It was a clean place
They need to put some light in the washroom because I had to keep my stall door slightly open which was really annoying and unacceptable. So hopefully they can add some light to the restroom... ATLEAST the ladies not sure about the men
Might go back one day."}
{"text":"So I made the mistake of coming here again for my husband's birthday...
I saw they had lots of reviews online (through inviting Elite Yelp members for a free meal and asking them to review it, I'm sure for this day they made sure they were on point but my review is for a typical Saturday night) and I saw they had something cool called a \"Meat Head Platter\", here's what went down
-made a reservation still had to wait 10 minutes for them to set-up a table
-received plates for my apps and the plates had small pieces of melted cheese on it! I called the waitress and before I even said anything she said \"new plates?\" and I said \"yes please\", she then said \"oh I triple checked these\" when i showed her the cheese she laughed hysterically and said \"my bad\", I did not find dirty dishes funny...
-raspberry mojito ($6.50) was good but definitely not worth the $ and it comes in such a small glass
-got the app platter ($29), burgers were crazy dry, wings had literally drops of sauce on it and were also dry, the was no filling in the jalapeno poppers, there was some melted cheese on the board so I'm guessing it spilled out?, the artichoke dip had melted cheese on top and the inside of the dip was ice cold, the mac and cheese bites were crunchy but the macaroni inside had no flavour or cheese
-got the meat head platter ($45), had the same dry wings on it, coleslaw was cut very large and it was super hard to eat, I asked for my steak well done (I do this at Kara Mia and it is super juicy) and it tasted like a towel it was so chewy hard and dry, they charged me an extra $1 for a melted butter sauce which I was okay with but then it was only filled about 1/4 of the container and the butter was not melted (when i asked for more sauce for the wings which was free it was filled to the top) , pulled brisket baked potato was pretty good as the potato had green onions and cheese in it however the mashed potatoe that came with the fried quarter chicken tasted like Costco instant mash with no salt/pepper (it was literally all white), the only thing was actually worth it was the beef rib which was excellent and what I would expect from a \"Modern Halal\" restaurant like this, I didn't even try the fried chicken cause I was so disappointed
-In the middle of our meal cause everything was so dry I ordered a coke, when were ready to pay I noticed we didn't get the coke then suddenly a different waiter came with it and I said I didn't want it cause we were finished eating, he looked upset and said \"oh well it took long because I ran out of coke and I ran to Shoppers Drug Mart\" like WHAT??!! Why would he even tell me that, how do you run out of coke, and Black Ox is supposed to be some high class place, no high class restaurant would tell their customer I ran to shoppers to get you a coke, that was just ridiculous
-Overall the meal for 2 costed me $100, if I went to Affy's my 2 mains, mocktail and dessert (no apps cause portions are larger) would have costed me $50 
-I think they focus to much on the ambiance (fancy lights/background music) and food presentation rather than quality of food for cost, customer service and basic functions (having drinks stocked, having clean dishes), I would rather eat something that tastes good in a clean plate that eat something horrible on some fancy wooden plank
-I can think of 10 alternatives of the top of my head in the GTA and downtown TO: Affy's, Crave, Kara Mia, Los Chicos, Restoran Malaysia, Nando's, Tandoori Time, Watan Kabob, Burger Factory, Cluck Clucks"}
{"text":"Pros: 
Excellent and friendly service 
Booking was very easy
Server gave good recommendations and knew the menu
Friend nearly lost her sunglasses and he ran out saved her from losing them
Nice interior and clean washrooms
Cons:
The food
It was sad to see such a nice cuts of steak underappreciated with lack of seasoning and flavor 
The steak was cooked just how I like it but had no flavour what so ever
The same could be said for my friends chicken
Presentation of the food was very nice but if there's no flavor there is no point

If this place steps up their flavor game, I could easily give this place a 5 star. It's nice to see halal option that has actually put in some effort to the interior and dining experience.

I'll try this place after a few month's let's see what happens."}
{"text":"Disappointed. 2nd time back after having some of best food just 7 months ago. 

Really disappointed this time around. They actualy were out of chicken wings which my wife and i were going there for. They no longer carry a bunch of gournet burgers like the juicy lucy the had. My wife ordered chicken and waffles, 10 mins later we were told a chef in the kitchen would soon be let go hes been messing up alot and the waffles could not be made. I order a filet mignon and it came out pretty cool, fries were under cooked and cold, overall disappointment with $100 being spent. Maybe it was bad luch but we wont be going back to find out

Felt bad for the server who was really nice, but seemed to be put in a tough situation."}
{"text":"Took our family to dinner for mother's day. Awesome food! Pretty restaurant, has a variety of innovative and creative menu. The service was kind of unorganized because there were so many people."}
{"text":"Recently just visited black ox. Ordered the roasted vegetable stuffed chicken breast and beef lasagna. Beef lasagna was served with a red/white sauce which was delicious. Chicken breast was so nice and tender, not at all dry. On the side we got a strawberry daiquiri customized in Splenda. That was pretty delicious. Over all great experience! Loved the creme brûlée!! 

Previously we tried Newyork striploin steak which was tender & well marinated. Went there for my birthday dinner and over all it was fantastic. The ambience was pretty decent."}
{"text":"Do Not Go there if you don't have minimum of 3 hours waiting for food. there is no service, and the manager don't even care if you are paying for the dinner or whatsoever.  there were 6-7 staff, but only 1 person is working for the entire restaurant.  If you've ever played the game called \"Diner Dash\", you will see how many angry customers are waiting to be served. This restaurant need Gordon Ramsey!!!"}
{"text":"Full disclosure: I was invited here for a media night. Unfortunately, I was unable to go, but the organizer later treated me to lunch. For my lunch, I got to sample a 5 course meal, some of which are going to be implemented into the existing menu soon. I am in no way being sponsored for this review. But I would like you to know that I was invited to try this place out.

Okay, so started off with some mocktails (non-alcoholic drinks only in this establishment) and Mac and Cheese bites that came with a sriracha mayo. SO isn't big on Mac and Cheese. I love it, esp when they come in bite size. This one I found to be okay, but I've definitely had better. And I found that the sauce was not spicy at all. I really hope they kick up the spice for the sauce. This dish isn't on the menu just yet.

Then we had  the Bacon wrapped Scallops. So if you read my reviews, I never eat pork (for religious reasons). This restaurant serves halal meat. Which is excellent, because I'm always looking for places to take my parents to. Anyway, the bacon here? It's veal bacon, so not pork. This dish, was hands down, our favourite of the entire meal. It was SO FREAKING GOOD. The mushroom salad that went with it was delicious too! If you go here, I definitely suggest getting this.

Next course was their Black Ox Brisket Poutine. It's made with real cheese curds. I loved the beef brisket, but found the poutine to be too large. Of course, we'd already had 2 courses, but still. Maybe if it had more meat to it, I would have pushed myself to eat more of it. I have to say, this place puts emphasis on their meat, and I enjoyed the cook of the meat very much.

We had vegetarian personal pan pizzas after that. This is another item not on their current menu. The GM came out to tell us that they were really excited to add this as there are not as menu vegetarian friendly dishes on the current menu. The dough was made in house. The presentation was fun, and I liked that the pizzas reminded me of making pizza at home with my family. I will say, the pizzas need more pineapples (they had a couple scattered about) and that the toppings need to be more evenly distributed. I found that most of my toppings were close to the crust. It is a fairly thin pizza and could be a good vegetarian entree if those changes are made.

Lastly, we got to taste two dessert dishes. We had the Creme Brûlée which was absolutely delicious. Loved it. We literally cleaned the dish. The other one, I don't believe is on the current menu. It was a Chocolate Torte cake. HOLY COW. SO MUCH CHOCOLATE. I could only have two slivers of it. My SO tried to eat more, but we could not finish more than half. It's really too rich and decadent. Literally was like eating solid chocolate. The taste was good, but the amount was way too much.

It was really empty when we went for lunch on Friday. We did go for a late lunch time though, so that could be it. The service was beyond excellent, but I should remind you, I was being hosted for lunch. I cannot tell if the service will be excellent all the time. I really loved the decor, the fact that they have created an upscale dining experience while keeping the locals in mind and serving halal meat. I think that's really important because I don't have a lot of fancier restaurant options when taking family out. The location is a bit far, if you don't live in Scarborough or drive, but I think this place is worth checking out. It's a lovely place for date night or girls night. 

I will definitely be visiting again though! I'm interested in trying more of their meat entrees hehe =)"}
{"text":"This was my very first time at a halal steakhouse and it was not bad at all. I dragged my friend here with an invitation and we both didn't know what to expect as the owner told us that we will be served a selection of their customer favourites that included mocktails, appetizers, entrées, and desserts. A menu was still provided for reference, but it would be best if there was actually a menu so that we would know what our next dish will be. Anyhow, we sat back and relaxed as they roll out their customer favorites.

 

The first thing brought to us were these virgin drinks to freshen up from the hot summer day. I loved the presentation of these drinks, especially the gradation of the Raspberry Mojito - from clear to red to deep ruby red.



The Raspberry Mojito was made with raspberry, mint leaves, lime, and soda water. It was very refreshing and rejuvenating, especially on this blazing hot day.



On the other hand, the Pina Colada was rich and smooth. Garnished with a slice of pineapple and crushed nutmeg, the ratio of the pineapple juice and coconut cream was perfect, which made this Pina Colada exceptionally good.



Black Ox Bistro Drink Menu



Next up was the Shareable Platter, which consisted of five different appetizers offered by B.O.B. - Buffalo Wings, Deep-Fried Mac N' Cheese Bites, Roadside Sliders, Beef Bacon Wrapped Jalapeño Poppers, and Spinach Artichoke Dip with Flat Bread.

The Spinach Artichoke Dip with Flat Bread was by far my favourite. The dip was very cheesy, and the spinach and artichoke flavours were very distinct. The baked Parmesan flat bread took this dish to a whole new level.



I was a little disappointed with these mini burgers. The patty was not juicy at all and did not have much taste to it. Plus, there was no sauce in the burger, which made it extremely dry to the mouth.



To my surprise, the Jalapeño Poppers were not hot at all. They were de-seeded and stuffed with cheddar cheese and wrapped with beef bacon. Nothing can go wrong with that.



The buffalo wings were average. The skin was crispy, which I did not expect as most of the time the chicken skin turns soggy before the dish is served. As per the menu, the wings were supposed to be served with a Blue Cheese dip, which did not come with ours. Now that I look at this picture, it seems weird to have carrot and celery sticks without a dip.



The Mac N' Cheese Bites were bland, although the Sriracha Herb Dip adds a little flavour to them. This was my least favourite dish of the night.



Next up was the Meathead Platter, which immediately put us in awe the moment we saw it. So much food!! We couldn't wait to dig it.

 

The BrazillIan Churrasquiera Wings were tastier than the buffalo wings. They were baked and tossed in a house sauce. I wouldn't mind having these wings for the rest of the night.

The Top Sirloin Steak was perfectly cooked. It was so tender that half melted in my mouth.

The Gargantuan King Rib was the highlight of the night and was the best rib I have ever had. The server told us that it was marinated for at least 12 hours the day before. The meat was extremely tender and smooth, and was quite filling as well. The coleslaw was a great compliment to the rib as it freshen up your palette.

 

The chicken fingers were crispy, however it was very dry and not juicy enough. The mash potato tasted a little weird to me because it was kind of sweet, which was different from the usual savoury mash potato that I am used to. 

The Brisket Potato was very similar to the Mashed Potato Topped with Chicken Fingers. The brisket was dry as well, but this potato tasted better with cheddar cheese.

 

Lastly, we had Creme Brulee and New York Cheesecake as our desserts. They did an amazing job on the Creme Brulee. There was a thin layer of hard caramel on top which was not too sweet. The custard was very smooth and rich. I could have this everyday for dessert =) 



I'm usually not a big fan of New York Cheesecake because I find them too rich and mostly just cream cheese. B.O.B. did a good job on balancing that by incorporating pomegranate coulis into the mix. The sourness of the pomergrante made the cheesecake less filling. We ended up finishing both desserts and left with a full stomach.



 Black Ox Bistro Dessert Menu



The venue was modern and comfortable. They even have booths on the side for a more private dinning experience. Also, a large party room was located on the left side of the restaurant, which can fit more than 100 people. I would definitely come back for more dishes. B.O.B. is a great restaurant. It was my pleasure to be invited to try out some of their new dishes on the menu.

That's it guys!
Janet"}
{"text":"Came here because I saw it on groupon and thought it was good from a fellow yelper, so we decided to give this place a try. 

Everything was mediocre to good, but not excellent. Beef wrapped scallops are a must and very unique.

The rib was well good, beef Wellington is good if you like phyllo type pastry dishes. 

Creme brûlée was watery, but as custardy as it should be but it didn't lack flavour because of it. Chocolate was good but not something I'd come back to. 

Everything was pretty good, I'd probably come back again if I had the groupon because only then it would be worth the trip and price"}
{"text":"This is a good food place. We tried the appetizer plate. All of us speak highly of the sliders. Very recommend! Then we tried the top sirloin and chef cut. The portion is very big with 2 sides. We could not finish the food. That is why I saw many customers have to do boxes. However, prepare well to spend more than 30 mins to wait for the food. And, the restroom is very dirty."}
{"text":"At first sight, looking from the outside you would have never guessed there was a restaurant like this but once we walked in, we were surprised to see a good amount of people sitting down enjoying themselves. The ambience was great and the semi dark lighting and the cool woodie-brick colors set the mood.  The hostesses were kind and greeted us when we walked in. He first apologised for the wait but it was not a problem since we had just literally walked in 2 minutes ago.  They couldn't find our names in the reservations but assured us that it might have been a mispell or mistake on the reservation. Anyway, we waited another 2 minutes and finally they seated us in a cozy corner.  Daniel the manager came and said hello while explaining the menu as we sat down. She informed us of a great tasting which they highly recommended and we proceeded to look through the menu while waiting for our drinks.  Since the place does not serve alcohol, they still recommended 2 excellent beverages which was the virgin pina colada and the raspberry mojito.

What we ordered:

Shareable platter (Mac n cheese bites, 1/2 lb buffalo wings, roadslide sliders, spinach dip, beef bacon wrapped jalapeno poppers)
-  This was an excellent selection of shareables for 4 people. I guess if you eat a lot this could also be a good meal all on its own. It was so filling and had a good amount of little bites for tasting. And it was presented very well on a large wooden board. Very rustic and I definitely enjoyed it. 

The Meathead platter 
-  Oh Boy!! When this came out, the presentation was just perfect. It was a beautiful wooden board of different selections of meat cooked just right. I don't think I need to describe this order, its best to present it to you as you read this through the photos. (Please view photos attached which I took of our order).  It was massive and for my husband and I, it was very hard to finish that we had to pack it home. Everything was delicious ... but one word of advice, the chicken could use a little bit more flavor. Other then that, it was still very tasty. So thank you for the recommendation. 

Dessert - Creme Brulee
-  This tasty finishing was just perfect for the end. It had a good balance, though thin of the filling, I think it was the right amount. You don't want american sizes where you over indulge anyway.  

Overall, our experience here was excellent. I don't have anything negative to say about this restaurant as everyone was extremely attentive, our server Roula who got us everything we needed and explained every dish was great. She even packed our Cheese cake to-go so my husband and I can enjoy it later this evening as we were too full to finish 2 desserts. 

I would come back here again ... since Daniel told us there was a Tomahawk made-to-order on the menu for only $69.  It requires a 24hr order in advance since they would need to prepare it. I look forward to bringing my other friends who are bigger foodies then I am to try this place out. 

Cheers and thank you!!
MICHELLE"}
{"text":"A classy halal steakhouse with friendly staff. Finally a place where I can try steak! I tried their beef Wellington and it was delicious. I would definitely go here again."}
{"text":"I truly wanted to like this place. I mean halal and steaks: always a good combo. I came in with high expectations given the reviews. Upon entering, we were warmly greeted and there was a great ambience although it was empty. I immediately noticed homemade fly trap cups behind the host. Not what I wanted to see before eating- but still remained positive. We took our choice of tables and among 6 of us- we ordered an array of meals. We ordered the shareable platter for appetizers. It was a huge disappointment. Everything was so bland that at one point I had no idea what I was eating. The sliders were the biggest let down as they were so dry and tasteless. The buffalo wings were mostly pink on the inside so for fear of salmonella-can't review those. The brisket poutine wasn't bad - generous portion of meat-and perhaps the best thing we ordered.
On to what's supposed to be the star of the meal: my filet mignon. I ordered it medium- and it was cooked perfectly, however the filet itself was so dry and bland that it just felt like \"game over\". There will be no more potential saves of the meal. I expected the melt in your mouth filet, and instead I got a filet that was a bit tough with barely any seasoning and very skimpy on the sauce.
What probably confused me the most were all the reviews that hyped this place up for me. Perhaps I came on a bad day? Or maybe halal steaks have such low standards that the fact it's halal is enough to qualify it as \"on point\" as one reviewer claims.
I hope something changes in this restaurant as it does have potential and I hope it succeeds and would LOVE to see halal restaurants as this thriving. But truthfully, I can't justify the prices with the quality of food I had."}
{"text":"Very nice.
Non alcoholic restaurant.  I like that.
Had the beef Wellington.  Nicely done. Nice waiter. Tasty food. Needs more atmosphere."}
{"text":"If you haven't visited in the last few months you need to come by and check them out again. With a new chef, revamped menu and plans for expansion of their dining room this cozy little restaurant is evolving. 

Full disclaimer - I was invited to sample items off of their recently revamped menu. I'm not related to nor friends with anyone at this establishment nor am I getting paid for my review so here it is...

MOCKTAILS non-alcolholic
Pina Colada - a delicious dessert drink sprinkled with a little nutmeg. Perfect to finish off your meal with.
Raspberry Mojito - very sweet but delicious once we diluted it. Liked the fizz.

SHAREABLE PLATTER 
Mac n' cheese bites - they're breaded and deep fried served with a delicious sriracha herb sauce (I would use this sauce with the other appetizers). Needs more cheese, bland but very filling.
1/2 lb buffalo wings - baked not saucy served with blue cheese dip. Delicious spices with a crispy skin!
Roadslide sliders - cooked well done, very tasty with fresh toppings.
Spinach artichoke dip - served with flat bread triangles. Very cheesey!!!!!! Yum!
Beef bacon wrapped jalapeno poppers - filled with cheese served with a raspberry sauce. Deseeded so not spicy but greasy.

MEATHEAD PLATTER 
1/2 kg King rib - fatty, juicy and tender, actually tastes like ox.
10 oz Top Sirloin steak - seasoned with salt, has a good sear and crust. Juicy, delicious and so tender you can cut it with a butter knife.
1/2 lb buffalo wings - very saucy and taste heavily of ketchup
Fried quarter chicken - crispy but a little bland and dry, came with a tasty side of garlic mashed potato.
Pulled brisket baked potato - very sweet, taste like they used bourbon in the sauce. Since they're Halal, they don't use alcohol in anything. 

DESSERTS
Creme Brulee - Delicious but the custard was the consistency of soft pudding.
New York Cheesecake with pomegranate coulis - sour and taste mostly like chunks of cream cheese.

Danielle (hostess/waitress/bar tender/manager for the lunch crowd of 3 tables) did a wonderful job. We were seated and served drinks quickly, the appetizers followed soon after and the entrees arrived right after we finished our appetizers (HINT- they don't serve bread or complimentary appetizers to fill the gap between ordering and receiving your food. Do yourself a favor, order some drinks and appetizers, relax and enjoy your company while you're waiting because this isn't a fast food joint).

If you want a good experience eating out then you must do the research. You should read Yelp reviews and tips of Yelpers who have similar tastes as you, look at the photos and read the menu to see what appeals to you, and check their Yelp and Groupon offers to get your money's worth.

Definitely returning to try more of their menu."}
{"text":"I dont have time to write big reviews, this place is a hit or a miss, from the service I got.  
The customer service is great, wait staff is really good, they kept checking on us, but not hovering over us. Everything was brought in timely manner. 

We were party of 6 adults, and 4 kids, ordered five kids meals, 7 entrees 2 appetizers, bottle of bubbly, 5 specialty drinks, 2 sodas. Kids meal really are for under 5, piece of meat they got was 40% fat.  I am not going to say whats not good, since its a steak place, so it depends on how u like your steak, must try ribs, salmon, and rib eye. Kids burger did have a slight meat smell to that my son didn't care for, all in all, bill including tip was around $420. CAD"}
{"text":"Hidden gem in Markham. Great small social place, and great variety. I had tried the Mac and cheese bites and the meat platter. Huge portion for 2 people however the food was delicious. I would recommend the meat platter.it has a bit of everything: bbq chicken wings, drum sticks, steak, fall off the bone rib, mash potatoes and more. Seasoned to perfection for a decent price. The only down fall is that it does not serve alcohol as it serves halal meat."}
{"text":"Not a bad place.

Great novel idea for a halal steakhouse and the decor is also very well done.

Unfortunately the beef ribs with korean short rub sauce was a fail.

I like both separately but not a fan of the combo.

The other party was not a fan either of his meal and while I do suggest still trying this place out if HMA approved is a priority it barely got the three stars I gave it."}
{"text":"I've never given a $30 tip for a 2 person complimentary meal before, so this is a first for me.

Like a couple other elites who have already posted reviews, I was invited to try Black Ox's new menu. I was quite blown away.

The standard offering they've given us is a pina colada, a raspberry mojito, a shareable appetizer platter, a meathead platter, a strawberry cheesecake, and a creme brulee. My brother and I wanted something slightly different, so we ended up getting a pina colada, a mango and lychee shake, a shareable appetizer platter with buffalo wings removed and cajun shrimp added on, a meathead platter with brisket baked potato removed and brisket poutine added on, a creme brulee, and a pistachio cheesecake. Danielle was very accommodating of all of our substitutions.

The mango and lychee shake was not bad, but the pina colada was absolutely perfect. I'm a girly drink kind of person, and I don't mind that these were mocktails. The pina colada wasn't very large, but it didn't need to be. It was just rich enough without being overbearing, and the flavors were on point. For $6.50 on the menu, I wouldn't mind buying one.

The appetizer platter:

Spinach and artichoke dip - pretty good, but not as outstanding as the rest. Liked the flat breads.

Mac and cheese bites - these aren't bites. They're at least two to three bites. Crispy on the outside, and surprisingly light on the inside. I wouldn't mind having an entree of just these.

Jalepeno poppers - the raspberry sauce on top makes this pop.

Sliders - was worried these would be dry. Nope. Super juicy. Actually dripped onto the table. Best slider I've had in my entire life.

Cajun shrimp - not sure how much it would cost to actually substitute this. Ridiculously good though. Thin layer of batter encasing huge, juicy shrimp. The proof is in the picture.

The meathead platter:

Buffalo wings - not a fan of buffalo sauce, but this was surprisingly good for a buffalo wing. I wish they had more wing sauce options, but I'll survive. Crispy wing. Juicy wing.

Fried chicken with mashed potatoes - mashed potatoes were good. Fried chicken was crispy. Drumstick was a tad drier than I'd like, but that might be because we ate it a tad later than we had the other meats.

Coleslaw - yeah. That. Curried, perhaps? Creamy. Not tangy enough to offset the oils from the meats. Black Ox has been informed though. We'll see what happens.

Brisket poutine - real cheese curds. Slightly sweet gravy. Fries were a tad thicker than I'd like, but I understand. Steakhouse fries. Good stuff though. 

Steak - asked for medium rare/rare and got just that. Steak was super tender and juicy. Could use a tad more salt on the steak itself, but the peppercorn sauce served on the side fixed that quite well.

KING RIB - huge hunk of beef rib on big bone. Short rib. Makes me feel like a caveman. LOL. The meat was incredibly juicy and tender and delicious and juicy and um...juicy. Yeah. Juicy. There's a pic to prove that one too. The juice was visible in every bite. Literally melt in your mouth. Mmmm. Can I just have another one right now? You know your meat is tender if every time you so much as put your cup down, your meat jiggles. My favorite item of the night, bar none. So satisfying.

Dessert:

Pistachio cheesecake - slightly sweeter than I'd like, but I'm Chinese. I don't usually do dessert. The berries helped. So did the pistachios. Large piece for $7.50.

Creme brulee - thin layer of sugar. Crispy, not crunchy. Huzzah. Custard could have been a tad thicker, but super tasty. Berries also helped with the sweetness here. Also a good portion for $7.50.

Final thoughts:

We tipped $30 because we brought home almost half of everything they served us. In other words, the app platter and the meathead platter together are almost four people's worth of food. Totally worth it. Favorites of the night: pina colada, cajun shrimp, and king rib. This review might have been for a complimentary meal, but I'm already planning my next meal at Black Ox. Until then, I'm going to think of the food coma I was in after eating this meal.

Black Ox, your king rib and I will meet again soon."}
{"text":"I was recently invited to review the Black Ox Bistro in Scarborough, a modern steakhouse that is also Halal.  This was a fun and interesting experience with a restaurant that is catering to two different target markets, mainstream and Halal. Their biggest challenge is that they can't serve alcohol, which is where this review begins...

Because they don't serve alcohol, they worked very hard on developing and creating 'mocktails' that look and taste like the real thing.  Tried both the Raspberry Mojito and the Pina Colada.  Both were excellent!

We then tried the brisket poutine and the beef bacon wrapped jalapeño poppers.  Loved the poutine, best I'd ever had with a great sauce and covered in brisket.  The brisket itself was a little tough, but the poutine was still excellent.  The poppers were visually stunning, but not as enjoyable.  The beef bacon wrapped around the poppers were very good, but the poppers themselves were served more on the raw side.  I prefer the more traditional poppers that are fully cooked and breaded.

The main course was visually spectacular, massive and meat lovers dream come true.  Called the Meathead Platter, the meal for two (or one for some people) includes 1/2 kg beef rib (no pork on the menu), 10oz Sirloin steak, buffalo wings, fried quarter chicken with garlic mash, pulled brisket baked potato and coleslaw.  Although I prefer fried chicken wings, these baked wings were still very good, good size wings and buffalo sauce.  The fried chicken was huge, meat was juicy, but the coating lacked flavor.  I prefer the more traditional breaded and spiced fried chicken.  The garlic mash with the chicken was very good.  Beef ribs were also very good, tender and fall off the bone.  The steak unfortunately was over cooked.  If I were to have this platter again I would order the steak medium.  The baked potato and coleslaw were both very good.  While we were eating the platter they also let us try a homemade hot sauce they use for their Black Ox Burger.  It was VERY hot, and would be fantastic on a burger.  Overall an impressive platter, huge portions and great presentation.

We tried two deserts, a classic creme brûlée and a tiramisu which was a brand new item on the menu.  The creme brûlée was excellent, loved it!  Again this was interesting as an Halal establishment can't use vanilla, and yet you would never know the brûlée didn't have it in the recipe.  We had a brief conversation with the restaurant manager about how the chef works hard to research, develop and create recipes that will satisfy both a mainstream and Halal customer base, very impressive.

One last thing to note is the great menu.  Even though it is a steakhouse, it has an impressive amount of fun and varied foods to try like a Philly Cheesesteak, a number of different burgers, great appetizers, pastas, fish, chicken and more.  

Overall this was a fun experience and a must try for anyone that is looking for high quality food, big portions, great service and/or also requires Halal."}
{"text":"Average steak, under seasoned dry pasta. Only reason for 2 star is the crème brule. The other chocolate dessert is too dense...."}
{"text":"This is probably the best halal restaurant I've been to. The service was great- our server was very kind and knowledgable about the menu and gave excellent recommendations. The decor and ambiance is also very cozy and classy. I went with 3 other people. We had the chicken wings and beef brisket pouting to start with. Chicken wings were good but oh my god the poutine... I'm not a big fan of poutine but this was amazing and the beef was soo tender and flavourful. I had a steak with a side of mashed potatoes and vegetables. The mashed potatoes were decent the vegetables were too. My friend also ordered a side of vegetables and only got bell peppers. Two of my friends also had steaks- ribeye and filet mignon also good and th other had the rack of ribs. To be honest I would not recommend the ribs as it was quite heavy on the sauce and more bone than meat. We also ordered mocktails- strawberry daiquiri which I did not try, raspberry mojito which was very good and a piña colada that was not quite to my liking but my friend did like it. Also had the creme brûlée for dessert and a few of the cheesecakes- berry and pistachio all were very delicious but the cheesecakes did not have a crust which I did miss. Overall a great experience and hope to return soon to try some of their other menu items"}
{"text":"It would appear that I am having a relationship with Black ox with all of my review updates lol

I was invited by the owner of this restaurant to give them another chance and get everything right. And they did just that, they got everything right this time. It was a busy day and we were looked after promptly. The food was as great as always (the mojito tasted better).

Seeing that their service has improved and they are actually looking after customers that are somewhat dissatisfied, which is the best they can do. This has earned them a unique place of an upscale halal steakhouse which I don't think is paralleled by anybody in Toronto at least."}
{"text":"I made a reservation on line, was greeted by the manager and he was unable to find reservation for  few minutes (restaurant was nearly empty so reservation was not necessary). Was seated as close to restrooms as possible. Waitress was not properly trained she could not answer any questions we asked about menu (5 questions out of 5) and needed to walk away five times to secure information (this was not inspiring any faith in the service). We ordered two scallop apps both where under seasoned and steamed instead of seared so the texture was not pleasant and the flavour was bland. Ordered two stakes both cooked reasonably competently,  but under seasoned again, we had to request salt be brought to table.this was a trend in the dining room as I overheard a table say their food was also \"bland\" and another table ask for salt to be brought to them. I also ordered the five dollar addition of mushrooms they came in the corner of my plate and the amount and quality where not worth the price. My wife had a seven ounce steak and was mostly fat (imo a small steak should be trimmed so as to give people the opportunity to have all of it) and her choice of side was the vegetables and this ended up being a plate full of carrots and a bit of zucchini.  So was the service and food worth the 100 dollar tab?  No,  not at all, and the overall four star rating is a mystery to me, yelp you have let me down on this one."}
{"text":"We were greeted and promptly seated by our waiter. At first glance from the outside it didn't seem like much but when we entered, the restaurant had nice decor and a more upscale feel to it which was nice considering its location on a strip plaza. 

The first thing to note is that they do not serve alcoholic beverages. For most it would be a deal breaker, but luckily we aren't big drinkers. We had the raspberry mojito and a mango lychee smoothie. They were both very good and different, with the mojito being spritzy and the smoothie was refreshing and fruity. Really good for mocktails

We were then served an appetizer platter for two which was nicely presented on a wood board. We enjoyed all appetizers and this was actually quite filling. I personally enjoyed the sliders and jalapeño poppers the most and my dining partner enjoyed the dip and wings. After this we were stuffed, but we still had our main course on its way.

Our main course was the meat platter again served on a wood board with various meats but the one that caught our attention was the massive beef rib - it was delicious and perfectly cooked. The steak on the platter was also a highlight, we had ordered it medium rare and it came moist and soft! 

Overall I would visit Black Ox again however due to the size of the portions I'd only order one platter to share between two.  Great customer service and I loved the staff's knowledge on the items on the menu."}
{"text":"Had a very pleasant experience at the restaurant. 

The staff was quick to seat us. They were extremely polite and professional. The appetizer came within 15 minutes of ordering. The main course came within 10 minutes after finishing the appetizer. The bill came promptly after the meal. These guys are not out to waste your time!!

Now onto the food. It was delicious!! The scallops with chicken bacon as an absolute must try. It was properly cooked and very aromatic. My chicken breast sandwich was well seasoned and prepared. The chicken breast stuffed with vegetable was also quite tasty! 

The décor is extravagant!! Very edgy and modern. The atmosphere is quite pleasant...did I mention the servers were amazing? LOL!!

All in all, this place is a definite hit so far. I only hope they can keep up with the demand of their growing clientelle. Keep up the good work people!!"}
{"text":"The staff is friendly and give good recommendation and there food taste good and there desert was great.The service of food and service is great."}
{"text":"@BLACKOXBISTRO #PREMIUMHALAL #GOURMETHALAL #YELPGTA

I am glad I gave this place another shot. I was asked to come back to this restaurant for a meal and as an incentive, their PR team threw in a complimentary sampler palette. My friend and I got to Black Ox Bistro super hungry and left super full. Truth be told, I probably got some special treatment, but the service was top notch!

I ordered the Pina Colada mocktail as soon as I was seated. My friend ordered himself a Raspberry Mojito. I'll tell you this. The Pina Colada is WAY better. Although, he did love his drink. The Black Ox menu looks really impressive and I was surprised to see some very reasonable prices. Steaks were about $30-$40 for 10-12oz. 

Now, I wish I had ordered a meal right away. But instead, we wanted to try the sampler first. We got 3 mini tacos - chicken, lamb and fish, mac and cheese bites, and a deep dish personal vegetarian pizza to try. The fish taco was unreal in a good way! The lamb had some heat to it and the chicken taco was pretty good. The mac and cheese bites were much better this time around - a lot more flavour! Very tasty with the chipotle aioli. 

I wasn't a fan of the deep dish vegetarian pizza due to personal preferences; don't like vegetarian pizza. My friend enjoyed it. I really enjoyed the crust. It's made from scratch in the kitchen! 

Anyway, the above filled us up. Like we had no more appetite. I suspect it was the Pina Colada for me, and the entire deep dish pizza for my friend. I felt bad that we couldn't order a proper meal. So I offered to pay for the sampler. And the staff obliged and charged me a heavily discounted rate. Woohoo! 

I did order myself a dessert. I got a creme brûlée. And as a part of an off-menu sample, the chef brought out a pina colada ice cream that was the most exquisite thing I've had!! The creme brûlée was perfect too! 

All in all, this was a much more positive experience than the last. It's missing a star because I haven't yet ordered anything off the menu. But I'll be back. My friend and I are both looking forward to be back because the menu was really exciting. Also, the people in the adjacent booth to us ordered some crazy meat deliciousness that we HAVE to try!

PS: A+ for presentation!"}
{"text":"We had heard great reviews of this place and wanted to try it out. Luckily we also got a WagJag Voucher for $49 which includes 1 Appetizer, 2 Entree's, 2 Desserts and 2 Coffees/ Teas.

We made our reservations prior to going, Great Ambience and Great Service! We ordered Buffalo Wings as Appetizer, Sirloin Steak WellDone and Creamy Mushroom Chicken. One added advantage to this was that it's Halal as well so works for us. Both the Appetizer and the Entree's were mouth savoring and delicious, totally loved the taste. The sides Mashed Potatoes were ok, not in comparison to the main dish.

For the Desserts, we ordered Creme Brûlée and Triple Chocolate Cheesecake. Again it was succulent and mouth watering, I personally loved the Creme Brûlée, as not much a chocolate dessert person, it was smooth and scrumptious.

We had a great dinner and an excellent time, Thanks Black Ox Bistro for making my wife's birthday special ! Would surely recommend it and it's totally worth it !"}
{"text":"Back again.
Got the ribs this time, they were fall off the bone. Kids loved their steak. 
Whatever bad reviews they've had in the past don't listen to it, these guys are very good.
Even the ramadan menu was quick and tasty."}
{"text":"I initially saw Black Ox Bistro while I was in Markham for work, and I said to myself \"I gotta come back and check this place out\" as it looked quite interesting, and finally 3 months later I had the opportunity to! 

Initial Impressions: 
While it's location is a little unassuming (the restaurant is situated between two medical buildings) the minute you go inside, you feel like you are transported to another place. The restaurant itself is very nicely decorated and definitely feels like a upscale restaurant. 

The food: 
This place is Halal so everything on the menu is obviously going to be such, having said that this also means that the restaurant features a Dry Bar (no alcohol) while this may disappoint some, I had no issue with that at all. 

Their menu does feature a bunch of \"Mocktails\" so myself and the person I was with both tried  one each. We ordered the Pina Colada and the Raspberry Mojito, I must say I was very impressed with both drinks. They featured a very fresh taste and had a very nice balance of flavours (meaning that one particular flavour note didn't dominate the whole drink). 

For our Appetizers we had the Brisket Poutine and the Beef Bacon Wrapped Jalapeño Bites, I find these two items were the real star of the show as they completely blew me away. I have had my fair share of poutines and this was probably the most \"gourmet\" tasting one I have had yet! The poutine featured fresh ingredients and the beef in the poutine wasn't dry or \"cheap\" tasting at all. Although I will warn you and say this dish itself can be extremely filling. The Jalapeño Bites were also quite interesting; typically I'm used to having the standard breaded and fried ones available almost anywhere, but having these nice ones was a real change. Once again they tasted quite fresh, and didn't seem like they were sitting prepared waiting to be ordered. The bites themselves are drizzled with a light sauce to give it a small kick, but besides from that they aren't overly spicy at all and anyone with a low heat tolerance should be okay with this dish. 

For our main dish we actually opted to share a platter as this was recommended by our server; we went with the Meathead Platter which features a variety of meats which include: chicken wings, ribs, steak, and fried chicken and potatoes. The dish also featured a side of coleslaw and \"loaded\" mashed potato that had cheese and beef brisket on it. I found the chicken wings to be extremely tasty, and flavourful. Typically I get the hottest wings available when I go out but having a nice mild BBQ-ish sauce on the wings was a real treat as I got to actually enjoy the flavour and not die of heat LOL! The ribs were honestly spectacular (I almost want to say they were the best ribs I have ever had)! They meat itself was very soft and virtually melted in your mouth, the ribs were also topped with a nice BBQ-ish sauce which paired with it perfectly! The quality of the steak was also very good, and on par with some steaks I have had at very premium (and expensive) steak houses. The fried chicken was also very good, but what really made it for me was the mashed potato bed the chicken was on top of. Those potatoes were by far the best Garlic Mashed Potatoes I have ever had, as they were loaded with Garlic, just the way I like it! The coleslaw and baked potato were also very tasty and \"premium\" tasting! 

For dessert we ordered the Chocolate Cheesecake which was simply phenomenal, the cake tasted as if it was prepared in-house and didn't feature any sort of \"kept frozen\" taste that some Cheesecakes do at some restaurants. 

The Service: 
The service was absolutely impeccable! I have been to several restaurants and this by far beat any of them. Our server was very attentive and made sure we were happy with every part of our meal! 

I will definitely be back to experience the greatness that is Black Ox Bistro! 

P.S word on the street is that they will be soon offering a Breakfast menu, so do keep on the lookout for that!"}
{"text":"Tried Black Ox....its okay. 

Atmosphere 
- Nicely themed restaurant, especially for the area. Good decor and vibe, place is clean and nice ambient lighting. Good for casual, family, dates.  Had to wait longer then expected for the food and bill, make sure you go with someone you can talk to cause time goes by slow. 

Menu
Your general bistro items, sandwiches, starters ( shrimp, fries, poutine, pasta, steak.... ) The mains are similar to any steak house. When it comes to pricing its a tad high then similar places, but $20 average for a main is nothing major. 

Food 
Its okay. Unfortunately the stuffed chicken which was on the menu, is no longer offered. Got substituted with an 8oz chicken breast, some veggies, and mash potatoes, doesn't come with any sides. Chicken was good, but a bit small in my opinion. Sauce was amazing, thick and creamy with good flavor. Mash potatoes was gritty, felt like it came out of a box. Not sure if its normal or if its a bad batch but would not recommend the mash potatoes. Steak was good, they know their cooking temperatures, good steak sauce. Similar complaints, small portion and mash potatoes. 

Overall
Its okay, but not sure if I will come back again for dinner, or for any of the mains. The wait time for the food and bill was a bit annoying, and food was nothing major. Maybe I'll try their sandwiches, some of them look interesting. The location and convenience is whats going for the place, and with it being halal attracts wider crowd. Its Meh..."}
{"text":"Full Disclosure:  I attended a media event, but I did tell the organisers that I would be providing an honest review, so here it is...

Coles Notes version:  Service/Ambiance was much better than the food itself.  

Service was not perfect, we had to ask for basic stuff like cutlery, condiments, & water, but never did I see the waiters unable to handle our requests or get frustrated.  So that was pretty impressive to me!

Restaurant itself is new, so it's nice, re:  medium/dark wood tones, dim lighting, nice light fixtures, etc.  Strip mall that it's located in appears to be new as well, so there is plenty of parking.

I'm not going to itemize each and every course, but I think the main problem lies within preparing food for a large group, approx. ~30ppl.  Most, if not all, the food was probably left out too long before being served as everything was just lukewarm, re:  soup, Mac & Cheese/Poutine/Sliders, & Risotto.

In conjunction with the temperature issue, there was also an overall lack of any flavour, re:  Soup (bland, needed good old fashioned s'np, nutmeg), I really wanted to like the Mac & Cheese, but that was completely bland, needed a sharper cheese, & Wild Mushroom Risotto was also very, very bland, and rice was undercooked (had hard bits), I couldn't eat this.  Stuffed mushroom itself was good, but the entire dish was a beige colour which was not particularly appealing.  Basil foam as a garnish was not a good idea.  I think some fresh chopped chives would've been a better idea, adding some colour to the plate.

The only dishes that had any notable flavour were the chicken wings (had a nice kick to it!) and the Chicken Ballotine (chicken was nicely seasoned), but carrot purée needed some salt.  

I must note that the meat, re:  sliders (served with no condiments), beef brisket (room temp & bland), chicken was cooked well.  However, the temperature & lack of seasoning on most things really detracted from the quality/cook of the meat.

The Pavlova part of the dessert was just meh.  Tasted just like baked, fluffed egg whites.  White chocolate sauce was nice though.  Again, presentation was not a strong suit.

While I was making a call, I walked around and took a look at what the other diners were eating and honestly, their dishes looked better, more colour, nice cuts of meat, better presentation.  So perhaps there was just an issue of preparing good food for a large group.

I do feel bad for providing a less-than-stellar review, but I did *warn* the organisers that I was going to be completely honest, free or not."}
{"text":"Thoroughly enjoyed the service and the food here at Black Ox. I had my birthday here with the girls, we started off with drinks (mocktails) which were fruity and delicious! Definitely worth having when you enjoy the beef brisket poutine :) highly recommended!
We ordered the Mushroom Agnolotti, Beef Wellington and fettuccine. The pasta was perfectly cooked al dente, the creme sauce was smooth and creamy. I will definitely come back.  

In addition, the service was excellent. Our waiter was quick and offered recommendations since we have never been. Loved the atmosphere. Worth going back :)"}
{"text":"I'll start off by saying I was invited for a complementary meal by the owner. This did not change my opinion of my experience at Black Ox Bistro. 

It is located in a plaza at Markham and Sheppard and you would never think that it was a fine dining restaurant inside. As soon as we walked in, we were greeted by a friendly lady and we're promptly seated. We chose a booth in a corner. The restaurant had a nice fine dining ambiance. I read some reviews about the tables being too high and uncomfortable for short people. I'm fairly short (5'3\") and I did not have any trouble or find it uncomfortable. 

We were introduced to the manager (Danielle) who was very friendly, as were all staff that we had encountered during our entire time at Black Ox Bistro. She explained the menu to us, let us know what the most popular items were, and gave us options to make any changes to what she suggested. We did not make any changes and ordered everything she recommended. 

The drinks are all non-alcoholic, as this restaurant is completely halal. I have to admit that I was slightly disappointed as I would have loved a glass of wine with the meal. However, the mocktails were delicious. We tried the raspberry mojito and piña colada. The raspberry mojito had fresh raspberries muddled at the bottom and fresh mint. Topped off by soda water, it had a nice freshness to it without being overly sweet. It was a great palette cleanser as well. I would definitely order this again. The  piña colada was completely dairy-free as they used coconut milk. It was very creamy and delicious. It was on the sweeter side of the 2 drinks but I would also order this again.

The appetizers came out shortly. There was a LOT of food on this shareable platter. All of the food was made from scratch at the restaurant and nothing pre-made. The sliders were absolutely delicious. The bun was tasty and the patty was very juicy. This was the best slider I've eaten. The spinach and artichoke dip was fantastic. There was plenty of cheese and it was served with very delicious bread, instead of the plain pita wedges most restaurants give you. The Buffalo wings were not very spicy but they did have a delicious sauce which, again, was made in-house. The macaroni and cheese bites were huge! They were extremely delicious. I highly recommend these. I was very happy to see that the jalapeño popper was not breaded. It had real cheese on the inside and was not spicy. There was so much food on this platter that it could have been an entire meal for 2-4 people! 

We then saw the size of the platter of the Meathead platter we knew we'd barley be able to dig into it. Needless to say, there would be a lot of food as leftovers. Sitting in the middle, it was clearly the star of the platter, the 1/2 kg King ribs. They were extremely tender and also very fatty. Since this is a halal joint, there is no pork. I have never been a fan of pork before so I can say these were hands down the best ribs I've ever had. The steak we ordered it cooked to medium. This was also the recommended level. It was very juicy and delicious. I loved the flavour of the steak. It did come pre-sliced, which can take away from the flavour or temperature but I tried it earlier on so it still tasted amazing to me. The beef brisket potato was really good, as were the mashed potatoes. There was a bit of coleslaw on the side. It was missing some kick to it, maybe vinegar? It didn't really help to cleanse the palette with all of the meat. This was probably the only disappointment on the platter. 

Now comes the dessert. We had an Oh Henry cheesecake and a creme brulee. I would order both of these again! They were both delicious. The creme brulee was very soft and creamy with a crispy sugar layer on top. The oh Henry cheesecake was very flavourful with delicious peanuts, caramel, and chocolate all balancing out with each other. 

Overall, the experience at Black Ox Bistro was fabulous. All of the staff were very friendly and professional. Danielle, the manager, and Tahir, our server were amazing. I hope to see them again on my next visit."}
{"text":"The food and atmosphere are pretty nice, however, we waited 40 mins for our entrees.
The appetizer - chipotle chicken flatbread is really good! They add a thin layer of curry in the bread to match the chicken better.
Entree: my friend had New York style steak-6 oz with mashed potato and vegetables. The sauce is perfect.
I ordered true stuffed chicken breast with Garden salad. The sauce is a little bit spicy but it's totally fine for me. All the meat are well-cooked, mashed potato is flavory.
Drink: my friend had the strawberry slush(forget the real name), she said it's really delish
I was on a rush so we didn't get the chance to try their dessert.
Will come back and try their pasta next time."}
{"text":"I can't believe there's no alcohol serve for a steak place. The steak is good but the fried chicken and ribs are meh~~~"}
{"text":"I took notes! 

Disclaimer: I was invited to try this place complimentary by an outside firm.  This has not clouded my judgement even though I think free food is the best food :p!!!

Interior was absolutely gorgeous, but you wouldn't expect that from the outside, it just seems like another plaza diner but really wonderful inside.  They had a great colour scheme the rock walls were gorgeous and light fixtures as well! 

We were seated and given their raspberry mojito and pina coloda drinks.  My husband LOVED it even though he was SUPER upset that there were no alcoholic drinks, I probably should've explained that to him first :p 

One thing that might just be a problem for me, but i'm 5'2 and the tables are SUPER high and chairs low so my chest was just at table height and it was very  difficult to eat (I'm a rather large chested person). That was annoying but beside the case.  

It took about 25minutes for our apps to come out.  The flat bread was AMAZING the wings are one thing I would go back for 100%, I enjoyed the jalapeno poppers.  Those would be my recommendations.  The spinach dip was too hard and didn't have that creamy texture, I didn't eat the mac and cheese but my husband said I wouldn't be missing anything life changing. 

The mains took about 10mins after we finished our apps.  Let me start by saying the Short ribs ORDER IT, wings and short ribs oh baby!  Would go back for that.  HOWEVER, the steak, and I love steak, was cold and a bit dry.  I ordered a rare steak and to be fair on the meat head platter it is pre-sliced I would have to come back to try it one day when it isn't sliced for me because that takes drastically changes the temp and dryness.  Fried chicken was good, not drenched in oil and nice seasoning..  Potato Brisket good but not worth reordering but the mash was awesome :)! 

Dessert - Flavour in the creme bruele is some of the best I've ever had...BUT the firmness was not there, it was very liquid, this should be an easy fix and then I would 100% go back for it.  Cheesecake, nice presentation not something I would order again though because that creme bruele is amazing!! 

Service - AWESOME Abdul and Danielle (I really hope I Got their names right sorry if I didnt) were great!  Good service, attentive.   I tipped $30 because of how great they were. 

We also got cream sodas, which is an issue because now we're going on a hunt to find them , they were SO good! 

The reason they lost 1 star is because of the wait time, it shouldn't take 25 minutes for apps to come out when you had a reservation with a fixed menu for yelp reviewers.  Aside from that I'd come back!"}
{"text":"Gave it 2 stars for the ambience, the awesome service and fabulous drinks. Other than that the food sucked. 
Appetizers - we ordered the Brazilian wings and poutine fries. The wings were anything but Brazilian. It was just regular breaded wings topped with Frank's buffalo sauce (or atleast it tasted as such). The poutine is supposed to be gravy infused fries but the gravy was at the bottom. 
Oh by the way the wings were cold and the poutine was warm. 

Main dish-
The steaks were rough in texture and looked rubbery as opposed to the marblery glaze it's supposed to have. The sauce that comes with it was watered down. 
So I asked for a1 sauce and the restaurant doesn't carry it. Ok so if you're an upscale steak house but don't carry A1 then there's something wrong there. 

I wouldn't repeat. They recently had a change in management."}
{"text":"After seeing all the yummy photos from fellow yelpers, I decided to visit here after work last night with my colleague. I made reservations on their website for 9:30 for 2 and requested for a booth if available.

When I arrived, we were greeted promptly and seated at a booth as reserved.  Being my first time here, I didn't realize it was a halal restaurant, and my colleague was wondering... \"Where's the drink menu?!\" Little did we know... no alcohol for dinner!

It took a little while to waive down our server to get our orders in and get water at the table.  We got the meat platter @ $45, beef brisket poutine, and their suggested mango lychee drink since we couldn't get any alcohol.  For the two of us, it was quite a lot of food, we barely even touched the poutine because the meat platter was already enough!  The meat was cooked and seasoned well, however I must say the cheese curds on the poutine was quite chunky.  What I loved the most was the king ribs in the middle of the platter, it's made to perfection!

It was a great experience overall, however I was quite annoyed with several fruit flies flying around the entire time we were eating.  And the fact that several times it took a while to waive down our server, we didn't really get the attention at our table until the restaurant literally cleared up... otherwise, I definitely would've given it a 5 star rating. 

Will definitely return for more of the king ribs!"}
{"text":"yay a place i can finally share a HALAL meat filled meal with my bestieee. which is exactly what we did :)

we started with the brisket poutine-it was perfect. the gravy was rich and tasty-not so much a poutine type gravy. it was more like a gourmet gravy. the meat was also tender. i would go back just for that 

the bestie got the ribs-which she liked. had an impressive presentation too. i got the 7 oz steak with peppercorn sauce and ordered it medium. this place loses one star with me because the steak came out medium rare...and in some spots straight up rare. but i ate it anyway i was so hungry i didnt wanna wait for a re-order. 

the server was super nice and attentive. although my steak was cooked exactly to my liking everything was still delicious. 

ps-maybe having some background music would be nice. when i was there it was eerily quiet and made us feel weird about having girl chat since everyone could probably hear us..AWKS"}
{"text":"Ordered the MEATHEAD PLATTER which has a decent size beef rib, an equally decent steak, pretty good buffalo wings, an oddly well seasoned but at the same time lacking salt fried quarter chicken, and a nice backed potato with a little too sweet pulled brisket on top. Here is the thing I would come back here to try the rest of the menu cuz it sounds really good and what I tried was decent enough. I wish the rib was cleaned a bit better that would have made the experience nicer. I also wish the chicken was salted, I think it would have been pretty good. The baked potato doesn't need the brisket on top, either serve it separately or give more portion for the steak. It is definately filling enough for two and probably the first thing you should try when going there. Gives you a good idea of their quality. Now the drinks I really liked. Especially the raspberry mojito. I normally hate raspberry but this thing is awesome. The mango lychee was good but the mojito really quenched my thirst after all that meat. The creme brulle was also really good with a nicely torched sugar top. I really like that a halal place is branching out from the usual fare and I'm also really happy that they seemed to be successful as they are expanding into the adjacent shop. Good luck guys. Keep it up."}
{"text":"After my first review, the manager/owner had replied back to me to listen more about my feedback, which I always appreciate.  Fast forward a few months now and he indicated that they had taken some suggestions into consideration and that they've added a new chef, several new menu items.  Given the lack of classy Halal Canadian steak/fine dining restaurants in the GTA, we decided to give it a go again.  Sorry for the long review but I really wanted to translate all of the improvements and quality.

Now we decided to come earlier around 5:30 as we knew it would be less busy with crowds and lines normally forming after 7-8.

Initial overall impressions:

- ambiance was quiet and very relaxing - nice music playing
- warm welcome and seated immediately even though we were early 
- we had a few mocktails to start with:
- pina colada was sensational with a pineapple garnish and nutmeg floating on top of a smooth, creamy coconut and pineapple flavoured mixture 
- raspberry mojito is very refreshing with mint and fresh raspberry - both drinks are the perfect balance for a warm and uncomfortably humid day! 

Chose the appetizer platter to start with - mini burgers had good flavour and were fairly tender, although not as juicy as a large quarter pound burger as to be expected with such small patties/sliders 

Mac and cheese bites - crispy coating with cheesy Mac n cheese inside a tiny amount of spice tops off the flavour - would order these as a standalone - very good.

1/2 pound of churrasquiera wings which were baked and tossed in a house sauce that was a bit like Frank's.  The wings were absolutely delicious, and I was tempted to cancel everything else and just order 2 dozen of these.

Spinach and artichoke dip was tasty along with pita that had baked Parmesan on top. 

Also, came with jalapeno poppers - I've never had a jalapeño popper before but these were good and were wrapped in beef bacon, which tastes better than most halal chicken bacon.

And then there was meat! Sooooo the meat platter consisted of a half kg of beef ribs, sliced sirloin, baked potato topped with shredded beef brisket and cheese, and crunchy, coated homemade chicken fingers along with buffalo fried chicken wings which were even better than the appetizer wings.  

Beef brisket on the potato had a slightly sweet flavour while the ribs had a sweet / tangy bbq sauce on top which I enjoyed. The flavour of the meat itself on the ribs was a little gamier than the sirloin which is to be expected for such a giant chunk of slow cooked beef.  All of the meat was very tender and served perfectly with everything piping hot. Even after 6 or 7 minutes the ribs still had steam coming off of them. 

Last but not least there was a sweet coleslaw side and a tangy mashed potatoe which the chicken fingers were served upon.

The dessert came out and holy dessert paradise.  Creme brûlée and a strawberry cheesecake served in a martini glass.

I was told that the desserts are a new focus for the restaurant and that the sous chef has many new ideas that they are looking to include on the menu.  Let me keep my comments simple on the desserts - the creme brûlée had a perfect topping along with a silky smooth bottom filling - amazing.  the strawberry cheesecake was almost unstoppable as far as fork to mouth action.  Finally, I wouldn't expect dessert quality like this from any place other than an incredibly high class 5 star establishment like the Ritz or Canoe, etc - black Ox brings that quality to you all the way up on Markham road."}
{"text":"Came here with a Groupon for $40 that included 1 appetizer to share (up to $12), 2 entrees (up to $25 each), and 2 desserts. If you wanted anything above the price limit, you can pay the difference. 

Food: 
Brazilian wings: 3 stars
Beef Wellington: 4.5 stars
Surf and turf (filet mignon with prawns): 3.5 stars
Creme brulee: 5 stars
Chocolate torte: 5 stars

Brazilian wings were pretty good. Not sure how to describe the flavour. Very mild spice. A hint of tang. A dozen of small wings. Not bad but kind of wish we got the brisket poutine afterwards lol. 
The beef Wellington came highly recommended by our server and I was not disappointed. The puff pastry was soft and fluffy....mmm it was really good. Filet mignon is about 4-5oz but extremely tender. I think all mains come with 2 sides. I got vegetables and fries. Vegetables were pretty good but the fries were looked and tasted stale. They were sort of hard too. 
My boyfriend got the surf and turf. Filet mignon was great! He asked for rare but it came to the the table as more of a medium rare. Still really delicious! I'm not a big prawn fan so I wasn't particularly impressed  with the prawns. 
DESSERTS WERE AMAZING! I loved the creme brulee and the chocolate torte. I wish the caramelized sugar layer was thicker but regardless, the custard was very smooth and creamy. The dark chocolate ganache was  very rich in flavour. Thick and smooth. I was most satisfied with the desserts. Wish I could have traded the appetizer for another dessert. 

Ambiance: 4.5 stars
Very pretty dark interior. Comfortable booth seats. Pretty lights lining the centre of the dining area. We were here on a Monday evening so it was quiet but I enjoyed the tranquility. 

Service: 4 stars
We were one of about 3-4 tables in the restaurant but our food took a long time to get to us. My boyfriend and I aren't usually the type to notice something like this so I'm guessing we waited for a solid 30 mins for our food. Maybe since it's quiet, there only one chef??? Luckily we weren't in a rush so it wasn't much of a nuisance. Our server was great. Good humored and gave good recommendations. He checked up on us at each point of our 3-course meal. Had a wonderful dinner here! 

Will definitely come back, especially for the desserts!"}
{"text":"Came here with a Yelp invitation. The venue was classy and the service was above average. They started us off with a Pina Colada and a Raspberry Mojito, both of which were rich in flavor. 

Next came the \"Shareable Platter\" which consisted of mac 'n cheese bites, Brazilian Churrasquiera wings, roadslide sliders, spinach artichoke dip, and beef bacon wrapped jalapeño poppers. The spinach artichoke dip was impressive but the other sides were bland and the mac 'n cheese bites were somewhat tasteless. 

The entree was a meat platter of ribs, steak, buffalo wings, chicken fingers, and baked potato. The steak was well made, but the hidden gem were the ribs. The server told us that the ribs were marinated for more than 12hrs which explains why the taste was so remarkably rich, not to mention that the meat essentially melted in my mouth. 

For dessert, we were served creme brulee and new york cheesecake, both of which were satisfying. 

Overall, my experience at Black Ox Bistro was a positive one due to their amazing service and gigantic portions. However, aside from their steaks and ribs, the quality does not justify the hefty price tag."}
{"text":"Had a great time.  We went out on Saturday evening with two other couples for dinner.  We had a great time and this place was a great find.

Firstly, the pictures on Yelp are 100% accurate.  
1. Great interior
2. Beautiful ambience
3. Great service - Hiruy was not only a handsome young lad but very accommodating
4. Food was excellent; great portions; great taste and AMAZING variety on the menu
5. Everyone we encountered was friendly, helpful AND they were properly staffed!!!!

Would definitely recommend this place and we plan on going again and again.

TIP: We made reservations - DON'T even think about walking in as it is very busy."}
{"text":"HALAL

5-STARS

The ambiance as soon as you walk-in is great. You can go with your family or go on a date and either way the ambiance fits. Their service is impeccable. The staff is friendly and energetic. 

Now, let's talk about the food. We ordered the shareable appetizer platter which had 2 of everything and it was beyond delicious. The presentation, the tastes...everything was on-point. We then had entrees, one each, and by the time I was done with the appetizer, I was full and could not have more than two bites of my entree. Again, the entrees were just as delicious and presentable as the appetizers.

This place has hit the nail! Everything about them in on-point! Finally a Halal restaurant that has great taste, great ambiance. and great service. Everything you want in one place."}
{"text":"Wanted to try a local spot I haven't been to for lunch. Came across this place. Walked in cute, cozy and modern. Went over the menu and saw many items I wanted to try. 

Went for the wings as an app. They came out about 10 minutes later. Felt like it was microwaved. Soft, juicy, spicy. Not what I was expecting. I thought there would be a char or some kind of crispy edges but no, none of that. 

Server was extra nice. New to the job. Didn't know the specials or the menu very well. 

Ordered the Juicy Lucy, medium but when it came out about an hour later it was wellllllllllll done. Flavours were good. Presentation was nice. Fries nice and crispy. Just not what I asked for. The burger was cooked way too long for my liking. I posted a picture. 

Anyway overall, this place is okay. They have a great lunch special ($6.50-7)  which I wish I knew about before ordering my over cooked burger ($17)."}
{"text":"Have been to this place twice. Shame on me for getting fooled again.

This place advertises heavily on Yelp. That's why there are 140 suppressed reviews.  Similar to 1980 Russia, anything negative will get suppressed and crushed by the Communist regime that is Yelp. 

Downtown Prices.
Ghetto Scarborough Location.
Mediocre food.

The Good:
It's nice inside.  Nice ambiance and layout, and the menu sounds good.

The Bad:
The aforementioned ghetto Scarborough Location. The mediocre food.

The Ugly:
The prices.  Uggh.  You're basically supporting their Commie Yelp advertising budget."}
{"text":"Black Ox Bistro is a restaurant in Scarborough offering modern halal cuisine with an elevated flair. The restaurant caters to serving halal-certified meat that are from HMA (Halal Monitoring Association) certified sources. Given the long lines at the Toronto's Halal Food Festival 2015, one could tell the restaurant has gained popularity for their take on mainstream style dining.  

Upon entering the establishment, it was clear that the management of Black Ox Bistro wanted to create a more upscale and relaxed environment. The dining room was spacious with a bar located at the front of the house where they make in-house mocktails. The reason for the sale of mocktails is because alcohol is not permitted in hahal establishments.

I started the night off with an order of their most popular mocktails, the Pina Colada ($6) - pineapple juice, coconut cream, and crushed ice. It was a very refreshing drink with a strong hint of coconut, which I enjoyed. I decided to opt for the bacon wrapped scallops after seeing pictures of it on my Instagram feed earlier that week. The bacon wrapped scallops ($14) were absolutely delicious, and flavored really well. Normally, I am not a huge bacon fan, but I really liked that the texture of the veal bacon was slightly less crispy than pork bacon.

As for my entree, I got the filet mignon (6 oz) ($24). The steaks are Canadian Angus beef that are aged for 28 day, and HMA certified hahal. Each steak entree was served with the customer's choice of two sides from the following list; seasonal vegetables, house cut fries, or roasted garlic mash. I opted for the seasonal vegetables, and roasted garlic mash. I also added an extra order of lobster tail with lemon herb butter ($12) to make it into my own version of surf & turf. The juicy steak was cooked exactly to my order, which was medium. The sauce that I selected was the Café de Paris butter. A good Café de Paris butter needs to have the perfect balance of butter, and the fragrant herbs and spices used. The texture of the one from Black Ox Bistro was slightly thicker than I would have liked, but it did add flavor to the steak. The lobster tail also added the extra touch to what was a very tasty and filling meal.

Black Ox Bistro prides themselves on serving a variety of items that are made in-house from fresh local ingredients. Similarly to their food items, the desserts were all made in-house by their chefs. I was happy to see that one of the options was crème brûlée; my favorite dessert of all time. I ordered the crème brûlée ($7), which was well plated. Overall, the dessert was indeed excellent, and it was a generous portion compared to the ones at similarly priced restaurants.

I was pleasantly surprised that all of the staff provided both friendly, and attentive service to all diners. They all worked cohesively as a well-unified team, and that resulted in providing great and consistent service. Overall, I had a fine dining experience at Black Ox Bistro, as I enjoyed both the food and ambiance."}
{"text":"I said I was going to give a review and here it is!

If I could give a zero I would.

If you can see (based on all my reviews)  I give 5 stars where the service is fantastic!

To the chef of that place: please check food for freshness before leaving the kitchen. It should be expected to have fresh ingredients and salads. Salmon is not supposed to be dry & overcooked (so bland). Salad is not supposed to be dead when you are serving it to customers. Please take this feedback into consideration. I will not come back. I don't think it's out of context for me to expect my food to be fresh. 

We walked in and asked for the lunch menu (menu advertised on their website) and our server was confused however he found them. The customers next to us were wondering about the menus we asked for and advised us to tell them to warm fries for longer as they got cold fries. That should have been sign # 1 for me.

Ordered food and waited 45 minutes (it felt longer) for food.

I ordered baked salmon salad with no onions. I asked if everything is fresh. Our server said \"Of course!\"

Food came and for those who ordered salads, salads looked dry and dead. It was not fresh at all. I asked for no onions (again, our server did not pay attention to detail at all) and I got onions with a salad that was absolutely not fresh (I wish I took a photo). I got another plate of fresh looking salad. Salmon was dry and I left it on my plate. I ate about 35% of food and I couldn't as it was absolutely not fresh. 

The manager spoke to me and offered 50% off my meal. I am thankful for that. Again, it wasn't about money. All I wanted was to eat fresh food as I was hungry! 

My co-workers food looked great and they had no complaints (they ordered sandwiches with fries instead of salads). Their food looked fresh.

Ambiance was much better than the food itself!"}
{"text":"This is quite the gem of the neighborhood. Upon entering this small plaza with a Harvey's, we decided to give this more upscale restaurant a try. It was definitely a good choice. It was a surprise to hear that this steakhouse served halal meat, you don't see that everyday. 

They have a mocktail list instead of cocktails, they were so tasty even without the alcohol. My date ordered the pina colada, and it was the best she ever had.

For starters, we ordered the Mac n' Cheese bites and the small Angus beef sliders. Both were delicious and very nicely presented. It was so delicious and the beef sliders were very juicy. The Mac n' Cheese came with a side of 'Cheese' that added the right amount of kick. As well as, my date ordered the rib eye, where as I ordered the Beef Rib. Man, the beef rib was amazing. The meat was tender and fell off the bone. It was definitely out of this world! The rib eye was very good as well, medium rare, though it was a little more medium which made it a bit tough to chew on. The steak came with a side of vegetables which is all part of a balanced meal. Then we ordered a cheesecake to share, and it was soft and creamy. Definitely a must try. 

There were a lot more things we wanted to try but we just didn't have the room to eat. We will be back!"}
{"text":"the decor and ambient was nice. The food was just average. It was a busy night at the restaurant, the server we had was quick; however he was not very organized and low attention to detail. He was not aware that we were missing a set of silverware, and plates for shared appetizers came much later. 

The brisket poutine wasn't very good. The fries were over fried. The gravy wasn't hot so the cheese didn't melt at all. 

For the entrees: (all the entrees didn't come out all at the same time) 
1. Beef Wellington- bland, the puff pastry was nicely cooked. Side dishes were also bland. 

2. Stuffed chicken breast- too dry. bland. 

3 Rib eye- ordered medium but came out med rare. again bland. 

4. salmon. bland. slightly over cooked."}
{"text":"This is a gem for GTA. 
Ambiance is awesome and you can celebrate events in this inviting environment. 
Not a big variety but they have options and some good quality steaks. We ordered half rack ribs . It was juicy
 done to perfection but spice level was very very low. Next time I will try mentioning make my food spicy. Presentation was appealing but nothing so exceptional. 
Also tried steak from child menu which was very dry and flavorless, disappointed 
The pleaser was poutine from appetizer, fresh tasting steak fries with soft and juicy beef, topped with right amount of gravy and curd! Makes it perfect.
Overall a very good restaurant, I am taking a point off because my food was not done according to my spice level , owner please take note and next time ask customers how spicy they want the food to be."}
{"text":"Very disappointed of the food! I ordered the Surf & Turf with lobster tail, the steak was overcook, the lobster tail was dried out and super salty."}
{"text":"Wow! Amazing place! The mocktails here are sooo yummy!! =P tried a couple entrees and appetizer and they were all tasty. The food portions were huge and at a very fair price!!!  Overall delicious! Highly recommended restaurant. Oh wait! Don't forget the desert !!! Creme brûlée was so creamy and good. Thumbs up. Must try !"}
{"text":"Like many other Elites I was also invited to try out this restaurant but as always my reviews are my own thoughts and opinions.

The concept of this restaurant is unlike anything I've ever heard of. It's a Halal steakhouse therefore they also do not serve alcohol and no pork. From the outside it's pretty unassuming but once you walk inside you feel like you've transported to a trendy bistro downtown. The dim lit interiors with eclectic light fixtures, grey leather chairs and wood panelled walls was totally not what I was expecting to see.

We were warmly greeted by a hostess upon entering and taken to a booth near the back of the restaurant. I found the booth area a little awkward as being only 5'2 the table height was little to tall for me and for my husband who is 6'1 the pedestals under the table were in the way restricting him from stretching his legs out. 

The menu for the evening was already set for us from drinks to desserts so we just sat back and awaited the delights that were to come.

First off Drinks
Raspberry Mojito - Raspberries, crushed mint leaves, lime, soda water
We both agreed this best of the two drinks brought over. The bottom of the glass was coated with a layer of juicy muddled raspberries which not only made it a pretty drink but also gave this refreshing drink a subtle sweetness
Pina Colada - Pineaple juice, coconut cream, crushed ice
Garnished with a wedge of pineapple this was soo creamy and tropical without being too sweet

Next up was the appetizer platter
Shareable Platter - Mac & Cheese bites, 1/2lb buffalo wings, roadside sliders, spinach and artichoke dip, beef bacon wrapper jalapeño poppers
One of my favourite items on the platter had to be the spinach and artichoke dip served warm and bubbly it was soo creamy topped with shredded cheese and the sharpness from the addition of parmesan cheese definitely increased the depth of flavour. I just wished they provided more than 3 wedges of flatbread so I could of scraped the ramican of dip clean. My second favourite item were the roadside sliders, the AAA beef patty was thick and nicely seasoned topped with some sweet caramelized onions. The buffalo wings were plump and meaty with a crispy batter coated in a tangy sauce. The mac and cheese bites were definitely larger than one bite with a wonderful golden crust revealing a super rich and creamy filling. It also came served with a Sriracha mayo dipping sauce which really kicked up the flavour nicely. Finally the jalapeño poppers had to be our least favourite - the only thing I loved about these were they were wrapped in smoked beef bacon which was soo delicious and we found better than pork bacon I definitely need to get beef bacon in my life. The popper itself was still quite hard/raw and 1/4 filled with melted cheddar cheese.

Next up was the Meat Platter
Meathead Platter - 1/2lb king rib, 10oz top sirloin steak, 1/2lb buffalo wings, fried quarter chicken, pulled brisket loaded potato
The real standout on the platter had to be the ginormous king rib. It was definitely tender and fall off the bone meat. So juicy with that lovely smokey bbq flavour was just heavenly. We literally scraped every last strand of meat off that rib.  I am a sucker for BBQ so when I saw that brisket loaded potato I dove my fork in without hesitation. Just like the rib it had that wonderful smokey bbq flavour that I love soo much and let's not forget that stuffed potato filled with cheddar cheese, green onions and sour cream. The fried chicken was our least favourite meat on the platter. Personally I like a really thick crunchy crispy coating on my fried chicken and this much more of a thin lighter coating batter. However the mound of creamy garlic mashed potatoes were just perfect. Finally the Top Sirloin, although it was cooked to a perfect medium rare and beautifully fanned out we found the steak a bit too cold and rubbery for our liking.

Last but not least was Dessert

Triple Chocolate Cheesecake
This was sooooooo good!! Homemade, with a chocolate cookie crumb base, rich chocolatey cream cheesy cake which was not too sweet and topped with chocolate ganache and dark chocolate curls. I scraped my plate clean and had to keep myself from licking the hot fudge sauce off the plate.
Creme Brulee 
Hubby had this one but although the flavour was spot on it was sadly underdone.

Overall we had a wonderful time. Service was a real standout. All waiters were attentive to all tables and food came out in a timely manner. We were not able the finish the meat platter and our waiter kindly packaged everything to go for us. Hubby only took 2 bites of his dessert the manager took notice without us saying anything and offered to bring him something else. The ambiance is great here and it's perfect for a romantic evening or a dinner with the whole family. We are thankful we were invited to try this place out and will gladly return."}
