{"text":"The point of calling ahead is so that the food will be ready when you get there, right? Apparently that's a new concept here..."}
{"text":"This place is gross. I like the cheeseburger, but this place is just nasty. Paint would go a long way. Wiping the tables off after customers finish their meal would help too!Every time I have been inside to eat, we had to clean our table ourselves. If you go inside to eat, you just might loose your appetite."}
{"text":"We Love BLACK'S BBQ! Every time we are here visiting from Florida we HAVE to get our Black's FIX!"}
{"text":"I'm only reviewing this for the \"barbecue\" because that's in the namesake and that's what I ordered.  I told the gentleman I'd like a pulled pork sandwich and he asked if I wanted sliced or minced pork.  Feeling a bit confused, I asked if the pork was smoked.  He looked down at at his register and gave a no response.  As much as I wanted to just walk out for false advertising, I was hungry and just told him I'd try the \"minced pork sandwich\".  Got it to go fast, took to my vehicle and unwrapped what looked like a toasted bun with unidentifiable pink/ orange filling.  The sandwich satisfied my hunger, but Ladies and Gentlemen, this is NOT barbecue.  At best it is boiled pork roast run through a food processor and mixed with thousand island dressing and slaw- a novelty sandwich at best.  If that's your thing, good for you, but I'm heading on down the road till I see some smoke coming from the back of a building next time."}
{"text":"Ok, Luke warm pressed BBQ. Nothing to write home about. I've tried it a hand full of times, since it's close to the house. And apparently it's anti-female. I've never seen a  female worker. Not one!"}
{"text":"Only the best barbecue EVER. Order extra slaw on your sandwich though, sometimes they don't put enough. Always the same, nice people when you come in. Can get very crowded at lunch time but this place is definitely worth it. The crinkle fries also taste super good with the slaw. Definitely my number one place if I want some good bbq. I've been coming here ever since I was a little girl."}
{"text":"Went here for lunch and the place doesn't look like much but the food is the reason to drop in. I got their turkey sandwich and it was delicious. Not a huge variety, but they are good at what they do. The staff was friendly and patient with us since we've never been before."}
{"text":"Great restaurant, AMAZING FOOD, the ribs were off the hook. I really recommend the minced barbecue sandwich -- it was the best I've ever had."}
{"text":"Would recommend to anyone. It's a place that anyone visiting Gastonia has to try out."}
{"text":"I walked in really wanting to like this place, but their BBQ was just not doing it for me. I came here on a week night and based upon what I'd heard from some locals, I expected Black's to serve up some good BBQ. Also, Black's is in a rough part of town, in a small shack and had an old Sun Drop brand menu on the wall. All of these things led me to believe that I was about to have a great meal. 

At Black's you order up front and they bring your food out to you at one of the few booths that they have. The man taking my order was very friendly and recommended the sliced BBQ sandwich. I ordered a small one of those along with a hot dog all the way with their slaw. Both of these items plus a sweet tea only cost me $7, so I was excited about that. 

I note two things here. Black's only takes cash. This shouldn't be an issue considering there is an ATM inside the restaurant. Also, they are open for dinner on week days and stay open until 9:00. The hours were not listed on Yelp and I had to call to check on this. 

My food came out very quickly and I jumped right into chowing down because I was very hungry. The first thing that I noticed about the BBQ sandwich was that it was just kind of smooshed together. It seriously looked like someone had taken the palm of their hand and just put all of their weight on top of the sandwich. After prying it open I found that their was not a lot of the sliced pork on their and the slaw was orange? 

Very odd but I put the top of the bun back on and tried a bite. The meat was kind of tasteless. It was luke warm and had no smokey flavor at all. Also, it was kind of dry. The \"slaw\" was unlike anything that I had tried before. It was kind of tangy and tasted like it might have had some thousand island mixed in. As for the hot dog, it was a little better. Honestly, the whole dog was overshadowed by the strong tangy taste of the \"slaw.\" I could see this \"slaw\" being good on a burger, but it does not belong on a hot dog and it definitely does not belong on BBQ. The tea also was not sweet enough and was not what you would expect from a NC BBQ joint. 

If I came back to this establishment, I would completely skip over the BBQ and probably heed the advice of some fellow Yelpers and get the burger. I only give this place 3 stars because I appreciate the character and history of the place and the fact that it is run by a local family. The service was honestly the best thing about Black's. BBQ is disappointing."}
{"text":"I order the same thing every time I go here.

Large Double Cheese Burger, with Chili, Onions, Tomatoes.

Last week no tomatoes, this week I get a small double cheese burger, and again it doesn't have tomatoes.

I called this time, and they said I could bring it back and get another one. For me it's a 20 minute drive, I'm not doing that, by the time I get back everything else is cold. The proper way to handle this is to take a name and get it next time. They can not resell the burger they all ready gave me, so they insist on wasting my time.

Also this place doesn't take any form of payment other then cash, get with the times.

The \"BBQ\" is a joke, it's a barren flavorless wasteland of mushy pork, stuffed into a bulk ordered hamburger bun."}
{"text":"Terrible barbecue. Unseasoned sliced pork with a sloppy topping that's less like a slaw and more like a bland pepper cream sauce, served on a nearly flattened fried bun. Just about as far from Carolina BBQ as you can get and still claim to have it on the menu."}
{"text":"If you're from Gastonia, it's either Black's or RO's for you in the local BBQ department. Depending on what you grew up with, you choose one or the other & very rarely switch allegiances & grab a bite to eat from the crosstown rival.

I for one am a Black's person, & have only ventured to RO's a couple times in my life. While RO's has some great, great, great slaw (that they sell in local grocery stores) Black's is just better to me. The weird thing is that both of these places are owned by the same family so there's kind of a family feud if you will.

OK, on to the food. This may sound really strange, since Black's is a BBQ restaurant, but I never order the BBQ. I just can't get enough of their burgers. They're the double whammy...cheap & good. Yeah I know it's odd that I don't even get the BBQ at a place where it's the specialty, but I save my BBQ eating to other locales. This is nothing against theirs, as it is pretty tasty the times I've had it, but I just prefer their burgers.

The place isn't that large, but you shouldn't have too much trouble finding a seat. They also have curb service at your car so that's another option as well.

Black's is a great family owned restaurant, with good BBQ but great burgers. Heck, if you're skeptical on what to get just order both. The burgers are great as take out items to be reheated later. You won't go wrong here with any of their options."}
{"text":"I love he sliced pork with slaw. Unique and tasty
Local business. Reliably good food.
Unpretentious and very casual"}
{"text":"Absolutely love this place!  The BBQ sandwich is delicious and is topped with their cole slaw then pressed on a griddle.  The result is crispy bun surrounding perfectly cooked BBQ and tangy slaw.

If you aren't in the mood for BBQ, their BLT is the best in town."}
{"text":"Never disappointing, always great food, consistent and very nice people. Sliced BBQ or hotdogs all the way...curbside service...always stop here when I'm in town."}
{"text":"Go for the BBQ slaw not the BBQ. Growing up on NC style bbq I am used to it being smoked meats, blacks is not that. I have no idea how they prep their pork but its not with fire and smoke. With all that I said I love this place. Probably my favorite local place. Try a cheeseburger all the way with BBQ slaw and a hot dog all the way with BBQ slaw! A side of onion rings isn't a bad call either. A must when you go is a CHERRY LEMON SUNDROP, they still make it the old way by mixing Sundrop and Cheerwine then adding in a slice of lemon. RO's across town cut the corner by buying the premixed cherry lemon sundrop and it is no where near as good.  Give this place a shot just don't go in expecting traditional NC BBQ. FYI someone said they don't have female staff, they have some ladies in the kitchen working."}
{"text":"Did anybody else not know that there was an inside seating area and anything other than bbq sandwiches on the menu? No, just me? For as long as I can remember, my family has always just pulled up outside and ordered a bag full of sliced bbq sandwiches with bbq slaw. A family friend introduced me to their French fries when I was a teenager and i was livid at my dad for never ordering fries before. They were so good. It's always fun to stop in when I'm visiting family in the Clover area."}
{"text":"What is that???  It is NOT BBQ!!!  It looked like mushy cat food mixed with thousand island dressing.  I don't even have the words to describe the lukewarm mystery meat served on a hamburger bun at this place."}
{"text":"BBQ and the South.
Goes together like eggs and bacon or cheese and burgers.
Everyone has their opinion about whats' good, better or best.
My bro-in-law has been going to Blacks for years, for years he says and it's the best, yes much better than RO's.
OK, he might be right, it's all opinion, right?
Blacks is good, you also get bbq slaw but on the side.
I still think RO's is better.
But what do I know?"}
