{"text":"Black Apron just catered our 30 person Christmas office party in our home.  They did an amazing job.  The food was like a fine dining restaurant just opened in my home! Everything was prepared fresh, beautifully seasoned and just a little different. Juan and his staff were attentive, effective and efficient.  Appetizers  were creative and elegant.  The main buffet was amazing, beautifully presented, and really delicious.  The dessert was fantastic. Everyone was complementing the food. Just what you want.   They cleaned up and left the place clean and tidy. With all free rental equipment out in the garage ready for pickup.  What more could you ask for?"}
{"text":"I don't know how I stumbled on to this place - a John Gilchrist review in the paper I think.  If so, thank-you Mr Gilchrist.  Small and out of the way, with somewhat odd hours (not open evening and weekends).  The place is run by two gentlemen who are skilled and obviously care deeply about bringing the best possible food to their loyal customers - of which I am happy to say I am now one after my first visit.  The burgers are bar none the best in YYC.  Lobster Mac and Cheese, homemade with real lobster!  I have four more days of vacation - if I split it into half days I can enjoy Black Apron EIGHT more times this year!"}
{"text":"Fantastic sandwiches and guys who really care about food :) I've stopped by twice for an early lunch (mostly because I don't like eggs so don't really do breakfast) and have been super-impressed with the food and the service both times.   The first time I got to nibble on breakfast cake while waiting for my to-go Reuben and the second time I sat under a patio umbrella with my dog after a long walk and had their feature sandwich - an unbelievably good chicken, brie, spicy sausage, tomato, arugula concoction served on the perfect baguette.   The chefs really love talking about what they make and obviously put a lot of care and thought into their product. Everyone I've interacted with at Black Apron has been personable and approachable - and, most importantly, have made great recommendations for what to eat!   Most of their business seems to be catering, but the Black Apron totally shines at lunch (even if that lunch is before 10:30am!)."}
{"text":"my friend introduced me to this place. We both work several blocks northeast of Chinook mall and I gotta tell ya, there's really not much flare in the industrial area. So, when my bud told me we were going for burgers close to work at this new place he found, I wasn't expecting much... I was expecting a dive.  we pulled up to this place that outside looked like a place where you'd buy wholesale industrial equipment anything pure use to seeing out here like a car part store. Before I went inside, I had to take a call and that distracted me. Anyhow, I walked in and one of the first things I saw besides the order counter was on the left, two well played Salmon fillets on a bed of mashed potatoes and greens... WTF?! my jaw actually dipped and i was completely surprised that this place served up this kind of food.  They said the upstairs was full so we sat at the main level. Have a look at my photos btw.  salmon was the special and was delicious! it was fresh and seasoned well. it was on special and only cost $13.95 if you can believe it. The beef stew on the other hand was well beef stew and was $12.95 (over priced in my books).  My only bad points of the place was they don't have a menu and their chalkboard doesn't tell you the prices for everything; So, unless you love having to ask how much everything you're interested in costs, don't bother asking and just get surprised that you we're charged $12.95 for a bowl of stew.  4.5 stars form me really, but no point five ratings so straight to 5 for the great service and completely taking this area's cuisine choices to a whole new level.  peace"}
{"text":"We hired Black Apron to cater and bartend a 80 person event in a house for a birthday. We found them via a google search, had never heard anything about them before but read good reviews. They were absolutely phenomenal. I hosted the event, planned the event, pulled my hair out attempting to organize the event and the second they walked in the house they completely took over everything. The evening went extremely smoothly, Stephen and Juan are incredibly sweet, charismatic and accommodating. I highly recommend. I have strict dietary restrictions and thus couldn't eat anything however everyone at the party praised the food especially the sliders. Definitely check them out and support such a great little local business."}
{"text":"Black Apron is tucked in an in a light industrial park not far from Chinook train station. I went to check it out because of a recommendation from a friend who knew I worked close by.   If it wasn't for the sandwich board outside, you may not know it was a restaurant at all. It has a door on the 62 Ave SE side of the parking lot. It's a simple, clean space with friendly staff that are very quick to say hello and assist.  A friend and I split a Reuben sandwich and the Creole Sausage Mac N Cheese with a side garden salad each.  Both meals looked amazing as they came to the table and the taste didn't disappoint. That was the cheesiest mac I've had in a long time.   The price point is real nice and the meal came at a very timely manner.  I would recommend this place to anyone."}
{"text":"Great food, great service! They just redid their menu and it got even better. I have many favorites off the menu, but have the Burgers, so tasty! Their pastas are awesome too."}
{"text":"This place is awesome. It's almost a crime that it's not more busy than it is. Staff is super friendly and attentive to customers, food is incredible and an incredible price. Don't judge this place by its exterior because the food is better than most $30-40 entree restaurants at a $12 price tag. Will definitely be coming back. Only downside is limited parking, so get here early for lunch"}
