{"text":"Had a fantastic night at the Black Briik with my closest 9 friends from high school. Music was perfect 90s mix of both rock and hip hop but not too loud for conversation, food was elevated pub style and delicious, and the owner took great care of us. Will definitely come back."}
{"text":"Great vibe, service, and food is amazing! Their chicken and waffles are on point as well as the appetizers I got to try. Seriously salivating just thinking about their food. We ordered the mac and cheese bites (can never go wrong with mac and cheese) and the briik dog. I've got to say that Black Briik is worth coming back just to have the briik dog again. Its their take on a corn dog but instead of your typical hot dog, they used longanista which is a filipino sausage that is sweet and savoury (my fave combo). Will definitely visit again to try some more items on their menu. Great place to have casual food and drinks or to watch the game! They do open pretty late until 2am on the weekdays which is great for late night eats.The 90s vibe the restaurant gives is really cool and feels very homey and comforting."}
{"text":"The Buffalo Chicken Burger was the best sandwich I have ever had in my life.  Yes, that good!   Staff is SOOOOO friendly, I was there because friends were playing music, it's across the city from me, but I will definitely be back again, it's seriously THAT GOOD!"}
{"text":"Waffle bacon avocado.  Fried Chicken.  Poutine.  Can't stop thinking about it. Great service and a good choice to watch games."}
{"text":"Love their throwback vibes and comfort food filled menu. This is a great place for Friday night drinks (or getting rowdy) because the atmosphere is super chill, they play Full House re-runs on the TV and the whole resturant just makes you feel very comfortable with it's 90s jam playlist full of NKOTB, BSB, Spice Girls, TLC... Awesome place for meeting up if you grew up in the 90s."}
{"text":"Damn near 5-stars across the board so who am I to break the love-fest over this new-ish addition to the Dufferin-Grove neighbourhood. Admittedly, we were looking for somewhere to grab a quick lunch prior to visiting some friends in the area, we had been cruising Bloor and refreshing Yelp to find something.  We had passed a pizza place a couple blocks earlier and decided to pull over and park and walk back. However, we ended up finding parking directly in front of Black Briik and their sandwich board hilariously said that they had Brunch and A/C on the menu today. With the 40C heat, it was a wise bet, because we quickly crunched the numbers on walking 2 blocks in the heat vs eating at the place that was advertising A/C. Easy decision.  It's a smaller restaurant with maybe 20-25 seats set in a mix of high-top tables, regular tables and some bar seats but its industrial design with some modern flair (inclusive of a Toronto skyline mural done by a local middle eastern artist) gave it warm big restaurant feel.  One of the owners (Frances I believe his name was) was our server and offered us both the lunch and brunch menus.   After some debate, my SO went with the Dirty Corn Hash (sans ham and with scrambled eggs) while I oped for their Juicy J Burger with well-done crispy fries.  Being pregnant my SO is definitely well in tune with her taste buds and loved the Hash from first bite, unlike traditional versions the chef at BB mixed it up with an almost curry-indo/asian spice blend which was subtle but fragrant, I had a bite and it was fantastically different from the normal brunch offerings around the city. And served with thick/sweet/buttery slices of brioche type bread, mamma and our baby to be were VERY satisfied.  As mentioned, my main was the burger and fries, not the healthiest option but what the hell - Yolo right? I ate the fries first because I LOVE well-done fries when they're hot. These were something else, I know it's hard to rave about fries but there was an amazing seasoning either on the fries or p[erhaps it was just the flavours of the oil on them, but they were amazing. Also, while I cannot confirm the science on this, they somehow cleared up my raging heartburn that I had been suffering from all day. The burger was excellent as well, a large fresh bun, topped up with a juicy pattie (NOT cooked well done - thank god).   The food was excellent but it was the owner that really sold the place for us, taking time at the end of our meal to have a great conversation with us about the coming baby, his excitement over the restaurant's success thus far and even a little fantasy football chat for me. He was super nice to the point that I kinda felt like I should have given him a hug as we left... I don't know why, he just gave us both a real warm reception.  This was the happiest meal mistake I've made in ages and one of the best lunch/brunches we've had in awhile. If you're in the are or are looking for something awesome to eat I definitely recommend you pop by Black Briik.  Eatcrest Out"}
{"text":"Awesome spot in the Christie Pits neighbourhood! In an area dotted with watering holes, to survive in a competitive market like this means you need to stand out. We had a few yelpers out together for a UYE hosted by the kind and generous Peter L. Obviously the staff liked Peter L. and us being there and showed it by offering stellar service along with some comped items to try out. The deep fried items were a real treat!  Of course these need to be gobbled up while hot, which was not a problem. There were coated cauliflower and other veggies, as well as some very tasty chicken drum sticks and thighs. What stood out for me was the corn dog. The sausage tasted just like the red Viet sausage that they include as an option for Banh Mi (Viet sammies on a French stick). Sort of a sweet taste that is unmistakable and my first choice for Banh Mi. But this was a twist with the breading and warmth from the fryer. Very tasty!  Overall a refreshing take on bar snacks that will get your group talking and animated without resorting to pounding back shots to break the ice. Highly recommended for groups!"}
{"text":"My boyfriend and I went for dinner and drinks here and had a fantastic time. The bartender had excellent service and the food was delicious. They also have a good selection of brews and have a chill atmosphere. A really good place in the neighbourhood and am happy that I took the time to check it out :D!"}
{"text":"Awesome spot. Great place to take in the game. The deep fried broccoli and cauliflower is ridiculously good. Had the buffalo fried chicken sandwich, best I've had in a long time ...maybe ever. Combine that with a great beer menu, ddefinitely going mg back regularly."}
{"text":"Holy comfort food is all I can say!   Well priced and portions are on-point! I can't lie I was suppose to post this review a lot sooner but completely disregarded it, will update when I revisit! (You bet your ass I will). I don't always clog my arteries with deep fried deliciousness but when I do black briik is where I'll do it, 1 hundo p. You would think it's the most simple food, how could it be so good and that's the beauty of it. Good doesn't always have to be complicated. I could tell you try this or that but how about you grab a few friends get some drinks going and try the whole menu.   Customer service is on-point from the moment you walk in till the moment you black-out (its a controlled environment), very attentive and accommodating the owner Francis really shows his passion in customer service, as not only his employees are checking up on customers so is he, Warning can work up a preeeettty good conversation. ;)  The place is small but it's cozy, music is great, and best of all is all the 90s nostalgic memorabilia, can't get over how everything looks like it just belongs there. The washroom are unisex, a little tight but I've noticed most washrooms downtown to be that way.   I think I covered everything, but did I mention how much I love this place?"}
{"text":"Now I was a bit hesitant to try this place because, yes, believe  it or not, I'm not too crazy about deep fried food, which was what their menu mainly offered. What I mean is I don't go looking for it.  Mhmm, go ahead blast me now.  Anyways! I wanted to give it a try because my boyfriend loves crispy/crunchy/deep fried goodness and I thought why not just give it a shot?   We didn't order any drinks though because we were solely interested in their food. We ordered the briik dog, fried chicken, deep fried mac n cheese balls, and the avocado and bacon waffle sandwich. Oh my pearl, it was all godlike. Every bite, there was a tear of joy. I really loved the briik dog (their take on a corn dog), and apparently my boyfriend told me it's longanisa! Longanisa is a type of Filipino sausage that has a more of a sweet kick to it than other sausages.   My favorite was the deep fried mac n cheese balls served with a marinara sauce. I thought it was strange at first, but wow! So crispy, so cheesy, so saucy when dipped in marinara. Next up was the fried chicken. This appetizer was their best seller as well and I can see why. Super crispy peppery exterior and a generous amount of drumsticks/wings. My least favorite had to be the avocado and bacon waffle sandwich. It was still good! But the other dishes were just too awesome. I guess I wasn't too crazy about the syrup on the sandwich, but that's just me.   Service was very attentive: constant checking on us, refilled our waters, chatted with us etc. It's definitely a smaller joint and I can see this place getting jam packed easily on a typical weekend night. I went fairly early, so I was able to snag a table. They play a lot of 90s/2000s music with matching decor as well. I spied some Spice Girls posters, and picture frames of Dawson's Creek and Buffy the Vampire Slayer cast. Ah, back in the day huh?.  Really nice concept, great service, cool music (I'm a 90s/2000s kid anyways!), bomb bomb food. I really recommend ordering a bunch of dishes to share and go with a small group! Love this place, I think they will be a successful resto-bar."}
{"text":"A truly wonderful experience. Greeted right away, it wasn't busy on a Sunday night. Greeted by a very pleasant person. Who gave some recommendations.  Small menu. Mostly fried.  Mac and cheese bites were tasty with a pureed tomato dip. Chilli cheese fries had just the right bite and GREAT flavour.  Had the Avocado bacon waffles. Very nice flavour and texture.  Would definately recommend."}
{"text":"I attended their grand opening and enticed a two friends to come along on the promise that there would be some good food to enjoy.  I felt a good vibe in the restaurant the moment I stepped in with a 90s/2000s playlist pumping through the speakers, the exposed brick walls, and the combination of low and high top tables.  They have two large flatscreen TVs for viewing sports events but the placement doesn't make them the focal point of the room but it's very complimentary.  So if you came to just chill with your peeps then you can do that with the glow of the TV distracting you the whole time.  The menu is full of their take on some classic pub and comfort foods.  It doesn't paralyze you with choices which I like because then I know that the dishes can be executed well.  The back page of the menu is a lot of variations on the theme of ingredients wrapped in waffles while the front page is filled with other deep-fried bites.  The menu items are, in my opinion, family style so sharing is caring in this case! :-)  All the staff were extremely friendly and came by to say welcome.  Service was great, warm, and on-point.  We ordered a few items to share:  1. briik dogs: their take on a corn dog but instead of just a hot dog, it is a longaniza sausage.  The longaniza sausage had lots of flavour and it was a pleasant enjoyable surprise.  2. chili supreme fries: just a straight up pub dish that is piled high with fries and chili.  Done well.  3. chicken and waffles: the waffle is sweet and they have definitely put their own twist on it.  The chicken was moist and it came skewered like a shishkabob.  4. bacon avocado waffle sandwich: this was my favourite combo of the night.  I love avocado and it tasted great with the crisp bacon between those sweet waffle slices.  Overall, I think Black Briik is a very solid and promising resto-pub with a good vibe.  You can just come in for a pint, eat some comfort food, watch the game, not watch the game, chill with friends etc."}
{"text":"****Very Good****  I went here for Canada day to enjoy food and drinks.   The food and service was 10/10.   We tried 3 things. The corn dog, chill cheese fries and chicken and waffles.   Everything had good portions for the price. I liked every meal the same so I can't pick the best. Chicken was boneless with the waffle but very big for 1 person main meal.   Fries were good for 2 to share and corn dogs came with 3   Next time you want a good selection of food and drinks stop in here."}
{"text":"I came with a couple of girlfriends thinking it was a nice neighbourhood place to have a drink. Unfortunately the staff was too tightly wound up and not social. They did not encourage bar patrons to interact with one another. The chef was ok, but in terms of food had little to work with, at best it's good bar food. Small venu, little choice, troglodyte drink choices... hipsters go to a real neighbourhood bar, stop faking"}
{"text":"Black Briik is 1 of 2 reviews that I had not yet gotten around to writing, so I returned last night for another visit to watch some of the Sunday night football game. Similar to my two previous visits, it was late on a Sunday night and only a few other people were there. The space is deep and narrow, with a black-and-white mural of the Toronto skyline on one long exposed-brick wall. There was music playing on my first two visits, mostly not songs that I recognized, but at least upbeat and not too loud. Last night, everyone was watching the football game, so no music at all. Each time I think that I have had the same server, who is quick to come over and quite friendly to everyone.  On my first two visits, I particularly went to eat something as I had read they have a good late-night menu. I had the chili fries supreme ($11) on my first visit. They were quite good; there was lots of chili and spring onions with sour cream on the side, and the fries were crisp. I then had the mac and cheese bites ($9) the next time, and they were really delicious, crisp outside but cheesy inside with some kind of dipping sauce; I only wish there were more than five in the basket. Other menu items that I noticed were fried chicken, chicken and waffles, mushroom poutine, and  their own version of the corn dog. I am not sure if there is a different menu earlier, but most of the late-night food is definitely 'comfort food'. They seem to have a good selection of drinks, including a list of craft beers ($6.50) and ciders, and some cocktails and martinis. I did have a Caesar once, which was nice and spicy, but mostly I've had mixed drinks like rye and coke ($6). Overall, not a bad place to drop by late at night if you want something deep-fried to eat. I expect I will keep going back every once in a while."}
{"text":"This place has become my go to place for brunch. Eggs Benny with salad. Can't get much better. Oh also they have a full menu as well with chicken waffles and a great assortment of rotating beer taps. Try the Bacon avocado waffles...you are welcome. Great place on the Bloor and duffrin area. Stands out amongst the crowd. Great for a date or just chilling with friends. Recommended.   - Note this review is solely the opinion of the reviewer and NOT the opinion of Yelp or any of its staff members."}
{"text":"My friends and I visited Black Briik on a Sunday for brunch. The brunch menu was pretty standard - we had the eggs benedict, dirty corn hash, and pancakes. The wait was quite long for food (30+ minutes) - the restaurant was not too busy but there was only one server and given the wait times, there was likely only one chef. Timing was an issue, as the first dish was served long before the other two arrived. The eggs benedict were okay, although a bit sparse compared to the other dishes and a touch overcooked. The dirty corn hash came with two eggs sunny side up that still had uncooked egg whites, but was otherwise tasty and a good portion size. However, the pancakes came out burnt and drenched in syrup. The bottom side of the pancakes (i.e. the hidden side) was significantly more burnt than the top side, and we had it sent back. The pancakes were comped, but the fact that something that burned made it out of the kitchen is not a good sign for quality control.   On the plus side, the prices were reasonable ($11-$13) and with some refinement, this could be a decent neighbourhood restaurant. However, given the wait times and the food quality, this is not somewhere that I would recommend going for brunch until they've gotten their processes more sorted out."}
{"text":"One of the best fried chicken that I have ever had, friendly great service, reasonably priced, very good selection of beers, a must if visiting Toronto"}
{"text":"The Mushroom Gravy Fries and Brik dogs were really good and the service was really friendly. We got lots of good recommendations from the owner, or at least he seemed like he was the owner! The Brik dogs were battered and deep fried Longaniza, I think. We also got the deep fried cauliflower, but we were not a fan of those, they were a little undercooked, soggy, and also a bit bitter.  We definitely could have gone without ordering that one.  This is a nice place for a beer and a small deep fried snack with friends. It was really dark, but had a few TVs playing the Jays game. And it was strangely dead we went! I think we would go back if we were in the area and the other places around were closed...  We had to take the deep fried cauliflower to go because it was way too much food for the two of us, so they packed it in a takeout box and put it in a Staples bag. Lol! A little unprofessional but it's cool, it was just a bag.  Food was just okay, but the service is super friendly!"}
{"text":"Incredible. Food is some of the best I've had in my life. Stayed close by on a work trip and ate here happily every night. Staff is amazing and incredibly nice people. Solid beer choices and strong well drinks. I made a Yelp just to leave this review. Do not hesitate to eat here, or just stop by for casual drinks. Atmosphere is great and I honestly just love this place"}
{"text":"Over anything the service and vibe was amazing.  Nice little bar with an owner who genuinely cares. Food overall was good.  We got sweet wings  (amazing) and chicken and waffles. Over the course of the evening it got busier and the vibe was great. Definitely coming back!"}
{"text":"If you are looking for a nice cozy place to have good drinks with good company while indulging yourself with some old school 90's music,  hand picked by the owners.  This place will leave you a nice friendly vibe for many times to come."}
{"text":"Outstanding fried chicken, waffles were absolutely delicious.  Great decor and great service."}
{"text":"Everything was excellent! The food, the service, the music, the drinks, the atmosphere and the washroom. I cant think of an improvement that could be made. This is such a clean low key spot. Try the sausage dog, you won't be disappointed!!!"}
{"text":"Came here from New Jersey and it was definitely worth it! amazing food, service and drinks!!"}
{"text":"De-fricking-licious! Tried the fried chicken with cornbread waffle, mac and cheese bites and the briik dog. Highly recommend this place. Can't wait to return!"}
{"text":"Dark decor. Ok draught selection variety. Normal prices. Nothin special about the place really. Plain ok"}
{"text":"A small get together with Yelp Elites were proposed by Peter L., and about 9 of us made it to the Black Briik.  It was in unofficial-UYE.  Located just east of Dufferin on Bloor, it's an interesting area that has seen it's fair share of gentrification.  Lots of bars and small restaurants have been popping up in the area and since this is not my stomping grounds, I will probably not be able to get to many of them.  Luckily, many of us made it down to share a few drinks, try some good pub food, and share stories.  When you walk into Black Briik - just to make sure you know, the restaurant bricks on the outside is painted in a very deep black and yes, you could miss it in the dark, it is a small place with one awesome wall mural.  The mural covers most of one side of the restaurant and it is of the Toronto skyline.  We had their \"TM\" Black Briik Hot Dog, which is their take on the corn dog.  Deep fried Mac&Cheese, Wings, Chicken and Waffles, and fried cauliflower were among the other dishes.  Much like a lot of pubs, I found that there was way too many items in the deep fried category - I'd like to see if they will be coming up with some lighter fair.  Though they indicate that they are a Restobar, I think I would call them a gastropub.  None the less, the food was good, Francis the owner is hoping to expand closer to where I live - Cool!  The service was great, and it's always good to have great company when out on the town.    It was really nice to see a bunch of like-minded Yelper-nauts!  Cheers!"}
