{"text":"Bought a deal on Fabfind for this place. Went the last week to redeem it which also happened to be winterlicious. The owner said it could not be combined with any other offer (ie. not used with winterlicious) and they had no menu to choose from. The expiry date was also the last day of winterlicious. Owner blamed it on Fabfind (but as the owner its YOUR choice to accept it). I agree with the others she was rude and unaccommodating. There were others in our situation as well (i assume alot others). I ended up going at 8am (open time) for breakfast and the service was horrible... i got served dead last (even though a party of business people came in AFTER me they still got their food first - not sure what that was about). nonetheless i ended up being late for work and the food wasn't worth it. waste of time and money don't bother there are far better places."}
{"text":"Came here on a Wednesday night to find it nearly empty except for 2 other tables. We were warmly greeted by a server who was warm and very hospitable throughout the entire meal.

After reading the menu I settled on the Spanish risotto - chorizo sausage, asparagus, red onion, white gulf shrimp (aka the paella) for $25. The chorizo was chopped pretty finely, which was actually kind of nice since you could get a bit of it in each bite. It came with 5 large shrimp and the overall portion of the risotto was pretty generous. The flavour of this dish was nice and overall I really enjoyed it.

My boyfriend went with the miso marinated black cod - golden heirloom carrot puree, purple carrots, baby bok choy ($23). I was disappointed to see that it came with shanghai bok choy and not baby bok choy (one of my favourite veggies!). The carrot purree was very buttery, and tasted just okay to me. I've never seen purple carrots before... they tasted like yams. The black cod itself was great, but I think it's difficult to do this poorly. I often order the black cod since it's one of my favourite (go-to) dishes, and I've rarely seen it done badly. 

Since the black cod dish was on the small side, my boyfriend was still hungry and so we decided to get dessert. The server recommended the bread pudding - raisins and cranberries Crème Anglaise and fresh berries ($8). What a fantastic recommendation. I never order bread pudding on the menu because I picture it as a a soggy, gloopy mess, but this really changed my mind about it. Yum!

Overall, a great experience. I'd probably be back again, but maybe to try their brunch since they had some pretty tasty-sounding items on their brunch menu."}
{"text":"Trying to find a place to eat dinner without a reservation on NuitBlanche is equivalent to trying to get a cab on New Years. Mission impossible when you have 5 people! 

Lucky for us, we stumbled upon the cozy looking BLD (Breakfast Lunch Dinner) Restaurant on Adelaide east.  From the outside, the place looked completely deserted but very inviting with its nice red/white décor and candlelit tables.  

So why were there no people inside on a night like NuitBlance?  

Apparently the place does not want to promote itself (based on what one of the waitresses told me) they just like to grow through the word of mouth. If you ask me, they should stop this non-sense right now and promote themselves through various media channels because it could make so much more money on a night like NuitBlanche. However, I will do my part and spread the word. 

The atmosphere at the place is really intimate because it is split into two small seating areas. I loved having the table against the window. Also, the random movie snippets they have projected onto a wall really make for a great conversation piece. The only point of criticism I have is-they seriously need to get uniforms for the waitresses.  They were all wearing their own clothes which doesn't look professional. 

The menu was pretty standard, resembling something close to a high-end diner, featuring a variety of dishes from various cuisines- from Italian to Chinese. There is something for everyone.  I ended up having a Spanish Risotto for the main course and a flourless chocolate cake for dessert.  The risotto was  as expected. I liked it but my friend found it a bit bland...I say it's a question of taste buds! To me you can't really go wrong when you have bacon and asparagus in the mix! One of my friends had a tuna tartare for an app and loved it. 

Also, I'd like to note that the presentation of the food was very well done! Someone in the kitchen put in a lot of effort in decorating the dessert with fruits.  I am not going to lie, I kind of felt bad about destroying something so beautiful, but this feeling of guilt went away as soon as I tasted the chocolaty goodness!  Muaahahaha! 

All in all, this place has my vote! ;)"}
{"text":"I love this little place! Neat and very contemporary design and clean. I tend to go for their Sunday brunch. They offer breakfast too, but not a morning riser :(

Highly recommend the Egg in the Hole...thick cut toast...real thick, filled with minced turkey and pouched egg...very fulfilling. If you want to start your day with something sweet, Banana Bread French Toast is an alternative :) Personally I also like the Tuna Tartar...it was a decent size for an appetizer...its sandwiches are awesome too :D

Staff are super friendly and helpful. Definitely one of the hot spots for brunch :)

Its washroom is all the way down at the parking lot level...haha..interesting experience that you needa ride the elevator and use a pass code to enter the washroom :P"}
{"text":"Many of our office social gatherings end up at this place.  They're very accommodating and I like their food.  They have a fair amount of draught beers and a decent wine selection.  I can't help but order their hand cut fries with sea salt and rosemary.  They're delicious.  The only downside about this place: they do not have washrooms.  It's down a few levels or up.  

They offer a nice selection of lunch items as well, unfortunately a bit on the expensive side."}
{"text":"A pricey bistro type restaurant.  (at least it ...was)   

The first sign of trouble was when BLD (apparently standing for Breakfast, Lunch, Dinner) stopped serving breakfast.  Then came the high staff turnover, replacing some great staff with some very young, very inexperienced servers (yes, we noticed).  As of this morning those walking by the storefront observed that everything that wasn't nailed down was removed over the weekend, leaving only a few chairs and items that couldn't be hurried out in the middle of the night.  There was no bailiff's notice on the door, nor a notice of any kind (not even a thank you to customers), which leads one to assume the folks chose to abscond with the contents before they could be seized to pay possible back rent.  One hopes the employees received their last paycheques.  I am sure they earned them.

The food itself at BLD was...OK.  It was always more pricey than it needed to be. Whether this was out of necessity, or simply an attempt to appear more upscale, their pricepoint was consistently 20 to 25% higher than other alternatives in the immediate vicinity, with no apparent reason.

I would give three stars for the food.  (I tried their pork schnitzel sandwich last week which was greasy beyond description.  I compare it to those sausages you buy from the street vendors - eat it once and it repeats all afternoon), about the same for the service, but to run out in the middle of the night is beyond comprehension.  The verdict - 0 to 1 star.  I just hope they don't open under a different name somewhere else and do the same thing to a whole new group of employees.

BLD is RIP, and I'm A'OK with it.

What a shame."}
{"text":"Went recently with a group of five. Our oysters were quite small and just not great quality. Though the other apps and our main courses were all terrific. I had the blue cheese encrusted steak and it is literally one of the best steaks Ive ever had. Atmosphere was very nice, though our waitress was not great. Very rushed and made numerous mistakes - forgot our menus, didn't refill water, etc. All in all the food was mostly delicious, service was mediocre, atmosphere was suave."}
{"text":"Really nice small bistro style resto with a modern contemporary decor and a unique fusion cuisine menu. Great for drinks before heading somewhere else, or for a client meeting, or just for a romantic dinner. Tried the lasagna and the Japanese style fish and chips. Both were really good. Just be aware it's expensive and there is very limited seating, so reserve during busy times."}
{"text":"Server was nice but FOOD WAS ABSOLUTE CRAP! Manager was also incredibly rude when we expressed our concerns. DO NOT GET THE FISH AND FRITES.. TASTES LIKE CANDLE WAX!  The mushroom salad is also extremely small. All in all stay away!"}
{"text":"Lovely place, great staff  - so friendly and helpful - great music and ambience. The best buckwheat pancakes I've ever had are served here. I've had them for the third time today and honestly they are just getting better. For those on a low gluten diet well worth a try. My fav brunch place in Toronto by a mile!"}
{"text":"Took a chance on a fabfind deal.  Butternut squash was delicious. On og the specials was lamb chops,  Done to perfection.  Will go back and pay full price."}
{"text":"New place, modern look. A bit pricey but okay. Met the owner, a very nice and professional lady with experience in the industry. Available for private parties."}
{"text":"I came here for lunch on a weekday with a friend. I chose this place based on the location and yelp reviews. I was pretty disappointed with the experience. Overall it was mediocre.

There were only two or three other small groups in there during lunch, which I thought was odd. We shared the fried calamari to start. For the entree I ordered the white prawn sandwich and he got the grilled chicken sandwich. 

My drink was fresh brewed iced tea with lemon and mint. The iced tea was great and really refreshing, a nice tea flavour without being too strong. As for the calamari, the batter was crispy, breadcrumbs and a mix of spices. There was an unidentified spice that gave it an odd flavour and the batter did not want to stay attached to the calamari. With each bite I was getting either calamari or batter, but not both.

Our entrees came and each sandwich came with a side salad. This was a nice idea, unfortunately it was drenched in the oil and vinegar dressing. Both sandwiches were grilled, which adds a nice crispiness to the bread. The sauce in my my sandwich had too much pepper in some spots and I think there was a taste of something being too char broiled. I didn't have a taste of the chicken sandwich, but his comment was mediocre. 

We didn't have dessert but stayed for coffee as we chatted. The coffee was fine. I guess the good thing about the place not being busy is that we weren't rushed out.

Being so sparsely populated during lunch isn't a great sign. With so many other places to choose from in the area, this wouldn't be my first choice. I wonder how this place does for breakfast and after-work drinks or dinner. The bar looks pretty well-stocked."}
{"text":"BLD: aka Best Lunch Date evar! I mean it did last a few hours. It is a rare treat when I spy grilled calamari on a menu and even rarer when it's seared to just-undone perfection. Paired with watercress, orange slices and a sweet-tangy-spicy fennel, it was a party in my mouth! 

Letting us stay on, the staff offered up their wi-fi password as we sipped on afternoon cappuccinos. Might I make a recommendations, Toronto? Get here for a working lunch. You'll eat well without breaking the bank and you can walk off your lunch with a *trek* to the little ladies room. 

Directions to the washroom: Exit the restaurant by the rear, turn right. Turn left in foyer of the office building. Board the elevator. The womens washroom is on the second floor, in the direction opposite of the restaurant. Let your dining partners know where you're headed so they don't wait to dig into their meals. There's a high probability yours will be cold by the time you return from your loo mission. But the staff are well equipped for such an event - they'll happily keep your meal warming for you if you ask."}
{"text":"Here's the inside scoop, BLD stands for Breakfast, Lunch, and Dinner and this place delivers. It has an ultra modern chic feel of a new age diner. The food is clean, perfect, and very well presented. The service is friendly and very timely. I loved the fact that they we're playing an old black-and-white movie on a clean white wall. I'd suggest that you give it a shot. So far, BLD rates as my most suggested restaurant on Toronto St."}
{"text":"Sort of a strange mix of really positive qualities and really questionable practises.  For starters, I was there with a group of four on a weekday night.  During our two hour dinner, we only saw two other tables of people come and go.  The place was empty. 

The decor was very nice.  And the food was quite good though some of the menu items were a bit on the pricey side (eg. Chicken Supreme was only $20 but Rack of Lamb was $38).

The service was not even so quick considering how empty the place was.  There was one server, one bartender and then 4-5 people in the kitchen working on the 6-8 dinners being prepared that evening.

Two criticisms of the space: (1) there is not washroom in the restaurant and you must exit into an office building, take the elevator down two levels and then key in a four digit code just to find some relief; (2) they didn't really do anything to make us feel like welcomed guests - meaning despite the fact that the place was empty, they didn't offer us anything gratis, including bread, which was not provided.

All in all, not a bad dining experience.  I'm sure it would be doing much better if on the West side instead of the East side...not sure it will be around much longer so if you like high design and decent cocktails, go now!"}
{"text":"BLD has impeccable decor, excellent food and top notch coffee. I was the only patron on a sleepy Tuesday mid-morning, and had an excellent experience. Polite and friendly staff quickly served me, and weren't overbearing. Dishes aren't overflowing with extras as you might find at other places, but were perfectly filling without making me overstuffed. Love the clean, black and white decor. Will definitely return on my next trip to Toronto."}
{"text":"I ended up dining here on a Saturday evening using my deal and was surprised at how lovely the restaurant looked. The interior was classy and seating was small but intimate which was a nice change. 

I had the Boullaibaise which consisted of Pacific halibut| salmon|white wild gulf, shrimp|P.E.I.Mussels|little neck clams |calamari| spicy red pepper rouille| grilled baguette and my sister had Pappardelle Pasta, which is gourmet mixture of roasted
mushrooms|salsify|porchini leek jus| shaved Grana Padano. Both dishes had unique flavours and definitely did not lack flavours, it was absolutely perfect. 

We had a peach bellini and mimosa to accompany our meals, I can say their drinks are lacking but the food made up for the downfall. I would dine here again for their wonderful tasty foods and their excellent service. Our server was not very knowledgeable about the ingredients but there was another lady there who was very kind and explained to us the difference in the ingredients and also recommended us which dishes to choose. 

PS, this was back in December 2011 when I dined here but got around to reviewing it right at this very moment."}
{"text":"Nice decor, friendly service and truly delicious meal. We had grilled calamari, mussels in white wine and blue cheese broth and grilled red snapper with garlic confit. Yum! Highly recommended!"}
{"text":"Sometimes when food is really good, you're willing to forgo all diet restrictions (dairy, deep fried, fatty etc...) and I'm really glad I got to break the rules at BLD where I dined on quite possibly the best fish and chips ever!!! 

I brought hubby here to treat for lunch as he was a very good errand boy the other day and felt he needed nourishment after all the shlepping of shopping bags! Well I think BLD has now become our HG financial district lunch spot!

Upon entering BLD we notice it is all class and modern refinement as the interior was lined with elegant lattice formed bar stools and on the ceiling is a lovely light fixture that somehow resembled origami boats floating on a mirrored river.  The service here is very pleasant as the hostess was very welcoming and made sure we were well looked after by the very cordial waitstaff.

Hubby ordered the market oysters and the Lobster Ravioli with bisque, and although the Lobster dish seemed small in size it was very rich and filling, in a good way.  It's also nice to know that the ravioli is made in-house using only the best tail meat. 

 My starter was the Caprese Salad Kumato tomatoes with Ontario buratta, basil with an aged balsamic reduction and Tenuta di San Guido olive oil.   So, was it worthy of going against my no dairy restriction?? YES Absolutely!!!  The buratta was half soft and just the right amount of creamy/malleable texture to couple with the sweet tomatoes and the tart balsamic drizzled greens and pesto for an orgy of caprese'd goodness.

Now back to the best part of my BLD experience, the Japanese Inspired Fish and Chips!  This entree features tempura battered aspiration ( like a young broccoli/ rapini ) with succulent organic Irish salmon chunks (skin on) and fine matchstick frites.  Seriously amazing and probably the best $23 I've ever spent!  The batter and the combination of the salmon and aspiration is pure palatable genius with a batter that is perfectly light and flawlessly crisp, accompanied with an excellent tartar sauce that is punctuated with tasty salted pickle bits (don't you just hate sweet tartar sauce? Eck, I do!)  

Good to know :  Being that BLD is housed inside a Heritage building, in order not to compromise the plumbing and infrastructure, the washrooms for BLD are accessed by elevator down two floors, but hey that's okay because one has Kegels to thank for bladder control.  BLD also has an alternate entrance where food can be ordered for Take-Away.

Yes it's a bit pricey and it doesn't help that I'm notoriously a cheapo when it comes to lunch, but I really felt like BLD is indeed worth it for every delicious morsel!  From the excellent service to the chilled out atmosphere, the lack of meathead business types and most importantly the incredible food, give them a try and I guarantee your tastebuds will be spelling out BLD anytime you're in the financial district."}
{"text":"\"You down with BLD, ya you know me\".  Okay, just had to get that out of my system.

Checked out BLD for dinner with the girls during Summerlicious.  Arriving around 6:30pm on a Thursday evening, we were seated in a smaller room sectioned away from the main bar area.

I noticed that the tables were quite close together so if you feel the need to tell someone about the rash on your genitals, this is probably not the place.  It also got a bit loud as the room filled up so you really don't want to be screaming \"I have an itch I can't scratch right now\" while your fellow dinner neighbours listen in.  Not that I'm saying that's what we talked about...

The drink menu gave a choice of wine and cocktails.  Martinis and specialty drinks were in the $10-$14 range.  There was no mention of beer on the menu but my friend spied the taps behind the bar and asked the waitress.

They had some fantastic beers on tap including Cracked Canoe, Mill Street Organic, Mill Street Tankhouse, etc.  Nothing to be ashamed of at all so I don't know why they don't include beer on the drink menus.  The waitress mentioned a special beer on tap called Lawnchair by a Ontario brewer by the name of Hop City.  

Being a beer lover, I always get excited when I learn of new Ontario craft brews.  After sipping from my friend's half pint, I decided to get a full pint for myself.  It's a wheat beer but far superior than it's competitors like Mill Street Wit or Amsterdam Oranje Weisse.  Full of fruity orange flavor and very refreshing.  I'm definitely a huge fan and it may quickily become my beer of choice for the hot summer months.  Hop City is owned by Moosehead (shocking because Moosehead is swill).  I'm definitely interested in trying more of their brews if they are as good as Lawnchair.

Back on track to the BLD review - For starters, we ordered the grilled calamari, tuna tartar and cucumber gazpacho.  A good beginning to the meal.  

For mains, I ordered the fish tacos and the other ladies ordered the burger trio which included a beet, lamb and beef burger.  The mains arrived on white rectangular plates, no garnish, no sides.  Very minimal.  We figured that generally burgers will come with a few fries or maybe a pickle?  Nothing.  So the portions felt a bit skimpy.

The fish tacos were good, not outstanding, a bit on the bland side.  The ladies voted the beet burger the favourite from the trio.

Dessert course - we ordered the Cinammon Merlot Poached Pear and the Asian Pear with Orange Segments.  Two super simple desserts, a refreshing end to the meal.  The poached pear came with a single scoop of vanilla ice cream.

Service was efficient and quick.  All the courses came out at a nice pace.  Our waitress gave us some BLD purse hooks at the end of our meal which was a lovely parting gift.

We did have to take the elevator down one floor to the bathroom and enter a code to get in but it's not really an inconvenience at all.  

For the Summerlicious price of $35, I didn't feel that it was a meal befitting that price range, mainly because the portions were small-ish, with no sides or accompaniments."}
{"text":"I came here for a Summerlicious lunch this year, and I have to say that I was pretty disappointed. Both my friend and I ordered the cucumber gazpacho to start, which she aptly described as \"a facial in a bowl\". It had this strange...unique...flavour which wasn't necessarily bad...but it wasn't good, either. The strange gazpacho was followed by a mushroom papardelle which was actually quite good - I would say it was the highlight of my meal, with a creamy, flavourful sauce and fresh ribbons of delicious pasta. For dessert I had the \"BLD bread pudding\", which turned out to be not like authentic bread pudding at all and more like two slices of dry bread sitting on top of a puddle of creme anglaise. 

Service was quite brusque, and there were obvious dirty fingerprints all over my plates. *Mysteriously* it was only after I whipped out my credit card to pay for lunch that our server suddenly became all amicable. This might be sad to say, but for $20 I would have rather had a burrito and a beer for lunch."}
{"text":"Joined by the incomparable Crystal H, we snagged a sweet lunch at the BLD restaurant on Toronto street. Only a few doors down from the famed Rosewater, BLD is a classy and chic locale. The inside features stark white walls with plexiglas magenta panelling and groovy artwork. We dined under an ink (and what seemed like coffee) canvas of Mick Jagger's head. 

My roasted chicken and brie on sourdough with pear and cranberry chutney was perfect; it was Christmas dinner in a sandwich. Washing it down with a minty home-brewed iced tea sealed the deal.  And they were quite cool when we pulled out our laptops and set up shop. They even have wireless Internet. Just ask for the password. Cool spot!

Obligatory Title Pun: The BLD and the beautiful.

Menu Readability: I like the layout, but the use of a script typeface is a typography hate crime.

Need to mention: They lose a star for the Loo Situation: the washrooms are FAR from the restaurant. You gotta head up to the 2nd floor of the attached buildling; they're around the corner from the elevator.

What this place teaches me about myself: It's not at all creepy eating a sandwich under the impassioned stare of a Rolling Stone. Who knew?"}
