{"text":"I have been here for dinner many times. In my opinion this has become the best Chinese restaurant in Mississauga. The food is authentic Chinese. In here, the beef tastes like beef, scallops taste like scallops and not altered by some artificial sauces; in fact their taste is enhanced by good cooking techniques. Sometimes I noticed the lack of salt in some seafood dishes and had to ask waiters for salt, not a major problem. The ambience is pleasant, the restaurant is spacious, not too noisy, has nice chandeliers. Even the outside of the restaurant, parking lot and the entry door are quite nice too. Part of the ambiance I don't like is the tinted windows and drapes that block the outdoor views. Service is not fabulous but not unpleasant."}
{"text":"I've been worked in this area for couple of months, it's my first time visited this restaurant, ordered a BBQ combination (roasted pork and BBQ pork), I rate it a 5 stars, it's sooooooo good. Beside the BBQ I also got some dim sum, I could tell they're good, but no surprise. That's why I rated this restaurant only 4 stars. Definitely will recommend to my families and friends."}
{"text":"I wanted to write a scathing review of this so-called fine dining restaurant but Wen L pretty much summed up my experience with a party of 14.  Service was incredibly SLOW and I couldn't believe the rice was served after the main course.  I think the waiter assigned to our table was a trainee.  We didn't get water until after 15 minutes.  The food itself was alright but nothing special.    And the one thing that bothered me throughout the night was the blood curdling loud voices of the staff yelling at each other across the room to talk to each other.  Don't waste your time here."}
{"text":"The worst Chinese restaurant I've ever had in Mississauga. I know it's Friday so would be busy as usual but they have plenty tables aren't reserved and still gotta let us wait for about 20mins. They have two wifi for customers which is good yet none of them is working sadly. You can clearly seen that they lack of servers and can't handle well under stress or busy condition. When you requested for something, you gotta ask for at least twice in order to get what you need. What even worse was they served soup after we ordered but took 50 MINUTES to serve the FIRST dish! Really?!! The food quality is average though. But sorry I'm not coming back."}
{"text":"We came to Toronto for vacation and the Chinese food.  My aunt brought us here for dinner and the restaurant was simply amazing.  The duck was super juicy with right amount of fat and meat on each piece.  The roasted pork and BBQ pork was so good.  We can't compare food from State side to many of the Hong Kong chefs who now reside in Toronto and Vancouver.  The dishes were innovative not something you see much in Chicago.  The quality and service was impeccable.  We also had dim sum here and everything was really good.  I was impressed by their desserts.  The steam milk was similar to what they have in HK.  They had these amaze sesame ball desserts with peanuts crumbs on top were delightful.  The sweet Tofu was great.  So silky and smooth and it doesn't break so easily, good consistency.  I'm pretty happy with both trips here.  I am definitely coming back here next time and recommending to my other friends when they visit Toronto."}
{"text":"Overall Impressions: 3.5 stars and I've been here a few times for dinner and lunch. I usually dim sum in RHill/Markham/Scarborough, but Bliss is probably my favourite place to dim sum when I'm in the west end. That's why I keep coming back  Food: Overall the dim sum was reasonable. It was not top notch quality but definitely average and satisfactory. I was served some BBQ pork buns that were room temperature, which was not exactly pleasant. Food here at dinner time is decent and we've been even done Chinese New Year dinners without any issues. I would say the service is actually better at night..  Service: This is the type of dim sum where the food comes, but empty plates do not leave. New food and plates will stack on your old ones. You're expected to clear space for them to put more food on the table. Otherwise everything else was fine. The service was reasonable and my expectations were met, but not exceeded.   Parking: This parking lot is busy at times since it's shared with a sushi restaurant."}
{"text":"Been twice.  1) Dim Sum Lunch - one of the better quality dim sum places around Mississauga.  Overall, good taste and assortment offered.  The bbq combo/rice was of excellent taste and value.  Note that the prices are slightly here than the standard.  However, nice décor . . .  2) Dinner - tried dinner special for 4:  a) roasted duck - good taste and tender; b) fish & celery - also good and not oily; c) pork chops - nicely seasoned and fried; d) beef & gailan - good quality beef and veggies were fresh.  Unfortunately, the dessert was awful!  Chopped walnut in sugar water :(.  Not sure what happened here!  Price is again marginally higher than standard"}
{"text":"Went for a family new years dinner.  Very clean and spacious space.   Had very typical menu but the order was a bit messed up.  First came soup then Peking duck then fish?  Fish is supposed to be near the end of the meal not the third dish.  Fish came before the bbq meat plate.  Wha??? You hard core Chinese food lovers will understand my confusion.  That aside the food is delicious and the bbq especially so.  Hope to be back for dim sum soon."}
{"text":"3 stars earned because it was the best wonton soup I ever had, and our waiter was friendly. Overall though, the building decor is outdated, and the fried noodles I had were so crunchy and oily that they tasted bad. I would go back for the soup only."}
{"text":"Absolutely awful and ridiculously expensive.  Probably some of the worst Chinese take-out I've ever had.  Perhaps the dim sum is better but I'm not going to risk it, I'll stick with Perfect Kitchen."}
{"text":"i went here on a whim to get food for a quick bday meal, BOY was I delighted! food was fresh food was well prepared and tasty service was friendly and accomdating (no addes msg please) this was not the typical N.American-Chinese fare, this was very good! chicken fried rice (for papa) was one of the best i ever had fish with mushrooms and snowpeas was excellent! ho-fan noodles were very good, they were black bean ho-fan very well done my family will always go back here now!"}
{"text":"It's the best chinese dim sum place I've tasted in Mississauga. I have been looking for places for dim sum for a long time, finally found it! Some of the food really reminds me of the food in Hong Kong."}
{"text":"This restaurant has gone through a few changes of ownership. It was closed down for a while. I came here for dinner with my family.  Since Mississauga doesn't have too many options when it comes to authentic Chinese cuisine, Bliss offers another option.  It's nothing exciting but serves it's purpose. Stick with ordering dishes that are typical.  The fancier dishes were not good. Service is ok. What one would expect from a Chinese restaurant."}
{"text":"I went here 30 min after it opened on Sunday. There is no wait and service is quick. There is $1 tea charge per person which I am not sure if normal for dim sum. It is $3 for small, $4 for medium, $5 for large. This is more expensive than Markham dim sum but the portion is bigger and quality is better. Good for my dim sum cravings lol not many dim sum place close to this area."}
{"text":"We had come in advance to work out a menu and pricing w/the manager for my sons confirmation dinner ,a set menu and and price 350$ 15% gratuity included, we had a party of 12.  The service was awful, this is the problem with set gratuity.  The dishes came out at incredibly random times and we had to sit and wait ALOT . dishes that should have been apps came last and vice/versa although the food was ok all guests left hungry!  We constantly had to ask for things, Evelyn, you had ample time to make my sons confirmation a memorable and enjoyable experience instead you took our money and basically said, fuck it they've already paid so why should I give a shit!  Too expensive for what we got.  And service deserved absolutely no tip!"}
{"text":"This Chinese restaurant is the most authentic in Mississauga for Chinese food. Dim sum and dinner are great. They serve good quality and good dishes."}
{"text":"I was pleasantly surprised that Eric - Managing Partner, personally contacted me via yelp message to apologize for my dining experience in my previous review. He explained that this is a new restaurant and inevitably there are hiccups in the kitchen and service. I think he is being honest about it and by reaching out it shows that he cares about his business and not just an investor. I will return to this restaurant again in the near future. I am sure that my review have given him an outsider's unbiased opinion of a dining experience and will help him to focus his attention on the problems."}
{"text":"Went to bliss with family for dinner. 4 of us had the dinner for four combo (Starter soup, BBQ chicken and duck combo, mushroom vegetable, ginger and onion lobster, steam tilapia, finish with Chinese dessert) for $73+tax+tips. Cash only deal. It was quite busy but the service was good. Food quality is good as always. I really love their BBQ, very tasty. The combo used to be much cheaper last year. I think if they don't raise up price that much, I will come to this place much often."}
{"text":"Awful experience. Every time I go I'm surprised by the bad service and rudeness or the waiters and waitresses. Their owner / general manager is the worst. We arrived at opening and the manager hasn't even gotten in yet. They haven't cleaned up from the day before. And he was 8 min late from opening. No apologies. And said 'well there was traffic'  on a Saturday morning at 9:30am? Yeah okay bulls hit. There's not a car on the road.  We just turned around and left because he was so rude."}
{"text":"Check this place out . Restaurant it self was clean and fancy . Order deep fry squid and pork chop . Potion was in a small side and it was lacking on flavor.  Cantonis chowmeg was ok . Beef with Chinese brocoly was good . Soup was ok as well . Food was ok price was on the high side . Service was ok . They demand 10% tip . I always give 15% or more . Will not go back . But I did not try there crab or lobster or fish ."}
{"text":"They don't have dimsum during the dinner time and their prices are very high.. you can see after a certain hour they don't care about the customers they just want you in and out so they can have their own meal at the end of the night"}
{"text":"Family and I have been to bliss numerous times over the years.  Food is consistently good and normally service is ok.  However, the service we got today was just BAD!  We asked for chili oil that took 45 minutes to come after we asked for it 3 times.  Server forgot to leave the Worcestershire sauce for the beef balls we ordered even when it was on the tray.  We asked for that and it never came.  The servers put our noodles and fried tofu on top of dimsum baskets that still had food in it. No one came to pick up empty plates and dimsum baskets so we were moving them to the ledge beside our table to make room for other food we ordered.  Even ice water kids wanted took 3 times of asking before it got served.  Also, one of the servers bringing food was just so rude!  Anyway, we won't be going back there anytime soon."}
{"text":"Best Cantonese I ever had in Canada and US: the food is great, the waiters/waitresses are very professional and attentive. Overall great experience"}
{"text":"Food is okay but nothing compared to a wide array of choices in sauga.   They have a pretty restaurant with pretty chandeliers. It's a bit different with its glass running down one whole wall.   The problem is the service, it's almost constantly bad. If their food and dimsum was as good as sam woo maybe they'd have an excuse.   But on a Friday night at 6pm with a half empty restaurant,  you'd think you would want to treat the customers nicely so they'll keep coming back but no.   Request a waiter and they ignore you, ask for water and they serve 4 other tables and gets them drinks before you have to ask them again.   Just not worth your time. Perfect kitchen is on the west end too and I'd much rather line up for dinner than sit in a sad and frustrating restaurant."}
{"text":"We went there for dinner and had the set menu for four which included crab, chicken, buk choy and beef. Soup and desert was complimentary. We also ordered the Peking duck. The quality of the food was good and tasty. I was surprized I had to pay cash for the deal but that was ok. Luckily I had enough. I usually don't. You might want to check and prepare before you go for these set menus. The ambiance was nice and airy. It was not busy  the evening we went. The meal for the four of us costed $160 which I found a bit dear. Overall a pleasant experience."}
{"text":"Pretty big dinning room. Dim sum is top notch and about the same price as other Mississauga dim sum joint. The difference is that you order from a sheet, instead of someone pushing carts with food around."}
{"text":"Good dim sum in Mississauga that has good quality food for reasonable price. The place is also clean and inviting. Good for hosting large groups. Ordering is easy with the order form. Unlike traditional dim sum , they don't push the carts around so it is a quieter dim sum experience. The place was full with Chinese customers as well as foreigners, so it caters to all. Service was reasonably fast and the staff were very friendly and accommodating. Its location is convenient in northwest Mississauga since usually the Chinese restaurants are concentrated in the middle or south side of the city. Will come again!"}
{"text":"walked into a huge place for lunch and it was getting busier..service was fast and the food quality was good...I had the schezuan beef with rice...got a mountain of rice and smaller then expected portion of the beef"}
{"text":"Service is great. Peking duck is the bomb - dot - com!!!!! Crispy fatty duck skin is my weakness & these guys do it right!  I.ve had my share of Peking ducks and this one is legit. In general their dishes are good. I recommend. I am definitely coming back for more....duck!!!!"}
{"text":"This was the first time I had been to this restaurant after hearing so much about it. For a good dim sum experience this place ranks high on my list for Mississauga locations. Since everything is picked from a list of items instead of the traditional cart service all the food was hot and tasted well.   If you're looking to bring some people who had never had dim sum before this is the better place to take them. The food is standard and doesn't look intimidating or unappetizing like some restaurants.    The tables are pretty close together so it can be a tight fit with other tables and the staff do make mistakes often. But if you're able to look past this the food is pretty good for Mississauga standards."}
{"text":"The dim sum quality is probably the best in Mississauga. I would totally recommend it. The only thing I would say is that the line up are crazy, but it should open up for a reservation option."}
{"text":"Delicate, flavorful, and quick service, this place is my family's favorite dim sum location in Mississauga. Although not the cheapest dim sum alternative in Mississauga, would highly recommend this place. Large and spacious seating, but high traffic during lunch hour on weekends. Food comes out promptly, attentive service is acceptable but not prestige, food is slightly on the oily side but so flavorful! Super tasty for anyone looking for authentic dim sum. Feast away!"}
{"text":"Had the Peking duck special on fridays, excellent. Service is good too"}
{"text":"For sub par chinese food, the prices are way over priced.  But i guess you pay for the nicer atmosphere?  I would choose many other restaurants over this though.  My fried rice was dry, my beef was over cooked.  Took forever to get hot sauce.  We thought that this place had all day dim sum, based on the description but it does not.  standard chinese restaurant service (which for the looks and price and location you would expect more)  I would go to Kinsley over here."}
{"text":"Had dimsum lunch with my parents on a Sunday and it was way more packed than I expected. We took the last available spot before people had to start waiting for seats. Moderately attentive service, although our teapot was forgotten but other than that we were quite well attended.   We ordered pumpkin and scallop steamed dumplings, beef ribs with Maggi sauce, preserved meats on rice in a clay pot, bean sprout tips and oyster mushrooms in rice roll, plain rice roll and durian pastry. Lots of scallop, very fresh; beef ribs were deep fried instead of grilled but it tasted alright; typical preserved meats, maybe a bit more fatty than usual; bean sprout tips are in season and they were very tender!! And the rice rolls were very, how to say, elastic-y? Which is good!; same with the plain rice rolls which comes with sesame, soy sauce and sesame sauce/hoisin sauce; I don't really eat durian things but I wanted to try this and it was pretty good I think, the pastry was warm and although there could be more durian filling, it wasn't too sweet and had a strong durian taste.   Overall I had a good experience and I'm happy to see that they have a lot of good business because the restaurant before this location wasn't doing very well. Also there are a lot of unique kinds of dimsum rather than the boring typical \"favourites\". It's good to see variety and good execution of the variety too."}
{"text":"Food is better than the average dim sum place but the service is terrible.  Tried to pay for the bill and not let my relatives know by going up to the till to only get berated by the cashier for not having the bill.  Even describing in detail where I was sitting and what we ate she continued to talk down to me , followed by a bus girl talking down to me because I wanted to surprise my relatives by paying the bill.  Luckily a waiter overheard and kindly grabbed the bill nonchalantly and helped me out.  I speak fluent Cantonese and communication was not the barrier."}
{"text":"Honestly a really bad restaurant experience.   At a certain price point, you need to demand a certain level of service. Nice cutlery and serving platters won't cut it anymore.   We ordered snow pea leaves with garlic ($16), tofu with scallops in a black bean sauce ($19), and deep fried spicy pork chops ($15). I've had far better snow pea leaves--you really can't charge that much for stir fried vegetables and get away with a great review, but we were craving it. The tofu with scallops was fine, I have no complaints but no great remarks either.   We waited like 30 minutes for the first two dishes--that's fine, whatever. But when we waited and waited and received no word on the remaining dish, I knew our waitress has failed to order it. When we confronted her about it, she didn't even apologize. I was honestly pretty upset and cancelled the order.   I mean if you're going to advertise as a higher end restaurant, you better act like a higher end restaurant. Because your prices certainly preaches a class you can't handle."}
{"text":"Great place for dim sum in Mississauga.  Good selection for vegetarians & newly open.  Spacious private room!"}
{"text":"serviceable dim sum spot with elegant, banquet hall-esque decor.  popped in on a sunday shortly after noontime, and it was quite busy, but we only waited about 10 minutes to get seating.  the waitstaff were friendly and attentive.  bliss operates on dim sum orders rather than carts, and i prefer the latter because it's more fun and significantly reduces wait times for food - it took roughly half an hour after ordering for our food to get to our table.  our party ordered our usual favourites, like siu mai, har gow, beef spareribs, snow pea leaves, squid tentacles, congee, shrimp spring rolls, beef brisket noodle soup, and egg tarts.  everything ranged from good to great, except for the noodle soup, whose broth i thought was lacking in flavour.  prices were on the higher side, but that's forgivable since the food was enjoyable.  i would easily recommend this place to anyone, but i do think there are better dim sum restaurants in mississauga"}
{"text":"Excellent Chinese food in Mississauga. ...they have dim sum at lunch....yes i said dim sum....It is a very clean and beautiful restaurant. ..more on the upscale side.  Food is great but you will pay a little more than the average. I dont know how more people do not know about this place."}
{"text":"3 because I only got to try the dimsum and it was really good. A lot of selections and affordable. Service was really quick and mind you, very polite as well."}
{"text":"I don't usually give low ratings, so, when you see me giving such low rating, you know how bad it must had been.  Tonight was disappointing. First they wouldn't let us make a 6:00 reservation, saying it must be either 5:30 or 7:30. We got there at 5:30 and the place is almost empty. At 6:30 it was just half full.  Then, they gave us only one of three holiday menus and also the regular menu.   We didn't like the special set, so we ordered the regular set. It took them 5 minutes to come back saying the regular set is cancelled and asked us to choose from one of the sets from the special menus. We didn't like the for-6 menus, so we picked a for-4 set and added another three dishes for our party of 7. A minute later, they came back to ask if we would like to upside our soup that use meant for four. We said \"okay\". A minute later, they came back \"strongly\" recommend us to upgrade to one of the for-6 set, since we upgraded the soup.  Then the food take a long time to arrive, even for the soup and the BBQ dish. The dishes were nothing to get excited about. Apparently they are not able to keep up the standard in service and food. We are leaving at 7:20, and the restaurant is barely 75% full. Chance of us returning? 1%."}
{"text":"Overall Experience: 3.5/5 Above average for a Chinese restaurant in Mississauga. Given that there aren't any legitimate Chinese restaurants in Oakville, this is my go-to spot for Chinese food that's relatively close. I've come here for Dim Sum and dinner and both are pretty good.  Food: 3/5 Dim Sum is above average, and almost always comes out hot because it is made to order. Portion sizes are your typical Dim Sum portions.  Dinner menu items are good quality and taste, with portion sizes being a little better than most Chinese restaurants.  Service: 4/5 Service is fast and friendly, and the wait staff accommodate your requests in a timely manner. However sometimes they tend to bring out all your food at one time.  Atmosphere: 4/5 The restaurant is clean and well-lit. It has a bit of a more upscale environment from your typical Chinese restaurant in Mississauga, however you pay for the premium.  Tips & Recommendations: -Deal on Peking Duck on Friday nights for roughly $30, cheaper than any other day of the week -Dim Sum on the weekends can become very busy, with wait times averaging 20 minutes for a table -Plenty of parking, with many spots behind the restaurant -Lunch Break Friendly? No"}
{"text":"Best dimsum in Mississauga by a long shot, good service and ambience...only downside is that it is pricier than its local competitors but you get what you pay for. Will def be back for more !"}
{"text":"I wish they allowed half stars!  Though I'm giving it a 4 star, it's really a 3.5 stars for me ***1/2.  It's not my favourite Chinese restaurant but it does stand out above most GTA West Chinese Restaurants.  Seeing how The Grand died nearly a year ago, GTA West doesn't have a lot of options for higher end Chinese Dim Sum.  There is the good My Perfect Kitchen but it's more 'homey' compared to the large, sunny, and nicely decorated Bliss.  We were able to make a 11 am reservations on Saturday for dim sum for a large table of 8.  I would say it definitely rates higher than other GTA West place but it also costs more too.  I dont mind paying the premium ... easy parking and quick routing to 401, fast service, tasty foods and lots of options of dishes.  Definitely one of the better spot for dim sum.  On a Saturday @ noon, the restaurant was about 60% full and it was a comfortable atmosphere.  Plenty of service attending the area and though you do have to flag them down, they were always helpful when asked.  The menu was vast with the typical staples (har gao, siu mai, steam buns filled with pork, rice rolls filled with beef or shrimp...) with some more interesting options (scallops and pumpkin dumpling, snow pea leaf rice roll, steam tofu skin filled with vegetables, tendon in a sweet savoury sauce...).  We ordered over 15 dishes for our group and they were delivered with a good pacing and all were super hot.  As with most busy Chinese restaurants, service could appear to be indifferent but it's more that they're being VERY quick and efficient.  They do smile here and appreciate a thank you :)  Without going into the details of over 15 dishes, simply said... a lot of it is good and would order again.  The best things would be their rice roll and anything shrimp.  The shrimp dumpling (har gao) was excellent as it had a soft thin skin that held up being steamed and picked up with larger than average and 'bouncy' texture (this is a good thing!! not mushy) shrimp.  The Rice roll with Shrimp had the same treatment... the shrimp was perfectly cooked and was definitely larger than average.  The steam buns were well done too.  I LOVE the steam bun filled with egg custard.  It is a sugary hit but ... what can I say, its like a creme brulee with the sugary crust blended up, then piped into a sweet fluffy white bun and then steamed till completely molten.  Be warned... sugar high inducing.    The good... Steam Bun with Pork Shrimp Dumpling, Har Gao Rice roll filled with Shrimp Rice roll filled with Snow Pea Leaf Steam Tofu Skin with vegetables Mochi balls filled with Black Sesame Steam Bun with Egg Custard  The decent... Pork & Shrimp dumpling, Siu Mai You Choi sum, greens Braised Tendon Deep Fried Mochi Ball filled with Pork, Ham Siu Gok Steamed lotus leaf wrapped rice Rice roll filled with Beef Rice roll filled with Deep Fried Fritter  Egg Tart  Probably won't order again... Pan fried white radish cake ... a bit too salty but if you like it that way Pan Fried Green Tea Mochi Cake ... interesting flavour but I felt it was a bit too greasy  It looks like a lot of dishes ... okok it is a lot BUT I would say we only covered about a quarter of the options.  A lot more offered on the menu still to be discovered.  To bring my picky family... I'll definitely return here."}
{"text":"Good dim sum. Hard working crew and food was above average for Mississauga. Some items were good and some were a miss. However overall price is decent and good . Recommend for non holidays and weekends as wait times can be long. Worth a try!"}
{"text":"Food quality was good but prices were high for dim sum, especially since we were there at 3 pm on a Sunday.  Menu ordering which for the most part meant every dish was to order cooked.  They also have Chinese BBQ offered.  Shu mai were juicy and flavourful.and servers very attentive."}
{"text":"Have been here a few times now for both dim sum and dinner.  The prices are a bit steep for what you get and the food is a hit or miss.  We've had pretty good food but also pretty mediocre.  I went today for mother's day not knowing that they only had specific dishes or meal sets available for this weekend.  We picked one but it wasn't what we would've normally gotten.  We got a four person set plus two extra dishes (set list of choices....a lot less than regular menu) which included the below  1. Suckling pig with the jelly stuff.... The pork was super fatty so after removing the fat there was barely any meat. The skin was ok crispy though. And even though this is normally an appetizer it was the fourth dish we got  2. Shark fin soup.  Was decent.  Nothing amazing  3. 3 veggie dishes... The veggies were either quite hard still or was chewy.  I had a bean that still had the edge part still attached (the piece you clean off so it's not stringy.... But it was just hanging there)  4. Lobster...ok size and flavor.  Also nothing special  Then had regular red bean soup for dessert.  All this for $200.  When it came time to pay we were gonna pay by card but apparently we weren't allowed because it was a set dinner. Even though that's all that they offered that weekend.  If we paid by card then we had to pay 10% more (sounded like they deduct 10% discount for set meals since must pay in cash)."}
{"text":"I came here to celebrate my mom's birthday because she wanted to try it again. We came on a Thurs evening around 730pm and it was not busy at all. So many seats were left avail so we were seated near the middle where the majority of the people were at. Bliss is a 'fine Chinese cuisine' so their dishes are more costly then other places in Mississauga.   We ordered: Peking duck (non lettuce wraps) $38 Chicken chow mien $14 (approx) Chicken fried rice $14 (approx) 3 crab claws $6/each  Out of the 4, my favourite dish was the peking duck and the crab claw. But this wasn't anything too special. It tastes similar to other places that offers the same thing.   Chicken chow mien was TOO salty and it's a little different then other places I've tried it at. Chicken fried rice is supposed to be set up as a pyramid (I saw other plates that came out and looked like that). Ours was broken which is whatever to me because most places just have it all on a plate but I mean if they're trying to follow their 'fine dining' theme, then it shouldn't have looked like that. I was actually too full to eat some rice but I had it for leftovers the next day and it was really dry and tasted kind of bland. The complete opposite from the fried noodles.  Though I enjoyed the peking duck and the crab claw, it's too overpriced for me to eat just that. I didn't enjoy any of their main dishes so I probably won't be coming back for the mains unless we're there for a big occasion since their restaurant is set up for large groups.   Aside from food and pricing, service was great!"}
