{"text":"Sorry, looks it's been closed for some time , given the state of  The store front ...see photo"}
{"text":"Mauritius is a tiny (Mississauga-sized) island in the Indian ocean, but it's actually quite interesting with a storied past and beautiful vistas.  I haven't been to Mauritius yet (my fiancee is from there), but if the Blue Bay Cafe is even a half decent representation of the food there, I will love it!  I thought it would be a fun surprise to take my fiancee here on her birthday, and she wasn't expecting it at all!  It's pretty awesome that we have a Mauritian restaurant in Canada, given that Mauritius' population is barely over 1 million, and even better that it is really good.    I've given away my bottom line, sure, but I wasn't expecting this place to be this good.  It's very Toronto (I'm from the burbs), so small, quaint and very non-corporate (all good things I suppose) as well non-trendy.  It's like, real, man.    We ordered the crevette au couer de palmiste (shrimp served with tangy palm hearts) for her, and I ordered the carri ourite (octupus curry).  Both of these came with rice and two kinds of chutneys.  The shrimp dish wasn't bad at all.  The shrimp, not bad in portion was well-cooked and flavourful, but the palm hearts lacked discernible taste and the sauce they were in was bland as well.  My fiancee really regretted not ordering the octopus (we usually order different dishes to be able to sample more) since she loves her mom's octopus curry, but more so because it was absolutely fantastic!    This dish was the showstopper, the dish you go to this restaurant for.  Octopus is a difficult protein to cook right.  Unlike other kinds of seafood, you don't just cook it fast & high and simply make sure you don't overcook it.  Octopus needs to stew... for a while.  It goes from just tender (when its not really cooked) to hard to tender again at some point in the cooking process, and you will find that most places do not do it right.  The Blue Bay cafe does.  The curry itself was just delicious, and even now, after much time has passed, the flavour lingers on in my mind, beckoning.    You don't need to worry about what Mauritian food is or isn't, or whether you'll like it.  Like a restaurant of the highest grade, the people at the back of the Blue Bay cafe really care about their food, and it shows.  This is what all restaurants should be like... good food, served without fuss."}
{"text":"Great homemade food, well-priced, casual restaurant."}
{"text":"Another one of my favourite places in the city, been coming here for over 20 years! The Mine Frire dishes are a favourite, along with the palm heart and okra salad. Mild, incredibly delicious samosas. Everything is fresh and delicious. Fish vindaye is one of the best fish dishes I have tasted anywhere."}
{"text":"I finally had a meal here, and do not regret a thing. Great food at extremely fair prices. Beautifully done curries and super delicate fish.  Will be going back again soon."}
{"text":"After recently moving to the area I thought I'd check this place out. I ordered the mango shrimp curry for takeout and it was delicious! The refreshing thing about this place is that you actually get a good amount of shrimp. It also came with a small side of their coleslaw and salsa, which were both very tasty.  Another thing to note, for those of you with celiac they were very helpful and there are plenty of gluten free options. They use tapioca starch to thicken their sauces. I will definitely come here again."}
{"text":"The only Mauritian restaurant in the GTA that I'm aware of. Fortunately the food is fantastic and reminds me of the delicious home cooked Mauritian food my mom used to make. Best to go with a group and try a variety of dishes but our favorites are; curried octopus, fish with eggplant and the mine frire. I first ate here in 1985 and I believe it's the same location and  owners from beginning.  I would eat here more often but they are only open for dinner and not everyday. Great for takeout  as the dining room is very basic and casual. Please Maryanne and family don't retire !"}
{"text":"We tried the palm heart and okra salad, the shrimp and mushroom soup, the curried octopus and the fish vindaye. The soup was quite bland. The salad was decent but also had a lot of lettuce in it. The octopus was ok and might have been better if we hadn't asked for mild to be able to share with our kid. I didn't care for the onions on top of the fish that tasted kind of sour. Atmosphere was nice, service quick, but based on the food, I don't think we'll be going back."}
{"text":"Alright restaurant. We went on a hot night. A/C was not working. No ceiling fans. Service was by one lady.  She was attentive.  3+ stars  samosas are not spicy enough.  My chicken was good but not \"tender\" my guest enjoyed his fish and noodle dish very much.  Portion sizes are generous.  They serve scented rice - excellent!"}
{"text":"Short version: This place is worth going out of your way to try. It's easily accessible via streetcar and/or subway, right near the junction of Roncesvalles Ave and Dundas. Not sure why it's showing up as four dollar signs on Yelp though because it's certainly NOT that expensive--all of the entrees were about $12-15.  Long version: I have wanted to try this place for ages but never seem to be nearby when it's open as they're only open for dinner (they open at 5PM), and today I finally caught them! Tried the fish vindaye, which was probably one of the most flavourful fish dishes I have ever had. The salsa that came with it was so good I actually ate what I didn't use on the fish straight out of the tiny dish it came in. The portion size was perfect--it came with rice and a coleslaw-type side (which was good and I don't even like coleslaw!) and I ate everything without feeling overly stuffed. Probably had room for a samosa or soup at the beginning of the meal, but as I rarely finish an entire meal at a restaurant at once I didn't chance it this time. Maybe next time, because I'll definitely be back."}
{"text":"I was asked what to recommend on the menu  1) Look for the curried octopus.  It is good  2) Fish & Eggplant is also good  These are my favorites. --------- This is a good Mauritian Creole restaurant.  I took my wife here, and she was even surprised.  I go to this restaurant every time I go to Toronto.  The quality of the food has either held steady, or has gotten better over the years.  I have been going to this restaurant for the last 10 years.  Get the curried/stewed octopus or fish & eggplant curry if you go.  They are good.    We need a good Mauritian/Creole restaurant in the USA.  No Mauritian restaurants in USA.....this one is in Canada......"}
{"text":"This is my favourite restaurant in Toronto. The food is delicious and unlike anything I've had anywhere else. Get the chicken cutlet / côtelette de volaille, any of the fish dishes, the okra, the mein friere (sp?), the ratatouille, and for the love of all things sacred, eat every last bit of the chutney and coleslaw they put on the table."}
