{"text":"They made the best breakfast. We had carrot pancakes with a cream cheese frosting sauce and coconut French toast.  Coffee was never empty. Great service"}
{"text":"Oh no, I hate giving this a 2, but I had to. You see, I had high expectations of the place - the owner also owns Gypsy, a restaurant I like, which made it more disappointing.

Blue Vinny Diner is located on Stephen Avenue where Avenue used to be. Basically the same set up. a bit sparse looking, again, especially compared to Gypsy.

Small menu - which is fine for people who have trouble making food decisions like me. Mostly breakfast, with a few lunch options. That's ok too. Although if breakfast is what you shill, then it should be done well.

Me - I had the mediterranean omelet; waaaay too salty, no tomatoes, and the 'side of fruit' was more like a garnish. One half of a strawberry, one grape I think, and two other small nothings of fruit. Hashbrowns were unmemorable.

Lunch companion - Egg BLT; something my bachelor guy friends made. White bread, like Wonder Bread, and same fruit side and hashbrowns as me. 

The service was excellent though, and it's a great location. Unfortunately I doubt I will be going again. Too many other places to visit that serve better fare."}
{"text":"$90 for three people for a  lousy breakfast. Something has happened to the quality here. Breakfast was so run of the mill we would have been better crossing the street to A&W. The lady serving was extremely slow and didn't really give any type of service. I was so disappointed because in the past I enjoyed the diner. We will be looking elsewhere in future which is a pity because we are downtown residents!"}
{"text":"We did not have a good experience. The lunch menu on a Friday was mostly breakfast items. We each ordered the mac n cheese. It appeared to be white cheese Kraft Dinner, there wasn't evidence that it was homemade. It was gross. When we commented on this to the server she didn't deny it (nor confirm it). It also did not come  with  any kind of side, just a bowl of macaroni in watery cheese sauce and a few bits of underdone bacon.We each ate about 3 bites but they still charged us full price. They also did not serve wine. We will not be going back."}
{"text":"Recently had lunch here, it was not great. West Coast salad was small with a piece of chicken on top, not worth the price.  Mac and cheese did have bacon, which was the only flavour in the dish. Bland, soupy and overcooked pasta, blah. Not worth a second try."}
{"text":"I hate giving a diner a 3/5 but I had to. The food was excellent but the service was not. Had high hopes because the Avenue Diner that was here previously rocked it.

I love breakfast. I had the scrambled eggs, bacon, hashbrowns, sausage and toast. Pretty basic, but delish. 

Atmosphere is simple, low volume but man oh man, we thought we were being poached alive (and it's not hot outside).

Service was less than desirable. I think with training, they could rock it. Be more personal and it will make people want to come back. Just a word of advice.

I think this is a case of \"been there, done that\" for me. I can always find diners to rock breakfast."}
{"text":"Stumbled upon Blue Vinny Diner while roaming downtown for a breakfast joint. The service, food, and prices were fantastic. I can't explain how tasty both our breakfasts were! Everything tasted very fresh. I also had a clear view of the kitchen, which appeared very clean and was being staffed by two very hardworking cooks."}
{"text":"Great Food, Great Service & Great Price! 

Enjoyed a Sunday brunch on the patio with family, there was no issue accommodating the group of 6, food was quick and delicious and service was prompt. Would recommend to anyone looking for a great diner!"}
{"text":"Ate breakfast here today after having a disappointing in the Hyatt hotel, Blue Vinnies  has won hands down. Food excellently prepared, and tasted really fresh, highly recommend the herb infused omelet"}
{"text":"Great breakfast!

The service was excellent, the coffee was good and the breakfast dishes were really tasty."}
{"text":"Ordered steak & eggs. Steak was cooked perfect & service was great. Good atmosphere & very clean. I recommend eating here."}
{"text":"They have the best spread of good breakfast food. Even for those of us who like lunch or dinner for breakfast. Macaroni and cheese was very good. Service was good."}
{"text":"My favorite breakfast spot.  I don't even get a menu as I found the breakfast bowl and haven't looked back since.  Great staff, cozy, and quiet.  Srsly, try the breakfast bowl."}
{"text":"great atmosphere at Blue Vinny.  I thoroughly enjoyed the Mediterranean omelette.. The breakfast included very tasty hash browns, toast and a very fresh side fruit bowl.
I'm a coffee fanatic and must say Blue Vinny had great coffee...
The service was very good.. highly recommended!!"}
{"text":"Food was good.  Food was pricey..Service was ok...Owner is stressed, but there and watching everything..That's was a good thing."}
{"text":"I want to start this review off with a public apology to the server. 

You see, I had been up since 7 am but had not eaten. As a result I was so sick to my stomach that I had been throwing up. I'm one of those if I don't eat in a certain amount of time after getting up I get very ill. But my parents had taken forever and it was about 10 am. Then mom kept insisting I pick on where to go even though I was so ill and dizzy that I couldn't think clearly. Finally, in frustration I tried to sit down and the server came out and yelled at me for not coming inside first. I was very ashamed but I hope he reads this and understands that I was sick and upset. I even had a minor breakdown afterwards because mom would not make a choice and I finally started crying and saying that I didn't care, I was sick to my stomach, dizzy, and very upset.

Afterwards, perhaps because he could see I was ill or because I was polite he became nicer as he served us. 

The food was pretty good. I'm allergic to pork so I had the eggs florentine due to the fact the other dishes had far too much pork products in them. I mean it wasn't knock you off your feet fantastic but still good. The potatoes had a weird spice in them though that just didn't agree with my American taste buds. 

I'd eat there again possibly. We're only here a week and I want to try a lot of places. But I hope the server sees this and knows how sorry I am for breaking the rules."}
{"text":"I recently had lunch at the Blue Vinny Diner.  It was nice to try some place \"new\" downtown, at least close to me.  I was seriously underwhelmed by the limited menu.  I get that they are a pretending to be an upscale \"diner\" but would two pages of choices be too much to ask?  It took me a long time to choose because there were just not that many things that interested me.  I settled on the steak and eggs or Vinny's Breakfast on the menu.  I must admit that it was a great steak and eggs for $15.99 downtown.  The steak was done as I asked, very tasty and a reasonable portion.  Do the eggs and hash browns really matter?  If they do to you then know that the eggs were done as I ordered and the hashbrowns were crisp and tasty."}
{"text":"Not a bad option for breakfast in downtown Calgary. Service was fantastic. Coffee was refilled faster than I could drink it. For food, I ordered the carrot cake pancakes. Portion size was ok. When the pancakes originally came out, one side was very burnt, but upon noting this to the waiter, the pancakes were quickly replaced. New batch was quite buttery, sweet, but with good flavor. Fresh fruit side was a nice addition. I would recommend if you find yourself in downtown Calgary looking for a place to eat."}
{"text":"I should have taken a photo as my breakfast was divine! I had the feta, tomato and basil omelette and it was cooked to perfection. The service was fast and friendly - the perfect diner experience!"}
{"text":"Awesome breakfast and great service!
We had the breakfast bowl and Belgian waffles! Great cup of coffee. I recommend it!"}
{"text":"The diner was quiet on the Saturday morning I went. I thought that was unusual. I remember waiting for tables when it was Avenue Diner. I LOVE diner food, so I had high hopes for it.  Unfortunately, the food was just ok.

My roommate had the breakfast bowl and he eats pretty much everything. Except this apparently. He found it greasy and too expensive for the amount he was able to eat.

His pop was in coke bottle. That was an unexpected cost. He would have appreciated having the choice between a bottle, can or fountain pop. We wanted a quick breakfast that was tasty and inexpensive. The cost of a glass bottle of coke was not appreciated.

When we were ready to go, the waitress was reading a paper at the cash. We hadn't received our bill and couldn't get her attention, so we went to her to pay. I don't think we'll be back."}
{"text":"Great experience at Blue Vinnys Diner. The owner Duane was extremely professional and wanted to make sure we were well taken care of. The food was very good and fresh. The place was spotless and well designed. If you want a tasty breakfast and wonderful, personal service - go to Blue Vinnys."}
{"text":"Great little diner! Had the blueberry pancakes which were so delicious! Coffee is good too. Sat on the patio while stampede activities were going on so lots of great people watching."}
{"text":"The food was great, the atmosphere was great, and the service was fast and the restaurant clean.  Overall this was a great restaurant and I would recommend it.  It is a bit pricy so I only gave 4 starts."}
{"text":"--- Food --- 
First time dining here with my partner while strolling the streets during Calgary Stampede Parade. We chose the egg bennedict for our brunch. We asked if we can switch the ham for salmon, but they only offer ham. The egg benny with ham and side of roasted potatoes with fruits was fresh and delicious. It was nice it was whole wheat english muffins as well. 
But I think the hollandaise sauce is a little too thick, the poached egg was almost fully cooked (was hoping for the runny yolk consistency), and the potatoes could have been roasted a bit more. 

--- Atmosphere --- 
The customer service is average - but that's okay because he seemed to serve all the tables inside and was busy running around serving the dishes, coffee, bills, etc. I just remember he worn a quite a strong cologne, I could smell it whenever he walked past us haha. 

--- Summary --- 
My partner and I enjoyed the egg benny in general, we would likely come back again. It was reasonably priced around $13 as well. Coffee around $3.50 though."}
{"text":"After months of wanting to go there we finally did and it was delicious and I highly recommend it. These are the reasons why:

1. No wait! On a Saturday. At 1230. On a long weekend.
2. I had the feta basil tomato omelette with fruit and hash browns. So good
3. Great service, kind and always quick to refill coffee
4. Reasonably priced 

No gluten free bread, but the food was so good I didn't need any bread.

Go there. 

*note: it is called Blue VINNY and not Blue Vinyl as I thought it was."}
