{"text":"This place is very strange. On my visit, the service was terrible-it took over 20 minutes for me to get a pint of beer and the place was not very busy. The food looks like it was just pulled out of the freezer and warmed in the microwave, and the restaurant smelled like Windex upon arrival. I like a clean environment, but a restaurant should smell like food to entice its customers. Overall, I would not recommend this restaurant unless you like poor service, bad food, and a cold environment."}
{"text":"My husband and I love the food as we always get delivery from Just Eats.  Quality, quantity and pricing very reasonable. The Manager is excellent and therefore, we  order weekly."}
{"text":"Worst service ever, waited on phone for 30mins just to get hanged up on, called back was told busy and to call back in 5 mins, when into the place waited for 15mins and still no service,  worst place to eat in Brampton I guess, one chef and one server team on a Friday."}
{"text":"The food is off the hook!!! Awesome, waitresses are nice and friendly. BUT..... If ure not much for beers or any other type of alcohol? Then don't drink any of the soft drinks, the iced tea, Sprite & Coke drinks are not brand name and their TERRIBLE!!!!!"}
{"text":"Went in to try the food. I was pleased to see that there are TVs at each booth. Unfortunately, the menu never made it to my hands as we were waiting for 15+ minutes for someone to acknowledge that we were there. My bf went to ask someone for 3 menus and was told to \"wait a minute\". Meanwhile 2 other tables that walked in after us, had already received menus and were about to order. After another 8 minute wait, we left the restaurant STILL WITH NO ONE ACKNOWLEDGING US! 

Let me put this simply for you...

DON'T WASTE YOUR TIME WITH THIS PLACE! 

There are better places in the area. This business has maybe a good year or two with service like that. 

TO THE OWNER: FIGURE OUT YOUR PLAN BUD CAUSE YOU ARE LOSING GOOD MONEY BECAUSE OF THE HORRIBLE CUSTOMER SERVICE"}
{"text":"Clean, modern sports bar including the washroom. Great service. We had the pulled pork & beef sliders with fries and onion rings. I personally liked the beef sliders better, the onion rings were good especially if you put it in the slider! Also, I liked that they salted the fries for you because at most restaurants they are plain & it was over salted either."}
{"text":"This place is like a double diamond ski hill - all down hill. All the pretty Russian Ladies are gone and the food sucks. From a 4 star to a 2. And the only redeeming thing, is cold beer. Service a 2, staff a 2,  cold beer a 3. 
Either close it or try harder. 


First thing to catch my eyes were the servers - the girls are HOT - the bartender is a 10+ - yet very sweet.
They have my favorite beer on tap - Tennants. Big kudos for that.
Wings are large - but what they call hot is 7/10. Even asked them to tun the heat up on the wings but to no avail. The place is a sausage fest with 10 men for every one lady. 
Overall - servers 9 - food - 7"}
{"text":"It's a nice clean environment with friendly staff.  The wings are top notch, they are big and meaty!  The dip sauces that came with the wings were perfect to send my palate over the top with happiness."}
{"text":"Went there to watch the Jays game with some friends. They had the game sound on which beats listening to bad pop music. Server was very friendly and attentive. The food was very good with decent portions. My friends and I would definitely go back again!"}
{"text":"By far THE WORST food I have ever consumed in my life. I have never felt so sick leaving a restaurant. I've been here a few times but after this experience, I don't think I'll ever go back. 

First of all, after being greeted we were seated waiting for almost 25 minutes till the waitress came to see what we wanted......... Yet the restaurant was empty with only 5 other individuals inside.

I ordered a Diet Coke. Worst mistake made. First, their cups smell so disgusting to the point where the coke tasted so bad. I had to ask to get a brand new cup and new drink. Second cup comes and it smells and tastes even worse than the first one. 

The food came. Fries taste like they've been sitting in the freezer for years. Came out cold. 

Service was horrible. Food was disgusting. Never coming back."}
{"text":"I was there for the Superbowl and had a lot of fun. The beer selection is good and reasonably priced. The Philly cheesesteak sandwich was delicious with a surprising spiciness to it."}
{"text":"They have many different flavors to try for wings selections, even though we moved to Niagara Falls it is worth the visit still."}
{"text":"This bar recently opened up in the neighbourhood and I am glad that it did. Unlike other places that have \"wing\" in their name, the Boar and Wing has really good wings. They are a good, meaty size, with tons of flavours. I've had the ribs too and they're pretty good. The service is quick and friendly and they have a lot of screens for the sports. 

The only negative I have to mention is that the last time I was there on a Saturday they switched the main sound from the Leaf game to UFC. Being a Leaf fan I was disappointed. However it won't stop me from going there to see a game."}
{"text":"I went here with a friend for some wings. It's a larger place, lots of seating and TVs everywhere, on the walls as well as personal ones in the booths. Your average sports bar. 

We came in and waited a long time before the waitress came over to take our order. The service was very poor. Maybe there was because a woman was at the table, because the tables full of guys seemed to be getting service. I understand that they want to get tips, I guess by flirting or using their bodies, which I personally don't agree with, but that's just me. Don't let that affect your job performance though, you're there to serve all customers. 

We finally got to place our order. The wings tasted alright, nothing special, but before we were able to eat more than one, we noticed hair in our food. Obviously grossed out, we sent it back. The waitress then told us that it was probably chicken hair. Let that sink in. Chicken hair. At that point we just wanted to leave. They didn't give us a discount, didn't do anything. 

One of the worst sports bars I've ever been to. I'm never going back."}
{"text":"Have been to this bar several times. Each time I have gone to Boar n' Wings, the service was awful. During my most recent visit, it took over an hour to receive our orders. We did expect this because this happens each time I have been at this location (also other customers have pointed this out as well). Nonetheless, in addition to the late orders, a few of my friends did not receive their order at all this time, and the waitress would never come back to check up on us to ask whether we wanted more drinks or food. When we finally would get in contact with her, she would walk away half way through the conversation and did not acknowledge whether anyone else at the table would like something else too. 
Although their wings are OK, they will not be receiving my business anymore. There is only so many chances a business can get. Boar n' Wings seriously needs to reevaluate who they hire and time management strategies."}
{"text":"I love wings. Local favorites include Wacky Wings in Mississauga for All you Can Eat, Hooters near the airport has gone downhill. This place is consistent with their wings. The burgers are decent but I don't recommend any of the other sandwiches such as the pulled pork. Friend described it as the frozen stuff from Costco. Try the Presidents choice wing flavor it is honey garlic and creamy dill. A pound will give you 7-8 wings, but mind you they are jumbo, meaty wings, that always come out piping hot! Come on wing night for the best value. Several beers on tap, which are always tasty. Sort of hard to find from Kipling station. There is parking in the back of the restaraunt, DO NOT PARK ON THE STREET. There is no sign saying its prohibited and I got a $40.00 ticket last summer."}
{"text":"This place has got to be the best full service restaurant that I have had the pleasure to encounter. I feel as though if the location wasn't I'm such a secluded area, it would see much more customers. 

Been going to Boar N Wings for for a while now, and each time, the food is has always been a 10/10. On Tuesday's they have a wing deal, buy one pound of wings with a drink and get the second pound for FREE!!!

The waitress is very attentive, I love hot sauce and each Tuesday that my girlfriend and I go there, as soon as we sit down, the waitress brings over a bottle of Tabasco sauce. Highly recommend!"}
{"text":"i totally agree the resteraunt before sucked thyme4 was good,and the boar and wing really good.We are not really wing people but we thought we would try it and damn they were good,and they are big not those small wings that look like they were on a hunger strike.Service was good we are always greeted at the door by a host,thats how all resteraunt should be.It is the most nicest classiest sports bar we have seen,we also go there to watch the fight which is amazing.I suggest check it out you wil not be dissapointed.I like #62 and #63 for wings try it,you will like it."}
{"text":"came here to watch an NFL game a few months ago, wasn't impressed with their service at all. We ordered food, it came out wrong - we asked for the right meal and the waitress got upset with us."}
{"text":"I'd give the wings a B+.  They are a good size and served nice and saucy.  The fries were also very good.

Service was fast and very friendly

Lots of TV's and they have the play by play on for Leaf games.

The only real disappointment is the beer selection....only 1 or 2 imports/craft breweries."}
{"text":"Amazing bartendars and waitresses. Such wonderful people really. Don't even get me started on the fries, nachos and the sliders, wow. Really makes your taste buds come alive. Interior is wonderful. A LOT of TVs!!!"}
{"text":"76 flavours of wings = difficult choices. I went with mango chipotle because that's the name of my sister-in-law's blog. Pretty decent wings.

They have a couple beers on tap I had never heard of before. I tried the barking squirrel, which was dark, hoppy and delicious. My friend had a Scotish lager, which tasted like nothing.

The service is friendly and they have a lot of TVs. 

I live across the street so I'll probably be back to try the other flavours."}
{"text":"Hopcity brewery is on tap so its great to grab a drink. Only had a pulled pork platter and it was decent. Burgers are really good to.Place is huge and there are TVs 360 around the bar area.  Would return visit as it is the only bar around that area. Very young crowd because it is the only bar in that area."}
{"text":"The Boar N Wing is a sports bar dedicated to all sports fans. There are multiple tv screens on all walls showing different game feeds. They even have the new Fox Sports One channel that everyone is raving about. No matter where you are seated, you have a view of the game. In fact, some of the booths have TVs in them too. I personally found the excessive number of screens in the bar annoying and distracting.

The food here is decent and the prices are very reasonable. You can get a medium pizza and beer or a pulled pork with fries and a beer for under $20. The Boar N Wing is a great place to catch a game, but probably not the best place to catch up with friends as your attention is always directed to one of multiple screens."}
{"text":"Hey avoid this location, service is non-existing.
It's unfortunate this place has slipped since opening. Used to have two waitresses, now down to one and she cannot keep up with the number of patrons at noon. Food is good. Lots of TVs."}
{"text":"After playing a game of Aussie Rules, my team ran a rampage on any wing place in the Etobicoke region. Luckily, we found Boar N Wing. Not so lucky for Boar N Wing's staff.

We walked in on a Friday night at about 9pm. The place was not packed at all, so it easily accommodated our group of 16 people. As we sat down, a few more tables started to fill up and we were surprised to find that there was only one waitress working the floor, while there were 2 bartenders working the bar (this made no sense to me as there were only 2 people sitting at the bar). 

Anyways, our large group was seated and we started ordering drinks and food. Because there was only one waitress on the floor, we found ourselves waiting quite a while for food and drinks to be delivered. Our food was delivered about half an hour after we ordered it, while some people at our table did not receive their food until about 45 minutes later. Pretty unacceptable for a group of hungry athletes... pretty unacceptable for hungry people in general.There was no one helping the poor girl deliver our food. Poor management.

Anyways, I ordered a pound of the Homerun and the Batman wings to share with a friend. We also had the sweet potato fries. Overall, the wings were large and quite tender and juicy. They were very flavorful and super yummy.
Homerun- my favorite of the two types of wings I ordered. It was a chili thai and teriyaki sauce which was sweet and spicy all at the same time. It was ahhhmazing
Batman- it was pretty good. The bbq sauce was a bit too acidic for my liking, and the teriyaki sauce did little to mute out the acidity, but they were still pretty good

Later on in the night, we ordered a pitcher of beer and it was totally flat. We returned the pitcher to the bar and they replaced it, but I think more could've been done in order to mitigate the situation. The manager seemed to be very MIA for a Friday night when business started to pick up. The food here is great, but the lack of quality customer service really makes this place a disappointment. Although the food was good, it's not begging a repeat visit. Too bad."}
{"text":"Wings were pretty good but it took 45 min to an hour for the food to be ready. Not recommended to go on a week day."}
{"text":"good place, decent food, decent service. too many tvs ! owner most likely got a discount from costco for buying 30 plus tvs lol
the place is set up for ufc most likely which explains all tvs
has 2 areas 
dinning area which is quieter & a bar area
would go again if im in the area"}
{"text":"They are still open! Wish I can give them negative scores.

They randomly make up rules on when and how you use the goupon.  Went there with three people using the groupon \"$50 Groupon toward lunch or dinner for 4\" and they wouldn't accept it...Even though I had done it in the past. When asked about it, she said it was in the fine print somewhere... When it clearly states it nowhere!!  

Horrible customer service, the lady even yelled something along the lines of cheap get cheap service, when we were leaving.  When it was a standard 15% tip for sub-par service.. which included messing up our order 2x/ long wait/ justifying the random rules on the groupon. This will be the last and final time I go there.  The food isn't worth paying full price.

But wait, there's more!! This groupon is not even the $20 or $50... they ended up subtracting taxes off the groupon's value.  So the $20 value groupon we bought was only worth $17.40."}
{"text":"Very good Wing Place in Etobicoke. The wings are large, fresh (not frozen). My favorite are the Katrina Wings. Service is excellent. Tuesday and Thursday are Wing specials. I have been there about 6 times, consistantly very good, way above average. My only beef is that they dont have standard Buffalo Style wings which you would think that of over 70 flavors they could pull that off."}
{"text":"Wasn't entirely interested in ever visiting this place, but it was absolutely crucial that we saw the Mayweather VS. Pacquido fight that night.  

The place was absolutely packed with barely any room to stand.  Personal space was of the essence.  

When I got a chance to make it to the bar through the crowd I was pleased with the decent price with beer.  Gotta have a Heineken.   

It was a fluke that we even made it for the fight, but I went only because my friend wanted to.  Not exactly dying to go back as these kind of bars are not my Forte.   

Nice place though."}
{"text":"Decent environment and tolerable food but poor poor service and a problems with the taps? It took forever to get a beer and it appeared as if it was because the staff was having trouble with pouring them. When I got it finally it tastes flat. I would have sent it back but I didn't feel like waiting another 10 minutes. Could be a decent place if they cleaned up their act a little but there are better options for now."}
{"text":"My boyfriend and I sat down and it took twenty mins for someone to ask if we wanted a a drink then It took an hour for the food. The waitress was arguing with us and one customer thought we were just drinking water lunging around for an hour , little did he know we were waiting on the slowest service ever. Embarrassing and aggravating, this place is terrible."}
{"text":"Great food HORRIBLE SERVICE!!!! 
Feel bad for the owners who are letting their business go down due to horrible staff. 
The waitress forget about you and forget to bring out your food on time. They see you looking at the menu again but don't bother to ask you if there's a drink you'd like to order or if there's anything else you want to add to your initial order. They ask you for your drinks as soon as you walk in and if you don't know what you drink you want to order, well then forget about it because they ain't coming back to ask you even if they see you looking through the drink menu. 
The waitress I had today was to into cleaning her table even though I waived her down ...she told me to wait. Are you kidding me? 

The food is Great, don't get me wrong. Best wings out of a lot places I've tried but the service SUCKS!!!!!!!!!!!!"}
{"text":"I came in to watch UFC, I sat at the bar and ordered a beer. I decided to hold out on ordering food until the event started, that's when the lone bartender became overwhelmed with drink orders and never came back to me for more then 2 hours. 

That's when the owner told me I had to buy a raffle ticket from him for $10 or leave. I've gone there before to watch UFC events and this has never happened. After I was bullied into buying the ticket I was then allowed to order food. 

The burger was alright but there was only 5 onion rings on the side. I had to wait a while to get my bill.

I've been there several times this was by far the worst. I like that it's walking distance from my home but it may be the last time I go there."}
{"text":"Boar - not so much Wing - I like!

You name a place Boar N Wing, those two items had better be your specialty right? Well they partially got it right. 

The Wings, is hella good, very crispy, moist, not greasy, or saucy, just the right amount of everything that you can put into a wing. They have over 70 different flavors, which I have only tried 2 sauces and just an F.Y.I their heat scale is wrong I ordered wings that were 4 hot peppers which honestly only felt like 2 hot peppers, or maybe it's just me and the fact that I'm used to the heat. The wings are bigger than most places you go to, for 1 pound you only get 7 pieces, as opposed to 10-12 pieces everywhere else.

The Boar, is hella meh. It's a hit or miss the sliders were good, very tender but not enough flavor to my liking. The ribs were good, but not fall off the bone good. I had to literally chew through the bone to get the meat, as well I could still taste the char from the meat, someone wasn't watching the meat while it was on the grill, tisk, tisk. 

Besides the food there is at least 50 T.Vs all playing different sports, not just hockey! Just for that this place gets an extra point! As well this is a definite guy bar with beautiful waitresses waiting to serve you and the combination of sports, wings and beer this place will be around for a while.

Lastly for all those with cars, there is not that many parking spaces available, and I'm sure during games, or pay per view fights, you're best bet is to car-pool, bus or walk.

Items to definitely get

- Wings 
        - Flavors, I'll get back to this later"}
{"text":"We went here for a family dinner on a weekend evening. We all had some wings and fried pickles. The saucy hot wings were definitely the highlight, as were the lemon pepper. 
They have a huge variety of wing flavours. 
The only thing a little lacking is the service. They are a little slow and also some mistakes were made."}
{"text":"Terrible service and very snappy staff. Went there with my girlfriend and the waitress literally took an hour+ to serve us our food. And when i complained about the service, the waitress argued with us."}
{"text":"Came here on a Friday with my spouse after hearing very mixed reviews. 
We thought we should give the place a try.

We were greeted by the hostess and seated at our table.
It was a very nice atmosphere with lots of TVs showing different sports games.

Ordered our drinks and a few minutes later ordered the appetizers as well as entrees.
We waited over an hour for the food to arrive but the waitress did not show up with anything.

The waitress came over to the table once during the span over that hour to ask for refills.
Not once did she inform us about the wait time for the meals or what was happening.

The restaurant was a bit busy, which is understandable as it was a Friday night.
The only problem I have with that is that the appetizers at the least, should not be taking over 30 minutes to come out...

Now, I have never walked out of a restaurant in my life, even with horrible service experiences but this was my first time.
I will never recommend this restaurant to my friends, family or people that expect reasonable service.

It may be the fact that I had a terrible waitress, but even then - please don't become a waitress and do something your good at.

2 stars only because the atmosphere is great and other customers seemed to enjoy the food."}
{"text":"Portion size is a large size! Food was wonderful. Patio had dirty tables, and disorganized seating. Service needs improvement."}
{"text":"Came for the gold medal game in 2014 had wings at 8am and they were unreal, great service lots of tv's great atmosphere"}
{"text":"A 3-star is all this location should get. It was lunch on a Wednesday. Very unexciting for a Sports Bar. Not much happening for a mid-week lunch. All the bars beer taps were down for cleaning so no tap beer at all were available. 

I ordered the fish & chips. The menu & the waitress said they were traditional Fish/Chips...meaning they were fried. When I received the food, the fish was actually baked. The taste was there but I was expecting fried. Nothing more to report on this spot."}
{"text":"I'll definitely be coming back for some more wings!

Came here on St Paddy's Day for some drinks and wing specials. A little miscommunication between the waitress and I resulted in more wings than we anticipated but that was okay because I like to eat. I ordered the medium + ranch sauce which was amazing. The wings are a decent size. Normally I can clean those suckers in one swift bite but not here... and I ain't mad about it!

We also got some free 'swag' (hate that word... might even be the first time I've used it in context) with it being St. Patrick's Day. 

I really enjoyed the atmosphere and the million TV's."}
{"text":"I've been here many times, but because of this one incident I will never go here again. I went into the place sat down and asked for some water and beer. The waitress returned with just our beer and took our order. We asked her again politely for 2 glasses of water and she said ok. A couple moments later she came back with our food but no water, so we asked for a third time. After 20 mins and us finishing our food we asked for water for the last time. The two glasses of water were finally brought to us before we going to leave. At this point my buddy and I were not happy with thier service, so we decided not to tip. We asked for the bill, and paid the bill with no tip. Our server looked at the bill and said \"thanks for nothing\" threw the recipt in my face walked away. Who says that? Just ridiculous and appently she was the manager."}
{"text":"I went there tonight to get some wings with my boyfriend. We both ordered wings and some perogies to share. They had a lot of things on the menu (would probably be a good thing to cut it down), and a number of sauces to choose from. While the food was great (the hot sauce was actually hot), the service was lacking. There was only one waitress tending to the tables and at one point she disappeared. Even when she was on the floor, other tables were tended to more. 

Again, while the food was tasty, I wouldn't find myself running to come back here."}
{"text":"Decent food, good atmosphere for sporting events. 

Only thing questionable though is service, there are some really good waitresses and some really bad ones who can't remember your order or neglect your table through the night"}
{"text":"Wings are great, service has always been OK. Delivery is fine too off of just-eat. Best day to go is on Tuesday when they have half price wings, otherwise it's a little to pricey for me."}
{"text":"Ok... SO I've been here quite a few times.  Its a niche location and it is what is. Its a sports bar that caters to West Woodbridge.   

The place has great nachos.  I've had the other food and its ok as well. 
The place will not wow you in any way and the waitresses are hit or miss but if you just 
want to grab a beer with the guys, this place will wet your whistle."}
{"text":"Upkeep is kept to a minimum. Bartender is also waitress for entire bar. Happy camper she isn't. But at least the owner cares. 
Ha ha."}
{"text":"A great place to catch the ball game with the fellas over some wings and beer. The entertainment value is high here and that's what this spot prides itself on. Huge big screen TV's all over the bar and great surround sound speakers for maximum enjoyment. Service is also good here."}
{"text":"All in all this bar is alright. The prices I have to say are amazing and the staff is really nice. However, they seem to be understaffed as it took 15-20 mins for drinks as well as almost a hour and a half for food (normally i wouldn't mind the wait for normal food but it was bar finger food) on top of that when we got the food they didnt give us any utensils or napkins so we were eating our food with our fingers and holding our hands above the table waiting for someone to give us napkins. It took the wait staff 35 mins to get us napkins, we asked over 5 waiters and they all said in a second and never came back. Our waitress was barley coming back to our section so we could never get her attention to help. And even though our waitress was nice, she kept forgetting our orders, even though she wrote them down or repeated them to us after we told her. As i said, an ok bar if you like waiting. In general yeah i would come back again, solely for the prices and the atmosphere. I mean they have tv's at every table and thats cool i guess..."}
{"text":"The deep-fried pickles are my ABSOLUTE favriote. So are the potato skins!!!!!"}
{"text":"Like the other Yelpers here, I found the food and interior set up great. The food came out in time but the service overall was poor. Found the waitress all smiles in the beginning, which progressed to a condescending attitude later for no apparent reason and back to sweet talk at the time of the bill. 
Flavour options for the wings and taste of what I ordered was good. For the size of the wings, PK Creek in Sauga still is the best in the GTA. 
Philly cheesesteak wasn't authentic at all. Tasted like cold meat heated up and put on a bun with cheesewhiz. My rating on the food is solely for the wings."}
{"text":"Sorry but I cannot recommend this sports bar  service was horrible the food was probably microwaved. Never going back there.
We ordered 2lbs of wings they tasted horrible. .I think I have had better wings Costco than here lol...pretty sad bc it's a sports bar you would think they would at least have good wings. We also ordered a steak sandwich...which we would give a 3 out of 5. Another dish was partially served..no one brought out the rest of the dish and the waitress didn't apologize for that either. The customer service from the get go was crap! The waitresses look miserable! I'm never going back there again. Food was not worth the money. Customer service was not worth the outing."}
{"text":"There were so many deliciously-sounding flavours for wings at this place that it was definitely a difficult choice and finally had to resort to the old close your eyes and move your finger around the page to choose a flavour of wings.  I don't recall if there were 76 or 73 flavours but I do remember seeing over 70 flavours of wings here and that's truly enough said.  

With large flat screens all around the restaurant, this makes this place a great location to watch the game, have some wings and have some beer. 

If you're used to hot wings, you will want to have at least a 3-chilli rating in your flavour.

Service was friendly, the restaurant was very clean and food usually arrives rather soon after you order it.  

I will definitely be back to try another flavour!"}
{"text":"Not sure why this place has bad rating. Service was good. Staff were polite and checked on us on time. I loved the wings! Crunchy as well as juicy. Tasted really fresh. I will definitely go back.

Edit: got horrible waitress who was so condescending because she didn't know what \"michelob ultra\" beer was! Wtf! She is the waitress who needs to know her beers and if she didn't, then she is the one who is suppose to feel like crap! Not make me feel like shit! Secondly, every flavour I asked about her response was \"oh pretty self explanatory, isn't it!?\" I fuckin kidding? U will tell me that I don't know how to read? I asked you for recommendations moron! Thirdly, never asked if I wanted the wings breaded or not and when I told her I can't have breaded she acted like the world ended and she had to do the impossible to change the wings which SHE didn't give information about! Then finally toward the of the night someone was swearing and screaming on the phone which was terrifying and we didn't know if he was going to turn violent. Not once did she come to tell us if we should feel safe or leave! Guess why, we had paid and she got her tip! Well, hopefully people see this review and realize how horrible this place was."}
{"text":"only ever had wings...seriously subpar wings
expensive for the qualitity 
not impressed
wouldn't go back unless i wasn't paying"}
