{"text":"This is my husband and I's favorite BBQ, EVER! We tried the pulled chicken, ribs, hot links, fries, and macaroni & cheese. Everything we had tasted amazing! I never want to eat BBQ from anywhere else! Our server was kind, and the food came out quickly even though they were busy!"}
{"text":"This was our last meal in arizona and we definitely wanted to check this place out.

We got the full baby back ribs and the 2 meat combo (pork and chicken). Sides: Mac and cheese, baked potato, fries, corn. The food and sauce definitely 5 stars, highly recommend it. 

I know it's a busy place and servers have a lot on their hands, service was kind of disappointing for us.

We were missing plates and a set of utensils but we didn't get them until after all our food had arrived. So we had to wait a while until we could dig in to our food. We also ordered drinks which were ready and just left sitting at the bar until we were half way through our meal so our drinks weren't cold anymore when we finally got them after reminding our server. :(

Great atmosphere and I would recommend it for families or dates or gatherings but the service needs some work! Thanks."}
{"text":"Well, we tried both Mesa & Biltmore location. Meat is very tender but no flavor without sauce. While I like sauce, I'd like the smoked flavor of the meat to come through. If you just want it tender smothered in sauce this is the place."}
{"text":"Usually you have to sacrifice atmosphere for great BBQ but this place has everything.   A beautiful restaurant, the food is incredible!  We had the Mac n cheese, roasted Brussel sprouts, pulled pork, brisket and the que rolls. All were amazing and we would get it again.  The service was fantastic. Just when you think it's over and couldn't have been better they bring out warm complimentary doughnuts. This place is a must!"}
{"text":"We tried this place 2 weeks ago, take out on a Sunday night and loved it !  We split a whole rack of the baby back ribs which were tender and meaty, no fat in sight.    Then . .  this past Sunday night we did a repeat and they were horrible, so I guess it's hit and miss.   One third  of the ribs was a mass of congealed meat and most of the ribs were full of fat!  I picked the meat off the bones, discarded the fat and tendons, and put it in a salad the next day.   We agreed we need a different agenda on Sunday nights, too dicey to order these ribs again;  so disappointing.    

The cornbread is great, as is the coleslaw with pecans on top.   The shoestring potatoes were okay, and we tried the potato salad, but we really just like a big salad and the ribs.   Too bad, because we were at Mexx 32 all the time and loved it, and miss that place, especially because we could take our (well-behaved)  dog on the patio.    The bar looks like a 'happening' place, but the ribs were a downer this last time.   Need better quality control."}
{"text":"What ever bring's you, Bobby Q Biltmore is where the the experience is total satisfaction. The menu is on target & offers delicious variety. As a concierge, there is no missing service here. Staff including management (Joanna) have great inviting touch. A perfect steakhouse for who want to get off the old stubborn beaten-path."}
{"text":"In a word:  WOW!

As I've said in previous reviews, Traci and I are fortunate to live in the 85018 with so many fantastic restaurants in the area - practically within walking distance.

As others may have said, this is a crowed Safeway shopping center, and it starts with parking.  Don't get all crapped out trying to find a place to park if one's not nearby the restaurant.  Learn the local way - use the complimentary valet parking area dedicated to the two restaurants just to the north of the restaurant off 32nd Street.  You'll see the signs.

Bobby Q's has big shoes to fill - the real estate / lease costs for this space has spiked dramatically over the years.  Mexx32 was awesome, and Lenny made that cool place work to his credit, but Bobby Q's gutted much of the restaurant to enhance the bar/patio/seating, so they have made an incredible investment in the place.  Was it worth it?  We think so!  Six to eight months of the year they'll benefit from the patio/bar combo area - which we love in a restaurant.  Very inviting, friendly and an open greeting when entering.  Terrific addition!

As we all know, service is key to a successful restaurant, so they did the smart thing:  Got a bartender who knows his stuff and who has worked for them at another location in the Valley.  Chris knows his way around the menu and the cocktail choices.  He was helpful and knowledgeable.  He recommended two of his favorite 'brown liquor' choices and we were not disappointed.  Both delicious and beautifully presented.

The rubber meets the road with good food, and the melt-in-your-mouth cornbread did not disappoint in getting our appetite in high gear.  Because it was our first time in (and won't be our last for sure!) we decided to try the \"Whole Hog Heaven\".  GREAT call!  A little of everything... Perfect for 2 or 3 people if you bring your appetite.  We just about finished it - but not quite.  Delicious, smokey, tender and flavorful baby back ribs or beef ribs (Pick both) AND your choice of two:  pork, prime brisket, sausage or chicken.  AND three sides (think the best BBQ choices in your mind and they'll be there).  Bottom line:  we liked EVERYTHING.  But If there was one criticism - it's the beef ribs are work.  They're not 'fall off the bone' like the baby backs.  A bit messy, but delicious.

Ultimately, we had a fantastic meal!  Great service!  Amazing ambiance!  What more do you need or want?  Highly recommend going to Bobby Q's!  You'll be able to personalize your meal and your head start is checking out their menu before you go.  A must - just be prepared for your mouth to start watering!  :)    Enjoy!"}
{"text":"Wow. First of all, the complimentary cornbread from the start was sublime. They don't just give you a lil slice per person. No. They bring you a lot and then ask you if you want more. Next, the PPS's (PULLED PORK SAMMY) we ordered came out hot, fresh, and ready. The meat was thicc but tender at the same time. I have never been so content with a PPS. Best in the valley. I tried some of Mary's mashed potatoes and I had an immediate verbal reaction: \"Flavor\". Then, to our surprise, Colton offered us even more cornbread. Of course, we accepted. AND THEN, Colton brought out the COMPLIMENTARY BAG of cinny sugar donuts (free of charge)! Colton was the best server in the west: treated us right, big smiles, and plenty of BBQ and fun. In conclusion, Mary and I thought that Bobby Q was so far the highlight of senior year."}
{"text":"I moved into the neighborhood 2 weeks ago and I'm already a regulator. Brisket and ribs are amazing! The meat is tender, well seasoned and just the right amount of lean and fat. I also love that they have garlic roasted broccoli robb/brocolini. It's so good! The meals come with 2 pieces of cornbread, which is also fresh.

I usually sit at the bar and the staff are friendly and attentive. The last few times I went, they gave me complimentary mini donuts, which was a nice touch.

I'm so happy they are located within walking distance from where I live, but I'd make the drive for their food and dining experience!"}
{"text":"I was really afraid to write this review after going here for the first time so we went a second time. Now I feel very comfortable giving 5 stars. Let's start with the food, amazing ribs and brisket. The ribs literally fall off the bone and are so tender with such great flavor. The sauce is just the right amount of sweetness without being overwhelmingly spicy hot. We're outnumbered here in Arizona, we consider salt a spice and don't venture even to pepper much. Crazy, I know! I'm not a huge fan of cornbread but I would go back if they were out of everything and only had cornbread to serve. The serving sizes of everything ordered was generous. 
The service was excellent both times we were there and we found the patio especially comfortable. 
I thought I would never find great BBQ in Phoenix but I did and couldn't be happier. Thank you Bobby Q, I'll be a regular from now on."}
{"text":"Reduced menu compared to other locations and not a lot of seating but still great quality food and great atmosphere."}
{"text":"Macaroni and cheese to die for!!!!!  It is literally the best one in town.  I have tasted their barbecue chicken pork and brisket, everything is very flavorful.  I have only gotten my orders to go and their team is very efficient and friendly and thorough.  
They are very generous with their cornbread and it is delicious also!  It was a blessing and a curse that they are right across the street from my job!"}
{"text":"Exemplary customer service! I love coming to Bobby Q because as soon as you walk in, you'll know to expect friendly smiling faces. Our server Chet was wonderful and so was Joann (I think she may have been the manager?), she was so kind to every table she passed and attentive to needs. Actually, I was really impressed by her when a customer walked in & with a friendly exuberance she said \"Welcome back!\" He may have been a regular, but the fact that she showed so much pleasure in seeing customers shows a lot about how this restaurant care about the service they provide. After we were done with our meal, another passing server even offered to clear our plates off the table - another clear indication to me of how this restaurant works as a team. Food was also great, I had the half rack of baby back ribs which came with two sides for $21.   If you're not a big eater, you can even share this with another person and be satisfied. Get their sweet tea also! So good! Overall, I enjoyed my dinner and the experience."}
{"text":"Came in to Bobby Q for lunch on Fathers Day and was seated pretty quickly! Quality of the food was amazing, and their service was equally as awesome. 

We started with the Q-Rolls--which is basically egg rolls but filled with bbq meat. They come with a chipotle aioli sauce and bbq sauce on the side (the aioli was awesome!). I ordered the Beef Brisket Burger and it was perfect. Juicy, tender, and full of flavor. The side of Mac and cheese was delicious and super cheesy. And to top it all off they gave us these cinnamon crusted donuts that were hot out of the oven (which also tasted great). 

Our server Ann was super helpful and friendly. Didn't need to ask for a refill of a drink because she would bring one out for you before you even realized you were almost out. My dad asked to sample one of the sides before he ordered it and she gladly brought it to him. 

Great service and a great restaurant. Def will need to come back and try out the bar next time!"}
{"text":"New location but same fantastic smoked meats as the other locations. Love the remodel and atmosphere especially the patio. The wine list is really upscale now which is a huge plus. I do wish the had their world famous beans on the menu here as well as some seasonal vegetables like sweet potatoes brussel sprouts etc.... love  this place.

Had the baby back ribs today which are the best in the country in my opinion"}
{"text":"AMAZING FOOD & GREAT SERVICE. It's not rated the top 30 best BBQ in the country for nothing! I basically live there, and each time is better than the last! The Q-Lada handcrafted cocktail is delicious and I also really enjoyed the Cajun Shrimp appetizer. Great atmosphere for families or a date night!"}
{"text":"EXCELLENT dinner and service. The Bobby's Mule was perfect. The filet was one of the best steaks I've ever had, and the Mac n cheese and Brussel sprouts with bacon were phenomenal as well. Our waiter and the manager were very nice too! Definitely will be back - one of the best restaurants in Phoenix."}
{"text":"With all the hype, I was expecting something special. I consider myself a bit of a BBQ expert. Tried the place twice to make sure I just didn't get a bad night. Their meat is mushy, especially the pulled pork!! They may be soaking their meat in tenderizer, who knows?!? Unfortunately, this place is now off of my list"}
{"text":"We were looking for good BBQ and got it, and more. The restaurant has a cool feel to it.
Pros: 
- Service was excellent, starting with the hostess who was super friendly and then the server was excellent. Everything came out promptly and correct.
- Food was excellent. The corn bread they brought out early was amazing. We got the 3 meat BBQ platter and the chicken, pork and beef ribs were great. We didn't have room for dessert but they brought us out some take home mini-donuts.
- prices were reasonable.
Cons:
None"}
{"text":"Note was an awesome waiter.  Renée is an excellent manager.  The service and food ( baby back ribs) was fantastic."}
{"text":"The stapley location is so much better... it's unfortunate because this is so close to my work,  but it was just average at best.."}
{"text":"Great food great service and beautiful setting! One of the only places in town where you can get bbq beef ribs! The Q Rolls are brisket rolled in a flour tortilla type wrap and deep fried! The entrees are big portions and they have a full bar! Pretty sure you won't be disappointed!"}
{"text":"Awesome spot! So glad to have a Biltmore location now, it is much closer to me than the other locations.  Great food, anything from a good steak to bbq pork. Love the mashed potatoes with country gravy and the cornbread! Also they have delicious complimentary donuts they give you at the end of your meal. Check out happy hour too :)"}
{"text":"DO NOT MISS this delicious, friendly, cozy, cool restaurant!!! Perfect for locals and tourists, Bobby Qs is the epitome of exquisite and melt in your mouth BBQ!! Service was caring, attentive and efficient. Greeting was friendly and accommodating. Sauce is OFF THE HOOK! We took a big jug home for our summer cook outs. The patio was beautiful, comfy and sheltered with lovely hanging plants and terrific atmosphere. Music was uplifting and retro...we were singing along. The Q Rolls are a MUST!! You will not be disappointed!! Our kids love it too. :-)"}
{"text":"We've been to all the Bobby Qs locations and they never disappoint. This location is a bit small but still has the Bobby Qs feel. The food is nothing short of amazing!"}
{"text":"It was lots of fun to meet with extended family here. The wait staff was great as were the wine and mixed drinks. The smells coming out of the kitchen were also wonderful. We had eaten at the I 17 location before and were really looking forward to the food. For the price the food just did not have the wow factor that we had had at the other location. I had ordered the half rack of baby back ribs which did fall off the bone but the flavor was just a little bit different. I also order the Q roll as a appetizer which had good flavor but was dry even with the dipping sauces. I also felt the food was maybe a little too salty maybe that was the difference for me that night. I would return to this location for drinks and lunch but most likely not dinner."}
{"text":"It's been many years since we've been to the original Bobby Q's on I-17 near MetroCenter and we've certainly never been there as much as we used to go to it's predecessor, Bobby McGee's. However, after spending a weekend camping with the Boy Scouts and trying to come up with a place to eat on our way to Zoolights, I remembered seeing that Bobby Q's had recently opened a new location at 32nd Street and Camelback and we decided to give it a try.

Located just East of Safeway, in the space where Mexx32 used to be housed, Bobby Q's is a dark, warm space that is very inviting. Because our November weather is so perfect, we chose to sit on the patio and it was great.

Our server, Joseph, did an excellent job and filled us in on the specials and his favorites. I went with the three meat platter and picked babyback ribs, brisket and pulled pork along with a side of grilled vegetables. My wife and kids were all in the mood for burgers and they all ordered the Smokehouse Burger. 

Everyone enjoyed their meals very much! The meat on my ribs was perfectly cooked and falling off the bones and my brisket and pulled pork were excellent with just enough bbq sauce added to flavor them perfectly. The rest of my family enjoyed their burgers and even though the boys didn't finish their burgers, they took the leftovers to go and warmed them up for lunch the next day!

Service was very attentive and they made sure that they refilled our sodas, tea and lemonade whenever they started to get empty. Pricing was very reasonable for a family of four and this is certainly a place to which I would return.

Bobby Q's, you're a hit in my book!"}
{"text":"I choose Bobby Q for my birthday dinner!! They accommodated my larger group and it was great! Had plenty for leftovers which were even better the next day! I'm so glad this is closer to where I live now!!"}
{"text":"Went here last night for dinner and sat on the patio. It was super cute! Our waitress was in training, but both she and the trainer were awesome. Very friendly and attentive. I got chicken and brisket. The brisket was delicious! The chicken was good too, but I probably wouldn't order it again only because I liked the brisket so much more. The restaurant was very clean, but the floor in the back was so slippery, like maybe too much solution was in the water when they mopped it? I was wearing sneakers and my boyfriend was in flip flops and we were still slipping and sliding. I feel bad for anyone in heels! Overall though everything was great and we will definitely be back."}
{"text":"Amazing food! But even better service, super friendly. The portions were big! Definitely will be coming back! I got the Full Baby Back Ribs, and the meat literally fell off the bone"}
{"text":"While in Phoenix area for spring training we ate here. Family of three including a 12 year old boy. We ordered \"the whole hog\" or something like that for $51.00, what an amazing deal. We got 2 things of baby back ribs and double beef brisket. This ribs were quite possibly the best I have ever had, and the brisket was really good too! Will definitely come back here when in the Phoenix area again."}
{"text":"OMG!!! Best barbecue EVER!! We will definitely be back! The ribs were my favorite, I didn't really like barbecue until I tried this place."}
{"text":"I love Bobby A' s and have been going to the one on27th Ave for about 20 years. Now I just started going to Biltmore location and it's amazing! I love love love this place!!!!"}
{"text":"OMG BOBBY Q'S YOU ARE TESTING MY PHYSICAL BEING WITH YOUR AMAZING FALL OFF THE BONE RIBS WOULD YOU STOP????? I was raised in Georgia, so barbecue was basically a food group that was presented at basically any family gathering, duh. I guess you can say that after having BBQ so many times, I can probably tell you what is quality and what is not. Bobby Q's is where it's at. I had such an amazing experience here. 

I brought the boo a week or two after the grand opening: the first thing on our table were two perfectly baked corn bread rolls with a dollop of butter (basically already speaking our language, southerners put butter on freaking everything). They were so delicious! We had to stop ourselves from eating them because we did not want to spoil our appetites for the Q Rolls, our main entree, and the mac & cheese side. We decided to split a rack of ribs between us for our entree. The ribs, we learned, were smoked in house and were brought out with the three kinds of signature Bobby Q sauce. As soon as I tried to cut into a rib it fell apart, clean off the bone- something you don't see very often unless the chef knows what they are doing... and BOY did they know. 

We basically ate that in 3 minutes flat and then chowed down on some Q Rolls: small taquitos stuffed with beef brisket and served with a chipotle-style sauce. Our side of mac and cheese really could not be beat. Some BBQ restaurants will do the most with everything in the restaurant BUT mac and cheese. This was so good, you could definitely tell it was freshly made (no clumps, super creamy and heavy).

In short, Bobby Q's is definitely now my top choice of BBQ. 

-Outdoor seating 
-Outdoor seating does not allow puppers
-Great date night spot 
-Bar shares the outdoor patio"}
{"text":"Rachel was awesome! We were pleasantly surprised with the quality of food, service and atmosphere.....it exceeded ALL our expectations. 
The cocktail menu is the bomb!!"}
{"text":"Came here for happy hour with some work folks. We actually won their business card drawing contest so got some free appetizers. The happy hour drinks are pretty solid. $5 for a pitcher which gets you about 3 beers from it. And they have some good beers for the pitcher not. Not just your normal domestics. For apps we got the brisket nachos and the pretzel. The nachos were large in size. The pretzel was big as well and came with beer cheese, marinara, and a mustard sauce. The pretzel was delicious so we ordered another. Patio seating was nice as it's covered so stays cool during the summer. Definitely will be back for some actual bbq."}
{"text":"Wow!  What a disappointment!  2nd visit, so I guess we have to return one more time to see if it's good or bad!  This time the ribs were jumbo, mature and strong taste to them.  I brought half home but they weren't even good enough to eat today or ever.  The server might have been new and wasn't paying attention so she messed up on the drinks that took forever to get!  The Pour for the scotch was one of the smallest pours we've seen.  The wines per glass  are expensive considering the quality.  The cole slaw and the crisp shoestrings were excellent.  My husband thought the rotisserie chicken was average....no better than Costco!  People like the donuts.  I think they are just a ring of dough of pure fat.  So I give it a 3 star but really want to put in a 2 star!  We won't rush back."}
{"text":"Love the QRolls!  Ribs are amazing ! I will go there for take out just for these! 
I have been about 5-6 times, every time the food and service are top notch!!"}
{"text":"The only complaint I have about this place is there was no warning about how damn full I would get. They need to have a dark, cool room to digest after eating, because the food coma is real. EVERYTHING about this place was world class. From the greeting at door, the ambiance, the great service from Ricky and Lauren and the FOOD. Some of the best BBQ I've ever had! Will definitely make this a regular place when we visit Arizona!"}
{"text":"Been to this location a couple of times for lunch. I think the food really lives up to the reputation of the original location. I love the q rolls for an appetizer. I usually get a platter with the different assortment of meats, all being excellent. But the ribs there stand out for me. Fall right off the bone and taste like heaven.

Don't forget to grab a free bag of donuts while you are there. Super fresh and a perfect little pre meal or post meal snack."}
{"text":"Meh!  2nd time around.  First time was a few days after they opened and service was rough and the suggested appetizer (Q-rolls) were awful!  Dripping with grease.. we shared one of the half dozen and left the rest.. (we were never asked why).  Since they had just opened, we figured they were just finding their groove.
We finally went back last Friday for happy hour.  Surprisingly, there was lot of open seating!  We went through 3 diffferent servers before we got one that said she was our official server and brought us water.i think her name was Krista.  She was an awesome and fun server! 
Unfortunately, it did not take away from the extremely odd tasting meat.
We tried the brisket tacos (meat was weird), machaca nachos (meat not terrible, but unusually uneventful and definitely not machaca) the wings were fairly good.. they dip them in pork juice (Krista had told us), glad she did..or I might not have been able to make out the non chicken flavor..
Margarita was ok.  I had two.  Both times asked for no salt and both times I got salt.
The complimentary sugar donuts to take home is a nice touch.. 
we always try a happy hour at places first to determine if we would pay for a full priced meal.. unfortunately, (because we live across the street) we will not spend our money here again.. really wanted to love it."}
{"text":"My Phoenix work office isn't too far from the Bobby Qs off the 17 fwy on N 27th Ave. In fact, that location had been on my radar for YEARS; but, never made it out there for whatever reason. Then, one day, I found myself driving around the Biltmore area, trying to kill time before my flight and happen to be hungry. Lo and behold, I see a Bobby Qs. Meant to be? Maybe. But, sure, why not?

I was there for an early lunch because it definitely wasn't crowded. The clientele were fairly well-dressed. Dressed in a zip up workout sweater, tee and yoga pants, I definitely stuck out. Service was excellent and my server was very attentive and helpful, offering suggestions and answering my questions.

I ended up ordering the lunch platter sampler. My choices of meats were brisket, pork ribs and sausage. For my sides, I picked potato salad, added pecan coleslaw and it came with cornbread. The brisket was a bit on the dry side and the ribs were okay. I was told that the Q was cooked on site, but it didn't have much of that smokey flavor you would expect. When you add the BBQ sauce, it makes a decent meal. But, I'm not a fan of drowning my meat in sauce. I did enjoy the sausage and the cornbread was fantastic. The coleslaw and potato salad were kinda bland. 

At $18 for the sampler platter, it's on par for what other BBQ joints charge. The plate is enough that it could easily be split with a friend or significant other. Curiosity satisfied, I just found Bobby Q just A-OK. For Phoenix, I'd rate it a 4-star. But just based on past Q experience, it gets a 3.5 rounded down to a 3 from me, since I doubt that this place will be the first that I think of, when I am craving BBQ."}
{"text":"04/12/2018  Bday Dinner 
I was driving by the area & decided to stop by for dinner. We were greeted by a host and sat to table right away. The interior of restaurant is beautifully decorated and your able to see seek peek of kitchen. Server was quick and made food suggestions. The food arrived quickly and Everything seemed to be fresh made. We ordered the 3 meats with 3 sides & had plenty left overs. Cant wait to return & try something new in the menu."}
{"text":"Food was very good. Great atmosphere and staff was very friendly. Highly recommend!! Ask for Rachel great server..   very  knowledgeable.."}
{"text":"For a  relaxing outdoor patio and drinks night - this is a really fun hangout. The patio feels like an oasis and the wait staff really make it an enjoyable experience - Krista is awesome! The bbq is great - we all agreed their cornbread is excellent and everyone loved their bacon fried Brussels sprouts! Really worth a visit here."}
{"text":"I like the scenery here, the steak was great but the macaroni was very good! I do not know the recipe but that macaroni was probably the best I've eaten"}
{"text":"Fantastic BBQ and fantastic service. Good wine selection and great ambiance.  Second time at this location and it does not disappoint."}
{"text":"Bobby-Q's just one upped themselves!! I didn't think it possible but I like this locations more than any other I have been to. My BFF and I decided to check out this new location not long ago and it was the most adorable place. I'm going to call it a Boutique version of their other 2 restaurants. Something a little more upscale. This locations also offers different craft cocktails, new menu items and an even more gorgeous patio if thats possible. I ended up getting my usual Q-sticks and Mac-n-Cheese because I just cant help myself. Everything was just as tasty as their other locations. I hope to see more of these smaller fun locations around the Valley. Great concept."}
{"text":"I've been living in Arizona for over 10 years now, and I've never been to the famous Bobby Q Peoria location. I've heard so many good things so I was ecstatic to find out that they opened a new location close to my house. 

We were immediately sat down as they weren't busy at all (I'm sure that's about to change), and our server took longer than usual to acknowledge us. Because of this, the manager gave us two complimentary Q Rolls which were so good. They reminded me of Filipino lumpia except it had delicious brisket on the inside. They were crunchy and paired well with the side sauces. Our servers since then had been very attentive and the manager sat down to chat with us about the great quality of meat they have which was very apparent. 

I split the two meat combo with my sister and for $23, it was well worth it. I had the prime brisket which was fatty and rich, and the beef ribs which were equally delicious. My boyfriend had the ribeye steak which he thought was amazing. We were served corn bread with butter and it was one of the best corn bread I have ever had. Little Miss BBQ is one of my favorite restaurants in the valley, so I couldn't help but compare both. Little Miss BBQ definitely has way better tasting barbecue sauce and fattier, tastier meats (which may overwhelm some people), while Bobby Q has an array of choices when it comes to meats and sides, not to mention better sides as well. I had the potato salad which was bomb, and the mac and cheese. You can definitely taste the smokiness in Bobby Q's meats. I can still confidently say that Little Miss BBQ still takes the cake when it comes to best barbecue in Arizona, but Bobby Q follows very, very close behind. I will definitely be back!"}
{"text":"The most amazing brisket I have ever had!  Very tender and flavorful!  And the baby back ribs were to die for!  Service was fantastic! I would definitely recommend trying this place if you are ever in Phoenix!"}
{"text":"So my Dad and I were in the need of some late night grub and came across this place on yelp. I live in LA and my Dad lives here but is new and not super familiar with the area yet, so we took a chance. Boy I am I glad we did! Showed up about 11pm and it was rather quiet but no biggie, it's Arizona in the summer ;) Our server was so rad...Joe from Jersey, and he was super sweet and genuine and made some great suggestions on the menu. After 10pm they have a limited but good and very reasonably priced menu...not sure if that's weekend only but it was fantastic. Food was great even for a late night eat and we walked away full and wicked happy. Really gotta to give it to our server though, Joe was a stand up dude and so accommodating....especially for it being later in the evening and being not very busy. Most late night places I've notice just want you in and out and want to go home. If you are in the area and are thinking of a place to go please check this out and ask for Joe!!"}
{"text":"Brisket tacos hit the spot. Lunch portions were perfect size and service was great! The cornbread to start was a great addition. And the cinnamon sugar donuts to finish completed a delicious meal!"}
{"text":"Got cocktail and wings and they were amazing! The mojito was right on point! 
The wing was appetizer but the portion was huge and it can be a full meal actually! I love the patio! Such a welcoming and relaxing atmosphere. Love this place"}
{"text":"Great barbecue spot in the Biltmore area! Had the pulled pork sandwich and the smokehouse burger, both of which were great. The cornbread and doughnuts are a nice touch and delicious!"}
{"text":"Saw the reviews and figured we had to go. Sure glad we did. Everyone was super nice and the food was excellent. The four of us ordered the roll q and hog heaven platter. There was a favorite for everyone in the group and even had leftovers to enjoy. The cornbread was so yummy too! My bf's mom loved the cinnamon sugar donuts they give you as a thank Q. Loved this place  and will be back when in Phoenix."}
{"text":"Amazing food. Amazing service.  My fiancé's food didn't come out as he had hoped and our waiter and his manager were eager to make it right and make him happy. We will definitely make this a go to spot."}
{"text":"Everything was perfect (food, drinks, and atmosphere).  We go a lot of places and thisbolace stands out.  Door was excellent. The general manager (Joanna) even stopped by our table to check on us.  She runs a good show."}
{"text":"Bobby Q's is amazing!!!! Always 5 star food, service and this new location is by far impressive. I am so happy they opened this location so close and in the Biltmore. I know most people have been to the other locations but I am definitely telling everybody about the newest Biltmore location. So happy about them adding on nearby where I live."}
{"text":"So good. The Q rolls out of this world. The deep fry isn't too heavy. I like it with the chipotle sauce. The vibe is a bit classy not what I expected but I enjoyed it"}
{"text":"Simply outstanding!  Love to visit Bobby Q's during my travels to the Phoenix area. Beef brisket is so tender!  Perfect. Likewise, baby back ribs delicious.
Highly recommend!"}
{"text":"Wasn't what I expected for all the high reviews. The broccoli Was too tough to chew, the cole slaw was average, and there was way too much meat in proportion to sides. Won't be going back"}
{"text":"Absolutely amazing. From the great service, to the delicious entrees and sides this was an awesome BBQ experience. Ricky our server was very attentive and offered wonderful suggestions. The Q-Rolls are a must. Their ribs fall right off of the bone. Their Mac n cheese was delicious. I can't wait to come back next time."}
{"text":"We came into town for visit with friends and family. We all heard about the new Bobby Q in the Biltmore area. it has been around for close to a month.

I can honestly say, I know this is not KC BBQ, but it is really darn good!
The only recommendation is to get some great signage out in front. I know you are new, but I almost missed the place with the banner.

The decor is surprisingly nice and friendly. I was not expecting this look and feel as the location is in a strip mall. That being said, it is done very well inside.

On our visit, the staff was marvelous, from getting seated to our waitress to the Manager, everyone really went out of their way to make you feel welcomed. It felt very real and warm and not fake. Kudo's to all, especially our waitress Rachel. She was fantastic and really took care of us.

We ordered the Family Feast for our entree. If you want to try something new, this platter has an assortment of meats to try, Ribs, Chicken, Brisket and more. It is more than enough for two and could possibly feed three and is a great deal at $39!

The chicken was very moist and tasty, the rib meat literally fell off the bone and the other items were also tasty. I was a bit surprised that the BBQ sauce does have a bit of a bite so be ready. Nothing bad, but surprising for a sauce.

The house salad was made as requested and to top it off they give you a few small sugar donuts that have the look and taste of beignets. Really tasty!! :) I wanted more of those to go with the gelato I got across the street.

So in summary:

Ambiance - 5
Service - 5+
Cleanliness - 5
Food quality and taste - 5
Bang for Buck - 5

I wanted to try their steaks, but the bang for the buck on this platter cannot be beaten. I highly recommend this establishment as they nailed all the things you look for in your dining experience! :)"}
{"text":"I have been to the Bobby Q location off of I-17 and Northern multiple times and have been incredibly disappointed. So I was, needless to say, reluctant to try the Bobby Q location in the Biltmore. However, I have been to the Biltmore location 3 times now and have been happy with my food and the service. Their hot links with the spicy bbq sauce are outstanding, and of course, you have to have a couple of their fresh mini donuts on your way out the door. I wasn't impressed with the spinach queso dip or any of the sides I've tried thus far...better to pass them up and eat more meat! I'm hoping they'll add bbq baked beans to the menu sometime soon. Both the dine-in and take-out service are speedy and friendly."}
{"text":"Bobby Q's has never disappointed me, or my business colleagues.  I highly recommend anything on this menu from salads to steaks.  Their mac 'n cheese is super creamy, thick with 4 cheeses.  Their Q roll is the taquito bomb -  a must try appetizer.  I usually get the pulled pork sandwich, but recently, I had one of the best burgers ever at Bobby Qs.

There is a 1-star rating from Mike L. which I cannot believe to be true.  I've spent a lot of time in KC, South Carolina, and Texas areas in my lifetime.  Eating out a lot on business and I am a BBQ aficionado .  Believe me,  I  have had some really great BBQ, and some really bad BBQ (especially in KC where even bad BBQ can stay open because BBQ there is like burgers and pizza everywhere else).  I have about 30 BBQ books I've collected over the years, and I've been brining meat and smoking for 30 years now.  Their BBQ sauce is decent, but certainly nowhere near \"piss\" as one person made in his brief and highly negative comments.  I think it is better than many BBQ sauces offered at restaurants.  My guess, this reviewer owns a restaurant nearby and isn't happy Bobby Q's will take business away.

Bobby Q's is similar in ways to Pappadeaux Seafood Kitchen in Peoria - which is my favorite fish restaurant in AZ, and beyond and so is Bobby Q's my favorite BBQ joint.  Yeah I've had a particular item that is better at another restaurants somewhere in the nation, but these 2 restaurants are favorites because they always deliver a consitent \"Yum,\" and occasional \"Wow!\"   In my life, I got to spend a lot of time in Louisiana and eat at 5-star restaurants where a particular fish dish was amazing.  Again, what makes Bobby Qs and Pappadeuax a favorite is their extensive menus in a particular food type, and the food served is always very good to amazing depending on what is ordered, and when.  There is never just a decent, or sub par experience at either of these restaurants.  I always leave saying, \"Man that was GOOD,\" or \"Wow, that was Amazing!\"   I've always left Booby Qs wanting to come back again the same week, if I could.

As a point of reference to a reader, let me say that the Cheesecake Factory I believe tries to do something like this with a vast and varied menu, but I think they fail at it where Bobby Q's doesn't.  I've only had sub-par to decent food at Cheesecake Factory excluding their cheesecakes which never disappoints!  For me, the Cheesecake Factory has never delivered amazing food where Bobby Q's has.  Also, I think the Elephant Bar with it's varied menu as being maybe one step above the Cheesecake Factory in regards to taste of the entrees - they are consistently good."}
{"text":"We really enjoyed dining at this restaurant. The ambiance was party-like. So not for a person who wants a quiet experience.
We got a complimentary appetizer because we were seated approx 10 mins before a waitress greeted us. The Mgr also came over to apologize,  which was kind.
My honey got the Prime Rib, medium well, which was tender as heck! I ordered grilled salmon, and it comes with a light glaze. Not over seasoned, which is perfect for me. And it was moist! For sides, Mac & Cheese for him. It was stove-top tasting with a Velveeta cheese flavor. The cole slaw I ordered was good. All in all, it was very good."}
{"text":"This is my favorite new neighborhood restaurant. The food was fantastic! We had dinner at 5 because we had our son with us. The staff was very nice and accommodating as we ended up taking turns eating."}
{"text":"My family is from Kansas City, so I have a high standard for BBQ. Luckily, Bobby Q didn't disappoint.

There isn't a ton of great BBQ in Phoenix, so I'm glad Bobby Q opened in my neighborhood. I ordered the baby back ribs, which were fall-off-the-bone delicious and my fiancee ordered the pulled pork sandwich, which was tender and dressed to perfection.

The sides are also great and BIG. Sharing is encouraged. 

Cocktail menu is interesting. There are tons of unique drinks and each was photographed so you can basically point to the menu to order.

The donuts you get when you leave are also amazing. I didn't know what to think of the little to-go bag at first, but I couldn't stop eating them on the way home!"}
{"text":"First time in Phoenix and had a sometime to kill for dinner.  It is a bit north of Phoenix, but it was worth the drive! 

Food:

Comes with complimentary cornbread, which is delicious, made fresh! 

Ordered the shrimp appetizer- comes with 3-4 huge garlic breadsticks and about 8 fairly large shrimps.  Shrimp has a good smoky flavor and the garlic sauce is fits well with the shrimp.  Although, it is a bit too oily for my taste.

Entree- Ordered the two meat combo, beef brisket and South Carolina ribs.  It came with two sides ordered the mash potatoes and roasted corn.  Beef brisket is absolutely delicious, good amount of fat with the balance of the meat.  Ribs were my favorite though, fall off the bone literally, the bbq sauce has a kick to it which I also really enjoyed.

After the meal, they gave complimentary donut holes that were surprisingly good.

Service was on point, owner I believe always checked on everyone very cool hangout spot and environment to be in.  Excellent food and place."}
{"text":"I had never been to any of the Bobby Q locations so I was excited to try bc I've heard good things! It can be hard some times trying new places (esp bbq restaurants) as I am a pescatarian but our waitress was great at giving recommendations for me! I had the vegetarian burger and Brussels sprouts (minus the bacon) and loved it! The vegetarian patty is made in house and seemed to be rice based. My boyfriend had the Q-Rolls and really enjoyed them! We both loved the cornbread as well. We enjoyed the overall experience and definitely will be coming back!"}
{"text":"My partner and I went there for lunch today and it was an amazing first time experience there. The wait staff were so nice and friendly. The manager Laura came to our table and asked us how or meal was, it's not every day that the managers come to check up on the guest. It's a great place for lunch or dinner I highly recommend it Thank you to the wait staff and the manager for your hospitality. I know I will definitely keep coming back."}
{"text":"Service was awesome.  Had the beef brisket, baby back rib and sausage all perfect.  Took my picky sister who literally hates every restaurant and she loved it.   Our table had two rounds of the hot, buttery cornbread....wow!!   The atmosphere is perfect.  Just big enough.   Highly recommend!!!"}
{"text":"I've gone to the other location many times. Was always amazing, but was a little far for me. Hoped this location was as good as its closer and omg! Amazing food, amazing atmosphere, but service wasn't the best. 

 I read the other reviews on here and one guy said the food tasted like vomit. I don't think so. Haha, I gotta admit, if the main ingredient in their food was vomit, I'd still eat it! Soooo good, and that corn bread. Wtf!?!? AMAZING"}
{"text":"Aside from the decor being a bit interesting for a BBQ establishment the food was legit! Being a designer I had a hard time associating the environment with the menu design, but enjoyed my experience!"}
{"text":"This is a great addition to the Camelback corridor restaurants. The ribs and steaks are the specialty and amazing. We had a fantastic server who is a guy who moved from one of their other locations. Took great care of our large party. My wife asked for a drink from the bar and said \"surprise me\" and the bartender mixed some fruity concoction that she liked so much that she had a second. Wow! I had the full rack of baby backs and the meat was tender and flavorful. Sauce was just right. Others in the party had the filet mignon which they said was outstanding -- That's a big deal in Phoenix/Scottsdale that has so many high end steakhouses. Also, they are open late -- after midnight most nights. We will be back -- often!"}
{"text":"Wow first off the BBQ is good, really good. The portion sizes are HUGE! We got the whole hog which is basically whole portions of each meat with three sides. It says it could feed one or two but honestly it could easily feed 4. The meat was fall off the bone and smoked to perfection. I've eaten a lot of BBQ but am by no means an expert. I do think this is more consistent with what you would expect from a sweeter Kansas style or St. Louis BBQ with a liberal amount of moisture and sauce. The huge beef ribs are not a dry bbq, but are also generously sauced. All the sides were great. We had the should string friends (addictive!), mac and cheese, roasted corn, broccolini, and cole slaw. All were solid and delicious. We also had a kale salad and the q rolls not realizing how the portions were. Both were also excellent. The food came out quickly and service was friendly. Don't forget to eat the cornbread and donuts!"}
{"text":"Food was excellent. Had the 3 combo meal with pulled pork, baby back ribs and bbq brisket. Delicious!  The waiter, Joe, was great!  Very nice atmosphere. Plan to return often."}
{"text":"The ambience, food, and employees are all 5 stars no doubt. We ordered different things and i was able to try all of them. I had the beef barbque brisket sandwich and the meat was very tender and it had the perfect taste by far the best brisket i have had thus far. The other entrees ordered were the perfect hamburger and the vegetarian burger. I was impressed by the taste, because I felt like I was eating hamburger meat. I'm not vegetarian by all means, but this burger was delicious. We also ordered some delicious drinks and the pina colada was a bit strong, but loved the presentation."}
{"text":"Fabulous food just like the \"original\" Bobby Q. We went to this location because it was closer and we were not disappointed. The restaurant is in a strip mall but has a cozy, heated outdoor patio with about 6 tables on it. The inside of the restaurant isn't very big so I would recommend a reservation."}
{"text":"Overpriced for the portion sizes. I like my brisket sliced and trimmed and this was more like chopped. Service was prompt though. Taste was just ok overall but not memorable. The ambiance was pretty cool - kinda rustic elegance."}
{"text":"It's nice to see Booby Q expanding eastward towards me.  This location on Camelback near 32nd St has a good amount of parking and an open air feel.

I sat at the bar and the first thing you get is some free corn bread which was really good.  For lunch I went with the brisket tacos.  The serving was a good sized portion and it was full of moist and tasty brisket.

I like this place and will definitely be back from time to time."}
{"text":"Great addition to the camelback east neighborhood. We were missing a great barbecue spot, and I think this is it!

The pulled pork and short ribs are so tender.. the Q rolls are a must appetizer... and also very reasonably priced drafts($6). 
Also to note the entrees are quite hefty so the two meat combination platters are plenty to share for two."}
{"text":"good bbq. great service. i split the two meat platter with my daughter. the baby back ribs were excellent. the beef brisket was good, but i was expecting better based on the reviews. at this price point, there are better bbq destinations in town."}
{"text":"Inside talk: Girls; there is a purse shelf in front of a mirror in the ladies restroom!  (Restaurants take Note) 
The portions are Huge! The smell of deliciousness will stop you in your tracks as you walk by and invite you in! 
Brisket was tasty!  Roasted corn yummy. 
View was great and staff was awesome!"}
{"text":"This place is amazing , the ambiance , the service , and the food makes you crazy , you become addicted to the ribs they have that is made to extra perfection , unbelievable tasty sides , Cajun shrimp is a must for appetizer hands down , extremely highly I recommend everyone !!!!!!!!"}
{"text":"This is the best BBQ place I've ever been to. Everything is homemade, and the portions are big enough for leftovers. Our server, Michael, was also very friendly and  helpful. The menu has so many great choices to pick from, his suggestions were spot on."}
{"text":"First time at this Bobby Qs location. Regular at the original location on I-17.

Man, what can you say. These guys know how to cook meat like no one else. The brisket is the best in the world. The baby back ribs also qualify as the best ribs I've ever had.

Cornbread to start is excellent. Best cornbread anywhere.

They also make some mean drinks. The old fashioned with the maple syrup is two thumbs up - best old fashioned. The princess peach - don't let the name fool you - is a zesty refreshment.

Service is very good and the decor is intriguing with the feel of something special yet comfortable and relaxing. Of course the smokey meat flavor wafting through the air is the best part of the decor. Decor A+

Can't recommend this place enough. A lot of the bests are available right here. These guys know what their doing."}
{"text":"I never thought I'd find amazing BBQ in Arizona but lemme tell ya, this place has it. They got an appetizer called Q-Rolls and they are FANTASTICALLY DELICIOUS! Our waitress recommended them and I second her recommendation. I had a half back of ribs with Mac and fries which was amazing as well. This isn't just fall off the bone ribs it's you pick up the rib and the meat stays in place and the bone just slides out ribs, perfection . Let's not forget the cornbread that was perfectly moist and sweet. The atmosphere was pretty amazing too, great decor!  Not to mention the little churro like doughnuts that are SOOO good. There wasn't one thing worth complaining about beside the fact that I walked in with a flat stomach and walked out looking six months pregnant and have been waddling since."}
{"text":"Great ambience and fantastic food! Don't let the strip mall location fool you! Charming restaurant with an array of foods. Chilled plates for the salads a nice touch, Brisket was incredible and the Q rolls a must. Service was great too. We will be back soon!"}
{"text":"I am not a huge fan of \"smoked\" cuisine.  It is a time consuming art honestly lost on me.  That being said this place is pretty delicious...even for one with a palate lost on the art of the thing.  Generous servings.  We enjoy the sides.  Atmosphere is good.  Drinks likewise good and generous."}
{"text":"If you are in the mood for great BBQ, this is the place! My bride and I went to the Pheonix (original) location last year and had a great time. This place is just as good. 
The food is consistantly great and comes out fast. Our server, Anne, was very attentive and provided exceptional service. If there were any drawbacks to this location I would say tables are a bit small if you have a party of four and order the \"Whole Hog\". This place is located in a strip mall so the parking can be a little conjested.
We had the whole hog and our friends ordered the prime rib and half rack of ribs. Everything was cooked to perfection. We have made this a regular stop everytime we visit Pheonix."}
{"text":"My father and I ran across this restaurant when we were looking for places to eat online and boy am I glad we did! The atmosphere was very homey but still classy. Our waiter, Chesney, was so inviting and helpful. He make the experience even better. The Q-Rolls were fantastic and the smoked prime rib beef brisket is to die for. Many people checked on us and it made it feel like a hometown joint! To top it off when they brought us our check, they also gave us mini donuts as a thank you! We left satisfied and itching to go back again!"}
{"text":"Okay so Bobby Q really deserves 3.5 stars food wise, but I will round it up to 4 because of the overall experience. As suggested by most reviews we started our meal with the q rolls. My oh my, everyone is right because they were phenomenal! Tender, juicy brisket wrapped into a crunchy roll. An awesome American twist to the traditional spring roll. There was 3 adults and 2 children in our party so we decided to order the whole hog consisting of: beef ribs, pork ribs and brisket. The meat was overall good, but maybe a little bit too tender for my liking. Obviously they have to cook this ahead of time, but I could tell it did not come directly off the grill/smoker. We did really enjoy the variety of sauces they offer especially the \"Q-a-lina.\" If you are in a party of 4, the whole hog option is way to go. Service was prompt and friendly. Classy interior with a beautiful entrance filled with plants along the bar area. I also love the fact they have complimentary corn bread to start and donuts to end the meal. Not sure if I'll be back, but the least I can do is write them a good review. If I come back, it'll definitely be for the q rolls!"}
{"text":"Great customer service Riley was awesome!
Food was great and nicely priced too. 
We had the platter with ribs, pulled pork and brisket. It was one of the best bbq I have had and reminds me of a place in Arkansas that I truly missed"}
{"text":"That brisket... just amazing! Got the Whole Hog meal for 2 and had leftovers for days. Yum!
Definitely try the sangria because it tastes like wine candy juice. And the service was just great. We'll definitely be back!"}
{"text":"Server Danny was above and beyond amazing. He was  very attentive with a great sense of humor. Very refreshing. Our glasses were never empty:) thank you Danny! The manager talked to us to make sure everything is up to par. I appreciate their desire to always be better and customer oriented."}
{"text":"Their food and service was outstanding. I have had BBQ from all over and I vote this the best food I've had in a long time. Complimentary corn bread and sugar donuts were the cherry on the icing. Thank you for serving us!"}
{"text":"What's better than a locally owned, thriving chain with awesome food and perfect service. NADA!! The thought of something a little extra comforting sounded good to a friend and I for lunch, so we checked out this new location. We shared Qrolls, Mac n cheese, cornbread and a couple house salads. All were perfect except the cornbread was a little bit boring. Our server, Megan, was thorough, prompt and kind. We especially enjoyed the great patio."}
{"text":"Excellent food! The staff was above and beyond, super friendly and nice!! Highly recommend!!! Rachel was the best waitress!! Thanks for a wonderful meal!!"}
{"text":"Service was fantastic, Colton was the best server we've had in a long time at any restaurant. Food is great and always consistent."}
{"text":"The server was great and very friendly. The food was sub par, and overpriced for the taste and quality. The potatoes tasted like powder packaged potatoes. Very nice interior but food leaves a lot to be desired."}
{"text":"For the last decade plus, Bobby-Q has been consistently delivering quality BBQ at their sole I-17 location. And then recently, almost unexpectedly, they branched out, opening a second similarly styled location in Mesa. And then, rather surprisingly, I read that they would be opening up a third location in the building that previously housed the mediocre Mexx32.

Being a huge fan of Bobby-Q, I've always found this expansion a bit concerning. But let's face it: the dude ran a very successful chain called Bobby McGee's for many years, so I think he knows a thing or two about the restaurant industry.

This location is a bit different in the sense that it's a scaled down version of Bobby-Q. The menu is the same, the food is identical, it's just all confined to a smaller space. And there's nothing wrong with that.

Bobby-Q is one of the few restaurants that I rate as a five-star experience. Not so much because of one particular item that blows me away, but because it's one of the few places I've found where you can order a table full of food, including sandwiches, appetizers, and sides - and virtually every damned item is delicious! 

The Q-Rolls are an essential starter and are packed with some excellent smoked prime brisket. Additionally, the complimentary cornbread is leagues above those cold muffins that most people dish out.

For the actual meal, my girlfriend and I usually order the pulled pork, which has yet to disappoint. There's a subtle smokiness to the meat that's consistent in flavor and texture. And unlike most BBQ joints, Bobby-Q is one of the few that I've found that doesn't skimp on side quality. The mac and cheese is simple, but similar to the cornbread, exceeds the quality of what you will find elsewhere. The mashed potatoes, baked potato, and even the French fries are on par. I mean, seriously, they make it all look so easy!

Throw in some freshly made donuts that are provided before parting and you'll find that even the most jaded diners won't find much to complain about.

Rarely can you go wrong with some Bobby-Q!"}
{"text":"Was tempted to give five stars because of the great service of the manager and staff here. We always frequent the main branch where we've had the best BBQ, here the food is still good, but it cannot compare to the main branch. Service is amazing, and so are the cornbread and donuts."}
{"text":"Sat at the bar.  Excellent food, even better service.  Q rolls holy shit.  Just come here already.  Enough said"}
{"text":"This visit to the Biltmore Bobby Q's means we've been to all three of their locations. Happily, we've also had great meals at all three! Father's Day seemed like the obvious time to go. Dad's + BBQ = a perfect combination! Our waiter said Father's Day is their busiest day of the year, makes sense. Speaking of our waiter, he was great! Very attentive and nice.  We went at 11 when they opened and didn't have a wait, but they were already pretty full when we left.
As always, they started us off with a basket of cornbread and whipped butter. Delish. 
My husband got the 3 meat combo with baby back ribs, brisket and pulled pork, he loved them all. His favorite were the ribs. Super tender, flavor all the way through. My 8 year old son had the pulled pork sandwich with mac and cheese on the side and he destroyed it! If you haven't taken your kids out for BBQ yet, do it. Even picky eaters will like it. 
I had the BBQ loaded baked potato with pulled chicken, it's my go-to choice at Bobby Q's. You can pick any of the meats to top a gigantic baked potato. I could only eat half of it! Another reason our waiter was great is that at this location they normally only offer the BBQ potato during the week, but he asked the kitchen to do it anyway, and they did. I had corn as my side, and it was the only real miss. Just underseasoned, nothing special. 
The cutest thing is that you get a paper bag of cinnamon sugar mini donuts when you leave!"}
{"text":"Those ribs ...that brisket...the cornbread  I could go on about my visit to Bobby Q's the food was amazing the waiter was amazing the atmosphere was amazing and the complimentary mini donuts they give you as you leave (to die for) so worth my money and I can't wait to go back !!!"}
{"text":"The Whole Hog Entrée was everything they said it would be! You get to try  e v e r y t h I n g . All delish. They give you great sides to choose from like sautéed brocolini and brussels sprouts. Only knock was the baby back ribs were too \"fall off\" the bone. Beef ribs were very satisfying! Service was very friendly."}
{"text":"EXCELLENT food , servers and atmosphere! Every server I've ever had has been very welcoming , friendly and attentive! The food ( especially the ribs and sweet cornbread) is all superb!!!  I wish all servers were as great as the ones in here. I will be coming back a lot now , for I just discovered this gem."}
{"text":"Been to the bbq in Phoenix and this one. This place is amazing. Our bartender Dana was amazing! I ordered the perfect burger, and needless to say it was perfect. Thanks a lot, coming here every day for the the rest of my life until I die of cinnamon doughnut overdose"}
{"text":"My husband and I eat out way too much so I have a good idea what a GREAT restaurant  should be and Bobby Q's at Biltmore was outstanding. We went for Father's day with 6 people. We had a reservation and were seated immediately. We were able to order appetizers right away, the food came out quick. Everything we had was delicious.  We had the chicken wings, spinach artichoke dip, cornbread (hands down best ever), the Whole Hog (2 of them) which was beef and pork ribs, chicken, pork, beef tip, mash potatoes, beans, cole slaw, carrot cake, and bread pudding. So you can see we literally tried a little of everything between us and EVERYONE raved about the food and the service.  They were very busy yet it never felt like that.  We sat on the air conditioned patio which was perfect.  The Manager came over several times to check on us, it really was just a fantastic experience."}
{"text":"Hands down best BBQ in the area. Staff was attentive, pleasant and proud of their work. Class act of an establishment. 

Beef brisket was perfect; ribs fall off the bone. Will absolutely make this a frequent stop when in PHX!"}
{"text":"Pretty fancy for a BarBQ joint ( This IS Biltmore lol). Same wonderful BobbyQ's food. Great service a wonderful bar and bar tenders. Sat at the bar and we shared a 3 meat platter. Beef and pork ribs and chicken. The Broccolini is a really tasty side!!  Can't wait to return."}
{"text":"Out of all the restaurants I've been to in the world, Bobby-Q has a special place in my heart.

Bobby-Q came up while I was searching for some good restaurants in Phoenix. They take reservations so I decided to book a time slot for myself! 

I arrived on time and the two gorgeous ladies at the front desk greeted me and led me to my table, a perfect spot that was facing the TV, which was also playing my favourite sport - the NBA. Within a minute, my server came by with the menu. I ordered a cocktail, and my server pointed out that the Q-Rolls are one of their best sellers. 

When my server was back with my cocktail, some water, and cornbread, I ordered the Q-Rolls as an appetizer, and Half Baby Back Ribs as my main. I sat back and enjoyed the game with my cocktail, and my food came in no time. The Q-Rolls were amazing - the crispy outer layer wraps the pork which was tender and perfectly smoked. The edges of the pork were slightly crispy too which I really enjoyed. I didn't even bother dipping in too much of the sauces because it was so delicious that I didn't want the sauce to overpower the actual food. 

The Baby Back Ribs arrived with the two sides I ordered - brussel sprouts and corn. I was clearly trying to be healthy, which is why I avoided the tempting mashed potato and mac and cheese. Without much expectation for the sides, I bit into the brussel sprouts and boy were they good! I would have mistaken it as an actual dish if it weren't placed in the same plate as the ribs. The corn was also the best \"side dish corn\" I've ever had. I love how Bobby-Q puts in effort even in their side dishes. Finally onto the star of the night - the baby back ribs. Trying to be civilized, I used fork and knife throughout my meal. I had my fork in the meat, and my knife ready to cut a piece off. I was not expecting the meat to just slide off the bone...It was so tender, and so well cooked that it took me zero effort to eat baby back ribs with a fork and knife! I don't think I have ever had such good ribs ever in my life. 

During my meal, my server came by couple times. I usually like to use the word \"check up on me\", but he just came by casually to have a short convo with me about my food and my trip, and it felt like an actual non-obligated conversation. I learned that he was from Thailand which I will be visiting soon! The super friendly and (very) attractive manager, Joanna also came by to see how things were with the parties around the restaurant, including myself. And to make my whole experience at Bobby-Q even better, the owner of the restaurants came by to say hi and thanks after he heard me saying good words about the food. Kindest old man ever.

I never pack my leftovers when I'm on vacation, simply because I have planned out all the restaurants that I want to visit. But I couldn't stand such amazing food to go to waste, so I packed them all for a late night munchie.

After I got the bill, my super amazing server brought me some of their dessert of the day to go. I was already so full from the food, but secretly had a bite in the car...and ended up finishing it all. I would give this place a 6/5 star if I could! 

There are too many restaurants nowadays that try to satisfy the customers while prioritizing their profits, but Bobby-Q make sure that every single customer leaves with a happy tummy and smile. 

Thank you Bobby-Q for really setting the bar high!! I will come again if I ever visit Phoenix."}
{"text":"Excellent food but our waiter Dimitri was a real gem! He's worth his weight in gold. Q rolls , corn bread and sampler plate was delicious. Raspberry sangria was great"}
{"text":"Always an awesome visit! The one and only place that comes to mind when I have an anchoring for BBQ chicken! Thank you for the consistently amazing food and service! See you soon"}
{"text":"This place just opened. The service is fast and the wait staff have their scripts down. That being said, the wait staff is hesitant to show personality because they're so focused on their lines. The ribs we had were great, the meat separated from the bone easily and the portions were generous. However the brisket my companion had was mushy and when she shared it with me I asked her how she was eating it, her reply was \"I thought drowning it in sauce would help but that made it worse\", yikes! She's a real trooper, personally, I would have sent it back. The sides really made the meal for me though, and the doughnuts at the end of the meal are a nice touch."}
{"text":"Arrived in the rain Sat nite for our 9pm online reservation for 4 adults.  Easy to find by Delux; although the parking lot is busy, it was worth it.  Got a nice table right away, had very good service, and ordered some nice large cold beers - a special idk but were refreshing with bbq.  Got the Q rolls $12 to try - large order of 6 very good, filled with brisket, and complimentary corn bread and butter - yumm.  We ordered the Whole Hog Heaven  with ribs, brisket and pulled pork (coulda have tried sausage or chicken too) and extra bbq sauce on the side - plenty with leftovers for us 4 adults.  We got 3 sides - good pecan coleslaw, mac and cheese, and fries for dd.  Best ending was the complementary 8 donuts hot in a bag with sugar - easy to go if you ate too much bbq! total with 3 beers $92+tip.  Fun place and great food!"}
{"text":"Very good food great service and some of the best ribs I've had yet. Plus the donuts at the end were a very classy touch."}
{"text":"Great food & great service. Nice place with nice outdoor seating and heaters too. Staff was super friendly and accommodating. Food was good and hot donuts after dinner. Very nice touch. Would come back when in the area again."}
{"text":"Love the relaxing and attractive atmosphere, exceedingly friendly service and food.  I'm not even a huge bbq fan but the food was prepared very well and the fact that I just loved being there made my experience!  This Bobby Q is a tad more upscale than the others, and smaller.  It has a really nice patio.  Good cocktail menu and cocktails are well prepared."}
{"text":"So I have been to the original many times. 
Absolutely love it. But this new one is in my hood. 
So last night hubby and I went. 
Greeted by a friendly young lady and offered inside or patio seating. 
We decided on the inside bar area. Great seat...TV's and get to watch the great mixologist!
The seats were half booths facing the actual bar. 
Started out with craft cocktails. Omg. Amazing. 
One drink had reposado tequila/vanilla/cinnamon/lemon.
The other was a Hendricks Gin/lavender/egg whites/lemon and edible flower. 
Not lacking booze.... which is good because they were $12 . 
Then we ordered food. Hubby had the 2 meats with 2 sides. Brisket and pulled pork. Baked potato and baked corn.
I had a pulled pork sandwich with one side which is the potato salad. The potato salad I swear is like my Moms. Delicious! 
Server brought us the corn bread which was warm and just so tasty. 
We did order 2 beers on draft and they were local which I love.
No room for dessert because we know they bring a brown bag of mini donuts with sugar. Such a great touch. 
Over all just a wonderful night. 
Oh and I would be remiss if I didn't mention our excellent server Ann. She was delightful. Attentive-without being intrusive and very informative. Thank you."}
{"text":"AMAZING! Great food, great service, great beer. If I could give more stars I would! I got the ribs with Mac and cheese and corn as sides! The ribs were so tinder and flavorful they fell off the bone. Mac and cheese was sooo creamy and cheesy! Perfect for cheese lovers! They use five different cheeses. The corn is roasted, buttery, and just heavenly! Had the bread pudding as dessert and it was perfect to top of my meal. The service was great. Our waitress was Nikole and she was amazing! So knowledgeable on the menu, gave great suggestions, and held friendly conversation! Overall I had a phenomenal experience and I cannot wait to go back!"}
{"text":"The service is nicely attentive and accommodating for our large party. After coming off my Austin BBQ withdrawals, I was looking forward to tender slabs of meat again.
We showed up early for our party of 9 and the hostess quickly had our table setup. The dining area is on the dark side with pinpoint spotlights accenting the tables. It was nice but not great for trying to read the dark menus and see across the extended tables.
Because of the size of our party we opted for 2 of the whole hog platters to taste every meat, a kale salad to feign being healthy and also a house salad, and a filet.
The whole hog does not disappoint and 2 of them is just a grotesque amount of farm animal on a plate. It was all very tasty. I would get the chicken, sausage, pork ribs and brisket again. The beef ribs were gargantuan but tough. The meat did not want to be torn from the bone and could use another couple of hours breaking down.
For the sides we had the broccolini, potatoes every way possible, and mac and cheese. The sides were yummie as well but there must be a strong love of garlic because the broccolini was drenched in garlic slime. The broccolini that managed to avoid getting bathed in garlic was perfectly roasted and tender.
Overall this was nice bbq, they need to work on the beef ribs and tone down the garlic for my taste."}
{"text":"Woah baby this is good BBQ! I have to admit that I am not a big fan of bbq, I have to be in the right mood...but Bobby Q is delicious! 

We heard from a friend about this new spot and decided to try it while the family was in town for the holidays. We ordered for pick up and it was all ready to go at the time we asked for (for some reason this can be challenging for some places). We ordered brisket, half chicken, hot links, buns, coleslaw, and mashed potatoes. When we got it home we realized there was only one small cup of sauce for all of us, but we didn't even need it. The meats were so good and flavorful that any extra sauce would have taken away from it. Everything was cooked to perfection with just the right amount of fat that melted in your mouth with each bite. The hot links were more mild than hot, and the mashed potatoes were good but nothing to write home about. Everything else however was stellar. The coleslaw and brisket were quite possibly the best I've ever had. The buns were not necessary either, the meat spoke for itself. Clearly Bobby Q is doing it right! I'm anxious to try some of their other delicacies sometime soon. Even though I'm not a big bbq fan you can be sure I'll be a regular at this place. I highly recommend checking it out for yourself."}
{"text":"For a First time visit  Bobby Q's did not disappoint! It was a Friday night so we decided to call ahead for reservations. We sat in the first booth beyond the bar and it was the best seat in the house.
Our server, Christa, was right on top of things and had a great personality to go with her excellent service! 
My husband asked about the coleslaw and she offered to bring him a sample which was a great idea. We all had barbecue and it was fantastic. You can't go wrong with a fun night at BobbyQ's."}
{"text":"Glad that there is a decent BBQ place in my neighborhood.  Daughter treated me to dinner here and I went with the Brisket Sandwich.  Meat was tender, juicy, flavorful and the Brioche bun was fresh.

As happens at the other Bobby Q, cornbread is served, and when you depart, mini-donuts accompany you.  Yeah, I think I'm gonna be back.  soon."}
{"text":"????????, ?????????
????????????, ??????, ??????????!
??????"}
{"text":"If you're looking for BBQ, you've found it here. Bobby Q is one of my favorite stops for meat around town. The biltmore location is trendy and hip inside and has a great atmosphere. For our group of 7 we ordered two Q rolls, the spinach queso dip, and two whole hogs. It was plenty of food for everyone with some leftovers. 

The Q Rolls are my absolute favorite. Incredible brisket wrapped in a egg roll type shell dipped in barbecue sauce. The spinach queso dip was good but overpriced for the portion size. The whole hog platter is amazing and has a little bit of everything for everyone. The best meats are the brisket and the pulled pork. There are two sauces available: the regular and the spicy. I didn't think the spicy tasted much different at all but it had good flavor. 

Great service overall and to top it off they serve warm cinnamon sugar donuts for free at the end of your meal! Definitely check any of the locations out."}
{"text":"I went to eat a salad at lunch and I am Pescatarian, ( veggies and fish). They did not have a salad with fish and when I asked about adding fish to a salad they told me I would have to pay $25 for a dinner entree and add a salad. I did not plan on a $30 salad for lunch. I went across the parking lot to Keegan's and got a salad with salmon for $12."}
{"text":"What can I say about Bobby Q??? Off the hook? Amazing? To die for?? Never disappoints! Appetizers on point, drinks amazing, kale salad so healthy!, brisket OMG......finished off with some donuts..... a must"}
{"text":"Delicious food, same owner, same recipes new location.  Nice atmosphere a bit to loud for me. It was lunch time so I'm sure that played a factor. Glad it's at the Biltmore so much closer to home!"}
{"text":"This is a amazing place, we are regulars at the black canyon locations, don't miss out on great brisket!!!"}
{"text":"This place isn't bad, by any means. If you're in the mood for BBQ at dinner time with a cold beer, they've got you covered. It's got a great vibe with the owner coming around to ask how things are.

We split The Whole Hog between two of us, and maybe I'm just a fat kid at heart, but it felt like it should've been a bit bigger. Ribs are definitely the way to go here. I love brisket but this one was sort of meh.

My expectations are probably a bit off-kilter, too, as I frequent the fantastic Little Miss and Texas BBQ House in S. Phoenix."}
{"text":"Bobby Q's cocktails are out of this world. I've only tried princess peach, coconut lime mojito, and the q-loha but all of them were great. I can't even pick a favorite. 

The food..
Q-rolls are amazing. I love brisket and the sauce they are served with is soo good. One order comes with 6 rolls so they're definitely shareable. 

On  another visit, we came for the late night menu and had brisket tacos. Amazing. I don't think you could order anything bad from the place. The ribs are good, the brisket is good, Mac and cheese is amazing. 

We were even given cornbread before our meal and freshly made donuts for dessert!! 

Definitely come hungry because the portions are huuuuge. I never thought BBQ could be classed up but Bobby Q's did it. The environment at the restaurant is nice and the patio is great at night. 

Definitely recommend for cocktails, food, and as a date night spot!"}
{"text":"So far we only had drinks here. Their patio is small but it's nice with a relaxing atmosphere. The bartender was attentive so service was good. They have TVs and a pretzel dish that is big enough for 4 people. Looking forward to trying their bbq."}
{"text":"This place is fantastic! I don't know which is better, the service or food! Whoever said the food is subpar and not full of flavor either are reviewing the wrong place or their palette took the day off. Very easily the best BBQ I've ever had. Thank you for opening one up so close!"}
{"text":"Delish !   So good.   I am glad Bobby Q's moved to Camelback in
Phoenix.     I look forward to going there.    Been there 6 times and
love their bar b q and the sauce they use on the meat.  
 There were 3 of us the other day for lunch and service was so good and so was the food.  The owner is there a lot and really cares about
his customers ."}
{"text":"Amazing food and service. After 10PM, they shut down their full menu and bring out their \"late-night\" menu. Either way, the food was amazing!"}
{"text":"I was excited to try this new place after reading the reviews! I left with a little bit of a mixed bag.

First I give a five stars for the Q-rolls, the Mac and cheese and the surprise mini donuts to take home. 

I ate at the bar and the service was a 4. 

To eat I had the brisket sandwich which I would give 2.5, the taste was off and it was dry. Not very enjoyable. Maybe it was an off day???"}
{"text":"I placed an order with them using GrubHub. We waited past the  expected wait time for our food to be delivered. When it did arrive, it was missing items. I called the restaurant; they insisted that they had placed all the items in the bag and and that their workers are trained to double check orders. Someone clearly screwed up, because we ended up with cornbread, which wasn't even part of the order. They made me call GrubHub. GrubHub called the driver and the restaurant. After they got back in touch with me, they told me that the restaurant had refused to issue a refund. I paid $44 for two cold sandwiches with no sides and a garden salad and three pieces of cornbread I didn't ask for that showed up 10 minutes outside of the delivery window. I will never order from Bobby Q again. And I have serious reservations about using GrubHub in the future."}
{"text":"Everything I tasted was amazing!!! Can we dedicate a minute on the free cornbread patties? Warm, soft, and buttery... tasted even better with butter on top. The brisket and baby back ribs were tender and juicy with just the right amount of fattiness! I'm a shoestring fry kinda girl and the ones here were perfect. The complementary donuts are not your typical donuts. They are super small(cute!) and tasted more like funnel cakes. The interior looked like an upscale steak house. The staff were so incredibly friendly. Would definitely come back here again!!"}
{"text":"Very cute restaurant! Smelled AMAZING as soon as I opened the door!!! Went last night for the first time and wasn't disappointed. Great menu, tried the \"Q rolls, spinach dip, pecan cole slaw, Mac and cheese and chicken wings\" all of which were fantastic! Great drink menu as well! The restaurant itself is dimly lit and very cute! Service was wonderful! Definitely will be back for the late night menu which looked awesome!"}
{"text":"Let me preface, I am a Kansas City girl and know my barbecue. First of all, I ordered burnt ends and a half a slab of baby back ribs. The flavor was perfect and really did not need sauce. I did use a little and their spicy was perfect. One thing though, I called and asked if they had burnt ends and the girl said they did but they were on the menu. What I got was brisket and nothing about them resembled \"burnt ends\".
Overall I thought it was very good. Enjoy!"}
{"text":"Great spot at the bar to watch Stanley Cuo.  Great food and service.  Q Rolls deserve the hype they get.  Could be a meal for two.  Bob's salad great as well"}
{"text":"Oh so happy!

This location is small but it lives up to the standard. 

Menu seems smaller. But portions are priced appropriately.

Fast, friendly service.

Get the beef brisket. Well prepared."}
{"text":"This location is pretty good. Of course this is a smaller location so there are certain things that aren't on the menu. This place has potential."}
{"text":"Went for lunch for the fish. Both my wife an I thought it was the worst we ever had fish was supposed to be cod instead we got tilapia it was so salty almost in eatable. Have had beef ribs in past they were good but expensive overall there are much better places to eat."}
{"text":"One word Fantastic!!!! I've been eating at the location off the 17 frwy for years, but live around the corner to this awesome new location. The food here is always good, from the barbecue, to the steaks, including the fresh ground burgers. My favorite burger is the smoke house with a side of pecan coleslaw. This new restaurant has be designed perfectly, a great place for date night. The service has been great each time I have visited, this place is must for great casual dining."}
{"text":"Was in the other night and had such a great experience. Our server Krista was exceptional and very friendly. She made great suggestions as I wanted to try something new after visiting their other location not to long ago. I love the decor, food was great as usual. Our server really gave outstanding service I hope to sit in her section again. Perfect location, just what the neighborhood needed."}
{"text":"Wife and I went to Bobby Q's for her work get together they have every so often. It was a group of 8. They had the table early and we sat down 15 minutes before. We ordered drinks and they took a bit longer than usual. I am not sure if it was busy or what. More people ordered drinks and they took a bit longer each time. The food was pretty good. I had the pulled pork with beans and fries. The wife had the filet mignon. It had a good flavor and the bbq sauce was good. Overall I would go back. We were just a bit down on the service."}
{"text":"We had the 3 way combo. Baby back ribs, brisket and chicken off the bone. Our 2 sides... Mac n cheese and shoe string fries.  It also comes with cornbread (not pictured). The lemonade was good. It was just my daughter and myself so they served us 2 plates, dividing the meal in 2, with 1 side on each plate. That was a great idea! The meal was delicious. The Mac n cheese was super cheesy! I would definitely return the next time I'm in Arizona. Oh yeah and the staff are friendly and attentive!"}
{"text":"After spending a day with my wife Christmas shopping and running errands neither of us felt like going home and cooking dinner. Barbecue sounded good and Bobby Q's came up as \"hot and new\" so we gave it a try. When we were seated we were soon greeted by Demitri who ensured we had a nice dining experience.  Folks, from the time we sat down to the time we left the service and dinner were absolutely fantastic. We ordered the Whole Hog so we could try a variety of meats (pork ribs, prime brisket, pork ribs and roasted chicken)....WOW!  The sides were perfect and of course we had desert. Needless to say the Bread pudding was delicious. Did we eat it all?  No way. The portions are generous. The whole hog dinner could feed a family and that is what we plan on doing in the coming weeks!  This is by far our best BBQ restaurant!"}
{"text":"Took my co-worker here for dinner.  Ribs so tender the meat fell off the bones. Good sized portions. Service was great. Because my it was my friends first time there, they gave him a taste sample of the brisket, very moist and tender. Definitely will come here again."}
{"text":"Horrible, it smelled like vomit. The meat seemed rancid. Prices were way too high. The BBQ sauce tasted like piss."}
{"text":"Great place to hang out and have dinner. We sat out on the patio-great atmosphere. The food was great too. Ribs so tender they fell off the bone. The Brussel sprouts were to die for. My wife loved the corn bread."}
{"text":"Went in with my grandmother and mother who are in town visiting. A+ service from the staff and server Trevor. Dinner was quick, ribs were the best we've ever had, and fair priced for the service you get. A must check out."}
{"text":"This place is the spot for barbecue junkies. The macaroni and cheese was absolutely the best I have ever had , and the prime rib sandwich was excellent. Service was friendly and fast , giving me an extra few minutes to head back to work . Ny only regret is I didn't try the ribs ...yet.  I will definitely be a regular at this spot. Barbecue is 10 Stars here !  

6/22/18 Back again - this place is amazing ! We like it better than Don and Charlie's / way better service , too. Joanna is the best !!! She goes out of her way to make sure you are taken care of every time."}
{"text":"Right off the bat, I fell in love with the patio dining area. From here, I get the most beautiful view of the  stunning bar. The bartenders are friendly and attentive. In fact, the staff and management here always aim to impress every single guest. From my photos, you'll see the selection of delicious BBQ meats and mouthwatering side dishes. If you're in the market for a bbq joint near the Biltmore, look no further, give this restaurant a try. Enjoy!"}
{"text":"I took my husband here for Father's Day and he loved it, we all loved it. The atmosphere was very inviting, our server was helpful and so pleasant. The food was delicious, I especially enjoyed the Mac and cheese. We live in Gilbert but we will be back to this location."}
