{"text":"Another marvelous meal today !
A light seafood broth with a hint of fresh mint smoothes your palate for the delicacies to come ...
The delicacy this time were sweetbreads flambé. 
How to describe these tender morsels with a slightly crunchy crust in a smooth creamy sauce ? 
Exceptional !!!"}
{"text":"Ended up going to Boca Ibercia by chance. Waiter was always there to serve...he was exceptionally friendly and recommended a red wine that turned out to be fantastic. we decided to go with a few tapas instead of ordering main dishes super great idea the octopus was very very good and tender the rapini was fantastic and the stuffed calmar was nice. the atmosphere was very friendly and deafened we will be paying another visit  to Boca Ibercia. I recommend the restaurant and there's a nice terrace."}
{"text":"Went here to catch a soccer game, they weren't open but others were in there.  Fantastic fun.  Decided to eat there, had cod fritters, crudo, octopus, and scallops!  Spectacular!  The chef was sure friendly, learned a lot from him regarding food and Portugal.  Great experience, will definitely be returning when back in Montreal."}
{"text":"Excellente adresse.  Les tapas chauds et froids sont vraiment à l'honneur.  Nous avons choisi cinq plats et tous étaient réussis.  Que ce soit les calmars grillés, les poivrons farcis à la morue, la saucisse choriso, les fritas (miam, miam) ou encore les fèves légèrement panées, on s'est vraiment régalé.  L'addition est raisonnable pour la qualité.  Atmosphère détendue.  On y retourne?  Absolumment."}
{"text":"The meat was terribly hard. The cappacio was lacking flavor. The bread was not fresh. I would not recommend this restaurant ."}
{"text":"Bonne bouffe bonne ambiance"}
{"text":"Bons tapas portugais, rien d'exceptionnel, mais bon.
Par contre, excellentes croquettes de morue et ris de veau exceptionnellement bien apprêtés.
Bon service. Bel endroit. Rapport qualité-prix très bien. 75$ taxes incluses, avant pourboire, par personne, incluant le vin."}
{"text":"Went at this place for a private party for my friend's birthday.  A lot of great food!  Everything you're expecting from a Portuguese restaurant but with a Spanish-Tapas touch!

Chicken was very good and so were the sardines and various seafood salads!

Enjoy!"}
{"text":"Mmm trop bon! Tout ce que j'avais pris était très bon. Je garde surtout un très bon souvenir des palourdes grandes et super goûteuses!"}
{"text":"We discovered this place with a voucher - but would definitely go back.

Food : very tasty. The ingredients are of good quality. We ordered the octopus, chorizo, mussels as appetizers and they were all very satisfying. The main dishes are well seasoned and the portions are perfect.
I'd suggest the typical Portuguese dessert served in a verrine - exquisite.
Their wine list is short, but definitely delivers.

Service : our waitress was very attentive and took good care of us. Service was A+

Decor : very simple and modern. Friendly-romantic atmosphere 

This place is appropriate for both small and large groups."}
{"text":"Really enjoyable options for lunch. Good quality though portions are a bit too large - they harm my afternoon productivity!!! Guess I should have discipline to pack up leftovers ;-) Looking forward to trying this place for dinner as well."}
