{"text":"I tried their $10 (tax included) large cheese pizza special and I have to admit that it was quite good. The tomato sauce had real flavor and there was a lot of cheese. It was more than enough for 3 people. It was baked fresh, so we had to wait 15 minutes which is perfectly fine. 

However,  it wasn't any better than a pizza from Costco where they have a veggie option and a bigger size for almost the same price. And for a pizza restaurant serving pizza the same quality as Costco...well that's not very good. The guy also made the pizza behind the glass which was covered by lids of the silver dishes so we had no idea what he was doing or if we could request anything different from the standard. 

Others have said that the employees were really friendly but not in our case. We went around 9 pm and the place looked like it was 5 mins away from closing, even though the hours online said it was open until 11 pm. There was only one guy and he was on his phone and barely paid us any attention. The seating area was okay, nothing really nice. 

Overall, it has good pizza but there are better places. It's a level up from Pizza Pizza but that's the only place it passes."}
{"text":"A great local pizza restaurant for take out. The price and quality beats any shit pizza franchises. Their best deal is the large takout pizza with one item for $8.99....the chef owner is very accomodating to your requests on the menu. People forget the other médiocre pizzas joints that charge twice the amount and still inferior to a lot of other pizza establishments."}
{"text":"Im a regular customer here, the pizza is awesome, I love the thin crust, and the people who run the place are awesome! Also a really great price for what you're getting! You should definitely give it a try, you won't regret it!"}
{"text":"After my dissatisfying visit of just a little over a year ago, I was recently invited back by the owner of this establishment to give their pizza another try. 

Just judging from their display alone when I walked in, the pizza already looked significantly better than the one I had last year on their grand opening day. The slices looked fresh, cheesy, not too greasy, and was loaded with a bunch of toppings!

I ordered the deluxe slice (which was a gigantic slice) and they gave me a homemade garlic dip on the house. Everything was delicious! Large pieces of mushroom, sweet peppers, and onions over a bed of pepperoni and sausage embedded in melted cheese.. yum! The pricing was very fair and I would definitely consider coming back for a quick bite between classes. For comparable prices, the pizza here is much better than Pizza Pizza. They have more toppings, larger slices, are less greasy, and although the crust is more thin, it definitely didn't taste like cardboard!"}
{"text":"One of the best non-Neapolitan pizzas I have had in Toronto so far.  Crust was soft, thin, yet crunchy. I ordered a Specialty Mexicana large. It was delicious! Reasonably priced, in an area surrounded by Pizza Hut, Pizza Pizza and Piaziallo chains, it is a delight to have a local business creating delicious pizza. Please support this local business. They are friendly and making good food!"}
{"text":"Great place for take out. A large pizza can be made in 10-15 minutes and it costs only $10 (tax included). Much better than your typical franchises

Other things I have tried:
-Panzerotti - quick service with the meat lovers and quite tasty
-Shawarma plate/wrap - great quality

Not sure about the individual below who was complaining about free food.... I'm not sure how you can judge a place on grand opening day when they are giving out free slices. Overall I recommend Bocconcini as the food tastes great and the service has been on point."}
{"text":"The pizza here is just 10/10, sooo tasty! I have also tried chicken fingers, they are good too. 
Hands down it's the best pizza I've tried in the area. Highly recommend it!"}
{"text":"great place I come here alot for the student deal it's 8 dollars for a meal. The meal is really good. the shawarma is good and the potatoes that comes with it is amazing. I will suggest people to check it out. the place is nice and organized. they serve pizza as well which I never had the chance to try it. the guy serving the shawarma is so nice and friendly he seems that he really like his job he well prep the meal."}
{"text":"Get the walk-in special for $8.99. Pro-tip: you can call ahead for the walk-in special so you won't have to wait: they make everything fresh to order. This pizza is a hidden gem. Seriously. Their pies are amazing. Great sauce, perfect cheese amount and fantastic fluffy light delicious dough!"}
{"text":"I tried their bocconcini specialty pizza and loved it, it had some chimmichurri sauce and fresh tomatoes and the melted bocconcini cheese. Utterly delicious. The crust was just the way I like it, not too thick or thin. Definitely coming back!"}
{"text":"I LOVE Bocconcini! I stumbled upon it when I explored my campus a week ago and fell in love. I initially tried their sliced pizza as a quick snack the first time I went there. It was fresh, tasty and they were not frugal with their toppings unlike other places.
I came back a second time to try a large pizza with wings alongside a few friends. The food was delicious; the pizza piping hot, loaded with toppings and the wings tender and juicy. The only thing I'd point out is that they put only enough sauce to cover the wings. All in all, it's a campus gem and the decor is cute!"}
{"text":"Really good pizza. Super affordable super convenient. I order a large pepperoni for $10 when I know school work is gonna kick my butt for a few days and get a lunch, dinner, and next days lunch out of it. The owners are super nice too."}
{"text":"Great pizza slices, and good value for money. I especially love the Bocconcini slice, it has the perfect texture, and tastes great!"}
