{"text":"Beer.  That is (was) the only reason that I ever went to Bocktown for.  I'm not much of a fan of this place anymore.  Let's start with the good stuff...beer.  One of (if not THE) best beer selection in Robinson.  They have just about every style available.  Prices for beers range from acceptable to a little overpriced. Why don't I care much for this place anymore?  Service and food prices (at least compared to quality, and not just from my most recent visit).  SERVICE: The last time I was there was at the beginning of March.  Two days after my birthday and one day after I had find out about their 'Birthday Club' and free beer or dessert on your birthday.  I asked our waitress if an exception could be made (I mean it was literally two days after my birthday and, up to that point, I was a fairly regular patron).  She begrudgingly said that she would go check.  She came back with a somewhat snarky 'No.  It HAS to be ON your birthday.'  After ordering our food and drinks our waitress delivered our drinks and checked on us once after our food was brought to the table (by another server).  She never asked if we wanted refills or another beer.  FOOD: My wife ordered a bacon cheeseburger ($8).  Another place (a chain) sells the same burger for a dollar less and my wife said that the 'cheaper' burger was a better quality burger, plus she can eat their french fries (she has a gluten intolerence and the fries need to be cooked in a dedicated fryer).  I was trying to decide between the Bocktown Chicken ($14) or the Grilled Chicken Salad ($11) but after the birthday beer answer (which irked me of course), I opted for the plain salad ($6).  It was basically half a bag of 'mixed greens' salad mix.  Instead of a dressing, I opted for a side of spicy brown honey mustard.  The only reasonable food item would be the french fries (any size).  It's a decent price/quantity/quality combination."}
{"text":"Looked on yelp for a place to grab a bite and a beer boy we hit the jackpot not only was the food delicious but the beer selection was great. Had multiple different samples of beer a great bocktown burger and a delicious veal dinner . I will be back here for sure :)"}
{"text":"The beer is why you go there.  The food is why you stay. A constantly rotating draft selection and a wall of cold bottled beer ensures that even the pickiest can find something they like. There pub style menu is surprisingly delicious as well."}
{"text":"We are visiting Pittsburgh and we were looking for some place for the family to have dinner. We were so happy we found this place. We had the pretzel mustard appetizer.  I had the pull pork plater and it was awesome. We are from New Jersey I wish we had a place like this near us."}
{"text":"I've always been a fan of trying new things. I stopped in to grab a drink at Bocktown and it is definitely my new favorite beer place. The bar tender was really cool, and gave great suggestions on what beers to try. I'll will be back soon to see what else he recommends to try."}
{"text":"Do not ever eat here. Great beer selection but I ate the crab sandwich last night and it was over seasoned and I've been sick all day. Once great beer selection but god awful food"}
{"text":"This has been my favorite place in the area since I moved to Pittsburgh 3 years ago. Not anymore. They truly do have an incredible beer selection, and the staff is knowledgable, but I have noticed the food quality plummeting. Even my favorite sandwich no longer tastes good. Quality and consistency is worth 1/2 a star. I will not be going back, even to use my coupon for free food (even though it never expires). You need to back to the drawing board on the food."}
{"text":"Beer selection is great. The place has gone downhill since it opened. Food quality and service is poor, prices are high. $55 for 4 beers and two appetizers. French fries and onion crips were rubbery doughballs. Use to go there alot when they opened, Chris the owner was always around. Now its not worth it."}
{"text":"Obviously go for the beer. Hint: know what you like in beer before showing up, the staff will guide you but it helps if you know what you like.  The food was above average for pub food. The beer cheese was ok, but the bread it came with really stood out. All in all of you want a night out at the pub this is the place to do it."}
{"text":"Great staff helps you navigate a huge collection of available beers. Food is good."}
{"text":"I have a long held assertion that the best places to eat and drink are in half abandoned strip malls. This place proves it."}
{"text":"one of pittsburgh's best...a real gem..  the goods.. clean and doesnt smell like stale beer, glasses real clean, innovative menu, uses a lot of local purveyors, will try to seat you fast..  excellent beer library and list..heavy and I mean heavy on craft beer...if you are a Bud person, oh my, be prepared for your conversion...list changes frequently to season and stock...staff is very knowledgeable and courteous...no beer snobs on staff here..they really can explain a brew...that makes the wifey have that all \"warm and fuzzy\" feeling inside..as well as cater to my inner (and outer) geek...feel free to explore, they give samples easily, so for novices to the guru you can really enjoy the beerific experience..extensive 6 pack and bottles to go..rare in PA, even rarer in Pittsburgh till recently..very fair prices..not a budget buster at all..   food really is a event here as well!! Sandwiches and specials are well thought out..and compliment most any beverage you get..most items made to order, so they are willing to make special requests..portions are large..not excessive.which is good in my book. time to explore your culinary side as well..a lot of plays on pittsburgh staples..fun indeed..outdoor garden, booth seating ...they have the obligatory Pittsburgh HDTV's for the games to satisfy any teary eyed Pirates diehard or obnoxious screaming Stiller fan (yes I said that!! Giants, Baby!!)...not too many tv and sport heads though...very conversation friendly..not a loud place..  a real homey feel for a joint in a worn out mini strip mall..kinda reminds of a oasis in the Mojave desert..i pass all the retail hell and there it is Bocktown..ahhhhh... a really worthwhile establishment in an area of pittsburgh that is pretty much a culinary dead-zone..  no real bads..just thoughts.. they dont do \"the right glass for the right beer\", at least not that i have seen, so if you are picky about that, a heads up, doesnt bother me because they are very conscientious of the way they pour..bar area is small...8-10 seats maybe...but place is smallish so that is expected..(doesnt feel cramped because of the lighting and high ceilings)..not a huge selection on tap..i think 16..no visible kids menu (just ask)..somewhat kid (well behaved!!) friendly though.. location is a bit out of the way from downtown but easily gotten to..prepare to drive..not much in the area for hopheads except madmex..so this is a real destination point..  the extras.. always check foursquare/facebook they will surprise you with some hidden specials.. cool weekly events food/beer to attend.."}
{"text":"Good food and a great selection of beer.  Perfect place to meet up with some friends!"}
{"text":"Food is good, beer list is solid, good vibe, and customer service is outstanding! Every reason to stop in here if you're passing through or become a fixture if you're local."}
{"text":"OH BOCKTOWN, HOW YOU DISAPPOINT ME!  I thought this place was going to be really awesome. I had heard good things...we went on a Friday night about 8. They said there was a 20 minute wait. No problem. 45 minutes later, we go in to realize they've forgotten about us. Luckily, we got seated right away.  Great beer choices! However, I actually ended up getting one of their \"aletail\" drinks, which is booze and beer combined. I got the gingersnap one. It was way too boozey for me.   As an appetizer, got the beer cheese. It was served with dry pretzel sticks like from a bag of Snyders, and cold pieces of bread. The cheese itself was sickeningly sweet.  I got the pot roast sandwich (which I will have to post a picture of), and my boyfriend got the appetizer called \"meat trio.\" Mine was hilarious. Seriously looked like cafeteria food. The bun was a cold, normal hamburger bun. Imagine going to Walmart, picking up the Great Value brand of hamburger buns, and there you go. Not even warmed up or toasted!!! The pot roast was covered in this very strange layer of cheese. It was not one of those big, piled-high-with-meat/cheese sandwiches that I was expecting. It was a small, flat layer of sadness. The sad thing was, it didn't taste too terrible, but the presentation made me lose my appetite.  Boyfriend's food was also disappointing for the $13 he spent on it (it was only an appetizer!) He got like three meatballs, a bite of kielbasa, and three pieces of filet mignon, though one was just straight fat. I understand it was only an appetizer, but at $13, you think it would have been one of those made-to-share things...  Our waitress was the nicest person however, and the beer selection was great, but that was about it....I can get a better sandwich from the smokey dive bar down the street in Lawrenceville."}
{"text":"Crummy location, jammed into a strip-mall in the middle of a sea of strip malls, where everything else is shuttered, having fairly unconvincing frontage, and being not entirely easy to find.  Once inside, however, you warm up to the place pretty quickly.  The staff, especially my favorite server Mo, are all pretty excellent.  I can't say I've ever had a complaint about any of them.  Even when I came in with friends before a Rush concert at Consol Energy Center, stating up-front that we wanted ales delivered to the table every ten minutes until we left for the show, they were spot-on in serving me quickly.  The food, while slightly overpriced for the region, has always been pretty swell.  The pumpkin hummus is a seasonal favorite, and the burgers I've had (all but two of them) are pretty awesome--even if a few of them are of questionable nutritional value (I'm lookin' at you \"Three Rivers Burger.\")  Also, not that I necessarily recommend \"borrowing\" from another restaurant, but Bocktown needs to try doing their own version of a Primanti-style Pittsburgh sandwich.  Folks from out of town would appreciate not having to actually go to boring Primanti's to get one.  The beer selection is pretty excellent, even the draft rotation, which is a revelation for the Pittsburgh area--a place where finding craft beers used to be arduous and unfulfilling.  I can't say I've been too impressed with their in-house infusions, but as I've never had such a thing elsewhere, I can't speak to whether it is my tastes which don't agree, or a performance issue with the product.  I will certainly return to Bocktown whenever I visit the area.  There aren't really a whole lot of places like it in the region."}
{"text":"We were just passing through the area and chose this based on reviews.  The service was poor and the food was average, at best.  The menu was varied and all sounded good in writing but all four of us were pretty unimpressed with our meals and we all got a different menu item."}
{"text":"Food wasn't anything to shout about - even ordered a \"signature\" burger.  It was O.K. At best.  Waitress pretty much got everything we told her wrong.  (There were only two of us.)  Won't be going back."}
{"text":"Love the food and the beer selection is unbeatable. Minus one star just because there is always such a long wait because it is sooo tiny, they can't fit a ton of people in their. If you have a large party, be prepared to wait unless you go on an off hour."}
{"text":"I cannot say enough good about this place!  I have never been a fan of the bar-in-a-strip-mall vibe, but once you walk through the door you would have no idea that's where you are.  The food is great; locally sourced where possible.  They are even a drop point for a CSA.  The beer selection rotates so fast that the list wasn't the same two days in a row.  That's right, we are from out of town and visited two days in a row... Because that's how awesome these folks are!  As someone in the industry, I feel I speak with a measure of authority when I say that both bartenders who waited on us were PHENOMENAL.  The kind of guys who facilitate conversation between bar guests, fill every beer as soon as needed, and tell just the right jokes.    The service was fantastic from every staff member we encountered, the beer selection was unparalleled, and the food was delicious.    And perhaps most importantly, a help wanted sign out front advertised paid vacation and 401k.  Seriously?!?  I almost want to apply and move to Pittsburgh.  That really shows an establishment who cares about their employees... And by proxy their customers, because long term, happy employees provide the best and most genuine customer service.    I can't recommend this place enough!"}
{"text":"Pros: Good food Great beer selection (especially love the pumpkin beer with cinnamon rim during the season)  Cons: Very small seating area inside and small tv's Service can be hit or miss  Gave it four stars because the food and beer outweigh the negatives."}
{"text":"If there was a zero score that is what Bocktown would have received from me.  We attempted to go there last night but they refused to seat our party of 11.  We asked them to split us up and they refused to do that because it would be 2 different servers and could not be on the same check.  Now...does that make sense?  Sure it does...Bocktown was more concerned about making sure they got to add their gratuity.   For an industry that is supposed to SERVICE the customer, the Manager was more concerned about serving the wait staff.  I used to be a regular at Bocktown because of their beer selection, but that was my last visit."}
{"text":"I'm a repeat diner. The place is reasonably cheap and has different specials daily, and obviously has a lot of beer specials, including samples available for just a few bucks to try out different types. Meals range from Pittsburgh staples like bratwurst and a big bucket of fries to more creative meals and pairings (we went during Restaurant Week which was a lot of different tastes paired with beer, very nicely done).   Its a small restaurant so it fills up quickly especially when the weather's not great and people don't want to sit outside. Located across from the Target in the Pointe its easy to get to and park."}
{"text":"This has become one of our favorite places in the Robinson area.  We've been there maybe four times.  It is better than average brew pub food.  Huge beer selection that only confuses me.  I usually go with a recommendation by the server.  You probably won't find this place unless you are specifically looking for it.  I've had the BELCH sandwich twice and like it.  The Bocktown Burgher was also very good but messy as I recall.  French fries are excellent here.  We just have always had good meals and good experiences at Bocktown."}
{"text":"This has truly become one of my favorite places. The food is always great and the rotating specials menu is really a treat. The staff is knowledgable and helpful with both the food and the beers on tap. They offer 4oz sample options on all of their drafts so you have the chance to try many different ones in the same evening. The bottle selection is also large and varied. They have tastings on certain nights and those are a lot of fun. Truly this is a great place to meet friends and hang out!"}
{"text":"Happened to find this place when looking for somewhere to eat after picking up a friend at the airport later in the evening. Love that the kitchen serves till midnight nightly (1 am on Fri and Sat) Very cozy comfortable atmosphere. The selection of beers on tap were great, as well as the over 400 bottled beers to choose from. Plenty of choices on the menu, the hot sausage meatball sandwich was excellent, and loved the build your own fries combo. Would definitely recommend!!!"}
{"text":"Second time visiting from Houston and cannot say enough good things. Great beer selection and the crab soup is fantastic! I also had the Italian meatball sand which for the first time and will order it again. Great food and great bar, come and visit!  Joe Dowdy"}
{"text":"I love the beer selection here and the food is great!  The brusetta wasn't good at all.  But everything else I have had was good. I think the peirogi hoagie should have a choice of kabasi or sweet sausage."}
{"text":"Beer selection was great.   Can't say anything poor about that.   Food was marginal.   The biggest issue with this place was the hygiene.  Fruit flies were all over.  Flying in our faces,  around our beers, pretty much everywhere.   They had left the door wide open to the patio which was allowing more insects to fly in.   I am not sure what PA health code is but I can't imagine that is up to it.   Created am environment where we ordered dobla and an appetizer but by the time we were considering food, we all weer questioning the fact that the cleanliness of the dining room was suspect so the kitchen had to be just as bad.   Unless the place is cleaned up,  don't bother spending your money."}
{"text":"This place needs to move out on the main road and away from the run down part of the area, but they still maintain great business. The menu is alright with minimal selection. Beers are great and I recommend you get the taste test where they serve you four different kinds in smaller glasses. Whatever you do don't get shoved in the back room that makes you feel closed off from the place. If its nice outside sit outside, there's always a nice breeze and plenty of shade."}
{"text":"This was my first meal in Pennsylvania. What an excellent start and hopefully a good precursor of more meals to come. Walking in, the place had a good feel and the atmosphere was very welcoming. The beer wall was a nice touch.  I had the Bocktown Burger with fries. It was a nice blend of flavors. The burger was cooked exactly to my order, the bacon was delicious and the sauce made it extra special. The fries were unlike fries I've had before. I'm not sure if it's a particular style found around this region or not, but they almost seemed homemade and I enjoyed them.  One thing that stood out to me was the knowledge of the beers on tap that the servers had. They answered all our questions about what they had on tap and had good advice on what we said our tastes were. The service was excellent. That coupled with good food and good beers made our first meal in Pennsylvania a great one."}
{"text":"The food here is good. The menu is interesting and I like that you have an option for grass-fed beef for your burgers.  I definitely recommend the she crab soup. They have a nice beer selection as well.  The atmosphere in the main dining room is pleasant, but seating is limited. I did not enjoy being seated in their back room. The lighting is blaring and the decor is definitely lacking in this area of the restaurant."}
{"text":"Decent bottle selection. This is really a bar with some tables so set your expectations accordingly. I went the safe route and ordered the Bocktown Burger. They asked how I wanted it prepared & I told them Medium Rare. The burger came out very well done (grey & dry). Since its a bar I shutup & ate it. The other people in my party who had BLT & grilled chicken salad (i think) were also not impressed with their food. Service was fine."}
{"text":"Bocktown is one of those places that I don't hesitate to visit, even if I'm on the other end of the city. The staff is knowledgable, the excellent beer selection is always in rotation, and the food is fantastic - AND the commitment to sourcing local food is refreshing.   I'd recommend the hummus, Adventureland Burger, the BELTCH sandwich, and obviously the fries. Whatever you get - order a side of BBQ sauce. Made in house. To die for. (I'm drooling right now.)  If you're a beer kinda person, you can grab a draft, a special weekly infusion (always unique!) or a mix and match 6 pack. The variety is unbelievable.  If you go, ask for the owner Chris, and tell her Abby sent you. (Please note, this place is becoming more and more and more popular, and rightly so, so plan to go on a weekday night, late lunch or be ready to wait a bit. It's worth it!)"}
{"text":"Friends brought us here for dinner while we were visiting. Amazing food! Hubby loved his sandwich and my salad was amazing! Beer selection can't be beat and the service was perfect!! Will definitely be back!"}
{"text":"Above average bar food. They are doing things right here. Awesome crab soup. Great beer selection."}
{"text":"What is not to love about this plan?! I feel like my fiancé and I find excuse to go to target just to stop at Bocktown afterwards. They always have a great beer list. The bartenders are always so nice and helpful. You can try the beers before ordering a full one. The food is really good too. Their menu has the perfect number of options for any mood you are in. I haven't eaten a bad thing here ever."}
{"text":"Crab soup is on point and so are the fries with beer cheese.  Staff is pretty cool as well.  I just wish they had more hard cider options."}
{"text":"Bocktown Beer and Grill was more than I expect to find in a mostly vacant strip mall in Robinson. The had 100s of bottled beers that I'm sure a beer fan would find fun and interesting . They also had a good variety of about ten different styles and brands of craft brew on tap. The place was packed and I can see why good beer and good food. My wife was even able to find a beer that she enjoyed. I had a delicious burger that wasn't a traditional burger. It had beer cheese, gravy, a beef patty cooked perfectly on top of a slice of bread and fries. They referred to it as Pittsburgh's rendition of Poutine. I loved it, the wife had a really good chicken salad. Definitely worth the trek out to Robinson . I only gave it a 4 star rating basically because of the location and I felt that it could use a bigger bar area to wait in while waiting about 30 minutes for a table to open up."}
{"text":"The burger I ordered was the Angus beef Bocktown burger which cost $5 less than the grass fed version of the burger. The cheese they put on it was shredded cheese, and it was not even melted and was cold while eating the burger. The burger itself was awful. It tastes like a burger you would get in the frozen food section of a grocery store that sells patties by the dozen. I only ate half and could not stomach anymore. The broccoli soup was delicious, although luke-warm. The beer was delicious, and the selection was good for microbrews. The service was good while we sat up at the bar.  Overall disappointed, but would go back for a beer."}
{"text":"Awesome beer and service to boot Bocktown chicken was phenomenal! From Chicago on business what a nice treat!"}
{"text":"On a recent outing with ex-coworkers, we sat down on a busy random weeknight.  The service was friendly and fast, given how busy the restaurant was.  The beers were cold with a fantastic selection from the huge coolers that are impossible to miss on the left hand side when you enter the bar.  We ordered a selection of appetizers which were all pretty good.  While the chicken tenders were fine (what else would you expect?), Carnivore Trio(Filet, Kielbasa, hot sausage meatballs), and beer cheese(with pretzels, both sticks and baked in-house)  was good the stuffed Banana Peppers with Ricci's Hot Sausage (available in Robinson nearby!) was great.  Overall, it was a fun place, good beer available, plenty of bar food to enjoy, Bocktown is a great after-work to meet, or hang out with a couple guy friends.  I didn't really check out the \"bar scene\" there but it looked to be more families and friends than a \"pickup\" spot.  Maybe this changes on Friday or Saturday nights, but who knows?"}
{"text":"Good food but better beer. We had about 10 different brews and enjoyed them all. The meals were a little smaller than expected but very tasty. I did leave a little hungry and that is why 4/5."}
{"text":"I'll give it 2 stars because the waitress we had the night before was very good. That same night however the hostess was dismissive and non-accommodating.  She was almost annoyed that we had a party of eight.. sorry thought you'd like the business.  The food was average, burgers ok, great selection of beer.  Why 2 stars, I went back the next night to have a few drinks, decided on some liquor this time.  Asked the awesome bartender(sarcasm) what type of gin they had, went over the usual suspects and then mentioned they had a new gin made in Pittsburgh.  Interested, he spoke I listened he sold me that it was good... to me it wasn't.  Asked to have it replaced, but proceeded to tell me he could replace it, but he couldn't take it off my bill.  Wait..what?  You talked me into this and now I have to pay for it because your boss will be mad.  I asked to speak to the manager if it was going to be an issue.  Didn't go that far he reluctantly replaced it, but sulked like a 3 year old and wouldn't even make eye contact with while I drank it. This place is run like a frat house."}
{"text":"Great selection of beers and food is really good. Buffalo dip is awesome. Been there twice and will go again tonight."}
{"text":"Myself and group of coworkers were in town for a business trip.  We like to try non-chain local type places and the Bocktown Beer & Grill was near the hotel we were at.  We showed up on a Tuesday night around 6:30 and couldn't get a table for 30 minutes.  This place is more bar than grill and the seating is limited especially if you have more than a party of 4.  Luckily it was a nice night out and we could sit on the patio they had, if not it would have been a tight squeeze to stand by the bar while trying to avoid the wait staff and people using the restrooms.  The food was decent but came out luke-warm.  I didn't have the fries but the guys next to us shared what appeared to be 10 pounds of fries and ate just about all of it.  The beer selection is decent but only if you like non-traditional beers.  There were, in my opinion, too many hopped beers on the list and not enough variety.  If you want a draft macro brew you have come to the wrong place.  I hope by the time the patio opens the wait shouldn't be so long but the kitchen needs to get its act together."}
{"text":"Went in for a quick dinner...I had extremely high hopes for the kielbasa reuben.  Took my first bite, and found that the sausage links had been cut in half lengthwise, and I couldn't bite through the casing (I'm 28 with a full set of healthy teeth). 1/4 of the meat from the entire sandwich had fallen onto the plate in the first bite, after I reached up and tore the casing with my free hand. A recommendation: cut the sausage into smaller pieces, or grill the sausage with the casing down until crispy and can easily be bitten.  The rest of the sandwich elements were good, the sausage itself was good, just not enough thought went into the preparation. Fresh cut fries were excellent."}
{"text":"I thought this place was pretty good.  It's definitely a little difficult to find as it's in a strip mall behind the Target.  You can definitely miss it.  It's also not nearly as big as I thought it was going to be.  Sort of a long and narrow restaurant.  I tried a couple of different apps on my visit -- the spinach and artichoke dip and their version of a \"meat and cheese\" board.  I liked both apps.  The spinach and artichoke dip was tasty, although not huge.  The meat and cheese board was solid, as well.  Lots of meats and cheeses and complete with some great pretzel bread that came with a number of different dipping sauces.  I'd recommend either app.    For my meal, I had the italian sandwich heated up.  There was a fair amount of meat and choosing to go \"hot\" as opposed to cold was definitely the right way to go.  I'd order it again.  Each sandwich comes with a side and I had the side salad with a tomato vinaigrette dressing that was actually very good.    It was a fine meal.  Service was a little on the slower side and the prices were pretty reasonable.  I don't know if I'd rush to go back but I wouldn't be opposed if someone suggested it."}
{"text":"We have always enjoyed the food and beer selection here, from the appetizers to the deserts. A fun place for those who  enjoy beer and those who don't. Our service has always been great."}
{"text":"Visited here while out of town on work. Bocktown has so much potential however it falls short.  This fall starts...with a lack of Menu's.  How do you run out of menus when you are only about 1/2 to 1/4 full?    The food, bland, not great not bad just average.  The drinks were good and there is a decent selection of brews available which is a nice plus.  The outdoor area is nice and has so much potential maybe a live band? Something a bit better than 3 gazebos tied together to provide shade?    Lastly the staff....the few people we dealt with were the saving grace to this place.  If they had more to work with this place would be great."}
{"text":"I'm from out of town (used to be a local) and this is the only restaurant that I undoubtably find myself at every time. Everything on the menu is amazing and if you like an obscure beer, I bet they have it. The staff is friendly and very knowledgable of their beers as well as local breweries. This place is a must stop!"}
{"text":"Absolutely love this place! I hadn't been here in a while but the pens are playing for the cup and we didn't want to sit at home. We sat at the bar. Our bartender was Sarah and she was great! Knowledgeable about the different beers on tap and was entertaining! Started out with artichoke dip and pita. It was good but next time I'll ask for the pita not fried. It was still good though. I had the pierogi hoagie sandwich with a portobello mushroom instead of the kielbasa and it was excellent! I also had the eggs and beets which were also delicious. I recommend Bocktown. I see some bad reviews below but don't be discouraged order a sandwich it's a craft beer restaurant. I only order seafood at seafood restaurants."}
{"text":"I didn't get to really spend much time here, but I am thankful for the Yelp advice I found via the mobile app as I was in search of a pick-6 beer-to go type of establishment on my way to the airport. Whenever I am in Pennsylvania, I always try to find places that offer this as beer laws in that state are much different than in California. With that said, Bocktown was a great spot with hundreds of different bottles of beer for take-home purchase. The taplist also looked great with some regional favorites and some up and coming Pittsburgh locals as well. I was happy to go home with some Southern Tier, Founders, Troegs, and Brooklyn Brewery beers at the end of the day. If you're local to the area, follow them on Facebook-- they do beer dinners and other cool craft beer events."}
{"text":"The establishment was awesome but nothing over the top for me. I eat out alot. For me it was the combination of server feedback, knowledge of the menu, and outstanding beer selection that sold me. It may be in my top five favorites now. Thank Tanner for that."}
{"text":"I went to BOCKTOWN this past Saturday with my sister. Everything I got was DELICIOUS! Here's what I ordered:  CRAB SOUP ( picture): the crab soup was mainly broth with very little crab meat, however, the broth tasted like a base to a crab chowder... I would have liked it more if I could get more/ bigger chunks of crab.  Very delicious otherwise!  POPPER DIP ( picture): this appetizer was the reverse to the jalapeño poppers.  You received a cheese dip with bits of jalapeño throughout. The cheese was just the right heat to it. It had a combination of cheeses that made it yummier than your average cheese and jalapeño dip.  It was served with pretzel bits and green peppers for dipping.  Although my came out warm and ready to eat, I would have preferred it to be warmer. I assume it was sitting for a short while.   Finally JUST A LITTLE SALAD ( picture): that's exactly what it was just a little side salad.  Just enough to satisfy but not fill.  The veggies were fresh, and the use a mixture of lettuce which I love....not just iceberg  I gave it a 3 stars because I also ordered my favorite beer LINDEMAN POMME (picture) without even asking for the price. I order this beer and buy it all the time and assume it soul be roughly 8-9 dollars, however, when I received my bill it cost me $13. I WAS SO UPSET. I NEVER PAID THAT MUCH FOR THAT BEER. At any restaurant I go to!  I think I'm going to start asking before committing to a beer out in Robinson!   Other than that the food and atmosphere was decent!"}
{"text":"We came here for a mini Christmas-get-together. I haven't been in here a while but this used to be one of my preferred restaurants when I lived in the area. Our server was very attentive and the beers on tap were awesome (not to mention the insane bottle selection that I did not delve into). There was a bit of a mix-up with food - my vegetarian hubby's sandwich came out with meat on it when he had requested no meat - but it was fixed with speed and grace from the staff. Be sure to stop in on your next visit to Robinson!"}
{"text":"Nice selections of craft beer. Ok food.   My husband and I were in the area and decided to stop here for dinner. We came on a Wednesday night and were immediately greeted with free beer samples upon entering. What a great way to be greeted! FYI, they have free beer samplings every Wednesday night from 6pm-8pm.   Once seated, that's when I realized how small the place was. I thought it would be much bigger but it's actually quite narrow. The menu is what you'd expect: mostly sandwiches, burgers and some large plate entrees. The hubby ordered a cheeseburger with beer cheese and I ordered the grilled chicken stack (which is just a chicken sandwich) with their barbecue sauce. We weren't feeling adventurous that evening. The food was rather average. We enjoyed it because we were starving but it didn't taste all that special otherwise. If it's because we ordered ordinary items, we'll have to find out at our next visit. Something to note is their sandwiches do not include fries or any side item, which makes their sandwiches a little overpriced since a lot of places include fries with their sandwiches for around the same $10 price range. However, their fries are fresh cut which I love! The highlight of the night was probably the barbecue sauce which you can tell didn't come out of a bottle. It was sweet and tangy but not overly sweet like bottled bbq sauce.   Overall, I'd probably come back for the beer and because it's one of the few non-chain restaurants in the Robinson area."}
{"text":"The location is a little odd (empty strip center) but the atmosphere and beer selection was great. Plenty of ciders to choose from and a nice menu. I'll definitely be back. The chili was very good. Crab soup was thin and light but very tasty."}
{"text":"This was my third trip to Bocktown.  I have eaten and had beer during each visit and each time I try and think how to sum it up.  Beerwise...They have 16 rotating beers on draft as well as hundereds of bottles.  I had a Victory draft as well as a \"white lighting\" draft.  Both 16 oz drafts were $5.00 a piece.  Food wise...I have had (during the visits) the pot roast sandwich which is pretty good but on a cheap bun.  Spend the extra quarter for a real bun,  The second visit I had a meatball sandwhich which was ok.  The sauce was ok.  My last visit my wife and I tried the Carnivore appitizer as well as a few other small plates.  The carnivore plate was 12.00 and you got about approximately 3 ounces of filet mignon, 1 1/2 meatballs, and maybe 1 full brat.  Food was ok, but seemed a little pricey though.  I would not necessarily run back to Bocktown anytime soon.  I think there are better food alternatives and think there are better places to drink beer."}
{"text":"I have been coming here for a couple of years and I haven't had a bad meal (or beer) yet.  The staff is friendly and down to earth and always knowledgable about what's on tap.  They have 16 rotating beers  that are always changing so you always get to try something new when visiting.  The sandwiches are really good and the right size.  The crab soup goes without saying.  I've seen enough reviews on it already so I won't bore you with another.  This place is best with a group of friends but try and stay away from peak hours on your first visit since seating is limited."}
{"text":"Great Bar hidden away in a little strip that I really don't think has any other businesses in.  Right across from Target, I am glad I tried this place out.   A group of us came here after work one day, on a Wednesday - and the place was pretty happening.   They have an outdoor patio,  that apparently it doesn't open for seating until May ... totally ok.     Super great beers ( sworn to by my three friends, since I didn't try any) ... and pretty good food.  My friend had the Omega Goodness (Salmon) and said it was the best meal he has had during our entire 2 week stint staying in Pittsburgh.  I had the Pierogi Hoagie.  Pierogi with some kielbasa as a sandwich... tasted as great at it sounds.....    Two of my friends suggested so many items here that I am definitely coming back to try something new!!!!!  Try this place out.  I loved hanging out here!!"}
{"text":"Was in the area doing some shopping and wanted to stop somewhere for dinner. Since Robinson is overrun with chain restaurants, we decided to try Bocktown. We were pleased with our decision and this is a great option if you find yourself in Robinson. The beer selection was extensive and every Wednesday night they have free beer samplings! We sat at the bar and the bartender that evening was extremely friendly and engaged everyone sitting at the bar most of the night. You could tell there are \"regulars\" which adds a nice touch.   The menu has some bar food staples burgers, sandwiches, etc. But, they also have some great entree options. My husband started with the chili and really liked it. I had the Bocktown Chicken and he did a pot roast sandwich. We really enjoyed Bocktown for a weeknight stop. You can count on a great beer selection, friendly service and good food! We'll certainly stop back if we're out that way again."}
{"text":"I'm here on business from Texas and happened to stumble upon this bar. It has different beers that differ from what a I am accustomed to but that is a good thing. It has led me to discover a whole bunch of different craft beers I enjoy now. As far as I can tell they rotate there beers on tap quite often. They have free beer tastings on wed's 6-8 from different breweries every week. The place is small and is noise level is great for people who actually want to have a conversation with each other. The food seems to be great also."}
{"text":"We had a much better experience here this time than last. I'm glad we returned to give it another try. We were able to take our family there for dinner one evening. Despite them being rather busy, there was only a 10 minute wait time. It was a warm night so it would have been nice to see the patio open, but perhaps it was closed due to the weather starting to change.   I find their build-your-own-fries to be a unique draw to Bocktown. We had a bad experience with it last time, but I think we've figured it out. The secret to this is to ask for the sauce on the side and dip them (otherwise they soggy up the fries by burying them in beer cheese.) This is the only way to prevent bad fry mojo. Having done this, I can say the fries on their own are above average.   I recommend trying a burger - they're quite good. The Bocktown burger is served up on toasted slices of Italian bread. I didn't mind the different take on a traditional burger.   They have an impressive selection of beer - including seasonals. You can stop in to build your own six-pack if you're into that.   Definitely recommended."}
{"text":"I went here with my beer-savy mom for a causal dinner tonight. Normally I would be all over their expansive draft list but unfortunately I had a couple too many last night.  So I skipped the draft list because my body might have shut down if I put one more hop into it.   We sat in the back of the restaurant in the corner. We passed the bar and it seems to be pretty poppin for a sunday yet still family friendly (no body shots...at that point).   I ordered the Chicken and Rice soup, and the Seafood Trio with double veg.  It's hard to mess up or knock you socks off with Chicken & Rice soup but it was yummy.  My mom got the Monkey (something) from East End...actually that might be a complete lie. It was some sort of wheat beer but I didn't try it because my \"condition\". She enjoyed it.   The seafood trio was good! The salmon and shrimp where the high points, tuna on the lower side. I mean... I ate the whole thing which included a huge portion of broc.   It seems like the management really cares about having their customers excited about the establishment.  They have a ton of events (tastings, concerts, pairings, brewery nights). I like when restaurants are proactive about events because they become more of an entertainment destination rather than just a restaurant.  Props.   PROS: very friendly and knowledgeable service, great beer list, friendly atmosphere, customizeable menu, outdoor portion, tons of events  CONS: location. ugh. strip mall in robinson.   OVERALL: I will be back for some of the events and brews!"}
{"text":"I love the buzz from being at BockTown. Yinz guys will love the Beer, Food, and Puns. Always hosting new events and breweries, each trip I experience something new.  Bocktown is a must on the Pittsburgh beer scene."}
{"text":"The best food and beer in Pittsburgh, a true gem and a great place to eat and drink. We live 375 miles away and have been here 21 times since 2006.   Beer variety is fun, diverse and unique. Food is flavorful and always comes in large portions. Staff members are friendly and helpful."}
{"text":"Have gone back since 2011 (wow that was a while ago!) and Bocktown is still rocking the great atmosphere and serving good food.  This time I returned with fellow tennis team members to celebrate our season and we got to try several seasonal beers.  Our waitress was both helpful in the tasting venture as well as patient since between beer tasting and talking about beers it took us longer than usual to order our food.  The food was great, and the beers were paired to the food which made the whole thing even more awesome."}
{"text":"Loved the banana peppers stuffed with hot sausage."}
{"text":"We were having difficulty deciding where to eat for lunch on a busy Sunday... We landed at Bocktown Beer and Grill. We were seated right away and served promptly. Place was clean and well maintained. Prices were fairly reasonable, they promote using local suppliers. Which I always appreciate.   The sandwiches and burgers don't come with fries but they do \"loaded fries\" with a ton of toppings to choose from, that was nice. We shared them and was very filling. I had the rachel which is a reuben with turkey it was fantastic.. very filling. My husband and his dad both enjoyed their sandwiches. We will certainly go back again.  We did however have a lengthy wait in between when we ordered and when we got our food, but all of our food was fresh and hot.   They also have a wide selection off micro brew and local beers, some I had never even heard, we didn't try any on this visit but next time we plan to. They have about 7 or so beers on tap and then multiple fridges full of bottles (you can create your own six pack too). Robinson area is heavily populated with chain restaurants this is one of the few local places. I try to seek out local places, so it's refreshing to find a gem like this.   Go check it out, I don't think you'll be disappointed."}
{"text":"Generic brew pub with Interesting brew selections and good reliably standard pub grub, with two standouts: custom topped white trash \"poutine\" (ours with gravy & beer cheese) damn good, and rotating infused beers. (Mine was Bell Oberon infused with cucumber, lime zest and orange zest.) if I was shopping in the area Is stop again, but not a destination by any means."}
{"text":"Overall great place! Food was amazing, and love that it's locally grown. Excellent service. And awesome beer selection! Just wish they had descriptions of the many beers they have on tap. But overall great experience. Will definitely go back!"}
{"text":"Great meal!  Large portions!  Excellent service by Erica!  Will def be back to try the Death by Chocolate cake dessert!!"}
{"text":"THIS PLACE IS GREAT. Mandie was our server, and bocktown. you are very lucky to have such a cheerful, genuine, hard working server at your establishment. She was by far the nicest server I have ever had. She had great recommendations and made the visit for my friend and I one to remember.   I ordered the she crab soup which was beyond satisfactory- I wish I would e ordered the bowl! I got wings as well, which were cooked perfectly. The food was fast, and the atmosphere was remarkable.   A great place for food, friends, and laughs. Mandie is an amazing server!!!!!!!!"}
{"text":"Disappointed is the first word that comes to mind.  My husband and I use to go there a lot but have not been in while.  We are not beer drinkers (I know, weird place to go), but we always liked the food.  Last night fries were really hard, like they have been refried, not fresh.  Sandwiches were average.  Service was good but it was a slow night."}
{"text":"Very gluten-free friendly! Had several gluten free beers in their wide selection. Also fried my French fries in a separate fryer to avoid cross contamination. Very good food. Fun atmosphere. Would definitely recommend to anyone, especially those with celiac disease!"}
{"text":"Out of the way joint. Small and crowded. Hockey trumps football on TVs. Exceptional chef created soups. Everything I tried was very good - expecially for a bar. (yes,that's 'extra specially').  Nice beer selection as we'll."}
{"text":"Fantastic food, I'm usually not a huge fan of chili but their chili (no beans) is incredibly zesty and delicious and usually have it as a fry topping. And let me tell you, their fries and choice of toppings on fries is great!! I chose chili and Italian sausage on top of their fries and I was in heaven. Great burgers and sandwiches, great drink selection, reasonable prices and a ton of fun and energy. It was a great find after a day of shopping.  Psssst have the she crab soup/chowder.  Have everything on the menu.  HAve a great time. The staff is kind and very fun.  You will be full. And happy. And likely crying over your calorie intake but it's ok. It's always ok here!"}
{"text":"I'm glad I found this place because if I wasn't looking for it, I doubt I ever could have made it there.  They have a good selection of bottled beer (for PA), and a good draught selection (for PA).  I ordered the flat belly fries with bacon & beer cheese - I'd order the fries again, but I think I'd choose a different cheese - the beer cheese was just too sweet for my taste."}
{"text":"Found this place on Yelp so we decided to stop here for lunch on the way to the airport. If I didn't know what I was looking for I probably wouldn't have found it as it's a bit hard to find. The food was very good (I had the spicy meatball sandwich, she had a chicken salad) and they had an impressive list of craft beers on tap and in bottles. The price is a bit high for lunch (~$11 each not including drinks) but for the portion you get and the quality of the food it's worth it. Would definitely stop there again."}
{"text":"My boyfriend and I went here for dinner and it was delicious. We sampled multiple beers which is a great option, its just a couple bucks to get 4oz glass of some good beer. We both got the sirloin salads and our server, Ryan, recommended a great dressing. I forget what it was called but it was some sort of a peppered tomato balsamic. Ryan was great through out our whole dinner! We sat outside enjoying the weather and good food."}
{"text":"Food is excellent, as is the beer selection.  I particularly love the clams here.  Try it."}
{"text":"If you like burgers and fries, you'll like this place. Ordered an appetizer of mussels, over done.  Swordfish entre...way over done and stringy.  The unmashed potatoes are not seasoned, completely bland...as is the rice that came work my husband's also very over done swordfish.   To top it off they were out of Penn Pilsner...in Pittsburgh!  Ok, that happens. .. but how disappointing!  Server did take my entree off the bill.  My husband ate his bc he was starving... We didn't mention that to the server. Our son said his burger was really good."}
{"text":"I'm from California, visiting PA for a work trip. What a great find Bocktown was! I'm stoked! Food and beer was stellar, and Ryan the bartender was such a cool dude. I ordered the buffalo wings and they did not disappoint. Definitely coming back to this place when I'm in Pittsburgh again!"}
{"text":"- 16 Rotating American Craft Beers on Tap - Food Daily 'til Midnight or Later - Always Fresh Homemade Desserts - Pittsburgh Owned and Operated  yeah, welcome to Pittsburgh indeed!  She crab soup was brilliant.  3 rivers burgher was a great intro to what was to come in this fantastic city that loves it some burger and fries... just more so than anywhere else..."}
{"text":"Went for my first visit last night, which was a Saturday. Fantastic brew selection, friendly waiter with great suggestions. Ordered two tap specialties that were both delicious while waiting for friends. Wasn't starving for dinner, so ordered the \"Snacks N'At\" Mussels Diablo, while my friends ordered the entree Grilled Reuben and the Pot Roast Stack. We told them to bring them all out together, which was done after an unusually long wait. There's very little less enjoyable than cold shellfish, unless it's supposed to be chilled. There were about a dozen over-cooked (i.e., tough) mussels on the half shell, with barely a hint of temperature, served in a bowl with a handful of pita points. The sauce was reminiscent of a spiced-up duck sauce, with sliced jalapeños thrown in for heat. It may have been enjoyable at some point, like maybe when it had just been prepared, while the mussels hadn't overcooked from waiting and the sauce hadn't congealed into a stiff syrup, but by the point it was served it was barely edible. On the plus side, Friend One seemed to enjoy the Reuben, and it looked delish, piled high with lean corned beef and nicely toasted marbled rye. I distinctly heard Friend Two say that the Pot Roast Stack was one of the best he experienced. So maybe my Snack was held to the detriment of its \"eatability\", in an effort to sustain the unified presentation. Perhaps a little delay in cooking would have helped.  If there were two ratings, one for ambience/quaffability and one for the food, I would have assigned a 4.5 for the former, and a 1 for the latter, being a generous testament to my friends' remarks. BTW, Friend 1 ordered a Coconut Layer Cake for dessert (made locally but not on premises) which she absolutely adored. Since there AREN'T two evals but an average, and giving some weight to the fact that this is primarily an artisan brew joint (perhaps contrary to the owner's remarks herein), I'm giving it the dreadedly average 3. Perhaps teaching the waiters to have subpar dishes held would be a better policy. Timeliness at the expense of quality is never a good policy."}
{"text":"Great music, good food, service and fabulous beers on tap. A little bit of something for everyone. Stopped here on my way through and came back a little later in the evening to hear \"Rising Regina\" one of my favorite local bands. Will certainly stop again. This may well be the best place to hang in Robinson."}
{"text":"One of the places in Robinson that serves food till late (midnight). True that the location is remote and everything around is shut but worth driving down if you are looking for some good beer selection, many with flavors, and some late night snacking.  I like to try new beers so I was happy to find a strawberry and a blueberry beer in bottles (cannot remember the names) - worth finding and trying IMO. Nonetheless, with more than 10 beers on tap there is plenty to choose from. Our server was good in helping us decide which beers to try.  Food is average bar food. I had the Bocktown Burgher which was solid - good juicy meat and the onions and bacon on the top were crispy - the way I like it.   Good for groups, especially in the evenings and of course at night between 10-12pm."}
{"text":"This place should be renamed Ghost Town Beer & Grill, not because of the bar itself, but because of where it's located, in the corner of an abandoned strip mall in the Robinson Shopping area. It definitely doesn't stick out, but once you're inside all of that it quickly forgotten.  First take notice of the 15 craft beers on tap and you won't ever want to leave. Decisions, decisions. The bartender was great, offering taste samples and making recommendations. I first tried a New Holland El Mole Ocho, very smooth with a little kick. Then I switched to Sam Adams Cranberry Lambic while I worked on a batch of cheese fries with bacon and jalapeños. That's a well-balanced meal, right?   Thumbs up all around...and you'll never, ever have to worry about parking."}
{"text":"Microbrew beers with stupid names? Check Extensive bottled beer selection? Check Mediocre food that is generic? Check Got me drunk enough not to care that the food was just like every other brew pub I've ever been to? Check"}
{"text":"Bocktown Beer and Grill was one of the closest restaurants around the area where we stayed at when we visited Pittsburgh. It's hidden in the same shopping center as Target. It's away from the crowds and off to a corner all by itself. The place is long wards, meaning it's narrow but plenty of tables in a column. As soon as you step in, you can already tell you're in Beer town. This place has loads of different types of beer and they pride themselves of creating their own brew. They even sell some in bottles to take home. The atmosphere is like any other bar, a bit noisy and busy. They have TVs playing whatever game happens to be on at the time on both ends of the restaurant and one near the bar.   The beers are tasty and they serve all sorts of different types to fit your drinking mood. Their beer list changes daily and cycles within the season. If you're not a beer person, fret not because they do serve wine and mixed drinks. However, it would be pointless to go to Bocktown and not try their beer, especially since their food is mediocre. The only thing special on their list of food would definitely be the loaded potatoes in which you can decide what to put on it. I tried their wings as well and that was bland. Hooters wings are even better.  To sum it up, I really like the fact that if you liked a bear, you can take home a bottled one. They have awesome slogans on their t-shirts and merchandise that you can easily purchase from your server. Oh and by the way, their service is pretty decent as they are all nice, courteous and informative.  This would be an awesome place to gather with friends, have some awesome beers, enjoy each others company with many laughs!"}
{"text":"Stopped in around 7:00 on a Tuesday evening. Though the restaurant was full we were able to get a table right away. I had a cup of chili and the \"Untouchable burger.\" The chili was great! It was full of meat, just spicey enough, and tons of flavor. However, I was less than pleased with the burger. The burger is topped with coleslaw, fried onions, pickles, and their Untouchable sauce (which tastes like a ketchupy bbq sauce). The burger was cooked to my requested doneness, but there was no texture to it, no crust on the outside. That in combination the overwhelming amount of sauce, coleslaw, and a too soft bun created a soggy burger that had no indivudual flavors or textures. Even the fried onions that were supposed to offer some sort of crunch were soggied by the heavy amount of sauce. My meal and a beer was $22 before tip. I would happily try Bocktown again, I would just stay away from the Untouchable burger."}
{"text":"The place was ok, service was very good, but the food was mediocre. If you are a beer drinker, this place would be heaven for you. I would return but not go out of my way."}
{"text":"Been to Bocktown a few times, and this experience was by far the worst.  I give them credit, their beer selection is excellent and reasonably priced compared to establishments in the city. But on this particular occasion, service left a lot to be desired.  Unbeknownst to our server, I also am a server, and having just worked 6 long nights in a row, all I wanted to do was relax with my girlfriend, watch the Pirates game, and have some lunch. When she tried to get us in and out within 20 minutes, I was mystified.   We ordered an appetizer (The Jalapeno Popper Dip), which was okay. Felt the portion of pretzel bites to dip for 9 dollars was a bit pricey, but I understand how restaurant costs work, but it just seemed unreasonable for what I would call \"Queso and Chips\".  We ordered our meals soon thereafter, and my Soup came instantly after we got the appetizer, and then oddly enough, my sandwich came right after I got my soup. At this point, I hadn't even taken a sip of my beer, and I had 3 hot items to eat before they got cold.   I probably should have spoken up, but this review will have to suffice. Note to servers; PLEASE LEARN HOW TO READ YOUR TABLES.   Also, there was little to no interaction. She was pretty much only there to deliver the food from the kitchen. A little service goes a long way. We also had to flag down another server to get our check in order to leave, because she was nowhere to be found.   I'm sure the type of service she delivered today is acceptable for some people, and I get that she's not working at a fancy 5-star restaurant, but a simple \"would you like me to wait on sandwiches so you can enjoy your appetizer\", would have gone a long way. What was planned as a nice afternoon to drink beers and watch some baseball on my day off was incredibly put into fast-forward and before I knew it, we started our grocery shopping much earlier than we would have liked to."}
{"text":"This place has great service, great beer selection bottled and draft. Food was pretty good I got some wings of course to try them out. Flavors were good (can't remember what they were called ) and the wings were bigger than expected.. Beer was also good drank Victory beer . Sommor Bock, an October fest style, Red Thunder (which is aged in red wine barrels), and some Ranch beer no not like the dressing like the ranch the farm where the hops are grown.. Hope to be back there soon"}
{"text":"IPA on draft was good. Limited seating. Only a couple of TVs to watch the game. Menu was rather small."}
{"text":"Food is 3 stars, but service is rotten. Sixteen craft beers on tap. Go here for drinks, and then eat somewhere else."}
{"text":"As a self-proclaimed craft beer connoisseur, nothing is more important to me then a wide variety at decent prices. While I cannot claim that this place is inexpensive, I can vouch for their selection and quality! Generally, the service is decent and the staff is friendly. The building can get a little crowded, but they keep it spic and span. Regardless of what you choose to indulge on, it's pretty much a guarantee that it will have some good flavor. If you're looking for great beverages and aren't afraid to try something new, this place is made for you!"}
{"text":"One of the best places to eat in the Robinson area. I get something different from the menu every time I visit, and I haven't been let down yet. The fish sandwich is amazing. Oh yeah and the beer is pretty good too."}
{"text":"I was looking for Beer and a Burger when I was at Robinson Towne Centre and am glad I'd added the Yelp app to my iPhone. I found Bocktown close by and it was the perfect place. While there was an expected wait if we wanted to dine inside, the staff had opened the outdoor seating area even though it was the first weekend in October, usually not a great time for outdoor evening dining in Pittsburgh. Outstanding beer selection, including options for tasting and pouring a variety of on-tap choices. The bottled beer selection was extensive - I'd probably still be there if I looked at them all. The taste of the beer and the food was excellent and portions were very generous. The only downside was service being a little slow, possibly because they may not have anticipated opening the outdoor patio and didn't schedule staff accordingly. I'd give it a 4.5 rating, but don't have that option. I definitely plan to return."}
{"text":"Always a great selection of beers and everything I have ever eaten was good. No bad things to say."}
{"text":"I can't remember if I've reviewed Bocktown before, but the important thing is that it's consistently great. I'm always in the area on business, so I've eaten at the bar every time but once. The bar staff is consistently the friendliest I've ever encountered. They're attentive without being overbearing, will chat or leave you be depending on what you're looking for, and have great suggestions for beer. Plus the food is always good, and there's always a new beer on tap. Compared with all the chains in the shopping plaza it's located in, it's a breath of fresh air."}
{"text":"As a craft beer fanatic, I'm typically at a loss as to where to go when I visit my family in Pittsburgh. That being said, I was thrilled to be introduced to Bocktown and their wonderful selection of beer. With 16 rotating American beer selections on draft and over 400 bottled beers, they offer something for almost everyone. That being said, Bud Light and Miller Light drinkers may complain but that's their own fault for coming to a specialty beer restaurant.   The servers and managers are very helpful about providing recommendations based on what you like. You can pick out your beer, bring it back to your table, and they'll provide you with the appropriate drinking glass. I absolutely love how they serve the pumpkin beers in pint glasses with a sugar and cinnamon coated rim!   The food was also good! I had the steak salad served with french fries (pretty hard to mess up) but the steak was tender and cooked perfectly medium rare. The garlic Parmesan wings were delicious, the chili was average, and the pot roast stack was excellent!"}
{"text":"This place is Is a solid choice when looking for somewhere to grab a bite in Robinson.   It can be a bit small and I don't always recommend it during busy hours or during sunset, as the sun will punish your eyes. I don't know why, but the sun shades just don't work the best or something. Maybe they have faded with time and haven't been replaced.  They have a great beer selection and the staff helps you choose what you are looking for in a beer. They also have samples too, but be careful because they charge for them on certain days and it can really run up the tab without noticing it.   The food it good and the fries are a solid choice. Any option that sounds good to you, get them. My favorite is the beer cheese and gravy. An American poutine if you will!  The Sea Crab soup is my mom's favorite. As far as the rest of the food, it's not the best in Pittsburgh, but it's good. Some of the specials are exciting on the menu, but slightly underwhelming when you receive them."}
{"text":"Hooray for Beer!  We had already eaten at another lcoation and my friends wanted to enjoy some good beer.   Not having to been to to Bocktown, I was surprised how crowded it was on a Thursday Night - there was a 20 minute wait for a table and no room at the bar.  We viewed the amny coolers with individual columns of beers (a different beer in each column and row) - so many choices.   I felt like a kid in Wonkaland.  This place reminds me of the Sushi Conveyor Restaurants... I know there is not any comparison to Sushi and Beer - but....   When you sit down, you can order a beer off the menu.  The larger selection, you walk up to the cooler and bring your beer back to your table.   The waitressw will open the beer for you and mark her ticket.    Thus the sushi converyor belt - yuo take want you want / the waitress keeps score.  My goal was to get high score and think we did so with a Smokey Porter.   In all my years of having beer - I have had a irish smoked whiskey but not a beer.   It was well ... smokey.   Atmosphere - Hopping / active  - We sat outside - it was nice and everyone on the patio was having a good time.  Prices - kinda of expensive but what do you expect when drinking quality beer.   Beer prices are $5 - 20 per - the Smokey Porter was $17  Service - Great - our waitress was a lot of fun.  Will I go back? - Hell Yes! ;-)"}
{"text":"Came in from out of town, yelped it and found this place!  Thanks again Yelp!!  We had 2 hrs to kill before check in and had some great wings & beers!    Large beer selection!  Friendly staff!"}
{"text":"Well i was excited to go here from reading the reviews and the counter person at the hotel i was staying. Apon arrival the place is in a strip mall center and the only business open. I am on a special diet and ordered grilled chicken breast the waitress said it comes with fries i cant eat fries so i ask for a vegetable she says we have zucchini perfect i thought she said its cooked in butter i asked to have it steamed please ok and i order a small green salad. The food arrives its two chicken filet tenders grilled they were great i must say but the zucchini was cooked in oil and cumin i hate cumin ugg the side salad was warm and wilted bummer i will never eat here again.  Oh ya and i forgot when the bill cane it was $16.99 are you kidding me and i had a water. She took off the fries and still charged me $3.99for the veggies:("}
{"text":"A large selection of beers and a great menu. The service is never stellar, but it's normally okay and we're never in a hurry when we go there, so it's not a big deal. Sometimes, the wait staff gets confused if you properly pronounce beers, so using the local (read: incorrect) pronunciation might work better for you if it's a fancy beer."}
{"text":"Beer was amazing and the popper cheese was also great! However, the service was not that good. We sat at the bar to eat dinner. The bartender was no help with recommendations as far as beer or food was concerned. He seemed more concerned with telling the staff to wash his glasses and to put them away while he just stood their. I Finally the gentlemen sitting beside us at the bar helped with suggestions. He also worked their but was off shift. He should of been the bartender! If you see a guy with star tattoos on his elbows I suggest sitting at a table."}
{"text":"Who knew this place even existed??  Hidden away in the strip mall by Target, you'd never find it unless you were looking for it.   In the Robinson area on a Friday evening, we gave this place a shot when 'no wait' had a 60 to 75 minute wait for Burgatory.    Got in line on the app and after a 15 minute wait, we were seated at a table for two by the bar, which was my biggest gripe of the night.  The front area by the bar was crowded and so we constantly had people bumping into us and essentially standing at our table while waiting for their beer.    The food was good though, and the beer options were plentiful.  There were several glass cases of beer along the one wall plus the draft list.   We started with the jalapeño popper dip, which was served with some green peppers and some soft pretzel bites.   Delicious although we had more dip than dippers.  An extra dollar charge for additional pretzel bites.   I also had the buffalo wings.   They were a little too crispy and some of the chicken was dry but overall good flavor.  My fiancé had the Pittsburgh Poutine and enjoyed it.     We'll be back to sample more apps and food in the near future."}
{"text":"Found Bocktown via the YELP app on a recent trip to Pittsburgh. The number of 4&5 star reviews talking about a great beer bar captured my interest. Great selection of rotating drafts, choose from 16 taps.  The bottle selection too should be noted, it seemed like their row of refrigerators went on for miles and the varieties they carried spanned the globe.  Service was excellent.  Dash, the bartender, was great.  Food, outstanding, really enjoyed the Hot Meatball Sausage Sandwich Stack.  Here's a tip, if you check-in to Bocktown via a popular social media location sharing app, you get a free order of their famous fries.    If I'm back in the area, I'll definitely head back to Bocktown."}
{"text":"This is the best brew pub in the area. Great food and great selection of local beers. Great staff as well.   Update 9/29/16 This place is great. Every time I'm in town I make a point to stop in. Great place to sample local beers. A big pumpkin selection which isn't really my thing, but cool to try. Great food. Crab stuffed chicken was great. The staff is always great. They really know their beer."}
{"text":"This review has a qualifier... I haven't eaten IN this restaurant in probably close to 10 years. But...when I want a break from my weekly Asian takeout, I often find myself ordering take-out from Bocktown.  Every time I walk in to pick up my food I think to myself, \"I like this place.  It's got a nice atmosphere, a huge beer selection, and I think it would be fun to hang out here for happy hour outside.\"   And then I take my food back to my office and eat it and think, \"this is really good, I should go there and eat in the restaurant for a change.\"  But I don't. I have short-term memory issues. Also, it's in a really weird location.  Maybe this review will help me remember.   So the qualifier is, although I can vouch for the food, and I can speak to the atmosphere of the restaurant itself, I haven't eaten there for a long time and don't know what sort of service experience to expect. I do know that when I pick up my food, the staff is always very friendly.  I will be returning here for happy hour and to dine in... As soon as I can remember it."}
{"text":"I met a group of colleagues for a \"tweet-up\" at Bocktown last night. To be honest, I had never heard of the place, or knew where it was located.  It was completely new to me.  I really enjoyed the atmospher. Very nice outdoor patio, a small back room (which we used) and the main dining/bar area when you first walk in.  I really enjoy the decor of old beer cans along the walls.  I had two drinks, which were $4.50 each. I had the strawberry wheat beer, which I loved.  A little pricey, but I'm willing to pay for good beer.  My Bocktown Burger and fries was super delicious, and I offer no complaints about the food.  The service was great. We had a waiter who took care of our entire party of 12-14 people. He was very friendly, jovial, and offered great service to us.  Bocktown also worked with us before the event to make sure everyone in our party got separate checks.   Overall a good experience.  This place is really hidden, though... No wonder why I never knew it existed!  P.S. They have a great website and very good social media presence."}
{"text":"Bocktown really is the Place to Beer, as one of their shirt describes.   I have been frequenting Bocktown Robinson for a few years and have yet to have a remotely-imperfect experience. The rotating beers always have something for everyone, and if not you can just pull your own beer out of the self-service coolers. By now, we've sampled half the food menu and my favorite menu item is the Hot Sausage Meatball sandwich made with local Ricci's sausage on a fresh Mancini bread.  Anytime I have friends or coworkers in from out of town, I always recommend Bocktown and not that other place that puts fries on their sandwiches. :)"}
{"text":"\"This place better be damn good\", I muttered to myself as I did the mile and a half walk from my hotel. I don't mind walking a few miles to get to a restaurant, but this walk particularly sucked. All up hill and in the gutter since there are no sidewalks here (and they say nobody walks in LA. At least we have sidewalks).  By the time I made it to the place, I was so ready for a beer. This establishment is quite unassuming from the front. However, once you step inside you immediately feel like you are at a locale much hipper than the strip mall location would suggest. It was pretty busy but I did manage to find a seat at the smallish bar.  First things first, their beer selection is fantastic. 16 taps and Lord knows how many bottles. I got the feeling that if you ordered a Bud here they might just throw you out on your ass. The bartender recommended the Troeg's Sunshine Pils, which is a locally produced beer. It was good and crisp. I was in an IPA mood though an subsequently had the Green Flash West Coast IPA (GOOOOD!).  I did actually eat as well. I had the Bocktown \"burgher\" that was quite tasty. I especially liked the fresh bread used in lieu of a bun. It was pretty big and I could barely finish it.  Don't let the odd location fool you. This place is well worth a visit."}
{"text":"Coleslaw was not good. Bocktown Burger was ok. Beer Selection was good. Adventureland was meh. French fries was ok. Service was ok. Coke had no bubbles. Worst than the one Mc Donalds serves but at least our waitress was kind enough to take it back.  Our waitress asked if we wanted to have grass-fed or traditional style, we said grass-fed. We haven't seen the price on the menu (maybe it was written) but I wish we were told that it would cost $18 for one burger, not even a good one. Thanks but no."}
{"text":"I wish one star was an option.  Service was awful and food was worse.  Ordered Titos Vodka and Club which waitress said they didn't have Titos which was later sitting right on the bar.  When my Stoli came it had no club soda in it.  Ordered garlic wings and they came out over cooked with zero sauce on it and ordered fried pickles which were so salty that you couldn't even eat them.  Another person who ordered a Reuben with corn beef and it came out with some kind of sausage on it.  Another coworker has been up since 4 AM sick from the food.  Hope they figure it out quickly."}
{"text":"This is probably closer to 3.5 stars; when I reach that position I think \"If I were in the area, would I definitely go here again or maybe try somewhere else?\"  While this meal was great, I'd probably try somewhere else.  The visit was on a Saturday night and we were seated very quickly (sooner than the promised time which is always good). Dining room isn't spacious but we had a large booth for two.  They were doing a great job of keeping the tables turning.  There were TVs but not enough for where I would come here for a major sports event to camp.  Our server was probably 5 stars.  She was very attentive, cheerful, helpful with the menu, and offered to bring me out a beer sample for what I ordered to make sure I liked.  Checked on us at the right frequency and seemed genuinely happy to be helping us.  Speaking of beer, probably 5 stars on the selection.  A huge selection of bottles plus rotating draft options that are on a chalk board and temporary menu.  The temporary menu also does a good job of explaining the beer flavor.  The bottles are in a display case that throughout the evening patrons are usually perusing to find a gem.    The food was hit or miss.  The hit was my growler sandwich (sliced steak) that was really good (probably 4 stars).  Fries were average.  She had the crab roll sandwich.  It seemed a bit overseasoned.  Good, but seasoning overwhelming the crab.  We finished it, but wouldn't order again.  Probably 2 stars.  The location is a an odd, off the path strip center but easy to find and park.  So if you like beer variety I would definitely stop here.  If you're more mainstream on beer and are just looking for Grill food, maybe try other options."}
{"text":"In town from MD and this place received great reviews on Yelp and Google and did NOT let us down.  My husband said it may have been the best sandwich he has EVER had!  I had a pierogi sub.  YUM.  We wished we weren't driving back home as the beer selection was stellar!"}
{"text":"First time here based on recommendation from a friend and really liked it!  Good food, great drink selections.  Higher prices than desired but overall very good.  Maybe get some better lighting or signage outside...drove by this place numerous times and didn't even know it was there."}
{"text":"I love this place. Top notch beers. Great food that is locally sourced. If you get lucky you will have Dash the restaurant manager subbing as bartender. great personality, impressive knowledge of beers (yet unpretentious). Look at the back of the beer menu for specials, though I recommend the she-crab soup."}
{"text":"Absolutely delicious! We ordered the kielbasa Ruben and \"the Growler\" both were great! Service was fast and attentive. Beer selection was also superb. :)"}
{"text":"Good food. Fast service. Bocktown sauce taste delicious.  Clean restaurant"}
{"text":"I spent the week at a crappy little motel about a block from this place.  Their great beer selection, well crafted, tasty food, and fantastic bartenders had be not bothering to get in my car to find food for the entire week.  It says something about a place when you find yourself swapping recipes with the bartender's mom on a Friday evening!  Kudos!  I'm glad this place isn't in my neighborhood...I'd be about 100 lbs over my already well padded self!  Cheers!"}
{"text":"My husband and I just happened upon this quaint little gem on one of our shopping trips!  Wow am I glad we did. The beer cheese is awesome!  I had one of the chicken sandwiches and loved it!  Great atmosphere with 16 rotating taps. Our service was great!  We will definitely be going here again next time we are in town!"}
{"text":"We've been to Bocktown countless times over the years. This place has it going on. Fresh local ingredients, beers o plenty, friendly staff. I can't think of a single complaint. Beer cheese and bacon flat belly fries are my Bocktown happy place but let's be real, everything on the menu is fantastic. Don't forget to check out their specials!"}
{"text":"As far as the beer & food goes - this place is 5 stars! What brings it down is the speed of the service.  So first things first, I am not from 'round here. I'm here on business and I'm not going to let something like \"I have no one to eat with\" to stop me from going where the good beer is. And that's super important because good beer is hard to find around these parts!  I accidentally saw Bocktown when I was at Target. I thought about going there but opted for pizza instead. (Note: That was a poor decision.) So today I came back to the shopping center to drink good beer and eat delicious food. I wish however I was hungover; this place would have been *that* much more awesome.   I got introduced to the layout - if you want a bottle of beer you go to the gigantic fridge and pick out your favorite bottle. (I suggest doing this after you've ordered an appetizer or side of Belly Fries.) This alone could take you 15 minutes depending on how much you like beer. Once you find your favorite bring it to your table and your server will pop it open for you.   Hopefully you've already placed an order for some food because it's going to take awhile for it to arrive. The servers are nice and great so do NOT blame the slow arrival of your food solely on them. I can't say it's not at all their faults, but my server was great: helpful and attentive. But it took about 45 minutes for my to go order to arrive. And that's just not ok.  I ordered the chili cheese fries to snack on while I drank my beers. I would have liked more cheese to go with the chili (honestly, if it weren't for a few stray strands of cheddar I probably wouldn't have known there was cheese on them at all) but overall they were good. Note: add malt vinegar, it's deelish!  To go I got a Growler - the sandwich, not the beer. It's good, not great. Why doesn't it have mayo?? I thought cheesesteaks had mayo?? Oh well. At least the beer is good."}
{"text":"This is my favorite local spot. It's very original, I guess it's a small chain... but it is a great way to spend your night in the Robinson area! The have a freaking awesome collection of brews paired with quality food!  They sell growlers and have seasonal& weekly taps, you really can't fully appreciate the place unless you are a variety enthusiast for brew as I am, the different flavors available here are so random and rewarding.   The inside is very relaxing, a little dim- setting a relaxed tone. The service is great. The food is good...  I've gotten everything from the loaded fries, to the barbecue burger, to the portabella burger- it is all pretty solid American food with its occasional twist. I was not a huge fan of the 3 rivers fries.  I like that they have multiple vegetarian options.   Definitely a great spot to hit on a weekday night/ before you get on the plane. Will return"}
{"text":"Bocktown is a local favorite.   It's a bottleshop/pub with food that is better than your typical brewpub.   In particular, and why I go here when I'm on that side of town is the She Crab Soup. I became addicted to this soup while attending the Big Pour event in Pittsburgh, where they were featuring their famous soup at their stand. I couldn't get enough and went back the very next day to have another bowl.   This last time around we also had salads, which were a nice healthy pile of greens with some veggies. The house vinaigrette is not bad and the proteins were done right. The beef was pink and the shrimp was tender and grilled without overcooking.   I don't have anything bad to say about Bocktown, indeed, even the service is typically fun and friendly. Perhaps it's the location, or that the food while good hasn't wowed me yet, but I can't give everyone 4 stars, so three it is for now.   Just know, that bowl of soup must be had."}
{"text":"I went to this restaurant because it was REALLY cold out and it was the closest thing to my hotel. The atmosphere was cozy and there seemed to be a lot of interesting beers in the refrigerators lining the wall. There was also a good selection on tap, but there were no descriptions of the beers on tap, nor were there any prices for beer indicated on the menu. The menu had good variety and I selected the Bocktown Burger with Angus beef ($9.99) after the waitress strongly recommended it. I also added fries for an extra $1.99. My food came relatively quickly and it looked amazing. However, when I tucked into the burger it was SO INCREDIBLY SALTY! It was so salty that about halfway through my tongue started to hurt and I couldn't go on. The service through dinner was passable but not too friendly or attentive. Overall, if I'm back in this neck of the woods, I don't think I'd go back back to Bocktown Beer and Grill."}
{"text":"Insanely slow service. Took nearly 10 minutes for a waiter to come ask for my drink order. Lots of burnt out light bulbs and filthy light fixtures. The food was mediocre they are trying way to hard. And I'm pretty sure the same beer door that's broken was broken when I was in town 2 years ago.  I should have just gone to Burgatory"}
{"text":"So sad it is closing. I'm not a local but I stop here every year and love the atmosphere, food, and beer selection. Bocktown will be missed!"}
{"text":"Our meals were so bad that I thought we were being 'punked'. Let's start with atmosphere, cold with a few space heaters, booths and tables are crooked (annoying having 1.5 feet between me and table), and lights burnt out over the table so the lighting was rather depressing, not mood lighting.   Wait staff wear no type of uniform to identify themselves and very unprofessional, nice, but trashy vibe. And the food....  I ordered the 28$ blue cheese crusted filet, bf ordered seafood trio around same price..the price would indicate this is a good place (why we decided to come, based on online menu)..my steak was terrible, tasted like dry deer meat, had congealed blood all over the top as though cook clearly can't cook, no crust and one blue cheese crumble. Potato and veggies were actually cold cold, not warm, cold.  Bf's seafood was clearly 3 frozen tiny pieces of meat with NO seasoning and the texture  (well I picked them up with my hand, shook them, and they didn't fall apart, like little bricks). All I could do was laugh.  I asked for managed and hit the meat on table like a dry roll!! And scraped the blood crust off my steak, he felt bad and just said to go."}
{"text":"I begged the hubby to go with me to Robinson last weekend, so when I drag him to the mall, I try to find a delicious dinner spot so it all doesn't seem too miserable to him. After seeing the great reviews of Bocktown on Yelp, I knew it would be the place to go.   We arrived a little after 6:30pm on a Saturday night and were immediately intimidated by the hoard of people waiting to be seated. They were all crowded together like sardines in a tiny space that Bocktown must call a waiting area. We got our name on the list and were told only one other party of 2 was ahead of us. Ok, phew, that wasn't too bad... Until 7:30pm rolled around. In the hostess's defense, there really was only one couple seated ahead of us. It just took that long for people to leave...  The draft list was pretty impressive. The list was 16 beers long with no typical Pittsburgh beers (such as Yuengling or Blue Moon) in sight. I ordered one of my favorites, Full Pint White Lightning. Mmm mmmm.   We ordered our food ASAP since we were starving after the long wait. I was so happy that it also came out quickly, too. We shared a serving of fries covered in Beer Cheese and Beer Kraut. I really enjoyed the combination, but if German-style fries aren't your cup of tea, they had a long list of toppings to choose from. For dinner, I ordered the Rava-Dava-Dici. The ravioli and sauce was nothing special - really nothing better than the frozen/canned variety I would whip up at home - and the ravioli actually seemed a bit too al dente. The accompanying hot sausage meatballs were tasty but didn't seem to be a perfect pairing for the boring pasta.   I love people watching and Bocktown had an interesting mix of clientele from classy business folks wearing nice wool coats and dress shoes to your Pittsburgh locals wearing Pens jerseys, flannel shirts, and Kmart shoes. (I actually heard a girl bragging about her Kmart boots while there so I did not make that up!) All that to say, you really don't have to worry about dressing up for Bocktown.  My favorite part of the restaurant was actually the service from our waitress Maureen. She was so fabulous that I wrote her name down in my phone to remember to give her credit in this review. She was friendly and efficient without being too over-the-top.  This restaurant is really 3 1/2 stars for me.... I would consider it a solid dinner option but didn't think any of the food was interesting, innovative, or well-cooked enough to bump it into the 4 star bracket."}
{"text":"Great spot. Stopped in for lunch today. Had a brown ale with my potato & bacon soup app and the lamb stuffed banana peppers. PERFECT!  A great beer selection as well. This is a great spot....skip Fridays / Applebee's and go here instead....you'll be glad you did and the factory restaurants won't miss your business."}
{"text":"Went there twice when I was in town for a tournament.  Nice selection of beers and the food was very good for a brewpub.  Recommend!"}
{"text":"If you can find it, and you're willing to wait for a table, you can't miss out on Bocktown Beer and Grill. The restaurant is in a vacant stripmall in Robinson, which sounds strange, but trust me- seek out this place. Bocktown seems to pride itself on its Yinzer roots and using local ingredients. Except for the Sharp Edge, Bocktown has the biggest selection of beer in Pittsburgh, and craft beers are plentiful. While the restaurant is a bit tight and the wait sucks, the food will make up the difference. Try a \"burgher\"- juicy, meaty monsters like the Adventureland burger with coleslaw and onion crisps or the Bocktown Burgher with cheddar, bacon, and their in-house BBQ sauce. Their sandwiches are also big and delicious, and make sure you try the fries.  Also, a hidden gem on the menu is the She Crab soup. If you've never had She Crab soup, try it, and if you've had it before then tell me if you've found one better in the Burgh, because I haven't. Crabby, creamy, and delicious."}
{"text":"I was not impressed with the food it felt like they tried so hard to be different that they missed the mark. I had the clam stew which could have been thicker and have more body but it didn't it was light. I felt really let down. Its like they were really cheap with the soup.  The beer selection is what made the place its everything you could ever want. I am telling the truth go here for the beer the food is high-end and my feeling is that it doesn't mesh with the rest of the place. I want it to but it doesn't or perhaps I'm not complex enough to know the difference that could be true too.   But seriously, go here for the beer."}
{"text":"This is a pretty cool place. We started with buffalo chicken dip, which comes with little fried pieces of pita. Yummy, filling, and rich. I tried the Bocktown Burger, which was HUGE! You definitely get your money's worth. It was juicy, and the bacon CRISPY (which is the only way to properly prepare bacon). The French bread was tasty but it was only about the half the size of the burger, which made it a teensy bit difficult for me to eat. Their house cut fries have the freshness of homemade. The Mr. tried the reuben sandwich. He's picky about his reubens, but he said he really enjoyed this one; it was moist and easy to eat rather than chewy.  The beer selection here is really fun; something different every time you visit and a huge selection of interesting six-packs. The service is friendly and the decor is edgy. We're eager to check out the weekly beer tastings and live music.  My only complaint? The location! We frequent the Robinson area, but Bocktown is kind of hidden away in a lonely corner of the Pointe at North Fayette. Bocktown is waaaay too hip for this place! I think this they belong in the city, not in the sterile suburbs surrounded by awful chain restaurants! I hope they consider opening a location in the South Side or something along those lines in the future; they would fit in very well!"}
{"text":"I generally don't contemplate leaving the city to get a meal, but Bocktown definitely gives me second thoughts. The amount of beer held in this place is phenomenal - there are many choices here I have never tried before, and that is saying a lot considering the work I have put my liver through.   On to the food: their fries were plentiful and delicious, and I would recommend getting a serving to share as an appetizer. I loved choosing toppings (bacon and bbq sauce, yes!) and the server was helpful in explaining the differences in sauces. I had the poutine burger, which absolutely made my month as the best use of poutine in a non-poutine setting. Note: poutine is a Canadian delight consisting of french fries smothered in gravy and cheese curds - get your minds out of the gutter.  The server was very attentive, friendly, and helpful - she even helped me select a pumpkin beer 6-pack to go when I was heading out. I would like to go back during one of their tasting events or other special nights, as I sure I would be fully satisfied with pretty much anything this place has to offer. Definitely glad I left the city for this one!"}
{"text":"I have to admit that I am a regular at this place whenever I am in town, and I have been going to Bocktown for over seven years now.  That said, I can count the number of times I have been disappointed with Bocktown on one hand, and I visit at least 10 times/year.  It's a serious beer place with outstanding food and great staff.  The beer is always changing which means that if you stay for any length of time or come back the next day, you'll have different brews to choose from on tap because once one kicks, another takes its place.  The 16 taps are just about always different styles from each other -- one pilsner, one ale, one porter or stout, one IPA, etc.  There's something for everyone.  The staff knows their beer (some more than others), and the \"beer library\" in bottles and cans is quite extensive.  If it were just beer though, it might get old, but the food is really underappreciated by some reviews that I've read.  EVERYTHING is good (except the ravioli -- not bad, just not notable), from the sandwiches (hot sausage meatballs are awesome!) to the salads and soups to the generous and tasty fries with multiple options for toppings.  But wait, there's more!  They have daily specials which vary considerably based on the season and available local produce and proteins.  So, even though I have been going there for a long time and have eaten there probably over 100 times, I am never bored because the specials always offer something new.  Desserts are usually exceptional, though with a limited selection and number available (not made on site).  It's a weird location but definitely worth checking out if you're in the area.  The only negative is that the bar can fill up VERY quickly because there aren't too many spots.  Friday nights can be very busy at dinner, and sometimes Saturday can be a little crowded.  There is a back room that can handle larger groups, but you may want to call ahead to check on how busy they are.  There's an outdoor patio area open during the summer.  They also typically have beer tastings from a local brewer on Wednesdays.  Say hi to Dash and Ryan behind the bar on Fridays!"}
{"text":"Food was great! Had the rachel and my boyfriend had the Italian sandwich and we split the flat belly fries with gravy and peppered bacon.  Only complaint on the food was the gravy could have been a little thicker - it was very thin and watery.   The service was mediocre - our bartender was not very attentive at all.  Some of the servers were just getting off of work and it seemed like he was more concerned with serving the drinks at the bar and fooling around with others behind the bar than he was with taking care of us.  Our waters were empty for quite some time before he refilled them.  In a nutshell, my boyfriend and I kind of just felt awkward being there like almost as though we were interrupting their work social gathering."}
{"text":"Came here with three friends for an out-of-town sports weekend. Bocktown is in a forgettable strip mall somewhere in the suburbs of Pittsburgh, but once inside, it's a cozy joint with good, typical bar fare and a respectable beer list. Plenty of bottles from around the country, and plenty of rotating draughts as well.  Despite its forgettable location, an A-OK place to grab a pint with friends."}
{"text":"I used to visit Bocktown regularly when they first opened. That was the only time I have ever had a good experience. The last 4 times I have been there have been absolutely horrible and I have finally decided that I will no longer spend any money at an establishment that cannot get their act together! First, they do have a good beer selection. That is THE only thing they have going for them. The last time I was there I had their special mussel preparation for the day. Half of them were inedible as they didn't open, effectively making this a 4 mussel meal for $14.00! The sauce was practically flavorless as well.My boyfriend also ordered one of the specials that day, it was around $17.00 however all he got was a small piece of chicken with a scoop of rice that had a few almonds in it! The beer cheese was excellent the first visit we ordered it and since it has been ice cold each time. Also, service has gone soooo downhill. It's just a congregation of \"hipsters\" standing around the host stand who act like you are interfering with their gossip time if you walk through the door and ask for a table. Also, each time we have gone since our first visit it has taken our \"server\" longer and longer to come to our table. With 3 other tables in the restaurant, I don't believe it should take 15 minutes to ask \"what can I get you to drink\". And I am extremely understanding as I waited tables through college! After that experience we have never been back. I really want to like Bocktown because they do have unique drafts, however, unless they switch up their service and kitchen staff to people who actually care about Bocktown-I don't forsee us eating at Bocktown in the future. Cheers to the beer list though-it's the ONLY thing they have left going for them at this point!"}
{"text":"So I give this a 2 for many reasons. We went there for a coworkers going away party (note it's in a place where there's a lot of corporate offices). The outdoor patio was closed (despite the majority of it being covered) because of potential rain. They stuck us in this little room that was extremely loud. You couldn't hear the person next to you. They also tried seating other patrons in our area making it even more crowded and noisy, one table got up and left. The price for their food is ridiculous for the amount and quality you get. I will say the service was impeccable, she was really on top of everything and very good. The space overall is too small and not good for groups or to have any sort of happy hour. Their fries are delicious though. However, to me it's not worth it."}
{"text":"The Place to Beer!!  Craft Beer?  Check!  Burgers?  Check!  Friendly and knowledgeable staff?  Check!  Why yes, Bocktown - \"I'll Hop the World and Malt with You\"  When you walk in, you see the Wall of Beer - Coolers filled with CRAFT beer!  Yes, I am a craft beer connoisseur and proud of it!  Happiness, thirst, and hunger take over as we're seated in our cushy booth.  With the game on TV, I'm home.  We typically begin with the buffalo chicken dip - a creamy and spicy dish that I'm always thankful I ordered.  Though we have tried the fries, the wings, the fried pickles... everything has been tasty!  For an entree, I'm in LOVE with their burgers!  Cooked to perfection and juicy!  I've had their Reuben Cubed and the Grilled Chicken Salad is large in size and in flavor.  The ONLY time I didn't enjoy my meal was when I ordered Open Sesame - Sesame encrusted swordfish steak with steamed rice and fresh seasonal vegetables, set in a pool of Sweet Heat sauce.  In my opinion, their fish was overcooked and \"fishy\" tasting (I've since learned that this former Bostonian will no longer order fish in Pittsburgh - it does't meet my quality standards).  At Bocktown, I skip dessert and just order beer.  Their rotating draft list of craft beer always makes me smile.  I discovered some of my favorite beers here:  Mission - Shipwrecked, Oskar Blues - Dale's Pale Ale, even Unibroue - Le Fin Du Monde.  Their Brewers Infusion list is always interesting, as well.    As their creative t-shirts say, \"Wish You Were Beer.\"  ... and they're right :)"}
{"text":"Loved this place! My fiance and I stopped by on a Saturday night for dinner for the first time. There was a good crowd but we were seated immediately. Our waitress was very attentive and seemed pretty knowledgeable about the draft list. We started with the beer cheese which was pretty good and came with an assortment of hard pretzels and bread to dip. We both got a cup of the crab soup after reading the reviews on yelp and it definitely lived up to the hype. It was creamy and cheesy and full of real crab. I got the Cajun shrimp salad and my fiance got the sausage meatball sandwich.. His sandwich was huge and very tasty and made with really fresh bread. My salad was very fresh and a little spicy but not too much. The tomato pepper dressing was really yummy and different from anything I've had before. We will definitely be visiting again!"}
{"text":"There is nothing on the menu that is not fantastic! The food here is amazing soups, salad, sandwiches, etc. The beer cheese here though is what keeps me coming back! (Bocktown, can I have your recipe? What's it going to cost?!?) I love the fresh cut French Fries to go with. This is a must stop every time I come back home to Pittsburgh from Tampa. Oh and you won't run out of beer choices. They need to franchise and open one in Tampa! Phenomenal restaurant."}
{"text":"Remember the night the Penguins beat the Flyers 10-3 and Jordan Staal went for the hat trick? That was a darn great night, and I got to spend it at Bocktown Beer and Grill with some of my favorite people. Needless to say, that may have made me a tad bit enthusiastic for the joint.  Despite it being a playoff game night, we were able to snag a table for four without a wait or reservation. The wait staff was very friendly and accommodating, and gave great beer recommendations. With over a dozen brews on tap and hundreds more available in bottles, there will be plenty of reasons to make a return visit.  As one might imagine may happen when tantalized with over 400 beer options, I did not dedicate adequate time to study the food menu. No matter. I played it safe and ordered the Bocktown Burgher - a burger slathered with BBQ sauce, sizzling pepper bacon, fried onion crisps, and cheddar cheese. It was just as delicious as it sounds, if not more so, and was cooked to a perfectly juicy medium.  We also split desserts, a raspberry torte and a slice of buckeye pie from Signature Desserts in Castle Shannon, paired with coffee from Prestogeorge. While it would have been nice to have a few more options on the dessert menu (we ordered both items available that night), I loved being able to support other local businesses and breweries by going to Bocktown.  All in all, Bocktown's an oasis in the Robinson Town Centre big box-scape, and I look forward to revisiting."}
{"text":"We came to Bocktown tonight for their advertised \"Local Fest Farm Stand\". We have been to several Farmer's Markets and Farm Stands. When we saw that it was literally a one man show with a table top filled with produce we were disappointed. We decided to stay and eat. Inside the restaurant it was hotter than outside of the restaurant. We started with. Flight of beers and a Bocktown Board which had meats, cheeses, dipping sauces, and soft pretzel bread bites. When it arrived I was again disappointed. The meats were all cubed in bowl together and covered in a sauce. Usually the meats in a meat and cheese board are sliced and you can see what each meat is. I tried a piece of meat and that's all I needed. I was NOT a fan. I nibbled on the cheese and the pretzel bread.  I decided to try another menu item-The She Crab soup. It was as thin as water and it only had one tiny piece of crab it. It did have flavor but each bite had an overly salty ending.  At this point I was too hot and disappointed to try anything else.  The beer was very good but not sure that I would come back to try other items on the food menu."}
{"text":"Good beer selection and good food. Not much more needs to be said :) ha. Definitely should check it out."}
{"text":"My fiancé and I love bocktown.  We frequently get dinner and drinks here.  My favorite dish on the dinner menu are their chicken salads.  (Suprsingly for a bar)  Definitely my go-to place when I am craving a salad in the Robinson area.  Both the beers and the food are worth the trip. Just be careful went choosing a beer from the cooler.  These can be priced pretty high."}
{"text":"Decent beer collection and lots of micro, craft brews on tap.  The place is cozy but a bit tight quarters. If they were to expand, I think it would loose its appeal. The stuffed pepper appetizer is very tasty and goes well with some heavy brew. Given the choice, I'd be headed to the Sharp Edge Creekhouse."}
{"text":"We were looking for a place to have dinner before heading back to Ohio and I found this on Yelp. Thank you Yelpers because Bocktown was awesome! The beer selection was crazy! Like something out of a fancy grocery store. I would have liked to see a list but the \"go pick your own beer out\" was pretty cool.   We started by ordering the Pittsburg poutine. A giant helping of fries with cheese, pot roast, and gravy. WHAT?! Loved the spin off of chili cheese fries. Amazing! Next I had the crab soup which was to die for. I'm actually mad I was too full to finish it. That was just what I wanted out of a crab soup.   I only had a bite of the pierogi hoagie, but YUM! Honestly I'm a fan of pierogi on anything so I may be bias. Oh well, it was fantastic.   Our server was outgoing and personable. This was a great experience and I will return again someday!"}
{"text":"Wife and I stopped by here on Sunday for lunch and we where not disappointed. This was our first visit here. Started out with 4oz beer samples from the beer list, and the selection is pretty good, including local breweries, which I love. As for the food, I ordered the Italian stack while wife got a backdraft burger, and the food was just as good as the beer! They also have coolers with beer so if you're still thirsty you can grab a six pack to go! Will be going back for sure!"}
{"text":"If stars were based on location alone, they'd only get 2. I mean this place is in the way back of Robinson Town Center.  And the sign makes you enter a lot where the HHGregg store is but that's wrong. You have to go as deep as possible - all the way to the Target lot.  Once you finally make it to the nondescript strip mall store front and go inside, you are further unimpressed with the narrow and deep space.    But that is quickly forgotten about once you get to the bar and peruse the on tap craft beer list.  They say they have 16 always rotating beers to choose from.  I tried the Spoonwood beer and enjoyed it very much.  My friends and I sat at the bar until we finished our first beer, talking with the bartender who was very knowledgeable and able to help with choosing a beer based on our likes. We then moved to a table for dinner.  It was simply easier since we were a group of four to sit at a table.  We had appetizers, fried pickles and brushetta, which were good. For dinner I got a chicken sandwich. It tasted great.  I finished up with a Southern Tier Pumking beer.  This is an odd beer that comes with a sugar ring at the rim of the glass, the way a margarita has salt along the rim.  The taste was good at first but quickly seemed weird.  Its hard to say whether it was good or bad so I think I will stick with odd. If I have a headache tomorrow, it will be due to this beer.  All in all, it was a great time with friends, enjoying good beer and good food!"}
{"text":"We are from out of town and were looking for somewhere for lunch. Saw this place on Yelp and decided to try it. Boy am I glad we did! They have a nice selection of beers and the food was great! Definitely get the fries!!! We sat outside and had a great dining experience."}
{"text":"Constantly updated tap list and menu, awesome place to get a mix and match 6 pack to go too! The beer can be pricey but def worth it since they're usually 3-5x the alcohol content! Good food and beer, favorite spot for the fam."}
{"text":"Just happened upon this spot while searching for a new place to eat in Robinson. The Service was just Ok and even though there were plenty of open seats it took them some time to seat us. The original host said his waiter went to seat other people and then he left and some other guy was the host. he was kind enough to seat us right away.  Our bartender handed us some menus and we ordered. I got the bbq pulled pork sandwich with fries and a side salad while my sister ordered the beer cheese and pretzel bites appetizer with some crab soup and a side salad.   I chose a dressing that sounded great, pesto vinaigrette but like most places I attend it was mostly oil with all the good stuff at the bottom. They obviously didn't shake up the bottle before serving it. I ended up wasting the salad because It had no flavor. My sandwich on the other hand was good, it said it came with onion straws but I couldn't taste them on their. I had to add extra bbq as I like my pulled pork closer to a sloppy joe. Fries were your average fresh cut variety.   The beer cheese and pretzels were good as well. The pretzel was very soft and dense but the cheese came out luke warm and not hot which was a little disappointing. My sisters crab soup looked just like a bisque but had no real chunks of crab in it. i'm not sure how it tasted but she managed to finish the whole cup so i guess it tasted good.  We ended our night with two drinks, I ordered a beer(great lakes dortmunder gold) and she ordered a apple lambic beer which are pretty expensive. My bill total came to $18 but here bill was $32!!! She couldn't believe it was that high until she seen that they were charging $13 for the lambic which is $5 higher than any other place we've been to. I couldn't believe it!! I was laughing but she was very upset, it wasn't until she saw that bill that she was really ready to leave.  All in all I'd say this place is just ok, The beer prices were good if you order the right kind and my food wasn't half bad. I'm sure the other items on the menu taste great  but the service was kind of poor. The environment was kinda blah!! I prefer happy people..."}
{"text":"I only have this place an extra star for the fact that they had a Belgium beer I like. Which is rare.   Food was bland and disgusting. Asked for medium rare and got well done. Couldn't even return the burger, because I didn't think they could actually make a frozen patty medium rare.   Server was dismissive and completely lacking in knowledge.  Made it abundantly clear I'm allergic to tomatoes. So they put it on the side. (Good call idiots)   Don't know if I went to same place as the other reviewers or maybe it's because I'm out of town and this is what Pittsburgh people are used to. Then I'm truly sorry Pittsburgh.  Getting up to leave now. First time leaving under 20% in a while."}
{"text":"Bocktown was a great stop on my last visit to Robinson. They had lots of options in the drink department and have a really cool vibe. We split a couple appetizers... Jalapeño Popper and the Bocktown Board. I enjoyed the ambiance and overall it was a nice place.  **Edited my review: the owner reached out to me right after my first post. I love a place that cares about their customer feedback! Also, added a star. I'll be back."}
{"text":"Was in the area to go to dinner at Burgatory.  Wait there was to long, so opted for Bocktown. Great food and atmosphere."}
{"text":"Today I had lunch with a friend at Bocktown and it was a pleasant surprise! We were originally led to a very tight table for two and we decided to sit at the bar instead. The bartender was super friendly (and also, hilarious!) and offered tastes of various beers before my friend and I both settled on a delicious and light mango wheat.   For lunch, I ordered the salad with grilled chicken. You have several options for how you'd like the chicken flavored so I opted for buffalo sauce. I ordered mild with a side of the hot, just to be safe. Apparently it's a thing in Pittsburgh to put fries on a salad. I have an addiction to French fries, so having a few tossed on to my salad satiated the craving without any major regret afterward. Why didn't I think of this genius idea before?  As we were leaving I noticed the long wall of bottles available for purchase and there was a very solid selection. Great spot for lunch in the Pittsburgh 'burbs!"}
{"text":"For a pub place, they have really terrible fries. They were overcooked and greasy (see picture). I also ordered the Mussels Diablo and they were also equally terrible. The only reason I'm giving them 2 stars is for the good service and wide beer selection."}
{"text":"Great beer selection, beer is why you come. Good music - Tuesday night is music night.  Good pub grub.  Good & friendly service.   The Pierogi Hoagie was tasty...good keilbasa, cheddar potato pierogi, good beer kraut topped with beer cheese.  Big and filling!  Was told the soup and fries are killers but the Hoagie was to big to order anything else."}
{"text":"Bocktown had been for a while and continues to be a favorite spot for me. I've never been disappointed with their food. In fact, just the opposite. I'm always blown away by how far over my expectations the food was. My favorite are the salads. Winners. They used to have a seared tuna salad that was my go-to, but they've replaced it with a seared salmon. The Mediterranean Chicken salad was my last choice there and like I said...over expectations! Don't forget to try a burger! How does a place that usually beats your expectations continue to beat them? You'd think you would raise your bar and get used to it. Doesn't happen. Love this place. Can't forget to mention that, like their name suggests, they have a great selection of bock beers as well as the other stuff. Sit inside for or outside. I prefer in. Outside is great for a nice, sunny day, but your view will consist mostly of the Target across the way. I second Rachel C's request for a downtown location. I've never been the their other spot near Beaver Valley mall. t I'm sure it's great, but what a bad spot to be. Relocation?!?!"}
{"text":"Excellent service and food. We went during Pittsburgh restaurant week and they had great specials. We will be back again."}
{"text":"This is a really nice place nestled in North Fayette. The bar/restaurant is small, but cozy. There is even outdoor seating.  Although I am not into craft beer, they had a huge selection.  I really felt good here. Like I could come back by myself, saddle up to the bar, and not be bothered by crazy drunks. I don't say that about many places. The service wasn't great, but not terrible either. Our waitress was very nice, but not as attentive as I like. The food was really surprisingly good. I had the Italian sandwhich, my boyfriend had the Reuben cube, and we shared fresh cut fries with cheese and bacon. Both were very tasty. The Italian had thick sliced capicola, ham, salami, and cheese, on Italian bread and grilled to perfection.  The fries were cooked perfectly, but could have used more cheese. I will definitely be back."}
{"text":"As a non-beer drinker I still enjoyed my visit to Bocktown! My husband loves beer and he had an even better time at Bocktown! He was pleased with all the choices and had a flight while there.   Since I can't speak for the beer I can say that the food was delicious! I had the raved about crab soup and shared fries topped with bacon and beer cheese. It was very filling and we had fries to take home. My husband had the breaded chicken with a bacon Gouda sauce and throughly enjoyed it. The portion sizes were huge!  The staff was very friendly, from the host who was telling jokes to the attentive waitress. It's nice to go to a non-chain restaurant in Robinson, where they are few and far between. I'm glad this place is in the area!"}
{"text":"Bocktown is a pretty recent entrant to the Pittsburgh restaurant scene, but they really rose pretty quickly. Located in \"The Pointe At North Fayette,\" (near Robinson Town Centre), they came on the scene in 2007--really without my noticing. They serve up what the City Paper calls \"beer-oriented food,\" and that's a surprisingly accurate description. Big sandwiches, massive orders of fries to pair with 16 rotating drafts plus over 400 bottle varieties. Not too shabby. If you're looking for quality beer or a 6-pack to-go, Bocktown is definitely worth checking out.  I put together a fairly long review on my blog... http://www.foodburgh.com/2009/08/bocktown-beer-and-grille  Then after the new menu, I went back again... http://www.foodburgh.com/2009/09/second-take-bocktown-beer-and-grille  The first time demonstrated some challenge in finding any healthy/veggie options. The second visit came after they released a new menu that offered up a delicious (and unique) portobello sandwich."}
{"text":"Good food and a great beer list basically sum this place up.  Everyone always enjoys their meals and the varying list of craft beers means there is usually something new on tap to try.  The dishes are basic well cooked entrees that focus on one or two flavors per dish. The standouts include their swordfish, steak and shrimp entree, and the majority of their specials. All of the entrees are also a great size giving you the perfect portion of food. If you are in the neighborhood give them a try, we have yet to find something we haven't enjoyed."}
{"text":"Well what a great experience we had. Started out on a Sunday, I was with my son at a hockey tourney as he was playing the last game of the evening. Of course they work up a big hunger after the game and it was late. Not being one to enjoy hotel food too much, I Yelp'd the area and found Bocktown. When we arrived the parking lot was empty but the place was lit up and inviting. Entered and just a few \"regulars\" there but they all said hello and waved us in. The food was terrific and the cook even came out to chat for a moment. The selection of beer on tap was impressive....and tasty. It was a great place to take my son on a late Sunday after a game...felt very comfortable there and the staff was terrific. You have to try this place. My son had the bbq and i had the chicken sandwich...both perfectly cooked. .not bad for near midnight!"}
{"text":"Great food and huge beer selection.  Love this place"}
{"text":"Best place to eat when out around Robinson and Settlers Ridge.  The Strip District salad is loaded with Italian meats and cheeses; the Rueben is equally good with sweet sauerkraut, good corned beef and a dab of thousand islands, all on two buttery slices of marbled rye.  Fries are just like Grandma makes.  And the (very friendly) staff really, really know their beer."}
{"text":"Great place! Great atmosphere!  Great food for price. A little higher price but never had a bad meal. Great local craft beer selection also."}
{"text":"This Bocktown is in a strip mall that has some empty stores as of 7/2014.  So, when I walked in I was surprised to see a decent, lively, late lunch crew on a weekday.  The bartender was a good guy, gave me samples of the beers I wanted to try.  I counted 16 choices on draft.  Did not have a chance to try the food but what I saw going by looked good."}
{"text":"Once upon a time, in a era before smart phones and Yelp, a man was reading his newspaper. It was a Thursday, and in that paper was the \"weekender\". In the weekender were articles, and those articles were called \"restaurant reviews.\"   On this particular Thursday, the man read a review of a new restaurant  outside of Pittsburgh called Bocktown Beer. The reviewer went on and on telling her readers how many beers were available at Bocktown. Then the reviewer went on and on about the mile high crabcakes at Bocktown. The man reading the review got in his car and headed to a far away land called \"South Pointe.\" It was an evil land where they tore down God's trees and built a complex of stores, like the evil Walmart, and satanic McDonalds.   Tucked away, behind all the evilness, behind all the crazy people going in and out of these evil houses of corporate greed was Bocktown Beer! The man was happy!  He sat at the bar, looked around at all the beer bottles and ordered a bottle of great lakes IPA. He took a sip of this magical elixir and he was happy. The keeper of the inn presented the man with a menu, on this menu were items the man could order to eat. He saw the mile high crab cakes and told the keeper to bring him some. A little while layer, the women of the house returned with a plate with three wonderful crab cakes, they indeed were a mile high! The man was happy! He took a bite, and he noticed no filler inside the golden brown cakes the inn keeper had presented him. Just nice big pieces of crab, a bit of mayonnaise, and just enough panko to hold it together and form a nice crust. The man was happy!  After the man finished his meal, the keeper of Bocktown presented him with a Bocktown church key, an Item he cherishes to this day, a t shirt, and an invitation to return anytime. The man paid his fare, bid his fond farewell to the lady and left. I will return to Bocktown the man said to himself, as he rode off into the sunset, he indeed was happy!  The end."}
{"text":"stopped in here last week for the first time. The food was amazing. The place had a nice energy to it as well. I had the rock town burger and it was one of the best burgers I've ever had. I definitely recommend it to anyone."}
{"text":"I'm in agreement with some other reviews here. I'd always seen this place, knew they had craft beers, and wanted to go. But I think the outside appearance may have made me think it wouldn't be all that great. It looks vacated, almost like it's closed from the outside. But let me tell you... Once I got inside, both the selection of beer (especially local brews) AND the food were amazing. I'll definitely be going back."}
{"text":"Love, love, love this place. The staff is very knowledgeable and pleasant. The food is great. The price is a little high for some of the things on their menu but I'll let that one slide for they do have an awesome staff. What I can't let go is there is no place to sit or stand when there is a wait. It sucks. People stand in front of the door which makes it hard to get inside let alone get your name in at the hostess stand. Uncomfortable as that might be.... It's always worth it. Hundreds of beers to chose from, there is something for everyone! Thumbs up to bocktown! The place to beer!"}
{"text":"Great selection of beer for IPA lovers. The wait staff are good at helping non-beer snobs try something new and will even offer samples to help you find something to enjoy with your food. About the food: it's average at best and therefore overpriced. Nothing I've eaten in several visits made me want to come back for more."}
{"text":"I'm in the minority and I'm ok with that. I was not impressed at all. This is just another one to add to the list of brew pubs with bad food. It must be a requirement of them. Sure, they have a large selection of beers and the infusions are marginally creative, but their beer diversity is no different than most places in Pittsburgh. I like to call this type of beer diversity - hipster beer. Coolers laiden with IPAs of every type just screams \"hipster\" - if you like IPAs - you must be cool. Now, a place with a good sour ale - yeah, that's a gem!  The menu gets your mouth watering with things like the Roast Beef Stack - piled high with roast beef, melted cheddar cheese or their Bocktown Burger - with thick peppered bacon, cheddar, onion straws, and BBQ sauce. Which is what Mr. J and I ordered.   The wait is really long for 11:30 on a Friday and only 2 other tables of patrons. When our food finally arrives, our glowing anticipation of what was teased on the menu was quickly crushed. Let's start with my Bocktown Burger. The burger was a frozen, mass-producted patty, the cheese was some extra fine shredded cheddar and wasn't even melted, and the BBQ sauce was just ketchup mixed with mustard. The burger was served on butter-toasted Italian bread. Fail. The bread was so greasy that it was almost oozing butter. Why does a burger with bacon need more grease!? The only good thing about the burger was the bacon. It was as described, peppered and thick cut.   The 'hand cut' fries were over-cooked to the point of being hard and devoid of any potato on the inside.   The Roast Beef \"Stack\" was possibly more disappointing. The roast beef seemed to be what was pulled from the bottom of the pan. It was overcooked, overly shredded, and was more like meat mush. The cheese - again the fine shredded cheddar (??) - was so melted that it was nearly burnt and basically a cheese coaster. Mr. J's fries were also overcooked.   ...and on a sidenote....really?! Another $1.99 to add fries? So, no, the burgers don't come with anything on the side. It's just a $9 Sam's Club burger with a limp pickle on the side.   I don't know if we were there on an 'off' day with 'off' kitchen staff or what but I can say that I won't be going back to find out. As Mr. J put it.....\"I think they owe me money for eating there\". Sorry fellow yelpers, I have NO IDEA what you see in this place."}
{"text":"My second time around this joint! I absolutely love this place! So many great memories have been made here and the atmosphere and aesthetics just give me butterflies!   To drink I had the flying dog the fear imperial pumpkin beer (the name peaked my interest), a dark beer, however, very light! It was... D-lightful...   My quest to try every restaurant's chili continued here. Excellent. Spicy. Hot. Savory. Order yourself a bowl, yes, screw the cup size, you'll want more than three spoonfuls of this jazzy masterpiece.  Bocktown Chicken was the main dish I had. Chicken with Bocktown's homemade BBQ sauce topped with bacon and fried onion strings. Do I need to say more? As your mouth waters, make sure you give this place a try!  Our waiter was very nice, however, just average service. Nothing too special, but great food, great beer, and awesome atmosphere will give you a great dinner!"}
{"text":"I remember when this place first opened thinking it was so weird that it was located in a shopping plaza. For that reason I had put off trying it out. Boy was that dumb. I still like stopping in for dinner when shopping at Target. They have a great beer selection, nice menu and fair prices."}
{"text":"A solid \"meh\". Ate here with friends for the first time, and we all felt pretty let down. The reviews all seemed positive, but the crab soup was thin and weak, the seafood platter was a solid plate of deep fried with little culinary effort, and the Ruben was chewy and unappealing. Nice beer selection, but there are better pub food alternatives in the area."}
{"text":"Sometimes you just gotta veg out.  Instead of moo-ing out of course!  I scanned the burgers and was excited to see that all burg options can substitute a portobello mushroom or chicken.  Since I'm a huge fan of the bello I decided to go the meatless route and choose the Adventureland Burgher.  Included is slaw, a mysteriously sauce dubbed untouchable, pickles and onion crisps.  I ventured into this burger like I was on the run from some wild bears.  I was as ravenous as those creatures are!  I felt as if I would have done a disservice by not getting a beer (dah, Bocktown BEER).  The first option on the list screamed my name, the Lancaster Milk Stout infused with coconut.  Yinz guyz know I love coconut!  It was thick yet refreshing with a hint of coconut.  Hit.the.spot!  My friend started staring beyond me and then said, \"holy crap, it's big in here!\"  It sure is!  Great space for groups and events!  Best of all, there's a nice patio outside!  The only thing lost on restaurants placed in shopping centers is the patio view isn't the best.  Unless your idea of a view is Target (which I've been caught dreamily staring at from time to time anyway).  I will most definitely come back to try way more beer and inhale way more delish food!  I just wish it was closer to the city.  Mr. Owner, will you please open a location downtown...I'll bring you biznas, I promise!"}
{"text":"Your room. Yes, I said your room, it's fantastic! Why you ask? Well let me issue a disclaimer first by saying I have yet to see your room and honestly have not put much thought into visiting your humble abode despite it's personal charm which I am sure it glistens of.   Your room is fantastic for some obvious reasons. It has all your stuff! All of it. The things you want there as well as maybe the things you may not be so fond of. It reeks of you. Whether it is messy or clean to the teeth, it represents you in the fullest.   Bocktown Beer and Grill is your room. In the middle of a shopping plaza in an area known for suburbia...you will find your room. It's a terrific dimly lit bar full of beer choices aplenty as well as an oh so random food selection.   It's everything you want in a bar minus the live music. The best part about it is, it's a bar you would find in the city but (Hang on to something) it's NOT in the city!? Wow yeah I just blew your mind.   Like your room you will feel comfortable there. You will feel at home and you will want to hit that snooze button in the morning and stay in that room a little longer before you have to go to work despite the workload piling up....wait that's not you anymore?...whoops.  Bocktown..check it out."}
{"text":"Dine here fairly often and it's a great place to bring out of town guests--from Tulsa to The UK--to make them feel welcome and give them a taste of the Burgh. Great food, beer, and music.  Servers are generally quite knowledgeable about fare and brews and usually a great place to have some fun.  Not necessarily the best place to have a quick lunch and I really encourage them to expand into the space next door.  Also like that it's locally owned and doesn't take itself too seriously."}
{"text":"I'm definitely a fan! Bocktown has a great beer selection (both on tap and in the bottle) and the food is pretty good too! I had the steak sandwich - the bread was great, the steak was good quality, and it had just the right amount of flavoring. It looks like they have a great patio too for warmer seasons.  Sunshine, beer, good food, and good service - I'll definitely be back!"}
{"text":"Bocktown is one of my favorite restaurants, I've tried a couple things on the menu but always end up going back to the crab roll, a toasty buttery roll with huge chunks of crab with tomato & remoulade sauce on the side. Delicious! I always get fries too, great to take advantage of ordering as an appetizer with friends. Great selection of beer and servers are knowledgeable to help you find the right one. Prices are comparable to similar restaurants.  My only complaint is that Bocktown gets PACKED, I've gone in on a Saturday night with one other person and told that the wait was an hour long. I've many times driven up and when saw how long the wait was turned around and left."}
{"text":"I was scary close to giving this joint a 3-star rating.  But since it is next to a Target, it was bumped to a 4.  Why, you ask?  Because while Target and other cookie cutter strip mall squatters are soul-crushing the fun of travel, destroying unique aspects of visiting a different part of the country, and completely homogenizing regional cuisine as we know it, Bocktown is a beacon of all things Pittsburgh.  The food menu is filled with local favorites, while taking some chances with some interesting combos.  For instance, the peanut butter and blue cheese on my burger special-of-the-day; and the beer list, which runs the full ROY G BIV color spectrum of beer.  Not everything is perfect, but if you stick to the basics, everything is very good and comforting. And, of course, the people, some of the Pittsburgh area's finest, are friendly and accommodating  each time I visit.  More places like this, and I could become a strip mall devotee (orange skin and tramp stamp not included)."}
{"text":"Good beer and tasty appetizers! My husband ordered the popper dip appetizer. It was delicious! The pretzel bread sticks were the perfect texture of soft yet firm. The dip had the perfect amount of spice and flavor! They had an impressive selection of beers on draft and in bottles. There was definitely a beer for just about any taste!"}
{"text":"I'm torn. I truly went into this location knowing a lot of negatives from past visits, and we are talking years of past experiences. My husband and I basically boycotted Bocktown for their prices and lack of happy hour specials, and, for most of 2012, crappy slow service.  So, we ventured there tonight predicting a place that would produce a negative review. I was pleasantly surprised. Yes, we have our list of negatives, but our food and the service were decent. That was a nice change from years past.  1. The parking lot is a stage for a crime.  Please please please get more lighting! It's a dangerous world we're living in. The parking lot is scary dark.  2. Light up your restaurant! In addition to a dark parking lot, Bocktown has tinted windows, so you may have a hard time finding it. The neon beer signs help, but the location is just different.  3. Can't read the drink board.  I am all about the chalkboard list, but when the light is so bright that it creates a glare, what's the point? Ditch the paper menus. Waste, since they can't ever keep up with the rotation.   Positives: 1. Thanks for losing some of the pretentiousness.  2. Service was very prompt tonight.  3. Food was great. Got the \"popper dip\" app, and it was solid. Not texturally solid, just rating of \"solid\". I was very pleased.   To Bocktown, I still challenge you to offer specials. Somehow, some way, lower your prices on something from time to time. You're in Pittsburgh. That's what we do."}
{"text":"We cam here yesterday for a working outing with 13 people.  Our waiter was great and very accommodating when we asked for separate checks.  The food was very good and so were the drinks. The restaurant was the problem.  It was very muggy inside and it was also dirtier than I've ever seen it.  The bathrooms were a disaster and the back room we sat in had very sticky floors to the point that all of our shoes were sticking to ground.  It was a let down and a turn off, since I've been here several times before."}
{"text":"Bocktown oh bocktown....named after my favorite type of beer how can a place like that be a bad? This place has a lot of seafood, chicken, BBQ, and burgers on the menu and have beers for all tastes and pairings. It has delicious hand cut fries that come in flat belly and pot belly sizes and can be piled high with a large list of toppings that make them mucho delicioso.   The Beers in this place will keep you coming back with a large list of taps and a huge choice of bottled beers. There is truly a beer for everyone and even the biggest of beer snobes will be impressed with many of the selections.They even have beer tasting and food pairing events that you can attend if that's what you're in to.   The only thing I can say negative about Bocktown is that it's on the expensive side and since not drinking when there isn't an option for me I often leave with a pretty decent bill, but often good things cost good money and it's worth it in my opinion."}
