{"text":"Took my wife and daughter here for lunch and it was awesome. We got Pot stickers and seasoned fries for an app and wings and strips for lunch. The service was what made the experience even better. I can't remember the waitress's name but we look forward to coming back again"}
{"text":"They really have, in my opinion, the tastiest and crispiest version of Korean fried chicken I have ever had. I always look forward to visiting the location in Sunnyvale, CA when visiting family back home in the Bay. So I was very excited when I first learned this place was coming to Vegas. I've been here several times since they first opened and based off my own experience and seeing the other yelp reviews, I fear that Bonchon may not be around here too much longer if management/ownership doesn't make changes.  The main concern here is the value. As delicious as the chicken is, it has a premium price that doesn't match the product. When they first opened, the drums were almost twice the size of what they are now, making the price a little more reasonable. I suspect the reason for the change to smaller portions was due to the cooking time (twice-fried to give that signature crisp) being very long at first. This led to many earlier complaints, resulting in less repeat customers, the need to save money, the now odd hours/random closings, and shortages of some of the items on the menu (which they shouldn't have anyway), again all affecting repeat business. What makes Bonchon popular worldwide is the chicken, and that should be the focus. Bring back the big drums!"}
{"text":"I came in after the lunch rush so I got in pretty quick. Great service and great food.  I ordered the chicken wings soy garlic and tried the udon soup. The udon soup was really great. I can't wait until the pork buns are available. Will definitely come back."}
{"text":"I ate different Korean restaurant before this is the worst place, food taste terrible and 4 orders charged $100( price higher than the other Korean restaurants),I can tell it's not real Korean food, I definitely not go back this place"}
{"text":"Amazing food!!! highly recommend this place! Best fried chicken in Vegas! Perfect mix of spicy and sweet flavors with an hint of Asian fusion! Must try!!"}
{"text":"Just moving from the east coast Maryland I've had it many times. That's the main reason for the 4 star review the chicken is amazing. At this location it wasn't a great first experience due to the fact that I walked in at 7:40pm and they close at 8pm, as I walked in I was disappointed to hear that I can't eat in ? Since when has a restaurant said you couldn't eat in if you came in 20 min before they close. The lady in front of me also was disappointed. They told us we could only do take out and it would take 30 min to prepare; it was said in a way like they didn't really want me to order take out because 30 min past 7:45 at the time would mean they would be open till 8:15. Long story short I told them it was fine and I was just going to come back another day and they responded with a simple \"okay\". I feel that this location should work on their customer service skills a little more."}
{"text":"We ordered takeout and ordered the combo which was supposed to have 15 wings and 8 drumsticks and ordered a half spicy and half garlic soy sauce. As soon as we got home,we found that we received no spicy sauce and was a lazily thrown together mixture of wings and drumsticks.   We called and they said they would call us some time tonight and were rude about it. Then they called us back saying that the chef said that he put half and half and the labels were marked. After checking we saw that the labels were correct but there was no spicy chicken. We complained and they said to message them proof that we were lying and abruptly hung up without a sorry or any apology. If the owner sees the message I would like to inform you that WE WERE NOT LYING AND THAT YOU SHOULD FIX YOUR CUSTOMER SERVICE!!!   I do not recommend this place."}
{"text":"The service was really good! And soy garlic chicken was awesome.  Definitely will be back soon"}
{"text":"We love the garlic fried chicken wings! It's so good and our favorite! We have told many friends to go and try them. It's been the closest chicken wings from Kyochon wings from NY. We crave for them and glad we have one close to home."}
{"text":"The chicken here is good but when are they ever open is the real question. Lol  They should just have a sign that says they're permanently closed instead of \"a/c troubles\" or \"sorry closed today\"  Hope they open someday."}
{"text":"I've read the valid reviews. While looking through the the menu I started to get side tracked on the real mission. Chicken wings!  The restaurant was a little hot. Staff was friendly, but you could tell they haven't been open long as they were running around (which is okay).  I ordered the half and half. Verdict. Perfect crisp on ever wing. Juicy. Meaty big wings. My only complaint is that there are not more delicious flavors. But if it's not broke don't fix it. Best wings I've had in Vegas."}
{"text":"Ordered our food with one order of fries and order was confirmed by the server. For whatever reason, when the server punched in our order, she ordered us 2 fries. When the food came, another gentleman came to deliver our food. When we told him we only ordered one fries, he took it back. But only to be followed by the server who insisted we ordered two and kept telling us we were wrong. Food is was also subpar.  Chicken was extremely oily and japchae was too salty. They were also out on a lot ingredients so 4 items off the menu were not available.   It's a very poor representation of what korean food is and I hope people do not judge korean food based off this poor establishment"}
{"text":"Service is awesome but definitely our first and last. Food is honestly on the down side. We ordered the chicken katsu, bulgogi bibimbap and wings. Chicken katsu was on the tougher end. Bibimbap was not as good as we expected. Only thing I personally enjoyed are the wings which I highly recommend. Nonetheless, thumbs up to the servers and crew."}
{"text":"This place is good..... WHEN THEY'RE OPEN = 1-star. Went here today (Sun. 5/21) around 6pm, when clearly their hours on the door says 11a-8p on Sundays.  To the owner: Get your sh*t together. Read your Yelp reviews and see how many people you're pissing off by not sticking to your scheduled business hours. AT LEAST give us a notice before we set an expectation of eating here and before we give an effort to drive all the way down.  Tips and advice for yelpers: CALL to make sure they're open.   I seriously hope this location figures everything out, because I do enjoy the chicken wings."}
{"text":"Although the price is a little steep.  I would recommend this place to everyone.  Their chicken wings are delicious!.  I will be back for more.  Customer Service is awesome!  Thank you."}
{"text":"Easy 5/5. Great food, great service. The entire place was jam packed and our waitress, Nina (Mina? It was loud), still managed to keep us fully stocked on water and anything else we needed. They definitely took care of us."}
{"text":"This has to be one of the worst experiences that ive had at any restaurant. I am not exaggerating this review.   Service Our server was great. He had very good manners and attitude.  After we got our appetizer, it began to fall downhill. We ordered the Salmon ball and Fried Rice. Salmon ball tasted great but the fried rice had very little salt and little to no flavor.   40minutes after we ordered our 9pc combo, i decided that we didnt want to wait any longer so i payed for the food that we did get and left. What surprised me is that a manager or supervisor did not approach us to see the issue.   I will not be returning. Goodluck in the future."}
{"text":"Went there a couple weeks ago. Had seen it in NY and NJ and always wanted to try. Very disappointed. Had wings and fried rice. Both were really greasy. Tried to share with a family member but they felt the same way. So I winded up throwing what was left away. I would never go back."}
{"text":"There are a number of good places in Vegas serving Korean food.  After experiencing this place I wouldn't recommend or return unless you enjoy paying for mediocre food and service.  I would best describe this as a random watered down version of Korean Asian Fusion or whatever you want to call it.  Assuming they recently opened should they have standard time period to get things right?  If this was an independent restaurant I would give them 3-6 months at least.  This is a global restaurant chain according to their website.  Where is the training and why have they not figured it out?  Food quality 1-star.  Beverages - My girlfriend is diabetic and all you can offer is soft drinks and sweetened iced tea?  Water it was I guess.  This brings me to the next subject.  Here in Las Vegas, the water quality is http://www.reviewjournal.com/news/water-environment/las-vegas-water-safe-drink-comes-warning  If you're serving water then stop being cheap and use filtration.  Hard to enjoy your meal when you can taste chlorine in the water.   Chicken Katsu - If you are serving a child, then the server should mention the katsu comes smothered in katsu sauce and spicy mayo.  It is not cool to serve pre-frozen mushy broccoli and rotten carrots even as a garnish.    Fried Chicken Wings - For a \"fried chicken\" place, this was about 5% of the menu.  Sauce was decent as expected.  The problem was the wings we were served.  Chicken was old and eating it was a major disappointment.  Especially after the long long long wait.  Chicken Strips -  Same sauce, decent.  Hardly any sauce coating the flavorless chicken.  Chicken meat was dried out.  Nothing screamed \"oh my god, I can't wait to eat this again.\"  Rather, this was a big mistake and I should have gone to Raising Cane's for the same impact at a third the price.  Bi Bim Bap - Not sure what they did to the sauce but that was not Korean gochujang.  It was some watered down version.  Add Bulgogi (+$2) was about one ounce of tiny little bits of gristly meat.  Flavor was good, too bad there was not much to enjoy.  Overall the dish was bland.  An egg yolk missing the white was served.  Never seen that and I have always enjoyed the whole fried egg.   Service 1-star  47 minutes for 6 chicken wings.  Everything else came out one at a time during the almost hour long wait.  Witnessed one table walk out.  Witnessed food delivered to not just one wrong table, but three.  The adjacent table shared our agitation with the lack of service and long wait time.  Not even an apology, explanation or thank you.    Bottom line is that there are hundreds or more of good Korean restaurants here in the US.  So the bar is already set for great Korean food and the endless fusion dishes that can be made.  Why lower expectations to embrace a cheap but expensive fast casual knock-off."}
{"text":"I loved the wings. Meaty, crispy and great spice. Noel had a great smile as did all the servers. Everyone seemed happy to be there including the Executive Chef Luis Castro. We had been going back and forth trying to chose my wife's dinner and the result was she was served the wrong item. No problem \"We'll bring it right out\". Well, it comes quickly, delivered by the Chef! We have lived here since 1991 and I do not know if I have met a more passionate, likable and  sincere food and beverage professional. Luis even went and made a milder sauce from scratch for my wife's dinner. Very impressed with our meals and experience. Luis 5 stars!"}
{"text":"I've heard that the food here is delicious. It might be. Maybe one day I'll find out. So far they refuse to take my money. I've come twice with friends during their posted business hours and both times they were closed with no real explanation-once with a handwritten sign saying, \"Sorry, we are closed for dinner tonight\" and once with nothing to indicate they were closed other than the locked doors.  It seems like other yelpers have had the same problem so make plans at your own risk, or at least have a conveniently located alternative in mind."}
{"text":"I had a overall good experience, the staff was friendly, and the food was decent. Given that the this place is still rather new, several items on the menu were unavailable as they were currently sourcing the ingredients for the dishes. All but two \"starters\" cost a nearly identical amount as the main dishes, but were at least identical in size. The soy garlic chicken strips were super awesome but the Korean tacos were unremarkable."}
{"text":"I love their Korean tacos.  the chicken is unique.  service is good. I wish they had a little more selection on their menu."}
{"text":"For only being open a couple of days, everything was good. Some items on the menu are not yet available and some hiccups with the wait staff. But these are things that go on during a soft opening. Wings are as good as other locations I have been to but the wings were a little on the small side. It maybe a supply problem with being in a new city. But everything was as tasty as other locations. Can't wait for the official opening to try again when I am in town."}
{"text":"I ordered small combo with half garlic and half spicy sauce, bibimbob, and takoyaki. small combo was okay. I like their soy garlic sauce! It seems like real Korean Chicken sauce. but spicy sauce was bad. It's... not good.... I don't know how to explain it... it just tasted weird for me. even I'm from Korea. also, their chicken are not that good quality so, I can smell that peculiar odor.  and For bibimbob, this is reason why I wrote this review It was totally different as I expected. There's many differences as pictures on menu and real one. and It cost like 14.95 when I add some bulgogi on it. It's too expensive, and not worthy... Don't try the bibimbob here, maybe you can find it at other Korean restaurant with better quality and lower price. Last one takoyaki was... it is okay. because I didn't expected at all.  Overall, it's too expensive for everything. It's not worthy, it's different as picture. I don't think I will comeback."}
{"text":"I had the kimchi coleslaw. Loved.  The potstickers with spicy sauce - I crave these. The wings are huge and delicious.  Also liked the popcorn chicken and shrimp dumplings."}
{"text":"This place is great for friends or if you wanna do a date or just by yourself!! The Food is delicious O had the Bonchon wrap with Bulgogi!! It was off the Chain had the shrimp shumai steamed with a lunch special of 8pc boneless wings spicy!! I took my Mom out to Bonchon we both Loved it!! Food is delicious and service was great!! Easy to order and whatever you don't finish they box it up for you!! Keep up the great work BonChon!!"}
{"text":"It tasted okay but the chicken was not the best I've had, I'd rather go to Buffalo Wild Wings and order a bunch of wings. The tacos and the sliders were my favorite, I prefer the beef over the chicken on those. I might come back but it's an iffy"}
{"text":"I am so upset right now! Just got home after getting a take out order of large wings ( 30 pieces) this is my third time ordering from here and first two times were great. Big juicy perfectly crispy wings. You could tell the chicken was the highest quality. It's been about two months since the last time we ordered and boy have things changed. This order the wings were LESS than half the size, the wings were completely over fried and DRY, DRY, DRY!!!! They were barely edible I ate about 6 cause I was starving but I forced those 6 down. Ugh straight in the garbage! I'm sorry I threw them out before taking pics but trust me they were almost inedible. Never ever again. Lost this customer forever."}
{"text":"**UPDATE - we decided to give Bonchon another try after their re-opening. We were seated outside in the heat, there is limited seating inside and it was full. Our drinks arrived 15-20 mins later, the food came out over an hour after we were seated. Many of the diners around us ended up leaving w/o their food. Our drinks were never refilled. The bibimbap arrived w strips of scrambled eggs on top, instead of the raw egg yolk. The salmon ball was ok but had no sauce like was pictured on the menu. Such a disappointment . **   We have attempted to eat lunch at Bonchon twice in the past 2 weeks. The first visit both items I ordered were not available. The salmon avocado ball and pork belly sliders. The second visit they were out of the salmon, pork belly, tacos, and chicken strips. That's practically half of the menu! I won't waste my time on a third attempt. I also just noticed they are only open 11:30-2:30 on week days"}
{"text":"Have been wanting to try this place now for about a month, since seeing it open. Decided to have lunch with a friend who's business is near, so I said \"Hey, I'll grab take out from this new Korean Fried Chicken joint\"  When I walked in to place an order, the ladies at the hostess station were very friendly and warm in the greeting.  They also advised that as the chicken is cooked to order, it would be 20-30 minutes.  I was good with this, and the ladies were kind enough to offer waters, and even asked if a lemon was wanted. NICE!  The order was very simple, a medium order of strips (Soy Garlic), and two combo lunch orders (Spicy).  We did not order any sides or extras, just chicken plain and simple.  Now, I must say, this was really quite terrific food!  It might be hard to believe that straight forward chicken could be this newly revealing, but it really was.  My party and I really enjoyed every bite.  The Soy Garlic has an amazingly simple yet sweet taste, with only a hint of garlic kick.  The Spicy sauce was sweet to start, and only then did the \"kick\" come on.  And the way it'd battered(?) and cooked showed a lot of concern with giving you a first rate experience.   I read a couple of other reviews briefly, and those who complain of it being a bit pricy should probably stick with the other \"KFC\".  Bonchon definately gives you what you pay for, and I (and my party) found it to be well worth the money.  You get a lot of quality food here, plain and simple.  We are anxious to try it again, although next time will be dine in."}
{"text":"Went here on a recommendation.  The restaurant itself is small.  The customer service was excellent.  Now for the food: The potstickers were okay...had good flavor on the outside but was bland when you bit into it.  The shrimp shumai was forgettable.  The pork buns have almost nothing in them (and they charge $11).  The Japchae is too sweet to be authentic.  If there was anything good about the food, it is what they're known for, their wings.  We had both the soy garlic and spicy which were not at all mind blowing.    I was expecting a lot so temper your expectations if you do go.  Bottom line, if you want good Korean food, then go to a real Korean restaurant, and there are plenty here that will make this place forgettable.  Prices here are too much for what they offer."}
{"text":"Amazing korean fried chicken: crispy and juicy and packed full of finger licking flavor. Their sliders are worth a try as well. Just a good tasty slider that leave u wanting a 4th.   Ambiance is asian casual modern feel."}
{"text":"I absolutely love this place. As a Bay Area native, I frequented BonChon often. So when I seen that Vegas would soon welcome them, the countdown was on! Now....I sit here this evening excited and enjoying my Korean Wings and pickled radish. The taste explodes in your mouth. I'm so elated they're here and hopefully to stay! This place does not disappoint."}
{"text":"Here's the deal. No doubt the food is good here. Chicken is a crowd pleaser.  My first two visits here were takeout, and last visit was dine-in. Take out tastes pretty darn decent, but getting the food straight  out of the kitchen is an even better gastronomic experience.  I've kept my 4-star rating because of two things:  1.  My 2nd take out experience, I was missing a beverage I ordered. My fault for not checking/remembering myself, but I guess I'm not that smart. However, shouldn't they be checking the orders too?  2. Perhaps opened too soon? The air conditioning has been troublesome. Was told the other night that their AC can't keep up with Vegas heat. What?! Did their contractors think they were in the OC? Kind of a sorry excuse but that's what they told me.  As far as seating, it's pretty lame. Folding chairs and patio tables made me feel like I should've been eating in somebody's backyard, but I had to spend a lot of money for the privilege. Also, the floors were very slick on Saturday night (8/6/2016). One of my kids fell of their picnic chair.  These chairs are lightweight and in combo with slippery floors, it was like we were clowns skating around an ice rink.  Not all menu items are available at any given time. A friend went for lunch on the same day I went for dinner, and spicy rice cake wasn't available to friend but I was able to order it.  Like I've said before, the chicken is the highlight of this place. You want other Korean food? You should just go somewhere else. Waits are long now as expected. Call ahead orders would be nice and maybe a better setup for take out. This place looks bigger outside than it really is.   Staff memebers I've encountered are nice, but not yet efficient in bringing out orders. I hope they continue through their Vegas infancy an emerge like pros in the end."}
{"text":"This place was awesome! Everything we had was delicious the onion rings were really really good! The spicy was pretty hot for me but the soy garlic sauce was soooo good!! Our server was great! We sat outside the weather was perfect!"}
{"text":"Better than the location in the Bay Area.   Moist drumsticks / wings fried well with their custom sauce, which were devoured in no time."}
{"text":"Chicken pieces are WAY TOO SMALL. I've had Korean chicken before but these wings are tiny! Not worth the money you pay for a 20 piece."}
{"text":"As Woody Guthrie said, \"Left wing, right wing, chicken wing, it don't make no difference to me.\"  And Bonchon don't make no difference to me. I don't recommend this place. Truly disappointing. The first thing--that I'm still not over--is the rotting raw chicken smell that hit me as soon as I walked in. I was looking for the yummy cooked chicken aroma. We came for the wings but they were out of the spicy sauce for wings. They only have two kinds on the menu so how do you run out? We also had the bibimbap with bulgogi which was ok. Nothing amazing. Not sure how this place made the Eater list."}
{"text":"First tried bonchon when I was in the Philippines, so I was super excited to find a branch here in LV.   I originally wanted to order for take out on a Sunday, but found out through yelp that they were closed. So I called in the next day to order for pick up and was informed that they were out of drumsticks. They were actually out of a lot of the items on their menu including potstickers, takoyaki, seasoned fries and a few more that I couldn't remember. We ended up getting the lunch special which was 8.95 each for 8 wings and 6 chicken strips where both came with a free side. I was told that our order would take 15-20 min, which was perfect because our drive there was about 15-20 min and so we left right after I got off the phone. After 6 min on the road I get a call saying that our order was already ready which left me pretty upset because it would mean that our order would not be hot. Had to reheat the food once we got home and surprisingly it was still crunchy and tasty! I was really looking forward to getting the drumsticks but the strips are actually pretty great, I like how they aren't shaped like the traditional chicken strips. We got half soy garlic and half of the spicy flavor, and they were both very delicious.   My boyfriend and I enjoyed the food so much that we wanted to order it the next day. Yelp said their hours were from 11:30am-2:00pm, which is ridiculous, but when I called it seemed as though they were closed. I would definitely recommend calling this location first before you head out there just to make sure they're open. And double check to see if they are out of a certain menu item."}
{"text":"I had such high hopes for this place. What happened? Why did your quality of food go down? Why are your hours shit?   Just why. :("}
{"text":"This is an over due review. I told the owner and myself I would write a review but never got to it until now  I visited this Bonchon restaurants a few months ago on my trip to Las Vegas , shortly after their opening.  The owner personally came out  and greeted us once we were seated and settled. The food was excellent, flavorful. The service was great. Since wee were a large party of 8, we were able to sample a variety of dishes and not one disappointed us. My favorite is the hot wings. Be careful, they are really hot. We highly recommend this restaurant ."}
{"text":"Compliments to the chef. Everything looked so good on the menu that my husband and I couldn't decide on what to eat. We asked our server if they could provide a sample of the popcorn chicken. Unfortunately, the server came back and said it would be very difficult for them to just make a sample. We definitely understood. But next thing you know, we got our very own taste of the popcorn chicken (from the chef, or manager... I think). They are amazing and worth ordering again!!! The food was great and service was amazing!"}
{"text":"I'm here on Monday at 7:39 pm and they are closed?! WTF?!  Hours are supposed to be noon - 8 pm ."}
{"text":"We've been wanting to try this place forever and finally splurged tonight. I got 10 soy garlic wings and my boyfriend got 10 spicy wings. They were super crisp and perfectly cooked. The soy garlic was a little too sweet for me (kinda honey-ish and couldn't taste much garlic) and while I liked the flavor of the spicy wings the slow burn on those was way too much for me. We also got the salmon avocado appetizer and pork buns. Both tasty. Great service and friendly as well. I spilled a quarter of a beer and she gave me a whole new one. Overall it was a great meal and experience but not my favorite sauce flavors - just personal preference."}
{"text":"This place was awesome!!! Great service from Lloyd I work at a hotel and I appreciate great service when given to me. I was so happy I tipped the guy $20 it was well deserved and again the food was great. It is better than bdubs and hooters!!"}
{"text":"I never did a fine in but always Togo. The service for Togo is great. The chicken I got was spicy and it was ok. I would go back because I love chicken but it's not a place where I need to go. If it's there I will eat it."}
{"text":"Every since my trip to Seoul, Korea in April and had a specific place's korean fried chicken, i had been craving and wanting to get the same stuff again without having to return to Seoul. Hearing about a popular korean fried chicken place opening, i was excited ! After a few push backs on opening date, it has finally started to open.   I had came here on the 2nd day of soft opening to pick up food. I got here a few minutes before 12pm (opening). There were a few tables seated already.   Exterior looks huge but upon entry, its vary narrow and small. Minimal seating with a bar area.   The hostess in front had taken my order and told me it will take 15-20 minutes. A few more parties rolled in and had been seated.   After about 20 minutes, the hostess came up to the people including myself who had been waiting for to-go orders, and asked our names. Seemed like she went to confirm the orders. The other 2 ladies waiting for to-go orders said it took only 15 minutes or so to get their orders. Today, took about 30 minutes for mine. I dont know how long it took for them  I had ordered 8 wings lunch special soy garlic, 8 wings lunch special half soy garlic half spicy, and bull dak (Spicy chicken stir-fried with rice cakes in fiery sauce, topped with thinly sliced scallions, onions and mozzarella cheese. Served with white rice and steamed vegetables on the side.)   When i had opened up my order, 8 wings half n half was correct. 8 WINGS soy garlic became STRIPS. When i had ordered the wings, the hostess asked me twice if i wanted rice or pickled daikon for each chicken order. I didn't get either of these. The bull dak was smaller than i expected for the price. It was packed in a microwavable plastic to-go box, half was filled with rice, the other half is the bull dak. Fiery sauce is correct. it is pretty spicy. I like the spice but iunoe how many people can handle it. Lots of chicken and onions. maybe only a few pieces of rice cake. It tasted good overall but i expected a bit more on portion size and pieces of rice cake. Especially since its a normal menu item and not on the lunch menu.   The chicken wings sauce wise was nice. Soy garlic was sweet but not overpowering. Spicy had a small kick but nothing close to the bull dak's spicy level. The batter seemed a bit thick for my personal liking though. And the chicken itself was plain.   I really hope they can get a grip on their times and improve during soft opening. Otherwise, they'd be losing more people than having people go. Had two friends dine in today, arrived around the same time i did, if not a few minutes off, and they had to wait around an hour (or more) for their order, if it even was correct (one had strips given instead of wings as well). One of the friends had said \"i could go to a store, buy the chicken, and cook it in the same amount of time\".   As another friend suggests, the restaurant should have not allowed to-go orders during times of soft opening, or at least not the first week or so, just to get the restaurant to run smoothly first."}
{"text":"The fried chicken in the soy garlic sauce is amazing. I also had the bulgogi fried rice, it was undercooked and didn't have much flavor. I had it before they closed for a while, but it seems like a different recipe since they've reopened. I ordered take out and took about 30 mins, and my food wasn't very hot. They could be more efficient. Hostess was nice, offered me water while I waited. I'd like try dining in to see what the service is like."}
{"text":"First time eating here..chicken is very crunchy and tasty,  came in for lunch special..end up order 30 wings to go also..yummy!"}
{"text":"PATHETIC SERVICE!!! We sat down approx 6:45pm almost immediately upon walking in. Noticed people are sitting but no food on the table. After 15minutes we got our water. Roughly 30 min just to get our 30pcs of wings and took another 10 min to bring out our fried rice. I had to walk in the bar just to ask for forks. Obviously they were short staffed on a Saturday during peak hours \"really?!\" They have great Korean fried chicken no doubt but shitty staff service. So many people waited and we saw people walking at the bar just to get plates and chopsticks, other tables were not even prepared and people just sat there. The workers here don't give a shit! We walked out at 8pm after waiting for another 15min after my daughter walked up to a server whose at the bar and asked for our check. Outside 4 employees taking their break peaking inside and laughing... and the gal that serves us was there too. The staffs there ought to be fired starting from the management down. There's a lot of people needing jobs and maybe you guys can find someone who cares for their job and will give better service."}
{"text":"Took me about 15 min to be seated, as we were seated we were not given an explanation of the menu and I was wondering why there were some green and orange circle stickers on certain menu items. It took our server about 20min for her to come back to take our order after passing by me a couple of times. I ordered just a 10 piece wings, and only 2 pieces of the 10 were flats lol. The wings were not to die for, but they were good (I ordered all soy garlic). The worst part is that we had no utensils and napkins... Which then took me another 10minutes for our server to bring them out to me."}
{"text":"Best Wings ever.  I usually order to go as the place is somewhat small and there may be wait times.   Go for the Soy Garlic Wings. Their bibimbap is great too. But for a great night at home, order their 30 piece wings, grab a coke and turn on Netflix.  5/5 wings."}
{"text":"My husband and I were craving Korean Fried Chicken tonight so we found the newly opened Bonchon on Rainbow. An hour before closing, the hostess seated us and our server Manee took our orders right away. We couldn't decide between spicy and soy garlic, so we got half and half. It was perfectly fried, crispy, juicy and the flavors are sooo good! Manee made my night when she gave me extra pickled radish & steamed rice with my take out box =) Overall, it was a great experience. I'd give it 10 stars if I could!"}
{"text":"Overall, food and service were good. The one star that I knocked off was for the prices of the food and the nickel and diming of a lot of the stuff that would normally be considered standard for me.  Aside from the price, I ordered the bull dak, which was labeled as spicy. It was spicy but not that bad... for me. Nothing completely outstanding to me, but i got both chicken and dduk (rice cake) in my meal.   I nibbled on two pieces of the spicy wings. They were good. A little dry but flavors packed a punch and wasn't slathered on there... but that could be a minus for some. You HAVE To eat the wings with the daikon radish because Korean wings were meant to be eaten that way :)  My friend got the pork buns. They were ... ok. I would probably not order them again just for the fact that nothing about it made me say... this is good or this is unique...   Quick simple dinner. Expensive, but it's worth a visit."}
{"text":"That flavorful crunch into a savory soy garlic fried chicken wing was one to remember at Bonchon. This is only my second time at Bonchon. The first time I had been to Bonchon was actually on a trip to the Philippines. At that time, we had ordered spicy and garlic wings; this time, we just stuck with garlic.  We requested a side of rice with our 20 wings as well as a side of sriracha. I wanted a slight kick of spice to my wings without the full spicy flavor. The 20 wings was plenty for me and a friend. It was definitely mouth watering. What I loved is that although there is a bit of a wait to get the wings, you know that it was just made, JUST FOR YOU!   I really enjoyed every bite of these chicken wings. Now, many compare this location from it's previous versions, I never had the opportunity to try the other versions of this location so I would say from what I experience it was delicious. Plus, I'm reviewing this NEW place not comparing it to the one before.   The services was also very friendly. You can tell that the individuals working at Bonchon wanted to make sure everything went smoothly. They greeted us as we walked in and had us seated and within 1 minute had water out for us.   The location was clean and had a very cool modern vibe to it. There's a bar around the corner for those who want a pairing drink.   I'd like to definitely come back and try their other appetizers. Happy chicken winging! :)"}
{"text":"Food was great it's a small place nice service decent price as well... we ordered tokoyaki bi bim bap and pot stickers all of them are really good! Would be back for sure."}
{"text":"So I really wanted to like this place especially with everyone snapchatting about it but it was a total let down. With this being mine and my husband's first experience at Bonchon we wanted to start with the infamous wings that were all the rave. So we tried soy garlic flavor on half the order and other half plain. Our order came out pretty quick which was nice. However, biting into my first few wings I discovered it wasn't juicy nor flavorful to the extent I was addicted by any means. Sorry not sorry. Regarding the service, from the moment we walked in the host was a gentleman and he was attentive and found us a table pretty quickly considering the busy time we went. The server also was attentive. We expressed that it was our first time dining and he went over the menu thoroughly and explained what was popular and any specials. If I was just rating service we would go back but because I'm also reviewing food I don't think we will be returning here any time soon. For $13 for 10 pc wings I'd rather go to Popeye's chicken where it's consistently juicy and tasty and because it's considered fast food tipping isn't expected."}
{"text":"We were excited to find out they were making a BonChon in Vegas. We lived off this place  when  we were visiting the Philippines. Their chicken wings are off the chaaain! Tried the one here, greaaaat service. But unfortunately there was paper in my Jap-chae. Couldn't identify what it was exactly but its like chewing paper and i had to keep pulling out the inedible material from the bite i took. Told our server& he handled the situation very professionally. Won't be getting the jap-chae again, ill stick to the chicken wings."}
{"text":"I had high hopes eating here, sadly I was let down. The staff showed there inexperience so maybe more training should have been given before the hard opening. Also disappointed that a restaurant that just opened had 5 menu items dotted not for sale.  The food quality was disappointing.  The garlic soy chicken was salty, as well as the meat on the bulgogi sliders (salty) and the slider bun not even warmed or slightly toasted.  There were more items that I tried but I am just listing the two I'm most dissatisfied with because they are the simplest to create. With that said I think the cooks need more training on how to cook well."}
{"text":"Wow! Yummy! Service was great. I placed a to go order & per the hostess' suggestions, I order the drums and salmon roll. Salmon roll was too slimy for me but flavor were good. I got the soy garlic drums and they were excellent; so crispy & moist. I'll be back to try more."}
{"text":"First visit to Bonchon in las vegas (chain with outlets all over the US and the world). We had the chicken wings for appetizer (some of the best I ever had - we had 5 hot (very hot) and 5 with a different spice. Main dish was a great asian chicken salad. Great flavor and overall presentation. Service was solid and quick. Overall a great new place to have a quick meal."}
{"text":"If the past visit we stopped by here was during soft opening, I couldn't tell. Service was great. We just missed the lunch crowd so there was no wait to be seated. As soon as our orders were taken, we were served promptly. The servers were friendly and attentive.    So onto the main subject; FOOD:  Soy Garlic Wings A-  - fried perfectly golden brown, juicy and Mr B is a big fan of the breading on the skin and these wings.  Although the wings were meaty, I thought the size was a bit on the smaller side.  BiBimBap - B - Nice presentation, tasted good. But again, portion wise not sure I would pay thirteen bucks for again. I read it feeds two...well I had no problem eating up all the bulgogi.. which was an additional $2, I might add. So FIFTEEN dollars for this. ..skip it, well, unless you are dining with Daddy Warbucks.  Another issue, even though they offered different chicken combinations, I dont understand why there wasnt one for wings and strips, which I would have preferred. So two separate large orders were placed instead, Our total bill for ended up being a little over seventy dollars for chicken 40 pieces, bibimbap and side order of potstickers.  My suggestion come during their lunch hour, there is a meal deal available then.  Ambiance wise-  nice, contemporary design. I expected the dining area to be big. The building exterior makes it appear much larger.    Coming from 89012 it's not worth it for me to drive out there, especially since there's a place here that has soy garlic wings that are ono. But if you live in the area, check it out, it may be more worthwhile for you."}
{"text":"Try this new place and people say their specialty is the chicken wings. It was good but not great. I don't know if they're trying to safe money or what but it was damn HOT in there. The bathroom is nice and cool compare to the restaurant. Overall the food is good."}
{"text":"We went for late night dinner and we got seated right away but I guess we were lucky even though restaurant was busy. Mina was awesome! She explained everything and made us feel better about ordering for the first time bibimbap. The chicken wings were really good did the non spicy. Just the right amount of seasoning and batter. I only have 2 complaints- no free wifi and the people next to us who complained their order was taking long. I don't mind the complaining part but don't be yelling out you're a Yelper and they better hurry because their going to Yelp it all over. The customer got a discount plus 1 of their guest got comped.  I guess if we all announce we are yelpers we would get discounts??? Geez. We would be killing businesses!"}
{"text":"Got half and half chicken and dukbokki to go.   The chicken was fried to death. The meat was dry and scarce. I was trying to like it but it wasn't good.  The dukbokki was interesting. It had a thick, oily, clumpy consistency (I'll post a pic). Worst dukbokki I've ever tried. I didn't eat much of it since it all clumped together in the bowl... It's topped with a bunch of shredded cheese (not traditional) and it came with little rice cake and a lot of ramen noodles.   I would not go back. The food is too oily and there is no balance."}
{"text":"This was my first visit and It was pretty good. If Yelp allowed half stars , I would be leaving a four and a half but I am rounding up because of the attentiveness of the staff.  My family and I ordered a variety of things so that we could all sample and share.  Tried the soy ginger and the spicy wings. Very tasty but I can see why many of the reviews state that they are smaller than other establishments out there. Soy ginger is flavorful and probably my favorite out of everything's that we tried. Personally, I don't normally do spicy food but I think the spicy wings were pretty good. Definitely have a kick to them but in the sense that the heat acts as a flavor enhancer to the other foods you are trying.  The bulgogi is from rib-eye and while it was ok, I wouldn't order it again for the price.  Also had seafood fried rice which had an amazing amount of calamari and I would definitely order it again.  The takoyaki was average and worth ordering. Edamame also average and good to snack on.  It may help the business to serve the appetizer type dishes before the main meal comes out so people can munch while waiting on the awesome chicken. And I was a little confused initially when the waiter said the chicken was made to order and seemed to be in an extreme hurry to take down the order to the point where I felt rushed. It would be better to clearly explain that you are asking for any chicken orders to be done first because they make it to order and they want to make the wait for the food as short on the customer as possible. I didn't understand why they kept saying \"it's made to order\" and rushing people until I read the reviews about long wait times - I think they are doing it to speed up service.  Good service though with everyone pitching in to constantly refill drinks (bonus with how much fluid people go through from those spicy wings!) and the server asked many times what we thought of the food and made it a point to talk with everyone (even our kids)."}
{"text":"Yey!!!!!!! They re opened! i was soooo bummed out when i heard they were closing, my sister bought chicken for dinner, and the taste was even better!!!  you wont regret!"}
{"text":"My friend is obsessed with Korean fried chicken so I took him here. We both loved it :D  You can order just wings , drums , or strips and they come in small/medium/large sizes. You have the option to choose between spicy or soy garlic flavor or even half-and-half it. My favorite was the spicy flavor. Perfect amount of spiciness. I wasn't really a fan of the soy garlic flavor - it tasted too salty. I really dig the complimentary daikon (radish) - it had a nice crunch and sweetness to it which complemented the wings (especially since I had the spicy flavor !)  Food takes awhile to come out since it's made to order. Expect around half an hour wait , or maybe a bit less.  Service was surprisingly very very good here. Our waitress was super sweet and always checked up on us. Will definitely come back here again :)"}
{"text":"Bonchon is the buzz for today!  B is for the business name : BONCHON Those who know BonChon in Korean translation is supposed to mean the yummy FREE side dishes that come with your Korean meal. Do not be deceived by the name! They do not have any free side dishes here just the name is a go. You pay for everything you eat and for everything you drink here- water is an exception! They sell the what might be considered side dishes as entrees. If you're looking for more traditional food with a variety of side dishes this is not the place! Its more finger food, soda, and hangout food type of vibe!  U is for the unsatisfactory service from the staff except this chef from the back named : Luis Castro. Not only is he nice but seriously the only customer oriented person staff wise. I did sit at the bar with my friend, I'm not quite sure if that really designates anything but everyone else at the bar definitely seemed to be catered to except my party of two. Personally I am not a needy person, however, when other chefs come out to you and ask you how you food tastes to bringing you extra complimentary sauce to extra rice ( I'm asian free rice is a big deal) and when I have to ask for more water and possibly other sides that's unacceptable. I'm not sure if you get more catered to if you order 30 wings, which my party did not maybe you get the exceptional service. All in all, ask for Luis Castro because he is the nicest person there!  Z is for zero actual \"banchan\" which is all the Korean side dishes.  Z is for zealous fried chicken fan! The fried chicken is on point. I'm not referring to KFC fried chicken, or Popeyes or Canes fried chicken. Like the popular trend of Korean friend chicken, this place is definitely one of the better spots! From spicy to soy garlic or half and half I would definitely grab some again and again. Despite the service, the fried chicken will definitely make your bitter mouth alot more happier. I can't speak for the spicy but the garlic soy was definitely tasty and probably best with iced cold beer ! Esp. here in Nevada. Side note, not quite sure if they did sell alcohol? I didn't see any signs nor drink menu!   All in all the fried chicken was great and I'd take this food togo next time! Parking is available openly and both cash and card are taken here!  cheers!"}
{"text":"I came here in high hopes to get my korean chicken fix. They have lunch specials. They have the original style, spicy, and soy garlic flavors. I didn't get the spicy because my korean parents didn't pass me the \"able to eat spicy food\" gene unfortunately. My friend got it and said it was pretty spicy. I opted for the soy garlic and it's pretty decent. I just felt the chicken isnt as meaty as I wanted. Theres alot of fried chicken skin, not alot of flavor. Every time I bit into the chicken, I mostly got skin. There was a space in between the skin and the meat...meaning there was not alot of meat..and I like my meat lol They give you a bucket to put your bones in. They also have alot of other korean food. I didn't taste it because this is a chicken place, so uh I got the chicken. Ill probably come here once in awhile to get my quick fix (once every 6 months) but it isnt spectacular or anything."}
{"text":"Place is awkwardly set up, the dining area is narrow and it would be difficult to have a party of 8 or more without putting together the tables. We got seated fairly quick, we had a party of 6, at first we had to squeeze into a table that was meant for 4, but luckily another table next to ours opened up, so they kindly put the tables together for us. The service was amazing, our waiter Tim was very open to questions and was very attentive; his service was quick and was not hesitant to help out even with his hands full. As our food came out, we didn't get our chicken wings out first, the side dishes like calamari, fries, shumai, jap chae, salmon ball came out.   Calamari:  Tasted good, wish the breading was more like tempura but had a onion ring type of breading? No sauce that came with it  Fries: Fries were great! Well cooked and was crispy but had enough potato'y to it. Generous amount of seasoning if you like garlic Parmesan.   Shumai: This was the type of shumai you get at sushi bars, kind of a generic taste? Had this sweet sauce on it that did not compliment it very well.   Jap chae:  The noodles were perfect, taste like any other jap chae to me  Salmon ball: A very interesting dish, it was salmon filet covered in some type of coleslaw? But what ever it was, it tasted great  Bulgogi sliders:  Sliders were amazing, the only bad thing about them was that the bread was a bit dry.   A few minutes later we got our wings (half and half) The wings were good, it was juicy and full of flavor. The only complaint I had was that it was very oily, and breading was a bit too much.   We also ordered rice but it did not come out on time. So we just canceled the order. What really stood out was the chef, Chef Luis Castro. He presented each dish to us, he got down to a personal level and made us feel welcomed as if this was his own home kitchen. He felt bad about the rice so he complimented us with a fresh batch of fries and the sliders. This place has the best service, next time we'll try out the bar! But I would probably take my family out there again."}
{"text":"My family and I went to eat lunch here on a whim and the food/service was AMAZING! The noodles and fried rice were delicious. We will be back for sure! So happy we found this place!"}
{"text":"Bonchon is closed on certain nights?!   A group of hungry people (excluding my group) came looking for Korean fried chicken only to find out that they're closed before 8pm. We tried calling in, prior, but they weren't answering. We just thought, \"oh. Their business must be just booming. That's why I'm on hold.\" But turns out they're just closed on nights.   They left a handwritten note that said, \"sorry! We're closed for the night. Please come back tomorrow!\" ...   To make the long story short-- bonchon is NOT RELIABLE for dinner.  looking for a Korean fried chicken place? Try somewhere else."}
{"text":"Updating my Review to 5 stars. If you are as big of a wing enthusiast as I am then you will love it here, as long as they keep their service and wing quality consistent then you'll definitely be seeing me here often!  Tip- Get the Soy Garlic!"}
{"text":"I feel very middle of the road for Bonchon.... They weren't the best but they weren't the worst I've had either.... So it's a 3.5/5 rounded up to 4 stars... Read on to see why...:)   I had to try this place...to see what all the hype was about... The dining area is tiny so be ready to wait... But if you don't mind sitting at the bar... It was 0 wait time for me. I went on a Monday afternoon around 1pm on labor day weekend.  There was a 3 top and a 5 top ahead of me but since i was eating alone and the bar area was empty...i was able to sit and order right away.  Seating (3/5) really small dining area.  Service... Was about 4/5...i sat at the bar and the guy taking care of bar...Hyun Soo i think... Gave me water right away and walked away so that i could look at the menu at my leisure.  There menu was 4 pages long... When i was ready to order i had to wait a bit as he was busy taking care of the other guest at the bar and delivering food to other tables... The system seemed a little convoluted. They had a runner it seemed that brought out the food to the bar... And the server's would come and get it from the bar and deliver it to the table... One would think that the runner would take it out to the tables like in other restaurants. In other words, the bar area for really crowded with food sitting there for a bit until the servers could come and get the food to deliver it to their table.   That was a just side note... On the other hand, the server came by and took my order and left me to keep on checking out the menu. I ordered the Dduk-bbok-ki appetizer.... And the flavor was decent... But the sauce was kind on lumpy side... Like they didn't stir the sauce as they were adding in the cornstarch slurry to thicken the sauce. Flavor was decent... But too much sauce and not enough rice cakes. After i was done fishing out about 10 rice cakes that consisted of the dish, all i had left alot of lumpy sauce. Flavor (3.5/5) quantity (2/5) there was a little wait but the server let me know before i ordered... And for me the wait time wasn't that bad as i was not in a hurry. :)  Now onto the the dish that they are known for... Fried chicken! :) I gotta say that the the crunch on the chicken was top notch! Whatever they are doing was totally awesome! You bit into the wing and you could probably hear the crunch a mile away. Yes it was that crunchy. Texture on the coating/skin was fantastic! Crunch factor(6/5). Flavor was not as great tho. :/ I order the combination of 2 flavors... Spicy and garlic and the spicy had a mild kick... But not like you would expect... And the soy garlic did not have that strong garlicky flavor that i was wanting.  But overall, the flavors were decent. Nothing near their crunch but still decent. Flavor (3/5).  The pickled daikon was good tho. Added a crunch and great flavor. (5/5)  And on a side note...i ordered wings and received both wings and drummettes.... And i ordered wings specifically as I'm not a big fan of drummettes. :( But I didn't want to make a fuss so i kept them and I figured i could try the drummettes as well. So it all worked out. :)  Overall, i won't be rushing back as the price was a little over priced. 11.95 for about 10 small pieces of rice cakes and $12.95 for 6 wings and 3 drummettes.... I'm thinking just not worth it.... But if I'm craving a fantastic crunch for my chicken... I'll definitely come here. :)  And for a place called bonchon(Korean side dishes) to charge for bonchon was a little odd...."}
{"text":"Their chicken is worth trying. Go here next time you're in Vegas. We had Tim as our server. He took good care of our large party. Check this place out today!"}
{"text":"The service was mediocre the vibe is weird and the music sucks. It's definitely not worth the price you pay. If you want real Korean food head over to Juns! Half the price and the food is more authentic. $2.95 for Kimchee no thanks. And what's with the pickled daikon? Anyone can chop radishes and put them into white wine vinegar sugar bath. Although the seasoned fries were pretty good and had a nice crunch."}
{"text":"Love that this place is in Rainbow! Love eating lunch here then going on the other side of the 215 for dessert!  Place is a good size. Im sure they could've gotten a bit bigger and still fill it up. The waiting time was not that bad. During our first visit (Monday) there was no wait at all. The second time (Sunday)... Maybe around 15 minutes. They had a couple of electric fans because it was a little warm inside, but not too hot that people were uncomfortable.  On both visits the staff were nice. Especially Luis Castro! He's amazing! We felt special ---like VIP,actually. lol  Bonchon's wings are the best! Best in Vegas for sure. My friends agree with this too. We couldn't stop eating them! So addictive and will definitely come back here just for the wings. FRIED shrimp shumai are a must try too!"}
{"text":"Bonchon chicken is very good if you have a larger budget for wings! The wings themselves are INCREDIBLE. So fluffy and crispy and light, with delicious sauces. Their bibimbap is also good, and has that yummy crispy rice. Even though the food is good, the service is kind of lacking and the prices are a bit expensive."}
{"text":"I've been waiting for this place to re-open. I'm super excited to go back.  Their Korean Fried Chicken is awesome!"}
{"text":"Decided to stop by here since I've never been to a Korean fried chicken place before.  The chicken was ok. The garlic ones were a little bland and the spicy ones were actually spicier than I expected. I liked the spicy ones better but I wished they had more flavors. The bulgogi sliders were good but had too much sauce on it.  The takoyaki was ok too.  Mostly dough inside with some octopus. Place is clean and the service was prompt."}
{"text":"I'll give 4 starts for the food, ive been waiting bonchon to open for so long. Very disappointed,  if i can give half star for the service, definitely i will give half! We've waited for 30 min, nobody take our order, even drink. And another 45min to get my food!! Another 20min for the bill!! Are you guys serious??"}
{"text":"i read some reviews, and i guess im not the only one who noticed their management is lousy. i drive 10miles just to get to this bon chon and wait in line to be served, but its ok coz the food is soo worth the wait. butttt- its totally NOT OK to call them on jan 2nd, was told that theyre closed but will be open the following day jan 3rd at 11am-8pm. Come jan 3rd at 4pm, my family from different sides of town drove all the way there to meet us and find out  through the sign on their door that THEYRE CLOSED! definitely not ok"}
{"text":"I love the food but the ambiance feels like it's always boring and dry in that place. Closing at 8 pm isn't the best idea for someone who craves chicken at 2 am :("}
{"text":"Our first visit to the Bonchon Chicken was not the best experience. Though, the food here was great! We had ordered the soy garlic chicken, budak, and seafood bibimbap for 4 people to share. The chicken was amazing, we haven't had such delicious chicken in a while. It was nice and crispy on the outside and juicy on the inside.   So here's what went wrong..  The waiting time for the food took a long time really time, especially for 4 hungry people. When we asked for 10 pieces of chicken, only 5 pieces were served. But that's not all.. as we were enjoying and biting into the crispy wings, there happened to be found raw chicken blood hiding in the meat.  Not just one but 2!! I heard there are so many health risks when you eat chicken blood. So nasty  We told the waiter about the blood in the chicken, so the manager came out to see what the problem was.  Overall, I think we would come back, only because their soy-garlic chicken was bomb. But for the waiting time, not much. The chicken blood had us off-guard but next time we'll have to let them know to have them \"well done\". If you're looking for a place with delicious crispy chicken wings you've found the right place. Also their budak is bomb."}
{"text":"Its a Korean fried chicken place. Korean style fried chicken is crunchy and has a spicy sweet glaze on it and is their main food item. They also have Korean side dishes like japchae, fried rice, salmon ball, and takoyaki. But I recommend the seasoned French fries, they have a light batter and seasoning with a dust of parmesan cheese. The place is nice and decently sized but they are doing a soft opening right now and are only open from 12pm to 8pm. Overall 4 stars because it gets a little pricey once you start adding sides and such. Would definitely come back though."}
{"text":"Went for a quick bite and was so delighted. I had the shrimp shumai and bimbimbap (excuse spelling). I was so pleased with the flavor. Will be a regular customer. The wait staff were so accommodating and continually checked on everything. Would have been a 5 Star but I was freezing which is probably due to being afternoon and not crowded as usual. GREAT DELICIOUS FOOD"}
{"text":"The Goods 1. Known for its Korean style chicken wings the fun doesn't stop there.  These are good so light and crispy on the outside and juicy tender inside/hot; it is the chicken wing other wings wish they could be. 2. I get the spicy version but the mild is good too 3. They also do Korean delicacies of toppeuki, bibimbap, buhlgogi, etc.  there is a secret menu sometimes of kimchi fried rice with melted cheese!!  Very yummm 4. Beer presentation is fun with the \"smoke\" and various unique flavors of shochu, treat yourself to a day of Korean vip!!  Service 1. Friendly and efficient, what else can I say 2. Credit cards accepted  3. Ample parking  4. Not hard to get a table   Ambiance  1. Youthful and hip, no fluff but has the necessities in stylized form 2. Quick meal or chill with friends over a frosty beer   MoJo 1. Get those wings that put them on the map 2. Try the beer tap with lights and smoke, it's like a Vegas show LOL"}
{"text":"This week was their \"soft opening\" so the patio area isn't done and some menu items will not be available until next week. Despite not even having had a grand opening yet, they are busy!  I sat at the bar and received excellent service from the staff. Got the half soy glazed, half spicy wings, and loved them (especially the spicy ones). The spicy wings made my husband tear up though. I thought they were perfect.   My friend tried to order carry out tonight and they were so busy that there was a 45-1.5 hour wait! Kudos for them and their success, so soon after opening.   Will definitely be back soon to try other menu items!"}
{"text":"This \"Bonchon\" located in Las Vegas offers awesome eats to satisfy Asian Fusion cravings. Bonchon has really cool, trendy decor upon entrance with the wall showing huge list of main cities/countries on a wall map showcasing highlights of those places with graphics. The inside has a bar and indoor seating, along with a nice decent outdoor area which I opted for the patio.  FOOD I TRIED HERE -Seasoned Fries: seasoned and tasty! -Takoyaki: Fried octopus dumplings lightly drizzled with Japanese mayonnaise, katsu sauce and sprinkled with bonito flakes.. this was mouthwatering and savory with good texture from the flakes in the mix -Chicken Katsu: with spicy mayo on top this dish.. delicious breading and chicken! -Medium Combo: Wings and Drums.. I LOVED the soy garlic and spicy.. both equally flavorful.. I can't decide which one I like more. The fried chicken was irresistible.. great batter with a delightful crisp. ;D  Service was on point here with a sweet staff.. and server was very outgoing and nice! Overall, a great place to get some BOMB Korean Fried Chicken!"}
{"text":"Korean fried chicken, mouth watering goodness!!!! Let me start by saying im not a big fan of fried anything but my friend told me about the best fried chicken ever an TaaDdaaa!!!  Not really sure what kind of glaze they put on before frying it up but it really was incredible.   I will definitely be back!!!"}
{"text":"Talk about korean style chicken wings that reminded me of family dinner growing up back home. I have had Bonchon bookmark for sometime now just never got around too it. But I found the perfect occasion on my birthday week celebrate with family. Obviously the chicken wings is the star at this show. Funny thing is ended up ordering the japache and the bulgogi sliders. Thankfully family ordered the wings so got to try wing one. They were awesome!!! Totally lived up to the hype for me. Not only did it remind me of my mom korean wings growing up for family dinner. The style is the thing that makes it stand out. Most part the norm is chicken wings in america deep fried, different concept breading, batter, and then mix it in the sauce goes on and on. The thing that really enjoy is the sauce or seasoning been marinade can really taste. It comes straight out right from the marinade into the deep fryer (maybe dry coating) and thats it right on the plate. NO need for extra sauce. The perfect crispy skin not only from perfect cooking time, the marinade with soy or sugar gives it more depth, and gets even more full crispy skin. Be warned the meat is HELL of hot once bit in. It so good. It nice moist cooked perfect. Just addicting that want eat more....  I had full plate with two entrees. The bulgogi sliders was good. You get three per order. It nice full small size sliders. Really all the components complimented each other well. The bulgogi meat was cooked perfect and really could have bowl of the meat be happy. The japache it was solid but the least favorite dish I tried that night. The portion is nothing to complain about. NO doubt talk about hearty they have decent amount of bulgogi meat, lots of vegetables, and really if looking for noodle dish Japache solid choice. Just knowing the chicken wings are unreal good. I would stay clear of the Japache.   The service was awesome. We had big party seven everything went smooth that night. Service, never empty glass, explained the menu for half of us first timers, and asked if could split the bill into three separate checks never problem. Friendly. I like the fact on the menu every item there picture of that item. Just in case curious what it looks like get visual. Not many restaurants do that in this day and age.   Talk about tiny. Inside not many seats but they do have an outside patio area. Since summer heat not sure the amount they use it or no one asks about it. So the place can fill up quick.   Warning the $$ might be off especially if you get the wings. Honest they are kind of expensive just for wings, They come in different amounts that you can order. You're getting quality wings. It worth it!! I will be back again."}
{"text":"Amazing chicken wings and drumsticks!!! The spicy ones are probably the best ones, just a bit of kick into it. Reminds me of my days back in Okpo eating this ones in a-bit-strange restaurants. Thank you guys! Keep up the good work!"}
{"text":"My boyfriend and I were soooo excited our favorite restaurant bonchon was reopening!!! We both came in and ordered our lunch special wings. The restaurant started filling up after we arrived. Needless to say we never got to have our delicious wings because for whatever reason every single person that came in after us got served their food and we were still just sitting there with nothing. Told the waitress we were leaving because of this and all I got was a \"I'm sorry\". Quite frankly I preferred the old bonchon over this one! Everyone at the old one was super nice to us and our food was always perfect and came out in a timely manner. The next time we go to bonchon again will be when we go out of town because at this point I'm not wanting to come back to this location ever again. It's a shame because I waited months for you to reopen but I also refuse to be treated like that."}
{"text":"The restaurant needs some time to get everything truly ready for business. Smell really bad when we got there waiting to be seated, and chicken was good, but side dish was just so so."}
{"text":"I came here a couple of weeks ago with my boyfriend. It was packed and there was a little wait but nothing too long to complain about. We got an order of medium combo wings which were half spicy and half soy garlic. We ordered the seasoned fries and one side of rice.   They take a little long for the wings to cook because they are made to order. The wings are very crispy and have a good flavor. The wings were pretty big too so we got full after a couple of wings. I wish they had other flavors but the two they had was good.    So service was ok. The waitress was very nice but I can tell they are still working things out. My boyfriend asked for ranch, I know the audacity! But it took forever to get to us and we had to ask twice. They forgot my side of rice and I had to ask for that. They were very nice though and I'm sure with time it will get better."}
{"text":"Damn so I recently added Bonchon to my rotation of places to eat at during lunch and now they're closed!? That sucks!  I've only had their chicken wings, drums, and strip. Order them all spicy, order them all soy garlic, or order them how I did half soy garlic and half spicy. They were definitely good nom noms. Most times their service was good. Though last time it was pretty bad where half the party left because they took forever bring out the food and cancelled their orders. Instead of cancelling some of the orders all of them got cancelled and so we had to wait again as we had to reorder. It was tolerable and I would've gone back after this.  It's too bad they closed hopefully they reopen. Kind of craving them right now."}
{"text":"Ordered the combo spicy and soy garlic wings which were very flavorful. Spicy level had some heat but it wasn't to the point where the heat took away the flavor. The Japchae was also well flavored and enjoyable. Definitely would recommend if you got that Korean Chicken craving."}
{"text":"Very delicious!!  Will come back again for sure!!  There two flavors.  Spicy and soy garlic which was very good.  The only thing I would order different is more sauce.  Tried bulgogi sliders, japchae, and fries which were ok but I would go ahead just for the chicken.  Service was very good and helpful."}
{"text":"First time visiting since they opened back up. We got a medium order of half and half wings and an order of japchae. Excellent service, our waitress was friendly and welcoming, our drinks were always filled. The food came out quickly, and it tasted delicious!"}
{"text":"I have been eating Bonchon from 2 different countries in Asia and I LOVE it. I can't tell you how happy I am when I heard that they will open in Las Vegas.   Even some menu are different from what I ate in Asia but the taste of chicken is the same - super delicious!!! Soy garlic chicken never fail me. I wish there would have chicken breast and thigh to choose like in Asia  Only 2 points that made me hestitate to go back there are.... 1. The price is too high for Las Vegas. Small size order (10 pcs) is 12$, Medium size(20pcs) is 22$ and Large size is(30pcs) 31$. Average price could be 15-20$ per person.  2. Service is way too slow.  30mins waiting for table plus 25 mins waiting for food. I saw many people left while they were waitng for their table.    I might go back there for chicken once a while (may be next 3 months) but next time I will take out, instead of spend 1 hour waiting."}
{"text":"Was very disappointed in this place.. First off, the staff was pretty nice but the food... Ok let me start with their $7 seasoned fries. The flavor was good but the fries were soggy. Blah. The chicken wings...I had a half n half order of their spicy n the garlic. Both were really sweet n the only difference I tasted was spice. The garlic ones were barely garlicky. Oh and the most disappointing thing was their steamed rice. Now I like fried chicken with a nice bowl of soft steamed rice. Well their rice was hard and undercooked and cold. BLAH! I was so hungry I ate my food but prob won't be back. I also tried their chicken katsu, very dry. Def was not worth the $50 I spent.  Oh, and those fans...blowing all over the place! Yeah I don't like my hair blowing in my face while I eat. So uncomfortable"}
{"text":"Service was great menu had good amount of selection.  I was looking forward to try Korean marinated chicken but it was totally off.  I will return to try other dishes 7/10"}
{"text":"The first time we came here, we ordered for take out. We order 30 pcs wings half/half. That was half soy garlic and half spicy. The spicy was good, but I could not get past the spice after the 2nd wing I had. I couldn't take it like my husband is who's just G'd up from the feet up when it comes to spicy food.  The soy garlic fried chicken, however, is what keeps us coming back. The perfect crispy wings and flavor with some white rice and kimchi. Soooo gooooood!!  ------ Update: We come back here at least once a week. Sometimes for dine-in, sometimes for take out."}
{"text":"This is now open. Great place for lunch. Food was great before but then it closed down. Not sure what happened but after speaking with the waiter he said they reopened under new management. Unfortunately you can tell it's not the same. Didn't have the same great taste as before.  4 stars for the service but food lowered it to 3. Hopefully in time the quality will return."}
{"text":"I enjoyed this joint right here. The ambiance is very chill and seems fit for those looking to have a kickback with family or catching up with some friends. The chicken is good, and I think the sauce they add to it gives them a good kick. I wouldn't recommend eating this all the time (obviously) as it will make you feel full fairly quick due to the fact that is it is a fried food joint. Overall, I was satisfied and was pleased with the customer service."}
{"text":"First of all I loved Bonchon and was so excited that they finally reopened but since they just reopened the food lacks its normal flavor. The customer service here is the absolute worst, we paid $51 and we waited 40 minutes to get our food to go and when we finally got it we checked the bag and the order was wrong. We ordered the large chicken fingers but instead we got the medium chicken wings. We went to the host and asked for them to correct the order so she grabbed the manager (the Asian lady with the light brown contacts) and instead of being nice and help make sure we got what we wanted they were talking down to us saying it was our fault and that we were lying. All we wanted was to get the food that we ordered and did not mind waiting but the fact that they were so rude and demeaning turned me away from this place."}
{"text":"Love love love the wings here. I suggest getting the half spicy & half soy garlic wings. Each wing dish comes w a complimentary side of pickled radish which pairs amaaaazing w the chicken. The bibimbap and Korean tacos are also up to par.  I had to deduct one star for the wait time and the customer service. The servers still seem to be learning their roles and the wait time is extremely long for a plate of wingettes. I will say though that all the servers and hosts are extremely nice and welcoming. Also when ordering takeout be prepared to wait for an hour... I'd have to say though that the quality of the food makes up for that missing star. I'll give them time to work out their kinks!"}
{"text":"You guys...  Bonchon is back... AND IT'S GOOD NOW.  Not to say that it wasn't good but if you're like me you remember eating here last year and thinking, wow this food is really awesome, but WHY OH WHY is the service so terrible.  Well, they're back open and wow, what a world of difference with the service. The staff is wonderful, we ordered a lot of food between 5 people. With appetizers and everything, the food came out promptly and without error. I know that's not saying much, but again, if you ate here before, you know what a shit show it was.   Not much needs to be said about the food, it's korean fried chicken and it is really, REALLY delicious. Lightly breaded and fried with 2 sauces to choose from, and apparently now they have boneless wings too.   If you haven't eaten here before, it's a definite must try to delve gently into the world of korean cuisine.   And for those that HAVE eaten here when it was under the old management, GO!"}
{"text":"I don't think I will ever come back. The Korean tacos tasting like something a high school kid could make at home with frozen Tyson chicken. The Bibimbap lacked any flavor what's so ever, tasted like air. The soy & garlic chicken wings was the tastiest thing I had, but it wasn't enough to bring me back again. Majority of the food was cold after 2 minutes of it being on our table."}
{"text":"About a week ago, a coworker mentioned this great new chicken place on South Rainbow I had to try. He said it was supposedly some of the best chicken in Vegas and they have a cool Asian menu. When posed with the question, \"how about Popeye's,\" I jumped at the chance to mention Bonchon and it's crunchy chicken.   This location is on South Rainbow near Sunset in a plaza with other busy eateries. The decor is was modern and we were seated immediately. Although I was really tempted to try their Asian menu, we were looking for chicken, so we got chicken (popcorn chicken and strips) along with seasoned fries and onion rings.  Everything was served as it finished, so it came out staggered, but we were ok with that. The onion rings came out first and they were nice and crunchy (the most important thing, in my opinion, to a great onion ring). Shortly after arrived the popcorn chicken, which was drizzled with a sweet molasses sauce. They were good, but the strips, which came a moment later,  were the real stars here.  We got 1/2 hot and 1/2 in a soy-garlic type sauce and they were really great. Nice crunchy batter, but not too much breading. The hot was really my favorite, with a sweet bite at first, leading to an intense heat. The seasoned fries were very good as well.  We will definitely be back to Bonchon. Their chicken was excellent, next time we will order some bone in and strips instead of the popcorn. Their Asian menu looked great as well, and as we saw the other table's food being delivered, we both agreed we would order their Korean fare in place of the fries and onion rings as accompaniments."}
{"text":"Very good customer service! The food is great as well, chicken is crispy on the outside and juicy on the inside. Their two main sauces are very tasty, if you like spicy food go for the spicier option but if your tolerance for spice is not that great go for the soy garlic. Both of which are very good! I also recommend their chicken popcorn, it was their first time serving it today and we were the very first customers to try it. I highly recommend them!  I will definitely come back for more!"}
{"text":"Food looked amazing so I decided to check it out for my lunch break. Was able to get seated right away which was great. Unfortunately, after giving my drink order, it took about 15 minutes for the waitress to come back and take my order. Once the order was placed, I waited about an hour and still did not receive my food. It is around that time I noticed another table complain about their wait.  As I had to get back to work, I had not choice but to cancel my order. I did try to see if I could get my food to go and just pay for it. But at that point, it was still taking a while to come out.   This was a disappointment as the food did look good for the tables that were eating. It appears this restaurant has not been open a long time as it still has the \"Grand Opening\" sign up. Hopefully they can iron out their production issues and get food out in a timely manner. But I will not be returning.  This is also my first Yelp review :/"}
{"text":"This place is so good when it's open. But it's always closed! I'm not wasting my time getting excited to go anymore and driving all the way out there just to find out it closed :/.... update your hours bonchon..."}
{"text":"Super Disappointing. I have been waiting to go here because they just recently opened back up and it's close to my work. A few of my coworkers and I went in and I got the boneless lunch special with rice. It was a way to Breaded and was definitely more breading then it was chicken. If you are going to go here I recommend getting the drums or the wings because at least it will taste like chicken. Fair warning the spicy is really really spicy and if you've never been there before and they forget to tell you you're going to be shocked. Also do not expect any customer service. I might've gone back to try the other chicken, But the customer service was so horrible I will never return. Had to ask for everything three or four times, they were stingy with everything from napkins to ranch and it's just not worth it."}
{"text":"Delish! I loved their chicken strips  They were crispy on the outside and tender in the outside. I got the half and half and it was better than I expected.  When you order you can also tell them you want the chicken wet. So they can put extra sauce.  I will definitely be back!"}
{"text":"I'll make this review short. Here are my experience while I'm dining in.  1. Service is good.  2. Price- it's a little bit pricey on what they offer.  3. The moment you were seated until they take your order, well for us it took at least 15 mins. And it's not busy when we came in.  4. Food- regular fries are a kinda addicting.  Chicken- soy garlic flavor- it's ok but I've been to a different Bon chon this location they don't coat their chicken well. Spicy flavor- it's not that spicy but has a kick.   Over all I would comeback but I would prefer to go instead dine in, since the service of getting the food takes forever.   Shout out to our server Carlo! He's very enthusiastic and very fun. Keep up the good work young man!"}
{"text":"So if you are craving Korean fried chicken this is the spot to go. Little pricey on the wings but the flavor will not disappoint. I have had spicy and soy garlic, however I would recommend soy garlic. Try them for yourself and you decide. Overall great experience, staff was ultra friendly, parking was easy. I'll be coming again."}
{"text":"Had the Takoyaki and standard Korean Fried Chicken drum sticks with garlic soy sauce. I've been to the Bonchon in New York, Fairfax VA, and Woodbridge VA, and comparing this one to those, this Vegas location doesn't quite live up to the reputation. It's not bad but not quite as good as the other locations."}
{"text":"This place should be called \"Bonchon-Katrina\" because it is a DISASTER! From the moment I walked in, the hostess appeared completely frazzled and confused. There were 2 tables ahead of us and they said it's a 45 minute wait (Sat Aug 6th around 12:30). How is that possible? Walking to our table, the floor is greasy and very slippery! Gross!!! There are many items not available on the menu. The service is horrendous. Once we placed our order, the food expo guy was sending food to all the wrong tables (including my order). I see the server explaining to him how the tables are numbered.   Meanwhile, we've been sitting their for 20 minutes, food being delivered to all the tables but ours. I know that the expo guy sent my order to the wrong table and when we saw chicken order after order coming out but not to us, we walked out and left. :( We were so hungry but was not going to deal with this any longer.   This place has a lot to work on. Staff all walking around like zombies and \"chickens\" with their heads cut off. The hostess needs to learn guest recovery and the staff just needs to give a shit. The manager appears to avoid conflict and eye contact.  On a positive note, the water we received was on point! :)"}
{"text":"Korean fried chicken is impossibly tender with a crackling crisp crunchy coating and spicy, garlicky, savory-sweet sauce.   I'm not a big spicy fan, so I ordered \"half and half\" - which is a combo of the spicy gojuchang sauce and the garlic soy sauce. Beware- \"Korean spicy\" is off the charts spicy compared to American wing places.   Your tongue and lips will go numb so try the half and half first before venturing into gochujang-only territory.   The wings took a while to come out, but everything is cooked to order."}
{"text":"We came in on a Thursday night, and they weren't that busy so we got seated right away. We ordered 30 wings, half spicy, and half glazed.  The food came out a lot quicker than I expected, the other bonchon chicken that I went to in Santa Clara, took almost 30 min for the chicken to come out.   The spicy chicken here is surprisingly spicy!!!! It actually leaves your mouth tingling, and your lips burn.  The other spicy chicken I had at the one in Santa Clara wasn't spicy at all, so I was so happy that this place was actually spicy.  The soy glazed is lightly sweet and salty and delicious if you can't handle the spicy one. We also ordered onion rings, the onion rings were huge and beefy.  The pickled radish that the chicken comes with really helps to complete the dish, otherwise the chicken would feel too heavy.   The people whom work here are really friendly, and the owner was also at the restaurant as well. Pricing is great, and they also have tons of other options if you don't want chicken."}
{"text":"I live on the Southwest side of town and couldn't have been more excited about another Korean style restaurant opening up so close to home. We finally had a chance to stop in last night to give it a test run on the wings, Korean tacos and japchae.  This place did not disappoint but in fact exceeded our expectations. The chicken wings were amazing with the perfect crunch factor and spicy flavor. It was not drenched in sauce like so many other wing places. The Korean tacos were a huge surprise. They where filled with bulgogi, picked radish, coleslaw, and a wonderful spicy dressing which was to die for. Simply delicious. The Japchae was also amazing and the portion was very generous. This has now become our new favorite Korean place to enjoy not only the best chicken wings in town but some of the yummiest Korean side dishes when that Asian craving hits you. For me, that's all the time."}
{"text":"We have been waiting to check this place out, finally got the chance the other night.  Ordered 30 wings to go, half and half as well as an order of chicken strips and tteokbokki.  We were told it would be a 20 minute wait which was fine, the wings were prepared to order.  There are 2 types, the soy-garlic were good, not great and so was the spicy.  Don't get me wrong, it was good just not something I'd go out of my way for or worth the price."}
{"text":"Freaking best chicken wings I've ever had. I love the spicy wings so much but the soy garlic is really yummy too. We also got the seasoned fries which were delicious!!! They had like parsley and Parmesan cheese and they were flakey and crispy. Full of deliciousness. Then we also tried their bulgogi Korean tacos which were yummy. But the wings is where it's at.   We came during Friday afternoon, it was kinda slow. They said they just reopened up after like a year of being closed 3 weeks ago. Inside is a lot smaller than what it looks like too. It's not super busy, only a few p but the less busy the better the service. And the girl was very friendly. Spent like $45 for the two of us. Not too bad, but the food was worth it.   Came here another time and the food was just as great and the service was absolutely amazing. Everyone is so friendly and helpful. Tried the lunch special this time, chicken strips, and they were delicious. Also tried the pop stickers half and half and it was amazing. I can't get enough of this place, it's so freaking good!!!!!"}
{"text":"Still no alcohol license when we went but that wasn't a big deal. Because of the fires in the cajon pass they couldn't get their shipments. Lucky for us they gave us the big drum sticks. The waiter made sure we understood that so we wouldn't come to expect that the next time we come in. The chicken was okay but the shining radish was the star of the evening. Unfortunately the duk bokki (spicy rice cake ) was a total misfire. It smelled something was spoiled. The rice cake was mushy. Because of this I have to give 2 stars for passing off spoiled food. The service was superb."}
{"text":"Great chicken. They have not lost a step from their NYC roots. The staff is wonderful and and their wings have the same spicy kick that they're famous.   My only request would be to please open up a location in Chicago. ;)"}
{"text":"Tried this yesterday while in town. I saw this on  another yelper's page so I had to try it. I love chicken and am always looking for a new chicken place to try.  I've had great Korean chicken in Santa Clara and have not really found a place like 99 Chicken up there but Bonchon came close.  I ordered the small combo: 6 wings and 3 drumstick s got both the spicy and the soy garlic flavor. We also ordered the salmon avocado ball. The food did not take long at all. Ahhhh chicken was so good!! I can taste the garlic on the chicken and oh boy it was spicy but I love spicy! I don't think I got enough chicken.....the salmon was seared and covered the avocado ball. Delicious! Must come back for more chicken before I go back to San Diego!"}
{"text":"Nothing like the Korean Chicken places in the Bay Area but delicious nonetheless.   They added a couple of lunch specials which I believe they didn't have before. Around $9 for 4 wings and 2 drumsticks and a choice of side. Great deal!   The chicken was crispy and juicy. I always get the spicy. It has a little kick but maybe not that spicy for those who really love the heat. Garlic soy is kid friendly. It's flavorful the way it is but something I wish it had had more sauce.   I like how in the back of their menu it explains what the item is and even phonetically spells it out for those of us who are unsure how to pronounce things. You get good food and learn something!"}
{"text":"Service was good in the beginning, for a chicken place you would think they would give you napkins, had to ask for napkins, and more tea each time, food was good,  pretty cheap on their chicken quantity, waitress was slow, the front lady checking ppl in had to bring our refills,  won't be going back but glad I tried this place and better because not returning"}
{"text":"Came back for lunch and noticed that they have lunch specials from 11:30-3. We got there around 11:50 and it wasn't very busy. We each ordered a combo (4 wings & 2 drumsticks) for around $9 along with onion rings to start.   Service again was great but this time food came out VERY quickly. We ordered the onion rings as an appetizer but it came after our chicken. The chicken wasn't hot when it came out. It was also disappointing to see that they were a lot smaller today's visit! The chicken was more \"seasoned\" this time around because of the size and kind of on the dry side. I'm not sure if they make it batches and let it sit. I ordered the half & half this time and the spicy was definitely SPICY! I couldn't finish the 3 pieces I had because my mouth was on fire. I think the chicken here is a hit or miss but will be coming back during dinner time when it's busy to ensure fresher chicken!   Oh, and onion rings were 5/5! Super crispy."}
{"text":"Me, my brother, and my cousin decided to try out a new restaurant and since it was my cousin's birthday, she decided to come and dine here.   We came to this restaurant on May 2, 2018 around 7:04 p.m. At first I thought this restaurant is probably the worst since we were the only ones dining in but it was good. We were greeted and taken to a table. Since this restaurant is new, there's a new construction smell if you know what I mean.   It took us a few minutes to order since they didn't have that much menu items available for customers to order.   We ordered: - Seasoned Fries - Combo Large Fried Chicken (Spicy and Soy Garlic)  All three of us were very stunned while eating the food. The seasoned fries tasted so seasoned with a little bit of garlic and perfectly fried up to bite in our mouths. As for the fried chicken, PERFECT! We were all shocked it tasted so good and so crispy to eat. For the spicy flavor, they weren't kidding when they said \"Spicy.\" It was actually spicy we all had to drink water to hydrate ourselves and get the spicy out our tasting system.  Overall the food was good and the service was great but I was hoping more menu options and flavor options also."}
{"text":"I've been to several Bonchons up in NYC and D.C. And this one is great! A lot of things can go wrong with a newer location, but I'm glad that this Vegas location is consistent with the others. I'll be back soon!"}
{"text":"Had the one in daily city and I liked it so decided to try it out here.   Service was good.  Fast.   Got japchae and it was okay.  Kind of pricey for that item.  Got some onion rings and they were good.    The chicken was great.  Breading was solid,  moist,  and the flavor was good.  Got the half and half and it was spicy for me.  Had to keep eating japchae. The chicken pieces were also filling so that was  a plus.     Overall I would come back just for the chicken.  Maybe I'll give their salmon a try next."}
{"text":"Even after the re-opening this place once again falls short on service demands and expectations.  We sat out in the patio and in an hour only our fried rice came out. None of the 30 chicken wings or 15 drumsticks, not even the taco, and the other fried rice. 1 hour.... and all you could bring to our party of 8 was 1 plate Bulgolgi fried rice. Smh this is such a very big disappointment coming from you. I guess something's will never change. Nice try on re-opening but if you keep at this rate of service, I wouldn't be surprised to find out that you're closed.... again."}
{"text":"Stumbled across this place when I was looking for new places to eat off Rainbow.  Took our order of 10 wings and 5 drumsticks to go and it was still delicious when we got home!  We had a split order half spicy half soy garlic.  Perfect mix of sweet and spicy!  The best part?  The chicken was still good the next morning for breakfast!  A few minutes in the toaster oven and it was still crisp and juicy!"}
{"text":"Lunch special wings and lunch special seasoned fries.  Got the wings half & half (spicy & soy garlic).  The wings were SOOOOOOOOOO good!!!  The spicy is pretty spicy.  I have a high tolerance for heat and I definitely experienced some spicy.  For most people, I'd say you will find the sauce to be quite spicy.  But besides the heat, you get a nice sweet and tangy flavor as well.  The soy garlic was very tasty.  I think I like these better than the spicy.  The sauce is sweet without being too sweet.  I feel the spicy is sweeter than the soy garlic.  Just thinking about these wings are making my mouth water.  The seasoned fries were probably the best fries I've ever eaten.  They were on the thicker side and tasted kind of like soy garlic wings.  I can't quite explain it, but you must try these fries.  I really want to go back and try more items.  I can't wait until they start serving alcohol.  This will be my new hangout!!"}
{"text":"I love their fried rice and ofcourse the chicken wings.. Their fried siomai is good too! Everything in the menu looks good.. The service is fast and staff are so friendly.. My new favorite place"}
{"text":"I'm the biggest BON CHON fan. I constantly crave their spicy wings and hubby always gets the Bulgogi. But during this visit, BULGOGI took a long time getting to our table, so we expected it to be sizzling or fresh off the grill, at least. Guess what? one part was cold and the other side was slightly hot. I guess their microwave is broken. Our $20 microwave does better! Oh well. If they microwaved the damned thing, why did it take too long? Did they need to defrost the frozen bulgogi? Still the best Spicy Fried Chicken in town, though.  Sadly, this is the only BonChon in town. :("}
{"text":"Just called in to make an order for take-out (915pm 9/9/16) The lady that answered stated they were closed already. Strange, because on their website and yelp it's says their business hours are noon-10pm. How disappointing. Either they need to update their information or employees are lazy. :-/"}
{"text":"This place sucks. I came in solo from across town just to be denied seating. 4 empty tables that seat 4 people, but because i am just 1 person they want me to wait for a table to open up. No thanks rude hostess. Manager seemed apologetic over the phone, but still rude. Don't come here alone. One of the most embarrassing eating experiences."}
{"text":"Bonchon just reopened and as expected excelled in the chicken wing game.  Crispy yet not greasy, crunchy yet not overly fried. Couple that with soju for less than $11 and some Korean tteokbokki and the meal was great.    Though the chicken wings were the best I've had in Vegas, the rest of the meal was just average considering there are actually a few really good Korean spots in town, especially in the Spring Valley area.  The tteokbokki was too Americanized for me with too much cheese and not enough spice in their sauce.  Even the wings were mellowed when we asked for extra spicy and got a mild at best.  Taste-wise was fantastic but they need to up their spice game up.    I really like the vibe of Bonchon with a nice selection of beers and a lot of TVs considering the size of the restaurant.  I would surely come back for some takeout or to watch a game, especially at 10 wings for $13 and other good deals on wings and entrees.  But in my opinion, just stick to the wings and the soju.  Open until only 10pm is tough as chicken wings are a late night must, but definitely still worth a trip.  Good service, good wings, enough said."}
{"text":"One of the best fried chicken wings ever! No heavy batter and no dipping sauce necessary ! Great alone !  Highly recommend - smaller size Restuarant so beat the rush."}
{"text":"We stopped by to try their deep fried chicken wings, sampling both the spicy type and the soy-garlic type. Since we just wanted to sample the chicken wings, we got them to go. The hostess was actually very helpful and kind, even asking us if we wanted water while we waited.  All in all, the chicken wings were deep fried very well. The crust was on the more robust side, thicker than the typical chicken wing that you might get at a bar. It almost reminds me of Honey's Kettle Fried chicken, though not as thick as Honey's crust. Of the two flavors, we like the spicy one better as it had more flavor. It was sweet, savory and spicy, tasting very much like the wings had been tossed in gochujang (a Korean spicy sweet paste), however their description notes that it is tossed in gochugaru, a pepper powder, but likely with the addition of some sweetening agent. After tasting the spicy chicken wings, the soy garlic chicken wings were completely underwhelming. It was difficult to discern and soy sauce or garlic flavors because our taste buds were overrun by the spicy sauce.  All in all, we are fans of the spicy deep fried chicken wings, both in terms of flavor and how good the crust is. Because they overwhelmed the soy garlic chicken wings, it's difficult to comment on how good the soy garlic wings are. If you are going to try both, I'd suggest that you give the soy garlic a taste first before trying the spicy wings."}
{"text":"They will be officially open on wednesday (04/04/18) They had a Soft opening last wednesday (03/28/18) It was pretty good to taste bonchon again!"}
{"text":"I come here so much! That should Tell You how good the Korean fried chicken is!! Be careful ordering the spicy one. It's so hot you might not handle it. I like hot but this was heat I couldn't handle. But soy garlic for sure!!"}
{"text":"This place was awesome!  I loved their Korean tacos.  So flavorful!  Oh and the wings were super delicious.  I will definitely be back.  This place is worth bragging about!  Must try this place folks!  You won't be disappointed!"}
{"text":"I visited this restaurant for lunch as I had heard only good things \"Oh, you live where? You gotta try Bonchon!\"  And because I like Korean food and love bon chon, I was looking forward to a seaweed salad, marinated tofu, shallot pancakes, or whatever bon chon they would have.  So I was extremely disappointed when they didn't...womp womp :(  Turns out this restaurant is known for their Korean-style chicken wings.  I looked it up and Korean-chicken wings are called Dakgangjeong. That's what this restaurant should be called, Dakgangjeong.  Alrighty, so because I couldn't get what I was hoping to get, I ordered a lack luster Bibimbap with bulgogi and store bough fried shumai. :(  Have you ever gone to a restaurant craving something only to find out they don't have what you were craving for? Don't you just leave completely unsatisfied even though you're full? Well, that's how I felt.  The one thing that is keeping me from giving this restaurant a 1-star is the customer service. The customer service was fabulous."}
{"text":"Ordered take out.  Had this once before and loved it so I craved it again.  Ordered the mix bucket ( 8 drums 15 wings) for me and my boyfriend. We didn't realize how much we actually ordered because we couldn't even finish it!  We also ordered two sides of steamed rice. The wings were all spicy flavor which was crispy, juicy and DELICIOUS! I just wish there was some sort of ranch or cream sauce to dunk them in because it needed some balance with all the spice. Love this place, one of my fave chicken places I would highly recommend you try this place. I'll have to venture beyond their chicken some day and see how their BIBIMBAP ( sp?) is !"}
{"text":"I'm giving this Bonchon 4.5 stars, but will round up.   I thoroughly enjoyed the Bonchon located in Richmond, VA while I was in medical school, so I was excited to hear that there was one in Las Vegas (since there are none in SoCal). This location is also fairly close to my home!  The restaurant is not that big so not too many seats, though they do have some outdoor seats as well, which we opted for to minimize wait time. If you sit outdoors, they have a cool misting fan that also plays Bluetooth music.  Service was EXCELLENT, and we were checked on frequently. My water NEVER stayed low for too long, and the head chef actually came out to personally introduce himself to us. Service was noticeably above average; clearly, the employees have been trained well.  As for food, the menu is a bit different than what I had back in Richmond, but the must-have fried chicken is still there. I will say that the crust \"shell\" of the chicken was slightly thinner here than what I've had at my previous Bonchon location, though it is still extremely crunchy and unique compared to fried chicken elsewhere. We also enjoyed some calamari, seasoned fries, and bulgogi tacos during this visit. We asked for a side of spicy mayo, which paired perfectly with both the calamari as well as the seasoned fries. As expected, Bonchon executes deep fried dishes very well.  Prices are fair. I highly recommend coming here for some unique fried chicken!"}
{"text":"I was so excited to get bonchon because they finally opened again. So I went there with my bf and we ordered the medium size wings and a side of season fries. We got our fries first so of course we ate that but I wanted to slow down and save some room for the chicken. We ended up finishing our fries while waiting for our chicken and there were two other groups that sat down. They ordered their food and like 15 mins in they got their food. And I'm sitting there like how did they get their food first when we sat down and have been waiting for ours. So I let it slide and decided to still wait. Then there was people that came in and they ordered to go. Still waiting for our food and all those people that waited for their to go food got theirs. That kind of crossed the line for me and didn't want to stay anymore. So all we paid for was our fries. It really saddens me to have to write this review and to give a one star but that's just ridiculous."}
{"text":"Horrible service! Food was not great either. Our order did not get to us at the same time, Spend your money at a real Korean restaurant!!! I think I should get a refund!!!!"}
{"text":"Kind of feel bad giving a 1-star review but I think whoever owns this franchise deserves it. First off, I didn't even get to eat here because this place was the most understaffed restaurant I've ever seen, there was only one waitress taking care of EVERYTHING on the front end of the restaurant (I.e. Hostess and waitress). Not sure if someone called in sick or if the owner is too cheap to hire more then one person. Some people waiting at the front said they had been waiting for an hour on their takeout order. The waitress/hostess told one person waiting that they were running out of items in the kitchen for their order. Waited 30 minutes in line just to place a takeout order in the excessively warm restaurant (A/C was broke or owner was too cheap to turn on) before deciding that I would be waiting for over an hour more and decided to leave. Also, their telephone line doesn't even have call waiting and reverts to an error message when u call and no one ever picked up for the 5x I called. I've had Bonchon before and know it can be good, it just isn't in Vegas. This place needs new management ASAP since it's disgracing such a good company"}
{"text":"Terrible service! It took 30 mins to get our first order of chicken wings. Almost every table is waiting for their orders  and you see the staff outside talking a break. Seriously? I understand they are entitled to their breaks but with full house and peak time, can they not wait until it slows down a little? Will never dine here ever again!! Spend your money somewhere else where the staff cares."}
{"text":"It's been years that I haven't had Bonchon in Philippines and When I'm back in States I saw that they're gonna open one... And in Vegaaaas. So it's an advantage for a local like me who loves korean food... And chicken wings. Good service, Nice place and people. The Manager was Filipino tho. In General, I love Bonchon a lot. Gonna go back to this place again and again."}
{"text":"We liked it here. They have a nice outdoor seating that I haven't tried out yet, but I will next time. We ordered the $10 beer and chicken special, fries, takoyaki, and a lot of beer. Price-wise, everything was decently priced, especially when they have their buy-one-get-one-free beer special :D. Food-wise, we each chose a different chicken flavor. One of us chose the spicy one, and the other chose the soy sauce garlic. The spicy is really spicy, exactly the way I like it. If I had to compare it to Hooters, Bonchon's spicy chicken is spicier than Hooters' spiciest wings. As for the soy sauce garlic, it's sweet and really flavorful. We each had a different preference. So if you get the $10 beer and chicken special, you can get half and half. The fries was seasoned with Parmesan and other spices, served with ketchup. It's pretty good, and I would order that again with my drinks. As for the takoyaki... hmm, I guess I should say that no one ever screws up on takoyaki, but then again, there's nothing special about it and no one makes it special (that I know of). Basically, if you've had one takoyaki, you've had them all. I wouldn't order it from here again just because I'm sick of eating takoyaki in general, but if you like takoyaki, by all means, order it; it still tastes good. Btwy, soju is $10 here, same as 90% of the restaurants I've been to, but they also happen to have peach-flavored soju. No, I am not talking about soju mixed with peach juice. I'm talking \"peach soju\" in a green glass bottle, bottled by the brand. We liked the service as well. Of course, the more we drank, the better we liked people... but seriously, everyone was very attentive and friendly. If you can't stop ordering simply because the waitress keeps asking if you want more even though seeing your table is covered with dishes, that's on you. Don't blame it on anyone else. Lol  I touched on price early on and called it decently priced so ya'll would keep reading, but I actually felt the food was a tad more on the expensive side. It is definitely a hang-out kind of place to have snacks or just drinks though."}
{"text":"we stopped by for lunch today. The chicken wings are delicious and crispy. We had the half and half sauce, soy garlic is tangy and salty but good and the spicy ones were definitely hot and spicy. If you are a wimp, don't order it, just kidding! but it really is spicy!  The wings comes with side of daikon cubes which I really like--light, tart, and crunchy.  Bibimbap was good but not crazy for it. I like the Bulgogi sliders -it's marinated ribeye beef cooked perfectly with fresh cucumber, red onions and coleslaw, served on a mini slider bun and served three per order.  You must order the Salmon avocado ball which is a mix of avocado, crabmeat, cucumber and fish roe wrapped in seared fresh salmon topped with spicy mayonnaise and unagi sauce. It's sprinkled with crunchy tempura bits.  I want to try their Calamari next time. Oh the service was pretty quick."}
{"text":"Vegas is getting all the food chain hot spots and it's awesome.  BonChon is just as I remember it in other locations - \"hit the spot\" wings and addicting pickled radish. Careful, the spicy wings are REALLY spicy. We always do 5 spicy, and 15 soy garlic instead of half and half.  This type of Korean fried chicken is glazed and pretty great on its own or with white rice. Fries are good too, but sometimes I think there's a lot of fried going on so I prefer rice with the chicken.  My only complaint for this location is the host situation. I've been here to dine twice, and each time we had to wait several minutes bc the host was taking an order on the phone. I get it, but the place was pretty empty - couldn't someone else seat us instead of awkwardly waiting 10min for us to cross the front line to their table?  Another time, I was picking up an order. Again, no one was really seated but there was a guy placing an order with the host. This took a long while. I don't mind that the customer wasn't sure what to order, but couldn't the host or someone else take a minute to complete my transaction?  Service and hosts are super friendly, but I just think there's a consistent road bump in that area.  Ordering a delivery service like UberEats is probably the best way to go to get your BonChon fix. Next best is phoning in your order and picking it up. Food is so good, but good luck with the wait on non-busy occurrences."}
{"text":"Reminds me of my favorite korean chicken place back home. The spicy has some kick, but doesn't last too long for those who are sensitive to that. Well worth the drive from south east las vegas."}
{"text":"Had to wait a little because it was rush hour for dinner time but we got excellent service!!!! We got catered on and really felt like VIPs...the food was ok. I like the chicken..very light and crispy. I'd say may 3.5 for the food and 5 for service"}
{"text":"Looking through the reviews and listening to the experience of my friends, I expected some pretty mediocre service at Bonchon. I think we were a bit lucky. We jumped in on a Friday late lunchtime and had to wait about 30 minutes for a seat, which was accurately quoted. The biggest note is this place is MUCH smaller than the building seems to show. If they open the outdoor area, it'll be a decent size but during the heat of summer it's not going to be great and the small size of the restaurant is awkward. Think of a building that looks to be square, but 80% is cut off so you have like a narrow hallway for a restaurant (my girlfriend said it reminded her of New York). I don't know if they had any options when they had the place built, but if they did, they went the wrong direction.  We ended up sitting at the bar, which generally does mean there's a server there to be attentive. Looking around though, it seemed most people were getting their dishes in 10-15 minutes, far better than the hour or so my friends were experiencing. They also didn't run out of Daikon or Rice.  We both opted for the lunch special for 8.95. I got 4 wings and 2 drums, while she got 8 wings. Note that wings seem to include drumettes, so I'm not sure you can ask for all flat wings. We got one rice and one daikon. We waited about 15 minutes.  The chicken itself is pretty good Korean Fried Chicken. Very crispy on the outside, and meant to be moist on the inside. The insides were moist on the wings and the large drumsticks, but kind of dry on the small drumettes. I know that they are having some supply shortages so I wonder if they had to get some lower quality chicken to keep up with their demand. l, I found both sauces tasty. I know Bonchon only has two options, but it'd be nice if they had a couple more.  The daikon is exactly what I would expect after having it in Korea and the Bay Area plenty of times. Most people will probably be turned off by it's flavor, but it's a staple with Korean Fried Chicken. It's meant to cool down the temperature of your mouth and enhance the flavor of the chicken, not be a dish to necessarily be enjoyed by itself (though some are addicted to it).  The servers here appear to be pretty clueless overall. We sat near the kitchen, and noticed almost every plate that came out, someone was asking someone where something was going. That's never good. However, when talking to the waitress, this is still very much considered a soft opening and while that doesn't excuse problems, it explains why they are there. I felt the managers didn't look like they had run many restaurants before as they simply didn't have the look of confidence when running parts of the restaurant. We did receive two greasy and dirty looking forks, but quickly had them replaced with clean ones.  Overall though, our personal experience was quite good. It was a bit warm in the restaurant, but that happens in Vegas. I do think we'll generally opt for take out here as the restaurant layout is less than ideal. I did ask about alcohol, which is like mandatory as a side dish in Korea, and they said that would be available when they had their official grand opening, the time of which was unknown at the time."}
{"text":"This place is Soooooooo GOOD!! Definitely recommend ! The Pork buns are amazing. The wings....best wings I've had."}
{"text":"Whats going on???  By far worst Bonchon ever. I have tried many other location. I order the drum stick with half and half flavor. Taste like they were just dipped into soy sauce just salty. The other one was they just put the Korean ramen powder. Taste like load of MSG. They charge this crap for almost $30 for 15 piece. Im a Korean so I know how Korean fried chicken supposed to taste. I also ordered bulgogi fried rice. I almost spit as it was taste bad and really soggy. Even person who doesn't know how to cook fried rice can cook better than this. Don't waste your money go to somewhere else. I was really excited when I heard Bonchon is coming to town. Its shame."}
{"text":"I was asked to do a Yelp review from the girl at the register. Enjoy.  I miss Bonchon on Little River Turnpike in Annandale, VA. I was a regular back east. You typically had to wait 45 minutes for your chicken, but it was well worth the wait. When I saw this was opening 5 min from my house, I told everyone back home...to suck it.  I was a bit surprised when I heard my order would be ready in 15 minutes. Honestly, the quicker turnaround made me question the quality here. I was right. Not as good as back east. I heard that the extra time it took for the chicken was because of it being fried twice. I'm not sure how much truth there is to that, but the process here is different. This was not the Bonchon I was used to.  I'll gladly wait the extra 30 minutes if that means better quality. For now, I'll settle for it. It's still good, but not everything I hoped it would be."}
{"text":"I was anticipating their grand opening since a friend of mine said their wings are bomb.com!  It was a 30min wait on a Sunday, and when my party was finally seated, we ordered: The large wings (half & half), Fries, Bulgogi Sliders, and Japchae.  Japchae was okay. A bit oily than what I'm used to, but it was tasty.  Fries were pretty good, but they were quite pricey.   Bulgogi burgers were just OK. It didn't really taste like Bulgogi, but it was filling.  Now the wings..... The soy garlic was good, but the spicy sauce was my fav! It's not too strong of a spice, but I liked the sweetness of it & would maybe ask them to double up on the sauce next time (if possible).  The texture of the wings.. It's not your typically \"fried wings\". The texture is different than most. It's crunchy & just deep fried goodness.  It was a little oily for me though, BUT, it was really good! =)"}
{"text":"Went here twice to try out different menu items. First time I came here I ordered the bibimbap which was really good. The second time around I ordered their chicken and it was amazing. Came out hot and fresh. Also tried both of their flavors. The hot one gets really spicy after a while but the soy sauce one was so delicious."}
{"text":"Different kinda KFC, finger lickin good chicken.  KFC = Korean fried chicken!   Ever since the demise and different recipe of local favorite Bazic's KFC, I've been searching for something similar.   Once I found out Bonchon was open, I went for lunch. Luckily, they have great lunch specials.  Although they open at noon, I had a feeling the lunch rush was gonna be crazy so, we arrived at 11:45. And trust me when I say, the line was crazy by noon. We had just gotten the last 2 person table.   The BF had tried the wings the night before so, wanted to try the drumsticks in half half flavor. While I had the wings in soy garlic.   Of course you know my Asian ass had to order steamed rice and pickled radishes, my favorite all time banchan. And the radishes go so well with Korean fried chicken **mouthwaters**  Mind you, they make the chicken as you order it so, the wait is around 30 minutes til your food comes out. HIGHLY RECOMMEND NOT COMING HERE WHEN YOU'RE STARVING. #hANGRY  My heart dropped when the waiter came up to us and said \"we're out of radishes! And drumsticks!\"  **screams** NOOOOOOOOOOOOO :(  ((( I almost wanted to walk out lol )))  He said I could order a different side and I guess the kimchee will have to do.  While the BF got chicken tenders instead.   When the food came out, it was better than I remembered when I tried the one in SF. I was pleasantly surprised.   Wings were the perfect amount of crispy saucy goodness. The chicken tenders were really juicy considering they were as flat as they were.  Kimchee was vinegary, which I like a lot. And the BF enjoyed his kimchee slaw.   Since I only went on the 2nd day, I'm basing this review on the food.  With that said, I REALLY HOPE the next time I go -- there will be some (fricken) radishes and drumsticks available!  p.s. I had hoped this location would be bigger considering how busy they WILL be."}
{"text":"We drove across town to try this since the pictures we saw looked good. We were satisfied with the food and everything was tasty esp the chicken wings. We ordered calamari too but the server came back and said it was available. The price wasn't reasonable and the lunch menu prices weren't any better. It was a little uncomfortable to eat in there esp wheb your 2 year old is sweating as much as you. Their aircondition wasn't working well today while we were there. Customer service was good and he was always checking in on us. Will try again but not as often since it's so far and not cheap for the portion of food you receive."}
{"text":"Honest rating. I didnt allow all the issues bother me till the the Server Manee failed the 5th time. 1) We are a party of 5, she asked for our drink order. It was water, water, water, and diet (3 waters and 1 Diet). Once she got the diet order she left. It didn't bother me, just thinking she will ask when she comes back with the other drinks. She brings 4 waters and a diet and walks away. I said to myself, I'll take a water, I don't need a sprite, no big deal.  2) When she got our order, she took our menus 1 by 1, and when got to me I said I wanted to order another item, she literally just left. I was about to tell her what I wanted but she just left without any acknowledgment. Not even saying, do you need a few mimutes or I'll be back for that last order, NOTHING! She walked passed our table 3 times, I stopped her to tell her my last item. At this point, I'm still mellow like no bog deal, not one once of frustration. 3) When our meals came out, my brothers meal was spicy and I asked Manee what was his order, she said spicy chicken, my brother said he wanted regular chicken but no big deal, please exchange for tofu. She took the spicy chicken and brought it back in a to go box. Shortly after brought out the tofu.  4) When I asked for our bill, every item was on the bill. I took the bill and crossed out the spicy chicken and asked her to fix it.  5) She wanted to know why and I explained to her that you MIS-HEARD my brother say regular chicken and he wanted to EXCHANGE it for tofu cause he was burning up from the spiciness. She then said, but you ate it. I took the bill back and say, I don't want to pay for the chicken AND the tofu for your error. Plus you made multiple errors and was horrible at the same time, but I want to keep it simple and just move along. She asked what do I mean? then I said, ok. Do you know what my drink order was? She said no, I asked her do you know why you don't know? She looked confused and I said, it's because you didn't ask me. When I continue, literally left (AGAIN)and the owner came out asking if we ate the chicken or not. *please keep in mind, there was still no sarcasm, attitude, or any negative as I know I wanted a simple conversation and handle it like adults. I said to the owner, first of all, you as a owner don't start out by saying if we ate it or not, that's not very professional. Second of all, I didn't ask for a manager or owner for any help but if you want to take over, this is your business and you can do that if you want. There is no issue but your worker not taking ownership of her error. If there was a misunderstanding, they were re no apology for that. But to keep this short cause we need to leave, I don't want to pay for these 2 items and I'll be on my way. Manee can explain it to you, if not I'm more than happy to tell you but we are in a rush and have to be somewhere. So Kenny was a little dumbfounded so I asked if he wants me to explain, he said sure. So I explained to him about my drink order and the rest. Now at this point I'm getting irate and frustrated cause it really felt that Manee didn't do anything wrong and kenny wanted full payment. So once I was done explaining, I'm heated. So I told Kenny that, now I'm late and still stuck here, I want you to do what you think you should do, come back with the new bill and then we can settle. He said no, I IMMEDIATELY cut him off and said you as a owner don't say NO to a customer, you don't need to say anything at all but go and fix this bill and bring me a  correct one.  Short time passed and Manee, not Kenny, shows up with my bill hands it to me and walks away. He took off the 2 charges and gave me a 10% discount. I'm ready to settle up but before I leave not 1 person apologized for the error and inconvenience. So I asked for Kenny again and Manee said that he left and if I wanted his phone number, I said yes. She scrambled to get it, when she gave it to me, I told her not to leave, I ask for a pen, she said \"for what?\" Not joking here, she really said for what. So I wrote down his number, gave back that piece of paper and told her to call him right now and get his ass back here. Turn that car around right now. I went to the bar and started to be very loud expressing my frustration. All I wanted was a damn apology from her and the owner for turning a nice evening with my family to a frustrating one.  I'm not nip picking, if she show up with the bill without the chicken, I would of settled and leave. She clearly isn't fit to be a server but the owner is more interested in keeping her around than have repeat satisfied customers. There is no way I'll allow my friends and family to come here just to get the same treatment. I'll probably give it another chance if Manee wasn't there and if the owner reaches out to me and apologizes for the way we were treated. But for now, I'm posting this on yelp, urbanspoon/zomato, trip advisory, gayot, opentable, zagat, Facebook, google review, and dine."}
{"text":"The service here was very good.   My family ordered the chicken wings, bimbimbap japchae, takoyaki, and seasoned fries.   I ordered the bonchon wrap with bulgogi, I liked it but I could do without the avocado they had inside.   The seasoned fries were tasty, it had parmesan on top and some other stuff.   My partner told me that the plain wings didn't have a taste but the soy garlic was good. They don't offer sauce on the side so if you like it saucey try to ask them to add more sauce on them. She also said the takoyaki hit the spot for her.   The rest of the food I didn't try, but my brother and sister n law liked everything they ordered.   They are still in their soft opening so there are a couple of things not available, but the food is pretty good."}
{"text":"Is this place still open or what? I keep trying to stop by around 6 and they're shut down. What restaurant closes that early? You aren't a breakfast place.. lots of money lost when your competition stays open all night! Awesome wings, stupid hours..."}
{"text":"FOOD: WINGS! Since my first taste of their wings at the NYC location, I've been searching for similar styled Korean wings but can't find anything like it. It's probably my favorite wings ever. Every wing is super duper crispy with flavor that soaks deep into the meat. I always go with the Soy Garlic.. just a unique taste that doesn't need any dipping sauce.  We also tried the Salmon Ball which was basically one giant sushi roll smushed into a ball. It had good quality and had a good mix of flavors. I'd stick with the wings though.  AMBIANCE: A cool, uniquely-designed restaurant, resembling the NYC location's atmosphere.  SERVICE: Very nice and welcoming staff. The restaurant is still fairly new and you can tell that the hosts and servers were still a little stiff. I was a little disappointed at how long our food took to come out. We only ordered wings and the Salmon Ball but it took almost half an hour for our food to come out.  TIPS: SOY GARLIC WINGS!"}
{"text":"Unreliable business. My family came here on a Wednesday night for dinner to find that they are closed for the night. The business hours displayed said they are open until 8 pm but was already closed by 7:20. We tried to come again the next day for lunch but we wisened up and called first to make sure. They said they will close that day until 2 pm. Again, their business hours said they are supposed to be open until 8. Not sure what determines what time they feel like closing but I guess they will do what is convenient for them."}
{"text":"Order the salad it was 20 mins wait. Had the chicken salad. Chicken was good. Salad was ok didn't have a lot of ingredients just mix green and edamame and green onion and the chicken. It was pretty slow but not sure why it took so long. Service over all was ok."}
{"text":"The establishment was too small. Chicken wasn't as good & as crispy as the one i had in Asia. Wish we could've ordered all soy garlic instead of half&half, as the spicy was just too hot! Everything else on the menu is pricey too, i'd rather go to somewhere else."}
{"text":"Way over priced and at least 30 min wait and it was a slow day. The wings are good and the kimchi fried rice. Nice environment and clean."}
{"text":"This is a nice family restaurant. It is a relaxed environment. The decor is nice, but the location is small. I thought it would be bigger. Good thing we came in before it was busy.  I order jap chae, takoyaki, and the spy garlic combo. The jap chae has a lot of veggies like mushrooms, peppers, onions and beef. It was ok. The takoyaki was ok. Nothing special. I also order a side of rice. The rice was hard! For $2 I expect the rice to be made right. I didn't have to be made perfectly, but for $2 I was expecting better.  The only reason why I gave this place 4 stars was for the chicken and the service. The service was amazing. Our waitress came back often to refill our drinks and check on us. We really enjoyed the chicken. It was crispy but not overly cooked. The soy garlic flavor was yummy. It was also juicy. We should've order more chicken instead. Next time we will try the fries."}
{"text":"Who doesn't love fried chicken? But fried chicken done the Korean way? Bomb.com. I prefer to eat this over Hooters, Buffalo Wild Wings or Wingstop.   The chicken wings they serve here are a good size - not small like the other restaurants. I believe they're double fried and the finishing touch of soy garlic sauce completes me. They also have a spicy sauce for you hot sauce lovers.   Service was great. There were two other dishes I tried - Bugolgi and the Pork belly buns. The Bugolgi came with white rice and I didn't like it so much. Tasted too much vinegar. And the pork belly buns were too small and had too much sauce on it.   5 stars for the wings. And 3 stars for the other dishes.   By the way- no liquor license here yet. An alcoholic beverage would've gone nice with my meal. Hope they get it soon."}
{"text":"Great first experience. Food was decent. I've had korean wings before and preferred it to be crispier. But thanks to the great customer service by Lloyd, he made it up and will be coming back."}
{"text":"I would love to give this place 0 stars if I can.  I got this \"Bonchon wrap\" and immediately got food poisoning the next day. Came down to a fever by the end of the day. Horrible. Would not come back ever."}
{"text":"Bonchon is one of those restaurants that I just can't get enough of lately.   Their chicken strips are delicious - I like the soy garlic, but love the spicy sauce! The sauces here are unique, and don't taste like anything I've had before. My husband doesn't like them as much because he thinks they should have more sauce - but I think they have great flavor and I like that they're not terribly messy to eat. However, if you like super saucy wings, this might not be your favorite chicken wing/strip.  The atmosphere inside is cute and the service was fast and friendly. The take-out is also prepared fast and always on time.   The only downside to this place is the fries. Every order of fries that I've gotten from here has been perfectly crispy... but poorly seasoned. The parmesan garlic fries were especially disappointing, the price point is just too high for fries that don't have a lot of flavor."}
{"text":"First visit since re-open. The food came out pretty fast regardless of other reviews. The chicken was very crispy and flavorful. The spicy chicken is pretty spicy, I recommend only to people with spicy taste buds. The interior has changed to better, specially at the bar. Much cleaner than before. The staff was very friendly and knowlageble with the menu. I think the new management is doing a great job training all the staff.  Overall my experience was good and I will be back. Also I will be recommending to my friends as well."}
{"text":"Horrible.  Menu: This chicken place has two flavors; Very salty and spicy. Many other odd selections available at high price.  Food: Mostly salty and spicy. Ddukbokki does not have enough dduk. This must be a fusion dish. I found some rice in pickled radish bowl. This must be a fusion also.  Ambiance: The place looks huge from outside. Big door with sign. Nice. You walk in and face a wall. Turn right and you will find a a narrow hallway with tables on each side. That's all they have.  They were using two fans to cool off the entry area."}
{"text":"My fiancee and I had our little Yorkie with us on our road trip,  but couldn't pass up detouring 20 minutes to get Bonchon after first experiencing this extra crispy chicken goodness in the Philippines.  We were ready to just buy take out and eat in the parking lot,  but luckily they allowed us in the patio with our dog.    We ordered:  -One small chicken wings order (qty 10) spicy flavor and soy garlic half and half.  The chicken wings looked small at first but the crunchiness and strong flavors made up for lack of size. Comes with a little bowl of pickled radish - refreshing. -Bulgogi tacos (qty 3) the server recommended this flavor over the spicy chicken. Well worth the extra $1. Little bit too much mayo, but still good. -seasoned fries. So crunchy you may forget you just paid 6.95 for french fries -lemonade, the tap water tasted too tappy.  We had a bunch of leftovers to enjoy on the ride home to CA.  The taste is what we remember from Asia,  unfortunately with US prices. Total meal for 2 $35 plus tip."}
{"text":"If I could describe this place in two words, it's that this place is a HOT MESS! And not the good kind. Here's what happened, once we got seated which took some time might I add, we ordered ice water with lemon. Brings water with no lemon. I then ask for lemon, the girl brings out and entire lemon holder and used tongs to put them in our iced waters. The plastic holder def did not look clean. Then what do you know, NO STRAW! I had to ask for straws!!!! Then I order a tofu salad and medium combo half half fried chicken. The girl says she doesn't know if there's anymore salad...and I'm like well can you go check and then let me know?!?! Next the salad comes out and it's basically half the portion size that it's supposed to be. You can tell because it doesn't even fill the plate/bucket thing they put the salad in. As we are finishing our salad, the girl comes up and asks if we are ready for the check. I said excuse me? She said are you ready for the check. I said the check? Our chicken hasn't even come out YET! How could you ask for the check you just sat us down. Next our chicken finally comes out, remember I ordered half soy half spicy, what do you know!!!! It's all spicy!!!! How could you mess up a service any more than this?!?? Seriously how could a restaurant mess it up any more than this!!!!!! Then I ask the manager, he sends it back and brings us the correct order! Some chicken was fresh and some was obviously re-fried. Trust me I know my fried chicken. HOT MESS, this place is a HOT MESS. Then as we are still eating with still 3 pieces left on our plate girl come up to us again and ask us if we want the check again. I'm sorry, do you not see us eating?!?!?? I'm not even gonna go on to continue to write this review because it's just too much. The staff sucks, the chicken could be better. HOT MESS. This has been the most emotionally taxing meal I have ever sat through."}
{"text":"I have only been for lunch, and think this is a solid option in the area. I have only had the wrap which is good and very filling! The seasoned fries are also great, and only $3 for lunch, I feel like the dinner prices might be a bit high so will stick to the lunchtime visits.  I agree with the tip about calling ahead for takeout, it can be a very long wait."}
{"text":"I'm very disappointed with this location. I just moved from DC a few months ago and there would go to Bonchon at Navy Yard at least 2x a month because it was so good- golden, super crispy, saucy/sticky goodness. I ordered takeout today and my 20 piece strips were the equivalent of 10 pieces at the DC location. They were dry, had barely any sauce, little crispyness, and were so small. If you want to see what Bonchon is supposed to look like, check out the DC one's yelp pictures. I was so excited to see Bonchon in Vegas but was totally let down."}
{"text":"Yummy chicken, the wait wasn't bad but I guess they get really busy at lunch. A little pricy but the food is good."}
{"text":"This place was recommended to me while visiting out here. The chicken was amazingly tasty and so crisp and fresh! I highly suggest pairing it with the fries which were so yummy!!! I will definitely be coming back on my next visit to Vegas!!!!!"}
{"text":"For anyone that loves KFC (Korean Fried Chicken) this place is a must in the Las Vegas / Henderson area. There's plenty of parking outside and the food is great. They also have bar seating available if you just want to stop by to watch a game while munching on some Deliciousness. The staff are very friendly and attentive. I Don't think my drink went below halfway the entire time I was there. I would definitely come back here as well as recommend this place to everyone."}
{"text":"I really wanted to like this place, but I walked out with an eh feeling about the place. The decor is cute and the servers are friendly, but the food was underwhelming. We got the 20 wings, 10 spicy, 10 soy garlic. The spicy is spicy and pretty decent. The soy garlic is pretty bland - I expected a bigger garlic punch than I got. Mostly it tasted salty.  We also got the seasoned fries which were $3 more than the regular fries for a shake of parsley and parmesan cheese. We also got the happy hour beer which was the most pleasant surprise of the night. We got a Hite for $5 and it was one of those giant bottles. The meal came to $40 and change. I thought it was a bit pricey.  Overall it was an okay but not great meal."}
{"text":"We ordered the small (10 piece) chicken strips in garlic soy and the small (3 drums, 6 wings) combo in half and half. These were both served with pickled daikon.   The chicken strips came out with some pieces piping hot and some that were soggy with a cold center. The server apologized many times for the cold chicken and gladly took it back to prepare a new order. The new order was piping hot but the texture was less crispy than we had hoped. The wings and drums came out very hot. The wings were very crispy but the drums were less crispy. The flavors were very good. The daikon was a bit bitter as if it wasn't marinated long enough. It didn't have the usual sweetness and refreshing taste that we were looking for.   We only came for the chicken this time. We will try some of the other dishes next time. There were still a few items that were unavailable. Maybe this could be due to the soft opening stage as other reviewers have mentioned.   Overall, good service but the food wasn't on par with other Bon chon locations we have been to in NYC and SF. I would give this place about 3.5 stars but rounded up because they were kind enough to replace our cold chicken without any issues. If you have the Korean fried chicken craving, this is probably the best option in town, even if it isn't on par with its sister locations in other cities."}
{"text":"Stopped in for lunch by myself. I have been wanting to taste this place since it opened. The chicken looked so great on all the yelp reviews. I'm glad I went in for the lunch special, $8.95 for 8 wings I decided to get half and half (soy garlic and spicy) I also ordered the season fries. All the food was good but just not my taste. The spicy wings were WAY too hot for me, so I couldn't really eat those. I might go back and try again with the soy garlic. The service was very good!"}
{"text":"The wait times are ridiculous and I'm not talking about getting seated. It took 40 minutes for just the appetizer to come out.  The waiter kept apologizing for how long it was taking but it was that way for all 20 people in the restaurant.  I wonder how long you have wait if they were busy.  The food is mediocre at best.  It has a decent taste to it but very mild.  Not worth the wait or the price.  I would pass on this one if I had to do it over again."}
{"text":"I love the BonChon chain and haven't lived near one for awhile. Wings were good but this location had really small wings mixed in. Tiny. For 24/$ for 20 that's disappointing. The spicy wings were not spicy at all. Usually, when I eat the spicy wings my mouth is on fire.  Clean interior. Sweet servers.  Maybe just an off day for wings."}
{"text":"I've heard good things about this chain over the years, so I had to try it when it finally came to Vegas. It didn't quite meet expectations.  Bonchon is a restaurant mainly known for Korean fried chicken, and they've finally expanded to Las Vegas this month. Located on Rainbow just north of 215 (expect to turn left across a busy road if taking the highway), they're pretty accessible no matter where in town you live. They seem to be very popular already, with a 45-60 minute wait time quoted by the hostess on a Sunday after peak lunch hours. It actually ended up as a 30 minute wait, or at least it would've been if we didn't head elsewhere to kill time...  Other than their big specialty, the menu offers lots of appetizers and entrees, a few of which aren't ready for primetime (see others' photos for orange stickers) but hopefully will be soon. We tried a couple of apps first, for which they provided us with small (and rather light in a \"this feels cheap\" kinda way) plates and metal forks.  Takoyaki ($6.50, 6 pc): this fried octopus treat came out hot and had a good helping of bonito on top. I found it odd that they had shredded lettuce on the plate, but I guess a bit of crispy freshness isn't bad. The batter seemed a bit off though, and the sauce was unexpectedly sour. Ultimately, I kinda liked them, but I can find better takoyaki in town at a lower price, specifically at a great katsu restaurant on Jones just a few minutes away.  Shrimp shumai ($6.50, 8 pc), steamed rather than fried: deferred to friend's choice of steamed, which in retrospect was the inferior choice because these things were too soft both in the wrapper and the filling. The shumai are definitely on the small size too. The flavor was fine, including the sauce which is definitely not soy sauce-based, but I can't help but compare this dish unfavorably to the good or merely decent shumai that I've had at dim sum places near and far.  Our chicken came out last. They gave us a bucket for bones and some extra napkins, which can be combined with the drinking water to clean the sauces in lieu of actually getting moist towelettes (they don't seem to have them).  Medium combo ($22.95 for 10 wings + 5 drums), half and half. We wanted to try both the spicy and the soy garlic sauces, and I wasn't that impressed. The former was too hot for me to handle more than one wing (and wasn't otherwise prominently flavored), and the latter would not be something that I'd call garlicky in a blind tasting. I was hoping for somewhat more powerful and nuanced sauces. I will grant that the texture was superb, both in the crunchy skin and the moist meat, but that's only part of the equation. On top of that, the portion size is pretty small in comparison to the price point. I was happier overall with the wings at a great chicken-focused lunch spot on Sahara by the Strip, as well as a chicken-focused restaurant in Henderson (with a Boulder City location now).  I'm separating the \"complementary\" side into this paragraph, but I'm going to hold it against them too. This side is pickled daikon, and it had a great crunch but was too sweet. The wing sauces mostly read sweet, so I can't help but think that there should be a noticeable sour element in a side dish.  Service during this visit was nothing to complain about. Maybe it was a bit slow by a couple of minutes here and there, but that's not surprising with how busy they were.  My impression of Bonchon is that the chicken is good but not great, and the appetizers that we tried were underwhelming. I wanted to give them a higher rating for that chicken anyway, but considering that it's a casual chain, it felt a bit too pricey for food that, at best, wasn't mindblowingly good. It's worth trying the Korean fried chicken for the textures, but I suspect that everything on the menu has a better alternative elsewhere in town."}
{"text":"Wings cooked how they should be!  Crispy and super flavorful wings.  We had the half and half (spicy and soy garlic) and they were amazing.  I think I lean more to the soy garlic.   My kids had the strips and potstickers and everything was delicious and full of flavor.  Our waitress was very friendly and accommodating to a child with food allergies.   We will be returning here for sure!!!"}
{"text":"We heard there was a Bonchon in Vegas and decided to try it.  This is one of our favorites in the Philippines.  Went on Tuesday about 11:30 am.  Not crowded there was a group of four at a table and another couple.  We were seated right away.  My wife ordered Bibimbap and I ordered 6 piece chicken strips, half with spicy and half with soy garlic.  I also ordered fries.  The fries came within about 10 minutes, the chicken about a half hour later.  Wow, talk about slow service!  The food was fresh cooked but, they really need to speed it up.  The fries should have come with the entree.  My wife's food was just ok.  My chicken strips were more like chicken pieces.  There was no breading at all.  It was way overpriced too.  In the Philippines there is a honey garlic flavor.  Not here.  By the time we left, the place was full of the lunch crowd.  I felt sorry for all these people.  They were going to be there a long time waiting for their food.  Won't go back here.  I'll wait until January and I'll be back in the Philippines."}
{"text":"Chicken nice and spicy (I ordered the spicy, not garlic). Larger than your average wings. Quick in and out for late 2:00 pm lunch. They push the sports bar, but doesn't feel like one. Feels like a fast food crossed with sit down restaurant. Plastic dishes, disposable wooden chop sticks.   Overall a great lunch. Friendly staff. And at $11.65, including tip, a pretty good deal."}
{"text":"I ordered chicken fried rice, bulgogi sliders and soy garlic chicken strips! The fried rice  was all right, just average! The soy garlic chicken strips was way too spicy! It was so spicy that my tongue was on fire! And this is a spicy food lover talking. I couldn't finish it. I will not order from here again."}
{"text":"Good food for good price, had Chauntee as my waiter provided amazing service highly recommended asking for her. She was very knowledgeable about the menu and gave a great recommendation for dinner. Overall friendly staff would come again!"}
{"text":"Came here for lunch, and was not disappointed. I tried the bibbimbap, pork buns, and a combo of chicken wings with a side of kimchi and edamame.   The chicken is the main thing they're known for and it's worth getting. The skin being super crispy and thin and spun in sauce. The two sauces are a sweet and spicy mix.   The bibimbap was a ton of food. It's a pretty huge bowl that is made of the hot stone. Pretty traditional. The mix was a bit more than the standard Americanized bibbimbap. It had mushrooms, royal fern, zucchini, carrots, just the egg yolk (impressive), and the rice. I added bulgolgi and they bring out the red sauce.   The pork buns were ok. I loved the actual bun, but the pork was a bit tough.   Overall, I'll be back for sure!"}
{"text":"Straightforward review  Thanks Timothy for serving us.  Chicken half spicy halve garlic +made to order food +tasty chicken  +crunchy +moist   bibimbap  +fresh ingredients  +tasty +filling +healthy   +polite workers  +patio seating +clean +great music"}
{"text":"The best chicken place i've rver been to. Seruously, its like fried chicken heaven. The spicy chicken is my favorite. Soy garlic had a good flovor as well."}
{"text":"Tried this new location for the first time through UberEATS and was disappointed. Having had Bonchon in Cali before, I've always enjoyed their chicken.   We ordered their 10pc combo and the Salmon Avocado Ball. Chicken was as I remembered however we only received 8pcs. The salmon ball was new to us and was...interesting. Not knowing what to really expect, we received a half cooked, half raw ball of salmon. For being called a Salmon AVOCADO Ball, it lacked a great deal in avocado and ultimately flavor. Not sure if the half cooked thing was their intent but definitely turned my girlfriend and I off and it became difficult to continue to try and eat.   All and all, I'll most likely order their chicken again when the craving comes but will probably stick to just that."}
{"text":"I found this eatery on yelp, and decided to check it out. I order a small order of the soy garlic wings with an order or fires and they were AMAZING. I also received great customer service from the hosts that took my order. She offered great recommendations and great conversation while I waited for my food.  Whenever I am craving delicious wings, I will come back to Bonchon."}
{"text":"I love BonChon chicken! The soy garlic chicken wings are so addicting. I'm actually salivating just thinking about it !   Generous- sized portions that comes with a side of perfectly pickled radish. Both the fries and chicken were really crispy from the first bite to the last!! I also had the salmon ball which didn't quite compare to the one I had at the Boston location but it was still delicious!  Our server Timothy was very pleasant and very attentive. The chef even came out to personally deliver the plates and greet us! I'm so glad there's a location out here so that I can get my fix whenever I'm in town.   Thanks for the hospitality BombChon!!"}
{"text":"My policy of keeping my Yelp friends informed, has obligated me to do yet another review.   It seems this place is turning into an example of \"how not to manage an eating establishment\". It was closed almost a whole week because they couldn't or wouldn't pay for a decent Air Conditioning service to fix the AC. It seems they are closed at least once a week for something that should be performed during non business hours.   We were there the first night they reopened. It was 830 on a Friday night. Prime time, right? It was like a Ghost Town there. I ordered my usual Chicken Tenders, and was told they were out. After offering to pay for my Cola and go somewhere else, the Server went to the Kitchen, and they agreed to improvise. They did a decent job, and I was pleased.   Now, here's why I'm writing. I got the check. You need to know they increased their prices.  For a \"small\" and simple order of Wings (10) , Tenders (10), and order of regular fries, and one soft drink the tab was $34.   This place has turned into a Rich Man's KFC, and I'm not rich.   I'll go back there again, but only if someone else is picking up the check."}
{"text":"Great fried chicken ..different from the rest of the wings place ..have a few Korean dishes but stick to the fried chicken wings and beer.  It's a bit pricey but worth it. Smaller than it looks from the outside."}
{"text":"We went early on Mother's Day and had a great experience! It wasn't too busy so our server was very attentive. Always love the half soy garlic half spicy. The spicy has a nice kick and is pretty addicting. We'll be back for sure!! They should add some drink specials because we love drinking soju with our wings.   Only downside was that the patio was closed when we were there. Not sure if it's normally open at lunch but we were there close to opening."}
{"text":"Came to try out Bonchon Chicken with a group of friends. The food we ordered came out disorganized. We had three people in our party and we got our food one at a time. The main dish came before the appetizers. There was a long delay between each plate. Might I mentioned, the store was not busy.   My Sesame Chicken salad came without chicken... By the time I finished my salad and chatting with my friends, the side of chicken came out. The breaded chicken cutlets for both the salad and the katsu was not juicy.  The fries   The only saving grace of the meal was the flavorful BonChon Chicken. It gave quite a kick. The dipping sauce for the chicken was delicious.  The pickled radish is supposed to clean the palate and normally, I am obsessed with the pickled radish. However, it contain a strong vinegar taste.   Overall, the meal was OKAY. Would I come back again? Maybe, just for the chicken and nothing else. Be prepare for the $$$. It's quite expensive for it's portion."}
{"text":"We came for lunch and order half spicy and half soy sauce. Medium size. 10 wings and 5 drums.  Like half of the Chicken meat was brownish yellow.  And smelled rotten. I've complained to the waitress and she goes into the kitchen to tell me that the batch was received yesterday and it's all fresh.  I wish I took a picture of the colors of chicken. But honestly, it was the most awful tasting chicken I've ever had. It's an embarrassment to the Bonchon franchise name. The management really need to wake up and make sure fresh food is being served.  I will never return even if food is FREE."}
{"text":"Bonchon is a sit-down restaurant with really good service. Surprised that they needed a hostess for such a small restaurant. Chicken come in large sizes (10 wings is the smallest portion for $12, or 5 drumsticks) but I am not sure if you can order by the piece. Nothing amazing about their wings. Sweet soy garlic glaze, and the spicy is too spicy for me to eat more than a couple at a time. Popular to order alcohol with your KFC.  Fries had a very good crunch. Ddukbokki ($12) was very spicy and creamy. It does the job if you're just craving wings, but there are so many other options I'd choose over this."}
{"text":"Need a spicy chicken wing fix this is the place! Upon walking into Bonchon exterior was beautiful with a very big outside patio.  Interior was smaller then I expected but the lay out was nice.  Service was excellent and both servers were very tentative.  I wasn't disappointed with this menu either. I actually ordered quite a few items. Bonchon is Korean based dishes so if love Korean food, you will really like this place."}
{"text":"This was quite a drive from the Strip but nicely located in a shopping center with other restaurants.  My boyfriend and I were craving some fried chicken and noticed it opened its doors earlier that week, last summer.  There was a small wait, about 5-10 minutes which wasn't an issue for us.    Upon seating our waiter notified us that there was an issue with the shipment on their chicken which resulted in them having larger portions of chicken which meant delay in cooking time.  We were starving at this point and decided to order their pot stickers to start off with. The dumplings was delicious.  We ordered the Soy Garlic which was crispy and nicely flavored with a sweet, tangy sauce! It also came with a side of pickled daikon, which I was a fan of!  Having prior experience working in the food industry, I know what great service was and our waiter was exemplary!  I would definitely come back here again in the near future!"}
{"text":"When i heard there was a Bonchon chicken around here, i had to check it out. I lived in VA before i moved to Vegas and they have a Bonchon chicken there. I have memeories of crispy chicken with this spicy, garlicky sauce. I remember it being super delicious. So when i went to this location i was super excited and couldnt wait for my chicken. When my chicken came out it was delicious, but not as good as the location in VA. I felt that the chicken here wasnt sauced enough. It was a little bland as well. The crispiness was there but i believe this location is not executing the way its supposed to be. Dont get me wrong, its still good chicken. But it can be a little better"}
{"text":"I swear every notable food chain is opening up in Las Vegas and that makes me and my husband happy.   I think I've had Bon Chon chicken on the east coast?? I know I have had other kinds of Korean Fried Chicken.   This place is good and legit. I recommend placing a phone in pick up order if you don't want to wait an hour. I did that around 430 on Tuesday afternoon. If I opted to dine in there were plenty of tables available. They also give you a call back when your food is ready.  The chicken is pretty good-- I got their soy ginger bc I can't do spice. It's tangy and has this nice crispness to it. I also got jap chae and fried rice which were okay.. Nothing amazing.   The chicken is best freshly cooked so I'll have to come back and dine in when the hype dies down. Also want to try a few other things on the menu which doesn't seem to be strictly Korean.   Only qualm is that this place is expensive!!!! I spent $50 on three items.   Side note: There's a place in SF that BonChon reminds me of- San Tang- which is so so so good."}
{"text":"A few weeks ago I noticed the sign saying that Bonchon was open again. I never went the first time around so I have nothing to compare it to - only tonight's visit.  Everyone who we encountered was incredibly gracious, helpful and friendly. Service was prompt and the restaurant was clean.  Our server even asked if it was our first visit and was great to deal with.  The chicken was delicious and deserves the hype - for sure. We also got the bulgogi tacos which were great (apparently the spicy chicken is even better) and they were huge for being a appetizer. Totally a meal size if you aren't sharing.   I almost didn't suggest this place to my husband for dinner tonight based on the recent bad reviews regarding the service. But I figured if the chicken was half as good as people say, it would be worth it for subpar service.  Halfway through dinner I told my husband about the reviews and how we almost didn't go. He replied that he couldn't imagine a server being any better or nicer or ask for anything to be different.  Don't let the reviews regarding service sway you - as they must not work there any longer!"}
{"text":"For the sake of punctuality and making this review REALLY easy to understand compared to my previous critiques, I'll lay it out like this.  Chicken amazing. Seasoned fries also really good. Portions reasonable. Service slow on first visit but prompt on second. Warm service regardless. Would come back. Came back earlier today. Slogan accurate. Mmm.  I'm hungry again."}
{"text":"I love the crunch and texture of the wings but the 2 choices of flavors is sad: (1) is the spicy.  Super f$&@ hot.  I felt like I needed to scrap my tongue on the table to remove the heat.   (2) the other is soy garlic which is edible.   However soy makes it salty and garlic is a bit overwhelming for those who do not eat garlic cloves for breakfast.  I understand the restaurant wants to avoid the Buffalo wings, but there are many flavors that would be tasty and still fall into Korean wings.  So my suggestion might be to add a honey/ Korean BBQ or Korean Kalbi flavor or orange sweet flavor.   Etc.   I would definitely return when knew flavors emerge because their wings are cooked to perfection."}
{"text":"Great customer service and yummy food! the beef bulgogi, popcorn chicken, and the spicy wings!"}
{"text":"Wings were pretty good. Only serve 2 flavors. Food came out fast, service was good. Didn't get anything else."}
{"text":"The food tasted great! Servers were friendly and courteous!  \"Addicted Yet?\" Their slogan is very fitting. Perfect with your preferred alcoholic beverage, especially their fried chicken--the crispiness is something you'll long for again after trying just once, and their 2 sauces (spicy and soy garlic) are very pleasing.  I also really like the interior design of this restaurant (check out their bar area!), and it has a nice vibe to help you wind down and chill.  To everyone who gave bad/low reviews, please bear in mind that this restaurant was just reopened (under a new owner/franchisee/management after the fallout from the previous owner or owners), so it's expected that they will struggle, especially in the beginning. Give time and patience, and I'm sure this restaurant can become great--I see potential here."}
{"text":"Best. Fried. Chicken. The 10 piece chicken strip meal half soy garlic half spicy is heaven."}
{"text":"The chicken was great. Small pieces but the flavor is very tasty! However the service was. Or the best. Before going to the restaurant with a large order, I wanted to call ahead of time. After waiting on hold for 5 minutes, i thought it was better to just show up and place my order. When arriving, there was only one family seated in the restaurant and 3 employees at the. At socializing. I was very turned off at this. My jaw dropped when I saw there were not a lot of people and I was put on hold. Like I said food was great, a little pricey for a new restaurant and don't expect world class service here. Get take out."}
{"text":"HOLY SEXY WINGS them fried wings are delicious! When you bite into a wing/leg first you hit the beautifully crunchy crust followed by the awesome seasoning dancing on the tip of your tongue then you hit the super soft and amazingly juicy meat which bring a perfect level of moisture and balance of flavor to your one single bite. EXCELLENT!   Don't get it? GET THE FREAKING WINGS!!! Don't know which flavor? Get the half & half.  We also got Bibimbap and Japchae... both were okay... we can do without or again. Bibimbap the rice is not cooked well... a bit too mooshy and the sauce/seasoning missed the mark. Japchae is meh also. The noodle was definitely over cooked (bloated and mooshy) and also lack seasoning/sauce was under flavored. Both dishes were disappointing but I tell you what, them wings really made up for it. STAY WITH THE WINGS!!!  So my one complaint is... WTH is with the smell? The location in Vegas sits in a newly constructed plaza  right under Hakasan Group... but there is an insane super strong sewage smell... HOLY DOO DOO! Literally!!! From getting out of the car to waiting for food you are just drenched in this not so sexylicious sewage smell... DAMN! I do have to say, you definitely forget about the sewage smell once you take a bite of them wings!  Definitely would go back BUT I would try taking the wings out... hopefully taking it out will deliver the same experience."}
{"text":"Their chicken is the best! I suggest to order the half and half chicken, (garlic flavored and the spicy one) service was good! We met a new friend Llyod, he's very helpful in deciding on what to order especially if it is your first time to eat there. Two thumbs up! Great food, great service"}
{"text":"Their soy chicken wings was good but was too salty for our taste. Their spicy chicken wings was too spicy to try and we had to settle to eat only the  soy chicken wings. The server was very attentive and that was the only bright spot of this restaurant. Lastly, It took a while for our food to come out from the kitchen."}
{"text":"Best tasting fried chicken but pricey. The staff is very attentive and always smiling."}
{"text":"Really excited to come here - been doing frequent drive-bys like a crazy ex-girlfriend, waiting for it to open.  Decent chicken. Not as thick a sauce as the locations in NYC, but similar. Spicy is spicy!  Wait will always be a bit (15-20min) as chicken is cooked to order. Fries were super crispy and fresh out of the fryer.  Service was good too. I'll be back next time the craving hits."}
{"text":"I have never had bonchon before but I've heard about it. I ordered the 10 piece wings, half & half, with a side of rice. The wings were crispy! It wasn't spicy, it had the right amount of spice and saltiness, really really delicious. I ate about 5 pieces and was already pretty full. My friends ordered the salmon ball or something like that & it was alright, nothing amazing. I thought that item was pretty pricey for the amount that you get, must be because it's salmon. The wings were a little pricey too but it was really good so I didn't mind it that much.   The workers are really nice. I think they're still having their soft opening so some items on the menu aren't available. Also, some of the servers were a little frazzled or nervous, maybe? Idk but they still have some kinks to fix. The place is also a little small so there wasn't a lot of seating available. Overall, it was a good first dining experience at bonchon!"}
{"text":"Ordered through Door Dash app a pre order of food for an office party. Ordered at 11am for 1:45pm delivery. Around 1:30 pm the Door Dash driver called to inform me that he arrived at the restaurant to pick up the order and they were closed. Maybe they should stick to their hours posted because it seems a lot of reviewers run into this issue. I understand emergencies happen but this is obviously a chronic issue for Bon Chon. I will not return."}
{"text":"I ordered soy garlic chicken strips with Kim chi over the phone for to go. Took me about 5 minutes on the phone just to order because the guy couldn't understand me. When I got home with the food it was completely different from what I ordered. I called him back so I can go back there and get the correct food. All the guy said was \"Okay thank youuuuuuuuuuuu\" in his Korean accent like ten times in a row and hung up. I realized it was a mistake but come on now that's the most awful customer service I've ever gotten. Complete waste of money."}
{"text":"Ordered the 30 wings for my boys and myself. These wings are bomb! The jury is still out on the best sauce because we liked them both. The wings are a decent sized and cooked to perfection. The crunch is to die for. The side of pickled daikon radish was a pleasant surprise. Combined with the wings it was a great little party in my mouth. It just works together! A little expensive ($35 for 30 wings) but was a nice little treat for us. Excited to explore the rest of the menu later"}
{"text":"They ran out of white radish Daikons !!! How !!?? You guy's just opened last week and plus no drumsticks too !! So mad, during prime time lunch hour too. Overall service was ok but much needed work on the food inventory portion of your store though.   Pricing wise. Lunch specials are a great deal. But almost $3.00 for a small cup of rice and kimchi as well, literally 1 scoop. $12 for DukBoKi, I mean really? (very small portion might I add). As you can see in my picture, probably like 5 rice cakes total and rest was just spicy sauce and cheese.. fak. Want real DukBoKi ? go to Soyo.   But let's get to the chicken. Overall it's good tasting with spices on point.   Would I come here again ? Probably if they fixed a few things such as overall wait time for food, better service in refilling water, making sure daikons and drumsticks are available. I'm big on Daikons, maybe because I'm Korean and I can't eat korean chicken without eating daikons. It's like eating chicken nuggets at Mc Dee's without the bbq sauce. They just go hand in hand.   I miss Kyochon."}
{"text":"It was our first time here and we will definitely be back. My husband said his seen the logo before and he finally remembered, it was when we traveled to Philippines.  The place was already packed when we got there. It's only a small place to begin with. We ended up sitting at the bar. The place had two big fan, it was hot in there. I hope they fix the     A/C if it was broken. They have only been open for five days.   Service could be a little better, slow on water refill, we had to ask. By the time we left there was already a long line waiting for table."}
{"text":"Finally got to try this place (using UberEATS) after hearing about it for months.  We ordered a small (9-piece) 6 wings/3 drums with both soy garlic and spicy sauce. This was about $13 and came with some pickled radish. Like another reviewer mentioned, there were a few tiny pieces in there that I yelled at, but devoured quickly. The best way to describe the coating is a layer of extra crispy fried breading, almost 'candied'. It was pretty heavy. I enjoyed the first 4  pieces before I started feeling icky as it was almost too 'saturated' I guess you could say. Will give the strips a try next time, maybe they will be more balanced.  I preferred the spicy while the wife preferred the soy garlic.  The pickled radish was nice, but for the price you'd expect at least rice on the side. We opted for an order of rice ($2) and kimchi ($3). Rice was a tiny portion. The kimchi pretty good, that was probably my highlight of the meal. We ended up with a drum uneaten.  Will try dining in at some point in the future, and may update my review if my opinion changes.   In closing, decent fried chicken, not-so decent value."}
{"text":"I got the bibimbap and half and half 10 wings wing and drum sticks. LOVED the chicken, but the Bibimbap was so horrible! It was cold (I thought it was supposed to be hot?). It tasted like a mix between feet and raw fishy fish. I may get the chicken again, but I am not going to try anything else. Maybe it is just my taste buds that do not like Korean food, or maybe their Bibinbop is just horrible?  This I do not know. I have never had that before, so I have nothing to compare it with."}
{"text":"Wonderful experience. From the start the server was super sweet and even went the extra mile to sample out some of their kimchi to try after I asked how it tasted(I usually prefer it super sour and spicy). Although it wasn't as sour as I always hope for it to be, it was still great. Throughout our whole dine-in experience, everyone seemed to anticipate our needs even before we needed to ask; water was always refilled, and a few of them came around to ensure we didn't need anything else. I noticed some reviews complained about the wait time but when I went with my friends we didn't have that issue at all but we must've been lucky. I could honestly see why the wait would suck in such a tight space during rush hour though.   Will definitely be coming back for more!"}
{"text":"Came here on a Saturday around 3pm.  No wait; actually the place was pretty slow and quiet, which was nice and surprising because I have been warned this place can be super busy and with more than half an hour wait at times.    The menu is very simple and self-explanatory.  Other than fried chicken, they have an array of Korean dishes.  But my companion and I were here for the chicken, so chicken was what we got.    The spicy sauce is actually quite spicy; definitely not weak sauce...  The garlic sauce didn't taste like it was very garlic-y but it was; you will notice the garlic by the end of the meal. We favor the spicy flavor over the garlic just because the flavor profile was a bit more complex and simply more delicious.   The wings were perfectly deep-fried; crispy on the outside and juicy on the inside. However, the wings were on the smaller size, which makes them less bang for your buck.   We also had the garlic fries and they were very good; not too salty at all.  All this complemented with chilled barley tea make for a fulfilling late lunch. Will definitely return!"}
{"text":"I was never a fried chicken person. But the way they cook  and all their ingredients are so fresh.  It's a total different experience.  They recently reopened under new management.   The owner must be interested in interior design as well.  Perfect for night out for dinner n drinking.  I liked the purse hanger!!!!! What a great idea. Thanks!!!!"}
{"text":"if you were stationed in Korea..this probably the closest thing to Saku-Saku near Osan..actually this place better cause its soy garlic not as runny and they have lots of appetizers to choose from which is also good. 2nd time this week since finding this place lol."}
{"text":"First time here... What a let down! :(  I enjoyed the food and I would love to give a better rating but the service was ridiculously bad. The entire waitstaff was confused!  Our waitress told us it was her first day and I completely understand how that goes. However, I was annoyed enough to start a list...  1. She did not pay attention while we were ordering. I watched her look away mid-order and I knew we had lost her attention at that point. I politely reminded her when she repeated back 2 out of the 3 things we ordered (mixed chicken, fried rice, and kimchi).   2. A busser(maybe?) brought out the chicken first. He asked if we needed anything else... Um, yes? Fried rice and kimchi. He comes out shortly with white rice. *facepalm* I'm guessing the waitress had tuned us out twice.   3. We finished our food - happily. No sign of our waitress. Calling the hostess over for our boxes and check is always fun.   4. The most cringe-worthy hiccup was watching our waitress interrupt another couple (both mid-bite on their first piece of chicken) and try to get them to sign OUR check. Can we apologize for you???   I'm not writing this to dissuade anyone from trying Bonchon. The chicken is too good to pass up. I'm writing as a plea to management.   PLEASE... Train your staff. I saw nothing but puzzled faces walking the floor. I left with a satisfied belly, but I will most likely opt for take-out if I have to shake my head from start to finish."}
{"text":"We ordered take-out and were pretty disappointed. While we specified for half and half wings, we received a combination of wings and drums. It was too late to do anything about it as we were already home when we realized the order was incorrect. Also, the ordering process was kind of strange. I understand the concept of providing your phone number, but they did not quote an estimated time or timeframe while ordering. They told us that they would call us when the order was ready for pick-up.   The food was just OK. I'm surprised with the reviews on the spicy wings being too spicy and soy garlic being amazing and flavorful, because our wings were pretty bland overall. The signature Korean Fried Chicken were crispy, but the pieces of chicken were also very dry. They kind of tasted like supermarket deli wings that have been sitting under heat lamps or something :(. We also ordered japchae... the noodles were also very bland and we had to season them further. Also, they were oilier than usual and I think being placed in the to-go container may have affected the texture as the noodles were very soft and not chewy/bouncy. It was a pretty disappointing dish.    Would consider returning, but dining at the restaurant instead of take-out."}
{"text":"I honestly can't see why this place has so many 4 or 5 star reviews.  The food is good, but nothing special (in fact my fried rice was really bland).  The service when I was there was good.  The place is clean.  But it still goes back to the food.  It's just \"A-OK.\"  Oh, and the price was really high.  I can get better/more similar food at a Hawaiian BBQ for a lot less."}
{"text":"I got spicy fried chicken and garlic chicken togo. Both were flavorless. Not sure if they gave me the wrong thing. My spicy chicken wings were not red at all. Regardless, they didn't marinate it long enough. Besides the skin, it was flavorless inside. Even though the skin was crispy, the flavorless meat inside was just quite horrible. We also tried the rice cake. It was baked with cheese and spaghetti. This plate was a disaster as well. The dish tasted sour?! The best thing that we had probably was the pickle radish.   Hopefully they\"ll get it together and I\"ll possibly revisit in the future."}
{"text":"I'll keep this short and sweet.  The chicken was ok, in my opinion not worth the price (20 wings for $21.95).  I asked for a side of sauce to dip my chicken in and the server and subsequently the manager told me no. Apparently it's company policy to deny a side of sauce to protect their recipe.  I have a real problem with this, who's the customer anyway? Moreover, if I can identify the ingredients of your sauce by taste then I can do it just tasting the chicken. The manager and server were very nice and attentive, unfortunately that won't be good enough for me to return."}
{"text":"They are under new management. Very cool atmosphere and great food! We ordered the combo wing/ drumstick with soy garlic sauce, seasoned fries, Korean tacos and sliders. It was really good, service was fantastic and fun place to hang out with friends. We will be back soon!"}
{"text":"Short and sweet:   Pork Buns  Soy Garlic Chicken Sliders  Shrimp Shumai  Japchae   What can I say? Thumbs up for everything I tried here, and the customer service was excellent! I would definitely come back for more."}
{"text":"I agree with David H's previous post. I found the chicken to be tasty but WAY to little for the amount you are charged. Unless I hit the lottery I won't be back."}
{"text":"The chicken is not fresh here; at least from what we received. We ordered the combo and half was spicy and the other half was soy. It was our first time and it will be our last. The chicken smelled and it tasted rotten. The kitchen said they received the chicken yesterday, but I highly doubt it. This is our experience and if you're going to try this place I do hope you have a better one than what I had. Good luck."}
{"text":"As far as crispy fried chicken goes, Bonchon has me satisfied. Throw in the sweet and salty goodness of Korean fried chicken, this place leaves more to be desired.   I came here strictly for the fried chicken and that's exactly what I got. I ordered a medium combo with half spicy and half soy garlic. Oddly, the spicy was more salty than the soy. As far as level of spice goes, I enjoyed that. The soy garlic was a bit bland and not very garlicky. The chicken itself was crunchy, meaty, and juicy. I liked that the order comes with pickled daikon. It helps cleanse that greasy flavor from your palate.  Overall, decent fried chicken, just not my favorite for Korean fried chicken. I wouldn't mind coming back though."}
{"text":"Had much better wings in New York. I wasn't feeling the lack of crispiness in their wings. Although they accommodated in serving us wings late... they closed an hour and a half early which would made it inconvenient to enjoy their location to begin with. I prefer other options in town."}
{"text":"This Korean chicken place is located on rainbow and sunset with tons of other eateries. We decided to give this a try because my friend was craving it.   We split an order of 20 wings half spicy and half soy garlic. Unlike other korean establishments, this place does NOT give you any side dishes and you only get one pickled radish. If you want more.. They charge you.   The chicken wings are pretty crispy and has nice flavor. I like the soy garlic more. The spicy one is good and it does have a kick to it so if you can't handle spicy don't get it. For me I've just had better fried chicken at Q bistro. It's cheaper, they offer more flavors, and give you side dishes!  Also in my pile of wings were two dinky baby chicken wings.. Like half the size and meat of normal ones. I didn't like that they try to squeeze that in there and count it as the 20.   I thought the wings were decent but you pay a higher price without other accompaniments."}
{"text":"We have been wanting to try this place out for while and finally tried it a few days ago. We are from Guam & they have a chicken place there called Pochons & it was our favorite, so we got excited once we found this place because it looked the same.   Service: We called in & placed an order for pick up before we made the 20 minute drive. The lady I spoke to was very nice, repeated my order twice & called when it was ready. We were just pulling up, so perfect timing. Once inside, the same lady repeated our order again & gave us our food. She was very pleasant.   Food: Ordered small (10 piece) half Soy Garlic/half Spicy wings for me & small (5 piece) Soy Garlic drumsticks for my other half. It was all delicious & it was very close to Pochons in Guam. The one problem came when my other half bit into a spicy drumstick (she cannot do spicy) & we realized that they gave us half spicy/half soy garlic drumsticks. We would have went back fo fix our order, if we didn't live 20 minutes away.   All in all, it was good. We will be going back, but we will make sure that the lady who takes our order & gives us our food is 110% sure that they give us the right food."}
{"text":"My boyfriend and I were excited when we found out that Bonchon was finally opening in LV. Every time we went to SF.. it was a must to go for their chicken so when we found out there was one opening up in our home city.. we were ecstatic. Right when we walked in.. we were immediately greeted by friendly staff. We decided to order take out. We ordered the soy garlic chicken (our favorite) and japchae. While waiting for our food.. the hostess offered us water. She was extremely nice and kept us updated on when our food would be ready.   Now onto the food: the wings are amazing! They were very crispy and extremely flavorful. We also loved the japchae as well. It never disappoints. Bonchon definitely lived up to its expectations since we've been to their SF location so many times. I am so glad that there's a Bonchon here in LV. We will definitely be coming back a lot more often whenever we're craving their chicken."}
{"text":"The service was really good! They were attentive and ask if we needed anything. The chicken was definitely something I'll go back for. I had the bibimbap and it was a big portion and tasted good. Definitely will be back soon ."}
{"text":"Bonchon wings have the best crunch ever! Not greasy, not too saucy and keeps it simple with two flavors soy garlic and spicy. I like to get the half and half because the two flavors compliment each other well. I could never do just one flavor since the soy garlic, a more sweeter flavor gets monotonous. The spicy is perfectly spicy, but can be a bit much after two or three wings. What better way to change it up with a sweet flavor. Get the seasoned fries or a side of white rice to eat with your wings.   I've tried other menu items (jap chae and salmon ball) and I say skip them because they are overpriced. The bulgogi sliders were decent though.   *****Yelp 2016 100 Challenge***** 63/100"}
{"text":"Spork - No.  Chopsticks - Yes Cole slaw - No.  Pickled radish or Kimchee - Yes Mashed potato - No.  Rice - Yes.  Bonchon is to Korea with KFC is to the States with one exception, it isn't only about Mr. Clucky.  Korean-ish, Asian-ish dishes Westernized for the American palate are also offered.  You know, potstickers, fried calamari and shumai all with a side of soy garlic sauce, overly sweetened bulgogi stir fry with mushrooms and onions, pork buns with sticky sweet sauce, and of course, the Korean taco.  The food is what mainstream, Mr. and Mrs. Smith would categorize as tasty Korean.  The chicken.  Wingettes, drrumettes, and breast meat tenders.  All dusted in flour and fried then dipped in either a sweetened garlic soy or gochujang soy and refried.  Fresh out of the fryer, uber crispy with noticeable, sweet, earthy, soy flavor with a hint of garlic / sweet, controlled chili spice heat.  Good eats for sure.  Fans of flavor, it's all about the wingettes.  Great crispness, firmer flesh due to over cooking.  Drums are OK, juicier but pricier.  Tenders, least flavorful and dry.  Arm twisted, other non chicken items sampled.  As initially described, none authentic Korean in flavor.  None memorable or flawed.  All a little too \"Panda Express\" for me.  Takeout and dine in.  Chicken prices are HIGH compared to American wing joints (strips and wingettes aprox $1 each, drumettes $2 each).  Service is painfully slow for what should be fast food.  Hopefully it improves with time.  It has its niche.  True fans of Korean food, look elsewhere.  SPECIAL NOTE:  HAWAII YEEPS - Bonchon is opening its first Hawaii location (Kapolei) in October 2016."}
{"text":"Ive been familiar with bonchon already from the Philippines so i know their chicken tastes good. The food did not disappoint same good taste. Our server Carlo or Carlos, was very enthusiastic and he was eager to attend to us and the customers.   What i didnt like though was the long wait time. I though this bonchon was fast food style or at least could have kept up in pace in terms of speed of getting the chicken to the customers like BWW.   Im not sure if im going to be coming back soon. I will but not any time soon. I will give them time to speed things up, hopefully when i come back it wont take 30-40 minutes to get some good chicken"}
{"text":"Missing my Seoul trip and had to get my Korean fried chicken fix...their fried chicken were huge, crispy and not greasy at all. I like the soy garlic sauce. Pretty tasty, but it only stays on the outside, not the meat. I would suggest the chicken to be marinated before they get fried. I wish they gave beer that I can enjoy with the fried chicken. Oh, well..it is Vegas, not Hongdae. I can't complain...overall, it statisifed my crave of Korean fried chicken...  Suggestion: more variety of the sauces and spicy level.  Beer. Marinated juicy chicken? Am I asking too much? but that is what a true foodie ultimate mission - search and taste all the best food in the world...haha...   This will be on my come back list ~~ I'm looking forward to more delicious fried chicken...  Serivce was very attentive,  good job!!"}
{"text":"You have try to visit this place, great ambiance, nice staff and above all the food is Awesome especially The famous Korean Glazed Chicken and a lot more."}
{"text":"A good place for some chicken wings and drums.... they also have a good salmon avocado roll that anyone should try... will be coming back soon"}
{"text":"The Korean fried chicken is bomb. a little pricey but worth it. and the portions are big! not like Wingstop tiny wings. the bibimbap was okay. rice wasn't crispy and I don't think any of the veggies were pickled. overall this place is pretty overpriced for what it is...americanized fast food version of something you can get more authentic elsewhere."}
{"text":"Bok Bok bok! I feel like chicken tonight!! Especially here at Bonchon. I don't know if the world is ready for this flavor though. That's why there's a lot of mixed reviews about the food here. For me though I love it here! I only stick to one thing here is their wings. I always order the 30 wings here half and half meaning half spicy and half soy garlic. There's something that I love about Korean fried chicken and it's the Gochujan sauce It's spicy and full of flavor. Even the soy garlic ones are so bomb as well but it's not spicy and it's a sweeter flavor. I don't know what the secret is but the batter is bomb as well. It's super crispy and crunchy and chewy all at the same time you just gotta try it. This is definitely a spot that I always think of when talking about eating wings now. Thanks Bonchon you have earned my business with your bomb chicken. I'll see you real soon."}
{"text":"Stopped by for lunch and enjoyed. Will be back when travelling through! Had soy garlic wings, shrimp shumate and edemame. All tasted great!"}
{"text":"Definitely the best chicken wings in America. Only reason they didn't got 5 stars is because of their poor opening hours."}
{"text":"Walking into this place, you are welcomed with an enormous banner over the front entrance that promotes and all day special with beer and wings for $10. Could you really ask for more?...  The atmosphere within the vicinity is very laid back with a clean modern feel all around. Restaurants at this size usually would leave a customer like me feel a little claustrophobic, but the high ceilings give comfort and a sense of room to breathe. Tables are nicely spaced apart so it doesn't feel like you're tied into the next table over and their conversations. The staff had a great sense of urgency, complimented with such a warm hospitality towards you and it makes you feel like you belong there. Looking at the menu, it was simple, but in a really good way. Straight to the point and nothing overwhelming about it at all. The items that caught my eye was their Korean fried chicken small combo that came with 3 drumsticks, 6 wings, with a side, and a choice of your flavor on the chicken(Spicy or Soy Garlic) for $12.95. Our waitress took notice that it was our first time eating here and not being too sure if we would like the spicy flavor, she took initiative by giving us the option to have some chicken pieces tossed in soy garlic sauce and  a couple with the spicy sauce. I also ordered a side of onion rings with my small combo for $6.95 The flavor of the Korean fried chicken, packed with flavor, and paired with a nice solid crunch with every bite. I had no idea that fried chicken could ever achieve such crispness. The onion rings provided the same satisfying crunch as the chicken did  and you could tell that these were all made to order. One more thing that made me love this place that many other restaurants have failed to do, was keeping my glass of water filled. Our server made passes by to make sure that the water level in our glasses would never be less that halfway full. It felt good to have a staff come by so often to show concern and let the table know that they are here to serve us with a passion.  Great food, great workers, and overall a great place to grab a bite to eat with some friends."}
{"text":"tl;dr: It's the absolute best, go and enjoy yourself. Spice-addicts, get the Spicy wings and enjoy the burning sensation. If you get their Shumai, get it fried instead of steamed; the slight crunch from the first bite is really something.  A tl;dr at the top? It's a miracle. Seriously though, their chicken is the best. Soy Garlic is slightly sweet and tangy; a great pairing with pretty much anything. The Spicy 'gochuwaru' wings have a good kick to them and I would warn people to avoid going half-half as it really is a lot to handle for some people, lolol. One awesome thing is that their fries are some of the crispiest fries around; a testament to good fried chicken is how good the fries are. The other items on their menu are all worth at least a try, but in particular their fried rice, takoyaki and shumai are staple repeats; the fried rice is a great complement to the chicken.  If you even have a remote fondness of fried chicken and have never been to Bonchon before, go. It's just so good.   (I mean, I finally sat down long enough to type this... that's a miracle in itself when I think about it)"}
{"text":"Perfectly crispy. Meaty. Unique taste.   Soy garlic wings are my favorite.  The double fried wings capture the strong taste. Wings are wonderful coupled with rice and pickled radish.   Highly recommend!"}
{"text":"This is definitely the beginning of the end for this location. It has been mismanaged since opening day. Now that they are only open 3 hours a day we know what that means. Closing is imminent. I've gone there twice this week during their newly advertised hours and it has been closed.  The food is amazing, the staff friendly, the restaurant clean. I love eating here, but sadly it will be gone soon."}
{"text":"Stopped by today with a group of 7.   Ordered: - 10 piece small wings with half and half sauce: Wings were not actually that \"small\" and bigger than the wings I've gotten before at most other places. Wings were nice and crispy on the outside and juicy on the inside. There was enough sauce to cover the entire wing but did not drench the wings and make them soggy. The soy garlic had good flavor but the spicy had just the kick it needed for my taste. The pickled radish was just the right accompaniment to help cut the heat on your tongue enough to keep eating the wing. I can agree to CNN's comment that these are the best wings in the country.   - Bibimbap with spicy chicken: Huge portion for the price. Cast iron bowl came out still sizzling. You could tell the rice was actually cooked in the pot vs being filled to order because you could feel the layer of crispy rice as you mixed the bowl together. It was enough to feed 5 of us with some still left over in the pot. We used all of the sauce that was given. The dish was a little on the spicy side but not enough to make it inedible. Ate some of the pickled radish with this dish too! *Should be served with a spoon so it's easier to mix.   - Japchae: also a good portion for the price. Good ratio of ingredients to noodles. Comparable to any of the other places in Vegas I've had japchae at before. Only tweak I would make is slightly less sauce as there was a small puddle of sauce at the bottom of the place.  - Seasoned fries: AMAZING!!! Some of the best fries I've had before. Great seasoning. Not over powering. Great fry where the fries weren't too crispy or too soggy. Just perfect for me.   - Korean tacos: Huge portions! I was expecting smaller almost appetizer portions but these were huge! They were spilling out of the rack holding them. Great flavor and great slaw to help make the tacos not seem too heavy.   Overall, great experience and great food!  Will define be going back! And soon!  Can't wait for them to get their alcohol license and start delivery as I work close by!  (Sorry! I totally forgot to take pictures and just scarfed the food instead)"}
{"text":"I just found out they reopened after checking on my yelp bookmarked pages SO I had to stop by during my lunch  yesterday. We got there at 12pm and they weren't busy so I thought \"GREAAT! Now we can get our food faster!\" They're under new management too so I thought it would be better. We both got lunch specials, half and half (spicy/sweet soy) with steamed rice. There were others that walked in and got seated right away like we did, ordered and got their food before us which is odd since we got there before them and literally waited 30 minutes for ours to finally come out. I knew what I wanted when I walked in so it's not like I took 10 minutes to order you know? I'm on a time crunch when I go out for lunch during the work week (1 hr, like most people) and that's SUPER disappointing! I HATE rushing to eat, biggest pet peeve. I gave 4 STARS ONLY for the the wings which are super bomb for KFC (Korean fried chicken) and fell in love with them since I tried the Boston location a few years back when I went home to visit. Knocked off 1 star for the customer service. The Boston location is MUCH better and in a better spot. I think if they relocated closer to the strip, business would be better. Especially with all the tourists there AND not many tourists stray away from the strip realistically speaking. The servers just need to check on their customers more often, I understand taking our orders and putting it in the system and remembering the time frame of how long it takes to make the dish but just check. I don't think others want to wait too long for what we ordered. It would be different if we ordered the large portion which is 30 wings BUT it was 8 wings, and 4 wings with 2 drum sticks with NO appetizers or other dishes. Also if there was a way to utilize the outdoor seating area with mister fans like at other places that have outdoor seating for the heat during the summer in Vegas that would be great too!"}
{"text":"We were in search for bimibap and found it here! We were so excited to try it.   My first complaint was our appetizer came out AFTER our meals. We told the waiter that since we had our meals we didn't need the potstickers. We basically got an answer of \"well it's here... So sorry?\" We had to argue with him to get it off our bill. I ordered the potstickers \"spicy\" and they were, but they had a good flavor to them.   I love spicy food. I have no issues with it. I ordered my bimibap with spicy chicken. It came with a side of spicy sauce to pour on it. I found it to be way too spicy (which is not normal for me) and decided to only pour 1/8 of it on my food. The over all bimibap bowl was too spicy. It was painful to eat. I couldn't distinguish the flavors in the bowl because it was so spicy. It all tasted the same. I was really disappointed because I was so exited to try bimibap. My husband had the steak bimibap and he said it was really good. My brother had the same bimibap bowl as I did, and he did not put his spicy sauce on, and he even struggled to eat it. He said it was even way too spicy for him.  All in all if you're looking for quick service come here by all means. The service just seemed out of sorts and by all means DO NOT ordered anything with extra spicy sauce on it."}
{"text":"As a chicken wing aficionado, I will finally give my stamp of approval on Bonchon after the disastrous initial grand opening.  The wings were so crispy and light and flavorful, I cannot imagine anyone not liking them.  They are a tad different from the standard fare you find at Wingstop and Buffalo Wild Wings, they tend to be a tad sweet but definitely worth expanding your chicken wing horizons :)"}
{"text":"DELICIOUS!!! the crispy-ness of the wings was to die for!!! both flavors (spicy & soy garlic) were YUMMY!!! chairs were a little uncomfortable if you have any sort of cushion in the booty area."}
{"text":"I have an aversion to all things salty. In the case of Bonchon, I'm not referring to their food but rather the reviews I've read. It's their soft-opening and they've been open for only a few days. Of course, things aren't going to be perfect and there would be kinks that need to be straightened out. With that said, I came with a lot of patience which, I normally don't have.  We were told there was a 30-minute wait which was fine. I brought my textbook to read while I wait. (If you play Pokemon Go, you have no right to complain about wasting your time on waiting). I don't think we waited the whole 30 minutes. A lot of other people are as excited to try Bonchon as you are. No, I didn't see a frazzled/ confused hostess. She was sweet and calm.  I've been to Bonchon in L.A. years ago when it was still open. I've eaten fried chicken in Korea. My Korean friend's mother has made me try her fried chicken. But who the heck cares? Korean chicken wings are simply chicken wings - don't expect anything more/less.   Our server, Carl was awesome. He was the busiest person there and yet, he was calm and friendly. He was chatting with diners while cleaning other tables. He was following up on orders, refilling drinks, taking orders and checking on everyone. An excellent multi-tasker. I was tired for him! I had to tell him he needed a break. Bless his heart.  There were a few items that won't be available until their grand opening. We ordered combos of wings and drums in soy garlic, and spicy. We also got takoyaki and seasoned fries. The wings came out quick, shortly followed by the takoyaki that was brought out by the manager. The fries came out last and Carl was very apologetic but nah, we're cool. The wings were exactly what I had expected (hot, crispy and with flavor that starts as sweet then, savory or spicy) and no, they weren't salty.  Don't come to Bonchon if... You don't know what \"soft-opening\" means You are HANGRY or about to be HANGRY  You expect ranch or whatever dipping sauces they have at B-dubs You are salty"}
{"text":"So we finally dined there.  And we got to try some other stuffs on the menu.    The bulgogi wrap was delicious!   The wings tasted much better when it was hot and juicy, however I found the size of the flats were ridiculously small! Hopefully it will not happen again."}
{"text":"Came in today for their soft opening. It was super packed! The wait was a bit long but the hostess was very apologetic for it and constantly checked in us to reassure us we weren't forgotten. They even brought out more chairs for us to sit while we waited. Our waiter was super friendly and informative. Just about everything we ordered was amazing! They are mainly known for their twice-fried chicken. It comes in either soy garlic or spicy. We got half and half of each flavor. Both were delicious! We also got their salmon avacado  ball, bulgogi sliders, fried shumai, japchae, and bimbibap. I thought the bimbibap was ok. It needed a bit more flavor, but everything else was superb! This will definitely be one of my go to spots in Vegas!"}
{"text":"BonChon was one of my favorite chicken places back in Asia. So when I heard that they were opening one in town, I got excited and of course I went to try it right away.   I mean it's not bad but maybe I was just expecting a little more from this franchise in Vegas. The soy garlic chicken was a little too salty, it really didn't satisfy my craving for Korean fried chicken. Also, our orders took long for it to get out even when it wasn't that busy.   I would've loved to write a review that's a little more detailed but honestly it wasn't memorable, I just recall that I didn't have the best experience here."}
{"text":"Best freaking chicken ever!!! The garlic is so flavorful and delicious and the spicy has an amazing kick between it I always get the meal with both. Literally my favorite place for wings."}
{"text":"I was excited to try this place because of all the hype and reviews and it does live up to all of it. The service was great and all the servers checked up on our table and took the time to explain the menu items and answer any questions we had.   The fried shumai was good with a crunch and not too oily. Also got the potstickers. The spicy was a bit too spicy and it lingers in ur mouth so wasn't too much of a fan.   Got the small order of half and half wings and strips and it was enough to share between the three of us. Both flavors were delicious and the spicy flavor wasn't too spicy like the potstickers. The only thing was that the strips were just a bit on the dry side."}
{"text":"Y'all are crazy. This place is freaking delicious. Despite the misleading name (Banchan = Korean side dishes), we DEVOURED our chicken wings in like 5 minutes. We got a medium combo, half soy garlic/half spicy. The wings were soooo flavorful, crispy, and tasty. Maybe my standards are not high enough because I ate food here as take out and so I approached it like a chain fast food joint? Either way. SO GOOD. I would eat the wings here over any wing joint in my hometown if one opened up."}
{"text":"Ever since I heard about Bonchon opening up in Vegas, I was excited for it to open! I love when restaurants from other places open in Vegas because to be honest, Vegas used to have nothing. I would usually go to other places like SoCal to try popular chains and stuff. The chicken at Bonchon is A1 for sure. I love the spicy and soy garlic wings! If you like chicken, come thru! I also like how they provide radish with the chicken. In addition, their bulgogi tacos are really flavorful!"}
{"text":"Best fried chicken in town!!  Service is excellent and great atmosphere! We ordered the usual medium wings half soy garlic half spicy and bibimbap. Loved this place when it first opened and love it even more when it reopened!  You should try the salmon ball! It's delicious!"}
{"text":"This place is dangerous!  Meaning obesity is knocking on my door, since I want to eat this everyday!  I fell in love with Bon Chon when I was living on the east coast and this place serves up the same super crispy chicken with finger lickin' soy garlic sauce.  Okay, yes this is expensive fried chicken...but it really doesn't compare to other fried chickens.  Jollibee is a runner up maybe...  Once you taste the chicken you will understand the superiority to other fried chicken joints.  The 5 stars is just for their fried chicken.  The takoyaki is kind of disgusting...overly sauced and mushy....please skip.  I always get a side of pickled radish and rice to go with my chicken.  I ate four drumsticks in one sitting and then went straight into food coma status.  The best part is that they have NFL Sunday ticket, so my husband can enjoy his football and I can eat my chicken."}
{"text":"I tried Bonchon and really liked it. I've eaten at Bonchon in a different city and had fond memories of their fried chicken. I didn't try this Vegas location before the re-opening so I can't speak to the changes.   I will say the chicken was glorious. We ordered the medium sized wing and drumstick combo with half soy garlic and half hot sauce. The chicken was perfectly crispy outside and juicy inside. Both flavors were yummy but we preferred the hotter one. The pickled radish is a nice cool down for the mouth. We ordered a side of coleslaw, it was okay but really not worth the price. They were out of the kimchi coleslaw, which I really wanted to try.   We with be back for the fried chicken for sure"}
{"text":"Why are you always closed?! I hope you read all the negative reviews about your hours.  I have been craving Bonchon for a month now and your 11-2, and 5-9 hours do not work with mine or anybody else's schedule.  FIX IT!!!"}
{"text":"When I went, it was only a day after their soft opening, so it's understandable that the workers were still in training and a bit slow. The chicken is definitely on the pricier side, but it's definitely worth the price as the taste is completely different and better than what you would find at other chicken joints we know of like KFC or Popeyes. If this is what all Korean style fried chicken tastes like, I love it!   I ordered the chicken strips and tried the soy garlic. I also got the seasoned fries as a side dish. As for the soy garlic, I definitely dig the taste! However, considering that I'm not much of a sweets person, I got tired of the taste on my last 2 pieces of chicken. Yes, the soy garlic definitely has a sweeter taste to it. However, I think I can balance that on my next visit by getting a half and half and trying the spicy chicken. As for the the fries, it was one of the crispest fries that I've ever had and I absolutely love it. Definitely something I'll order on every visit. It's a must-try!  The reason why I give this place 4 stars is because of the air conditioning problem they had. It was definitely hot in there. Well, probably for other people, it's fine, but I enjoy being seated in cold temperatures, the same as other restaurants. Maybe they had problems with the contractors, but I definitely regretted wearing a white shirt that day."}
{"text":"Highly recommend!! Potstickers are a great appetizer also. Tiny bit expensive but worth it. The spicy sauce is definitely spicy so beware! We will definitely be back and recommending this place to friends."}
{"text":"Ordered take out at 6:58pm and it is now 7:53pm and no sign of my food. We already paid or else we would have left. It appears that only 3 people are working the floor (which is slippery with grease btw) so who knows how many are working in the kitchen."}
{"text":"Having tasted authentic Korean fried chicken, I had high expectations for this place. I was ironically told by a 10 year old that this place wasn't that great, I should have taken her advice. We order dduboki (spicy rice & fish cake & ramen noodle), when it came out, it \"looked bad/not good\" and the noodles and rice cakes were over cooked and mushy. Our waitress asked how was it? And I thought jokingly to myself \"the best part was the cheese\" referring to the mozzarella cheese melted on top to cut down on the spice (we asked for it on the side vs on top to adjust how much gets added). The chicken came out and the crunch was good and the chicken was tender on the outside but there was only as slight difference in flavors between their garlic soy and the \"spicy\" (which wasn't spicy). When you think of legit Korean spicy sauce you expect lotttts of garlic, vibrant Red (gochujang/Korean pepper paste) sauces, and full flavors but I didn't care for either sauces and they are authentic Korean fried chicken dressings/sauces which are thicker and ooey-gooey. The pickled radishes were ok but not the best I have tried. I wasted my cheat meal on mediocre \"Korean\" fried chicken, so I was pretty disappointed. Most likely will not be back again."}
{"text":"Imagine going to a Starbucks and the coffee they serve is nothing like the thousand other Starbucks you've been to.  This is what this Bonchon location is like. I've been to 3 locations in No CA and this place is nothing like them.   They use smaller chicken. The wings at the other locations where much bigger. Maybe the other places use chicken pumped up with roids?  Not sure but the wings here are definitely much smaller  Their spicy chicken tastes nothing like the spicy chicken at the other locations.  On a scale of 1 to 10 of spiciness, the other locations would be at a 6 while this place is at a 10. It's overly spicy that it's hard to enjoy. Mind you, I love spicy food and this was a bit much for me.   The soy chicken was good.   The manager is extremely nice and accommodating. Service here is good.   The bad review is just based on the fact that the food is not what Bon Chon is suppose to taste like.    Imagine going to a McDonald's and their Big Mac is nothing like all the other Big Macs you've ever had."}
{"text":"KFC! KFC! KFC ! ... and I don't mean the fast food chain ... KFC = Korean chicken wings ... yaaaaasss !!  I know it's popular in LA, so when I heard about this place I definitely wanted to check it out and yes it did not disappoint.   Something about the super crispy wings you can't go wrong.   I would definitely do the half and half, half soy garlic and half spicy.  Now if you can't handle spicy after a few wings you're going to have to eat some pickled radish to help soothe your tongue.     On top of good food, our server Mina was super friendly and attentive.    Bonchon, definitely a place we will be visiting again soon."}
{"text":"Best place for Korean Froed Chicken, appetizers are a bit expensive.  The chicken is crispy and the sauce is drizzled over the wings (if you get it).  Ttoekbokki is pretty good too.  The rice cakes are cooked on the firmer side, not overdone!  The sauce was a more liquid consistency than I like but tasted good all the same.  It wasn't very spicy, so if you like it that way make sure to ask for extra spicy.  I recommend going around dinner time."}
{"text":"We finally tried this place a few weeks ago for a Friday office lunch outing.  It is important to note that they open at 11:30am not 11:00am.  I recognized a sewer smell upon entrance and we were seated in the relatively small indoor dining room at a table with cold metal chairs.  The service was good but food was just basic fare...chicken strips were okay but actually found the bulgogi Korean tacos to be best of the food we tried.  Our overall experience would not lend any of us to want to return for lunch."}
{"text":"I had never even heard of Korean fried chicken before last week, and now I can't stop thinking about it ever since I ate Bonchon's perfectly crispy, well-sauced version. I had the pork belly bao appetizer, drumstick wings with soy garlic sauce, and seasoned fries. It was all delicious! Some of the best fries I've ever eaten.  I'm a \"sauce person\" and I loved their soy garlic sauce (a glaze consistency) which was a perfect mix of sweet and salty. Not only was the food delicious, the service was impeccable. Our server made sure that we liked the pickled radish that comes with the fried chicken (which we did) and offered white rice if not. He was very attentive and told us about other popular dishes for our next visit (which will be very soon if I have anything to do with it). PLEASE visit Bonchon and fall in love with their Korean fried chicken, as I have, so that we can keep this amazing restaurant alive!"}
{"text":"How, oh how, does BonChon keep the skin so crispy and the chicken so tender? Service is always quick, and plenty of friendly faces to go around. I love introducing friends to KFC (korean fried chicken) and watching them become converts for life. Ok, here come the cravings...!"}
{"text":"We got here around 7PM on Friday night but didn't wait so long to get served ( about 10 minutes). We ordered fried chicken wings with spicy sauce and garlic sauce and bulgogi sliders. The sliders were good but they were smaller than we expected. The fried chicken wings were not well marinated. Overall, we would come back to try anything else rather than the chicken wings."}
{"text":"Overall, it was okay. Somethings I want to comment about is their spicy chicken. It's not your ordinary spicy korean fried chicken. If you are expecting the flavors of bistro q, it's nothing like it. It's a mix of Tabasco and gochujang with a lot of sugar. It was not the flavor I was expecting. Their soy garlic was alright except for the fact that it was more salty than my preference. If you are used to kyochon in California, it's more salty than Kyochon. It was okay but I don't think I'll visit again."}
{"text":"Amazing food!  Korean tacos were spicy and delicious! The wings are crispy and not greasy. Can't wait to go back."}
{"text":"LOVE Bonchon! I discovered them in the Philippines & was so happy to find out that they were opening a location I. Las Vegas..  Their chicken wings are just so good! I usually get the Soy Garlic because the Spicy ones are too hot for me.. Service is also great, everyone is very friendly. The place is quite big, good for families!"}
{"text":"I can't say I am a fan. I came here with my Korean friends, and we have all had better for better prices. Heck, just drive down the street and get Soyo's chicken.   First off, the service. We had never tried Bonchon's before, and we over-ordered by far. While the waitress doesn't have to stop us, I think it would've helped if she at least explained what drums and wings were and how the portions worked, especially after hearing we'd never been there before. For a party of 3, we spent $90, and she still had the nerve to ask us \"And what else do you want?\" She was sugary sweet when handing us the check, but that was the only time.   Next, food. The chicken is not for me. There's way too much batter, the flavor is weak, and the chicken is whatever. I'd hands down go to Soyo or Mama Oh's, both of which are just a few blocks south. We also tried the kimchi coleslaw and seasoned fries. The coleslaw was nothing to be impressed with, but for 3 little cup sized portions at $10, definitely not worth it. The fries were $7 and comes with 1 tiny little dipping sauce.   I have no intention of coming back, especially when there is a plethora of better food within a few minutes drive."}
{"text":"The establishment is smaller than my friend thought it was. There's an outside area but it's way too hot right now to be out there and suffering XD. The inside area will definitely fill up easily since their name is so popular. There is a bar area as well, close to the entrance to the patio area.   For their wings, they come in small/medium/large sizes and you can order just wings, drums, or strips. Love this since I only like wings.   Your whole party has to be present to be seated. Parking will be limited as long as it's busy enough (which it should be). Closed on Sundays. 12-8pm hours as of right now. Bill splitting is good to go as well.   In terms of sauces, you only have two choices. Soy garlic and spicy and you can do half & half.   Our server was really nice but wasn't very good at refilling water. The rest of my party had all finished their water and had no refills for awhile. Had to ask for refills twice.   The wings and strips are both really good. I love the soy garlic sauce. Spicy was too spicy for me personally so I would probably stick to the soy garlic.  We will definitely be back. Their local website is: http://swlasvegasnv.bonchon.com  EDIT: had a friend pick up to-go the next day and got strips instead of wings :("}
{"text":"I really wanted to give you 5-stars. But when you have a 1-hour lunch break and it takes almost 45-minutes for the food to come out, ugh..... and, I get tired of all the excuses of restaurants being short staffed.   The food itself is excellent! I purchased the lunch special combo half and half with steamed rice for $8.95. I had enough time to eat a wing and a bit of rice. Then I had to go back to work."}
{"text":"The place is pretty small but their chicken wings are huge in flavor! Soo good!! Our waiter was awesome and checked on us often. I'd come back for them wings."}
{"text":"Service here is so bad. i ordered ahead of time and was quoted a 30min wait. It's been 50 minutes already and I was still waiting. They were so disorganized and werent sure if they already gave me my order. smh.   Staff is quite unprofessional as well. They were bad mouthing a customer by the podium and all of us in the waiting area heard it. It makes me wonder if this is how they really treat their customers."}
{"text":"They have the best fried chicken and fries in Vegas! Must try. Step by there for family vacation. Found out this Korean fried chicken here under new management."}
{"text":"The place is very clean, staff was nice and professional, and we were served in a timely manner. We found it to be a little pricey and I'm not accustomed to being  charged for kimchi. We had the boneless wings which we enjoyed and shrimp dumplings that I didn't enjoy as much due to me not caring for minced foods and it didn't have much flavor outside of the sauce that was on it. We also tried the Bulgogi which we would have preferred to be a little sweeter."}
{"text":"This is the very first time I am writing a review and it's not even about the food. The food was great but the service was horrible. We ordered 5 items. We had to send back the bimbimbap twice due to server error. Our kimchi and rice was forgotten and had to wave down the lead server to get it corrected halfway thru our chicken. When we got the kimchi, it looked like a hot mess and when the server was told that this was not kimchi and that it was coleslaw, he proceeded to say it was kimchi. Finally, the lead server came over and corrected the error again. Our server then came back from the kitchen and  gave us the kimchi after blaming the kitchen for the error. When we got our check, we were over charged for the bimbimbap. Final straw, he gave us the corrected bill without a pen. Ok, I get it, it was his first day on the job, but dang he blamed everything on someone else and proceeded to have errors after errors throughout the course of our dinner. The best part was when the lead server commented to us that our server was lost. Awesome, right!?!?!? It's so sad when the food is great and the service does not live up to it and leaves a sour note to the experience. Would not recommend this place until they get their act together. Best of luck. Will stick to Soyo for now."}
{"text":"Food either tasted bland or ridiculously over spiced, none of our 6 dishes were a winner. Service was slow, the first item took 20 minutes, and my wife's entree was not brought out until after everyone else was completely done eating. Won't be going back, there are much better choices."}
{"text":"It may be a chain, but it doesn't disappoint.  Great chicken! And the people are very friendly."}
