{"text":"Summary: Overpriced and mediocre tasting dim sum dishes, with below average food portions..won't be back again.

Came to this place to try it out on a sat morning, outside the restaurant there's a sign claiming there are more then 500 kinds of variety of dim sums available, however upon reading the menu, there's at best 50 different varieties of dim sums dishes. 

Pricing are significantly higher then the popular dim sum places in Markham and Richmond Hill areas, however the food portions are noticeably less.  Food flavoring is just average withoit any significant mentionables..it seems that they are trying to offer an upscale dim sum experience, reflecting from the decors and price level they charge, however the food quality and value has not kept up with those expectations..will not come back again. 

Staff are friendly though and food was fast, hence the 2 stars."}
{"text":"I was there for Dim Sum this weekend and it was such a pleasant experience. 

- The service was warm and their refill of tea is very frequent and in time (a lot of the times we had to have our hands raised and ask for refills all the time at other places). 
- The Dim Sum was just not only very tasty but also aesthetically appealing and interesting (esp. their piggy lava bun, is a must try!!!)
- You have to pay attention to their interior design as well as their use of utensils. I am pretty positive that their plates and chopsticks are things you cannot easily find at other restaurants. The place had put so much thoughts into having the best quality of utensils for the best dining experience. 
- We also had a peek at their dinner menu where they have a wide selection of choices and they all looked worth of trying. 
- Will definitely come back for both Dim Sum and Dinner!!"}
{"text":"Bonflavor is one of the few places in the Willowdale area where you can get dim sum.  Unfortunately, that doesn't make it good.

One good thing about this restaurant is that it's near Centerpoint Mall, so there's ample parking.  But just look at the banner outside and you'll see:  Its so-called dim sum special (before 11AM) still has each dish costing over $3, more expensive than any place I've tried in Chinatown, and the price looks even higher compared with the places in Markham and Scarborough.  This place even adds a surcharge of over a dollar per person for tea, a cheapskate move that immediately lowered my esteem of it.  Service was okay, staff was courteous, but the wait time for the food was substantial.  And the dim sum menu is very small.

The food looks better than it tastes.  Because of the sky-high prices, I ordered only three dishes.  The Phoenix Talons (fung zau, ??, chicken feet) are all right, but for such a high price, you get a pretty small portion.  The pork dumplings (siu mai, ??) are fine, softer than most places and tasting like they're not as overstuffed with MSG.  The deep-fried shrimp dumplings (??), however, are literally the worst I've had anywhere.  They look and taste like they were left frying for too long, and the insides are way too salty, with an aftertaste that I normally associate with seafood that isn't fresh.

The decor isn't even all that great, a spartan wood-and-white-paint kind of deal.  Seating is comfortable enough but nothing special, either.  For these prices, I can get five or six dishes somewhere else.  I feel like this place wants to be upscale but falls short on both visuals and food quality."}
{"text":"we try the lobster yesterday.amazing??And also have good service.I'd love to come again??"}
{"text":"It was our first visit to this new restaurant on a Saturday early afternoon.  Our table for 2 was available instantly.  Surprised.

A server recommended chicken and thousand year egg congee as today's special to us.  We \"casually\" asked him if there's added MSG to the congee.  We immediately got a lecture from the server.  \"We add MSG to all of our meat.  How can you cook meat without putting MSG to it\", he lectured us in a \"matter of fact\" manner.  His tone made us felt we were naive and asked a stupid question.  We are allergic to MSG, and seriously considered walking out.  It was pouring outside.  We had to give a chance to this new restaurant and challenge our bodies' reaction to MSG.

We obviously avoided the congee and order other dim sum plates.  We tasted MSG in all dishes.  To our dismay, we found the restaurant used fresh and good ingredients which should taste very well without MSG.  

There are many other restaurants which pride themselves for not adding MSG to their dishes.  If our server represents this restaurant, this place takes a very serious philosophical attitude about using MSG in their dishes.  Good luck to the business owner.  I am glad that I have many good choices elsewhere.  I also do not have to make myself feeling stupid after asking questions about food that affect my health.

When we left the restaurant at 1:15 p.m., the rain stopped and tables were still quite available."}
{"text":"Tried out this place after noticing it open up a few months ago. First thing I noticed was that the decor was clean and modern, reminiscent of some of the higher end dim sum places I've been to. The menu had all the classic dishes like har gao and siu mai, but also had some unique dishes like Thai style prawn rolls and pig shaped custard buns. Our order came out quickly and everything tasted amazing. Flavors were clean and fresh, without being too oily like some of the cheaper dim sum places. I'll definitely be coming back to try out the rest of the menu!"}
{"text":"Brutal. I went during their soft launch. I waited 20 minutes to be told they are not serving dim-sum or ran out... Brutal either way. I then ordered what read to be a spicy chicken dish...........which ended up being Kung Pao Chicken... sigh....the fried rice was decent. I asked to pay with card and was told their processing machine did not arrive. Yes...... I was asked to walk down the strip plaza to an ATM. A comment as such is so uncanny I am forced to suspect it was the waiters first day in public and first interaction with a human being. I was able to find cash in my car, still tipped (always) regardless of this poor experience and did mot receive a thank you or a \"have a nice day\". 

I'

RE-VISIT:  A defensive and \"finger-pointing\" response. Thank you for validating my review"}
{"text":"Went for dinner.

1. Above average/great decor

2. Food was unfortunately mediocre - see uploaded pictures of mine

3. Sauteed sprouts with garlic - chewy, tough, overcooked.  Another table had a different vegetable and said it was overcooked and when offered the same dish declined

4. Spicy Dan Dan Noodles - intense flavour, great texture

5. Griddle Spare Ribs - dry, practically no meat, very tough, and again overcooked.

6. Good service, but suggest waiter/waitress polish up their English  (not talking about accents but often it's difficult to make out what they're saying. Many lower-rung restaurants in Scarborough have higher degree of English fluency, not to mention a few other ones nearby serving a similar clientele e.g. Congee Queen, Asian Legend, Legend, etc etc)"}
{"text":"Best dim sum ever.  Everything was fresh, not oily, and seasoned just right. Staff might get very busy, but we got what we need.  My favorite dim sum place in Toronto."}
{"text":"We were here for dinner a few days ago (check my previous review) and came back for their weekend dim sum. We aren't disappointed with the dim sum quality, we had:
1. Steamed pork siu ma - decent size and flavor was good
2. Chicken feet - sauce not too rich with the right flavor
3. Rice noodle rolls with shrimp - shrimp was big compared to many dim sum place, the rice noodle roll skin is a bit thick to my liking
4. Fun Gor (light mixtures of ingredients like finely chopped pork, chives, peanuts, cilantro, salted turnip, and dried shrimp.) - this one is good we love it
5. Taro wrapped pork ?? - the best of all the dim sum we tried, just the right amount of taro, fried to perfect, not greasy and with the pork fillings was tasty too
6. Sweet custard buns  ??? - the filling was so runny (make sure you get your mouth ready!!!) and have the right sweetness but the skin was too thick and a bit dry
7. Steamed shrimp ball wrapped in sticky rice - I actually thought it was a good shrimp ball, well, a big one, which literally wrapped in sticky rice. It is with real shrimp but the sticky rice was falling off from the shrimp ball and I saw other yelpers pictures, ours were missing the fish roe on top. (see my picture, the presentation is actually really bad!) They really need to improve the presentation! 
8. BBQ pork puff pastry - the pastry was flaky and the BBQ pork flavor was good. We like it!

Overall I think the dim sum were good, the restaurant was newly opened so there are definitely room for improvement. Price was acceptable but service was really good, interior decor was nice, very bright, clean and spacious. We are happy to find a dim sum restaurant in the Yonge and Steeles area, we would for sure come back to give another try."}
{"text":"I had a great experience at this restaurant. Ever since I can remember my family has been going to this dim sum spot. I only found out recently that they've renovated and changed the name. Not sure if it's still owned by the same owners though. The decor is absolutely stunning. Minimal and modern. Instead of having the dim sum carts like they used to, the food is made to order. It did take longer than usual but it was delicious. The rice rolls with shrimp were super yummy, along with the siu mai and har gow, which was my favorite. The BBQ pork buns were phenomenal, and the bun itself wasn't at all dry. Despite the great food and beautiful decor, the prices are pretty high, which is a bit disappointing considering the price it used to be. I guess we're paying for the higher class experience? Overall, I would still go back!"}
{"text":"Totally disappointed by the dim sum. The tulip cake turn bad  ( sour taste) the baby octopus turn bad, the dumpling meant were uncooked.  I don't think the restaurant is for dim sum. Server is not willing to help and un-organize.  Not worth to try."}
{"text":"We have been to other restaurants in the same location and loved the dim sum carts.  So easy to chose and loved the ambiance.   When we saw new ownership and no more carts we were hesitant to try Bonflavor. We were so surprised at the quality of the food.  It was easy to order on a check off order form and the shrimp dishes were all extraordinary.  We happened to go mid-week at about 2:30 and all dim sum was reduced in price.  Can't wait to go again and have a good quality dim sum restaurant in our area."}
{"text":"Very poor managed restaurant! Dim sum served cold, floor is so dirty and sticky! No more visit for sure in the future."}
{"text":"Enjoyable atmosphere: tasteful interior decorations. Excellent food! Very recommendable service. Deserves a 4.5 star rating.

Cash Discounts available."}
{"text":"I was really happy to see this store improved a lot from its first opening. Me and my boyfriend went there yesterday around 1pm. though the store was packed the server quickly arranged us a 2ppl seat. We ordered: shrimp dumplings, egg tart with birds nest on top, piggy bun, steamed chicken claws w/black bean sauce, pineapple buns w/BBQ meat in it, and other dim sums I can't remember the name. They were All SO GOOD. Especially their famous piggy bun was so much fun. So in general, quick arrival of food, nice tasting, friendly servers, good decoration. I will come back again at their dinner time to check dinner items( I saw there was a 2ppl dinner set with three course and all with lobster in it costs only 30!) 

Tips: they have free wifi available and the dim sum now is having a promotion. Before 10:30 all s/m/l dim sum is all 3.18."}
{"text":"I came here for dim sum on a Friday. The place was half empty so we were seated quickly. 

Service: it was acceptable, they were not rude. They didn't put anything on the table loudly like they do at many other Chinese restaurant. Food came out relatively slowly, which is good if you don't want to feel rushed. 

Food: tasted good and fresh. 

Ambiance: everything looked fresh and new. 

Cost: I ordered 9 items for two people, came out to about $56 (including tip)."}
{"text":"I was excited to try this restaurant because of the good reviews of the custard bun and food in general, but I left the restaurant with disappointment.

I arrived in Sunday afternoon and the wait wasn't long. I just had to wait for the next table, which was about 10-15 min wait.  The decor inside was simple, nothing too fancy compared to the dim sum restaurants in Richmond Hill.  Services was not too good, there were a few people quite rude but there was one person quite helpful.

Food was mediocre, nothing compared to the RH quality but they are charging about RH prices. The tea was not good but they charge $2/person.  The custard bun was so so. The custard was good but the bun was quite hard. I would say the food quality is very average. I would expect more for the price I'm paying.

I would not recommend this restaurant to anyone."}
{"text":"Really really bad service! Rude sever, I don't think these severs have been trained before work at this place! The food was extremely suck and expensive! When I was asking for bill, no sever came for 15mins till my baby was crying cuz of long time waiting, I went the front to pay with no any tips! Never ever back to that disgusting place anymore! Bullshit! And the funny thing is, the owner saw my review and chatted with me , threatened banning me because I tell everyone the truth! That's cool"}
{"text":"Super crazy, first thing arrived to restaurant -not sure where or who to speak with to get a stub for a table. 

Waited 1.5 hour for a table and a long time for food. A girl took our dim sum paper and first wrote wrong table # (over heard another waiter yelling at her. FYI - theres a sign with the table # at the center of the table!)  then the dim sum paper was left on counter and did not input into system for the kitchen. we had to chase order then find out it wasn't input. 


Food 4/5* not bad for food in terms of plating, flavor and sizes. After order went in, everything we ordered came out very fast. The fish congee $5.99 was a good portion size, and the fillet was grouper not frozen basa. 

When food arrive, there is was no bowls or plates. 
Seem like a lot of people were complaining and unhappy. This place was filled with negativity.

Limited seats, environment seem like it is for dinner or set dishes, not the typical Chinese dim sum place. Spacious environment yet not enough servers. Everyone is new on the job, inexperence with serving as well as running this type of restaurant. Servers need to open every dim sum dish to see whats in it and process slowly. 

Perhaps it is their first day, but very disorganized. Require more training for everyone and the flow of how the system works needed massive improvement! Sitting here is quite entertaining (pun intended), lots of conflicts and drama to watch."}
{"text":"Terrible service.  Loads of staff standing around moving carts of dishes but no one being taken care of.  Waited 15 minutes to be approached at the table.  Restaurant was at half capacity so really no excuse. Average quality food"}
{"text":"Update: I came back here with my dad (he's a chef so he obviously critiqued everything haha). The food was again, mediocre but we did really enjoy the seafood chow mein. It was very refreshing and delicious! Would definitely try out their dinner menu next time in that case."}
{"text":"We came twice for morning dim sum, and once for  afternoon tea. We enjoyed most of the dim sum, especially the steam rice rolls. I do have one suggestion, the soy sauce in the bottle that came with the rice rolls was cold, it would be nice if the sauce was heated.  The actual dish that the rolls were on was also cold, warmed dishes would be a plus!"}
{"text":"Would have given 3.5 points but the server we had was nice and made our day so here is your 4 points. Came here on a Sunday for lunch with my parents. It's is tucked into the bottom of a strip plaza. Parking lot is a bit confusing and quite packed as they are lots of restaurants but limited parking space. Upon arrival, the place is moderately busy, the restaurant is full but we are the only one waiting so we got seated in 5 min. The decor is relatively simple and not ethnic like most other Chinese dim sum place. 

For the food, everything are above average. The highlights are the siu mai, steamed piggy custard buns, fried tofu rice noodle roll and fish fillet congee. As a Cantonese myself, I had tried most of the dim sum place in the GTA and this is a nicer one and one of the best in North York (the other one would be Crown Prince on Victoria Park Ave). My family all agreed that the Siu Mai is the best we ever had. The pork is flavourful while tender.  Steamed piggy bun is not only cute but the custard filling was tasty too. Just the skin could have been a little moister. Rice noodle roll was nicely done and very fresh. The tofu inside was freshly deep fried which gave the rice roll nice combination in texture, silly smooth on the outside and crispy inside. The fish fillet congee was also quite nice and so are other dishes we ordered (har gao, pan fried dumplings, xiaolongbao etc.)

Overall our experience here was pleasant. The service was different depends on which server you gets as they don't assign a server for each table. One server we had was welcoming and chatty while some are grumpy and lacks patiences. We got seated at the booth and saw some food residue near the window sip and on the floor. The food are nice and we got discount for sharing their restaurant on social media and paying cash. They also offered a 17% off on our next visit when we share them on WeChat (the Chinese whatsapp) I will come back as it's nice Chinese restaurant at a convenient location for me."}
{"text":"Went there for dim sum.  Food is good, service is average, ambient is average."}
{"text":"Amazing food?Service was great?quick and efficient. I like the dim sum there and I tried the new release \"crab and lobster on the rice\". Still?there are items I can't wait to try.Excellent?Highly recommend. Would definitely come back again?"}
{"text":"Most dishes I ordered are not better than the similar items you can order in T&T supermarket's food court, but t&t's dim sum is a lot cheaper. The juicy steam dumpling I ordered had the raw pork meat taste, totally unpleasant, I don't think there r many restaurants could do worse than that. I give 1 star for the overpriced dim sum, and 1 star for their logo, their big logo in Chinese character outside might be the only thing I like about this place. I wont go there again and probably wont recommend this place to any friends who just want to enjoy the decent dim sum.
I received a message from the owner of boflavor, Luke W. after I posted my review. This is what he said: \"We do get the dumplings from TNT market, I am glad you find that out.\""}
{"text":"I remember this place despite having pretty good dinsum, foods took forever to come out and they didn't seem to bother about customers. Not surprised they closed down"}
{"text":"After trying this place once and reading other reviews, I must conclude that this place has different chefs on weekends and weekdays. We came on a weekday morning. It was nearly empty. After seeing people line up for this place on prior weekends, and finally getting to try, we felt very disappointed.

This place is evidently trying to brand itself as a high end place. The decor, utensils, and plates are certainly nice. But the food is definitely crappy. Like Miu Garden or Landmark Restaurant level crappy. But the difference is Miu and Landmark are dirt cheap so they still attract customers. 

We ordered several dim sum items and one fried noodle plate in the morning before their lunch hours. Their S starts at 3.75 and goes up. So it's pretty steep.At this price range you would expect finely decorated dim sum, non-oily food, no msg, and using high quality ingredients. Nope...the only noticeable achievement was not using msg (or so I think). The fried items were even greasier than the cheap dim sum places. There's no decoration on the food aside from nice plates. We had the beef ball (english name escapes me) and the color was funky. The bean curd veggie roll were simmered in too much sauce. Crazy!

The portions were smaller too. Most places give you 4 beef balls in one order. This place gives you 3!!! . The only items I did not have a problem with were the fish congee and the fried noodles. The fish congee was fair at 5.99 and didn't taste like msg. The fried noodles were...ok. For a place that charges 3.75 for S dim sum, and only $12.99 for fried noodles, I would say the noodles are much more worthwhile. 

Good service doesn't make up for mediocre food. My guess is...this place caters to western people who don't understand Chinese food enough to criticize. Western places seem to emphasize service more than the food. Go to Congee Queen across the street instead which is less contentious, has decent decor, AND have (mostly) good food."}
{"text":"Good location... Lots of businesses and people in the area... But it was quiet at lunch time.  The XO beef rice noodle... Had nice tender beef and good portions but it didn't have much XO flavor.  Just spicy hot.  Also had preserved salty fish and chicken cubes fried rice... Again not very flavorful... Really wanted to find good Chinese food in this area... Haven't tried the dim Sum... Looks like the dim sum menu is small. Special Prices before 11am on weekdays and 10:30 on Saturday."}
{"text":"One of the best dim sum places I've ever tried in Toronto. Top notch quality.
The egg-yolk bun is the BOMB.com. The filling is so liquidy that it actually drips all over your plate! Serves a great selection of both traditional and their own specialty dim sums. 
Would definitely return for their dim sum and dinner menu"}
{"text":"Came here for Sunday morning dim sum. There was no wait. Good dim sum. It's very fresh. Average price is $4-5/ dim sum (a bit expensive than other places). They also have congee that's not on the menu so you'll have to ask.

You get 5% off if you pay in cash. They also gave us a 15% off coupon to use for our next visit (expires sept 1)"}
{"text":"We came here in the morning just in time for the special dim sum prices! There were a lot of parking spot available, and the place was smaller than most dim sum places, but it was fairly clean. We were seated immediately and the waitress and waiters were very nice.

The cost of tea per person was reasonable-it was $1.20 per person. We were presented with a sheet for the dim sum and a few menus for dinner options etc. There wasn't too much of a variety for the dim sum, and I must say, this is fairly pricey for dim sum if you don't come early for the specials. I'm glad we came early for the specials. 

We ordered (I might not be typing the exact name on the menu):
1) Egg Tart with Red Bean
2) Har Gow (Shrimp Dumpling)
3) Chao Zhou Dumpling (Chives, Meat and Peanut Dumpling)
4) Piggy Bun with Flowing Custard Filling
5) Spring Roll wrapped in Rice Noodle Roll
6) Fried version of a shrimp and chives dumpling

The waiter was fairly nice and let us know that two of the items on the menu were not in the special list - which were the har gow and the piggy bun. We said we knew and thanked him. The food took a little longer than regular dim sum restaurants to come, but it was still okay.

1) The Egg Tart with Red Bean came first. It was a little disappointing because the egg tart was cold, for a longer wait time, I would have expected a nice hot egg tart. The egg tart was an average sized (smaller than the ones you would buy at bakeries) and it has a pastry shell. I thought that the red beans were a little off in the taste, and in addition, each egg tart only had 3 red beans which sunk to the bottom of it. Perhaps, it would be nice to have a red bean paste with a custard paste? What bothered me the most about this dish was that at the end of the meal, we found out that this costed a little more than $5. We found out that there was a notice at the front door stating this, but nothing on the dim sum sheet. I don't think it was worth paying a little more than $5 for cold smallish sized egg tarts with 3 red beans inside. 

2) The Har Gow was also smaller (but bite'sized) compared to other places, but I really admired the shrimp here. They were very clean - the intestine in the shrimps were carefully picked out and the green har gow in the middle of the other shrimp dumplings gave it a pleasant presentation. There were a total of four har gow's with a middle green mini version of a har gow.

3) I can't say anything about the chao zhou dumplings, I didn't eat any of them, but the presentation looked standard.

4) The piggy buns are super cute. I've seen quite a few piggy buns at Chinese Supermarkets, but this is the first time I've seen it at a dim sum restaurant. The filling definitely oozed out and it tasted quite good!

5) the spring roll wrapped in rice noodle roll tasted mediocre to me. I didn't really like the combination of these two - I usually order this at other dim sum restaurants, but the large size of this and the actual spring roll didn't seem like a great blend it for myself personally. (I know it might taste great for some other people).

6) The fried version of a shrimp and chives dumpling was probably my favourite dish. It was nice and hot, came with a decent presentation and a rather good size.

There was also 12% off, I believe the tea price (Haha, I wasn't the one who paid clearly), coming to a total of roughly $32."}
{"text":"APPERIANCE: 
guess the day we went news year it wasn't that busy the time we went there.. they renovated the place from the last time I have been here. It's very clean new tables and chairs.

SERVICE:
We had at least 3 people serve us I don't really know why but we had I guess the manager and 2 waiters. The manager treated us like we know nothing about Chinese food or dimsum when we already informed him we know what dimsum is, but I guess other people would be happy that they have half the staff cater to them. Some dishes were quick to come out like soup and rice dimsum we had to wait for a bit. We had to ask for glasses of water napkins and soya sauce and hot sauce(btw their hot sauce is just Sriracha)

FOOD:
We got 2 kinds of soup hot and sour and chicken and corn.. hot and sour was really good and chicken and corn was very bland needed soya sauce for sure. I don't recommend getting their fried rice it was very hard and too much green onion.. we got this glass noodle dish that's suppose to come out on a sizzling plate it came out on a plate but not sizzling.. we ordered Chinese broccoli with Beef and braised bean curd with vegetables beef was tough to chew and the braised bean curd dish just taste like star anise which isn't a great taste when it's too much..
DIMSUM:
Chicken feet spare ribs shrimp dumpling soimai cuttlefish fish fried shrimp roll their dimsum was really good I enjoyed it especially their chicken feet..

Overall will I go back I don't think so I would choose other dimsum/ Chinese restaurants but they did have good service.."}
{"text":"Terrible attitude!!! the reception lady yelled at us because two of our party were late due to unanticipated circumstances. She thought we \"tricked\" her to get the reservation and threatented that she will never take our reservarion again. She could have arrange a smaller table for us instead of yelling at us. Not going back again. This attitude is not acceptable!"}
{"text":"Came out on a Monday morning with some family (total four of us) to have some dim sum in this area. I've noticed there aren't many in this area and hence it was actually pretty empty when we came in. There were glass total of four tables occupied including ours and two servers on the floor. The decor was nice, not the traditional banquet hall that you would expect and it generally looked pretty clean. 

We were greeted and seated immediately which was pleasant. We asked the waitress if there was a special on for Monday mornings and she advised dishes marked small, medium, and large were $3.18 which is what I was hoping for. We did order a few items that had their own pricing hoping they would be outstanding. 

The beef roll was the first dish to come out along with a huge glass of soy sauce, the beef balls on the menu stated there was orange peel added to it so I was hesitant on getting it but the beef roll didn't state that so we got it. It did have the orange taste as informed by my company but they said it was subtle. 

Other items came out and they were quite tasty, the ha gow (shrimp dumplings) were packed with shrimp but the siu mai (pork dumplings) were pretty fatty. We asked for two dishes of hot sauce twice and only received one. 

The waitress was so quiet that we only heard one word of each dish she placed down... If we were lucky. She also seemed very spacey... We ordered soup and received no spoons. I asked for four spoons and she gave one, had to ask for more and she gave another. We ended up having to take spoons from another table. Honestly, there were four tables she had to serve until we were about to leave so I don't know where her attention was. 

Anyhow, my patience ran thin starting from when we received their \"specialty\" dish. It was their \"Bonflavor Lovely Piggy Custard Bun\". In Chinese, it's supposed to be a steamed custard bun that basically has liquid egg yolk flowing out from it the moment you open it. My cousin opened one up and it did not flow at all. It was literally just a solid. We asked the other waiter whether it's supposed to flow and he said yes and said he will replace the three (even though we had one on our plate already). He came back and served it to us... With the original two we sent back (I feel like this is not up to code and he lied). So we caught his attention again shortly after he dropped it back off to us and he asked how it was. We showed him that the inside was still a solid and that he told us they would be replaced. We were fed up at this point and just told him to cancel this order which he did. 

When it came down to paying, we were not advised beforehand that to get the special pricing ($3.18 for small, medium, large dishes), you'd have to pay in cash, otherwise everything is reverted back to the regular price. The female server said the sign was at the front of the restaurant but we did not see it when we exited, nor was it on large banner they have outside the restaurant. 

In short, the food was decent (the five spice squid tentacles are pricey for dim sum but if you compare it to other restaurants where you would get calamari, it's a fair price and the flavour was good) but the service was absolutely horrendous. I've been to much busier dim sum places and they were a lot more attentive to us (the two servers passed by our table about five times and did not approach us to refill our teapot). For a restaurant that has a sign on their table encouraging you to write a review to get a free dessert/beverage, you'd expect more."}
{"text":"To this day, blonflavour is still my favorite spot for dimsum. Every time I have gone for brunch or dinner, the food has been fresh and so delicious.

I highly recommend this restaurant, and am encouraged to trying new things each time - as everything has been so flavorful and tasty."}
{"text":"I really like the airy and minimalist decor. You can definitely tell that there was a lot of thought put into the decorations. The restaurant has a distinct \"youthful\" vibe, mostly because of the bathroom signs (super hero themed) and the pig shaped custard buns. You can definitely tell that the restaurant had in mind to cater towards the 20-30 somethings based on the decor and food. What I'm not too thrilled about was the royal blue table cloths. The colour is too harsh and clashes with the rest of the decor. Perhaps change the tablecloths to a soft Tiffany blue instead? 

Service was okay but could be better. We weren't completely ignored by the servers but they could have been more attentive when we wanted to have our bills paid, for instance. I noticed that some of the servers were more focused on cleaning instead of coming to the customers when they needed them. 

Most of the food that we had were very good with the exception of the lomaigai (lotus leaf wrapped rice dumpling). It was very bland and looked like it was thrown together very quickly. What a shame, especially since it is a personal favourite of mine. The food that we enjoyed the most was the fried taro dumplings and pig shaped custard buns. The pig shaped custard buns definitely make the restaurant stand out more. Both taro dumplings and pig buns were beautifully made and very flavourful. Not too thrilled that the pig buns kept having the runs instead of spewing snot like it should have when we squeezed it. 

My overall take? Meh. There are other restaurants that have even better dim sum. However, if you do get the chance to come to Bonflavor, definitely try the fried taro dumplings and pig shaped custard buns!"}
{"text":"First time here. 

Yang chow fried rice - as expected. Good
Cantonese chow mien - similar to congee queen. Quite good

Dimsum
- siu mai - wow the best so far!
- spare ribs - if you like bones, you will love this... meh
- snow pea tips dumplings - very good"}
{"text":"After seeing a few positive reviews, I was quite excited to try this new restaurant but in the end I was totally disappointed.. It wasn't what I was expecting and I felt mislead..I also felt bad that I took my out of town parents who had a positive dim sum experience the day before. They kept saying they much prefer the other place.

We were there at 9 am and there wasn't a wait as we were the first ones to arrive and go in. however, the first dish took about twenty minutes to arrive.

The restaurant isn't as glamourous or high end as i thought it should be..wooden chopsticks at the table is a non non ( are we cooking?)  No where the glamourous utensils cutlery to be seen as well or was that it?  I didn't mind paying the premium and the high end prices but felt the food, the decor and the ambience offered didn't match the hefty price tag 

We ordered 8 dishes all together and from what I can remember:

The shrimp roll was nicely done but not hot enough.

Har gow was big but the skin kind of sticky

The XL tentacles was nicely cooked.

The golden lava buns : which i expected to be the piggies turned out to be regular buns since the piggies buns were a special item at $8!!  It was oozing of lava but the bun was hard.

Total bill: $65 for 8 dishes and 3 people


Note: there shouldn't be a sign out on weekends for 10% off for dim sum from 9 to 11 am since the offer is only good from mon to fri. This may be misleading since the mon to friday notation is barely visible or well marked on the sign.

Owner should really hired a consultant to glam up the place and make changes if he wants the restaurant to be marketed as a high end place and survive because in the long run, at these high prices, it may deter people from a repeat experience or ever coming back. 
 
Kudos for them for having some Cantonese staff.

I still will try them for dinner though, just not in a rush to go there any time soon."}
{"text":"Words cannot express how sad I am to see this amazing restaurant close. I have been too late to sing praises of my favourite dim sum spot and now it's gone. :(

The quality of the dimsum here is amazing. So fresh. I love their rice noodle rolls, the texture was soft and slurpy, just the way I like it. Their curry baby cuttlefish was another one of my favourites. The cuttlefish was not overcooked yet it was so flavourful! How did they do it?? My grandma is from Shanghai and is super picky when it comes to xiaolongbao but the xiaolongbao from Bonflavor passed the grandma test!! 

They were more expensive than other places at regular price, but they had happy hour on the weekends if you order before 11AM. Another thing I loved about this restaurant; no lineups! I hated waiting hours to get some dimsum, or having to wake up super early just to grab a seat. I will really miss this place!"}
{"text":"I'm not someone who normally makes a review unless the place is really good or really bad, unfortunately this is the second one. 
We used to be avid guests of former iterations of this Chinese restaurant prior to Bon Flavor but haven't really tried after this renovation until now. 
Went with my mother for a late Dim Sum lunch. We ordered and got tea but then after 20 minutes we noticed that a pair of guys (whom arrived after us) got their food before us. We asked another server how much longer and instead of checking on the order he decided to chastise us on the idea that they are not fast food. His tone irked us but we decided to wait a bit longer. 
Anyways he ended up checking afterwards and asked the  original server if he put in the order. This is when the original server started to frantically look for the order form. Instead of apologizing they just looked at each other as we walked out. Suffice to say, they didn't care about us being there or not and we will not be going back."}
{"text":"Went there for dinner. Terrible food. Fried vegetable has lots of sand in it. Chicken taste like it just come out from the freezer. The soup is a joke. Will not come back."}
{"text":"A closed yum cha place ~ dim sum was great especially the piggy bun ~  Weekday was not busy, we don't need to wait for the table. Good serve and good price."}
{"text":"Food was not the greatest but the worst of all ,  customer survice was very poor. I would not recommend this place ever.

One of our dishes was very salty. so we asked the manager for an exchange. But the manager said \"The dish does not have any salt, so the problem is your taste.\" 

What kind of customer service is this. I am never going back."}
{"text":"Nice decor, mediocre food, charges $2/head for tea, horrible service:

1.) Went on Sunday at 12:00, the wait wasn't too long but we were only offered a table for 4 for 5 people. We asked for an extra chair and our server (an older Chinese man, the main person I'm referring to in the whole review) told us it would impede the staff so we were forced squish into a booth. 10 minutes later, another booth in a similar situation had an extra chair added to their table.

2.) After placing our order, we noticed that the waiter serving us had made a mistake while placing the order. When we brought this to his attention, he was not only dismissive and simply said: \"it's fixed\" then abruptly walked away.

3.)  One of our dishes was a satay sauce beef with fried rice noodles.  It was quite delicious , but deposited a spoonful of oil at the bottom of everyone's plate afterwards.

4.) At the end of our meal, one of the ladies at our table needed to use the washroom and found that there was no toilet paper.  When we brought this to the attention of the waiter to tell someone (while also asking for our bill at the same time), he replied very curtly: \"this isn't my job, it's not me you should be telling about this\" and walked away. 

For a restaurant that's aiming to be a high-end dim sum place, they need to work on making sure their servers understand what basic polite human interactions entail."}
{"text":"2.5 stars! I've been here twice and the first time was better, but the second time it seemed as though their quality went down a bit. Their prices are very expensive for the small portions you get, particularly with the fried squid tentacles. I haven't tried their well-known buns with \"faces\" on them, but they don't really seem all that appetizing or special. The servers speak some English and the place looked clean with modern plates and tea cups. Never been here for dinner so I cannot comment on that."}
{"text":"Very good servers, they are attentive and very friendly. The place is very nicely decorated and clean! So is the kitchen I'm guessing! And the food all come with bonflavor! Very good! And reasonable good pricing and quantity!"}
{"text":"Edit:

Before we left they spilled dessert all over my brother in law, although they did comp us the extra lobster charge.

Soup was a on the bland side, Peking duck was very salty.. on the whole our meal swung between very salty and no salt.  

The promotion to post on social media was also ignored a few times, however they did bring some chrysanthemum jello towards the end.

Notably not the most amazing experience."}
{"text":"Let's start by warning people that the 10% off when mentioning Yelp doesn't work.  The guy had no idea what we were talking about or what Yelp was.

The dim sum was okay, but a too overpriced.  Pan fried dumplings were super small, shrimp balls were bland, rice is lotus leaf was small.  The rice noodle dishes were good and the steam pork dumping was good as well.  I think it is on the pricier side because of location and not much direct competition in the area.  I think this place was also trying to play itself as higher end, but the food was just mediocre."}
{"text":"My mother-in-law wanted to try this new dim sum place with me, so she could bring MY parents there next weekend - she wanted to have a tasting first #cutethingsparentsdo lol. This higher end dim sum restaurant is located NW of Yonge/Steeles area (same plaza as Kobi and Red Bean Waffle House).

Food is pricey but food ain't bad. For the price they charge, the items were on the jumbo side. I thoroughly enjoyed most of the items - they all came out piping hot. The only weird vibe was the service. You will get a cheerful mandarin speaking young lady, then you will get an annoyed yet polite Cantonese old man, and then another one would speak to you in English hahaha...

We ordered plenty of food to try and here are some of our favourites!
- Shrimp dumplings (so meaty... love it)
- Piggy steamed custard buns (eat while it is hot!)
- Minced meat fried dumplings (my fave!)
- BBQ pork pineapple bun
- Tofu wrapped with steamed rice rolls
- Fish stuffed eggplant (never seen it this big before lol)

Some items were mediocre but still came out piping hot:
- Red bean egg custard (just leave out the beans lol)
- Bacon and leek pancakes (it was tasteless)
- Giant shrimp balls (I rather have it deep fried)
- Eel puff pastry (stick with bbq pork, guys)

Overall, it was an enjoyable meal - quality and quantity were definitely there. 9 items was close to $60, even with 12% off. Anyways, will be coming back to try more items next week :)"}
{"text":"It was a nightmare. I purchased group sale from YorkBBS. It costed me over 138$ plus tax. But tasted all garbage. Fish was not fresh. Lobster was very small. I couldn't image how they gave me 3 small lobster and told me that was a 4lb lobster ( very clear had 3 heads in a dish). Furthermore, waitress asked me for tips when I just sit down. That was so ridiculous. I wrote in the YorkBBS to complain, but got deleted by admin. So surprise that kind of restaurant still opens until now. It is really a miracle."}
{"text":"Must try: Shrimp Pancake with Shrimp

This place is surprisingly adequate for the dim sum, I love how there is so much shrimp in all the dishes. :)

I would definitely try the custard balls with sesame as well, way better than the buns which isn't soft enough. Anything with shrimp is good, and the siu mai is very full and refreshing.

I like the price and the fact that there is very little lines as well. Definitely give it a chance.

- iPhoodie"}
{"text":"Waited for an hour and only 2 out of 5 things I ordered came! Ridiculous and when I asked the server about it he said he's not allowed to 'give pressure' to the chef!? Just paid for the 2 dishes I ordered and left! Never going there again!"}
{"text":"We were a group of fifteen in one of their smaller private rooms off the main dining area.  It was very pleasant, clean and quiet.  The service was good.  We tried a wide variety of dim sum offerings and all were nicely prepared, presented and quite good.  The prices are a little higher than downtown restaurants but maybe they don't face the same degree of competition.  Lots of parking but the lot does fill up quickly from noon on."}
{"text":"Nice environment but  best thing i wanna recommond is Griddle Intestine with lotus roots and Spicy flavour hog trotter! I love it!"}
{"text":"Five spice squid tentacle is a must-try. They are super good. Their shumai and har gow are also very good, considering the meat stuffing inside has more quality compared to other dimsum places I had. 
I also had the pork wonton soup, it was so plain that it is like seaweed water. So I don't recommend that.  
From my first-time experience, I think their dimsum is better than any other dishes. 
Servers are very nice. They don't speak fluent English but they are quite experienced and tried to be accommodating as possible as they can.
If it is your first-time visit, they give you the point card, that you can redeem. 

Overall, I rated 4 stars for the food, mainly for the dimsum dishes. I would recommend and come back and try others main dishes from the menu."}
{"text":"I was here 2 weeks ago, food was excellent, service and attitude not so good. Came back today thinking food was all it matters. Ordered the green bean with chicken puff. My buddy, new to dim sum had the first piece and told me there's a strong taste of chemical. I took a bite and my mouth and nostrils were instantly filled with taste of acetone(nail varnish remover). 
I informed the manager, and he said there's nothing wrong with the food, and refuse to cancel the order. I reassured him that I have no problem paying for the food I ate, but I spat out that piece right away and that it does not make sense that I have to pay for it. He said I was just lying and refuse to do anything about the problem. 
Honestly, for $4? Even if the food really was fine, you wouldn't fight with a customer about service over $4. While we were still arguing at the cashier, my buddy had to rush to the washroom and started puking. I just paid the bill and left."}
{"text":"Bonflavour, a new high end Chinese restaurant, has a mixture of offerings: Cantonese Dim Sum and Northern Chinese Cuisine.

Dim Sum is available till 3 pm. With Small item at $3.75 (Medium - $4.25, Large - $5, XL -$6 and SP-$8) which is the most expensive price point in the area for a small. But here ordering Medium and Large would be the best bet. And of course, I do have expectations, a really high expectation. We ordered a few dim sum item to try.


????? (L) Shanghai Juicy Steamed Pork Buns
????? (S) BBQ Pork Buns
???? (L) Pork & Shrimp Rice Roll (spring roll?)
?????(L) Pork & Crab Shu Mai

Shu Mai probably my favourite item as it was loaded with minced crab meat. The Pork & Shrimp Rice Roll is really a deep fried spring roll wrapped in a rice roll. A little strange but taste better than it looked.

Service is friendly and cheerful. Staff speaks fluent English and Mandarin. If only they would have hire a Cantonese speaking staff, that would definitely enhanced the experience for Cantonese speakers. A little green but with potential.

Dinner service looks promising. I would give it a try."}
{"text":"I came here on a Sunday afternoon for dim sum.  Although Google claimed it to be their peak time, there were still quite a few empty tables even though this restaurant is actually quite small (but very spacious between seats).      The dim sum menu is kind of small and there's no specials so the prices are on the higher end.  Five of us were about 70% full at $16/pp.   So the bad things first.  We got some communal chopsticks that were dirty.  When they entered our order into the system they left out items.  Then when we asked for it again they forgot to add it.  Then we asked again and they went to go check but didn't give us an update.  Then we asked to cancel it and they charged us for it on the bill. Then when we were paying our bill they finally brought it to our table.  Now for the good things.  The food was actually pretty good.  The egg tarts were amazing.  The rice noodles were fairly thin.  They have the piggy egg yolk buns which we had a lot of fun playing with having the filling squirt out of the piggy's nose.    All the items we ordered came three to an order.  There aren't that many dim sum places nearby so if I don't feel like going far for dim sum I may come back.  But for the price, there are similar quality places for a much better price out in Markham/Richmond Hill."}
{"text":"Very good service - har gow dumplings were great. Too much noodles not enough seafood. 

Overall pretty good, i would come back :)"}
{"text":"What does oranges, rubber bands, perfume, and fake fish have in common.  Not much at all unless it was Dim Sum at Bonflavor.
This particular location has changed hands over and over again since Bobby at Furama left years ago.  Bonflavor is the newest contender of the long list of failed restaurants over the last decade.  When I stepped inside, the place was really well done.  New everything!  Lights, floor, tables, chairs...everything except the windows (which had layered on paints and mildew that was painted over - sort of).  Nonetheless, we came for Dim Sum!  Not Windows - let Microsoft have that!
BTW - cleanliness and hygiene comes into question when they are cleaning the tables with an old rag that left a streaky film on the table top.  They also had food trapped between the table and the top glass - yuck!  The teapot was already filthy - nothing a simple rinse and wipe would not fix.
Oranges - the steam meatball with orange really had orange flavour.  Wow...a little overpowering flavour but the rind did work with it.
Rubber bands - it would have been easier to chew rubber bands than eat the curry squid - horrible!
Perfume - the soup dumpling tasted like cheap perfume - can't say it any worse!
Fake Fish - the fish with green peppers, looked like someone stuck elmers glue to the pepper and added fish flavouring - tasteless and pretty...EW!
To top it all off, we arrived at 11:15AM.  The DimSum special ends at 11AM - this is not the only place that is doing this.  It looks like it's the new trend.  BTW - before 11AM, the dishes are $3.80 or $3.18 or something like that.  After 11AM, everything is well over $4 and climbing.
Is this a return place?  Nope.  I guess I'll wait until the next contender takes over before going back.
Cheers!

Quick update - the owner/manager commented on this review and also sent me an equally strange message.  Have a read and make your own call on it."}
{"text":"Came for Sunday morning dim sum. It was  not bad. Not the worse I've had although not the best either. 

Location:
Just west of yonge and Steeles in the vaughan side of Thornhill

Parking:
Was there fairly early so got parking. As we were leaving it was nuts. Also SOME A HOLE HIT MY CAR while I was in the restaurant. So not impressed. 

Decor:
I think they are going for 'fancy' judging by thier prices   There are some nice interesting art pieces but it's really sparce. It doesn't scream high end to me.  

Food:
OK.  Nothing special. Literally came for the piggy buns. I loved them. They tasted so good. I thought it would be a pork bun, it was actually an egg custard.  It's really sweet and i liked it a lot.  

Everything else was just ok. Nothing was terrible but nothing was spectacular. 

Service:
Everyone seemed nice. I know some of the others reviews complain about it but I thought it was fine. Actually there was one thing I really appreciated. He asked if we needed forks rather than assuming and plopping them on the table  because we were a table of mostly Caucasians. I really appreciated the ask.

 Also my freaking car got hit in the parking lot. 

Conclusion:
I probably won't be acknowledged unless I hear they've upped their game. For their priest point there's are  lot more better places to go."}
