{"text":"Good local bar with surprisingly good food and great atmosphere. Definitely goin back and a good time for watching sports or meeting up with friends!"}
{"text":"I've never been disappointed with Bonnie's. I like to come here Sunday afternoons for a beer and a Reuben sandwich. I always sit at the bar, the service and food are top notch. There's always friendly people to yap with here. The parking is limited, but there are options."}
{"text":"We love the Friday night fish specials, one which includes delicious clam chowder.  Large portions.  Only problem is finding parking."}
{"text":"Food and atmosphere is wonderful but at 1pm on a friday, there is no reason the bartender should ignore us (me and my boyfriend) when there are only 2 other people at the bar. 
    She promptly greeted us and served our drinks and brought menus, but we sat for more than 5minutes with our menus closed before she came back to take our order because she was busy telling a very detailed story about surgery to the patron 2seats away from us. 
   When we ordered lunch, it was close to 10 minutes before she rang it in! Lucky for her, the cook was very fast.
     She never came to check on us while eating and I actually had to walk towards her at the other end of the bar to ask for hot sauce before she acknowledged me again. 
   This was my first time here and I would like to come back but I will turn around and walk out the door if this lady is bartending again."}
{"text":"We would always drive by Bonnie's and say how we'd like to try that place one day. We did and have nothing but good things to say about this place. It's small but flows nice with plenty of tvs for sports. Being there only one time still have me that feeling that I've been going there for years. Food was good and so was he service."}
{"text":"One of the worst dining experience I've ever had. ordered a burger, the bun was burnt, bacon burnt. then the owner has the veracity to argue with me and call me a liar, never apologizing for their inability to serve a proper hamburger. I asked him if he would like to be served or eat a burger like that."}
{"text":"Awesome little neighborhood bar. Quality bar food, great staff! Love that the owner is so hands on!"}
{"text":"The best kept secret in all of Cleveland.  Great variety on the menu (Rockefeller chicken wrap is too die for) and the cheapest happy hour in town.  A domestic 22 oz. for $2.25 is a bargain and only a dollar more after that.  Been coming here for almost 5 years and I've never been disappointed."}
{"text":"Will not go back. Terrible service. Shrimp undercooked, was still translucent and owner said he would eat it like that (no excuse!). Even when we switched servers 3 out of 4 of our meals and the French onion soup (which had about 1\" of soup in the tiny bowl), were sent back and returned and I still didn't have the water refill I asked for 15 minutes earlier. Owner explained how they were short-handed and our server was slammed yet he just added a table of 8 to her position. I have been to this place about 20 times because my friends liked it but I have never been impressed. They will not get any more of my money."}
{"text":"I first came to Bonnie's decades ago when it was just a little dive bar.  We'd stop in after work to drink cheap pitchers of beer.   Boy, have things changed for the better!   They've added on not only an additional dining area to the inside, but also a nice outdoor patio.    The food is very good with your typical bar menu, plus some very nice entrees and seasonal specials.  I say \"typical\" in the sense that you see some of these items at other places, but the quality of the food here moves it up on the list.   Decent beer selection.  Friendly staff.  We even had some fun with other customers at the bar.   As others have said, the parking lot is somewhat small, but there is plenty of parking along the side street.    I will definitely keep coming back."}
{"text":"Let me preface this comment first by saying that I have been frequenting Bonnie's since their previous owner Ed and his wife ran it. It was \"run down\" back then, but Ed, his wait staff, and perch dinners were great! Having said this, the new owners came in, completely renovated the interior and exterior spaces to give it both \"curb appeal\" and upgraded, modern amenities inside to attract the younger crowd (e.g. millennial, gen x'ers) while being careful not to offend the \"older\" crowd. The menu was also changed up with some fresh offerings but thoughtfully keeping most of the established food fare especially the Lenten fish fry. I believe the new owners brought in new cooks as well. Most times, we've been more than satisfied, especially the Fall special \"Clam Bake\" which was ample and delicious. So now, the not so good news...went last Friday around 9:00pm with the wife and two of my grandchildren in tow. We ordered a flatbread cheese pizza, a pierogi dinner and side of fries, a pretzel/beer cheese app, and a regular sized breaded perch dinner. This is the first time I can say we were disappointed. The perch was cold, as though it was sitting 20 minutes before being plated and served. The flatbread pizza was completely burnt \"black\" on the bottom which made it unappetizing to my 9 year old grandson. The pierogi dinner was ok though. Also, they were out of \"New England\" Clam chowder which was understandable but disappointing for my wife. I normally would have brought this to the attention of the waitress, but I felt it was getting late (10ish), and everyone just wanted to eat because they were hungry, including me. So, everyone makes mistakes. I hope this isn't a red flag of a declining quality control."}
{"text":"Kind of a local hangout bar (from the vibe / feel) with pretty good food.  Went for lunch recently and had to try their \"famous\" dish called the Bonnie Stacker which consists of layered potato pancakes, fried pork cutlet, cheese, all topped with a thick brown gravy...this sucker is an afternoon nap in the making!

Dish was well prepared and quite tasty, would definitely have it again."}
{"text":"Great little neighborhood bar, nice atmosphere, big menu, but not overly fancy. Looks like a great spot to watch a game. Service was quick and friendly."}
{"text":"This was just a local watering hole some years back. It retains some of that charm, but has been updated very nicely and is a nice friendly place. I love the cheeseburgers here, and the wings are excellent.  Service is typically quite good, although there can be expected delays on a busy occasion.  Overall,  this is a great place for a meal or even just drinks with friends."}
{"text":"Bonnie's is where I lost my Leinenkugel virginity. I'd never even heard of the brew before my pal Lisa asked our ever-friendly waitress to slap a pitcher on our table. I'm not saying it's going to replace my cabernet, but it was definitely a tasty brew.

I'm giving this divey sports bar four stars for sheer damn friendliness. The waitress greeted my friend by name, remembered mine when I was leaving, and made a point of checking on us to make sure we were brew happy. The food looked delightfully artery clogging, so next time I'm in the mood for an anti-cleanse, I'll buy a ticket to the Cleveland 'burbs and pool up a barstool at Bonnie's."}
{"text":"We were out wandering and looking for somewhere to go, because the dogs were calm and the in-laws were feeling flu-ey. So, we figured we'd get out if their hair, and grab a beer and something munchy.

Being still within the holiday season, we went with a seasonal beer to warm the hearts a bit, so we went with the Leinenkugel Fireside Nut Brown (the Great Lakes Christmas was long since gone).

Seemed like a really good excuse to get some pierogies to warm the stomachs while we were at it. Those were delicious. Nice and large... potatoes, butter... hell, anything wrapped in pasta is going to score with me. It's just tough to find them in a bar.

I wish more places in Columbus served them

The battered green beans were a nice appetizer. I've been a fan of these since my introduction to them at Tip Top in C-bus. Bonnie's provides a really good portion that is great for sharing.

The staff is very friendly and the atmosphere is such that you can bring your family here to eat in the dining area, or watch and yell at the Browns as they kick some ass (or not) on a football Sunday. A very happy, community-friendly feel to the place overall. Glad we stopped by."}
{"text":"Stopped by since it was close to AnimalHospital of Fairview. I do not like wraps because the tortilla is dried up.  Not here.  Super moist.  I prefer vegetarian but for you carnivores,  adding meat is an option.  I loved it because it contained rice and jalapeno peppers. 

After we told our server this was our first time there, she told us about all the Specials including the Monday night steak dinner

I can assure you that you can't go wrong here. 

Going back next Monday.  The steak dinner sounds scrumptious and we will have the same server- Lexie."}
{"text":"Nice little neighborhood bar with good vegetarian options including delicious fried mushrooms and giant cheese and potato pierogies. I'd return for both."}
{"text":"First time I have been in this place.  They have a pretty cool patio and clean bar.  Only had a few drinks and did not stay.  Overall good place for a pint.  Beer selection is not the best."}
{"text":"Used to love Bonnies years ago before it was \"updated.\" The little hole in the wall had great food and generous, well-mixed drinks.

I've given this local spot a few tries post-uodating, the most recent being this past Tuesday. My friend got wings; I got a club sandwich. 

I will never go back. The turkey tasted funny, like it had reached the end of its shelf life. My friend said her wings were raw. The waitress seemed so overworked that we didn't even bother to ask to have things fixed and left abruptly. 

I want to like this place, but with mediocre food and poor service, I'm happier getting a sandwich from Nates Deli or the Fairview Tavern."}
{"text":"I've driven by Bonnie's 1000 times and finally made the move to have dinner there. I was told they had redone the patio, which was really nice, the interior is still your usual townie bar. We sat outside and it took awhile to be served, but once we were, I was very happy. The beers are huge and cheap and the food was really tasty. It's a great little spot to stop for a quick bite or to watch a game. I'll go back for sure. 

PS very very light on the parking spaces... try the side street..."}
{"text":"I got the fry's and shrimp platter and it was really good . The service was good and prices were fair"}
{"text":"Love love love Bonnie's! I always stop in when I'm in town. The chicken wrap with spinach artichoke dip is great"}
{"text":"Thoroughly enjoyed.  Great fries very attentive waitress without being annoying.  Would definitely go again."}
{"text":"I think the food is great but the help could learn some manners they are very rude the woman who bartender during the day needs to be fired !  Unless you are her friend she seems put out that she had to serve you . I've been in the business 30 yrs and never seen anyone so rude"}
{"text":"Within walking distance from our house, my wife and I find ourselves at Bonnie's about once a month since we moved to Westlake.  I've been pleasantly surprised at the quality of the food, most times.  There have been a couple less-than-great experiences, but by and large everything has been above average, especially considering it's a bar.  I've seen several comments about bad food and server experiences, so I think it's hit or miss; maybe there's one bad cook and one bad waitress spoiling things on occasion.

My only consistent complaint is the music; I'm not sure who they think their customer demographic is, but every time I've been there, there's loud thumping club music coming out of the speakers.  Looking around, it's rare to see anyone under the age of 40 in the restaurant area, and not many in that demographic even in the bar area, so I'm wondering if they let the twenty-something bartender choose the music.  When I go to a place like Bonnie's, it's for a relaxed meal with my wife and/or friends, and chatting is definitely involved.  But with the music THUMP THUMP THUMPing in our ears, we end up yelling, \"WHAT?\" most of the time, which just means we ask for our check and leave a lot sooner than we might have.  I mentioned this to our server and she said she hears that all the time and the manager doesn't care.  I guess the manager isn't understanding that when I leave, my wallet tends to go with me.  I'd probably end up ordering dessert or another drink if I stayed, but with an attitude like that, everyone loses."}
{"text":"Have visited twice in the past month on Sunday afternoon, we dined on the patio both times and were very pleased with the quality of the burgers and the wings. It is a great way to spend a summer afternoon.      Previous visit is as follows:                                                                                                      Went their for a late lunch, not very busy but as usual the food was very good and reasonably priced. Ordered the pork snitzel better then I had hoped, wings are some of the best around the area."}
{"text":"They have a typical bar & grille menu which is good but what struck me was the quality of the food. My friend ordered a Cuban Sammie, and it looked delish. I ordered a classic BLT and I was so impressed. The music in this place was so much fun and brought me back to the good ole days. To me, if you can play classic Britney then swing into the 90's and then play Kanye...you give yourself something others try to attain, a fun atmosphere to bring you back."}
{"text":"Such a solid and relaxed place to go. I really need to snap a pic of the daily specials that go from Monday through Sunday. They have a great \"cheap A$S steak\" that comes w your choice of potato and daily veggie. Cheap beer specials daily. So many great menu items.....steak sandwich Italiano, pulled pork gyro, French dip, Cuban sandwich.....all great. Bartenders and servers always friendly and helpful. This is usually my bar of choice to watch the Browns lose on Sundays. Bonnie's great food and beer helps ease another loss. Thank you Bonnie's....we will see you soon. Oh....they are open 365 days a year too"}
{"text":"I've been here a few times. It's a great atmosphere! People are friendly, good food! It's been packed everytime I've been here (friday nights). Definitely worth going too."}
{"text":"This is a good local bar to stop in when you want a low key, late night drink or bite. Good, cheap beers, and I've always found the service to be pretty good. However the food is mediocre at best. Convenience and late grill hours are what would bring you here for food."}
{"text":"I stopped in on my way home from the West side. This place is small and the parking is terrible. But, the wings are incredible! 

I just ordered some water to drink and a dozen wings. I could feel myself crashing and I had an hour drive home. Seriously, the wings were amazing and they were big. Like, actually had meat on them. 

Next time I'm out that way, I'm most definitely going to make it a point to stop and have a full meal. 

Only down side was the parking. I have a thing about parking. Lol."}
{"text":"They have some of the best wings around - Crispy, not too dry and not too much sauce (which, so far, they have all been great). There is also a great food special almost every night. Taco Thursdays are pretty good. Their draft beer selection is a little weak. And when they are busy, it can get quite slow. I blame this on their nice new outdoor patio bringing in a lot more customers and they haven't quite yet adjusted the staff to accommodate. Food is 5 stars, beer selection and struggling service drops it down one."}
{"text":"I travel to Fairview Park from DC to visit family and we always find our way to Stampers. I appreciate the draft beer list which gets updated with the changing seasons-- there were Christmas Ale options this week and we had some Pumpkin Ale in the fall.  The bar food menu is great. We usually go for a late lunch and sit in the booths that can seat 6. The prices are very reasonable and the service was attentive. Give this place a try."}
{"text":"Simple and good.  Looking for a good meal for a good price, here it is.  Well priced and patio is always a good time.  Been many times and just consistent.  The specials are unbelievable for the money.  

Good service every time and family friendly.  Check it out."}
{"text":"i love bonnie's! it's right around the corner from my house, the bar grub is good and my drinks, on wednesdays, are $2! love it! 
especially since they opened the nice new patio, its one of my favorite mid-week drinking spots!"}
{"text":"In the family of near west side towns Fairview Park is like the painter or mechanic of the family with Rocky River being the tight-assed, creepy uncle and Lakewood being the butch, lesbian cousin.  Bonnies sits in the heart of it all.  This a no-nonsence place with solid beer and food.  Beers would make any sales rep at Superior Beverage proud with all the all-stars in play (Sam, Magic Hat, etc).  The food is mostly just Sysco stuff cooked and put together..ok but nothing really homemade or remotely ethnic.  Its a good Fairview bar.  It, in itself reminds me of the neighborhood...solid, honest..but doesnt stand out.  Server was nice but like the patrons drinking in sweatpants at 11:45am on a Saturday...never smiled..once."}
{"text":"Been waiting for 15 minutes to get our check.... she's looked at us maybe 5 times. Probably won't come back here but wanted to give it a chance. I'd suggest looking at the burger menu. Yikes! Extras are expensive. Certainly need more wait staff."}
{"text":"This is a good friendly local bar that is reasonable priced.  They have good food and friendly servers.  Their dinning room is sort of small but their patio is amazing during the warmer months. They have plenty of TV's for sports watching and they have a lottery machine for Keno, Etc..."}
{"text":"I come in here quite often. It is right down the street from my house so it's within walking distance should I have to walk. The only downside with this location is there isn't enough parking. It's so cramped that I even refuse to park in the lot by the patio because people could possibly hit your car. The Owner Jimmy is on the ball here. He is always running around and always keeping busy! He's bringing out food, clearing tables, wiping down tables and chairs. He is not a slacker that's for sure. Ashleigh, Danny and Karen are great servers! I try to sit in their sections because they don't screw up orders. They're constantly checking on you, asking if you need anything and even check to make sure the food is good. They also make sure to ID people, which doesn't happen often at most places. 
So food. I love their wings! Garlic parm is amazing and so is their mild. Never overcooked, always on point and meaty. Nothing worse than having no meat on wings. You can also get their chicken fingers tossed in wing sauce (I do that a lot). Pirogi's are my 2nd thing here. They're from a local company and they are amazing!!! They come with apple sauce, grilled onions and sour cream. They're fat and filled with cheese and potato. Their burgers have gotten bigger it seems. I love a basic cheese burger. My boyfriend gets the pizza burger. They do have a $5 burger special, not sure what night it's on, but it is available. Buffalo Chicken dip is also homemade and it's excellent. Not too spicy and doesn't upset your stomach. There is a lot in an order. There are daily specials inside the dining area on the chalk board when you walk in. So make sure to check that out. 40 cent wing night is also a popular night. There is an outdoor patio and they do allow dogs in the patio if you're looking for a dog friendly place. just make sure they're leashed as they are required by the city. Booths are fluffy people friendly but it is kinda cramped with the amount of tables in there but thankfully you can still move about as needed. The bathrooms are on the wall by the end of the bar. The tables are never sticky, chairs are always clean and the floors are always kept clean. One tip. Because it is located at the border of Fairview and North Olmsted and because this is a local place, the place is packed!! It's best to get there for dinner before 630 and after 9 on Friday and Saturdays. End of work week and people swarm. Don't just grab an empty table because Jimmy will boot you because there is more than likely a wait list! That's how popular this location is. And, if you are looking for a sponsor for your sports team, hit this place up."}
{"text":"Bonnie's seemed to have a lot of regulars when I was there, and I can see why. It's a really friendly place with pretty solid typical bar food. Nothing to go out of my way to enjoy (I'm not exactly in their demographic wheelhouse), but it's not far from me and I expect I'll happily return sometime soon."}
{"text":"Only come here if Danny is your server. The server tonight took away our food when we weren't even done with it. Our drinks sat empty for twenty minutes. I had a flatbread pizza and it was cold. I think the two servers tonight hate their jobs. The bar has great potential if the service would pick up their slack. At the end we asked for our checks, we got one check which made for awkwardness and everyone doing the math. Not coming back unless Danny is working."}
{"text":"Went here last week for dinner on a Thursday night and it was fairly crowded.  As another reviewer said, we've driven by this place a bunch of times and always wanted to try it.  I really liked the food.  The wings and potato skins were a bit greasy but not so bad that you couldn't eat them.  My daughters split the chicken Alfred and it was horrible.  The only bad things we ordered.  It tasted like shrimp in oil sauce.  We didn't send it back or anything so I have no comment on how they would have handled the situation.  A lot of the food seems to be home made according to the descriptions that our server gave us.  Chicken Alfredo aside, I will go back.  The prime rib and french dip sandwich sound really good and deserve a try.  Drinks are good and moderately priced.  Service was really good. Our server was very busy but he still was able to make it around to everyone and keep drinks filled."}
{"text":"So this place used to be my favorite place to get cheap drinks have a great time with my girlfriend and my sister is well kind of a good watering hole but at the end of the day what happen yesterday I'm never going back there again. Any logical boss take your food back and give you another one and take it off the bill if it didn't taste the way you thought it would but no we had the crappiest service there the waitress that we had literally didn't even come to our table to check in on us didn't even ask if we wanted anything to drink or desert which I mean in my eyes it's terrible service & the sad thing about the wait for the food & drunk was the bartender had to make sure we where okay which didn't really happen too much while we where there. Now this is not a hate post on them we've had great times there but when an owner calls you dysfunctional and delusional because you're trying to make excuses to not pay for a check that's where I draw the line. I went up to him nicely after we complained at the table when the person I was with food didn't taste the way the wanted that they would take it off the check completely he said at the table \"don't worry it will be\" well that didn't happen. Do you know this place you know this place sells very cheap food very cheap drinks so honestly when you think about it they're not gonna take off really anything off your tab because it's so cheap which I mean I can understand but when Hall tables complained about another drinks being wrong or a drink not coming for food doesn't taste right that's the sign of OK maybe I should pay for the check or take a little bit off the check whole tables complained about another drinks being wrong or a drink not coming or food doesn't taste right that's the sign of OK maybe I should pay for the check or take a little bit off the check and if you want my honest opinion it didn't happen either I got said I have no heat for that place but when you try to undermined me and basically told me I'm delusional and that I can't pay for a check because of the way my skin looks that's when I want to go off I'm a proud black man that enjoy some good cheap food every now & again but I will not go there after the way I was treated by the manager."}
{"text":"I will not be back...ever...unless I'm drunk or someone else pays...food...sub par...service...terrible...honestly...a waste of time...dont know how they got rated \"one of the best patios in CLeveland\" according to Scene Magazine unless you like looking at Lorain Road!"}
{"text":"So I was looking for a place to have a quick bite to eat and some drinks with friends somewhere between Westlake and Berea, which made me think of going to Bonnie's. I've passed the joint driving on Lorain Road I don't even know how many times and last Friday night at about 930 was when we decided to give it a try.
 
The parking lot is extremely small and there are signs telling you not to park across the street or you will be towed, luckily we found a spot and walked in. We were kind of confused as there was no sign to seat yourself and 3 employees walked by us without saying anything. My girlfriend asked one of the waitresses and she stated that we could sit where we wanted. We decided on a booth which was quite cozy/tight for even just two people. The décor of the place is pretty simple: neighborhood bar and grill, a bit dated and it had the likes of young and old in the building which prompted me to think that hopefully this place is good.
 
First the good. The beer prices are outstanding. My buddy received a pitcher of a light beer for $4 dollars and would have been plenty of drink for me. I also can't complain that they have my favorite beer (Bell's Two Hearted Ale) on draft with a  22 oz for $5.50 (not bad, not bad).
 
Now to the average, aka our food. To be honest I really was not impressed with the food we received. I ordered a buffalo chicken wrap (my go to if I do not know what to order) and it was kind of bland. The chicken was tasteless, there was too much buffalo sauce and it was a bit soggy. The regular fries tasted as if they were from a bag and were not fresh at all. My girl ordered the French Dip, which pretty much consisted of a thin layer of meat between a loaf of bread. I tried a bite and it really was not anything special. The sweet potato fries were even worse than the regular fries.
 
Now to the bad. My girlfriend ordered an Electric Lemonade, which literally tasted like dirty water. It was absolutely terrible. Our server was not on her game either. She was short with everyone, did not seem to be in a good mood at all and was dressed in tight yoga pants that almost looked like pajamas (not professional at all). Unfortunately I cannot say who this server was because she never told us her name. After we paid (I still left a 20% tip) she was just sitting in a booth behind us drinking beer with friends, not surprising based on how she served us.
 
All in all we did have fun at Bonnies (the Two Hearted Ale helped). I enjoyed the beer specials and would come back but only to drink with some of my guy friends but I would skip on the food and also the nameless waitress. I feel like this place may have had an off night but the service and food really brought it down a notch for me."}
{"text":"This is one of my favorite places to go near my parents' house. Food is tasty, prices are cheap, atmosphere is nice (sports bar, but not too loud). Highly recommend the perch sandwich or patty melt)."}
{"text":"Unfortunately, this place has really gone downhill. The food is mediocre. The bartenders/servers and owner are very unfriendly and act bothered if you want to order something."}
{"text":"This place is great! The staff gives great service and the bartenders are always personable and will make sure that your glass is always full! $.40 wing night on Tuesdays and great specials throughout the week!"}
{"text":"Tried to order take out today, just ordered quesadillas. When I got home my wife's was really really burnt and they should be ashamed of themselves for trying and sending that out in the first place. Since we live right down the street my wife went back up to return it because it was inedible, they said they would make a new one. Guess we should have check the box when they brought out the new one (that part is our fault) because when we got back home all they did was clearly just scrap off the burnt parts! We called back up and the owner said that they definitely made a new one and that they refused the chicken from the old one, still gross. Needless to say that we will not be ordering or going up there again!"}
{"text":"* * * *     Fries  
* * * * *  Battered Onion Rings  
* * * * *  Spicy dipping sauce for rings
* * * * *  Stephanie.  A \"super server\".  The type that every business hopes they could find:  Efficient...attentive...warm, genuine smile.  Naturally upbeat and friendly---not embarrassingly enthusiastic, saccharine, or phony. 
 
Would have given Stephanie 10 stars instead of 5 had she ASKED how our fish dinners were----but she may have been told to NEVER ask how the food is.  That's always a risky (potentially costly) question posed by any food server. ( I was tired and not in the mood to speak up like an adult.  Shame on me.)   A day later, however---reminded by seeing the weighty mass in the garbage can, and after thinking about dropping $28 on two WAY below average fish dinners---instead of forgetting about it and not bothering to review, I felt compelled to sound a \"Food Alert\" . 
  
x x x x x  Breaded Lake Erie Perch   
(5 Don't Do It's)   What the...?  Worst perch fish fry we've EVER had.  

Their self-proclaimed \"famous\" perch dinner---audaciously printed on their menu and website---would be more aptly described as \"infamous\".  Offered battered, breaded, or broiled.  We opted for breaded---the best preparation for LE Perch.  Never had ANYTHING with breading that was this firm and thick---from 1/8\" to 1/4\" !   More like cow hide.   And gummy, too.  Maybe dipped into egg and flour 5-6 times before the bread crumbs.  This preparation was NO mistake---this was the intended heavily-coated result.   
And they didn't TASTE like LE Perch.  Not sweet and mild, but on the strong side, and very VERY dry.  If this WAS the real thing, it was likely a catch from 3 or 4 years ago---that was stubbornly stuck to the bottom of the freezer (requiring industrial pliers to yank them loose)---then finally dropped into a fryer and onto our plates.  I finished less than the equivalent of a single filet of the four served---about two small bites of each hoping to find a good part.  No luck.  I'm sure Stephanie noticed the heaping amount of food---mostly fish---that we packed into the take-home box, but she didn't dare say a word.  Rather than leave them there, an examination/dissection in the privacy of my own kitchen would determine if any of the FISH could be salvaged---whether for human consumption, canine consumption, or plant fertilizer.  No, no, and I'm still thinking about it.

x x x x x  Their Homemade Tartar Sauce  
A thick amalgam of what tasted and looked like a mayo/BUTTER combination.  Yes, butter.  Unappetizing.  Unlike any tartar we've ever tasted.  Sampled once, so didn't use.

x x x x x  Coleslaw 
An unseasoned and liquidy mixture of what appeared to be just cabbage and maybe 1% MILK---certanly not cream.  Neither sweet nor tangy.  Could eat just  two small fork-fulls.

Based on Bonnie's current self-promotion about their \"famous LE Perch dinners\", we expected a vast improvement.  But---to be on the safe side---I brought my own tartar from home.  Just in case.  (AL's from Seven Seas).  But even this excellent condiment couldn't save these petrificated and badly prepared fish.  It had been about 10 years since we had their LE Perch dinner.  All
components were just \"ok\" then---nothing special.  But much better than THIS visit.  (Except for the 4 star fries.)

Instead of looking forward to tasty fried perch leftovers today, I'll warm up the fries and rings in the toaster oven, and nuke some hotdogs.   

Other edible menu offerings may be real winners in this popular, clean, friendly, welcoming, comfortable spot, so worth checking out.  Heard their wings are favorites.

If we visit again---and feel like something to eat with our drinks---we'll stick to their onion rings and dipping sauce.   
."}
