{"text":"The grits were a bit dry/crunchy and the crab cake croissant sandwich was salty. However the mimosa was fantastic! I loved the dinning area. I was able to sit inside but still enjoy the outside air with the windows being open. Over the environment is great and the employees are nice but I wasn't completely impressed with the food."}
{"text":"Came here for Saturday brunch. It was freezing when we came in, which I attributed to getting there at 11. However, it remained that way the entire time we were there, until about 12:30. Kind of a cold sparse atmosphere! The Bloody Mary bar wasn't ready for a few minutes, and it was the best part of the experience. The waiter was also great. However, the food was mediocre at best. The shrimp and Tasso omelette had about six baby shrimp, no ham that was advertised, and barely any cheese. Breakfast wrap was mostly scrambled eggs, not a lot of flavor at all. Overall, pretty surprised at the good rating it has. Not sure I'll be back, unless it's for 1/2 off Bloody Mary's!"}
{"text":"Great staff, good food.....extra long wait times but we'll worth it if you like spicy foods. This was my first visit and I had never had gumbo or jumbalaya.....so I would say both dishes were delicious!!! We had a party of 12 and all enjoyed the dishes. My favorite was the spinach crawfish dip (and I don't like crawfish). Kudos to Shawn and our server Quan who did an excellent job at accommodating a large party who had difficult requests on a busy night!"}
{"text":"Mon cher de food be good here. Had blackened Tilapia smothered in etoufee. Service was extraordinary they work as a team you never want for anything. Pricing 2 beers 1 Margarita 2 cups soup 2 entrees 1 desert  2 coffee $76.
No rush even on Saturday night. Definitely add to our favorites list. Atmosphere garage quaint."}
{"text":"Have been to Boudreaux's a few times and get the fried gator tail appetizers and the chicken fingers & fries basket each time. Not an exciting dish for some, but it suits me just fine. Gator tail? If you are not from Florida, then this is not your everyday menu item. If I said, \"tastes like chicken\"; would that be too much of a cliche? Well, it does, it's a mild flavor that anyone can like. I went with a vegetarian and she managed just fine. The food is decent and the prices are reasonable. The restaurant suits the area and is pretty big so it can handle large groups of people. 

I think my only gripe is the service is a little slow. The last time I went, there were only about 4 tables of guests and we still had to wait a while for our meal. If you are walking around Noda and want to try a new place, then stop to Boudreaux's. It's very visible corner location is inviting and you can hit a few pubs after dinner in Noda before heading home."}
{"text":"Try Boudreaux 's has great food - never have had anything that wasn't delicious. even when busy, the service is good. try the fish & grits, étouffée, creole & gumbo. Great place to eat before taking in a show at The Evening  Muse or The Neighborhood Theatre. Busy full bar + excellent mocktail selection for non-drinkers!"}
{"text":"Boudreau's compares with the better and best casual New Orleans establishments, serving a wide selection of Cajun/Creole recipes that did not let us down in any way.
Good to get out of Charlotte business district and experience the neighborhoods which have not been bulldozed by the big banks.  Travelling to Charlotte: rent a car and visit the community."}
{"text":"Awesome brunch. One of the best in CLT. Sit outside and enjoy the NoDa scenery. Love the make-your-own Bloody Mary bar."}
{"text":"Hard to find good Cajun food anywhere outside of LA.  This place does a solid job.  Jumbolaya, Cajun fried chicken, gumbo.  All really yummy.  They do a Sunday brunch which is good for a beneit fix."}
{"text":"Worst staff I have ever dealt with. I had to ask three times to get my check. They were making excuses for poor service saying they were understaffed. Would not return here. If you want to kill two hours waiting for your food this is the place for you."}
{"text":"Boudreaux's is my favorite Charlotte restaurant. I've tried half of their specialty dinners and have not been disappointed with any that I have tried. Recommendations would be to try the jambalaya, etouffee, and catfish mulatte. The soups are all fantastic. Definitely try this restaurant in NoDa!"}
{"text":"Great atmosphere and brunch!  Especially the Bloody Mary bar with their own infused vodkas!  Will definitely be back!"}
{"text":"Loved their jambalaya!!! Fantastic list of beers and mixed drinks. Possibly the best cajun food I've ever had."}
{"text":"I had visited once during a visit to Charlotte and it was a good experience. Now a recent transplant to Charlotte, I thought I'd go back for the brunch available on both Saturdays and Sundays now! :-) I ordered the Cajun chicken omelette with a side of home fries. A small cup of fruit comes with it too. The meal was a disaster. The Cajun chicken omelette was flavorless, dry and hard. The contents in the omelette were not cooked at all either. Gross! I went for it anyway. I took one bite and was so disappointed. Eating it was like eating a piece of rice cake. Furthermore, my potatoes were hard. Seasoned well, but overcooked. I was going to grit and bear through my meal, but something told me to tell my waiter, Ryan. He was a good sport. He listened to my complaint and allowed me to order another meal, the Eggs Benedict with a side of cheese grits. When my plate arrived I was very excited. The meal looked fantastic. Then, it was love at first bite. The cheese grits are the best grits ever. I shared half with my sister because i wanted her to get \"the experience\". lol I ate my meal slowly so I could savor it. I literally cleaned my plate. I will return because I want to try other items on the menu, but I will still proceed with caution."}
{"text":"We ate at Boudreaux's during our Noda Gallery Crawl (I will mention we chose the coldest week of the year to go--d'oh!), and it was a warm welcome after our chilly tour.  The staff is really friendly and attentive.

The food is also wonderful!  I had the shrimp and grits, which was awesome! One of my favorite parts of the dish was the celery, which added a nice crunch. The shrimp and sausage were both very yummy, and the grits were a good consistency. 

My hubby got the red beans and rice (this man loves him some red beans and rice) and said that it was done right.  \"Tough to imagine it better.\"  

Our friend got the jambalaya, and also said that it was really great. He didn't finish it, but I think he doesn't eat a lot at one time.

Also, the cornbread was very tasty!  All in all, it was a great experience--food was delish, all for about $9-$14 a dish. 

Next time I will try something off of their bloody mary menu--they have a cool thing going on there!"}
{"text":"I don't know how this place stays in business the foods weird the people are weird but not in a good way so I told me this place was once good but every time I go because I want to support the neighborhood I'm always disappointed"}
{"text":"I've never seen such a diverse demographic cross-section of North Carolinians all in one place - and i presume its because everyone loves good cajun food.  

We stumbled upon this place while exploring Charlotte, and were very pleased with the food.  I had the muffalatta which was a good approximation of the new orleans sandwich.  Hubby had the crawfish & shrimp etoufee - also pretty darn good. 

The service was a little less satisfactory - the staff was running around aimless on many occasions.  Our table was cleared at the end of lunch, and we tried to flag down our waitress for the next 10 minutes to pay the bill, and finally had to stick an arm in front of her to get her to quit ignoring us.  Busy, i understand - snotty attitude doesn't need to accompany that, especially at the point where we are about to decide what your tip is."}
{"text":"Ehh. The vibe was nice, along with the service. 

They offer specialty hurricanes that are strong drinks. I personally didn't like it, but my friend enjoyed it. 

I had the fish and grits. It had too much Tasso gravy on it in my opinion. But it had nice flavor and the cheddar grits were good. 

Half off mimosas on Sundays was a pleasant surprise."}
{"text":"Had a wonderful jambalaya and she crab soup. The corn bread that came with both dishes was a bit dry. Will definitely come back if I'm in town."}
{"text":"I had heard mixed things about Boudreaux's when I moved to Charlotte, but I ate there a couple months ago and had a perfectly lovely time... 

My partner and I got a cozy little table in the corner, conversed over drinks while the soft and sultry playlist invited us to make ourselves at home. The server was attentive and fun. It made for a great time. 

I had a Burbon Pork Chop and my partner the Cajun Carbonara. Each dish HAD FLAVOR. Something I noticed a lot of food in Charlotte seems to lack. 

Overall I am glad I decided to give Boudreaux's a try!"}
{"text":"Seriously one of my favorite eats in Charlotte. Service is always quick, food is always delicious, nice beer selection, great ambiance. I can't really comment on their seafood because I don't eat any but their other dishes are always excellent. They have a ridiculously tasty brunch on weekends. 

My in-laws love this place so much they request we eat here every time they're in town. It's become a tradition. :)"}
{"text":"I have not been in a while and should not have waited so long to go back. I was very pleased with my meal. I ordered the special: lump crab meat and shrimp over angel hair pasta. My friend ordered the shrimp po boy and the bread looked delicious. I may have that next time. The service and atmosphere were great: all the loud yuppies must have been at Cabo Fish Taco"}
{"text":"Came in on a Monday with some friends and tried the gumbo. I must say, this was the most amazing gumbo I have ever had. 

I also ordered their crawfish spinach dip and it was out of this world. 

I don't know how I've never been here before but trust me when I say I will be coming back again.. Possibly tomorrow.. And Wednesday."}
{"text":"Love this place and food down in the Noda area of CharLotte and great  drinks as well the hurricane drinks ,,,,becareful love love it drink it everytime im here"}
{"text":"Really, really terrible service. Our waiter was very nice but rarely checked on us. Our appetizer was not good, our main meals were what I would expect at that price point, and they were out of the dessert special after describing it to us."}
{"text":"The food was really good  - but the smoky air courtesy of the bar next door and the customer service, left us not planning to return!
The open door on the patio allowed all the smoke from the next door bar to come right into the dining room -- it was like eating in a smokers lounge!
Our waitress nor the manager seemed to care and the waitress took three attempts to get a pretty simple bill correct.
Food was good - but not good enough to endure the place again"}
{"text":"If you have 2.5 hours to kill (literally 2.5 hours today at lunch, with only two other tables sat in the restaurant), this place has some seriously kick-ass cajun food. Unfortunately, the service was far too slow to handle, and I will not be back.

If you don't mind waiting forever, I really do highly recommend the food, which brought my rating from 1 star to 3 stars."}
{"text":"A friend took me here on my visit to Charlotte for work.  The atmosphere is casual and the staff were extremely friendly and courteous.  They staff alone deserves 4 stars.

I started out with the alligator bites. The dipping sauce was good, the bites were crispy and flavorful but a little dry. I proceeded to order the fried chicken and jambalaya.  First, I was not expecting so much food that I had to get it to go. The jambalaya was full of shrimp, sausage and crawfish and the rice cooked perfectly.  The boneless chicken had great crunch and full of flavor.  The cornbread hardened too quick but was good.  The only other issue I had was the smell of cigarette smoke I detected from the patio area that interfered with my dining experience. Overall, I enjoyed the experience and will go back when I return to Charlotte."}
{"text":"I found this place a great place to do lunch since I work downtown. The wife and I now love to go for brunch on the weekends. The Bloody Mary's are great and you have the option to make your own at the Bloody Mary Bar. My wife enjoys the Mimosa's and always has the Muffletta, which she loves! I adore this place as well, nice laid back atmosphere as most places in NODA have. 
I would give 5 stars if our drinks were kept filled more consistently..
some visits service is better than others, but this place can get packed!"}
{"text":"Pork chops and fried chicken were delicious. Service was very friendly and accommodating. If you like Creole food, stop in here."}
{"text":"Friendly service, great food, neat atmosphere.  I like the heat and they don't disappoint.  This one will be a regular stop."}
{"text":"Went for lunch today...not as good as last time. 
The server was wonderful and tried his best to accommodate us but the shrimp and grits wasn't as good as last time. The grits were just to thick and starchy. I give the service a 4 star and the food a 2 star.  My coworkers had both remembered having the veggie burger before and remembering it to be a little more moist. Also, it was a little cold in the middle.

 Not writing off Bourdreaux's for good they just need to work on being more consistent with the food. Oh... and they only had one other table besides us at lunch so no excuses about being busy."}
{"text":"The best Ducharme(seafood gumbo)! I wish I would have had a bowl by myself instead of sharing a cup with 2 others. They have the best Shrimp and grits I have ever had. It was amazing. I wanted to save some for lunch, but I could not stop eating it because it was so good! The staff was great. We will be going back several times."}
{"text":"We came here for the breakfast. We got the eggs/biscuit/cheddar grits/Cajun Chick omelet, and Beignets.

Everything was awesome. The Beignets were a little doughy (like gooey) though, but still good.

We'll be back!"}
{"text":"I had my mouth set for Boudreaux! Were soooooooooooo rude. I was asked to move twice, literally, from one patio table to another, due to a server issue. I complied.There was no one there. This was 7 pm. I asked for a bud light and a menu.. Waited 15 minutes. Get over yourself!!!"}
{"text":"I will start by saying that I rarely rate at five stars. However, I must for Boudreaux's. I visited the restaurant for the first time for lunch with my coworkers and was extremely satisfied. If you are unfamiliar with the NoDa district (as am I) you may pass by this place without second thought. However, don't miss out. My meal consisting of catfish, collards, and sweet potato fries was phenomenal! 

However, I must note that my coworker ordered alligator bites as an appetizer, and I was less than impressed. It was not seasoned very well and was a bit chewy for gator. 

I can only rate based upon the one meal that I had. But so far, so good!   : )"}
{"text":"Good spot.  The Jambalaya is great and the service is excellent.  I'd agree with other posters that this is a more refined toned down cajun fare, but still good.  It was nice to be close to the rest of NoDa (galleries and bars) for some pre and post entertainment."}
{"text":"I was soooo happy to have found this place before I started cooking some  gumbo! I had my mothers reciepe written down and everything. I searched and I thought hmm this place maybe good.

I walked inside and if felt like I was back home - home away from home. The music touched my soul. I ate some gumbo and it was delicious and my fiance cleaned his bowl too!! Some truly good authentic Cajun/Creole food!"}
{"text":"I went here with a social group. The food was decent. [The pork chop was great, but nothing out of the ordinary]

Atmosphere: The atmosphere was a bit dingy, appearing to be shooting for culture it didn't have
Service: It was a little slower than desired, but it wasn't bad."}
{"text":"We stopped by one evening not knowing what to expect and We were pleasantly surprised! The jambalaya was incredible. They're Cajun bloody Mary's were really tasty as well. We will for sure be back!"}
{"text":"Good gumbo. A bit thick but still worth the price. Shrimp po boy was fried lightly and delicious.  Definitely go again"}
{"text":"Decided to try restaurant due to great reviews. The waiter was extremely nice. Unfortunately, we ordered an appetizer and he never brought it out. The restaurant was not busy however it took approximately 15-20 minutes to receive our meal. I can understand that the food is fresh and made to order however let us know in advance. 

I tried the gumbo and it lacked seasoning. I had to add lots of hot sauce to provide flavor. The cornbread was flavorless as well. I prefer to have some butter on the cornbread.

My main entree was shrimp and grits. The meal was not bad. I cant say i would make another trip, however it deserves a try."}
{"text":"We had a group of 14 eat here on 5/12/17. The food is amazing and our waitress did a great job. Highly recommend."}
{"text":"Haven't been here in over a year. The neighborhood is definitely changing. Not sure for the good or bad but Boudreaux is still here! 

I ordered the Bourbon Pork Chops Mac n Cheese  and Collards. As always very good but I wish the corn bread was sweeter. 

The service was great. I will definitely come back especially for their Sunday brunch."}
{"text":"Here is what we ordered for a late lunch/early dinner: 
Fish & Grits
\"the one with everything\" Gumbo
(I forget what it's called...sorry...) 
She Crab soup
 
Everything we ordered was pretty good. My favorite was definitely the Fish & Grits, the fish was blackened perfectly in my opinion. I'm not that big of a fan of black peppers but the pepper flavor was not overwhelming at all. So if you like that spicy pepper taste, it's probably not for you. 

The sausage that came on that gumbo was sooooo good!!! If it wasn't on the gumbo, I probably wouldn't order the dish again because I'm more of a jambalaya fan. 

She crab soup is also very good, I appreciate that there isn't a fishy taste or smell to it. Very well seasoned. 

Honestly, all of our orders came with cornbread and the dish was better off without it. It was outrageously DRY and flavorless. Not wanting to sound rude but their cornbread will NOT be missed if they stopped serving it, that's how bad it was. 

Service was good considering, we were the only people there in the restaurant but we did go 4-5pm during a work day."}
{"text":"Fried oyster appetizer - 1 star - 9 dollars for about only 4-5 oysters. Cajun queen is better.
Jambalaya rice - 4 stars
Étouffée - 2.5 stars
Hurricane for drinks - 4 stars"}
{"text":"Although the gator bites were disappointing,  the main course was excellent! Very flavorful and plenty of food."}
{"text":"Best poached eggs I've had in town so far. Unlike most places that serve Eggs Benedict or some variety of it, Boudreaux has perfect poached eggs. I cannot eat a whole lot on the menu because I am a vegetarian but they have a great brunch with a few veggie friendly options. The Croissant Florentine is very yummy. My only gripe was that the home fries were a little soggy for my taste."}
{"text":"This was a wonderful hidden gem.

The seafood gumbo and Jambalaya will match what I get in New Orleans.

Many choices and local beers.

The manager running the place was very nice and the bartender rocked!

Keep up the good work and I will definitely eat there again!"}
{"text":"Stopped in here one Saturday after a few drinks at the Blind Pig with my girlfriend and her friends.  I was blown away by the assortment of Hurricanes they offered. There was a good portion of a page devoted to them.  Naturally,  I chose the strongest one of the bunch.  Sadly,  what i received was the worst hurricane I had ever had.  I would prefer the premixed Bacardi stuff over this.  I'm sure it had a lot of alcohol in it,  but it was sweet past the point of overkill and was quite hard to get through.  My girlfriend got a bloody mary and after trying hers, I ordered one immediately.  Boudreaux's more than redeemed itself with their bloody.  One of the best I have ever had.  The food was good,  but I would like to see a little more soul and love put in to it.  I would come back in a heartbeat for the Bloody Marys and would definitely try another entree."}
{"text":"Food was not worth the wait.  First to order, last to be served.   Drink orders took the longest to be fulfilled.  We never received any napkins or silverware.   The hot appetizers came out cold.   The jambalaya came out but we had no silverware to eat it so we asked for silverware and napkins a second time and the food got cold while we waited 10 minutes for him to come back without the silverware or napkins.  More waiting.  We finally got up and got forks and napkins ourselves.  They were quick to take our money and credit cards but took over 15 minutes to return with them.  Then they accused my party of stealing money bc they were confused and accidentally gave out the wrong bill books to the wrong tables.  What a mess.  The food was not good enough for all that."}
{"text":"We are a tough crowd, being homesick New Orleanians. So with that in mind, we sometimes need at least a reminder of a few dishes we've been unable to make here. We've visited now 3 times, and each time we had a friendly waiter and they had Abita, and even once, Dixie in a bottle, which sent my husband over the moon (beer, for the uninitiated). Their Bloody Mary's were also pretty good. I have ordered oysters twice, once was great, the other had to be sent back b/c they were underfried. Their french bread, which they get from a local bakery, is spot on. The way it should be. Crunchy and light, not doughy and sweet. If you go, be sure to order a po-boy. It's pretty authentic. However, I would stay away from \"etoufee\" or anything that when not in New Orleans takes a decidedly tourist take on the dish. We took our children for Mardi Gras dinner, and they enjoyed it, even if the waiters had no idea why our children wanted to throw beads at them. 

The atmosphere was comfortable and very New Orleans, and they had coffee with chicory, difficult to find even in the best of circumstances outside the city limits of NOLA. So please, do yourself a favor and get fully caffinated before you leave. Even if it's after dinner. It's no ordinary coffee. You'll be pleased with your pep. I give three stars -- one missing for oddly cooked food on occasion and lack of attention to detail on some dishes; one simply because I know I'm not at home when I eat here."}
{"text":"I was looking forward to some great food but the service just overshadowed that all the way for me.  We stood at the door for a few because you have to be seated.  Well, the waiters were also the host!  Did I mention the waiters were also the bartenders.  I wouldn't be surprised if they were the cooks, too.  

The service was so slow.  I was the only person that didn't order a soup to crave my stomach. It was only 3 tables when we came in... two more came after we were seated.  Entrees took at least 40 plus minutes after the soups came out. 

Monday lunch hours arrived at 12:15 and ran out by 1:45 to get to our meetings. 

One of my bosses said his soup was a little cold.


FYI: Just don't go for lunch... I've been for brunch and it's been great on Sundays with a full staff!"}
{"text":"I have always like Boudreaux's, the brunch is excellent and unpretentious. The make great (and strong) Hurricanes and I like their gumbo. The service the people are always good. The food is usually consistent, although at times it has fallen off. If you like Creole cuisine I would recommend it over others in the area. 
read more at: http://eatitcharlotte.com/2016/05/27/boudreauxs-louisiana-kitchen/"}
{"text":"Still the best place to eat in NODA!  The food never disappoints.  The service is streaky.  Get an Oyster Po' Boy and catch a show at the Neighborhood Theater."}
{"text":"Worst restaurant experience ever!!!! 20 minutes to get a table, 20 minutes to get a beer that was on tap, 60 minutes to get food & we had to send food back because it was horrible, the whole place was terribly run... management blamed it all on one person not showing up to work that day, but I find it hard to believe that 1 person could impact every aspect of the service.  People were pissed and leaving.  Then they sat 3 very drunk men in the middle of everyone and they actually served them alcohol... as you might expect they were so out of control that a fight nearly broke out & only after many customer complaints did the manager kick them out... then another 30 minutes to get our check.  Unbelievable!!! Manager promised to follow up with patrons the next day... 3 days later still no contact, so posting my review.  Not ok to treat customers the way we all were that night."}
{"text":"Have been coming here for years.  There service is always good, excellent food and nice portions at a decent price.  It's never really crowded and the does baffle me.  I bring out of towners here often and they always want to come back.  The most flavorful dishes to me are the shrimp & grits and the Mulatte.
It does not really have a \"scene\" but when weather is nice their little patio is cool. Always friendly staff.  I have been In Charlotte almost 15 years and I frequent this place for a solid meal often."}
{"text":"This is a tough one.  What my girlfriend ordered was very good, mine was absolutely horrible.    The beignets we ordered to start the meal were too doughy and tasted like grease. I had the Monte Cristo sandwich.  Soggy bread, the taste really didn't flow, too many things going on. My girlfriend had the Croissant Florentine and she really enjoyed it.  I might go back and see if it was just what I ordered, but more than likely I will try other places first"}
{"text":"This restaurant does not have a parking area.  When we walked in, we noticed that the place dark, dirty and dingy   Since my wife is a vegetarian we looked at their online menu to make sure they had a few vegetarian items.  We went on a Sunday just to find out that they only serve from their \"Brunch menu\" and Brunch is until 3:00pm.  We explained the situation to the waitress and she came back with their \"lunch\" menu with small selection of vegetarian meals so we left.  Not sure when a person would have to go there to have access to all 5 menus (as shown in their website) but Sunday around 2:30 is not the right time."}
{"text":"I have no idea what happened to this place but all the sudden it just dropped completely off. I ordered the Jambalaya as usual and for some reason it was much more more runny and kinda oily. It had the texture of something that would come out of a cafeteria bin that was mass producing food for hundreds as opposed to a freshly made dish. I also ordered the gator bites to start with and they were a complete joke. The \"bites\", as they were called, were mini fried pieces of batter and hardly anything more. I'm not kidding when I say mini either. Probably half of them were as small as or smaller than even a M&M piece of candy. The real kicker was that our waitress was sporting some serious attitude. I get it that I'm just a lowly customer and therefore I am to be regarded with what can only be described as restrained content but at least try and phone it in a little. Just really upsetting to have such a crappy experience at a place I have always loved and tried to talk up to whoever would listen."}
{"text":"Absolute best place in Charlotte for Cajun food.  Beats Cajun Queen by a mile!  I have been here numerous times for dinner and had brunch there recently where I enjoyed Mimosa specials and Beignets!  Reminds me so much of Naw'lins!  I LOVE THIS PLACE!"}
{"text":"Fun place to go in a really cool part of Charlotte. The blue cheese burger is really great. I've had other dishes that were just ok. But I like this place."}
{"text":"The mojitos were great. I ordered the jambalaya and asked the chef to add an extra kick of spice. It was perfect."}
{"text":"Wow, something out of this world! Very good southern cajun and creole cooking! The Shrimp and Grits was delicious, The Po'boy out of this world, and even the cajun dip for an appetizer was so good! If you are looking to try something new this is the place to go!"}
{"text":"I was trying to figure out why I haven't written any 1 star reviews. I realized one reason is I don't want to feel responsible for a small business going under. Another is I'm pretty good at avoiding places that are likely to be a 1 star experience.  And as a rule I usually find some redeeming qualities like value or service. But rules are meant to be broken. 

Enter Boudreaux's.  The first visit I was excited to try their etouffee because I love cajun food and like the etoufee at Cajun Queen but alternatives are always great. First we had to wait about 50 minutes for our food and after it came, I thought the etoufee was awful and the taste was bland. Perhaps I should have gone with the jambalaya or Shrimp and Grits, though none of the people enjoyed their meal. However, the meal just got worse when the server was pouring my sweet tea (apparently above me) and poured half a pitcher of sweet tea down my back. The server was off in Lala land or might have been on something because it took a chirp, or yelp if you will, to get him to notice that there was something wrong. So he then stood there and said \"Oh whoa dude...\" ... and so then I had to ask him to get a napkin or towel or something.  \"Oh, sure.\"  I don't make a big deal of things, so I laughed off the tea and apathy and attributed it to having a bad day. 

Then Mother's Day came around and I wanted to give it another try since it's an institution that has been around NoDa forever. They were having a brunch and I realize most places get overwhelmed for Mother's Day brunch, but this was truly amazing. The food took 2 hours and 20 minutes to get to us and was completely cold by the time it got to us. Really?? Really. So all we had during those hours waiting was weak bland coffee. They offered to remake the food, but I was worried it would take another hour or so.  Quel désastre! I usually give places 3 tries before I'll review a place but in this case after 2 visits I will unequivocally never go back.  

So if the food had been exceptional, sure, I would compensate the stars to make up for the terrible service, but it wasn't, so I didn't. I hope I never have to give another 1 star review again. It just makes me feel dirty."}
{"text":"I tried out Bourdreaux's over the weekend and perhaps I'm spoiled by some of the other Cajun joints in the area but I found everything to just be okay....not bad, just nothing really special. 

We started with the gator bites, the portion was a bit small but they arrived to the table hot and fresh. I felt they could have used a bit more seasoning but overall a great way to start the meal. I ordered a Hurricane, I love that they have a full page spread devoted to different flavors and levels of liquor for these drinks...I just with the Category 1 but it packed enough of a punch. 

For dinner, I went with the Bourbon Chicken over grits instead of rice. The chicken is flash fried and the bourbon adds a nice amount of sweetness. The gumbo yaya was good, a little salty but I really enjoyed the addition of the andouille sausage.  Now, I will say that swapping out the rice for grits....was a huge win! I'd recommend doing that every time. 

Overall, this visit was just A-OK in my book. If I'm in the area again, I'd pop in to try something else but I wouldn't make a special trip."}
{"text":"Damn good food.  Etoufee is great, same with gumbo.  Good beer selection.  Daily specials.  You can get some of the dishes at the bar next door."}
{"text":"Boudreaux was great!! We were going to an event next door to the restaurant and hoped to get last minute reservations for a party of 8 before the event. We called and they were able to get us in. The servers were attentive and fast with drink and food orders. They have a very large drink menu that ranges from beer & wine to unique cocktails. Start with a Category 5 Hurricane, then go from there! They offer a wide variety of Cajun food. Most of their entrees come in two portion sizes (T'boo = smaller, Beau Jacques = larger). I went with the smaller Cajun Carbonara and it was perfect for my small appetite this night - along with an appetizer of fried pickles. The pickles are thick cut slices (not spears) and are good for sharing. Next time I would like the try the Bourbon Chicken & their gumbo Yaya. Prices are very reasonable where you can have a good sized dinner for $9-$16 on average. I will be back! Laissez les bons temps rouler!"}
{"text":"Service was extremely slow considering the room was not fall on a Sunday brunch weird solo guitar player we thought he was practicing food was pretty good bloody Mary bar recommended"}
{"text":"This place sucked. Thankful I've been to New Orleans and know how this food should taste. The alligator bites came on a bed of cheap store bought shredded lettuces, why put something on the plate you won't eat with the food presented or that doesn't look good. Then the red beans and rice was so plan. If you've been to New Orleans the red beans have a smoke flavor and real andullia sausage. I don't know what the sauce was but it wasn't andullie. I live in vegas and I get real andullie from New Orleans for pretty cheap how come a restaurant that is suppose to be  Cajun can't. Don't eat here if your looking for Cajun food."}
{"text":"Go.  Unique restaurant relative to its location (NoDa).

Alligator bites be solid...."}
{"text":"Great food for a fair price. The she-crab soup was delish. We ordered bourbon fried chicken, which was extremely juicy, had great flavor, and was served over YaYa and rice. We also got fish and grits - it was an amazing portion for the price (two tilapia filets) and had the most yummy sauce! There was nothing wrong with the service. I saw quite a few more things I want to try on the menu and will definitely be back."}
{"text":"If I could give a zero I would.
I told
Waitress the meal was not good , burnt food and like a salt shaker was dropped in the crab cake !
Many other restaurants around - skip this one !"}
{"text":"Food and staff are awesome (thanks so much, Keisha!). We ordered the etouffee, shrimp and grits, beignets, gator bites, and she crab soup. The gator bites were interesting and came with a great sauce, but were more of a novelty than anything. The she crab soup, although just a tad too sweet for me, was delicious and the crab flavor was evident. The freakin shrimp and grits was like a creamy flavorgasm, and the ettouffee was just as incredible. They didn't skimp on any of the ingredients like crawfish and shrimp, and the seasoning was perfect. Beignets were very similar to what we had in NOLA, although a bit more chewy (which we liked). Would definitely come here again, and recommend to everyone."}
{"text":"This place looked so cool from the outside, but besides that and decent service, it didn't have much going for it. The inside is not very clean, especially the women's bathroom. 
For appetizer we've had fried pickles, the flavor was ok, but the batter didn't stick, and they kept falling apart. The second app was the bbq shrimp, 9 shrimp, which were obviously frozen, not fresh, on a plate of soupy sauce that had nothing to do with barbecue, and a few pieces of toast getting soggy, just swimming in that sauce. As the entree, I had the fried chicken. It was a thin, boneless, skinless breast. The seasoning was pretty good, but the bourbon and molasses flavors just weren't there. Also, a piece of meat that skinny is more like a schnitzel, not fried chicken... The rice was overcooked and the gumbo yaya (which was pretty bland and had a slimy texture) made the chicken soggy. I also had the cheese grits, which had too much pepper and were way too thick. And I mean, I needed a knife to eat kind of thick. The cornbread served as the other side was just ok, nothing special. 
After the appetizers and entree, I didn't want to order dessert just so I didn't have to be disappointed. 
On the plus side, it's pretty cheap. 85$ for 2 apps, 3 decent size entrees and 2 drinks. 
Honestly, don't think I'll be coming back."}
{"text":"Food was missing salt and lacked flavor, service was a bit slow. Did enjoy the ambiance and server was quiet pleasant. Was looking forward to a great time, sadly disappointed"}
{"text":"I had my hopes up but it's really just basic. Let's start with appetizers; hardly shareable so you better order a few. The flavor was pretty good on the alligator bites and fried pickles but the batter just crumbles off. The pickles really just feel apart after touching them. ?

I had the blackened chicken from the lunch menu and it was awesome. A good portion for a chicken breast and super juicy. The season was heavy but that is the idea, very good. For sides I went with the Charlston cheese grits and French fries. Grits weren't hot but warm enough to eat. Decent flavor but super stiff. The fries could have used an extra minute in the fryer, flimsy and floppy but again good seasoning. 

The reviews about the corn bread are spot on. It's one of those moments you just need to sit someone down and say... just stop. At least serve some real butter while it's \"hot\" so the dryness can be remedied with the butter... maybe. 

Over all the basics need work. Execution is the flaw here since the flavors really are good. We went for lunch and it was super slow so maybe a dinner when things are moving in the kitchen would mean someone was paying attention."}
{"text":"I've been here several times and every time the food is amazing. A lot better than Cajun Queen and better prices too!"}
{"text":"Before this past Saturday Boudreaux's, and especially the Jambalaya, was one of my favorite places and dishes in town. The new interior has lost all its old charm. Maybe they're not done remodeling yet, but the current state is not cool. More importantly the food has dropped in quality. The shrimp in the jambalaya was like bad small frozen shrimp that weren't even deveined. Needed a pooper scooper. I think I'm done going there. Wife had shrimp and grits and that was disappointing too. Maybe it was an off night but I can only judge my experience. I hope they get their mojo back."}
{"text":"Have to give this place a solid 4 stars. Came for brunch and ate like a little piggy. Not to mention the mimosas are so cheap! Had the gumbo and it was pretty good. My fam is from NO so I'm naturally a tough critic. Wish I had room for the beignets so it's on the list for my next visit. Please bring your appetite if you decide to come!"}
{"text":"I have eaten at Boudreaux's a couple of times for lunch and while the food was pretty good, it was not extraordinary.  

On my first visit, I just went with a Shrimp po boy and fries.  It was good, but not the best Po Boy I've eaten.  On my second visit, I went with the Shrimp creole.  I liked it better than my first meal here, but overall, I prefer the food at Cajun Queen. 

Both of my visits were at lunch during the week, so we did not have a long wait and our service was a-ok.  I am not sure I would want to fight the crowds to come here for dinner on a weekend though since I have heard it gets really packed then."}
{"text":"This was my 1st time here and I have to say that it was very good. Tried the shrimp po boy and sweet potato fries and it was excellent. Next time I'll try something else on the menu. Service was good and quick. I recommend this place to try out."}
{"text":"Wish I could comment on the food, but we ended up leaving 40 mins after ordering soup and small brunch items. Place was not slammed but severely understaffed for front of the house and more than likely back of the house. Heard great things but terrible first experience."}
{"text":"We stopped by on a very warm afternoon for lunch. We were literally the only people in the restaurant which was weird because they have a nice little patio out front that was perfect for day drinks and catching some sun. 

I got the bayou bomb. Which was sweet and satisfying. Plus alcohol content was defiantly high! I got the blackened chicken, with cheese grits and cucumber balsamic salad. The grits were the best part of this dish. If I went back I would get the shrimp and cheese grits instead. The chicken was good but nothing too special. It also came with cornbread and I was very excited for this but was disappointed by it. It had an almost fake sugar flavor at the end of each bite. However nothing was so bad I wouldn't return. It was just that those things weren't my flavor! 

A definite hot spot for cheese grits and day drinking on the patio!"}
{"text":"We went here for my husband's birthday.  The place was dead cause it was a Monday at 5.  The waitress asked us 5 times what our drink orders were: 5 sweet teas...sooooo hard to remember especially with maybe 15 ppl in the restraunt.  I had the seafood gumbo and being from Louisiana that was the worst excuse of gumbo I've ever put in my mouth.  Thick and gloopy with what was definatly frozen seafood.  The corn bread was dry and cakey.  The rest of our party was equally not impressed with the food.  Almost immediatly after the meal I felt sick."}
{"text":"There are some times when my taste buds want to feel like they are on a vaycay to NOLA without having to go any farther than NoDa, for those times there is Boudreaux's.

They have a solid menu, ranging from Po' Boy sandwiches to full on, dig-your-heals-in entrees. The bf swears by the Jambalaya. I'm more of a Shrimp & Grits gal myself. Honestly though, I've never had a bad dish there so feel free to go with what speaks to you. If it happens to be Sunday, I tempt you (well THEY tempt you) with brunch between 11:30-3. Stop by, order up a cajun bloody mary and enjoy the soulful sounds of the vibes player (or whoever they have performing this week).

Last time we were there Boudreaux's was surprisingly empty and for the life of me I can't see why. The server was sweet, the food was, as always, tasty and they Hurricanes were half price. Charlotte, get on in to Boudreaux's next time you are craving some cajun and laissez les bons temps rouler."}
{"text":"Expected better after reading the reviews. The food is overpriced and we waited for a while for food. I had the crab cakes sandwich and it was far to moist. It felt like I was eating tuna salad. The fries are awesome. Best part of the meal."}
{"text":"There's not much else to add about this NoDa favorite that hasn't already been said. If you get here on a Friday night around 6 its' a great place before taking in the gallery crawl. Recently I was here again with some friends. Last time I had the Gator Bites which are good but more of a novelty than a signature dish you should order time and time again.

I was reminded why its such a favorite, laid back casual atmosphere and excellent food at a fair price. A friend of mine who was a New Orleans native recommended getting the Beignets as they were as close to authentic one could get in this area. Alas I've never had them as they are only available at brunch.

On this visit I ordered the Shrimp Po' Boy. It was delicious, it was filling, the only complaint I had that the size of the bread was so large that it was very difficult to actually eat it."}
{"text":"Service from our waiter Jacob was very nice, he was polite and casual. Very helpful in his suggestions. Food was good. Gator bites are a great starter. Our table ordered two different gumbos after reading such great reviews. Both were very bland and disappointing. Had to add salt to bring out at flavor. Gumbo was mostly rice and almost no meat. Our main dishes were very good. Tried the fried chicken and pork chops. Mac and cheese side is a must! I'd go back for sure. ...bonus, Bloody Mary bar was excellent"}
{"text":"Great great great Sunday brunch!  Their cajun (bloody) mary's are to die for!!!!!!! Biscuits and gravy were excellent along with Charleston grits and cup of fruit!!"}
{"text":"Great brunch! Love the Bloody Marys. Not fancy shmancy at all. This is the cool lil' arts district of Charlotte which they are trying to expand. Must try the creole shrimp and grits, and the alligator."}
{"text":"Wow. I have to say, I can't say I know what authentic Cajun food tastes like, but I'd imagine this is as good as it gets around here. I stopped by for dinner late on a weekday night and ordered the Cajun Carbonara, which had the perfect amount of heat without detracting from the wonderful flavor. My date, who was more acquainted with Cajun cuisine than I, had the Low Country Shrimp & Grits. He absolutely raved about them, and the bite that I tried was just as flavorful as my own meal. I'd happily eat it, and I'm not even a shrimp or grits fan! The cornbread that came with each meal was pretty solid, but not the best I've ever had. I will say that the service was a little slow, but they were very kind and I had no problem waiting. The portions were pretty huge, so don't feel shy about boxing it up!

EDIT: Alright. It's sad, but I had to drop this review from 5 to 3 stars because I'm fairly sure my boyfriend got some serious food poisoning from the questionably \"shelled\" shrimp in his shrimp & grits. (I can further confirm this because I only had a bite of it and had a lesser bout of food poisoning myself the next day.) Just be wary of what you're eating, folks - even if it IS delicious."}
{"text":"Pros: fast seating, half off mimosas and blood marys on Sunday. Cool menu items. 

Cons: Our waitress put the wrong appetizer in for us, we ate it anyway. Our food took probably 45 minutes to come out, it was two shrimp po-boys one with fries, one with chips. Both came out with fries. The tables sat after us had burgers and their food came out first."}
{"text":"The first time I went to Boudreaux's, Yelp didn't even exist in Charlotte.  Since then I confess, I had forgotten about this Cajun haven.  In recent weeks however, I have rediscovered this NODA treasure and it has quickly become a staple in my food/restaurant rotation. Here's why...

Parking:  As I reflect, one of the reason's I stopped going is because the parking situation is so precarious.  Like so many other establishments in NODA, there is no parking-lot reserved for Boudreaux's patrons.  You're best bet is to UBER or cab-it, but if you have to drive, try the many side-streets of NODA or perhaps in the YMCA parking-lot down the street.

Service:  My initial return visit was the evening of Friday, April 22. I was there for a birthday dinner for a good friend.  On that visit, I had some of the best service I've ever had anywhere in Charlotte.  The waiter, who my buddies said, they've had before, was on point with everything - drinks, clearing the plates, asking us if we needed anything, extra napkins, splitting the checks, etc.  Simply amazing service.  My most recent visit came this past Saturday - April 30th, around 1pm.  The service was just ok.  To be honest, it was a little on the slow side.  Nothing outrageous, I just thought it could have been a bit better is all.

Ambiance/Lay-out:  The atmosphere at Boudreaux screams NODA in so many ways.  They have a nice open-air seating/dining area similar to Cabo and many other spots in the area.  There's also a nice bar area with plenty of high-top chairs and seating directly at the bar as well.  Then of course they've got a plethora of tables and booths scattered throughout.  It never feels like its well-lit in there, but who cares.  There's a huge book-shelf, with a bunch of books I'm willing to bet haven't been opened in decades, separating the dining sections - so NODA. 

Food:  Let's start with the Gumbos.  That's right 'Bos, because they have THREE different types of GUMBOS!!!  I sampled my friend's \"YAYA\"Gumbo and was so amazed with how tasty it was, I ordered a cup of the \"Signature Seafood\" Gumbo  myself - even better!!  They both have a nice soft bed of rice that soaks up all the soupy elements of the Gumbo.  They also serve their soups and Gumbos with a nice hearty piece of cornbread.  But what made me go back in the span of a week you ask?!  The Mutha-F-in SHRIMP AND GRITS!!!  The evening of my friend's birthday I got the \"T-Boo\" or small portion and loved it so much I went back the next Saturday and got the \"Beau Jacques\" or large portion!  Pick an adjective - amazing, real and spectacular, yummy, tasty!  The shrimp and grits contains plenty of andouille sausage, peppers, onions, plenty of creole seasonings and shrimps all over a bed of creamy, tasty, cheddar grits!!  The flavors and textures work together in perfect harmony - the crunch of the peppers and the softness of the grits for example.  So good, all I can do is be quiet and shake my head...      

Rarely do I give 5-stars because of one menu item, but this place gets 5-stars bc of the SHRIMP and GRITS alone!!  I can't wait to go back.  If you're ever wondering if you should go to Boudreaux?  I say Boud-Yes!!!"}
{"text":"Wow, how is it possible for a Cajun place to have so little flavor? Everything here was completely bland, uninspired, and barely resembled the amazing food that comes out of New Orleans. I've seriously had better Lean Cuisines than what we ordered. It probably didn't help that we came a few days before Christmas, originally planning to eat at Revolution Pizza across the street, but having to settle on Boudreaux's because Revolution was closed for the holidays. As soon as we walked in you could feel the nasty cigarette smoke in the air (http://www.flickr.com/photos/wedoitforlove/4385694117/in/set-72157623503537096/), I definitely do not miss that about North Carolina restaurants.

After waiting well over 10 minutes, someone finally came by our table to bring us some water, but they didn't take our order. We waited another 10 minutes to at least see a waiter, and I finally got impatient, went over the bar, and asked who the hell we could give our order to because we had stuff to do besides sit around in an empty restaurant. Apparently there was some confusion over who was supposed to take our table, and instead of figuring out which of them should do it they though the best course of action was to ignore us completely, not smart.

Since we were already delayed a good bit due to the slow service, I decided to only get one appetizer for the table, the gator bites. I really love the flavor and texture of gator when cooked properly, and my mom or Nicole had never had it before, so I wanted them to try it as well. The pieces we got were pretty miniscule (http://www.flickr.com/photos/wedoitforlove/4385694465/in/set-72157623503537096/), and the plate as a whole wasn't much in size or appearance. They basically charge you for novelty, and then make it as generic as possible. In fact, the pieces were so small, some bites wound up being more breading than meat, really sad. The cajun \"mayeaux\" was also far too creamy, and too much mayo and not enough cajun.

I ordered the shrimp and crawfish etouffe as my main lunch item, as I generally love anything cooked in a good roux. This was another tragic failure. The shrimp were not cooked properly, and the crawfish was virtually missing. The roux was a sloppy mess (http://www.flickr.com/photos/wedoitforlove/4386459240/in/set-72157623503537096/), and even the cornbread was doughy instead of crumbly. Worst of all, there was NO flavor, it tasted so horribly bland. Etouffee is supposed to be one of the crown jewels of Creole cuisine and they butchered it.

My mom ordered the blackened chicken salad, which sadly was probably the best thing at the table, but unfortunately it too was still lacking any solid flavors. How you manage to cook something \"blackened\" and leave it devoid of any charred or spicy flavors is beyond me, but it looked like they just rubbed some red pepper on and prepared it normally. 

I didn't even bother trying Nicole's oyster po'boy, because the baguette was completely ruined (http://www.flickr.com/photos/wedoitforlove/4385695997/in/set-72157623503537096/). The bread was practically crunching off like charcoal with each bite she took, and the oysters themselves were tiny and fried for entirely too long. The fries were edible, but overcooked as well, and probably sitting for a while because they weren't very warm.

How much of this horrible meal was due to it being Christmas week and them probably understaffed and under-enthused about having to work I'm not really sure, and I honestly don't care. If you're going to be open you should treat every day the same, and give customers the same quality of service you normally would, otherwise give everyone a 50% discount for your 50% effort."}
{"text":"While visiting with some dear friends in North Carolina over the Labor Day weekend,  we were delighted to be introduced to the NoDa section of Charlotte, despite the torn up sidewalks and make-shift potable water lines resulting from the recent discovery of the soil contamination. 

The four of us sat down to what seemed was to be a nice dinner at Boudreaux's.  Our waiter was friendly and enthusiastic.  We placed our order drink, along with four appetizers.   Our alcoholic beverages arrived in a timely fashion.  We waited for an extended period of time for the apps, but were so busy chatting, that it didn't seem to be much of bother to us.  

Finally, the waiter arrives with our plates.  DINNER plates, that is.  Perplexed, I ask \"What about our appetizers?\" . He, looking completely stumped, replies \"Appetizers?\" .  In turn I reply \"Yeah, we each ordered an app!  We ordered them along with our drinks.\".   

Then, you could almost see the light bulb go off in his head (almost)!  He remarks \"Oh no!  Oh, boy.... I forgot about them.  They've been sitting up on the counter.  I didn't realize they were for me.  We're really short-staffed tonight and I'm swamped!\"   

At that point, we told him to forget about serving them to us as we all had our large meals, but he was insisting to bring them to us (not comped).  Two of us gave in to his urging and so he brought out my friend's She Crab soup (eh) and my alligator bites, which were of really poor quality, and I doubted their authenticity.   In fact, I picked the thick, mushy breading off a few of them and I unveiled a couple of pieces of crawfish!  

We wondered why the waiter felt \"swamped\" as the restaurant was only at about 60% capacity on this Saturday holiday night.  When wait staff makes a big blunder like that, they should really ask permission from the manager to make it up to the patrons by offering free dessert or removing an item from the bill to compensate.  But, no- we were granted so such gratuities.  My Charlotte friends won't be going back there anytime soon."}
{"text":"We went here before a concert at the neighborhood theater, as it was recommended by our son. They didn't have our first choice for food or my husband's first choice for beer, so the manager came over and comped the beer and offered an alternative. So we ended up getting burgers and they were really good. Great service too!"}
{"text":"This restaurant is very nice. Everything on the menu is very delicious. The servers are very friendly and professional. A must go if in the NODA area."}
{"text":"I've been here a couple of times and the food is good. I got the pork chops with greens and tasso mac and cheese. The pork chops were well seasoned and the greens were full of flavor and very tender . The mac and cheese was good but I could've done without the tasso in it.  I actually picked around it. I'm a southern girl and we don't play when it comes to our sweet tea, grits and mac and cheese. 
I'm not a bloody Mary fan, but if you are, they have a bloody Mary bar and it's $1 off bloody Mary's on Saturdays."}
{"text":"\"Yay! I'm a fan\" pretty much sums it up.  Good food, good vibe.  If a well-stocked bloody mary bar doesn't really make you smile, there's something wrong.  Coffee was extra weak, but hey, everyone has faults. 

Croissant florentine benedict, beigets, bloodys FTW!"}
{"text":"We got there at 7 o'clock. At 8:40 half of our table got there food, cold. By 9:10 the other half of the table still didn't get our food yet, including the kids. Not once did the manager come speak to us when we ask to speak to him 3 times. We even called ahead to let them know we were coming. Over 2 hours at this restaurant and the kids had to leave hungry bc we ended up leaving. We took them down to Benny's to get some pizza. This was one of my favorite restaurants in charlotte and tonight was very very disappointing. I understand if you're a little behind, but management did absolutely nothing for the customers and I can see that most of the other people in the restaurant was very upset. I'm writing this at 10:00 pm hungry."}
{"text":"Came here before a show at Neighborhood Theater.  This was after we sat at Revolution Pizza for 15 minutes without being served, but that's another review :)  
Boudreaux's hostess and waitress were friendly and welcoming.  They didn't seem stressed by the Friday crowd.  
I got their veggie burger and it was one of the best I've ever had.  I've had A LOT of veggie burgers, mind you. 
Definitely give Boudreaux's a chance next time you're in NoDa and either a) want to try something different, or b) don't feel like waiting 30+ minutes to be seated at one of the usual suspects."}
{"text":"Love this place. The food, the service and the ambiance, all, are beyond AMAZING. 

Do call and make reservations, as the place gets very busy."}
{"text":"Came here for brunch...been looking for a Louisiana themed place for a while now. The ambiance is very different. It's almost as if they're trying to give it the French cafe look but with beads and plastic decor randomly set up in different place and instead of the live music being upbeat like the NO feel would give you, it was more so sad and somber. It was cute though and has a lot of potential to be great. I ordered the crab omelette and some beignets in hopes of it being similar to my French mother's and my bf order the shrimp and grits. I will say my omelette was surprisingly good I had no disappointments especially since I went ahead and put the hollandaise on the side( Im not a huge fan). The beignets were good but nothing compared to authentic, they were overloaded with powdered sugar like wayyyyy too much. The shrimp and grit ratio was off a lot of creole sauce, decent amount of shrimp, not even close to enough grits, and the cornbread that came with it deserves a prayer and some Holy water(it was hard and disgusting). I will say I'd give the place another try but for a Louisiana themed restaurant it def would not be for the shrimp and grits."}
{"text":"I used to live in Charlotte and I've always loved this place.  My ex indulged me and took me here while I was here on business.  I love spicy food and the fact that this place looks a little dive-y lends to it's charm.  I have never had a bad meal here and I've had plenty.  Their cornbread is outstanding and their drink selection--especially the wine choices-- are right on target.  Their vegetarian dishes are great and I've always enjoyed their crawfish, too.  My ex had a great smoky rotini dish and although I don't like any other pasta other than whole wheat, I couldn't keep my fork away from his leftovers when he wasn't looking."}
{"text":"Overall great first time. I was craving a burger, which was my fault for getting one at a Cajun restaurant. It was good, but you should get the specials! Friend had the shrimp and grits, and this was amazing! Buttery, savory, and lots of flavor."}
{"text":"I've always enjoyed Boudreaux's.  I love the shrimp and grits and their sweet cornbread.  Shrimp PoBoy is also a great choice. Oh and don't forget about the cheddar grits.  Best cheese grits I've ever had actually. On Sunday Brunch they have live jazz music.  Service can sometimes be slow."}
{"text":"After a gluttonous weekend, we decided to walk to Boudreaux's for our Sunday morning recovery food.  Well, most of us did, but we split up so that some of us took a car and put our name in.  When we asked for 10, the hostess looked quite worried, even when we said we'd sit separately, and advised us to call ahead next time.  Is this really a problem, when only three tables in the place have customers?  But by the time we were seated and everyone got there, the restaurant was packed, and there was a line out the door!  So take her advice: for large parties, call ahead.

I could really get to like this place, at least the bar.  $2.50 Mimosas on Sundays!  Woohoo!  The server was very friendly, and took our orders for beverages, even though she couldn't legally serve us for 20 minutes.  Sure enough, as soon as noon rolled around, we saw the bartender making our order.  They were pretty good mimosas, especially for $2.50.

I was going to go with the Croissant Florentine (eggs Florentine on a croissant), but opted instead for the special omelet (shrimp, chevre, asparagus, spinach, tomatoes).  I was glad that I'd avoided the Croissant Florentine because they'd used frozen spinach, but I wasn't thrilled with the omelet, since the eggs were overcooked, making the whole thing chewy.  I wish I could have just gotten those toppings on scrambled eggs.  The portions were HUGE, particularly for the biscuits and gravy.  

While the food wasn't great, I think that had more to do with my tastes and poor ordering on my part.  The staff was wonderful with that relaxed Cajun vibe permeating the air.  I will definitely go back, but I'll be trying some of the Cajun classics instead of the omelets."}
{"text":"love noda and was hoping for some true cajun food, but was disappointed by the tiny, tiny shrimps on the po'boy. my mom liked the muffaletta though."}
{"text":"The customer service is great! Very friendly! The gator bites were great! The snails where excellent! Very fresh food! Still waiting on the main entree!!"}
{"text":"I've been here many times and I'd say that 3/4 of the time I leave happy.  I've had two average experiences but otherwise love the food here.  The bourbon fried chicken (comes with gumbo ya ya) is so yummy good, I get it pretty much every time I go here!! The steak au poivre that my date got the last time I went was amazing and one time I got the Cajun Carbonara which was okay but not a wow experience.   I probably should try more things but I'm not a big seafood fan lol.  

It's a great place to go to before a night hanging out in NoDa.  Their seating and layout for me isn't the greatest but the staff is amazing and therefore makes up for it.  Their wine selection has let me down many times and their Hurricanes tend to be weak, however I have heard amazing things about their bloody mary's!  Overall this is definitely a place to check out though!"}
{"text":"Excellent the service was great! We arrived at breakfast and noticed the fish and grits weren't on the b menu. However their team made an exception and made sure that as out of towners we got a chance to partake. It was delicious I had the Mahi Mahi and my partner had the Salmon both were great!"}
{"text":"The Level 2 Hurricane was really nice! My food was extremely flavorful and this is definitely going to be one of my regular spots! For starters,  I enjoyed the fried pickles which are really plumped. Next I had a cup of the gumbo with okra, delicious! For my entree, I had the fish and grits, one of the best things I've ever tasted! The portion sizes are so large that I had to get a carryout, but my belly enjoyed it the next morning!"}
{"text":"My wife and I had a delicious meal tonight at Boudreaux's.  I had ettouffe and my wife had gumbo ya ya.  The service was very good, we will definitely return in the near future!"}
{"text":"The seating in  this place is really cool. Very large. You have the option to sit outside, our inside side in the room with the over head garage door to still get the outside weather. They also have regular indoor seating and a bar. Like a said place is huge. I got the gator bites, which basically tasted like boneless chicken wings. Also tried one of the gumbo a that I didn't care for. Finished up with a bowl of she crab soup which was the best out of the 3. I don't know that I would go again personally, not that there was anything wrong, but nothing really \"wowed\" me."}
{"text":"Fans of Cajun food definitely have to try this spot. I had the jambalaya while on a great date there. My expectations were a little high because I travel to New Orleans sometimes just to eat or bring back seafood. But this place is really good and reasonably priced for this kinda of food. Next time I will definitely try the brunch. In a great neighborhood..very artistic creative vibe in the air."}
{"text":"Love the fish and grits! Best in Charlotte!"}
{"text":"Tyler, our server has great customer service and gave us great directions on what to eat and what's good. I really enjoyed he spinach dip very delicious app"}
{"text":"Who would have thought you could find amazing Cajun food in this small, hole in the wall?  We ordered the gator bites, they were fried and pretty hood.  But let's face it, more of a experience than a gourmet item.  I had the fish and grits and my friend had the chicken carbonara, both were phenomenal!  Huge portion, just right amount of spice, great piece of sweet cornbread to sop it up.  Skip the chains, try something new, support locals!"}
{"text":"I have eaten at the Boudreaux's in Blacksburg several times and decided to try out the one in Charlotte as well. The location is great being right in Noda and the food was just as good as in Blacksburg. I tried their veggie burger which was nothing amazing but good and their homemade chips which were delicious. My mom ordered the vegetable rotini which was delicious and something I wish I had ordered. They had some local beers on draft which was nice and they had a jalapeño one which was very delicious."}
{"text":"Went there on a Friday evening. The NoDa area was booming. People everywhere. Had to circle longer than expected to get a parking spot. Hostess and waiter were very nice. Food was ok. Nothing to go too crazy about. With the front wall/bay door(whatever you want to call it) being open, a good amount of cigarette smoke travels from a nearby establishment. That smell is consistent and can be aggressive at times. 

Went for the experience because the wife mainly wanted to go.. but with so many other resturants in the area, we will likely try them out rather than returning here."}
{"text":"Let me start off by saying, the food is excellent. 

Now that I've gotten that across, the service is HORRIBLE. 

Me and two others were seated and our drink orders were taken, and shortly after our food order. After 15 minutes of waiting patiently for our drinks, our server Nate (bless his heart, he needs a new career), comes back to the table to explain that the drink ticket was lost and our drinks would be out soon. 2 minutes later, came back to inform me that the beer I had ordered was out and asked if I wanted another drink, at which point I ordered a bloody Mary. About 10 minutes later, a table of 8 just beside us, is asking for the manager. They were seated after we were informed our drink tickets were lost, so I guess we must have been patient. After asking for the manager and explaining their drinks hadn't come out yet, I couldn't help but speak up to explain about our 30 minute wait of no drinks...the table of 8 immediately decided to leave after that. 

We then explained to another waiter about our wait, and Nate, our original waiter came back to apologize. A couple minutes later, our appetizers were brought out, and still no drinks. 

We were sitting close to the bar and could see 2 beers sitting there for 10 minutes. Nate even picked them up, as if he was going to deliver the 2, but put them down and thought otherwise. 

After a wait of 40 minutes, our drinks were finally brought out. 

At no point was any attempt made to correct the situation, only excuses about being understaffed and busy, although the place was half full at best. 

So I leave it at that, my belly full and satisfied, but annoyed at my time here. If I'm back, I will be calling in ahead of time and doing take-out."}
{"text":"Left feeling bamboozled. I have never seen celery in shrimp n grits. Made the grits taste bitter. My honest impression was they intentionally overload the dish with celery to use less shrimp. Location is excellent."}
{"text":"We won't be visiting again. We had out of town guests with us on Friday evening and were originally looking to eat elsewhere, but the wait was too long, so we decided to walk up the street to Boudreaux's. It wasn't too crowded, so we decided to get a table. The waitstaff did not show up until we had to ask the host to send someone over. Although our waiter was friendly, he delivered the wrong items to our table. One of our guests didn't receive his food until everyone was almost done eating. This place just isn't worth it."}
{"text":"Went for lunch on a lazy Saturday, seated in room with wall open to the outside, perfect for the good weather. I had the bourbon fried chicken over gumbo yaya, delicious!  Staff was friendly and helpful. I'll return!"}
{"text":"Boudreaux's is delicious and reasonably priced.  I've been for brunch and for dinner and I've never left disappointed.  At brunch I recommend the cajun omelette.  If you're in the mood for a sandwich, have them wrap the omelette in a tortilla.  For dinner, the Cajun Carbonara is terrific for those of you who love spice."}
{"text":"Been going here for years. Never had a problem with their customer service. Always friendly. Usually start with the gator bites & order the jambalaya as a main course. They now have 2 sizes (smaller size is a nice portion). Have tried a few things & nothing has disappointed. Good selection of hurricanes & bloody marys. Would recommend."}
{"text":"This was my second trip to Boudreaux's. This time i was much more satisfied than the first trip (not that it was a bad 1st trip). Maybe my Cajun expectations were lower this time after being disappointed at the Cajun Queen a few days ago. 
i went with the jambalaya as per usual and was very satisfied. Served with some cornbread, i had enough leftovers for tomorrow's lunch. My friend had some spicy noodle dish, i can't remember the name. He enjoyed it, said it didn't seem too southern and wasn't as spicy as advertised, but good.   
We went right after they opened (11 am) for an early lunch and were the only people there, so the service was attentive. 

2 entrees, 2 drinks =22 bucks plus tip"}
{"text":"I was really excited about this place based on personal recommendations and yelp reviews. I've heard the dinner is amazing, and with such a high rating level, knew this would be a great place to take friends from out of town. However, we decided to go earlier in the day instead of for dinner.
Went for brunch with 3 other people. Now, I understand that Charlotte is still working on their brunch scene compared to other cities, but brunch is brunch!
The food was cold, and service was slow. Our waitress was really friendly but very relaxed. She was attentive when it came to our coffee, but would disappear in bouts of 10-15 minutes. It wasn't very busy. The food was good, not great. I got the Breakfast Burrito. It was cold, and the cheese was hard. My friend really enjoyed the Shrimp Omelette, but did mention it was luke warm. Could be an attribute to our waitress performing Houdini disappearing acts. 
Overall, this place is good not great for brunch. It would be a place that if I had to have a fourth or fifth option for brunch, I might think about trying it again during this time. As to other times during the week/night,  I'm not giving up on this place! I've heard their Shrimp And Crawfish Etouffe and Bloody Mary Bar are as authentic as it can get. I will be back for dinner!"}
{"text":"Can't miss with the gator bites or the gumbo. Everyone's plate around us looked like you wanted to ask for a bite. You MUST try the blue crab omelet."}
{"text":"As both myself, many friends and my boyfriend have all been servers in many establishments, we all tend to notice a bit more than your average customer. Not so much because we want to (sometimes it takes a LOT away from a dining experience), but because we were trained to. Generally, when I go out with my boyfriend we get lackluster service. I don't know if it's the combination of our 20-something age and generally casual appearance or the fact that we don't really try to ask much or seem to require attention. Either way, we've been searching for a decent place with attentive, but not obtrusive service that has good food absolutely NOTHING LIKE a chain restaurant. 

We found it. 

I found Boudreaux's on yelp while searching for something, anything new. All the reviews were helpful and mostly accurate. We headed down there and it was easy to find. Parking nearby costs $3 if you're a pansy like me and don't feel like parallel parking a Buick. There's a little box that you shove some dollar bills into and I'm ASSUMING someone checks it, but who knows. Maybe it's just an honor system. 

We sat in the front room behind the garage like door that connected one of the dining areas to the patio. It was open, the sun was beautiful, the breeze was nice. Once it got chilly, the server closed it. 

Our server was polite, but not stuffy, friendly, but not overly talkative. The best part of dining in a non-chain restaurant is that the servers are not under penalty if they don't immediately try to offer you 3 beverages, an appetizer and up sell the special. They're more inclined to tell you the special, trust you to READ the menu and answer any questions you may have honestly without sweating bullets because they have a mental checklist of things they HAVE to say. If so inclined they might tell you THEIR favorite, but it's not a forced speech. That is what we got. Perfection. Nothing forced, no worries on those pesky shoppers. 

The Food: We ordered the Shrimp & Grits (couldn't resist) and the Shrimp Creole Rotini. I can honestly say the Shrimp Rotini was one of the best things I've eaten in years. There's an obvious bite to both dishes w/o overpowering the whole dish and both were served with delicious cornbread. Also, they have many different hurricanes, but we only tried the category five which was fruity, but strong and absolutely perfect. 

The very next day I was craving some more Boudreaux. The atmosphere was so laid back, the food was so good, the service was so fantastic and relaxed, but on point. I ended up dragging along a friend, trekking up to NoDa and doing it all over again. This time we got the Gator Bites (delicious spicy mayo) and I was feeling the fried shrimp. Still delicious, still great service, still good hurricanes, still love it. 

My boyfriend told me that that area (I'm still slightly new to Charlotte) didn't use to be so filled with funky little places and interesting restaurants. He said a lot of them fail too. When we asked our server how long they'd been open he told us ELEVEN years. Now that's what I like to hear. That means that without all the bells and whistles and fancy stuff, this place has survived solely because it has soul. Good management, I assume, great food and no pretense. It makes sense. 

I wish I lived right next door to this place. They'd get tired of me sitting there downing their delicious cooking, reading Creative Loafing and sipping on Hurricanes. I can't wait to try the Cajun Mary."}
{"text":"Had dinner here with some co-workers and it was a nice experience. We had a table on the patio that is half inside and half outside and enjoyed some food and drinks.

I went for the Cajun Carbonara Dish. It was very good, had a lot of flavor, and a nice large portion too.

They have a big drink selection with a focus on mojitos, I had the PineAngo mojito, solid."}
{"text":"This is the spot for the best Cajun food in Charlotte.  The shrimp creole is delicious and you can't go wrong with the jambalaya.  There are plenty of great drink options including a variety of hurricanes.  The atmosphere is laid back and totally reflective of NoDa. Dinner here followed by a show at Neighborhood Theatre makes for a fantastic night."}
{"text":"Ugh. 

I've given this place two tries.  The first was at a Upstage performance.  Food was cold, but serviceable.  I attributed that to the location and the fact that they have to carry the food up the stairs and around the corner to get it to Upstage.

Well tonight proved 2nd time is not the charm.  

Drinks - Girlfriend ordered the special, a Poinsettia, it tasted like olives.   I ordered a diet Pepsi.  I complained that it was flat to which the friendly waitress said \"yeah someone said that last night too - I think we are out of carbonation\"  WTF?  Really?  She replaced both offending beverages with no complaints.

Food - overpriced and very very greasy.  The hush puppies were good, but not worth the 7 bucks.  My ribeye was fatty..fattier than it should have been.  The potatoes and asparagus were also covered in grease.  Girlfriend got the gumbo (just a cup)  she said it was good, but her entree was also all butter/grease.

I will not be back.  Bad experience.  Waitress was nice, but it speaks something about the establishment when a full 24 hours after they discover an issue with carbonation at the bar, that they A) still don't fix it and B) continue serving carbonated beverages.  Yuck."}
{"text":"Was going to CABO FISH TACO before a show but the wait was too long. Decided to go to an old favorite, BEAUDREAUXS,.....wrong choice sparky!! They didn't have a wait and unfortunately I found out why. This had been a favorite when we were visiting Charlotte, and now that we had moved back it seemed like a logical choice.  The waitress was great and we gave her our entire order at once.  The beer was cold and my CAT 4 HURRICANE were the best parts of our meal.  I started out with the SEAFOOD GUMBO, full of flavor and barely tepid. Having been in and out of the Food Service Industry most of life, bad food and bad service usually makes me your worst customer nightmare. This night I wasn't in the mood because of the performance we were going to.  I had the SHRIMP and CRAWFISH ETOUFFEE....once again tepid...the roux wasn't dark, not much flavor and no HEAT...thank God there was hot sauce on the table. My wife had the Jambalaya...this was hot....but unfortunately dry. My cornbread was hot and moist my wife's was burned and dry. Her next piece was right. Did the kitchen not notice the burnt edges!  Well BEAUDREAUXS we tried but unfortunately you did not. Next time we'll just bide our time at CABO or one of the other restaurants in NODA."}
{"text":"I'm from Louisiana so I tend to be a bit critical of \"Louisiana Kitchen\" places outside of the bayous of South Louisiana but these guys pretty much got it right.
The bourbon friend chicken w/ gumbo yaya was really quite good. They don't overdo the spices but the flavor is still strong.
The atmosphere is a little bit dive-y but overall, we really enjoyed it."}
{"text":"I'm usually not a big fan of Cajun Cuisine, but Boudreaux's Louisiana Kitchen knocked my socks off. Came here for a nice brunch on a lazy Sunday morning.  The restaurant reminds you of a \"modern shack\" you might find near the shores of the Louisiana Bayou.  Multi-colored beads are hung all around with a chalkboard eloquently displaying current specials. 

That morning there was a lovely jazz duo playing some tunes which complimented by $2 mimosa quite well.  We ordered the shrimp and grits, tasso ham and cheedar grits.  My shrimp and grits were pretty good but the chef could have went easy on the amount of celery and onions he put in there.  Either way, it came with a lovely wine sauce on top of the creamy grits.  Shrimps were plentiful and were plump and tasty.  The tasso ham was so flavorful that I wish bits of them came in my shrimp and grits.  Cheddar grits were good but let's face it, it's kind of hard to mess up cheddar grits.

There were a mix of people there including a table of what appeared to be college-aged kids with a really loud female in the group.  Luckily they left about 15 mins after we arrived.  There were also families and couples.  Real cute.  This is definitely a nice spot to take a date when you're getting to know each other (fellas, hint, hint!)

Service was quick and cordial.  The manager will come out to make sure you're doing good which is always a nice touch in my opinion. After you're done eating, go check out some of the nearby boutiques."}
{"text":"I had the pleasure of visiting this find establishment this past Sunday for brunch.

The wait staff were phenomenal. Food was excellent. The biscuits and gravy were quite possibly the best i've ever had.

Portion size was great. Leaving me enough to even bring home for a snack later.

Well worth the trip. First of many to come!"}
{"text":"Hubby and I went here last night, because I saw a shrimp po'boy that was in New Orleans on t.v. and had to have one. So I turned to Yelp to find the best options for a Po'boy.  Well Boudreaux was close to the house, so we decided to go there. When we arrived, we stood at the front desk for about 5 minutes before we were sat. There as only two people that was working the floor that night, the bartender and the server. There was about four or five tables including a party of 8-10, so I think that there should have been at least another server on the floor. 

So was in a hurry and very distant, which did not bother us much since he did provide great service and besides we were ready to eat anyway without all of the extra details. Of course I ordered the Shrimp Po'Boy and my hubby ordered the Blackened Bleu Burger. After ordering, it was about 15 minutes when we received our food.

First everything came out great and looked good, but my shrimp was sat on top of my po'boy, just waiting to fall off. I hate having to maneuver my food to my mouth. Three of the shrimp fell off onto the table, which I still ate and gave my hubby a chance to steal one, I just wished that they would have constructed the sandwich a bit better. Also a little spice would have been great . The fries was fantastic!! My hubby burger was good too, and the pasta salad was just meh, nothing special.

Overall the food was good, but nothing that transferred us to New Orleans."}
{"text":"I've had brunch here a couple of times and I love it. If you're like me, you'll wanna come on a week day when it's a little slower. Try the gator bites!"}
{"text":"If you're in the mood for an authentic Hurricane go here.  Dinner of blackened catfish hit the spot. Cornbread was average.  Great meal, and cool drinks!  What more do you want."}
{"text":"The jambalaya is incredible. Very good taste, not very spicy if that is your thing you can kick it up with hot sauce. Good local beer on tap and a friendly staff."}
{"text":"Jambalaya.  Oh my goodness.  The jambalaya.

I had to make myself stop eating.  I ate my left overs at 11am the next day, I was so excited about it.  

This is a really great little casual place.  I don't know why I never came in sooner.  I came here for date night last week and it was really nice.  Our server was on top of things, super helpful and constantly refilling water.  (Sometimes, I drink water like a mad woman).  The jambalaya has a little bit of everything in it; chicken, sausage, shrimp, craw fish.  It's amazing.  It's one of the pricier things on the menu, but a million times worth it.  

I need to come back here for the hurricanes.  An entire menu devoted to them?  Yes please.  I'll update my review after that!  

See you soon, Boudreaux's."}
{"text":"A definite favorite. Start off with a couple Vieux Carres (very much like a Manhattan). Excellent pour. 

Just love the etouffee - loaded with crawfish and a huge portion to boot!  Very casual and warm kind of place. Friendly service as contrasted by the rude service at the Crepe Cellar just down the street. 

I would definitely recommend this place to anyone."}
{"text":"I was taken here for dinner and was simply amazed. My dinner began with a creamy asparagus soup that was awesome with a  side of corn bread. The corn bread wasn't impressive but the soup was. My entree was the vegetable rotini dish and it was amazing! It had multicolored rotini pasta with sun dried tomatoes, mushrooms, asparagus, etc. all topped off with a dash of asiago cheese. I liked that the dish did not include a lot of cheese and it came with a side of rosemary bread. Our server was great and the atmosphere is nice and cozy!!!"}
{"text":"Me and one of my friends visited Boudreaux's last month after an evening yoga class in the neighborhood.  It was a rainy, cold Thursday evening, so the place wasn't busy.  Unfortunately, we were immediately struck by the VERY THICK haze and stench of cigarette smoke.  

My friend ordered the black-bean veggie burger with a side of potato salad and I ordered the shrimp po'boy with a side of fries.  We were both shocked by the large portions of both of our meals.

The seasoning on my fries was a tad stronger than I like but not overwhelming.  The bread was lightly toasted and very thick which made eating the sandwich a little difficult.

However, my friend commented on the fact that her veggie burger had the texture and taste of a regular beef burger! Also, she noted that her potato salad was very satisfying and delicious.

Although our meals were very enjoyable, having to deal with the thick stench of smoke put a major damper on everything else. Also, our waitress didn't appear to be all that interested in providing much service to our table.  

I hear good things about their brunch menu, so I would be willing to try them again during the day. Hopefully, the next time I go it will be on a nice day so I can sit outside and not have to worry about cigarette smoke interfering with my meal."}
{"text":"Literally amazing. The service was great, the food came fast and the food was incredible. I ordered the shrimp and grits (a must-have) and my friend got the chicken and waffle sandwich which was also amazing. The beignets were hot and fresh and delicious. This place is better than most places actually located in Louisiana. Will definitely be back."}
{"text":"I went here for the first time and loved it! I ordered the shrimp and grits and it was really good. Also GREAT service! Ebony was our waitress and she was very friendly, attentive, and helpful with the menu! I would definitely come back for round 2."}
{"text":"AmaZing flavorful food in a colorful atmosphere. Will definitely come again and again."}
{"text":"As a neighborhood spot...I have tried and tried and tried to find something I like here.I have just never experienced a dish that I found to be tasty or worth the money. I don't remember having exceptional service there either. Is been awhile since I've gone, that I honestly don't remember much else. Clearly it was so lackluster that I haven't even tried to go back since. Unfortunately its not one of the places in the neighborhood I recommend. Sorry...just the truth. /"}
{"text":"I really wish I liked seafood because much of the Cajun menu at Boudreaux's involves seafood and my boyfriend loves the place. Plus, with Mellow Mushroom gone, there just aren't all that many restaurants in NoDa anymore. Still, Boudreaux's is really good. I often get the blackened burger with blue cheese. It's pretty delicious though the very onion-y bun is kind of overwhelming. The New Orleans/Mardi Gras-themed restaurant is a fun place with a good vibe. They also serve up a good brunch menu."}
{"text":"Lover of Cajun food, I had to come here. I love the rustic interior inside. Service was pretty great as well, our server was so friendly & welcoming! The food was kinda of a letdown though which is SOO disappointing because I had really high hopes due to all the great reviews. The food wasn't bad but it was just mediocre. Also the cornbread was cold & dry which makes me super sad because I loveeee cornbread. We really enjoyed the crab/corn hush puppies but the shrimp po boy & etoufee was just alright! (Needs more seasoning)"}
{"text":"Great food for the money. I had the fried chicken served over white rice and gumbo. It was quite tasty and for under $12 quite reasonable as well. 

The outside looked very eclectic and the inside used bright colors and cool paintings. 

There were two hiccups that prevented a five stars. Our server was very polite but felt like she was new. She didn't really explain the menu and she didn't check back with us often. The second reason was the price of the appetizer.  I had the hush puppies.  They charged $7 for four. Granted they were made from crab cakes but $7 for four small balls of fried hush puppies were a but too expensive."}
{"text":"Great food.  The service was wonderful. My mom says that her stomach gives it a A+. Mom had the gumbo- delicious.  I had the biscuits with gravy-ambrosia in my mouth.   The only sad is that there isn't a parking lot or I may not have seen it, but I parked around the corner."}
{"text":"A nice French environment (washed out walls with wooden furniture and scattered plants). The workers make you feel at home with their rolled up flannel shirts and comfortable jeans attire I got the croissant Benedict with a side of French fries (which were to die for!!) we also ordered the shrimp and grits; it had a strong flavor so prepare yourself!"}
{"text":"I really give it 3.5 stars.  I got the sampler platter.  The gumbo and jambalaya were good.  The red beans and rice was just okay and lukewarm.  My daughter got fried chicken and subbed the sides for collard greens and mac-n-cheese.  She liked the chicken but not the sides.  We both liked the cornbread.  The service was just okay."}
{"text":"Didn't really know what to expect for my first visit but the service was good and the food was great. We went for brunch on Sunday specifically for the beignets which were a bit disappointing. I don't understand what's all the rage? HOWEVER, the gator bites are a must have. We've gotten 2 plates each time we've been there for dinner. The étouffée is also a good option. A bit spicy."}
{"text":"So driving around, lost in a new city, we fell upon this place! Not busy at all around 1pm in the afternoon on a Tuesday, but the music was pleasant and Cajun food, always a must! The place was very clean and service was genuine. Our server gave us some great recommendations and even gave us some idea of the area and even days where they had specials per our taste. 

The menu for alcohol was pretty cool. They had a section for category 1-5 hurricane drinks, which our server also said was half off till a certain time. Caught my attention. It had different descriptions for category 1-5 rum drinks which varied on strength and liquors. I got the cat 2 because that was the strength of hurricane Matthew when it hit us in charleston just the week before. It also had info on around 5 hurricanes that hit Louisiana  in the past and had names specifically for those and personalized concoctions for those hurricane drinks. I've never seen this on a drink menu, I really enjoyed it, went along with the theme of Louisiana!

For the food! We only got appetizers because we stopped in between house hunting. We got the BBQ shrimp and the bacon jack fritters. When I read BBQ shrimp, I automatically think of BBQ, southern BBQ, sweet with a little spice, but this was something completely different. In a great way. A buttery Cajun spice mix, not spicy, but flavorful, and the shrimp were a decent size as well for an appetizer. The bacon jack fritters were a surprise as well. They seemed to be fried but not greasy at all, which I always worry about with fried appetizers. You get around 5 pieces and the sauce is what really gets your attention. I'd eat that with any type of appetizer, Parmesan cream sauce. Yummy yummy. 

We definitely will be back to try out the dinner options and enjoy some of the nightlife!"}
{"text":"I've had a few great dinners here, but my favorite was a night out with one of my best girlfriends when she was visiting. We rode around a bit uptown looking for something good, and then we headed out to NoDa when we exhausted our options. 

I had the Vegeletta sandwich, and she had the blackened catfish. The food was great. Our server was funny, but he also left us alone when he saw that we were having a good time. We had my laptop with me, and we jumped on the Smelly Cat's internet connect and watched R. Kelly's \"Real Talk\" video on Youtube. We were sitting near the window out front, so we could watch the crowd pass by. We giggled and ate, and it was awesome."}
{"text":"Atmosphere isn't anything special but the food is very good. I recommend the fish and grits and the jambalaya."}
{"text":"Words don't describe the taste of the food... everything I are was beyond delicious... flavorful... mouthwatering...addictive.... awesome... the waiter was super nice, friendly staff, I'm going back... This place is 10 star"}
{"text":"People were right when they recommended Boudreaux's shrimp and grits.  It's among the best I've had in Charlotte.  It always taste better with cheesy grits!  The andouille sausage was flavorful and the shrimp was good.  My boyfriend had the Monte Christo and I really liked it.  It even came with two slices of pineapple . The rest of the brunch menu looks good as well so I would love to come back to give some other items a try!"}
{"text":"Eh - where's the flavor?

We walked in here pretty early on a Saturday - roughly 5:30ish. The place was pretty empty but as we were seated all the of the sudden the room filled up. There was one waiter for a long time and then finally a second waiter showed up. The service (although super busy) was very friendly and efficient. 

We ordered the crab bruschetta, the jerk chicken sandwich, and the mahi mahi mulate. While the prices are fair (pretty cheap actually) the food is exactly what you pay for. The crab bruschetta thing was ok - no flavor and the texture reminded me of something from a can. The jerk chicken sandwich was blah - I literally just ate the chicken (which had NO spice or flavor...I thought this was a JERK chicken sandwich??) as the bread was too hard to bite into (stale?). The Mulate was pretty good - the etouffe was good but nothing memorable. The best part was probably the fries that came with the sandwich. 

Overall - blah blah blah. Nothing was awful but nothing was good enough to make me come back."}
{"text":"My days of the week include Bloody Mary Sundays and this is my favorite place to cure what ails me. If you want/need/crave a bloody mary, come here. Bloody Mary bars are wonderful because I can and will make a killer bloody mary when supplied with the right ingredients. They have several vodkas to choose from including a pepper vodka which is great for lovers of spice. There are probably 8 different bloody mixes to choose from, including a great house mix. There are hot sauces galore! And so many pickled vegetables to throw in, not just olives. The best thing is they'll have your vodka ready so once that clock hits noon, it's on. 

The food at brunch (because I've only eaten here during brunch - prime bloody mary hour) is aiite. Standard omelettes and other things covered in hollandaise sauce. Have yet to try their beignets, but have heard great things about them. 

In short - when it's bloody mary time, Boudreaux's is my number one."}
{"text":"Decided to stop in after reading all of the wonderful reviews was extremely disappointed the meal was so awful I didn't even attempt to finish it money wasted!!"}
{"text":"Cajun Mary - make your own Bloody Mary bar!  Hot!  Seafood Gumbo - best I've had outside of Nawlins. Jacob - world's most enthusiastic waiter. Great place for a lazy Saturday afternoon brunch."}
{"text":"Boudreaux's Louisiana Kitchen was the first place my coworker and I went to in Charlotte.  Mostly because I was craving Shrimp and Grits!  It's been a while since I had some Southern food.  Overall, based on the dish, pretty good."}
{"text":"We stopped in at 6:12pm. We were seated immediately, and then waited until 6:35 for someone to at least offer us water or drinks. The server attended to the one other table on the patio, but ignored us. The last straw was when another couple was seated, he immediately went to take their drink order. I'd like to comment in the food, but I was never asked to place an order!"}
{"text":"The Cajun festival turned out to be a big flop, and wasn't really a festival and the only Cajun food they had was some overpriced gumbo that tasted like ass and was covered in flies, not to mention the staff didn't even lift an eye when we thanked them.

So here we are, at Bourdraoooow's in NODA!

Service is sloooooow. It wasn't even that busy. The food was okay though. We went with basic breakfast foods, fries and cheese grits (really rich). My grand-pappy used to make cheese grits with shrimp and andewy sausage, so I didn't really think much of the grits here. Everything else was standard.

Slooooooooow service."}
{"text":"I've absolutely loved every dish I've had here. I highly recommend this place to get your Cajun fix. Love their location. Be aware, at Sunday brunches, it tends to get very busy and the service gets a little weakened. 
Order the shrimp and crawfish étouffée :)"}
{"text":"I went with some friends this past Saturday and was pleasantly surprised! The food was amazing! I lived in New Orleans and haven't found a gumbo that could compare. I had a few bites of my friends and it was out of this world! I ordered the sea bass special and when I asked for a side of sauteed spinach, our server was happy to ask if the kitchen could do it. They, of course, could! Our server was super fun and Quick!!! My friend said the hurricanes were pretty awesome! If you go check out the hurricane menu. I can't wait to go back!"}
{"text":"Excellently prepared Cajun food set in a laid back atmosphere.   I love this place because it's quieter and less crowded than most of the nearby restaurants, but doesn't skimp on the freshness and quality of the meal.   Don't fool around and go straight for the bourbon fried chicken."}
{"text":"Pretty good food with a Cajun flair.
I think of Boudreaux's as Cajun Lite, because let's face it, they're not authentic Bayou. 
Slow service. Always. Expect it. Plan on it. Don't let it harsh your buzz. 

The food here can range from good to really outstanding on any given day. 

I usually found the waiters to be as friendly as their limited time permitted.
 
I ate at Boudreaux's about once every two weeks. 
The wait staff remembered that I drank sweet tea!

Service is not bad, it's just not very fast. The problem is that many times during lunch, there is only one person waiting on everyone. My schedule was always flexible, so getting back on time from lunch was not a problem. For those on a tight schedule, having lunch here and getting back to the office on time, could easily be a tricky proposition. Fast food - this is NOT.

My favorite lunch entrees were the Cajun meat loaf, and their smothered pork chop. 
I liked the collards and mac 'n cheese for side dishes. 

I ate at shrimp po boy ONCE, and it was mostly lettuce. I did not order this again. 

I love the funky décor, the relaxed atmosphere, and their central NODA location. I was usually able to park right on the street next to the restaurant. 

Prices are reasonable for the quality of their food. 

When I wanted something really good for lunch, this was my destination. This is one of the places in Charlotte that I really miss."}
{"text":"First time here and I'll definitely be back. Came here for a late lunch on Saturday so we were the only ones in the restaurant. The server was friendly and attentive. We ordered the crawfish & spinach dip, fried chicken with jambalaya, and shrimp & grits. Everything came out hot and it was delicious! They could've added more crawfish meat to the spinach dip though. Nonetheless, the food was flavorful and portions were big. Both entrees came with corn bread which wasn't all that great. It was dry and tasteless so I could've done without it. We sat by the opened garage/patio area which added an awesome ambiance to the place."}
{"text":"I love spicy Cajun food.  I love NoDa, so I desperately want to love Boudreaux, but every time I go is a disappointment.  I hadn't been there is over a year and decided to go for brunch.  The big draw, besides location, is the well appointed Bloody Mary bar they set up for Sunday brunch.  Other than that, I won't be back.  The food is bland, nothing Cajun or Creole about it, except  the names of the dishes.  I started with the Gumbo Ya Ya.  Its consistency and taste was that of wallpaper paste.  For brunch I got the special of the day- strawberry cream cheese stuffed French Toast and cheese grits for my side. ( I would have prefered bacon or sausage as a side, but was told they didn't have either meat as side offerings-really ? breakfast without bacon or sausage??) When I got my entree, the grits were touching the french toast, and the strawberry \"compote\" over the french toast was also in the cheese grits.  Sloppy.  I scrapped the grits off the main plate in order to save my meal.  The french toast was dry, and has cream cheese inside, with canned strawberries. The Strawberry compote on top of the french toast was also straight from a can.  C'mon guys, its summer- this was supposed to be the \"special\", yet there was nothing special about.  Again, bland and disappointing.  The cheese grits I managed to salvage that didn't have canned sugared strawberry sauce in it were the standout of the meal, and that's high praise from someone who isn't a big grit fan."}
{"text":"UPDATE: Another testament to Alex and his charismatic personality. As my group was walking by Boudreaux's for lunch this afternoon, Alex came out the door to say hi to us and tell us it was good to see us. I will absolutely be back and looking for him!

 I've read a lot of the reviews and I feel terrible because I have to disagree. We were only perusing the outdoor menu when a waiter appeared in the window in front of us, opened the door, and informed us that they were having $2.50 mimosas and half off Bloody Mary's. That sold our group of 5. We were seated immediately by Alex and I have to tell you, he was so personable, he's the main reason (tied with taste of food) I'm writing this review. 

Alex immediately took our drink order and recommended appetizers. We ordered mimosas, gator bites, bacon fritters, she-crab soup and corn and crab hush puppies. The gator bites were smaller and there were only 4 hush puppies but none of the apps were lacking in flavor! They were SO delicious and we're shared among 5 people amicably. 

As far as entrées go, we ordered jambalaya, etouffe, red beans & rice, shrimp & grits, and muffaletto. They were all spot on and hit every spot we could have imagined. 

My favorite part of our hour and a half dinner was our waiter Alex. He should be requested every single time you come in! Thanks for such a great experience!"}
{"text":"Okay - confession #1) the waitress from Davidson Street Public House said if you're going there next, order the Red Beans and Rice with Andouille Sausage. Confession #2) we peeked in and there was no one in Boudreaux's at the time - it was bright, empty and I didn't want to feel like I was on display in a fishbowl, so we ordered and had the food delivered to Sanctuary. Holy Yapple Dapple Yabba Freakin' Doo! Tasted like they have been stewing/cooking those beans all day long - jam packed with flavor and spices. Nice consistency to the rice (not overcooked). Let's not forget the sausage - nice portion with just a little heat. Great choice of eats for a pub crawl or foodie crawl. If I remember correctly too, it was under ten bucks. Will definitely be back to try the Jambalaya that Kelly C raved about!"}
{"text":"I'm surprised to be giving a four-star review! We hadn't been here in years and decided to give it a go. Service was very slow early on. Hushpuppy app was kind of sad. But then our server was able to get more focused, and then our meal came. Fish and grits...delish. My brother had the Red Beans & Rice and loved it. My husband's burger was great. So, despite a half empty restaurant on a Friday night and a slow start, our bellies and taste buds are very happy!"}
{"text":"Delicious!! We went after church on a Sunday for brunch. Didn't have to wait to be seated but food did take a while to come out. But when it did come it was hot and fresh! Shrimp and grits are my favorite! I've be back! Good service!"}
{"text":"There's live music, mimosa bar complete with fruit and berries, your choice of cranberry, pineapple, orange juice, or hurricane mix. $3.50 double mimosa price tag. Can't beat this with a stick!"}
{"text":"Boudreaux's is a chain that has only one other location...in Blacksburg, Virginia, which is such a culinarily bereft location that for nearly six years, I went there quite a lot.  Among the faculty at Virginia Tech, Boudreaux's was known as \"The Best Restaurant in Town\".  And truly, a big bowl of their seafood gumbo at that location was a pretty satisfying thing, though nothing to write home about.  In Charlotte, though, they have a lot more competition.  I was in there recently and had corn chowder (thick and cheesy) and fried oysters (I know, right?) and rolled out feeling kind of bloated.  Anyway, my feelings about Boudreaux's are mixed, but they're pretty convenient if, say, you have to pick someone up at the train station and get them something halfway-decent to eat right away and it's after 9."}
{"text":"This was my second experience here and I thought a reservation and early arrival would help us out on the wait. However when we arrived at 730p we immediately ordered drinks while we became familiar with the menu. By 8p we ordered our appetizers due to chatting as girlfriends we hadn't seen each other in a while. Our appetizers came our fairly quick and we shared. My BBQ shrimp had a very funny and unfamiliar taste to it. The sauce even stated strange. By 8:30p we all were ready to order. It took exactly one hour and fifteen minutes for our food to come out. The manager brought it to us because we were beginning to have reservations and concern of the wait time. And they guest around us were getting their food sooner. 
I totally understood that this was a busy night for them and it was a Friday but 1 hour and 15minutes for your entree is a bit long. But everyone enjoyed their food, we took majority of it home with us as it had gotten really late to eat such heavy food my 9:45p"}
{"text":"Came here for lunch looking for creole food after an appointment.  The restaurant is cute and in a cute part of town (NODA).  The waitstaff was really nice!  I ordered the etoufee and it was okay.  My parents live in New Orleans so I know good creole food when I taste it.  This was a good attempt but just missed the mark.  I would be willing to try it again but I wasn't impressed on the first go round."}
{"text":"First time here and I absolutely love this place, the food is extremely tasty. I had the the gator bites and the etouffee which tasted amazing you can get it in either a small plate or large. The restaurant was very spacious and had patio space for those who wanted to eat outside and enjoy the spring air. They also have a stance indoors where they open the doors to allow fresh air in. The atmosphere had a old southern feel, as if I was l eating righting in New Orleans. My waitress was very attentive, my pineapple mojito was delicious, it was the perfect balance of mint and fruit. I would totally recommend this place to anyone. Definitely"}
{"text":"Worst service I've ever experienced at a restaurant. No one was at the door to greet us, then when someone did she didn't know where to seat us. Then it took 15 minutes to be greeted by our server and once we noticed he didn't have a uniform, we knew it was going to bad. We waited 45 minutes for our food just for the server to tell us he dropped it all. We wait another 25 minutes for our refire and it tasted rushed, just as we expected. I had the shrimp and grits and the grits were thick and clumpy and the whole dish was overseasoned. We waited 15 minutes to try to see a manager but none of the servers were in the dining room. Finally we go to the host stand to try to request the manager when the hostess tells us to have a nice day! We had barely touched our food and hadn't paid for anything but she wished us well on our way out! We looked around for our server but he and the hostess disappeared to the back. So we just left. After the horrendous service and difficult parking, I will not be back."}
{"text":"Thoroughly enjoyed my experience here. Our waiter Jacob was pleasant with a beautiful accent and disposition I might say. I had the crab cake croissant which was delicious. Although it was just one patty, it was flavorful and just enough for lunch. Lunch was accompanied by my Danny boy Hurricane. Gf had shrimp po boy and gave high praise. I was visiting from out of town for the first time and I appreciated this creole southern food that was both comforting and appetizing."}
{"text":"A friend was visiting from out of town and she wanted to visit the NoDa area. We went on the last day she was in town, which I did not realize majority of NoDa was pretty much a ghost town on a Monday afternoon. We found Boudreaux's by chance and decided to stop in. The food hit the spot for a southern girl. 

I had the bourbon fried chicken Meat&Three option  -the sauce was perfect and full of flavor. The Charleston cheddar grits hit the spot. And the collard greens were also bursting with flavor. The only complaint: the corn bread was a bit dry and not served with any butter. 

The service was great, attentive - should've been anyhow considering there were only 2 other tables. Our drinks never went dry. We left full and satisfied. Definitely worth the trip back to the NoDa area to try a few more dishes."}
{"text":"Been here several times and it has always been good food and good service. We often stop by before shows at the Neighborhood Theater. Tonight however is a different story. I have been sitting here for an hour and still don't have my food. Our show starts at 8 so we are leaving hungry as we never got our dinner."}
{"text":"Mimosa, gumbo and cornbread.

Mimosa--:-)

Gumbo--the meat was so lovely and tender, I ate it all first and then kind of looked and picked around my rice, wishing for more. 

Cornbread--the sweet kind. Actually could have used a bit of salt to enhance the flavor. I grew up having cast-iron skillet cornbread, dense and crusty and not a hint of sugar. Love sweet cornbread, but as a fan of kettle corn, my ideal now includes both tastes at once. 

The service was kind and leisurely. I was sad that the beignets are only on Saturday and Sunday...note that the mimosas are cheaper on Sunday."}
{"text":"This was my second time visiting this establishment, and was only 10% occupied. It's located in the NODA area and expected more occupants. I don't mind, but it would be nice to have a 65% full restaurant. They only have one TV, and partial outdoor seating. 

The waiter was friendly, we had the same waiter on both visits two weeks apart, and she remember us from before. 

The food is New Orleans style, and is served in large portions. 

This last visit i ordered the large crab cake salad with spinach, and it was delicious and healthy. 

My friend ordered the Mulatte and took home half the serving. We will return, maybe on a Friday or Saturday evening."}
{"text":"i'm mostly salty that beignets aren't served at night but also salty that some new orleans staples just don't fit the standards i have"}
{"text":"this place was delicious!! It's in a really cute part of town near all the breweries with a ton of free street parking. We went on a Sunday and got $2.50 mimosas. The food was delicious- I got the breakfast burrito and my boyfriend got stuffed pancakes. The only reason this isn't 5 stars is because I was looking forward to some different Cajun options but there didn't seem to be a whole lot on the menu."}
{"text":"On July 4th, I was walking around NoDa, checking out some arts. I was hungry, I could eat a horse, so I stopped here put some yummy in my tummy! 

Good:
- Signature Jambalaya is the die for. Tip: Get the T'boo (small) size; it is a filling portion $10.00
I mean who says you need to drive to Bourbon Street for authentic Cajun dishes.
Eh ok:
- Not too exciting ambiance. But Great food. 
Boo:
- I think they overlooked that simple amenity that would keep our purses/coats from ending up on the floor. Hooks under bar, hello!
- Guest WiFi??!  I was connected to their WiFi, but couldn't browse.

I enjoyed my Jambalaya, so I'm sure I'll be back in the future.

Three and Half Yelps"}
{"text":"I had this place catered where I work for lunch one day. I had the Chicken Carbonara and I thought it was really good. I haven't been inside their physical location so I can't really comment on the inside and the service."}
{"text":"The menu is so broad and delicious. As a pescatarian I found multiple menu items worth trying. The hush puppies are amazing and their catfish was cooked perfectly. I ate here once and decided it moved quickly up the list as one of my favorite CLT restaurants. It's a must-try if you enjoy Cajun food -- they do it right!"}
{"text":"Took a walk in NoDa and ended up having a crazy experience at Boudreaux's. If by crazy, I mean I ordered their special Taco Loco for breakfast. This place is a gem and their food is amazing!! Braised beef, poached eggs is a crazy twist for brunch that goes down easy with my double mimosa!"}
{"text":"Great food! Prices are very reasonable! Gumbo was good....Shrimp and Grits was amazing!"}
{"text":"Above average service, but just so-so food when compared to my favorite Louisiana style meals at other restaurants around the country (including one across town in Charlotte several years back).  I was looking for great Louisiana food with much more mojo and passion to it, so it was definitely a let down visit for me.  Then again, the experience was interesting with the minimalistic dive bar type ambiance, and the food was at least ok even though too simple... Just not too much wow factor or loving soul in the dishes I received from the kitchen... 

It seems there are better places to go to get more satisfying meals for the money, but if you're in this exact area and really in the mood for Louisiana style food, maybe you'll be OK if you can manage your expectations..."}
{"text":"i am mot a huge fan of Creole food but i really enjoy the flavor of the Shrimp poor boy sandwich. The only thing i was a little bummed about it the veins were in the shrimp which will cause me not to get that sandwich again. The  shrimp and grits look tasty so i will definitely try that the next time when i come.The little pastry that i got i think it was called bignet or something like that was amazing . i will go back again but for the main menu not brunch."}
{"text":"Gave this restaurant another try this week. Earlier this year was very disappointed in the slow service and lack of staff during a planned brunch with a large group. This restaurant redeemed themselves with very friendly staff and  service today. The tilapia was excellent as were the sides; green beans and sweet potato fries!  Their sauces and spices add such a southern and Cajun flare. The parking in NoDa is improving, so hopefully the restaurants will flourish even more!"}
{"text":"Wasn't impressed. Good was just meh. Seafood gumbo had a weird taste. The crab and corn hush puppies were a disappointment. My niece  found a fly in the bottle of ketchup after she had put some on her food. They were good about it. Replaced her food and gave her a voucher for free entree or appetizer. Was in Charlotte for a family reunion. Was hungry and excited to find this place. Was just in NOLA in July. This doesn't compare."}
{"text":"Before Cabo Fish Taco expanded into more space... the wait used to be ridiculous.  What would normally happen was that we'd go to NoDa craving Cabo, but then end up at Boudreaux's.  The thought was that we could grab a hurricane and then come back when our table at Cabo was ready.  Needless-to-say we never made it to Cabo whenever we went to Boudreaux's.  

The ettoufee is my favorite here... great and unique spot for Charlotte.  Haven't gotten to try a lot of the menu items yet, but I will definitely be up to the challenge of getting to know all the items personally.

Usually for NoDa... end up parking on the street... it's worked out most of the time.  Gallery crawl nights make it more challenging, but still doable."}
{"text":"I've never really been a cajun fan because I don't like crawfish and I'm not really a fan of beans and rice (see my latin and asian reviews).  Thankfully my idea that all cajun food contains these is misguided.  

On my last visit to Boudreaux's with the dinner group, I had the Cajun Carbonara and the she crab soup.  The soup had a nice spice level to it as was as the pasta dish. The disappointment I had was that it looked like the pasta was the pre-cooked rotini version importanted from your favorite food service company.  But it was still good.

The service was good, the drinks tasted good and were not weak like some places make them.  Unfortunately, it was a lot of food where 1/2 of my meal went home in a box with me.  But it tasted good the next day also.

My only surprise was the restaurant wasn't busy.  When I called for a reservation at 7pm, they told me they had another big group coming in at that time and asked if we could go 15 before or after.   But when a friend and I arrived early for drinks, that group had the only tables (2-3) occupied in the place.  Oh well it was still good, we were still served and we still got out before that group.  I just found the request odd considering they weren't busy."}
{"text":"Went here with one or my buddies on a weekday lunch. The food was quite enjoyable. 

We started with the alligator bites, then had i had the jambalaya and my friend had ribs and fries. If you're a fan of Cajun food you'll like it here. It was very tasty.

Service was good, but since it was late in the afternoon, we were among only a few other people. I'd like to see the dining room and get a feel for the place when it's more crowded and lively.

Overall I'd like to give it a try again, but it's definitely a good spot for Cajun."}
{"text":"This was a delightful experience. The Bourbon chicken was excellent, the ya ya to die for. The flavors were amazing. The location is avant guard, you will love this place"}
{"text":"You don't go here for dinner. You don't go for lunch. You sort of go for brunch.

You always go for the best Bloody Mary bar in Charlotte."}
{"text":"I am from Destrehan LA about 20 min from the French Quarter. I have been eating Gumbo all of my life. The Gumbo at Boudreaux's is the most Authentic Gumbo I have had in Charlotte. I have tried at least 5 other places on Yelp that serve Gumbo. I dislike CajunQueen because of the tomatoes. We never put a red base in our Gumbo, not that you shouldn't but, it doesn't taste like the Authentic Cajun Gumbo I was raised on. At Boudreaux's I always get some to, go to put in the freezer. LOL!"}
{"text":"Spent the weekend in Charlotte and this was recommended by the hotel staff. EXCELLENT CHOICE! The jambalaya, fish, chicken, fried pickles, gator and burgers were all good. To top it off our server Alex was Awesome!"}
{"text":"my husband and i went on our honeymoon to new orleans, so we are huge fans of cajun/creole cooking. our tastebuds were pleasantly tingled by their tasty morsels. i got a shrimp po' boy with their house potato salad, and the hubs got the jambalaya. both were excellently prepared and mouth-watering. i was super full halfway thru the meal, and i got to take a good portion of home--which was totally awesome. my kids thoroughly enjoyed the leftovers, which is saying a lot about the deliciousness of this place.

one note about this place: i guess the restaurant behind it is the same kitchen/same food. not sure if it's cheaper or nicer, but i am curious..."}
{"text":"I went to Boudreax's for dinner, and the food was pretty good.  We started off with the fried oysters.  The breading was seasoned nicely, and the fried oysters were nice and crispy.  Inside, they weren't as juicy as oysters near the beach, but they were decent for being in Charlotte.  Overall, they were solid, but I've definitely had better. 

For my entree, I ordered the mulatte, which is shrimp and crawfish étouffée over blacked fish.  Étouffée is tough to cook well and having been to New Orleans, I've had the real stuff.  The étouffée here was pretty tasty  and held its own well.  There is some creole spice to the dish that gave it that Louisiana taste.  The sauce was good and made for a tasty dish. 

However, there weren't that many crawfish compared to the shrimp, and the shrimp were an average size.  Both didn't taste as fresh as they could've been, but the fish was the highlight of the dish.  I chose tilapia and it was seasoned and blackened exceptionally.  All the Cajun spices were sealed in the blackened crust, giving it some great flavor.  All this was served over rice with a pice of cornbread, making it a very filling meal. 

Overall, the food was good at Boudreax's, but not great.  My rating would really be 3.5 stars.  Fresher seafood would really enhance some of their dishes a lot, but for being in Charlotte, their food is worth try if you're craving some New Orleans inspired food."}
{"text":"It is a very relaxing place in the heart of Noda. 

I ordered the Veggie Benny which was good! Defiantly should try it for brunch!"}
{"text":"Again, my Creole nose is tuned to the hunt to satisfy my craving for that perfect po'boy, that savory gumbo. Boudreaux was third on my list for my Cajun fancy, and I found myself there on Saturday night with a friend. There was about a 10 minute wait for a seat, which wasn't bad at all. 

An absolutely lovely first Bloody Mary experience. Though the presentation was nothing like what Yelp's gorgeous picture provides, it was still smooth, yet hot and spicy. Good stuff, I would get another.

There was a bit of an awkward moment. My Cajun unicorn is a fried oyster po'boy. Never managed to have one, and have always been denied at the last minute. This was no exception. 
Upon ordering, my waiter got a very sad, contemplative look on his face, informing me that due to the tragedy of the gulf oil spill, there were no more oysters. I stared at him incredulously, then slowly turned my eyes down to the Creative Loafing magazine I had open, to the page that advertised the largest oyster festival in the world that happened in Myrtle Beach that very day. Our eyes met and he had that panicked, feverish look that waitstaff sometimes get when they're fervently praying that you don't call them out on something.

So I didn't. I got a damn shrimp po'boy instead. [Miraculously, though the oysters were doomed, the shrimp managed to survive. Well... except for the ones on my sandwich.]

Incredulousness aside, the po'boy was pretty good. Huuuuuge roll, but it was soft, so there wasn't any bread stabbing painfully into my gums as I ate. Plenty of shrimp, so I guess my only lament would be that I wish the remoulade was tangier, or rather, tangy at all.
I got the potato salad as a side, which didn't disappoint. Sweeter than most potato salads, but great herb flavor and just the right amount of creamy.

My friend got the bourbon chicken, which she tells me would have been great if it wasn't so salty. It seemed to put her off her meal and she only managed to eat part of it.

All in all, I think I'd be back again to sample some gumbo when all is said and done. However, I need to tack off the rest of the restaurants on my Cajun bucket list'o Charlotte before I return here."}
{"text":"Great experience and food.  Truly delicious.  Staff was friendly & hard working.  Only good things to say and would definitely return."}
{"text":"I've got roots in Louisiana (but I don't hold 'LouisianaStyle\" restaurants outside of Louisiana to the same standard)... That said... These ppl should be shut down for claiming to be a NOLA style restaurant. On top of that, the service left a lot to be desired. Not my favorite experience of the year."}
{"text":"Came into today just to get some beignets at around 5:30. First of all the restaurant was completely empty so that was probably a sign. After waiting five minutes at the hostess podium someone finally came over to seat us. Once seated we waited at the table for 15 mins for someone to come over and maybe get us a water for starters. But then decided to just get up and leave after seeing the staff drinking at the bar and no one came over.Never going back to actually try this place out and the staff was completely and utterly RUDE."}
{"text":"This place is FANTASTIC!  I ate here for Sunday brunch - the bloody mary bar was the best I have ever seen and 1/2 off for top shelf vodka (grey goose, ketel one, etc).  The mimosas are $2.50 and also absolutely delicious.  I ordered the muffaletta which was very good but the jambalaya...oh my goodness.  Please order the jambalaya!  I can't wait to go back and (1) drink more alcohol, and (2) try the gumbo."}
{"text":"I went the week after Christmas which is usually slow at most restaurants until NYE. So the restaurant was pretty empty however we didn't let it stop us. We had the crawfish dip appetizer and considering my boyfriend doesn't eat seafood normally and has been talking about it since we left I'd have to say it was a hit. We had for our entree's the veggie burger and the shrimp po boy. Both of which were good. I didn't like the fries with the po' boy but I'm very particular when it comes to fries so I don't take anything away from them for that. We went on a Tuesday when Hurricane's are half, we started with the category 2 and worked our way up to 4. We've said next time we will try a category 5. Overall it was great and we are looking forward to going back."}
{"text":"A comfortable environment, the prices are a bit high but it's worth it. I'd rate this place a 4.7 I got the Gator Bites as an appetizer and Etoufee for my entrée. If you like shrimp and crawfish I highly recommend this dish."}
{"text":"The WORST waitress I have ever encountered. The food was delicious, only reason I'm giving it 3 stars. The entire staff seemed preoccupied and not worried about our party at all. We were the only table in the entire restaurant and it seemed as if the staff was all too busy to attend to us. Good food, nice prices, horrible staff."}
{"text":"Soooo, came in last weekend after a few months and man have things changed! Idk if it's under new management, has new chefs, or what but the entire experience was nothing like it has been in the past. Should've known something was wrong when it was basically dead on a Saturday. The service was pretty good but the food was just blah. So blah. I ordered the etouffe over Charleston cheese grits instead of rice. The grits were not smooth at all and the etouffe had the biggest chunks of onions and peppers in it ever..they were bigger than the crawfish! My sister ordered the crab cake sandwich, i don't even know how to describe it bc it was nothing like any crab cake I'd ever tasted. All in all this seems to be one of those places that was great once upon a time but we won't be back."}
{"text":"Down right nasty. One of my biggest regrets in life is wasting my time and money by eating here. 

Very shocked at how many good reviews they have regarding the food."}
{"text":"Being from California, I always look forward to an opportunity to get some Soul or Cajun food when I'm in this part of the country so Boudreaux's seemed like a good choice.  While walking up to the restaurant the neighborhood reminded me of the funky shops and unique flavors found on Telegraph Avenue in Berkeley, CA.  Far from scaring me away, this was an endearing throw-back to home.  Across the street it was Hookah night  and the sweet tobacco scents drifted in the air.  As I shoved tightly folded dollars into the parking pay box ($3.00 which suprised me in an area so far from uptown) I noticed a fun looking book store on the back side of the restaurant. 

When my dining partner and I walked in we were seated quickly although the waiter seemed a little brusque (in fairness he did appear to be the only wait-staff that evening).  I finally settled on Ettouffee, Rice and of course corn bread.  I was suprised to find that the potent spices and flavors that usually accompany this dish seemed to be lacking.  The meal was fine, but a little bland for my preference and the cornbread was actually a little dry.

If you prefer milder Cajun cuisine, this might be the spot for you.  If you're looking for something more authentic... keep looking and let me know where you find it!"}
{"text":"Had lunch, ordered tilapia and 2 sides with cornbread.  Service was good food was good.  The place looked clean, I would recommend to my friends.  The food was well seasoned, for my palate."}
{"text":"Half price bloody mary and mimosa bars on Sundays. Sold! 

I primarily come here for brunch (see line above), but I never order brunch-type food. She Crab Soup, Jambalya, Etouffee, Gumbo- give me all the Cajun goodness. My latest trip here though I did get a little brunch-y and got the low country shrimp and grits. Delicious. Our table of seven each got something different and all really enjoyed everything. The chicken and waffle sandwich is crazy! I love the giant pancake with the fried egg all in it. Must order for the table: the beignets. 

Back to the important things, this bloody mary bar- they have several different vodka infusions (habanero, rosemary garlic, cucumber basil). The spread on the bar itself is also impressive- homemade bloody mary mix, various squeeze bottles of juices (pickle, okra, olive), veggies. They do it right here. 

It's NoDa, so parking sucks. Be patient and look for a spot on a nearby street. Make sure to pay attention to all the parking signs and don't block anyone's driveway."}
{"text":"Pretty so so. Went from Yelp reviews. Food was just okay, not super hot. Service just okay. Ambience good."}
{"text":"Not a fan at all.  I was very surprised at the high ratings on this place since my experience was so disgusting. The pictures posted on yelp were NOT AT ALL like what we were served! I went here for dinner last night & should have known something was up due to the lack of people, especially when the other places in the area were slammed. I got the crawfish spinach dip & shrimp po boy. The chips were good for the spinach dip but the dip itself was lacking, and cold. My entree was basically lettuce on chewy bread, shrimp was minimal. My friend got the gumbo yaya and could only take a few bites before giving up. It looked like it had been dumped from a can and she said it tasted as if it had gone bad. Service was also lacking. Would never recommend this place!"}
{"text":"Many friends suggested this place to us. Unfortunately I was not impressed. The gator bites were extremely small and tough. The BBQ shrimp were severely lacking in flavor. The fried chicken with the jambalaya was overcooked. Service was a bit slow as we waited 5 minutes to be greeted. The \"garage door\" was open and we had to smell exhaust fumes our entire meal. Overall the meal was decent... but unfortunately we won't be back."}
{"text":"I hate to give this place 1 star because most of the food is really good.  Today I stopped in for lunch and ordered fish and grits.  The waitress brought me shrimp and grits.  I told her and she said it would be 5 more minutes to correct it ( had already been there 30 minutes).  Another 20 minutes pass and she brings out food in to-go box and says she doesn't know why the cook put it in the box.  Now what am I supposed to do?  Eat it in the car?  I told her to forget it and left.  50 minutes for lunch and no food!  

On a side note, their cornbread needs work.  It's dry and bland."}
{"text":"I ordered the shrimp and grits and didn't realize they had spicy sausage with it. I was still going to pay for the meal but they insisted that I don't and gave me a free entree for my next visit.  They were very friendly and by far the best customer service I have ever received."}
{"text":"I absolutely love this place. It's one of my regulars. Some of the best food, not just Cajun food, in Charlotte. Period."}
{"text":"Bayou cooking has everything my little heart desires.  Seafood (especially that of the shelled variety), spice, and plenty of rice!  I never met a gumbo I didn't adore.  Truly.

Boudreax's is a nice break from the downtown Charlotte restaurant scene.  If you've never been to NoDa--you must check it out.  I haven't spent nearly enough time in this neck of the woods. I have eaten at Boudreax's twice for brunch.  Both times, I didn't leave disappointed.  However, I wasn't \"wowed\" the way I hoped I would be.

About 5 years ago, I went to Baton Rouge and had my first beignet.  My life hasn't been the same since.  The beignets at Boudreax's are nothing close to the crispy, sweet, drippy, fried dough ball dusted in powdered sugar I had in LA.  Instead, these were dry and bland. Described as \"hot pockets with nothing in them\" --the words didn't come out of my mouth.

Anyway, skip the beignets.  I do recommend the eggs benedict.  The cheddar cheese grits (extra $1) are AMAZING.  Yes.  Get those.  And the home fries are perfectly dark and just crispy enough.

The atmosphere is very laid back and warm.  There was live music when I was there which was a nice touch.  I prefer Cajun Queen to Boudreax's, but then again I have only dined in for brunch."}
{"text":"This place is phenomenal! Food, service and ambiance are all on point, can't wait to go back for more."}
{"text":"Excellent shrimp and grits. Zesty Cajun flavor with a lot of shrimp. Soft buttery cornbread on the side. The large size is an ample portion for dinner."}
{"text":"Shrimp and grits were the spiciest and good. Stay away from the spinach crawfish dip...has non point if view and very heavy. Gumbo was great. Cornbread was a perfect sweetness but was just a tad on the stale side. Waiter Caleb was perfect...ask for him."}
{"text":"What can I say...there needs to be more than 5 stars. These guys definitely out did themselves! They catered my dear friend's wedding reception which was for about 250 guests. I have to add that the bride is from Louisiana and all of her family came to SC for the wedding, so they were anxious to see how Boudreaux's compared to what they were used to. 

I was the contact for the reception, and was asked to coordinate the arrival and distribution of dinner. Once Kevin and Pete arrived, they wouldn't leave until everything was set in place and we were confident with what was in place. After my team and I served the approximately 250 guests, several of them came back for seconds and a few even came back for thirds. 

Everyone raved about how good dinner was. Even the Louisiana family absolutely loved it. The bride and groom were ecstatic!!! That's definitely a bonus!
The menu included: House salad w/ a variety of dressings and homemade croutons, Grilled Andouille Sausage, Blackened Chicken, Gumbo ya-ya, Jambalaya, Shrimp & Crawfish Étouffée & Fresh Grilled Veggies. 

We would definitely recommend this establishment to anyone and everyone. Whether it's for lunch or dinner at the restaurant or for catering an event. These guys know what they're doing and have the customer service and expertise to show it. Thanks again for helping make this the best day of the bride and grooms lives!"}
{"text":"This was the worst.  Service was horrible.  Came in on a Wednesday night at 8:00 very few people in the restaurant.  Waitress acted like we bothering her by asking about items on the menu- which should be expected by new customers.  Hubby asked if there was anything on the menu with a white creamy Alfredo type sauce waitress said no.  He ordered something else and I ordered shrimp and grits.  I went to the bathroom and on the wall the special of the day was shrimp Alfredo?!?!  Hubby changed order to special.  

My hubby enjoyed the shrimp Alfredo though it was by no means the best he's ever had.  The shrimp and grits were GROSS.  How do you have grits that are not cheesy and half cooked to the point of crunchiness?!?!?  I have been to Louisiana and had Louisiana real quisine-and this was not it."}
{"text":"If you're gonna go, go for Sunday Brunch...if nothing else for the AMAZING Bloody Mary bar.

The food here is great. Muffuletta, po boys, shrimp and grits...

But, the service is just plain weird. Slow and socially awkward. If you can get past that, I'm sure you'll enjoy your meal."}
{"text":"Im eating their blackened wahoo BBQ right now and I never want it too end... for $14 this is sooo ridiculously good."}
{"text":"Had the pork chops here the other week. Really good stuff. Definitely more spices than other Cajun & Louisiana style restaurants in the area. Wife's shrimp and grits were great as well."}
{"text":"This place is great! We love going here for lunch! Their Cajun food is pretty authentic and so so delicious! They also have some great drink specials!"}
{"text":"Came here on a Sunday night with my mom and sister for my Mom's birthday dinner. She loves seafood and Cajun dishes so I thought this place would be perfect since our usual belated shenanigans kept us from seafood connection. 

Got here around 8pm and it was completely empty. Our waiter was extremely chill but very friendly nonetheless. Took a minute to peruse the menus and everyone decided. I got the veggie burger with fries, my mom got the shrimp and grits and my sister, the chicken and waffle sandwich with fries. We ordered drinks afterwards and I got a brew from NoDa and my mom got the pineapple mango mojito. She enjoyed hers. The brew was a bit too hoppy for my taste but I managed to gulp down half. Not convinced it was a lager but hey, whatever. 

After about 30 minutes, our food arrived. My mom loved her entree sans her cornbread which she said was hard and dry. My whole plate was cold (veggie burger and fries) My sister had cold fries but devoured the chicken and waffles sandwich. The waiter brought new fries and on my Mom's suggestion I ended up trading in the veggie burger for a couple of sides: fries, grits and salad. The salad was magnificent and I wished I had just gotten a huge salad instead. The grits were well done too (which is saying a lot being that I'm a total grits snob). I also ordered the crawfish and spinach dip after the rest which was good but really needed some salt or seasoning. With copious amounts of salt it became delicious. 

All in all I would give them another shot earlier in the day but am a firm believer that if you're open, you should be able to deliver a five star experience (hence the 3 stars)."}
{"text":"It's not the real thing but it's as close as you can get around here. I went for brunch and I want to go back and try dinner if I am around this area again. Their bloody mary hit the spot. Their beignets had a really good flavor though the dough was a little thick and the edges were crusty which was strange. They should have also been bigger but overall they were good. They claim to have crawfish etouffee which I want to try. I am skeptical of places that say they can cook that outside of LA unless its my house but I am willing to try it."}
{"text":"So, I have this weird thing I do: every time I go to a Cajun place I order shrimp and grits with the expectation that it will be somewhere between disappointing and catastrophically bad. Ordered same at Boudreaux's expecting same result.
Guess what: Best. Shrimp and grits. EVER.
As awesome as the staff is (and they are awesome), the food is more awesome by a magnitude of about 100.
I'll start looking for excuses to come back to Charlotte, and this will be the first stop."}
{"text":"Brunch is da bomb. Dinner is great. Lunch is intriguing. Have been here with at least 4 different groups of friends, and no one was disappointed. None of us could finish the more than ample portions, and the drinks/beer menu were good. This is a perennial favorite for eating anytime."}
{"text":"Our friends from Raleigh, NC were in town so we took them to NoDa in hopes of eating at other place for dinner. After finding out the wait time was 1 hour and a half, we decided to try another place and walked into Boudreaux's with low expectations. Boy were we pleasantly surprised!! We were sat immediately with no wait time. The place is very cool and the service was awesome. Our waitress knew that it was our first time and suggested the crawfish spinach dip and we were VERY glad that she did! Excellent! I had the salmon special and it was SO.GOOD! Food came out hot and fast. Hubby had some chicken fried something meal and it was oh sooooo good as well! We were defiantly glad that we stumbled upon this place and will def be back!"}
{"text":"First time trying. The beignets were actually dinner rolls with sugar, the gumbo was slimey and the veggies in it were uncooked, red beans were full of fat and worst of all, we were handed a USED to-go container. Nice waitress but not coming back."}
{"text":"Both the Gator bites, and the gumbo are amazing; I have never been disappointed by the food."}
{"text":"I have been here for brunch a time or two.  The food is always good, I have never had a bad experience.  They have a bloody mary bar where you can put together your own bloody mary, which is one of my favorite drinks.  There are many toppings, sauces, and spices to choose from.  

The restaurant is small, but friendly. There is an option to sit outside.  The service is good and prompt."}
{"text":"This review is low due to the poor service we received. We went around 2pm there were not many people eating the place was not busy at all. Service was extremely slow. We ran out of tea waited 10 min before we were checked on for refills the we ran out again and a guy that said he was the manager was having a conversation with the table next to us for a long time. Meanwhile I was chomping on ice to get some liquid in my mouth. He as the manager should have been looking at the customers while he stood there talking and should have noticed we were being neglected. Then some other guy brought out the desert we ordered at the same time we ordered our meal. He just placed them on the table and walked away before I could ask for more tea. Finally our waitress that had cigarette stained teeth came back to ask if we wanted one check or two. I told here I needed a to go box for the desert and wanted more tea. I could not imagine choking down the desert without nothing to drink. She put the desert in a box and gave us the check and still no tea. BTW she reeked of smoke so I assume she was outside smoking instead of waiting on us."}
{"text":"Had brunch today. I ordered the shrimp and grits and was not disappointed. It was sooo good. The cornbread on the side could've easily not been there, but the dish itself was really good. I also tried the bloody mary bar. I'd never had one and the idea of selecting all of the ingredients was great. They were also half price today. My server was attentive and friendly and even helped me construct my drink with suggestions at the bar. There was also a sax player to boot lol. I'll be going back for more shrimp and grits."}
{"text":"Delicious! The She crab soup was so good and the Jambalaya was on point!  Pineapple mojito? Yes please!!  Waitress was super nice and service was fast. 

The restroom was a little dirty, and the corners looked like they needed a good sweeping. They do have a big garage door that they open in good weather so I'm sure that's the reason for the dust bunnies. Otherwise I would give 4 stars!"}
{"text":"I've been to Bourdreaux before, long time ago. This most recent visit was great. I had shrimp and grits and my friend had the pork chops. It's the best feeling when food exceeds your expectations. The shrimp and grits did just that and I would argue that they're the best in Charlotte. It was apparent that the roux was fresh. The celery maintained crunch. My side of seafood gumbo was divine, but could use larger pieces of seafood.

Service:
My gumbo was served at the same time as the shrimp & grits, which wasn't ideal. Our waiter was kind and referred to us as \"friends\". As in substitute ma'am for friends. It was cute. The wait wasn't too long. When we were finished, we moved to the bar, having been in the restaurant for 2 hours. The bar tender was nice and VERY patient explaining different drinks. I ultimately had wine.

Needless to say this was a great outing and I will definitely return soon."}
{"text":"The food here is very flavorful. I had a party of 18 people here for my birthday and everyone loved their meals. I had the bourbon fried chicken and it was yummy! I also tried the pork chops on another occasion and the gumbo! It is in a cool area and the service is nice. The prices are pretty good as well."}
{"text":"A MUST to try in Charlotte's NODA district. LOVE LOVE LOVE this place...for breakfast, lunch, or dinner!  If you love New Orleans food then this is for you. The ambiance is great and the service is wonderful. The shrimp and grits my favorite!   I do not eat grits from anywhere except here, their cheese grits are the ultimate comfort food."}
{"text":"There is a lot of road work going on on 36th was hard to find for out off town ppl. The inside was very nice gold and purple colors with a live music the waiter Chip was pleasant. Do my fiancé got the gator bites very good tastes like chicken and I got the Cajun omelette not bad."}
{"text":"Great location for this Cajun eatery and bar. Cozy and spacious, if that makes sense....Get reservations if you have a large party, they will accommodate, but bring a flask because drink service is sloooooooowwww.

Food came out fast and hot which was nice for a large party like ours. The shrimp & grits was seasoned very well and pretty darn tasty. Not very spicy and slightly monotone in flavor, but not bad. They do well with their fish, as the blackened catfish was excellent. Lots of items to choose from; but kinda disappointed there were no buckets of crawdads to order. 

They make up for that with tons of specialty drinks, most were yummy and fruity for the ladies.

I would definitely try it again."}
{"text":"I LOOOOOOOVVVVVEEEEEEEEE jambalaya. 
Yea, I will drive up there just to buy 2 order to go and eat them during the week. (go figure)"}
{"text":"Shrimp served without de-veining... Disgusting! We asked if they clean them up before serving but were told that they never clean them up. We used to be regulars here and they did the best seafood gumbo in town but we would rather not eat shrimp poop."}
{"text":"Okay, so I STILL haven't been to New Orleans yet so I can't really say how authentic a place is, but this is the second Cajun restaurant I've been to and it was so much better than the first one.

The service was excellent.  My waiter was very attentive and answered all my questions about the food and the drinks.  This is the first place I've been to that had an entire menu devoted to their Hurricanes.  Holy crap.  I can't remember which one I ultimately ordered, but it was excellent!  And strong!  I ended up getting the blackened catfish, which was great, but the best thing was the hashbrown casserole.  Hands down the best hashbrown casserole I've ever had in my life.  I was temped to ask if I could order a whole 'nother side of it on it's own....."}
{"text":"My wife and I love to stop in and grab a bowl of their delicious she crab soup with cornbread.  It is sooooo yummy!  I have tried almost every item on their menu and would recommend it all.  The staff is always friendly.  Great drink options also.  Got to stop in and check them out."}
{"text":"Delicious food that tastes like it was made by knowledgeable cajan chefs. They have some of the best cheese grits that I have tasted in a restaurant. The grits have an earthy taste that seem stone ground.  They have a unique texture. Our waitress was very friendly and attentive. The beignets are doughy and delicious. Best I've had as well."}
{"text":"Really great place. Came here before a show at the Neighbor Theatre. Outstanding food. Shrimp and Grits, killer. Pork chops were awesome. Come see."}
{"text":"I ate here about 2 weeks ago and the food was simply divine. It really does taste like something straight from New Orleans. I had the seafood gumbo (that comes with cornbread) and the alligator bites. The alligator bites are amazing, however, it might be the only overpriced thing on the menu ($10 appetizer). The seafood gumbo was dee-licious! For dessert, I had the bread pudding! AMAZING! I had a mimosa to drink with my meal. I was visiting from NJ and was extremely pleased with the food. The service was equally wonderful. I had a waitress named Stephanie who is an enabler haha! But I'm glad she convinced me to get the bread pudding. This place has good food, great service, and is priced right. Def check it out. You won't be disappointed!"}
{"text":"I've never been to a Louisiana style restaurant so this was a no brainier for me. 

The menu based on their website had a very diverse selection of food that is also Louisiana style. I ordered the Shrimp & Grits which was different than I'm use to buy surprisingly it was tasty but soupy . I also ordered the Seafood Gumbo since I don't eat pork and all of their gumbo had sausage in it.  

I also ordered a Hurricane Category 3 which was very interesting. It's the typical hurricane but their spin on it is to add additional shots and increase the category so I was told a category 5 would put anyone on their butt. I ended up with the 3 which was made perfectly and tasty. I'll go back again to try a 4 and later a 5 .

Our Waiter Quan was very attentive, nice and welcoming so he received a great tip. He was very helpful in asking the bartender about the hurricane categories and also the kitchen on a few concerns about sausage not being included nor cross contamination with the shrimp.

I ended up spilling my drink (promise it wasn't bc of the category 3 lol) but Quan was very nice about cleaning up the spill and still provided amazing service. Thanks Quan for a great experience, I'll definitely be back to try a few things."}
{"text":"yes yes yum yum and I think my waiters name was Dave. Dave is A Ok

where do I start... ya ya gumbo .. fried chicken.... Zombie drink !!!

heaven"}
{"text":"A great addition to NoDa and really something different from everything else in Charlotte.  Filling, delicious food at a great price.  They have some great drinks here in the morning and the afternoon with a decent patio for those sunny afternoons and cool summer nights plus they have a garage door open up the restaurant to the outside."}
{"text":"My family loves this restaurant! It is located in Charlotte's arts district, NoDa. Boudreaux's is a delicious restaurant serving an array of Cajun food. Their fries are delicious, and they also make a mean vegetarian jambalaya (but its a special, and sadly not always on the menu). I don't eat meat, but I've heard that if you want seafood in Charlotte this is one of the best places to go!

The staff is friendly and attentive. Order the strawberry beer!"}
{"text":"Enjoyed Easter Brunch today at Boudreaux's.  The Bloody Mary bar was quite a deal at $4.00 per glass.  I ordred the Habanerno Vodka, complete with the warning from the waitress, who said, \"be careful, it is hot!\"  Well, after I loaded it with jalopeno pepper slices, horseradish and Texas Pete, it still exhibited only a warm friendliness.  I guess that was a disclaimer.  But, it was good, and a big glass with fixins' at $4.00 is a bargain.  I also asked for the 3 egg vegetarian omelet and Charleston Cheddar grits.  The grits were creamy and delicious!  The omelet could have used more cheese, but the spinach, mushrooms and red bell pepper were very flavorful.  The accompanying fruit was refreshing as well.  The restaurant featured a nice jazz duo, consisting of trumpet and guitar.  It was just loud enough to contribute to a nice atmosphere while still retaining the ability to have conversation.  In my opinion, Boudreaux's always provides both good, reliable food and ambiance, no matter the occasion."}
{"text":"Gator bites not worth $10.95 and a little plate came out. No taste identifiable. However i can vouch for the mango mojito"}
{"text":"Pretty good food and a great environment. I ordered the collard greens, pasta salad, cornbread, and tilapia sticks. It was a lot of food for a good price. My meal was about $9. The tilapia was so fresh! The only thing I didn't like was the collard greens... Too sweet. 

This place looks like a hole in the wall but the food makes up for it. Bathrooms are also in an awkward spot so prepared to look stupid. Parking sucks due to all the construction- I came here during lunch with coworkers and can only imagine what the parking is like at night."}
{"text":"2.5 stars for Bourdreaux's. I was really excited to try cajun/creole food while visiting Charlotte, but was not that impressed by the dishes we ordered here. Our waiter was really nice and checked up on us often

The two of us decided on the jambalaya and shrimp po' boy to share:

Jambalaya- Came with a good amount of meat and seafood! but TOO SALTY. The side of cornbread was also forgettable. Dry and just whatevs. 

Shrimp po boy- I liked this sandwich overall, but it just seemed like a regular fried shrimp sub. The bread was actually very fresh, and the shrimp pieces weren't small or skimpy.
The FRIES though were really CRISPY and seasoned well! My favorite part of the meal for sure. I would come back just for the fries.

This was actually a lot of food for the both of us! and we left pretty stuffed
Not sure I'd make my way back here though :/"}
{"text":"Tried this place for lunch, arrived there at 2 pm and we ordered right away. My friends got their entres from the breakfast menu, I ordered the PO boy sandwich. The ordered took 50 min to reach the table, the sandwich was very bland and tasteless barely any sauce on there! I ordered the Mac and cheese as a side, which has ham in it. The menu fails to mention anywhere on it that it has any sort of meats in it. Being a pescatarian, it's surely not something I would like. The waitress was nice to address bringing out another side but at that point I was just done. It's a nice place to hang out, however the service needs to be worked on and the food look more appetizing and better flavored."}
{"text":"I have been coming here for awhile, and truth be told, the quality is getting worse.
1st tip: DO NOT EVEN BOTHER with the fried oysters. You will hate yourself for ordering that. The oysters are so tiny, and it's not worth the money. Actually put the gator bites on the do-not-order list as well. They're smaller than the popcorn chicken you get at KFC. 
I normally come here and order the gumbo or she crab soup and make that a meal. A bowl runs you about $8-9, which is a lot more tolerable. Sometimes the gumbo comes out luke warm (at best), but it tastes good enough.
If anything, consider this place for a drink, they do have drink specials on the hurricanes and wine and beer. 
I really hate that one of the few cajun places in Charlotte is going downhill."}
{"text":"Nice atmosphere. We went on a Monday night and were the only ones in the restaurant. I don't know if the fact that their liquor license is pending is the reason it was so empty. 

But overall I was very satisfied, I got the seafood gumbo and my date got the shrimp and grits.  The food was pretty good, although it wasn't as spicy as i like my Louisiana cuisine it was still good. 

There aren't too many authentic Louisiana food places in Charlotte so this was a great find.  It also doesn't hurt that its located in my favorite part of town (NoDa). 

Go check it out."}
{"text":"Date night with Mrs. K., we headed to NoDa of course!

On a Saturday night, there was a solid wait for a table - 45 minutes. We spent it wandering the nearby neighborhood and were only accosted by one \"upper class\" beggar who wanted \"a dollar toward a vegetarian burrito, man\". Love NoDa!

We started with the \"Gator Bites\" - a small plate of battered and fried alligator tail. Despite living in South Florida for a decade, I've somehow managed to miss out on this delicacy. Tender and rather buttery, you should give it a try.

For our mains, I chose the day's special - a half-rack of St. Louis Ribs which came with an ear of corn and cole slaw and fries. I cleaned the plate. I love ribs and these were particularly fall-off-the-bone. My date chose the blackened steak, which she said was cooked perfectly and the side greens were excellent.

I would have thought that after a meal like this we would have been stuffed solid, but our lovely waitress managed to convince us to share a bread pudding and cappuccino.

Great meal, great service, great date. We will absolutely be back!"}
{"text":"When I am in the area this is one of the top places on the list!  Best shrimp and grits and jambalaya I have ever had to date.  
Service is always prompt and casual. Interested to see how it changes as Noda does, they have recently updated the place and it looks great. I am looking forward to the new menu. 
Large portions also at affordable prices!  You won't be disappointed."}
{"text":"Great place for some creole food in Noda, enjoyed the gator bites and po boy, nice outdoor seating as well and great dessert. Service is slow however and not top notch."}
{"text":"Great food, music, service, and art work! I'm definitely making this a regular hangout spot. Oh! Did I mention they have tv's for sports? Awesome!!!"}
{"text":"Craving New Orleans? Come here! Great food and probably the best French fries you will ever have!"}
{"text":"Oh Boudreax's, how i love you..

Whenever I visit my sister in Charlotte, we go here..her family actually has taken me, my mom and brother all there..on  separate occasions..were all fans!

This time i had brought my little dog with me on my first road trip and he got to go some pretty great places..the server brought a water bowl out for him when he brought our drinks :)

We had the gator bites appetizer that is really good and my nephew LOVES them..for my entree i always choose the Low Country Shrimp and Grits..creamy cheese grits with plump shrimp and sausage with veggies and all in a great sauce served with a square of some of the best cornbread in this world! 

you will leave stuffed, happy and with some left overs too!"}
{"text":"Love what we ordered here. The chicken is crispy outside and tender inside. The etouffee is fantastic as well!!! Will return to try other dishes on menu!

2nd time we came here on a Saturday for brunch. We ordered beignet (each order comes with 3), and Crawfish Spinach Dips as appetizers. Both appetizers are pretty good! Entrees wise: Chicken Waffle (not the type I like though, the chicken lost its crispyness once mixed with cheese, etc), Cajun Chicken Omelet (it's not bad but not great), Burbank Chicken (again, our favorite one so far besides etouffee."}
{"text":"I served tables for several years of my life and always tip 20% or higher. Last night I had to leave 10% because I just couldn't bring myself to reward our experience. We had a party of 12 people and we were there for 3 hours due to how long things took to get ordered, come out, etc. While I understand parties take longer, it's a Friday night, etc....the lack of attention and inaccuracies by the server were unacceptable.  People were getting new alcoholic drinks when they didn't even order them, but when they were ordered it would take 20 minutes to arrive....want a beer?  How about the wrong one?  To the wrong person...food came out and the temperature ranged from piping hot to downright cold. How you do this with the same entree is downright impressive, btw!  The bills came out...wrong. It was just ridiculous. Only thing that saves this from a 1 star is the crawfish and spinach appetizer was awesome and some of the entrees were decent (and not cold).  It'll be a struggle to return here."}
{"text":"Food was good, but disappointing. The roux wasn't cooked down, it seemed fluffy and floury instead of a gravy."}
{"text":"If you are ever in the mood for Louisiana style creole food ..... than this is the place to go! They have a variety of things to choose from and best of all a great brunch menu. Definitely a thumbs up!"}
{"text":"I went with a group of five to have Sunday dinner prior to catching James Lastra performing at the Evening Muse which is just across the street.

They have nice selection of cajun/creole on the menu. I had the shrimp and crawfish etoufee. It was good, but I didn't care for abundance of uncooked celery.

Everyone liked what they had and we all shared some of the She Crab soup for an appetizer, it was really good.

The service was fair, even though it was slow for a Sun evening."}
{"text":"I'm not huge fan of spicy foods so my review may be tainted; however, I can say the food I have tried here is some of the best Cajun food I found in Charlotte. Whenever I have out-of-town guests coming who have also lived in Louisiana, this is always one of our spots to stop in. Their menu features dishes that are definitely in line with traditional Cajun cuisine, which is nice because you know you're getting the true Cajun experience.

And with the addition of gator bites, there's always something on the menu that I'm sure you'll be trying for the first time."}
