{"text":"Great little brew house in Boulder NV. Great food. Interesting combos for burgers and salads. Micro beer sampler was great. Six moderate sized samples of diverse beers. Definitely a fun place to visit before or after visiting Hoover dam."}
{"text":"We were looking forward to a cold beer and found ourselves at Boulder Dam Brewery.    Had the Pale Ale.    Found it strangely flat and served cool, not cold.  :(  wings came to the table overcooked and rock hard ...but chips were good !"}
{"text":"The beer isn't drinkable.  It has the taste of polymer.  The food is bad - I've heard that they've made some improvements, but I've not wanted to return in 4 years.  The last time I was there they were making nachos with that cheese sauce that you would see at 7-11"}
{"text":"All of us had fish n chips, they could have been a touch better, less greasy maybe. Relaxed atmosphere. Supper beers!"}
{"text":"It was great to get out of Vegas, the food was good and so was the beer. The staff was very good. All in all, if you like beer and food and a laid back atmosphere, you will be happy you stopped."}
{"text":"Love this local brewery. Todd is always ready to impart some knowledge about their great beers."}
{"text":"Nice little brewery in Boulder City! Nice selection of beers, drinks and food.  We started off with fried pickles, pretzels and chips/beer quest. Pickles and pretzels are great apps and a must do! Stay away from the feeling fruity drink! Amber is and hefeweizen are flavorful! 

Service: Recommend you ask to sit in Brandy's section as she is fiesty and interactive! She is quick witted and won't hold back! She made great recommendations for food and drink!

Bartender: Bruce is an ASS! One in our party tried to interact with him and wouldn't give the time of of day. She felt like she was wasting his time. His customer service is a disgrace to an otherwise great business! His actions made us leave and take out business somewhere else."}
{"text":"Please invest in a bright tank. Seriously.  High Scaler was half trub. Seasonal Beyond the Pale had an off flavor, slightly metallic in nature. Apricot was under-represented.  Hefe was adequate at best.  Unfortunately I had the same impression 2 years ago..nothing has improved. Didn't finish any of the pints. 

The food is pretty good.  Had the Brewpub Burger - very tasty."}
{"text":"Stopped by for lunch after visiting Hoover Dam.  The food is good, the beer is cold, and the people are friendly. What more could you want?"}
{"text":"Small portions wings look like they came from sparrows not chickens. Nacho's were a joke. Wish I could post a picture of what they looked like"}
{"text":"Had terrible service here today and made for a disappointing meal. It wasn't a particularly busy day, and we were seated at 2pm. Our waiter was very inattentive. We had to grab our own silverware when our appetizers came out. He didn't check in with us after our appetizers or after our meals came out, only came over once we flagged him down. Ordered a porter and was served a blackberry cider and was assured the bartender said it was the porter. Asked for a water and didn't get it till the check was brought out. Disappointing because our first visit was decent. Maybe an off day, or maybe the male waiter is not cut for the job. 2nd star awarded because the food is actually pretty good."}
{"text":"Thought we would give this place another chance.  Will not again waited almost hour to get drinks.  They screwed the drinks up.  Then they messed up the food orders. Spoke to manager he apologized but made excuses.   Will be last visit here.   Would not recommend to anyone"}
{"text":"My husband cannot get over how good and how authentic the beers were,  especially the pilsner and the hefeweizen!  We also both loved our food,  he got a burger and I got the Reuben!  If we are locals we would be in a lot, and probably would have bought a growler if we didn't have to fly back to the east coast!"}
{"text":"While my husband was finishing up zip-lining through Boulder Canyon, I hit up the town of Boulder City.  After checking out a few antique stores and the museum, I decided to relax with a drink.  So I rested my weary legs at Boulder Dam Brewing Company.

It's a bit small inside and was pretty busy when I arrived, so I opted for the patio.  Of course I was there on a 105 degree day and even though the tables had umbrellas, I was still drenched in sunlight.  I did my best to hide from the rays while waiting for my Shandy and Bavarian Beer Pretzel.

The Shandy (mixture of Pilsner and lemonade) was surprisingly very good and perfect for the hot day.  The pretzel, however, was not so good.  Imagine a frozen pretzel that had been sitting in the freezer for too long served up alongside some queso out of a can.  That's pretty much it.  The worst part?  It costs $5.

After finishing up my pretzel, I headed inside no longer able to bear the heat.  I sat at the bar but wished I hadn't; I was surrounded by older guys with my only entertainment being to either creep out the bartender and stare at her or watch the football game on the small TV at the opposite end of the bar.  I think sitting at a table away from the bar would have been a better option.

After my Shandy I ordered the Hefeweizen, which was a little darker than others I've had but still very good.  When my husband finally arrived he ordered the Amber Ale and really liked it.  Drafts are $4.50.

Essentially, this is a good place to have a drink on the patio if the weather is nice.  You have to be careful if you plan on sitting inside since it is small and can fill up quickly.  This is not a good place to catch a football game- they had a small TV playing a game at one end of the bar while a giant TV near the bar was playing Dr. Phil or something as equally as annoying.    If my pretzel was any indicator, I would think twice about ordering food here."}
{"text":"The beer and music was great, the waitress was very rude and chatty, she talked more than serve."}
{"text":"Felt like I was in a Bar Rescue episode.  No one greeted us, an arm wave and find a table was the only thing offered. Later we had to walk up and ask for a menu.  Between 6 of us we shared 2 menus. NO ONE came to the table including the manager who I assumed was the guy straddling the door to the kitchen with the head phones on. Can't say the service was bad  because the service was non existent.  Went to a place down the street with great service and great people. If you're in town pass on this site and go to Dillengers."}
{"text":"Always such poor service. Decent brew and food though. They dont make fried zucchini anymore but had fried pickles that were delish although a small portion"}
{"text":"Walked in and stood and walked back out. Very small town bar not brewery. Smells like a bunch of drunks. No one came to seat us. They looked at us like we didn't belong as they let us just stand for two mins."}
{"text":"Skip the trappings of Vegas and head here. We ate on the patio and looked at the equipment used to build the Hoover dam. The prices are good, and they know how to brew good craft beer. They live up to their name, and I'd come back again in a heartbeat."}
{"text":"Went for lunch today with mom, ordered club sandwich, was alright bread was soggy, fries were not that great, spin dip good but, little cold.
Beer was awesome, server was great.
Wish food was better."}
{"text":"Good  beers always something new on tap. Kambucha was delicious too sweet to taste..."}
{"text":"Was very disappointed with the food & service. The 2 employees that were there were very nice."}
{"text":"Caveats: 
(i) My brew pub standards are pretty high. If this was located in the PNW, I wouldn't bother to review it and would leave with a \"Eh. Decent everything.\"
(ii) I hate Las Vegas. We were there for a climbing trip but got rained out so decided to check out the Hoover Dam, which is how we ended up in Boulder City. 

This brewpub is NOT Las Vegas. This was the most \"normal\" place with the most \"normal\" people I've been to in the Vegas-surrounding area. Yeah, the place smells like beer. It's a brewpub; they brew and sell beer that people consume on premises. The food was good or slightly better than good (I had a burger and fries with a veggie burger subbed) and the IPA was better than good. There was live music on this Saturday evening, and it was also better than good. The service was  better than good. Whatever salt/coconut oil mixture they had in the bathrooms was magic. It's a pretty chill environment and the people were friendly normies. 

If this was Portland, I'd give it 3, maybe 3.5 stars. But it's almost-Las Vegas, and it gets 5 for being the best thing around. Oh, and there are no slot machines. No gambling in Boulder City. 

If you're in the Hoover Dam area, absolutely check it out. Even if you're in Vegas, if you have some time, there are worse things you could do than check out this brewpub in Boulder City. (Like go to the Chicago Brewing Company, which is a complete disaster and is pretty much the opposite of Boulder Dam Brewing Co.)"}
{"text":"Excellent quality of food, great beer options, great service and friendly staff; I would highly recommend them!!! Too bad I discovered them on my last day of stay at Vegas..."}
{"text":"Great house made Shandy! My friends liked their beers & the food was good. Great fried pickles and Orange Chicken Salad. Bruce gave us great service. Great little joint!"}
{"text":"Great beer and food, you can't beat the High Scaler Pale. Smooth and refined. Owner generally on site, service is friendly and on time."}
{"text":"Came to the brewery for a beer and an appetizer. The band was playing outside great atmosphere! The problem.stayed with our server who was in a hurry to get our order and got it wrong. We ordered boneless wings and and got boned. It took a while to get our order straightened out and when we it it back it was over cooked and missing the chips and cheese that came with it. Bummer! I really like this place,  but the food needs some help!"}
{"text":"Garbage service and nachos with unmelted cheese.

Sat with an empty beer glass until i had to waive the server over to get a new one. What kind of beer-loving place is this."}
{"text":"Visited today with my husband and brother after the dam tour.  Brewpub burger was very good and cooked well done as I asked. Side salad was uninspired and only 4 dressing options. Caesar chicken wrap was very good. Hot dam! burger was also very good. Spicy but not too spicy,  but very messy.  Beers: high scaler pale was  5 out of  5, balanced and hoppy without being overpowering. Dam buster '14 was also very good,  5 out of 5, balanced,  hops evident but not overpowering.  Oaked Black Canyon Stout best stout ever had."}
{"text":"I think it is odd when a Brewpub attempts to put out a seemingly interesting selection of beer but does not give any attention to food service.  We had Bridge Breaker ale, which wasn't amazing but we enjoyed it anyway as we came off a long hike.  Our food was not worth the money.  Chili cheese fries were decent fries slathered in canned (Hormel?) chili and cheese.  I had to add a lot of hot sauce to add any flavor, all I tasted was canned beans and fries.  No chopped onion, no peppers, no desire to eat it after 2 bites.  My boyfriend's food also seemed like it was a pre-packaged meal that was warmed in a microwave.  

I don't know if the brewery is aware of this fact but good food makes people want to drink more beer.  There were a few more beers I wanted to try but not on an empty stomach.

If you're in town, it is a nice place to stop for a beer on the patio or listen to live music.  But seriously, as other reviews advise, eat somewhere else."}
{"text":"Good food, beer and patio.

Tried: 
-Six Shooter: sampling of 6 beers they make and offer, decent beer, not the best
- Fried Pickles: they are the spears, not the slices
- BBQ Bacon Cheeseburger, really good

The biggest surprise was the fries that came with the burger, they are sliced wide and thin, not too crunchy and not too soft, really good, get as a side or app if you can

Tips: 
- Ask for the fried pickle dipping sauce to go with your fries, really good that way
- Take a brief walk through the town, lot of great little shops nearby
- Eat outside if the weather is good, not great ambiance inside but patio is shaded and comfortable"}
{"text":"We are locals and have seen many changes at the pub. The most recent menu change was must improved so we took a visitor for supper last night. While the beer is always good, the food has always had its ups and downs. We all got fries. And we all agreed they tasted like fish. Which indicates they were cooked in the fish fryer, however no fish on the menu. Go for the beer not for the food."}
{"text":"We went to this place twice during a one week visit to Lake Mead/Boulder City.  The fish and chips special was great the first night and their burgers were excellent on our second visit.  For the ultimate refershing (adult) beverage on a hot day, try their Shandy!  My husband even loved it!"}
{"text":"Stopped on our way back from hover dam for lunch. Service was good. I only had 1 beer their IPA it was very tasty. Got the onion rings and a patty melt both were very good. The burger was fresh and juicy. Allin all a good lunch"}
{"text":"Many expert micro beer lovers who live in BC do NOT like the beer here. It's a real shame. The place has such potential, atmosphere, patio, location, even live music. We have discussed having an intervention with the owner who thinks he's making good beer, but just isn't. It all has a funny un-finished metallic taste. The food is too expensive for what you get and is likely  ready made and popped into the microwave, as there isn't much of a kitchen back there. Maybe we should tally up the $$ we spend at  Milo's on good beer and send that to the Brew Pub with a note that says, if you carried some good beer, we would have spent this at your place!"}
{"text":"Great beer!  Can't say much for the food....but that's not why you come here is it?  Seasonal right now is an Orange cream ale.  Not usually my kind of beer, but I was amazed.  Bring somebody that doesn't like beer and have them try it.  Again..my review is on the beer.  Some of the other reviews dogged the food.  Looked alright to me but didn't have any so can't review honestly"}
{"text":"A place to enjoy microbrews for less than $5 per glass deserves all of 4 stars.  It was a busy weekend in Boulder City so I expected a wait for a table but right when we arrived 2 spots at the bar opened up and we took a seat.  We both tried the seasonal  Marzan.  It was dark, served cold and had a nice flavor without leaving a heavy after taste.  Next we tried the Hefeweizen and I believe a blonde.  The Hefeweizen has a unique flavor that was unexpected.  It tasted like Hefe at the beginning but the after taste was more floral rather than citrus.  The blonde was good, I'd order it again.  

This place is a fun weekend spot for us to keep in mind to round up a few friend and make the drive out to BC for some reasonably priced beer.  

Since we planned to stop in here on the City's busiest weekend I had expected a delay in service time but the place was well staffed and they were attentive to the guests.  The Bru Guru (I assume) was checking on one of the tanks and tasting the product which added to the atmosphere of a brewery.  It was a nice mix of guests - all ages, families, people laughing so I wanted to stay."}
{"text":"Fantastic!! Great beer, fantastic food (in house burgers that taste like homemade) and fantastic service. Hope to visit again someday!"}
{"text":"The the stout tasted a bit watery, the Pilsner was light and crisp though. My wife had a refreshing shandy. The service was friendly and the place was busy for a weekday afternoon. I had already eaten but I saw some tasty looking burgers being distributed. Overall this place is not impressive as a \"brewery,\" but a solid place to stop in a town without a lot of options."}
{"text":"Ugh! Horrible bar food... I ordered chili cheese fries that came runny and no real chili and a pretzel that came with the most awful jalapeño cheddar. I'm assuming they are banking that their food works because they are serving good beer, which to be honest beer was pretty decent. Drink the beer, don't eat the food"}
{"text":"Good people. Very friendly. Food was fantastic. We had the French Dip and the Mediterranean Salad. Both of which were excellent. We will be returning."}
{"text":"Love this place, very small and cozy!
When ever I go to Vegas(2-3 times a year) I make sure to drive out and sample some of the delicious brews on hand. Staff is always friendly and welcoming. The atmosphere is quiet and relaxed and is great place to stop before and after visiting the Hoover Dam! Especially on Hot summer days. Make sure to walk around the town also, lots of great little mom and pop stores!"}
{"text":"Wow, what an amazing place! Greatest beer and burgers around! We love the staff and the service.  We drive out to Boulder City from Vegas at least once per month to enjoy the BCDC food, drinks and the entertainment!  They have great bands and we especially love the band Crossroad South that performs there.  It's well worth the drive and you're guaranteed a fun-filled evening!"}
{"text":"Taylor B is an awesome server. She was attentive and knowledgeable.  Great place for a flight and yummy pretzel.   The pretzel cheese is amazing"}
{"text":"Julie was awesome and very prompt we had a blast we enjoyed samples of the beer which I found out I'm an IP drinker"}
{"text":"Couldn't be more disappointed.  Service absolutely terrible.  No refills on our drinks.  Had to ask another server where our food was after waiting for 40 minutes.  There were several employees standing around including the owner while we were waiting for our food and drink refills.  This is my first bad review ever.  My husband and I were servers for over seven years.  We know things happen but this was one of the worst dining experiences ever."}
{"text":"After waiting 55 minutes for our food we received cold, mediocre burgers that tasted like cardboard along with soggy, flimsy fries. Definitely not worth the money and service was terrible as well. I waited about 30 minutes just to get a refill on my drink. 0/10 definitely wouldn't recommend."}
{"text":"We stopped in for an early dinner. Kim was our server. She walked up and said \"what can I get you?\" Not how you greet a table. We ordered our food, and then she took an order from a 6 top. The 6 top got their food first. They ordered burgers and entrees. We had 3 salads, a soup, and a chili. Our food came out about 5 minutes after the 6 top. The chili was so cold, the cheese wouldn't even melt. Our food obviously sat in the window for a while!!! There was very little dressing on the Caesar salads, and there were green peppers on them??? My blue cheese salad had about 1/4 oz of blue cheese. Very little, to say the least. There was a 3 top next to us, that came in about 10 minutes after us. Kim asked them how they were doing 4 times. She never asked us once! We had to flag her down to get the chili heated up. As I'm writing a note on the bill which I had to ask for, she notices and decides its time to ask if we want refills on drinks. And asks how our food was. Too late!! I have worked in the service industry for 11 years, and have never left a $0 tip. This was the first, and hopefully the last. If the manager reads this, please know that Kim is not helping your establishment in the least!"}
{"text":"The chicken wings are in the top five I've ever had.
Whenever my hubby & I eat here we always get them!
They also have a footlong coney that's very tasty, as well as the salads."}
{"text":"Best wings I've ever had and the French fries were amazing.  Beer was fun as we did the sampler.  Staff was friendly. Only 15 minutes away from my house in Henderson. I'll definitely be back:)"}
{"text":"Standard pub fare menu, but with little original items on the menu. I was uninspired by the menu, and ended up with a hot dog, which was standard. My husband had a bratwurst and said that it wasn't anything special. 

The beer selection was pretty good, I only had a blueberry bock, and the fruit was distinct and the bock profile was tasty. 

Service was pretty good. I just wish that the menu was more varied, not too much looked good."}
{"text":"For a change of scenery, we took a drive to Boulder City. We hunted for treasures in a couple antique stores before grabbing lunch at Boulder Dam Brewing Co. We've never been before, so it was fun to have a look around and watch the footage from when the dam was built. There is a good selection of brews; we enjoyed Hells Hole and Bypass. We looked over the menu and the patty melt ($8.95) with swiss and mushrooms sounded tasty. We also tried the queso and salsa ($6.95). 

The queso was pretty darn good, it never congealed like many do and it had a nice kick. The burgers were a little overdone, underseasoned and the bread was toasted; grilled with a bit of butter would have been preferred. Prices are reasonable and service is friendly. There's a large patio ideal for beautiful sunny days. It's a great stop when visiting the dam or even a day exploring Boulder City is well spent."}
{"text":"Small, cozy, hole in the wall brew house, my kind of place. Friendly staff, good place to sit, relax, and drink some good crafted beer. Lots of outdoor shaded seating if you want to enjoy the weather or have a seat inside... I had the bbq bacon burger, medium rare and that is what I got, a medium cooked juicy burger. If you are in this area, stop by and enjoy good eats and some crafted beer!"}
{"text":"The beer flights are disgusting. They pour it right out of the non-refrigerated cylinder and it is warm and tastes like yeast. What a disappointment. The only thing that saved our visit was a not bad hamburger."}
{"text":"If you're looking for an exercise in patience this is your place. Food took way too long to come out. All we ordered were a couple sandwiches and salads. I couldn't tell you how any of it was because after an hour of waiting & no checking in from our waitress we decided to leave. Skip it."}
{"text":"The beer is tasty. The seasonal for summer 2014 is a plum pilsner which is cool and refreshing. The stout is on point. We have eaten here before and the food is pretty tasty. Each beer is $4.50 which is a steal in comparison to prices on the Vegas Strip."}
{"text":"Nice place, good staff but a little disappointing for a beer drinker. 
Mainly novelty/exotic flavored beers (blueberry bock, over chocolaty stout, etc)"}
{"text":"Great place to spend a leisurely Saturday afternoon drinking some local beer.  We sat inside, but the outdoor seating would have been great if the weather was a bit warmer.  

It took a while for us to get our food.  The staff were otherwise friendly."}
{"text":"1st time trying this place on a recommendation from friend's that ate there the day before. It was my son & I, along with another family of 4. We waited over an hour for 2 burgers, 2 orders of wings & nachos. It wasn't very busy. Tables that arrived after us received their food before us. Nothing was offered as an acknowledgement of poor service. Our food was not prepared well at all & taste was average at best. Very disappointed & will not return."}
{"text":"Service was excellent, food was really good, and beer was good.......but not great. Perfectly situated in town and has fantastic outdoor seating. Don't buy the baby/kids onsies though, they do not fit well."}
{"text":"sooo sad, service and beer quality have really become sub par.  For the second time, I walked out because i waited and waited for a server and left after 20 minutes of no help.   not going back :(.  if you plan on going, stick with the rotating guest taps.... shame on bc brewery for resting on your laurels."}
{"text":"Girls Night Out!  We enjoyed our Spinach & Artichoke Dip and Boneless Wings.  It was just enough food to go with our Beer sampler.  I'm not much of a beer drinker but enjoyed the fun of trying them as well as the excellent and fun band that was playing that night.  There were a lot of friendly people and it wasn't too crowded.  I certainly will be returning in future.  Thanks!"}
{"text":"Had the best time here today. The food was out of this world!!! They were fast kind and got my food to me at the perfect temperature. I will continue to come here and tell all my friends! Who ever is running this joint has it down pat!!! Thank you for the great food and service!!! Amazing!!!!"}
{"text":"Something needs to change here. We waited for about 5 minutes to be seated. The beers came out quick. However, we ordered nachos and sliders and it took the kitchen more than an hour to put out basic sliders and basic nachos. The food took more than a hour to come out and when it did, it was cold. The waitress never stopped moving. It was not her in the least bit. She was obviously frustrated at the kitchens slow pace. Unacceptable service by the kitchen staff.  Won't be returning."}
{"text":"A great brewery-restaurant located in Historic Downtown Boulder City and only 30 minutes or so away from most Las Vegas suburbs.  In addition to a substantial list of house brews, the food is quite good.  The burgers are creative, flavorful, and generous in size.  The fries are slightly battered and really highlight the meal.  In fact, they are some of the best fries I've had.  The wings are also very good.  Being a brewery, the beers are a highlight.  They change periodically and include IPAs, wheat beers, ales, dark beers, light beers, hoppy beers, etc.  Try the sampler, which is six 5 oz samples of the first six beers on the menu.  The wait staff is very friendly and knowledgeable of the various brews.  The outdoor patio has as much seating as the restaurant and they have a steady list of bands performing.  This is the ideal place to have very good beer and food while listening to some live music.  Good for bar hopping with friends or a casual meal with the family.  Prices are very, very reasonable.  We will be back."}
{"text":"It was our second time here, staff was either laidback or just plain lazy. Our friends even commented on the sub par service. We thought the first time was forgivable but it seems to be their standard practice. Food is ok but you should go to jacks down the street for better food and much better service, then, if you must have a beer, and everywhere else is closed, including the convenience store, then still don't go here."}
{"text":"Sometimes a star represents how ingredients come together at the hand of a brilliant chef. Sometimes a star is given because the venue has amenities that we value. Stars are awarded for the decor, the exquisite professional service. In the case of This place... I'm offering stars based on providing an exceptional oasis!  Amid the hectic constant stress of the biggest weekend of customer flow staff managed to keep customers comfortable, hydrated and supplied with delicious food while maintaining good humor and friendly kindness!  This experience made a Huge impression! Enduring rude impatient customers who come to an event and unleash frustrations may be the norm, but the staff here soared elegantly!"}
{"text":"We go out to Boulder City about once a month to bar and band hop. There are a few places that do live music on the weekends, but we wind up spending the majority of our time at the Boulder Dam Brewery. 

Lots of good beers to choose from.
They will actually cook your burger the way you order it. Thank You!
Fun local bands on the weekends.

They also have a pet friendly patio."}
{"text":"Omg I keep trying this place but for sure I'm done now. . Service was so rude,  my pretzel was cold. And the girls sat at the bar and chatted with some from. . Owner if you read this you really need to make sure you check on your staff. .  Food still hasn't improved and your beer after we got it home in our growler it just didn't taste the same. ."}
{"text":"The Anti-Vegas, fantastic! This is where I bring people who want to relax and enjoy some great food and beer without a bunch of noise and enjoy some good live music. I really enjoy going there on a warm summer night and sitting in the outdoor courtyard.  Consistently good and friendly and parking is pretty easy, right out front. Everybody that I've taken there has loved it."}
{"text":"Can to check out there brew system. Meet Mike get to talk to knows his beers. Very relaxed time. Would definitely come back next we are in town. Great food and beer."}
{"text":"3 is fair when the brewery has better wings than beer. The beers are a little week on the hops and flavor. Most of the beers are citrusy and rather mild. I think that there needs to be some revamping of the recipes. The stout was out which could mean it was their best beer. I've never been a fan of beers mixed with lemonade or apricots. Average at best"}
{"text":"We've eaten here twice now, so we must've liked it to go back whilst we're here on vacation. Their classic burger was truly excellent. The Reuben sandwich was pretty good and the Pub roast beef sandwich was okay. They have a very nice selection of beers brewed on premises. I liked the blood orange IPA and the High Scaler Pilsner, but wasn't too keen on the mango flavored beer my son ordered. The 2nd visit I was driving, so I had a shandy. It was pretty good too. The manager, Bruce was very friendly and informative. We got $5 off our 1st visit using Yelp, and on the 2nd visit my wife bought a shirt and that got us another $5 discount. The atmosphere and decor was not fancy, but was comfortable and in keeping with the Dam building theme. I highly recommend this place, and will likely eat here again next time we visit."}
{"text":"How was this place? Couldn't tell you. A friend and I decided to stop here for lunch on a recent visit to Boulder City. Upon entering, we saw some tables full of people and a bar area. There was no hostess, no sign stating whether or not to seat yourself or wait to be seated. Nobody \"working\" bothered to greet us.

We decided to seat ourselves in the outside patio area. There were many tables but only one was occupied. A waitress finally came outside with waters for the other table and took their order. Then ... she walked back inside without acknowledging our presence. We waited another 10 minutes and decided to go to Milo's which is just up the street. Milo's is excellent and I had been there before. Skip Boulder Dam Brewing and try any place else on the street, there are quite a few options."}
{"text":"Great beer an food to match. Kind of a drive but well worth it. Nice town to walk around afterwards. You will not be disappointed."}
{"text":"I actually dont like beer at all but i tried a few of their options and now I do. The Irish rattler is a must! The food is great and the service friendly."}
{"text":"Cute town. Great history.

We were passing through on the way to the dam and needed lunch.  The place we had been to last time we were in town had changed somewhat and we didn't want to eat there, so tried this place instead as the hubby loves to try local beers.

The food was average.  We had salads. Mine was a taco salad.  The beef was ground and had been warm... once... The saving grace was that it seemed to have been lean meat so as it cooled there wasn't that awful greasy feeling on the roof of my mouth.  Hubby can't remember which beer he had but liked it.

Server kept disappearing and we ended up walking to the server station to pay."}
{"text":"This place is maybe 3.5 stars, but I downgraded it just a hair because of the food. Still a good option, and by the look of it, probably one of the best places in this small little town. I wanted to like it so much because of the decor, area, and awesome courtyard outside, but it just didn't live up to my initial thoughts. 

The beer was better than generic beers that you buy at the grocery store, but probably just one small step up from homebrew (which, don't get me wrong, can still be good). We got a taster set and shared a sandwich, which like I alluded to earlier was just OK. They had two different IPAs, which might have slighted my judgement because IPAs are my least favorite. They were good efforts, as was the Stout, but the honey ale and pilsner tasted like Budweiser. 

If you're passing through it might be worth a spot if you need some beer, but that's all you should really get."}
{"text":"I am a limo driver in LV and when I bring people to the dam I usually recommend this place because the food is good. I'm getting tired however of my people complaining that it takes over an hour to get sandwiches. This isn't the first time this has happened either. Hire some more people because your about to start losing business, starting with mine and I drive a limo that holds 30. I brought 11 today. Your welcome. I'm sure your slow service will affect my tip though."}
{"text":"The location of this restaurant is great. We actually found this place while antiquing and followed our noses because we smelt a delicious smell and it was coming from the restaurant. Or so we thought. 

Let me say the staff is friendly and personable, but very slow. Inside was clean and we were seated immediately (on a Saturday around 2pm). Outside was well kept and the people out there were enjoying themselves with their dogs as it is a pet friendly establishment. The bathroom was a bit dirty, especially around the sink area with a mysterious bowl of sludge in the counter. 

As for the food negatives - we ordered two cokes both of which were flat. We ordered the chips and beer queso as an appetizer. My advice: don't. The queso was gross and the chips were stale. I got the philly cheese steak and my mom got the French dip. Both gross. Do NOT order the sweet potato fries. They were slimey?? I don't know on what planet those would be acceptable on. 

We didn't have a beer, which maybe if we were intoxicated everything would have been better."}
{"text":"If it were possible to give Minus Stars, I would!
We pushed to arrive  before 9:00 (which is what their website shows as their hours of operation. 
Needless to say, it was rather off-putting to arrive @ 8:17 and be told that their kitchen had closed!
What is point of having a website when you do not adhere to what is posted??
This is our  second 'attempt' to add this place  to o the expanding  list of brewpubs we encounter on our travels throughout the country. We were through the Las Vegas area a month ago and thought we would give it a try. It was a week night and the patio had a group outside enjoying themselves. We went into the dining room and stood there for at least ten minutes and not one employee acknowledged our presence. There were 2 or 3 people who appeared to be working there but were far too busy discussing their plans for the rest of the evening rose at us, so we left!
Foolishly, we thought we would give it another try tonight.
Maybe they do have good beer and food but we will never know!
At least the  waiter said that 'Dillinger's'  next door was still open and was serving food. We ended up going there and had a really good meal. While not a brewpub per se they had a great selection of beer on tap and awesome menu!
So save yourself the time and effort and avoid this place like the  plague!
On a brighter note. . . After making a complaint online after leaving last night, by the next morning Todd the manager sent me an apology along with the offer of a $20 gift certificate for next visit!!
Must say, this was a cool move!"}
{"text":"The staff was very friendly and helpful, but the beer was just not all
that exceptional.  I tasted all the brews that were available, and would say the ale was the best of the lot.  Personally I'm not into pub food, but did try the beer battered mushrooms and would say they were 
mediocre.   This place just was not for me........being from San Diego
I think I'm a tad bit spoiled by the great micro brews we have available here in town.........and honestly I enjoyed the bottled beer I had down the street at Milo's more."}
{"text":"Craft breweries are popping up everywhere but the community of brew masters and beer engineers are what make these beers authentic and creative. Local brewery that seems passionate about there product.  

Ordered the chips & salsa along with the chips & queso which were both tasty and flavorful. Tried the High Scaler IPA and Hells Hole Hefeweizen both refreshing and thirst quenching beverages. Both fairly good beers and would like to go back and try the Powder Monkey Pilsner and Belgian Wit next time we get a chance to go back."}
{"text":"Ive literally never left a poor review, or really had a bad experience at all, at a brewery. That should never happen! We came to grab food and a few beers in the afternoon. Patio looked nice, but sat inside...inside was so quiet you could hear a pin drop. Awkward atmosphere. We ordered an appetizer (decent) and salad & wings. Salads came out bland as can be, and actually the toppings (half of which were missing) made them taste BAD. We actually had to return a salad. Never had to stoop to that point before. We were never even offered beer. Couldn't get our waters refilled but once the whole time. Food took a bit long to come out. Temps were off. I can't recommend this place. Sorry guys. Unfortunately didn't even get the opportunity to try the beer so this review is based on the Food & Service only. They both need major improvement"}
{"text":"Terrible service. Waited 20 minutes for seating when they had 4 empty tables. Had to go to an employee to ask if we could seat ourselves. Tried to order wings, but they were out.  Out of chicken nuggets too.  Been waiting an hour for our food now and have not even gotten our appetizers. Starving while waiting!!!"}
{"text":"Wings in their special sauce were very good.... but the beer was warm and so that kinda bummed me out"}
{"text":"I love heading up down to BC and exploring and so the GF and I stopped in for a couple of beers and some chow.

The micro beers are tasty.  I enjoyed the BC version of a Black & Tan embodied in the \"Monkey Bean.\"

I ordered up a burger minus the bun and found it to be tasty.

The vibe was chill, my only real grip was being seated next to the server station.  The ladies seemed to be more about chatting then serving.

Next time I will probably sit at the bar."}
{"text":"Excellent pub. With indoor or outdoor seating. Umbrellas are outside, kid/casual/dog friendly. Beers were delicious, had the burger, home made salsa and the wings were awesome! Plenty more to choose from Philly cheesesteak to salad. Loved this hidden gem."}
{"text":"I always make it a point to visit local breweries when I'm on vacation. I'd been to Boulder Dam previously, about 4 years ago. Was hoping the beers had improved, but unfortunately they were still pretty mediocre. The food was so-so, not bad but nothing special."}
{"text":"This is a likable place that I went to have lunch after visiting Hoover Dam.You could say it was my anniversary dinner but for the fact that both my wife and I forgot about that.I guess we won't win the sentimentality contest.The place was jammed on a Sunday afternoon around  one.We sat at the bar.They make a terrific Hefeweizen  and  their coffee stout was first rate.The Pale Ale is good .The Red IPA wasn't bad but had too much of a malt profile.I had a bratwurst sandwich ;wife - a turkey club.We enjoyed both . Make sure to look at the town , Boulder City  , which was built for the dam workers in the '30s.I'd add the place has a funky beer centered atmosphere that I liked."}
{"text":"(The review to be sung to the tune of \"Bohemian Rhapsody\") 

Is this the real life?
Is this just fantasy?
Great atmosphere inside,
An escape from reality. 
Open your eyes
Try a new beer and see.
I'm just a simple girl,
I need no specialties. 
Because I'm easy come, easy go
Not gluten free, no allergies. 
Any way the wings come, 
Doesn't really matter to me, to me. 

Mamaaa just ate some lunch. 
Had bleu-ery burger
Cooked so well, got another order. 
Mamaaa, the meal had just begun
And now I'm 3 rounds deep with horderves. 
Mamaaaaaa oooooh oooooh
The service was so fast, 
The staff is friendly and informative
On their beers, on their beers. That's all the really matters. 

So full, my meal is done 
Sent shivers down my spine,
Experience was so sublime. 
Goodbye, everybody
I've got to go
But before I leave I need some good desert. 
Mamaaaaaaaaaaaaaa, oooooooh (Anyway the wings come)
I don't want to leave,
I need a root beer float before I scream

[Guitar Solo]


Anyway, I'd recommend this place to a friend."}
{"text":"Only their hefeweizen  is drinkable.  Food is terrible.  Won't ever be back."}
{"text":"If you are looking for a place to get a quick lunch in a quiet private atmosphere, this is not the place for you. But, if you want a leisurely lunch surrounded by other friendly customers then I highly recommend this place, especially if you go on a day that's not cold or super hot so you can comfortably sit out on the patio. The patio is lined with honeysuckle and smells fantastic. The service was a but slow but very attentive, but the food is outstanding, hand made and well worth the wait.  Most of the outdoor customers had dogs, so that made it even better!   For a family of four (grandma, mom and two 6 year olds) lunch with an appetizer came to $45, which is very reasonable, especially considering the food is very obviously fresh made to order.  The adults in our group got burgers, they weren't just delicious, the 'blu-ery'burger was life changing, and the bacon cheeseburger is exactly what you have been searching for your whole life (even if you didn't know it)!  I highly recommend this place, and even though we live in the west side of Las Vegas we will be making the drive to come here again. 2 thumbs up!"}
{"text":"A must stop on your way to or from Hoover Dam. Excellent beer and delicious food.  Loved our bartender.
I had a Shandy and the patty melt.  My husband had the grilled chicken special and powder monkey pilsner. Everything was perfect.
Ingress players note this is a great place to sit too!"}
{"text":"Enjoyed our Sunday drive to Boulder City. A few brews and some good food! We had the French dip, onion rings, coney dog, French fries and mushrooms. I'd recommend them all. Delicious! Our waitress Hannah was delightful. Fast service and pleasant conversation. Sit outside, they have lots of tables and umbrellas. We will definitely be back!"}
{"text":"Love this place!! Great Atmosphere, and terrific food. I was in there in December of 2015. Food was perfect and the staff is great!! Their burgers are better than Gordon Ramseys burgr on the strip. I wish I had time to stop in during my last visit to the area last month, but time did not allow. The owner is a great guy! I enjoyed chatting with him, he is very personable! 

One of my friends visited this past sunday and she had great things to say as well. 

Next time I am in Nevada, I am definitely going back! Thanks Boulder Dam Brewing co for being the best Dam brew pub around!"}
{"text":"Delish!  Sliders were great, beer queso was delish. Taylor B is awesome! We enjoyed our lunch."}
{"text":"Best dam brew this side of the Dam!! Great place to hangout with friends and find a new favorite brew, add dinner and your set for a good time at Boulder Dam Brewing Co."}
{"text":"We were in Boulder City for the Dam Short Film Festival. We walked across the street to the Brewing Company for a quick lunch between sessions. I ended up with very mixed feelings about this restaurant.

Ambience: the restaurant has a very large, well laid out patio area. It was a perfect place to eat on a beautiful February afternoon. I only walked inside for a minute. The inside eating area seem much smaller and very dark.

Food: I ordered the fish tacos and the salad that I could share with my wife. The kitchen split the orders for us without our even asking. This was was very appreciated by us. The fish tacos consisted of a small log of deep fried cod with some tasty garnish on top in a fairly typical taco shell. It came with a fairly generous portion of chips and salsa on the side. If you are not watching your calories, this is a very enjoyable lunch. The salad was also a very generous portion with lots of chicken, walnut, and crumbled cheese mixed in. Despite the really tasty sounding ingredients, the salad was really meh. 

Service: to sum up the service in one word I would have to say atrocious. I had gone into the restaurant to let them know we were seating ourselves on the patio. I was assured that a server would be by shortly. It was probably 15 minutes before anyone came and gave us menus. We told the server we had a bit of a time crunch in order to make the next session of the Film Festival. It was probably another 10 minutes before the server came by to take our order. We had already given up on making it back to the movie theater in time to see the next session of the Film Festival.
Overall, the patio setting and the tasty food might have rated a four star review. However the poor service dragged it down to a 3 star review."}
{"text":"Love coming here after a day at the lake (or anytime I'm out that way). 

As previously mentioned, excellent atmosphere. I usually stop in during the summer so its quite comfortable inside/out. The in-house beers are tasty as I recall and the food is great as well. The wait-staff was very prompt both when we were in & outside, and they had no problem letting us taste the different beers until we each found the one we liked.
In all, the place isn't large, it's very friendly, and exactly what I expected to pay for what I got."}
{"text":"I had taking a date there we sat and waited for our food after it arrived I found hair in my food needles to say I'll never go back"}
{"text":"I went to this location after a long hike with couple of friends.The seating is based on your preference, in-short sit wherever u like. Interior lighting in the restaurant was too dark for my preference, but we set in since it was little cold outside. Since, its a brewing company I decided to try out their hefeweizen. When the waiter brought it to the table it was not chilled, but the biggest disappointment was the special. I ordered the special, pulled pork sandwich (see pic). The meat in the sandwich was tasteless, it was too sweet and the cheese seemed like it was a week old. Fries were fresh, however my appetizer of queso dip with chips was ok. The dip lacked proper consistency in the cheese's texture, it was too runny.

Overall, the food and my drink  was disappointing. Maybe I was expecting bit more after 3 hours of hiking."}
{"text":"Today the weather was beautiful so I took my daughter to the brewery where they have a nice size outdoor dining area she could run around and chase birds. We had delicious chips and salsa while waiting for our chicken ceasar salad and baja enchilada soup. The salad was a pretty large portion for the $10. The soup was good but strange..... Excellent service even though they were busy with a few large table."}
{"text":"SLOW SERVICE.... waited about 40 min for our burgers... they were good dont get me wrong but the lack of service is the reason for the rating.  came back later that night for the party and heard other people saying that they were waiting 45 min for food... we waited about 15 min to put in  a drink order but a server never came so we left.... by the time we left those people still didnt have their food... so they waited over an hour... we walked down to The Dillinger which was GREAT!!!!"}
{"text":"Relaxed place for a meal. Kids are welcome. We always see kids here.  Great beer and food."}
{"text":"Stopped here on Sin City Brew tours and had a great time!  The owner was so informative not only about the beers but he also incorporated history on the Hoover Dam."}
{"text":"Do not bother! I am sad to report this place has gone over the cliff, not just downhill. Stopped by after a day on the lake and found the burgers and other items to be well below average. Server was quite nasty, thought she was going to kill my wife for sending back her flat and tasteless IPA. Many beers listed on filthy menus were not available. Fries are super greasy and taste dirty from fry oil that needs to be changed. 
Final straw was the filthy restrooms with wash basin water turned off in one of them. Just no attention to detail. Won't be back!"}
{"text":"Good service, good beer, bad burger!  How can they charge 8.95 for a pre- frozen beef patty?  yuk! Terrible texture, no taste.  Come on folks, fresh beef just tastes a whole lot better, and at $8.95, that's what it should be!"}
{"text":"The only reason this place is 4 stars and not 5 is because you have to wait a ridiculous amount of time to get your order taken AND to get your food. However, the food was AMAZING . Try the pekoe pale ale, you can thank me later!"}
{"text":"Very good craft beers.  Great setting....either inside or out.  Their sandwiches and burgers  were very good too.  We really enjoy the setting in downtown Boulder City.  Stop by and check it out.  We will be back"}
{"text":"Like most, I stopped by here after visiting the dam. We saw this place as we passed in and we are not people who turn down a chance to check out a brewery. 

SERVICE: Great. We sat at the bar overlooking the various brews of beer. Our bartender was quick to help us and offer recommendations. It seemed like many of the people frequenting the joint were regulars. They knew each other by name. You gotta love that.

FOOD: The food was good. I had a salad with goat cheese and candied walnuts. It hit the spot after a day out in the heat. My friend had a wrap which she described as, \"Okay.\" Bar food through and through; nothing to write home about.

BEER: Meh. Not to my taste. Fell flat. 

ATMOSPHERE: A cool little roadside brewery with an homage to breweries around the world through growlers. I liked the feel of the place."}
{"text":"They have a huge selection of beers and drinks. I had their burger and it was excellent. The outdoor patio was nice and clean. Very relaxing atmosphere and the staff was more than willing to help with menu choices. I wish I had more time to spend but it will definitely be a place I come back to"}
{"text":"Working the art in the park in Boulder city this weekend and needed a decent meal. The night before we set up and can work up quite an appetite. So I was told to walk down the strip and id find plenty of places to eat. I settled on the nearest one. Had a crowd so I figured it must be good. I sat at the bar for quite a while while the bartender helped other customers. No eye contact or acknowledgement. I was simply ignored . Finally instead of a greeting, he slaps a menu down in front of me and says drinks are on the first 2 pages. After choosing the house burger he says what do you want to drink? I said I wanted food and ordered. Before I could ask for anything else he left and resumed his dark walk back and forth dealing with customers. I immediately pulled out a $20 and put it in the bar so he could take it. Usually a person returns with a total. After several minutes I put it back in my wallet so I could use the bathroom while I waited. As I stood he finally stops me and says, \"money\"? A bit surprised at his attempt at customer service, I said I had it out for the longest time in a light hearted manner. To which he replied;\" well, I'm busy\". I don't care if the food is great. Left a bad taste in my mouth. I've been a bartender, and this was a lousy one.. Oh yeah. The music sucked. Top 20 pop in a brew house? Welcome to Boulder City!"}
{"text":"Was going to give 1 star. Read on for details...

They just can't seem to handle a high volume of customers - even at their own planned and promoted event. Past experience proves the more customers that show up, the s-l-o-w-e-r the service gets.

Off-hour (non lunch/dinner) service was reasonable, especially if you sit right at the bar. How much more convenient for employees can a customer make it? GREAT service is to be expected in such cases.

Just attended a special event at this \"Dam Brewing Co.\" featuring Kona brews. Very tasty and thumbs-up to Kona. It was the \"Dam\" food that was lacking this time. Had a burger during a prior visit (off-hours) which was good however.

As Yelper \"Mike F.\" stated on 8/16/16:
 \"All 4 of us decided to eat somewhere else after we finished our beer which we already ordered.\" 

Bingo! 

We were thinking the same thing until another waitress stepped in to prevent losing customers. Nonetheless, by that time it took over 25 minutes for us to get any drinks. Note that we came for the advertised Kona brew and atmosphere, otherwise we would have left - pronto.

Yelper \"Vikkie N.\" stated on 7/16/16 that:
\"Server kept disappearing and we ended up walking to the server station to pay\"

Bingo, again!

Whatever the reason, service was s-l-o-w. No matter what restaurant one may be at, if you're head is continually spinning with arms waving to get attention from the wait staff there is a BIG problem. The staff apologized and was polite but that only goes so far. 

Boulder is a small town so many folks (us included) drive from Vegas to get here. S-L-O-W service saps time from patrons. We really wanted to stroll the quaint streets of Boulder after eating to check out other businesses, but no luck - thanks to, did I mention(?), Snail S-L-O-W service.

So, on the issue of star-rating, if it weren't for the great tasting Kona brew and their attentive reps, apologetic \"Dam\" staff and decent songs from the acoustic guitar musician you'd have seen a single-shooting-star (burnout) review.

All said, I will eventually check them out again but will certainly stack the deck in my favor - off-hour and simple burger order. What bar can't handle that??


NOTE: Yelp considers \"3\" stars as an \"OK\" experience - of which this was not (exceptions noted above not enough to turn the tide). Sorry, maybe next time with be better."}
{"text":"I've eaten in downtown BC many times, but it was my first time at this restaurant. I'll say this is going to be my new go to. The sandwiches taste good and the price on point. The beer was delicious and the service exceptional. Plus plenty of outdoor seating with shade!  

We tried the Pilsner house brew ($5) which was really good. It was smooth and had a nice flavor. I will be back just to have this beer again. And maybe try the sampler six pack. 

For an appetizer, we had the chips with queso dip and mild salsa.  The chips were thick & ok in flavor. Nothing exceptional here. The queso dip was really good, but the cheese stiffened by the time we got our entree, which made it difficult to pick at throughout the meal. This isn't a bad thing tho, as it means the kitchen isn't adding extras to keep it soupy (e.g., oils). The mild salsa was a chunky tomato based salsa either the consistency of pico de gallo; it kind of reminded me of store bought salsa from the deli isle. I wasn't a fan, it was a bit bland and didn't have much spice, even with respect to other mild salsas. Next time I would order chips and queso ($6) and forgo the salsa (+$2). 

For the entree, I had the brueben and she had the turkey club. Both were tasty sandwiches served with fries (or coleslaw) @ $10 each. The corned beef on the brueben (Reuben) was thick cut.  

The service was exceptional here. The server was attentive and quickly brought everything we needed. She was also quick to notice a mistake (before I even noticed) and offered to fix it right then. The restaurant was busy, but this did not diminish quality of service. 5 stars for that!"}
{"text":"I've been coming this brewery since I first moved to Vegas in 2007. And, sadly, I still have yet to be impressed. Don't get me wrong, it's not bad. It's just not amaze. I will say that I think the beer and food have improved over the years. The service, however, seems to have gotten worse over the years. 

The beers are all just fine. But none make me want to have another pint or take some home. The food is alright. But there are so many better places to eat in the BC. But if you don't want to venture elsewhere for food, the food here will do ya ok enough. I personally like the pretzel."}
{"text":"Great 80s music with live band on Sat night, great beer sampler and the burger with pepper jack cheese and jalapenos was beyond awesome.
Wayne Gorsek"}
{"text":"Was disappointed that there was not dark brew in tap,  but the food was good enough and we had the beer sampler,  which was nice. I would NEVER have chosen an IPA, but theirs is pretty smooth and was good. Burgers weren't extra special in any way other than the large portion and good homemade Cholula sauce. They were good for a pub. Certainly not the crappy pre-formed McDonald's variety. 

We had a nice server and the other gal working was sweet and stopped by to comment on my tattoo. Seems like a nice crowd."}
{"text":"Great Lunch!  We stopped by after visiting Hoover Dam.  What's better after a dam tour than a dam beer?!?!?!   Enjoyed trying a sampler flight of all their beer - my favorite was the pilsner, but the pale, IPA and stout were all pretty tasty.  Ordered the burger, turkey club and the pretzel.  All were excellent.   But the really important thing... the cheese sauce w the pretzel was amazing!  Worth the trip!  Thanks for a great lunch!"}
{"text":"Nice brewery, good air conditioning. Nice space to walk into, very pleasant. The out door area was large and had plenty of room, though it was hotter than who-hoo the day we visite; it was dry though. . . 

Good Beer. I don't remember what we had, but we had too much! We each had several pints, and I can recommend getting the pitchers because they are less expensive.

To go with we had some salmon sliders which were delicious. We could have eaten two orders of those.

I would like to visit again."}
{"text":"Not impressed. Beer meh, service meh, food meh. Quest and salsa was the highlight.
Not really worth the time."}
{"text":"Stopped by here after a trip to Hoover Dam. Nice little brewpub with a great outdoor area. Went with the sampler to try their different brews. They ranged from excellent to good, nothing really bad. My favorite was the Black Canyon Export Stout. We also sampled the fried pickles and onion rings and both were good."}
{"text":"Nice pub, good beers. I tried the mango jasmine wheat and the powder monkey pilsner.  I would recommend both.  Nice relaxed atmosphere and they have a nice outdoora area.  Great after a trip at the hoover dam."}
{"text":"Great place. Beer was great, service was even better. If you go make sure to ask for Jen K."}
{"text":"Nice stop in Boulder City - great wait staff - happy and on the stick. However, food menu has shrunk a ton since we were last there. Chips and queso was like velveeta and stale chips (bottom of the bag). Cinquenta Cervesa was flat and a weird flavor. Namesta white ale was great. If they get the food back in order, it'll remain a great place. Plenty of indoor and outdoor seating. Lots of dogs in outdoor seating. Worth a try .... if you're not too hungry."}
{"text":"We stopped at the brewery while driving through town. Staving and wanting a beer it seemed like the best place to stop. 

We sat outside. After being inside all winter it was great to sit outside. Patio was awesome!! We got a flight of beers. It was ok. We got the IPA Ocho Loco, it was ok. Not very hoppy for an IPA. Also got the High Scaler, that was pretty good too. Also ordered burgers. Patio was a 10, beer was a 6, food was 8. If you are in the area def stop by and check it out."}
{"text":"Today we decided to come here and try this place out. Gave them a call to make sure our kids can join. So if you got kids NO PROBLEM =) We came around 5 on a Saturday. This place is located in the awesome downtown area of Boulder City. 
Ok so their outdoor seating is nice. Tables and shade and nice pieces of industrial art to look at. I believe they have live entertainment on Friday and Saturday nights. We sat indoors because it was still hot out. 
So it's a seat yourself kinda deal. We found a table for us 4.  I ordered a beer sampler of which came with 6 samples of the different beers they offered that day. ($11)
* Cincuenta Cerveza 
* Powder Monkey Pilsner
* Hell's Hole Hefeweizen
* High Scaler Pale Ale
* Smash IPA 
* Black Cherry stout 
The beers were good. Only bad thing is when I was trying to figure out which beer was which the waitress couldn't help me.  I guess the bar tender mixed them up. But I think I figured out which was which.
I also ordered a BBQ burger. It was delicious! We also ordered kilowatt sliders and Bavarian beer pretzel for the kids. Those were really good as well. My husband got the megawatt sliders and battered mushrooms. His stuff was yummy!! 
After reading bad reviews I was afraid to try the food. But I'm happy I did because everything was great. No disappointments here. 
My waitress was also super sweet. Bathroom was clean and offered free scrub when washing hands.   I checked in using yelp and got $5 off our tab. So don't forget to do that if you're gonna check this place out. I'd come back again."}
{"text":"Nice little bar with good beer and decent food. Prices are fair and service is good. Best brewery in Boulder City. Not sure...but it might be the only brewery."}
{"text":"Oh....I am so disappointed.  I thought I had found the best hamburger on earth.  Went there again yesterday and I could have cried!!!!  I don't know what's up but it was like I was in a different restaurant.  

First of all, it literally took us over an hour to get our food.  Our waiter (who was nice) told us their grill is not big enough to handle the volume.  Our party of four ordered one medium burger, two medium rare and one rare.  All four of the burgers came out well done and dry.  The guys enjoyed the beers but I couldn't stop whining about the hamburgers!"}
{"text":"The worst brewery I've ever been to in my 62  years. We almost walked out after horrible beer (both choices) took 20 minutes and could not even finish the terrible food. The place is a pig pen and bathrooms looked like a gas station on a heavily traveled hwy totally blown up. Don't waist your time or money on this one."}
{"text":"Service was horrible - it took our waitress at least 10 minutes to greet us, and although all we ordered was a flight, it took her even longer to fill that order! The bartenders were standing around looking like they could use something to do (like pour my flight for example) but the waitress was nowhere to be found! Then of course, once we finished the beers she was still missing.

Besides the awful service, all the beers tasted fine but none stood out to me. Location was cute but it was a warm day with no AC turned on. If you're looking for a \"quick\" stop to rest while on a road trip, this wouldn't be the place."}
{"text":"We went here with some friends after zip lining in BC and this place is great for greasy food!  They have great chicken wings, burgers, hot dogs etc and a great selection of beers.  Def give this place a try when you are out in Boulder City."}
{"text":"This was one of the very first stops along a birthday adventure my girl put together.  I've seen this place many times driving though boulder to the dam, and always have been very intrigued by it.  Once we walked in all the staff was very courteous and friendly, and our bartender Mike was very knowledgeable.  I am more of a light beer drinker, and immediately had the powder monkey pilsner recommended to me.  Extremely flavorful, good beer choice with my salmon sliders.  I was expecting more along the lines of a piece of salmon on a slider bun, with condiments.  But they actually turned this into a slider, with shredded salmon, and veggies, in a patty form cooked perfectly.  Also had their Bavarian beer pretzel with homemade beer queso.  Also noticed they had the chocolate reaper stout from a shoe they filmed on food network, so naturally I had tho try this brew infused with Carolina reaper chilis.   The taste is unmatched, and definitely warms you up on a cold day like yesterday!"}
{"text":"Loved the fried pickles and the burgers was good.  I was surprised with the live music.  It is on my list of places to visit again.

I was surprised when I checked in I got a discount for my first visit.   Thanks to staff who were pleasant and attentive."}
{"text":"Great little brewery. Was well worth the stop before heading into Vegas. Started with the Six Shooter flight and then ordered the stout. My only wish was that the stout was a little more full bodied but it is still good beer. We also had the Beer Battered 'Shrooms and YUM. Service from Emilio was stellar. The husband and I will definitely return on our next trip out this way."}
{"text":"Good Dam beer! Holy cow what a great little brewery. After a hot day tooling around in the desert and filming/shooting photos we dropped in (found it on a map...seemed like a great idea. It was - comfortable, roomy with great vibe. Oh, right, the beer was fabulous!"}
{"text":"The best part of this brew pub is that you can bring your dog to the patio section.  The first few times I brought my dog there the waitress would bring him a small snack and a small bowl of beer.  but that stopped...no big deal the fact theydod that at all was freaking great.  Now he just gets a huge bowl of water..awesome.

For me the beer is slightly above average, but the food is sub-par 80% of the time.  Don't get wrong I still go there regularly mainly in the spring and fall.  The patio is awesome.  But how can you have a brew pub and serve the food they do is beyond me still.  The first time we went there ( a few months after they opened),  the food was crap (7-11 type hot dogs)...the have improvede leaps and bounds above those days.  Now the food fills the void, after a day on the chopper, lake or mtn bike, but damn...if they got a good cook, meats, and such the place would be kick ass.  The Salad is probably the best thing there IMO, I wish ther burgers were as good as the sound on the menu...

The servers are usually very good, but we have had poor serve once or twice, but that just might be becasue my dog scares them with his 145 pds..."}
{"text":"Great food, and awesome local brews made on site. Love the creativity. Check out the tanks directly behind the bar."}
{"text":"My friend's and I always stop by here for lunch and to catch up with some beer and conversation after the Art Fest.  Note: During peak hours, or festivals, MAKE A RESERVATION!  We showed up about 1pm, and the wait was 45 minutes, but that was determined by how long the people sat and chatted at the two tables we needed. As one table finished, we sat half our party, the other table the waitress was going to put together for us finished, and 3 people ran over to sit down. We told them we had a reservation and people waiting for that table and they were NOT happy! Sorry buddy, we've been waiting for over 45 minutes now for our party to be seated (as expected each year and we don't mind).  You show up, grab a little umbrella stand table and run over to steal a table waiting for less than 10 min? I think not.  Don't be rude! 
Anyway, most of the table ordered burgers. I had the turkey burger and it was good. The fries are a little soggy but good.  We also ordered the pretzel and some chips and queso which was good. Beers change based on the seasons. Pumpkinhead was good, but a bit heavy for me, so I changed to a Hefeweizen which was great! 

I've only eaten at one other place in BC and this is my favorite thus far as the other places seem to closed for the day whenever I get there. :("}
{"text":"Mac and cheese was great otherwise it was freezing in the building even the men were wearing jackets,  it literally smelled like a barn inside and burger all I can say is \"where's the beef\""}
{"text":"Very unorganized, the wait staff is running around clueless. We been here 20 minutes and asked for our drinks twice... nothing. Can't rate the food but I can only imagine how that's going to turn out!"}
{"text":"An Arroyo IPA was just the thing after 500 miles of motorcycling today. Barman was friendly and seemed to know his stuff. Great location right across the street from the historic Boulder Dam Hotel."}
{"text":"Food was fine, wings and their house made sauce is very tasty. Service needs a lot of improvement. 20 minutes for a water seems a little too much. Place was not packed, some empty tables so that isn't really an excuse. Our waiter was super chatty with other tables who seemed like they were his buddies outside of work. We tried refilling my water at the bar, and for some reason \"they don't keep water at the bar...\" There beer was good though."}
{"text":"Had the hatch chili burger and being from NEW Mexico, had to give it a shot. Great burger and fries and a good IPA to complement. Great patio seating area as well!"}
{"text":"This is an interesting place. Food was good but took a while to get served after taking the order. My issue with this place was that it seamed to be way laid back, no real management. I wasn't greeted when I walked in and kind of stood around for a few minutes trying to make eye contact with any employee. Finally I decided to browse around the place (they have t-shirts and stuff for sale) and still no one greeted me. I finally just asked a served if we just seat ourselves and was told yes. 
It was super busy so maybe that is why it was so mismanaged but I don't know if I would go back just to find out.
Prices were reasonable, didn't have any beer, clean but dark inside."}
{"text":"I am a little annoyed that the name is Boulder Dam Brewing instead of Hoover Dam Brewing but I guess I will let it slide.  It was really easy to find which is always a plus when you are from out of town.  The service was fantastic!  The guy helping us was super nice and funny.  The house beers were all really good.  They also have other beers as well as food.  If you love to try new breweries while traveling like I do, and you are out visiting the Hoover Dam, you should check this place out."}
{"text":"Fabulous place.  Went on Monday, it was popping for a Monday around 2 pm.  I drank the Fruity beer that was 10% AC...It was honestly delicious.  I also had the veggie burger with fries...but be warned, the beer is filling.  The bartenders and staff were nice and talkative...the place was clean and quaint.  Boulder City is such a gem when the weather warms up!"}
{"text":"Stopped in on our drive from the Grand Canyon to Vegas. Came across it while driving down the historic district. 

Easily find parking on the streets. 

The best part of this place is the $5 off coupon when you check in on Yelp 

We were greeted once we walked in \"sit wherever you want\". We just a quick beer so opted for the bar. 
We sampled four different beers before both settling on one. Beers are nothing special, but not horrible either, they are all $5. 

We also ordered the pretzel with cheese... Not sure if I recommend this. When we got it it was super hot to the touch. After letting it cool down we dug in, the first bite was super hard. We quickly realized the pretzel was definitely stale. We spoke to the bartender and she took it back and brought us a new one. Pretzel looked exactly the same, but softer this time. Didn't taste fresh at all, I assume they're just frozen and heat up when ordered. 

All in all an okay stop if in the area, but I wouldn't go out of your way to come here."}
{"text":"This local establishment breaks my heart. Such a great opportunity as far as concept and location. Too bad the overall experience is not good. I used Facebook to complain and the owner responded and told me it was an \"off night\" due to a local event they didn't prepare for. That confuses me. When you know of a planned event, you plan accordingly. In any case, I believe what he said and accept the explanation and apology. Last week, we tried again. We walked in around 3 and it was pretty empty. My husband and I sat at the bar and waited. And waited. And waited. We watched the bartender serve others around us. She passed us several times never making eye contact and acknowledging our presence. She stood IN FRONT OF US and looked right through me. Maybe I'm dead. Yeah, that's it. We're ghosts. We left. I wrote a review on Facebook and so did my husband. The owner has not contacted either of us. I suppose it's possible that our Facebook pictures are hanging in the back and we will never get served there again. Too bad because we like beer and we like food and we like to spend $$."}
{"text":"My girlfriend and I went on Friday night July 10th.  There was a live band which was decent.  We sat down at a small round tall table in the courtyard and the blonde waitress with the ponytail ignored us for half an hour.  Not even a glance.  Finally my girlfriend stopped her and asked \"Can we order from you?\"  The waitress replied \"Has anyone helped you?\"  It was obviously her section since no other employee came near.  My girlfriend ordered the pilsner, it was terrible.  Not going back!"}
{"text":"I have gone to brewery every lake trip since at least 2008, I have never been treated as rudely as I just was by the owner. We showed up after they were closing the kitchen with 6 people wanting to order food and drinks. Without greeting us he immediately asked if we planned on eating, we said yes and told him we always come after the lake. He told us the kitchen was closing and made us feel very unwelcome. We used the bathroom and took our money and future business down the street to the Dillinger per the recommendation of the nice server."}
{"text":"Went here with a Groupon awhile back and got the IPA out of the six sampler set. Overall the beers were pretty good, and the bartender an extremely cool guy to talk with. However, I did not think the beers tasted all that exceptional. If I do find myself in Boulder City again, I will be sure to stop by this Microbrewery again though!"}
{"text":"If you're into wings you've gotta try theirs, with their signature sauce. I might find an excuse to drive out to Boulder every now and then just to have some. It's a mild sauce and I'm usually looking for heat with my wings but it's delicious and I'd get it again every time I'm there."}
{"text":"Four of us hit up the BDB Co for burgers and pulled pork BBQ sandwiches before heading up to the Dam which this establishment rightfully continues to honor it's original name!  Right on.  Service was friendly and food was pretty good.  Buddy had an ale and I had my usual Heffen which was cold and tasty.  I'll patronize the little guy (microbreweries) any old time to a sterile bottled brew that's been sitting on the shelf for who knows how long.  They were filming a commercial for the brewery at the time and everyone was really into it.  It was a scorching 104 outside so most everyone was inside that afternoon, waiting time was 0-10 minutes for most that came in after us.  I'd recommend BDB Co. as a great place to hit up before or after going to the dam...if you want good burgers and a tasty cold microbrew, disregard the lame ass reviewers who probably would be better off at Burger King or in a \"posh\" Vegas locale to be seen.  BDB Co. is run by real people for real people."}
{"text":"I have only been here a handful of times but it really hits the spot and it's not that expensive. I have yet to try the beer, so i will only mention the food. My favorite dish to get is the BBQ bacon burger. The beef is high quality and not greasy, the bacon is nice and crispy and the buns are nice and soft.  The fries are pretty good as well. Service is a little slow but Boulder is kind of a laid back town. I recommend this place if your going through town after a long day at the lake or are just up in boulder for the weekend. It will definitely satisfy your burger craving ."}
{"text":"Had the signature \"WORST Salad\" (inside joke) -- was awesome.  Thankfully they subbed out the awful with a lot of well above average lettuce, \"the best\" tomatoes & some sweet sweet salad dressing."}
{"text":"I am sitting here ready to go postal!! Absolute WORST service ever!!!! Got seated and it took 15 minutes before our order was taken. Another 10 before we got our drinks. I spoke to the manager and he kind of shrugged and said it was busy and if I was looking for a serving job he'd hire me.  I know it's not because it's busy. We've been here when there was only one other table and it was still bad. Why are we back? I have an emotional tie to this place because it's where my husband and I came right after getting engaged. Won't be back after this, though. WORST SERVICE EVER!!!!!!!  Still don't have out food 30 minutes after original post!"}
{"text":"I came down here to kill time before seeing the Red Mountain choir perform down the street on Wyoming Ave. 
Boulder Dam Brewing Co. is settled in cozy downtown Boulder City, and they have everything imaginable from beer to food.
Maybe when anything related to Red Mountain happens again, I'll return."}
{"text":"If you enjoy a great beer made in house and some great food this place is for you. Large out door garden patio with misters for the summer heat"}
{"text":"Standard bar food which was satisfactory enough. Service was very poor though. Our server (a younger guy) didn't visit us for 15 minutes after we sat down. If it was busy I would understand but there was only one other couple there. One of our orders was completely wrong. Our server misinformed us about happy hour which resulted in us waiting to order drinks. Overall, our server was just inattentive and sloppy. Glad I won't be back in Boulder again soon."}
{"text":"Never have I ever been so upset with this service I've tried coming to this place 3 times already and all three times I've been ignored and not a single acknowledgement from any of the waitress I noticed that 2 minutes after my friend and I sat down 2 girls had sat behind us and they were greeted immediately and given menus in less than a minute I waved for the waitress with the short hair I didn't get her name but she ignored me twice even after making eye contact I decided to wait a little longer then 3 older people decided to sit in front of us, within less than 2 minutes the same waitress with the short hair that ignored me had 3 menus for them so I waived to call her and she turned away after 3 more minutes a waitress I called over came in and with a rude attitude decided to just drop the menus and walk away never have I ever felt so upset over such a horrible customer service too bad I didn't even get to try the food !!!"}
{"text":"Worst service ever!  We ordered, waited over an hour and never received our order!  Went to the Dillinger and had great food and service!  
Vurnie from MN"}
{"text":"Yikes...where to start.  While waiting for a table, I watched the hostess drop a rag on the floor, then immediately use it to wipe a table. I made the mistake of using the restroom. One of the filthiest restrooms I've ever seen.  We ordered the beer batter pickles appetizer, and received 5 small pickles for $5.95. I wanted so badly for this place to turn it all around with their \"1/3 lb burgers\". Either their buns were made for a 1 lb burger or the burgers are not truly the 1/3 lb the menu claims. The six shooter beer was alright, although 2 of the 6 beers were warm. There were two redeeming factors to our visit: the servers busting ass and the coleslaw. The slaw was perfect; tasty and just the right amount of dressing. Your money is best spent elsewhere."}
{"text":"Really good food!!! The pretzel and fried pickles are amazing!! The people were great and it was very clean. Good prices, good food, definitely will go again."}
{"text":"Definitely a gem of a place.  The seasonal brew that I got was delicious. It was a red ale with wintery notes of cinnamon.  I give 4 stars because I did not order any food.  The bartender was very nice and the staff working the dining room was friendly.  The tanks that brew the beer on property are right behind the bar which is a pretty cool feature."}
{"text":"Great place to eat after a day at the Hoover dam. So good to see small local establishments really care about the tourists. We planned to return later that evening for a late dinner and it was closed. We certainly understand why it was closed but we were sad that we didn't get another opportunity while in town."}
{"text":"Beer and food are both good, but the service is horrible.  The server just stopped at our table to ask if I still want the glass of water I requested 30 minutes ago.  Forget it, just bring me my bill and let me leave!"}
{"text":"Nice location in the heart of the city but that was the only thing positive about this experience. Wait staff was extremely slow- I ordered a very basic salad and my husband ordered a roast beef sandwich - it took 49 minutes to get our foods with only one status update about 1 minute before we were served. When the food arrived the waitress said \" sorry for the wait were were backed up\".  Well there were 7 tables with people outside and 4 inside so that certainly did not reflect a busy afternoon. Beer is priced right but marginal choices for both beer and food. After the extensive wait -My salad was poorly presented ( romaine, walnuts, onions and avocado) and my husbands sandwich was dry  There are several other choices for meals in the area- try those instead"}
{"text":"Here's a review I posted at pubcrawler on (06/25/2008):

I've passed this place a few times and made plans to check it out with the fam one afternoon. It was packed, so I cannot knock the staff for being slow to get to me. The bartender was waiting tables, sadly we didn't get her. The waitress let us sit idle for 45 minutes (with children, mind you) and was genuinely angry that I had helped myself to menus. No 'hello' or 'sorry we're understaffed' was ever uttered. She scornfully said 'you got your own menus' to me. We ordered our food a two beers (hefe and an Amber) and they came pretty quickly. They both had a rotten taste and aside from the slight variation of color, they were the same beer. Maybe a lemon wedge might have helped the hefe, but I was not asking for that. Substandard. The food was mediocre at best. It was a couple of weeks ago so I forgot what my meal was, but is was practically thrown at us before the waitress ran out the door. I had to get up and find silverware and straws. I hope she's not mad at me for that too! As an appetizer we ordered the beer battered mushrooms. What a huge mistake! I don't know how one could mess this up, but once you get through the batter, a hot blast of flavorless liquid fills your mouth. In closing, please avoid this place at all costs. Coming from Vegas, the land of chain restaurants, I pride myself in seeking out the little guy and giving him my business. I really wanted to like those guys!"}
{"text":"Awful  - Philly cheese steak fries had more salt than steak, and the steak was the Steak-mm variety. Plus it took forever to receive this delicacy."}
{"text":"This is a good brewpub.
The place itself is somewhat lacking.  The inside is small and rather uninteresting and basic with limited seating.  The main sitting area is the patio, which is nice and has a number of umbrellas but needs more shade given how sunny and hot this area is and given that it is most of the seating.

The food is great.  It has more limited range of fare than many and mostly just a focus on burgers and sandwiches but all that we had was great.  The \"Brueben\" was the best rueben I've had in a long time with outstanding, tangy homemade sauerkraut.  The philly cheesesteak fries were wonderful with a great mixture of ingredients in w wonderful balance.  Burgers and chicken wrap were outstanding, too.

Beer is of limited range and choice but the Powder Monkey Pilsner was very good."}
{"text":"Great Brew and good food! Good and friendly service. Boulder City Brewery and the town is a nice clean place to visit. Close to the Hoover Dam with lots of history. Would visit there again."}
{"text":"This place is alriiight.  Three stars is being generous, in my opinion. It's kind of like a small saloon with a bit of wear & tear, not much deco on the walls (in the bar area) other than their own merchandise and a couple tv's-- but I guess that creates their version of character. Aesthetics is not a strong point here.

 The vats are impressive upon first glance...but the beer not so much. **HUGE beer connoisseur here**  After making my way thru the maze of oddly arranged tables, I sat myself at the bar.
There was an older, not-so-friendly man bartending the day I went. He seemed to be very irritated to be in the presence of those at the bar. Maybe it was because I'm not a local? Maybe it was because the guy had a rough day? Maybe....he just plain loathes being there. 

I looked at the drink menu...it all -looked- good and was definitely willing to try it all....especially the banana stout, but opted for the monkey pils (just falling back on familiarity). 
As I tried to order, the man just looked at me, shook his head and didn't utter a word. What's that mean?! You're shunning my choice or you're out of the pils? It'd have been nice if I was actually greeted then maybe tossed a few recommendations!!! I mean DAMN! (Or Dam...whichever) could this guy BE anymore lackluster and apathetic?! 

I ordered the high scaler ale which was delightful.
And guess what? As soon as the other, more personable bartender showed, the pils was back on tap!! Funny how that worked out. 
.

Also decided to try the beer flight. I forget the names of the beers. the ipa tasted very soapy and the stout was thin and flavorless. The hefe was superb -- albeit a bit on the bitter side...I wasn't crazy for it. Of the lot, I really only found two to be tasteful. 

We also ordered the chili cheese fries....and I don't think I'll ever order them here again. The chili was strangely sweet, the queso just...no. and WAY too many jalapenos for my taste. 

The one thing I did like was the hand scrub in the bathroom and the nice patio area. I'll give this place another shot with the hopes of a different bartender and a different food selection. 

I love beer and I love local breweries, especially those that feature and showcase other (local) brewers. I like that about this place, and I'm sure if I was a local, this spot would be my go-to."}
{"text":"You'd think people would practice making beer before selling it. We've given this place two tries about 2 years apart and there will definitely not be a third. Got a sampler and couldn't finish a single beer. The beer all tasted pretty similar, and that's a shame when the ale and the IPA are interchangeable in taste. 

And, to add insult to injury, the beer didn't come from the taps, but from a PITCHER kept in a cooler for who knows how long. Seriously? Breweries are supposed to know about beer and this is what they serve? Maybe that's why it's swill. 

For anyone who thinks this is good, I urge you to check out real breweries. This is not craft beer; it's crap beer."}
{"text":"We went here after visiting the Hoover dam in the morning, and had lunch at about 1:30. The parking was easy, and we were able to be seated right away. The food was excellent and the beer was excellent. The staff was very friendly and we had an enjoyable lunch, very relaxed and just what we were hoping for at that point."}
{"text":"Really wanted to like this place.  Outdoor seating and music is nice, but beer was just not that good in quality (my party found the flavor off on all in house brews) and service was hit or miss.  Some servers were nice, others were a bit surly and unavailable."}
{"text":"Service was far from good order got screwed up price was to high for product and the worst part was none of their brews were really good .  The burger I ordered was half the size of the bun . Don't recommend at all !"}
{"text":"Food was not good-just plain weird - Caesar salad w vinegar write- undercooked salmon n burgers- very below average-go to dillengers"}
{"text":"Spent last weekend visiting Lake Mead , came here Friday night and had a light dinner and a couple glasses of beer , well , maybe 6 or 7 spilt between 2 people ...had the triple - berry and it was great ! It was so good we came back Saturday night and enjoyed more Triple - Berry ! They had a 3 man band that was fantastic and the service for food and beer was excellent ! Perfect place to kick back and taste some different brews !"}
{"text":"If we're being real here, you should probably eat somewhere else before coming here for a few beers. 

We just snacked here and had a few drinks here outside on the patio. Drinks were good, but the food is pretty atrocious. 

Their queso recipe is badly comical, like Velveeta with margarine mixed in.  
Sweet potato fries had nice flavor, but you gotta face facts that you're consuming limp, flaccid strands of real sweet potato instead of an actual crisp fry. (If the actual definition of \"fry,\" however, is that it's been thrown in the fryer, then I humbly stand corrected.)

Fabulous service here. We had a lovely lady named Taylor, but the rest of the staff was still friendly to us as well in passing. 

Good stop for dranks. Bad stop for food."}
{"text":"This place is more like 3.5 stars but I'm rounding up because...

- Food was Good

- Service was Good... we had a big group and they let us all get separate checks.  :)  

- Good for Groups.... see above.

- Ambiance was Great...we picked a great night to go because the weather was perfect for sitting on the patio (which I realize the establishment can't control... but the fact that they had a patio with which to sit out on... gives them the nudge up in stars...)

...and... there was a live band playing tunes and taking requests... (again... giving them the nudge up...) to make for a really nice evening out.


Enjoyed a Burger... which was Awesome!  Juicy and not too big and definitely NOT greasy... so I was really happy with it.  And the bun wasn't overly bread-y which I like because I want to enjoy a burger... not fight with the bread.

Mom ordered the chicken wrap and wasn't thrilled with it.... she said it had too many raw red peppers which were overpowering the wrap.  So, she said she wished she had gotten the burger.

Also ordered the Zuccini strips.... these were 'ok'... nothing all that special here... although they do give you quite a few that are easily shareable with 3-4 people as an app.

I'm not a beer connoiseur but I thought the Hef was refreshing and tasty.... I enjoyed it very much.  :)

Will we be back?
You bet!  :)"}
{"text":"Good local restaurant. We've been there a couple times, both with kids and just adults. Being a brewery its more of an adults type place. The outside seating is nice, especially of you can grab a spot in the sisters during the summer. The live music is a cool touch as well. The reason I dropped a star is the table service seems to be hit or miss. Sometimes you get an attentive server, sometimes you get one that you only see twice. Fun place to try though. I recommend the Rattlesnake brew - very good!"}
{"text":"Great food and beer. Quick and friendly service. Casual dining indoors or patio seating. Great place to refuel after touring the Hoover Dam."}
{"text":"Walked in to a half full crowd. Got seated within a min. We were greeted and handed menus, sat for about 15 mins and never drink orders or even spoke to again.  The people that came in after us a few tables over got drinks but we didnt...We walked out."}
{"text":"I visited the brewery on 11/30/2017. The experience i had was horrible. we had a party of 9 and we waited for a table almost 30 minutes which we knew that with a big party we were going to wait but if the party of 9 behind us gets a table first that was a problem. Then we finally got a table  but the food took 1.5 hours and in top of that it was nasty. There were table dirty tables for hours and the people working there did not even care. We asked to speak with the manager and i waitress listen to our complain but at the end we got a discount of 10% which is basically taxes. No apology of any manager or owner. It is good to say that i will never be back to this place. Just TERRIBLE. !!!!"}
{"text":"I really like this place! We come to have a drink after breakfast on the weekends. Their service is pretty good and they have a variety of craft beer for every pallet. I haven't tried their food but it looks pretty good."}
{"text":"I've had better experiences at Boulder Dam Brewing but this last visit was a tad embarrassing. I suggested this spot after a hike with my boyfriend's family because I like the patio better than at Dillinger's (both are pet friendly). Well, the patio is still better but not much else. None of the beers sounded very appealing so I ordered a La Fin du Monde that they had on draft. This was good. We also ordered a sampler flight and the stout among us. The stout wasn't very strong in flavor and rather flat. I did enjoy the cider-y beer they had in the flight. 

For food we ordered the nachos and pretzel to share and one in our party ordered the wings. They were out of both sweet potato fries and wings, so he had to get the boneless. The boneless wings looked like over fried popcorn chicken. He didn't finish the dish. The nachos weren't much better. The chips reminded me of the kind you get in the packages at the movie theater. The cheese was also of that variety. The rest of the toppings were a bit odd, especially the lettuce which was soggy and too big for a bite. The best choice was probably the pretzel. I've had a good patty melt here before so I know they can do better but apparently they were slammed Thanksgiving weekend and it showed. I will say the staff was friendly and apologetic about their lack of inventory but this definitely wasn't a meal I was proud to have recommended."}
{"text":"I came here after touring Hoover Dam. I ordered the Tuna wrap, after ordering the server said I was in luck cause they were just making it fresh as I ordered. So I was expecting some real fresh seared tuna. I got the wrap to realise it's canned tuna. Beyond disappointed I actually laughed at the thought that I was expecting fresh, sushi grade tuna. The food is like any other bar food."}
{"text":"Stay away. Do yourself a big favor. They were overwhelmed with people on 2/17/18 so you automatically give them the benefit of the doubt. Our middle aged, brunette, tattooed, female server was the worst ever. I only describe her because she truly earned this review. She was outwardly annoyed with us. We literally weren't brought water or silverware. I got our own as well as chasing down sugar for those that had iced tea. I thought maybe we were in some kinda reality show. Like someone would pop out and go haha, we gotcha. Then, maybe we could all have a laugh. Boy was I wrong. What a horrible representative of this business. Total disdain for us. 

The beer and food, are just average and their guest taps were all recently sold out. Guess they forgot to remove an entire sheet of available brews. 

Too bad because this is a great location and could be awesome with better beer and staff that doesn't dislike their patrons. A real bummer experience."}
{"text":"Great local place to grab a bite!! Cheryl our server was great! Definitely recommend this place"}
{"text":"Ate here for the first time tonight. It was the 4th of July & the street looked like a ghost town. I'm so glad they were open.

They have the BEST \"dam\" chicken wings I've ever had! My daughter said her turkey burger was really good. Also ordered the artichoke spinach dip. Will forgo that next time. The chips just weren't right.

I will bring my husband next time. The wings are that good!
Service was a little slow, but chalked it up to them being busy due to no one else being open."}
{"text":"Very nice place for great beer, food and music. I see a couple of negative comments about poor service but that must have been an exception.  Been here 3 times in past 3 months and nothing but great service.  The food is always delicious and the outdoor music venue is perfect for a cold beer."}
{"text":"Not sure what some of the other reviewers are drinking! The Beer here is just AWFUL, and I Mean AWFUL!!! I tried all of the beers on tap, and they all had a very off flavor, and all were nowhere true to the style they were supposed to be.
And my flight of beers was pricey.
There are so many better breweries in the Vegas area, but I guees if you live in BC this is all you have. But it is just not a place I could ever recommend, just really BAD BEER!!"}
{"text":"Beer is good , everything else is not worth your money.  Appetizers ok, burgers less than mediocre, service slooow as molasses.  My coke never arrived. Ketchup on the table was empty . No salt and pepper on the table and the burgers could definitely use some. Disappointing experience."}
{"text":"This place really rates 2.5 stars, but I'm rounding down because I had high expectations (as I always do for a microbrewery). We popped in on our way back to Vegas from the Hoover Dam while we were exploring Boulder City. Boyfriend and I both tried the High Scaler IPA (meh, lacking in flavor, but drinkable). I had the pretzel with mustard and cheese (pretzel was good but not made on site and the cheese was from a can) and boyfriend tried the stout which was better than the IPA.

I will say that it was nice to sit in the sun on the patio, but we have hard winters in NYC and  the southwestern sun is awesome in the winter. I imagine in the summer that patio gets less use."}
{"text":"Stopped in here after our Hoover dam tour. Awesome! The food was outstanding, the beer was excellent, and the music was mellow and not too loud for conversation. My husband had the taco salad and loved it, especially the spicy salsa. I had the Thai chicken salad, and it was also excellent. Sweet and spicy blended well together. The sliders were delicious, and more than enough. The coleslaw and the french fries were unique and good, as were the onion rings. The fried cheesecake a la mode is also delicious. The staff is very friendly. If you are in the area, you can't go wrong stopping here."}
{"text":"Improvements on the food would garner 4 stars. 
Great cold cold beer. 
Patio offers a good feel for the charm and history of the area. 
Super staff."}
{"text":"Waitress was a complete idiot and couldn't answer simple questions like how are your wings cooked nor did she bother to go find out for me just said I don't really know and left it at that. She also couldn't tell me how much a beer was (the menu didn't say) The beer menu is out of date I ordered a kind they didn't have anymore again the waitress didn't know this until she went to go get it and it wasn't there. Food was horribly unsatisfying. Not sure why people like this place it left much to be desired."}
{"text":"I loved the beer and pretzel was excellent. Kids loved chicken fingers and said mac and cheese was fantastic. Asian salad was really good. Burger looked like someone had stepped on it. I had patty melt on marble rye bread. It was good but onions and mushrooms made bottom bread super soggy which made the sandwich kind of gross but still tasted decent.  Waitress was fantastic and friendly. Atmosphere was ok and bathroom was kind of messy."}
{"text":"Great micro brew.  Dam!

The Blueberry Bock was my fav, as Daniella S. (hey, great name!) says below, it's not too sweet.  I didn't think it was too fruity.  It left me wanting more.  Second favorite was the High Scaler IPA.  I thought it tasted like grapefruit juice but I LOVE grapefruit juice.  Third favorite was the Stout, it was dark and chocolatey.  YUM!

The food menu does leave a lot to be desired (not much for vegetarians) so we got our dinner at Carlos' across the way.  If you're into \"pub grub\" it'll probably suffice.  Ask for popcorn and they'll bring out some salty yellow evil stuff in a basket (tasty but probably really bad for you).  The pretzel appetizer was delicious -- huge, fat and salty.

We'd definitely come here again if we ever pass through these parts.

p.s.  Really resonable prices.  So cheap it's scary.  (At least by L.A. standards.)"}
{"text":"Great food and good beer. The whole town is such a cute and refreshing change to get the Vegas off of you."}
{"text":"We sat outside on their cozy & semi industrial patio.
I can't comment on the interior too much as I just popped in to use the ladie's room, but they were clean & sufficient.

We had a couple of beers & shared the Ploughman's Lunch.

I had the Blueberry Bock, which was yummy.  I think I'd like to layer it with their stout the next time.  It was a bit too fruity for me, but not too sweet.  My husband had the stout & rated it a 7 or so on a scale of 1-10. 

The Ploughman's left something to be desired...
The cheese selction was your average supermarket cheddar, colby-jack & pepper jack with a few chunks of water logged apple, salty tasting grapes & pale, uncrusted bread.  There was no pickle served as mentioned on the menu.  I was fine with that, as I suspected that it might be a deli type pickle & not the proper English style pickle as it should be.  I may have been expecting too much, but when you have a small menu I feel you should be able & willing to do it well.

I would go back for the beer & try something else food wise, but maybe move onto Milo's Best for their eats..."}
{"text":"The beers that they brew are very average, at best.  I ordered the sampler and found none of them worthy of a purchase for weekend drinking at home.  They do have a nice non-self selection on tap, however, which makes it a nice spot to try some new beers in the area.  But they have a huge patio which just gets them to 3 stars."}
{"text":"The food is great, the music is great, the brew is great and Emilio is AWESOME! They have an awesome selection on brews and I had an amazing blue cheese burger. Everything was fresh and good quality.  Emilio the bar tender was really nice and when he had a minute would chat with me. I highly recommend this place."}
{"text":"I had the BBQ bacon cheeseburger, and I was pleasantly surprised. It was a pretty solid pub burger! I don't drink but I would come here for dinner if I happened to be in Boulder City. It gets a little crowded on busy nights but I would like to try the other burgers."}
{"text":"Great food and great drinks. Owner came by and explained his beers as part of Sin City Brew Tours.  Can't wait to come back."}
{"text":"This is a cute little brewery. I know I said cute and little, but it really is! Aside from it being far from Las Vegas, but I'm willing to drive or ride in this case for good beer.

I got their coffee stout (forgot which one it was) and it's really light for a stout. It was a pleasant experience, but definitely when you think stout you're thinking heavier types, but this was definitely not heavy. We were on a time crunch so only one beer for me otherwise I would have loved to gotten more. Honestly I probably should have gotten a beer flight to try all of their beers. 

Food....well....it was decent honestly. I got sliders with this jalapeno pineapple cream cheese (I forgot what it's called) and it was pretty decent. I really enjoyed the jalapeno pineapple cream cheese, haha that was why I picked it really! And I also got the pretzel with beer cheese. The pretzel was typical and so was the beer cheese. It was overall pretty good for a small brewery. At least they had food! Some don't even offer that option.

Service however was pretty much a let down. They didn't have enough people working on Veteran's day. If they had one more person serving it would have helped them a lot. Considering how many groups came in to check it out. At some points we were able to go get water or cups or whatever we needed on our own. We understood it was a busy day, but it's a holiday, there should always be an extra person for holidays!"}
{"text":"Love to come here for some great food and beer. (philly cheesesteak is my fav) but everything on the menu is great. Nice atmosphere and outdoor area as well. Fun spot."}
{"text":"The food is fairly priced. Beer is excellent. Service is terrible 100% terrine. Food is tasty."}
{"text":"Give this place e a try, there brews are tasty and there food is as well. Had they had logo tin signs for sale, they would have gotten a 5 from me. So even though I can't mark 4 1/2 stars, that would be my rating! The staff and owner are very personable and are on top of things"}
{"text":"Pretty decent homemade beers. A friend we were visiting collects micro brews so she asked us to stop here for a growler. I had no idea what a growler was. I thought it was the name of the beer, haha. Turns out, it's the glass bottle the beer goes in. They have 7 different brews that they make in-house. Then they have 2 or 3 that rotate from \"special guests\". We tried the special guest IPA one....mad strong but way to bitter for me. I tried the house special mix which is hereneause (yea, I have no clue how to spell it) mixed with cider. It was OK. The prices are OK. They serve food here and the staff (except the bartender) were super friendly. The bartender did not seem to care for us....damn loud ass NYer's...(even though I've been out for a while, people still hear the accent). If you are passing through to go to the dam, or AZ, and like beer, I'd suggest stopping here for a drink. It's not a place that I would just drive 30 miles out of the way for. I dont like beer that much. Good food on the other hand, I have and will drive far. (back in my vegan days, 60 miles ONE WAY for dinner....worth it!)"}
{"text":"I'm not sure what has happened but the food certainly didn't meet the expectations of our family.  The Reuben was inedible!  The meet so tough you could not cut it.  The Patty Melt over cooked with no caramelized onion and a horrid addition of mushrooms.  Spinach dip...also inedible.  What happened, we used to love you?  We didn't ask for a refund but the waitress surely saw the untouched food and should have inquired about our dissatisfaction.   Please return to your former glory!"}
{"text":"No pizza here, but they have a good flatbread appetizer and good burgers. Service was great!"}
{"text":"A group of us went there this past Saturday evening as we have often done.  The service was bad, restrooms disgusting, didn't recognize any of the staff and on top of all that my friend and I split a patty melt and got food poisoning.  Her husband called the owner/manager and he hung up on him.  Don't know what is going on with this place but it was a place we really enjoyed and we will never go there again.  STAY AWAY!!!!"}
{"text":"This could be a really neat place came in to give it a try love to support the local businesses has been a few years remembered I didn't like before but couldn't remember why staff isn't friendly and very slow service in fact after we got our food never was checked on again and I understand it is a brewery but the food was not good either stale chips canned cheese dip had to hunt our server down for the check never was offered another beer or refill"}
{"text":"Boulder Dam was the most out of the way brewery that we visited in Vegas. Located about 30-35 mins away from Vegas itself. In the Bay Area, that could be as little as 5-10 miles. Out here on the wide open roads, it seems like FOREVER! Then again, there is plenty of tourist and tour bus traffic on the highway that runs though Boulder City, heading to the Hoover Dam.

I like the grounds outside where you can enjoy your beer. Although I'm not sure how many months of the year you're able to actually enjoy the outdoors in the desert. It was certainly nice in the mild October weather. They do offer beer shades to hide your beer from the sun, but mine usually doesn't last that long. I would be more concerned about myself keeling over from heatstroke. 

Seems there's a lot of locals that enjoy this place on their lunch break or as part of their after work routine. The staff at the bar treats everyone the same regardless whether it's your first time, or if they know you by name. That is sometimes a rare thing.

We got the sampler as we always do. Theirs is called the \"six-shooter\" and arrives on a cool lil tray. Too bad it doesn't resemble a six-shooter in any way. 

The beers were all uniformly \"okay\". None of what they had on tap was anything special. That became even more clear once I ordered the only non house beer they had on tap. The Golden Road IPA was light years ahead of Boulder Dam's version. The Hefe was pretty good, but to me all Hefe's pretty much taste the same unless it's terrible. Theirs was good so I'll give it that.

Don't fall for the temptation to try the complimentary salt scrub in the restrooms. It is rough on your hands and leaves an oily residue behind. I tried it so you won't have to.

I wouldn't go out of my way to visit Boulder Dam. However, if you are on your way to or from the Hoover Dam, it may be worth a pit stop to get some liquid refreshment to beat that scorching desert heat."}
{"text":"This Brewery is one of the coolest breweries in a authentic community that is clean and inviting! Their beers are one-of-a-kind! Everything from heffeweisens to stouts!
I can't wait to come back!
We got lemon pepper salmon on a salad that was amazing! They've also got lots of beer swag!"}
{"text":"Tried several beers, they were good, but we have high expectations on craft beer being from California and having a continuous supply of high quality, microbrewed beers.  Boulder Dam Brewing might get better as time goes on and recipes are changed around for different taste structures or as better ingredients become available, but they are on solid ground with the location and the friendly helpful staff.  

Food menu was kind of limited, the Chips and Salsa was good, but not a lot of choices."}
{"text":"Really great food. Nice menu and good burgers.Everyone is nice, helpful and knowledgeable. Their beer is good if you like IPA's. I really enjoyed this place until they ran out of Amber. Then, well, they haven't replaced it in more than 3 months. So the problem as I see it is when you live less than 5 miles away from a place you like  you probably want to go back again And again to eat and drink your favorites . Now I have to stop in just to see what they brewed and so far , I just walk out. I have voiced my opinion to the staff and they say they always relay this stuff but the owner doesn't respond to the customer feedback . It's a shame. 
The world is full of empty buildings because of hard-headed owners who think they are right and the customer's a fool. Look for a change in ownership."}
{"text":"Best fried mushrooms!! Great food and great beer!  Bruce was a great waiter and made us feel welcome!"}
{"text":"Nice outdoor patio and an open, well presented dining room with the kegs in the back.  Beer is alright.  Not the best and certainly not the worst.  It's not Nor-Cal or San Diego style, but decent brew.  I would definitely come here again."}
{"text":"We were at Hoover Dam with the kids and asked the guide for a recommendation. He said the Boulder Brewing Co had great burgers. He was right. 

We had the Papa, the BBQ Bacon Cheeseburger, the Party Melt and the Bluey. They were all great.  Fries were well made. Good beers as well. Prices are reasonable."}
{"text":"My family and I just stopped here on our way back from the Hoover dam. The food was great across the board & the beer sampler was just what we needed on a hot day!!"}
{"text":"This is a great little stop to or from Hoover Dam. The food is the best I've had at a brewery and the beer even better!! Service is excellent and there are plenty of tvs to watch any game going on. Located in Historic Downtown Boulder City Nevada."}
{"text":"We had a cool, enjoyable respite on our 110-plus degree journey to see 1) the haunted hotel next door and 2) Hoover dam. It was cookin' while we were bookin' the day we stopped in. We were two fried fritters/poached peeps/crispy critters/roasted meats and were disappointed not to see any menacing spirits at the adjacent hotel. So what do you do when you're dispirited (yes, I said it) and facing the possibility of heat stroke in Boulder City NV? You walk into the just-right coolness of Boulder Dam Brewing Co., pull up a chair and order some beer! D'uh.

I opted for the Awesome Blossom IPA and the Huzby went for the Squatters' Hops Rizing IPA. After two sips of my Blossom I realized I liked the Rizing better. So the Huzby and I traded and mixed things up a bit, ordered another Rizing, some chips and salsa and we settled in for a spell watching the fascinating (from many standpoints) documentary on the building of the Hoover Dam made in the 30's. Truly a gem.

The Rizing was very good. I don't really know the proper brew jargon, but it went down easy, tasty, and with just the right amount of fizz. The chips were bagged but fresh and the salsa, we were told, is made by a local. It was very good--spicy but not SO spicy you couldn't wolf down your dipped chips and chase the corn mulch down your throat with a healthy swaller of hoppy liquid amber. A perfect, midday recovery from the furnace outside.

And let it be known: Mike, the bar dude, is super personable, helpful, interested and interesting. He made us feel very welcome and got us filled in on some local lore. Thanks, MIke. It was good to meet you!

Special bonus: They had some some adorable onsies in a variety of sizes, so we scored a pink and blue one for my brand new niece and nephew. They say: \"My parents like beer, that's how I got here.\" Self explanatory, one hopes. I've included a picture with the beer accompaniment."}
{"text":"I'm not a beer lover, but I love coming here for the great atmosphere and good food. When the weather permits, their outdoor patio is the best place in town to sit back, relax, waste away a couple hours and listen to some live music. But when you sit inside, you also get the feeling that a lot of love really went into the design and creation of this place. The old posters and newspaper clippings about Hoover Dam - all the little details - make it a lovely spot to spend time.The father/son team that created the brewery definitely put their hearts into it.

 It would get five stars from me if they bumped up the menu variety. Their onion rings are phenomenal, and the bratwurst and grilled chicken sandwich are yummy, but I wish there was more to choose from. (I suppose, being a brewpub, the food's not exactly the star, but it would help out us non-beer people.)"}
{"text":"I am not a fan of this place. You're typical greasy hole-in-the-wall bar, yet it's a brewing company. We tried the 6 Shooter sampler and I found one beer I liked and my husband found none. Service is a little slow, but not bad. We ordered the chips and queso and the Bavarian beer pretzel. Queso right out of a jar and I believe the pretzel was pre-frozen. We split Pub chicken salad and it was decent. 
I was expecting a little more out of a brewery, but I guess this is what you find in a small town."}
{"text":"The only reason I am giving 2 in place of one star is for  the food and service, as I only tried the beer I cannot rate the food and will give them the benefit of the doubt.

I had stopped in here back in 06 or 07 and the beer was weak and had no depth.

After seeing it got best microbrewery in 09 by the RJ and the fact I see it when I eat Milo's Wine Cellar (which great  place by the way) I decided to stop in and see if they had improved their beers.

I got their flight which was only $10 so I could sample all six of the beers that they had on tap currently.

Belgian Wit- this beer was ok, it was relatively weak on its flavor but its body and color were spot on.

Hef- Their Hef was about the same as the Wit, it had little flavor  it should but they had mastered the look body of the beer.

Oktoberfest Marzen- This beer was a severe dissapointment.  Its flavor was bad...I would not try thid beer again...ever. 

IPA- This beer was pretty good...they nailed the IPA flavor, body, and color, etc...its can always be better but this IPA would order a pint of if I ever were back (which I prob wont be)

Caramel Choc Stout- This beer was horrid.....don't know what type of caramelization they did to the hops or extract they used....but it completely ruined this beer. I could barely finish it. Almost reminded me of a German Rauchbier.

Lobotomy Bock- Yet another beer that had no flavor to match its identity...I could barely finish this sample either...

If you are a bud light drinkrt this place with probably seem like heaven for you. If you drink real beer with flavor and attitude or even just expect beers to have flavor and not seem like flavored water...this place will make you cry.

The bartender was very polite, courteous, and quick despite the fact he was very busy so a + for customer service."}
{"text":"Went to this place to get out of town on a really nice weekend and it's a go go go! In Boulder City on your way back from the dam it's a great food and the outdoor patio is a place. Definitely try the hef!"}
{"text":"Came here on a Sin City Brew Tour. Great experience. Enjoyed the beer and really liked hearing from Todd about his brewery. Really cool and informative. Impeller was really good, not too hoppy. Cool place."}
{"text":"Came on a Saturday lunch time. Decent beer but only okay food and very slow service. Prices are reasonable."}
{"text":"Wednesday night atmosphere was wonderful. Service was great and they made sure they answered all our questions. I loved the flight of beers in the hoover damage shape. My wife finally tried something outside her comfort zone and she loved the salmon croquet burger thingys. It was great pub food and exactly what we were craving! Beers were awesome too! Not to loud and great patio area for dogs or families."}
{"text":"Stopped here on our way to Hoover Dam. The beer is fantastic and they have a whole page of selection that is brewed in house. The fried mushrooms are on point with the garlic aioli sauce. The pub quesadilla was good but I didn't anticipate there being so much meat. I got it for the black beans, corn and cheese and it's got a lot of angus beef. The homemade salsa, not sure I've had anything like it but it was good as was the queso. Great little stop!"}
{"text":"The staff was rude and the food sucked. Also the beer ALL tasted watered down. Avoid!"}
{"text":"Great beer after a long hike in Lake Mead. Pretzel was the best I've ever had. Awesome place! Awesome people!"}
{"text":"First and foremost thank you Jennifer for your kindness and awesome service. Yummy pretzel. Club sandwich with turkey was filling and delicious. The fries were the only downside. Maybe serve kettle chips instead. The fries were soggy. Otherwise all the employees and Mark the manager were wonderful. Great selection of beers especially the IPA'S. go out to Boulder city take a chance nice change from vegas. Thanks again..."}
{"text":"After reading Alick's review of the Boulder Dam Brewing Co., I have to agree that this is possibly the best brewpub in the Vegas area, which is going to get some ire up, but let me help explain my reasoning.

Most of the brewpubs in Las Vegas,  are based in or around a casino. By locating itself in BC, it is not having to compete with video poker machines. It has a large patio area that makes it great for you to enjoy the weather, the bands and it helps dissipate the smoke of others.

Bottled beer selection is slim, BDBC has a limited variety of their own home brews and I tend to get a little bored, but they are consistent and they offer a Hoppy Hour M-F from 4-6.

The staff here makes me feel like I belong here. I enjoy watching games here on NFL Sunday. However, the food leaves something to be desired. The menu is limited to sandwiches, burgers, hot dogs and appetizers. Sorry! On Sunday's I do not want to start my first round of games with a hot dog. Let's get a little more outside the box with the food and some of the seasonal beers. 

Live music at night and a front row seat for the endless parade of HS kids cruising the \"loop\" means that the BCPD is always around trying to keep everyone from having fun, but it really is more like Barney Fife than a real police force.

Being a fourth generation resident of BC, I love the history they display of the building of (Boulder) Dam. Old newspapers, photographs and antique equipment is great. 

If I could give this place a 3 and a half stars, I would. I had to think hard about the rating. I want, WANT, REALLY REALLY WANT to give this 4 stars, but the lack of variety of food made me go to 3. I am very sure, that if they start caring more about food, this place is going to really blow up."}
{"text":"Damn good!! Boulder Dam brews! Delicious cold brews! Service was excellent (go Bruce!!) and so was the veggie burger with coleslaw. Can't wait to visit the Hoover Dam to have an excuse to stop here again."}
{"text":"I had Boulder Dam Brewing Co. bookmarked for a long time, so we finally decided to venture to Boulder City to check it out.  I seriously doubt that we will be back.  While the beers we tried were good, the food was awful, and the service was lacking.

Let's start with our arrival.  When we got inside, we were told that there were no tables available because two large parties had reserved them all.  You would think that they would have a 'Closed for Private Event' sign posted if all the tables were reserved.   There were also no stools available at the bar, so we were about to leave when were told that we could take a round table that was pushed right in front of the bar because the large parties would not be using it.  They found us a couple of plastic chairs and we claimed our table.  It's a little bizarre that they use outdoor patio tables and plastic patio chairs indoors.  I saw lots of food going through the large gaps in the basket weave table tops.

Beer: It was hot out so we tried a couple blends that sounded refreshing.  The Shandy $3.00- was half powder monkey pilsner & half lemonade. The Rattlesnake Bite $3.50- was half powder monkey pilsner & half hard apple cider.  Both were 'dam' refreshing.  haha.  This was the highlight of our visit.

Food: Papa Burger (no bun) w/ side salad $9.95- the salad was pretty pathetic: lettuce, shredded parm, 1 tomato wedge & red onions. The menu says that the burger is \"1/4 pound Angus patty topped with cheddar cheese and smothered in our thick, rich chili\".  Let me tell you, it did not taste better than my attached picture looks.  I don't think I would have fed this to a dog.  The chili was dry and didn't taste like much besides old & burnt and I seriously doubt that the patty was 'Angus'.  I took one bite and could not take a second.  It tasted like fat & grease & gristle.  It was inedible IMO.

Patty Melt w/ potato salad $9.45- 1/3 pound Angus patty on marble rye bread w/ Thousand Island dressing, Swiss cheese, sauteed mushrooms, and onions.  This patty was also less than desirable, although it was slightly more masked by all the other items on the sandwich.  However this one was difficult to choke down due to mass amount of grease coating the bread.  Potato salad was not great either, but it was better than the two entrees so I will leave it be.  

When our server cleared away our largely uneaten plates he didn't ask if there was anything wrong with our meals or even if we wanted boxes, so we didn't offer up comment.  I think they just wanted to turn the table.  We were still hungry after we left and stopped at Dairy Queen for Blizzards to cheer us up. :)"}
{"text":"My family visited this location while we were exploring Boulder City. I have a tricky diet, so I was very happy to see that they offered a vegetarian burger. Once we sat down and ordered our beers, we received them relatively quickly. I ordered a honey cider which was absolutely delicious. My fiance ordered the sampler, and there were quite a few that none of us were a fan of - mainly the pilsner and the rattlesnake bite. However, the rest of the food and beer was good. It did take a while to receive our food and receive the check, but overall the service and food was good. I would recommend to others in the area!"}
{"text":"Speaking as a beer lover, you can do better.  While the beers are relatively clean, they aren't that interesting.  There's a lack of malt depth and complexity in them, although so .  I tried the sampler and while nothing really stood out, at least they all were stylistically close.    Had a Vegas dinner date, so snacked on the chili cheese fries, which were somewhat greasy and the cheese was big can nacho sauce at best.  Service on a pre-Christmas afternoon was attentive, but we were about the only folks there as the regulars (I'm guessing) trickled in."}
{"text":"Family drove up to BC to celebrate my mom's birthday.   Loved the live music and outdoor seating.   Ordered drinks and small bites.   The nachos were amazing, however artichoke spinach dip was gross.  It looked like a bowl of oil.   We didn't eat it.  The beer queso was good until the cheese set and got cold.   

We had a great time and will be back."}
{"text":"My wife and I went across the street from our hotel (Boulder Dam Hotel) to enjoy some beer after dinner.

We grabbed the samplers of 6:

BYPASS BELGIAN WIT - didn't like this one.
POWDER MONKEY PILSNER - OK
HELL'S HOLE HEFEWEIZEN - light and crisp.
HIGH SCALER IPA - I'm a suck for IPA. This one is light on the bitter note and high on the hoppy fragrance!
BLACK CANYON STOUT - a bit weak
RATTLESNAKE BITE - a cocktail of 1/2 Powder Monkey Pilsner and hard cider. My wife liked it, but not for purist.

Overall, the beers were OK. They were mostly a bit light in body and lack depth in flavor. Maybe they were made for the warm weather in Boulder City. Not my preference.

The night was cool(er) as was the blue grass band (Out of the Desert?). We thoroughly enjoyed the night, even if the beer was not great."}
{"text":"Since I've stopped here so many times from my first review, it's time for an update.  The food is generally good.  Sometimes a bit off but most times it's quite good.

Today we stopped in after hiking and I got the special of the day a Dam Turkey sandwich.  It was warmed turkey slices (lunch meat turkey) with bacon, lettuce, tomatoes, and sautéed onions on your choice of bread.  It came with a choice of freis or cole slaw.  The sandwich was very good.

The place was not busy at all but we waited for longer than we should have.  However, during the wait, we had plenty of time to discuss next week's hike and just enjoy our drinks.

I'm sure we'll be stopping in again before it becomes too warm to hike at Lake Mead."}
{"text":"We came here hoping for a nice lunch after a hike down by Lake Mead. 

The appetizers we ordered were great. Of course its hard to screw up deep fried anything.

The overall service was very SLOW!! Our entire dining experience took just over an hour and a half despite the restaurant being near empty and our table knowing nearly immediately what they were going to order.

We ordered water for our two sons and they didn't receive it until after they had finished their meal, despite asking multiple times.

Upon receiving our son's waters from one of the hostesses who apologized profusely, our waiter came over and actually made sure to tell us it was her fault and not his. He was a jerk and should be fired for his lack of professionalism YOU ARE A TEAM, YOU WORK TOGETHER TO MAKE YOUR CUSTOMERS HAPPY.

We had four burgers at our table and four different size hamburger patties. My wife and I shared a burger that was supposed to have been 1/3 pound and it can't have been more than three ounces of meat, our friend had the same exact burger and it filled the bun. The two other burgers ranged in size between these.

Go here if you want a unique beer but steer clear if you are looking for a nice meal as you'll only experience slow service and jerk waiters."}
{"text":"We got the fried pickles for our appetizer. They were weird. The breaking didn't stay on and was tasteless. So basically you were eating a hot, wet pickle! My burger (brewpub burger) was pretty good. Asked for medium and it was completely raw and wet inside. I order burgers all the time and know what a burger cooked medium looks like. Fries had a stale texture and were not good. The beer was good, nothing to brag about, but good. Server was nice."}
{"text":"One of the first things we did once we got into Vegas was drive down to the Hoover Dam. On the way back, this Mircobrew sounded good. 

The atmosphere is nice and brew-ish if I can say so. The special was pulled pork nachos. Wow, those were some awesome nachos! The flavors and good cheese on them made them great. This is a definite must try if your here. 

For a drink I ordered the sampler. It seemed reasonable to try all the brews (the sampler came with 6 of them). These came in a Hoover Dam shaped holder and the glasses were actually good sized. They definitely had some good brews there. My personal favorite was the Hefewiezen. The sampler was a great price. I would definitely go there again and I was so impressed with the beers I had to buy myself a beer cozy just to remember it. 

Wait staff was awesome too. 

In short, order some good food and drink some good beer and enjoy!"}
{"text":"Great burgers, great beer, excellent onion rings.  What's not to love?  Service can be a little slow, especially if they are busy, but the beer is enough to take the edges off of any frustration.

Best Dam burgers in town."}
{"text":"Since the last time I was here, the menu has changed; however this change is not for the better. The service is prompt and wonderful. The reason why 3 stars, instead of 4, is because there is a pile up of dishes and trash in the main eating. It isn't always pleasurable to eat next to a pile of trash and dirty dishes. Being under age, I did not try the beer, however I hear it is the best in town. If you want a good beer, this is the place for you."}
{"text":"We were in town from Massachusetts on Saturday mid-day and we are real beer fans. This is a super quaint little brewery and our server Taylor B was so busy, but she was very attentive, knowledgeable, and helpful on her beers and food! Thank you Boulder Dam Brewing Co. for wonderful drinks, food, and service!"}
{"text":"My husband recently took me to Boulder Dam Brewing Co. for dinner on a Friday night, we wanted to try a place we hadn't been to in a while. It had been a few years since my only other visit to the brewpub and I didn't really remember much about that visit...

Since it was a Friday night there was live music, but nothing worth writing home about. The guy covered a couple songs I love and really didn't do them any justice, but other songs I didn't recognize didn't sound too bad... 

The menu is pretty limited, it's basically appetizers, burgers and sandwiches. As another reviewer said, go for the beer not the food. Only I am not a big beer drinker, oops? My husband tried one beer, didn't care for it. Asked for something darker, but they didn't have anything. A brewing company with no stout to offer? Absurd. He ended up getting the guest brew and was happy enough with it.... 

For dinner I had the tuna salad sandwich. Talk about an uninspired, boring sandwich. It came with fries, which I asked for a side of ranch with when I ordered, but had to request again. My husband had the chicken burger (which is actually a grilled chicken breast sandwich and not a burger) which he was kind enough to let me taste, and it was quite good, nice and juicy not overcooked and dry. 

Our meal wasn't expensive, but it wasn't anything special either. I wouldn't want to come back for dinner, but it's an ok spot for lunch or a beer, hopefully they have the type you want!!"}
{"text":"I really wanted to like this place. Despite reading a lot of recent negative reviews, I was optimistic I would leave here with some positive things to share. Unfortunately, that is not the case. 

We were seated immediately but waited at least 15 minutes for anyone to acknowledge us at our table. I had to flag down a waitress to get drinks. The beer that I ordered was not available, as were several beers, but there was no indication of that. It took another 10 minutes or so to get our drinks. 

We ordered food which was mediocre at best. Our waitress did not come over once to ask how our food was. When we finally ordered a second round of drinks, we waited another 15 minutes for them to arrive. Assuming it would take a long time to get our check, we requested it immediately after getting our second round of drinks. Our check came right away and suddenly our waitress kept coming back. 

I'm all about leaving positive reviews on Yelp and almost always do. This place has so much potential but was absolutely horrible. If you're leaving the Hoover Dam and looking for a cold beverage, just keep driving!"}
{"text":"Great patio seating and nice to be outside.  Beer was great, but service in general was super slow and food was average at best."}
{"text":"This Dam Brewing Co. We had a bartender, a middle aged gentleman, who was probably the owner. This guy was a hard-worker, flying around the place. This guy was nice to a fault. Why the fault? He told us that sometimes he gets light headed when he works and he needs to suck on a sugar packet to get him back on track. I really hope he's okay.

The beers? For better or worse, most of the locals beers were out. We tried the WTH Grapefruit IPA and Powder Monkey Plisner first. The IPA had a smooth flavor with no bitter aftertaste. It's no Deschutes Fresh Squeezed IPA but it is a very solid choice. Same with the Pilsner. Easy and smooth taste, good on a hot day. Refreshing.

Next two were gross. Hell's Hole Hefeweizen had a weird candy wannabe taste to it. I couldn't put my finger on it. Notes of cotton candy? Funky tap? Who knows. The Beyond the Pale Ale was super heavy on the apricot taste. Plus it was thick. Wrong beer for how hot it was. Then again, not sure apricot beers are really all the rage. It's about that grapefruit."}
{"text":"Four stars because this place has such a great atmosphere! Many things can make a bar a great bar. The food. The drinks. The people. etc... For Boulder Dam Brewing Co. it is definitely the people. My boyfriend and I went twice while in Vegas and both times everyone was super friendly.

The beers are nothing complicated. Solid and consistent. Good if you are a fan of that yeast character but if you're not then you may not be a fan of the beers.

The food also is pretty decent. I would recommend the pretzel and the wings. I'm also a big fan of the fact that smoking is only allowed outdoors. As a New Englander no longer used to smoking in her bars, this was a great break from the other bars in the area.

Stay friendly Boulder Dam Brewing!!"}
{"text":"What a great place! My husband and I decided to drive to Boulder City a few months ago and totally didn't see this place.. It's a bit up the road from the other restaurants. We decided to go back to Boulder City yesterday- and found The Boulder Dam Brewing! The food was delicious! We got the battered mushrooms and the Bavarian pretzel for appetizers - totally recommend! The mushrooms were perfectly breaded and crispy on the outside  ( my mouth is watering thinking about them ! ) the pretzel was huge with 2 sauces  I recommend the chicken wings and things- great sauce ! was not expected- a lightly spicy bbq ! Yum - I had a chicken burger!! Wonderful too!  
Bonus! They had Angry Orchard Cider on tap- which was awesome, as I always wanted to try it.. Fabulous!! 
To sum it up.. Nice family owned bar- friendly service, great food ! We will be back next visit to Boulder City!"}
{"text":"Not a bad place. Had the Hatch Burger . Yum.  Haven't tried and of the Brew  yet. Once I do, then I can fully rate the establishment. The staff is great, attentive, fun to talk to and food comes in a timely manner. Nice homely brew joint with good brew food. Side not: the nachos are to die for! Nom Nom. Eat and drink up!"}
{"text":"Q:  Why would one go to a brewery if not to drink?
A:   To eat of course.

Boulder Dam Brewing was the only game in town on Saturday at 11:30 that was not packed with people getting breakfast.  It was empty inside at that hour as they likely just opened.  My folks were in town for NASCAR weekend and I knew they would like to get way from the hustle and bustle of the city (Las Vegas).  So we spent Saturday in Boulder City and grabbed a nice lunch at Boulder Dam Brewing.  My step dad ordered the BBQ Bacon Burger.  I got the regular Pub Buger.  Both were impressive with the obiously hand formed patties, fresh toppings and a great set of buns.  He got onion rings while I stuck with fries.  Both were good though I think I  liked my fries better.  There are seasoned with garlic powder, onion powder and seasoning salt.  I make fries at home with a similar blend.  The onion rings were good and came with a dipping sauce that really woke up my taste buds.  I think it was Franks Red Hot sauce added to mayo.  I'm not really sure but it was hot and tangy.  The odd ball in our group was my mom.  She ordered a cup of broccoli soup and a dinner roll.  She said the roll tasted homemade and fresh and that the soup had fresh broccoli rather than frozen.  The quality here is second to none.  I know my step dad was disappointed with not going to the Coffee Cup as it was on Diners, Drive-ins and Dives.  A show he is a fan of.  His disappointment was quickly erased with our brew pub lunch.  All three of us were quite happy in our experience."}
{"text":"Not a bad place. If you are a beer drinker, this will be a great stop for you. The interior has a great brewery smell to it. The staff is super helpful and the food is pretty good. 

The burger to bun ratio is a little heavy on the bun, but I think the flavor made up for it. Try the Hot Dam Burger, it is flavorful, but won't make you cry. The fries were a little overdone, but were seasoned well. 

If you are in Boulder City, swing on in and give it a try!"}
{"text":"I ordered the Bruebon and the Corned Beef was very tough.  The fries and beer were good though.  Good service."}
{"text":"Nice place to checkout on a recent skip out of the Las Vegas valley. 

Sat at the bar and enjoyed 4 different beers between my husband and I. The bartender was super nice and gave suggestions and let us know what was on tap. Beers were good, adorable location, and the bathrooms had handscrub and were very clean!"}
{"text":"The four stars is for the beer only. Service & food is just ok. Beer is great! Loved the heffeweizen. Their slogan is Dam Beer - brilliant! Town has an interesting history. Very small restaurant but also has outdoor seating."}
{"text":"Very, very cool place. Brews its own beer and bad amazing guest taps - Lost Coast, Victory, Anchor, etc. Dogs welcome on the patio, which takes it to 4 stars on its own. Love coming by for beer, but food is so-so. Rest assured the awesome staff will bring a bowl of water for your pooch and everyone is always friendly. As long as I'm in southern Nevada I'll have a soft spot for this place."}
{"text":"Shandy was refreshing and delicious.  Craft beer mixed with fresh lemonade.  Went with my husband on a vacation/road trip.  Turkey club and fries were a perfect lunch.  Quaint brewery, quiet and great service and bar.  Recommended.  You can get small jugs of craft beer to take home!  Quick service.  Across from Hoover Dam museum which I also recommend."}
{"text":"The staff at this establishment was super nice, the service was quick, and it's sort of the only option on a Sunday night if you're headed back to Vegas. That said- I have a hard time accepting any business as a \"brewery\" that brews only from malt extract. Food was just fine for a bar but if you're looking for a great meal and a good local craft beer, you should probably keep looking."}
{"text":"Service is slow and horrible.  We ended up leaving because the hostess forgot we were waiting for a table. Didn't write our name down and seated others before us."}
{"text":"Seems to be the only genuine brewery in town. Beautiful outdoor seating and of course indoor and bar seating.

Came in only for the beers. Yesterday was their  local brew festival. Enjoyed their pekoe pilsner made with tea leaves. I got the wheat blueberry-vanilla guest beer. Both were excellent on these days we find getting hotter and hotter. There are taster sizes, too.

2 unisex restrooms. T-shirts for sale. Free street parking surrounding it.

Do your Yelp check in for a free beer/5$ off!!!"}
{"text":"This was a logical stop for us on a beautiful Saturday afternoon. My brother was in town and he loves trying new beers plus we were in the area checking out The Hoover Dam. 

We easily found parking nearby and walked right in to find a table on the patio. The waitress told us to choose any tables we wanted indoors or outdoors. There was a table that was partially shaded so we snagged that. 

The Beer Sampler immediately appealed to us since it would allow us to try a variety of beers. My husband and I split one since I was driving and my brother enjoyed his own. We all seemed to enjoy about half of the beers. None of them were bad by any means, but as far as beers we would order again there were about three. The Powder Monkey Pilsner was enjoyed by all of us. None of us enjoyed the Hell's Hole Hefeweizen. Something about the flavor of this beer was odd. I'm glad that the waitress warned us about being careful with the heat on the Chocolate Reaper Stout. I love heat, but found this one to be too heavy on the heat. It was a shame because the chocolate and cinnamon taste at the beginning was great. The heat actually ruined this beer for me.

Our waitress was friendly and was really trying to take good care of us, but the brewery was clearly understaffed. They really need more than one person to serve the patio on a Saturday afternoon. Like I said, she did her best, but for great service there should have been more servers."}
{"text":"Loving the home brewed beer on the patio waiting for the band to start. Amazing service with great food."}
{"text":"I tried the brew pub burger and the Tallulah beer tonight and both were delicious! Our waitress Hannah was knowledgeable of the menu, super efficient, and very friendly. Will definitely come back again for the great food and service!"}
{"text":"Have been here many times since we moved to Vegas. Always enjoy their beers and the food is good. The staff is always great and super friendly. We take our kids with us sometimes and the staff is always super friendly with them as well. Had my husbands surprise 40th birthday party here and everyone had a good time and the staff was on top of everything. Plus the owner helped me plan everything and was very patient with any changes, questions, etc."}
{"text":"I was a bit hesitant to come here because of some of the reviews but I was very pleasantly surprised. 

The beer is $4-4.50 for a pint. The interior is very nice, clean and welcoming. 

The Belgian Wit was amazing! Great beer. The Ocho Ipa was amazingly grapefruity and smooth, great beer. 

I did not have any food so I cannot comment on that."}
{"text":"Good beer, good food, good service, gotta give them four stars. Did the taster with six-5oz pours to see what was good. It was all good. Favorites were the Hefe, lots of banana and cloves and the Stout, smooth. Honorable mention are the Pilsner and the peach vice. Wondering about peach beer but it was not overpowering and refreshing. Not sure how a pint would be but the taster was good. Decided to hake home a growler of the Hefe. Only a short drive from Henderson and a nice get-a-way. Pretty sure we will be back."}
{"text":"In town for the dam and ate lunch. Service was a little slow and the food was fair.I had a quesadilla and the monkey powder beer. Beer wss the best part."}
{"text":"Waited 45 minutes and never got acknowledged by any of the waiters. Looked like good place oh well."}
{"text":"Good pub food and a variety of micro brews although it is hit or miss what they are pouring or what is still fermenting. Usually under staffed so expect an hour + for a quick lunch. Staff is easy going as is the vibe. If you have time to kill it is not a bad place to drink some brews."}
{"text":"Great place to grab a locally crafted beer in Smalltown USA aka Boulder City.  I would probably give 5 stars for the brew, but have to downgrade them overall because they always seem overwhelmed and understaffed.  If they could improve the grub/service, I'd drop by more often."}
{"text":"This place never disappoints. Whatever they have on tap is always good, sangria is yummy, and the food is great. We have been going here for years."}
{"text":"When you're there try the rattlesnake bite and a burger 
Been there twice took 3 of the one gallon jugs need to refill soon will be back Friendly  people very cool place"}
{"text":"First and for most it is important to bring attention to the aura the owner carried and the atmosphere he developed in his brewery. Being from Washington state you tend to pick up vibes of the like and it so turns out he moved from Seattle to Boulder City. He gets some of his hops from where I was born and raised which is the Yakima area, so of course I am going to appreciate his brewery that much more. My favorite beer at Boulder Dam is the Oasis IPA. It has an alcohol content of 6-7%, you can detect a very light sweet ting, and the perfect amount of hops. With the country music soulfully filling the background, I was able to carry a conversation with a fellow customer about Napa valley and the wineries around the lower valley of WA state. This is a brewery I will visit again either by myself again or with company. This brewery is not over priced and has amazing brews, very kind and personable staff, and attracts the same visitors. I had sampled 4 beers, had a pint of the Oasis IPA, and I was privileged to order their Queso dip with corn chips all for $17. I left the brewery beyond satisfied."}
{"text":"Tried wings, spinach & artichoke dip and other appetizers along with house beer. 

Good place to hang out.."}
{"text":"First off, a word about Boulder. It's funky, cool, hip, glamped, and way better than Vegas. And the brewery keeps that theme going as well. A nice selection of taps, from hefe to stout, all unfiltered and quite good.

Their food menu is on point as well with everything from naan bread to burgers. Bonus points for a beautiful outdoor beer garden so the fur people could chill in the vibe.

A real winner!"}
{"text":"Awesome! all said and done. It is a small place so don't get your hopes up but they have a great patio and sometimes the band is either inside or outside on the weekends which makes it a wonderful place to party with friends. They're also very dog friendly & will bring you bowl of water for your four-legged friend. Food is very scrumptious and they have a great selection of micro brews to choose from. They're also the ones to personally thank for the Boulder City Brewfest that occurs annually."}
{"text":"On the first weekend of October my tradition has been to hike the River Mountains Loop Trail from Railroad Pass to the Art in the Park Festival in Boulder City. The Boulder Dam Brewing Company is part of this tradition. Pychologically, Art in the Park is more than a celebration of art and food. It is a celebration of the end of the brutal weather that ascends the desert temperature to the triple digit and the start of months of beautiful weather. When I drink my traditional first weekend of October beer it is \"Cheers\" as I toast the cool weather.

   When I spend time in Boulder Dam Brewing Company, I am drinking a cold one (or two) in an establishment that is unique. Both the beer garden and beer pub have special qualities. This is one of the few beer gardens in the Las Vegas area outside of a casino property. It is a beer garden that seats eighty patrons. It is a beer garden that brings a cool nightlife scene to the City that Hoover Dam built. This is the sight of live music on weekend nights when the weather is peaceful. The beer pub is unique in its attention to creating a 1930s feel to the interior. Hoover Dam opened in 1936. Above the bar there is a mural of constructing the Hoover Dam. There are pieces of the equipment used in building the dam. There are lighting, seats, millwork, and artwork from the 1930s. What makes Boulder Dam Brewing Company stand out from several Las Vegas  brew pubs and bars is the missing video poker and gaming machines. Boulder Dam Brewing Company is in the heart of Boulder City where gambling is illegal. However, they make up for it with interesting trivia cards.

   Boulder Dam Brewing Company has been brewing beer since the late 2000's. The sign outside says established 2006 where their Web page states they opened on February 17, 2007. That is around eight Art in the Park weekends. Since they opened, they received a few awards including \"Best of Las Vegas 2009\" and \"Best of Nevada 2011.\"

   The heart of the business is their twelve tap system. They brew six different styles at a time. In addition they serve alternative beer, wine in a glass or bottle, pub food, sandwiches, and pub burgers.

   The paragraphs above paint a picture of this brew pub that I have visited during the last three Art in the Parks and with additional Boulder City adventures. It has usually been full during Art in the Park. After a few minutes of taking in the 1930s Era decor, a bar stool becomes available. On my first visit during Art in the Park 2013, I kept entertained with the trivia cards. The following two years I'd keep entertained with my phone and the tvs up ahead. Regardless that they brew their own beer, I order a Bud Light draft. Draft is a major reason I enjoy brew pubs. I am a beer draft over beer bottle person. On all my visits, the clientele were locals and tourists. I noticed that some of the locals are from Henderson and Las Vegas. Both the locals and tourists filled the brew pub with interesting conversation that was at an average noise level. Behind the bar, there has usually been two beer servers. Whenever I have visited the service has been okay. 

   During the last three first weekends of October, when I celebrate the beginning of months of cool weather at Art In the Park, The Boulder Dam Brewing Company is the right place for \"cheers\" as I make a toast to the months of beautiful weather ahead. With that said, this review is a Yelp toast to the end of the brutal weather that we have put up with and to the months of serene weather ahead."}
{"text":"What a find! Tasty craft beer--6 of their own brews and 12 guest taps--delicious food, and entertainment. Plus we had a rare treat of conversation with the brewer who was working behind the bar. Overall our beer critique was mixed, because on this visit we preferred the guest taps. But hey, $10 gets you a sample of all six house brews. Sweet deal. And fun. 
 
Food highlights:
- hand-packed certified angus burgers
- they roast their own turkey, which made the club sandwich delicious.
- hand-cut fresh potato fries

Large outside seating area perfect for groups."}
{"text":"This was a total let down for it was my last meal of my \"Las Vegas\" trip before my flight back East.

The staff didn't seem to enjoy their jobs.  My server was very cold and distant.  As a newbie I prefer to interact with the employees and get a feel for their favorite items on the menu.  This guy did not care to interact and help with menu advice, other than saying the special of the day was \"really good.\"  I personally would like a little more than that.

I am not a beer connoisseur, but being in a brewery, I felt the need to step outside of my traditional domestic beer ordering mode.  I ordered the Powder Monkey Pilsner, it was good.

I went ahead and ordered the \"special\" which was a barbeque sandwich.  The other person in my party ordered a simple cheeseburger, and ordered the chicken wing appetizer.

Meanwhile, soaking up the stale/dead environment of the BDBC, no chicken wing appetizer ever came out.  But, eventually and thankfully, our sandwiches arrived in a decent time.  He mentioned the burger was okay.  The barbeque made me wish I would've ordered a good 'ol American classic hamburger.  It was horrible.  Sloppity slop on a bun fo sho!  I couldn't even finish it, but I scarfed down the so-so french fries and gulped the pilsner, and out the door we went ... regretting our decision to choose the BDBC.

Choose wisely!"}
{"text":"Beer - Great !
Food - Not so much.  

Has always been this way since opening and seems to be a common theme from patrons.  You would be better off getting one of their Growlers filled with beer, take it home, and eat a PB & J."}
{"text":"What a place. I came here a few times when it first opened and was not satisfied, the burgers tasted like Costco preformed patties. I had not been back for about 1 and a half years and forgot why I did not like the place and came back. Well the burger has improved, it looks like preformed patties but they tasted good. The service though was abysmal, when I came in the waitress was cavalier about where we sat. When we sat down the waitress and here cohorts snickered and gossiped right next to my table. My water was empty and they did not ask me if I wanted a beer after the rest of my table ordered, they forgot me. After we ordered we waited an eternity for our food to come and 2 of our pretzels were cold. Also when we were there the live band was setting up and they blew out our eardrums with sound checks that were giving feedback. Not a good atmosphere, not good food, and not good service. This all culminates into a 1 star review from me. I will not be back."}
{"text":"Stopped here with some friends after doing the traditional \"Let's go see the Hoover Dam while you're in town!\" tour.  We each had a beer, and we shared some spinach artichoke dip. The dip was fine, nothing special, pretty much what you'd expect. Not sure I'd actually order more food here, unless I was really hungry.

But I'd definitely stop back in for more beer. I had the Rattlesnake Bite, which was half pilsner and half hard cider. Yummy. My friend had the Golden Cream, which was their stout topped with vanilla ice cream. Also yummy. And my boyfriend had the Hefeweizen, which he enjoyed as well."}
{"text":"Very poor service! Waited for over an hour for out food. It was NOT busy at all. Food was subpar.... definitely not worth the wait. We had 5 refills of ice tea before our burgers, a hot dog and a salad was delivered. BBQ burgers with NO BBQ. Had to ask for our appetizer of wings to be delivered. Will never go back!"}
{"text":"One of the better pubs in the area. LOVE their beer and the food is wonderful! I do recommend this place."}
{"text":"Great looking place
The beers were incredible 
Food was above average 
Priced reasonable"}
{"text":"Not a lot of vegan options to eat (I think I got fries), unfortunately.  But the beer is pretty decent (although the IPA was not quite hoppy enough for my taste), the staff is very nice, and they are DOG FRIENDLY! yay! 

I dropped my folks off at the Hoover Dam, and brought my dog to BDBC for a beer or two on their lovely patio while the 'rents did their tour.  

Lots of space outdoors, perfect for a group of friends w/ multiple dogs!"}
{"text":"I'm going to give this place another chance in the near future, because it was so highly recommended to me. Maybe I was there on an off night or maybe they really don't care about the quality of the food they are serving and are more focused on their beers. I don't know.
The service was a little slow.  It was kind of weird because it was a Saturday night around 7pm and there was hardly anyone in there.  My server, the bartender, was exceptionally nice and seemed to be on the ball. I hate to make this all reflect on him. But service shouldn't have been that slow for how not busy the place was.
To be fair, I'm not a beer drinker, so maybe I don't \"get\" the brew pub experience.  I ordered wine. Just a basic house wine. It was pretty nice for the price. No complaints on the wine.
Wasn't that hungry so I ordered an appetizer. This is where it all went downhill.
Ordered the spinach/artichoke dip.  First off, it took a long time. When I got it the dip was barely lukewarm.  Worst part, there was less than 1/2 cup of dip and what looked like a whole family size bag of multi colored tortilla chips dumped on the plate around it. And it tasted just okay. 
Dear Restaurant/Brew Pub Proprietor: Dumping a huge amount of  chips around a miniscule amount of dip isn't fooling  anyone, in fact you bring attention to the fact that you went cheap on the dip. Having worked in the food industry forever, I could cost out that dish and prove that a little more dip and far less chips would be more cost efficient and would be better for the customer. Just sayin...
Also I agree with some of the other reviews here. There is no one to greet you when you enter. Not even a \"Seat Yourself\" sign. Very confusing.
The music there is amazing though.
Make sure to catch the Chris Bell band when they play there. Really good."}
{"text":"Love the different types of beers and enjoy the music. Good and friendly service too."}
{"text":"Good beer, good food, great atmosphere. Service seems to be a little spotty at times but is generally alright. Love that we can take our toddler son, dislike no changing station in the bath room. 
This is are go to when down in BC."}
{"text":"Outstanding!  Great friendly service, good food, nice little town to walk around.  Well worth your time to drop by and check out."}
{"text":"Overall beers were decent. Server had way too many tables for the amount of people. Add more servers to attend the guest more frequently. We had to make eye contact several times to get service."}
{"text":"Waited over 20 minutes on the patio just to order beer and an app whole waiting for friends. Staff is really nice but management obviously under staffs even on game nights! Probably would have given better rating but this crappy slow service is consistent enough to downgrade.

FOOD AND BEER ARE AMAZING! Don't plan to see your server too often though. Perhaps mail them a letter with your order."}
{"text":"Visited here with Sin City Brew Tours. The owner Todd was awesome. They had a table reserved on the patio, the weather was amazing, and the beer was fantastic. 

Todd met our tour group and informed us about each beer. We sampled 5 and I liked them all. The IPA was much different then I expected and was a favorite among the group. 

Thanks Todd and thanks Sin City Brew Tours!"}
{"text":"What a disappointment. The beer was good, the food was less than mediocre. How is it even possible to make a bad burger in this day and age? The time between ordering and serving was an eternity. Then my burger was cold and the sweet potato fries were burnt."}
{"text":"Making our way back from Hoover Dam, finishing up our weeklong trip in Vegas, and unexpectedly stumbled upon this little place when we decided we needed a refreshment and didn't want to wait the 30 minutes it would take to get back to Vegas. I ordered a Hefeweizen, while the hubby ordered a Pale Ale. The Ale was strong, but good. The Hefeweizen was refreshing on a warm winter day. Also sampled the artichoke dip, which was tasty enough when washed down with the beer, but nothing to write home about. However, the onion rings were yummy, especially with the Cholula dipping sauce that came with it."}
{"text":"Food was pretty good. We had the chips with quest and salsa to start with. Then we ordered a few of their house brews. It was pretty decent. They had a nice open balcony to hang out and enjoy live music. Cool place to chill."}
{"text":"Nice selection of beers but $1.50 or $2.00 for 5oz is high. Appetizers also are expensive for what you get.....the chicken wings are frozen, not fresh and the cheese on the natchos is globbed on from a can.... fresh onions, tomatoes and avocado but the other items are from a can, jar or freezer. Did not try an entree, so I can't comment on the rest if the menu. They have great wait staff but the fake taste of the food we tried brought down what would otherwise gave been a nice experience."}
{"text":"I like this place.  Service is always decent but bot great.   It isn't anything special, but definitely worth going to for drinks or decent food."}
{"text":"I don't know why I haven't ever gone to downtown Boulder City but I must go more often. It's only a 10-15 minute drive from my house. Anyway I finally stopped by and of course had to try the Brewing Co. I love a good beer. The weather was great and they have a good size patio but we decided to eat indoors for lunch. Plenty of seating with a good view of their brew set up. 
I had the amber which was very good. For once a micro brew that isn't too hoppy. I also had their Dam Hot burger which was awesome. Not too huge that you make a mess of yourself. Great sauce and spicy jalapenos. The roll it was on was fresh and burger cooked nicely. Very friendly staff. I plan to go back sometime for the nighttime music."}
{"text":"I was in Boulder City and I've been hearing about this brewery for quite a while so I decided to cruise on in.  I enjoyed a great burger and a variety of beers.  

If your ever in the area then this is a must.  They have quality food and service and to top it off I got a nice growler to go.  

Gonna enjoy it at home."}
{"text":"Boulder Dam Brewing is possibly the best brewpub in the Vegas area. This pronouncement comes after taking into account all the ingredients that go into a good Brewpub: Location, Beers, Staff, Food and atmosphere (in no particular order).

Location: On the north end of Nevada Highway, Boulder City's quaint main drag; filled with quaint Antique an Country Stores and a genuine old-time feel that is more Mayberry than Vegas.  BDB is a great FOB for sorties into downtown Boulder City.

Beers: This is the strongest and weakest category for BDB. The strength comes from the dependable and tasty beers they brew here. Their standard brews are a plisner, hefeweizen, IPA, amber, and stout. All of them are fine examples of the style and they normally carry 1 or 2 specialty brews at any given time. Although they don't carry any \"guest taps\" and their bottled beer selection is slim, anyone who likes beer will find something to enjoy. That said, the lack of variety and the fact the normal beers in the lineup don't push the envelopes of their respective style may cause a beer connoisseur to get bored. As a beer connoisseur myself, I have other reasons to come back to BDB again and again. Hoppy Hour M-F from 4-6 features $3 pints, a buck-fiddy off the normal price.

Staff: The staff here will make you feel like you are hanging out at a friend's house. The small-town location makes for friendly service and anyone who comes regularly is made to feel right at home. 

Food: The menu is limited to sandwiches, burgers, hot dogs and appetizers but everything is made quickly, and well. 

Atmosphere. Probably my favorite attribute of BDB. Their roomy Beer Garden is one of the best outdoor drinking locations in the Vegas Metro area. Cigar friendly with classic rock music during the day and live music at night and a front row seat for the endless parade of motorcycles that roll down Nevada Way. They also have free WI-FI courtesy of one of the businesses next door. This is THE place to enjoy a good beer and meal outdoors. Inside, is the normal brewpub fare: a small dining room and bar with the requite big screen TV's for sports fans. History fans will appreciate the old newspapers and antique equipment on display inside and outside. The place could be seen as a mini-museum of Boulder City's dam-building past.

As a whole, BDB is better than the sum of it's parts. It's the best place in the LV area to enjoy good food and tasty beer in the sun."}
{"text":"For us the staff is earning the 3 stars.
The beers are underwhelming. Granted we only tried 2, the Tropic Thunder IPA and the High Scaler Pale.  Bleh, the IPA is anything but tropical. I was surprised to have a burning aftertaste from the habanero peppers. A bit too much for my IPA friendly palette. The Pale was a tad bit to Heffy for me.
We also tried the fried pickles and pretzel. 
Nothing spectacular. 
We sat at the bar and we're served promptly. We even traded an IPA for the pale as the bartender was knowledgeable and friendly checking on us often.
I wish I could have done better than the 3 star review. 
This will not be on our places to stop while in Boulder City."}
{"text":"We had good food all three times we went there. The music was good.  We don't drink but did enjoy soda. Husband even bought a t-shirt to support local business. The only reason I didn't give it 5 stars was because the bathroom had not been tended to in quite some time. 
Everything else was great."}
{"text":"Las Vegas Brewery Stop #6

I love when smaller towns have a brewpub and the locals support it. That's what I found in Boulder City. Just minutes from Hoover Dam are some pretty good locally brewed beers. We tried there:

Awesome Blossom IPA
Powder Monkey Pilsner
Hell's Hole Hefeweizen
High Scaler IPA
Black Canyon Stout
Guest Tap - Honey Ale

The beers were all good, but the Awesome Blossom IPA brewed with Jasmine was so delicious. The jasmine plus hops just worked. They had lots of beer cocktails on the menu, which are always fun. The have a huge beer garden that actually resembles a beer garden. Props to Boulder Dam Brewing!"}
{"text":"Stopped in on the way out of town. I'm not a big beer drinker, but what I had was tasty. I think it must have been the Stout De Menthe. I'm giving this place 5 stars for combined reasons. First off, this place is decorated with a very impressive collection of ephemera and collectables - most relating to the Boulder, uh Hoover Dam and the time period to which it was built. Secondly, we ordered the beer battered onion rings and pickles. I am so sick of greasy, limp deep fried food. It doesn't have to be that way, use a good batter and have the oil at the right temperature. These folks did. Finally, it was the friendly guy behind the bar that clinched it for me. We exchanged banter with him and what I heard next made me really happy. A man was there with his other half. He got a salad, but was concerned that he needed more food. The bartender advised him that the salad was sufficiently large and filling enough without having to order more food. maybe some bosses would discourage that, but I rather enjoyed the honesty. I will be back again."}
{"text":"Found this gem on my way home from a charity gala. It's Saturday night the weather is balmy and they have a live band playing. Great ambiance and pretty darn good beer. I got their cervesa and it's tasty. Great for a warm spring night."}
{"text":"We saw the 3.5 star rating but decided against our better judgement and try it anyway. We arrived around 6:30pm, Saturday. It was busy and we waited about 20-25 minutes prior to the hostess sitting us at an outside table. No menus were provided so 5 minutes later we asked the hostess for menus. No server showed up for 10 minutes, so we stopped a server rushing by our table to ask for our server. Not sure who your server is, so I'll take your order. I ordered a bacon cheeseburger which apparently is a special order, because they charged me two dollars more than the BBQ bacon cheeseburger (9.45) on their menu (why not remove the BBQ sauce and charge me the normal 9.45 price? I ordered my burger medium, got it 55 minutes later, medium-well to well-done. My family also ordered various burgers, requested medium-well and medium-rare. All arrived cooked longer than requested and lacked flavor. The fries were mushy and greasy, so we asked for new fries. They assured us we would not get charged for new fries...oh how thoughtful! My mac and cheese side dish was runny/watery. This food is standard to sub-standard pub food. Beer was good, though! Service is slow and the wait is simply too long. Hire more cooks and staff! Honestly I would have been more satisfied with a bowl of cereal at home. The reviews we read on the way home mirrored our experience. I'm guessing this place handles many vacationers and visitors and the owners simply don't care about quality control. We will never be back and that average 3.5 star rating is too high. Spend your money elsewhere."}
{"text":"This place did NOT disappoint. From the food to the atmosphere to the staff everything was amazing. We had burgers, chilly fries, a hot dog, hot wings, a soft pretzel and a taco salad. We LOVED everything."}
{"text":"We got seated right away. The French dip was completely bland and soggy. Mac and cheese was great but was only a side. I didn't  try any of the brews so no comment there. The waitress was very nice."}
{"text":"Clearly still bitter about the nearby 3,250,000 cubic yards of concrete being named after Herby Hoover, the Boulder Dam Brewing Company chose to honor the Dam's original name. Perhaps because of the depression or maybe because he had pet alligators, there will never be a Hoover Dam Brewing Company.  

Hoover is missing out because the beer here is very good and is only $3 a pint during happy hour.  I would say crafting a beer of this quality and selling it at such low prices is a greater engineering achievement than building a giant wall to make a river flood, and I know what I'm talking about."}
{"text":"Oh man I'll start off by saying they were having one heck of a bad day today (02/17/2018).I've eaten here several times before and never had an experience like this. We arrived as usual with the dogs and prepared to sit out on the patio. The inside seating was full and the patio was nearly full also. We got seated with menus and then we were nearly forgotten. I ordered an ice tea and drank it down quickly only to discover that my glass was extremely dirty with a greasy film on the inside. I brought it to the servers attention and she brought me a new glass. Gross start, right? We put in our food order(bean burger for me, chicken wings for my wife) and 45 minutes to an hour later our server delivers us a hot pretzel with mustard and cheese dip and explains that it should hold us over and our food should be out soon. My wife try's to dip the pretzel in the hot cheese and it is rock hard. We show our server and several minutes later she returned with a similar one just hotter. As we had been here more than an hour now we had seen several people abandon their orders giving up on empty drinks and no food delivery's. I myself love to wait it out, see just how it's going to end. Situations like this leave people open to truly shine and have some sort of redemption by how they choose to treat the customers. Unfortunately our food showed up rather room temperature, the frys were raw and cold on the inside (I'll include fry pictures)and the lack of being able to handle their circumstances of poor service, dirty dishes and bad food were never acknowledged. Not even an effort to make anyone want to understand there situation. I know places can be busy, maybe the cook quit, or the dishwasher broke, understaffed or under trained help. It's the acknowledgement and taking responsibility for the situation that I look for and unfortunately that was not the case today. 
 Hopefully today was a learning experience for management. 
     Review done."}
{"text":"Stopped in here early afternoon for a beer and a snack. Nice looking pub with a great mural on the back wall. Got the beer sampler which was very good with diverse tastes. Tried the Angus beef blue cheese sliders -- a treat not to be missed! They were the best sliders we have ever had. We would have no problem returning here again."}
{"text":"We visited Boulder Dam Brewing Company while in Boulder Nevada and were not very impressed. If you are a biker and into beer this is the place for you. If you are a visitor who wants to eat a meal please do not go to this brewery because it has a very poor resturant.
We waited almost an hour for simple lunch food and when we finally recieved it all the meals were  cold. They pushed beer and made sure you always had a full glass but failed in the food area. The price for the lunches was overpriced for what you recieved. The service for food was very poor in the kitchen and with the waiter.  They should remember that vistors have friends and their poor service and poor quality of food will get around as well as the many beers they serve.  They should improve the quality of their food service  and not just depend on the all beers they serve to bring customers in."}
{"text":"Stopped in for lunch yesterday.  Had to sit outside in the cold. The heater wasn't on. The service was extremely slow.  Finally ordered and 38 minutes later I got my salad which consisted of apples with brown aged spots, limp lettuce, a few slivers of onion.
Just terrible. My friends burger looked like it was made last Super Bowl.  My other friends sauerkraut was dry.  Who ever heard of dry sauerkraut?  This was probably one of the worst meals we've had in long long time. Won't be back."}
{"text":"first time I've been here, the food is so much better than we expected. live band playing classic rock, great atmosphere. service is good, friendly staff, drinks were just ok, but again the food really surprised us in a good way."}
{"text":"A group of friends and I went to get an after dinner drink after the day's film festival, so we stopped here to close out our night of adventuring.

Real cozy atmosphere.  Something about the vibe that was casual and laid-back.  We sat next to a guy chatting excitedly to a friend about how drunk and incoherent he is, and is usually a very normal person (uh-huh).  On the other side, \"Wheel of Fortune\" was playing on the TV.  Pat Sajak is still hosting?  Really?

At any rate, my friends and I survey the menu.  They do their own beer, so there were quite a few appealing options.  As I started to gravitate towards a Bock, my eyes found the \"Beer Float\".  And it's exactly what it sounds like: A stout with vanilla ice cream.

Since I skipped dessert at dinner, I decided to try one.  So I ordered, and the bartender actually scoffed at me, as if to say \"What kind of lame-o wants ice cream in their beer?\"  Well, I, sir, AM that lame-o!

....

Well, one of my friends and I, anyway, since she decided to try one.  It's a rather exclusive club, you see, and memberships are limited.

True to word, we got served our drinks, and they were tasty.  The bartender made it a point to give us a hard time, but he was having some good-natured fun with the jokes, so we verbally gave as much as we got.

We finished our drinks, hung out for a bit longer, and left.  As we left, the bartender thanked us for coming out, and said he hoped to see us again soon.  I liked the guy, so I gave him a good tip.  Any schmoe can sling a beer.  It's finding someone willing to have a good time with the customers that makes the experience.

Didn't try the food, but perhaps I'll brave it on the next venture out there."}
{"text":"We have been here many times and always pleased. . Beer is great. Today, something was amiss. Sloooow service. Almost an hour before food was served. Sent back to be re-heated. The hair in my burger was an extra bonus. Guess we might come back for their great beer, but will pass on food. Very disappointing."}
{"text":"An amazing brewery that is well worth the stop (we stopped after visiting the dam). The beer is delicious and the food is filling (I had the pulled pork) I highly suggest stopping here."}
{"text":"Go for the beer not the food. Overall average rating of 3 stars is accurate.
Food: 2-3 star range especially measured against the cost. 
Went with a group...I'm not a big beer drinker. Very good service. People seemed to enjoy the beer."}
{"text":"We came to Boulder for the train and found this nice little beer and sandwich restaurant.
Great service, good and fresh sandwiches.  Wine was fair to middling but then again it IS a  beer place"}
{"text":"Local beer is the best kind of beer! On a nice day this is the perfect place to have a patio drink and meal! I was there in between typical meal times so the place wasn't crowded, but the service we had was great and friendly! 

I tried the Powder Monkey Pilsner and the High Scaler Pale Ale and both were tasteful and refreshing. We started with the beer battered zucchini which I suggest if you've never had it before! Its a great change from the typical appetizer items you see on a menu. I thought it best to stick with a fully fried meal and got the special; beer battered fish and chips. Overall, the flavor was good but what I enjoyed was the little amount of grease coming off of the food. I'll be back next time I'm in Boulder!"}
{"text":"Dam good food & Dam, I mean DAM, great beer! Had their blue cheese burger, fried hot dog and wings... Fresh and great quality food."}
{"text":"I love this brew pub. Great place to grab a refreshing pint. The Brü Guru is a badass at his craft."}
{"text":"Came with Sin City Brew Tours and sat in the beer garden. Even in the 100 degree heat it was perfect. Love the High Scaler Pale Ale and the IPA was good too. Def recommend this place for a relaxing night out."}
{"text":"Stopped by for a couple of beers.  

Hats off to the brewmaster here - the IPA was very good.  Sat on the patio and enjoyed a few beers  and then headed home.  It is very relaxing and good service.  Has a nice small town vibe too it - which makes sense becaus eit is Boudler City.

Definately will return to try some food."}
{"text":"Sam Adams Cherry Wheat and Magic Hat #9 going down yesterday...the service was slow but it was a beautiful day to sit outside and we were not in a hurry..."}
{"text":"If we weren't on a travel schedule, I could have spent hours and hours here. This brewery sits on a corner of a small town with indoor and outdoor seating. We got in a little after lunch time and got a table outside. As Pennsylvanian's in November, I was in heaven sitting outside in my shorts in the sunshine drinking good beer. I had the Heffe and the pilsner. I really enjoy the Heffe, the pilsner wasn't bad, but just ok to me. The husband had the Black and Tan and the IPA, and enjoyed it. I had the Bruben sandwich which was good, but the meat was a bit fatty and hard to bite through. The sweet potato fries are some of the better ones I've had. I don't typically like steak friea, but they did a good job of combining sweet and salty. Hubby had the spicy burger that he liked. 

This place gets extra love for me for atmosphere and beer."}
{"text":"The beer here is awesome and the service is great! Whatever you get, make sure to sub the onion rings because they are seriously the best I've ever had. Love this local watering hole!"}
{"text":"We went in for a beer and a burgers as the menu looked good.  The service was extremely poor, from how long it took to order until the time it took to get our check.  An hour and twenty minutes to get three burgers, a hot dog and a salad - crazy.  Two BBQ Bacon Cheeseburgers didn't even have BBQ sauce!  I'd find a different place to go if I were you."}
{"text":"Wanted to get away from Las Vegas  and explore boulder. Super disappointed did not have the drinks I wanted ... They were out of sangria. They were out of salmon Salomon sliders everything I wanted they didn't have. So I order and the food came out in about an hour super dissapoinment on the food horrible never going back there again."}
{"text":"Good beer, great sangria, and a friendly atmosphere. It's your typical neighborhood brewery. Kitchen was closed when we visited, so I can't rate the food but the bartender was great! Will be back again."}
{"text":"Been twice, first time was good food, okay service, bought a second groupon. Second visit was hardly worth the drive...Slow to no service decided to go elsewhere for dinner because there was so much time between the server or a manager coming by. Flights were warm by the time we got them. Had to walk up and get my own growler from serving station. Not one employee had any hustle. The Bavarian pretzels  we ordered were almost cold by the time we got them. Definitely unimpressed and probably won't be back. Not one employee knew what team work meant, and no one helped anyone else. I'm a server myself and this was unfortunately horrible service."}
{"text":"We have a local group of 6-16 people that love to frequent our local restaurants. This was the worst experience we have encountered. The server could not get our orders right; most of the food was cold (which should have been hot) and it took almost two hours. Sorry. Not coming back."}
{"text":"This place has so much potential.  Great location on the main strip in Boulder City....a lot of tourists drive this way on their way to and from the Hoover Dam.  They have a great patio and  an open dining room with a large bar.  I have not been here on a night when they feature a live band, but I can imagine it is a great atmosphere.  I've also not enjoyed the patio, it has always been too hot to sit outside!

I've tried a few items on the menu.  Everything has been decent.  There is nothing spectacular about the food.  The service is usually pretty good, but can be hit or miss.  Almost everytime I have been here, they've had a very small selection of beers.  This is odd to me, since it's a brewpub, and they are brewing their own beers.  I love beer and I like supporting local breweries, but it's hard to do so when the product is mostly unavailable.

It's a shame, because there is such an untapped (no pun intended) beer market here in Vegas.  I feel like this place way underperforms and could be a gold mine."}
{"text":"Very run down place lots of crap on the floors, smelly bathrooms.   Service was average.   Menus are completely warped and destroyed and we had to grab our own.   The beer was just meh.  Craft beer can and should be better.  The food was definitely forgivable not too hard to mess up a burger and fries but they did.  Fries over cooked and burger lacked in flavor even with the hatch Chile's.  :)"}
{"text":"This place may not be a 5 star rating, but I think the sheer fact it is a micro brewery located in boulder city (what people consider a small town in Vegas) almost alone should be worth a 5 star rating. 

Everyone that ordered a burger ordered it different and each one was still amazing. My cousin ordered the tuna wrap and she liked it. 

They have really good beer at less that $4 a glass. 

The environment both inside and outside is great. If you can handle the cold I would recomend going in December because boulder city has Christmis lights all over and it is beautiful from their deck."}
{"text":"Had lunch here a couple of times. All the servers are chill and nice. 
Food is good and the price is fair. 

I would recommend this place to others."}
{"text":"Not gonna lie... We were here for the Dillinger Block Party and by the time we stopped into Boulder Dam Brewing Co. I might have been past the point where I can truly judge something.

However, I do remember that the shandy I got tasted great.  PERFECT beer to lemonade ratio.  I mean this drink was good.

My friend ordered me food but I didn't eat any of it.  I took one bite of the very delicious fries but that's about all I could do.  The food looked really good and my friend seemed to enjoy what he was eating.  

I can say that by the 3rd time I had to run to the bathroom I learned that both are pretty clean and large.  I really appreciated the cleanliness when I may or may not have tried to expel some of the copious amounts of alcohol I consumed.

And the service was quick and friendly.  Definitely want to come back and give it another try.  That shandy is calling my name..."}
{"text":"Pretty decent spot in historic downtown Boulder City.  The drafts were good... lemongrass cider was particularly good on a Hot summer day.  Kids liked the chicken tenders but not the m&c.  The orange cilantro chicken salad was good and u really don't need the dressing.  At our table, the sliders and Reuben with votes best meals.  French fries were the big thick ones... very good!

Service was particularly attentive and we got $5 by checking in on yelp."}
{"text":"My wife and I stumbled onto their live music on a Friday night. It was a lot of fun.  Neither my wife nor I are much of beer drinkers, however we can say their sangria is a good alternative. We really enjoyed it and will definitely be back."}
{"text":"Wish this place was closer to Vegas. But always a must stop when I have to go through Boulder. The bartender is always nice and I love the stout and the food while not fast is always worth the wait."}
{"text":"We drive in from Vegas to eat and have a few drinks here 3-4 times a year.  The food, and especially burgers, are consistently excellent.  All of them.  There is a good selection of craft beers here.  The IPA's and wheats are consistently good.  

Indoor or outdoor seating- can't go wrong either way. If you are here in a weekend do yourself a favor and sit outside and enjoy the band.  Stevie Ray Vaughn type music; perfect for the brew pub atmosphere.

Highly recommend"}
{"text":"I stopped in on a Sunday afternoon to try the 9th Annibrewsary Scotch Ale \"Frisky Whisky\" and eat as well.
The patio looked fun but was packed so I opted for a seat at the almost full bar. The first thing I heard was an adjacent table asking the bartender for dressing and another beer, to which they were told something along the lines of sorry, we're real busy right now. I soon found out one bartender was handling the crowd. And I heard the sorry, we're really busy repeated many times. It goes without saying that having one bartender to serve maybe close to 80 people drinking beer and help with food service is ridiculous. 

I was nervous as I recalled the same sad situation had played out last time I was here. I figured at least sitting at the bar I'd get fed in a reasonable amount of time versus being at the mercy of the servers outside. \"The Frisky Whisky\" was pretty good but didn't blow me away. I had the turkey club BLT (added avocado at the bartender's suggestion) which was pretty impressive- the pepper turkey, bacon and marble rye (my choice) was a good combo. I also had it with potato salad which was really tasty. I got my sandwich in a reasonable amount of time. My second brew, the Pekoe Pale Ale, is made with tea and was much better than I anticipated! Very tasty indeed. Usually I will ask for my credit card to be processed after I've had it out for a while but this time I just waited. And yes it took a pretty long time to get that card processed! So if you come on a gorgeous day on a weekend, be prepared to wait. 

I'll be back in good old BC for the BC Beer Fest on March 26, and at least it's not at the brew pub, though they are listed as the official sponsor...."}
{"text":"Had a very nice lunch with a friend on the patio after a long-distance running event in town. I ordered a large salad, she ordered a burger and a beer and everything was excellent. Service was prompt, food came fast and our lunch was enjoyable and relaxing after a long day. Prices were reasonable as well. Stop by if you are in town for a casual and comfortable dining experience."}
{"text":"My husband and I love this place. We've been twice now and each time the food, beer and service has been great! We just wish it was closer to us! But still, we plan on making the drive out from Vegas again next weekend for the live music. I'm a vegetarian and they have been happy each visit to alter items on the menu to suit me. The patio area is really cute and the whole place has a great atmosphere."}
{"text":"I was really excited to finally try this place out. I was very disappointed with most every aspect of my visit. The wait staff was friendly and attentive at first. We received our water right away and then placed our orders for beers. It took 23 minutes from ordering THREE beers to receiving said beers. Once we got the beers, two of them were murky and filled with yeast spindles (see picture). As a beer lover and home brewer, I would've respected my craft and NOT sent the beers out. Instead, we were served the bad beer and the waitress walked away quickly. About 5 minutes later, we were able to flag her down and send the beers back for a replacement. It took another 20 minutes to pour TWO beers. The wait would've been tolerable if iwe weren't one of two groups in the place. The only other party had received their food and were content. There were two waitresses and the bartender. There is NO conceivable reason that we waited for 43 minutes to receive drinkable beer. There were no apologies made for the bad beer served or for the complete lack of timeliness. This is a sad excuse for a brewery."}
{"text":"If you're looking for pretty decent beer for pretty good prices (especially during happy hour), you'll find it here. The bartenders have always been nice, and I love that they have glasses full of old Trivial Pursuit cards up at the bar so you and your drinking companion can amuse yourselves by quizzing each other back & forth. I've only had a couple of their food items -- a pulled pork sandwich (well, I stole a bite of my companion's) and some chicken fingers with chips & nacho cheese -- and it's pretty decent for bar food."}
{"text":"Great beer, so so food.

Beware this is a local's watering hole and outsider, lone males get a cool reception."}
{"text":"I'm giving three stars for waitstaff-excellent server, ambience  and what I did taste.  Let me quantify all this now. The ambience is pretty cool. I was a mother alone with my 4 year old and 18 month old (who eats better than my 4 year old) but I totally could see myself hanging out there if I were single and didn't have kids or have kids with me. What made it \"cool\" to me was the really \"old west/barfly\" working class feel. They definitely need a full bar though. I'm on a ketone diet and the atmosphere/ambience really reminded me of my days as a student to be honest and I really wanted to enjoy a beer with my meal but after googling what I could drink it was only clear spirits and they had only beer and wine-so no little relaxation for me (probably for the best but they need a full bar they'd really be slammed).

Ok now the negatives. Being on a ketone diet I looked over the menu and salads or salmon were my main choices. I spotted a Philly cheese steak which was PERFECT without the bread (and peppers as I hate those) for the kids I got my daughter a hot dog and my son the chicken nuggets. As mine came with French fries too I asked to substitute them with avocado which they did. I briefly saw our food coming out and my really great waiter intervening-he didn't know I saw but he came over and apologised for the delay and told me they put peppers in it. 

So the food arrives and the presentation was really great on mine. They managed to make an AMAZING Philly cheese steak minus the peppers and bread. It sat on a large leaf and on the side there were a few slices of avocado. I do want to add that I had a tea-iced tea I made by them giving me a green tea tea bag and hot water and a cup of ice. The only complaint I have on my meal is for the price the Philly cheese steak was about half of what a subway 6 inch Philly would have-so really small portion. It's obvious they like to fill people on fries-which were overly generous on both my kids plates.  Also considering I didn't get a huge heap of fries they could have given more than a few slices (3 to be exact). 

Now my kids meals-well my daughter had a really good hot dog and a ton of fries that looked-and felt dry and over cooked and a pickle on the side. This is the first time EVER my daughter didn't touch a French fry-NOT EVEN ONE. I tried to feed one to her and she smacked it away. She did get a juicy hot dog though. My son had over cooked nuggets and again the same dry over cooked French fries. I really had to coax him-I did take all with me but likely going out with the trash tomorrow. 

So honestly maybe it was an off day with the fryer but anything fried was really not good. You can't work with kids (or adults) and dry over cooked fries. 

Finally the bill-for a tea bag I brewed myself, the cheese steak and avocado and the kids meals it was $32 dollars or so-I was shocked really. If they had massive portions and they got the fried foods right I'd totally have no issue but the small portions just kind of shocked me. I'd go again when not on a ketone diet and enjoy a house beer and a burger and ask for lightly fried French fries."}
{"text":"I brought my fiancé here for his birthday and had a groupon for the beer tasting and growler to take home. They ran out of beer because of a prior beer festival- However they more than made it up and let us order any beer off their menu instead of the specific ones that usually come with the groupon. We sat at the bar and our bartender was great. We had the pretzel with this amazing beer cheese that I would order in bulk to take home if I could! We also split a burger and their wings which were equally amazing. Thank you for the great service! I'm happy we went here- will be back again!!"}
