{"text":"The best restaurant in Boulder City for a quick meal and friendly service. Best French frys in town."}
{"text":"Great burgers and fries, the best fried fish in town. I love the ranch. The pit stop is the kids favorite burger place to go to. The waitress are always very nice too."}
{"text":"Very tasty and moist turkey burger, love the deep-fried mushrooms. Old fashioned onion rings. Inexpensive for what you get. Real quality!"}
{"text":"We have been going to this establishment for at least 15-years.  NEVER had a bad meal.  We especially like their fish and chips with a side of zucchini to start.  It's important to get there before the lunch crowd or you'll probably be waiting for a while, but it's worth it.  The service is great, and with little ones at the table, they are very gracious."}
{"text":"Finally! My hubbie and I finally decided to try out the Boulder Pit Stop after talking about it for months. What were we waiting for??

We went on a Sunday afternoon, and the place was packed. Husband ordered the Pit Burger with swiss cheese and I the turkey burger with cheddar. He said his was really good, and I LOVED mine! Not too often do I come across a turkey burger that is really tasty and moist.

We each ordered fries, not knowing the serving size. Wow! They arrived in their own separate baskets! For us, one serving is all we'll need to order on our future visits there. Oh! The fry sauce! Yummy!! You will have to get their fry sauce when you go!

The service was really good, too. Our waitress even offered us to-go cups of ice tea; now how many places do that?"}
{"text":"Great place to fuel up after a day at the lake!! 

The burgers are not anything over the top but they are tasty and remind me of eating burgers at a small cafe in my childhood. 

Fry Sauce is great and they also provide Fry Dust at your table. Who needs salt when you can get dusted! While we are talking about fries, if you order a combo the fries come out in a nice big basket. I like getting more fries than I should eat. 

I look forward to plowing through the rest of the menu at Pit Stop! 

Good prices for a sit down sort of place."}
{"text":"When its hamburger and fries time, its off to the Pit Stop we go.

We are working our way through the menu and everything has been prepared well and we have yet to be disappointed.

The staff is mostly local high school/college aged girls and they always treat us like we were their parents. Great service, great food.   Our kind of place."}
{"text":"my wife loves their turkey burger.  she says its the best shes had.  i always order the double pit and put their special fries sauce on it. very tasty.  there are some places in town that actually charge you if you get additional sauce or dressing.  how cheap can they get ??  maybe thats why owners drive new trucks and dont give a rats ass about their customers. they charge a fortune for their burgers and must think they are the only burger in town.  pit stop is great.    tk"}
{"text":"The Pit Stop has been in Boulder City for many years.  I use to go there for the \"fish and fries\" when they were on the main highway.  My wife and I have started going there again after a long absence.  We live nearby in Henderson but forget about going to Boulder City to eat.

Each time we go I say that I will try something new..........but when we get there I go back to those batter dip fish and fries.  My wife tried the turkey burger and said it was great.  There menu selection is great too. 

Oh Yah!  remember when you use to get fry dip with your fries?   Here, they still give it to you....and it is \"finger licken good\"

Maybe I'll try that turkey burger next time...................Maybe"}
{"text":"Great food! Great service!  They'll even ask if I want a refill in a to go cup.  That alone will keep me coming back."}
{"text":"I just ate at Pit Stop restaurant. It has a quaint, welcoming interior, combined with friendly staff and good food, which ultimately lead to a great dining experience.

mozzarella sticks 8/10
they were flavorful and not overly greasy, just overall very good and enjoyable. 

\"pit burger\" + bacon & cheese 9/10
this burger was exceptionally good. I especially liked the smoky flavor that I assume either came along with the way they cooked the burger or the bacon that was on the burger. 

fries 10/10
to be honest the best part of this meal was the fries. they were crispy and seasoned perfectly and I very much enjoyed them

overall I would highly recommend this establishment to anyone passing through Boulder city, or anyone who lives in the area. it's a good place to get a good meal for a reasonable price."}
{"text":"This is our Sunday lunch place! My whole family loves it. Its not dirty, that's a bunch oh bull! Its very clean and the staff are all very nice."}
{"text":"Decent food at a reasonable price. Good service. We were glad to find this place on our way to Grand Canyon from Las Vegas."}
{"text":"AWWWWWW Sooooo Goooood! I had my 12 birthday there. Whenever I go I get the chicken sandwich, before I got the chicken strips and cheese burger. My mom gets the Dam Burger. I didn't like Pit Stop for a while because I got the chili dog, and that night I threw up, its because it has beans in it and not the chili sauce. But lately I remember how much I loved it. And for once I actually eat the friends. They give you a choice of \"special sauce\" or ranch. The fries were soft but not so soft. Go there when your fellin hungry."}
{"text":"The pit stop has good food courteous servers and a nice atmosphere. Prices are reasonable."}
{"text":"This little place is popular with the locals, which must mean something.
The chicken fingers and ranch are awesome.
Not to mention the burger and fries are pretty good too.
A bonus is this is a clean little restaurant. 
Definitely the place to stop for food on the way home from the lake."}
{"text":"I've had a cheeseburger here before which was very bland; however, go for the fish and chips.

Some of you should love it here; it is waitressed by Junior Hooter's Wannabies, who hang out at the back of the restaurant as much as possible, texting and chatting.  OMG - i just looked at the pictures for this restaurant on this page, and you can see what I mean - how funny.  I have been here about 5 times, and 4 out of the 5, they have screwed up my order, usually omitting something or another promised in the menu - if, however, you can manage to hack in through the texting and chatting barriers and get their attention, they will try and fix it.

Fish and chips are great - reasonable portions and good quality."}
{"text":"If you would ever want to have a bite to eat in Boulder City Pitstop is the place to go .Their burgers are delicious and juicy. pit stop is the best place to eat for anyone who loves real amazing food!!!"}
{"text":"i've had better. it is really nothing special, but you could not tell that from how crowded the place got after i sat down in my booth. 

the burgers were on the thin side, but the fries were really good. i ended up eating all of my fries and my friend's when he wasn't looking. 

i ordered a milkshake, but it really was not a milkshake at all. it was a soft serve ice cream with hershey syrup frozen drink disguised as a milkshake. how can you do that and call it a milkshake, i will never fully understand?

so either i was really hungry after spending the day at hoover dam or it was actually a decent meal. i think i was just hungry. the jury is still out on that one."}
{"text":"3.5 Stars

The PIT Stop is a Boulder City institution.  I spent a summer working in Boulder City back in 1995 and we ate here regularly.  I don't make it back that frequently, but the nostalgia factor is tough to resist when I'm in the neighborhood.
I'm a big fan of the burgers...they probably aren't the best in the Las Vegas metro, but they are big and juicy and a great value.  They offer a couple different topping options including bacon, jalapenos, and green chiles.  The fries are fairly mediocre, but that mediocrity is eclipsed by the wonderful fry sauce and seasoning salt available on the table.  The milkshakes are also enjoyable...thick enough you need to eat with a spoon.
Although service can be a little hit or miss depending on how slammed the restaurant is (and believe me, it can get crazy in here), the waitresses are generally very friendly and are doing the best they can.  If you haven't been out to the PIT Stop, you should definitely make a trip out for the experience and to enjoy the charm that Boulder City has to offer."}
{"text":"Quick and tasty lunch! I always get the crispy chicken sandwich.  It's very juicy and flavorful.  Love the fries with seasoned salt on them!"}
{"text":"Awesome turkey  burger. Their burger is the best I've ever tasted.  

I love the small sports atmosphere. I didn't know which TV to watch. There are several televisions located throughout. I enjoyed that each TV weren't showing the same thing. I love it. Football highlights while eating. It's like tailgating. I also enjoyed looking at the different sports photos on the wall.

The wait staff is nice and friendly.  It seems that they really enjoy their job. 

I know that I will definitely come back again. This place is a must when in Boulder. I am already planning the next visit."}
{"text":"If you're on the road to or from Vegas, make it a point to stop here. Great burgers, huge pile of fries and great price. The staff is friendly and the place is clean and fast."}
{"text":"We were on our way to Hoover Dam and we got hungry. Pit Stop came up on our search and decided to try it because of the high reviews. These burgers do not disappoint! Generous portion of fries, have your burger how you want it, diff patty size options, sauces, pleasant wait staff. Option to eat in or sit outside. This one is a gem."}
{"text":"PROS:
+Most affordable burger-joint burgers in about a 100 mile radius.
+Friendly service.
+Olde Fashioned (as you can tell by ending the old with an e) burger joint atmosphere.

CONS:
-If you're not local and trusting your TomTom or Garmin to get you there, good luck! (Spoiler: it's at an outlet at that corner strip mall.)

BOTTOM LINE:
Better and more affordable than StarBurger. I recommend it if you want a budget lunch and in Boulder City."}
{"text":"Was driving through the area and stopped by this local place. Cheap food, good quality food. The grilled chicken dishes and fish/chips/shrimp combo platters were delicious. Fast service and friendly staff!"}
{"text":"Delicious greasy burgers - in a good way! Just what we were looking for on the way to the Hoover Dam. Excellent service and atmosphere."}
{"text":"My family and I have dined at Boulder Pit Stop on many occasions and always enjoy our visits.  The food is great, love their burgers and fries, fish and chips and their chef salad. The service is always excellent with attentive, friendly servers."}
{"text":"Service was quick and food was great! We added pastrami to our pit burgers! Perfect french fries and special sauce!"}
{"text":"Been coming here since i moved here in 96. Still have not found a better drive-in style burger in the Vegas area.... fry sauce is addictive, totts are great and fried mushrooms are awesome. Shakes are killer too! hope this place is around for another 20 years."}
{"text":"So tasty. I had the double burger with Swiss cheese. Fries with seasoning salt and their own thousand island based dipping sauce. Definitely will be a frequent stop when passing through the area for work. A local friend recommended it, and it did not disappoint. The baseball memorabilia didn't hurt either!"}
{"text":"I live here in Boulder City, and would eat at the Pit Stop every day, but then I wouldn't be able to get out of bed in a few years. Yep, the burgers are greasy, and that is what makes them yummy. The meat is purchased fresh from a local grocery store that is in the middle of old town BC. The fries and onion rings are amazing. And I have never had a fish and chips basket to equal theirs. I had never had fry sauce until I went to \"the pit.\" I am hooked on that stuff. Well, I have talked myself into a trip over there to get some fish. If you are ever in town, please stop in. They are in the same area as the Vons supermarket."}
{"text":"Really great food. Was a clean restraunt. I took my family there and everyone had a nice lunch. The staff was friendly. We were seated immediately even tho there was 6 of us. We will be back."}
{"text":"Great burgers, fry sauce was yummy, French fries were cooked perfectly! Great job, Pit Stop!!"}
{"text":"In an age of over cooked, dry, tiny fast food burgers, the Pit Stop still makes burgers the old fashioned way, delicious!

We've been going here for decades. They never fails to please us.  I usually get a Pit burger and add a few extras like Swiss cheese and a chili. The BBQ bacon burger with onion rings is good, too. We usually split a basket of fries. Great food."}
{"text":"Stopped in on our way home from Vegas. The place was hopping!   Good burgers and fries.  Prices pretty good too.  Liked the fact that it wasn't just burgers.  They have hot and cold sandwiches, chicken sandwiches and even hotdogs.  Not a fan of the chili but we will definitely be back next time we are on Boulder City."}
{"text":"Returning to Las Vegas from the Hoover Dam and wanted to eat somewhere outside of Vegas. Saw this place on Yelp, and decided to give it a try. Hubby got the fish and chips--sizeable serving and YUM. Daughter got the kids sized hamburger. Now, she's outgrowing kids meals but this burger was not dinky. Son got the chili dog. He out ordered us all--chili was extra yum. The restaurant is in a mall that's a little tricky to get to from the main thoroughfare, but it's worth it!!! Will go back again."}
{"text":"Have stopped here about 4 times and  usually have the Pit Burger. We were there yesterday and my wife had the fish and chips. She felt it was one of the best fish and chips she has had in a long time. As usual the Pit burger with pepper jack cheese and avocado was delicious. We have never had any issues with our orders and the service has always been top notch."}
{"text":"Good quality food. Service was a little slow, but it was a busy Friday night. We got a BBQ burger and a fish sandwich. Fish sandwich kind of hard to eat because it kind of fell apart, but had a good taste to it. Prices were definitely reasonable."}
{"text":"This was an amazing discovery on our way back from Hoover Dam to Vegas.  We were looking for a lunch stop in Boulder City, and found this place on Yelp.  The interior was nice and clean.

We got the Chili Dog special and Pit Burger Special, both came with a basket of fries.  The Chili Dog was definitely loaded with all sorts of goodies, the chili was decent, and the portion was quite big for a chilidog dish.  The Pit Burger was a simple, solid, juicy burger in toasted soft buns.  For my fellow Utahns, they got your favorite thing here... the Fry Sauce.

Boulder Pit Stop is where I am stopping by when I am in Boulder City again. Service was excellent, and there was never a moment my felt unattended."}
{"text":"Freaking awesome burgers!!! This place also earned a place in my heart because of the fry sauce!  Only a few places I've found in the area have fry sauce and this puts it over the top of other burger places.  Stop here if you're in Boulder!"}
{"text":"WIth temps today in the low 90's in July, the GF and I thought there could be no better place to spend it than by slow rolling in the desert area behind BC.

Prior to departing the black top, after much deliberation, we just ind of sorta ended at BPS.  I am happy we did.

I think there has been some remodeling.  Our booth was much more comfier than I remember.  What I did remember was a three star experience until today.

The service was spot on.  Not only was one super friendly waitress taking care of us, there was another super friendly waitress taking care of her and us.

The GF and I bother ordered up the Dam Burger Combo.  I added cheese, bacon (strips...no longer round) and green chiles.  This came with an enormous basket of fries and a beverage.

Before I knew it the meal was over...sadness.  But what made me happy again was the waitress asking me if I would like a drink refill in a to go cup...Absolutely to the to go cup and giving BPS another star."}
{"text":"Wow, that was a goooood burger. You need to try the ranch and the fry sauce. The waitress was friendly and very helpful."}
{"text":"Love the fish n chips here. Great burgers too. My wife just had the grilled salmon salad which she loved. Good food great value."}
{"text":"If you want a great burger or fish and chip your at the right place. Fast service and great food is why I am a regular at pit stop."}
{"text":"Burgers, fries, FRY SAUCE, milkshakes. enough said. The burgers were really good, especially with the thousand island dressing. One of my favorite burger places in town!"}
{"text":"great down to earth home cooking.  Liked the fish and chips combo.   We should have a choice of type of fries.   They can improve on their hot sauces as mine was very salty and low quality."}
{"text":"Good food, great service. Love the fry sauce and really love that they leave a bottle of fry sauce and, or ranch at the table for you. Prices are really reasonable as well."}
{"text":"First off, for a veggie burger, I've never had one better or juicy...how can it even be juicy? YUM. Fries were great and I love that they give you ranch and fry sauce. I couldn't believe how packed the place was, it was soo worth it. My husband had already been and he loves their bacon cheeseburgers. Will defiantly be returning!"}
{"text":"This is one of the only old school diners in the Vegas area not littered with slot machines. I've been coming here over 3 years, the food is excellent, service is great, especially their diner style burgers and chili cheese fries which is a great way to end a day out on the Lake. It's the last restaurant my Dad wanted to go while he was doing chemo/radiation last year before he passed. He loved this place."}
{"text":"Pros: I really did like the hamburger and French fries.  

Cons: restaurant so dirty that I threw up in the parking lot.

The burgers are fried rather than grilled, so it's a different flavor than most other restaurant hamburgers.  However, it was pretty much just an In-N-Out clone that cost twice as much.  The meal deal is a good value for 1 person, but if you have 2 people, just order one value meal and an extra burger.  The French fry portions are very generous.

Cons: FILTHY restaurant.  I am not kidding.  Everything was sticky and greasy.  Dirty tables just sit there until staff have time to clear them, and I was uncomfortable drinking from my drink glass after I saw our server clean a dirty table and then bring a refill.

Fortunately, the other con came into place - poor service.  Our server wasn't rude, but not very attentive.  They don't have enough staff to keep up with the volume of customers.  So I didn't have to worry about a refill because I only got one, and then gave up.  There is no reason for this place to have table service.  It would be much better suited with a order at the counter setup with a drink station, like Jason's Deli or something.

However, the bathroom was disgusting.  It was a tiny single unisex stall covered in used toilet paper.  I decided just to wash my hands and skip the science experiment toilet, but there were no paper towels or soap.  The worst part was overhearing the staff and kitchen from the bathroom.  I just used hand sanitizer, paid my check, and walked to my car.  I guess my disgust at the dirty restaurant got to me, because I threw up in the parking lot before getting to my car.

I might give it another try sometime, but only for takeout."}
{"text":"Really good cafe food. Great burgers, fries (served with fry sauce or ranch at the table), and sandwiches. Friendly attentive staff. I always stop here for a meal after hitting the gun range."}
{"text":"I have so many memories coming here. This is another little gem in a strip mall- you know it's good when there always full! My dad is buried out at the Veterans Cemetary, so me and my mom would usually stop here or at a&w after. And now that both parents are gone, I still try to stop by . The hamburgers are great , but I love the zucchini  and the fish n chips are great too.. I hear they have great shakes but I've never tried. But if your in Boulder City stop by!"}
{"text":"Great service, delicious burgers and the best looking girls(waitresses) in boulder. Very friendly"}
{"text":"This is a great little hole in the wall sort of Hamburger place.  The burgers are juicy, and delicious.  The burgers remind me of something I would cook at home on the grill outside.  I also really like that they give each table there own bottles of fry sauce and ranch so you can use as much as you like without having to ask for more or pay for more.  They also have some very good ice creams and other desserts.  Everytime I visit Boulder City I go to this place and will continue as long as the service and food continues to be good."}
{"text":"This place is fantastic! It's fresh fast food that satisfies your hunger while having a deliciousness rarely found at this price.  

I had the Pit Burger with Cheese, Fries, and Cole Slaw.  The burger is a  third pound of medium well fresh beef. The roll tasted like it just came out of the oven.  This is the burger you've been dreaming about.  

The service was top rate and friendly. 

Folks if you're out by the Hoover Dam, this is your place. Go to this busy spotless burger joint and find your happy place. It's 5-Star perfect."}
{"text":"Doesn't look like much from the outside, but they can serve up a pretty yummy burger. I had the 'Pit Special' 1/4 lb. (or was it 1/2 lb.?) beef burger with fries and drink. They had this 'special sauce' on the table (don't know what it's called), but my guess was ranch, ketchup and mayo. Waitress was on top of things even though it's kind of a hole in the wall.

Good burger, good price. Need I say more?"}
{"text":"This is an amazing place to eat the best burgers I think in all the Vegas area. I've been going here for 14years now when my uncle started taking me and I always order the pit burger and onion rings witch are really the best I've had.  I'm really talking this place up but have to its wonderful!!"}
{"text":"Great spot.. good prices.. everyone enjoyed their choices..
Turkey Stack. Pastrami Stack, Turkey Burger and Traditional burger all great.
Served with Ranch or Thousand island dipping sauces.

Id come back for sure. Good service. Good Food.. what more can you want."}
{"text":"Love Pit Stop so much! I moved away but still dream of pit burgers, patty melts, fish sandwiches, fish and chips and boat loads of shoe string fries. Service is great, restaurant is clean and prices are budget friendly. Do yourself a favor and try it out!"}
{"text":"This is a great little burger place.  It's as good, if not better that the other hole-in-the0wall joints in BC.  Really good food, perfect sized portions, and reasonably priced.  The service is really good and the staff is really friendly.  If you're in or near BC, check this place out.  You won't be disappointed."}
{"text":"Great find.  Excellent food, atmosphere and service.  Clean.  Big screen TVs.  We ordered sandwiches, fries and salads.  All were fresh and delicious.  Our bill including tip was $12 per person.  You can't beat that!  I highly recommend."}
{"text":"Best burger place to go in Boulder!  If I just want to go somewhere quick for lunch I always go here although it's busy and normal lunch hours. Lol 
I usually go on off hours so there aren't that many people there.  But their food is amazing.!"}
{"text":"I've been here before a few years ago and don't remember it being as good.  That being said, on this occasion I had also just came from the Boulder City Beer Festival so I'm not sure if this is the beer talking or not lol.  Everybody always tells me how good this place is but I never have the opportunity to go unless I'm in BC.  This place is good though!  Giant portions of meat and potatoes, at least for what I got (1lb burger), great white sauce (whatever it is), small, divey type establishment but always packed to the gills both times I went.  It is definitely a locals hangout and a place where a lot of hikers go after a long day of exploring.  Check it out next time you're in BC, you may just like it as well!"}
{"text":"Excited to go try the food based on recommendations but when we entered the door we were quickly unwelcome and rushed out by the blonde waitress. Family or 3, small hungry child, only available booth. \"You can't sit there we are too busy and we close in 30 mins.\" 
Thanks but no thanks. As a person in the service industry I try to have patience for things like this... but Really Lady?!
I do not recommend Pit Stop for families who are looking for a quick bite to eat. Disappointed to say the least."}
{"text":"I don't venture off the Strip much when in Vegas, but a group of us drove out to check out Hoover Dam and were starving on the way back.  We saw the signage for this place on the main road and decided to check it out for lunch. 

We went in not knowing what to expect. Turned out to be a diner, felt clean and comfortable, was relatively busy but we were quickly seated.  We opened the menu, and I guess we're used to seeing The Strip prices, because we were like, OMG, their most basic Pit Burger was only $4.95?! I ended up going for the BBQ bacon burger for $6.95.  But what great value!  And when the burgers came, it tasted fantastic! It's not a fancy burger, but the patty was moist and well flavored and the sauce in it was yummy. It's a basic burger done really well.  My friends who had the other burgers and the battered shrimp dinner also enjoyed their food a lot. Service was OK; food came quickly, as did the bill they gave us before we even asked for it.  Overall, I'd definitely like to come back here. I'm craving their burgers again while I write this review..."}
{"text":"What's the point of Yelp anymore? It has become so self indulgent with the long winded reviews about a burger and fries. Oy Vey!

Boulder Pit Stop is pretty simple.  It's a neat burger joint with a small town feel.  $7 for a decent burger and fries is hard to beat.  If you are looking for an amazing experience....look elsewhere."}
{"text":"Best burgers in town!!! They have a great turkey burger also and lots of toppings like Ortega chilis and grilled onions."}
{"text":"Came here on a Saturday afternoon around 12:30. Place was very busy but we got seated quickly. I had the Pit burger combo (cheeseburger, fries, & soda) for $8.95. Very reasonable price and the burger was delicious. The portion of fries were huge and very tasty. I would come back here for sure."}
{"text":"Meh it will do when you need cheap eats. This place gets swamped on the weekend. Seating inside is very limited. The food is about average for a diner. The prices are pretty good , I usually go for the combo which includes fries and a coke. This place is good for a quick bite to eat, on a leisurely weekend trip up to boulder."}
{"text":"The staff is fantastic, for lunch, you can be in and out of there in no time flat. Food quality and portions are excellent and this is a very, very clean and well maintained establishment."}
{"text":"Pit Stop is a good local burger joint. It's located in a shopping plaza and it lacks ambience...but the service is good, the food is good, and the staff are friendly. It's not a destination place unless you live nearby, but If you're driving through Boulder City and hankering for a burger, this is a good place to make a pit stop to refuel."}
{"text":"Pretty good burger and fries. Very reasonable price. Better than the Luxor food."}
{"text":"I went with my brother and husband and the food was great, but the service wasn't the best.  When you walk in the front door, you walk right into the dining room and there is no room for anyone to stand.  There was a sign that said to wait to be seated and they definitely had us wait, along with two other groups.  The bathroom is also located right next to where people eat, so I would make sure not to get a table near the bathroom (YA NEVER KNOW WHAT YOU MIGHT ENCOUNTER).  I had to ask for my soda twice, but they gave us a to go cup for it when we left.  The food was great!  Burgers were awesome, fries are the skinny ones, but they have seasoning which was delicious.  My brother had onion rings, which were also the skinny ones and my husband had the chicken tenders, which I stole a bite of and were great.  They were fully cooked and the breading was crunchy.  Serving sizes were good and price was even better.  I will probably go back, but not with anyone I wanted to impress."}
{"text":"Second time here.  Ordered the Pit Burger again, and it was just as delicious the first time I ate it!
Service was great and food came quick."}
{"text":"My favorite place to eat in town! I love the turkey burger and the fry sauce is the best I've ever had. I like the new remodel too, the place looks really nice. The Pit Stop is casual dining, and delicious inexpensive food."}
{"text":"Stopped in here again on our trip back home. They have made some nice upgrades to the appearance of the place since I was here last. They front entrance has a new paint job with bold colors of black, red and white. The outdated bathroom that I always felt was dirty is all jazzed up with new tile, sink and fixtures etc. They did a great job. Food is as yummy as I remember."}
{"text":"This is one of my favorite places to grab a burger at! I have been going to this restaurant since i was old enough to sit on a barstool. They have other great options as well if you don't feel like a burger. Their fried zucchini is great as well as their chicken fingers and fish n chips. This place is located in a strip mall type parking lot but don't let it fool you, if you want great service and good food . . . Make sure you stop here"}
{"text":"2 stars for food quality and 1 extra for customer service and small town charm.

Basically, the Boulder Pit Stop is a step up from Burger King and Wendy's.  The burger patties they serve up are fairly tasteless.  So why two stars?  Well, the place serves a burger called the \"Pit Special\" that comes with \"special sauce\" (think ranch + ketchup).  It's a small touch, but a tasty one.  Combine that with a nice fresh bun and a dollop of mayo and you've got as good as a frozen burger can get (I'm assuming they are cooking frozen patties).

The fries are worth a try as well.  But be warned.  They are tasty, but so greasy that I'm pretty sure they can tear the bottom out of  a carry out bag.  Who knows? That could be a plus for some people.  It was a little much for us.    

The place gets an extra star for customer service.  Pit Stop has a nice small town atmosphere and most of the service staff seem to be local high school kids.  They served the food up quick and were great to our table and the other tables around us."}
{"text":"This is one of those places where you can go once a week and never get tired of the food . My fiancé and I come quite frequently and always get the pit burger combo . Comes with some bomb fry sauce on a well seasoned burger and a huge platter of French fries . We usually walk out the door at $25 flat including the tip for the all female waitress staff . $3 beers too by the way . They recently added a new bathroom as well so there isn't a line to the old single bathroom any longer . I'd rather spend the $7 extra here for the service and excellent food than go to a normal chain fast food restaurant . It's fairly easy to get too , right off the highway . I have nothing at all to say bad about this joint !"}
{"text":"Driving thru Boulder City on our way to Phoenix and we were looking for a place that could let us stretch our legs and wasn't fast food. WE HIT A HOMERUN! For the three of us, we ordered a western bacon cheeseburger, regular cheeseburger, fries, fried zucchini and the mac n cheese bites. All of the food was hot, fresh and cooked exactly the way we ordered. Service was a bright spot too! Wish it was closer to my home in Sparks, NV. This will be a 'must have' anytime we're in town. Thanks!"}
{"text":"Still great food, so much better than fast food joints... but the wait staff sure seems perpetually asleep at the wheel. Call ahead for to go orders since they seem baffled by the idea of people showing up to place an order for home. Plus there's really nowhere to wait without being in the way. Weird experience."}
{"text":"great burgers and fries for a mom and pop type of burger joint.
just great juicy burgers and well fried fish and fries without the corporate BS.
portions were generous and the waitress were happy to make conversation.

all waitresses were wearing low cut tanks."}
{"text":"Boulder pit stop is THE burger joint of BC. Fast, great service! My one and only issue is they have changed their burger patty recipe and it's not the same anymore :(
Please bring the old burgers back"}
{"text":"Great fish n chips.  Always my go to place on the way home from the lake.. Burgers are really good too."}
{"text":"I live way out on the west side of Vegas and have on several occasions driven all the way to Boulder City for one of these burgers.

My girlfriend and I stopped in again today and as usual the service was great. The place was really packed and we had to stand around awhile to get a table. We didn't mind as we know the food is worth the wait.

Even as busy as they were the staff remained friendly and cheerful.

We'll definitely be back again and again."}
{"text":"There are two places to have a burger in Boulder City: The Dillinger, and Boulder Pit Stop. I don't mean that there are only two burger joints in all of BC, but the only two that you should be eating at, are the two aforementioned. (See my 5 star of The Dillinger) You won't find \"gourmet\" burgers at Pit Stop, but what you will find, is a delicious, fresh, and perfectly cooked patty, with a bun that is to die for. Pit Stop is one of our favorite burger places in all of the Las Vegas area. We make the drive of 35 minutes routinely for a burger. It's also a bomber place to stop in after a good day of bike riding or hiking. They do have a \"common\" list of brew that is about perfect to wash down your meal. We've had no issues with any of the staff as they are always very friendly. At peak times, they may be a little rushed, which actually means they are so busy they may forget a refill, but that is to be forgiven, and they will make you feel welcome no matter how busy they are. We love Pit Stop and will keep stopping here whenever we just need a \"dam\" good burger!"}
{"text":"Played in a baseball tourney all the way in Boulder City, and the highlight was dining here on Saturday and Sunday. 

Pit Stop is a homey little restaurant with great service, delicious food and very reasonable prices. Plus the servers are pretty hot!  Lol

Try the patty melt!"}
{"text":"We are so glad my dad took us here! We played work hookie on a Tuesday and decided to take a day trip out to the Hoover Dam. On the way to the Dam you pass through Boulder City (if coming from Las Vegas) and the Pit Stop!

The menu is simple, well priced and sensible. We all got pit burgers, with cheese and a side of fries. The buns are soft and fresh and when you bite into the burger, just a slight amount of grease comes out so you know...it's delicious. We finished with a strawberry shake and really it all couldn't have been better. $30 for the three of us. 

We can't wait to come back and try the fish and chips."}
{"text":"This is our favorite burger and fish and chips place. We go here every time we are in boulder. Great staff and fast service. The menu is underpriced and very affordable. The fish and chips with shrimp for $9.99 is my favorite dish."}
{"text":"Yay for working in Boulder City! Every once in a while, I get to go to this awesome place. the burgers are out of this world, and fry sauce is another level of awesome and the fries are perfect. I even hear that hteir black bean burger patty is really good too!"}
{"text":"Fantastic quality at great prices. Their special sauce is amazing and addictive! Their meat is good quality and nicely prepared. The servers are nice and welcoming."}
{"text":"Hidden Gem! Hands down my favorite burger spot.  Good prices, great food , and good service."}
{"text":"This is a love story. My wife and I have been coming to this restaurant for 5 or so years, and now we have a hard time getting burgers anywhere else in the country. My wife and I met long-distance (I lived in Phoenix, she lived in Henderson) and whenever I came to town, the first thing we ate was Pitstop.

Food is legit! But first, let me tell your about the place. Pitstop (for our family) feels like an extension of home. The place is always clean, music (and now Flat Screens) are on, decorated with all kinds of Baseball swag, very comfortable. We are ALWAYS greeted, welcomed, seated as quickly as possible and we always feel as though someone is keeping an eye out just to make sure things are going the way we wanted. It has gotten to the point that Jodi (hope I spelled her name right) knows our drink orders as soon as we walk in the door and has a good guess what we might be ordering that night! Mind you, we aren't affluent people by any means, just regular peeps. She takes the time to strike up a conversation to see how you've been and what you've been up to, offers suggestions about new things they're trying in the kitchen and offers a level of sincerity about helping you. You only get service like this from people who care. The entire crew works as a team to serve the entire restaurant, and it makes you feel as though everyone is there to help you.

Okay I'm rambling, let's get to business. I come for burgers and onion rings, so I can't give a first hand account about the rest of the menu. But if you're a carnivore like me, you're in for exactly what you want. Dial up the amount of meat you want from a delicious and juicy 1/4lb Dam Burger all the way up to the 1lb monster burger. I've tackled the monster before.. It's massive, grab some napkins. Add on your favorite toppings and make it just the way you want (green chiles is a must for me though I wish they were more spicy). Fries are good but onion rings are my fave here.. Big, golden, crispy and hot.

My regular order which has been consistently juicy, flavorful and filling

Double Pit Burger Combo w/ Onion Rings
Add Bacon
Add Green Chile
Add Pepper Jack Cheese

If you've driven past Pitstop Burger in the past, you've done yourself a disservice. My wife and I can get a burger anywhere, but there is only one burger spot that we are willing to drive 20miles to get to.. 

Our meeting point, our history, our friends, our Pitstop Burger."}
{"text":"Had the best service !! 
The BBQ Bacon Cheeseburger was delicious with a Side of peanut butter the waitress suggested. Yes the burger tastes yummy with Peanut butter on the bun.my new way of eating a burger."}
{"text":"Pit stop burger with pepper jack and green chili is fantastic. 

It can get crowded, so it's hard to get in with bigger parties."}
{"text":"This place always has pretty good food and the waitresses aren't bad either.  Nice environment that was recently updated with TV's."}
{"text":"One of the best places ever have eaten there for years and they are nice. So dont listen to the bad reviews, the place is always busy need I say more."}
{"text":"This is by far my favorite burger place. We live in Las Vegas and will drive to Boulder City just to eat at Pit Stop at least once a month. The staff are so sweet and attentive. This place is always packed because their food is delicious. Try it, you won't be disappointed!"}
{"text":"Food was fast, and good for the most part. The fried zucchini tasted a little weird but everything else was great. Wait staff were nice but kinda hovered too much when we were done and it wasn't like we were lingering too long. Kinda reminds me of a very casual burger joint."}
{"text":"Best burger around. Worth the 40ish minute drive from Downtown Vegas. Pit burger special with cheddar cheese, bacon, and grilled onions is my recommendation."}
{"text":"Thank you Yelp for pointing me in the direction of the Boulder PIT Stop.  If you wanna eat burgers and fries stop in!"}
{"text":"Went here after a day of hiking outside Boulder City.  Not a lot of choices for eat spots in BC and given our cleanliness level after hiking this place worked out.  Nothing fancy going on here, just a good greasy spoon.  I was with several friends, all of whom had some version of a cheeseburger and fries and all were pleased.  Good burger, fries and onion rings and the price was fair."}
{"text":"If you are looking for quick, Delicious food.......stop here!

It was a Friday, we had just pulled into town and we were HUNGRY.  Stopped in based on Yelp reviews.  Glad we did.  There were only 3 tables vacant....place was busy......had drinks in a few minutes, our server was Shaye-Lynn....she was great.  Hubby loved she was a Bronco fan and they chatted.....best fried cod I have had in ages....shoestring fries.......hubby's Patty Melt was HUGE and very tasty.  Portions were above normal and the place was C L E A N !!!!   They had 2 high school boys walking around and keeping the tables and floors clean......they were very polite.....\"excuse me sir, may I take your plate if you are finished?\" 

We will go back for sure!"}
{"text":"Totally worth the drive! I try and come in once a year and it's ALWAYS good! And great value. A lot of delic food. Best burgers, and fish n chips. Even the veggie burger is to dye for. It is also a very clean restaurant, even the bathrooms were spotless. lf you are within driving distance, you must go."}
{"text":"I was looking forward to the great fish & chips here as well as one of their better than average turkey burgers when I returned to live in Boulder City. Saw immediately that they've even renovated the place and it looks better for sure. We would literally have a meal here at least once a week before, it was that good and the friendly service was top notch. We brought many friends who live in Henderson & Vegas here and they too loved it.  So, why the 3 star review you ask? Two glaring reasons which my family, friends and I can't tolerate. Service is now just mediocre, all the friendly faces like the two Amanda's are gone and they keep the TV on FOX News all the time. I'm not even a sports fan but would prefer that over your current choice. In the past they played old school vintage rock & roll but now they have country music. Oh well, whoever's in charge now has lost our dine in business and we won't be bringing friends any longer. Not that they care."}
{"text":"This place is an institution. If you grew up in Boulder City and moved away, you want to hit the Pit Stop whenever you come home. The service is great. They are the most friendly and some of the most beautiful people you will find. I am not talking about physically beautiful (even though they are), I am talking inner beauty. They are the kind of people that ask how you have been, if you have not been around for awhile."}
{"text":"I've been to Boulder PIT Stop a couple of times and had good, friendly service and tasty food on both occasions.  This restaurant is located in the small strip ajacent to the larger Haggens (fka Vons) strip backing up to Buchanan Blvd.

On our last visit we started with the onion rings and fried zucchini with ranch.  The onion rings had a light beer batter and the zucchini had a denser coating.  Both are fantastic if you're in a fried kind of mood, but very filling.  

Then we had the Chef Salad and the Bacon Cheeseburger.  These were also both very good.  The salad had a lot of meat and cheese, a whole egg, and crunchy veggies.  The cheeseburger was cooked to a perfect juicy medium with crispy thick bacon.  Yum.

Lastly, don't let them know this, but the prices are seriously low compared to similar restaurants."}
{"text":"This is a great  local spot that  will reminded  you of  what good food  and  old time customer service  was like in the day.  The spot is local and the  food  and staff are great!"}
{"text":"Quick great service. Stopped here on our way to Hoover Dam and glad we did. Staff is courteous and although the place was we were in and out. Can't beat the price."}
{"text":"Stopped here for dinner while visiting the area. The place seems like a place that's a regular stop for locals. It has a friendly vibe. The food was just ok. I had the salmon salad and the salmon was lukewarm and not a great tasting. The service was pretty fast, but our server wasn't that attentive."}
{"text":"I always get the Jr.Pit burger combo (fries & drink).  The fry sauce is yummy, they also give you \"fry salt\" (like seasoned salt) to put on as desired.  BTW, they have Pepsi products.
So glad my friends introduced me to this place!"}
{"text":"My wife and I came here with our young daughter. We were very impressed with the food and the service.  The restrooms were clean and the tag team service was exceptional.  We will definitely drive down from Henderson again."}
{"text":"I was in town for training for a week and the crew stopped in for lunch one day. It's very economical. Food was good considering how inexpensive it was. An overall good value. Staff was friendly and attentive to refills which is always nice. This is a great place to grab a quick bite to eat."}
{"text":"Really busy during lunch on the weekends but there service didn't suffer. 
Had a table within a few minutes. 
I had a pit burger and fries. Both were really good. 
My boyfriend got the fish and chips but instead of regular chips he got the chili fries. They were very good and the fish was huge."}
{"text":"Grew up going to pitstop, especially after exams on school. I'm never disappointed.  Get fries and a shake! You're welcome"}
{"text":"Very good food here at Pit Stop!! The staff are very nice and quick to get your food out to you. The location right off the main street and could be a little hard to find if you're not too familiar with the area. Pit Stop is usually always packed with people and it is not a big establishment, so you could feel a little crammed in a tight spot eatery. Again the food is delicious, I never had a issue here. I recommend visiting Pit Stop if you're going to visit on your way to Hoover Dam."}
{"text":"I'm a local and my mom is in town. We were coming back from Hoover dam and saw this place. The place wasn't crowed and it was clean, fast and friendly place. Food was absolutely delicious and fresh. We had burgers and my mom had fried shrimp. I will be coming back! And oh prices were very good!!!"}
{"text":"Finally made a visit since it's been on my list for awhile. We were seated right away and our server was quick to take our drink orders. We ordered a few burgers, fries and the chefs salad. The food came out quick and looked good. I really liked how they gave each table a bottle of ranch and fry sauce. That's so much easier than having to ask for those little cups. The salad was good. Nothing too special. The burgers were delicious as well as the fries. The fry sauce didn't taste like other fry sauce that I've had but it was still good. It was more runny than what I'm used to and had a slight vinegar taste. Still good. Our check with tip was right at $40. Here's my only complaint about this place...why do the girls wear those tiny little tank tops?! I have noticed that almost all little eateries like this in Boulder City have their workers wear these shirts! WHY?! If you have good food, why do you need to have boobs hanging out all over? I'm a chick and was distracted my the busty girls running around the place. There was one server that I seriously couldn't stop staring at. She was young and very large chested. The tank top was SO low! Like inappropriate low. I don't understand why they can't have the girls wear a womens tee shirt? It would look so much better. I get it, sex sells but it shouldn't be the focus of your hamburger joint and that's what I took away from this place more than what I thought about the food."}
{"text":"Love the fish and chips. This time the fish was a little over cooked. The Pit burgers were good. The fries were OK"}
{"text":"For my first trip here, I was pretty satisfied. Walking in at 3:00 on a Tuesday afternoon I was surprised at how busy it was. 

The staff was very helpful (3 different people teamed up to cover our table of 2). The food came out in a reasonable time. One basket of the well seasoned fries was enough for 2 people. The burgers were cooked just right. I tried the Mushroom-Swiss and it hit the spot. For some reason the fountain Coke even tasted better here.

Next time I'm in BC, this will be my lunch time stop for sure."}
{"text":"The burgers, fries and customer service was outstanding. I live 20 miles away and its worth the drive. The best burger I have had in Vegas thus far. Keep up the good work. Hats off to the chef!!!!"}
{"text":"Open wide for a mouthful of homemade goodness!

A small unassuming diner located in the middle of nowhere-BoulderCity, where burgers & sandwiches are still fashioned in the ways of old & service makes no compromise of treating you right.

That said while everyone raves about the burgers, its smaller cousin; the sandwich stands out in it own limelight. Hot juicy roast beef, served over rich buttered sour dough toast (over their griddle most likely), topped with melted cheese & a slice of tomato. Perfect!

The first bite which instantly transported me back to days long forgotten, where afternoons comprised of this humble snack & homely warmth. (An experience that mirrors a scene from Ratatouille). Prompt & keen service even during the lunch rush, while in hindsight service at the city marks low in comparison to here. 

If you're in the area, stop by, if you're not in the area make a reason to stop by, if you're starving & really need to use the bathroom stop by!"}
{"text":"This place is Tiny!  But,  they have really awesome burgers!  Service was quick and it is the lunch rush.  Wish I would have tried a shake as well."}
{"text":"We decided to check a little hole in the wall place for lunch when driving through Boulder coming back from the Hoover Dam. We found this place via Yelp and from the outside it looks like a little dumpy place, but when you walk in, its actually pretty big inside and nice and clean. We got confused when the sign at the front of the restaurant says \"please wait to be seated\" and then a few minutes go by and a waitress just says sit wherever you want. The waitress was nice and got our order all correct which was a plus. The side of chili fries can be a meal in themselves and they were really good. I had a cold turkey sandwich and it SUCKED! The bread tasted as if it had been sitting out for a few days and in a whole the sandwich had zero flavor. We couldn't exactly figure out who our waitress actually was because the person that took our order was different then the person who delivered it and even different then the person who dropped the check off. We did notice the waitress liked to spend a lot of time around the kitchen area playing with their hair.........which is so gross in a restaurant and just chit chatting. It took 10 min to get mustard for my gross sandwich all because I couldn't get anyone's attention.  

All in all I should've stuck with just the chili fries and that's all..... prices for things look cheap, but that's because sides aren't included. This restaurant has potential, hopefully the waitresses can pull their hair up and figure out what tables they are working."}
{"text":"Nice mom and pop shop ! Customer service was very welcoming felt like I've been there before. I forgot why I don't eat greasy foods I'm going to regret this tomorrow. I had one of their famous damn turkey burgers and fried mushrooms. Next time I'm going to have to try something without grease."}
{"text":"The best part about coming home from the lake as stopping at Pit Stop and having a delicious lunch. There's nothing on the menu that you can order and be unsatisfied with."}
{"text":"Late review I think I was here back in early May but wanted to leave my review because this place was worth stopping at. 

They offer a huge menu selection with a great amount of variety from salads to burgers to dinner entrees and breakfast. I had the chicken fingers and fries and my friend had huge burger and fries. The salad was super fresh. The dinning room is small but the tables were clean and server was very attentive. I wish I had remembered to take photos of our food next time I will totally do that and update my review because I totally plan to take my boyfriend here to eat."}
{"text":"After living in BC we still talk about their burgers. While driving back to Phoenix last weekend, we called in an order and choked down on our drive home. 

The buns have changed, but that's about it. Still my favorite burger anywhere. I always get the pit special with cheese. They have a perfect ratio of burger to cheese. I'm telling you. Pit Burger yummy. 

The fries are good and don't forget the fry sauce. They also have great ice tea. My daughter worked here back in the day and never had anything gross to say. 

The fish and chips are also great!"}
{"text":"Great food! I've had some of the burgers but my favorite is the grilled ham and cheese! Seasoning for the fries is a must. Sometimes a wait because it is so busy so just expect that."}
{"text":"My husband and I came here for dinner. He got the fish & chips, and I got the pit stop burger with American cheese and bacon (cheese and bacon additions were an extra fee). The waitress told me all burgers are cooked medium well and asked me if that was ok. I was fine with medium well but when I got he burger it was well done. That really wasn't a deal breaker for me, but if you're particular about your burger it might be a deal breaker for you. The fish and chips were good; the fish was nice and crunch. My husband asked for lemon and malt vinegar when he initially ordered, but it didn't come with the food (he didn't ask the waitress for it after the fact just to be fair to the wait staff). Fries weren't anything special. Some people said the fry seasoning was good but our fries weren't seasoned. Overall the food was just okay, but affordably priced. 

The wait staff was very attentive. We had multiple waitresses check on us. Some people in pervious reviews saw this a negative, but I don't see the issue. 

Overall: we'll be going back for a quick and affordable meal."}
{"text":"I love burgers and fries and this place is the best at both! They have a full menu for all, the burgers are fantastic and your meal comes with you own basket fries that are golden and crispy! Plus the bonus, they have their own fry sauce and shakers on the table of this crazy awesome seasoning. Love this place, totally worth the trip. Also, service is always friendly and fast."}
{"text":"Rarely am I so impressed by a burger joint, both delicious and affordable with a menu that could keep you coming back to try new things.

the only reason it doesn't get the fifth star is that I could feel the grease pains later; that being said, the fries were amazing, even though the fry sauce was not worth the hype."}
{"text":"Small Town Diner.

Good home cooking.Simple as can be.

Seat yourself-1 sided menu and fast & friendly servers.

According to TripAdvisor they have the BESt burger in Nevada! 

I've been here before & I still stick to the fact that its a frozen patty-nothing special.

However the BBQ Beef & Pastrami on Rye are Fantastic sandwiches.

THIS place is for you if you are looking for Great prices and great sandwiches."}
{"text":"A favorite of mine when in Boulder City. Not because it's iron chef quality food, but because you can't get fresher, quicker, cheaper, and tastier burgers at any fast food restaurant in town. Friendly service, simple menu, and family orientated. Awesome."}
{"text":"4 solid stars, my rating hasn't changed. Haven't been to the PIT Stop in over a year but none the less it is still serving up good eats.

Skip the menu, go for the PIT burger comho. You get a choice of cheese - I go with American.  Fries are legit, no complaints. This is no frills meal deals here. PIT burgers come with Thousand island dressing, tomato, diced onions, and shredded lettuce.

Also got a side order of mozz sticks. Fried just right. 

If you're in Vegas you may want to make a trip out to BC to check this place out."}
{"text":"We popped in on an extremely busy Saturday after visiting the train station with our boys. My husband grew up eating here and I had to try it and I wasn't disappointed.

Don't expect to find brioche buns and Gruyere cheese here. It's pretty plain and simple but also very good. It's a tiny little place with fair prices.

Fry sauce and ranch alone were amazing.

If you travel all the way out this way, definitely worth stopping in and seeing what it's about."}
{"text":"Pit burger is one reason to visit Boulder City. The burgers are delicious, the wings are small but have a fantastic taste, and they have my wife's favorite fish and chips. Everything we have tried there is awesome , especially when you consider the price.  Worth the drive from Henderson."}
{"text":"The Pit Stop reminds me of the Mom and Pop's stops back home in California.

I've had the fish and chips and I've had the burger.  This is exactly how a burger is made!  This is how fish and chips are suppose to taste.
Fry Sauce!!  It's the perfect sauce for your fries.  I however mixed it with my ketchup. 
Some of the people in Henderson and Vegas need to take notes on this place.  They have excellent customer service, the owner is a Los Angeles Dodgers fan, and the food is awesome.

By far...  This is one of the best burgers spots in NV!!"}
{"text":"I found this place on yelp.  We had been sightseeing and needed a bite to eat.  The burgers are decent and the fries are good.  There was confusion with the order, but they made it right.  And their iced tea was old, cloudy and tasted horrible.  They took it off my bill and I had water instead.  They don't have any decent mustards.  Just ketchup, generic yellow mustard, and their special sauce (similar to thousand island dressing).  I like my specialty mustards but ended up with ketchup and mustard on my burger.  I'm not a huge fan of thousand island.  I'd try it again when I'm in the area.  I'm sure you'll have a better experience than us."}
{"text":"I am aware of the fact that this review is of the minority that contrasts from the greater number of four and five star ratings in addition to accolades that include the Las Vegas Review Journal voting it the Best Burger in 2012. However, Yelp is real reviews by real people, and this real person has had five three star experiences here.

 From the first weekend of October when I attend Art in the Park until early June when the summer temperatures heat up the desert, I frequently spend time hiking the backcountry adjacent to Boulder City. The reality is that I have spent more time in Boulder City the last year than downtown Las Vegas making me more of a local that lives in Henderson than a tourist. A major part of my Boulder City backcountry adventures has been either the pre hike breakfast or the post hike dinner. The Boulder City Pit Stop has been one of the local restaurants that I chose for my post hike dinner. I have dined here five different times giving the Boulder Pit Stop five chances for that exceptional meal. There were three times that I ordered the Pit Burger with fries and a drink, one time that I ordered fish & chips, and another that I ordered a BLT with fries.

 The Boulder Pit Stop is a Boulder City legend that has been a part of the community for thirty years. It is located at the intersection of US 93 and Buchannan Boulevard in a pad at the 99 Cents Store Shopping Center (where CVS formerly was). The restaurant offers plenty of free parking spaces. It is a medium sized restaurant with two rooms. The main room features an open kitchen where you can watch them cook. Throughout the restaurant in both rooms are pictures of sports memorabilia and flat screen TVs.

  The first time that I had dinner in the Boulder Pit Stop, the customer service was outstanding. The token gesture of my waitress offering me a Coke refill to go left a positive last impression. If this exceptional customer service endured, I would have rounded up my rating to four stars. The fact is that the customer service the next four visits were good yet nothing exceptional. 

  In contrast to several reviewers, I was not overly fond of the Pit Burger. I found it to be good yet not exceptional. Although there is a debate between the Dillinger and Pit Stop as the Best Burger in Boulder City, in my opinion after trying both restaurants with Fox's Barbecue, I rate Fox's Barbecue the best in Boulder City. This is based on the Pit Burger, the 1/3 patty burger. At first glance, the burgers seem really inexpensive. When you look at the menu, you'll be like,\"$5.45 for a burger!\" That is before you add $2 for French Fries or over $4 for onion rings. Cheese is 75 cents extra. Toppings are 75 cents extra. With a bottomless Coke at $2.50, French Fries, mushrooms, and pepper jack cheese my last visit came out to $12.39 before tip. If I had ordered bacon as I did in the past, it would have added up to more than $13. The mushrooms by the way tasted as if they came from out of a can. The following list \"Burger Time\" shows the burger places that I reviewed and where the Pit Stop stands in comparison: https://www.yelp.com/list/burger-time-las-vegas-10.

  On all five visits, I ate their French fries. These are the skinny fries that they serve in a large portion. They had a solid taste. Even when I complimented them with the Ranch or Fry sauce that is on every table. For the record my favorite Boulder City fries are the potato wedges that Chilly Jilly's serves.

  There is a sign proclaiming that they are known for their fish & chips ($10.95). There was one post hiking dinner that I gave the fish & chips a try. Just like the Pit Burger, I thought it was good yet nothing exceptional. Customarily I am used to three pieces of fish when I order fish & chips. If the two fish & chips were exceptional there could be an argument for Pit Stop serving two. The reality is that I have had better fish & chips in Las Vegas restaurants including the Five Star Tavern and Village Pub. 

  On my last visit on April 24, 2018; I would try their BLT. The BLT is my quality identifier of a restaurant. If a restaurant skimps on bacon, it tells me something about the place. This would be a reasonable quality identifier considering that in the past I have had a BLT in five Boulder City restaurants that I have rated on Yelp. With 1 being the best and 5 being the worst, I placed the Pit Stop BLT at number 4. This is the list below:

1. Southwest Diner
2. Coffee Cup
3. Lil City Diner
4. The Boulder City Pit Stop
5. The Restaurant in the Boulder City Inn
 
From ordering at 3:53 p.m., it arrived on the table only five minutes later at 3:58 p.m. With fries and a Coke, it came out to $9.47. Not a bad price for a sandwich that was good yet not great.

The Boulder City Pit Stop is a diner offering a variety of food that is open relatively late. There is the possibility of me returning to this Boulder City institution a few more times with an updated review."}
{"text":"If I am looking for a burger place in Boulder City then I head toward the dam for a Pit Stop. Bad a bup (restroom is for one and clean FYI). But seriously, they are right by the busy intersection of BC. Its quite busy at dinner time too. Locals love the place as much as the rest of us. It's a very tiny place but they serve big tastes. We are part of a Jeep group. (Being Asian I drive a Toyota in there. Reliability damnit!) After mudding through the flat beds near Nelson we came here for lunch. Everyone ordered the Pit Burger. Some had beers for lunch, which they have. For us light weights, the finest Coke on tap was ok. Free refills here FYI. The burger is cooked right and the fries are generous and crunchy. Honestly, I can eat two. With the distance it takes to get here, I probably should've. The burger is not greasy and it has a nice char to it (weird guy in a plastic King outfit need not apply here). I skip the special sauce which is usually Thousand Island (where did they get that name? Seriously, that's a lot of islands. And why did they go around making salad dressing, in an island? As perplexing as why there are Chickens in the Sea to me.) Tidbit, you can ask and get the onions grilled as well. The chili fries tastes awesome and it's served on a plate with plenty of chili and meat. You have to eat it with a fork. This place has been here for as long as I can remember. There used to be another burger place that was just as good but served theirs differently. Starburger but alas they went Supernova and no longer here (it's replacement is not it, trust me) There used to be a 50s diner here that served food from the 50s and had decor from back then, it's gone too. But still standing here, is the American burger plain and simple @the Pit Stop. Service is always fast and friendly. So if you are on the way to Hoover Dam, milling through the old town, or went wandering away from the casinos, I recommend this place."}
{"text":"Best place in town to get a Burger. And he fry sauce is amazin!"}
{"text":"My friend and I dropped into this little burger spot in Boulder City on a whim. We ended up splitting a  Pit Burger and some fries. Pretty good burger, decent fries and AMAZING sauce. Service was great- they even let my friend plug in her dead phone for a quick charge while we ate! All in all a reasonably priced little spot that makes a decent burger."}
{"text":"Great burger and service and sauces!!! Friendly service too... stop on the way to the damn..."}
{"text":"Service was fast & friendly. Food was served hot. Everything was delicious. I got a made to order burger, fries and coffee for well under $10.00
Such a better alternative to the fast food places nearby. 
Will definitely recommend and will definitely return."}
{"text":"Best burgers in Boulder City. Always has awesome deals and timely service. Best Malts in Boulder City, as well!"}
{"text":"What a nice mom & pop place to eat in Boulder City! EVERYTHING was delicious (I had the chicken tenders dinner) and the fries were out of this world! Not greasy at all :-) Their fry sauce is also delicious! Affordable and very yummy!!!"}
{"text":"Used to be better. They changed the Philly chicken cheesesteak. Haven't been back since."}
{"text":"First time visit.   Restaurant very busy, but, was seated right away. we ordered right away a BLT and fries, and Pastrami and rye with side of onion rings .  Well as busy as they were, meal came very fast , hot and delicious Compliments for the 
fryer cook, both fries and onion rings  crispy and not oily. Both sandwiches excellent. Waitresses did a great job  quickly taking order and delivery.   Will be stopping at this restaurant again to try burgers"}
{"text":"When I am in Boulder, this is my favorite place to eat. The location appears tiny, but it's very roomy and every time I've been there at different times, has always been full of customers and I can definitely see why. They have the best burgers ever and at an amazingly reasonable price. I have eaten at expensive burger places on the Strip and none of them come close to the quality and flavor of the Pit Stop. The meat on the burgers is so tender and juicy that I don't even have to use condiments, and that's saying something because I'm a huge fan of ketchup and mustard.

My second favorite thing on the menu is their club sandwich. It's never soggy and has the right proportion of everything so it's just the right size. 

Also, the mozzarella sticks great. They aren't greasy while at the same time having the right amount of crunch on the outside. 

When I get the chance I bring friends and family visiting from out of state because the quality of the food is so consistent, I know they will love it. So far no one has been disappointed."}
{"text":"Very solid burger and fry joint.  As some yelpers have noted, each table has its own fry sauce/ranch bottles.  It's a small touch, but it's nice.  I found the sauces to be a little thinner, but not watery.  I've not had issues with the cleanliness or appearance of the restaurant like other yelpers have.  All in all, you can get a very solid, and large, burger for a good price.  It's a repeat, and it's why it's been in Boulder for so long."}
{"text":"This place is great. Great hamburgers and great service. Whenever I get a chance I go there to eat. I was introduced to this place by my mother in law. I recommend this place to everyone. Next time you come to Las Vegas make you way to the Boulder City Pit Stop."}
{"text":"Super quick, efficient, and friendly. The waitress sat down at the table with me to discuss my options."}
{"text":"I've been going to Pit Stop Burger for many years and can't believe I haven't reviewed this place yet!! Not only do the have friendly servers and excellent food their prices are seriously reasonable. 

Pit Stop Burger is located right by the turn off to the dam. Just a quick detour into the Vons parking lot. It's a tiny cafe where you seat yourself. Their waitresses are always quick and friendly. I've even had them offer me to go cups for my drinks. 

Their menu has something for everyone. They offer you classic sandwiches, salads and of course burgers! Some of my favorites to order from here are the Pit Burger Combo which comes with 1/3lb burger, frys, and a soda all for $8.95! You can even add a domestic beer for  $0.70 or a import for $1.25. Sounds like the perfect combo to me. I also really like the Chef Salad. It's huge and comes loaded with ham, turkey, swiss and american cheese. If you feel like a sandwich the classic Club sandwich is always a great choice. I must mention that when ordering frys or any other fried goodies they give you a squirt bottle of Ranch and Fry Sauce!! So awesome!!!! 

Next time your cruising through Boulder City make sure you hit up Pit Stop Burger. You just can't go wrong with a place that serves a kick ass burger, has excellent service, doesn't brake the bank, and an amazing feature squirt bottles of Ranch and Fry Sauce."}
{"text":"Delicious burgers!! Quick service too. I don't usually order burgers but decided to try one of theirs, might just order more often if this good."}
{"text":"3.05 stars

I figgered I orta eat me a burger er sumthin' right quick 'cause I went ta feelin' a might peckish so I rolled on into this here spot when I seen that there Pit Stop sign 'cause I figgered I could Pit 'n Git on down the road.

I ordered up one of them Pit burgers with some good 'ol swiss cheese (I ain't know a lot about them swiss but I like that there cheese even though they ain't figgered out how to fill in them holes in the cheese yet) and some mushrooms and green chili.  I axed for onion rings instead of them fries 'cause I just been eatin' up on a whole mess of fries for a stretch and I needed me a change of pace.

Well that there burger shore did hit the spot.  Them green chili pieces was right nice 'cause they put the whole dad-gum slice of pepper on that ol' boy but it ain't had no bite to it no how.  Them Pit Stop onion rings was ok and all but I ain't writin' home to mama 'bout 'em or anything.

I reckon if I was a hankerin' for a burger 'round these parts I'd make me another stop in this here restaurant."}
{"text":"This place is very casual, low key and clean. Cool Mom and Pop kind of place.  Been wanting to stop for awhile, we finally made it. Excellent hamburgers, tastes like real meat no fillers, quality and not too greasy. The grilled chicken was very flavorful. There is a lot of fried food, fish and chips, fried mushrooms, onion rings... but there are also healthy choices and fat free dressing. They have unique sauces, board specials and big drinks with free refills.
 The wait staff were friendly and young. The men will appreciate the pretty young waitresses. I don't care what anyone looks like as long as service is good and respectful and it was.
 The only drawback was that the fries are thin, and that is not a favorite on our end. I think a choice of steak fries would be nice.
 If you just want good food and no nonsense go here.
 We will be back. Can't wait to try the fish."}
{"text":"This is a perennial favorite of ours. We have been coming to this location at least once a month since 1993 with never a bad ecperience."}
{"text":"Took the entire family Wednesday night to Pit Stop. FAST service, great quality food and the kids all enjoyed a chocolate shake with their meal."}
{"text":"I had heard about Pit Stop through my searches for good burger joints through Yelp and finally made it out there to give them a try.

The first thing that surprised me was I thought they were a basic fast food burger stand but instead they are a sit down restaurant with waitress service- no counter. I didn't want to eat in but luckily they do take out service. 

I ordered the house special Pit Stop burger with cheddar cheese with fries and drink and sat down at a table to wait for the order.

I see a lot of people in reviews here knocking the place as shabby and run down. Well, yeah it is a bit well worn, but it's a burger joint- a local dive. What do you want? I think it has it's charm and while shabby, it is definitely not what I'd call dirty. I think I saw in some review below a girl said it was so dirty she had to throw up in the parking lot???? Seriously???? Come on now!

OK, to the food- The burger was surprisingly good. The beef had a rich taste and some crisp crusty bits from frying on a flat top. Nice melted cheddar and a mild thousand island burger sauce added to the overall good experience. I would definitely recommend the burger as above average IMO. The fries were average middle of the road quality but were a nice hefty serving of them. As for the fry sauce talked about, I really didn't like it. Too loose and whatever that spice is in it, I just didn't dig it.

Price- My meal was just about $8.75 or close to that I think, but since you have waitress service even with a to-go order I felt obligated to tip the additional $1.25 bringing it to an even $10. Kinda pricey.

One more note on the restaurant staff- there were about half a dozen waitresses on duty and all of them seemed to be young and rather hot girl next door types. I guess that is a theme of the place and I guess that will help the guys, at least, from noticing the dings and scratches on the chairs and tables."}
{"text":"The kids love coming here. Great burgers and this is where I come to get fish on Fridays. Can not beat the prices either. Glad we found this place"}
{"text":"The burgers are excellent. The fish and chips is super. Shrimp and chips are pretty good, too. The real deal is the fish and shrimp combo dinner. The place is clean. The staff appears to be mostly high school senior to college-age females who have been very well trained in friendly and efficient customer service. Prices are low. Portions are large. A home-town, long-time Winner."}
{"text":"I was on a 4 day 3 night hiking adventure and I ended up driving through Boulder City around dinner time.  This would be my last chance for real food before I found a place to stealth camp.  I did a quick search and found this restaurant.  I figured anyplace with over 100 reviews and maintaining a 4 1/2 star rating must be good.

I ordered a bacon cheeseburger, fries, and a beer.  I received my food in under 10 minutes and it was really good.  Burger was nice and juicy and full of flavor.  Fries were also good, and they give you lots of them.  The price was $8.95 (not counting the beer) and I would consider that a value.  Definitely worth it.  

The restaurant was clean and my waitress, Susie, was very attentive.  The place seemed over staffed (it was still early though) and while all the waitresses were centrally located, they kept busy and whenever someone walked in the door they immediately responded.  

I am very happy I found this place."}
{"text":"It's no secret that some of the best places in Las Vegas are not actually IN Las Vegas - like the Pit Stop!

I was jonesing for a burger and didn't feel like paying $14.00 for a side of fries at Gordon Ramsay's so I ventured outward and found this awesome little shop. Do five stars tell you it was the best burger I ever had? No, because it's not, but it was damn good. The five stars are for the TOTAL experience. 

In my fatty fat days I would have definitely ordered the 1 lb mega burger but opted for a \"Double Pit\" with three kinds of cheese (American, Cheddar and Pepper Jack - $2.25 for all three) and a basket of fries (for a measly $2.00 extra). I, or course, added jalapenos, pickles and raw onions because that's how I roll. 

Burger was delicious and satisfying; fries were hot and tasty. $2.50 for a fountain Coke but that's the way it is. Service was extremely friendly and gracious! I also loved the baseball theme of the eatery. 

All in all, a $16.50 well spent and a place I will definitely hit up again when I come back."}
{"text":"Since we live closer to Boulder City, than Vegas we choose this place time and time again. Boulder City is a small town with tons of heart, this burger place is no different. No frills, just good food and friendly service. The shakes are so good. The burgers are just right, and he fries or zucchini's or even the onion rings are made just right. Everything is so well done. Check out the wings, sooooo goood."}
{"text":"Five stars for this place.  Absolutely.  

I went to college in Pittsburgh and most people don't realize that Pittsburgh has some kind of local contest for who has the best fish sandwich.  Well this place, way out here in Boulder City could give any of them a run for their money.  And then...OMG the fries.  Shut up!  They're like the old McDonald fries back in the way back when they were cooked in lard and salted to perfection.  Finally, way beyond my expectations or highest hopes, the ranch dressing is that amazing Midwestern kind of ranch.  Pittsburgh, look out.  

Cute little restaurant inside.  Clean. Price was ridiculously low.  $10 for my meal and there was enough for two meals (but I ate it all at once)"}
{"text":"Great hamburgers, was really glad that we found this place.  Quintessential greasy spoon with great fries, but the burgers are really the star of the show.  I'm sad that we are in North Carolina and I'll probably never get to go back here.  You could tell that the locals eat here."}
{"text":"Living in Henderson for many years all my friends drive out to Boulder City to come here.  I am thinking wow that is far but it really is only 15 mintues from my home - go figure.  I finally made it her yesterday with myself and three kids.  I ordered the turkey burger with fries, two cheeseburger kids deal and one chicken strip kids meal.  The service was quick and the food was awesome.  My turkey burger had wonderful flavor and I tried the kids meals and I can say they were all good.  Now, the big hype of this place \"Gotta try the fry sauce to Try the fry sauce to fry sauce rock\"  Yes! Yes! Yes!  I don't know what is hidden in that secret bottle the fact that they keep it cold and the fact that is had a wonderful taste - I am sold.  We will come out in the future.  Loved it!"}
{"text":"Saw this place on TV and went to check it out.. yummy! lots of people, some long waits but it is a small joint with awesome food. The servers are courteous and helpful even when they are overwhelmed with customers!"}
{"text":"We were just passing through and stopped in.  Everything was amazing!  I had the Dam Burger!  Their secret sauce is great too! Our server was excellent!"}
{"text":"We really like their burgers! We come and get burgers at lease once a month. Their fried zucchini is also very good. 

We tried the pastrami the other night and I didn't think it taste much like pastrami...more like roast beef."}
{"text":"This is my favorite place to eat in Boulder. I live in AZ but I try to eat here every time I'm in Boulder city. The fry sauce is the best! We always have to order extra because it's so good. Love Pit Stop! I would recommend this place to anyone."}
{"text":"After hearing about this place from a co-worker for a couple of years, I finally had lunch with her there today. I'm not a big burger eater, but curiosity after all this time got the best of me. First of all, the prices are pretty cheap considering it's a casual, sit-down joint with waitress service.  I had the DAM burger special, which is 1/4 pound beef patty, fries, and a drink for about $6.50.  I added mushrooms and Swiss cheese, which were .50 each extra.  I was disappointed that the mushrooms were not fresh, but canned--blech.  The fries weren't bad, but I wish I had ordered onion rings instead.  The good news is that the service was very attentive, even though it was busy and there were customers waiting for a table.  Overall, it wasn't a bad meal, but just okay.  If I'm going to eat that much grease, I want it to be on something so good that I don't have food remorse afterwards; this wasn't it for me."}
{"text":"I drove 45 mins from North Las Vegas for a Green Chili cheese burger and I wasn't disappointed"}
{"text":"Typical American fare. Burgers, fries, beer battered shrimp, fish and chips. Quite honestly, one of the best, and cheapest, burger joints in Clark County. The crispy chicken sandwich is amazing, and the beer battered shrimp dinner is quite good. 

You get good service, but go early on Friday and Saturday nights as sometimes it is literally standing room only. Great for a cheap option any day of the week."}
{"text":"Went here yesterday (7/10/11) with my two sisters to grab some lunch. When we walked in, a waitress told us to sit anywhere. We grabbed a booth by the front door. We were handed menus and that was that. A girl was sweeping around the tables but didn't say anything to us. She then went on to bus tables. After 10 minutes, I told my sister, \"If somebody doesn't come by in 2 minutes, we're leaving.\" Two minutes later, we left. 

I wish I could tell you how the food was, but I would have had to have had my order taken by somebody. There was a table of two girls, probably in their late teens, that were also just sitting there, also without drinks, waiting for somebody to come wait on them. An older couple was looking around frantically for somebody to take their order, but they did have drinks. Ridiculous.

They definitely get one star because I ended up eating at that P.O.S. restaurant Big Horn on Arizona Ave. when I wanted to eat here."}
{"text":"My boyfriend and I were having a debate about our favorite burgers in BC. He is a fan of Pit Stop and I am a devout fan of The Dillinger. I had never been to his place, so he insisted on taking me for lunch.

This is a cute, family owned place that has expanded over the years. It is still a small place and I can imagine there is usually a wait.

It's casual and the service was decent. I had the patty melt and my BF had a double (I think). We shared a side of fries. Everything was fresh and well made and I will definitely go back to try other things. Overall, it was a good experience - however I think I still prefer my spot to his. :)"}
{"text":"Boulder city's hidden gem. The food is good I usually order a turkey burger with BBQ sauce. It is very filling and tasty. The employees are alright. I like their leniency on the uniforms. It keeps it very casual. One thing ive never tried from there was the fish because I think it comes from lake mead. I wouldn't eat that."}
{"text":"The food was really quick to come out and was really good! We had two girls that were helping us, one was really nice and helpful and the other girl was our \"server\" but she kind of had an attitude (she was wearing red converse) over all everything was good tho so I gave 4 stars"}
{"text":"I just had the Double Dam combo at Pit Stop. Not only was the food excellent, but the service was exceptional! People who train waiters and waitresses would be smart to study what they are doing here because their service is better than nearly every restaurant I have ever visited. I was looking for flaws and sincerely found none. I will be back soon to try their fish and chips that I hear so much about as a resident of Boulder City, NV. Try Pit Stop, you'll like it!"}
{"text":"Stopped by for a quick bite to eat after a day at the lake. I got the hot beef sandwich with onion rings and the table had fried mushroom. Everyone was so happy with their meal and the kids are all their food! Great service too."}
{"text":"Though I am now a vegetarian, this was always the place to go whenever we are in Boulder visiting my in laws . The burgers are simple and delicious, the fry sauce is outstandingly delicious, but for be the hidden treasure is the fried fish! I'm confident know better what you order you will certainly enjoy your meal."}
{"text":"This little Mom & Pop burger joint rocks my socks off! It's only a quick 15-20 minute drive from Henderson...it may be a little further for you LV peeps but if you ever have time to take a little road trip, then be sure you visit Boulder Pit Stop in Boulder City!

They have fry sauce here. FRY SAUCE people!!!! Do you know what this is? It is the best, creamy, tasty concoction to dip everything in!!!!! I haven't found another fry sauce that even pales in comparison to theirs (not even in Utah! Gasp). Their french fries come in their own basket and they man are plentiful. These suckers are so tasty because they put some sort of Lawry's seasoning on them. Scrumptious!

Pit Stop's burgers are simple and that's what makes them delicious. The patties are well-seasoned and juicy, the buns light and toasty w/American cheese and whatever else you fancy. A cheeseburger, a huge basket of fries and a soft drink is less than $6. You can't even get out of McDonald's for that cheap! Pit Stop has a variety of other foods that they offer - fish & chips (outstanding), hot dogs, grilled cheese sandwiches, salads, milkshakes, etc....very Americana and the prices are right.

Check them out and support our local, small businesses!!

Note: get in before 12pm or after 2pm on Sunday's as they get a huge lunch crowd after church lets out."}
{"text":"Good food, good service and pretty good fish and chips. Although the chicken tenders were cooked from frozen, it is still a very solid place. I would definitely try again."}
{"text":"After going to Pro Gun Club Boulder Pit Stop is the place to be.  Out of the main strip with the town feeling.  The waitresses has these cute outfits that works with the place.  Burgers are great here and you come out full.  I would say it falls in the attraction of Boulder City and is open a little later than most restaurants there. Price is about 25% more than the Burger King just up the street.  Boulder burger is where it is at wirh thick pepper bacon and if i remember avocado."}
{"text":"I'm feeling like Yelp led me astray here.  This is an average burger/sandwich joint...barely.  The fry sauce was unique, I liked it, it has a buttermilk base.  A friend had the fish and chips and he liked it, the tarter sauce was good.  The chicken sandwich was greasy and I gave up trying to eat it.  The house salad is very basic and the dressing also par for a cheap diner.  The waitresses were a bright spot! They were very attentive and sweet.  I don't care for chain restaurants, but frankly Red Robin is a better place to eat."}
{"text":"WOW ..... Great burgers Great service 
Walked in thinking it was your usual burger joint I was surprised with the friendly service and perfectly cooked burger"}
