{"text":"First time stopping in and was greatly pleased by the sandwich choices as well as the prices. I had the North Shore sandwich and really enjoyed the combination of flavors and left satisfied with my choice."}
{"text":"Fresh sandwiches, salads and homemade soups make this deli a winner. They are very friendly and the food is good. I love the variety and they have daily specials. I've been eating here a while and I've never been disappointed."}
{"text":"I was in the mood to try someplace different on my lunch hour, even if it meant trekking a few blocks out of my way.  And after having tried Boulevard Deli, I can safely say it was well worth the hike.    Nearly all of the items on the menu here have Pittsburgh-centric names and it was hard for me to decide.  The Pittsburgher?  Hmm, I'm not exactly fond of chipped ham, so no.The South Side?  Well a good cappicola is always tempting.  The Squirrel Hill?  Hey, that's my neighborhood, so why not!  The Squirrel Hill is corned beef, 1000 Island dressing, and 'kraut.  In other words, a Ruben!  Oh, but my sandwich was excellent and I was so glad I was able to walk a little bit of it off on the way back!"}
{"text":"Not that great of a place to eat.  The salad wasn't too bad.  Chipped ham sandwich was nothing special and barely had any taste. Overall wouldn't recommend this place."}
{"text":"This place is everything you would expect from a deli and they do it very well. Quick friendly service, fresh and generous ingredients all at a reasonable price.  I had the Oakland Sandwich (all of the sandwiches are named after sections of Pittsburgh) which was essentially a triple decker BLT with turkey and American cheese on French bread. Just what I was in the mood for today only it was piled so high with ingredients that I couldn't finish the whole sandwich. If you come to the Boulevard Deli bring your appetite."}
{"text":"Such a nice little spot. Welcoming staff and delicious sandwiches at very affordable prices."}
{"text":"The is a great little place. The staff is friendly. The food is always fresh. The chili is awesome. There is a wide variety of sandwiches, salads, a soup of the day and two types of chili. Quiet with some background music make it a good place to have one-on-one conversation or to calm a hectic day."}
