{"text":"This Bourbon Street runs through Market Mall and after sampling a little bit of their spicy chicken, I think they're on to something here. They give you a lot of spicy Cajun bang for your buck here with generous portions and actually pretty good food. It's also a new flavour you wouldn't expect to find at a mall food court....."}
{"text":"Got what I believe was a violent case of food poisoning at bourbon street during Christmas shopping on 12/16/16.  Enough said!"}
{"text":"My friend and I ordered food here after years of ignoring it. My experience was good-ish.  Friends order Mashed potatoes = 10 Noodles = 1  my friend hated em Cajun chicken = 7 Fish = 8  Mine Home fries = 8 Chicken friend rice = 7 Pepper Steak = 3.5 Honey chicken = 9"}
{"text":"I've eaten at different BSG locations many times over the years, but this was the first time that I was truly disappointed. The meat itself was juicy, but utterly bland. This is not the sweet bourbon chicken that I remember. Even my friend who had the honey glazed said his chicken wasn't that sweet.  Considering I ate BSG at the Simcoe Place location less than a year ago, I'm going to assume  the problem is location specific. I won't be returning to the Eaton Centre when I need to satisfy my craving. Which is very sad because there are fewer and fewer BSG locations in the downtown Toronto area. (Used to eat at the old Clarica Centre quite frequently when I worked in the building. And now the spot at First Canadian Place is also gone, as is the Yorkdale location.)"}
{"text":"The food is cold and awful and the workers are RUDE. They need to reconsider who they hire. I do not recommend eating here. Panda Express is better."}
{"text":"The guys that have written the above reviews must have been to this place when it was under a different management cuz I was there today 2-May-2011 and  was a very disappointed  the food was terrible and on top of that the guys working there seemed to be from a different planet, Anything I asked them they just laughed and said no no no ..... Bought a fountain drink which was totally flat. Total waste of money will never ever go back."}
{"text":"I LOVE good customer service. Don't care if it's a food court or fine dining. The guy who runs Bourbon St. in Market Mall goes out of his way to cater to requests that fall outside of the \"combo 1, 2 or 3\" world. I don't want the rice, just give me the veg! I love the fact that at his franchise, the customer gets what they want.  On top of that, the portions at Bourbon St. are enormous, you could feed a family of Parisians for a week on the amount of food court lunch they give you. I had the bourbon chicken and another 'blackened chicken' with green beans and mixed veg ... not saying this is haute cuisine but the chicken was good quality, and it was certainly pleasant. Like Victor P. says, little bit oily, but satisfying and good."}
{"text":"I've never had Southern food so don't have anything to compare this to but like Mike S. said the Bourbon style chicken was a little sweet and sticky.  When I went they let you sample the different kinds of chicken.  My order came to $8.46 for 1 main, some rice and vegetables which is the standard price for meals in this new food court at the Eaton Centre.   (They serve the food in reusable dishes and real cutlery.)  Ample seating - good for people watching but when I went it was a little hard to find empty seats since it was so busy."}
{"text":"Anne Marie here is the most attentive and sweetest ever! After one visit came again SHE REMEMBERED ME BY NAME!!  it is so close to home, clean, great atmosphere, fun and incredibly underrated.  Really debated giving a great review because selfishly enough I dont want a bunch of people crowding my new favorite watering hole. not only is it cheap but the food is great and HUGE comfortable sofas in front of big screen projectors! Great thing about this place too is that you get free tokens to play the FUN ticket games when you make any purchase! Great prizes for a sports bar!!! Thanks for giving us a lost wonderful place to cut loose, laugh and have a great time Anne marie!!! We appreciate you!!!"}
{"text":"I'm not sure how healthy this food is (it is a food court after all) but it sure is nice to eat some comfort food once in a while.  Mashed potatoes, broccoli, and bourbon chicken is usually all I get and I usually always leave satisfied."}
{"text":"It's funny when people say it's not too sweet yada yada yada.   If you want something that's engulfed with MSG and artificial flavors to ruin your body, you should go somewhere else..   This is imo the best option at the Eaton Centre food court and one of the healthiest if you select items right.  I always ask to put very little sauce and my request is received well without any problem.  The ladies here have always treated me with lovely smiles but I could see how things could go to a different road for others especially during busy hours because there's always a huge lineup..  It seems like they always have the same menu though but it's understandable."}
{"text":"Rude unfriendly staff leaves bad taste.  There are plenty of choices for fast food at the Market Mall. Bourbon Street is one to be avoided."}
{"text":"My favorite food court spot in the mall circuit.  Food: 5/5 Great value and always consistent. Service: 5/5 Friendly and fast. Environment: N/A Food court. Washrooms: N/A Mall washrooms available. Worth it?: 5/5 great value.   Bourbon Street Grill is hands down my favorite food court place. I personally feel like no mall is complete without it. The food is good and I find all locations do great job and portions and quality are consistent.  Food may be too oily to some but when I'm looking for some food to grub on quicky after an expensive day of shopping, this place always satisfies me.  My go to: Pasta with corn and Bourbon or spicy chicken."}
{"text":"Food court restaurant. The usual grilled chicken choices (bourbon, sesame, blackened, etc.) with vegetables.  Chicken was OK, as was rice. No surprises, no disappointments."}
{"text":"THIS IS BASED ON MALL FOOD QUALITY!  My girlfriend and I wanted to watch the UFC fight at a sports bar and grab a bite. We got rained on so we decided to head to the food court at  Scarborough Town Centre instead. The restaurants here are pretty much what you see at all other food courts except two places. One of them being Bourbon Street Grill.   They had 2 different types of rice, a few more options in vegetables, about 4 or 5 choices of specialty chicken and everything else that was laid out I didn't really pay attention to. When it came time to serve me I ordered the Jambalaya Rice and Bourbon Chicken. They weren't stingy when it came to serving me either. My plate overflowed with food and my eyes lit up with excitement.   The chicken was really moist and flavorful. It had a sweet and smokey flavor to it, very well seasoned and not too salty. The rice was yellow and had red kidney beans in it. They packed a bit of false heat to them. I was extremely satisfied and happier with the low price I paid compared to what I would've been spending at the sports bar.  I would definitely recommend choosing this place if you're planning to eat at the mall.   Pros: - As high quality as Food Court food can get - Insanely fast service - Extremely large portions  Cons: - It's the food court so SEATING is first come first serve."}
{"text":"Different and quirky!  We walked into a somewhat empty bar to try something new.  The bar is quite large inside with games on the left and sofas with a wall of flatscreens on the right.  We were approached soon by the lady working.  She proceeded to let us know how things worked there.  There is no wait staff. You order at the bar, food & drinks.  It's cash only so you can't run a tab.  She then pointed out an ATM inside that you can use.  Strange?  A little bit.  Looked like a one woman show that afternoon as she took the orders, cooked the food and brought it out.  She was definitely friendly and seemed to handle things quite efficiently.    We ordered the Lone Ranger Burger, side of fries and gumbo to share.  The gumbo was crazy good.  For only $5 it was a large bowl with the gumbo scooped on top of rice.  Full of flavor and definitely a meal in itself.  The burger was good.  It included bacon, cheese, jalapeños and guacamole.  It was supposed to also have chili and bbq sauce but I didn't taste any of it or see any these ingredients.  Strange again. The fries were good but we ordered Seasoned fries.  There weren't any seasoning on them but at least they crisp.    So when you order food, they give you tokens equalling the same amount you just spent.  It was a nice perk as you can keep yourself busy playing games while you're waiting for your order.   When I initially walked in I was expecting more of a PT's or Timbers style setup.  Bourbon Street is definitely its own style."}
{"text":"Awesome place for date nights or groups...fun games and tons of tv's... always clean and friendly service!!!!"}
{"text":"I come to their eaton centre location all the time for the blackened chicken Caesar, I absolutely love it, it's a big serving and tastes absolutely amazing!"}
{"text":"A good place to hang out, grab a bite, drink some beer, lounge in some comfy couches, play some games and watch some sports on their ginormous bank of giant flatscreens.  We dropped by on a Sunday evening. There were only a few other customers in there (probably because it's still fairly new). The decor of the place is clean and very fun.  The service is prompt and friendly. We got some alligator nuggets and a catfish sandwich. The food is tasty and satisfying.  Overall, it's a fun place with a good selection of food and drink. We would go back.   Just a note, it is cash only."}
{"text":"I know its mall food but its still delicious.  The bourbon chicken and BBQ chicken are awesome.  The jumbolia rice is a bit tame, but i would suppose thats so you can please thier core customers.  The portions here are large so show up hungry.  I also had their fried potatoes with this visit, and they were good.  Now eating in a mall food court may not be the ideal ambiance but when you are hungry and on the run, this place is an excellent choice for a decent meal."}
{"text":"Cash only? Can use our ATM...with a fee??? No servers...order at the counter? MUST CHECK ALL ID's including a  65 and 73 year old?... 'potential' customers?  Only 2 customers visible at 12 noon  No thanks."}
{"text":"Me and my cousin were just shopping in the mall and decided to get something to eat. I've tried Bourbon from Vaughan Mills, and if I compare them to this location it lacks variety. I ordered a plate with two chicken options and with noodles. The food was good but some pieces of the chicken tasted weird. Like if it wasn't cooked all the way. Since I was hungry we just ate the food and the parts I didn't like I ended up throwing away. The service was fast, even with a line up. I think the portions of the food are good, but the price doesn't do justice for the portion you get. The staff is a little pushy when it comes to ordering and when it comes to paying. After I had finished paying, before I could even pick up my drink and ask her to pass me the food she just started helping the next person. After when I did get my food and ask for a bag she just tossed it at me. Customer service at this location is horrible."}
{"text":"Looks like Panda Express has found a formidable opponent in the  \"Chinese\" fast-food arena royale. It's quite hilarious, they're one store away from each other and it's as if they're mirroring each other when looked upon from equidistance.   The food is typical, however with a sense of mediocrity, it is a refreshing experiment from the once-a-month Panda experience. I have to admit to their fried rice and lo mein (made with spaghetti noodles) have a tad more flavor than Panda and their staple, the Bourbon Chicken is in fact quite delectable even though there's no taste of bourbon. Their mango chicken and jalapeno chicken tastes much like Panda's orange but Bourbon's Mongolian beef is worth trying when fresh. Lastly, after they put your food on your plate or togo container, they'll ask if you want their Bourbon sauce and will pour it over EVERYTHING. It tastes like sweetened soy sauce with a hint of five-spice and isn't bad but I'd definitely ask for it on the side or go very lightly.   Overall I would try this place again when I'm in the mood for that fast and greasy \"Chinese\" meal but don't expect anything more than what Panda did a decade ago in Bizzaro World."}
{"text":"Food quality at this location is consistently bad.  Too cheap on food costs.  The veggies have more stalk than veggie, and the chicken always fatty and grisly.  Like the franchise and the one at Cross Irons is good, but this location always disappoints."}
{"text":"This place is awesome!!! Dawn the bartender is super sweet , nice to talk to, and very attentive. What other place can u go to that gives you free arcade tokens for drinking?! It's like you win just for being here! How cool is that right? The games here are awesome. Hoops, bucket ball, racing. All sorts of fun games. Amazing drink prices, and the menu is all New Orleans which is pretty special. This spot is a gem. I will definitely be back."}
{"text":"Located in the food court at Scarborough Town Centre.  They offer free samples of their meats. We decided to try the Bourbon Chicken w/ Rice and Mushrooms. Serving size is generous and total came to about $8. The chicken was slightly sweet and smokey. Yum. I appreciate that our meal was not overly salty. Employees are quick.   Bourbon Street Grill is a nice option to have."}
{"text":"Extremely greasy food. Very little to no taste. Avoid at all costs. The portions are quite generous though."}
{"text":"I'll be like the reviewer below and say, \"THIS IS BASED ON MALL COURT QUALITY.\"  Really well gee for me I'm as straight forward as they come and neither sugarcoat or give grievance for food coming from a food court. Severely overpriced for tasteless, bland meals. Sorry let's just say after I eat from here, I have a very unfriendly trip to the washroom. I can imagine this stuff isn't good for you, received my message loud and clear after glancing at the empty container covered in oil. In comparison to having a hot tub bath, they make the food swim in grease.  One point to mention with their End of Day specials, I don't like the fact that they refuse to let you choose what to eat. Everything is piled into the containers and placed on the counters, very poor in customer service."}
{"text":"Food experience was absolutely terrible. Ordered Combo #1: Veg fried rice with bourbon chicken and green beans for $6.99 plus tax.  For starters, the portion was ridiculously small for seven dollars. Lady at the cashier would only give us two packets of hot sauce. Seeing it was Thanksgiving Day (time and a half for employees) trying to save food much? Worst part was the rice being undercooked. Two cups water, one cup rice. Not hard guys, customers don't enjoy crunchy rice. Won't be coming back."}
{"text":"Great place to eat. Bourbon chicken is delicious.love to get the double meat double side portion."}
{"text":"My family and I decided to have dinner at the mall after an evening walking around and window shopping.   The worker at Bourbon Street Grill was handing out samples with such enthusiasm, that I couldn't just walk away to the next food option.  So we tried two of her samples and they were both really good.  My husband and I decided to buy two two item combos.  My husband shared with my son and I shared with my daughter.  I had the bourbon chicken and my daughter had the sesame chicken.  It came along with fried rice.  We had one large soda as well.  It all came out to about $15.  Not bad for a family of four.  We even had enough to take home!"}
{"text":"Omg this is good food. Everything except the blackened chicken is worth trying.  Go here instead of Ruby Thai. Don't even try to compare this with Manchu Wok.  Manchu Wok? More like \"Man You Sok!\" The BBQ chicken on Bourbon rice is scrumptious.  The shrimp is delectable and don't get me started on the rice... I can't keep writing, I'm tearing up."}
{"text":"If I had the opinion of giving this place less than 1 star I would - we came to grab dinner at 830pm and all we got was left over cold food from whatever that they couldn't sell that day, cold food, cooked few hours ago. Terrible 0 star"}
{"text":"This is the location in the Eaton Centre food court.   It's ok. It's definitely not gourmet. It's just average, bland, mall food court fare. The meat is either heavily battered and sauced, or in the case of the namesake bourbon chicken, it's just \"meh\". In the case of the battered dishes, sometimes you get a piece of \"meat\" that is actually just solid batter. Unless you go at a busy time, the food can look like it's been sitting there for a while.   On this particular day, they had 99 cent drinks. So that's good.   One issue is that the cash register is a bottleneck, so the line backs up and blocks the counter. This means you can't see what you're ordering, which can be awkward if you're not a regular here. In an effort to relive the bottleneck the employees here will take the tray for the person next to you and try to force your tray off the counter while you're paying. As if you have anywhere else to put your tray while you're waiting for their terminal to load.   I bumped them up to 3 stars because they're slightly better than Ruby Thai, in the same food court."}
{"text":"Bourbon Street Grill is like the relationship in your life that you try so hard to keep but it just disappoints you and disappoints you that you need to remove the relationship altogether from your life. I have been to this location probably 4-5x after months of hiatus and every time I go back I end up telling myself after the 3rd bite..why did I let you come back into my life? Why didn't I look elsewhere and give someone else a chance? When you walk by this location your eyes draw right to the big line ups, the assortment of delicious meat piled up high, cut in little perfect bits and the options look endless..so you put yourself in line..eagerly waiting to get to the front where the lady will ask you what would you like? and so you try and look at your options to decide..but you can't because the line is too big so you have to take the bourbon chicken and decide on what side. Your meal then gets packed into the large white containers so you know you won't be disappointed..you get to the front and you pay for your meal and rush to find a seat in the food court. Then..you option your container begin chowing down...and wow......what have you done? It tastes terrible! Today I got the jambalaya rice and bourbon chicken and although it looked SO appetizing..it tasted bland..it tastes terrible..I love meat and thought I could just chow down the meat at least but not even that. I disappointingly closed my take out container and tossed it out. How could a place be so deceiving? They make it all look so damn great but it does not live up to par. If you are looking for something to eat..save the cash..go to Jimmys or Thai Island..or Arbys even!? I completely agree with a previous review that their bourbon chicken just tastes like Carribean Queens island chicken but the difference is Carribean Queen is better..so take that escalator up and wait for the 4 way cross walk at Yonge and Dundas and hurry up there to get Carribean Queen instead because at least your food will have flavour..it will taste better! Do it...do not come here my friends, please..I am telling you..move on..move forward..you can do so so much better."}
{"text":"Comfort food you can sneak in between  your shopping. Refuel here! I recommend the blackened chicken or cajun chicken and mashed potatoes. Huge portions for great value so you might wanna get that meal deal to go! Avoid the spring roll and extra-battered chicken like the honey-glaze etc. Asian-style noodles were okay."}
{"text":"I went to Bourbon while at the mall to grab a quick bit. The food was altogether ok. The vegetables were a little too firm for the fork to pick up, causing the tongs to bend and nearly snap. The bourbon chicken tasted okay but felt a little rubbery. Since I don't eat rice or noodles I asked to substitute mango salad and they allowed me to which was nice. Very busy though."}
{"text":"Craving for some bourbon chicken? I don't know where else to get it but at the food court during lunch hours! Apparently it's dish name comes from the use of bourbon whiskey in the sauce recipe along with soy sauce, brown sugar, Cajun and ginger. It's pretty tasty and there is familiarity to other Asian dishes such as lemon chicken, General Tao, etc. Staff is super friendly and generous with the portions. The combo includes your pickings of various rice and veggies."}
{"text":"First time I ever try this place, even though I'm a regular at Square One. I had their special for the day: salad + rice or potato (mashed or house grilled, I had the latter) + bourbon chicken for $6.99. The house potatoes were delicious! The chicken was good, but it had a weird texture to it. The salad was pretty basic, but obviously fresh. All in all, I gave it 3/5 only because they have so many options to offer in terms of vegetables and meat choices."}
{"text":"This is a good location in square one mall and every time I go it's busy and long line up but that's ok and the stuff are always nice and they greet up and ask what combo you want I say 2 and every thing is fresh and if they are out of same thing I wait for a few mins and bring food and you need to try the spicy rice and sesame beef it's so good and the have a few type of different shrimp faves and try the smash potato too !!   Hope everyone try this place when you visit Sq one mall :)"}
{"text":"Tried their Cajun pork speclai with rice and mixed vegetables. Tasty, filling, and very modestly priced for the portion size. Best part is that they let you taste small samples if you're not sure what to order. A bit on the oily side, but good value compared with a lot of food court places."}
{"text":"I actually ended up buying my dinner here after trying a sample, which definitely peaked my interest because of the sweet and sticky barbecued meats.  My friends and I were tired of walking around Eaton Centre so we decided to grab a bite but because of clashing food preferences, we ended up at the food court rather than a restaurant.  At the time, I had never seen Bourbon Street Grill before so I thought that I would give it a try and I'm glad that I did!  I spent around $10 or so getting some meat and vegetables served on a container or rice and I was fairly happy with my dinner.   For some strange reason though, I did not enjoy my second meal here as much and it simply tasted over-dressed in sauce.  Their food is decent for the price and I would say that this vendor is one of the better ones at Eaton Centre's food court."}
{"text":"A fun spot to grab a drink and play some games. I'm not sure many people know this location exists because my friend and I have had the place to ourselves on both visits.   There are a variety games to play. They offer a basketball game, football game, arcade games, and skee ball. Tokens for games can be purchased or are given with certain drink purchases. Games are rewarded with tickets that can be turned in for prizes. The prizes are just sport beads or silly tshirts. I don't mind that the prices aren't great because I just enjoy playing the games.   Drink options are the standard bar options plus some. They have the usual draft beers including some local beers, a large selection of frozen daiquiris, and mix drinks. I've only had the nachos as far as food goes and they were not good. I would not order this again.  One bummer here is that you can't carry a tab for food or drink so you have to pay as you go. It's not bad enough to keep me away, but it's kind of annoying."}
{"text":"Awesome place.I cant wait till football season"}
{"text":"It was actually not bad. I am not sure if this is really Cajun/Creole food or was it Chinese food. It tasted a lot like Chinese food. But its ok. Its cheap and it taste very good.   they have combo 1, 2 and 3. Depending how many meat and vegetables you want.  So I got combo 3 which comes with 2 meat and one vegetable and rice or noodle. I opted for the pork fried rice. For the meat, I got the Louisana Chicken and The Bourbon Chicken. My friend got the Cajun BBQ and the Crispy Chicken. Which I got to tried some as well. The food was delicious and everything was nice and moist. Not too dry.   Overall. I loved it.   I highly recommend giving this place a try. For the price, you can't expect too much.   This is food court style located inside The Market Mall. Plenty of parking outside."}
{"text":"This is one of my favorite food court places at Eaton Centre. Recently there are many great places that offer healthier options, I am second guessing their meat dishes, however Bourbon Street Grill has tastier meat than other place. I especially like this place because they always have mashed potatoes and about five different veggie options. It is really hard to find food court dinner with tons od veggies and mash, most times it's just junky meat, fried rice and noodles. I was also impressed that the veggies were not an oil bomb, as it can be.. And of course, the mash are from the bag but at least they offer such option."}
{"text":"Not the greatest, no.  I went at a busy time and had the bourbon chicken.  The sauce tasted watered down and the I wasn't impressed with the vegetables and jambalya rice that I had with the chicken.  The service left much to be desired since they were just rushing everyone through."}
{"text":"My rating is 3.5 stars.   I like Bourbon St. Grill. it is one of the places that I like to visit when I'm in any food court.   I feel that I can eat a bit healthier here than at KFC, as an example. I also like how large the Markville food court is these days.   After spending a ton of time in traffic on Friday (two accidents on my way home), I was hungry and dropped by the food court. I ordered combo 2, which consists of a starch, one meat option, and two sides.   I went with the chicken fried rice, Bourbon chicken, green beans, and corn. It was good, without a ton of grease. Service was prompt and friendly.   The food court was busy this evening. I spent 1.5 hours there. I ate and a phone call came in. So, I took the call, which made dinner much nicer. The food court was fairly noisy, so my chatting on the phone blended in, which I rarely do.   I come here often. I haven't tried the other places in the food court, simply because I'm happy with the food here.   (220)"}
{"text":"This place is actually not bad. While some people may say that it's cheap and weird they actually have pretty good cuts of meat and their noodles are cooked very nicely. You would think that something that does not cost a lot is good quality although I assure you this place is definitely going to give you the biggest bang for your buck. They are also semi-irrelevantly aesthetically pleasing."}
{"text":"The food here is always pretty good.  Very filling and yet reasonably priced.  Famous for their Bourbon Chicken, Blackened Chicken.  I've tried both of these and they are good.  Sides are rice, pasta, corn, mixed vege, green beans."}
{"text":"Foodcourt fare.   Great selections. Build your combo. Generous portion. Everything from rice, noodles, veggies to meat to seafood. Very tasty. Fresh. Peak hour line up. Fast service. Energetic. What's not to like."}
{"text":"It's a rainy Tuesday evening and you just want a hearty down home kinda meal that soothes the soul. Cruising the food court in search of something that's not an equivalent to that Toonie Tuesday stigma I stumble upon Bourbon Street Grill!  Tuesday Special Cajun BBQ Chicken served with your choice of rice/pasta/noodles.  The Cajun BBQ chicken has a smokey sweet flavour, the meat is juicy and flavourful and very saucy which goes perfect with the Jambalya Rice - very flavourful not your plain white rice with the addition of kidney beans its the perfect match.  My other favourite here in the Blackened Chicken, perfect combination of spices, never dry always succulent pieces of meat with a flavour that surprises for whats suppose to be fast food.  What I like about here is that food is always hot, fresh, steamy, and never lacking in quality! They give you an ample portion of food. Those ladies move fast but they never skimp on food, the amount of rice they pile in there can set you up for 2 meals!   FYI Always ask for it in the To-Go containers you'll get a bigger portion. I always get the 2 item (forget the veg, your already here) because they really stack that box full. Look out for the daily specials!"}
