{"text":"This place.... 

Looks like a hole in the wall when you walking by and nothing big when you walk in either.

BUT and i mean a BIG BUT, you order the Shawarma, potatoes with garlic sauce on'em and your in heaven.  I've had the grape leaves and they are delicious.

For a quick meal or wanting something good and consistent to eat this is a the place, because they're open late, the is great, and you know you wont be disappointed."}
{"text":"best shawarma in Montréal now in laval , such a beautiful place for food and coffee can't believe that they serve lavazza Caffè and desert to"}
{"text":"This review is based on the chicken shawarma which is the only thing I had here. And why would anyone have anything else when it's that good? I'm Lebanese and this best shawarma sandwich I've had."}
{"text":"RATING ZERO for Boustan! Horrible delivery and phone order service! Never faced such rudeness on phone! The delivery boy and the owner were extremely rude and ill mannered. Clearly showed a lack of respect towards women. Reached a point at which I had to return the food. Awful experience...... Never going to order food again from this place!"}
{"text":"Line was long going in but it was fast. Had kefta and chicken kabob. Was best kefta I've had and you really can't screw up chicken. Hummus was good too. Garlic sauce was yuk but that's a personal thing. Basically good food cheap and a lot of it!"}
{"text":"First time in Montreal, tried this awesome Lebanese joint... Nothing fancy, great food, great prices, what else can you ask for !? Khalas..."}
{"text":"Boustans is a Montreal landmark on Crescent Street. Known for it's delicious Lebanese food at low prices it's become legendary with the late night set partying up on Crescent and adjacent streets.  The Chicken Schwarma sandwich is probably the most popular item on the menu. A new location has opened up by St Catherines and St Denis I believe."}
{"text":"THE BEST place for Lebanese food in the West. The chicken pita will be fully loaded with meat, making sure you are full after. The meat will be dripping with juice, and it will be an incredibly crispy pita as they put it on the grill. Its a very unique idea and it makes it so much better! 
They also have the best garlic sauce I have ever tasted, a perfect match for the delicious potatoes that you will eat non stop. 

I can't stop coming here, I might need some help."}
{"text":"Great example of a hole in the wall that turns out delicious food."}
{"text":"I ate here several times on a trip to Montreal.
Very Friendly.  I think that they had Wifi.

Nothing was really freshly made.  All microwaved.
But a good cheap eat."}
{"text":"Great service, amazing fresh food. Best Middle Eastern restaurant in Montreal. I'd recommend a Shish Taouk plate or sandwich (depending on your hunger level) with a bowl of garlic potatoes."}
{"text":"I don't understand why so many people seem to be orgasming over this place. The food isn't that good. Sure, it's pretty cheap, but the food is mediocre, especially if you've ever been anywhere over the Atlantic.

I had a falafel sandwich while I tried food off of the plates that my friends got. My falafel was fine, but nothing special. It was cooked in a rather interesting way; the pita is pretty thin, so they make it like a wrap and then stick it in a contraption and grill it. It holds together pretty well. The other food that I sampled was also fine.

Reading the reviews, I thought that this place might be akin to L'as du falafel in Paris, but this place is nowhere near the same level. Good for a cheap, adequate meal, but not much else. Definitely not worth a visit if you're just visiting Montreal."}
{"text":"Reluctant service, grimy, kinda run down place, unexpectedly in the middle of a row of very fancy eateries -- but the food is inexpensive, large portions and quite tasty. Wouldn't take too much to improve the decor/atmosphere. . . still 4* for the food."}
{"text":"I've been eating at Boustan for about 10 years when I have the opportunity to be in Montreal.  This place is not some shitty tourist place as some people I know have denigrated it.  This place is legitimate in every way.  Yes, it's on Crescent Street and Boustan has a huge advantage from tourists in this location.  Boustan's food stands on its own, though, and is not influenced by anything other than a commitment to fresh, delicious ingredients which afford every customer with a symphony of flavors while adhering to tradition.  

I recommend Restaurant Boustan in the strongest way possible."}
{"text":"Visit Montreal usually 2-3 times a year and what I like to call my \"Street Food\" is either Poutine (fries, cheese and gravy) or my favorite \"Middle Eastern Cuisine place\" BOUSTAN. Tabernac, it's just fantastic. First, the Chicken Shawarma Pita, tasty, medium hot with warm pita bred, on the side Garlic Potatoes, no question. Another great dish is the Beef Brochette with rice and coleslaw, wont fail. Have also tried the veggie dish, Vegetable Couscous. To my big surprise it was great too, really tasty, medium spicy. Have visit both places, Crescent and Catherine, same good food but different atmosfer, yours to discover. In short, great food, good price, quick service and always open. Appetitus noni."}
{"text":"This might hurt to read but the grilled - chicken shawarma sandwich is not as good as the original on crescent downtown. That being said this place is still very good if you have a boustan craving. The flavour is similar and the sandwich is very filling - loaded with toppings. The additional plus is that it's open late. End result, I prefer Mr Falafel down the street but if it's past 11pm I'd def go here."}
{"text":"Service is a little hectic and there was obvious tension between the server and the cashier which made getting our order right somewhat difficult. The prices are appropriate for the type of very casual/quick service place it is. One pet peeve was they microwave some of the food in the take out styrofoam containers for a few seconds before serving it to you. 

The food itself was decent, nothing amazing. Their roasted potatoes with garlic sauce were pretty good. The falafel was dry, which is what I find with most falafel wraps. The chicken wrap was great with good sauces and they give a good amount of meat with each dish. Don't bother with the hot sauce--no heat to it. Overall, very average."}
{"text":"L'un des meilleurs endroits pour les sandwichs shish taouk."}
{"text":"This place used to be my go to place (especially at 4 am in the morning) whenever I was hungry and was looking for some cheap tasty authentic food. But since Mr. Boustan \"The Legend\" himself has retired, it's just another \"Amir\" and it's not worth it anymore. Sad sad story :( Boustan was filled with life an energy now the staff is rude and entitled.

Their garlic potatoes are still interesting enough for tourists to adventure there but... Waste of taste in my opinion."}
{"text":"We ordered the combo schwarma plate (chicken&beef) which came with rice, potatoes & garlic sauce, a cabbage salad, a couple pieces of pink marinated turnip, hummus & a pita.  All this was $9.50.  We also got a falafel trio (sandwich, drink, garlic potatoes)for about $6.  All very tasty food, potatoes have nice flavour, especially combined with the garlic sauce- actually everything tastes good with the garlic sauce... The meats were decent, although the BEST schwarmas we have had , have a better smoked/grilled flavour.  The cabbage salad was my favourite part- as it was slightly tart, very refreshing, and garlicky.  All in all, a tasty experience for the money- the line never shortened the whole time we were there- always 5-6 people waiting..."}
{"text":"On our visit to Montreal, we ordered in from Bouston since it was the only restaurant open and we wanted it delivered to the Hilton we were staying at. Between the 6 of us, we ordered 3 spicy shawarmas, falafel meals, hummus, tabouleh, roasted garlic potatoes, and baklvas. The ordered arrived promptly, warm, and delivered with a smile. The food was yum -- the shawarmas had a great crunch to it with the cole slaw, and the huimmus was creamy heaven! Full marks to the entire order!"}
{"text":"authentic lebanese food that is fast and cheap.  i was a bit surprised that the chicken shawarma is more expensive than the beef, but on second inspection, they pack the pita with much more chicken than beef.  we loved the \"wetness\" of the shawarma with the cabbage and other pickled veggies.  the garlic potatoes were absolutely delicious, and we had hummus on top of it...yum, yum, yum.

i would agree that the cleanliness and hygiene of the workers wasn't the best (they would handle food and the money without using gloves/washing hands), but what do expect for $5 sandwiches?

when we went, the place was packed with what appeared to be college students from mcgill.  however, we were served very quickly."}
{"text":"This place under the old ownership was amazing! Great food and really pleasant staff. The new owners are OK I guess, they're not as friendly and generous, but the food still tastes good, and way better than the Amir next door. This place is especially great since they're on Crescent street, so you can go try them out like 3 am after you're done partying, the food taste soo good when you're hammered lol. But they get really packed, and the place is small and doesnt look that great, but the food makes up for it. Give them a try!"}
{"text":"This place was recommended to me by a friend as a great place to stop while stumbling home from the bar at 3 am. Myself and another buddy decided to try it for dinner so we would actually remember how it was.

Somewhat difficult to find as it's downstairs off the street, and the restaurant beside it had a terrace that camouflaged the sign. They had a few tables outside and I'm sure it would have been nice to sit on the terrace, but it was way too hot for that, so we sat inside. A significant drop in the scenery, the restaurant itself is very simple with cafeteria trays to be served on and a dozen or so tables to sit at. 

THE FOOD THOUGH, any negative prejudice that had been created prior to eating was immediately removed after the first bite of my Beef Schwarma and potatoes W garlic sauce. This was like an explosion of salty, sweet, and garlicy flavours all mixed together to make the best Schwarma I've ever had. This potatoes were soft on the inside, crunchy on the outside with a generous serving of garlic sauce on top, a little on the salty side, but none the less delicious. There Schwarma was also excellent, filled to the brim with all the good stuff. 

End of the day I will definitely go back, probably after a night out of drinking to make sure it's as good at 3am as it was at 6. 

Friendly service, good prices and great food!"}
{"text":"Boustan is my favorite food in Montreal, and I know what some of you are thinking, but this place is perfect: cheap, big, delicious Lebanese comfort food. A great late night meal, and a place literally for everyone, from cops and bankers, to hoodlums and hipsters."}
{"text":"I really Like Boustan. Their signature dish with eggplant is really creative and perfect for a 4am after drinking.

My only complain is for the delivery. One of my friend is living Next door. literally. 
It takes usually 1h10min to get the sandwish.

I really hope they gonna do something about that one day, cold sandwishes and patatoe, not that cool."}
{"text":"average at best. the only thing that this place has going for it is the late hours on weekends. I guess the owners of Boustan downtown got fed up of drunken west-islanders saying...\"this food is awesome man! you should open up on the west island man!\"
better option further north on St.John's...Mr.Falafel. 
family run and more of a homemade taste."}
{"text":"A buddy and I were wandering the streets of montreal on a hot day looking for a place to eat. Before the mirages started to kick in, I caved in to his demands for a \"Cheap\" place to eat and we decided to try Boustans after hearing nothing but good things from another friend of ours.

After carefully analyzing the menu for all of 3 seconds, I decided to get a beef shawarma with garlic potatoes. The potatoes were pretty salty but the goodness from the heavens that is the garlic sauce made it all better. Taking my first bite from the shawarma I was impressed. I love the way it is grilled and the way the flavours from all the ingredients inside come together. Considering the fact that I finished my meal faster than it took to choose something from the menu (3 seconds remember?), I would say I really enjoyed it.

Definitely recommend this place and want to try it in the wee hours of the night when I just need to hit that craving. My only regret is that I didn't try the creation!"}
{"text":"La nourriture était bonne mais le service pas super....

J'avais même pas fini ma commande que le vendeur m'a tourné le dos pour faire le plat... 

La mayonnaise à l'ail était parfaite."}
{"text":"Price / Quality ratio is like perfectly efficient. I would say With Shawarma sandwich (both - chicken and beef) you can't go ever wrong. The level of appreciaton rises with level of alcohol in your blood."}
{"text":"I showed up here late on a Thursday night after a long and terrible bus ride from Toronto. The place was packed, but the owner was cheerful and efficient.  I ordered a chicken shawarma sandwich, and it was filled right up and then grilled to perfection.  The guys ahead of me ordered something off-menu that seemed to be a combination of chicken and beef and something else inside the same sandwich.  Brilliant, and I will probably try it next time.   Price per shawarma sandwich: $4.50. 

From the reviews on the wall, it's obvious that this place is not only a Montreal institution, but a work of love of the owner. The photos of customers in Boustan t-shirts around the world are a cool touch. Highly recommend."}
{"text":"Ok not great and I am pretty sure that I got ripped off on my change... The eggplant is super oily and they heat it in the microwave."}
{"text":"Montreal has plenty of cheap lebanese fast take out places but Boustan is definitely the best! It's cheap, the service is great, it's open late, they deliver, and the food is delicious! Not much atmosphere to sit and eat in there, but the quality of the food more than makes up for it and you can always get it delivered or take it out. 

I have only ever had the shish taouk (or chicken shawarma) but their other options look equally good. I recommend getting it spicy! Their hot sauce is great!

It is well deserving of the great reviews."}
{"text":"This is one of Montreal's best kept ''secret'' (not so much a secret, but you can easily walk past this little, below street level restaurant. 

Don't judge a book by it's cover; it may look like a small, run-down place, with their 'cafeteria' tables and discolored menu pictures, but this is the BEST Lebanese/Middle Eastern restaurant on the planet!! No wonder former Canadian Prime Minister Pierre-Elliott Trudeau and many, many Canadiens hockey players were/are regulars and have their pictures displayed in this tiny place!! 

The food is fresh, flavorful, and so, so tasty! Forget about those 'shish taouk' chains like Amir, they don't even compare to Boustan!! My only regret is that they do not deliver all the way to Missouri... :(  So when I visit back home, I always make sure that I stop by several times!!"}
{"text":"Bit of a hole in the wall, but decently furnished and clean.

I had the chicken shawarma trio, which came to a little over 8 dollars after tax. The staff were fairly quick and efficient, nothing to complain about.

The food was decent, not as good as I had expected and read about. The meat wasn't dry, but neither was it extremely tasty. The bulk of the flavour in the shawarma was from the coleslaw and toasted pita, which were good. The roasted potatoes are mildly reheated in the microwave, but the garlic sauce accompanying it is quite lovely. All in all a decent meal at a decent price, but nothing to write home about. Average tasting meat and reheated potatoes keep this place from a higher rating."}
{"text":"Great lebanese style shawarma at such a low price! This place was packed even at 5pm but the service is quick and a good place to eat if you're travelling on a budget. The restaurant is very close to the Montreal Museum of Fine Arts and is a good place to stop for a quick lunch."}
{"text":"I just wrote a review of Sabra in Hermosa Beach and found a photo of Boustan from a month ago on my iphone... So, here I am agreeing with everyone else that Boustan is probably the best take-out shawarma anywhere with Zooba's(renamed Balbeck?) in Ottawa a close second. I think my all-time favourite is still Kababji in Dartmouth NS, but Kababji is a sit-down restaurant at a higher price point."}
{"text":"Amazing restaurant! One of the best shawarma wraps I've ever had. Their beef plates are also very good. Solid choice if you're in the west island. It's also open late which is a plus."}
{"text":"Awesome shawarmas that are actually charred and not breaded meat rolled in pita. 
Go to place at 3 am after spending the night studying at the library or night out on Crescent."}
{"text":"Just a little hole in the wall, the place leaves much to be desired as far as sitting and eating. The food is awesome! Large portions at cheap prices. You must eat here but I recommend taken it to go."}
{"text":"Gross.

But thats what you do when nothing else is open at 2 am...

I am happy I didn't get sick the next day"}
{"text":"Amazing food - I picked the chicken shawarma and everything was perfect (juicy chick, potatoes, tahini...)
Great service - smiling and welcoming staff. Thanks for being flexible and mixing different sides since I didn't know a lot of them :)
Will definitely be back next time I'm in Montreal!"}
{"text":"Great food, nice people, home Esque environment. Has some serious draft problems through the door though, and a lot of cops."}
{"text":"Food was overcooked, dry, bland, and too salty.  Ppl at the counter weren't friendly either.  Wouldn't bother stopping by unless you've been out all night and are just really hungry."}
{"text":"Sent me the wrong item, and then charged me for their mistake. And the abomination forced me to pay tip. Must avoid."}
{"text":"Ok food..not as good as the one on crescent in downtown. 
The worse service btw. One of the counter persons was pleasant, (the taller gentleman) but the other (the main guy in the front responsible for cash) treats customers as if he doesn't want them there!!! Way too much attitude!! Unbelievable how ppl or owners like that with no customer service skills or appreciation are place themselves in the front as the face of the business."}
{"text":"Dry chicken and gross plates, unfortunate that the restaurant in the city was so much better and we are stuck with a shitty attempt here in the west island"}
{"text":"After 12 years I finally found a shawarma place to rival the best shawarma I ever had (Shawarma Queen in Salamanca, Spain). No frills casual dining spot that is packed on flavor and value. The combo platter was a generous portion. We ran across another Boustan so this place appears to be a chain. I could not have been happier and will gladly return."}
{"text":"I LOVE THIS PLACE! It's a small, hole in the wall eatery located in the basement of a building on a busy, hipster neighborhood. It's a good 15-minute walk from McGill. Their shwarma pita wraps are one of the best we've tried. They roll everything up quickly and heat it up to give a slightly crunch on the outside. They also add potato pancakes that add to the taste. Open until late night and perfect for a quick stop or on the go. I also recommend their tabouleh--very fresh and lemony with just the right amount of oil."}
{"text":"Excellent food.  I had the chicken kebabs and my girlfriend had the falafel pita.  Both were great.  The side of hummus that came with my entrée was good, the seemingly mayonnaise-based topping on the potatoes was good,  and even the pile of lettuce/cabbage that was a side for my entrée was delicious.  Highly recommended!"}
{"text":"le service est tellement lent. La nourriture est pas aussi fraîche et bonne que la franchise qui se trouve sur la rue Crescent. C'est un peu décevant, lorsque je vais dans ce Boustan et que j'espère recevoir le même produit que celui à dowtown et que je fini par avoir un produit substitue qui ne lui arrive meme pas à la cheville"}
{"text":"Mon amour pour les shish taouk a émergé lorsque j'ai pris une bouché de leur sandwich. après 5 ans, cet endroit a bannit tous les Amirs et les Bashas de ma vie. Aucun autre produit n'est comparable aux produits de boustan!!"}
{"text":"I've been a Boustan customer for more than 10 years now. So, I gave this place another chance and ordered food that didn't need to be microwaved. Unfortunately, as others have remarked, there's been a management change and it's been for the worse. It took longer than it ever has to deliver the meal, and so I called to politely ask what the status of the order was and I got attitude from the guy answering the phone.

They've officially lost me as a customer."}
{"text":"Good cheap and plentiful. The falafel was among the better I've had in Montreal and the shawarma plentiful. Would enjoy again."}
{"text":"\"Hole-in-the-wall treasure!\" is right on target. As before, Boustan struggles if you need attention to detail, but the food is honestly great. The Kafta Arayess has just about made me forget the Shawarma for good.

Only two things to keep an eye on: one, the overuse of garlic mayo - I'd argue to even just skip it given how good the hummus is - and two, that you'll need a very \"Quebecer-like\" voice to keep staff on-target if you need to custom order. You can request anything you like, but with orders coming fast and frequent don't expect yours to be anything more than cookie-cutter unless you keep an eye on it and speak up!

Boustan has a lot of history and the food is honestly worth going for, so don't let the new management get you down. It is, as it was, an oasis for the late night food traveller."}
{"text":"The shawarmas there are really great! I went at the end of the day though, so it wasn't as hot as I'm used to having there. I'll go again to see if it's a trend or if I just wasn't lucky on that day."}
{"text":"Chicken shawarma was very good. It's a great place for a late, quick, cheap dinner. The employees were all very friendly. I would definitely go back if I lived in Montreal."}
{"text":"Often understaffed which leads to poor customer service. Food relatively good. Not as good as original location."}
{"text":"The food wasn't good and they unsafely microwaved my food in styrofoam container, even after I requested for them not to do so.

I ordered a combo plate. They put rice in a styrofoam container and put it in the microwave to reheat it. I didn't this that was safe so I asked them to prepare me a new plate that wouldn't be inside a styrofoam container if they insisted on re-heating the food. The man at the cash said that there's no problem with putting his styrofoam container in the microwave because they are 'restaurant grade styrofoam' or something to that effect. I had my doubts but I was pretty hungry and had already paid so just took his word for it. I brought the container home, ate my food and flipped over the container and read that it was grade '6' styrofoam. I googled it and read it is absolutely NOT MICROWAVE SAFE.

I wish i had read the review posted 10 months before mine that complained about the same issue and i would have known not to even bother with this place. I also wish i had walked away when they put the food in the styrofoam container/food in the microwave... besides it not being safe, that should be a good indication of how their food isn't fresh. 

Speaking of their food, if you can look past the above points, my thoughts on their food doesn't get any better. Their chicken was dry. The beef was also dry and had chunks of hard bits in it. They re-heated already cooked rice which I assume means the rice had been sitting out for quite a while. I also asked for hot sauce and got something tasted like some sort of tomato paste with no hint of spiciness. Nothing was great.

There are plenty of shawarma places in the city that beat this place in all aspects (cleanliness, service, freshness, safety and food). I'd suggest you go anywhere but here. I've had great food at their Crescent location but i feel like this particular location is ruining their good reputation."}
{"text":"En temps que français nous avons etait agreablement surpris ! Les + la sauce a lail avec le chou c'est magik on mange un kebab avec plusieurs gouts ! A ESSAYER SANS PLUS ATTENDRE.
MANQUE JUSTE LE WIFI."}
{"text":"Most amazing shawarma I've ever had. The food is fresh and they give a good amount. Would definitely recommend this place :)"}
{"text":"Good value, friendly service, clean premises. Can't go wrong with chicken shwarma or the combo meal"}
{"text":"Service is very fast and friendly, now the food i might be picky but it's obviously not the real lebanese shish taouk and garlic sauce, but definitely better than any other lebanese fast food."}
{"text":"The falafel pita keeps us coming back! Myself and my fiancé both love them. Falafel is perfectly fluffy and the toppings all together on the pita makes one flavourful sandwich! We ate here twice on our trip to Montreal, both late night visits. We will return on our next vacation!!"}
{"text":"Their slogan is \"Montreal's Best Middle?Eastern Fast Food:
Served up with a smile.\" I can definitely say that that's true. When I got in around 11 AM to have an early lunch, the guy at the counter greeted me and asked what I'm in the mood for. I said it's my first time and asked him what he recommends. He then asked if I'm too hungry and I said I'm just kinda hungry. He suggested the chicken brochette pita. I ordered the trio which comes with a side, a potato in my case, and soda. I paid ~$9 and was asked to wait at the table. 

A few minutes later, my pita was ready. It was fresh right off the grill and it tasted so good. I love how the wrap is toasted enough that it smells amazing but not too burnt that it tastes bitter. The chicken was also very tender and vegetables and spices all mixed very well. 

They open up at 11 AM on weekdays. If you wanna pay less than $10 for lunch and you're looking for a Lebanese cuisine, this is definitely the place for it. There's also a huge HDTV inside which at that time was on sports channel so extra points for entertainment."}
{"text":"Yes, this has to be one of the best places to get Lebanese food.  It's cheap; fast; and dirty, but in a good way.  Their shish taouk is so super tasty.  I'm not sure what they do differently here from other fast-food Lebanese places but it really is the best.  And cheap.  And good.  My mouth is watering."}
{"text":"I used to love the veggie pita from Boustan's  but I ordered it recently and was very disappointed. They re-heated the fried eggplant in a microwave. The sandwich was stale and the overall taste was different (in a bad way) from what I was used to."}
{"text":"Yes , it is popular bcos there's not many options late night to be honest. Especially with all the pubs and party places in St Cathy's and Rue Crescent, the place gets decent business. 
The food is okay. You get what you paid for. Tastes fine. They definitely don't go out of the way to improve your dining experience. Honestly I don't think they really care much about the dining experience cos the tables are pretty dirty but u can takeaway and then ur fine. 
I had the shish taouk  good quantity."}
{"text":"Mixed plate with chicken + beef. I chose half rice + half potatoes. The potatoes were good!
Large portions!

The place was a little crowded when ordering. The dining place was kinda full of the smell of food. Overall it was a nice place to try shawarma."}
{"text":"My go-to for a great shish taouk. Make sure to ask for extra sauce (I personally also ask for extra hummus), or else they go light on it. It's non-expensive, delivery is very fast (and you can order almost 24h a day) and the food is great."}
{"text":"I ordered a Chicken Pita and it was really good. Potato with garlic sauce was also great. 
Fast service!"}
{"text":"Great stuff, very tasty and good portions, our favorite is the shawwarma either beef or chicken and the sides are hummus and turnip pickles, even the veggies and the bread are nice and fresh, we enjoyed it."}
{"text":"the chicken shwarma sandwich was pretty good, but not the best i've had.  the sandwich was dripping with grease, which might freak other people out, but i'm ok with it.  the potatoes with the garlic cream sauce is off the chain though!"}
{"text":"Poor service. Dry and salty. Greasy sauce. Be sure to check your order despite their assurance for delivery/takeout. They only gave me half of what I ordered and paid for but refused to deliver the rest of the order claiming they don't have driver-even though delivery service is labeled. What a mess!!"}
{"text":"The shawarma (beef and chicken) is the closest I've tasted to authentic shawarma outside the middle East.  This to me has dethroned many in Montreal to be the #1 middle Eastern place to eat.  But don't let the ambiance fool you, it's not pretty on the eyes but it's the food that will blow you away"}
{"text":"The bag when my food was delivered was ripped to shit and the delivery guy kept insisting I give him 8 bucks tip and got mad at me when I said give me 5 back and keep the rest!"}
{"text":"chicken sandwich is nice. staffs are friendly. my first time taste middle east food. not bad.haha?"}
{"text":"First order on the ste catherine location, really not a good shawarma pita, dry chicken, no spices, really not good. Disappointed and won't order again"}
{"text":"Tried the brochette plate and the chicken Shawarma plate.  The quantity is definitely a lot. Taste is good and reasonably priced.  I usually don't eat beef but I did find it to be good tasting and ate it all. People were nice as well.  Ioved the Garlic sauce and potatoes."}
{"text":"Being a Middle Eastener in Montreal is both a curse and a blessing as there are many of us here, thus many good restaurants, but there is also many bad restaurants, and then there are restaurants like Boustan which serve 'okay' food but are hyped to the degree that you come in expecting better only to be disappointed every time. After three tries, I think I am done trying Boustan.

It is not bad food per se; it is tasty, it is just not worth it when you are in Montreal, unless you are stuck somewhere nearby and are low on cash. Their shawarma is nothing special or different, bread is the regular pita you would buy from grocery store or is served at Amir... In fact, the problem with Boustan is that it offers nothing more than the Lebanese shops you would find in a mall's food court in Montreal. The variety and quality is exactly as such so why take time to go there when you can just go to mall close to your neighbourhood.

One thing they do better than say Amir or Basha is their falafels, I must admit. I was happily surprised that it didn't taste like coriander-soaked sand, which seems to be staple at many other fast-food-like Lebanese places. 

All in all: it is not bad, but it is not good either."}
{"text":"Delicious chicken shawarma.  The combination of rice, potatoes, garlic sauce, hummus, coleslaw along with the meat hit the spot. We will be returning here"}
{"text":"Only had the shwarma sandwich but it was excellent and absolutely delicious! It's located conveniently around the corner from the art museum so a great spot for a lunch or dinner after a whole day of walking."}
{"text":"I love their food, but the staff can be a bit unfriendly at times. Tend to get dirty looks when you ask for special/specific orders. But, apart from that, a great place to get good quality kebabs!"}
{"text":"Extremely friendly service and very affordable prices. If you are not familiar with the CFL do not mistake pictures of the owner with the \"Stanley cup\" on the wall like I did which he was quick to correct is the Grey Cup. Chicken shawarma is a must."}
{"text":"Best chicken Shawarma pita I have ever had! Also try the potatoes with Garlic sauce! I will come back to Montreal just for Boustan!"}
{"text":"just got in to montreal tonight and ordered after reading reviews on Boustan.  i wanted a place that delivered.

i ordered falafal pitas, grape leaves, tabouli.  all was really good and i could not believe how fast the delivery was.  my hotel is just around the corner, but, when they told me \"we'll get there as soon as we can,\" i expected that could mean a really long time.  the food was delivered in less than 15 minutes and it's saturday night.  i'm impressed.

cheap, fast delivery and really good for quick, cheap, delivery food.  i'd order it again."}
{"text":"ZOMG!  I love this place.  When I lived in Montreal, I went there once a week.  The food is so good and convenient.  The potatoes are awesomely tasty, and the schwarma is to die for.

I go to Boustan every time I visit Montreal now.  This place is amazing!"}
{"text":"\"You haven't experienced being a local until you've eaten at Boustan\" -My friend when I first moved to Montréal 

Wow. I've had my fair share of middle-eastern food and even more so since I've moved here. Boustan is definitely at the top of the pyramid in terms of non-overpriced middle-eastern food. Their shawarma and shish-taouk (300 orders later and I still don't know how to spell it) are amazing. Everything is well-seasoned and cooked to perfection.

The service is also great. The guys are quick and very friendly."}
{"text":"Delicious and inexpensive food near Concordia University. Opens late too.

The place doesn't look like much. The first time I came upon Boustan, I stayed because the food smells great and there was a long line. I am glad I stayed.

The sandwiches are grilled and delicious. They are cheap for Montreal standards. One sandwich is the perfect size for my girlfriend, however, I would need two sandwiches or a plate. The sandwiches are wrapped in wax paper that's easy to open and hold.

For the plates, definitely go for the chicken shawarma instead of beef. The chicken is hot off the rotating vertical spit, while beef is is not. You can try both by getting a combo plate or sandwich, with half chicken and half beef. There is a version where you get three meats I forgot what it's called, a classmate ordered one of those as a sandwich.

When you order a plate the rice / potatoes are microwaved on a styrofoam plate, but I can forgive that due to how great it tastes. (With the unavoidable amount of second hand smoke in Montreal, the styrofoam plate is not a huge concern to me).

Anyway, try to have it all dressed with all ingredients (I have it with no onions. In addition, one of the ingredients is a delicious garlic mayo, so if you got an interview, might want to hold the garlic sauce). For the plate I usually get chicken with half tomato rice and half potatoes. Definitely try the sandwich if you don't want microwave or styrofoam touching your food."}
{"text":"AMAZING Chicken Shawarma! I've had my fair share of shawarma, and this was by far the best I have had. They meat is amazing, I asked for spicy, which was even better, and they toast the bread, which makes it crispy and delicious! 

It definitely deserves its reputation!"}
{"text":"A great middle eastern option.  Hummus was phenomenal, great flavour.
The combo plate had excellent chicken shawarma and good beef shawarma.
The potatoes were nice as well.
Could use a little more meat instead of filler but still a great value."}
{"text":"I would like to preface this review with the fact that the food was good. I ordered a chicken trio pita and it was great. It's the only redeeming factor of this place, which I guess is essential for a restaurant. 

Being in a touristy area, I would also expect service to be key. However, the owner of this establishment lacked every once of respect and customer service. We were ordering to eat outside and it seemed like he was doing us a favor by feeding us. 

I hope that the owner works with the employees on their customer service. Then, the restaurant will be deserving full marks."}
{"text":"Tasty, inexpensive Lebanese food.  Perfect for a light lunch after hiking around the Museum Quarter.

I shared the falafel sandwich and the mixed shwarama plate with a friend.  Everything was fresh and well-seasoned and the hummus is great.  All in all, we were very satisfied.  The staff are a highlight of this place: very friendly and very courteous.

True, the place is a little less tidy than your average North American eatery, but the food and the staff more than make up for it."}
{"text":"Best shish taouk ever. Having a bad day? Go here. Having a great day? Go here. Raining outside? Go here. On a diet? Well.... Maybe not. But really a montreal must go to"}
{"text":"This place is a legend.  It's a small place, with hand pained murals. Perfect for late night party-goers or students grabbing a quick bite. 

I usually get the chicken pita - the chicken is tender and moist, though you'll sometimes fins a few pieces of fat.  It's loaded with fresh tomatoes and garlic sauce, and delicious cole slaw, which adds a nice tangy crunch! None of this lettuce business here, my friends! 

The potatoes are great, with a little bit of spice and coriander.  They're topped with a dollop of garlic sauce deliciousness. It an get a little intense grease-wise, so you might want to share them. 

The owner and his son are friendly and jovial.  You'll even get a little life advice while waiting in line."}
{"text":"About the best you're going to do for late-night schwarma, but everything tends to be very salty.  I wonder if they have a deal with the many bars in the area to ramp up the salt content so people'll want to drink more!"}
{"text":"Always good food. Ever since they opened in West Island I have been quite regular to this place and kind of addicted to the food. The staff is usually friendly but lately quite often I find them overworked and tired. When they are tired their behaviour is wayward. The owner needs to look into this quickly."}
{"text":"Went for lunch.  Very tasty and the prices were decent.  Definitely worth going if you are in Montreal and hungry."}
{"text":"One of those hole-in-the-wall treasures. Good prices and delicious food. While I love the platters, my go-to is the trio because their finishing touch of grilling the wrap is GENIUS. 

Also good potatoes with garlic sauce. It's worth breathing that on people all day, let me tell you!"}
{"text":"i dreamed about the chicken shawarma after i ate here on friday night. so i went back for lunch on saturday, and brought friends for dinner on sunday night (we were all in town for a conference). after dinner on sunday my friend s said, \"thank you for bringing me here- this is JUST what i needed\". word.

delicious, fresh, inexpensive- damn near perfect. good for vegetarians and vegans, too. 

only downside is that it's 5 1/2 hours from my house!"}
{"text":"Quand on regarde l'entrée du Boustan on n'a pas vraiment envie d'y entrer, une fois que l'on est à l'intérieur on a envie de repartir tout de suite, l'endroit est sombre, pas hyper propre et l'ambiance plutôt pesante (il faut savoir ce que l'on veut commander, sinon on vous regarde l'air de dire \"faut se dépêcher, on pas que ça à faire\")... Mais une fois que l'on a goûté à leur sandwichs on a qu'une envie... y revenir encore et encore !!! Le pita falafel est un délice à seulement 3.5$ ...à essayer. L'endroit idéal pour un lunch entre 2 cours, c'est rapide, bon et pas cher."}
{"text":"Great schwarma for a cheap price. Staff are the rudest people I have ever encountered, and the delivery people will take a tip that they feel is appropriate. If you can deal with rude Lebanese people when you order then the meal is definitely worth it."}
{"text":"Ok, their food is an awesome quality Arabic food :)

The restaurant space might not be that comfortable, but you'll see paradise once you try the first bite lool"}
{"text":"Staff Was ridiculously rude. Food was fresh but was blander than matzoh meal. I disagree with the reviews that I have seen about this place."}
{"text":"Speedy and friendly service.

Love the food, often grab a bite let Friday and Saturday when they're open until 4am!"}
{"text":"The food there is so fresh and tasty. The staff is very nice and they're always smiling to you. Best food for the price on cote des neiges tbh !"}
{"text":"I am a huge shawarma (sandwich) aficionado.  I was born and grew in Saudi Arabia, like most other expat kids and local Saudis, we love a good Lebanese shawarma.  Shawarmas are my nostalgic comfort food.  After about 1.5 decades from my last shawarma in Saudi Arabia, I am still magnetized to those vertical spits of beef and/or chicken wherever I am around Canada (and around the world) just to get a taste of my childhood.  Most of the time it falls short (some more than others), I get sometimes with some luck I find a joint that hit the spot just right (Shawarma King in Ottawa about 65% of the time and Venus in Halifax about 40% of the time).

While on business in Montreal this week, I had gone to 2 other shawarma joints at the Eaton Centre food court a couple nights before and ordered a chicken at one and beef at the other...both passable but nothing very special. 

Now Boustan, WOW!  Tonight, I ordered a beef shawarma trio (includes potatoes topped with garlic sauce and a pop) and a chicken shawarma (sandwich only).  Up until tonight, I sought to find the taste of shawarma that would equal those of my memory.  Today, Boustan's chicken and beef shawarmas entered the top ranks of the best shawarma that I've ever had!

To top it off, the two Lebanese guys working the food line were so incredibly industrious...working at a sustained full-tilt pace.  I dig it, our society is growing ever complacent prefer to take it easy, not these guys.

If I were Steve Ells (founder of Chipotle and judge/investor of America's Next Great Restaurant) or one of the angel investors on Dragon's Den, I'd put a Boustan in every major neighborhood."}
{"text":"Best of the best. Not your typical casual restaurant, this basement kind of place has the best food ever for its class. We had the best shawarma in our life, great food, great value. No doubt about it."}
{"text":"Beef shawarma plate is very good. Cops stop by here for food, there are plenty of other places they could go for fast food. You should ask not to have the tahini sauce if you don't like the taste on your shawarma."}
{"text":"When you first see the place you think you have entered the worst place ever... but don't be fooled! The food there is incredible, the best middle eastern food in Montreal (and Montreal has A LOT of middle eastern food). 
Go for anything... chicken shawarma, kafta... anything. It's delicious. Add the garlic potatoes and you are in heaven. Whenever I am back in Montreal this is one of the few place that I ALWAYS go back to..."}
{"text":"A Montreal mainstay. If you are looking for chicken schwarma forget the chain restos and head to Boustans."}
{"text":"Before you order your large poutine the price on the menu says$7.35 when they charging you $8.95 what a scam  after i catch them they return me$1.20 but by the law they shoud give me free. So disappointed. Never go back to that store. \"PLEASE CHECK YOUR BILL EVERYTIME YOU PURCHASE \""}
{"text":"This place is awesome! Very quick and kind service. We got the combo and vegetable platter. Very tasty. Plates come with so much good! Be prepared for a giant meal. Get the garlic potatoes no matter what!"}
{"text":"Price is really reasonable plus beef quality is fantastic . For most people, they just feed themselves. So the quantity of food is huge!"}
{"text":"One star for being unsanitary. I can forgive a lot when it comes to restaurants, but blatant disregard for sanitary food preparation is a deal-breaker.

The guy behind the counter got mad when we asked for water instead of buying a can of soda for $1.35 and would only give us a single tiny cup to share. I understand drinks are a big source of profit, and he was mad he wasn't getting that on this sale. I can overlook that.

I got the kafta arayess and my wife got the chicken shawarma. All meat comes from a big pre-cut pile. Some items go on an open grill. Most items go into a microwave there in front of you. They're busy, and pre-cutting and nuking are fast. I can overlook that.

I actually really enjoyed my sandwich. The meat was spiced well. The sauce was great. The beets tasted like they were past their prime, but nothing to detract from an overall decent meal. 

Despite the service, this was shaping up to be a 3-star experience... then we saw one of the men behind the counter pick up some of the pre-cut meat with his bare hands, eat it, lick his fingers, and continue preparing food. We were shocked.

I can't overlook that. That's just disgusting and irresponsible."}
{"text":"Visiting from the States. A friend of mine who used to live in Montreal told us to try Boustan. My husband was a bit hesitant by the little hole in the wall restaurant, and because he'd never had Lebanese food. 

Oh. My. Gosh. We shared the beef plate and fought over who could lick it clean. The garlic sauce was amazing. We loved the beef, potatoes, pickled vegetables and pita. I also had a grape leaf. What a magnificent meal! The place filled up with locals, exactly the type of restaurants we like to find on trips. Wish we could take Boustan home with us."}
{"text":"The food is pretty good. Just saying they never answer the phone when i call for delivery. honestly the owner gives me the impression he doesnt want to make money. Delivery= 1hrs30min+ ... Much better options are avaliable such as Natsoub on Sainte Sined!!

EDIT: Calling now to order, been on hold for over 10 minutes...Will make update.
...Still never picked up. A shame as I would say, id really like to pay for some soufflé."}
{"text":"If I'm craving shish taouk , I head over to Boustan.

The trio is the perfect amount of food!
The sandwich is always meaty, served hot and freaking delicious.
The potatoes are salty and perfect served smothered in garlic sauce.
The third part of the trio is the drink.  

If you are drunk sober, kinda hungry, or really hungry, Boustan is never a disappointing choice on Crescent!"}
{"text":"We got delivery from Boustan while visiting in Montreal for the weekend based on Yelp. It was open late and the delivery option suited us. The food was the tastiest takeout middle eastern cuisine we have ever had  --- it beats anything we have tried in Toronto. We loved it so much that we ordered again the following night even though we have so much more other food options. Great job Boustan!"}
{"text":"Boustan does it right! Quick delivery to our place by place de armes and they are open late! We were staying in Montreal for 3 nights and 2 of those nights we ordered from them. It was that good. Solid good fast Mediterranean food that is reasonably priced. Try the eggplant also you will love it."}
{"text":"Come for the shwarma, stay for the falafels. This place is one of my favorite falafel/veggie sandwiches in the world and I've stopped in regularly over the past 15 years. Family run place and you often see the owner's son or daughter working. Quality has gone down slightly when \"Mr Boustan\" isn't working. But if you go while he's there, action will be high. This place feels like family with everyone in line joking around. Lots of regulars spill out from Crescent. Garlic potatoes also good if you have an appetite. Or after the bars."}
{"text":"Yum. . .had the Shawarma plate.  Everything on the plate was so tasty!

Minus one start for the falafel and other vege things that were fried and microwaved but it didn't really have a good texture."}
{"text":"I was looking for a good delivery place in the area since it didn't take long before I was sick of the hotel restaurant. This was the top result for the area and I love Lebanese food so I had to give it a try. I was not disappointed.

This place is apparently very popular because when I put the order in they told me it would be over an hour wait. I was determined to try it so I sucked it up and waited and it was so worth it. I ordered the Creation pita with a side of garlic potatoes and a side of hummus with pita bread. Everything was mind blowing good. I can honestly say I have no idea what was in the creation but it was amazeballs. There was enough food to easily be spread out over two meals, and for only about $12 that was a pretty awesome deal.

I will likely be eating from this place at least once a week from now on while I'm in town. I'll be smarter from now on and put the order in an hour or so before I'm ready for dinner."}
{"text":"Everything here is to die for. The chicken shwarma, falafel, and veggie wraps are all amazing. There was time last year when my friends and I would walk over from around McGill multiple times a week for late night snacks."}
{"text":"Excellent Middle Eastern fare: Sharwarma, falafel, eggplant, salads, Kofta, pita wraps.  We had Chicken and Beef Sharwarma plates which were great.  Portions were substantial.  It's right around the corner form the Museum of Fine Arts which we had just visited.  Also open very late at night into the wee hours.  Informal, efficient counter service and tables inside and out .Prices were moderate: Two Sharwarma plates and one beverage ran C$27."}
{"text":"tiny little place, delicious shawarmas. I've lived in the middle east and grown up eating them. I always felt that most shawarma places have north-americanized the shawarma recipie. These guys kept it real. The meat in both the beef and chicken shawarmas were perfectly seasoned, very juicy and the meat to salad ratio in the wrap was perfect. Ive had shawarmas in the past where the meat is very fatty. Not at all at this place.  Also, I could not believe the price! 4.50 for a decently sized wrap. it's also open late so after a night out, definitely a place to stop and refuel."}
{"text":"I'm giving this place a \"Fair\" review because it use to be good when it opened but the quality just went down hill. The last few times i've gotten food here it was just really bad. I kept thinking it was a one off day but finally my friend got sick the last time we ordered. It's a shame because whoever is running this place is giving the Boustan name a bad rep."}
{"text":"Microwaving my food on a styrofoam plate? Not impressing this girl. 

Place was busy though, definitely has a loyal following with many people who enjoy the food."}
{"text":"Like other fans of Middle Eastern/Lebanese cuisine I was also excited to hear boustan open in Laval. And they also had a promotion on fb: 4$ pitas. I go there and its not clear which side you should start ordering from.. the internal map of the place is so disorienting.
Anyways I reach the ordering counter and the \"friendly\" employee isn't even bothered to look at me to take my order. He was busy watching the tennis game on the screens behind me. I ordered 3 pitas 2 of which were included in the promotion but I paid full price. After another customer mentioned it I said yes I am looking at my bill and it was regular price... the 3 employees/stooges looked baffled and in pain (because they started to use their brains to think) and came up with the excuse: it's the universe's fault... it's a new promotion on fb and they need at least 3 to 4 years to start getting used to it!
The kafta I ordered they told me it will take 5-6 mins so I was ok. At home I see its cooked on the outside and red-raw meat inside.. YUK!!!
Overall the tastes of both kinds of shawerma didn't have the \"wow\" factor also... just good and can be much much better....
It's so sad to see very promising businesses go down the drain because of ignorant employees... if they don't want to be there... let them loose! (It's management's fault anyway).
And just a note to get it off my chest: if you go to Lebanon and you offer anyone a beef-based pita sandwich shawarma or kafta or kabab or chicken shawarma and you put \"turnip\" kabiss in it.. they will throw it in YOUR FACE!
Turnip kabiss is for FALAFEL!. All the rest it's either Lebanese cucumber(not cheap sweet gherkin)  or mekti! ... bili tisterkon jarrastouna!"}
{"text":"I usually like this kind of food but the chicken was tasteless, the potatoes kind of yucky, and they purposely didn't tell me about a promotion so I ended up spending more on a sandwich than I would have on a trio; I only found out after hearing other people order (they gave me a free soda with a guilty look when I called them on it). It's clean inside and stroller/wheelchair accessible which is a plus. That said, the food wasn't nearly good enough for me to go back."}
{"text":"I stopped into Boustan on a cold and snowy Montreal day. Asked for the triple combo hoping I would get the platter but I ended up with the sandwich. No worries, I didn't need all that anyway.

I loved the way they grill the sandwich with the bread making it slightly crispy. This meal really hit the spot. As I finish this review months later, I find my mouth salivating for another bite. Might be time to go back to Montreal, a true foodie city."}
{"text":"I've always been a fan of Boustan (The Original on Crescent). This location was 'Okay'. I say this because I feel like they're lacking something with their sandwiches. The meat was a little dry and I feel like the sandwiches are much smaller here.

The location itself just didn't have that Boustan feel you're normally used to. I would still stop by for food if I really had no choice in this area, but it wouldn't be my go-to spot."}
{"text":"I had the combo shwarma plate.   It was fantastic. Everything was nicely seasoned and everything that I've come to know and love about shwarma.   Small restaurant with seats for 15-20 people.   Service was quick and the meal was about 12 bucks."}
{"text":"Nothing inspiring in there. I think the place is bought from an old Cheesecake restaurant (I forgot the name) and kept the same outdated decors that are neither inspiring nor a match for a middle eastern restaurant. 

Presentation of food counter is so so, kinda sitting lazy and dull there, not screaming freshness. The right corner of the restaurant is turned into a fruit cocktail counter which is a copy of Antabli on l'Acadie but no one there to serve nor any lights. I don't know, looks like an abandoned and failed dream corner right in the same restaurant that doesn't help the overall impression of the place. Also, around 1 o'clock afternoon and only 3-4 people ahead of me that ordered and took out the food. I was all alone in the restaurant and felt odd seeing no other customers besides myself in that huge place. 

I bought a shish taouk sandwich which if I'm not mistaking was mixed with beef? From behind the counter you can see the meat on the turning stick has two different colours in multiple same pattern layers, one white, one brown, one white, one brown. 3\" and 1\" respectively. White for chicken and a layer of brown which I'm thinking is some kind of beef. When I asked the dude serving me what's up with the bicolour meat, he says it's bcs the brown part is more cooked than the rest. Yeah? They must have a special burner doing that trick ha? Interesting answer. 

I haven't tried anything else that day bcs I didn't want to feel heavy and also wasn't even tempted to try anything else. The sandwich was ok (had better elsewhere). 

Overall rating is 3 starts for now, however, it could change upon my second visit. I'll give them another chance and update here."}
{"text":"Solid middle eastern carry out. Large platters. Pretty efficient service too. Basically clean."}
{"text":"I love Boustan. And they always show up a half hour earlier than the given time on just eat. Please never shut down."}
{"text":"I grabbed a quick lunch at Bouston yesterday, right before heading to the airport. It was my last meal in Montreal and it did not disappoint.

It's conveniently located on Crescent Street within stumbling distance from the bars and also within walking distance from our Sheraton hotel. 

I ordered the combination plate for $10.45 which consisted of generous portions of beef & chicken shawarma, garlic potatoes, rice, coleslaw and hummus.

The plate definitely hit the spot. The garlic potatoes are pretty addictive. I did see the employees reheat the beef shawarma in the microwave, but i'm not mad at them. I understand the difficulty and need to keep up with production. The meat was still tasty. 

Overall, a very good Middle Eastern / shawarma option in the area."}
{"text":"I can't remember the first time I had Boustan's but since then I can't have a Shish Taok wrap anywhere else. The perfect pita crisp, the perfect salad/ chicken balance, and the perfect amount of sauce (this can be a deal breaker). Everything pales in comparison to these flavourful, authentic Lebanese wraps. Their garlic potatoes are also tremendous but i would recommend grabbing two wraps and a coke. Everyone loves going to this place after a night of boozing on crescent, but I honestly like it better during the day. Every time I do it at 4AM my body feels like a garlic-filled garbage can the next day."}
{"text":"The best chicken shawarma and best garlic potatoes I've ever had. Amazing value. Avoid Basha at all costs, and grab Boustan instead."}
{"text":"Awesome little hole-in-the-wall type place. They offer a variety of entrees that include different side dishes such as rice, potatoes and salad, and the portions are huge! The potatoes with garlic cream sauce on top are a must-try- the sauce is delicious."}
{"text":"The 'Creation' wrap was amazing, and the garlic potatoes were delicious. Share the order of potatoes or be prepared for leftovers or a food coma. The line up is crazy and chaotic, but these guys know how to deal with it and it moves fast, so don't be scared if it looks like a mess when you walk in. My favourite take out meal of my trip."}
{"text":"Was planning to go to Amir but they were out of beef! I got excellent advice to go to Boustan instead. My beef shawarma plate was terrific; fresh and filling. Potatoes and rice were flavourful, and their salad had shredded cabbage which was really nice. All sauces (garlic sauce, garlic mayo, hummus) were packed with taste!

And I can't finish without noting the staff was all young, dynamic and super-friendly. This is a new go to for my family."}
{"text":"I always go out of my way to eat shwarma when I'm in Montreal.  Heck, I've driven up from Plattsburgh just to eat here.  It's a busy place and they expect you to know what to order, but they are also accomodating when someone new comes in.  Food is honest, flavorful and priced right."}
{"text":"If you need to satisfy your 3:30 AM hunger with some adequately tasty, cheap and quickly delivered food, you can't do much better than Boustan."}
{"text":"Having visited Boustan one too many times during my final's week, I can safely say I'd go again. The service is fast, you can thankfully sit and eat if you don't want to leave. From the outside, it looks like a small hole-in-the-wall a la Chez Danny style but there are a few tables constantly vacant since most of their clientele are students that have to get back to Concordia for their following class.

The selection is quite typical of Lebanese restaurants. Shish-taouk, Shawarma, garlic potatoes, etc. (You know the drill if you are from Montreal). Nonetheless, the food is still quite good and well worth the price.

One thing that I'd warn against: their shish-taouk sandwiches are pretty greasy. My Lebanese friend, who probably knows every single Lebanese restaurant in Montreal, also noticed the same and called Boustan \"inferior\" and told me \"they lost the way of the holy pita sandwiches\". Don't hold it up too long or the grease will fall through the paper. I had to clean up a mess on the 8th floor of Hall because of that.

It's quite typical and nothing to really gouge your eyes about. I'd recommend chateau kebab over Boustan to be honest."}
{"text":"#1 Lebanese food in the West Island hands down. Perfect Shawarma chicken every time at a more than decent price. It's me and my dad's go-to place (and quite possibly the reason my old racist Greek grandma started liking Arabs).

That being said, I do recommend the trio chicken pita. Great value for the price and they don't cheap out on the damn garlic sauce like motherf*cking Amir. That thing is water. Don't go to Amir. It's the McDonald's of Lebanese food. Especially if you can go to Boustan instead.

Recommending \"Creation\" if you really want to inflate your stomach.

P.S. Don't eat the pita sandwiches in the car, it leaks. Unless you're a very careful eater!"}
{"text":"boustan.  goodness.  my shawarma combo plate ran me $10.45 consisted of chicken shawarma [mistakenly referred to as 'shish taouk' by quebeckers, for some reason... imperialism functions oddly and cruelly], beef shawarma [layered and sliced pieces of meat rather than ground], hummus, pickled turnips, seasoned rice, roasted potatoes, a garlic-laden mayonnaise, and a very refreshing shredded cabbage salad.

the meat was very nicely seasoned, delightfully fresh, and gorgeously sliced.  the beef was topped with a mild tahini sauce.  i've heard reviewers here describe the meat as 'dry,' which really rubs me the wrong way -- in the middle east, most meat dishes are cooked until well done.  the flavor of the meat comes from its freshness and the spices used to season it.  boustan's meat is as good as it gets.  somewhat dry, due to the nature of a shawarma rotisserie, but complemented nicely by a variety of textures offered by the sides.

i also tacked on a small plate of tabouli salad as a side for about $3.50, since i was feeling like treating myself.  the tabouli was fresh, and heavy on the lemon juice and oil based dressing.  very refreshing, but only worth the price if you feel like throwing down for a salad that virtually anyone could make at home.  i'm a big fan of fresh herbs, and tabouli makes an excellent palate cleanser, so it was obligatory for me, but then again, if i was enough of a weirdo, i would've made my own tabouli and brought it with me, sneakily eating it out of a tupperware dish.. pocket tabouli.. mm.."}
{"text":"Great flavourful food! We have only ordered in, so I am not too sure what the restaurant looks like. I would highly recommended this place!"}
{"text":"Food is good but the service is TERRIBLE. I don't usually write reviews but I was so taken back by the rudeness and arrogance of their sandwich maker. Outdoor area is dirty - filled with literally birds and bees. Good food in Montreal is a dime a dozen so good service and cleanliness is very important. 

I have a business myself and if my employees were to ever yell at paying customers I'd fire him/her on the spot. 

I personally will never return to this establishment."}
{"text":"This is the restaurant that Verdun needs. For several years, we were stuck with the really badly run franchises of Amir and Basha. I was very excited to see that a Boustan was going to open in the area over the summer (2017). Boy, I wasn't disappointed. I saw that another reviewer criticized the shwarma as being very salty and dry. I have eaten at the Verdun Boustan 5 times since it opened and it has never been the case. The pita sandwiches (shwarma) are always very tasty and well cooked. You can even ask for a crispy piece (or not) if you have a preference. The staff is super friendly and good at what they do.

If I had something to criticize, well, despite taking it from the back of the rack, my drink wasn't as cold as it could have been (maybe the refrigerator isn't set to cold enough). Also, whenever I order the garlic potatoes anywhere else, I'm usually asked if I want them heated up in the microwave. This was not the case. I had to do it once I got my meal home, but nuking the potatoes isn't good for the garlic sauce that they include in the container. It would be easy to correct this issue if the staff asked customers if they wanted the potatoes heated up. 

Other than that, I love this place and I think that the competition should be worried..."}
{"text":"I almost missed this place because its almost underground in terms of location. But I am glad I found it. Food is good, prices are reasonable, I had the Beef and Chicken Brochette and my husband had the Beef and Chicken Shawarma both of which included rice, garlic potatoes, salad, coleslaw, hummus, garlic sauce, hot peppers (optional), pickled radishes, and a pita bread each. The meal was very filling, it took me a while to finish it all. I don't know why people say the workers or whoever are rude, I feel the people who work there were very polite. But then everyone has different experiences. Will visit again if I'm ever in Montreal. Again hours are great! Open late...like late late."}
{"text":"been there twice first time the food was amazing but this week i went the customer service was horrible very rude and we seemed to be bothering them. The food tasted old and they even heated up the food in the microwave in front of us... 

also very dirty,should have left right away"}
{"text":"This is a popular Lebanese restaurant at the southern entrance of the popular Crescent Street area of Montreal - the English-speaking side of the city's infamous partying street.  

Boustan is really popular in the late night hours when people are pouring out onto Crescent Street around last call.  They gorge themselves with shawarmas and kabobs which is excellent drunk food.

One thing you can order that's not on the menu is the \"creation special\" where they liberally add toppings like eggplant and potatoes to your sandwich.

Honestly, I don't find the quality to be that good. Boustan came highly recommended from a friend but I didn't find it to live up to the hype. The food just doesn't taste fresh nor is it very warm."}
{"text":"Boy! This place redefined the chicken shawarma. Easily, the best tasting shawarma I've had anywhere in the world. The shawarma plate contains potatos, hummus, garlic sauce, rice, chicken shawarma and a salad. All of them are delicious to an infinite extent. Too bad, I don't live in Montreal but if you do or if you are visiting, do try this small whole in the wall place."}
{"text":"This is definitely my go-to when I have a late night and didn't have time to get dinner. It is pretty consistent, but sometimes you go and can tell the food has been sitting out for awhile. But when you're hungry you don't notice.

I'm not going to pretend like this place is stellar, but for a quick bite, it's pretty alright."}
{"text":"Checked in late and the Boustan was the closest place to eat. The inside is simple but that's not the point because the food was so good! I got a combo platter. Bless this place and the late night hours. There's an old news article that is framed at the front that recounts the story of the Boustan and the early days of trial and error. Much respect for how they started to where they are now."}
{"text":"The chicken shwarma is amazing. Get it \"fully dressed\". You wont be sorry!"}
{"text":"Its a love hate kind of thing . . 

Its open till LATE

Minimum delivery is something like 8$

The food price is on point 

But typically you will eat here or get delivery after a night out and the next morning you never want to see the stuff again!

Otherwise its pretty similar to any other Arabic food place."}
{"text":"Meeeh. It's Above Average, food is ok, could be better. But Their Prices are hard to beat! Would Recommend if Broke and Hungry!"}
{"text":"I hiked up to Chateau du mont and then on the way back stopped here for a meal. The location is great, the food is excellent. I highly recommend it and make sure you get an Ayran with your meal. Ayran is a Turkish/middle eastern yogurt drink which goes great with shawarma meat."}
{"text":"We came in after a night out because we had heard good things about this place. I don't know if it was because it was really late or what but the food was a big disappointment... The potatoes were all dried out and nothing really seemed fresh. To top it off the staff was so unprofessional. One of the guys who works there, was off his shift and started persistently hitting on/harassing my friend to the point that it became EXTREMELY uncomfortable. It was all happening in front of the owner/manager and he didn't seem to care that his customers were being treated in this manner."}
{"text":"- good shawarma. very good. they toast the pita lightly on the grill, and use cabbage instead of lettuce. 
- great kebbeh and garlic sauce
- was saddened by the fact that the rice and potatoes were microwaved"}
{"text":"Yummy yum yum. Love Boustan. It's cheap, fresh, and absolutely delicious Lebanese food. And if that's not enough, they also deliver until 4am."}
{"text":"Awesome for the price. Best shawarma I've had in Mtl! Don't expect a fancy restaurant design tho."}
{"text":"Boustan has been around in Montreal for ages apparently, and I'm so glad I finally got to try it. It was a line assembly, and all the workers were very nice. They have faucet water at the sink on the right side with plastic cups, or else you have to buy bottled drink from the fridge.

I really enjoyed their potatoes as a side surprisingly. Not much of a potato person, I thought their potatoes were outstanding. Super flavorful. I also really liked their garlic sauce, not so much their garlic mayo (because it is unhealthy) even though they give you a big serving of it on the side. 

The place is super casual and affordable, and I can see lots of families and friends going here for a quick Lebanese comfort meal. I loved all the meat platters to include the chicken and beef, and could have eaten an additional tray of it. I thought the vegetarian platter wasn't too interesting because you pretty much get everything on the meat platter except the falafel, which wasn't that good."}
{"text":"The food here is good, but not great. This is the second branch opening, food is very flavorful, but some things like the garlic aioli are pretty heavy and oily. Great if you like that kind of food but not great if you don't, they have lots of small accompaniments which are pretty good."}
{"text":"Don't go for the dirty trays, the lack of napkins, the visibly overflowing garbage bins, the enormous television, the predictably forgetful counterman with one whole customer standing at the counter (\"Was that for here, or to go?\" Twice, now.) and the tepid level of heat your tongue inevitably finds at the core of the sandwich.  No.  Go for the way their beef shawarma *tastes*.  

That would be the beef shawarma in pita.  With hummus.  No white sauce.  Go for the unique, alien flavor of it, imparted by Cthulhu-knows what spices they use in the shredded lettuce, and whatever the hell those red pickled things are that they add to the garnish.  The taste of the stuff is mesmerising.

Go because the taste of the stuff will send you to some Fritz Leiberish alternate universe.  You'll be eating the fast food of Lankhmar.  On Crescent."}
{"text":"I was expecting Halal Guys late night meals but this wasn't that. They heated the food up in the microwave. It was alright, not the best. The falafel were super dry, not crunch at all."}
{"text":"Had lunch here recently, got the chicken shawarma plate. It was very tasty, filling and cheap. You get the chicken, humus, rice, potatoes and more.  I was happy to find this place and would go back except i am still full. 

The location can be a little hidden since you have to go down stairs from the street to get to the front door.  They do have a big sign that is about eye level  on the street so that makes it a bit easier to find. 

It is a cafeteria style set up where you go down the line and pay at the end. They have tables inside and tables outside that would be real nice on a summer day. Most of the people in there were collage kids but there were some working adults also on their lunch break, so it appeals to a wide audience."}
{"text":"Went around lunchtime and had a great meal!  The guys behind the counter are quick and know what they are doing."}
{"text":"Best shish in town, fo shizzle. 'Have eaten the chicken sandwich here more times than I can count. It always hits the spot. They put cabbage slaw inside and it makes all the difference. The tabbouleh is good too. Plus, delivery is usually really fast. I love me some Boustan!"}
{"text":"There is this halo effect around Boustan as though these characters invented the felafel sandwich.

I'll grant you, having a shish taouk sandwich  delivered to you is awesome and has increased my general laziness considerably since I discovered that they deliver here on Yelp.

That said, I must say their Kafta surpasses the other menu items by such a huge margin, I find myself mostly ordering Kafta, and suggest you do the same.

Their drivers have a tendency of getting lost like lambs but they do call you and the food does eventually arrive.

Their home fries or batata are better than the competition, and I'd say Bousties is my go to for Lebanese food."}
{"text":"I always order delivery from Bousties and I gotta say I'm pretty satisfied with their service. 

They always show up within the time frame they tell you, the food is always warm and fresh.

You're gonna wanna try their Kafta. Their shawarma is decent, but their Kafta is where it's at.

I don't know why they have Pepsi instead of Coke, that's the one thing I'd change."}
{"text":"The potatoes with garlic were wonderful. I also really liked the chicken and beef very flavourful and decent portion size. They also gave two different types of rice and hummus. They gave quite a bit of cabbage but I'd say there was a bit too much and it wasn't amazing. 

Will definitely be coming back here next time I'm in Montreal."}
{"text":"This Boustan does NOT compare to the one on Crescent. Chicken is always dry, sandwhich is wayyy smaller, staff have no idea what theyre doing most of the time, pita is not toasted long enough. Just really bad overall. Im only eating Boustan on Crescent."}
{"text":"Wow how far this place has fallen, in such a short time. The douch bags on the phone seem to think that the  service and curiousness this place was built on no longer applies.
I mean wow. 
This was one of my most recommend places... Now it's a stay away. 
As good as food can be, service or lack thereof is a reality, and their passion for indifference rates this place as a failed business."}
{"text":"Amazing chicken shawarma. I always get it to go, incase I have extras. Definitely get extra tiziki sauce. It flavors up the food. You cannot go wrong with this place regardless of what time of the day it is. I have gotten food in the middle of the day and as well as late as 2 am. Tastes exactly the same. Fresh and tasty."}
{"text":"So happy for a place like this  to have late night eats!! When your stomach cries fooooood - your healthier option next to MCDs is this place! Even though the owners have changed for Boustan  - the staff remains festive! I ordered the beef pita trio for less than 10$. It comes with a choice of potatoes with garlic sauce**** or coleslaw+ soft drink. So good for for the soul! Still a montreal landmark for food!"}
{"text":"Went back for the first time since \"Mr. Boustan\" sold the place a few years ago. The chicken shawarmas are still delicious, but the service took a hit. It's still arguably the best place to grab a quick lunch around Concordia or an early morning snack after a night of drinking on Crescent Street."}
{"text":"In the beginning was God, and God was the beginning, and in the beginning was Creation, and God was like, I think Creation needs to be more lit, so s/he wrapped that shit in a pita, with some Shish Taouk and eggplant and garlic potatoes. And God was satisfied. But not satisfied enough, so s/he was like, I'ma sell some of this Creation on Crescent and Maisonneve. And drunk Concordia students flocked to get some of that Creation. And they were pleased. God is good."}
{"text":"Amazing shawarma! Perfect size at perfect price! 
More meat than vege ratio! :) saucey too!
Must try!"}
{"text":"I can see why this place has such high ratings, it's the only place open at night around here. I mean the food is good, but is it fresh? Eh.. Not so sure. I chose the combination platter. All the food was laying out like a buffet style. They just scooped and then microwaved my food right in front of me. The platter was plenty for two people."}
{"text":"If I had written this review a month ago, I would have given them a 4 or 5 star rating. A 4 star because, you really have to stand over the staff to make sure that they don't put sauce all over your food (when you ask for no sauce), they seem to work on auto-pilot and forget the orders very easily. The food was good, and the staff pleasant, so that you could over look the forgetting.

Today, I had a terrible expirience. Like usual, I asked for no sauce, and like usual, they smothered it everywhere. I didn't catch the mistake before leaving and so when I got home, I couldn't eat my food because (to me) the sauce is nasty and just goops everything up. A little fed up from this happening, for no exaggeration 5 times, I called to complain. The staff was kind and sent a replacement asking that I send the first one back. The delivery man came to bring the food, I gave him the original meal and he was very bothered by having to bring back the container. As, he walked away from my place he turned to my composter and dumps the entire container (including the styrofoam) into my bin. I get the lovely task of fishing it out from the bin that is filled with rotting food, flies, and maggots. Plus, the way that they wrap their pitas, leaves them dry and crumbly. I don't believe I will be returning."}
{"text":"It's not bad. 

I don't go to many Arabic restaurants, since I can get the real deal at home, but Boustan is better than most fast food Arabic restaurants out there. If it still had the old management, I'd give them 4-5 stars. However, the new management isn't up to par. I've seen and heard them be terrible to customers, which would've never happened before. In my experience, they were just dull and didn't have much personality. Before, no matter what mood you walked in with, you were sure to leave with a smile on your face, if not laughing up a storm. 

Service is key, come on guys - get with the program!

So long as they're fresh, the potatoes are good. I made sure to ask if I could try a piece and the server chuckled, well - chuckle all you want buddy, not only are my taste buds in check, but I'm Arab too and know my Arabic food. I'm not going to pay for something dry and tasteless that was cooked 2-3 days ago, either. 

Chicken shish-taouk or kafta sandwich are the way to go, but this place has lost its charm."}
{"text":"1st off the guy taking orders didn't want to make the kafta kebab we ordered so we had to switch to a beef pita.

2nd he and the guy working the grill messed up our order and the guy taking orders took his anger out on us, as we patiently waited as customers behind us received their orders first.

3rd the guy cleaning the tables did not use anything to clean them aside from brushing off the crumbs.

4th and this one made me stop eating my pita, the guy taking the orders took a tomato from the prep station to show one of his co-workers and he proceeded to touch it several times with his hands and then place it back into the prep station. 

I am giving them 1 star because of horrible customer service and unclean standards."}
{"text":"came to this place and go the half chicken / half beef platter. along with this i got the brown rice, salad (more like coleslaw), garlic cream sauce, hummus, beets, seasoned potato cubes, and two hot pita breads.

it was daaaaaamn good. the entire dish had a flavor that was derived from the meat. good cuts, super succulent and totally worth it. im telling you, come here and get this dish."}
{"text":"Great chicken shawarma

Not so good beef shawarma"}
{"text":"It's 3:30am and after karaoke-ing, Lebanese food sounded like a perfect way to end the night. 

Boustan's is a teeny eatery situated downstairs from a nightclub, a spot where all the drunkies go to post partying. 

Oh but boustan's isn't just good for post-drunk meal, (i.e. dennys lol), their food is absolutely delicious.

The staff looks like they've been there for too long, but hey they're doing something right with their food.

Tried their potatoes had this yummy creamy garlic sauce atop. Also tried their chicken shwarma pita. The pita was toasted warm, crunchy on the outside, and soft inside. Their mix of veggies they throw in there definitely adds more life to that pita. 

One thing I didn't fancy was that they went overboard with their garlic mayo sauce. Wayyy too much of that in there, but you'd hate to ask for an amended version because the main guy here reminds you of the soup nazi. Like, this ain't BK, it would almost be rude to have it your way. Nonetheless, all the food was good, and cheap.

Better than many of the LA spots that serve similar food, but certainly still not the best. Solid 4 stars here."}
{"text":"I am going reduce Boustan from three-stars to two-stars.

I had two shawarmas: one chicken and one beef.

The exteriors of both were warm and crunchy and therefore started to disintegrated after the first bite.

The interiors were cold and dry; the vegetables chilled and the meat, at best, lukewarm.  The beef is already pre-cut and drawn from some metal storage tub-it is tasteless, stringy, and dry.

This place is filthy-dirty; food on the floors and trash spilling out of garbage cans.  I see very little good about this place apart from the quasi-reasonable prices."}
{"text":"Si vous n'êtes jamais allez au boustan, vous manquez sérieusement quelque chose.

Le pita au poulet 
10/10"}
{"text":"Prob one of the best Shawarmas I've ever had. Make sure to get it fully dressed. They throw it on the grill to toast the pita which gives it a nice crunch. The nice part about this spot is the hours. Great place for lunch but also a great spot to hit up after a bar/club since it's open till 4am. Will def go back whenever I visit Montreal again!"}
{"text":"Visited this place on Friday evening around 6 PM -7 PM, it wasn't crowded at all. The ordering is pretty systematic. You place your order ( along with your sides and additions) and finally checkout, had an international card but skipped out and paid by cash. We ordered the shawarma combo and the chicken trio ( comes with a side and drink) I chose the potatoes after reading the reviews. The shawarma combo comes with rice and potatoes, chicken and beef as well as garlic and hummus so it's like the whole nice yards with Pita. The food was really good and was extremely close to what a shawarma should taste like. Both were really filling for two people, there is a spicy sauce option for the shawarma as well. I would recommend this place to some one who would want to try an authentic shawarma out !!"}
{"text":"Boustan is officially one of my favourite places to go to now. I'm a student in Concordia so it's streets away, the food is off the top, and the service is so fast! I always have the veggie plate because there's so much food for $8 (not including tax) and it fills me up. One more thing about the plate is that it's filled with all sorts of different flavours and it never gets you bored (I usually get bored when there's only 1 flavour in a dish), so it's perfect for someone like me! There's always a little queue here regardless of the time, but your turn comes quick since it rotates really fast. It's a great place for busy students, but not a place to stay around and hang for a long time!"}
{"text":"Looking for a quick delicious bite after enjoying the Fine Art Museum? Follow your nose.....

You can smell the flavours of Boustan from up the street. Then you see the happy people sitting outside and the stickers from YELP AND Trip Advisor on the door. Join the line of eclectic people (Young & Old from all backgrounds) waiting and see Justin Trudeau's picture on the wall just before you order. 
There are 9 tables inside if you want to sit but it's also good to leave and have a picnic with Great take out Shawarma with all the fixin's! 

The line up goes fast and you pre-order before you get to the front which even makes it go faster. Best chicken Shawarma I've had while on vacation in Montreal!

Please recommend more for me..."}
{"text":"This is our regular shawarma dive and it didn't disappoint this holiday weekend lunch. Service is friendly. Food is reliable and generous. Sometimes you just need good, cheap shawarma and this is the spot."}
{"text":"Je suis sortie jusqu'à tard, après des mois et des mois! Rendu chez une amie vers 3h du matin et sur Guy et St-Antoine, nous commencions à avoir faim. Et à part une pizzeria louche de Verdun, il n'y avait pas de resto ouvert pour la livraison. Il fallait donc se déplacer pour manger. Désolé je ne suis pas assez riche pour foodora ou ubereat... Et du Mcdo..et bien, j'en ai mangé 3 fois en 2 semaines..  Anyways

 C'est alors que Yelp m'a aidé à trouver un resto à proximité et ouvert....Le Boustan était le choix judicieux! Nous nous sommes donc aventurer sur la rue des très jeunes  soupçons des sorties de clubs, qui chill encore à 3h40, car c'est sûrement leur première sortie avec Fake ID, je parle de la rue Crescent! Arrivé devant le fameux Boustan, il y en avait des petits jeunes souls avec leur spinner..et un line -up. Malgré le line-up, ça n'a pas pris de temps pour se faire servir! J'ai pris un classique
..le trio sandwich poulet, avec patates! 

Malgré mon ancienne vie de débauche, qui incluait des fois la rue Crescent, je n'avais jamais essayé le Boustan de Crescent. J'avais été à celui de Rivière-des-Prairies, qui était ok..mais sans plus...tsé tout est bon en y ajoutant de l'ail ou presque...! Il y avait du monde qui me parlait du Boustan...que c'était donc ben bon et tout...mais bon je ne les comprenais pas...car à RdP comme je vous dit c'était ordinaire...

Bref, sur mes patates j'ai demandé Humus et sauce à l'ail. J'adore quand le gars derrière le comptoir prend la cuillère remplie de sauce et y va d'un élan pour que la sauce tombe adéquatement sur les patates! Quand j'ai goûter au sandwich..j'ai compris pourquoi les gens capotait autant!! Le sandwich est tout chaud tout croustillant! Le poulet est malade mental  et les patates wow! Bref, c'est sûre que je recommande le Boustan peut importe l'heure! J'ai bien hâte d'y retourner miam!"}
{"text":"This is an awesome Lebanese shawarma establishment. Went in on a monday evening for dinner with my folks and it was packed. The guys behind the counter was extremely polite and helpful. We got Chicken Shawarma. Chicken Shish kabab, falafel with cuscus and more felafels! Everything was on par and the price is more than reasonable. The only suggestion I would give to the owner is to keep Lamb shawarma and other lamb meats such as lamb chops etc. They have chicken, veg and beef. Lamb and Pork are missing from the list."}
{"text":"Oh Boustan. The centrepiece of every drunk night out in the Plateau (or Concordia Ghetto). A Montreal chain of Lebanese late-night fare--falafel, shwarma, kaft kebab, garlic potatoes... pretty decent. If you're hammered.

I just have one question:

Why here? Why set up shop next to the most legendary Middle Eastern restaurant in all of Montreal? It's like deciding to open up a golf course next to Pebble Beach, or a concert venue next to Carnegie Hall? Sure--it follows the Starbucks strategy: if an independent café is thriving in Area X, chances are there are enough basic people for your café to survive in Area X+0.00001.

Unfortunately, Boustan misses the mark. By about, seven hundred miles. Watery garlic sauce, burnt pita, chicken that tastes like it did before farmers bred the species to taste like non-dinosaur. A marvellous gambit on part of the Boustan staff to try and pick up the neighbourhood's drunken, sloppy seconds, but then again--that's all this restaurant is. You're better off ordering another shawarma a week in advance, letting it rot on your countertop, and then digging in. It will probably still taste better. Sorry Boustan :("}
{"text":"We did not plan on coming here on our Montreal food for, but as we were walking down the street, we saw two groups of people go into this halfway underground hole in the wall, and our interest was immediately piqued. Following locals is always a good idea.

Who even cares if this is authentic?! It was freaking delicious and satisfying as hell. The bf and I got a platter each, his with skewers and mine with shwarma. Both plates came with delicious picked veggies, rice, soft potatoes, which we smothered in garlic sauce and hummus. The meat was flavorful and tender, and we wolfed our plates down. I'd give it 5 stars if the platter was $9-10 instead of $11-12 (quadruple digits is high for late night, hole in wall, sober-me-up food) but for the amount of food on it, it was a great deal."}
{"text":"This shit is the BOMB, no pun intended because it's a Lebanese place either.  Every time I visit Montreal, I make this my first stop, and this time I took 9 other Los Angelino's with me to experience this gastro-phenomenon.

I've had EVERYTHING on the menu at one point or another.  I like the way they toast the pita sandwich so that it doesn't fall apart - nice touch.  The home fries and mayonnaise is worth the heart attack, and the owner is super nice and friendly.

So the place is a bit dirty, so what - don't lick the walls.  Take it to go and eat it elsewhere, but just eat here period."}
{"text":"Pretty good Arabic food, even if you're sober! I opted for the falafel platter and everything was very good except the falafel itself. It was very bland and the texture wasn't so great either. However, the pickles, hummus, vegetables, and garlic sauce were all great. The shawarma got the thumbs up from my friends.

It's a hole in the wall, but not too dirty."}
{"text":"Great food, reasonably priced, with huge portions. Get go wrong with that combo."}
{"text":"Found it on Yelp and stopped by to satisfy a craving for a kebab. Food was really good and cheap.  Crowd is young a to a large degree middle eastern which is a good sign for a middle eastern restaurant. Not a fancy place but great for a quick meal or takeout."}
{"text":"Usually I love it here. I ordered the plate and legit got just potatoes and a pita with no meat no salad no garlic sauce. I don't even know how you can just bring someone a
Huge container of potatoes and not even garlic sauce lol."}
{"text":"Good shawarma and falafel. Reasonable prices. I ate here twice over my two day stay!!"}
{"text":"We popped in here late night, super hungry. I'm pretty much a Middle Eastern food aficionado, having spent a considerable amount of time in Syria and Lebanon. I especially like Kofte kabobs, those juicy, formed bites of ground lamb. These were great!

The Kofte dinner was enough for two. Rice, delicious thoum (garlic mousse), hummus and salad accompanied the Kofte, and everything was delicious. Everything was served up quick, fresh and definitely for the right price.

We were vacationing in Montreal when we ate here. If the unthinkable happens, and Trump wins the US POTUS, and I have to move to Montreal (would be awesome) I'll be a regular here!"}
{"text":"Update !

After picking up a wrap with my friends it turned out to be the best wrap ever! They put extra garlic sauce and turnips just the way I liked it. Meat tastes fresh and not fatty and it wasn't burnt the pita which was shocking because I always get a little burnt part that I can't stand.

So for anyone who wants boustan I suggest you go pick it up at this location it beats the main one downtown and that's super impressive. I know they are still new but let's hope they keep it up because there's Amir, basha, shishtaouk wellington & nick pita all on the same street.

Open until 11pm"}
{"text":"I finally got to this place.   Not sure why it took me so long, as it's a 3 minute drive from my house, but better late than never!
I walked in and noticed they  don't have plates or utensils.    You eat out of foam clamshells and you get small plastic forks.     
So I tried the beef shawarma with potatoes, coleslaw and sauces.
It came to about $12.50 with tax.
It was ok.    Meat was very overdone but the taste was good.    
Cute little place, very clean.
This seems like great food for the end of a night out."}
{"text":"Ordered delivery. This is the amount of chicken I got... this establishment is an absolute fucking joke. I order here very consistently and I am certain that they are familiar with how often I order food from their restaurant. The fact that they deemed it acceptable to send this to any costumer let alone someone who used to be extremely faithful to the boustan name is honestly just sad. I highly do not recommend ordering here."}
{"text":"If you have never had Lebanese like myself, order the welcome plate. You will get to taste everything. The meat is full of layers of flavor and straight up delicious. I felt like such a pig with so much food just for myself. I ate way more that I should have. You could definitely share this plate with someone and both be full. If I lived in the area I would make this a staple stop for take out or even to eat outside in the patio area. Thank you guys for such a fantastic first Lebanese meal!"}
{"text":"Boustan is one of the best comfort food you can have. Especially at 2am after a drinking night. Thats is true for the one downtown!

If i have to compare, this one is not exactly comparable to the one on bishop in terms of taste and freshness. The usually so good garlic potatoes are rather dry here, and cold. 

I had the shish taouk chicken wrap all dressed, even with the sauce, the chicken felt a bit dry...

Good place to go to if you live in the hood and craving for shish taouk, if not the downtown location the place to go!"}
{"text":"Average Middle-Eastern food restaurant. The plates are relatively good sized. The place is usually clean. The most beneficial aspect of this diner is the hours. Usually I hit the Boustizz after a turn up. The staff is lacking some professionalism but that doesn't bother too much."}
{"text":"Baba Ganoush, Hummus, Falafel, stuffed grape leaves with yogurt and Tabbouleh salad with warm pita made a working lunch most bearable!  There were also crisp cuke slices and tomatoes along side our wonderful array of goodies. 

Even though our lunch was delivery, somehow the goodies arrived warm and those that ordered falafel pita sandwiches were pleased to see that they were not soggy.  I couldn't believe how quickly we gobbled up all that food!  Our bellies full....we got back to the task at hand with a smile on our faces.  Needless to say the Boustan delivery guy made a repeat trip the next day!   I'm finding out, the easy way mind you, that Montreal has a wide variety of ethnic culinary delights....and I've only scratched the surface."}
{"text":"The Schwartz's of Shawarma baby!. We eat there twice a week or so. Everything is great, but try the \"creation\", spicy, with a side of garlic potatoes. Keep you going all day."}
{"text":"Great food, friendly service, yet very inexpensive! I was craving Lebanese food so while in Montreal I decided to check this place out (thanks to other recommendations on Yelp). We ended up going twice (dinner and then lunch the next day). My husband got a beef gyros and I got a vegetarian one and the kids had hummus and tabouli salad. By far, the best meal we had in Montreal!"}
{"text":"Best damn falafel sandwich which has ever entered my pie hole.  Moist, tasty, chick-pea/fava balls of glory wrapped in ultra crispy pita bread with just the right balance of veggies and white sauce in the mix to make this sammy a tongue pleaser.

Will be back for more no-animals-were-harmed-in-making-this-sandwich-awesomeness."}
{"text":"The food is definitely consistent with the downtown locations; good tasting and affordable.

The service is slow, maybe because still working out the kinks since it just opened on August 17, but really worth the wait.

The chicken shawarma (aka shish taouk at a competitor's) is delicious.  Instead of using lettuce, they dress the pita sandwhich with coleslaw.  You can even ask to put some roasted potatoes in the sandwhich.  What makes this place so good is that they roast your sandwhich on a grill, giving it the crisp that they're known for.  

I've now graduated to ordering The Creation. It's pretty much a chicken shawarma overdosed on crack - it's all dressed including eggplants, hot sauce, and much much more!

What I love about the garlic sauce at this place is that it's light - not overly pungent - and you can still have a conversation with a close-talker after the meal ;D!

If this is going to be your first Lebanese food experience eating a chicken shawarma, then be warned, you've already set the bar high.

**
Not sure if they're going to end up stocking up but when I was there on opening night, napkins were scarce... You might want to bring extra napkin because of the grease from The Creation."}
{"text":"Best shawarma I've ever had. It's almost the same since it was franchised. But it is less consistent. Cannot believe Dahlia's closed. Such a loss."}
{"text":"I went to this place with a bunch of my friends after a long night of bachelorette celebrating. After all the years of going to Concordia, I can't believe I haven't been to this place before. I had a simple beef sandwich/ Shawarma /wrap thing and it was fantastic! I have no idea when this place closes or if it does because I think we were there quite late/ early in the morning. The line went right out the door it was so popular, but the people there are super efficient and the line moved quite quickly. They have pictures of famous people who have visited posted on the walls to give you something to look at while waiting which also makes it seem less long. This place is awesome for a late night snack and definitely makes your morning much much more pleasant after a night of drinking. ;)"}
{"text":"This is great food! A hole in the wall!"}
{"text":"Love Boustan! I'm so glad that it is a short walk from my apartment because their food is amazing. I have only ordered out, but the inside seems nice and comfortable. It is not very large, and usually packed with students but there is ample seating. I ALWAYS order the 'creation' combo which includes a soda and the most amazing seasoned potatoes with a healthy dollop of garlic sauce. The eggplant is the amazing surprise in this chicken sandwich. The price is just right, the service is fantastic, and the food is delicious- plus they're open late! Do yourself a favor, if you're in downtown Montreal, be sure to try Boustan at least once."}
{"text":"This is my go to place from my university when I am hungry. They are fast and the food is good. But recently I have come to notice that they have reduced the serving size of potatoes and the pita used on the trio gets extremely crunchy that it can hurt your gums. I know that it becomes difficult to maintain quality serving so many people at once, but after all we go there for just that quality. I hope they take care of it."}
{"text":"Please send someone to make the food on the Ste-Catherine location! The taste does not compare to your excellent pitas downtown! Either that or please deliver! Best pita in town and most bomb garlic potatos"}
{"text":"Best Lebanese food in Montreal, especially the downtown location. The creation sandwich with spicy sauce is a must. We ordered delivery from the Berri uqAm location and we could taste the difference. If you're on crescent definitely make space in your day for a Boustan sandwich."}
{"text":"Best beef shawarma of my life!! The trio is about 10$ and it is a lot of food. The potatoes and garlic sauce are my favourite of any other middle eastern shawarma restaurants. The seating is a bit tight so not really good for groups. Also it gets really busy during lunch time."}
{"text":"I've heard about Boustan everywhere; on the internet, in Montreal tourism guides, friends and foodies alike. I went on a Saturday evening at 2 am and split the vegetarian plate with two of my friends. I'll start off by noting that the portions weren't large.

The line was long, and I waited for fifteen to twenty minutes. There wasn't trouble finding a place to sit. They don't do regular table wipe downs...meh.

As my friends and I looked around, we noticed all the customers were male. Hmmm.

On the vegetarian plate, you have 1 falafel ball, 2 chewy pancake things, salad, rice, potatoes, 1 pita and 3 different dips/sauces. That may sound like a lot, but it wasn't. I wish there was less salad and a little more of the good stuff (falafel!!)

I really liked the small chewy pancake things. Everything else was pretty standard."}
{"text":"SHAWARMA ER'DAY. 

No. Seriously, during the 2 years in which I lived 3 blocks away, I would stop by every other day for dinner or lunch. Since moving to NYC I've yet to find a comparable place (if you guys are reading this...please open one in NYC...pretty please?!). This will definitely be the first place I'm eating at when I head back to MTL.

I don't know what it is about this place, but it. is. so. fucking. addicting. I'm 75% sure it's the potatoes with garlic sauce. 

I would give it 5-star, but since the change in ownership in 2013 (?) the quality and service has deteriorated a bit. I miss that old guy with the mustache!"}
{"text":"Amazing place to eat. I ate here twice during my recent trip. First time I had the chicken plate. Amazing shawarma, best chicken I have had. The sides were also top notch except their famous potatoes. Their taste was good, but they were being warmed with a  microwave. The next night, late, I had the chicken pita sandwich. All the goodness of the plate, in a grill pita sandwich. Prices are good, service is fast even though there is constantly a line up. A must eat place to visit in Montreal."}
{"text":"I called for a delivery order and was told it would take an hour to arrive.. After an hour and a half, I called again to check on my order and after taking my phone number and address, the lady who answered the phone went to check and told my \"Your order already left, it'll be there in minutes\".. Half an hour later (2 hours since I ordered), I called again to check and the same lady answered the phone, then handed the phone to someone else who told me that they never received my order in the 1st place. I wouldn't have minded if my order never went through but I was obviously LIED to. Either they lied to me on my last call to cover the fact that it's taking very long, or on my call to check on my order!! They contradicted themselves"}
{"text":"Their enthusiasm and guest interaction is superb and the swarma is so good all you will be able to think about is the next time you will visit.  These folks are killin' it on the regular."}
{"text":"went here based on the other reviews.  was cautious when we first arrived as it looks a cafeteria setting.  I think basha in the eaton centre has better presentation.  anyways, it's more about the food.  i tried a bit of everything.  mixed meat combo was excellent. garlic sauce is as good as everyone says.  chicken was very tender and juicy.  loved the hot sauce here.  falafels were okay but a little salty for my tastes."}
{"text":"This place is miles better than Amir, I should just throw that review into the figurative trash can. I have a secret love for garlic sauce; and ohmygosh that stuff is not only potent, but addictive! A chicken shawarma trio is too much food for me, but I don't care, I just have to have those garlic potatoes sometimes.Next up to try is \"the creation\" sandwich...but I'm betting it will be good too. 

Oh, and it probably doesn't need to be mentioned, but the prices are less than $10 per person, so it's perfect for students and the frugal."}
{"text":"Typical for the genre - tasty food for cheap, albeit poor hygienic conditions. This downtown area is hustling and bustling around lunch time when people are out to grab a quick bite and go back to work / study. Boustan provides good bang for your buck with different combos of meat / veggie Lebanese food. I chose this spot because we were nearby and I thought my partner might enjoy their veggie plate - which she did. I got chicken shawarma wrap and sides of garlic potatoes and tabbouleh.  The entire bill was around 20$ with taxes. Everything was tasty - and I want to commend their menu pictures of every dish for being accurate.  Now for what I didn't like - the place is not very clean (floor, tables, etc.). There are no metal utensils and no real plates - you eat out of disposables with plastic utensils. I really liked seeing into the line from behind the glass when ordering - until I saw them cleaning it with a dirty rag that brushes against the food. The cashier was too occupied with her toddler to process my payment - what's the deal with bringing kids to the restaurant? Handling a kid playing on a dirty floor and then handling food... meh! In short - although not a big chain like Amir or Bashaa they pretty much serve the same food. The experience in this location was not great, and there is really nothing special to go back for unless you are right there, very hungry, and strapped for cash."}
{"text":"??????????????????????????????????sandwich?????????CNE????????plate????????????plate??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????plate????????????????????????????sandwich???????5????plate?????10?????????"}
{"text":"I got a vegetarian plate.. was reealy good.. the eggplant was nicely seasoned, same as the small pancakes and potatoes...  i rly enjoyed the garlic sauce. I tasted a piece of beef from my friend, and it was a lil bit gamy for my taste.. staff was polite and it is possible to pay via credit card"}
{"text":"I've always liked Boustan as a choice for Lebanese food but that was until I saw them microwave my food in styrofoam takeout containers. Pretty sure that's a health hazard and it kind of makes me wonder how they treat their food behind the scenes. Don't think I'll be returning until they they make a change like switching to paper containers."}
{"text":"Had lunch here today and was not disappointed! The food was hot, fresh and super tasty and the service super friendly. We had the combo plates and the house poutine with chicken and all were good sized portions. Would definitely recommend for a quick bite."}
{"text":"This place was delicious. I had the chicken sandwich and my husband the beef. Pita was toasted to perfection. Grape leaves were good as was the hummus. Ask for their sauces which bring out the fresh flavors even more. Hot sauce was earthy and balanced. Will come again."}
{"text":"In love with this place after our trip to Montreal. We had this place bookmarked and went our 2nd night in town. Shawarma sandwich with garlic potatoes. 

Garlic potatoes, one word: phenomenal! A home run for $2.25 a plate which is a steal in my opinion! So amazingly good I went back for another portion. Dining room even has a TV for everyone to enjoy their food and even at 11pm at night this place was packed."}
{"text":"Great take out and eat-in.  Some of the best Middle Eastern food we have found in Montreal.  And, they are open late so for those 2am hungers....  go here!  There will be a line!  Enjoy!"}
{"text":"Phenomenal place to dine out in the evening. Park the car late at night and stroll in. Shawarma dishes are amazing, they have sandwiches and dinners so take your pick. Garlic potatoes, one word: heaven! So good I just had to go up and get another plate! Try and you won't regret. Most enjoyable place to eat during my trip to Montreal."}
{"text":"When I'm craving Lebanese food for a quick Lunch Boustan   is the place.! I always order the chicken plate with the different salad and Hummus! Delish..it's all good!!"}
{"text":"Number of reasons why I rated a 4 star... 1) super friendly staff, 2) found is soooo good - always take the chicken pita mmm garlic - and those potatoes and garlic sauce !!!! 3) hours of operation - open until 4am Thursday, Friday, Saturday- great after an evening of drinking ;)"}
{"text":"The reviews on this restaurant made us buy it for dinner two nights ago. The man I spoke on the phone with was nice, however it was clear that my order was going to be screwed up. After picking up my food and coming back to my hotel, I noticed that they forgot to give my drink and failed to supply the bags with spoons and forks and whatnot. The food was absolutely disgusting. You could taste the \"freshness\" in each bite, it was clear they were serving food that was really old and were soon to go bad. Two days later and here I am with food poisoning because of the food here. Everyone in my family who hate the meal has gotten food poisoning. This place is absolute trash and as much as I wanted to like it, I couldn't. Doesn't even deserve the 1 star I gave it."}
{"text":"Yum! They really know how to Boust out the flavour. The garlic sauce is incredibly tasty - it's the perfect blend of cream and garlic that results in some sort of synergistic bliss, beyond what even my taste buds can comprehend. 

The plates are huge so go on an empty stomach. 

There's a small patio and indoor seating."}
{"text":"It's been almost a month since we visited Montreal, and the bf can't stop talking about how great Boustan's food is. I have to agree, Boustan was pretty damned good and CHEAP. I love good cheap eats. 

Boustan is on the lower level of a building near all the bars on Rue Crescent. Which is great for a late snack after knocking back a few. I had the beef shawarma trio and the bf had the chicken shawarma wrap. For six bucks, they give you a lot of food. The beef was delicious, tender and juicy. The flavors were amazing. Service is cafeteria style in that you line-up at the counter, put in your order and pick out your sides. The staff is friendly and there's a giant flat screen in the dining area in case you don't want to miss out on that Alouettes game.

Highly recommend checking out Boustan for some amazing, cheap eats!"}
{"text":"The Chicken trio is great value for the money and it tastes great. I usually take it spicy with extra tomatoes instead of turnips."}
{"text":"Fast, cheap, and delicious.  After walking around all day I was looking for a quick bite and, inspired by the great reviews, I decided to give it a go.  The chicken wrap was very tasty, but the garlic potatoes really made the meal."}
{"text":"They up their price and I hate to say that but price really does make a difference. If you are gonna up the price I hope the food standards is worth $1 than what it use to be! Still overall good."}
{"text":"Likely the best chicken shawarma in Montreal. Although Boustans was recently sold to a new owner, the quality and portion sizes really haven't changed. I always order Boustan delivery when I'm visiting Montreal, but they offer free delivery which is really nice. Both the chicken and beef shawarma are excellent here, and you can pay a little bit extra and get a \"combo plate\" that contains both. I highly recommend trying Boustans, and the location on Crescent is open really late so you can even grab some after a night on the town."}
{"text":"Great spot for a late-night bite to eat in downtown Montreal! The food was cheap and very tasty - can't go wrong with a $5 sharwarma wrap ($8 for the trio, which comes with a wrap, drink and garlic potatoes). Ask for lettuce in the wrap, otherwise they just fill it with coleslaw."}
{"text":"Good, cheap, pretty average but yummy middle eastern.  I like that they deliver and are friendly.  I don't like that they microwave your food while in the styrofoam container, just weird and what does that release into the food?

I will probably eat here again."}
{"text":"This place is superb. $12 after tax for a chicken+beef shawarma combo plate to go with meat, veg, hummus, fragrant rice, potatoes. HUGE and delicious. I eat a lot, I'd just been exercising so was extra hungry, still couldn't finish. Amazing value, excellent food, superior service, slightly-sketchy looking dive to add just the right amount of street-cred legitimacy, PERFECT. Will be back.

Personal note: found the beef nicer (juicier) than the chicken. I know everybody loves chicken shawarma, and there was nothing wrong with it, but the beef was a treat."}
{"text":"I love Boustan!

The food is great, the guys are very friendly and nice to talk with, it's pretty cheap, and they deliver!"}
{"text":"Good Good Good! Eat here for tasty food! Garlic spread with potatoes was delicious BUT believe it is mayo with garlic in it. But so so good together. The only negative would be that there is no fresh fruits or vegetables (meat, rice and potatoes are the majority of the food here). IT WAS TASTY AND RECOMMEND!"}
{"text":"Hello fellow Yelpers! My very first review of 2017 goes to *Drum roll . . . BOUSTAN!!!!!!!!!!! A Lebanese restaurant that I learned about through an old co-worker who once ordered me their chicken shawarma pita! Although very hit or miss, I remained a loyal customer since I've learned of them last summer.

To be VERY specific, I've never ONCE been disappointed with their Crescent location. In addition to the food, the lady who works there is very friendly and made it a point to remember my face and my VERY specific order. A spicy chicken shawarma pita, no turnip, little lettuce :).

My last experience however (with their Saint-Catherine's location) which is their only location that delivers, ended my time as one of their customer. I ordered a kafta plate and a beef kabob plate and because of a previous experience of having my meat over cooked, asked to have it cooked 'medium' which I've asked before. Well this time, not only was my meat over-cooked it was charred!

Well like I said, despite my loyalty as I said before they were hit or miss, so in the past I've called back and let them know I wasn't happy with my order and received a replacement or credit. Well this time, not sure if the guy (I'm normally assisted by a woman) was having a shitty day, but as I nicely explained my disappointment with my order, the person on the other end instantly got aggravated! Telling me \"if I ordered medium, that is exactly what I got\" , I then patiently advised him that my meat was indeed over cooked and I could wait for a driver to come pick he up so that they could see for himself.

He ignored my comment and asked \"what do you want me to do, we sent the food already, not much more we can do for you.\" I repeated my previous comment and he responded by saying \"No I will not do that!\" I replied by telling him that I was a loyal customer and if ever disappointed in the past it was always resolved. His response to that was \" I have other calls to take!\" I told him I will never order from Boustan again and his response was \"Oh well!\" And hung up on me.

The food at an establishment cannot always be perfect, but great customer service can always compensate for that. This person was not only unprofessional with his responses, but unwilling to assist me with a simple solution in order to keep a loyal customer. I will never give this place my business again. Pictures to follow. You determine how it was cooked. 

Today's review gets 1 star only because I had to select something."}
{"text":"Took a sec to find as it is down a few steps in a row of cafes and restaurants. The menu was entirely in French and busy enough that I was overwhelmed for a sec, good thing Chicken Pita is almost a universal phrase. This comes in a thin pita that's more like a rough wrap and is accompanied by some cabbage, pickled something red, maybe beets and a light garlic type of white sauce. It was thin enough to manage but more than enough and left a nice drizzle of grease running down my arm, always a sign of a finger lickin good gyro. Thanks Yelp for pointing me in the direction of Boustan, Montreal.......PS I wound up eating a second one a few hours later....always a sign of an amazing pita."}
{"text":"Restaurant rapide et pas cher voilà à ce que je m'attend lorsque je vais chez Boustan, je prend deux mixte comme à chaque fois et ma fin de soirée Est parfaite, je recommande cette place"}
{"text":"This is probably the best Lebanese fast food I've ever had in Canada! So much flavour and delight to my palate  it was my first time here and the man who served me was so nice and friendly. He also let me try the garlic potatoes with sauce as well as their egg speciality which were delicious. 

I also ordered the falafel wrap with spicy sauce with it and it was to die for!!! Love these guys' foods and you definitely get the value of your money. It costs me $6.04 with taxes and of course tips on the side which is different but a sumptuous falafel wrap which feels great to the tummy is to be found only here in Montreal... I would definitely return to try their other plates on the menus as they all looked delicious and flavourful. The place itself is very nice to have a seat and watch some tv while you're enjoying your food. The decor is very simply but different. Overall, I was impressed from coming to eat here for the first time till I left as they are the best and so nice in serving their foods! 

:)"}
{"text":"Im from New York, one of the world capitals of gyro carts. It saddens me to admit that for about the same price, this Canadian restaurant has all of my favorite chicken rice places beat in terms of both quantity and quality! Each piece of meat is unique and gushes with flavor: the creamy chicken and succulent beef sing together in harmonious melody as the soft chorus of hummus, potato and rice soothes your taste buds. Extremely fast service too!"}
{"text":"Never had shawarma before but stopped in after a few drinks and it was amazing!!!! Since stopping in we tried it from another place that wasn't as good. Stop here if you are looking for a great late night fix."}
{"text":"Best chicken pita in the west island. So happy they opened one here. Never going back to Amir. It doesn't even compare to Boustan."}
{"text":"This place used to be a lot better but it's still one of the best Shwarma places in the city. The potatoes are a must add-on."}
{"text":"Pretty mediocre middle eastern fare. Portions are good and food is decent. If you've ever been to the Halal Guys in NYC just know that this does not match up at all. 
If you do order though, stick with the shawarma plates and stay away from the falafel."}
{"text":"I am not from Montreal and dropped by Boustan for a quick lunch
-got the Beef and Chicken Shawarma combo for $10.45 CAD
-good value
-food is fresh and good but nothing special in my opinion. The key advantage they have is its price and freshness (given the high volumes)
-if you are in the area and want a cheap good lunch, go to Boustan. However, I would not specifically travel here for a meal"}
{"text":"ANYTHING LESS THAN FIVE STARS IS RACIST. THERE'S NO OTHER REASON, THAN A PREDISPOSED PREJUDICE AGAINST THE LEBANESE TO GIVE ANYTHING LESS.

Listen, I'm a reasonable person. If we're talking the afternoon crew - aight, it's not the elite servers. But anyone eating boustan before 10pm, is not eating boustan.

3AM THE BAR HAS KICKED YOU OUT: You're met face to face with the dead eyes of a man who has no patience to deal with your last call drunk ass, but he continues to serve. Vision begins to blur and the mind searches for an idea on how to get home - suddenly you're handed a brown bag and after that... there's no words to describe. Only stars, five of them."}
{"text":"I was craving me some meat and I guess my expectations were higher at that point. 

My decision ended to go to Boustan, but I was disappointed to see them re-heating the rice in the microwave after I ordered a dish of beef shawarma to-go. It wasn't warm enough though - some part were still \"cold\". That was pretty much the biggest down point in my opinion. 

Other than that, for a quick meal, I think it is a good place to go. The service is quick despite the lineup. 

I reheated again at home, and I actually better enjoyed the food."}
{"text":"When you're in need of some quality fast Labenese food, come to Boustan. This place is open till 4am and offers free delivery, so it's never too far away.

The great thing about this place relative to the others is that the pita sandwiches get grilled; this makes all the difference in the world! Also, there are a couple off menu items that are great such as the creation and crazy juice...try both!"}
{"text":"I usually love Boustan. I've eaten at the Crescent location many times, as well as the newer location near the Metropolis. Their food has always been on point. 

However on Saturday night, we ordered delivery at my friend's place in NDG (3 pitas - 2 chicken, 1 falafel and 3x garlic potatoes). IT TOOK 1.5 HOURS TO ARRIVE and if only that was the only problem! 

The food was disgusting. Stale bread, GREY chicken and even their garlic potatoes weren't that great (HOW?!) 

I was so hungry that I ate most of my meal... and started to feel sick. Long story short, I threw up everything I ate. The 2 others with me also hated the food and said it was very dry and stale. 

Shame on you Boustan NDG, we are really let down and will obviously never eat there again!"}
{"text":"I was on vacation, and this place is awesome. The food was so yummy please open up in New York"}
{"text":"Admirable consistency in the food, usually the place is busy but mostly I got served on time. Creation sandwich is my favourite though Pitas are awesome too. Sometimes I've found pita breads cold otherwise nothing can beat Boustan."}
{"text":"Very disappointing experience at one of my all time favourite restaurants. Just married and returned to Montreal for the holidays with my husband. After a couple of pints at Hurley's I was excited for my new hubby to have the full Montreal experience and end the night with Boustan sandwiches. We visited around 8:30pm when it was quiet. Ordered our food and while watching it being prepped and other people served, I noticed that the cashier put the wrong sandwich in the bag. I questioned him as to what we had ordered and he was very flippant and short with me; tearing the receipt from the register and pounding it with his finger. I was totally put off. We took the bag and left. As we were leaving I could hear him talking about me back at the counter - yah, the white girl speaks Arabic. 

Lo and behold we were indeed given the wrong order. 

Very disappointing to be treated like this and embarrassing to have it happen after I gushed on about how great a place Boustan is. I've always been a fan and even filmed an episode for the Travel Network there several years ago. 

I won't be back."}
{"text":"Amazing food for the price. Honestly, I took a full pita with chicken and I was absolute in love. 
For a food after work or when I'm little hungry, I will definitely go there. 
Service is quick and as the price (no need to intend something else than a sandwich )"}
{"text":"Terrible food and service. I went to eat there and the person serving me took chicken and meat already cooked from a plate and heated it in the microwave. When I asked him how come it's not from the rotating stick he answered that's how it is!!! I tried to eat but it was not edible, when I told the person(who was the owner) how the meat tasted, he sais that if im not happy and I dont have to come back, and that's exactly what I will do. Reheated chicken and food from a day before... I just hope I wont get sick..."}
{"text":"Nice big portions with their plates. I take the chicken plate comes with coleslaw salad ,shredded chicken, pita, rice, garlic sauce, vegetables,potatoes. Lots of flavors and taste just writing about it makes me want to go back or grab my leftovers in my fridge. There`s a little bit of a wait in a line every time I go but it moves quite fast and so many people enjoy eating here that its on a lot of peoples list of choices for a quick yummy lunch. Pita is a absolute must! They grill it so it gets that nice crispy texture"}
{"text":"The food is good, although the quality seems to vary greatly. Sometimes we get platters that are lukewarm, and it's just unappetizing to see them nuke it in front of you. Similarly, the sandwiches have been oddly filled, with the first bite being only garlic mayo and lettuce, and all the meat stuffed at the bottom. Ends up falling apart and the first bite is a... surprise.
Also, some of the dudes are overly flirtatious, to the point of me not being comfortable going there by myself anymore. There's nothing overtly disrespectful, but as someone with anxiety, I dont want to be subjected to that when I just want to get some quick food."}
{"text":"How do you rectify a situation that's obviously a mistake? I'm hoping my fellow Americans can find the answer to that on November 8.

I should have read up on it, but didn't. Comfortable with my knowledge of Middle Eastern cuisines and having faith in Montreal's amazing history of multiculturalism, I didn't sweat the details. I only looked briefly in the direction of the orange colored dish with Shish Taouk written as the descriptor. Had I paid enough attention, I would have realized that it's Chicken Shawarma, not Shish Taouk. I have no idea why Montrealers have allowed this error to persist: Chicken Shawarma is definitely not the same as Shish Taouk. Why do people confuse the two candidates for selection as the same? Facts matter ;)

In this case, thankfully, the stakes weren't high. The trio set me back by a mere 8CAD. And, while I didn't think much of the chicken pita, the garlic potatoes were outstanding. Highly recommended. Also, I thought the Baklava had great texture, even if it tasted average.

Boustan is smack dab in the middle of tourist central, the prices are fantastic for the location, and it's a great value if you're in the area. But, it's just not destination dining. It's disappointing to see this as the first name come up in a search for Shish Taouk in Montreal. I realize now that \"they\" meant Shawarma, but just didn't know any better..."}
{"text":"Absolute best food for the buck in Montreal, if you haven't tried Boustan yet then waddle on over there and give it a try...you will not be disappointed."}
{"text":"The sandwiches are freshly made. Pretty tasty 
Usually served warm. Very good option for a quick sandwich run between meetings or shifts"}
{"text":"Friendly service, delivery is quick too. The best Lebanese around. I always have the kafta arayes and it is so well seasoned. Their harissa is the best I have ever had."}
{"text":"Ordered Boustan's three times during my week-long visit to Montreal and I can't say anything but good things about this restaurant. First and foremost, they DELIVER - and quickly too! I ordered the chicken schwarma plate all three times. The chicken is nice and tender and the hummus is to die for! I'm from California and I'd much rather have Boustan's late-night than an order of carne asada fries (and that's saying something!)"}
{"text":"Excellent.  Food was great.  Staff was SO helpful.  Came in with my kids around 10PM and they were so patient with their orders, which took some time with the unfamiliar food.  Also, my daughter has a gluten allergy and they were very accommodating.  Lots of great choices too.  We ate outside and the people watching was very entertaining.  The outdoor area is up against the line for the club next door.  Lots of 20 somethings all decked out for the scene."}
{"text":"I dream about the beef shawarma pita. I visited my sister for a long weekend in Montreal, and Boustan was our first stop. Believe me, I understand why. The food is affordable, it's delicious. The perfect combination of greasy, warm, salty, saucy. Unbelievable. 

I think a beeline for Boustan has become my new Montreal tradition."}
{"text":"Found this place through Yelp and was not disappointed. Had the beef platter and everything was excellent.  In my short trip in Montreal I tried 2 other fast food Lebanese places and this one was definitely the best.  (Comes with hummus, pickled/shredded cucumber, other pickled veggies, rice, meat, and a piece of pita)  The best part of the entire experience was conversing with Mr. Boustan about Montreal and hearing him drop knowledge on some McGill students about the merits of keeping up with class in the short term so they can go out/party/relax on the night before the exam.  Apparently he did this when he was in engineering school."}
{"text":"The food was amazing!  Kafta Kabob plate was to die for.  Meat was delicious, salad was great.  Nice garlic flavors.  Hummus was a little bland, but overall an amazing experience. I would definitely come here again and again."}
{"text":"Wow! This place was recommended to us by a bartender as we were closing out the bar and it was spot on! It's a bit of a whole but no worse than some of the indi/paki taxi spots back in NYC. Food for the price was incredible! Very fresh, very tasty! Might be our regular go to for late night eats while we are here in Montreal!"}
{"text":"Don't understand the hype, not worth the wait, not even a remotely good shawarma.



Had much better in Ottawa."}
{"text":"I rarely give 5 stars but I seriously love Boustan. In fact, it should be a religion. Their food is just heavenly and I drool just thinking about their potatoes. Their delivery takes a while but they do tell you how long (usually 45 mins - 1h) over the phone and I'm convinced they give you more food when you order at the store.
Honestly a rite of passage if you ever live/visit/stay in Montreal. Even Pierre Elliot Trudeau (former Canadian PM) was a huge fan."}
{"text":"I ordered delivery as I normally do from Boustan since it's one of the few restaurants in Montréal that actually does a decent and not overpriced delivery service. Also, the actual location is not that impressive ambience-wise, and I'm admittedly a bit too lazy to travel almost 1.5 miles by foot just for something that I'm so used to eating during late-night study sessions. 

I got a chicken brochette platter with a Pepsi as it's been proven to be quite a solid option in the past. The chicken was flavorful and seasoned as usual, and it goes really well with the hummus and vegetables when you eat them all together with the pita. I've always liked the pickled turnips that they put in the vegetable mix, as it has a tart flavor and adds color to everything. The garlic potatoes are always savory and provides a nice contrast between creaminess and the crispiness of the potato skin. Also, I'm not sure what they put in the rice, but it tastes really good and filling nonetheless!

If you live within the area in which Boustan delivers, order it next time you have the late-night drunk munchies or are too stressed to cook - it's worth the price you pay and they give you a lot of food! It may get repetitive if you eat it too often, but somehow the cravings for it still manage to come back, so eat it sparingly."}
{"text":"This was our first time trying Lebanese food. Everything is as delicous as it looks in the pictures and a great value as well. I would definitely recommend trying one of the shawarma platters."}
{"text":"Tried out their shawarma combo and it was great. They have an excellent mix of sauce, pickled veggies meat and carbs on their plates. Just what you need for a late night out."}
{"text":"My love for Lebanese food is pathological because I live for potatoes and garlic. Very sexy.... I know. 
I could eat it everyday soooooo when I heard 
Boustan was opening in Laval, I knew that sometimes good things happens to good people. 
I almost went to every Boustan out there, obviously the crescent location was my favorite. 
When I first tried it in Laval, I realized somebody messed up the potatoes recipe and I wasn't an happy camper. It wasn't bad just not great.
I think the owner was there and he asked for our honest opinion. We told him that there was something different. I waited to make this review because I wanted to give them a chance. 
I can now say loudly and proudly that we do have a great Boustan in Laval. 9 /10 of the time the potatoes send the same endorphin rush to my brain and I remember why Boustan is the best ! I recommend the potatoes, duh! 
I often order the chicken or beef shawarmas or a chicken plate."}
{"text":"Horribly burnt shwarma(really bad) very salty and dry, plain cold potatoes one had the texture of play doh, no salad (vinegarless coleslaw instead),hard pita. I am not even a picky eater. wow THE worst i have had in a very long time will never recommend or eat there again."}
{"text":"Late night cravings hit?  Do yourself a favour and come here.  Got this tip from one of the bartenders who said most late night staff in the area hit this place up.

Had the pita wrap (one chicken and one mixed).  Even late at night the meat was tender (not rock hard leftover late night meat you tend to get).  The tang of the pickled veggies and the sauce counterbalance the meat.

It gets busy at night but you can just pick up your food and go.  There are tvs here if you want to eat/rest after a late night of partying (for me late nights are like 11pm...LOL)"}
{"text":"Tasty food. Nice outside area. A little too much vine pickled salad stuff. Natural would be a better fit. 
Montreal has just too much of this pickled add ons,  fresh veggies would be way better & would rise the quality of the food. 
Overall i liked it.
The tables outside could be whipped more often tho:)"}
{"text":"Their chicken shawarma is amazing. As for their beef shawarma, if it's cooking on high flame, I always get it with tahini sauce on top. Otherwise, I wouldn't risk it. Not too crazy about them warming up food in the microwave (especially with styrofoam plates) but food is beyond par compared to other shish taouks in the city."}
{"text":"I'm so happy Boustan opened up a franchise in Laval. I have long hoped and craved to get a better Middle Eastern/Lebanese fast food option in the area that tastes like restaurant quality food.

The establishment just opened last week and it is HUGE! It's also gorgeous with great seating. They also sell hats and shirts.... any way to sell their brand to their loyal patrons. Their work on social media as well has been on-point as well.

This location also holds a cafe and I believe they may sell Heavenly Taste Cookies... if that's true I may find myself here more often than not! LOL. However, the cafe isn't opened yet but that should be rectified in a few weeks time.

I went with their shwarma chicken plate with side potatoes and coleslaw. Portion is generous and when I asked for more garlic so that I can smell the food on me 2 days later, they provided me with a very generous serving of garlic dip! All for a price tag that was under $11. Very affordable. The food line went very quickly and the staffing was very good at what they do.

Quality of the chicken was sooooo good. The right amount of tender and crispy! The potatoes were done just right and the coleslaw was a nice compliment to the meal. Go figure. The garlic sauce though.... WOW.... what can I say... it was simply SOOOO good.

5 stars, 5 stars, 5 stars.

I might be coming here on a weekly basis, I'm not exaggerating, watch me, Duke Spaceman will hold this place dear. What an awesome addition to Laval."}
{"text":"I live for Boustan's shawarma on st catherine and crescent, its the best shawarma EVER and I almost fainted when they opened 2 minutes away from home but I came out so disappointed after giving them many chances; I ordered chicken sandwich first time and they just put chicken thats been sitting in a metal bowl for ages, you know the dry one- it was so bad.. I got the combo once and meat was dry. I got the regular chicken plate the last time and I got food poisoning? I was in bed for 3 days in a row no.joke. 

Their service is so rushed even when theres no line up and they put everything in the plate without asking you before what you want in it like the other boustans do and their not generous with the chicken portions. 

I am not putting my feet there ever again after getting sick."}
{"text":"Belle petite découverte hier soir. Le genre d'endroit où tu hésites à entrer parce que ça fait dur à l'extérieur, que t'es toujours pas sûr de vouloir y manger une fois entré, mais qu'un coup que tu as du manger dans ta bouche après avoir payé si peu cher et que t'as de la bave qui coule sur le menton tellement c'est bon, tu en redemandes. 

Visiblement, beaucoup de gens ont compris ça avant moi: c'est bondé d'humains affamés.

Patates et sauce à l'ail / hummus: ramenez-en, on en veut plus même si on a déjà le belly plein. Les falafels: même combat.

Tout le reste aussi, on dirait. À un prix dérisoire, je le rappelle. Et le staff est vraiment l'fun. Le décor, pas particulièrement charmant, mais ça fait rire, t'sais, on n'est pas au Ritz et c'est pas ça qu'on veut non plus.

La seule chose qui me fait mal au cur, c'est que tout est jetable. Ustensiles de plastique en petits sachets, emballage pour chaque shish taouk, drinks en bouteilles. Si on s'attardait à la bouffe seulement, ce serait un 5/5!"}
{"text":"Did the one in NDG. Now it's just another crappy shawarma place. Stuff was tough and cold, lacking care and flavour. Maybe the OG one  on Crescent still has game, but I'd probably say that now that they've expanded into a chain format, it's just more of the same fast food Lebanese crap you see everywhere."}
{"text":"Ordered the chicken and beef shawarma plates. The beef was really flavorful while the chicken had less flavor which was okay because the rest of the dish had plenty. Went on a weekday for dinner. The line wasn't too long and got our food quickly. They take credit card."}
{"text":"Got a grilled falafel pita which I was excited about because it was grilled and in a burrito form. The falafel and all the seasonings made the entire thing delicious. I wanted ten more after I was done but was too full to eat any more. The pita is very filling."}
{"text":"So we arrived in Montreal late night and this was recommended as a cheap, good place downtown by yelp. I guess I get why it's popular - it's near all the bars and clubs, is open late, fast, cheap and huge-portioned. I got the chicken schwarma plate and my wife the beef. The beef was extremely dry and salty. The chicken was a bit better but salty as well. The potatoes were also very salty. I guess Montreal folks love salt. A friend's kofta/kefta was definitely better but I kept thinking to myself, any street meat in NYC is better than this - sad.
The bread was a sad excuse of a pita and that weird tangy, mayo-y sauce was just....weird. The 2 different types of rice had minimal flavor and were dry. The best part of the plate was the hummus.
I guess this food can be good if you're wasted and starving but otherwise, I'm hoping Montreal has significantly better culinary options to offer than this."}
{"text":"Amazing!! Everything written about this place is true!! You can't really sit n eat here but perfect to pick up for a quick lunch! Really tasty as well."}
{"text":"It was a cheap and plenty of food. The place seemed like a family run restaurant. It was bustling with customers and the food was amazing. The reason it's 4 star instead of 5 is because the servers weren't wearing gloves while preparing the pita/food. Otherwise it's a great place and a must eat if you around the vicinity."}
{"text":"Clearly a love or hate type thing.. I won't write out a long essay because the place already has 65 reviews for you to base your opinion on..  But personally, it is my absolute go-to place after drinking all night on Crescent street.  The place looks like a dump but when you see all the celebrity pictures on the wall, it goes to show you that looks aren't everything.  Absolutely delicious all-white-meat chicken shawarma that is filled with their signature coleslaw topping, and the pita is cooked on an actual open charcoal grill which gives it an amazing crisp edge and awesome flavor.  Nothing even CLOSE to as good in all of Ontario. 

5/5 hands down, and it's well deserved.  Cheap, open all night, and tasty.  What more can you ask for?

They even deliver at 4am if you're at your hotel room and have the munchies"}
{"text":"The pita wrap here was unreal!!!! 
TIP: Try the creation wrap!!! 
The sauce is magical, and the pickled vegetables adds a perfect tangyness and sourness that complements it extremely well. To top it all off, the pita is toasted to perfection, just the right amount of crispness.  I tried the spicy version; it could definitely use a tad more heat (but then again, that's personal preference). 

My friend tried the chicken wrap. Portion wise,  the creation wrap was noticeably bigger. 

Check it out, order a creation wrap, you won't be disappointed."}
{"text":"The creation is simply amazing, service was slow due to the fact that there was so many people and that they just opened. Highly recommended!"}
{"text":"First, we were very grateful that this restaurant was open on Christmas Day evening. We got various pitas and plates. Food was solid and service was fine and we were not rushed. Chicken/Beef Pita was ~$5.50 CAD and platters ~$10 CAD. Large portions, clean restaurant"}
{"text":"The husband took me to Boustan when I was as he would put it 'fresh off the boat'. 
This was my first shawarma in Montreal after living in Dubai all my life. Yes, I thought more than two vegetables in a shawerma was sacrilege. 
Over time I have grown to like Boustan quite a bit, their food is far from authentic but they have found a middle ground delicious recipe that really works for them (try getting home delivery past 12am- it's impossible) 
The staff are always in a good mood and it's such a delight going to this little food joint. 
I would recommend everyone to try their garlic potato at least once (more if you want clogged arteries) 

This is not entirely authentic but nonetheless an amazing place for a midnight snack. Ambience is terrible though, take away would be a good option."}
{"text":"Boustan is as popular as the reviews say. For a quick taste of Lebanese food Boustan did the job. I ordered a vegetarian plate and my boyfriend ordered the beef shawarma plate. Both options came with a bunch of food as well as piece of pita. By the end of our meals we were more than full. The restaurant is small compared to the flood of customers. Seating is hard to find during peak times and during our visit we shared a table with a woman. Overall quick, inexpensive, and delicious."}
{"text":"We ordered the shawarma plate & a sandwich here during lunch hour for around $13. The food was so-so considering there are a lot of middle-eastern options around the city. The lady at the counter was a pusher - quick to tell you what you \"should\" order. We also found the ambience a bit dingy for our taste."}
{"text":"Boustan is definitely a must go Montreal staple! Second to Abu Elias, Boustan is my favourite lebanese spot! But if you go around 2am, expect a really long lineup. 
Their falafel is the best and, even though they changed owners a short while back, I'm happy to see they've been able to keep up the quality."}
{"text":"One of the low key dope spots to eat at. Hole in the wall- quick service and amazing quantity. It was surprising how quickly the restaurant filled up within minutes."}
{"text":"I ordered two creations and two chicken pitas by phone call, I picked up 5 mins after. When I got home I only see two pitas. Boustan, seriously ???! Worst experience ever! I paid for 4 pitas and only got"}
{"text":"Great place for a nice kicking Mediterranean meal - to go for the most part as this place gets jam packed after a certain hour in the evening. Pita rolls and Shawarma dinner plates are their specialty. At least that's what I tried given the 2 were the featured items on their not so big a menu. And both of these totally delivered.

Late in the night on Rue St Catherine, every restaurant is pretty jam packed. Especially if they serve alcohol or have a BYOB policy. We accidentally stumbled upon this place while trying to get a bite after one of the concerts at the Jazz festival. This place was packed too. But a quick peek and we knew at least we could do a take out.

So went for a kebab pita roll, a mixed meat pita roll and a mixed meat Shawarma plate. Yes, we were starving! Everything was fresh and being fixed right in front of us. They have an open kitchen where you can see the veggie bar and the meat skewered grill from where all the meat was being cut fresh and topped on to the dinner plate or the pita wrap.

They ask you for heat level preference and also what you opt your pita role or your dinner plate to be loaded with. \"Fully Dressed\" - gets you everything, with no extra charge. Fully dressed it was for us. And it was yummy! The special hot sauce will add that extra kick to your meal. Go for it. It is so worth it. It's not flaming hot, but it is good.

They open only in the evening around 5pm because we had walked past this place in the afternoon and it was closed. I believe they are open till late - around 3am. Definitely a good post drinking food to avoid a massive hangover. Meets all the requirements of a great Shawarma place. Fresh veggies. Meat being chopped in front of you. Hot sauce to boot. No hangover in the morning. What more can a man ask for after a wild night out in town? 5 stars!!"}
{"text":"Man, what a place to eat at...especially after drinking most of the night!  Don't judge the place based on the looks.  This place actually has some very good...it surprised me very much.  All I can say, just check them out!  :)"}
{"text":"(19 Rue Ste Catherine E location) The food is beyond amazing! Boustan is always my go-to place when I don't want to cook. Once, I accidentally put in an order in between my exams, and had to leave when they showed up. I called after coming back from my exam and the person was very nice about it. She sent the order out again without sounding irritated. I insisted that they charge me twice but she said it was okay. Awesome service and amazing food."}
{"text":"The food is beyond amazing! Boustan is always my go-to place when I don't want to cook. Once, I accidentally put in an order in between my exams, and had to leave when they showed up. I called after coming back from my exam and the person was very nice about it. She sent the order out again without sounding irritated. I insisted that they charge me double but she said it was okay. Awesome service and amazing food."}
{"text":"My friend felt it was the best Middle Eastern they've ever had - and I'm inclined to agree.  For you Vancouverites, this joint is better than Cafe Babylon of old in my estimation - yup, it's that good.

We stumbled into this joint randomly for some pre-drink eats before continuing our trek down Crescent.  Yelp said it was good - and Yelp was right.  This place is *insanely* busy - for good reason.  After a long line-up and fighting with their non-stop ringing delivery phone, we finally got our orders in.

My friend really liked her vegetarian plate and the chicken shawarma sandwich I had was insanely good.  Juicy chicken, fresh veggies and pita was a good amount of char which gave it a nice crunch.  Yes, it's greasy... but good greasy.  I was sitting there wondering, \"Wow - how good would this taste if I drunk?\"

... well... I found out a few hours later because we decided we want more Boustan after drinking far too much with the kiddies on Crescent.  Sober - this place is damned good.  Drunk - this place is \"fuuuugin' ammmazzzzing\".  And we were not the only fans - people were asking if they could take pictures with the man behind the mystical food, Mr. Boustan.  Being drunk, we got in on the action as well.  Funny dude - as he handed our food order over, he commented that he liked my friend but not me.  This was a bit of a shock for me -- I thought I was the 'cute' one.  Oh well.

Despite being drunk, I actually had the presence of mind to grab a take out menu before leaving.  Skip forward to the next night - after stumbling back to the hotel after failing to find anything appetizing on the walk back from the bar.  I find a Boustan menu on the desk and I think to myself, \"Drunken Johnson - you magnificent sexy beast - you are a genius!\"  Seriously, I'm so good that I scare myself sometimes.

These guys deliver until 4AM.  I repeat... 4AM!  For free!  If they only delivered to Vancouver... hmmm...."}
{"text":"Disappointed. Had the chicken and beef brochette platter. Both were extremely dry and the beef in particular was tasteless."}
{"text":"LOVE the shawarma here. Food is great. Lunch times are always busy - but the line moves fast enough that you can't get too upset. 

Great for on the go lunches when you need to get back to the office."}
{"text":"Loooove this place! Hands down the best shish taouk sandwiches out there.. Only problem is the long line ups during peak times but still so definitely worth it!"}
{"text":"Well, I usually don't write reviews on Yelp but the customer service at this place is extremely horrible. 

So to begin, it was a Saturday night and I understand it was busy and all but that is no excuse to tell your costumers to each have only one order each ( my bf wanted to order one pita sandwich for himself and one plate for my two kiddos). Once the guy finished my bf's sandwich he quickly switched to ask what was my cousin's order who was next in line yet he didn't even give us the chance to say \"hey we would also like a plate of beef sharwarma\". He only listened to us after serving 2 other customers. What really sucks is that when he asks you want you want in your sandwich and if you take more than 5 seconds to think he shoves all dressed in your sandwich. To make thing even worse, he complained to us that we were hogging the line and making it longer, but excuse me, when your line usually goes up to the front door, do not tell me we're the cause of that long line cuz that's a huge ass lie. As well, there's legit no communication between the sandwich maker guy and the cashier. We all piled up at the cashier because 1. We didn't see our orders and the cashier already wanted me to pay. 2. Everyone was frustrated so I had to pay for all 3 transactions ( my bf's order, my cousin's and my best friend's) because they surely wanted us to be out and about. 

So in the end, if I was able to give this restaurant 0 stars I would give it just that. Customer service is atrocious. Not to mention how dirty the eating area was (potatoes on the floor, pieces of beef and chicken on the table) and imagine the washroom. Just horrible."}
{"text":"I'm not a big fan of other ones but this one is great ! Showed up at 11:45 pm on a Monday night and they were still up to serve me with a smile ! Food looks great and owners was friendly ! I'm always reluctant to order food past 8 pm at a restaurant because it increases your chances of getting food poisoning but this looks pretty fresh ! Will update on my review if I get sick, if not , everything is two thumbs up!"}
{"text":"The falafel I had there was not fresh at all and the falafel balls were still cold in the centre when served to me. 
The garlic potatoes were quite mushy but tasted good. I prefer mine crispier. 
Overall the in ingredients are not fresh and the service is adequate. 
I have yet to find a place to get my authentic fresh falafel sandwich I used to get at Aldaya (used to be on crescent) before it closed."}
{"text":"I've eaten many lebanese \"fast food\"/shawarma places, which include Basha, the halal guys, Amir, Sarab, and more. However boustan by far nails everything from quantity, price, and massive amounts of flavor. Must buy!"}
{"text":"We were in the area and starving midday so we popped in for lunch. We grabbed 2 vegetarian plates and sat in the big open window watching the constant and amazing parade of people on St Catherine's. 

The veggie plate is heaping with healthy and delicious food, though it was a mix of temperatures and some was a little stale tasting. 

The garlic potatoes, rice, and eggplant were all as awesome as ever. Hot and savoury and soooo good. The falafel and fritters slightly less so. 

This is a solid, family run fast food spot. Feels a bit like a mall, but sometimes when you crave it there's nothing better in the world."}
{"text":"Chicken shwarma sandwich yes. I could have it every day of the week. Lunch dinner.. I love how they grill the pita and it gets crispy."}
{"text":"Je ne suis pas une adepte de la nourriture libanaise, mais le restaurant Boustan m'a plutôt convaincu. J'ai pris un Shawarma au poulet et c'était franchement très bon, la viande pas sèche du tout, avec une petite sauce qui dégouline un peu partout, et le choux frais et bien croquant, je n'ai qu'une chose à dire: Miaaamm ! Le service est rapide, je m'y suis rendue lors du grand prix de Formule 1 donc du monde y en avait, mais ils savent gérer le coup de feu, on n'a pas attendu longtemps! 
Le prix, plus que raisonnable: 4,50 $ et j'ai jeté un petit coup d'oeil aux autres plats, et ça m'avait l'air tout aussi raisonnable. 

Vu de l'extérieur, on pourrait hésiter à y rentrer, étant donné que c'est en sous-sol (contre-bas), personnellement, je suis toujours un peu réticente pour ce genre d'endroit, mais si tel est également votre cas, n'hésitez pas à y entrer, vous y ferez une belle découverte.  

Alors, à la recherche d'un endroit pour manger sur le pouce, avec un bon rapport qualité-prix, essayez le Restaurant Boustan !"}
{"text":"This place is literally a hole in the wall!! If your not paying attention you can easily miss this place. It does need to be updated  appearance wise, but the food is great and simple. The staff are very friendly and they were very patient with me as I figured out what I wanted to eat."}
{"text":"Woohoo! Was in the area and was lucky enough to get a wrap on the go. I love Boustans but don't find myself downtown anymore to be able to enjoy it. With the only good late night eatery in NDG shut down (RIP DADs Bagel), I'm elated that Boustans has opened its doors to us for late night eats on Fridays & Saturdays (4am) - 11pm closing time other nights. The quality was just as good as downtown if not better, I have no doubt they'll grow the NDG clientele and serve us for years to come."}
{"text":"Boustan has never let me down. Every time I have friends visiting Montreal I take them for a chicken shawarma trio at Boustan and they are always blown away! The coleslaw they put in the shawarma is tangy and crunchy, and the toppings are always fresh. I don't know what their secret is for the garlic sauce but it is delicious! The potatoes are tasty, though they are usually just re-heated in the microwave before being served. My favourite for after a long night out on Crescent street.
The best: chicken shawarma trio (with potatoes and a drink)"}
{"text":"Can not recommend enough. It's the only place that has quality food that's open whenever I need it, and the delivery is soooo convenient. So far, best schwarma I've seen in Montreal. Me and my friends are regulars here."}
{"text":"Ordered the combo plate, very good! The meat was very seasoned. 
However, no potatoes included"}
{"text":"This is the best I've had so far. I got the végéterienne plat, and it's great. The bevvgies are fresh. I particularly like the egg plant. Delicious! I highly recommend it."}
{"text":"This was by chance my first restaurant in Montréal. This did not let me down. We got the Shawarma Combo. This includes potatoes, both rice, hummus, steak, chicken, slaw, and turnips. Everything was good on its own. But together man. We couldn't have made a better chance. My wife and I shared this plate and good thing we did. We was full and could imagine each all of this on our own. Must stop by if you in the area and need something good cheap and quick."}
{"text":"Free Delivery til 4 am!?!?!??! And quality food?!?!?! This place is a godsend for all the hungry students pulling all nighters or just the ones who are stumbling out of bars and clubs at 3 am. Highly recommend the garlic potatoes which are the best comfort food ever and the chicken shawarma pita, although I wish the chicken shawarma had some more spice and flavor.  The price point is good and makes it a great alternative to other student late night favorites such as Chef On Call. For about $10 you can get the trio which includes a pita, a drink of your choice, and a side :)"}
{"text":"Best Shwarma in town.

really I shouldn't have to say more than this, but for the sake of defending my position.....

First Shwarma is a Lebanese dish, meat, often chicken or beef, cooked on a vertical spit over a vertical BBQ of sorts. The meat is shaved off the outsides of the spit as it cooks ensuring you always get crispy goodness. You can either have the meat on a plate with rice, potatoes and salad or as a pita sandwich, similar to a Donner, or souvlaki.

What Boustan does differently than everywhere else, is to really grill the finished sandwich over a fire, toasting the pita, this gives a unique taste. And Mr. Boustan is there just about every night, till closing at 4:00am or later, the man really livens up the place. Boustan's has to be good former Prime Minister Pierre Trudeau ate here while he was still alive."}
{"text":"I flew into Montreal after a grueling month and was too tired to go out. So my wife and I ordered in Boustan. We got hummus, stuffed grape (vine) leaves, the falafel trio and the Shish Tawook (Chicken) trio. The garlic potatoes were excellent. The grape leaves were great and were covered in a tangy, mayo-like sauce that was really good. The hummus was OK and the pita it came with was a little hard and dry, but this was the main downside. 

My falafel sandwich was pretty good. Not quite as good as my old favorite falafel stand in New York but still good. My wife really liked here Shish Tawook sandwich. 

Also it was really cheap. We got all of this delivered for $25 (CAD) including tip. And there was a lot of food."}
{"text":"Amazing little spot for Persian/Lebanese food!  

I tried the chicken and beef plate with rice and hummus.  There was also a little helping of garlic butter which was a nice touch.  

The staff was very helpful and accommodating.  Highly recommended!"}
{"text":"This place is already awesome and its reviews show it. So here are a series of taglines that I feel would fit their marketing campaigns. 

Unpretentious and so much better than Amir. That's it that's all.

I don't eat Lebanese food often, but when I do, it's Boustans!

The decor is atrocious, but the food isn't. 

It is a pity that your pita is not--from BOUSTANS!"}
{"text":"Wow...... fantastic iconic late night Montreal legendary restaurant branches out and into Laval. 

I will declare that I have never eaten Boustan but I have wanted to for quite some time. Let's say the better part of nine years. Many a tale handed down from night owls who would frequent this place for the late night munchies. In Ottawa we did Schwarma King and Marroush. NYC has The Halal Guys! Montreal has Boustan. 

You enter the restaurant and it's like wow? This is a Schwarma joint? Seriously?? The restaurant is open, clean, airy and has amazing large windows that face north allowing lots of natural light. Lots of tables and booths line along the windows. It's clean fresh and new. 

I ordered a Chicken Schwarma plate and it was amazing. It came with coleslaw (never seen this before) your choice of garlic sauce or hummus rice or potatoes and of course the pink pickled radish. I'm not usually a fan of garlic sauce so I went light on it. Their garlic sauce was like a choir of Lebanese angels singing in unison with harps playing in the background. The chicken was a perfect mix of crunchy and tender. Super flavorful and not dry. The rice, moist with a small amount of noodle and a devishly light flavour of seasoning I couldn't discern but it was tasty! Yes hella tasty! 

This place is going to get busy when people realize this high quality Lebanese is tucked away in this corner place. Ohhh my goodness. Compared to Amir I'd use the analogy of comparing a Ferrari (Boustan) to driving a Smart Car (Amir).  I may have just offended some smart car owners but seriously it's that good. 

Near the entrance it appears they are getting ready for a coffee bar. Hopefully will serve up some amazing fresh coffee. 

Come, crawl, swim across the river from Montreal. As you can see I'm doing backflips I'm so happy we have some real deal Lebanese quick and casual food in Laval! Knock your socks off Amir, there's a new sheriff in town!"}
{"text":"Never disappoints! The chicken shawarma is incomparable. An absolute must for anyone visiting MTL. And... a huge thank you to the wonderful staff for a prompt, late-night delivery to our hotel! Doesn't get any better."}
{"text":"Great place for a quick eat. I usually get a \" Creation \" shawarma when I come here & I love it ! You can ask for spicy or non-spicy. Good prices + Open Late."}
{"text":"I'll agree that the food is decent. But as a visitor to Montreal I have to say the opinions must be colored by local charm and history.

They got our order wrong, they took an hour to deliver just a few blocks down, and by the time it got here the pita bread was too wet and falling apart.

How was the food?

Well, the chicken shawarma we ordered did not arrive, so I don't know about that one. The beef was at least solid, although as noted, its pita had disintegrated from sitting around in a steamy bag for an hour. I took one bite of the potatoes and decided that was enough.

Far from the extraordinary cuisine people say it is.. Currently the top review says a good shawarma is hard to find in LA. I don't really get that because the food at Boustan is very similar in recipe and quality to Zankou in California. Zankou has numerous LA locations and their prices are lower despite being in a more expensive city.

I'm going back to my Poutine tour tomorrow."}
{"text":"Really don't get the hype over this place, the shawermas always get so crumbly and literally fall apart in your hands. I come here for the garlic potatoes though, which are great. Cute hole in the wall type place esp since its open late and is by all the bars and clubs on crescent."}
{"text":"Awesome chicken shawarma.  Great potatoes.  Garlic sauce.  Get the combo."}
{"text":"Super pita- everything was highly spiced and so savory and tasty! The chicken pita was less than $5 and incredibly filling. My husband had the beef shwarma plate with potatoes. It was great too, but particularly outstanding were the potatoes and garlic aioli. Excellent value for the money. Had lunch before we went to the museum nearby and we were full all afternoon. They also deliver until 4 am and minimum order is $8, so great deal."}
{"text":"The food is good and the price is fair. What I like the most is that they deliver until late at night, which is very convenient.
We tried the wraps and the platters and both are good. The falafel tastes good and the portions are big, so if you're not that hungry you can share one plate between two people for sure.
Service is regular, nothing special. Delivery arrives fairly fast, depending on the day."}
{"text":"If you stumble upon Boustan, don't let the simplicity of its outdoor appearance trick you: this might well be the best middle eastern food I've ever eaten. I always take a vegetarian plate to go, the place being a bit small and usually very busy, and I have never been disappointed. The staff is friendly, the food is affordable and the portions are satisfying. Their products seem fresh and the variety of tastes you can get in a single plate is impressing. If the other reviews did not already convince you, this is the sign you need."}
{"text":"Let me begin by saying I know middle eastern food. This was EXCEPTIONAL. We all know that best things come from small hole in the wall places - this is definitely it. You walk up your order is taken very precisely ... No frills no fuss only 6 items on the menu but are they done to perfection. We had the falafel the combination platter ( chicken and beef shawarma ) and the Kofta kebabs .... Finger lick in' good! The prices are great .... Nothing more than $10per item. A must have before leaving."}
{"text":"I went here on numerous occasions over the past 3 years.  The owner is the greatest and makes every effort to prepare your dish how you want it.  The food is unique and can not be matched.  Waiting for a location in the United States."}
{"text":"The chicken was a bit burnt but overall good. Just make sure not to get burnt chicken, it ruins the taste. The garlic potatoes were the best"}
{"text":"Mon spot à deux pas du bureau... Je commande toujours le sandwich falafel. Beau, bon et pas cher et rapide. La caissière est toujours souriante, les cuisiniers sont sympathiques également. Mon comfort food quand je n'ai pas le temps de manger"}
{"text":"ABSOLUTELY THE BEST CHICKEN SHAWARMA I HAVE EATEN!!!!! I am a huge shawarma fan and I have eaten at many Lebanese restaurants. Boustan, however, absolutely takes the cake. I've been here more times than I can remember and I don't even live in Montreal (it's really a shame there's no Shawarma places where I live!). I've made the 2.5 hour, international drive JUST for this shawarma before. It's that good. The garlic spread and the way they grill the pita after the sandwich is made is by far the reason why their shawarma is out of this world. If I could rate more than 5 stars, I would. Thank you to all the staff at Boustan who know how to make a girl happy with good food."}
{"text":"I haven't been here in 7-8 years since the old guy ran it and it was just as good as I remember it. Living in the USA now I can't find good chicken schwarma and this was just what I needed.

In the old days when I lived downtown they would remember my order without me giving it and they'd deliver it in under 15 minutes. 

All I had today was the chicken schwarma but it rocked. Ate outside watching the pretty Montreal girls walk by, it was a slice of nostalgia."}
{"text":"Came in for a late night shawarma. This should definitely be on your list of foods to try when in Montreal. My friend liked it so much that she ate herself a second one! (and she's a tiny girl; it's just that good). Their selection of vegetables isn't the best but did the trick."}
{"text":"Boustan offers some of the best Middle Eastern food out there.  I can't think of any place I've been to that Boustan is not at least as good as.

The garlic potatoes are to die for (*for garlic lovers).  The portions are big and the price point perfect.  Boustan does so many things well -- I'd recommend just getting a combo plate to experience all of the distinct tasty flavors together!"}
{"text":"All food is pre made and reheated on a styrofoam plate. Overall relatively cheap. But If you're expecting nyc mamouns type quality, you should look elsewhere."}
{"text":"TLDR: Best shwarma in Montreal.

I've been to three of the five locations (Crescent, St Catherine, and Pointe Claire) and it's standard deliciousness at each location. The toasting of the pita after assembly is what gives it the extra yumminess. The service is good but is long no matter where and when I've gone. Maybe it's in my head that the food was slightly tastier and the service was slightly friendlier under the old ownership, but Boustan is still my top choice for shwarma in Montreal."}
{"text":"TLDR: Best shwarma in Montreal.

Just as delicious as the one downtown. Their mixed platter comes with tender beef and juicy chicken with a side of fluffy rice, toasted potatoes, aioli, hummus, and a pita! If you're on a protein based diet, and don't want the carbs, you can literally just get a helping of your meat of choice. The service is quick and efficient, even when the line nearly goes out the door. Not only are they big in quantity they are also big on flavour. Still my go to place for my middle eastern craving on the west side."}
{"text":"I have to say, this is one of my favourite Lebanese Shawarma spots. I recommend the Chicken Shawarma with everything and a bit of hot sauce. Garlic potatoes were also a great side dish to go along with it. It is at an extremely convenient location - at the busiest section of Montreal's bar district. 

However, do plan your visit ahead, and don't go during a weekend night past midnight unless you are really craving for a good Shawarma, or would like to stand in line with people who are rowdy, and potential under the influence. Here's a true story, one time my friend almost got in a fight, when he was standing up to tell the person to be quiet as it got to a point when it was disturbing others. 

Overall, it's a Montreal-must-visit. If you are ever having a night-snack craving, or want to experience what's it like to have Shawarma with a bunch of rowdy folks, it can be a fun experience but be expected to wait in line for at least 30 minutes.

Fun note: There's a photo near the check-out of both Pierre and Justin Trudeau visiting this restaurant at some point. If two Prime Ministers of Canada have ate here, you should definitely try too!"}
{"text":"I heard from my felow yelpers that Boustan had opened in Laval, and you can't imagine how excited I was. For someone that used to go to boustan on a daily basis while a student at Concordia, I just couldn't wait to try it.

So here is my verdict, it was OKAY, better than Amir or Basha but not as good as the original. I had the chicken shawarma which was good, the potatoes were also very good but did not have much garlic as you would expect but I actually prefered it that way. The coleslaw and the taboule were very very tasty. I also ordered a plate of fatooush which they told me they made fresh on the spot, but unfortunately it tasted nothing like what a fatooush is suppose to taste like. It had burnt pita in it which smell overwhelmed the entire salad.

If I had the choice to go back to Boustan I would go back to the one on crescent."}
{"text":"4.5. 

Open late, cheap, great shawarma sandwiches. Preferred the chicken over the beef which is rare for me. Sandwich would be good at 4pm or 4am. Not just a drunk food stop."}
{"text":"Can't believe only a few talked about \"the creation\". It's like their chicken wrap, but with eggplant and the amazing garlic potatoes *inside*! It's listed on their website but not on the menu on the wall. Only downside is that the quantities of each ingredient vary based on who makes it, so if you order delivery instead of in person, you never know how much you'll get. (-1 star for inconsistency) Best shawarma in Montreal though."}
{"text":"This place was great! For a hole in the wall, they have incredible schwarma! For $12, you get a meal that 2 people can split easily. The beef and chicken were equally tasty, but the star was the garlicky potatoes. It looks like a bunch of roasted potatoes topped with 2 cups of mayo, but that garlic sauce was legit!"}
{"text":"Loved their vegetarian plate. Everything here is good, my only concern is the health hazard! They microwave the Styrofoam plates, it can be poisonous if it melted onto the food. 8$ for the vegetarian plate with plenty to eat!"}
{"text":"Je vais être très généreuse je sais mais je le base sur mon expérience. Ce Boustan est en plein centre du Quartier des spectacles et de l'extérieur il ne paye pas de mine. Mais pourtant leur pita shawarma sont vraiment bonne, particulièrement celle au poulet. Après je déconseille vraiment de prendre un plat par ce que tout est empilé dans l'assiette en styrofoam puis direct au microonde pour une minute. Vu que je n'ai jamais commandé le plat je ne peux pas mal noter mais je met en garde."}
{"text":"I am a huge fun of Boustan, I love their chicken and falafels, but i never went to this location until new year's eve. We did not eat all night and we were excited for some hot food on this cold night, we stepped in in the last opened restaurant on Notre-Dame. The staff was smiling, and their was a few people waiting in for their shawarma. 

I ordered the chicken shawarma plate and my boyfriend the chicken poutine. The staff was super nice we talked a little, they were also super efficient and in 5 minutes we got our hot plate of food. The plate was super tasty, everything was warm and the salad cold but not too cold/frozen, the chicken was really good, it was sliced in front of me, so i know it wasn't sitting on the warm grill forever. The poutine was also good, not too much sauce and a shit load of chicken on it. The plates were very big for the price.

For sure we will go back, it is super close to our place and their open hours are super flexible."}
{"text":"First time trying middle eastern food and I've been to multiple restaurants some then and they will not be able to compete."}
{"text":"After hearing that Shawarma in Montreal is a lot better than it is in Toronto, I decided to come here to try it out a day before Otakuthon (Anime Convention). The portions are HUGE and the chicken is wonderful. The only bad part is that it got sloppy because eating it with a fork and I was unaware there were spoons until I finished so this was my fault. Pricing is about identical to Toronto's as well."}
{"text":"We had a group meeting here. We were ten people. Service was quite fast, especially since it was the lunch rush. The food was fresh and different from other Boustan restaurants. I'd recommend trying this one out."}
{"text":"Best Lebanese comfort food you can have in the West Island. The staff is so friendly and quick with their orders. The portions are huge so make room for it! You can even call ahead to have your order ready when you arrive. The prices are fair for what you get. Either eat in at home or at the restaurant. It is spacious and equipped with a big screen TV if you want to watch hockeys games or any other sports. I am a regular and will remain one. Keep on BOUSTAN! Keep on!"}
{"text":"Favorite late night snack in Montreal. One of my favorite late night snacks anyplace. Right on Crescent, so close to the bars. The shawarma is delicious (order with everything on it). Also inexpensive. The fries with sauce are amazing. Go here at least once everytime I visit Montreal. Very friendly service."}
{"text":"Do you ever eat until you're on the verge of throwing up, refrain from throwing up.. Then continue eating? That is the experience I had with Boustan. After a sudden and complete URGE to have shawarma, I did some major googling to find that Boustan is one of the best in the area. 

- The service here is very up front and quick. They're generally pleasant, but I got the vibe that they just want to get to business because they're always busy, and deal with a lot of plates and wrapping that they don't have time to chit chat and be super friendly.

- It's very casual, so I felt welcomed in that sense.. It's more chill than I thought it would be. I definitely would've dined but I wanted to get back to my warm hotel room

- The food is prepared quickly, thank goodness! They wrap things up quite nicely and you're able to take napkins and forks after you've gotten all your food.

- It's not that expensive imo, and even if it were, it'd be well worth the price, which leads me to..

- THE FOOD. It's warm, it's home-y, it's full of flavor. You want to keep eating, so you do! The pita is a little chewier than I'd like, but perfect as a side. The meats are so well cooked and seasoned, you can't get much better. The white sauce.. Can you ever go wrong? Probably not. The potatoes are so tasty and crispy, a definite must have. A nice break from the heavy meat. Many people get it as a side because it's just that good. 

I've found myself craving a mixed plate from Boustan. It's 2am where I am right now, and I could 100%, without doubt finish a plate. Why isn't Canada closer to me?"}
{"text":"One of the best Middle Eastern restaurants I have ever been to. There's a pretty mural in the back, and all the food is clearly fresh. It's mostly popular with students because it's inexpensive, and it's super chill. The place appears not so fancy, but TBH the food could not have been better. Definitely worth going"}
{"text":"The amount of food using your precious canadian dollar is amazing! I got a combo plate 10, 45$ and my friend Bry got Chicken Shawarma plate 9, 45$. Plates come with potatoes, garlic sauce, hummus, pickled turnip, spicy(tangy) cabbage slaw, and a large pita to top it off with your choice of meat. 

REALL GOOD! The Beef made me feel meaty! There were 3 middle eastern men working behind the counter. I, myself, am super attracted and comfortable around cute guys in general so being a Boston native we end all sentences papa or mama as a sign of endearment. Here, they were amused. Yes, I'm gay, black and pretty fierce. I didn't get desert I ended it all with my chocolate. 

P.S. JLO was on the TV in \"Made in Manhattan\" it was hard not to stare at the tv. 

Au Revoir!"}
{"text":"We had some late night food here last night and it was phenomenal.  I had the chicken swarma wrap with all the dressings, and it really hit the spot.  Would highly recommend this place especially since the other late night food options around are not very good."}
{"text":"Boustan was our first meal in Montreal and it delivered.  Great Chicken Shawarma and oh-so-satisfying Roasted Potatoes.  Glad we did some research and reading up on our choices, I would've been disappointed if we ended up at the mass produced Amir and Basha.  Friendly guys behind the counter.  No frills decor and service."}
{"text":"First time i have a big lunch at the east-end location of Boustan ! Big sitting area and less clotrophobic than the crescent location ! As always food is great .. Portions are generous ! Just very loud, the employees yell at each other loudly ! For the rest is cheap and good :)!"}
{"text":"The iconic montreal shawarma restaurant comes to laval! The laval branch still has the amazing flavours and smell of the famous Montreal Boustan. For only 11$ a plate, it still fills up my stomach everytime! 

All these years and Boustan still can't be beaten in terms of quality food for shawarma at Montreal!"}
{"text":"I LOVE a great shawarma. And living in LA, a great shawarma is very very hard to find. So my first night in Montreal, one of the largest populations of Lebanese folks outside of Lebanon, i Yelped my area and found Boustan. 

It was so good, we went again the next day because we were so enamored by the meat. Just amazing! The arayess, hummus, garlic sauce, ALL so good! I read it was a local hotspot but hot damn, they need to franchise themselves! SO GOOD"}
{"text":"I prefer Amir; the meat at Boustan is overly charred for me and the pickled vegetables are too strong. But I imagine Boustan is probably more authentic. Also it always kind of grossed me out that one employee would wear the same purple latex glove for everything - preparing food, taking money, etc etc."}
{"text":"It was alright. I don't understand why this place is popular. Compared to similar food in San Francisco or Toronto it's mediocre."}
{"text":"One of my favourite lunch spots in the city. They have quick service and the staff does there job very well. I usually go for the \"creation\" pita  with a die of garlic potatoes. THIS NEVER disappoints. A nice mix of chicken, eggplant, potatoes ( in the pita) and all the fixings wow. Incredible.

I tried the falafel pita and I found it was a tad salty but still delicious. Here is a tip, take the pita spicy, you won't be disappointed."}
{"text":"Decided to stop in and check this place out after seeing the good reviews. What actually caught my eye on the menu online were the garlic potatoes with garlic sauce. I ordered the Kafta Kebab plate since it came with a side of the garlic potatoes. I admit I have a higher standard because I'm from a city that has a good variety of Middle-Eastern and Mediterranean food. Boustan did not disappoint. My Kafta Kebab plate was delicious.

They accept credit cards, which was a big plus in my book. Very unassuming place, good food, and the staff was pleasant. Friday evening, there was a constant stream of people coming in with a fairly short wait."}
{"text":"When the owner of this place bought that little hole underground in the heart of what is Montreal's party town, I don't think he realized how much of a gold mine he was sitting on.

At first glance, it looks like just another Middle Eastern good restaurant in Montreal.  There are PLENTY.  About as many as there are steamed hotdog joints.

But what sets this place apart from the rest isn't some amazing ambiance, smiling courteous wait staff (the place is too small for that anyway), but its amazing food.

Ironically enough, there is another middle eastern restaurant right next door called Amirs, which isn't anywhere near as good.  

The food is fresh, the chicken, beef and lamb are marinated and seasoned, the garlic sauce is to die for, their coleslaw has just the right flavor, their falafals are moist and very tasty... the food overall is outstanding.  It's also rather popular among local sports stars.  The place is known to be the go to place for Middle Eastern food for the Montreal Canadians and Montreal Alouettes.   It's also got celebrity autographs.  The place is a local legend when it comes to the unique flavor of Middle Eastern food.  

Their prices are also spectacular.  For anyone with drunken hunger after a party night out on Crescent, you can get a small feast for under 10$ here.

A lot of places will use canned/bottled food on their menu but this place makes their food fresh, and they are family owned, so you know there is care in it.

I would recommend this place to anyone living in the city, or anyone visiting the city, who enjoy classic, flavorful middle eastern cuisine.   And they deliver until 4 AM!"}
{"text":"This place is weird, but my friend recommended it as the \"best garlic potatoes ever\" and she wasn't wrong. It's not much of a sit-in type of place, though. More like a large kebab shop with several TVs. Eh, whatever, it's cheap, and the potatoes were very good."}
{"text":"Lining up for Boustan's heavenly shwarma, garlic fries and friendly banter is a rite of passage for many students attending university in Montreal. On a recent trip, I re-lived that experience and I enjoyed it as much (if not more) as I used to in the past. The experience was better this time because I did not have finals/assignments to worry about!

The shwarma was as good as I remember it being: toasty pita, with succulent crispy chicken choc-a-bloc with flavor and veggies, hummus and garlic sauce.  The accompanying garlic potatoes were gooey without being soggy and very filling. Did I mention I am a big fan of the garlic sauce?

The staffs' spirits and smiles are unfailing.

As I was returning with my order, I walked passed a very drunk trio, once of whom was urinating quite proudly while standing in the middle of Crescent street. Some things never change!"}
{"text":"I LOVEEEE this place. Went to Montreal for few days and found this place nearby my hotel and was recommended by the front desk person when I asked her about quick eats. HOLY MOLY. It was so good that I went back the next day and got more wraps. From listening to people ordering in line, I learned some \"regulars' tips\" LOL the best part, I used my US credit card and the wrap only came out to be $4 something. I love you Boustan. Please make a debut in the states!! Lol"}
{"text":"I already went there once the last year, it was OK. But this time it was worst. 12,59 for a plate of cold rice and beef. Only the potatoes were correct. It was hard to Finnish this plastic plate. It was like eating an expensive piece of cardboard. 
My advice : don't take the shawarma beef plate, I've almost throw up."}
{"text":"We got into Montreal late last night and this was one of the few choices open. I went to yelp for a recommendation and this place popped up. We made an order by 11.00 pm and it came at about 12.00 am. We ordered the shawarma beef, shawarma chicken and the stuffed vine leaves. The taste was good, and pretty traditional ( coming from a guy that spent most of his life in the Middle East) It was really quite affordable, tasty, and the order came on time at a late hour of the night. Thank you Bostan for putting delicious food in our tummies at this late hour of the night."}
{"text":"It took 15 minutes to order our food from the counter because they were so slow and disorganized. The quantities are less than most middle eastern places and the falafel was dry and grainy."}
{"text":"I can't believe I missed being the first to review this location by a day. Well when an institution such as Boustan opens in a new region of Montreal, there is bound to be a lot of excitement.

Impressive new sign showing off their \"famous\" and that they began originally in 1986 - wow that's a lot of pitas and shawarma.

Speaking of pitas and shawarma. These Boustan pita sandwiches were larger than I'd ever seen plus extra crunchy on the outside (thanks for that extra care and attention grilling them - as the other guys can get soggy). On that level great, on the garlic potatoes and garlic mayo - they're both just a little less -incredible- than the original Crescent street location, but I guess that happens with expansion. Don't get me wrong they're tasty little nuggets nonetheless. 

To customer service I say, the guy who took the order was very on it and welcoming. The food came in about 30 minutes as was mentioned - no fuss, no muss. 

The sign, and interior of the restaurant are very neat and clean, so there is a benefit of expansion. Those who know the original location can attest, the old bathrooms...not 5 star.

Bathroom memories aside, looking forward to trying more items, for now just wanted to be at least the second to review.

Welcome Boustan!"}
{"text":"BOUSTAN!!! If you ever mention this name to anyone from Montreal, they will have a smile on their place. The reason is this is the holy grail and go to place after a long night of partying. Hits the spot every time!

Super cheap and affordable. Expect a line up especially at 2-3 am! I always get the combo plate. It is just so fulfilling to stuff yourself with potatoes dripping of garlic and eating slices of well seasoned beef and chicken. Both choices of meat are extremely moist and tender. The portions are very generous and the service is great! All for under $10 as well!

SECRET/HIDDEN MENU:
I don't know if many people know about this... but now that I am no longer in Montreal, I shall share with all of you a secret item that I found out from one of my best friends about this place. It is called \"The Creation!\" Order it and thank me later. I will keep it a surprise for you to find out!

This place is like a cherry on an ice cream - best and sweetest way to end the night. I will guarantee you that you will sleep like a baby after a long night out! Highly recommended!"}
{"text":"Had the trio (drink + potatoes + schwarma sandwich). Delicious, quick and affordable in downtown Montreal. I would definitely return. They take credits cards (+extra points!)."}
{"text":"Great flavorful food!
Everytime I come back to Mtl, I need to visit Boustan to get my fix for lebanese food. Their shawarma's are so tasty and the garlic potatoes are to die for!!!"}
{"text":"Great food for late at night. The \"until 4am\" delivery hours make it super convenient to order after a night out.

Shawarmas are a bit oily which I dont usually fancy, but they are tasty and filling. Garlic potatoes are a must have on the side. 

3 orders of chicken shawarma, garlic potatoes and a drink costed $28. Not too bad"}
{"text":"This was a good quick and cheap lunch option close to the fine arts museum. It was obvious that the local students favored the place as well. The chicken shwarma was delicious!"}
{"text":"This place has one of the best falafel sandwiches I have ever had! Not too heavy, not too light, and just the right price at $3.50. Before coming here, I read that they had a special of sandwich + fries, though upon arriving, I saw that the \"fries\" were not true \"frites,\" but were just soggy looking home fries that they microwave - for that, they get four stars instead of five. 

If anyone has commented negatively about this place, maybe they are expecting something totally different? If you want cloth table cloths and a fancy meal, go somewhere else. But, for extremely tasty and affordable middle eastern food that is conveniently located and delivers late, this place is pretty incredible."}
{"text":"Ate here for lunch after visiting the nearby art museum. Delicious. Messy. Busy, but efficient.  I had to wait out a table, but it was a good overall experience. Pretty sure my kids would not like it, but young adults and business folk are lucky to have this place!"}
{"text":"Good Lebanese food and it's conveniently located on party street (crescent street) Montreal after you're done clubbing /partying.

The food here is really good and the service is fast. This is the only place I go when I'm in the mood for any Middle Eastern food really. I love the chicken shawarma pita, that's the only thing I get there."}
{"text":"Experience the exotic flavors of the Middle-East and Mediterranean in downtown Montreal. Served up with a smile :)

Placed was packed and I had the following:


 Kibeh which is yummy Lebanese Beef Croquette
Golden seasoned garlic potatoes served with garlic sauce (I didn't need it) a long with the marinated chicken 

If you want something satisfying, this is the place."}
{"text":"I LOVE the Shawarma here....I LOVE IT. We came here for lunch first--already a line. The owners are a bit impatient when it comes to slow customers who like to take their time looking through the menu. It's a fairly small shop, but there's plenty of seating inside. This was our third meal here in Montreal, and it was amazing though.

So amazing that we decided for our final meal at Montreal would be Boustan. SO, we ordered about 5 shawarma's to be delivered to our apartment that night so that we would have nomnoms waiting for us after a night at New City Gas.

4 star only because delivery took forever...we were told they would be at our apartment in 20 minutes, but was instead delivered about an hour later. We even called Boustan to confirm that they didn't get lost or forgot our order. :( 

Anyways, still loved the Shawarma...but probably wouldn't go for delivery again! Hahah."}
{"text":"Montreal classic. 
Most reliable service at late night. 

The pricing is great too. 
The only thing to note is quality is often inconsistent. 
However, probably my favorite Lebanese fast food place."}
{"text":"The food is super fresh. I think its the best boustan. The one in laval and crescent dont have as good of quality food as this one. The service here is good and its very clean too."}
{"text":"Discovered  this  place because of a  Coworker. Great  little  place to  eat  from  when  you  want  something  fast .  The  food  is  very good. The employees  are  also very  nice."}
{"text":"Pour la plupart des Montréalais (les vrais, là), cet endroit n'a pas besoin d'introduction !

J'ai appris l'existence de cet établissement au début de 2011 seulement alors que Boustan faisait les nouvelles ; Monsieur Boustan allait fermer ses portes ; il avait fait son temps ; ses fils ne voulaient pas prendre la relève... etc. 

À l'automne 2011, suite à mon changement de carrière, je me suis rapprochée de la si \"fameuse\" (interprétez les guillemets comme vous le voulez ;-) Crescent Street... et quand on ne fait pas ses lunchs, on fait très vite le tour des [bons] endroits où bouffer.  C'est alors qu'en me promenant sur De Maisonneuve, cherchant de quoi manger, quelque chose de WOW (c'est toujours mon objectif), et croisant Crescent, que j'ai aperçu le nom de Boustan à côté du cèdre libanais.

J'y suis entrée en courant. 

Depuis ce temps, j'y vais en moyenne 1 fois par semaine pour ma combinaison à moi : pita shawarma au poulet, une kebbeh (moi je les appelle koubebbah, à l'égyptienne) et un Pepsi.  Des fois, je remplace ma koubebbah par une salade de taboulah.  Mm mm mm que c'est bon !  Effectivement le meilleur pita poulet libanais que j'ai mangé !  Un pita... \"croustillant\" avec de la salade de choux, du poulet bien cuit à la croustillant et tendre, des navets marinés... Et que dire des koubebbah et de sa petite sauce blanche, à l'air bien sûr ; elle aussi bien croustillante et savoureuse à laquelle sa sauce blanche apporte un \"doux petit punch\" en accompagnement.

De mon expérience, même maintenant que Boustan soit passé entre les mains d'un nouveau proprio (d'origine grecque), le menu n'a pas changé ; la nourriture est aussi bonne !  (Voir article de MontrealGazette.com : http://bit.ly/MOqEFl)

Boustan : toujours et encore un incontournable pour le midi, le souper où aux petites heures après une soirée bien arrosée, pour manger on-the-spot ou pour emporter."}
{"text":"Great value for money. I ordered the trio. The garlic potatoes were simply the best! My expectations are usually high when I find a restaurant that has really good reviews. Definitely happy with this choice. Cheap great quick meal!"}
{"text":"Délicieux ! La petite terasse, le fait que ce resto est ouvert tard et les petites patates font de moi une personne comblée lorsque j'y vais."}
{"text":"Best middle eastern food I've ever had.  Halal Guys and other Middle Eastern restaurants in NYC should learn from these guys.  Food here was much better than top restaurants I've visited in Montreal.  Also, while many business closes early in Montreal, this place stays open at late hours, just like another great place, Joe's Panini.  Highly recommended!  I'll visit again if I ever go to Montreal again!"}
{"text":"Amazing grilled shish taouk & garlic potatoes!! Everybody and anybody knows this place! A must have prior or after the clubs. Always hits the spot. Friendly staff and prices are very reasonable!"}
{"text":"Food was good to great. Not great but not just 'good'. They could use a better quality wrap bread and the meat was a bit on the dry side. That said very good and a solid good value.

Here's why they got 3 stars and not 4. There delivery system- when I called in- woman said 1hr to 1.5hrs T the earliest she says there super busy. I said totally fine - went to the gym then and there, come back and have 10 missed phone calls from the driver. It has been only 45mins. Hell, I'm not complaining they brought the food early. Happy about that but was told a different time. I called back, guy says \"ya I'll come back over in 20 mins with the food\"... Meet this guy he's shaking his head at me, I check him on that and say to him don't be shaking your head when you guys said a complete different time. That said, thanks for brining it back, somewhat cold, and I tipped him well. Guy was a dueche for that but still, sloppy business practice. Great to deliver early but when you state a time, stick to it.

All in all good experience tho. I'm a positive thinker."}
{"text":"This place was just down the street from where we were staying and was fairly busy every time we walked by. It's located on Crescent street by where all the bars are and I think it's smart of them to open until 4AM to get all the drunkies.

I tried the chicken shawarma warp and garlic potatoes. They're pretty fast and taking your order and making the food so it's a good place to grab a bite and go. It's a tiny place with like 5-10 tables so it's really not a sit down place...

The wrap was delicious and the chicken wasn't dry! The garlic potatoes are DELICIOUS!!! It's def the sauce that makes that dish. I personally love jalapenos and got an order of them - big mistake... they were sour and tasted weird. However, I still like this place a lot because the food is good, it's fairly cheap, they're open late, and they have friendly service!"}
{"text":"After being disappointed at Halal guys nearby, someone who over heard my gripe about them recommended me try Boustan. That was indeed a excellent recommendation. I opted the beef plate with potatoes, salad, pita and a load of beef smothered in extra tahini sauce, one bite and I was hooked! I can arguably say this is the best middle eastern restaurant in Montreal. 

Service wise they are quite quick even with the line, I got my food in under 10 mins. Definitely come back and try their chicken plate."}
{"text":"The best fast food restaurant in Montreal. Service is fast and the foot taste wonderful. No complaints at all. 
I personally like the chickens over beef, cuz the meat is juicers and it go well with salad. It's also popular for its garlic potatoes. Most my friend choose garlic over rice but I like the combination of both. They also have vegetarian options but it not yet tried it. (Taste: 5/5) 
Decoration is simple, decently clean and not much to be impressed with (Decoration: 3/5). But the food is wonderful experiences. Much better than Hala Guys . 
If you looking for a quick lunch or dinner, this is the right place to go."}
{"text":"You want to go there to finish your night. Cheap and you will come out of there full! Nice staff and always busy no matter what time it is"}
{"text":"Great food. Best shawarma in the west-island. Service is a bit slow but ok. Great staff though."}
{"text":"Very friendly staff with a lot of menu options. The line was a little long filled mostly with the late night crowd. I ordered a chicken Shawarma for $6. It was decent but didn't amaze me. I expected more from the size of the line."}
{"text":"This restaurant is located downstairs and is kind of hidden. The restaurant is very dark and the white guy at the cash is not exactly the friendliest person around. The middle eastern guy taking orders is absolutely charming though. He is polite and caters to you. I don't understand why everyone keeps bragging about how great this place is. C'mon guys! It's just another Shawarma place. The food items are exactly like any other Middle eastern restaurant you go to. I think the relatively low prices is what attracts everyone. Ok, I give them 3.5 stars for the food. It's not amazing but it's plenty and it taste alright."}
{"text":"So good. Everything there is delicious. Really quite cheap, friendly people. Excellent."}
{"text":"Great food! Super cheap place, but overall it is insanely delicious. 10/10 would recommend for some excellent Lebanese food. Usually the line there is a good indication of this, but they are quite fast usually. They also deliver until the early hours of the morning!"}
{"text":"After eating out at expensive restaurants for the past 5 days in Montréal, we were in search for something more casual. We stumbled upon this place and decided to give it a shot. 
When it comes to the decor and cleanliness, it may be a bit questionable, since this place doesn't aim to impress but rather just feed those who want a fast or late night hungover meal. You have to place your oder at the counter like every other shawarma place, but the man taking my order reminded me of the 'soup nazi' form Seinfeld. He asked for your order and assembled the food in a very strict and uniform manner with no intention to smile. Let's just say that all the negatives were forgotten once I tasted my food. It actually beat every other over-priced meal I had throughout my week at Montréal! The shawarma was warm, hearty, and simply amazing.
My mum got the falafel plate, and I have never seen a falafel plate with so much variety. They had potatoes, rice, pita, salads, taboulli, and so much more all in one plate.
We also got the grape vines (dolmaldes), which were great too.
For an affordable meal that will satisfy any craving, and right by all the lively clubs, restaurants and shopping, this place is a must-go for sure!"}
{"text":"Boom Shizz Nizzle
            or
Bing Bang Kabazz

      Boustan is the best late night eats in the city, hands down. The drunker you are, the tastier it is. You never know who you'll see gettin' a shawarma. Habs, Trailer Park Boys, acclaimed Montreal chefs, the Als. It is a Montreal landmark, restaurantwise and a must for anyone trying out this city for the first time.

        A word to the wise...don't be scared, try the 'creation'. Get the meatballs, sitting on the plate. Have them coated in the white sauce. Get the chicken shawarma with the pickled turnips, the slaw, the hot sauce, the hummus, the garlic mouluu stuff. My mouth is watering just thinking about it (even tastes good when you burp later).

It's also a laxative and hangover cure...

...if you're a heavy drinker, get two wraps. Leave one in the fridge and have it for breakfast the next day, it might save your life.

waka waka"}
{"text":"The flavour of the falafel and of all the salads and sides are great. I enjoyed every bite of my vegetarian platter even though I felt a bit sick from the huge mount of garlic mayonnaise afterwards. Prices are probably unbeatable for Montreal too.
If I judged Boustan as a take-away restaurant only, I'd give them 5 stars. But if you want to sit in, you have to take away two stars unfortunately. Firstly, there's an air con blowing icy wind directly onto the dining tables. Secondly, the interior is very basic and not particularly inviting."}
{"text":"I know my Middle Eastern food and I wasn't impressed with this place. Meat was very dry. Nothing felt right. I don't recommend it.."}
{"text":"Lebanese food that's a bit different from all the others. Perfect for Saturday night at 3am! Service is okay they seem to rush you a bit when it's late though. After eating here too much I dunno, food just doesn't as amazing as it did at first."}
{"text":"Not as good as people say it is at all. Place looks dirty and filthy and food wasn't very good. Only thing good is the late night hours but that's about it"}
{"text":"I'm giving these guys \"2 stars - Meh, I've experienced better,\" when what I really want to say is: \"Waaaaaaaaaaaah! Whyyyyyyyyyyyyyyyyyyyyyyyy?\" 

Boustan used to make, hands down, the best shawarma (sp?) in Montreal, possibly in the world. I was a big fan of the veggie pita, but also the \"Creation\" (a combo of the veggie and the chicken) which my friend Shayne actually took credit for inventing back in 2004. Any time, day or night, I would pop in for a pita and the world's greatest vine leaves with the most addictive tahina sauce. I expounded a theory that sesame seeds might contain some kind of addictive substance, similar to opium in poppy seeds, dragging me back to Boustan day after day.

But now I've lost that loving feeling. Because you guys, (and I mean YOU guys, you new owners) have sucked the flavour out of this food.

It's clear the recipes are still the same, but the delicious pita, heretofore grilled to creamy, hot perfection, is now lukewarm. The crispy vegetable are limp and tasteless. The vine leaves have that distinct carbonated aftertaste of something that should have been chucked and replaced a few days ago, and the SAUCE (you cretins, DEVILS!) has been thinned out to the point of flavourlessness.

My heart is broken."}
{"text":"Hands down THE BEST place for shish taouk! Staff is quick, and friendly, and the food NEVER disappoints. Only downside: the bathrooms."}
{"text":"Restaurant satellite par rapport au commerce original du Centre-Ville.

Belle place, propre et spacieux. La bouffe n'est pas super. Salée et peu goûteuse. Déçu par rapport à ce que j'ai déjà goûté au Centre-Ville."}
{"text":"WOW!
Our order was taken along with 2 other people before we even got to the cash and the man remembered everything!!
This place is rockin!
Line up out the door but moves so quick! These men are so fast on there feet and well organized! Not to mention best shawarma I've ever had in my life!
I could have ate 2 more pitas they were so delicious!!
Such diverse clientele eating here- young , old, men, woman, kids! I saw it all within 10 minutes!!
YUMMMMYYY!!!

Ps -order a side of potatoes!"}
{"text":"It's ok. We got two mixed pitas and garlic potatoes. The potatoes are excellent. So soft on the inside and crispy on the outside. The garlic sauce is like butter; tastes great but probably not that great for you. The pitas were just ok; meat was dry and there didn't seem to be as many toppings as I'm used to. For one pita and one pita combo it came to twenty bucks."}
{"text":"Well known for their shawarma sandwiches, and for good reason! They're super cheap (less than $5 a pop) and they're delicious. I had both the chicken and the beef with the works, and it was exactly what you want before a nigh of heavy drinking and bar/club hopping.

They have outdoor seating as well as indoor seating with a TV in the actual restaurant. It takes a little bit of time to get your order, but that's because they make it all fresh. I liked the chicken more than the beef, but both had their merits.

Great pit stop in between bars on Crescent."}
{"text":"#jeudiconfession: J'y ai soupé 50% du temps cette semaine parce que c'est tellement bon!

Il y a un peu plus de quatre ans de ça, il y avait un tradition dans ma famille où les jeudis soir, on se retrouvait toujours à la même foire alimentaire pour manger le meilleur sandwich shawarma en ville. Ça c'est quand j'habitais en Outaouais. Depuis, j'ai n'ai jamais goûté de shawarma aussi bon, jusqu'à cette semaine quand je me suis retrouvée à aller à Boustan 2 fois plutôt qu'une tellement j'ai aimé ça. La première fois, c'était après une grosse soirée aux petites heures du matin, et la deuxième, c'était un peu plus tôt une soirée où j'étais conductrice désignée. Peu importe la situation, c'était le meilleur sandwich sharwama au poulet de ma vie. Oui, oui. La place qui était numéro un dans mon coeur est maintenant devenue numéro deux parce qu'elle ne peut plus se comparer à Boustan. Ne vous attendez pas à quoi que ça soit de chic et ne vous laissez pas intimider par la file. Ça en vaut vraiment la peine. Vos papilles gustatives et votre estomac vous en remercieront."}
{"text":"Right in the heart of the rowdy party area of downtown, Boustan is GREAT lebanese food. Chicken and rice halal is the staple in NYC, but what I find is that Boustan offers quality and taste. Their falafel and chicken schwarma sandwiches come in a very thin pita, which is awesome and doesn't make you want to puke from being too full. At around 1am or so, the place had a decent number of patrons but wasn't packed at all. The wait was short and sweet. I heard the worker/owner tell a guy that he would give him a refund if he didn't think the sandwich was THE BEST IN THE WORLD. Now how can you not go here? I miss it already!"}
{"text":"A great addition to the West Island. A different (better) take on the flavours you would get at Amir's."}
{"text":"Worst fastfood experience . Owner delayed order for 25 minutes finger pointing us with a strong attitude saying that we didnt pay enough for what we ordered. They end up giving two of us one plate with NO Chicken at all. They charged extra before giving us our right food, everything is writen on the receit, they messed up their order and they were SUPER RUDE to let customer to pay for their mistake. WILL NEVER return to this place, racist restaurant ever."}
{"text":"I always get the chicken shawarma. It's cheap and the chicken is well grilled. It's good food for a hangover but seriously, they put too much of the garlicky sauce that drips all over the place on top of tasting way too greasy."}
{"text":"Best fast food ever! I would recommend the \"Creation\" sandwich.  Which is not listed on the menu by the way!"}
{"text":"After really enjoying Boustan at it's original location I was excited to run into this spot, however it just wasn't the same.  I had the chicken trio.  I was so disappointed to see the employee fill my wrap with the scrapings instead of freshly slicing some tender chicken off the spit.  The chicken was completely dry.  The guys behind the counter didn't seem to have the same passion and care as the original location.  Bummed after leaving them a nice tip too."}
{"text":"Where do I even begin? Pretty much all I can say is: I LOVE THIS PLACE. Another McGill alum and I recently had a discussion about what we would give up to have Boustan in the States. It came down to one of our baby toes and a \"crackberry.\" I never tried anything other than the chicken shawarma or the falafel pita....but they are just that good. Also, the garlic potatoes....oh how I miss those."}
{"text":"Gosh, if I lived in Montreal I would be here nearly every night. The falafel is so delicious, and it's plenty of food. The veggie plate comes with eggplant, cabbage, one piece of falafel, chickpeas, served over a bed of rice (which is so deliciously dressed!) definitely a must visit for late night food in Montreal. Not to mention the guys working there are all so friendly!"}
{"text":"This place looks like it has quite a following... maybe because they are fast and open super late.  I had the falafel wrap and found it incredibly dry and their tahini sauce felt off.  I just did not like the combo.  Their tabouli was good, very lemony!"}
{"text":"Like this comment if it's happened to you before!
Love this chain but the fat/not-good tasting dark meat to actual white meat on the chicken & beef plate is awful. It's a really gross plastic-tasting fat, not one that could taste good. :( 
I love boustan and whatever is left of the lean chicken, potatoes rice & salad is great but this is the only location I've been to where there as much fat as chicken. I have to spend like 10 minutes removing the fat from each piece before eating it if I don't want to work while eating the whole meal. I'll attach a photo of all the non-edible fat for one plate with a small to medium portion of chicken. 
I liked the locations downtown and in NDG far more. The service is good though, very nice people. I hope they get better quality meat."}
{"text":"This resto has outstanding middle eastern  cuisine. The \"creation\" is the most popular item with the works. It has eggplants, pickled turnips, garlic potatoes, chicken, garlic sauce & lettuce. You can ask for spicy or not and will definitely need extra napkins!!!

The service is fast and exact. The kitchen is clean and well organized.  A definite bonus when at a late night eatery."}
{"text":"Good place for a cheap lunch/ dinner. I got the chicken shawarma wrap and it was pretty filling. I ordered it fully dressed and it cane with shredded lettuce, tomatoes, hummus, and other sauces wrapped tightly with soft and spiced up chicken pieces in a medium sized pita bread. Delish!"}
{"text":"Was so happy that Verdun finally got one of these after trying it in the west island a bunch of times! I always get the shwarma and have never been disapointed. The garlic potatoes are on point too. Would recommend for sure!"}
{"text":"THE BEST MEAL IN MONTREAL!! My first and last stop every time I visit the city. Been to several locations and they all have pleasant and speedy service. My first time trying Lebanese food was here and I haven't found anything comparable in Vancouver. It's rare that I can finish a whole plate but I would never let their food go to waste. Thankfully my air bnb was nearby this location. The chicken shawarma with the garlic potatoes.. I'm dreaming of you"}
{"text":"Just a staple of MTL. Have to get it, it's a must. Every plate on the menu is just amazing."}
{"text":"J'ai adoré la nourriture tres tres bon Les aliments étaient frais et délicieux et savoureux
le service est rapide et le staff a son affaire. Je recommade ce restaurant pour la livraison take out et salle a manger. Verdun avait besoin d'un restaurant de qualité comme celui la"}
{"text":"The garlic sauce and garlic mayo are so addictive that the secret ingredient has got to be crack! One of the good Middle-Eastern joints in the city in my opinion. Yes it's a hole in the wall but the food is delicious and cheap. Plus the owner is very friendly: very chatty and he seems to know everybody. Will be back next time am drinking in the Concordia area!"}
{"text":"Ordered delivery. As always, the price is right and the pitas are tasty. I love that they toast them. One issue w delivery: the pitas get a little soggy. Not their fault... it's a drawback of the limits of delivery technology. They're always perfect when I pick them up at the store and they're fresh ;-)

Their fixings and other dishes are nice as well. I particularly like their vegetarian couscous and their kibbeh.

One thing I like about their delivery setup: they keep a record of your account and what you've ordered. Since I always get the same stuff, I can simply say: give me the usual. Super easy and quick!

[Update: the quality of delivery seems to be falling. I posted a picture of how my recent delivery orders have generally looked. Quite unappetizing.]"}
{"text":"Omg I love this place their service in terms of them preparing our is quick, their staff are friendly. love the food price. One of the best potatoes and garlic I've tasted. Why I rate a 4 is because you have to say To Go for a larger portion. But the food is flavourful nonetheless. And they're open late night"}
{"text":"came here during a visit to montreal and we were blown away! the restaurant itself is very plain looking and isn't all decorated up but looks are deceiving. this place is bomb and i scarfed down a whole combo platter myself (was bloated as heck after but worthhhh). portions are huge, plenty of seating, and the food is prepared fast."}
{"text":"Simply the best shawarma I have ever had. I have tried to find something as good from San Francisco to Vancouver to Toronto and even Istanbul and nothing has ever come close.

The way they grill the sandwich combined with specs meat, the garlic sauce, and the perfect turnips is simply worth a trip to the city alone!"}
{"text":"I truly love this place! I come here at least once a week to grab a chicken shawarma (shish taouk) or like today, a combo plate which came with chicken shawarma, beef shawarma, two kinds of rice, potatoes, salad, hummus, garlic sauce, tomatoes and pickled radish. Omg the portions here are huge! They are super generous! Make sure to ask for their hot sauce. So addictive. Unlike some reviews, they have always been nice to me. They've never been rude or anything. I wish they would come open up in my area... Back to the food. Always delicious and fresh at anytime of day! I love how the meat is crispy yet juicy and tender at the same time. This place never disappoint!"}
{"text":"I've been wanting to try this place out for awhile now. I work two blocks away from it and decided to go there and order out for lunchtime. There were two young men in front of me looking at the menu and out of nowhere, the cook behind the counter just yelled out \"what do you want\" really meanly. I was taken aback! Rudeness level to the max!!! When he got to me, he was a bit nicer. Maybe is frown is permanent...I don't know?!

I ordered a mix combo plate and to my surprise (and horror) i noticed that he would actually heat the styrofoam container with the food in it IN THE MICROWAVE! OMFG! Nooooo! I quickly told him not to heat up my order. He was surprised :/  I also noticed that all the meats were already sliced. Dryness alert! Ok Anh... let's give it a try. So it wasn't pricey. 12,..$ something. The food was quite tasty. I got two kinds of rice, potatoes, coleslaw, hummus, garlic mayo, pita, shawarma and shish taouk. Although the meat was quite dry (duh!), it was really good! I can't give it more then two stars. It goes against so much things that i think is important: service, food prep and presentation."}
{"text":"One of favorite shawarma plates downtown. They're filling and delicious. They're also open until late which is really convenient. The  establishment doesn't look like much, but there's a reason that you can always expect a huge line at the cost went ordering food"}
{"text":"This is an adorable hole in the wall hidden gem, we almost couldn't find it. The staff made us feel like family the moment we walked in. While the garlic potatos that everyone gets were great, I think the falafel was better, crispy on the outside and smooth as anything on the inside. We got the mixed platter too and it was cooked very well and fresh. Thanks guys!"}
{"text":"Food is ok. Atmosphere is quite tense, service was pretty angry and impatient. We won't be back."}
{"text":"Stopped in here for a quick bite after a show at Metropolis, and the falafel sandwich was so good I felt compelled to write a review.  When the guy behind the counter prepped my pita and gave it to a person behind him manning a grill, I didn't know what was happening.  Turns out they stick the pita in a cage and toast it on the fire for a few minutes, which gives it a crunchy texture and smoky taste.  Absolutely delicious."}
{"text":"LOVE this place. Excellent meat (usually). Sometimes it's dried out, but hey, can't be perfect every time. It's reasonably priced, AND they deliver for free without having to spend a huge amount on food. 

I go to this restaurant for lunch a lot, and order it on weekends. It's amazing, and the service is pretty good. Check it out! :)"}
{"text":"Everything looked amazing!!! We indulged in the Combination platter:) IT was a true treat. GET IT!  The meat was flavorful and the veggies were fresh and oh so tasty with the meat. However, the star of sides were the fries with the garlic sauce!Yummy in my tummy :)"}
