{"text":"This is my go to rotisserie chicken place in South Etobicoke. Its casual but a small place. Not sure what classifies as portuguese chicken?
Cooked by portuguese speaking servers?
The chicken is tender but quite salty. Which is how I like it. Salad is always fresh and the little potatoes are tender and deelish.
Its not authentic piri piri hot sauce. Its Franks hot sauce. Again I like it as Franks is quite salty. As well as you can't pull the wool over my eyes in regards to piri piri.
Portions are good and fair price.
No grilled chicken."}
{"text":"Had a great lunch yesterday. Chicken perfect.. So yummy.
Price I thought was fair 12.00 per plate that included 1/2 a chicken, rice, potatoes and salad. Service was amazing. Ambiance leaves something to be desired, but worth it for food if you're in the neighbourhood."}
{"text":"Not an expert on Portuguese Chicken but wanted to treat my Brazilian friend to some familiar food while he's away from his home country. The result was an affordable meal of succulent rotisserie chicken with comfortable servings of rice and potatoes. They have a Tuesday family special too: $17 for a whole chicken plus two sides."}
{"text":"Great value for take out in etobicoke.  Everything tastes fresh and the wait times are short.  I find myself going back again and again."}
{"text":"Very nice place for a lunch. Try the Half chicken meal with potatoes and salad and beans."}
{"text":"Everything is covered in tasteless, orange grease. The chicken itself was terrible too and they serve cheap converted rice. Better off going to the old Chalet Swiss."}
{"text":"I concur with the name of the restaurant.

You can get a chicken dinner combo for about $10. Makes a great quick meal with some chicken and 2 sides (salad, rice or potatoes). Wrap up the meal with an amazing portuguese tart. Yum! 

Only issue is their hours... Closes at 8pm. A bit early for a restaurant that offers great dinner options."}
{"text":"Quaint little spot on the Queensway just east of Islington. 

This spot is brightly lit with a nice clean small dining area and lots of fresh light during the daytime threw the big storefront glass windows. Enjoy the sun in the summertime and eat on the small patio. It's a bit loud - being situated right on the street - but a nice cordoned off spot to enjoy the food an some fresh air. 

The service is quick and T&E food is delicious. It's not the best Portuguese chicken I've EVER had, but it rivals pretty much any other in this city. 

Don't forget the custard tarts for desert. Great finish to an inexpensive enjoyable meal out."}
{"text":"Stopped by here for dinner since the reviews were pretty good for the place.

There aren't a lot of tables here, so be warned (probably sits about 20 people) but we arrived on a Friday at 6:15 or so and there was only one other customer there.  All the food is ready, so you are just telling them what you want and the food is very quick.  You order at the counter and find a table for yourself (no service).

$11 including taxes at the time (January 2015) gets you half a chicken, 2 sides and a drink.  Price is good, the portions are very generous (half a chicken is pretty big).  I got the salad with potatoes and my sister got the potatoes with rice.  She liked the rice but we both thought the potatoes were a bit bland, salad was okay.  The chicken leg half I thought was pretty good, although the breast I wasn't a fan of.

All in all, it was a good meal, I wouldn't make my way back here since I don't live nearby, but it is worth trying."}
{"text":"Best Portuguese chicken in the city! Highly recommended. Owners take pride in their work."}
{"text":"Stopped in with a friend for a quick bite, there was a line up but it moved fast. The staff were friendly and helpful for us first timers, and since it was our first time there, they gave us a free soda. I have never had such great Portuguese Chicken! The portion wasn't huge, but it was a good size. Pricing was fair. This restaurant lived up to their name!
Bottom line: Good size portions. Fairly prized. 
Excellent service. Amazing food!"}
{"text":"The price was a bit high. Overall, I would not go back again! 
Food was Oaky but not worth the high price.
If the price was lower I would give it a better rating."}
{"text":"The chicken is always cooked well and is a much better alternative to other fast food rotisserie chicken. Personally think  under $10 is well priced  for a real meal. The place is clean and looks to be family owned. Not sure what Portuguese Chicken is or what it should taste but I know this place is good."}
{"text":"Fresh, quick and delicious!
It's Portuguese chicken in the west end! Cafeteria style, good for eat in or take out! 

Price is great we enjoyed 2 quarter chicken meals with rice, potatoes and salad for and a 1 drink for $18!!!! Winner winner super chicken dinner!!  (Or lunch in our case!!) 

I will come back!! Perfect for a quick, delicious meal!"}
{"text":"Best chicken PERIOD!  Skip Swiss Chalet and go straight to BPC.  $9 for breast and choice of 2 sides (rice, roast potatoes, or salad).  Moist, perfectly roast bird and decent sides make a perfect meal.  Free custard tart if you like them on Facebook, Yelp review or google+.  Guarantee you will be back once you try it!"}
{"text":"Not the \"best Portuguese chicken\" in town. Came in to try their tuesday special whete you get a whole chicken and 2 sides for 18 dollars flat (tax and everything included). When they said any two sides they only really had 3 options... salad, roasted potato and rice. I read reviews saying they had fries but nothing was seen. 

The chicken itself was tasty but not the best. The white meat is juicy and not very oily but the flavour was only ok. The hot sauce they gave you was not even hot.. mild tasted like a tangy tomato sauce and the hot sauce at best is a mild... potatoes were not crispy and the rice tasted like uncle ben rice. 

Service was also only ok.. the girls that worked there spoke in their own language and was rude with certain customers. Portion size was big though... saving grace is their portugese tart is very good so if i were to ever come back (which wont happen) i would just get the tart.

The special is good for the price but wont return."}
{"text":"Here's what you can expect at this place very good taste, very good pricing and fast service 
Truly awesome place."}
{"text":"This is a wonderful little place at Queensway & Islington.  Go there a lot for Friday take out, or dinner before a movie (Theatre is diagonally across the street).  Great food, Chicken, Sole, Pork Bellies, all of which I highly recommend.  Get the Piri Piri sauce on the the side for first timers!  Great helpful staff, who remember you, even if you are only once a month, or haven't visited in a while.  You can't beat the prices, especially for the quality and quantity you get.

I used to have to drive 1/2 hour east to get this kind of authentic cuisine.  Everything is cooked there in front of you and the aroma just makes you hungrier.  Warning, Eat-In is small 20-25 people capacity, but very nice tables and décor.  Great place to take a date in my experience."}
{"text":"Legit provider of tasty chicken. On Tuesdays, they have a special $17 gets you a full bird and 2 good sized containers of side dishes (rice, parisian potatoes, or salad). Every other day is still only $19.

I picked a combo up when driving through the area and it was still warm enough to serve once I got it back to home downtown. While I could argue that Toronto does have better Portuguese chicken joints, this seems to be the best in this area of the GTA."}
{"text":"I gotta try it if it says THE BEST! 

Verdict: It's pretty good! The chicken was fresh,warm and juicy. The potatoes were okay but i've definitely had better. They weren't crispy enough on the outside but inside was soft. 

The sauces came with 3 heat levels, I only had the flaming hot which wasn't very hot but lots of kick ass flavors. 

The service was good enough, moving menu when you walk in was confusing cause it only gave you 2 seconds to read before changing. 

The salad was sad and wilting but they did add some olives and other fun stuff.

The custard tart was nice, sturdy and not too sweet!"}
{"text":"Great find in Etobicoke..
Fast and affordable. Great hot sauce!
The family deal for $18 is very good and Tuesday otters only $15..  Easily feed 2-3.."}
{"text":"Had their Tuesday special for 1 chicken and two sides.  Had to wait for the potatoes and rice because I guess they ran out and were in the process of making it.  Really nice about it though and made sure you were well aware of how long it would be.  People kept ordering so you know it is worth the wait.  

Took home and it was still good.  Family enjoyed it."}
{"text":"Hit this place after a long flight. Had a hankering for some Portuguese chicken.  The food was good.  Got there right around 5 and the place was quiet except for a soccer game on the tele.

Chicken was juicy and the portion to price want bad at all.

There is street parking and that looks like could be an issue if it were busy.  That said I encountered no issues.

I'd come back.."}
{"text":"I can't believe I've never written a review for this place as we go there pretty often.  I like to just run in sometimes during lunch and get a quarter chicken breast ($4.75) to eat with my salad.

So anyway, the food is consistently excellent and I find the staff to be friendly.  The chicken is very, very moist, flavourful and cooked through.  The piri piri sauce has the right amount of heat and it's not oily and the rice and potatoes are always cooked to perfection.  The real star of the show, however, is on Fridays when they serve the bacalao - OMG, it's like one of the best things I've ever tasted.  After an old Portuguese boyfriend introduced me to it, I always search it out when I go to Portuguese restaurants.  The portion is huge, they use way more fish than potatoes, it's so well spiced and not too salty and they serve it with a super fresh salad and some olives.   So good like someone's Portuguese grandmother made it.  My husband loves, loves, loves their custard tarts too. 

They do a lot of catering, especially in the area.  The restaurant is just east of Islington (on the north side). They have designated street parking too that just runs off the road - never had an issue with parking."}
{"text":"If you are looking for a healthy alternative to fast food, this is it. The food is very good and the cost is low. The chicken was cooked perfectly with a very flavorful crust. It could have been a bit more moist. The best part of this place is they are not cheap with their piri piri sauce like many other Portuguese places. It is on the table and tastes great.   Recommended as a quality alt to run of the mill chicken spots."}
{"text":"Good food and cuts the chicken right from the rotisserie oven. Salad was a little too oily but otherwise great service, would come again"}
{"text":"It was a Saturday afternoon, and we were hungry. We wanted something simple, relatively quick, and not too expensive. BPC popped up on the recommendations, so we decided to give it a go. 

Both Lee and I had quarters with rice and potatoes. The chicken was great, the rice was a little bit crunchy in parts (overdone, or a little bit dry? not sure which,) and although I liked the potato balls, Lee wasn't a huge fan of them.

The piri-piri sauce was pretty good, although a little bit on the tame side. Even the super hot was what I would only call medium. I will say that to be fair, I'm more used to South American piri-piri sauce, so that might just be a cultural difference.

Would I go again? I would. I think it was a good value for the money, but I would probably avoid the rice and get a different side next time.

They seem to do a really bang up business for catering though, as there were tons of trays of chickens going out the door."}
{"text":"The chicken was good.... but for us, based on past experience sampling other Portuguese chicken, not the best.

We've had frango piri piri in Portugal and by comparison, we felt BPC fell short.

We've also had excellent Portuguese chicken in Montreal.

Yes, BPC's chicken was very moist, but we were disappointed with the piri piri sauce, as well as the potatoes.

Had wanted to try BPC for quite a while, but having now done so, won't rush to return."}
{"text":"3.5 - I can only comment on the take out orders my friend has placed twice with this restaurant and both times it was good. Their packaging for the food is great, really nice and easy packaging I've been told. I do like their chicken as well, but what bumped it down a star for me was that their salad was mediocre and their rice was pretty dry the last time we had it. The chicken and potatoes were great. I would order from this place again, but I wouldn't consider it \"best.\""}
{"text":"Ordered chicken for a large dinner and a full dinner for my family at home. Chicken was moist (always tricky with Portuguese chicken) and perfectly seasoned. 

Our order was ready more or less on time and nice and hot so it didn't need reheating.

Would definitely order again."}
{"text":"First time at BPC, I am Portuguese so I've tried many places, and have to say this is one of the best! So fresh, and taste like home!"}
{"text":"I had an early lunch today at Best Portuguese Chicken..

I ordered the half chicken dinner with rice and potatoes.  It also came with a pop.  The portion was large and the price was cheap ($12).  I've eaten this meal in a lot of Portuguese restaurants and I found it interesting that they don't put the hot sauce on your food.  They are in containers on the tables.  I think there was two varieties (there were two unlabeled bottles) ... kinda hot (which I used) and hotter.  The chicken was fresh and tender,though the wing was overdone and inedible (I was too full anyway).

I'd go back!"}
{"text":"Warning-Got a family? Go somewhere else. Sharing food here is frowned on. I usually don't give one star for a place that has good food. But my experience during my last meal was off putting. I came in late afternoon for lunch. Been here a few times. This time I ordered a half chicken meal to share with the wife and 3yr old. Got a few fish cakes on the side. We were not extremely hungry. I asked for a second plate and got a look, followed by a warning that I would be charged $5 \"sharing fee\". I was planning to look at a few other things on the menu but that comment stopped me from spending another dollar. It will be the last dollar I spend here.  Service trumps food. Too bad for a place that could and should do better for the area. So disappointed that a business would opt to threaten its customers with a charge for not ordering enough food."}
{"text":"Finally got to try this place both Sunday and Tuesday (for their $18 tax included) whole chicken special which comes with 2 sides! Love their rice (minus the olives) and fluffy roasted potato balls! Chicken is amazing! They are a bit stingy on the sauce! 1 tub of sauce per chicken! The tub is like regular size ketchup tubs when you order take out.  I guess that's why they sell the size for $10.50! Their Piri Piri sauce is the bomb."}
{"text":"Everything is fresh, good quality and fairly priced. Fast, friendly service, this is the spot for Portuguese chicken in Etobicoke. The hot sauce is some of the best as well..."}
{"text":"BPC is an excellent choice for rotisserie chicken for lunch or for a quick bite. I frequent this restaurant quite frequently as it provides non processed, freshly prepare meals.

Lunch for under $10. Feed your entire family for less then $40. 

They cater as well which works for our business functions and meals. It is a much better lunch choice than office pizza.

The space is always clean and friendly and for the price, quality, it's a lunch spot 4 stars."}
{"text":"Always have a fantastic time at this place. Great service and the chicken is always amazingly delicious."}
