{"text":"I really wanted to like this place, it's in my neighbourhood and the staff were very pleasant but the food really wasn't good.  We ordered the 9 piece grilled chicken with 3 sides.  The chicken was dry and not very flavourful at all, the rice with veggies was bland, and the grilled veggies were almost raw.  Sadly, we won't be back."}
{"text":"I tired Braiseryy chicken in different location and the food as always awesome  I don't understand some Coustmer they keep complaining about timing they cook the food fresh what they accepting , they work rally hard"}
{"text":"The oddly spelled Braiseryy in a casual dine in/take-out located on a busy stretch of Bloor in Etobicoke.   What makes it worth the trip?  In a word -- fried chicken. Better than the franchise food offerings by far.  When complemented by their in house potato chips, grilled vegetables, and plentiful savoury sauces you will be stultified.    ...and not just fried and crispy chicken, but slow roasted spatchcocked birds served in flavourful sauces and moist without being greasy.    The side dishes were fresh, seasonings redolent of Brazilian vigour with bright and spicy flavours abounding.   Try the garlic sauce, coleslaw, and fresh fries. But don't leave without getting some fried chicken!"}
{"text":"Found this restaurant for the first time on UberEats app. We were very pleased with the food when it arrived. To be honest we were looking for a quick fix food delivery and this place was way better then expected. fantastic chicken and sides if you're looking for a quick meal."}
{"text":"Location- was convenient ad it is both accessible by ttc and there were parking spots.   Service- not the best, I think the manager(shaved head guy) was not happy that we were using the Groupon. Not even once he smiled or said thank you or even replied welcome or anything.  Took him 30 to prepare our food and he even forgot to pack our fresh fries.   Food- we order 5 piece Grilled, 5 piece friend chicken with coleslaw, fries, garlic potato and corn.  Grilled chicken was very blend and needed more seasoning I think.  Fried chicken was crispy and juicy but a bit salty.  Coleslaw was Pre-made, looked atleast a day old and not fresh at all."}
{"text":"I bought a Groupon for their picanha dinner. Took my Brazilian friend to Braiseryy, expecting some form of haute cuisine, given the price of the Groupon. The first shock was the discovery that this is just your typical fast food place, except that it specializes in fried chicken rather than burgers. Everything chicken, deep fried. The name of the restaurant should have been a give-away, but I love picanha ... And I didn't check Yelp before I purchased, more fool me.  Requested the menu ... No picanha on there. When we asked, the guy said that's a different menu, and he doesn't have that menu here. Uh-huh!  The dinner, when it came, was passable. The meat was tougher than expected (picanha, done right, is melt-in-your-mouth delicious) ... Maybe just overcooked. The rice was fine, as were the roasted vegetables, but there wasn't much flavour to anything. Certainly nothing to justify the supposed pre-Groupon price. I couldn't eat the dessert, but my friend said it was good, so one star for that.  Save yourself the hassle of the Groupon ... If you go here, try their regular menu ... It's cheaper, and, hopefully, probably better (can you ever really go wrong with fried chicken?)"}
{"text":"Had a groupon, and ordered fried chicken and the grilled chicken for dining in.  This location was clean, and it was not busy at all when we arrived.  They make the fried chicken once you order, so there is a bit of a wait.  The grilled chicken was served before the fried chicken and we were OK with that.  Although the fried chicken was freshly made, we found it salty.  And the pieces were indecipherable - usually, when you order fried chicken, you can make out which piece is the breast, which is the thigh etc.  With our order of 5 pieces, other than the drumsticks, we could not really figure out what was what.  We definitely got a piece with a neck...at least that's what we think.  We had bought a Groupon to try their fried chicken, but were glad that we also ordered their grilled chicken.  This turned out to be really tasty, and if I come again, that'd be what I would order.  The seasoning was just right, and the pieces were moist.    Service was friendly and there was no attitude when we presented a groupon.  The groupon was for $20 worth of food, if I recall, so we did have to top up with several $ for our order."}
{"text":"Rich flavour and outstanding taste. Everything I tried here is so delicious. They started serving Mandi. The chicken is cooked from previous night in a pit, which rare to find. Highly recommended!  Not sure about some of the comments made here. If you come to this place, it would be for the grilled chicken, not the fried. Also, I never tried Groupon but it seems there have been issues with it for some customers. It's petty for this issue to affect rating as low as 1 star. The place deserve a fair review by everyone."}
{"text":"I found the famous fried chicken to be quite bland and greasy. I did quite enjoy the grilled chicken that was in the salad I ordered though. I tried this place on a whim because I had a Groupon. I haven't tried it again since but I would probably give it another chance."}
{"text":"driest most disgusting chicken i have ever put to my face even my dog won't go near it!!   please, do yourself the favor and go to nando's!!! ughhhhhh...."}
{"text":"This place is located a few minutes walk away from Kipling station for the TTC users. There's some parking available in the plaza.  This is a pretty spacious restaurant. We came on a Thursday night for dinner and had sat around for about 2 hours. During this time, it was pretty much empty, which is unfortunate. One person came in to pick up orders, and a couple dined in, but that was about it.  We and ordered their 9-piece grilled chicken and 9-piece crispy chicken. Asking whether the \"whole chicken\" option would come with more meat than their 9-piece options, the owner recommended getting the 9-piece. Whole chicken definitely costed less than their 9-piece, but we went with the recommendation anyways.  The chickens are grilled and fried upon order, so expect to wait 15 minutes or so. When the chickens came, they brought over a bowl of gravy for the grilled chicken, and three cups containing hot sauce, garlic sauce, and another other sauce. The owner also offered a bowl of rice because it was our first time.  The fried chicken was very crispy and the meat was very juicy and tender. The slight taste of spices on the skin made it much better. The grilled chicken was ok, but you have to eat it while it's still hot otherwise the meat becomes a bit boring to chew. I found that the meat itself compared to the skin didn't have much flavour, which is unfortunate because it costs like $10 more compared to the fried chicken.  It's a pretty nice place for chicken. If they had a more convenient location it'd probably get a lot more traffic."}
{"text":"I tried this place two times before writing the review, and both time the portions were great, chicken was succulent,  price was right and customer service was excellent. Remember this is a fast  food type of restaurant, so great to pick up a chicken on the run."}
{"text":"Braiseryy as far as I know is still located across the street from Six Points Mall on the north side of Bloor street before it breaks at Kipling in what is known to the locals as \"Spaghetti Junction\".  This area of Six Points aka Spaghetti Junction can be a bit of a tricky place.  It's busy, disjointed with lots of ramps, turns and traffic that is except for the part where this area basically breaks Bloor st and makes it split eastbound from Dundas.    This is sort of an important point when talking about Braiseryy because they're on the part of Bloor that breaks when it hits Kipling which stays continuous on the underpass with Dundas staying continous on the overpass.  Because of this point, Braiseryy may not get the same traffic as say businesses on Dundas who enjoy the busy street through Six Points.    I spoke to who seems to be the owner of Braiseryy about this and he said that they were planning on moving to where the Sushi2Go location is on Dundas which is a split building with another Asian restaurant.  I guess the thinking is that the place would be smaller and be on a busier street I mean he's right about that.  3 bus routes pass by that building not counting the Mississauga buses as well as the area is much closer to the new condos being built all along Dundas from 427 all the way to Kipling station.    You see the thing about Braiseryy is that their food I find is really good.  I really like their food and their offerings if you can get some.  I say it like this because just last Friday (March 23) I wanted to stop in and put in a huge order for catering but at 830pm the place was closed!  No sign saying they're moving, or why they're closed early - just a closed building at 830pm for an business that says they stay open usually till 10pm.  Going on the website it seems the location for the Braiseryy is on Lakeshore.  Lakeshore?  How old is this website?  The phone number for that location matches the number for the Bloor street location so I can only assume the webpage is seriously outdated.  I mean for a place that makes really good food between roast chicken, garlic potatoes which are amazing, awesome chicken wings for a place that uses free range chickens across the board?  What a great variety of chicken for free range like a lower key offering of what Union Chicken has to offer.  But between making great food and running the business in what almost seems to be a casual way well...   Needless to say I felt let down and disappointed that they weren't open but what would it have taken to leave up some sort of sign as an explanation.  I tried to call the next morning hoping I'd get a hold of somebody but the number simply gets to a voicemail notification that the subscriber has not enabled the voicemail for this number.    So between being closed without explanation, not being able to contact the business and a web page that has an address that's not up to date I regret that I can't rely on just popping in there so see if they're open because although Six Points isn't across town, for me it's not around the corner to be able to see what's going on.  I really hope things improve for this business because I want to come back whether they're on Bloor or Dundas but things have to become more reliable and stable before I'm intending on returning.  Speaking of Groupon since others mentioned it my friend had a Groupon and we weren't able to use it because the guy said the connection to them was down.  I'm not going to pretend I know how Groupon works but do they go down that often?    Good food, great food - if you can get it.  I really think the communications has to be improved.  Enable the voicemail, answer the phone, fix the web page, explain why you're closed when you're not supposed to be.  A sign is acceptable.  Don't leave your customers especially those wanting to return guessing as to why the business is strangely closed on a Friday night."}
{"text":"I was really excited to try the food here but it was a huge let down. I was looking for an individual portion but the smallest thing on their menu is 4 pieces. I then decided to just go with a whole chicken and save leftovers but then they didn't have anything other than a 1/2 flat-grilled chicken I believe. Right before the dinner rush and one option is all they're giving their customers? So I said fine I'll try it. They were nice enough to throw in rice for me but honestly the chicken was so bland. I need flavour in my food, so this spot is a no go for me."}
{"text":"I have to give this place a one star.  I gave them a chance, but they just didn't follow through.  I brought a groupon for the brazilian chicken 9 piece with three sides, unfortunately, I was not able to try it.  They gave me 9 pieces of fried chicken instead.  I called the place in advance and I specifically said \"Brazilian chicken\".  The other guy on the phone said are you sure its not fried chicken? I'm like I'm sure.  He asked me for the groupon number and I gave it to him over the phone.  So when I realized I got fried chicken instead of brazilian chicken, I asked if they can do a delivery to give me the right order.  They said they can't.  Then I got to speak with the manager and I asked what they can do to compensate for this and I was told they offered me 15% off my next order.  I said this is not sufficient, I paid about $7 more for the brazilian chicken. The manager said he didn't get the money. bhahahaha are you kidding me? Your company made a deal with groupon you get the money! Anyways, so I said nah, you gotta give me the difference and 15% off, he said ok, email him at info@braiserry.com.  I emailed twice. No response.  I don't live in Etobicoke, so I don't think I'll be coming back.  They didn't email me back confirming our deal as well.  So, what if I go there and they don't honour it?  They just ripped me off basically.  Oh, and I pre-ordered  and called in my order!!! I specifically said \"Brazilian chicken\".  So what's their excuse?  My friend tried to blame groupon, as in, don't be so cheap when you buy food.  But it's not groupon's fault that they mucked up the order.  It's not groupon's fault that the manager did not reply to my two emails.   So ya, nah..... thumbs down."}
{"text":"Is not a cheap place for pieces of chicken but it does give better fried chicken than popeye. I would have to try the whole uncut chicken next time to get better idea of the resturant."}
{"text":"I've eaten here twice, once dine in and once takeout. The restaurant is nice and clean and we didn't feel awkward eating here with our hyper toddler so that was a win. The service was great and our server was very friendly to our son.  We had the fried chicken which was delicious. I love the garlic sauce. The best part for me is that the chicken is free-range. This is really hard to find in casual dining, even in a city like toronto and I think their business would pick up more if they advertised this fact more. Plus it's not a huge jump in price compared to restaurants that use organic meat.  I will order from here again for sure!"}
{"text":"Had a bad customer service experience the first time i came here when the cook was a total jack ass to me, food was great the first time,  owner had class and contacted me for a free meal, I didn't take him up in the offer because I'm not one of these clowns who complain just to get something free, that's pathetic, then I saw an offer on groupon like a year later, so thought let's give them another chance, so a couple weeks later into the place to redeem, and the manager tells me the system is down he can't redeem, very non chalantly, As was his service on day one by the way, whatever, waste of time but things happen, that's life, so I call in on New Year's Eve, so I don't waste my time again, hes not taking vouchers, no valid reason why, pathetic, so I go in in day after New Year's Day, I say I have a groupon, he tells me he knows, like I'm some cheapskate, very low class, I ordered the grilled chicken, a whole chicken, got a half, I'm sorry whos the cheapskate?, it tasted like a bad jerk chicken, just like the jerk manager, crispy fries were great, I'm sorry business isn't going good buddy but there is a good reason for it,"}
{"text":"Great restaurant, great food, and unbelievable portions, must try if your in the area.  Worth every penny"}
{"text":"Much better service and atmosphere than the Lake Shore location; albeit, the food is still good at Lake Shore.  We had a Groupon for dine-in only. We ordered the grilled flatten chicken ($18.99) and coleslaw, garlic potatoes and rice ($9.00). As usual the chicken was amazing, especially with the garlic sauce that comes on the side. The basmati rice was light and fluffy and had very fresh corn scattered throughout. The garlic potatoes were deep fried and so crispy on the outside but tender on the inside. The coleslaw was super fresh with just the right amount of sweetness.  The service was impeccable and the restaurant was very clean. The cooking surfaces were spotless and all the tables were wiped down clean. We could see into the back where they prep the food and it was immaculate.   My friend enjoyed the food so much that she went back the next day and order a whole chicken (not grilled) with a side of rice for only $17.00 - great deal! I definitely plan to go back too."}
{"text":"absolutely nothing special here. after placing my order, the gentleman told me it would be about 20 minutes. i thought this was a good sign -- that whatever took this long to wait for must be fresh and well worth it. what came out of that fryer was bland, dry, and simply gross. even the two measly sauce cups couldn't save this fried chicken. the fries? good god. it tasted exactly like burnt homemade mccain crinkle fries - NO exaggeration. they were dried out, overcooked,  burnt. mind you, both dishes were made fresh to order, so i am assuming that this is the best they have to offer.  i've had far tastier and fresher chicken from the colonel's and popeye's - for a fraction of the price. this place does not live up to the hype. absolutely no personal grudge against this place and the employees - just an honest review and a heads up to consumers. unless i went on a particularly bad day, i would pass on ever visiting again."}
{"text":"Looks like I'm not the only person that had trouble redeeming my Groupon. Came here and the manager said Groupon server is down yet when I called Groupon they said everything is fine on their end."}
{"text":"I was super excited to try this place. My friend purchased a voucher on Groupon and we decided to go there for lunch. We drove from Burlington and it wasn't easy to find..but we finally got there and were stoked! Our first impression when we walked through the doors was holymygawsh hot!!! The doors were open, it was 38 degrees outside and within 5 minutes, we were drenched in sweat. The both of us started feeling really sorry for the girl working there who was single-handedly trying to manage the customers, turn the rotisseries, get things out of the fryer and put more food into the fryer, handle the cash and basically hold the whole Sauna Fort down. When Emmanuel mentioned that they work really hard - I was not expecting to see this. Third world conditions in a first world country. Just Shameful.   But I have to give it to her, I was so impressed with how polite, courteous and on-the-ball she was.... the entire time we were there, especially given the work conditions.   Since we were starving, we decided to eat there.... what a bloody mistake. One piece of fried chicken is all it took, our body temperatures were already too hot with the 20 minute wait in the heat for the food and we felt so nauseated. Oh did I mention, there was a gentleman who I can only presume was the Owner or Manager who wasn't helping this girl out at all except give her orders. He did not even so much as make eye-contact with us the entire time nor show any attempt of customer care centredness at all. I don't know if I was more disgusted with the heat at the place, the over-worked girl / lack of staff, the extremely rude owner or the fact that while we were fully ignored by the own/manager at the restaurant, I happened to get a follow-up email from Braiseryy Mgmt after this visit, wanting to know my experience there (?!)    Final conclusion of the place - the food is actually pretty decent. If you decide to order, opt for take-out as the dine-in option is likely to completely ruin your experience.   My advise to Mgmt in case you do read this - TURN THE DAMN AC on in the summer especially when it's over 30 degrees outside and you have fryers, ovens and rotisseries that makes it close to 50 degrees in your restaurant. I can only hope that moving forward you start treating your workers  and customers with a little more respect and consideration."}
{"text":"Awesome!  I had the Picana dinner for two.  Beef.  Spectacular!  With yummy mini potatoes with garlic, rice and coleslaw.  Fantastic!  And the Brazilian chicken is incredible."}
{"text":"They have given us a full refund and gave us a free dinner! Really great management, will come back because of the amazing management and how great he treated us after this mishap! We aren't sure what happened but the dinner the second time was outstanding !! :))"}
