{"text":"Local especializado en cortes de carnes!! la atención muy buena, eso si!! para ir, se debe estar con el apetito bien abierto, ya que la cantidad de comida que sirven es monumental!!!!   El sistema consiste en pagar una cantidad por un menú que incluye 18 cortes de carne u otro que incluye un mayor numero, el menú va acompañado de tres guarniciones (arroz, ensalada y alubias negras); con refill en refrescos, o una botella de vino, también se puede seleccionar una jarra de cerveza o una de sangría.  De verdad es 100% recomendable para quienes gustamos de los buenos cortes de carne, eso si!!! repito hay que ir preparado a comer con C MAYUSCULA, ya que por el contrario no será buena la experiencia, y como he escuchado en mesas vecinas en muchas ocasiones, consideran mucho el precio sino se consume como se espera, pero ya es algo que escapa del local y va mas vinculado al cliente.  Se me olvidaba, con el menú va un la tan conocida caipirinha"}
{"text":"Comer hasta reventar...así acabamos mi chico y yo. Estábamos de compras en Bonaire y se nos hizo tarde y entramos a la zona de restauración para ver dónde cenábamos... Cuando pasamos por delante de Brasa y Leña, miramos la carta, promociones... Al ser miércoles había 2x1, mi chico había dicho en otras ocasiones de ir, así que qué mejor día habiendo esa suculenta promoción.  Yo solo sabía que era un buffet de carne y poco más...Nos sentamos y veíamos como iban los camareros con pinchos grandes con carne en ellos, y iban mesa por mesa cortando rodajas de carne. Hay una parte del local que te puedes servir para hacerte una ensalada, y había otra parte con productos fritos (patatas, croquetas,...) y había algo de pasta. La verdad que no había mucha variedad ahí, pero con lo que comes de carne no hace falta... Y del tema postre, me pareció ver solo fruta, así que pensé que quizás iba a ser buena idea después de tanta carne, pero que podría haber algo más (o quizás no lo ví...) Bueno, pues una vez sentado, van pasando cada poco un camarero con algún tipo de carne y te pregunta si quieres. La verdad que ya perdí la cuenta de las veces que pasaron, y de todo lo que probamos: carne de cerdo, pollo y ternera. Me gustó todo lo que nos pusieron, muy curiosa la panceta a la miel (y muy \"sana\" jajaja), la ternera no me llevó a acabar de gustar.  Y para mi, que soy super fan del dulce, ya cuando estaba harta de tanta carne y que no podía con mi alma, ví que sacaron un pincho de algo que no parecía carne...y pensé, parece piña....Y SI! Si que era... PIÑA ASADA CON CANELA. Nos sirvieron la ración que van sirviendo por todas las mesas, pero no fue suficiente para mi, estaban tan rica! Le pedí que me pusiera más, pero me dijo que tenía que ponerle de nuevo canela para servirme, cuando volvió me sirvió generosamente, además el camarero nos contó que es algo típico en Brasil y nos habló que él era de alli, etc. Muy amable.  Gracias a la cena 2x1 (bebidas no incluidas), nos salió a: 12,95 (precio de menú 1 persona) + 2 bebidas = 19 euros No llegamos ni a 10 euros por persona!  Quizás vuelva sin promoción, pero es que está tan bien con la promo!"}
{"text":"Este no es un local como cualquier otro, no llegas te sientas tomas un menú y pides, al contrario también posee un sistema al igual que lizarran. Se supone que antes de entrar y sentarte ya haz elegido entre los dos únicos menús, ademas del de niños que exhiben en la entrada.   Uno donde tienes algo así como opción a degustar 18 cortes de carne de forma ilimitada, con guarnición, bebida incluida a escoger entre una botella de cava, una jarra de sangría o refresco y cervezas ilimitados, también incluye la bebida de la casa la caipirinha y postre y café por poco mas de 20. El segundo menú tiene poco menos de esos 18 cortes también de forma ilimitada con su respectiva guarnición pero sin bebida, postre, café y caipirinha por poco menos de 20.  Una vez sentados pasa con cierta continuidad de tiempo varios camareros con los cortes, colocan las guarniciones en tu mesa (arroz, ensalada, patatas, alubias y pan) comes hasta saciar y simplemente una vez que ya no quieras mas pides tu cuenta. ¿El secreto? debes ir con muuuuuucha hambre y no abusar de las guarniciones previamente para que puedas disfrutar de los diversos cortes de carnes, si no haces esto te llenaras con mucha facilidad en poco tiempo.  El lugar es un poco costo, aunque según mi opinión bien merece la pena, por eso debes seguir los tips que te coloque arriba para que no sientas que pagaste mucho por nada."}
