{"text":"Bravo's is my M-I-L's favorite restaurant.  Weird 'cause she only orders the salad.  She's missing out on the Crispy Shrimp Napoli which can be ordered during dinner service as a full appetizer or in a slightly smaller portion as a \"bar bite\" for less than half the price.  I also love the Grilled Chicken Chopped Salad and Petit Filet and Grilled Shrimp.  Yes, this is a chain.  However, the quality, portion size, and wait staff are consistently better than Olive Garden.    Some of the problems encountered by other reviewers should not be discounted.  It probably makes sense to first try this restaurant M-Th to avoid a long wait to be seated or over-crowding.  However, with reservations it's still a good pick any day for small or large groups since there is a broad selection of soups, salads, fish, meat, poultry, and pizza.  We recently hosted an intimate graduation party.  Everyone ordered something different and everyone was delighted.  The only complaints were about an overly-dry bread pudding and the caramelized sugar on the cheese cake.  Skip dessert and head down the road for pie at Baker's Square, and everything should be peachy!   For anyone who's still on the fence, consider stopping by between 4:00-5:30, grab a seat in the bar area.  Try a $5 drink special and order off the bar menu.  You'll spend $10 plus a tip and you'll have a better idea whether or not you want to try the dining room another time."}
{"text":"The staff are  friendly.  They go beyond to make their customers feel appreciated.  The food is good.  The prices are good!"}
{"text":"I am always amazes by how great bravo is and I don't go there enough.. They have a great happy hour where their bar bites are only $4 a piece and you can find a glass of wine for $5. Not a bad deal as the food is exceptional and they have wonderful flatbreads.  I hidden secret in Mentor that is worth a try."}
{"text":"It was Mother's Day.  My husband had made a reservation week's in advance (kudos).  It took 45 minutes to get bread.  One and a half hours for entrees.  Asked for lemon for water twice.  Won't be back!"}
{"text":"My husband and I frequent the Mentor Bravo and we feel like family.  I love the servers!  We always sit at the bar tables and usually come on Friday night.  Our favorite servers are Tessa and Janeen. The food is always consistently good."}
{"text":"Very good pasta selections, with especially good Alfredo sauce. Good service, quiet restful dining, tempting desserts. This is a good choice for dependable quality at fair prices."}
{"text":"I'm giving this restaurant 3 stars as an average. We used to frequent here regularly, for dates, take out and even family gatherings. The food is always good. Their tomato bisque is something to write home about. However, the take out portions have become a ripoff. We gave take out two tries from them before writing this review. The portions are tiny and I literally had three cut up pieces of chicken in my pasta and two halved cherry tomatoes. The boyfriends dish wasn't any better, completely missing the cheese. We measured his pasta portion and it wasn't even 1 Cup. We are used to having leftovers to take to work for lunch the next day. Even with an appetizer, salads and bread we had no leftovers. We will stick to eating in the restaurant for family meet-ups. Their staff is enjoyable and the restaurant is always clean."}
{"text":"Six of us had lunch at this restaurant and all of us really enjoyed the food.  I was the only one to have an alcoholic beverage, a peach bellini. I enjoyed it but would have prefer it without the crushed ice.  I had a soup and salad combo.  The Italian wedding soup was well prepared as was the insalata della casa.  The mac and cheese ordered by my grand daughter was really good as was the roasted vegetable pasta ordered by the other grand daughter.   I didn't sample the other dishes ordered but everyone was happy with the meal. The service as quite good.  We would all recommend this restaurant."}
{"text":"I eat here often. The food is always tasty and fresh. My favorite is their chicken piccata.  The bread and the olive oil they give you before your meal is outstanding and flavorful. I love their salads too.You could fill up on bread and salad alone IMO. We come here for all kinds of family occasions and always enjoy our visit."}
{"text":"My wife & I usually go here on special occasions or when family are in town; and we haven't been let down yet. The house chopped salad in excellent; and the oil served with the bread is delicious (but a bit scarce!) I tend to have the chicken marsala which is always great. My wife likes the penne pasta; and I usually cannot resist their tiramisu which is one of the best I've ever had! Servers always nice and friendly. Only ever had 1 issue there and it had to do with a shift change/lack of communication which left our table uncovered. manager comped both meals so that was OK. We're also members of their rewards program; and get regular deals and free meals for birthdays etc. Would highly recommend if you're in the Mentor area."}
{"text":"Came here on Valentine's day. The bad part of the dinner was that I asked for steak, well done, but it was still red inside. I had to send it back twice for them to get it right. Besides that, the food tasted very nice. Our waiter, Dennis was very kind and made our night so much better even though I ended up eating much later than I wanted to. They did not charge us for my dish and Dennis brought us dessert for free for all the trouble the kitchen caused. I would still come back to eat here!"}
{"text":"Service was slow, and our waitress kept forgetting drinks, and food we ordered. The bread is delicious. I got the chicken romano chicken salad which is always good. It's really like any other chain restaurant nothing spectacular."}
{"text":"I gave it a three because the food is always good here and the service pretty good.  I generally eat alone in the bar.  Cons: The portions are small and the prices high!  They also have no idea what Fra Diavolo is suppose to taste like!!"}
{"text":"This is the third time in a row that we have ordered take out from the Mentor location and they have forgotten to put everything we have ordered in our bag.  Make sure if you order take out from this location that you check everything before you leave. This last visit our food was missing two sides.  Our rewards card had a free bottle of oil and they forgot to put that in the bag. Our broccoli tasted as though they poured salt on it and we could not eat it.  Wrong salad dressing. Just really disappointed."}
{"text":"This is my spot nice and quiet. Love the drinks, salad, bread and oil they serve. Decent amount of patio seating. I do wish they had booths but still love the place.  Staff is always friendly."}
{"text":"My wife and I had lunch Thursday afternoon at Bravo. Clint was our server and was great. Perfect. My wife had a pizza, I had lasagna . Good. Desert was cheesecake and a blackberry tort. Very good. Going back for lunch tomorrow. By the way they have homemade lemonade, very good, and free refills."}
{"text":"Their  Bruchetta was really great!  Pasta was nice too, but wine selection was so-so.  I like this restaurant for sure."}
{"text":"If you like clean glasses and silverware, skip this place.  After 2 wine glasses and 4 sets of silverware, I was very uncomfortable and wanted to leave.  There were chunks of cheese on each set.  Gross!!  I don't think that I will ever go back because this is not an isolated incident.  Plus, my date's lasagne was tough.  I'm so disappointed and wish we could get our time back."}
{"text":"Food and service were both mediocre, felt very much like any chain Italian restaurant. I found it a little disturbing that they had Samuel Adams Oktoberfest on tap...and we were there in mid December. Won't be back anytime soon."}
{"text":"Food was okay, but overall service was quite slow for a place that was not really busy."}
{"text":"I like Bravo. I like Mentor. But Bravo of Mentor left a sour taste.   Don't get me wrong; the food and wine was good (per usual) and the waitress was perfectly nice.   But the hostess?....I don't know, maybe it was an off day. Maybe some customer had been horrible to her earlier and she was recovering. But the hostess was clearly disgruntled from the moment our interaction began (no, it was not 5 minutes before closing, or anything like that!).  I asked about a table and she walked away, came back interacted with others....and when I finally asked about the table, she acted like I was being pushy. Communication is key, people!!! Especially in the service industry. This is easy stuff.   I know businesses probably don't read these, but if not for this easily preventable interaction, I would have enjoyed my time there.....very unlikely I'll be back there at this point."}
{"text":"I should have known! Chain restaurants suck! Took the parents here for lunch on our Christmas trip. What an awful experience. First was seated at table that was ready to fall apart, told the hostess, went back to table waiting for hostess to switch tables, she never did come back to change tables. We picked our own table. Now onto the waitress......she was very nice, but very inexperienced. Had to order twice, beg for more coffee, food was cold, overcharged, she was MIA most of the time. I should have gone the olive garden...lol!"}
{"text":"We had a party of 8 at 6pm on a Saturday.  Our server was busy, but not in the weeds busy.  Our drinks were seriously 15 minutes between refills.   Kids did the pasta thing, was ok.  I ordered a 14 oz strip, was a tad overcooked and not the best cut of meat.  However my buddy ordered a filet medium and got it cooked dead.  no red.  which led to him sending it back and it came out perfect 25 minutes later.  we were all done.  Overall the server seemed frustrated because she put the wrong order in and it came our overcooked.  the replacement steak also was wrong but good nonetheless.  It was okay but the manager removed the steak from the bill but it did not help the dining experience."}
{"text":"Placed an online order for catering on 12/28 for pickup at 8 PM on 12/31.  When I called the restaurant on 12/28 I was told there was a deal that if I bought $100 worth of gift cards I would receive $20 of free gift cards. Since we were placing a large order, we figured it was a no brainer to save $20 on our offer and ordered the gift certificates online.  On 12/31 I called the store and asked if I could move up my pickup time from 8 PM to 730 PM.  I was put on hold for 8 minutes and then a friendly voice came back and said no problem.  I then received a call back from a panicked associate saying she had the manager who wanted to speak to me.  I spoke to the manager and it appeared that they did NOT have my order.  I was told on the phone that this happens sometimes (I was also told at the restaurant that this happens all the time) and at 5 PM, this didn't give me a warm and fuzzy feeling.  Nevertheless I'm told that the 730 PM pickup time could be accommodated.  I showed up to the restaurant at 7:30 PM and everything was almost ready.  When trying to pay for my order I was told I couldn't use my $20 gift card and that it wasn't able to be used until after the first of the year.  This was not disclosed to me at any point in the process online or when I called the store on 12/28.  I was definitely not please to hear this but oh well.  I got the food home and it looked fabulous.  We ordered chicken marsala with mashed potatoes and sauteed vegetables and an appetizer of the tomato and mozzarella caprese.  The portions also appeared to be in line for the price paid.    Then, we TASTED the food.  The tomato and mozzarella caprese were soggy and somewhat flavorless.  If it wasn't for the balsamic drizzle, it would have been inedible.  The grilled chicken had nice grill marks but was cold and extremely well done.  I literally had to cut the chicken up into little pieces (like you would do for a little kid) and dip the chicken into the sauce so that I could chew it.  The mashed potatoes were completely inedible and went into the trash after a few guests tried to \"cut\" the potatoes in order to scoop them onto their plate.  The sauteed vegetables were good, no complaints.  Overall, we paid $110 for food that was soggy, flavorless and difficult to eat due to the consistency/texture.  The restaurant didn't have my order and had I not called in to bump my pickup time, I would have showed up to the restaurant with no food for my guests.  I wasn't even able to use the \"free\" $20 gift card.  Myself and our guest were not satisfied whatsoever with this meal and having never ate at this restaurant prior, we're confident that we will never go back.  Does anyone want a $20 gift card?  We certainly will not be using it. **********************************************UPDATE************************************************************* Restaurant reached out to us and made things right.  They did NOT ask that I change my review but I feel it's only fair to let other diners know how quick Bravo was to reach out and make this right.  I left my negative review on New Year's Day.  Someone reached out to me 7 minutes after my review was left.  The general manager of the Mentor location reached out to me and seemed deeply concerned that my experience was not favorable.  She looked to understand why I felt the way I did and was concerned with the situation. After all was said and done we feel that the restaurant not only made things right but they exceeded our expectations.  We're very happy with our experience and will be going back to this location for years to come."}
{"text":"A great place for good food in a nice atmosphere, without being stuffy, and the servers are very friendly.  The perfect place for a night out without having to drive to Cleveland."}
{"text":"My shrimp pasta tasted like soup and the portions were so small I asked for a side salad and you could tell they just took the plate straight out of the fridge already pre made, lettuce was old.... server was nice but not enough to make ever go back..."}
{"text":"On the spur of the moment we headed here for dinner.  I'd had lunch here a couple of times and it was good but dinner is so far above good.  I ordered the Bravo pasta and it was delicious.  Chicken was julienned and you could cut it with your fork.  My husband had sausage tortiloni and he loved it.  My only complaint and it isn't enough to take off a star is that salad is not included.  I think $3.99 for such a small salad is not worth it.  The service was excellent and the place is really very nice.  We'll be coming back."}
{"text":"On May 31st we took a party of 13 people to Bravo Italian Restaurant located at 7787 Reynolds Road, Mentor, OH  44060.  We had the best service and food there.  We were celebrating three milestone birthdays and Antonette Smith, Bar Manager, and Nic, our server, gave us outstanding service.  Both of them went out of their way to make sure we had a wonderful dining experience.    I requested that all 13 of us be seated at one large table and they set up a beautiful table for us with plenty of room so we were not crowded at all.  We had two additional guests who we were not sure could attend so Antonette added an additional table to our large table and added two more chairs for our additional guests.  We brought in a large sheet cake and Antonette set up a separate cake table for our group complete with plates and to go boxes for our guests.  While we ate our delicious dinners (huge compliments to the chef whose name I did not get but wish I had) Antonette put the cake in the refrigerator so the wonderful filling and frosting would be just right at serving time.  When we were ready for our dessert, Antonette brought the cake back out to the cake table, and placed the candles on the cake for us.  I had placed the special milestone candles on the table in front of the cake in the order I intended to put them on the cake.  She just placed the candles in the order I had them and did it for me, which was very nice of her.  Then, after we took some photos of the celebrants blowing out their respective candles, Antonette cut and served the cake to our guests.  She also boxed up cake to go too.  Everyone in our group enjoyed their dinners all of which came out with beautiful presentations worthy of the photos in the finest food magazine covers.  We highly recommend Bravo Cucina Italiana restaurant in Mentor, OH.  We will be back !!!"}
{"text":"My husband and I were in town staying at the hotel just down the street. We had been traveling and were sick of airport food and ready for a good meal. This restaurant did not disappoint. The food was excellent and the service was fast and friendly. My husband loves cheese ravioli, but it wasn't on the menu. The chef agreed to make it for him anyway and did a fantastic job of it. I ordered the spaghetti and meatballs (they were huge!). The pasta was cooked to perfection and the sauce was amazing. We were  both very happy with our meal. We will definitely come back if we ever find ourselves in Mentor again!"}
{"text":"A disappointing meal at this highly recommended restaurant. Actually the food was pretty good but the service ruined our meal. For the prices charged the service should be proportionally trained. She was slow with the food, slow to refill our drinks, botched the check a couple of times. We won't be returning. It's a shame to pay that much for a dinner and leave aggravated. You go out on the weekends to get away from aggravation not to see it at your table."}
{"text":"I typically don't like to complain, but this one was a true disappointment. I love Italian food, wine and everything Italian. This one screams: chain! The food was below average - it seemed like every entry had the same sauce, not homemade by any means..."}
{"text":"Food, cocktails, service, happy hour prices; all five stars. Fresh ingredients, prepared and served hot and delicious."}
{"text":"Had the Chef's special lunch salad, awesome. Our waitress was not great but not bad."}
{"text":"We had a reservation for12 at  6:30. Car trouble caused a few of the party to be late. It was not a problem for the staff. The waitresses were the best. We were given time for everyone to arrive and not made to feel rushed.   The service was fantastic and the food was delicious. It's a bit pricey but well worth it. My family likes going there; it's a bit special without being presumptuous."}
{"text":"Could be better, but could be way worse. Eggplant parm is mediocre...the linguine that comes with it is kind of bland. Meh.  However, the last time I was here I tried the toasted ravioli app...so good! The horseradish cream dipping sauce was awesome. I may just stick with this and a salad the next time I go.  Service is always slow. The last two times I've dined here it literally took about 10 minutes to have a server greet our table. Yikes."}
{"text":"Fantastic Italian dinner! Staff was great, portions were large, and the food quality was great. Wonderful place!"}
{"text":"I wouldn't normally hand out a 5 star this easily, but when you get that perfectly cooked filet and NO seasoning is needed - you know it's GREAT! Did I mention how fantastic the steak was and how perfectly it was cooked. Look - if you are a steak lover and you want your steak cooked perfect - the chef on duty this night was the master!   The sides were good as well, but the desert - well - no one does it better then my son, but this place nailed the tiramisu!   Staff were all great to the 12 of us, serving everyone at the same time and the value was again - well within company policy.  I would return to this place without question!"}
{"text":"Excellent service and atmosphere!! This is an updated review from our first visit. I was happy to see that the water in bathroom was actually hot I had to let it run for about a minute then it came out hot!! the food was delicious. we had the spinach dip app and it was excellent and I had the 5 oz Filet Steak with rigatoni instead of veggies and mashed potatoes my gf had the Tilapia with crap and shrimp cake on top she liked it as well. we would come again for sure for the atmosphere and service!! the food is average but the service makes it a great dining expierence. can't wait for summer to sit relax outside on one of the two patios. Kudos to Megan, Bonnie and Natilie the manager for taking great care of us THANKS!! Also they really wowed us with the trio desert to take home!!! they took our first expierence and turned it right around ... we will definitely come back again!!"}
{"text":"Omg i love this place first off the waiter wasvso nice and so caring the food was amazing as always and there was no wait when we got there. Thank you to the workers for being great people"}
{"text":"Went with a delightful business group. Service/server, bread, cleanliness, ambiance, promptness, basically everything was on par! But the food was mediocre. Pasta was a little soggy. Not bad. But not quite a 4. But everything else was amazing, which personally to me is equally as important or even more! Solid experience."}
{"text":"Bravo's bread with olive oil for dipping is DELICIOUS! The service is always good, the atmosphere and lighting are wonderful and the food is always delicious. Their ceasar salad with blackened salmon is so good as is their marinara sauce. The lobster ravioli is also to die for. Yum!!!"}
{"text":"My family likes it here. Consistently good food and service. My step-dad appreciates eating on a tablecloth and having a cloth napkin. Mom likes the cucumber gimlets. I like to share a wood fired pizza if we're not hungry for a whole meal. But the variety and quality of entrees are good too. Rosemary bread in oil to start things off is nice. If you're in Mentor, it's a decent spot to eat."}
{"text":"They knocked the ball out of the park and into the lake, bravo! to BRAVO! restaurant.  Bartender Matt for lunch knew the menu inside and out, knew his dishes, they put cucumbers in my salad and I requested none but the service and meal was so dynamite this is still 5 stars.  Nobody should be going to Smoking Bones next door, they should be coming here.  Feel like BBQ?  Go to BRAVO! Italian.  Dynamite chicken parm dish and salad, just dynamite.  My focrotchia bread was dry but this place was so good result: 5 stars."}
{"text":"Came here for lunch on a Sunday. Service was pretty terrible- had two different servers who didn't communicate about what we were ordering and when we needed things. The tomato soup we got was great but the Mediterranean pasta we got was flavorless and lacking. Won't be back here, there are better choices in the area.  UPDATE: Spoke with a regional manager who asked me to come back. Once I return I will re-write and assess again."}
{"text":"I've gone to numerous other Italian restaurants in the area and gotten better portions, better quality, and better service for a lower price. The only possible way someone could think that this restaurant has good Italian food would be if they had only been to Olive Garden."}
{"text":"Since I found one of my favorite meals the first time I went to Bravo it seems fitting that it should be my first review. I love the atmosphere of Bravo. It is not too bright but not too dark. You look slightly better in the lighting but you also can still see your menu. The bread and oil is amazing while waiting for your dish to arrive, but be careful you'll go from one piece to six very quickly then you'll be full.  My favorite meal (and honestly the only one I have even gotten because I love it so much) is Shrimp Fra Diavolo. This dish has everything. Juicy, plump shrimp covered in a spicy tomato cream sauce. I am a baby when it comes to spicy so if that's the case for you too do not let that stop you from trying this.  The staff is always friendly and the dessert tray that they bring around when you finish your meal will prove that you still have a little room left."}
{"text":"I had a party of 8 and this was a return visit with my family after having a 5 star experience the week prior.  In fact, I liked that server so much I requesed him again because I wanted the service to be outstanding.  Unfortunately, he was missing in action most of the time and it was a real disappointment!  I also found out later that my  Bravo rewards card wasn't checked in for the  visit, nor did we get the free dessert we were due.  I spent $350 and no one had a good time.  What a shame!  When it really mattered I was let down.  Oh, one more thing, the food was average at best and the portions were reminiscent of a tapas small plates restaurant  (especially the salads)."}
{"text":"On a road trip from Wisconsin to Maine and needed a place close to the hotel for dinner.  Took a chance on BRAVO! and could not have made a better choice. The wait staff was friendly, knowledgable, and just the right amount of attentive.  Then came the food... WOW.   I had the eggplant parm which is a particular favorite of mine and it was the best I have ever had.  The pasta was homemade.. at least it tasted like it was... and the portion was just right."}
{"text":"Ate here today.  I am from out of town, and we don't have a Bravo nearby.  I had eaten here while visiting about 2 years ago and loved the lobster bisque, so when a friend suggested going here for lunch today, I was delighted! Today's experience was underwhelming.  I ordered the lobster bisque again and the shrimp and chicken scampi.   I was so disappointed in the bisque!  Last time, it had a few small pieces of lobster and good flavor.  Today, it just tasted like carrot or squash soup.  There were no lobster pieces detected, just crunchy pieces of something, which I assume was celery.  Now...on to the scampi!  It was just so-so!  I rarely add s & p to my food, but had to today, as it had little to no seasoning and not much flavor.  Very disappointing meal. Service was lackluster as well.  Restaurant only had about 3 tables occupied, so being too busy was not an issue.  Server never brought water, and only refilled our tea once.  We just plain didn't see her, except when it came time to leave the check. I won't be in a hurry to return on my next visit to town."}
{"text":"We enjoy Bravo's; we come here several times a year, often when family is in town.  The food is usually very good with nice atmosphere.  Once and a while the service is a little off; but they have tried to make up for their mistakes and that is appreciated."}
{"text":"We called to place a take out order and I ordered a pasta carbonara.  They told me it would be 15-20 minutes.  As I pulled in I got a call from a host saying they made a mistake and don't have a carbonara (why the lazy manager has a host fixing problems with guests is beyond me).  I was frustrated and asked how it takes 15 minutes to figure out you don't even carry the product.  Once he tripped over his words for a minute he put the manager on the phone.  She said it will be taken care of and get the pasta out in about 5 minutes.  I went in and went about 8 minutes without being greeted while sitting at the bar.  The staff making it obvious that I was the angry customer but no one acknowledging my presence. Finally after about 15 minutes the manager comes over with the food(10 minutes after she promised,  keep in mind the restaurant looked to be about 15% occupied).  She came over said they didn't have the item and that was it no sincerity at all,  almost as if I was a bother to her when I showed her the item on the online menu.  I was furious after that,  I sincerely hope one of the Dooley brothers reads this and gets that team together.  I've been to other chains and had a pleasant experience,  not like the one today. I did not eat the meal due to my frustrations so I cannot comment on the food.  I just can't fathom how someone could literally not give a damn after so many mistakes in an 20 minute interaction."}
