{"text":"We've been watching this place for years and finally decided today was the day:  family lunch outing to the  Brickhouse Grill.  
This is a local joint.  We went at noon and there was a full-on lunch rush.  Most of the clientele were of the elderly sort, likely because of a 10% decent senior discount.  When we arrived it was a \"seat yourself\" situation but when we left there was actually a wait for tables.
I found the \"localness\" of Brickhouse quite charming.  Their soda selection includes Cheerwine and SunDrop.  They offer Concord Spider fries and something named after the Mt. Pleasant team too.  
The restaurant will probably not win awards for cleanliness.  We dusted our napkin dispenser and I'm pretty sure it had never been dusted before.  Sort of nasty.  Also, there were flies everywhere.
On to the food:
One of my sons devoured his chicken tender and french fry meal.
The other could hardly choke down his hot dog.  I took a bite of it and I can't say I blame him.  Bread was stale.  Hotdog was the old-school kind as opposed to an all-beef situation.
My husband and I both ordered hamburgers.  You get to pick your toppings - as many as you like.  Husband stuck with just onion.  I loaded mine with slaw, chili, onions - etc.  Both of us were very pleased with the burgers.  And at $3.95 for a burger and $4.95 for a cheeseburger the price is reasonable.
I added a side of fried okra.  It's $1.95 (no sides come with the burgers) and I'm convinced there is some factory somewhere that churns out fried okra.  It's the same no matter where we go.
The \"salad bar\" actually made me laugh out loud.  It's the saddest little setup of iceburg lettuce, mini carrots, bacon and cheese I've ever seen.  Please, whatever you do, do not get the salad bar.
Despite having just two girls working the floor and quite the lunch rush our drinks were always topped up, we got our check quickly and we were in and out in about 45 minutes.  Lunch for 4 cost us a total of $28 including tip.
We both decided we would go back.  We both really enjoyed our burgers.  It's a good place for a quick bit when the alternative is scrounging around the freezer trying to figure out a dinner on the fly."}
{"text":"I wanted to like this restaurant but could not. The outside of Brickhouse is nice with good parking. When you enter you go through a breezeway that has a musty smell to it.  Once inside the restaurant is clean and nice and the staff is friendly. We chose to get the all you can eat wing buffet and salad bar. The wings and food were OK, but the salad bar was unimpressive. You had to eat with styrofoam plates and cups. The cost was $9.95 for the buffet, $2.10 for a drink.  Your experience might be different but my wife and I can only give it two stars."}
{"text":"We are from Burke  County and came here to Concord for a show.  Sowe came across Brickhouse Grill  and stopped for supper.  We ordered the steak dinner it was cooked to perfection and we had the best fried pickles ever. Our server was very pleasant and had a great sense of humor.  I will look for this place agian when I come back to Concord."}
{"text":"My wife's Odell High School class (1966) held their monthly dinner here in a private room. We had the hamburger steak with fried onion rings which included one trip to the salad bar. The food was tasty, and the server was attentive to our needs. Several members of our group had the wings bar with pasta and stated that they enjoyed it. 
It was my first time at the Brickhouse, and I would be willing to return and recommend it to others."}
{"text":"The service was good and the restaurant was clean and pleasant though the food left much to be desired....not worth the price tag. For a $9 wrap I was expecting a little more than a tiny piece of chicken with iceberg and shredded cheddar.  I probably won't be back."}
{"text":"One of the best places for bbq pork you will find in the area, and we have tried a lot!  

Seasoned shredded pork, tender and cooked perfectly.  It is seasoned on its own, and the sauces are made to complement the flavor, not drown it.  Vinager based sauce is delicious with just the right amount of kick.  The \"saucier\" tomato based bbq sauce is very flavorful without being too sweet.  The platter came with hush puppies (so good!!  Hot, crunchy on the outside and moist on the inside.  Good flavorful batter) and choice of side (crinkle fries with just a little crunch).

Grilled chicken salad was a bit plain with just lettuce, onion, cherry tomatoes and a sprinkling of shredded cheese.  Chicken breast was large and nicely seasoned & grilled, and came with 2 generous dressing cups.  Not my favorite place for this type of salad, but I would order it again here. 

Have also been here for their Sunday Buffet and this is the best way to try a good majority of their food.  The fried chicken is outstanding - light flavorful crunchy coating, moist inside!  Not sure what the seasoning is but it is very good.  Sometimes they have the pork bbq on the buffet also, along with beef tips and a few other main meats.  Sides are homemade and very good - mashed potatoes, gravy, mac & cheese, greens.  The buffet also includes the small (but still about 6-8 item) salad bar and desserts.  Get here a few minutes before Church let's out so you can get a seat."}
{"text":"Very friendly service and the food was outstanding. The owner was very personable with each and every table. We will be back!!"}
{"text":"My favorite place in Cabarrus County! The flat iron steak is the best thing on the menu!!! 
I've NEVER had a bad meal here."}
{"text":"Three words: Fried Flounder Sandwich. GET IT! You will not be disappointed. My husband and I have been here a few times and have always left satisfied. The staff has always been friendly and food came out quick. There are a few tvs, which is nice if you wanted to watch a game while eating some good grub.
I've read a couple reviews about the ambience (or lack thereof).... seriously? If you need more fancy with your burger, head elsewhere and pay extra for it as well. This place is just a relaxing, no frills kind of place to get a good meal at a decent price.
Oh! And don't forget the sweet potato fries!"}
{"text":"I want to acknowledge the owner, Eric. What a great man! He has a private room in his restaurant where you can have a party. He and his whole staff was attentive to our needs during our party. We had a great time!! The food was awesome as well. Thanks again Eric for the great experience in your establishment!!!"}
{"text":"The pulled pork bbq sandwich was pretty good.  The 'cue had a good smoke to it.  The side sauces were ok.  One was more of a Lexington, NC style sauce.  The other was a little spicier, but mostly from black pepper.  The platter came with coleslaw (red or white, I got white), and homemade potato chips with ranch.  The chips were pretty good, as well.

Based on food alone, I would give the place three stars.

But, the ambiance was terrible.  It just was not an eating environment one could get comfortable in.  Plus, the table was very sticky (yuck!).  And the waitresses really didn't seem like they gave a rat's backside about giving decent service.

I've heard the burgers are good there, and I might come back to try one, but I don't think that will be any time soon."}
{"text":"We usually eat here once a week and the burgers are by far the best around! We had an issue recently on a to-go order and when I called to speak to the owner and/or manager he was so kind and apologetic. He stated he would provide us a credit and that he did! We ordered some wings to-go and he gave us a credit which went above and beyond! Btw, the wings are really good as well! I was just amazed by how he went about things to provide a positive experience."}
{"text":"I believe that I chose a poor time to visit this restaurant for the first time.  I went with a friend at 8:00 p.m. on a Friday evening.  We were the last two patrons to visit the salad bar which did not have many choices at all other than the salad greens, onions, tomatoes, cheese and some peppers.  I ordered wings which were one of the specials.  They were very good.  My friend ordered a hamburger steak with cooked onions on top which she enjoyed, but her green beans left a little to be desired, according to her.  The waitress had suggested we order the BBQ, but neither of us were hungry for that.  Perhaps that is their specialty.  The atmosphere was pleasant, and our service was outstanding."}
{"text":"Place is ok, not terrible,but for the money I would go elsewhere. Food is edible but that's as far as I can go with description. Tried once for lunch and another time for Mother's Day Brunch. Service was a bit slow, tables smelled like dirty dishwater and food selection for brunch was very limited for price and what they did offer was sub par. Would have been happier going to IHOP tbh."}
{"text":"Have visited this establishment twice and my experience has been great. Love the char-grilled burgers and the bbq plate isn't to shabby. Its a great local burger joint and I'd recommend it to anyone seeking a juicy, quality hamburger."}
{"text":"Good cheeseburger, good fries, ok atmosphere and good service. Stopping for a business lunch here makes good sense. I look forward to trying more of the menu."}
{"text":"We use to live close by, and we quickly became regulars. We've like supporting small business owners, and this guy can cook! Now we live in Kannapolis and we still make the drive.  Where do I start? 
Bacon Cheese Burger - YUMMY, JUICY, and better than anything in Concord. 

BBQ - Smokey, moist, and the sauces are standard vinegar based. One has a bit more kick.

Chili Cheese Fries - They do not have these listed on the menu. They have bacon cheese fries listed as Concord Spider fries. I think they need to add the chili cheese and call them Wonder fries, because they are out of this world good! The chili is homemade and D-E-L-I-C-I-O-U-S!!! 

Chicken Tenders - Classics and hit the spot!

Mashed Potatoes - These are SPECIAL! I've actually asked about how they are made, because they are so good. 

The Salad Bar - Someone complained about this and they missed out! The stuff is always fresh. It has homemade bacon bits! It may be simple, but the items that are on there are fresh. They usually have boiled egg, pieces of ham, lettuce, cucumber, tomatoes,  bacon bits, cheese. Then there are a few other items that switch out. The dressings darn sure taste homemade and they are GOOD! 

My kid is quirky and always seems to want something off menu. They still charge Kid Meal prices. He has wanted pancakes when it was dinner time and they made them. He wanted a Pig Sandwich (BBQ) and they made it a kids meal. 

On Saturdays they have a breakfast buffet that is full of yummy standards. Gravy biscuits, scrambled eggs, grits, livermush, french toast, etc. The meats are good quality and not like the crap you get at a buffet like Golden Corral. 

On Sundays after church they have a lunch buffet that is full of southern down home cooking like fried chicken, mashed potatoes, okra, etc..... Remember what I said about those mashed potatoes!

I've been in there a lot and I'm not sure what the reviewer was saying about the waitresses. They are sweet girls. Holly is  a bit shy, but very nice and always serves us well.

SERIOUSLY one of the best restaurants in Concord/Kannapolis"}
