{"text":"Really Good Food. 

We had the Pot Roast Sandwich and a Full Slab of Ribs, Great BBQ Sauce.

It was a nice Neighborhood Adult Sports Bar. Very Enjoyable!

Service was quick and very pleasant, our server made the time very enjoyable.

We just need to travel from University Heights to enjoy this neighborhood gem. We'll do this quite often in the very near future."}
{"text":"Cold beer, delish Spinach and Artichoke Dip and awesome atmosphere.   Casual, welcoming and very clean.  Owner took time to speak with us, was very nice, very attentive  as were all the bartenders.  Reasonably priced and no shortage of tvs.  Next time we'll be on the large patio which looked relaxing.   Great place,  you won't  be disappointed! !"}
{"text":"Awesome dinner at this great place! Loved the well  prepared food and beautiful patio! The staff was friendly and the d.j. on the patio played fun music. Much mire pleasant than other packed places with so so food and service.  
Thanks for terrific experience!"}
{"text":"The atmosphere is great! People watching is always a riot, and the food has been great everytime. I love the signature brindaliers burger. Buffalo dip is also good!"}
{"text":"Brindaliers has a very good menu not typical of the average bar and grill. It is nice to look at a menu and see over 10 things you want to eat.  My friend and I go out 2-3 times per week. However, there are very few times that we are overly impressed by the wait staff. With that said, our server Gianna was on point. She never waited on us before but made us feel like we were regular customers. She is very friendly, outgoing, personable, and attentive. Of course, we will be going back soon."}
{"text":"The wife goes here once a month and a group she belongs to meets in the party room. I sat at the bar today to wait. It's a sports bar. Basic decorations nothing fancy and nothing overbearing. Nice and different menu selection. I only dropped $20 on a large draft , a small draft , and an order of Calamari. The Calamari was the most expensive appetizer on the menu ($12) and the portion was HUGE, It was also fantastic. Friendly staff, nice crowd. I'll be back again."}
{"text":"Not sure what everyone is raving about.  Seems like just another sports bar to me.  Menu is a bit more varied but who would order duck at a bar anyway.  I ordered a burger medium and it came out scorched.  Absolutely bone dry.  The $1 chili topping was essentially all kidney beans with a little spice and sauce.  Was not near enough fluid to bring any moisture to the burger.  I give it a couple of stars because the bartenders were cute and friendly."}
{"text":"My friends and I have become somewhat of regulars here. The staff is nothing short of amazing and always takes care of us. The specials are always good and don't get me started on the menu. There really is something for everyone and it's not crappy bar food you'll find somewhere else. It's fantastic. The Brindaliers burger is fantastic and is usually my go to when it comes to ordering. We also love the buffalo chicken dip. The ravioli appetizer is amazing and I sometimes order it if I don't want a ton of food. The Philly is good, the nachos are good, the pizza is good... You can't go wrong. The atmosphere is great, and is one of my favorite places to go watch the big game or just grab drinks and a bite with friends."}
{"text":"Good place to watch sports. I had their signature burger. I will definitely go back to get it again. When more people find out about this place...the more crowded it will become."}
{"text":"OUT-FING-STANDING... No serious.. This neighborhood sports bar has an upscale natural wood interior with low lighting and enough flat screens to satisfy anyone. The staff is supper cool. Now the drinks are made to perfection and don't get me started on the food.. Ok I will start. This is NOT bar food; if you go out to eat BEFORE coming here for drinks then you just made a HUGE mistake. I had the pleasure of meeting the owner as my friend and I have become somewhat of regulars here.  They have a CHEF on staff (not a cook, a chef) and it shows. I have yet to have an average meal.

Honestly try the food and you don't HAVE to thank me afterwards unless you really want to."}
{"text":"A bar that books a benefit for battered woman and sick children only to cancel it the day before because the sports fans are more important than helping other people. I know it's a sports bar but when you have booked something months in advanced to pull the rug out from under it the day before that shows your true moral fiber. I will never set foot in there again."}
{"text":"Brindaliers: Delicious food with a sports bar atmosphere.

Everything we tried was fantastic. They have a decent beer selection and enough food on the menu to keep almost anyone happy.

Try the brindaliers burger! I did and I loved it.
My Fiance had the fish sandwich and enjoyed it."}
{"text":"Was there for Abbey Rodeo on Saturday 
The place was packed. Service was very slow, only because they were very understaffed . Our waiter  was very nice, he was just too busy handling all the tables.
The food was really very good. I would definetly go back to eat."}
{"text":"Love this place for food or drinks. Great menu, great staff, great crowd, and great beer selection. From sandwiches to pizza this options will not disappoint. Not your typical bar food here. From the duck confit to the strip steak, the menu is just awesome. The place is big enough that you join for dinner or meet for drinks , or both. Great clean atmosphere, representing Cleveland sports. Highly recommend trying this place out, unlike Cleveland sports, you won't be disappointed."}
{"text":"this place is surprisingly good. the pizza is amazing. the burgers are very good (when cooked to the correct temperature). the only reason I don't give this place 5 stars is bcz the service is hit or miss. also, the have duck confit on the menu. now, I'm not exactly sure what duck confit is, but I'm pretty sure it doesn't belong in a sports bar. but, I could be wrong. other than those minor things, it was a huge surprise to me how good the food is. I've been here a few times, with different people and everyone has enjoyed their meal."}
{"text":"1. Duck confit not on menu. Build your own Mac-and-cheese covered up with scotch tape and paper. Never a good sign.
2. Pierogi appetizer on menu, but they're out. At 1 pm on a Sunday.
3. Appetizer order lost somehow; after a long wait our burgers appear instead. We opt to start over.
4. Fried ravioli bland, over-breaded; sauce lacks zing.
5. Burger ordered rare comes out well-done.
6. \"Horseradish cheddar\" on other burger barely noticeable as cheese; has no horseradish taste at all.
7. Both burgers themselves tasteless.
8. Fries the usual breaded junk that just proves a place can't be bothered to make real ones.
One star for excellent Bloody Marys, one for taking the overdone burger off the bill."}
