{"text":"Went for breakfast on Saturday morning. I had the breakfast skillet with brisket and a coffee. The food was amazing. Lots of perfectly cooked meat, great home fries, plenty of eggs. Coffee was nothing special. The service was OK. Only problem was that everything was served on paper plates. Coffee was served in a paper cup. Forks and knives were plastic. They do the cream and sugar for you, don't even have creamer packets. The entire time we were there, everybody had their food to go, nobody else sat down. It seems they don't want to cater to people who dine-in. So if you want a really great breakfast to-go, this is the place. If you want a place to go with friends to dine-in, this is probably not what you're looking for."}
{"text":"Great food. Friendly atmosphere. Good portions. Good variety on the menu.   Yelp is making me type more before accepting the review"}
{"text":"I came here after the lunch rush on a Thursday afternoon. the owners were so warm and welcoming I knew I had to get something to eat from here. they saw that I was looking at the menu and that I had never been there and offered to explain what everything was.   I ended up getting the Briskit melt with frings (fries and onion rings) with a regular size Greek salad.   This sandwich was damn amazing! The beef had soo much flavor and was so soft. wow I was in love. the frings were a generous portion and the Greek salad was pretty good as well.   Everything is made fresh and trust me you can tell by the taste of the food that it's well worth it.   I would highly recommend this spot of you're in the area. They are only open from 8am-4pm Monday to Friday. I'm definitely going to be going back to this spot!"}
{"text":"Amazing sandwich and friendly staff. Was the best I've had in a long time! Cant wait to go back"}
{"text":"Cute little place run by a lovely couple! We had the brisket Philly Melt, chicken fingers and fries and the banquet burger. All were fresh and tasty! 5 starts for sure and we will come back again!"}
{"text":"I've been to both restaurants, and I prefer this one for dining in. love the Briskit Melt for lunch. Large menu with lots of bbq and even breakfast options. Get your ribs fix on the weekends here!"}
{"text":"Great lunch and breakfast stop. Small little shop, with pleasant service, and good food. My favorite menu item is the Briskit Melt and Salad"}
{"text":"Mom and Pop sandwich shop. They were extremely helpful and the service was excellent. The brisket sandwich was a good size. The brisket was tender and the bbq sauce was tasty. I had the onion rings which were in a home made batter and were very good also. The Louisiana soup was was tangy and delicious. A solid 4 star joint!"}
{"text":"What cam I say that has not already been said simply put its the best food cooked and served by a real cool guy. Once you have tried nothing else will do. Take the time to check it out I promise you won't be sorry. This is not a paid announcement but a solid no bull review."}
{"text":"First to review this place? How is this even possible? This new(er) second location of this popular Brampton sandwich shop has been open over a year and it seems as if folks in Brampton just love the original location so much that they're not willing to travel to this new Orenda location.  Well folks, let me just say, while I've never been to the original location, what I learned about it from the owners is worth a listen. From what I understand, the original Biskit on Wilkinson is significantly smaller, and much busier. So while you'll get the same amazing food, you a) might be waiting a lot longer on Wilkinson, and b) you might need to take it to go as seats might be limited. At the newer Orenda locations, you won't have any issues what so ever, so why not give this one a try!?  Located in the midst of a sea of auto body repair shops and transport companies, Briskit Gourmet Sandwiches shares a plaza with a gas station, so if you're in transit, why not call and make an order in advance, grab some gas for you car, pick up your food and be on your way. Plenty of parking PLUS lots of seats while you wait.  Yesterday, I knocked this spot off my bookmark bucket-list and paid them a visit at long last. I got into a convo with Elaine at the front (a lovely woman, so nice!) and told her I was stumped on what to have (who wouldn't be stumped with a huge menu filled with gourmet sandwiches, gourmet burgers, chilli, soups, salads, desserts and even gourmet hot dogs! She recommended that for my first visit I go with what made them famous, the smoked brisket sandwich melt (spelt Briskit), which comes served with sautéed onions. OK, easy, a no brainer. Then for the side, I was torn between fresh onion rings and fresh cut fries... she said, \"Have F'rings\". YOU CAN DO THAT HERE???? SOLD!! A little...excuse me, I mean, a LOT a bit of both!  Took my seat and waited for the food to come out and when it finally arrived, OH...EM...GEEE, totally worth it. The sandwich, HUGE, dripping with briskit juice and bbq sauce, the onions spilling out of the massive kaiser bun. The fries, perfectly cooked, fresh cut, crispy with the perfect amount of salt on them. Then the onion rings, freshly battered, crisp outside with a soft doughy inside, cooked through to a brown gold crisp and seasoned perfectly as well - OH and did I mention TOTALLY GLUTEN FREE!!!  I got through the sandwich and onion rings no problem, half way through the fries my stomach sent a message to my brain that it was full but my taste buds intercepted the communication, told my stomach to EF-off because they weren't done yet. So another few mouth fulls of fries and my body went into shut down mode... sorry taste buds, my stomach pulled the override switch which stops my hands from moving and mouth form opening. Game over.  So good! So good! SO GOOD!  I staggered out to my car after paying and leaving a tip for Elaine as a thank you for her guidance and help, and instantly wished I could nap in my car. Overall a great meal and one I'll return for soon.   Couple of awesome notes before I wrap up: a) There is a gourmet burger of the month each month, so check back often b) The soup of the day yesterday was Spaghetti and Meatballs.... but in soup form!!! c) Any item on the menu can be gluten free, just ask and they can accommodate. Elaine told me they build the menu so that people with gluten intolerance's would never have to be turned away - very thoughtful!  I'll be back again, but for now  Eatcrest Out"}
{"text":"Good sandwiches, slow cooked to perfection. Fries are hand cut. I just don't like how they removed the check in offer. I shall return in the near future."}
{"text":"Delicious homemade food. Service was awesome but some items may take a few minutes of waiting. Well worth the wait."}
{"text":"Excellent little hidden gem. I go for lunch whenever I'm in town for work. The owners are friendly and helpful, and it's obviously popular for lunch. I prefer to go in a little before or after the lunch rush when the place has calmed down. Gotta get the frings... And the pulled pork sandwiches are great!"}
{"text":"Nice little family run place. Super friendly, honest homemade style food, decent portions and prices. What else can you ask for??"}
{"text":"Easily the best burgers anywhere.  The staff is always friendly and accommodating.  One of the few places where you truly do feel like family."}
{"text":"Odd it took Burger Binge week to make my first visit here since I live fairly close, but better late than never.  The exterior and interior are somewhat nondescript; however, still nice and clean. During my order - which was for 4 - the phone probably rang at least 3 times. I learned pretty quick that everything is cooked to order, and those calling learned to call ahead. Most of the people I saw coming in seemed to be repeat customers, so they're clearly putting out good food consistently. I forgot the server's name, and I believe she's a co-owner; she was such a friendly and welcoming person whom I'm sure plays a part in repeat business.  I ordered the Yelp burger, which was essentially a cheeseburger with caramelized onions and a grilled hot dog on top. It's up to you to throw on whatever else you want on the burger. As mentioned, everything was cooked fresh. It's funny how little onions are properly caramelized at many places; however they did it perfectly - very sweet and soft but still not overdone. Having the hot dog in a burger is almost like a double taste of summer BBQ at once. It surprisingly isn't that odd or arbitrary, with the hot dog almost serving the purpose of bacon. The beef patty was certainly house made.  My only complaint would be the fairly average kaiser bun. It's too large and masks some of the burger's taste. It also tends to absorb too much of the sauces.  Fries were fresh-cut and cooked well; probably a bigger serving than you may even need.  Positive experience, though my next visit will probably include their namesake of \"...slow cooked sandwiches'."}
{"text":"Ive been here a few times in the last 3 years and each time it has been great. I came here with a friend on Tuesdays around 12:30 for lunch. We decided to dine in. The location is small, clean and they had the sports channel on. I ordered my usual which is the poboy chicken sandwich and didnt get a combo. The sandwich comes with Breaded Pieces of Chicken, Cole Slaw, Pickle, Lettuce, Tomato, Mayo, Bacon & Fries.  No need for a side of fries when it comes in your sandwich.   We waited about 20 minutes for our sandwiches as there were two couples ahead of us. When the sandwich came out, I was shocked at the size of it. The price was 9.50 which for the size of the sandwich is fair. The service could be a bit quicker but as everything is made fresh, we dont mind the wait. I will definitely be back again."}
{"text":"Food? GOOD. Portions? BIG. Customer service? EXCELLENT. Go here? Immediately!!!!!!    Super small moms and pops joint in the middle of industrial Brampton with the nicest people running it! The portions are pretty generous, contrary to a review someone had left. And considering the type of food they serve, it surprisingly wasn't greasy. It was delicious and I don't hate myself after eating everything on my plate :)   We had a brisket sandwich and a Po' boy chicken sandwich."}
{"text":"Was in the area so used Yelp to find this place - good call. Called before I went in so the sandwich was ready in a few minute of me arriving. Had the Cuban pulled pork. Great taste and huge portions - came with fries, great flavour  very friendly staff  Highly recommend and will be back!"}
{"text":"I was super excited to go to this place for the first time.  I ordered the Burger that has brisket on it and to say the least the brisket was the highlight of the burger.  The burger meat itself did had no taste.  Lack of seasoning.  The brisket and the toppings gave it all its taste.  Also the burger bun was an Italian Kaiser which I do like but there was more bun than meat.  The gravy on the poutine was tasty but very salty and the poutine was done with shredded cheese and not cheese curds but that doesn't make the poutine bad curds are just my preference.    I will give this place a second chance but I will stick with their pulled pork or brisket sandwiches."}
{"text":"Ordered: Brisket Melt with fries.  The whole meal was above the standard I usually see across Brampton.  Next time I will ask for coleslaw on a sandwich as it is available, but not listed on the menu board."}
{"text":"OK so after visiting there last location and being not impressed with my lunch I decided to give the original location a chance as I had never been there.  I know my review on the other location is not as good as this one will be.  Regardless I came to find out the location I visited before has been closed for a while now.  Upon entering just before the lunch rush I already knew that things would be different here.  I see the owner and who I believe to be his wife working behind the counter.  That gave me a good feeling as I knew I would enjoy my meal.  I ordered the brisket cheese melt combo.  The brisket was super tender, bbq sauce very tasty,  fresh bun and crispy home cut fries.  I only wished that it was more cheesy  but none the less still great.  After paying for our meal the owner tells us he makes absolutely everything from scratch including hot dogs.  WOW.  I was very pleased with the food and the service.   There are a lot of items on the menu that are a MUST try for me.  I will definitely be back to try them.  Word of warning this is in a industrial and get very very busy during lunch hours.  Be patient.  Its worth the wait."}
{"text":"Just stopped by for lunch with some family. Briskit is a little out of the way spot in a light industrial park.   If you drove by you might miss it if you are not looking for it but my recommendation is to turn around if that happens and FIND IT!  Two of us had beef brisket the other had pulled pork. Both were outstanding.   The brisket was tender and moist with a nice subtle smoke on it.   The pulled pork was equally delicious with a great sweet and savory BBQ sauce.   And the fries , mmm the fries. Fresh cut, skin on delicious-ness.... mmm mmm good!  Home cooking all around with a great husband and wife team that care about the food and their customers."}
{"text":"Best briskit place in Brampton. A hidden gem, great owners, very friendly, they make their food with love."}
{"text":"Ok but not great  I brought a coworker with me from Germany while working the Panam games and we both were disappointed   It was good but the portions were too small  I love the heart and soul that goes into the dish but what happened to needing two hands to be able to eat it?"}
{"text":"We ordered this for the first time today from skip the dishes.  Omg it's amazing.  I had the brisket melt wrap and my boyfriend ordered the Briskit philly melt sandwich.  We shared the Briskit poutine.  Unbelievably good the Briskit was flavourful and tender and juicy.  This will be a defiantly be a place will will order form again!!!"}
{"text":"At first glance you may think this industrial unit restaurant may not be a place you must eat at, but it really is. The owner is passionate about serving good quality food at a good price. The seating is small but that's part of the charm of this place. The menu is huge and amazingly fresh. I love Fridays where they do fish and chips. But their burgers are mouth watering as well. I'm gluten free and they bend over backwards to make sure all their food has gluten free options. The fish is crispy and fresh from the fryer. The onion rings are to kill for. The banquet burger, brisket, and monthly specials are always good enough to make you want to keep coming back. The hours are limited to more of a lunch time crowd so drop by when you're in the area. It's well worth your time and money."}
{"text":"This is a small sandwich shop done right. The Mom and Pop who run the place clearly have a passion for the job and are always extremely friendly and outgoing. The fries, burgers, rings, and their namesake brisket sandwich are all completely homemade, freshly prepared to order. And there's a large variety of options to choose from including all day breakfast and breakfast sandwiches..  A great choice for Brampton"}
{"text":"I was looking for somewhere new to eat during my lunch while I was in Brampton.  I found this place on Yelp and came here as it was only a short distance away.    It's a such a cute little family owned place with incredibly friendly service.  It was super cheap and looks newly renovated.    There was a wide variety of unique options for lunch - both sandwiches and meals.  I was stuffed when I left!    I would come back here for sure."}
{"text":"Needed a quick place to eat close to the airport. Got the Brisket Melt with fries and root beer. Excellently prepared in a very quick manner. Brisket was amazing with perfect proportions of meat, cheese and bun. Fries were perfect and they give you a heaping pile of them so you won't  go hungry. All of that for a reasonable price of $11 something plus tip. Definitely going back next time I fly into Toronto."}
{"text":"I had a great sandwich here yesterday. The nice lady behind the counter offered samples to me when she discovered I was on my maiden visit. I selected the Philly melt brisket for my meal. It was lovely. The fries were good as well. The dining area is efficiently sized. Most of the tables were being used during the lunch hour. There was a sports channel on TV in the corner so we could keep up with our current events.   No doubt I will return to Briskit. There are lots of menu items to try. There are even some specials. I'm only in Brampton a few times each year, but this place hopped to the top of my lunch place list."}
{"text":"So - every now and then, I wander to the big scary 'burbs to pick up office equipment.  Most of these treks suck.  After a long ass drive to the middle of nowhere, shelling out big dough to a 'load-your-heavy-ass-furniture-your-own-damned-self' warehouse, I always try to 'reward' myself with a 'nice' meal - but not *too* nice, since I just spent hundreds or thousands on something for *work*.  Usually, this just means fried chicken or a McDonald's combo - but since I negotiated a 7% discount, I okay with 'splurging' on a $30 meal for my partner-in-crime and I.  We Yelped and found a gluten-free BBQ restaurant in the same industrial park.  I was thinking that this place was going to suck - a GLUTEN-FREE BBQ place in an industrial park serving a captive audience?  But I was too tired and hungry to argue...  But boy, was I wrong.  Sure, the place is small and seats 10 people at most and it's seems to specialize more in take-out/catering.  But the owner/chef instantly greeted us, confirmed that it was our first time there and offered me samples of the pulled pork and the eponymous brisket before I decided.  He recommended some awesome vegetarian options for the lady and we were soon seated and waiting for our order.  The owner/chef clearly has a passion for his craft and dude was a hell of a nice guy as well.  Filling us in on his catering options and his monthly specials (there was an Elvis sandwich with peanut butter and banana).  While the pulled pork sample was good, I had to order the brisket sandwich.  Not only because of the namesake, but because well-prepared brisket is glorious.  The brisket is juicy and tender and had a nice kick from the housemade BBQ sauce on a kaiser roll.  It was a large sandwich for only $7.  I had a bite of the lady's veggie wrap and it had nice hit of curry in it.  The onion rings are housemade as well and the batter was very crunchy and tasty.  I've been served many self-proclaimed 'best' brisket and onion rings before, and some of the finest examples I had was in a takeout joint in a Brampton industrial park.  Go figure.  We left stuffed for ~$25 total - with a belly full of delicious brisket and onion rings, I was almost happy to unload and install my expensive assed office furniture and work afterwards... ALMOST.  But at least I can look forward to coming back here again the next time I'm out in Brampton."}
{"text":"I would have lunch here everyday if it could be within the limits of my daily caloric intake levels.  It's tucked away in a small industrial complex, and it's probably Brampton's best kept secret. They have monthly specials which have a seasonal theme or are just outrageous (beef brisket parfait with mashed potatoes, anyone?).  I stick with the burgers and BBQ sandwiches which come with a large helping of great fries with a combo. The owner/operators are super friendly - the hospitality reminds me of my childhood when I went to other people's houses for dinner as a guest! Go hungry and you won't be disappointed."}
{"text":"One word: AMAZING. The portion sizes are huge, the service is great (cute husband-wife duo), and best of all, the food is amazing!   We ordered the Briskit Melt & Cuban Pork. We shared both and loved each just as much! They cook everything fresh, and it tasted that way too. The meat was tender and perfect, and the cuban pork sandwich had a nice dill taste to it.  We also ordered a poutine on the side and it was HUGE. All in all, great spot with good food. I will be going back again and again."}
{"text":"Who knew a restaurant like this exists in an industrial area in Brampton?  This is a small restaurant specializing in gourmet sandwiches and caters to the lunch crowd for local businesses.  I had the Cubans sandwich and their fried, both of which were delicious.  Not a bad price either, about $10 with a drink.  I saw a few people come and go, all of which were obviously regulars.  I would go here over subway any day of the week!"}
{"text":"I don't even know how to begin with this review. The food first of all, was amazing. It was my first visit and I got the Double \"B\" Burger so I could sample both their burger and their namesake brisket. Amazing. Juicy, tender burger, perfectly cooked. The brisket added some saltiness and a great depth of flavor. And tied together with some good condiments, and held between a soft bun that soaked up some of the juices (the rest of which was on my plate, which is exactly what should happen with a good burger). I've had some damn good burgers in my lifetime but this is up there. It's unique, it's delicious, and I'm salivating now even thinking about it. The whole mess is also quite sizable. I'm a carnivore and a big guy and this burger filled me up quite solidly.  The place itself has a warm atmosphere and you'll feel at home as soon as you're there. This is thanks in large part to the owner, who is really friendly. Most importantly, you can tell he has a real passion for food. This also comes through in the fact that virtually everything they serve, they make in house. They've even got their own hot sauce (delicious, of course).  Needless to say, I'll be back. Often."}
{"text":"Off the beaten path of Queen St or Steeles in Brampton, you will find it on the corner of Rutherford Rd and Orenda by a gas station.  Family owned and operated, we were greeted by the owners and they asked if it was our first time visiting Briskit.  We told them yes and they guided us through their whole menu and answered any questions that they had.  This location was also featuring breakfast menu that the other location did not have.  My wife and I opted for the Breakfast skillet which consisted of potatoes, Slow cooked beef brisket and pulled pork, eggs, cheese, toast, and bbq sauce, my wife had the BLT on a Kaiser with homemade onion rings.  We sat down and the owner brought out a little sample of the brisket and pulled pork in a little ramikin to sample..the smoke flavoring and slow cooking was evident in the meat..very tasty!!  Our meals came up pretty quick and we had a chat with the owner.  The Wilkinson location is well known for its Brisket sandwiches, but it is also well known in the area for its burgers.  The burger menu has about 8-9 different burgers, but they also feature a burger of the month.  This month the burger had Mac and cheese with BBQ sauce on a garlic kaiser.  He told me all the burgers are fresh ground chuck with a little beef brisket mixed in, definitely going to order on my next visit.  Prices are very reasonable and the hospitality and service was good! A great experience with some very tasty food.  I think this is going to be my guilty vice for the while!!"}
{"text":"Stumbling across some reviews for Brampton, Briskit happened to capture my attention.  Gourmet Slow Cooked Sandwiches...mmmm.  When I think slow cooked, I think smoked meat.  Reading the reviews, my gut was right..slow cooked and smoked meat piled upon different methods of food delivery.   I convinced my wife to accompany me on a Sunday morning to the Orenda location.  Briskit has two locations, but the Wilkinson location is only open M-F and the Orenda one is open all week.  It didn't take too much convincing, because they had home made onion rings (her favorite) that they made with a gluten free batter (almost everything I think on the menu is gluten free!!).  Off the beaten path of Queen St or Steeles in Brampton, you will find it on the corner of Rutherford Rd and Orenda by a gas station.  Family owned and operated, we were greeted by the owners and they asked if it was our first time visiting Briskit.  We told them yes and they guided us through their whole menu and answered any questions that they had.  This location was also featuring breakfast menu that the other location did not have.  My wife and I opted for the Breakfast skillet which consisted of potatoes, Slow cooked beef brisket and pulled pork, eggs, cheese, toast, and bbq sauce, my wife had the BLT on a Kaiser with homemade onion rings.  We sat down and the owner brought out a little sample of the brisket and pulled pork in a little ramikin to sample..the smoke flavoring and slow cooking was evident in the meat..very tasty!!  Our meals came up pretty quick and we had a chat with the owner.  The Wilkinson location is well known for its Brisket sandwiches, but it is also well known in the area for its burgers.  The burger menu has about 8-9 different burgers, but they also feature a burger of the month.  This month the burger had Mac and cheese with BBQ sauce on a garlic kaiser.  He told me all the burgers are fresh ground chuck with a little beef brisket mixed in, definitely going to order on my next visit.  Prices are very reasonable and the hospitality and service was good! A great experience with some very tasty food.  I think this is going to be my guilty vice for the while!!"}
{"text":"A mom and pop restaurant hidden in the intestinal commercial  side streets of Brampton. The dinner is not fancy and washrooms are clean.  My peameal sandwich, I had to order an egg to throw on it, and the meal deal added homefries and coffee. The food was good, nothing exceptional, but I'm not sure the price/value is great.  They need to add free WiFi, and offer table side ordering.   Currently you order at the counter, sit, then pay... Cant believe the rest of the menu could change my star rating here."}
{"text":"This hidden gem is one of my new favorite places to eat!  The food is outstanding!  The best brisket I've ever had. It was very flavorful, tender and soft (not rubbery like other places). The handcut fries are so amazing as well.  All their food is freshly handmade with love. The couple who owns the shop were so sweet and welcoming and made sure each and every customer felt welcome and enjoy their meal. I wish every restaurant had this homely feel. I can't wait to go back and try everything else on their menu (which has something for everyone)!"}
{"text":"Honestly the best brisket that I have ever had. There hours aren't the greatest but it is worth making the trip."}
{"text":"I'm not sure how a place called Briskit could be out of brisket, but that they were when we came in for lunch much to our disappointment. I had the pulled pork (actually a \"Double Trouble\" with the brisket replaced by the pulled pork). There wasn't much sauce / flavour to it so after eating a few bites I had to go back and ask for more barbeque sauce (made in house!). I'm also convinced I never go the swiss cheese ... based on other people's picture of it being on top and being able to only see cheddar in my own picture... yeah.  Fries are good and yes, they are quite generous with the portions but I didn't think they were special.  Service is friendly, but the place is very busy during lunch so it was slow.  The wifi password is love5."}
{"text":"Returned today for lunch because of reminder email from Yelp about this spot. Unfortunately I was underwhelmed this visit with the general vibe of the place and the food. Fries were pretty good but I had ordered onion rings? The brisket was bland, not sure what has happened but given it's distant location I will not soon be back."}
{"text":"I loooooovveeee Briskit! LOVE IT!   I don't get the opportunity often, but when I can I will always go for fish and chips friday. As someone who cannot eat gluten, fish and chips becomes a rarity, so it's always nice to find somewhere that does it - and does it right!  The portions are enormous! My fish was longer than the plate! The fries are always very crispy and are cooked in dedicated gfree oil.   The owners are fantastic and also sell gfree buns/biscuits and delicious gfree BBQ sauce.   Give it a shot - and try the onion rings too. You won't regret it (well, your waistband might, but your tastebuds will be happy!)"}
{"text":"Their food has been a huge hit at our office. We used to order subway for training sessions and sales meetings. Since discovering brisket one Friday afternoon - I have been back numerous times and we have had them cater many meetings. Owners are great and are glad to make recommendations. The brisket sandwich is, of course, perfect. Especially with some added fried onions and cheese! The buns are fresh-baked nearby and make for an authentic home cooked taste from bun to meat to toppings. They smoke ribs in the back - fry chicken - whip up some great fries and onion rings.   Sitting in here at lunch hour you see a constant stream of customers from all walks of life with one thing in common - a love for good BBQ. The chef and grill master brings his passion to work everyday - the food is consistently delicious. I see a lot of large orders - especially for catered lunches - being picked up or delivered everyday.   The Brisket team know what they're doing. They've been here 8+ years and have developed a great reputation. If you work in the area - give them a try yourself. If you need catered lunches delivered and work near Dixie/Derry/407 area - I highly recommend their services!"}
{"text":"This is comfort food with the home feel. No one treats you better than Ed and Elaine. When I owned my shop in Brampton this was my everyday place. I think I had my own table! Quality food and always crazy creations by the mad chef himself. This is worth a stop or two a week, or everyday! It definitely is a hidden gem."}
{"text":"This place is a hard to find and you might miss it. Very friendly people I must say. I had the brisket sandwich. It was good but maybe I was expecting more? I will say the sandwich was large and well priced. I want to give it a higher rating. I will have to revisit and give it another shot."}
{"text":"Awesome food. Great value. A little hard to find in an industrial area of town but so worth the trouble.  You will not be disappointed. I will be back here for sure  I had the brisket philly sandwich. So good.  The hand cut fries are very tasty. Not bland like some places. Only needed a touch of salt for my preference."}
{"text":"I had the Briskit and the bread was fresh but the brisket was not much in portion, yet it was still delicious. Sauce was sweet but could of had more of a spice to it. The fries were the best part of the meal because they were freshly cut and made.  I was out seeking some southern food, I would say it's more of a Canadian than a south. The place is clean and had regular traffic."}
