{"text":"Pretty cool place.  A little hole in the wall bar.  Had a fun time with friends but we had to move tables because they were about to start trivia night.  Man those guys take that seriously.  It was packed with trivia people!!!"}
{"text":"I was in town for a wedding and came here for lunch.  I ordered the fish and chips and they came out super hot and super fast.  Really good batter on the fish, like they do in Scotland and the fries were awesome.  Best of all, the bartenders/cooks Mike and Jimmy were awesome and a lot of fun to talk to and very knowledgable on their beers.  Best fish & chips I've had in America. So good."}
{"text":"Fish and Chips anyone? Had that and the quesadilla last night, both were delicious, but i'll admit I feel a little sluggish today. Place was clean, well kept, nice waitress. We went on a quiz or trivia night, so the mood was pretty mello. Tap beers seemed pretty standard for a pub. I will definitely go back for a nightcap as it is an easy walk from my house."}
{"text":"Finding good bar food is like searching for the Holy Grail.  Sure it might be fun and adventurous at times, but too much adventure will probably leave you dead.  In a world of extra greasy food, good bar food usually falls under that category, when it really doesn't have to.  Grease is not a condiment, it never has been.  The more grease, the more you will feel is the next morning, while also nursing a wicked hang over.  In my never ending search and self destructive search for good bar food, I have stumbled upon the British Open in Scottsdale, Arizona.  

The bar itself is a mix of old English Pub, and golfer paradise.  Being that is called the British Open, one of the four golf major championships, I found that it completely fit the bill.  There is a nice size bar, that one can belly up to for a libation or meal, as well as a seating area that is a mix of half booths, and elevated bar tables.  The pool table that is basically in the center is more a waste of space than a commodity to drunken patrons.

To get in the spirit, I choose my next words carefully...Me mate and I found seats at the bar, while our bartender attentively welcomed up.  She asked if we wanted to drink, but being that I wanted to review the food, and not how much I can consume on a Saturday afternoon, I stuck to a Coke.  Actually I asked for a Dr. Pepper, but not too many bars carry that on the bar guns.

The menu is your typical bar food, with a mix of British delicacies (a term I use lightly.)  Wings, burgers, onion rings jumped out at me as I looked over the menu.  Being that I haven't had a good burger in a while, my choice was clear.  Started with an order of hot wings, and then the burger: Medium rare, with bacon...no cheese. 

The wings came out first.  The sauce was very basic and could even be called a little watery.  However, the flavor was not too hot, and had the right amount of pepper.  The wings were deep fried too, with no breading or batter.  We ate them with some joy, as we talked and watched football on one of the many TVs throughout.

The burgers came out soon after, with little wait.  Size wise the plate was just what you needed if you were going to have a beer with your meal.  No so big that you don't want to drink afterwards, but big enough to fill you up.  Cooked to a perfect medium rare, I enjoyed the burger enormously.    The side of fries was also cooked to a perfect golden brown.  And as the bartender kept our drinks full, and checked on us just enough, I can say that I was having a pleasant eating experience.

I do see myself going back to the British Open.  The food was great, with the exception of the wings (it could be a west coast thing) and the food was reasonably priced.  Also, I saw that they have karaoke on Wednesday, and I do like to sing.  Maybe when I come back I will get some beer, do a shot or nine and enjoy a new favorite place to eat, drink and be merry."}
{"text":"This is a quaint little pub with great atmosphere. The beer selection is standard and the food pub-like but I recommend the sweet potato fries. The last time I was there the table next to us was freaking out over the fried pickles so we got an order of our own and they were all right. Definitely a good hangout place!"}
{"text":"I decided on this place as I was looking for a place to try Trivia . And found many more reasons why I had a good time. The place has great energy, very good food, great service ( even though its slow, the trivia distracts you) . The size of the helpings is generous and the prices are reasonable.  I especially recommend the bread pudding. Will have to be back to redeem the slightly poor performance in the Trivia! ;)"}
{"text":"So full disclosure up front. We're Brits born in Liverpool and having lived in America now, for 14 years and 7 in Arizona, we've adjusted over the years to some wonderful food and local southwest delicacies. For my birthday my son invited my wife and I to dinner at an \"authentic\" British Pub. Candidly, I've always felt that word authentic is unnecessary when related to food but we gave the British Open a try. 

The setting location was a little odd as one of the local stored fronts of a small shopping plaza, but it was in keeping with the rest of the stores to maintain the southwest color schemes. Its just not a Pub. 

Inside was dark and i felt the tables had way too much beer residue on them and could have done with some beer mats, which would have been a nice touch. 

The food was okay, and I had Fish and Chips, but they never did the British favorite of mushy peas. ( don't knock them until you've had the real stuff). However the fish was tasty and the batter light and crunchy. My son went for Sausage Rolls and my wife the Cheese and Onion Cornish Pasty. Now my wife has been making delicious Pasties an Sausage Rolls for many years, and we've converted many friends and neighbors, when we offer these for a snack, so we're probably tough to please. The Sausage meat was like a bratwurst which is certainly not traditional. The outer pastry too should have been Puff style as it makes them light and flakey. Pasties were okay, but not much cheese and little onion. No crusty lid either. 

I also took off a star for serving me a Black  and Tan in a Bud Light glass. Surely a little thought about the presentation in a Guinness Glass would have impressed more. Overall it was reasonable food, and hot, but we left disappointed it was not as we imagined. I realize running and operating an English Pub in the desert will have a limited base of customer, and it was good, but not as good as could be in my opinion. 

Pity as we've been searching for a traditional British Pub over here to satisfy our cravings for a decent Pint and some Pub Grub. Thank you to the owners and bar staff for the Birthday Pint. With some improvements we could return and return. 

An honest and forthright review."}
{"text":"This is a place you go when your to lazy or cheap to go elsewhere. Since I live in the neighborhood it's just convenient. It's one of those divey bars that a bunch of regulars hang out at. Never my first choice except the time I came here on St.Patricks Day which was nothing special. Usually come here after drinking at Papago Brewery and just feel like trying something else out. They do have drink specials which are hit or miss. The place is small so not much to do here but drink. The pool table is nearly impossible to play due to location in the middle of tables. Never have tried the food because I'm usually here late. I'm sure I'll be back though and keep going back."}
{"text":"No Yorkshire pudding...NO YORKSHIRE PUDDING?!?!?!

Other than this one serious omission from the menu, the British Open's menu is chock full of great English fare as well as a few tastes from around the world. I've been to B.O. twice now and have had great service and food both times. This last trip I had a nasty head cold so I got a bowl of Green Chile Stew (not something you'd normally expect to find at a British Pub, but I was most glad I did). Well, that green chile did a fantastic job of burning all the crap out of my sinuses and I was able to breath for a good hour afterward (one of many great uses for green chile). We also had the Sausage Rolls which we proceeded to drench with HP Sauce and devour. B.O. also has a great Bread Pudding!

The atmosphere is great, but I did notice one small problem. The place isn't very handicap accessible. There was a woman who came in while we were there who had just had hip-replacement surgery. There was no place she could sit at which she did not have to climb a step and it was obviously very difficult for her. After witnessing this I looked around and realized that there were no tables that would be accessible to someone in a wheelchair."}
{"text":"I love the British Open, we come in every couple weeks or so for a beer or 2 and dinner.  It's nice and dark, comfortable, good crowd.  Lots of variety in the juke box.

The food is delicious, we usually get the cod wrap with mashed potatoes (so good!) and grilled cheese with fries, or fish and chips.  

We always have a good time here, I really dig it.  A+, would recommend."}
{"text":"Have been here many times, but this is my first review. Surprisingly, this review was based on a work lunch I had here a week ago instead of the dozen previous visits I've had. Went on a Thursday at about 2pm and the bartender (Lyndsey) was great. Let us know what was good on the menu and was very attentive. The food was good and timely, and we were well taken care of. The regulars were hanging out and they were funny and added character. Harp on tap always sucks me in. Overall, it was a very enjoyable time, mostly because of the bartender Lyndsey. Mostly because she actually schooled my ex-bartender friend on drinks and their ingredients. I will go back again, no doubt. As a matter of fact, I am going there tomorrow night for a friends birthday party. I'll update this post appropriately after that time. My only reason for not giving this place 5 stars, is their lack of a smoking area/patio. I get that they're in a strip mall and that isn't an option, but as a cigar smoker, it would be nice to relax on a patio and smoke a stogie instead of stepping outs front to sneak a cig for 5 minutes."}
{"text":"Love this place. Excellent beer selection, excellent bar food (I recommend the French dip, the potato skins, the bacon cheeseburger, just about anything). The bartenders are extremely friendly, knowledgable gals. Sports on the TVs, but this place gives off a feel that is completely unlike a sports bar/pub. If you're in the area and want to meet up with an old friend for a chance to reminisce, go here."}
{"text":"So, while searching for day drinking spots on Easter ( too many closed! ) we crawled into this pub.  I'd been here a few times before and few years ago, but never again since.  Had a great time day drinking and playing darts!  All the usual pub fare was there:
Fried foods and so on.....
Decent British beer selection, i.e. Tetley's, Guinness ( Irish, I know ), Smithwyck's ( Irish, I know ) and on...
But, I must say what got me was the great jukebox....WOW!
Styx, new Radiohead, Muse, Massive Attack, Portishead!!!!!
Super impressive....
Go for the beer, stay for the tunes!"}
{"text":"Good food and a friendly atmosphere. A bar for grownups."}
{"text":"My favorite Scottsdale dive bar! Good food, great booze selection and awesome jukebox. A few TVs for watching games too. The bartenders are always very friendly, especially to the regulars. Not sure if they still do it, but their bar trivia night was always a blast too."}
{"text":"1. Beers on tap are European and good: Newcastle, Carlsberg, Guinness etc.
2. Above average to really tasty bar food.
3. A nice quiet place to hang out and talk.
4. Downside, not a good place to watch sports, small poorly positioned televisions."}
{"text":"Had a great time on Friday night.  As my friend and I walked in she said it feels like a great place.  It had a warm and friendly atmosphere.  I don't remember the name of our waitress but she was great. We ordered beer first and I asked the waitress to surprise me with one she likes. That started off the fun.  She chose a very good one first, and an equally good one for the second and last.  My friend and I both had the fish and chips because we thought that would be a good choice for a British pub.  The dinners were very good.  The fish was battered just right, the. Ole slaw was perfect, and the french fries were not overdone. So the first time there was better than I expected and we will come back again and again."}
{"text":"Stopped in to the British Open again last night for a bit of food & a few beers.  Cheese & Onion Pasties & Toad in the Hole paired with Boddington's & Modus Hoperandi.  Great Pairings!  As usual a comfortable atmosphere, good service & always a good time!"}
{"text":"Worst English bar ever the bartender so rude for an English pub there's only 2 English beers available seriously"}
{"text":"I've been coming here for lunch on and off for a year now but had not written a review because like most people I forget. However, I consistently go back for the lunch and have yet to be dissatisfied. Last week I went and they had this grilled pork chop topped with blue cheese and a baked twice potato. It was awesome. I will say from a portion perspective it was great for lunch. The one negative is interior is quite dated and dark. Other then that the staff and owners are friendly and always do there best. See you guys soon BOP!"}
{"text":"This place has the best grilled cheese sandwich I've ever had.  Added tomato, mushroom, and lettuce for the win.  When next I go, I will definitely pay the extra $2 again for the home-cut fries or whatever they're called.  Vegetarian offerings are few--part of the 4 stars--but if you are looking for a decent selection of beer on tap and some delicious, semi-greasy pub food, this place is great.

I went there with two friends who had the fish and chips, which are apparently awesome.  At lunchtime it's pretty quiet, dark, and cool, so it offers a great escape from the hot, summer street.  Our waitress was very attentive and kind."}
{"text":"Stopped by British Open on the way back from the zoo. The food was pretty good and the Guinness was good too. Service was attentive and friendly. It's neat that it does have a pub feel to it. Would come back again."}
{"text":"Haven't eaten here in a while, I'm usually in for drinks.
Had the fish n chips. Not NEARLY as good as they were some years ago. I know they changed recipes. The fries were mushy in a bad way, and the fish pieces (2) needed to be bigger. The fish batter was thin and light, but these weren't even close to authentic British fish n chips. The chips had an \"old oil\" taste. Some people like that, and it's OK when the oil tastes a certain way to make the chips taste a certain way. Served with choice of peas or slaw, and tartar and ketchup. Worth 8 bucks, but not near 11.
I REALLY want to see an authentic British recipe here so the place will be the talk of the town. 

***************************************
The beer on tap is SUPER COLD!!! 
***************************************

ADDENDUM OCTOBER 2012:
A friend bought me some sausage rolls. 
They came out with 2 small containers of hot mustard, which I love. It's not Coleman's but close enough. The rolls contained nice large sausage, but the pastry outer needed to be MUCH thicker to be in proper proportion. Delicious sausage, but more pastry thickness would make them the best in the valley. And not only thick, but fluffy, not dense and dough-ey. Believe it or not, my favorite sausage rolls were the multi-frozen ones from Tesco!!

May 2013:
THEY ARE NOT SAUSAGE ROLLS ANYMORE BUT 4 OR 5 SLICES OF ONE.
THIS MADE ME SO GODDAMN MAD!!!
But since I'm a bit of a regular I'm saying my peace here after not getting much of a response from the staff in person.
7 or 8 bucks for a few mouthfuls??!!
WWWWWWWW
TTTTTTTTTTTT
FFFFFFFFFFFF

You're downgraded to 2 stars.

F
U"}
{"text":"Great dive bar. Big fan of getting away from the Scottsdale standard in old town and mingling with country folk. I love their carpeted floors."}
{"text":"I would give this a better review, except the service lately has been very lousy with only one girl working and she's horrible at serving customers. I sat at a table with a friend for 20 minutes waiting to order, we finally walked up and paid for our drinks and left. Love the atmosphere, just service has been lousy lately."}
{"text":"This place came highly recommended from by genuine Brit father. I thought it was very authentic British. I had the Bangers and Mash. Good stuff. Boddingtons on tap for the win."}
{"text":"I ordered a Jack & Coke, ...they gave me a glass of flat Coke.  nuff said."}
{"text":"We celebrated English New Year's at 5:00 PM at the BOP on Scottsdale Rd. The pub was welcoming, although the waitstaff seemed intimidated, not sure why we were pretty tame. The manager distributed hats and noisemakers had an offical count down to (English Midnight). It was nice to be home by 7:00 PM. The food is typical English food, heavy and greasy. The cheese dip is awful, velveta and soggy pitas,  but sandwiches were good. Nachos really? in England they don't serve nachos."}
{"text":"Had lunch there today. First visit after a long absence. One or two recognizably British items on menu, all the rest pretty much American comfort food. C&W background music, of all things. Said to server: \"This is supposed to a British pub?\" Reply: \"Not really.\" Hmmm. 

Ladywife ordered Cheese&Potato pasty: very large, very good. But no Branston Pickle. I ordered Beef&Guinness Pie: very large, very satisfying. But \"sauteed\" veg were steamed, and mashed potato were born from a not very high quality bag. Doesn't take much to peel and mash a few real potatoes, no? -- but no.  I'm told the Fish&Chips are  excellent; will go back to try them.

Guinness was served with too much fizz, in a dripping glass.  Ladywife had to teach server how to properly pour Guinness on draft. She learned it at the brewery in Dublin. 

Weird little place, kinda fun, food good but not magnificent. Ask for server Bree: bright and sparkly young lady with wicked sense of humor."}
{"text":"Love this place just for the environment and service.  They staff are really friendly and accommodating.  Food isn't great but they do keep the kitchen open till 2 am which is fabulous when you are sitting around drinking."}
{"text":"The concept of a golf themed English pub in the desert is so foreign to me that I just had to come here. I had a Boddington and the jalapeno cheeseburger (cooked traditionally English style). The burger was nothing special. Wouldn't have it again, but would have the onion rings. Holy crappers Batman, are they huge. 

I kinda liked the style the place is set up, and even I am not aspiring to become a regular I will come back here when I need a place to have a beer and a conversation.. and possible some ginormous onion rings. The service is nice enough and the place seem clean. When I was here the clientele make up was of the standard regulars, a Led Zepplin listening couple to my right, and a girls-night-out table with 4 girls further in. The atmosphere was nice. 

Come try this place."}
{"text":"Early evening Sunday, the place had a number of drinkers around the bar.  There wasn't anyone eating at the tables opposite the bar.  Uh-oh......  But I convinced hubby to give it a try.  

We had the fish and chips--I had them fried, he had the fish baked.  Both came with fries which happen to be hand cut fries not the frozen ones.  

My fried fish was really good-- two nice thick, lightly breaded pieces of Cod.  I had to take a little grease from the crust but it wasn't what I would call really greasy.  My dish also came with cole slaw but it had too much mayonnaise to be edible.  
TIP:   Don't know why people think they have to add all the mayonnaise.  If you refrigerate coleslaw with just a little mayo, the cabbage wilts and it is nice and creamy.  I make my own and it is really good...... 
Hubby's baked cod portion was so small that he regretted getting it baked.  While I was crunching on my cod, he was silent and sad.  I offered him some of my cod and after some convincing, he took it.  It's bad when your eating partner is not enjoying his food.  He also asked for sauerkraut instead of the cole slaw because of all the mayonnaise.  Sauerkraut is Sauerkraut.  
The bar tender who also served as a waiter went back and forth between serving drinks and getting us water, food, etc.  He was really nice and attentive.  We really appreciate his service.
All told, I don't think I would come back, but the service was really good and friendly."}
{"text":"Nice little dive bar, cool atmosphere.  Pretty pricy, however domestics aren't too bad.  They have a pool table and the bar tender is pretty cool."}
{"text":"Stopped by for a quick light dinner. Went with a sampler appetizer to get a little taste of everything. Fried pickles (English call it a wally?) Was different but good. Also tried the pasties and it was good. My son loved them! Then he started throwing attitude for no reason so I took him so didn't get to try too much. Will have to come back and try more.

Oh, I believe the owner was sitting at the bar and came by with a slice of watermelon for my son after we ordered. That was cool. :)

Side note: owner reached out through my Yelp check-in via Twitter asking how my experience was. Knowing they care makes me automatically like the place that much more!"}
{"text":"Small pub, but great staff, food and drinks! I've been going to BOP for about a year, and I've never had a poor experience. It also feels like a genuine English pub!"}
{"text":"The food was ok, the prices were exorbitant.  Nothing was great, and especially not worth the price. The waitress/bartender was ditsy and forgetful. I waited ten minutes for a beer I ordered and there was nobody there. My beer was just chillin at the tap where she had poored and forgotten it earlier.  I had to get up from my table to remind her, as she was enthralled in a conversation with some other patrons. Food was nothing I couldn't have made at home, and I got the mac and cheese.  Don't waste your time here, it sucks."}
{"text":"The British Open is our neighborhood bar. No frills dive bar with awesome staff and surprisingly great bar food. Their chicken fingers and sauces are homemade and the Pretzel and Beer cheese hits the spot after a night of drinking!"}
{"text":"huh. i would definitely not call this a \"scottsdale\" type bar with that kind of crowd at all. i don't come often, but whenever i've gone it's been just good ol' beer drinking folk and/or the heavily tattooed crowd, and not skinny emo hipster tattooed... like

good meat and potatoes food, like bangers and mash, and englsih beers on tap like bass and such. service isn't spectacular. come to think of it, this bar is just so-so. i think i want to love it, cause it's a cool little pub, but it's just ok. yeah, you're better off going around the corner to papago."}
{"text":"Gave the fish fry a try and was very happy we did.  The fish was hot and flaky and the hand cut frys are great.  Ryan served us quickly and refilled out drinks promptly, Life is good."}
{"text":"I really dig this place. I came in here had the fish & chips which were great. I also got a Stella on tap which was ice cold. The service was amazing, probably some of the best I've ever had."}
{"text":"It's been 5 years, I guess I should update my BOP review!

Nice range of english & irish beers on tap. They usually have some kind of shot special going on when I'm there. The drinks are a tad pricy for the location, but I go anyway. I think they have PBR cans on special everyday though, not sure. 

Food is pretty great, I like the hot dogs, the fish & chips, and their mac & cheese is really good. For something different and yummy, try the celtic nachos. However I cannot recommend the deep fried pickles, I thought, pickles? deep fried? How could I go wrong? Oh, it was wrong. 

Since the non-smoking laws passed, obviously there are no more issues with the bar being super smoky. however they still have, in the ceiling, what I THINK is a smoke-eater machine? And it scares the LIFE out of me because it makes this crackling-snapping noise really loudly about every 10 minutes or so. It has to be fairly quiet in the bar to hear it. I seriously almost hit the floor the first time I heard it. 

The place definitely attracts the hipsters, but there's also an older crowd of locals and trivia brings in a mixed crowd. Staff is friendly and prompt."}
{"text":"Nice quiet pub atmosphere. We came for the fish and chips! They  were exactly what we're hoping for. Crispy on the outside and flaky on the inside. Good selection of beers. The bartender was quick and friendly. They have a  pooltable and dart board, jukebox also. Lots of TVs to catch the game while you eat. Which made for a nice Sunday even if I didn't win at darts"}
{"text":"I really do enjoy my time every time I come here. This establishment reminds me of being back east, with its ambiance and vibe. I came here last week for my birthday and with good drinks, good food, and good company, I had a blast!! We had the crab dip, fish n chips, and bangers and mash. All of the food was quite delicious! What I like most about the open in the crowd. Yes, it is in Scottsdale, but it's not Scottsdale. The people who come here are down to earth, and not the uppity uptight pretentious people of Scottsdale, which I love. When you're here, you're family and everyone is willing to talk to everyone. And even the waitstaff is friendly and attentive. I wish I could frequent this place more often but I live rather far away. I will never have a problem if a friend suggests coming here for a night of drinking!!"}
{"text":"This is the epitome of dive bar in Scottsdale. The servers are great. The prices are bit steep for this place. Never over crowded and a pretty friendly customer base."}
{"text":"Wow this is a pleasant surprise! I'm part British by birth and spent a few weeks in the UK many moons ago, and I always crave and love a Good Brit pub. I stumbled upon this in Scottsdale as my dad and I were nearby and reviews sounded good. We were a bit afraid that, being Scottsdale, this would be a place where a pint of beer cost you $20 and you had to wear golf clothes to enter; but this is not the case. The atmosphere is cozy and wonderful, televisions everywhere with sports and such, nice bar area, looks like some regulars frequent. This was a Wednesday at lunch time and it wasn't hopping, the bartender tends the bar area and serves as waiter, and he knows his stuff here. My dad and I had salads off the menu (yeah, some Brits we are) he had a wedhe salad and I had something else, I forget the name, but wow, so good! Well priced and TASTY. We had some English Sausage Rolls- the sausage comes from the UK. And it's tender, and unreal, and so, so, good. And a cheese and onion Pastie- which my dad was less enamored by (in comparison to the sausage, wow, that sausage was good) but I enjoyed much more. It grew on him as it got more cheesy.

To top it off we both had a Bread Pudding ($7) and ... was it from England? I don't know. I just know it was massive, it was hot, it was like a bread pudding banana split, and I savored each bite like it was the second coming. Yum. So no beers today, but I'll keep this bar on my return-list. It was my first and only introduction to Scottsdale thus far, and I'm impressed."}
{"text":"Nice neighborhood bar with good food. Ruben has lots of tasty corn beef and good portion. Sweet potato fries are ok, but not outstanding   This is great place for quick lunch. Nice selection of beers. Well worth your  visit. Located on strip mall, easy to find."}
{"text":"Came in today after work and friendly Matt the bartender was spot-on, which had me re-thinking this place. Yes, they are pricey, but damn it all if their pub atmosphere isn't just about perfect. I've tried their grilled cheese sandwich and bread pudding which were remarkable, and they have great beers on tap, so I know I will probably make this place a more regular stop, as it is directly on my way home from work, and I can forgive the initial oversight in my first review.

A great place to chill from the summer heat!"}
{"text":"This is my old digs from my college days and it is still kicking after all these years. They have a great selection of British and Irish beers on tap. The food here is great! I recommend the Basket of English Wallys (must try!!), Fish n Chips, Bangers and Mash, Beef and Guinness Pie or the English Sausage Rolls. It's all good. Also a great place to watch a game or play some darts."}
{"text":"By far my favorite dive in Scottsdale! Morgan and Wendy are the best bartenders in town. If you're in Scottsdale, you've got to try out the BOP!!"}
{"text":"Yeah so I love pubs, especially ones of the British flavor, and we tried this out tonight and it was a pretty good fit for what were looking for...

Prices were reasonable, and as was the service.

I was extra stoked for River Monsters on the T.V. Quiet Riot, Radio Head, the Scorpions, and Motorhead all within a 30 minute period.  Newcastle on tap, and $2 PBR Pints means this place gets extra thumbs up from me.

Fish and Chips, Deep Fried Pickles all great English food, the whole menu looked and smelled good.

Proper Bar sized pool table looked like it was in good condition and seen some use...another good sign.

I do have two chief complaints though (otherwise this place may get five stars)....

They don't play, and didn't even know about the English Premiership league, and as such aired no football (soccer) games....How can you run an English pub without this...I don't know..... 

No taxidermy animal carcass gracing the walls.....again a classic touch that would have gone a long way in my book.

We went on a Thursday and it was pretty busy I'm sure this place get's hopping on the weekend....

A little bit hard to find and a bit of a hole in the wall, this place is for sure going on our regular list."}
{"text":"Hole in the wall bar. Nice mixed crowd. Yummy food..although my drink was wrong, I didn't ask for it to be remade. Service was asi asi. 

Don't sit near bathrooms unless you want to smell sewage."}
{"text":"Keep your expectations low and you can't go wrong with this pub. Don't be put off by the slightly greasy menu with a few items crossed out with sharpie. There are plenty of delicious bar food dishes to choose from. Ignore the fact that the server is wearing an over-sized tank top and her hair looks a bit dirty. She is extremely friendly and will take good care of you. There is live music, and sure, he might be drunk, but he will have you singing along to his version of Tom Petty in no time. And if that isn't enough entertainment for you, they have darts, plenty of TVs, and a pool table, plus, just people watching can keep you laughing and ordering another round for hours."}
{"text":"This was my first pub experience in Scottsdale. A local Geocaching group had their monthly meeting here, and being 2 days into moving from NYC to Scottsdale, I looked to meet like minded folks.

They all extolled the virtues of the pub fare at the British Open, so I took em up on it and ordered an AWESOME french dip. Wow, it was delicious. The au jus was amazing. I chatted up the folks to my left and right and found that one of them was a cook at another local restaurant and said that I had to come back and try their other menu items. That is high honors, in my book so I did indeed come back here a few more times.

Each time tried another hot sandwich offering.  The price, is definitely right.
The only thing preventing me from giving British Open 5 stars is the service.

Its spotty at best. I don't feel that I ever had 4 or 5 star service here, the servers and bartenders need to be more attentive and NOT hang out towards the back of the bar (which is the service area).

If this place remedies this behaviour, then I may change my rating, however we shall soon see...."}
{"text":"A group of friends and I tried it out (was my second time eating here) last week and we ALL got sick. We all had different things, and the food was greasy and gross. I do not recommend this place and I won't be back."}
{"text":"I know my friends like this place.  But to me the service was lazy and veryy slow. Gnats flying all around, and the soda was flat.  The waitress said it wasn't.  No paper towels in the bathroom."}
{"text":"We eat a lot of pub grub and I was really happy with the meal we had at British Open. Visiting from out of town, we were starving and in need of sustenance (and maybe we were having a little culture shock as well). Yelp to the rescue! We stopped in here, and were really glad we did.

The server we had was really friendly and helpful, explained the menu and what she thought was really good, what was popular, etc. We opted for the fish and chips, and also for the hot and spicy beer cheese dip. Mostly we just needed a little pick me up before going to dinner with the folks. Well, we really wound up eating two dinners, because the portions were very very generous here! 

The fish was tender and perfectly cooked, battered to perfection. The chips were hand cut from real potatoes and perfectly done. The cheesy dip was really good. Carby, starchy, yummy, this was hangover food, or \"I just walked around a horse show in the sun for 4 hours\" food, and it set us right up. 

I was really charmed by the atmosphere. We liked it so well we sent our friends there for lunch the next day, and THEY liked it so well they went back for dinner.

Two thumbs up, five stars, we will come back here again when we're in town. It is a go-to kind of place."}
{"text":"I can not believe that a place called the British Open Public did not have the British Open on! The bartender didn't even know what channel it was on. No one else in the pub seemed to care either. CHANGE YOUR NAME IF YOU DON'T EVEN HAVE THE BRITISH OPEN ON! So sad"}
{"text":"I also come here on Tuesday nights for their weekly trivia night! Best time to come and put your brain to work. The place is usually pretty popular for trivia nights but they do take reservations so you can save a space for you and your large group and not have to fight for spots each week or show up super early to save a seat. 

They run happy hour specials during this time to so you won't be breaking the bank if you don't win the trivia prize. They have plenty of good beers to choose from and the food is alright. Not amazing food but it's your typical bar/pub food. Because its so busy on these nights the service can be a bit slow but you have the trivia questions to distract you and plus the staff is so friendly you can't blame them."}
{"text":"You can always count on the British Open Pub as a great place to watch a sports game--you'll always have a TV available.

Maybe it's because it's sandwiched in the Papago Plaza is not always the most happenin' place.

But that doesn't mean you shouldn't give this spot a try. It's golf-themed, which is refreshing in a sea of Irish- and football-themed bars, and it has a large menu of both food and drinks. There are also daily specials in the kitchen.

For my meal, I got a house salad ($5.95) and macaroni and cheese ($3.95), which tasted just fine-nothing phenomenal, but they were pretty good as bar food.

My pal got the English Style Fish and Chips ($10.95), which came with peas-something I'm not used to seeing on many plates these days (thank gosh, because I hate them), but I guess they made the meal more authentically British.

And even though the bar wasn't crowded, the people who were there seemed to be really into watching the game that was on. It's also a family-friendly place, so there were a couple of families in addition to the 20-somethings-which included a big group who brought balloon noisemakers. The spot was proof that your experience is what you make of it, and thankfully for us, it was spirited but not uncomfortably cramped like some of the other places we visited."}
{"text":"I like this bar. My wife and I go for lunch often and are always curious about the daily lunch special. We've never been disappointed with the food or the variety of cold beer on tap. The full bar has a lot to offer as well."}
{"text":"Team trivia night! Mostly empty so we won....finally. 
It's a traditional pub. Guiness included. Mostly heavy British food on the menu. We tried the fish and chips. There was an option to have the fish baked instead of fried. So we asked for that but it still came fried. It was still, of course, very tasty. 

The service was prompt and friendly. A good atmosphere of drinking and relaxing."}
{"text":"I'm still a big fan of the mac n cheese. Quite possibly the best in the Valley! Cheesy enough that you may have to twirl your fork when you grab a bite of the tangy, creamy goodness! 

I like the batter on the fish and chips but found the fish to on the tough side -- not my favorite."}
{"text":"I just found this place so much fun and authentic.  I lived in England for 8 years and this place is exactly what a British Pub is meant to be--dark, good beer, mediocre food and friendly but not too friendly service.  The food is not for the \"True Foods\" Tofu set.  I started with delicious New England Clam Chowder and our table shared some unbelievably good nachos.

Next I had the fish and chips which were perfectly good but not special.  I know people rave about the homemade fries.  Personally, I love how McDonalds, Five Guys, et al do fries and these tasted more like cut potatoes than crispy fries.

Still, the entire experience was so much fun--especially in these hot bright summer days, it's so nice to get a perfect cold beer in a dark place like this.  If you like English pubs this is the place."}
{"text":"Divey pub with a decent atmosphere.  A little too smokey for my taste and the beer selection on tap is nothing to brag about.  The crowd was a combination of skater types and preppy types.  It was interesting but not that exciting."}
{"text":"Only two other groups at the bar and it still took them at least 15 minutes to even acknowledge us. 

Made our drinks wrong and told us we were wrong when we asked them to remake them.

Suppose to be a \"British\" pub yet the entire time we were there only loud country music was played. 

There's dive bars and there's crappy bars. This was the later."}
{"text":"Loved this place! 

I ordered the fish and chips and they live up to the \"raves\" on Yelp!  The batter was not at all over powering and gave just the right bit of crunch.  Loved the hand cut fries as well...doused in some yummy malt vinegar and a big helping of some hard cider...I was happy!"}
{"text":"Come and meet the letter people!  Come and visit the family!  Words are made of letter people!  ABCD follow me ....

Today meet Mr F!

Fried f'ing pickles, finicky friends!  This place can fill your fix of finger foods, especially if you fantasize about f'ing downing forty of this fabulous fare with their fantastic fancy remoulade fixing!  Sure, other food and fun can be found at this foundation, but freakin A, fried fucking pickles are the fundamental reason for frequenting this fencepost.  

Fancy a pint and a footy match?  Fish and fries (fine, chips)?  BOP's got a few of your fantasies covered.  

Its your fault if your feet aren't the first in the queue for this friendly pub.  Four stars!"}
{"text":"Tl;dr-This place rocks!
I come to this bar time and again because of the awesome atmosphere, great service, and delicious menu. 
I hear bands like The Knife & The Xx playing here often.
The happy hour prices are always reasonable and the drinks never disappoint. 
There's Wednesday night Trivia! 
The food is on par with restaurant quality & the menu exceeds \"bar food\" expectations. The pretzel w/soft cheese is [housemade]amazingness.
The service is truly great, I feel as comfortable as a regular there. 
Awesome place!!"}
{"text":"I enjoy \"the BOP\" as my friend calls it on the same level that I enjoy pizza.  It's good, but it's not my desert island bar.  I go here to meet up with friends.  I've never been there on my own because let's face it.  I'm not likely to be caught dead trolling Scottsdale (even non-Scottsdale Scottsdale) by my lonesome.  The atmosphere is cozy and inviting.  Which kinda turns me off. I like my bars a bit seedier.  But if that's your thing then I'm cool with it.  I hear the food is pretty good for English fare, but hey who wants to waste time eating when you could be drinking?"}
{"text":"A lil disappointed with the place. Love the decor but the place was dead, faint music and everyone just seemed out of it and zoned out, some zombie type movie, ya know?

The beer was definitely overpriced, as was their shots. Kinda wish I would have stuck around at Papago Brewery, and not migrated over to this spot. 

The staff of girls working were really cool and pretty upbeat but it could have been my $60 bill i racked up in a matter of an hour/hour and a half tops. 

Again nice staff but poor prices- not sure I'll be back, at least not for the drinks- I still wanna try their food tho."}
{"text":"Many people I work with frequented this place over the years because it is so close to the office. I know that on any given weekday, they are mostly empty. I would think that gives you 364 days out of the year that you can prepare for your biggest day, St Patrick's Day. I've never had such lousy service. The guy who may have been our waiter would disappear and tend bar sometimes. I watched other parties get sat, order, eat, and leave before my order was taken. You may think it's St. Patrick's Day, they are probably slammed, but they had enough space in the tiny pub to have a full drum and pipe band play amongst the tables. There was not more than 50 people in the lunch rush.

The waiter then said our food was given to another table by mistake and they were putting the order in again. The other half of the party had finished their meal already so why even bring it? We were apologized to and thanked for our patience, but clearly this is a low to no tip situation. I was past hangry. My meal was missing some sides and it is a really expensive lunch. $17 for a warm Guinness and Corned Beef and Cabbage that I waited an hour for. I watched people around me finish the meal I had ordered before them.

The waiter thought he had done enough, took my $20 to cover it and assumed the rest was a tip. I asked for my change and he got really offended. He counted it out to me as plainly as he could, just dripping with sarcasm. \"Here. Your change is TWO DOLLARS and SIXTY FIIIVE CENTS.\" He stormed off and saw me pocket it all. No tip for that remark. He makes sure to find me before I leave, pats me on the shoulder and goes \"Thanks, Buddy\". You deserve every bit of that $0, my friend.

The place itself is a bar in a strip mall. It is hardly what I would call a pub."}
{"text":"I will honestly keep coming back here as long as the same owner remains.  He is the nicest person ever!
Every time I've been there he's been around and he is just swell!  Very friendly, great recommendations (on or off the menu) and truly genuine.  

The food is tasty.  Last time I had the macaroni & cheese.  It was simple and f*&%#@$ cheeeeeeeeeeesyyyyyyy.  Heard the wine burger is just divine!!!"}
{"text":"Came to Arizona from South Carolina to see a concert and stopped in here to have a meal. We lived in England for 3 years and let me tell you, this place has some awesome food.  If your ever in the area stope here for phenomenal food!!!"}
{"text":"Love going to pub quiz here on Tuesday nights. Good atmosphere. Food is average. My most repeated order is the fish sandwich, it's the best thing I have had there. I would stay away from the salads, pretty disappointing.  The mac and cheese is good, nice kick to it. Service ranges from decent to atrocious, but I do go at probably the busiest time for them, so I try to cut them some slack. They do have a couple of small TVs but it's not the kind of place I would go to watch a big game."}
{"text":"Yeah...


Overpriced, greasy, and not really that British.

However, they have AMAZING Bread Pudding.

Simply incredible bread pudding.


A more detailed review...

Beer was way too expensive, service was slow, even for sitting at the bar, the fish fell apart, fries were cold and lumpy ( were not CHIPS), NO FULLERS.

The good? The relish served with the Ploughmans, and the bread pudding was amazing, warm, served with fresh nutmeg, awesome custard.

However, in the end, that's the only reason why this place gets a star.

Avoid this, pay less and get better food in Tempe, at Rula."}
{"text":"Intimate bar with a great pool table and attentive staff. Food was average for a bar. Would go back, just because service was awesome."}
{"text":"Ahhhh yes. The British Open Pub or the BOP as I lovingly call it. This is a frequent lunchtime spot during the work week. Without knowing specifically where it was, you might drive right past it too. 

The atmosphere is my favorite part of the BOP. It's usually a very relaxing place to be at lunch. I have never been there any other time, so I'm not sure if this always holds true. However, despite it typically being quiet at lunch, the service is usually pretty slow. I typically have to plan on a longer lunch than normal.

The beer selection is pretty good. I can always count on being able to have a Boddington's or a black velvet. As far as the food goes, it's pretty good, but not overly British and a little on the greasy side. 

I've noticed a few spelling errors on their menus from time to time too, which always annoys me.

Overall the food isn't the best and the service is slow but it's still an okay place to visit."}
{"text":"Cheeeeeeeeeeeeeeeeeeeeeeese!!!!!!!!!!!!!!!!!!  Get the English Sausage Rolls and side of cheese! Too die for! 

I'm hesitant to give it 5 stars for fear that word will get out about the gem of a dive bar. I've never been disappointed by any of the food or drinks we've gotten there. We go regularly for happy hour or late night hangouts. The bartenders are always friendly and they work hard to earn those tips for sure. It's never very crowded and the regulars are a hoot."}
{"text":"BOP is a stone's throw from my place.The atmosphere is relaxed(a little too relaxed) for my liking but i do go here for the food especially their signature Fish and Chips (Atlantic cod batter fried) served with hand cut fries and slaw.
They also serve a mean chicken sandwich with mushrooms,jalapenos,chili,grilled onions and BBQ sauce.you can also ask for some onions and tomatoes on the side.

They stay open until 2:00 am and have a pool table and darts.The service is friendly and the place is mostly filled with regulars.The crowd is mixed and it does get a bit loud sometimes.  

I would recommend coming here on a pub crawl kind of night when one is too tipsy to mind the service and the crowd.

Cheers!"}
{"text":"We loved the food here so much we came back three nights in a row, and that has never happened. This may be a pub, but they're not serving bar food. What you get instead is freshly-made, home cooked ingredients turned into flawlessly executed meals.

The first night we were here, I ordered the fish and chips sans chips because I'm trying to make good choices (that's as fun as it sounds :-/ ). 

To my surprise, in lieu of fries I received an extra large, perfectly fried piece of flaky, warm cod -- given the high quality of the fish, the price can only be described as value exemplified by food. Every piece was wrapped in a golden brown delish crispy crust and not greasy at all. 

The Hubby ordered the rolled sausage pasties and -- I say this as a fairly serioous amateur bread baker -- the puff pastry was incredible, matched only by the very well-seasoned meat. There was no gooey rim between the pastry and meat and the meat was not greasy and all flavor, and I mean more than salt. 

Night 2: Clam chowder and the Maple pecan bacon burger. 

The clam chowder was creamy with enough celery and parsely to keep it from being too heavy. The cup I had boasted  good balance of meaty clam chunks with diced potatoes, but unlike most clam chowders, they weren't used as filler. There was plenty of actual clam meat, which my fellow chowdah afficianados will appreciate.

I like my burgers assertively hugged by char and more towards well done on the inside, which generally means I get a hockey puck. But here, for the first time in years, I received an actual, honest-to-goodness well done patty that still had every delicious drop of flavor. It was topped with a sweet/salty relish of maple bacon that gave the entire burger a delightful light note and worked as a perfect counterpoint to the generous portion of meat. 

With a Herculean effort, I once again skipped fries, or any sides. 

This burger was so incredible, I didn't even care. 

Night 3: Finally -- cheat day!!! Ordered the Guiness Beef and Mushroom pie. 

If this meal were expressed in music, it could only be Charles Ives' The Universe (or Ode to Joy). The vegetables -- cabbage, carrots -- were actually crisp tender and seasoned. With actual salt. Which never happens. The mashed potatoes were fluffy enough to fork sculpt into fun shapes but not dry, and again seasoned well with parsley. 

But the pie. Oh my goodness the pie. The meat chunks were large but not stupid and swimming in a thick, hearty gravy, all tucked in beneath that incredible puff pastry. 

If you're a food snob and/or professional fat kid like me, come here. If you enjoy, you know, food, come here. 

Come here even if you don't -- this is a great place with a nice vibe. Congenially full but not too crowded and friendly, excellent service. 

Bonus: Kitchen is actually open late, until 11 p.m."}
{"text":"We had a group of 10 people go there prior to a function that we were attending. The waitstaff was wonderful. The food ( many different selections) was prepared very good well for everyone.  The place is a little dated but clean. The only reason that I cannot make it a five star is because of the music. Rap and I don't get along.  Go and enjoy"}
{"text":"BOP is a Monday night tradition for me. Great atmosphere. Amazing service (especially from Wendy). And the rotating menu makes me excited to come back. I always feel welcomed by whoever is behind the bar. And, the bar isn't littered with college hipsters or sports fanatics, despite it's vicinity to ASU. Sometimes I feel like BOP is Tempe's best kept secret."}
{"text":"Ok, who told me to get their Cottage Pie???(i think that is what is was called)  It was their version of Shepard's Pie.  I am going to be very blunt about this...it was the most disgusting thing I ever put in my mouth.  And I blame it all on that stuff they called gravy.  And there little side salad or cabbage that they had...was I supposed to eat that?  

Anyway, why I gave the BOP three stars is not because of their stellar service (which didn't exist) and definitely not for the food that I had there...I gave it three stars because I loved the atmosphere.  I love pubs like this: dark, a little dirty, a cheesy pool table, awesome music...it was a place where I knew I could feel comfortable all the time.  Next time, I may just get a drink...."}
{"text":"Great food and even better service the bartenders are attentive and accommodating !!!!!! I love the fried pickles and the burgers are the best in town!!!!!! It's the best dive bar in Scottsdale!"}
{"text":"I'm a big fan of this place after one of my buddies recommended it years ago. It's a little out of the way for me, but I usually find my way there at least once every two months for a Friday lunch.

Great atmosphere - a real nice pub, complete with jukebox, dartboard and a lot of really good beers to pick from.

All the burgers here are good, but my favorite is the Mulligan burger with American cheese. The ground beef is fresh and they will cook your burger to order based on your own personal preference.

The club sandwich or BLT are also good choices here if you like either of them.

This place may have one of the best appetizers I have ever had - the English beer cheese dip. It's essentially a spicy dipping sauce made with beer, cheddar cheese and red chili peppers served with freshly made pub chips.

They also now serve gigantic German-style pretzels with dipping cheese, as well. Not the healthiest choice - but who ever said pub food was good for you.

Check this place out for something different than the usual neighborhood bar, but be warned - when the World Cup is being televised, this place draws big crowds and is understandably busy."}
{"text":"Always great service and friendly staff. The clam chowder is awesome and so is the house salad with balsamic vinaigrette dressing made in house."}
{"text":"I'm writing an update because I came for Trivia Night last night and had a BLAST!!!!!!!!! Every seat in the house was full, but the service was on spot and the vibe was killer.. 

I also found that that they have quite a few flavored vodkas, including pomegranate, so I was excited to try something new.

Again, the Mac and Cheese was SO good... I had two bowls. That's right, TWO bowls. What a pig. 

I think I will become a Tuesday night regular!"}
{"text":"I love BOP... Mostly for the food. I love eating here - it's slightly better than bar food and totally delicious... I've only felt ill after eating here a few times, but I can't necessarily blame the food for sure. I eat here regularly. Easily the best pub food around.

They took out one of the pool tables and gave it a recent coat of paint. It looks nice in there, but it won't really impress your friends. The bench seat cushions are blown out and some things about this place are starting to show signs of age. 

There are always a lot of regulars there, but they won't bite. They are always friendly and like to strike up random conversations with strangers - the staff is super nice as well. The crowd there has filled the digital downloading jukebox with good tunes so there's a good selection of inexpensive songs and there's typically something either really good or really odd playing.. 

There is usually sports (soccer) or news or adult swim on the televisions, but they'll probably put it to whatever you like. It's a really low-key bar. Don't go here if you want to impress someone with your new $200 designer shirt. I think if this place starts getting packed with a shit crowd, it won't be as worth going.

It's not the most british joint in the valley and the drinks aren't super cheap, but it's so inviting when you don't feel like dealing with the cramped space of TT Roadhouse or you want some grub. Plus, they carry Diet 7-up - nobody else really does that. Just don't tell anyone else they have it because that's what I drink when I go there."}
{"text":"If you are going out for beer than Papago Brewing in the same strip mall is a much better choice. But if you are looking for a true bar with liquor and beer than the British Open certainly qualifies.  Not a huge fan of the food with the exception of the fried pickles. Typical greasy pub fare. Darts and pool tables and a good juke box. Service is usually pretty good every time I've been in there.  Very dark and very much a neighborhood bar."}
{"text":"We tried this for lunch while visiting Scottsdale.  Nice enough Pub and our server was Friendly.  Unfortunately our overall service was super slow, and some of our food was cold.  It was a good hour from the time we arrived until we got our food, with only 2 tables dining, this is unacceptable..

This place has potential but needs to execute better."}
{"text":"Numerous friends and I have come here for on multiple occasions. We usually have a wonderful waitress who is attentive. However, tonight we had a different waitress and waiter who were rude and had slow service. We split the large check as asks and when returned were told to be familiarized with an ATM. They were very rude and took forever."}
{"text":"\"He is 175 yards from the hole, I think he will use a 6 iron\" WAAAAACCCK....\"it's in the hole, it's in the hole!\" 

Yeah, yeah, golf is not my bag, but pubs and drinking are! Now this Pub was recently remodeled according to my newly found tourer de force friend. Now I say this because he seemed to have a lot of knowledge of the Non-Douche Areas of Scottsdale, and surprisingly there are a lot of nooks and crannies in Scottsdale that lack Douche-ness. So going here with a 4 some, 2 guys and 2 gals, was a good pairing, I can drive the ball, my date can putt, if I get stuck in a sand trap, she just happens to have a \"sand wedge\" in her back pocket.  The key to this place is going with the right people. It is set up to encourage talking, and not TV watching, or staring at the crowd. So pick your party of players carefully, and bring an extra bag of naked lady tees, you 'll need them. Overall this place is very cool, and chill. Speaking of chill they had 2 girls handing out Miller Lite Chill beer for free. I am not sure this is the Chill crowd, but they had lime green dresses on, low cut, and skimpy, so I am sure they made some chill friends. The best thing about this place is the discreteness, it's located in a somewhat boring plaza, where everything seems to be named simply for what they sell \"Sub Shop\" \"Pizza\", or \"Korean Restaurant\" The outside of The BOP, doesn't do the interior justice. It feels very pub friendly, warm, and cozy. It's a perfect place for a pint  or FOUR and conversation. Also, the remodeling was done in early 90's pub decor with a splash of 70's retro, so don't be afraid it's sold out. Just go check it out and enjoy. When you're done feel free to peruse the shops of Papago Plaza, Checkout \"Just Shoes\", or \"Liquor Store, or even \"Haircuts\" It will give you something else to Yelp about."}
{"text":"Looking for a super chill spot in Scottsdale. Tucked away in the corner of Papago Plaza Next to Mikas Greek is where you'll find sweet spirits, good beers and delicious English grub. Sometimes lucky enough to catch the owner enjoying his own business. Love this place. Check it out!! BRITISH OPEN PUB"}
{"text":"Finally got down here to meet up with my girl and some of her pals (they come here all the time)... The drinks seemed reasonable. I didn't eat myself, but I saw a wide range of food at our table: salads, shepherds pie, pretzels and dip. Everything looked pretty good. They also have a couple pool tables, a jukebox, a long bar, and plenty of tables. 

Overall a nice, dark, dive bar with good grub."}
{"text":"Occasionally I get a craving for fish and chips must be the English blood in me.  I have yet to find a good fish and chips restaurant but this place did not disappoint.  Me and my wife both had the fish and chips. They weren't served in the tradition newspaper wrapping but still very good.  Definitely coming back next time I get the craving.  Service was excellent and very quick.  I loved the dive bar atmosphere and felt very comfortable."}
{"text":"Solid beer selection to represent a British pub theme.

Food is also above average with classic British pub offerings. 

Service has also been very pleasant during my visits.

The main factor for the 2 star rating is because I'm forced to sit here and listen to awful Jason derulo songs on the juke box because their touchtunes doesn't have the feature that allows me to pay extra to play a song next. Poverty juke box features FTL"}
{"text":"I had a really really great time here. We were seeing a show a couple stores down at Chyro Arts. All of us went in there and got beer and snacks. The sweet potato fries were excellent. I had them mix BBQ sauce and ranch together. it was a hit. All my friends loved it. Great bar food, great staff, and GREAT music was playing. No complaints!"}
{"text":"This place is pretty cool. Yet I have some dislikes.
It took us 15 minutes after sitting at the bar for the bartender to ask if we wanted something to drink (2 occasions) .....and they werent busy, but you could tell they had relationships with the regulars which as taking precedence over someone who just stepped in the bar. After asking what the happy hour was.... (which is all day on Tuesdays) we decided to just order a beer on draft. Even though we later discovered the deals were poorly explained by the servers/bartenders and better explained by the fellow regulars.
We decided to order food before the fact,  my boyfriend got the hot wings and they were terrible. Incredibly dry, had black burn marks from the stove/bbq that was obviously heated too high before cooking them. They had very little sauce and were overly unimpressive. Flavorless and crunchy, yes, crunchy. 
WingStop blows these people out of the water, sadly.... 
even though this place is labeled as \"pub\" food. I would suggest they remove these off their menu. just to continue their business. 

one REALLY good food, the only one i liked, was their mac'n'cheese. Its not for the faint of heart though. You have to love some SERIOUS cheese, which i do. I was full after half a serving. I would get this to go if I could, but, not going to sit at the bar for 30  minutes for someone to bring me a menu for takeout. (The people behind me complained of that 30 minute wait time....) while i sat waiting for someone to order my beer, 25 minutes after giving menus, when I specifically stated beer was the only thing I'd be ordering from the bar. 

Service needs severe work. Yet they seemed to have a few regulars who seemed to fawn over the bartenders.... asking them to try on their sunglasses and give them hugs across the bar. I've worked in a bartending community, just because 2/45 of your customers are trying to screw you and give you $50 tips on a $10 dollar tab does not make you a good bartender. It makes you an inattentive flirt, focusing your attention on creeps and actively choosing to ignore everyone else. Ive had to on (3 different occasions) throw my hand in the air like an elementary school student, to get someones attention. and it wasn't immediate either. more-so a mild workout. 


I only come here for trivia night (Tuesdays you can win a $30,$20,$10 gift card), because i feel like the terrible service and basic drink specials aren't worth the wait. 
Plenty of other places in the area to direct your hard earned money towards.
Sorry guys, yet, not really sorry. 
Basic. 


Go somewhere worth your money. This has just been consistently disappointing."}
{"text":"I was here for an early dinner on NYE because Papago closed at 6pm.  It appears we got there just after a big crowd left...the bar had just celebrated New Years in England, so the place had pretty much cleared out.  The service was pretty slow, and I wasn't really impressed by the beer list.  The menu was decent, nothing to write home about.  The food seemed a little bit pricey.  I will never figure out why places charge extra for sweet potatoe fries.

Anyhow, overall it was a good spot.  Next time I am in Phoenix, it's likely I'll drop in.  My friend lives just around the corner.  :)"}
{"text":"Pipp Pipp Cheery-o ! It's a British Pub in Scottsdale! No, it's not RUBBISH! It's True! 
We went to this little gem and it really did reminded me of a pub in London, very cool. 

They had a great selection of beer, but they also have and amazing selection of vodka! All the Three Olives, except Mango, but who drinks that! STOLI galore and much much more! 

The place has a really laid back feel - I think it would be an amazing Happy Hour location! I didn't get to sample the food - but I saw some sliders go by that looked to die for! 

Definitely a place to check out!"}
{"text":"My wife and i came in for lunch on a Friday afternoon. There were six people in the bar. The service was very slow. It took over 15 min to get a beer

I had the fish and chips. The fish came out very soggy and chips were soggy as well.  

My wife had the cottage pie. This came very dry as well. There was no gravy at all

Overall i dont think we will be back here any time soo"}
{"text":"Came here two nights in a row while staying at the best western Papago. We went the first night because it was within five minutes walking distance. Came back the second night because we had a good time the first night. Clean, friendly, relaxed place. Cheap beer and drinks, and really good food. Had the mulligan burger, grilled cheese and Mac and cheese and all of them we would definitely have again. The music playing was pretty varied ( ranging from Katy perry to mindless self indulgence) but i think it may have been a juke box. Overall, great convenient little pub to relax at."}
{"text":"First impressions aren't everything. So, I feel entirely justified re-Yelping the British Open after having been here three times. Sometimes you need repeat outings to really get the full \"feel\" of a place, right? 

MY FIRST TIME:
The crowd was mixed. You could easily find yourself face-to-face with \"creepy old guy\" when you first walk in. At least I did. But, he's not \"stalker creepy guy\" so it's okay. I can deal with that. Apparently it's okay to have a baby in the bar, too. Startin' 'em young, I tell ya. 

On the jukebox: The Black Keys, Wilco, Freeze Pop, Sarah McLachlan.

The beer menu offered selections from various countries. Nothing on tap appealed to me, so I went with the Sam Smith's Nut Brown. Very good. I had never had it before. That is probably my beer of choice at the British Open. I'd like to try the Oatmeal Stout, too. 

I don't think I'd go out of my way to frequent the B.O. Pub. It's in an obscure and generic retail plaza. That doesn't bother me so much as the \"mediocre\" vibe I got while sitting at the table. I guess the British Open and myself just didn't \"click.\" That's okay. Not every bar and myself can have that special kind of chemistry. It's an organic thing, I tell ya. It's Pub Kismet. 

* * *

SECOND HELPINGS:
(summary)

I sat at the bar this time. The service was faster. I perused the menu with my date and our friend. My date and I sampled a couple beers. I had the Whitbread Ale. It was okay. But... alas... COULD IT BE? Yes. It was Love At First Sip when I tried the Heather Ale from Scotland. This ale is aromatic and is made with lavender. Uhm, could you want anything else? I savored every sip and made the declaration that I love this pub for this ale alone -- and that I don't know if I can get this anywhere else. 

While at the bar, we got \"troubled\" to sign a petition to make St. Pat's Day a national holiday. For handing over our hancocks, we got free pins and pens. Nice. 

***

ST. PATRICK'S DAY:
(a short story of celebration)

As luck would have (luck of the Irish?), my friend and I touched on the British, Scottish and Irish in an hour's time - not to mention grabbed the last table when we walked in shortly after 5 p.m. 

We came to the BritOpen, for I wanted my friend to try the Heather Ale, and I selfishly wanted to be part of a celebration at what could pass as a St. Patrick's Day-friendly establishment. So, we sat among other St. Pat's fans, while we drank one of the best ales either of us has ever had. We got asked if we wanted to order a Killian's, since they were $2 and you'd get a free shot glass with your order. Plus a bag of malts to try. Interesting. After the Heather Ale, my friend ordered a Killian's at the bar, where they weren't handing out the freebies. Bummer. We did manage to track down a couple free shot glass - for what it's worth. 

We were about to leave when the Irish music stopped. We turned and saw a \"band\" of bagpipers and drummers and the like start playing outside the pub, framed in the open doorway. Then they walked through the crowd to stand near the jukebox/TV screen to play some songs. It was incredible! My friend said, \"I feel like my homeland is calling.\" She is, after all, a beautiful Scottish lass. 

After their rendition of \"Amazing Grace,\" we made our subtle exit. That's when I knew I had to re-Yelp this place. After all, bagpipes? Heather Ale? Good prices? Close to work and where I live?

Yeah, I will definitely be hanging out here again...and again... and again!

***
BEWARE: Their Sampler Plate is NASTY, with just a pinch of \"meh.\" The pickles who WHOLE, not cut into chips, like the menu implies. The duck is inedible. Ick. The cod bites were the only decent things on the platter. I did enjoy the tarter sauce!"}
{"text":"I went in here recently on trivia night by myself thinking I'd have a bite to eat. I sat at the bar and was surrounded by some strange clientele with some vulgar conversation. I think the place is great but they're catering to the wrong sorts of customers it seems. If you're with a group, it might be more pleasant but wouldn't recommend visiting solo (as I don't intend to anymore)."}
{"text":"This isn't really a British place, by any reasonable account. Normally such places have a lot of atmosphere & beer offerings are skewed towards things British, but here it is virtually like any other bar. There's a few golf items here and there, and the menu is golf themed, but it's pretty much just an ordinary bar.

Guiness, Bass, Stella Artois, Hoegaarden, Weihenstephan, Newcastle, Smithwicks, a cider and others make the lineup of taps. No Fuller's, no Whitbread, not much at all that you would expect to find in a British themed place.

Fried food options basically, and it sets the aroma of the place as well."}
{"text":"I've been here a few times for beers and to hang out with friends.  I decided to be adventurous this past weekend and try the food.  Big mistake.  I got the nachos, which was nothing more than chips and nacho cheese sauce like you get at a ball game.  Runny cheese at that.  But on the bright side, my friend got the fish and chips, and they were very good.  Although why I thought that there will be good food at a British pub is beyond me...

Service has been hit or miss, and this time it was a big hit.  A waitress that came around often always checking up on us, which was nice since the place was pretty busy.  Plenty of varieties of beer to chose from, mainly your British and Irish varieties, but a few local microbrews thrown in for good measure.

The place has a nice crowd, mostly your somewhat funky types thrown in with a mix of your laid back Scottsdale type.  There are a few TVs in there (only one big one) showing the game and the alternative X-games stuff you find on Fuel TV.  They also have a small pool table crammed in amongst the tables, making it a little tough to play, and a Golden Tee machine.  All and all, great place for beers and hanging out, not the best place for a meal."}
