{"text":"HORRIBLE PIZZA!!!! The WORST pizza I have ever had! I'm sorry I wasted over $20!!!! The BBQ chicken pizza was literally just BBQ sauce and chicken where the heck was the red onions and mozorella! That's what I was expecting. That pizza tastes horrible and the crust was horrible too! Pizza Hut or Dominoes would have tasted better and their pizza is utter garbage! This nasty pizza is going in the trash. I would have given zero stars if I could have! On top of that the delivery driver was 25 freakin minutes late! I shouldn't have given her a tip at all! I will NEVER order from this place ever again!"}
{"text":"These guys are on top of their pizza game. It is also one of the better cheese steak you'll get south of Philly. Place is always spotless and the sanitation score is 100 or over (bonus points). The owners make you feel at home too. Good time and Good food. What else does one need!?"}
{"text":"Great pizza.  Great guys that work there.  This place is just up the street from where I work and I love coming here when I get a chance.  The owners are great sort of gruff guys who are extremely friendly.  If you come there enough they definitely keep up with who you are and they'll talk with you when you come in.  The pasta and other non-pizza dishes are great too.  It's a nice, little restaurant that I recommend when I can."}
{"text":"Da pizza es magnifico! Whether it's by the slice or the whole pie, definitely my go-to when I'm craving some New York style pizza."}
{"text":"Not only is this the pizza in Charlotte, it's the best pizza south of NY!  I stop here every time I'm in concord."}
{"text":"I know pizza, try all local places when on the road and this place is my new favorite for North Carolina. The papa pie, knots and salad is what we had 4 days ago and it was SO delicious that we are already headed back for more!"}
{"text":"Great pizza for great prices best pizza in town! my family and I go here at least once a week. Never had a bad slice of pizza from them. The staff is great also they are always friendly"}
{"text":"This place has ruined me! I can no longer go to Pizza Hut or Dominos. Nothing but Brooklyn's will do!"}
{"text":"Brooklyn's was the first REAL pizza place in Cabarrus County and is still about as good as it gets.  The owners are in there all the time, which means everything will be done and done well.  Service is quick.  Like the TV show, Cheers, it's a place where you feel like \"everybody knows your name.\"  The pizza is like the Long Island kind that I grew up eating.  It's so good that my mouth is watering just imagining those works of art that Richie and Eddie pull out of that oven.  If you want to try a real N.Y. pie, head east on Hwy 49, get off on 601 south, and pull into the Food Lion plaza.  You will not be sorry."}
{"text":"Really good pizza! Owner is fantastic and Super Nice to everyone! Knows me by name! Haven't been in a while but I still love it!!!"}
{"text":"Thank you for making the best in town! This is the ONLY place my family orders from, but we will be keeping it strictly to go for a while. I have to say the servers need some work. We waited a long time to be noticed and one order came out 15 minutes before the other."}
{"text":"If your looking for a great neighborhood Pizzeria this is the place. Great service, Friendly staff, and real nice owners that also work the counter.  I would recommend this place to everyone I know.  They have everything from pizza to subs."}
{"text":"Best eggplant parmesan in the south. Loved the beer batters mushrooms.. Actually it's all good eats... Great NYC atmosphere..."}
{"text":"Truly a Gem....... Always a great experience, awesome atmosphere and amazing food.  Being originally from Brooklyn, NY and I must say best pizza in town and haven't had others that are better or come close carrying the N.Y. name in front of it here in NC.   Keep up the good work and don't cut corners at all to keep that authentic N Y. Taste.   Brooklyn Stand Up!!   Larry P. Brooklynite...."}
{"text":"I wanted to like this place since we have limited options around Concord. This is the kind of pizza that tastes like they put cheddar cheese on it, while I'm pretty sure there isn't any cheddar cheese on it. Crust has no puff in it. I love pizza doughs that are light and airy- You won't find that here. For folks that look for menu prices online, be advised, the menus online are old. If I remember correctly, 18\" pizza was $12.99, toppings were $2. The 18\" pizza after tax was just about $18. Wings are $7.99 an order."}
{"text":"My partner and I wanted pizza, good pizza, and are familiar with New York quality so national chains i.e. Papa John's wouldn't suffice. We did a google search and found this place. Definitely worth the 12 minute drive from Kannapolis. Large slices, fresh spices, tasty sauce. We had a cheese pizza, fried pickles, and zeppoli.  Try it, if you know good pizza you'll be pleased."}
{"text":"Ordered a pepperoni pizza with half sausage.  Got a cheese pizza, half sausage.  Crust was chewy at best, and very rubbery at times. Toppings were OK, but not great.  This was our first and last order."}
{"text":"Great food, friendly staff. About the best NY style pizza you can get in the local area. Eddie and Ritchie really make this place a good family neighborhood pizzeria - it reminds me very much of the kind of local pizzerias you would find in the late 70s on Long Island"}
{"text":"Best pizza in Concord.  The wings are also fantastic.  If you like hot, then get an order of wings with \"Eddie's Hot\" sauce.  You want be disappointed (warning, not for wimps that don't like spice)"}
{"text":"Love this place!  One of the only places I can eat since I am on a strict wheat- free diet.  They are truly sensitive to that and have a great gluten free pizza!!  Thanks Brooklyns!!"}
{"text":"The pizza is so good. Here are some pros and cons  Pros + Food is delicious. From the pizza to the anti pasta salad + They are very friendly + Atmosphere is great, though limited sitting + Take out pizza is sooooo good. Bring it home and serve. So yummy  Cons - Sometimes too busy!!! - Seating is a bit uncomfortable. - Food sometimes not made right.  Neutral * Pricing is high compared to main chains, but this is not crappy food. This is awesome food.  I would definitly recommend this place. Any time I can find a reason,  company, party, painting, or whatever, I get brooklyn's pizza!!!!  Edit: I had Brooklyn's pizza so many times now. Most of the times it is amazing, but I have had some bad experiences here. One time the wings all looked like someone took a bite out of them. Another time my pizza had very little cheese. Still recommend, just check your food before you leave."}
{"text":"When they first opened years ago,they were really good. The last pizza I got looked like it was dropped on the floor, and my sub had no meat. I returned both to them, and had them make new ones. I wouldn't bother if I were you. ."}
{"text":"We moved here in May 2013. We were out and about when my SO stated that he wanted a meatball sub. He's Italian and from the Italian part of town in Des Moines, IA. I know, you don't expect Iowa to have an Italian population, but they do...and a rather large one, surprisingly.  I'm from Mt. Holly and the only true Italian place I could remember was Angie's from Gastonia. I did a quick search and found out that Angie's had burned down and never reopened. It's been 18 some odd years...give me a break. :). I told my SO that he was now in the South and that he might be hard pressed to find real Italian food. It took us nearly three years to find a good place in San Antonio.  Anyways, I did a search and came up with the standard disgusting popular chains. Then I found Garofalo's...Garafinos..whatever the place on 29 is. We stopped in, my SO looked around and walked out. He can spot a frozen, reheated meatball a mile away.  Everything in Charlotte was too far for the risk. Back to another search....Brooklyn's Pizzeria. I called, asked if they had meatball subs, was told they did, and told my SO.  We walked in and I knew we had hit the jackpot. The owner was loudly giving a regular a hard time (all in good fun), the customers were laughing and the local LEOs were getting their grub on.  We ordered a meatball sub and a sausage & pepperoni pie to go. We rarely eat at whatever place we go to. Got home, opened everything up, and I knew my SO was in heaven by the look on his face. Real, homemade meatballs....  He devoured his sub, looked at me and said, \"This is my new favorite place. I'd never expect to find a true piece of Italian in a little place like Concord.\" Yea, neither did I.  We are there at least once a month or more, if possible. Go there enough and you become like family. It's the Italian version of Cheers."}
{"text":"It's October 28th and I just ordered a Large Brooklyn Special and 20 wings. It was scheduled for delivery 45 to an hour from the time I ordered on Yelp.   The door bell rang 30 minutes later. The pizza and wings were delicious! I  will continue to purchase pizza and wings from Brooklyn's Pizza and tell my neighbors too!"}
{"text":"Truly the worst pizza you can find. Very disappointed that my fellow yelpers rated this place so highly. If you see positive reviews they are from people who don't know pizza. Ordered cheese pizza which tasted chewy and they put seasoning/pepper on it (gross!)  Also ordered garlic knots which were just terrible, they had NO garlic and were tough like rubber. They told me the knots are freshly made but tasted and looked frozen.   On top of that it's a wannabe bar nightclub."}
{"text":"Great wonderful atmosphere. Staff is very friendly. Ordered the Sicilian pizza and old Mec . The music could be changed up too much variety in style."}
{"text":"Never getting delivery from here again. I've ordered twice from this place. The 1st time they told me my order would be here in 45 mins. I called an hour later they said 15 mins. I called 20 mins later they said ten mins. I drove there and my pizza was still sitting on the rack in the bag cold. They had to remake my order and give me a refund. The second time 45 mins turned into an hour and a half. And to top it all off the girl on the phone couldn't tell me anything but \"I don't know\" and \"I'm sorry\""}
{"text":"Do yourself a favor and drive a little further to the other pizza places close by. My order was incorrect, the pizza description on the menu did not match what was provided and they did not allow the pizza to settle resulting in topping all moving to one side of the pizza during the ride home. The taste wasnt terrible but much better option are not far away."}
{"text":"Placed carry out order , ,lost order , manager was a ass ! , don't waste your money !!"}
{"text":"My yelpers failed me. How did this place get all these 5 star reviews?? I'm confused. Quite possibly the worst pizza I've ever had. If this is what pizza is like in New York, then please keep it in New York. I've had better pizza at a gas station."}
{"text":"Awesome New York style pizza !  They have all your favorite Italian dishes from Pizza, Calzones, Stromboli, to meatball subs. We love their Anti-Pasta especially. The staff is super friendly and knows how to treat their customers right,."}
{"text":"We buy a pizza here every Tuesday night. Does that say enough? We do ask for a little extra sauce (no charge)  since that is the way I like it but the quality of the pizza is simply awesome!"}
{"text":"If I could give it a 3.5 I would, based on my NY Chicken sandwich and previous trips to this restaurant where I've also had great pizza and grinders.  This is a counter order restaurant and casually decorated and great for families!  Many take out orders came and went while we dined and there was a steady flow of customers in and out of the cozy dining area.  Service was okay, didn't blow us away.    My date ordered cheese pizza and spaghetti and was reasonably pleased with both.  Based on my previous trips I'd dine here again, probably getting the Sicilian pizza again, which I loved the last time!  Overall an ok experience...family owned and a good ol' home town Italian place"}
{"text":"Love Brookyln's!  They have a good selection of beers on tap and carry a few local craft beers, too.    They have great bar food!  The $7.00 anti-pasta salad has $8.00 worth of meat on it.  The NY style pizza is good and they have great appetizers.  We've had their wings, cheesy fries and fried ravioli.  They have a great marinara sauce (and I am a self-proclaimed red sauce snob!).  Great service and good food!"}
{"text":"Love Love Love this place. Whenever I want a good NY style pizza or just a good Specialty pizza I go here. The service is always friendly and the food comes out fast. I have eaten their dishes several times and they are just as good. I've had the Antipasto salad, Peppers and Onions sub, Chicken Parm and Fettuccine with Italian Sausage. Now, I am part Italian so they don't quite match what my family makes at home but just as good if not better than most chain Italian restaurants and much easier on the wallet with no pretension. Highly recommend the Sicilian Pizza (It's like a Casserole). Only gripe, they are not open on Sundays (just when you want a good pizza too!)"}
{"text":"What used to be one of my favorite pizza places has taken an astronomical nose dive! Sadly, the last few times we've eaten here, very below average service... I hate being ignored!! The waitresses rarely check on you. My last 3 pizzas were either way over cooked or very under cooked... All 3 times when I brought this to the waitresses attention, she told me that \"that's how pizza is supposed to be.\" Fortunely that's a Pizza Hut across the street... And it's one of the best Pizza Huts in town!!"}
{"text":"This place reminds me of home.  Love the food and the people! I recommend this place to everyone!"}
{"text":"OMG!!!! The best pizza we have ever had!!! We traveled close to an hour to try their pizza and was not dissapointed.  They were crowded when we got there and for good reason!  Definitely worth the trip!!"}
{"text":"First off i have to admit this is the best pizza i have everrrrr eaten!But when this guy who worked there  disrespected  me it left a bad taste in my mouth,I am a faithful customer go there alot!  Every time im in Concord .I bought 3 slices of pizza ,2 pepperoni and one cheese,when i got home turns out i had 3 slices of cheese!Really disappointed  to say the least ,i took pictures to prove and he tried to tell me the pepperoni  was under the cheese hidden!Lmao I'm  blond but not that stupid,I wasn't in there looking for free pizza ,i wouldn't stoop that low...but no apologizes then i called the manger who was on vacation ,informed the lady what went down from my bad experience,she tried to tell me it is sometimes hidden under the pizza okay well why wasn't it hidden any of the other hundreds of times i have eaten there?They forgot it plain and simple ..its not about loosing money due to 5 missing pepperonis its the fact   that it was their mistake ,i had to pay for it :( manger never called they just don't care about their returning customers  and that's sad,and again in my case the customer is always wrong!And that's not right ,cant say i will never return because the pizza is that damn good but ,this again has left me with a bad taste in my mouth to say the very least :("}
{"text":"We have only tried the pizza, fried ravioli, & fried pickles, but they are all great! The cheesecake is tasty too! So nice to have a place to get good quality pizza on this side of town. If you are ordering on Friday and Saturday, be prepared to call ahead and wait about 45 min... but it is worth it! The only downfall to this place is that they are closed on Sunday."}
{"text":"They Could not get an order right if their life depended on it. I tried to speak with the owner before posting this, but apparently he is never available to take a call. We are new to Concord, I grew up outside of Buffalo. I love good wings. They are good here if they can get the order correct, which I am quickly finding out is the problem. Not sure if it's the front of house or back, but we have had orders messed up several times. It kinda stinks when you are looking forward to the fried mushrooms and get home and don't have Any! Might have to try some other local places because this one is not dependable. Again, to the owner, I tried to get in touch with you before posting this but was put off several times. I guess your own employees have no idea how to reach you."}
{"text":"The Papa's pie made with their homemade meatballs is not something to be missed!   The meatballs are seasoned well and compliment the crust and sauce very well!   This is definitely a place where the locals go for good dine in or take-out (we dined in on a Saturday night in their modest dining room and there were several families waiting for their take out orders)."}
{"text":"Delivery took almost an hour but it was worth the wait !!! Delish NY style pizza. Huge slices. We ordered a margarita pizza and it was full of fresh mozzarella. Definitely didn't expect it to be as good as it was !"}
{"text":"And I don't give out 5 stars easily.  The owners have really brought a slice of heaven to North Carolina.  Almost hate to say how good it is, since I don't want others to discover our secret and make the wait longer.  Now open on Sundays, thank goodness - we can get our Brooklyn's fix after church.  The best pizza, especially a crust that's perfect.  Very willing to make whatever you need, if you want something a little different.  My favorite:  chicken parm with mushroom sauce.  And since I try to avoid carbs, they put it over a bed of spinach for me - instead of pasta.  Yum!  Wings spicy, drinks cold, atmosphere perfect (except all that Yankees stuff on the walls  ;)    Recently expanded, with double the space now, more staff, more seating, more menu.  But still crowded in evenings.  It's that good."}
{"text":"If you're a true NYer this is the place to go. Hubby and I are hooked! We tried the other Brooklyn on 601 and no way, this one beats it hands down."}
{"text":"So great! Love the pizza! Everything is great way better than a lot of pizza around here."}
{"text":"If I could leave no stars I would. We placed an order at 6:30 pm. At 8:30 we still had no pizza, was told that it would be another twenty minutes. At 9:45 pm, still no pizza. Was told that they wouldn't be able to send the pizza until TOMORROW! They were very unapologetic or willing to compensate and hung up on us. There is no excuse for such terrible service and disrespect towards customers. I will never attempt to give them my business again."}
{"text":"I have yet to be disappointed! The pizza is awesome! The sandwiches are yummy! The fried ravioli is great as well. Best pizza around hands down! The first time I picked a pizza up the line was out the door and I knew right then I chose a great place."}
{"text":"Great pizza and calzones. Nice little place to grab a beer and watch a game.  The people are kinda weird.  Maybe it's because we showed up pretty dirty after the tough mudder lol."}
{"text":"The consummate Pizzeria in the Harrisburg Concord area. I say this based on my upbringing in the New York area and comparing their Pizza to that of my memories in New York. These guys understand what it takes to make a New York Pizza, the crust is flaky thin and succulent, the mozzarella cheese delicious, and the slice sizes is proportionate to it where the New York Pizza is supposed to be.  While the Charlotte area has a few pizza locations that can rival this, Brooklyn Pizzeria has Harrisburg Concord area on lockdown."}
{"text":"The Sicilian loaded is unreal. We did a works Sicilian and it was massive. The crust was 5 star and toppings about a 3.75 so it's a solid 4-4.5 stars. Good selection of local beer make this a great local joint.   We also got a pepperoni and cheese for the kids. Great place and I will go back when in town visiting my brother.   Get the Sicilian for sure. I think most everyone will like it."}
{"text":"Worst pizza ever!!!! This is not NY pizza.  Crust not cooked all the way.  What the hell is a garlic knot.  I know it's not a roll cooked.  This was the worst pizza place.   Plus food did not come out together, which shouldn't happen."}
{"text":"I'm a native New Yorker, and this place seems to use cheap cheese. It does NOT properly represent actual 'Brooklyn pizza'. The fact that this place often has a line on a weekend evening is just proof that the pizza situation is pathetic in this area. This place is maybe a smidge better than other Concord-area pizza joints, and it's definitely not as good as Rosario's."}
{"text":"Best pizza in the area.  As much as I love the pizza the spaghetti is even better.  I eat here 2 to 3 times a months and have never had a bad meal.    The restaurant has two sides, the one to the left has more of a bar atmosphere, where the one to the right is more traditional and family oriented.  The bar side has poor acoustics and the noise can be loud.  Both sides offer the same great food.  If you want good casual American Italian food Brooklyn's Pizzeria is the place to go."}
{"text":"I am from Long Island,NY. We went here several times. The Sicilian was raw in the middle, a regular pizza was lukewarm when we would purposely counter order for take out. The final straw was when we ordered a sausage pie, sausage parm hero, and a spinach & cheese calzone. The sausage was crumbled! No pizzeria in NY or NJ would serve crumbled sausage parm hero or put it on pizza. It is sliced sausage for the pizza and actual sausage for the sandwich. When we asked why the hero was sausage crumbles and not regular we were told customers here don't like regular sausage!!! That's why it's all crumbled! SMH. The spinach calzone had broccoli in it also. Go to Rosario's closest you will get in Concord to decent NY pizza. If in Mooresville Tony's is the best"}
{"text":"Eat at Brooklyn's on a regular basis. Good food, Good prices and Overall Good Service! Italian Sub, Stromboli, Grilled Chicken Salad and Pizza - all some of the best around!!"}
{"text":"This has been a frequent visit to eat for my family.  An awesome family atmosphere and great pizza, sandwiches, and calzones at reasonable prices."}
{"text":"best pizza in concord! if you are a fan of thin, ny style pizza, don't pass this place up. the pizza is delicious and served in a quick amount of time.  We actually have to start out eating it with a fork because it's just so cheesy!  A small pizza and appetizer is plenty for 2 adults (in my experience) so our bill is never over $20 dollars. I also recommend getting the fried ravioli. Those are soo good!!  They also offer other things outside of pizza but I've yet to try those.  I really like that it's one of those places that can only be found in certain areas and not a huge chain like a pizza hut or something... so, go out and support your local businesses!  Especially Brooklyn's!"}
{"text":"Please make sure you check your bill because prices on the menu are different then your bill and then they will show you the back of the menu, that says prices can change without notice! They also don't care if you never return to their establishment. I like going to local places of business but I will not go here again."}
{"text":"Gimme a break.... I went here before it expanded several times. Food and service was great then. Went recently, after the expansion, and as with many establishments, bigger is not always better.... as is the case here. Service was below par. Food/quality took a nose dive. Now I'm not friends with the owner(s), so I have no bias with the place. There did not appear to be an owner present the last time I visited unless its a teenager. The place was loud (bad acoustics) service was slow, and the food was mehhh....There are much better Italian places around than to mess with this joint again."}
{"text":"Best pizzeria in Concord, by far! I've been going to Brooklyn's since I've lived in Concord for about 8 years and they've always been so welcoming and provide excellent service. Eddie and Rich are great guys. The food is great and I love being able to enjoy my slice like back home in NYC. Oh, and they also have hot sandwiches, wings, desserts, salads...you name it. If you need a spot to hang out at night, visit their after hours next door. Love this spot!"}
{"text":"Came for dinner, waited at the door for 10 minutes without anyone seating us or greeting us. Waitress walked past us several times. Got tired of waiting decided to go somewhere else instead"}
{"text":"Where do I start? The pizza is a greasy mess, not a very big place to sit and the bar side wasn't much better. Obnoxious people and service wasn't the greatest. Someone lied when they told me to try it and it is the best pizza around. Don't waste your money or time with this one."}
{"text":"The owners are great guys but being a NY'r I know pizza and this isn't it.  I would be very surprised if the pie crusts are actually made by Brooklyn's  You have to drive to Rosario's to get decent pizza in the area.  And the wings.  What?  I lived in Buffalo for 8 years and these dry and tiny globs are shameful."}
{"text":"NY style pizza in the Charlotte suburbs. Eat here when I'm in town for work. Awesome. Just love it. Keep up the good work, guys!"}
{"text":"Great tasting food! Huge pizzas with awesome crust, great wings, and friendly service. I have been here twice so far since moving to the area and both times I've had excellent service. I definitely recommend giving them a try the next time you want pizza!"}
{"text":"Our favorite place to get pizza! The food is always exceptional and the wait time isn't bad for the quality. Well worth the wait!"}
{"text":"Always on the lookout for another pizza place, and there is rarely a shortage in the area. This was a pleasant surprise. Though the delivery to the table was a tad on the slow side, it was made up for because the staff was friendly and the food was solid.  Perhaps not the best that you'll find, still much better than the Pizza Hut across the street, and certainly better than most other options in the vicinity. Haven't tried anything but their pizza, but the menu does have some other items that seem promising as well."}
{"text":"Love this place! The pasta ala vodka is my favorite dish of all time. The garlic knots are finger licking good! Along with the marinara sauce, and I do NOT eat marinara sauce. And of course, the pizza. Yummy!!   I first tried this place while living in Brooklyn, NY about 8-9 years ago... Once I had it, I couldn't get enough! This food got me through my first pregnancy!! (maybe that's why my first son loves this dish as well and still remembers going there when he was little ^_^). Even when I moved to Queens, NY I couldn't find anything that compared and always made the trip to Brooklyn to have my fix. Haha  Fast forward to about 3 yrs ago when we were moving to Charlotte, NC - I had to go in for my favorite dish one last time, and since we were regulars, we let them know that they wouldn't see us around anymore because we were moving to NC. Imagine my surprise when they said a couple of them were also moving here and OPENING a pizzeria just like the one up there!?!? I thought someone was playing a joke on me! Well thankfully it's not a joke and here they are. I assure you this is the authentic, real deal NY style pizza and all. I only wish I didn't live like 40 minutes away! (Far south Charlotte)   If you miss NY style pizza + more dishes... You'll love this place! And the guys are SUPER nice and get it right EVERY time!"}
{"text":"Have tried all pizza restaurants in Concord area. This is without doubt the best of the best!!! A little far from my location but well worth the drive. Busy Friday night but quick service and wait staff very attentive. Hit a home run with the ground beef pizza."}
{"text":"Very good pizza!  We ordered half cheese/half meatball and picked it up. It was ready within 15 minutes and was delicious. Would definitely recommend."}
{"text":"Love their pizza-one of two places I go when I am jonesin' for the real NY style thin crust. Good beer selection, although I rarely have one- I have to drive way too far after my meal! The owners are *always* there, they remember *everyone* and it feels like home."}
{"text":"The pizza was great. The veil parm was awesome."}
{"text":"Always great food and friendly staff.  This is the orignal and not to be mistaken for other locations.  Best pizza by far in Concord."}
{"text":"Pizza was only so-so and service was quite slow. In their defense, though, they seemed short-handed."}
{"text":"Really disappointed with this place.  I recently moved to the area and was searching for new places to eat.  I put in a call in order and was told it would be ready in 30 minutes ... it wasn't ready for almost an hour.  Then, when I got back home, I found out they messed up the order.  . The food was actually OK, but I won't be back.  Very poor experience."}
{"text":"Very  unorganized! Waited 45 min. For our food and the order came out all at different times. Saw people seated after us that we're eating before us. Could just be a bad waitress."}
{"text":"My daughter just said Domino's is better LOL!! But if you like the cracker crispy crust this is your place.  Not our cup of tea but at least we now know it's true to its name and the Brooklyn style."}
{"text":"There are no vegan restaurants in this area but this place made their green log without cheese for me and added marinara. They don't use butter; only olive oil. This item totally did not need the cheese because it was delicious as it is!  The fresh spinach and broccoli was nicely seasoned, the inside perfectly cooked, and the dough was the right amount of soft.   The guy that took my order was so amazingly kind and friendly. The cook was moving so fast and they got my order out to me in about 10 minutes despite being extremely busy. They are really hard workers!   My only negative was the older male manager/owner. He ignored me while I was at the counter. Didn't make eye contact with me. And when he had to show the cashier how to run a receipt that showed an itemized list of what I ordered (for my business meal receipt) he never even looked at me or smiled. It was really odd.   But everything else was so fantastic that I'm still giving it five stars!"}
{"text":"Overall the food was decent, service pretty good, they absolute care if you have a good experience.  They did a very poor job of coordinating all the food coming at the same time, apparently the pizza guys and the pasta guys don't talk.  3 people finished dinner before the other 3 got their food.  Management stepped up and took those dishes off the bill."}
{"text":"Absolutely the worse service ever! Pizza is amazing service is terrible I order every Friday for my sons and my family and every week the young lady who answers the phone barely understands English she gets the order wrong every week. Then this week the owner told me that she is going to refuse my orders on Friday because it's too much issues with the order being delivered because she only has three drivers. My problem ? Right then begin to blame me for ordering pizza on a Friday smh this shit is hilarious I will never go to the place again ever the worse period."}
