{"text":"We walked down to the Brother's three for friday fish fish fry. Like other's have said it's a converted gas station from the 70's. At this point it's pretty much a dive joint, but that's okay. We ordered the Lake Perch and split it. They brought over some store-bought rolls which were pretty unexciting. After a reasonable wait-time they brought our fish. The breading was good--beer battered-- but they were over-cooked. Some of the fries were also hard and burnt. To add insult to injury, they filled the glass Heinz bottles with what was probably Hunts ketchup, which is a pretty huge sin and pretty much turned me off to the place.

In all I don't think we'd go back again, but our waitress was nice and there was definitely a vibe to the place. I'd give it a whirl and see for yourself at least once."}
{"text":"Great Unpretentious dive! Friendly wait staff, large portions & tasty food! The Best burgers anywhere!"}
{"text":"Fantastic burgers, prime rib, big portions, great atmosphere.  I love the feel of this place and in general this is my kind of place. It feels like Wisconsin. 

The staff is consistent and friendly.  Every time I have been in Brothers Three I am treated like I've been going there for the past 30 years. 

I waited years before trying it. Don't make the same mistake I did and make plans to try it out!"}
{"text":"Terrible breakfast experience. We went on a Saturday morning and arrived a few minutes after 10.  We didn't actually get our food until 11. The food was OK and the coffee was bad but the bloody Mary was the worst one I have ever had. Thin and runny without any seasoning it tasted like a glass of water with pink food coloring. Every other table had half emptied glasses of it left behind because no one finished them."}
{"text":"Love this place. Very friendly atmosphere and food is quite good. The meal they do best by far is breakfast. They offer large quantities of food for a modest price. The staff is awesome; attentive, sincere and usually tell you a joke or two. 

My only criticism is that there aren't open on Sundays :("}
{"text":"the steak was good. However skip the \"gravy\" as it's a bowl of brown glop. YUK! passed as \"gravy\" OR if you like loud redneck noise \"music\"combined with a restroom with the floor so sticky of urine your shoes stick to the floor, GO!  A gas station converted to a dump.  Eat at your own risk.  

gerald miller"}
{"text":"My husband and I tried out this place on Saturday night with a couple of friends. My husband had the prime rib it was huge and cooked perfectly. I had a chicken sandwich with bacon. Again huge portion I only ate 1/2 and was so good. The atmosphere was great with a nice mix of hipsters to business men to old timers. The staff was outstanding and the bartender made my drinks to perfection. The portion size matched the prices and the food lived up to its name. We will be back to try the fish fry!"}
{"text":"Saturday, 10/19 was my second trip to Brothers Three for burgers.  I ordered the bacon cheeseburger and was not disappointed.  I'll be back."}
{"text":"Truth be told, I must have driven by this place at least 100 times over the years. Let's face it, this joint is nothing to look at from the outside.It looks like an old gas station that never finished a remodeling facelift maybe 10 or 20 years ago. Same goes for the entry way. For that matter the bar/kitchen/dining are a tad long in the tooth too, if you get my meaning.  But the women behind the bar are friendly, and they pour an honest cocktail. The menu is a cross between an old-time steak house and a dive bar. But the food here is awesome. Large portions, perfectly prepared and full of flavor.  The Bacon Cheeseburger is probably the best I have ever eaten."}
{"text":"Good food.  Huge portions.  Reasonable price.  Try the biscuits and gravy.  Yum. Everything else we've had there was equally as good."}
{"text":"Never had a bad experience at Brother's 3. Breakfast on Friday's has the best biscuits and gravy I've ever had at a restaurant. On Friday's fish fry, don't get anything other than the walleye. The last time I had the cod it wasn't the best, but the walleye never disappoints. Great drinks, friendly staff, huge portions!"}
{"text":"My daughter and I came into town saw that Yelp had 3 brothers  rated at four and a half stars. I had a little trouble finding it not a lot of lights out there no really a big sign you can see, but worth the trouble to find we both had the Mushroom Swiss burger excellent very big burger filled my daughter up I could barely finish it. Coleslaw was excellent nice and creamy, fries were okay Burger was cooked exactly as I ordered it, lots of swiss cheese an and mushrooms could have stood a little more spice either on the meat or in the mushroom still strongly recommended I'll go back again. Only con no tap beer."}
{"text":"Came across this restaurant threw the app. They were very busy and we sat at the bar.  Very good food, chicken cordon blue for me, awesome. Husband had walleye great portions.  Kitchen was in the bar. It was entertaining to watch the staff ."}
{"text":"A few weeks ago I dined at Brothers Three for lunch with co workers. It was a sunny day, but as soon as you enter the restaurant it has a dimly lit feel too it typical of Wisconsin bar and grill joints. I immediately noticed an overwhelming smell of old cigarette smoke, which probably permeates the place after years and years of smoking having previously been permitted inside before the smoking ban. We were promptly seated by a friendly server and I ordered the Reuben sandwich. The portion size was generous and they got the ratio right with the meat, sauerkraut, cheese and thousand island which was a pleasant surprise. Sometimes you order a Reuben somewhere and it's too dry with not enough sauce or has too little sauerkraut - not this Reuben. The French fries that accompanied my sandwich were meh, I would have expected better. The oil they had been fried in had a strange aftertaste. My co worker ordered a burger and it did not disappoint. You can actually watch the cook grill the burgers fresh right behind the bar. The ground beef they use seems to be of good quality. Overall my meal was ok, I think I just couldn't get over the unappetizing smell of stale smoke."}
{"text":"My favorite fish fry in Madison!  Choose from several varieties-cod, walleye, perch, catfish, grilled or fried shrimp with choice of potato (I recommend the garlic mashed or hashbrowns!) Walleye is delicious and so are both shrimp varieties.  Perch is great too and the portion was huge! My husband has also raved about the bacon cheeseburger.  
Nice little joint with friendly staff. Good Old fashioned and a decent bloody mary."}
{"text":"Disclaimer: I am giving this place four stars for very particular reasons. Many foodies will hate this place. The food comes from Sysco. The fish is NOT fresh, although their fish fry is as good as most of the other places in town that serve unfresh fish fry. If you come to Brother's Three, you are coming for the atmosphere. This place is not attempting to be something it's not.

Here's why I love this place and go with friends weekly:

1. The staff is awesome. I tend to go in the mornings, and the server/bartender behind the bar is friendly and quick. All of the staff, though, are genial and on the ball.

2. This is a very, very, local, kitschy Wisconsin bar. You will be treated well. The jukebox has a great selection from country to rock. There is a great rectangular bar that you can sit at for every meal, and you are treated well regardless of whether you come alone or sit with friends. The place is filled with regulars at all times. The morning server makes up crazy awesome soups that the regulars love (I once stayed through breakfast and lunch doing work, and person after person came in ordering the \"Chicken Cordon Bleu soup.\")

So, if you like cheap prices, great service, and Wisconsin kitsch, you will really like this place. My friends and I go weekly. Order your eggs over easy if you care about getting fresh eggs.

If you are really concerned with sustainability or are expecting very fresh food, you are going to be disappointed."}
{"text":"Friendly people and good food. It's a great place to grab a quick bite, one of the best burgers around too."}
{"text":"Walked in to brothers three the other day, been there a few times, ya I kinda like dive bars it was dimly lit and looked like the 1970's in there. It was packed on a late Saturday morning, the people looked and acted like they could have been your neighbors ( if you have nice ones ). I got to tell ya the food is home cooking and in large portions, Prime rib sandwich is absolutely one slab of awesomeness. Meat hankerin taken care of! Walked out, man it's bright out here , expected to see Kawasaki triples ,hemi cuda's and chevell ss's , No just moped and eco Sh-t ,    I'm going back in!"}
{"text":"If you are looking for good bar food, and I mean GOOD bar food, this is yur place The food here is always amazing, the drinks are well poured, the selection is wonderful, and the service is always top notch. Go get the prim rib sammich!"}
{"text":"You might feel like you have stepped into a time capsule. This bar is ragtag at best. Nothing fancy here.

Went for a late lunch. Not very busy but there were a few old timers glued to their seats. The bar staff and cooks were very friendly. The menu provided many choices but their famous burger was calling my name. I just ordered a burger with lettuce, tomato and fried onions. The meat was a perfect medium-rare. It was juicy and the portion size generous. The meat was flavorful and not too dense. My dining partner had fries and I never even tried one. They looked too good. 

My burger cost $6.50. What a deal!

I will definitely go back again."}
{"text":"Great fish fry!! This is the typical Midwestern bar of your dreams done well! Wood paneling, taxidermic fish, flowing beer and cocktails. 
Patrons over the age of 65 ( a sign of good food) no complaints I could wear denim head to toe here and feel pretty good about it."}
{"text":"I wasn't sure about coming here when we pulled into the lot but boy, am I thankful I did.  The bacon cheeseburger was to die for...I haven't had such good bacon on a burger in a really long time.  The man making the food is right in the bar- the ingredients are fresh and delicious.  Pam, our server/bartender, was outstanding and made the best grey goose/lemonade I've ever had.  Don't be discouraged by the exterior- it's worth a stop in....I will be back."}
{"text":"Great little place to have a good meal, and a cold drink.  Excellent country fried steak, and the bacon cheeseburger was almost too much to eat.  For a off the beaten path great meal, and good price check this place out"}
{"text":"Favorite place for Friday Fish Fry! Awesome burgers. Cozy bar with great service. You can place to go orders as well."}
{"text":"The place may look simple and uninviting but that is part of its charm! Because the focus is on the food! We were warmly greeted like part of the family by our wonderful server. Food was made to order, hot, fresh and delicious. Sit at the bar and you can watch your food being made."}
{"text":"I've been to Brothers III before but never for breakfast so decided to give it a try.

I ordered the two eggs (over easy), sausage links, hash browns and toast and my husband ordered French toast. 

First, I must admit that I love breakfast and so have strict standards to compare restaurants.  I thought that my eggs were perfectly cooked, the sausage very good, and the hash browns some of the best.  My husband's French toast was good, but only that.  The syrup was lacking in flavor and just tasted sweet.  But, it was good.  Of course service overall was friendly and that is always a plus at Brothers III.

My rating comes down to the food (quality)-for-price assessment.  Good but can not consider breakfast great for the price.  Still, a fun place and if you are in the area and want a good breakfast this should be on your list."}
{"text":"The food was good but I did not appreciate the cook using the plates for a resting place for his hand while talking to other customers. Not a sanitary plate warmer."}
{"text":"It's Funny how Gary gets the credit for the soups....why? is that what he says? he has a TINY part in the soup making process really tiny part, like scooping it into bowls \"TINY\". the CREDIT should go tho Rick, James, Jason, and Nate."}
{"text":"I've been ordering perch most Fridays for a couple of months; so far this is my favorite.  I think the pan-frying made the difference for me.  I tend to find deep-frying can overpower delicate fish flavors.  The breading was thin and deliciously seasoned.  I chose garlic mashed potatoes, which were very garlicky with melted butter in the center.  The creaminess of the coleslaw was complimented by big pieces of pungent radish.  My boyfriend and I enjoyed the unpretentious WI tavern atmosphere, but he was less enthusiastic about his walleye than I was about my lake perch."}
{"text":"Hearty, homecooked meals and generous portions.  The food was delicious.  I thought the mashed potatoes were some of the best I've ever had.  The prices are very reasonable.  The staff are very hospitable and they treat you like a friend even though you've never met.  It is a charming place that reminds me of small town Wisconsin family restaurants.  Its like a little piece of small town in Madison.  I really enjoy it here."}
{"text":"I've been here about 6 or 7 times in the last year. I went again last night, and as always had a good experience.

The food is very good. The burgers are delicious. The nightly specials might not be the cheapest, but you get a generous portion for your money.  Last night, I had a Ranch Chicken Sandwich, and it was great. It came with a heap of fries, and I had leftovers.

The service is also great. A very friendly bunch. There is always this older lady working at the bar, and she is an absolute hoot! She's friendly, funny and and reason enough to go back. The cooks also come and ask you how your food was. Really great service.

And yeah, it might suck that they don't have 30 beer taps like every other bar in Madison, but bottled beer is good enough for me."}
{"text":"I've eaten here a lot. Not much atmosphere, but one of the best burgers in town!  Home made soups are always delicious.  Fish fry is pretty good.  Good basic home cooking."}
{"text":"This is a bar that serves the best burgers and Friday night fish! Their mixed drinks are excellent, too. We enjoyed breakfast there a handful of times, also *very* good. 

One unusual thing: they don't have any beer on tap, only in bottles (and maybe cans, I don't remember for sure). But a good beer selection."}
{"text":"I found this place on Yelp while in Madison for Vietnam Vet convention. I was looking for local \"all foods\" place & THAT'S what I got! I was the only Black patron, & a lil nervous on walkin into this subdued place, but as I walked in, the grill chef smiled & nodded his head at me! I knew I was in the right place! There's oldskool country & light rock music playing, and the server was REALLY nice & helped me choose which steak I wanted. I had the Tenderloin Steak dinner, with onion hash browns & my friend ordered the Rueben sandwich platter. My steak was delicious & tender enuf to cut with a fork & the hash browns were perfect! My friend said the Rueben was just ok.  The server also introduced me to \"Spotted Cow\" beer...a local ale that was really good! I'd recommend this place easily!"}
{"text":"Love the breakfast although I wish it was open all the time. It would generate a lot of business but the early morning breakfast is okay with me anytime"}
{"text":"Great fish fry, had the cod, but many other solid options. Prices for food and drinks very reasonable, staff were extremely nice. May have to wait on a Friday."}
{"text":"Food is good.  This a decent neighborhood spot.  Service is slow if your not a regular.  Quiet hole in the wall joint for a drink or a bite."}
{"text":"This is great place for good old hearty comfort food."}
{"text":"We hit this place on the last Saturday of 2014.  Based on reviews, thought bar, pub, joint, dive, nope---supper club, and a fantastic one at that.  Specials were beef- prime rib, and various steaks. Our server was fantastic, and possibly one of the brothers.  Started with old fashioneds.  Then beer.  She has the petite sirlion, came with rolls, salad and hash browns.  I had to have a burger, since theirs was on my list of best burgers in Madison.  Plenty of food and delicious!  Great place, we will be back.  Looks like they do quite a carry out business as well, based on the number of to go bags leaving while we were there.  Great time, food and place."}
{"text":"I have been here before and like the place but never have been here for lunch. Some buddies and I met for the Wednesday meatloaf this last week. It's a busy workmen's type of place and we had a very friendly server who knew the four of us were there to catch up over  some beers and she left us alone. At the suggestion of one of my buddies we had the meatloaf sandwich and the only option for it was Mayo? Well it cried for a good marinara sauce but was served plane on a decent bun. My buddies all put catchup on theirs but I chose mustard. My point is that there is nothing to liven this sandwich up. No pickle, no chips no fries. Maybe the regulars know a better way of ordering this but I was surprised at how plain it was. The meatloaf itself was a generous slice and was great. It also didn't have onions in it which I do not like so I was happy with it. I would try it again and maybe ask the server for suggestions for add ons."}
{"text":"Very good burgers. Great portions. Bacon is nice and thick cut. Highly recommended to stop in here. No frills just good food."}
{"text":"From the road it looks like an old gas station. But here is the deal, they serve some of the best food I've ever had. The portions are two meal sized. I can't finish any of the baskets in one sitting. It took me two days to eat the meatloaf dinner."}
{"text":"This place is one of a kind. From the outside you'd think it was an old mechanic shop parking lot until you notice their sign. There are some game machines in a room to themselves when you walk in. You'll also see the special of the day listed, which boy oh boy each days special is good! This places takes me back in time whenever I set foot inside. It has an old small town feel.

You can either sit at the bar, table, or booth. The lights are perfectly dim. Everyone seems to be a regular. The cook and bartender are attentive and friendly. Their menu is off the hook! I would vote this place best burger in Madison in a heartbeat. Out of every burger I have tried, theirs has definitely stood out. Huge, juicy, and perfectly cooked and seasoned. Their country fried steak is delicious, as well as their beef sandwich. I was expecting a thinly sliced beef sandwich, but was surprised when I saw the slab of thick beef in between my bread. 

The cook told me they have the best biscuits and gravy in town, but I can't seem to make it in on time on Saturday mornings lol one day! Unfortunately, they are closed on Sundays.

The mint chocolate pie slice is really good too, if you aren't full. Everything is super filling and I always walk out in a food coma, but it's so worth it!"}
{"text":"Came in and tried the bacon cheeseburger and clam chowder.  The clam chowder came out first which was some of the best clam chowder I've ever had. You could get it in a smaller cup with a meal or in a larger bowl with their soup and sandwich deal. 
The bacon cheeseburger was absolutely loaded with bacon which I loved, and the burger itself was also very good.

My only complaints would be the small parking lot which gets a little packed when busy and the dining area is not very well lit, but these issues are easily overlooked once you try their great food!"}
{"text":"We were in search of a good prime rib and were not disappointed! Friendly staff. Good old fashioned. The food was excellent. This is a typical Wisconsin bar - comfortable but certainly not fancy. It was exactly what we were looking for. We'll definitely be back to try the rest of the menu."}
{"text":"Best chicken drummies in Madison. Friendly staff. Great food for the affordable bar grub price. Love this spot."}
{"text":"Great place for lunch specials, breakfast, burgers and really good prime rib on saturdays. opens early  and gets crowded for good reason at lunch - big portions of good food that doesnt cost downtown or west side  prices. simple  working folks bar serving good food, not  a diner trying to serve drinks, or some lame chain place trying to look like a service  station - this place was one way back .  belly up to the bar or snag a table if youre lucky. carry out phone ahead prime rib  on sat - makes great  sunday breakfast if there are any leftovers."}
{"text":"Had New York Strip dinner tonight. It was cooked perfectly medium rare. Service was outstanding. Right on time and always with a smile. My first time at Brothers 3! Will definitely go back. A great neighborhood grill and bar."}
{"text":"The burgers are always great! The bacon cheeseburger comes with thick slices of bacon and your choice of cheese. The drinks are good and the bartenders are always sweet! This is one of my favorite little whole in the wall bars in the city."}
{"text":"Best burgers in madison nothing fancy just excellent food never had anything here that wasn't very good from breakfast to  prime rib basically a supper club disguised as a bar go there most for lunch no one I've taken along hasn't liked it both hubby swear by the burgers don't know what they do to it just a solid juicy burger good selection of different fish and Seafood selections on Friday if you go get there early fills up fast don't be fooled by the appearance nothing fancy but some of the best food in Madison"}
{"text":"The breakfast is stacked with heaping loads of juicy fresh goodness. Healthy portions reasonably priced alongside stiff drinks. The building is old and not much to talk about, but the food and drinks will keep me coming back again and again."}
{"text":"If I'm going to eat a burger-- my biannual red meat craving--this is the place to go. Bacon cheeseburger heaven, with thick large pieces of bacon that extend past the burger. Fries are fine, could care less about coleslaw. Staff friendly. The atmosphere is 100% WI tavern with deer head and musky mounts. Did modernize with two large flat screen tvs but they don't dominate the place. It's dark and uninviting in the entry, with only a poker machine providing much light, but I guess that screens out the hipsters. Go here for the burgers and thank me later."}
{"text":"Dragged my friends in one day because I heard good things. We weren't initially sure. Then we ordered food. 

It does have sort of a neighborhood dive bar atmosphere, but has some of the best burgers in town. Also tried their beef stew on my visit as it was soup of the day, and have to say, it was great. Homemade with a nice, thick broth. Reminded me of Mom's. Wasn't something I was expecting in such a place. Definitely go for the food, have a beer while there, and enjoy the relaxed atmosphere and friendly staff. Definitely a great neighborhood hangout."}
{"text":"This place is the epitome of a \"dive bar\". Went and had breakfast here today. I ordered an omelet with sausage and onions along with hash potatoes. THE PORTIONS WERE LARGE!! I take great pride in not leaving food on my plate, and this place defeated me (and I just started a diet and my wife told me to stop eating). Very very friendly staff and quick. I will come back to try lunch or dinner. 

ENJOY!"}
{"text":"I went there with three others on a Thursday morning for breakfast. The place was fairly full, but we had no problem finding a seat. For how full it was, we were able to get our order in and our food served to us pretty fast. Service was great.

I ordered the sausage and cheese omelete, hashbrowns and toast. My boyfriend ordered french toast and bacon. My mother ordered pancakes and hashbrowns. And my sister ordered hashbrowns and toast. My mom ordered two pancakes without knowing how humungous they make them (size of a dinner plate), so the second pancake was consumed family style and everyone got to try it. The problem with giant pancakes like that is they are often cooked unevenly and some parts are burnt. No, not this one. It was perfect and tasted great. Aside from the pancake, everyone also loved what they got.

The bill for four people came to $33. 

The only downside is the atmosphere. Wood paneling walls to video poker; it's just your standard older Wisconsin bar. But this was minor to me. It kind of has its charm in an odd way. It's so minor that I'll still give Brothers Three 5 stars."}
{"text":"Hands down the best breakfast in Madison! 
Just make sure you reserve enough time in the morning to get it..."}
{"text":"do not recommend at all. walked in very packed.  ok.  waited in the doorway for about 10-15 min nobody seemed to know what to do, so I went to the bar and asked how we get a table, the bar tender was very rude should of left at this point.  she says don't you see we have a bar full of people?   I said yes I see that, I am just asking how do we get a table? she said over there?  nobody was over there.  I was very polite and said I have never been here there has been nobody over there for at least 15 min.  whom shall we speak to?  she was really pissed and stormed off came back and said rudely what is you name .....so that was the first part.   I will give them they are very understaffed, but hey don't be rude.   food was awful,   cold, noting special and I found a lot of hair in the food.   came home and had diarrhea.   not good."}
{"text":"Well, I've been wanting to come here for quite some time, based on other reviews.  Though, this place is a bit out of the way for me....luckily, I was in the area so decided to drive the extra 10 minutes to find the place.

Parking is very limited....

I'm tempted to give them 3.5 stars....but, can't.  That would round up to four stars, but I just can't give them 4 stars....

I came right at the peak of lunch and sat at the bar.  The character and ambiance are well described in other reviews - local, old timey, a bit rough, a bit north woodsy feeling....and I think that 'charm' in such an urban setting may be why the place gets so many really good reviews?

I'm from \"up north\" and have been to lots of local rough bars/pubs that are similar in character....m'eh....it is what it is...

Food?  Prices do seem high....I had a Reuben, only choice of sides was fries or mashed potatoes...that's kind of lame, IMHO.  No o'rings....  :(

It certainly wasn't the best Reuben I've had, though it was priced like it should've been

The sandwich was fine....nothing special.  It was a little soggy, but that's to be expected with the kraut.

Beer selection is LAME LAME LAME...like 5 or 6 types of bottle beer, no tap beers.

Service at the bar?  A bit cold-shouldered....  I think the bar tender must have been one of the brothers....didn't really seem to have time to talk, or even fake being friendly or polite.  I guess some people like that kind of service...not me.  I'm paying money to eat out...the food better be at least as good as I can make at home and the service should be friendly and at least reasonably polite....I am the customer, after all"}
{"text":"One of the best burgers in Madison. Great curds, amazing cheesy soups.  This is the off the beaten path place you want to be for real Wisconsin heart.  Forget all those jokers!  Go to brothers it's amazing!"}
{"text":"Love this place because you don't know about it. Please don't ruin it for us. Stay home!"}
{"text":"This classic Wisconsin dive tavern is known for their breakfast but this time we went for dinner. The decor of this former gas station is wood paneling like your typical basement with deer heads and fish mounted on the walls. 

We all ordered burgers and even though they cook them medium and we forgot to order medium rare they came out juicy and almost medium rare. The bacon cheese burger had three huge strips of bacon which you rarely see and a giant slab of onion. The burger was excellent.  We ordered some cheese curds and they were just ok - breaded not beer battered. The service was friendly and very quick."}
{"text":"Brothers Three is your classic Wisconsin tavern with a great fish fry. It has a vintage supper club feel. 

I've been here twice for the fish fry and it's been great every time. I had the Walleye and it was delicious. The portion was huge! It was cooked perfectly and the outside had that crispy crunch you love with a good fish fry. 

Their cheese curds are also really good, if you're looking for an appetizer."}
{"text":"You walk in and see sort of a bar setting. Giant Green Bay Packers decor right on the side, darts, games. Peek around the corner and there's the tables set up right by the bar.
The Good:
We where immediately greeted by the bartender who happened to be our server as well. Very nice lady who gave us prompt service and made sure we where taken care of. They where playing late 70's/ early 80's music that I dug. The people there where just your good ole nice Wisconsin folks. Clean restroom. Country-feel to the place. Loved the atmosphere.
The Bad:
Sat next to a closed window that had a draft. It was about 30 degrees out and we could feel it. It's an old place- not very tightly-secured. Their deep-frying skills are off. Cheese curds where barely done, one of which was cold in the center (like, not-cooked cold) same thing with the fries. Fries also came un-salted which I don't mind but some might. The burger was sub-par. I could honestly make better burgers at home. Bun was way too thin for the thick burger. Ordered it medium well it came well done.
Long-Story-Short:
Come here to get drinks and hang out with friends, not for dinner. And don't sit by a window in the winter."}
{"text":"If you like dives, this place is one.  In an old drive-up building there is a private parking lot.  However few people knew how to park there.  Walking in is just like walking into any old bar/restaurant you could find in a small town in the north woods.  There's a special charm found over mounted deer heads and vintage beer signs as decor on top of the same 70s wood paneling I remember in every basement in my childhood.  

But this place was packed.  And for a good reason.  The service was excellent-this is clearly their forte as fresh waters were slid onto the table as other tables received their food.  The food was classic bar food.  Real beef patties melted with cheese, crispy fries, and grilled chicken.  Good stuff."}
{"text":"Love this place!!  Prime rib is amazing. I make it point to stop here. Casual bar type environment. Cheap food and drinks. You have to stop."}
