{"text":"This is the worst Breugger's in downtown Pittsburgh!  Always understaffed, always out of coffee and always 1 cashier.  What's going on?"}
{"text":"This Bruegger's location is so painfully slow.. I kept trying to give them the benefit of the doubt when it was busy, but even when not busy.. I usually end up waiting 15+ minutes for just a bagel with cream cheese."}
{"text":"Since they remodeled this location the service here has taken a huge hit. It is extremely slow for unknown reasons. 15 minutes to get a bagel and soup? Ridiculous. It wasn't even crowded. Also staff is not friendly."}
{"text":"We came here on a sunday morning before heading out on the town.  The lady behind the counter was so nice and friendly.  She chatted us up while she made our breakfast sandwiches.  We got the Fresh start deal which saves money but more importantly has maple cream cheese on the sandwich instead of the other cheese.  This was fantastic.  ~5 stars


We went there the next day and got pretty much the same thing but with the regular cheese and it was meh.  The order taker was different and was not as good. ~2 stars

This averages out to about 3 stars."}
{"text":"It's good food and smoothies but I have never gotten my order right or on time. I work right across the street, so I come here almost everyday. So that's 5 wrong and long orders per week. The employees are kind and offer me coupons but I rather have some timeliness and accuracy"}
{"text":"I've been eating lunch at this location for years. The new layout is pretty, but totally inefficient.  Service is very slow and cashiers are rude.  Today may have been the last straw for me.  They have two registers and one line and you can't read the Jamba Juice menu at all from the \"food and drink\" line, which I was waiting in.  As I was approaching the register I leaned over to read the Jamba Juice menu and the cashier snapped at me that I was out of line (she thought I was trying to cut the line I guess).  Bottom line the food and drinks are great, but not worth the long waits and unpleasant staff."}
{"text":"Fantastic.
I went to Pittsburgh for a sorority convention, so it was my first time here. We were given gift cards for breakfast and I absolutely loved it! I'm not sure if all locations have a Jamba Juice, but that was a nice treat. The staff were all lovely and patient, because of course I have to ask for their favorite and recommendations. I wish we had one in Daytona!

Fresh. Flavorful. Consistent. Kind."}
{"text":"Bruegger's is a mixed place of win and fail. Well, not so much fail in food, but in being so pricey.

Their bagels and sandwiches are delicious enough to warrent spending the money, though.

One last thing, and I'm not sure if this applies to all bruegger's or not, bit this particular one always burns their coffee."}
{"text":"I got 3 free bagels coupons from this place before. Located right across the street from the Steel Plaza T station, this Bruegger's and Jamba Juice is convenient to the T."}
{"text":"I came here for a training event right before they opened their newly expanded and remodeled space. They also recently added on a Jamba Juice menu. 

They now have room for two separate lines to order food. On top of the addition of smoothies and drinks, it looked as if their regular menu expanded a tad too. There was a few burgers on the menu, which the hubby tried. I stuck to a Turkey Chipotle Club, which came on an everything bagel. My turkey sandwich was loaded thick with turkey. It tasted pretty darn good for a turkey sandwich, which I imagine would make a great lunch item. The hubby's burger was probably what you would expect for a burger served at a place known for bagels. It tasted like a frozen beef patty, warmed up in a microwave and thrown in between two slices of toast. We also ordered two smoothies. I don't recall the names but they were pretty tasty as far as smoothies go. 

I'm going to give Bruegger's a pass as I was here for a training event and they still hadn't worked out the kinks yet when I came. My husband's burger probably took over a half hour to prepare. Anyone who ordered a burger waited for a very long time for their food. I felt bad because my turkey sandwich came out within minutes, I finished my meal and the burger still wasn't ready. 

I work on the other side of town so I don't know how often I'll stop here, but it's good to know that there's a nice one stop lunch spot should I feel like making the trip!"}
{"text":"I'm a little surprised at the low rating. honestly I had a lot worse food than this in Pittsburgh, i'd say this deserves at least a 3.5+ based on the food quality alone. ok the service staff is a little incompetent, but come on the food was good!  and for a grab and go food place, to me the food outweighs the service. 
I really liked their soup, I had the chicken wild rice, didn't at all expect to be impressed but I was! and the rosemary bagle bites that came with the soup are delicious too. Bagle was good too. will be back for sure."}
{"text":"This store is a disaster.  The staff is often chatting or doing things other than focusing on the task at hand. It takes way too long to get the food to the customers.  I timed them once and it took 11 minutes from the time I ordered a turkey sandwich to when they actually finished it.  Another time it was 6 minutes for a bagel with cream cheese, untoasted, and I was the only one there! The cashiers are not friendly, never greet you or thank you. 

I actually now go three block out of my way to visit a different location that is much better."}
{"text":"If I could give this place less than 1 star I would. Getting a bagel here is a major time commitment. It took us a half hour to get 2 bagels with cream cheese. The order line was backed up. There were 3 employees working who would just disappear for 5 minutes at a time. The manager is completely oblivious. We witnessed multiple people just walk out even though they had already paid. Our food didn't come out and all of the people behind us in line were getting their orders SLOWLY but getting them. We had to show the girl working our paper receipt because she couldn't find our order on the POS screen. Then, she got my bagel spread wrong!!! The bagels had what I would call a splash of cream cheese on them. This place is a disaster. When we arrived a man who was waiting for his order said \"good luck\" to us as we got in line. Yes, you definitely need luck and time if you decide to go here....oh and also the patience of a saint."}
{"text":"There's about 9 people behind the counter who all look busy, but the line is moving very slowly and there's about 17 people waiting for orders. One guy said he couldn't wait anymore and left while an employee yelled from behind the counter \"Can't you see how busy we are dawg!\" Good entertainment, not great for a meal. The trash is full and the tables are a mess. I waited about 20 minutes for a smoothie. Not really getting it done here."}
{"text":"Bruegger's is connected to the building where I work. So, anytime I need to grab something quickly and it's raining or snowing outside, I come here. The food isn't spectacular, but it is dependable. You can create your own salad, and they usually have three soups to choose from. Because I'm not a big bread eater, I normally stick with soups and salad, but I do hear the bagels are delicious.

The chicken they use for salads looks and tastes like mystery meat, so go for the ham or no meat at all. There are a variety of veggie options for salads, so I usually do veggies. You can also add nuts, dried cranberries, or diced apples.

Today I had the chili because I was craving something hearty. It was nice and spicy, and I could visibly see the chunks of bell pepper in the soup. I would definitely get it again on a cold day.

This location is convenient to almost anything on Grant Street or in the vicinity of the William Penn Hotel. The interior is on the small side, so if you want to sit during lunch, come at 11 or after 1:30."}
{"text":"This is a bright, spacious Jamba Juice / Brueggers across  the street from the Steel T Station and at the rear of the Omni William Penn hotel. So amazing to have a Jamba at the base of your hotel. Klara is an amazing employee and Jamba should be proud to have people like her working here! She is nice, cheerful, and the best part is, if you order some obscure crazy drink, she figures it out and nails it!!"}
{"text":"Nice convenient coffee and sandwich shop. The food is good and prices are reasonable. Staff is friendly. Only draw back is it gets pretty crowded at lunch so lines can be long."}
{"text":"Came here with a friend as I had heard from him that this is the only Jamba Juice in the Pittsburgh metro area (sad, right?). Ended up getting the Peach Perfection fruit smoothie only (no yogurt or milk base, etc.). Service here was pretty fast since it was near closing time, but I can only imagine how busy this place can be especially during weekdays during work hours. In general the smoothie was pretty good. I do indeed appreciate the fresh fruit that is used in the smoothie, but for some reason, the smoothie itself seems to lack the fruity tangy flavor that I normally associate Jamba Juice drinks with when I've had them in the past. Not sure if it's due to inexperience or whatever, but I would hope that this would be improved on ... might be due to the very real possibility that since this place is so busy during normal hours on weekdays that the people trained here are so that they produce (quantity over quality), which would be most tragic indeed. Not sure if I'd return here again, but I might a little down the road to see if the other Jamba Juice drinks also follow the same trend (I really like Jamba Juice, if you can't already tell, haha)"}
{"text":"I haven't been to this Bruegger's location in over a year due to multiple problems (bad service, rude staff, dirty dining area). I had hoped that, after some time had passed, they might have fixed their problems. Spoiler alert - they did not.
 
I was in line behind three people. I ordered a toasted bagel with nothing on it and bought a tub of cream cheese. They did not even offer to put my cream cheese in a bag. I had to grab one myself from the pick-up area.
 
I set the timer on my phone to see how long it would take. From the time I ordered until I got my bagel, it was 9 minutes and 57 seconds. Ten minutes for a simple toasted bagel.
 
I saw people who I'm pretty sure came in after me get their orders. When I saw a girl get her order that I was positive had ordered at least five minutes AFTER me, I asked where my bagel was. The girl was extremely rude and said, \"IT'S COMING!\" She then grabbed my bagel hard enough to leave a thumb print in it and squish out most of the cream cheese. Yes, I ordered it plain, but she put cream cheese on it. I didn't see this or the thumb print until I got back to my office.
 
And, if the service doesn't chase you away, the disgusting dining area should. The floor is so sticky, it pulled off my shoe after I was standing in one spot a few minutes. My loafer stuck to the floor and my foot came out of it.
 
I do judge restaurants very strongly based on the cleanliness of their dining area. I mean, this is what you allow me to see. If you can't keep that clean, what does your kitchen look like. EWW!"}
{"text":"All staff were friendly and had exceptional customer service skills! The manager however was very rude. Firstly she didn't offer to slice our bagels (not a big deal) but when one of the employees offered to do so they also offered to toast our bagels as well. So the manager tells the employee \"For future reference we don't toast bagels because that's an upcharge\" but when the manager waited on us she didn't offer to slice or toast our bagels or we would've gladly payed the \"upcharge\" I've heard the management service here was awful.. I guess I just had to see for myself.

On a good note the bagels are really good and their juice bar offers a variety of delicious drinks."}
{"text":"I frequently visit this location prior to work. Although it got its much needed renovation, its service got lost in the transition. The new store is slow, making it nearly a ten minute (and this was on a weekend when it was not even busy).  

I prefer its old model, where they made your order as it was your turn in line.  The current set-up is too slow and makes for long, inconvenient waits."}
{"text":"Went here yesterday for lunch. Food was surprisingly good- really liked both the soup and salad I had- but the service was terrible and the restaurant was dirty. Very dirty. The bathroom was gross"}
{"text":"The Chunky Strawberry Bowl is sooooo good!! But be prepared wait regardless of the time you go. EVERYTHING is at least a 10 minute wait."}
{"text":"So disappointed with this place. I was so looking forward to enjoying some Jamba Juice before a big event downtown. We stood in line for 20 minutes because Bruegger's and Jamba Juice were busy. When it came time to order Pomegranate Paradise and Strawberry Swirl (which we were very much looking forward to), we were told Jamba Juice was too backed up. The issue is that: there was no announcement made nor was this posted anywhere. I'm not sure I'll give this place my business if they handle being busy by turning customers away. Sad!"}
{"text":"Walked in to jamba and they told me the wait for a juice would be 20 mins due to the machines being cleaned. An hour later i see them making juices for other customers so as anyone waiting would, i walked up to make my order just to be told that i had to wait an extra an 15 mins for a juice after they made 7 JUICES for other customers. As i was walking back to my seat, they were laughing. I've never humiliated and annoyed in my entire life."}
{"text":"Being from NY, I know bagels (I also baked bagels when I was a teen).  This place is a fast food bagel shop.  Kind of like Dunkin Donuts or Tim Hortons, adequate but not great.  I got a whole wheat bagel with cream cheese.  It kept me going until lunch."}
{"text":"I decided to give Jamba a second try. I understand how it can be working in a fast-paced environment ( I use to work at the Duquesne University Jamba) but again I was let down tremendously. Someone cut me in line, I waited for 10 minutes for a tropical bowel and when I opened it, I realized I was cheated out of the blended goodness. It was icy as if not enough liquid was added (nor did anyone think to fix the problem) and it covered not even 1/4 of the bowel. I paid a little over 7 dollars and I wish I would've just went somewhere else on my lunch break. I refuse to waste anymore money or time there. I guess the positive part is that I did have a friendly cashier this time."}
{"text":"I like to come to this Breugger's because it also has a Jamba Juice. They food is good and I love how many options they have for smoothies. However, the service here is awful, and has gotten progressively worse over the last year. Today I waited several minutes before anyone even appeared at the register.  Meanwhile, there were 5 employees behind the counter, all focusing on other tasks, like refilling the iced tea. I've been working in customer service for over a decade. There is no excuse for neglecting customers. They also frequently screw up my order. Sometimes this is because they are busy and understaffed, but most of the time I feel like the employees simply don't care."}
{"text":"Bruegger's is a nice coffee shop with a good ambiance, similar in style to Einstein Bros. I wasn't terribly impressed with the Jalapeño Bacon and Egg Sandwich I ordered though. For what they charged, I expected something a bit more than a squished blob."}
{"text":"\"Meh.  I've experienced better\" is exactly right.  While the bagels are somewhat tasty (I would hope they have this recipe down), service is SLOW (takes a healthy 10 minutes to get a bagel and coffee with 1 person in front of me) and everything is on the pricey side."}
{"text":"I am pleased with Brueggers.  Quick and inexpensive food that you can eat if there is nothing else you are tasting.  I need those \"fall-back\" places for times that I am ambivalent to the world.  Today, we ordered the following items:

Butternut squash soup
Chicken spaetzle soup
Ham egg and cheddar on toasted onion bagel
Chicken chipotle club on toasted onion bagel minus lettuce (use the Turkey Chipotle Club as a base)

Being from Florida, the soups were a hot welcome -- I was SO cold today.  The chicken spaetzle soup -- think chicken noodle with the noodles replaced with dumplings -- was rather good.  It wasn't too salty and the spaetzle wasn't mushy.  I wouldn't rave about the flavor of the broth, but I enjoyed what I ate.  The butternut squash soup, while lumpy and stringy, had a nice flavor with a slight piquancy to it.  It is amazing that the butternut squash soup can taste better at Bruegger's than at Season 52.  

Since I am picky and finicky about what I eat, I special ordered my chicken bagel-wich.  It took a little bit longer to make, but I am used to that -- it's a special order, what do you expect.  The staff was up to the task and were all blunt and to the point with everything they said; my kind of people.  

By no means gourmet, the bagel-wiches still had good flavor.  There was no undue piquancy in the chipotle, just some flavor to compliment the chicken and the tomato.  The addition of the toasted onion bagel was nice.  The ham, egg, and cheddar was average; but for being in downtown Pittsburgh -- and unable to make it home -- it is a passable substitute.  

I will definitely return."}
{"text":"Slowest service I've ever experienced at a Bruegger's before. Waited over 15 minutes for a coffee on a Sunday when customer volume was at its lowest. I would not recommend this location to anyone."}
{"text":"Convenient location, but not worth the wait.

Every time I've visited this location, I've waited an enormous amount of time to get even the simplest order AND I've also had my order wrong every time. I guess that's what you should expect for a chain though? It shouldn't be, but it definitely feels like it after giving this place more than a few chances.

It's an okay place to visit if you're in a pinch, but definitely not a regular breakfast stop for me.

The only benefit is that there is a Jamba Juice in the same location, which I was definitely missing in downtown Pittsburgh! (But still the same wait issues.)"}
{"text":"This is the spot for bagels in downtown Pittsburg. Fresh crispy outside, soft chewy, yummy inside bagel with bacon, fresh cracked egg and cheese!! So delicious. The rosemary and olive was my favorite. They also have a great coffee menu and juice bar. Easy to get to from the Omni Penn Hotel."}
{"text":"Absolutely terrible!  I tried the turkey Chipotle Club - it was, hands down, the saltiest thing I have ever purchased from a food service establishment.

I have no idea why they would even serve something with that much salt!

AWFUL!!!"}
{"text":"This is an average bagel shop.  They do have a nice Trio deal.  For $6.99 you get a bagel sandwich, soup or salad and a drink.  $1 more for a cookie.  This Bruegger's won't let you get the softwich with the deal.  The one on Smithfield will for 50 cents more.  Small amount of table seating.  

They have plenty of coffee or tea and is convenient.  You can get the unlimited coffee mug for about $175.  Lasts 1 year.  They need to change their soups more often.  The chicken and rice soup is too heavy."}
{"text":"My kid loves -- LOVES -- Bruegger's bagels. So, we come here a lot. But we're gonna have to change that because this store is INEXCUSABLY slow. Three weekends running, I have waited for 30 minutes or more just to get a bagel sandwich. It's an egg and a bagel. This should NOT be this complicated. I truly hope they get their crap together, because Bruegger's is conveniently located and, as I said, my kid loves it. But we won't be back until further notice."}
{"text":"Visiting Pittsburgh for work so we decided to stop here for breakfast.  We beat the rush. I ordered two sausage, egg and cheese bagels on wheat and a wheat bagel. It was satisfying. Hot, fresh, and fast!! Everything you want in a breakfast meal. I didn't order the coffee so I can't help you there. 

Just a heads up, it does seem to get busy but the line moves fast."}
{"text":"This place is delicious but its is fairly expensive. The morning bliss deal (bagel w/ chesse & meat +orange juice) for $5 is very good but isn't much of a deal. To get filled up you need to spend $7+. 

This place was conveniently located at the corner where the William Penn Oni Hotel was (where I was staying). I wouldn't go out of my way to go here."}
{"text":"After nearly 2 years without Jamba Juice, finally I get to indulge in a large Mango-a-go go...it was well with the wait. Fresh fruit and sorbet blended to perfection!"}
{"text":"The remodel is nice but think twice if you are in a hurry.  Very slow. The layout between the juice bar and food area is a bit confusing.  Staff is friendly.  

Update:  3 months later and still no improvement.  I can't get over how slow this place is.  It's remarkable at how many employees they have it still it's difficult to manage 3 to 4 customers in the store at a time.  First piece of advice... stop batching the orders before carrying them to the end of the counter to give to the customer.  Right now your employees are collecting about 5 orders before carrying them to the other end of the counter to distribute.  Stop doing this.  It is slowing your service down.  Give each order to the customer as soon as it is completed.  Additionally the food won't be cold when the customers get it."}
{"text":"It only took a few short months after opening to turn this from a fancy clean new place to get coffee to the dirtiest dump downtown.  Clearly nobody there cares in the slightest."}
{"text":"Well, I'd gotten some Dunkin' Donuts for the Goof Troop, but one of them mentioned bagels, so I also had to to sneak into Bruegger's to get some. The service was exemplary. I couldn't believe how quickly they got my order together and how \"diverse\" the assortment was after I simply told them to \"give me a little of everything.\" Nonetheless, I am not a huge bagel fan, Bruegger's and Einstein Brothers failing to do much in the way of converting me with their dry, hulking lifesavers of bread."}
{"text":"Holy cow Batman. I couldn't believe the line at DD the morning we were scheduled to head home. Being impatient people and only having 2 breakfast options within walking distance, Brueggers won by default. 

I ordered some spicy wrap that had jalapeno cream cheese, egg, sausage and peppers and a chai tea. My husband ordered the cheese bagel with onion & chive cream cheese and a coffee.

The food was more than satisfactory. In fact, it was pretty good. I think if we were locals I would have bought 10 tubs of that chive cream cheese and ate it with a spoon. I'll admit I had my doubts when he ordered it, but it was scrumptious. The jalapeno cream cheese was too hot for me, but I can't blame them-- I'm just a wuss. I had to scrape most of it off. The chai was some of the best I've had lately!

The reason for 3 stars was the fact that it took an insane amount of time for our order -- at least 25 minutes from the time we walked in. There was only 1 person ringing the register and 1 person making the food. The guy ringing the register eventually came to help prepare the food (because she couldn't make it all by herself) but it was after standing there for around 10 minutes realizing that no one was coming down to the register because no food was prepared. I'm not sure if there was a call off or if someone quit, but they needed at least one more sets of hands to get through the breakfast rush in a reasonable amount of time.

I do have to give mad props to the girl preparing the food because I probably would have threw my hands up and gave up with the amount of people she had to wait on, but she did a great job and managed to be personable with everyone in line."}
{"text":"I'm giving this a one because I didn't have the ability to order a Jamba Juice smoothie to actually rate it. I came in at 603 PM since the sign on the door and the website said it closed at 7... but when I tried to order i was told that they're closed. I know you're a big company and I'm sure nobody cares but I won't be back to try it again and I'll make sure to tell other people."}
{"text":"As out of towners in a new city, we found some place comparable to an Einsteins. The place was good and quiet on a Saturday in the city...in the morning. It had been a while since I went to a \"Bagel Joint\" and i would say it did the job in filling my tummy but it wasn't spectacular."}
{"text":"I agree with other commenters, they now have a nice layout but they deliver in a slower fashion and unorganized. I've seen the same situation since they remodeled regardless whether there's a line or 1 person in front of me. They need to do something if they want a good ROI."}
{"text":"I was concerned based upon prior reviews. I was needlessly concerned. My bagels came out quickly, toasted, perfect cream cheese ratio and I did not lose my shoe to a sticky floor. The staff were hustling were as pleasant as you could be at 8:30 on a Saturday morning."}
{"text":"Screwed up Daughter's untoasted bagel w cc ots. How can they justify that, or the overflowing garbage cans? Or the long line, onne cashier, and one prep person? It wasn't even busy!"}
{"text":"It's convenient, I'll give it that!

Went here to get a bagel and a drink.  The bagel was mediocre, a little bit old but whatever.  The drink was overpriced, but whatever.  Then I saw a dessert bar.  Oooohhh!  That looked so good!   I asked the lady if there were nuts in it (I don't have an allergy, I just don't like nuts in my brownies or blondies....that doesn't make me a monster!  Or does it?)

Anyway, she didn't know if there were nuts in it or not.  I manned up and got it anyway and it was delicious.  I didn't taste any nuts (no comments from the peanut gallery) so my vote says \"no nuts\".

Anyway, if you need a bagel and you're nearby, this should meet your basic requirements."}
{"text":"Stopped by the Market Square location and order a skinny egg white on an onion bagel. It was delicious. The serve was pretty fast and everyone was very nice and it was clean."}
{"text":"The problem here is the wait. They cant handle weekend rushes, so the average wait for a bagel with cream cheese is about 35 minutes."}
{"text":"Staying at the omni hotel and this seemed the best bet for a quick bite to eat. I had the tarragon chicken salad sandwich on wheat. Good healthy choice. They were busy, William apologized for the wait which was only a few minutes. Would recommend!"}
{"text":"Found this gem on my trip to Pittsburgh. Really good bagel place and awesome coffee!!!"}
{"text":"The bagels and sandwich we had were good.  The menu was a little confusing. The service was quick and the prices were reasonable."}
{"text":"I give the 3 employees working 100 stars!!! And the management a minus 1000 stars.  Seriously?? Day game and you only have 3 employees?? I heard 2 people call off well, I am a manager! Call someone else!! Don't do that to your employees and customers!!! This was ridiculous, I waited 50 minutes for 2 toasted bagels with cream cheese. The employees were in such bad mood and I don't blame them!! The food was great by the way. And my caramel macchiato."}
