{"text":"I went here last night with my book club.  There were 12 of us.  I ordered a cocktail, Summer Rose, which was delicious, however, four of us arrived first and ordered the drinks,  mine was the last to arrive.  The waitress seemed to forget what I ordered.  She took our orders, but wasn't close to me and I guess she wrote down the wrong thing.  However, there were 5 other orders that didn't arrived in addition to mine.  It took her a while to try to figure everything out and she seemed frazzled.  I was tired of waiting and told her to forget my burger.  Then she angrily said that they'd have to waste the food she took back.  Which made my upset, a restaurant shouldn't just redo food that was taken back, they should make new food.  Guess they don't here.  She kept asking me if I wanted the burger.  It's a good thing I didn't start yelling at her.  She never asked for refills on drinks later.  I was not impressed, which is a shame because I've heard good things about this place.  I did have the buffalo chicken dip, which was good, but I asked for chips and pita and just got the pita.  Maybe the kitchen needs more supervision.  They weren't busy either."}
{"text":"This was our first visit to this location since the change in ownership. We chose to sit at the bar to watch the Pens game. Bartender was friendly, and the drinks were cold, but we waited for an hour for a so-so salad and a bowl of chili. The guy seated next to us left after waiting for an hour for a burger that never arrived. There are too many other options in Southpointe to explore before I'd give this place another try."}
{"text":"I was very excited to try this place since BLVD closed -  not that the food was great from BLVD but it was nice to watch my kids skate and sit upstairs and have a cocktail!  The food is ok, not anything like I expected after all of the hype.  Burger was overdone (ordered medium and came out well).  It was still flavorful and juicy and the portion sizes were generous.  Service tends to be a bit slow and snarky, particularly on a Sunday night when bartenders should be hustling hard for tips.  Perhaps I'm a skeptic but I think they need to REALLY pick it up for their hard open in March."}
{"text":"Great food, great service. Highly recommended. Great view of the ice, outside deck is a must when it gets warm. Food took 20 min. To arrive  not bad at all in my opinion considering everything is fresh and cooked to order. Heard they are going to have bands. Great place"}
{"text":"I'll start by saying that the actual place is pretty neat with the ice skating rink attached and visible while in the bar/ restaurant. As far as the restaurant itself- mediocre AT BEST. That's being generous in my opinion. The service was not outstanding by any means and the food was absolutely awful. Our burgers were cold. The bacon on the burgers was sooooo fatty it was gross. The appetizer chips were cold, stale and WAY to salty. The fries were cold AND extremely soggy. The extra disappointing part is that this place is called \"Bubbas BURGERS\" meaning they pride themselves in their burgers? Do not be fooled. Bubba needs to find a new passion, because burgers clearly aren't his thing."}
{"text":"Service: Bad. Bad. Bad. Waitress was complaining about everything. To everyone. Kept saying she'd be right over. Maybe she had too many tables + the bar? Don't know.    Location: kind of cool that you can look down on the ice. But it was lunch time so nothing going on during this visit.   Food: Took way too long to get a burger. The place was only half full, but maybe this was very busy for a normal lunch.  The burger was good.   Overall: could be good with improved service."}
{"text":"Good burgers and nice beer list. We had fried pickles and split a western burger.  Staff was courteous but seemed a little overwhelmed. Nice large bar and tables. Good place to watch your kids play while you relax."}
{"text":"So an hour wait for food and my glass has been empty for a while but the bartender is so bitchy I'm not really interested in trying to get another. Asked if I could get a house salad quick - nope apparently they do all tickets in order."}
{"text":"I have worked in the restaurant business so I rarely give lower than a three...I understand that sometimes things happen...but this from start to finish was not great...and it's so sad cause it has potential.  I went to watch my nephews hockey practice and we decided to grab a bite to eat after. The location (literally attached to the rink) and the menu (bar food/burgers) attracted us here. Upon arriving there was no one at the hostess stand so we waited a while to get a seat but they were able to accommodate a good sized group of us outside which was great.   They had a large party that seemed to have been catered lingering at the bar and the restaurant was pretty busy. Our server got our drink order and we put in appetizers. The buffalo chicken dip was ok...not horrible or amazing...there were not enough chips and we were charge a $1 for more...beware. The onion rings were not good...there was way too much breading and they were very greasy. The cheese sticks had the same batter but held up a bit better...they were also a pretty big portion so that was good. The chili was good...again average. The nachos were horrible in a sense that they were literally stadium nachos...for the price we were all expecting a bit more. It was melted nacho cheese (like at the ballpark) with a spoonful of guacamole, sour cream, and salsa on the side. For dinner, my boyfriend and I got a cheeseburger and pulled pork. They were both ok but not worth the time we waited for them to come out.   Our server was very nice but apparently she fell while inside and we were left sitting for a good bit of time. We all felt really bad to hear what had happened and were happy that she was ok...but they should have made sure her tables were covered despite the accident. We also sat without refills and by the time we got our food just wanted the boxes and the check. Not to mention that it was pretty expensive for the quality of what we got.  This was my sisters second time here and she said that they were really disappointed. Not sure if we will try it again or not but it really does have great potential!"}
{"text":"Stopped in for lunch today.  This location was formerly BLVD, and also Jay's Sports Bar, back in the day.  When I arrived, the door was locked, and it was really cold out, so I hung out inside the ice rink next door, until 11:00.  Door was still locked, so I warmed up again next door.  I could see people moving around inside the restaurant from inside the rink, went back over at 5 after, and door was still locked.  Waited outside the door for a few more minutes, and finally at 11:07, the manager unlocked the doors.  While I have been a frequent customer of Bubba's at the original location in South Fayette, this was my first visit here, and I was told that they are still in their soft opening phase.  The menu was completely different from what I am used to at the original location (mostly same food, just a different layout).  I actually thought it was kind of hard to read, and nowhere did I see drinks listed.  The server finally told me that they have coke products, so I ordered a coke ($2.50), but I thought it would be nice if I could see the drinks along with pricing, and also I think a beer list would've been good to have also (Perhaps that is still in the making as they are new).  I wasn't really in the mood for one of the burghers on the menu, so I asked if I could make my own?  Yes, was the answer, but it would've also been nice to just see this option somewhere on the menu.    So I ordered a medium-well Hamburgher ($9.49) and subbed deep fried pickles ($1.50 upcharge) instead of fries.   When the burgher arrived, it was O.K.  I thought it was over-cooked a little, and tasted well done to me.  Maybe I should've ordered it medium? The fried pickles were not as good as I am used to.  They were pretty oily, and maybe a little undercooked on the inside.  Again, this place is new, so maybe they are still getting their act together, but overall, I thought the atmosphere of the restaurant was nice (and large), although sometimes there are loud noises from hockey pucks hitting the glass, so you gotta get used to that sound (almost sounds like a gunshot) every now and again.  I'll probably come back again some time in the future and see how things have improved.   I also am a big fan of the Friday Fish Sandwich at the original Bubba's, so I am curious if they do it just as good here at this location.   P.S.  The manager told me they are also going to have a Lenten menu soon too (FYI, Lent starts in two weeks on Ash Wednesday / Valentines Day).  Cheers!"}
{"text":"We went here for lunch last week and absolutely loved it! There were 4 of us and we went around 11:45 for lunch. Perfect time to go; plenty of seats and quick, efficient service. We did notice that it was significantly busier around 12:30/12:45 as we were leaving. If you are on a time crunch, I would suggest going earlier rather than later.   I tried the Steakhouse burger (swiss cheese, mushrooms, onions) and a side of their fried pickles. The burger was delicious! Cooked to perfection and the bun was fresh and soft. The fried pickles were a hit with our table! The batter was crispy and buttery with a hint of beer to it. One of the other girls at the table tried the burger with the fried cheese...one word....YUM! Go get it! The other two girls at our table tried the Bacon Ranch burger and loved it! We had nothing but good things to say about this place! The waitress did say that they were still in training...so heads up! We would absolutely go back again and try other items on the menu!"}
{"text":"Food is really good. The low stars is based solely on service. Been here twice and there was MAYBE 10 people in the whole place. Both times it took forever to even have a waitress acknowledge us (think 7-10 min) and even longer for food. We got a burger with no bun. Nachos. Fries. Salad. Took a whopping 45 min to come out.  They do NOT have gluten free buns. Bummer that they aren't up to snuff with other modern burger joints.  The chicken on my chicken salad seemed as if it was marinated or seasoned with gluten based stuff even though the waitress said it wasn't. Gluten burns my throat. Their chicken did just that :(  But again the good truly was good.  If they can get their crap together with the service this place would be a hit. I wonder if that's why it's always seemingly dead in there(my kid takes the new mark Schultz karate in the same building,  so i can see restaurant flow which is in same building and has glass walls.) Mark Shultz karate is AMAZING by the way. Strongly suggest checking out!"}
{"text":"Went there for a burger and some drinks. Had a horrible experience with the bartender Jess who also said she was the manager. My burger was over cooked and when I told her about it she did nothing to make things better. After that I closed out my bill and I won't be returning."}
{"text":"This is a new location for Bubba's.  Was advised it was still a soft opening.  This use to be another restaurant and bar connected to the ice area at Southpointe.   The place is large and just a few people having lunch.  Probably a good spot to watch your kids and friends playing hockey and have a cold one. The wait staff was very friendly, helpful and on top of refills.  Could see one of the waitress' being trained on the computer ordering system.   The menu has Fresh Salads, Starters and Fresh Burgers that are a blend of different meats ground fresh daily.  Even without a hangover decided to try the Hangover Part V Cure Burger.  It was cooked perfectly to my medium request and come with Bacon, Ham, Egg and Mayo.  A really good burger.  You get a rather large side of half sweet and half regular fries."}
{"text":"Terrible. As a hockey parent, was hoping to finally have a good place at the rink but that is not the case.  Not sure that I saw any evidence of management so it would get an N/A rating. The service was horrible.  Anxiously awaiting whatever replaces it."}
{"text":"So disappointed ...went again, so bad!! Food was below average, worse than before, and we waited an hour for it. We paid $100, without tip, for four of us; we had drinks, but definitely not worth it. I really want to love this place, the location is really good. You can watch ice hockey inside, sand volleyball and golf outside, even a sign to play cornhole and horseshoes. Just really a waste of the space right now."}
{"text":"This restaurant makes a pretty good burger to say the least. I had the Bacon Ranch burger done medium and I had no complaints on the meat. The only 2 things I will say need improvement are the fries could use a bit more time in the fryer since they are too limp and soggy with fryer oil and the buns the burgers come on could be slightly toasted to keep the structural integrity of the burger on point, since it felt as tho the bun got soggy a bit too much. Other than those 2 things, my experience was pretty good, our server was very nice and checked on us frequently."}
{"text":"I really enjoy the unique receipts and the fun atmosphere. The decor is very Pittsburgh which makes it a must visit when we have friends from out of town. They have plenty or parking with easy access to I79."}
