{"text":"Long time customer of the original AZ Buddyz way over on the east side. Finally got a chance to make it to the new location. Called in a to go order and was ready slightly early. Pizza tastes the same as the other location.. which is AMAZING. 

I go with the original deep dish, pepperoni and jalapeños. 

Salads are all really good as well. 

I am so happy to have this 10 minutes from home so I don't have to make the 45 minute trip to the other location.  

I love it."}
{"text":"This is my favorite pizza place in town. If your going out to dinner this is the place to do it. The service is prompt and the staff is courteous. The owner, Randy gave us some great guidance and was especially helpful with pairing beers with our pizza. This place is a 100%. Obviously the pizza is the main event but they have an amazing menu! You must come and enjoy......."}
{"text":"Called at 6:30pm for a medium thin pizza for pickup and they \"are closed because they won't have enough dough!\" I asked what time they close, 8pm, but they don't want to make more dough. They had a big order at 5:30pm and they can't take anymore orders. Really? BuddyZ will not last long in Tukee with that service. I hope it's due to ironing out the kinks!"}
{"text":"I've been eating buddyz pizza for a long time now. One of my favorites. But that is at the Queen Creek location. The Gilbert location is well not near as good as the Queen Creek location. The crust is not even close to being as good as QC which is the best part of Chicago style pizza. So they have some work to do to be considered the best pizza in town. Which I consider(QC location). Plus how do you run out of Pepsi on a Friday night which is what me and the wife drink. Hopefully they can correct the crust issues because I do love their pizza.

So I just received the check, and they didn't even discount the sodas. We got our first cup of Pepsi before they told us they ran out. For good customer service discounting the sodas would of been great!  Need to improve on the customer service."}
{"text":"We were so excited to have Chicago style pizza with a good beer on a Saturday night.... we get to the pizzeria on baseline and the service was poor...the pizza was very good... however the manager was incredibly rude & impatient and hung up on me when I asked him to hold our take out we accidentally forgot there...we love to support our great local businesses with all our friends & family often,  especially a good ma & pop pizza place  however as much as we liked the place & pizza. & beer....we can not support poor customer service...I am sadden because I was hoping for this to be our new hangout"}
{"text":"This was my families first time to Buddy Z and I have to say the Chicago style pizza was excellent.  We had been regular customers at the pizza place that was at the location that Buddy's now occupies and were disappointed when they closed. We were also suspect when the new pizza place that took its location was a Chicago style pizza place as many of these places don't get it right and you are often left with a super thick crust pizza, almost like a loaf of bread with toppings. Buddy's on the other hand gets it right, their deep dish Chicago Style pizza is spot on in flavor and accuracy.  The pizzas were also very visually appealing and once I opened the box and saw the pizza I could not wait to dig in.
The only reason I did not give 5 stars was the price. It was a little pricey for pizza but that will not stop me from going I will probably just not go as often as I would like."}
{"text":"My wife and I went to dinner at this \"Chicago\" pizzeria for my bday. We're both native Chicagoans. We ordered pizza, a salad and some beer. The atmosphere, service and, condition of the restaurant were all average or above. The pizza, however, was another story. It was devoid of any flavor and the dough was extremely dry and hard. There was nothing \"fresh\" about this pie. Would not return or recommend."}
{"text":"The Queen Creek location hooked us with by far the best pizza in town!!! I was excited to go with a group of friends to the new location  10 minutes from my house. The food is exactly what I expected the service definitely subpar. First the waitress gets didn't know what a Jack & coke was ( they don't serve liquor only beer) then gets confused with the menu about wings, then she comes out with plates joking about forgetting to place an appetizer order for the table next to us. Here comes those wings! Nope they're boneless breaded wings not original bone in. She tried to turn the tables on my friend saying that he ordered these not the others and tried to pawn off the mistake and to keep them. AMAZING PIZZA!! Just like QC!! Paying the bill was the nightmare that took longer than the pizza to cook!! The manager came out to fix it after 3 attempts to get things split right and even he screwed up! After 30 minutes and way too much of unnecessary explanation of how their system works and excuses we paid all oweing each other a few bucks in drinks next time out! 

Go for the epic food you won't be disappointed, the service will make you run!"}
{"text":"First time to this location. As usual, the pie was awesome but the experience wasn't. Server was mediocre at best and the AC really didn't work well. Hello, it's 150 degrees in Arizona...fix your AC!  I gave it 3 stars for the establishment not the ZA."}
{"text":"Looked to them out in queen creek to satisfy my Chicago pizza craving... was driving by running errands and saw this location! I was on the hunt for something to take home and eat to watch the Blackhawks game tonight, and thought, \"hey buddyz haven't ever done me wrong, let's give this location a shot!\" Walked in, very friendly greeting by everyone! Ordered our custom deep dish To go, and asked them if it was possible to munch on some onion rings while we wait... they said yes and got them out ASAP & perfect! I even got asked if I wanted water 3 separate times! ( some people would consider this annoying - I really don't, it's good customer service, that's what it is ) pizza got out with time to spare to get home AND stop to get a 6 pack. Pizza is delicious, as usual... now let's hope the hawks win...."}
{"text":"Excellent pizza!  Closest thing to real Chicago pizza. Service was great and beer and wine selection was full of new and different options. Reasonably priced. You pay a little more but well worth it. I had the gf pizza which was one of the best I've had. The rest of the family had \"regular\" pizza. I tried both and couldn't tell the difference. The sauce is sweet, toppings are generous. This is our new \"go to pizza\"."}
{"text":"First, let me start off by saying that I HATEed Chicago-style deep dish pizza...before I found Buddyz! I am a big fan of crispy, flavorful crust that I thought could only be derived from a New York style, thin-crust pizza...I WAS MISTAKEN! Buddyz took my idea of the Chicago style deep-dish pizza to a level I never thought possible. It was crispy and extremely flavorful...and at the same time, it was simple. We started with a Buddyz salad with deli meat and provolone and bacon and that in itself was amazing. It was very fresh and the rach was also delish! We also had a fried calamari appetizer with marinara sauce. Often when we have calamari (even at high end restaurants) it is greasy or overpowered with flavors that do not fit...not the case here. The calamari was very clean tasting and perfectly crisp with great flavor. We ended our meal with a 10\" deep dish Lake Shore Drive pizza which had 4 kinds of meat...what made this pizza so crispy and different from other Chicago style pizzas was that the cheese wa the bottom layer followed by the toppings and then sauce then more toppings. It was delicious and large enough to feed 3 adults at 2 slices a piece. 
We liked Buddyz so much that my husband and I went back tonight (yep, 2 nights in a row) to have some more. We were served close to closing hours at 8ish and still received amazing service from our server, Trina. We will definitely be coming back soon!"}
{"text":"Yum, yum, YUM!!!!!! Flavor, service...what else do I need....love this place!!!!!!  Did I mention beer is ICE cold?...jalapeno and sausage thin crust...dare I say better than Nello"}
{"text":"We have had Giordano's in Chicago and to me this restaurant wasn't a huge chain but they made a very good Chicago style pizza.  The sauce wasn't too thick or watery and the crust was very tasty."}
{"text":"Fire the white-haired coward they call a manager! I'm with Ryan on this one. I was there Friday night too. We called in the order at 5:30 and they said pick up at 6:30. At 7:30, they had no reason for why I still didn't have my order. Manager dude was scared to death to come out and face us. Seems like it was his first Friday night. No clue how to try throttle an order queue. Only reason I saw him was that he came out to high-five one of his obnoxious friends before he ran back to hide in the kitchen. He sent out his greasy haired lackey to talk to me (pretty sure they butter the crust with his hair) because he was \"so busy.\" He was no help either. The only employee who had it dialed in was the dishwasher. I had a perfect view of him for over an hour and he is my vote for replacing the douchebag manager. Nobody offered me a drink, a discount, or even really cared that several of us had been waiting over an hour beyond what we were told. Wait staff was as nice as they could be and kept apologizing. Hope they split the manager's salary for the night because he cost them all their tips. 2 hours and 15 minutes after my order was placed, I received an order. Of course, when we got home it was wrong. Pizza was okay, but we're from Illinois and this is not legit for Chicago-style. If they get a new manager, we may try again and will update rating, if deserved."}
{"text":"First time trying this place at the recommendation of a friend.  Like another user commented, the front area is a bit chaotic.  We walked in and both hostess/waitresses? were on the phone taking orders, so we weren't greeted for a bit, and didn't really know what to do-seat ourselves?  After about 5 minutes, they were able to talk to us and told us that it would be a 15 minute wait.  There were two open tables so we sat at one and they actually ended up helping us quickly from there.  Everyone that helped us was very nice.  One of the owners was very nice and accommodating and let us try a couple of the beers, gave us suggestions and explained the menu and pizza options.  The pizza was SO amazing.  My husband and myself finished the entire thing.  We will definitely be back.  Hopefully they can iron out the front of the restaurant a bit to make it more welcoming and less chaotic."}
{"text":"Good pizza! Horrible service!   This is the 3rd time I've ordered from Buddyz and each time the service has gotten worse. The first time I ordered I gave them a pass because they are new.  2nd time, OK you are still figuring it out, 3rd time and you are getting worse?  This is why restaraunts fail!   The girl working the phones on Sunday night 11/26 was absolutely horrible.   I had a large order as I had guests over.  She conforms the order and tells me it will be about an hour til the food is ready.   40 minutes go by and I send my wife down to pick up the food.  They forgot an entire pizza(wife didn't know what I ordered)   When I call back to tell her she screwed up the order she didn't apologize, she acted like it was my fault.  Then she says to me: \"so do you want me to put in another order for you?\" UGH! I would prefer you get it right the first time. How do expect to keep customers of you have people like this working here?  I do recommend the pizza however be careful and make sure you check you order.  Until they get new staff I won't go back and I will be telling everybody who asks me to order somewhere else until they get a better staff."}
{"text":"Well yesterday (12/23) when I called in to order a couple of pizzas for pick up, I was told the kitchen was 3 hours behind and they were not taking pizza orders for carryout. This is at least the 3rd time I took my business elsewhere. Time for them to get their 2nd Suzy Bake Oven. A pizza place that can't make pizzas....We have had the thin crust which was pretty good; the pan pizza, average at best. They are generous with their toppings. Will attempt to try the deep dish next...here is why I say attempt....on Sunday 10/22, it was a 2 hour wait for carryout, on Friday 10/27, they ran out of sausage...the phone system can't handle the volumes of calls and it requires repeated call backs until you get thru. As other reviewers noted, the front office is manned by kids. This location has seen restaurants fail, one after another. If they can't figure out how to run their business, they will be the next casualty, and that's too bad. I'll keep going back to Spinato's, Lou's or even make the trek to Peoria for Giordano's until they figure this out....and yes, I'm a Chicago guy who knows pizza."}
{"text":"We have been in need of a good pizza joint in the foothills and Buddyz does not disappoint. We went last night and had the deep dish pizza as well as the Caprese salad. Both were fantastic. There was a line out the door and we had to wait about 40 minutes on a Saturday at 6:00 pm. Totally worth the wait. I can't wait to try their other crusts."}
{"text":"Pizza was amazing. We ordered a deep dish and a thin crust. Our service was a little slow but we didn't mind. I look forward into trying this pizza again. Also, we had their bread sticks. Those were amazing too."}
{"text":"Went for the first time tonight. My roommate and I had cravings for calzones, and I'm glad we decided on going here. Upon walking in, I did notice a little bit of a strange odor up front/bar area, but where our table was simply smelled like the food leaving the kitchen. It's hard to find good pizza in Arizona and both of us are from New York, but the dough for the calzone totally delivered. The calzone was massive. I ordered it with ricotta and black olives, and it could've used a little bit more of both. They were pretty light on that ricotta. I had one beer, an Uncle Bear's Buddyz IPA, and enjoyed the hell out of it. Our server was really nice and she took the time to give a couple suggestions. Will be going back for sure. It's actually within walking distance for me, so between that and the Native, at least I have a couple options back here in the Foothills of Ahwatukee."}
{"text":"Slooooooowwwwww!!!!!  Service not great. I would have figured they would have worked out the kinks since they opened by no luck.

Buddyz, please fix your service issues, we don't want to see you close up!!!!"}
{"text":"Pluses
- Chicken wings were good
- Pizza was very good 
- Service great

Minuses-
- One of the AC units was out so it was a bit hot - they had the fans on full 
- It is a bit pricey - I read some of the other comments.  However I have made 3 meals of the 16' pizza I got so from that perspective it was a fair price.

Neutral-
- it's a bar crowd too so don't bring little kids and babies please.

I am giving them a 5 as I only give 1's or 5's as 2-4 means nothing.  It's either good or not good experience.  It was more positive then negative. May consider another try. when I crave Pizza again.

JGH"}
{"text":"We were patrons of the Queen Creek location so decided to give the new Gilbert location a try. They've been open about 8 or 10 weeks now & have been to this location about 1/2 dozen times. Same great food, same menu, love seeing familiar faces. We rotate between thin crust & deep dish to satisfy our cravings. We don't prefer pan pizza as a whole so never tried theirs. This location has a warm presence about it, the QC location has high ceilings. Love both locations."}
{"text":"Super craft beer selection, always rotating and very diverse. The pizza is Chicago authentic with all fresh ingredients and really tasty. No place in Ahwatukee comes remotely close to  taste and favor. Unlike a lot of pizza restaurants, the dough is made entirely in house and rises from scratch each day versus Sysco. Early on, there were hiccups in execution. But the excellent fresh pizza has never changed."}
{"text":"I tried on three different occasions to order a pizza from Buddyz, on the third attempt I got the order through. On the first attempt I tried for one and ahalf hours and I-called  12 Times and the line was busy. I then tried another time and this was on a Sunday and I finally got through after a number of attempts. When I get get through it was three hours before closing and I was immediately told that they were sold out of the thick crust and butter crust pizzas, So I didn't order anything again. A few more days rolls buy and then I now make an order for a large butter crust pizza with sausage pepperoni and tomatoes. I was high with anticipation with finally getting an order through. The butter crust pizza in my review it's far overrated and is more bread than ingredients that tomatoes in particular very few and far between. The pizza had a lot of cheese sauce they put on the crust was not exceptional nor was the sausage. I will gladly travel to Scottsdale to get a true butter crust pizza. It's too bad that these people move into a high-end neighborhood with low end service and withMinimum of phone lines and running out of Their signature product three hours before closing. Everyone knows the number of failures that this building has produced I hope these guys make it through the storm but they need to kick up the game."}
{"text":"Recently went with a large group. Service and pizza time prep is a little slow, and it's very cold in the restaurant, however, the buttercrust pizza is the way to go. And the staff were very friendly."}
{"text":"First visit for my wife and I last night.  We have tried every restaurant that has been in that space over the last 12 years.  Hoping for a keeper.  We sat at the bar.  Marginal atmosphere (beer & wine only).  Decent beer selection, my wife not wild about the wine, although the pour was generous.  Our bartender Trish, was great.  Really patient, friendly and helpful! We had a thin crust pizza and would grade it a 4.  Place was packed when we left with people waiting to be seated.  We are Happy Hour people who enjoy a nice bar atmosphere, this is not that kind of place.  Solid for pizza & beer........"}
{"text":"Deep dish was good, butter crust pizza was a little better. Very friendly employees and great small crowd."}
{"text":"Without knowing better, you'd pass by Buddyz, a small restaurant tucked into the end of a small strip mall, but don't if you love Chicago style pizza. Their pizzas are the real deal. Growing up in Chicago and suburbs I ate my share of both the Chicago-style thick and thin crust pizzas. I moved away from Illinois and haven't found pizza as good since. Well, not until I ate here... 

We ordered two pizzas - deep dish and thin crust. Both were excellent. The Italian sausage was great. We found out later that they had it shipped in from Chicago. The sauce was superb. All the toppings were great. Other reviewers complained about the wait time for pizzas but these pizzas, even the thin crust pizza, have ample sauce and toppings, so it takes time to bake. 

For a small restaurant, it had a large beer list with a wide variety of beers from the standard Bud to local craft brews. We tried two very drinkable IPAs that we hadn't had before. 

We had excellent service. Our server, Isabel, explained the different pizzas, the beers and other information about the area and the restaurant. Our drinks were refilled quickly too. 

All three of us in my party thoroughly loved our meal and experience here. 

We look forward to returning."}
{"text":"Buddyz has seriously good deep dish pizza! We tried a couple of different kinds, but the good ol' pepperoni deep dish was the best! Really good crust!"}
{"text":"Pretty good. I like the thin crust pizza, comparable to Vito's but better. Hubbys calzone didn't have ricotta, isn't that standard in a calzone?
Is it strange they're only open for 5 hrs? I was wanting to pop in for lunch the other day but realized they open at 4pm."}
{"text":"Great pizza!  So glad it is in our neighborhood!  Great to have awesome food so close by!  Our Friday night tradition now!"}
{"text":"First time customer.  Ordered a deep dish pizza and was blown away.  Crust was crisp, not soggy and flavorful.  Tomatoe sauce was outstanding.  I couldn't stop eating. We will be back."}
{"text":"We enjoy Buddyz Pizza in Ahwatukee. The staff is great, the manager Jeremiah is always very kind. The food is good. We have had the deep dish as well as several sandwiches that were all very tasty. On top of these things, the place is clean!"}
{"text":"Once we tried Buddyz, we haven't been to another pizza spot! It's THAT good!

If you don't want to wait long, call in your order and pick it up later. If you dine in, order an appetizer: Expect to wait around 20 minutes for your pizza, and expect the wait to be worth it. It will be."}
{"text":"This place was highly recommended so our family decided to try it out. 
The server was great. He took our drink order (Pepsi, 2 waters, and kids lemonade) then came back and said they didn't have any more lemonade and that the soda machine was down so they had limited sodas available. We ordered a Dr Pepper & kids choc milk instead.
For pizza, we ordered the \"Lake Shore Drive\" (sausage, pepperoni, ground beef, & bacon) in the butter crust pan and \"The Loop\" (olive oil, ricotta, tomatoes, fresh basil, & garlic) in a thin crust. Our server said they were out of bacon, too.
We also overheard our server telling the customer's next to us that they were out of mozarella sticks. 
We were told the pizza would take about 35 min to make but we waited closer to 45 min.
The filling in the pan pizza was delicious (although, I've had better) but the crust didn't have as much flavor as I hoped and the thin crust was mediocre. For the price you pay and them being out of quite a few things, I'd rather go somewhere else. I hear the one in Queen Creek is better so I'd be willing to give them one more try."}
{"text":"There were 4 people in our party we arrived at 4:45 there were only 2 other tables with customers. We ordered 2 different pizzas, after sitting for an hour the waitress brought the pizza that the other couple in our party ordered and said the other pizza would be out shortly.  Over 20 minutes later and after our friends were done eating our pizza came out.  Slow and horrible service.  The other couple in our party sat with empty glasses with no offer to refill."}
{"text":"Great deep dish Chicago style along with everything else.  Love the Italian beef on a pizza.   Also have a great beer selection, with rotating taps.   I'm glad they moved closer, trying to limit how many times I go a month.  It's so good!"}
{"text":"Chicago style pizza is my favorite, and these guys do it right! My first visit was epic and I'm excited to go back again the next time I'm in town. The calamari was tasty. Our group ordered The Mag Mile and The Lake Shore and they were absolutely delicious and filling. The service was outstanding and very friendly. I highly recommend this place!"}
{"text":"The pizza was extremely salty.  We just couldn't eat the pizza and trust me I like pizza. Additionally, I watched another couple eat one piece and they stopped eating the pizza. Funny thing, as we entered the place a family was leaving and one of them said, \"I can't wait to get home and brush my teeth\".   One can only hope that this was an ingredient mistake."}
{"text":"We go here all the time! The pizza is delicious and service is great! Deep dish takes forever just be prepared, but overall awesome!"}
{"text":"Now that Buddyz has calmed down since firy opening we don't have as much if a wait. Just order takeout early or get there a but before the crowd and it's no problem. We love the Rush Street thin-crust. It's Italian sausage, mushrooms, onions, green peppers and ricotta. Ask for pomodoro tomatoes on top. Delicious!! Great service and a friendly local crowd."}
{"text":"Finally some decent deep dish pizza right in Gilbert. The pizza is actually better than the Lou Malnati's in Phoenix. 

We came on a Friday night and thankfully had a short wait for a table. The menu advises you that the deep dish pies can take 40 minutes to cook so we were starving when our spinach and mushroom pizza arrived. It was terrific! I can tell they take special care in preparing their spinach because it was garlicky and not watery like at Lou Malnati's. The crust was delicious, and the cheese seemed like it was a good quality.

Our inevitable leftovers heated up beautifully, and I'm confident the pizza can hold up to takeout. This was definitely one of our best pizza experiences in Gilbert."}
{"text":"Ordered 3 thin crust pizzas for take out, paid over $65 ($75 when counting the tip). Ordered their version of a supreme, a meat lovers, and pepperoni for the kids. Took about 40 mins for the order to come out. The pizza was good, but the price seems a bit steep. If you're doing 1 pizza, try this place. If you're doing multiple for a get together, go Domino's (or something similar). Don't think it's worth the price for multiple orders."}
{"text":"We went there twice, we wanted to try it out, both times the wait to get our food was in excess of 40 minutes.  Very disorganized, not sure if it was the waiters, kitchen or computer system. First time we were their the waiters blamed it on the computer the next time we waited no feedback provided. Pizza was ok, not going to go back for a few weeks and see if the restaurant improved. I always get our pizza from Bell Italia. I wanted to give Buddy Z a shot"}
{"text":"The valley don't know nothing about no good pizza...especially Chicago style pizza!

I would have given Buddyz 2 1/2 stars, but that was not an option. However, I leaned more towards 2 stars than 3 stars, so 2 it is.

I am originally from Chicago, home of the deep dish pizza. So, I KNOW good Chicago style pizza and this ain't it. We ordered a sausage and onion thin crust and the Mag Mile (sausage, onions, mushrooms, peppers) deep dish. 

My wife and brother-in-law are also from Chicago.  The pizzas looked like a Chicago style pizza, but the pizzas didn't taste like it. The consensus:  the pizzas were BLAND.  The cheese lacked a saltiness. The sauce lacked a cheesiness plus it seemed like an after thought. The crust was nothing to write home about. The sausage and veggies were okay. At the end of the day, it was just pizza...unfortunately, bland pizza.

Now, if you want GOOD, legitimate Chicago style pizza, Check out Giordano's in Peoria or Lou Malnetti's in Phoenix. For the valley, they're tops. Gino's East in Arcadia is a close second. Better yet, if you can get a good airfare, fly to Chicago and get the real thing! If you do, go to Home Run Inn Pizzeria. It's extremely tasty and it's not even a deep dish pizza!   

My recommendation is that Buddyz should change their name to either, \"Buddyz A Failed Chicago Pizzeria\" or \"Buddyz strictly a Phoenix Pizzeria\"."}
{"text":"This place is nice, the wait staff was super nice and the pizza is VERY good. However, the wait time to sit down can be long, the wings aren't the best and it takes a while to get your food. I liked the previous restaurant better and sorry they didn't make it at this location. Buddyz is worth a try. I'd probably order to go next time though."}
{"text":"Yummy authentic pizza . Butter crust or the original both are delightful! They do get busy so plan ahead when ordering to go or in the restaurant."}
{"text":"This place is amazing!! Very very good taste and the staff was very friendly. Our server messed up our order a little bit but she made it right. Good selection of alcohol and a variety of toppings for pizza!"}
{"text":"This is the best deep dish Chicago pizza in Gilbert or Queen Creek area.  It has a deliciously thick and tasty buttery crust about two inches high and is filled with ample toppings and cheese.  All of the specialty pizzas we have tried are flavorful and bursting with a melange of intense flavor. 

We have tried the thin crust pizza and it is very good, but the deep dish pizza has won us over!

When we dine in, we treat ourselves to an appetizer. Fried calamari or homemade potato chips have been our favorite.  Both locations are well run by the same owner who strives for quality and consistency.

I crave this pizza; that is how I know it's good!  Please treat yourselves to a wonderful meal at BuddyZ!"}
{"text":"Owner is extremely sweet and cares about her customers satisfaction!!!! Closest Chicago style pizza to my home!"}
{"text":"Service was non existent. 2 tables were occupied at 730 on a Saturday night. Waited 20 minutes without even a drink order. We left and won't be back."}
{"text":"Patio seating with our dog is awesome. Nice breeze, great view. The new Buddyz in Ahwatukee is great. They are going through a soft opening so be prepared for a little chaos but excellent pizza. They have thin crust a deep dish butter crust and pan pizzas plans apps, sandwiches etc. We tried a thin crust pizza that had fresh mushroom, onions that were crisp but sweet, pepperoni and sausage. The crust was perfectly done-crispy and not soggy. It was cooked long enough so that the cheese on top was browned and bubbly. They didn't skimp on the cheese or toppings. We will be back here at least weekly. Currently it's cash only. The current beers on tap are those from Uncle Bears."}
{"text":"I've had the deep dish sausage pizza here for the third time tonight and loved it just as much each time! This place is my favorite in the Gilbert area!"}
{"text":"We decided to give this place a try since my husband and I are from Midwest and we LOVE deep dish! I wanted to call first to see how long the wait was going to be but phone number wasn't working??? We decided just to head out anyways. When we got to Buddyz the 2 gals working the phones explained that they only have one line, not sure how that could work with call in orders?? I tried calling three times. The girls up front front need a little work with customer service skills, not very friendly. We got seated quick, our waitress was great! Forgot her name but she said she drove in from Peoria to work. We ordered fried Ravioli for appetizers. They were ok not much flavor. We ordered deep dish and it was great!!! We will try again"}
{"text":"The new spot is pretty good! The interior is a bit awkward as far as seating goes, bar area is pretty small, but that's ok--the food is why I tried it out. We ordered the Sears Tower Chicago deep dish, and it was awesome!!! Probably one of the best pizzas I've had in the Foothills area. The only downfall is, it took about 45 minutes for it to come out...Ended up requesting it to go, but at the end of the day, the food was amazing and the staff was attentive."}
{"text":"The building Buddyz is in has change name a million times. I think this pizzeria is her to stay. Family style atmosphere with great local beers as wells as all of your domestic favorites. Shout out to our server Jeremiah who was pretty much the model of customer service. He informed my friend that they were out of limes and immediately went to the store to get some for him. Keep up the good work and this store is here to stay."}
{"text":"After recommendations from a coworker who talked about buddyz in Queen Creek, we decided to try the new location in Gilbert. Right from the beginning everything was great, from the hostess, the waitress and the manager, our dining experience was really enjoyable. The Chicago style menu has something for everyone, deep dish, thin crust pizza, plus a good variety of sandwiches, salads and lots of other great things to choose from. We started off with a couple of locally made brews to go along with the house made potato chips. We ordered a small basket and we thought it was a large, very fresh and really good. Then we ordered a Caprese salad to go with along with a 16\" thin crust pizza, called the Dearborn Station. We asked out waitress if we could have it extra crispy and she said no problem. She was very nice and very helpful though out our time there. The pizza was very good and very hot, which was great. We took half of it home it was so large. The whole experience was really good. Gilbert has another great Italian restaurant in town, so check it out, you won't be disappointed. We will be back."}
{"text":"Great new local place with great food and great prices. Came in to this new local pizzeria with the family during a soft opening. To my surprise it had a lots of patrons, quick service and yummy appetizers. I certainly will be back with the family, and or girl friends to grab a salad and drink some wine. Atmosphere was relaxed, friendly and perfect. Excited they are down the street!"}
{"text":"As a first timer, I ordered a thin crust Loop and a deep dish Lake Shore Drive.  Overall, the cheese and ingredients were very tasty, although we felt the sliced tomatoes on the Loop could have been of slightly better quality.  The thin crust itself was delicious.  The crust on the deep dish was a little too crispy to earn five stars, but the buttery taste of the crust was appreciated."}
{"text":"I just finished my first slice and felt inspired to leave this review immediately. I am not a deep dish fan! Until tonight, I had never enjoyed a single slice. Today is the day everything changed. This is one of the best pizzas I have ever tasted and it was a deep dish no less. The sauce is bold, the crust is buttery, and the flavors complement each other perfectly. I grew up in NY so I know good pizza. Trust me, this is legit folks.

I got the Water Tower Place deep dish with pepperoni and extra cheese. So damn good! I only got a 10\" and it probably weigel about 5 lbs. I will be back!"}
{"text":"Although the Pizza is great, The service is horrid! the service is very bad and the owner is rude and caters to white America.  I f you are not white DONT go to this resurant!"}
{"text":"Good beer, great pizza and great service.  I am big on Chicago style pizza and their deep dish was among the best I've ever had."}
{"text":"Tender calamari with delicious marinara. House salad good with cheese, salami, bacon and turkey. Dressings good too. Best part was the deep dish pizza. We had spinach and mushroom. Again, excellent sauce and a crust out of this world - tender and yet crispy. Perfect!"}
{"text":"Buddyz was just ok for me. BUT let me preface this is more about the service than food! The Pizza was really good and the wings weren't bad.

That being said we went on Fathers Day and it wasn't slammed busy our waitress seemed to forget we were sitting there even though she walked past us multiple times. At one point there was no one waiting for a table and she went to go clean another table but all we wanted was the bill. So I get up to ask for a to go box from the bar and she still doesn't come over. Finally as I am putting the pizza up she comes and asks \"so what else\" she really was so nice but I was just shocked because again it wasn't slammed. I believe she was trying to help other tables but I felt we were overlooked. In the end she was remorseful but it may have been the look on my face I was trying to not let her see. Overall the food is good just make sure you pack your patience!"}
{"text":"Pizza is good. Classic Chicago. Service is a work in progress. I've been here three times. Every time it's something different that goes slightly wrong. Still good enough to come back. Delivery soon!!"}
{"text":"My daughter had just gotten home from Boston on a Friday night and was craving Deep dish pizza. So I went to Yelp and ended up calling in an order for us, got a deep dish pizza and some wings. The pizza was as amazing as the reviews said and the wings were awesome too. We will be back!!!"}
{"text":"Come in and meet Jen and Randy, the owners of this family owned restaurant. Eat some delicious Chicago Style deep dish pizza, or some baked pasta with melted mozzarella cheese on top. Choose from a huge assortment of craft beers and hard ciders, nicely categorized to make selections easier. Bring the whole troop, the back room can seat about 50."}
{"text":"The pizza was OK.. I just didn't like the girl at the registry... everybody else were really cool with me. The Asian lady gave me a genuine smile Especially the guy who came out in the end and explained that it's  been waiting for me for 15 minutes only;assuring that it still good...
Excellent restaurant to bring girls..."}
{"text":"Wings were good. Pizza was okay. The sausage was huge same goes for the green peppers. (S.tower pizza) . Service was not so great since the pizza took toooooo long to come out.. so my rating is 3 stars."}
{"text":"Give it a try, you won't regret it. Deep dish water tower place (add pepperoni) is my absolute favorite. The sauce is chunky and delicious, the cheese to topping to crust ratio is perfect. Yes, it will take 45 minutes to get your pie, so have a drink and an appetizer and enjoy your evening. Or call ahead and pick up a pie to take home. The staff is courteous either way. This is my favorite pizza in the Valley and I've tried more than 20 Chicago style pizza places. I think you will like it too."}
{"text":"I just want to say kudos to Trisha, our server. It was a super busy night and they were short staffed, but Trisha never missed a beat, and was friendly and super attentive to our table of six. I have been there three times now. I was born and raised in Chicago, the food is great and Trisha was great too. Highly recommend!"}
{"text":"Visited at noon on a Sunday. Great service! Clean restaurant. Caprese salad as an appetizer was delicious and fresh. We also got the Combination platter with fried ravioli, onion rings, and chicken nugget thingz. It was a great start to the meal. Family from the Midwest are going to die when we let them know we found a place that offers fried ravioli. We got the deep dish pizza and it was VERY good. After all the starters 1 piece of pizza was enough. The sausage was flavorful and there were fresh gobs of tomatoes on the pizza which I liked. I think there was pepperoni on there but can't remember because the Sausage was so good. It was worth the Sunday drive back into the mountain to eat at this spot."}
{"text":"I would call myself a pizza snob having grown up and out with the pizza from Chicago. This place comes pretty darn close to the real thing. If you are a transplanted Chicagoan you'll see how close they come. If you're from anywhere else, this could possibly be the best you've had."}
{"text":"I am from chicago so when i moved to arizona, i was so disappointed as there were not any true chicago style pizza places around. We had pizza every friday night back home,  but that tradition ended soon enough! I thought i would have to give up my love for pizza forever! I was so excited when lou malnottis came to az as that is a well known chicago pizza place, but i have to say.....EVERYTHING ABOUT BUDDYZ IS BETTER!! The butter crust is amazing, the stuffed pizza is my all time fav but we have had thin as well as other dishes. The staff is so nice and welcoming. The restaurant is so clean. It looks like pizza every friday is back on track!"}
{"text":"We ordered take out on a Thursday night and it was sort of a struggle since we were just ordering Italian beef and combo sandwiches and a couple appetizers.  The sandwiches come with fries or onion rings and I was told they were out of both and to substitute salads.  Not exactly what we wanted but we accommodated however then was told that they were out of salads but did have onion rings.  Seems that communication between the hostess and kitchen was lacking that day.  That aside we had a hard time to understand how you could run out of fries and salads but hey good for them that business is good! 
The beef & combo sandwiches were really good. We all picked the beef juice which was very flavorful and our only complaints was that there was not enough gardinera on the sandwiches and we paid extra for that as a topping.  A bit disappointed there. The calamari was great this night, tender and not chewy but the red sauce/marinara was not good.  Same with the garlic bread basket, the bread was good the marinara not so much. Thinking it was just a scoop of pizza sauce in a cup and unfortunately it didn't work well with the calamari and bread.  
We will definitely order from here again and were pleasantly surprised with the quality of the beef and sausage being from Chicago and all :)"}
{"text":"Our new go to place for deep dish pizza. Crust is crunchy not mushy tomatoes actually taste like fresh tomatoes not to much cheese sausage is excellent not overly spicy. Excellent service"}
{"text":"Great pizza but just be prepared, wait times are intense. 75 minutes to make one cheese pizza and one chopped salad for a to go order on Friday at 5:30pm. If you have the time to wait that long, go for it."}
{"text":"There aren't too many food options in the Ahwatukee Foothills, so I'm stoked this place came to my hood.

Sweet Nectar of the Gods! The butter crust pizza is delicious!!! It is exactly as advertised: buttery, salty, delicious crust that's crispy around all the edges where the dough came into contact with the pan. It's sort of like what Pizza Hut pan pizza would be if Pizza Hut was any good.

The thin crust and deep dish are awesomesauce, too.

We've ordered takeout from Buddyz 3 times now, and it's our new go-to pizza place. The only thing that could make it better is if they delivered."}
{"text":"Not a great first visit for my family. Sat down and ordered at 5:50, small cheese pizza, pasta and meatballs. Almost 1 hour later we were served our food. I thought the pizza , meatballs, and sauce were all bland. The waitresses we're nice , the place was small and very hot. Open a door or turn on the AC."}
{"text":"Do not believe all of the trolls who post negative reviews. This is great deep dish pizza. The place is very busy so get there early or be willing to relax and have a beer before you get a table. The owner is super friendly and the pizza is really good.  

The entire family loved it and everyone was fighting over the leftovers the next day for lunch."}
{"text":"Super slow service, not my type of pizza, and didn't get a single refill on my drink."}
{"text":"The pizza here is definitely delicious but it takes far longer than most pizza places of the sort that I've been to. Supposedly deep dish takes even longer. Like I said though, the pizza is very very good, but it's hard to justify the wait time. They also do get packed so come early."}
{"text":"I really like the deep dish pizza here but the service leaves something to be desired.  The kitchen seems to be consistently backed up so even things like apps take a really long time.  We thought we would get around this by calling in our order to go but have had spotty luck with people  answering the phone.  Despite all of this, the pizza is good enough for us to come back every now and then."}
{"text":"Went with my friend for some good Chicago pizza.  I'm from Chicago and know good pizza.  Ordered deep dish Field Museum pizza.  Came out piping hot, tasted great!  Stevie our waitress was polite, and attentive.  Get the potatoe chips with ranch dip, you won't be disappointed.  They are homemade and come out hot!  Felt pricing was fair and will go back anytime I have a taste for a good pizza."}
{"text":"The most AMAZING pizza ever! Great service today by several people. Had the thin pizza, lake shore drive with a bunch of meat on it. Best pizza in Arizona."}
{"text":"A true Chicago pizza place! They have a pizza that has Italian beef. I'm all about that Italian beef and I love pizza, so put them together and you have pure happiness."}
{"text":"The best pizza I've had anywhere.  Deep dish Navy Pier and Lake Shore Drive are my personal favorites.  Not hungry for Pizza? Check out the Italian Beef or Sloppy Giuseppe sandwiches. Outstanding food and service that won't break the bank."}
{"text":"This Buddyz's location recently opened ... and it feels it. 

Walking in I was immediately greeted with 2 large tables of screaming kids. IMO the front bar area should have a partition from the main dining seating so adult customers can have their own space. Couple this with to-go orders and all the servers congregating around the bar ... yea the front of house currently revolves in pure chaos. Not a space I will frequent unless the owners can iron that out.

Getting past the front door the Chicago style Pizza tastes really good and they have a nice selection of craft beer on tap. 

I'll be back."}
{"text":"Great pizza and service!  Prices are also very reasonable.  A much-needed addition to the Ahwatukee neighborhood."}
{"text":"Fantastic and authentic Chicago-style pizza in a clean and casual atmosphere. Waitstaff is super friendly."}
{"text":"This place has really good food but it's as if the people working in this place have never run a restaurant before.  The noise is off-balance - music can't be heard but offers just enough of a distraction to be annoying.  People are talking over the annoying music with voices that are too load (And it's crappy oldies, which no one wants to hear - if and when you can make it out) and then clumsy servers are dropping stuff everywhere. It's really annoying!  Also, both times I've been it took forever to get the food and they weren't busy.  The first time the order was wrong (delivered to the wrong table so we were given a random pizza they had) and the second time just super slow.  Like 40 min!  The pizza is great but I'll give it one more try and if they don't have it pulled together - that's it.  They also can't seem to get their patio open.  They are just NOT organized and it's not running smooth."}
{"text":"What a PIZZA if you love deep dish this is the place, not to mention the thin is just as amazing! Been going to the san tan location for awhile, but now that they are in Gilbert :)
Randy usually has great beer selections and will always recommend a good beer to try out.
I have been to Lou Malnati's in phoenix and just my opinion I like Buddyz a bit better. Hopefully you will enjoy it as much as I have."}
{"text":"Buddyz was really good. They're still working out some kinks (holy cow we need some soft furniture in there to help with the noise) but overall the pizza was good, wine was good, mozz appetizer was yum (love the sauce to dip). We'll be back, for sure."}
{"text":"I love it I love it I love it! 
1. Food AMAZING! Chicago style pizza. Thin crust and the butter pan both rock my world! Italian beef sandwich gets a round of applause. Good sized wings that are perfectly sauced and still crispy! And you have to try the calamari.
2. Craft beer. Good, ever changing selection and great suggestions from the staff!
3. Which brings me to the staff. Friendly happy people who obviously like their jobs. Shout out to the owner who takes time to stop by tables to see how everything was and spends the time to actually converse with patrons.
We have been there every week since we tried it, and I have already recommended it to friends"}
{"text":"Somehow we were able to get an order in although they shortly said they ran out of dough on a Sunday at 6. 
Obviously they are still working out the kinks in how much of this and that to have on hand. The waitress said that the Gilbert location is much different in level of business and wine drinkers. Replacing a wine bar they better stock up!!

We had a large thin crust 1/2 cheese-1/2 pepperoni and it was quite delicious!  We tried some appetizers...the homemade chips are okay but the garlic/cheese bread nothing to write home about. Not enough garlic butter and very dry bread. 
The Buddy's salad was great! A large fed a few of us a small serving. 

They have about 4 big screen TV's and had the football game on the loud speaker so it's definitely a good spot for sports enthusiasts. 

I am excited to have a pizzeria back in the west part of Ahwatukee and will give them a chance to work out the kinks."}
{"text":"Pizza is very good, but I advise take out only. Table service the worst, disorganized, frantic, poor management. Waited over an hour for our pizza. No thank you, no good night, receptionist looked like she was falling asleep."}
{"text":"What a poor customer service experience. We got there and waited about four minutes to be able to approach the hostess as she was on the phone and had a carry out order waiting ahead of us. Once we were able to approach the hostess table, my husband told the her, \"just the two of us\". The other hostess that had come to hostess table to help the carry out order customer then spun around and quickly walked, almost ran away, which was a little odd, but the other girl said, \"She went to go get a table ready for you\". Then, we waited about four more minutes, and then the girl that had ran away asked if my husband was Eric. He said, no, you never asked for my name. My name is... Then she replied, \"Okay, I'll put your name down\" as if we had just gotten there. We were both looked at each other stunned and decided then to leave. It didn't even look that busy. The two very young girl hostesses were obviously not properly trained with customer service skills. We decided to go to our reliable pizza place Florencia's down the street. We were properly serviced right away, even though the place was packed. Florencia's staff is always efficient and friendly. Not at all like this experience at Buddyz. It would have been our first time, too. I was excited since I'm originally from Chicago. To sum it up, horrible service. Very disappointing."}
{"text":"Coming from Chicago almost 13 years ago we've searched relentlessly for great Chicago pizza.  Well the search is definitely over. Buddyz is spot on with their pizza as well as the sandwiches.  Owners are great people and the staff is awesome. Please support this business. We definitely need this one in the  Foothills."}
{"text":"Great pizza! Real deep dish and buttercrust pizza. Plan to have a starter and relax while you wait for your pizza. New location is nice. Sunday noon is a wonderful time to go. Small crowd!"}
{"text":"We came here for the first time and met the owner on Mother's day. You can tell he has a passionate interest in his restaurant, is constantly vested and working to ensure quality and customer service. To boot, the pizza is incredible. We got the deep dish Lake shore drive... and wow.... flavorful, perfectly cooked, down to the butter crust and bacon. We'll be back!!"}
{"text":"Haven't had Buddy Z for over a year because we moved away from Queen Creek.  I looked them up one day and much to my surprise I found that there was a location in Gilbert.  Couldn't wait to have a pie.  We went there today for lunch and got a basic cheese and sausage thin crust pizza.  I have to say that I was a little disappointed. The crust was burnt and like a piece of cardboard, pretty bad.  The sauce, cheese and sausage were great if only the crust was better. We should have gotten the Chicago deep dish.  We will definitely go back but maybe to the one in Queen Creek.   The waitress was very nice as well as the girl at the register.  The ambiance was okay. Two tv's and a few pictures on the walls."}
{"text":"I'm a Chicago native who moved to AZ after 30+ years.  Needless to say I've had my share of Chicago pizza.  For a point of reference regarding deep dish pizza, we preferred Lou Malnati's and the original Gino's East (on Superior). There are many others, including mom and pop shops, that are excellent too.

On to my Buddyz review.

Food: We had a deep dish sausage and fried calamari appetizer.   The calamari was very tasty and a good portion too.  It had a light batter with a hint of black pepper.  The pizza was delicious and cooked perfectly.  It had a generous amount of sausage which tasted similar to Lou's (a bit more fennel).  The sauce was slightly  sweet with a nice balance of garlic.  The butter crust had a great flavor and was done perfectly.  It I were to compare it to others, I say it was a cross between Giordano's (cheese flavor and texture) and Lou's (crust and sauce)   However, IMHO Buddyz deep dish solidly stands on it's own.  Buddyz earned it's way onto our pizza rotation. 

Service:  They have some kinks to work out.  There was a good amount of staff and the manager is actively involved. No complaints, just can tell it was newly opened.  I have no doubt they will settle in quickly.

Restaurant: The site is very plain, with a small bar up front.  It simply doesn't have much ambiance but the friendly staff helps to overcome it.  The layout is a bit odd and I give them credit for avoiding the tempatation of jamming in too many tables. 

Summary:  Delicious pizza.  Very nice people. Buddyz will be our local deep dish choice.  Probably will do carry-out more often than sit down.

Side note, I liked the poster from Thillens, it brought back some fond memories."}
{"text":"My husband's boss highly recommended this place, so we tried it out. Apparently, the recipe that they use for their deep dish is a family recipe that they got permission to use from Chicago. My hubby and I got to eat real Chicago deep dish from the first Pizzeria Uno in Chicago so I can say we can offer a decent opinion on the matter. We a family of 9, we ordered mozzarella sticks (their sticks were more triangles), house chips, a large deep dish cheese pizza, A large deep dish that had sausage, pepperoni-bacon deep dish and a white tower place deep dish. Everything was delicious the mozzarella sticks were a bit on the soggy side but still really good, their marinara sauce was excellent. All of the deep dish pizzas were very tasty and I was amazed that the crust was not soft or soggy. The service was great all around. I highly recommend trying them out."}
{"text":"The chicken wings were disappointing. We ordered 5 wings and got 5 chicken nuggets for $6, they were not worth 1.25 a piece. 
We also ordered an Italian beef. Was not impressed concitering we are from Chicago it doesn't compare. Over all not good for the price."}
{"text":"Deep dish nirvana.  This was my second pie from this team.  First one was from their Queen Creek location.  Both locations deliver great pizzas.  

Good pizza's foundation is in the crust. Their butter crust is fantastic.  Their toppings are top shelf.  Get anything you want, but make sure you add some bacon. Crazy good.  

If you're craving Chicago style, this is your place."}
{"text":"Best deep dish pizza in Arizona.  We have gone to the Queen Creek location for years and are happy to have a Buddyz closer to home."}
{"text":"Great Chicago deep dish.  A little pricey but I'd put it up there with any deep dish.  Glad they came to the neighborhood."}
{"text":"The deep dish pizza tastes amazing the meatballs are so full of flavor the service was really good and the price was very reasonable"}
{"text":"Their deep dish Chicago style pizza is so good!  We went with a big party and ordered two deep dishes and some appetizers.  Each pizza boasted enough cheese to top 4 pizzas!  The pizza was delicious!  The dough was incredible as was the sauce.  I didn't know if I'd be a fan of deep dish but Buddyz changed my mind!  

I ordered the caprese appetizer and it was lackluster at best.  The tomatoes weren't very ripe, and the balsamic was barely there and the big chunks of raw red onion were off putting.  However our server was MIA as is so I didn't push for something else.  The calamari was decent. Thank goodness for the pizza, it saved the day and this review!  My husband who is a huge fan of deep dish and pizza in general LOVED their cheese deep dish.  This place is husband approved!

The pizza was good enough to be back.  However the service was subpar, we often had empty drinks and their A/C was broken.  It was a sweltering July night and we were all hot.  In good company but still hot!  I'd visit again during the winter months when I'm confident I won't be sweating while eating my deep dish.

On a hot day I would not suggest this for crowds or kids.   It's a small restaurant and was loud and crowded."}
{"text":"Good sauce, good dough, great work! And the the service was 'excellent '. A respectable pizza addition to Ahwatukee! Welcome Buddyz's."}
{"text":"This is the best pizza place I have eaten at in Arizona. I love their homemade fried Ravioli appetizer and their thin crust pizza is perfect everytime. It is LOADED with high quality ingredients and comes out piping hot. So good! My husband loves their huge variety of beers. My only complaint is that they don't open until 4 on weekends which is a bummer!"}
{"text":"First time at BuddyZ,s , and being from NY  I'm a thin crust pizza guy, but the crust at BuddyZ,s  was just fantastic.  I'll be back"}
{"text":"Sooo glad we have one up by us now in Gilbert! 

We love the sauce here. Don't even order a pizza if it's not the deep dish! Best deep dish I've ever had! 

The cheese taste great, doesnt taste generic at all. It's a little pricey but we are glad to pay it cause the pizza is filling and delicious!"}
{"text":"Oh my goodness.  My husband and I heard great comments about this place and decided to try it on our own.  It was fabulous.  Worth every penny.  True Chicago style in both thick and thin crusts.  The ingredients were fresh and plentiful.  Go for it!"}
{"text":"The food is great but you wait a long time for food! Thirty minutes for a salad? We are going on a two hour dinner visit and it is on a not busy Wednesday night! Buddyz you NEED to work on your service level!"}
{"text":"Just had a stuffed pizza and salad to go for the first time at Buddyz. Best pizza I've had in AZ since I moved here 26 yrs ago. Keep up the great job!"}
{"text":"Fantastic Chicago pizza! This is the old Prima Pizza location but don't expect the same pizza or decor. The new owners have completely renovated the place and it looks really nice. The pizza is very different from Prima. This is a deep dish thick Chicago pizza that is really really good. The only drawback is no slices, like you could get with Prima and it takes a long time for an order so order well in advance. We ordered a 10\" small half mushroom half sausage for pick up and it took about 40 minutes. The 10\" was plenty and was worth the wait."}
{"text":"When you are a pizza place you cannot run out of certain types of pizza. You just can't. Even when you give people 15% off. We'll be back in 3 mos. time to see if things are any better. Our server Sammy made up for the lack of preparation in the kichen. The place was clearing out and our pizzas still took a good 45 minutes. No bueno, Buddy."}
{"text":"The best Chicago deep dish pizza in town. Ordered The Lake Shore Drive the sausage was amazing."}
{"text":"Live in Ahwatukee and been waiting before going into Buddyz so they could get the kinks out. 6:30pm on a Thursday night stopped in for dinner and sat at the bar. The bartender/server promptly came by to tell us they were out of toasted ravioli, fried mozzarella and their 10in deep dish pizza. OK then. Bar is sparse and they told us they have opted to only do wine and beer because they do not want a bar crowd- they want the family business. That's fine. Asked for a wine list and was told only one exists so it would be hard to find. He named off a few wines so I ordered and unknown sauv blanc and my friend a Stella. We decided to get a medium thin crust with onions, mushrooms and green peppers. The place was not packed but the pizza still took over an hour to get. When it came the green pepper was haphazardly thrown on the pizza... some pieces had it others had none. The pizza itself was fine and even rather bland.  Nothing special to keep you coming back for it. Sadly the service was slow. 

I would give it a try for yourself. But Ahwatukee has a number of good pizza places (Spinato's and Florencia to name a few) that you could skip the trip into the foothills and still enjoy good pizza elsewhere."}
{"text":"I know thin crust is not their specialty but I ordered a take out and thought it was the worst pizza I've ever had.  Seemed like a piece of cardboard with tomato paste.  Sorry. I was hoping for better since I live close by"}
{"text":"Every time I pass by this place I think two things:

1) This:

I came here the 2nd day they were open. Darcie and I were 15-year, extremely loyal customers of the pizza place formerly at this location. Thought we'd give Buddyz a go and start up a new relationship. 

I have a thing... I don't care if a pizza is thick or thin... I just want the ingredients on top of the cheese. Pretty simple. I've never had a request refused until I came here. To me there's a significant difference in the taste of ingredients baked on top of the cheese vs boiled underneath the cheese.

So, sitting at the bar with my wife I asked if we could have the ingredients on top of the cheese. At first, I saw confusion, then I got \"I don't know from the owner (at least I think she is in the family that owns the place). Then she said: \"I'll go check.\" She came back with a \"No, that's just not how we do it.\" 

She was nice about it. Asked why I would want my pizza that way. I explained. Then she said try it you'll see, it's good. Like I don't know what the texture and taste of the ingredients under that cheese will be like. 

Anyway, I got the pizza for my wife. I tried a bite when it came, predictably, I did not care for it. Strangely, I know myself. 6 slices of that pizza went home in a box. Days later they were eventually fed to my dogs. 

I spent last week in Bellevue WA for work. When I got home last Friday from Sky Harbor there was Buddyz pizza in the fridge. On went the toaster oven. I gave it another shot. Nasty, didn't even swallow a bite.

As a paying customer I expect a business to respect my requests or they will not get my money. 

This place is dead to me. Your mileage may vary.


2) Then this:

     God I miss Prima Pizza."}
{"text":"Great pizza and beer selection they have thin crust and thick si best of both worlds also a butter crust that is great been here many times alway fantastic service please come here"}
{"text":"Same menu, even a few of the same employees as the QC location but a little more convenient for us in Gilbert. And still excellent food and service despite being a new location. Always worth the time and money-- Buddyz has the best pizza around."}
{"text":"So we found this gem of a pizza place from word of mouth. Some good friends of ours were telling us how they have made a tradition of going to Buddyz Pizzeria on Saturday nights with friends. My husband is from Chicago and is a huge fan of deep dish Chicago Pizza; grew up on the stuff! Well, Buddyz did not fail my husband's Chicago Deep Dish taste buds!!! Since that first bite of this delicious pizza, we are now regular customers of Buddyz. The crust is just the right mix of crunch and softness, the pie is super deep, the sauce is so delicious to the taste buds with those chucks of tomato throughout; super yummy. The meats are big and chunky, as are the other yummy fixings. My mouth is watering just thinking about this pizza. If you love Chicago style pizza, don't pass this place by, it will not disappoint!!!"}
{"text":"Bad service, food is marginal at best and waitress seemed to be from another world.  Not a fan and will not be returning"}
{"text":"Absolutely the best deep dish pizza I have tried since moving here from Chicago a couple years ago, can't wait to try the pan and thin crust pizzas as well. Great looking menu and a super friendly staff, 5 stars for our server Trisha who was super friendly and very helpful explaining the menu. Also amazingly the leftover pizza was just as good reheated the next day. This place is exactly what this area needs"}
{"text":"Great pizza and appetizers. We have ordered a pizza every Friday since the day they opened and it is amazing. I am from Chicago and a bit of a Pizza snob, thin rust is perfect, especially the Italian beef and peppers. Deep dish is as good if not better than Lou Malnati's. They even have Old Style Beer(can only)! Needs more TV's and some Chi town memorabilia but off to a good start."}
{"text":"So happy to have found a quality deep dish pizza place in the Valley!  My pizza-living kid has never had deep dish prior and loved it!  We also had wings and calamari and enjoyed both. The wait staff--oh my goodness--from the hostess to our waitress and everyone in between we could not have been treated better. They allowed us to bring in a cake for my son's birthday, they kept it refrigerated until we were ready for it, they put in the candles and lit them for us!  And even though we were there past closing they didn't rush us out. This level of customer service is harder and harder to find and our family appreciated it so much!  We will definitely be back!"}
{"text":"A bit pricey. But since moving here to Mesa we have not found a good Chicago style pizza. I would go back if there were more specials!"}
{"text":"Best pizza I've had in ages.  Gluten free crust is awesome, they have all my favorite toppings and the sauce is robust with a little kick.  Pricey, but worth it.  We will be back for sure!!"}
{"text":"Delicious! Great, family and personal service. The pizza is quality, we had sausage and bacon deep dish..... incredible!
If you're looking for quality pizza, it's here!"}
{"text":"I love this place.  Best pizza in the valley!   But I am not sure how they think they can stay in business by opening at 4pm closing at 9pm on everyday!!  Especially on Friday and Saturday nights.  Oh, close is 8 pm on Sundays.  Just a terrible terrible business plan.  This location is notorious for turnover.  They need to stand out and serve their patrons.  Great pizza.  Just want more of it.  I hope they can make it.   Honestly.  9 pm close on Friday and saturdays!!!   That's a recipe for failure."}
{"text":"My wife and I gave Buddyz a try and I thought it was fair at best. Service was good and the place had a very clean appearance so it was a good start. We ordered fried mozzarella as an appetizer and they were a bit oily. We ordered a thin crust pizza that was half pepperoni and sausage and half vegetarian. The toppings were generous and tasted pretty good but the crust was neither thin nor tasty. The crust tasted like an unsalted cracker that disintegrated every time you took a bite. I judge a pizza by the taste and quality of its crust and theirs just didn't have a passing grade. On a side note the restuarant has a western exposure and the sun was brutal hot coming through the windows  They do have shades but they're not dark enough. It's only going to get hotter as the summer approaches so they need to fix this problem now."}
{"text":"Service was really slow. Pizza was ok but not great. Several items on the pizza were missing."}
{"text":"Excellent pizza, made from good ingredients and really tasty. 
In my opinion it's the best pizza I have had in Phoenix are so far."}
{"text":"I will probably not come to this restaurant again. I ordered takeout and they told me 30 minutes. When I arrived I had to wait an additional 45 minutes for my order. I was told by the manager that everyone called in and they were behind. I should have at least been offered a drink while I waited or a % coupon to come back. 
The guest waiting next to me also had to wait this long and all he ordered was a sandwich. They were out of the meat he wanted and had to change his order after he'd already waited 30 minutes. 
Very upsetting."}
{"text":"Wow! Hubby & I were super excited for a brand new place in Ahwatukee but if your going to open a new restaurant please have enough staff in order to run things properly.  We arrived around 6:30pm waited about an hour and the poor hostess said she was instructed NOT to seat anyone at this time because they were backed up in the kitchen and couldn't accommodate future orders. (I felt sorry for her she was embarrassed) so we ended up leaving without eating at all.  Not sure at this time if we will return."}
{"text":"I've only carried out Pizza from this location and the one in Queen Creek.  Both are a small hike for me but it's worth it.

Didn't have much interaction with the staff, outside of paying and receiving my order.

The Thin Crust and Deep Dish are my go to fav's.  I always order at least one of each.  If you're from Chicago, the flavors will take you home.

Tried the Butter Crust on a couple of occasions but that didn't really do it for me.


For Chicago Style Pizza in the East Valley .... this is THE Place."}
{"text":"This pizza is by far the most amazing pie I have found in Arizona and I'm from NY. The sauce is really Italian and the pizza is authentic with real cheese. Took time to come out so you know it's fresh. The crust was BOMB!!!!"}
{"text":"An amazing pizza place! Love their style and customer service, a nice young lady named cat helped me out with all of my questions, will definitely come back again!"}
{"text":"We are so excited that Buddyz is now open in Gilbert! We have been driving to Queen Creek for the past 2 years for the best deep dish pizza in AZ. We are from Chicago and this is the closest pizza to UNOs and Dues. We live in Gilbert so we will be here often. Great service and great atmosphere."}
{"text":"Pizza Chips were awesome with fresh salsa.  I had the house salad with bacon and it was delicious!  
Staff nice, decor \"gangsta\" style.  Hope more people find this restaurant -its kinda tucked back in the parking lot next to Subway.  We 'll be back."}
{"text":"If you like. Chicago deep dish pizza this is the place to go. 

The owners have a great craft beer selection and will allow you to sample before purchasing.

All other pizza is served here are just as good as the deep dish.

The deep dish pizza is our favorite although try all their pizzas because they are all delicious. 

note: only open for dinner.  I would prefer them open for lunch hours too since i entertain my clients during the daytime."}
{"text":"So glad they opened this location closer to our house.  Pizza tastes as great as their QC location.  Pan pizza is the best, the crust is so buttery.  Their sauces are the best and the pizza still tastes awesome when re-heated.  They have a wonderful beer selection and I love their house salad dressing.  When we go back to eating carbs, this is the first place we are going!"}
{"text":"This place has the best pizza!!! My husband would eat this everyday if I let him  Buddyz is a little family owned and run joint.  If you're are wanting pizza that takes you back to Chicago .... this is the place. They have amazing food and atmosphere. The staff is always attentive and so welcoming! The owner seems like a really nice guy and checks in to see how your meal was.  This is the only place we will go to for pizza in Arizona!!!!"}
{"text":"I rarely eat out these days, but I've been here 3x in the past few weeks because the pizza is so good. Service can be a little slow sometimes but it's always because they are so busy, which is a good sign. Food has been consistent and all of the staff has been very friendly. Maybe a little on the pricey side but with the quality you're getting I really don't find it an issue."}
{"text":"Take 3! To no surprise they are under new management and appears to be a good change. The pizza was good, a little light on the sauce. A look around and I see most people order their butter crust pizza. Service was real good. Not too busy as I believe prior mgt ran off a lot of the customers. I will definitely give it another visit."}
{"text":"Best Pizza Ever!! We had a very large party & the service was outstanding and every pizza we got was fantastic! Deep dish was so extremely flavorful and the thin crust was so crunchy and not soggy like most every other place. Highly recommended!!"}
{"text":"Good solid food around a 4. I am not grading the extremely poor wait time on the food ... if I was this would be a 2. Hoping that Buddyz Corp will  read this and adjust as this is a relative new place. Either need larger kitchen or more cooks. this is not the wait staff faults. Adjust quickly or lose our business."}
{"text":"Local pizza spot just opened in the Foothills. So far so good! Good prices, food, wine and service. Love that we finally have a decent spot back in the Foothills. Wish they had dessert."}
{"text":"Looking some delicious Chicago style Pizza?  This is your spot.  I had the butter crust, which is between their thin crust and deep dish.  The entire crust was super crispy which I loved.  Ingredients are fresh.  Pizza does take a while, so plan on dining for a bit.  They have a great selection of beers.  I will definitely be back."}
{"text":"I'm pretty picky about price pizza.  This place is legit.  Haven't tried the thin crust yet since everyone raved about the deep dish.  I was not disappointed.  This is now my favorite pizza in Phoenix.  Even better than those White Sox loving scum at Lou Malnatti's. We will be back soon."}
{"text":"The pizza is amazing! We have gotten take-out from here twice. Both times the deep dish pizza was the best I've ever had. The first time we ordered, we had a little hiccup but they took care of it this time. Issues can happen in any business, it's the way they are handled that lets you know the business cares about their customers and has integrity! Thank you BuddyZ, we truly love your pizza and will make our pizza goto place from now on! Welcome to Ahwatukee, we are glad you are here!"}
{"text":"I love Buddyz.  Their Chicago deep dish is my favorite pizza in the Valley.  The crust is flavorful and the toppings are fresh and plentiful.  

The waitstaff is great.  They are very nice, attentive and remember you when you come back.

Be advised that a deep dish takes a while to prepare (approx 40 minutes), but you'll understand why when you get it.  It's about three inches deep and densely packed with toppings.  Kill the time with one of their many beers and an order of wings (very crispy and flavorful)."}
{"text":"I really enjoy their food, although I haven't tried a big variety. I can't stop ordering the same thing. Love the neighborhood atmosphere."}
{"text":"this is a great place, with nice people and really good pizza!  is it the best deep dish ever?  no, but it is pretty darn good - try it!"}
{"text":"This has become my favorite pizza place. I am originally from California and I have my favorite place there, but I have found my new favorite! Pizza is delicious. The deep dish is out of this world with the chunky tomato sauce on top! Amazing. If you want great pizza go here!"}
{"text":"Ok. After my original experience, I did return to see if the second time around would be better.

It was.

The pizza is actually pretty solid and my order was rest exactly when they said it would be.

BuddyZ Thanks for making it right and for a couple of great pies! 

I will definitely return."}
{"text":"Ordered a thin crust mag mile which is sausage, green pepper, mushroom and onion. Overall really good and nearly Chicago good. The sausage was top notch as was the cheese. The green peppers were huge slices but they were cooked properly. The mushrooms on the other hand were much smaller and the onions missing. 

Despite these nits, a great pizza a good beer on tap too."}
{"text":"EXCELLENT Italian sausage and specialty Two Brothers brew for BUDDYZ--an excellent dark brew with molasses; delicious!  This place lives up to my experience at the QC location.  Great server in Trina as well.  Will definitely be back!"}
{"text":"I gave it a 2 star only because the pizza is good however they really need to work on time management and staff. My parents live right up the street so when I'm visiting them I usually order pick up and the wait every time has been an hour and a half which after the first time I learned to just order early. Well today I called and they told me they are no longer taking pick up orders for the night! It is 7pm and they close at 9pm! Such horrible service especially for a regular like me. Makes me not want to order from here again!"}
{"text":"I've had some pizza in my time. Maybe too much pizza, if that is possible. (Which, it is most certainly not.) Buddyz's deep dish pizza was good as pizza. But, it doesn't really emulate Chicago deep dish. I should say that if you're expecting a chunky sauce and not quartered tomatoes, well, then its fine. But, if you're more familiar with Chicago deep dish pizza having large tomato chunks in a pie type crust this is not like that. BUT, the pizza is very good tasting none the less."}
{"text":"BEWARE of the ripoff menu!  I came with a group of friends and we ALL thought we were ordering a $14 10\" deep dish specialty pizza.  NO, instead when you order a specialty pizza they unknowingly charge you $14 and then $1.50 for each topping that's on the pizza.  We ordered 2 really small pizzas and a couple drinks and got a bill for $100!

The pizza was really good, but the service was extremely slow.  We had to get up and track down the waitress every time we needed something.

After being charged $100 for a tiny pizza dinner, I'd rather just go somewhere like Grimaldi's."}
{"text":"We are weekly Buddyz customers but after tonight I'm not sure we will be back. Called at 5:30pm for a 14' thin crust pizza and a salad. Got there on time and was told it would be 18 more minutes, no problem!!! 18 minutes goes.... 25 minutes go... 35 minutes go and that's when I asked how much longer but never got an answer. So I kept waiting, oh and did I mention I was waiting with my two year old who was DONE waiting. At 7:30pm I finally said I wanted my money back and left WITHOUT a pizza and salad because it still wasn't ready. I use to work at a pizza restaurant, I understand they get busy but a 14' THIN pizza shouldn't take more than 30 minutes to cook if that. I'm disgusted at the customer service, yes I got my money back for the pizza I didn't get but never a offer to take my salad or a credit for next time. Awesome pizza but horrible customer service."}
{"text":"Pizza is awesome, decent price. Service was good. Will be back.  Plenty of parking. They do take out also. First time eating in."}
{"text":"really great pizza- both chicago style and thin crust are amazing; cant decide which i like more! the sauce, cheese and crust.. wow!  

i do agree, however that even for great tasting pizza, the prices are high. we usually get a small chicago and large thin for $35. that really is a bit much for pizza, but i justify it because we always have leftovers and even those are great. service is very slow and lacking a bit, but you can see its because they are new, thus working out kinks and trying to accommodate their already large crowd with the staff and space they have available. we will continue to go back, but with prices and wait times, wont be our \"every time\" pizza place, as id like. give it a try - its the best pizza around here!!"}
{"text":"I have had real Chicago deep-dish from all the best places in Chicago. This place is right up there with all of them.  One the main keys to a great deep-dish is the sauce and they have it right.  Nice that I don't have to fly to Chicago to get the real thing."}
{"text":"Mixed reviews. Had a Sears tower thin crust, which was really good. Friend had a sausage deep dish and was really good as well. My wife had an Italian beef sandwich with cheese and peppers. The meat was super chewy and seasoned with tons of oregano and other herbs. She ended up eating a pepper and cheese sandwich. 

The Beer selection was great."}
{"text":"Awesome Pizza! Awesome Apps n Sandwiches!Awesome Service! Old Style Lager! What else can be said. Had a birthday party for 13 people last night and everything was awesome!

Have carried out several times with awesome food and service!

Anyone posting a negative review either ain't happy with anything, anywhere or had a very rare issue and should give another go."}
{"text":"This place is really good, fresh ingredients and atmosphere is nice to. They have a small bar you can sit at while you wait for you're food and have a couple drinks. The only downside is it does take a pretty long time to make the pizza but I guess good things don't come fast. I always get the pepperoni jalapeño pineapple pizza it's the best."}
{"text":"We were so excited to see Buddyz opening in Gilbert. And the new location has not disappointed. The butter crust is absolutely delicious in Chicago deep dish or traditional."}
{"text":"Great location with a bar in house. Store is very clean and service is top notch. We ordered two 10 inch pizzas. One butter crust Sears Tower and one deep dish with pineapple. Pizza was fresh, piping hot and melt in your mouth good.My nephew got a huge Caesar salad for $8 and added chicken. We were all happy."}
{"text":"We went out of our way and visited the Buddyz location in Queen Creek a couple of years ago and had been dying to get back ever since. When my husband and I found out they were opening a location in Ahwatukee, we were thrilled! My husband's family owns a pizza shop in the midwest and we have been struggling to find great pizza out here. We went to the Chandler Buddyz a couple days after they opened and have been back several times since. Each time, the food, service, and beer selection get better and better! Highly recommend the butter crust!"}
{"text":"Well, we decided to try the Gilbert Buddyz as I was craving some type of deep dish pizza from 'somewhere'.  

We arrived around 6 pm while a large party was finishing.  There was one other party seated, which made it a relatively light night.  

We ordered the combo appetizer, which tasted good, but seemed a little light on the amount of onion rings.  :-(  Since the main event was the pizza, we didn't mind too much.

We ordered 2 pizzas, the deep dish 'Sears Tower' for my wife and I and a smaller 10\" pepperoni for our son.

My first bite and I felt that something wasn't quite right.  The crust seemed warm, but the tomato sauce on the top of the pizza was basically room temperature.

It was explained to us that the tomato sauce is added on top of the pizza after it was cooked?  I'm not a pizza chef, so I won't challenge the process to make 'Chicago Style' pizza.  I've had chicago style pizza previously and dont recall it ever having luke warm tomato sauce.  

When our waitress came by, I informed her of the issue.  She apologized  but said it was against the law to re-heat food once it had left the kitchen.  Our options were to wait another 30-45 minutes for a new one, or take it home and heat it up ourselves.  She stated she would 'make it right' for us.  My wife was starving, so she ate 2 slices of the 'cold' pizza.  We decided to not wait for a new one. 

Our son's pizza was perfect.  It was warm, gooey, tasty and perfect.  Since I refuse to eat cold pizza, I had one of his pepperoni slices (since he did not eat it all).

When the bill came due, I found that 'making it right' was a 25% discount on just the 'cold' pizza.  I didn't feel that was fair that I'd have to mostly pay for a pizza I couldn't eat when I ordered to 'eat here'.  I didn't go to Papa Murphys.  I didn't think this was supposed to be take and bake.  So I complained to the waitress and got 50% off the 'cold' pizza only.  IMHO it was not a good 'sit-down' experience.

I give the wait staff props.  She was good.  In retrospect I don't think I should have had to pay for a pizza I could not eat where I ordered it.  I wonder if the waitstaff/mgmt would have wanted to pay for it if they were in my shoes?  The pizza is great, just take it home and put it in the oven for another 10 minutes?  :-(

AND, I will admit the Sears Tower pizza we ordered is GREAT when it isn't cold.  I heated 2 slices up for lunch today and I will say it was excellent.  And this is why you are getting 3 starts instead of 2."}
{"text":"I guess Yelp allows multiple businesses of the same name at the same location?  If you don't like one set of reviews, you can always just delete that profile and move on to the 'good' profile?  ;-)

Gordon Ramsey, this place needs you, Badly.  Food seems to be ok, IF you can get what you order.  Service is SLOOOOOOOOOW.  But the beer is cold and good.  Drink enough beer and time doesn't matter.  Right?  ;-)

I'm not sure if this is a 'friends and family' place or what.  You seem to get better service depending on who you know.  And a lot of ppl seem to know each other here.  The other yelp reviews were either done by family, or bogus.

Our experience started at 515 this evening.  My wife and I got off work and decided we'd do the Chicago style deep dish.  

We arrived at 530 on a Friday night, and were eventually seated at 545 pm.  That is about the ONLY thing that went correctly.

This place is 'manned' by a ton of 'kids', most of which are 16 and this is their first job.  There are THREE people standing at the reception.  I've never seen 3 people constantly run a reception, even if they ALL are 16.  I am not sure if more than 1-2 'adults' work here.  

We ordered 2 pizzas and some chicken wings.  And THIS is where it all starts going 'downhill'.  After 30 minutes we were told that our 'ticket' was lost, and so was our order.  We were offered the 'opportunity' of coming back, but Ahwatukee doesn't have a lot of restaurants, so we decided to stay (or first mistake).

They put our ticket back in, which included one deep dish pizza.  The chicken wings came out about 30 minutes later and were ok.

The thin crust pizza, for our son, came out about 15 minutes later.

Our deep dish pizza NEVER came out.  About 20 minutes later the manager dropped off a 'thin' crust version of what we ordered, but not how we ordered it.  She apologized for the 'mistake', but for whatever reason, would not get us a deep dish pizza (we learned why later).

Our thin crust pizza really sucked.  But we were starving having sat in a restaurant for 1.5 hours.  So we ate about 25-33% of it.  The crust was burnt and the toppings overwhelmed the crust.  It just wasn't very good AND not what we ordered.

Our server, via the manager, 'comped' our meal.  Which was nice, but it would have still been nice to see the manager prior to our departure.

Prior to leaving we learned that they ran out of pizza dough for deep dish pizzas and THAT was the reason we did not get out pizza as ordered.  

When we left, at 7:30 pm, there was a huge 'CLOSED' sign out front.  Not sure what that meant as there were still a ton of ppl drinking alcohol in the 'bar'.  

The prices here are high.  For our 14\" pizza was $14 plus $1.50 per topping.  If we had paid (and received what we ordered), our deep dish pizza would have been around $25.  Our thin crust pizza would have been about the same price.  And IF I had paid for it, I would have been pissed off.  

FWIW, the deep dish pizzas LOOKED good.  Too bad I didn't get one.  :-("}
{"text":"Authentic Chicago Style Pizza in the Foothills? Yes Please! Lived their deep dish.  Pizza was layered with sauce on top and cheese on bottom.  Perfect acidity to the sauce.  We also had thin crust cheese which the kids loved and boneless wings.  Everything was very good.  The small deep dish fed three adults easy.   Best left overs ever.   We got this order for takeout."}
{"text":"And just like that. Buddyz kicked my favorite pizza places, ASS!!!! I dont even know where to start?!!  First I was a little annoyed,  thinking it was kinda pricey but then I got the pizza and tasted it and I wanted to slap myself in the face for thinking something so absurd! I got the butter crust Mag Mile and the thin crust The Loop, GAME CHANGERS for AZ! WELL DONE BUDDYZ! This is what pizza always wanted to taste like, and never could. I haven't even mentioned the hospitality in this place, OFF the charts!!  Im blown AWAY!! My new \"cheat day\" place for awhile! I'll be dreaming of this pizza until next Friday. Until we meet again..."}
{"text":"Deep dish pizza, sauce very good,crust very good, sausage good but hard to find on the pizza,(order extra sausage),cheese not much,( order extra cheese,) then you'll have a good Chgo pizza,.ordered deep dish cheese and sausage.just my opinion."}
{"text":"I love Buddyz Pizza.  Service at this location is the pits.  Going back to Queen Creek."}
{"text":"Overpriced yuck.  Went there last Friday night about 9pm.  Had 2 glasses of beer, both reeked of the cleaner they use to flush the beer lines (complained both times to no avail), 2 glasses of the house Chardonnay, and the appetizer sampler plate ($12).  $38 was the total.  Two glasses of crappy beer and 2 glasses of house wine cost $26?  Get real. Don't plan on ever going back, and I don't care how great their pizza is."}
{"text":"My first experience at buddys was amazing. Great food, great service, very kind people. My next two experiences were very frustrating. I called at 8:28pm and they wouldn't take an order because their kitchen was closed. Then Saturday afternoon we really wanted some good pizza to eat while watching football. apparently they open at 4pm. As much as I enjoyed my first visit it's been difficult going back. I hope they can reconsider their hours of operation rather than being open 4 1/2 hours a day."}
{"text":"Oh, My, Good LORD!!!  
My kids and I went to Buddyz in QC a couple of months ago, and I have been wanting to go back...then I heard they moved to Gilbert, and I was ON it!!!  
If you have any inkling of trying a deep-dish Chicago-style Pizza, you HAVE to try this place!

I took my kids to the NEW Gilbert Location, and my eldest and I ordered a deep-dish pepperoni pizza for the two of us to share.  The thing that amazed me was that the crust remained crispy across the entire bottom of the pie...throughout the dinner!  The crust is amazing, and the cheese and tomatoes used were par-excellence!  We will definitely have to go back soon!  My new favorite pizza place in Gilbert!

Locally and family owned, and in Gilbert.... the Trifecta in my book...and GREAT food to boot!"}
{"text":"We live just down the street and after ready the many 5 star reviews we were excited to try this place. Not to mention the fact we've been to Chicago many times and have enjoyed the pizza. I'm a little torn on how to yelp this review because I'm having mixed feelings. First we walked in to a semi full place, and at the same
Time as another couple. We did not order the deep dish but we ordered the butter crust this time thinking we would try the deep dish next time. Not only did it take over 50 minutes to get our 10 inch 2 topping non-deep dish pizza, the couple that walked in with us not only got their deep dish pizza but finished eating and left before we were served. We were not checked on during this long wait, the owner didn't stop by like he did all the other tables, and we had to request our table be wiped down due to it being quite dirty. We had quite a bit of of pizza left and we were given styrofoam to go containers. The waitress seemed put off that I asked for a Pizza box. As far as the pizza goes , the taste wasn't bad, I'm
Sure the deep dish would be better. I am
Not sure if I plan on returning to find out. Customer service is so important, especially in small business and when there's so many pizza joints out there. Hopefully they can make their guests feel more welcomed"}
{"text":"My husband and I took our 5 year old here for the first time yesterday.  Excited that a \"real\" pizza place was open in our neighborhood.  We arrived around 530, midweek, and the place was packed!  Good sign!  They offered to accommodate us at the high-top bar, otherwise a 15 minute wait.  High top it was!
First our server was SUPER friendly throughout our service.  She checked on us frequently and made sure our drinks were full and gave us updates on the status of our order.
I noted the menu warned that the thicker crust options would take 35 minutes.  No problem, being from NYC I prefer thin crust anyway.  We all ordered thin crust which should have taken less time...but took at least 35 minutes to arrive anyway. 
We also ordered calamari appetizer which was quite good but took at least 20 minutes to arrive.  Starving by then - it was worth the wait.
Sadly, I felt like the pizza was not worth the wait.  My husband insisted his was very good.  But I'm not a fan.  The thin crust wasn't great and I was disappointed that pesto wasn't an option as I'm not a fan of tomato sauce on my pizza (weird, I know, but pesto is a suitable alternative to tomato sauce I swear!).  
The kids menu offered the standard options (chicken fingers, etc), but disappointingly no kids-size pizza option.  Our server suggested we go half-half with pizza toppings but in my haste to order I went ahead with the smallest pizza (10\") for my daughter who ate a total of ONE small slice.  Love her.  Lesson learned: servers know their sh!t so follow their suggestions when offered!"}
{"text":"Our second time here.  We were anxious to find out about waiting time from the hostess. Our first experience was too lengthy.  She assured us that given the sparse amount of customers we should be ok.  We opted for a table by the window but within minutes we were  baking and we were blinded by the sun.  The restaurant lacks efficient sunscreens.  We quickly moved to a center table.  It was still too bright.  They really need to address this issue especially now that summer is around the corner.  We got their mozzarella cheese appetizers as starter.  It tasted average and was too oily. We then order a thin crust pizza, 1/2 sausage 1/2 vegetarian.  Ron liked the sausage topping, l liked my garlic spinach topping. We, however, didn't care for the \"thin crust\". It wasn't thin, it was medium thick and stiff, lacked flavor too.  The cardboard effect was on, it didn't meet our expectations.  Because the crust was so stiff,  toppings were sliding off the crust. Staff is pleasant, busy and on top of things.  Unfortunately  there won't be a third time for us. We'll wait for the upcoming restaurant across the street  opening up this summer."}
{"text":"Wow amazing deep dish pizza!!! The food truck was up in Scottsdale got the deep dish cheese pizza for $5 a slice, it's huge. I wanted to try it before driving over to the Gilbert or Chandler. Amazing taste, it's worth the drive."}
{"text":"I gave the original Buddyz location 4 stars because the pizza was freaking awesome (even though the service was spotty). We were excited that this location was so much closer for us and the pizza is seriously just as good, but service just sucks. There seemed to be only two wait staff on duty for Fathers' Day (not that anybody would go out for lunch on Fathers' Day, right??). It honestly didn't look to be that busy, but it took FOREVER. Our actual waiter tried to make up for it after he realized we weren't that happy. The gal with the pretty hair would come by once in a while, ask what we needed and then never brought it.

It was a good 15 minutes before we even got water. Finally we had our wings, and eventually the pizza came. Except that they made one as deep dish instead of butter crust which we specifically ordered. So our choice was 1) skip the other pizza, 2) get the pizza after another 30 minute wait, or 3) let them make the right pizza while we ate the other and then take it to go. They did not offer any compensation for what was a major screw-up. If you want people to come back after that, offer free drinks, free dessert, the pizza for free - SOMETHING. Geez. There are other pizza places, people. And that's where we will be going next time."}
{"text":"Tried Buddyz for the first time it was amazing!!! I moved here 1.5 ago from the Southside of Chicago and by far the best pizza in AZ. Friendly staff and will definitely be back."}
{"text":"Do your self a favor and skip this place - girl on phone and in restaurant barked at me for asking salad dressing on the side since \"they always do that\" - ordered an oak street beach pizza - thin crust tasted like cardboard hardly an sauce or mozzarella- ordered Caesar salad, got lettuce and 6 mini dried up croutons no cheese as outlined in menu - our first try will be our last. Stay away"}
{"text":"Great neighborhood pizza place. Wonderful service and so attentive to our puppy in the patio with a great view of the mountains. Owner Emily  came out and checked on us and our service. This is exactly what the neighborhood needs.  The Daly Plaza BBQ Chicken pizza is amazing and worth the wait. We also shared a small house salad. We recommend the house dressing!!"}
{"text":"The food is very good especially the deep dish. Being a Chicago native it's a pleasant surprise to have it in Ahwatukee. Service needs a lot of direction. There is what I assume is a bar manager who lingers too long with certain guests and doesn't pay attention to others. Had an experience tonight in which the waiter swiped my debit card four times and I received the alert from Bank of America that it was temporarily suspended due to suspicious activity. I don't think the connectivity issues should come at the Expense of the customer now  I have to spend 30 minutes on the phone explaining to Bank of America, WTF!  Just because this guy was impatient and overwhelmed.

Four stars food porn star service and lack of awareness."}
{"text":"We always love to support a local business but when they go above and beyond, have the best staff AND have delicious food?!
The owners wanted to give back to the community and only being open a year, we wanted to help. They donated TEN meals to families in need this year, we just delivered them. If you have not been to BuddyZ pizza on Val Vista and Baseline,  RUN, it's that good!"}
{"text":"Good job Buddyz. Great service, quality food and tasty beer selection.  Chicago style all around. 

Chicago beef with the spicy peppers is pretty legit, the bread is so crispy is a perfect vehicle to soak up gallons of delicious beef juice and get way too much nosh into my belly. 

Thin crust is certainly a valiant effort on thin crust also delicious, no question but also done in Chicago fashion. Just a thicker and crispier than I prefer but if your looking for an appropriate tool to deliver crazy toppings to your Mouth it's a winner. 

Chicago style deep dish is certainly a nod to a local classic. Taste is on 100%. However it's literally a complete meal so so so much food. 

Recommendation. Try everything. Order a Sammy of your flavor, a large thin crust (I recommend 2 toppings at best- too much can be too much) and a small deep and you'll get the best sample of what's available and love it also. 

Tip: skip the flavored iced tea and go straight for beer (if you can) the flavored teas are way too sweet for my tastes, stick with a solid standby with just regular iced brew."}
{"text":"Took the family there for the soft opening. Ordered two appetizers: home made house chips and pizza chips - very good. For dinner, I had the chopped salad - great. The wife and youngest had a pizza. Pretty thick crust (cake like) but they enjoyed it. The oldest had the spaghetti bowl. Not sure it was his favorite ever but he did eat it. Staff was friendly. Next time I go in I am going to try the thin crust."}
{"text":"ok I love this place, 

The Pizza is great. And my wife will kill me. The Girls are super awesome and look great!  You got a great shop here. I just wish you were open sooner then 4. 
Customer Service is AWESOME!
PIZZA Tastes Great! 
I just love coming here."}
{"text":"This is a great pizza place, don't know what Jens problem is but when you start name calling you sound like a cunt looking for a free meal, I've eaten at least 6 pies frome here and not one has been bad, if you're from Chicago you know it takes longer to bake then a standard crust. Do the state of Arizona a favor and go back."}
