{"text":"Blech! Ordered 4 pizzas. The \"Good Karma\" was inedible... Piled high with spinach gone bad. The special of the day \"Mexican\" pizza was WAY too cheddary. The \"Buddha Bomb\" was OK and the \"Presto Pesto\" was the best of the bunch. The crust was the worst we've ever had. Pics online show a wood-oven type thin chewy crust but in reality the crust on my 4 pizzas was an unleavened, cracker-type crust with visible fork holes. The worst meal we've had in the city since moving here 1.5 years ago."}
{"text":"I've heard many good things about Buddha Pie, and today was the first time I happened by when they were open. Johnny (I think I got that right?), the owner, was in on a Sunday trying out a new dough, and was happy to serve me (and to answer my questions about how he got started). He even fed my dog some chicken.  Because the bus trip home was pretty long, he gave me tips on how to reheat it in the oven.   Then, when I got home... oh my god, the pizza. A crispy, thin crust (even after reheating) with just the right amount of everything on top of it. Absolutely delicious.  It's not super convenient for me to get there, but I will definitely be going back. I will go out of my way to go back."}
{"text":"The pizzas here are simple, made with fresh ingredients, and great.  The owner is very personable.   The place is small, with only three tables. I believe most of their business is take-out.  They let me do a high degree of customization on my orders, replacing ingredients, sauces etc. to get the pizza I feel like eating.  I like the ambiance."}
{"text":"My husband and I ordered two pizzas from this place. So incredibly bad we thought it was a joke. Completely inedible.  Update: Owner wrote to me saying that we have not been there. Trust me we have and seriously it's terrible and the owner is obviously to busy responding to Yelp reviews to instead of running his business."}
{"text":"above average pizza, above average prices.... wouldnt get the bbq chicken again"}
{"text":"This pizza joint is one of a kind. Unique menu of pizzas. Great customer service. Good music. Very upbeat. And the pizza, spectacular!!  I go here regularly as well, obviously because its so good. It's like a gourmet pie."}
{"text":"Amazing!    We called in an order tonight, a busy Friday night. We ordered one vegan pizza on a gluten-free crust and the Zen Margarita.   When my husband went to pick it up, the person told him that they'd accidentally made the vegan pizza with cheese. They'd already remade it without the cheese, but would we like to take the cheese one too? Of course he took it - who passes up free, tasty pizza, after all?    So delicious. My husband raved about the crust, and the gluten-free crust they use is really good.    Highly recommended if you're looking for more gourmet pizza!"}
{"text":"Maybe I'm biased because I live close enough to go home and relax while my pizza is being made, but I'd say Buddha Pie is some of the best pizza in the city.   The BBQ Chicken is tangy and, unlike lots of barbecue pizzas, doesn't taste like store-bought barbecue sauce. The Presto Pesto is a delicious option for people with an irrational dislike of tomatoes. On all the pizzas, the sauce is great and isn't slathered on excessively.   And the owner is infectiously enthusiastic and happy about his food. He's given me a taste of the cheese before he's put it on the pizza, just to show how good it is. And when they ran out of containers, he gave me an actual plate to take my sandwich home on, since he trusted me to bring it back. That kind of little touch goes a long way.  Also, they sell Pop Shoppe pops, which are awesome.  So yeah, I am recommending Buddha Pie, for sure."}
{"text":"The pizzas are very small and they only do thin crust. If you like thin crust pizza then you will love this place. But I like my pizza thick and doughy. The selection was good"}
{"text":"serving up gluten free thin crust pizza and sandwich's with the best ingredients, plus great coffee!"}
{"text":"My go-to pizza place when in Toronto. Such a great vibe when you walk in and the pizzas are never less than amazing! I would definitely recommend the 'Fun Guy' pizza - my favourite. The only thing is the size of the pizzas are a little but still, the flavour is wicked awesome, I can never get enough."}
{"text":"Quality ingredients, friendly owner, great selection of pizzas, crisp crusts. Try the margarita."}
{"text":"Awesome gluten free pizza.  So happy I found this place.  A little pricey, but worth the treat.  The only challenge seems the inconsistent hours and boy it would be awesome if they delivered as I need to time the bus to and fro."}
{"text":"Awesome regular and gluten free pizza! Officially have found a new spot in the area.   The guys that run this place are a good time, always up for a chat and can hammer out a great pizza for pickup in 15-20 minutes. FYI no delivery. Highly recommend!Attached picture is the regular BBQ chicken and a gluten free buffalo Buddha"}
{"text":"Buddha Pie is hands down one of the best pizza joints I've been to since moving to Toronto! The Presto Pesto with Goat Cheese   (Gluten free) is absolutely fantastic, we get it every single time. It's hard to find a really good gluten free crust, other pizza joints always taste like cardboard but at buddha pie it's amazing, you don't even notice that it's gluten free. Definitely anyone in this area needs to check out Buddha Pie for an awesome meal!"}
{"text":"Best darn pizza. I have been here a few times and tried different pizzas each time. They're amazing. I recommend them to everyone. Also lovely staff and great music."}
{"text":"What exactly is a Buddha Pie?  It's a delicious, thin-crust pizza loaded with toppings and eating it makes you feel so good that you want another.  This place took me by surprise. It used to be a coffee shop. They still serve great coffee, but now you can get pizza, sandwiches, and a fun soda from the pop menu.  It's very small place.  Three small tables inside and one table outside. Buddha Pie appears to be the talk of the neighborhood.  There was a steady stream of new customers who ended up there because they have heard good things about the place.  Even though the menu may not be large, they have something for everyone.    I tried the pesto pizza with goat cheese, fresh tomatoes, onions. It was fantastic...and with a grape soda, even better!  The owners are incredibly warm and friendly.  This place is going to be the go-to pizza place in the neighborhood."}
{"text":"I don't usually do these but the owner just rubbed me the wrong way. I walked in 5 minutes early his door was open and he said, \"hopefully you are not here for food the only place open is the sushi place.\" So here I am eating at the sushi place I'll never come back."}
{"text":"Didn't actually eat here. However, here's why they deserve 4 stars.  I am here looking for an apartment and I'm in a suit. I'm an articling student with a law firm. This is a place which focuses on organic cooking, great ingredients and living and supporting your community. Not always a match that goes hand in hand.  Not only was there no judgment that I only ordered a drink so I could wait for my appointment, they took the time to let me know about the area and how amazing this neighborhood can be.  Oh, and their menu is intriguing and sounds delicious."}
{"text":"Very good food with a friendly atmosphere. Owner and staff seem really nice. I hope they can stay in business with the rent increases that have been happening in their neighbourhood.   Mainly a take out spot but there are a couple of tables for dining in too. Great marinara sauce on the customized veggie pizza that I ordered. Super tasty. I also like the thin crust which is a bit chewy and delicious."}
{"text":"Delicious!!!  The Zen Margherita pizza was fantastic and the owners are super awesome and really friendly.  Im a fan :)"}
{"text":"This place has great Pizza and Sandwiches!  Super thin crust, excellent ingredients and great prices!  I keep going back and it continues to make amazing pie and sandwiches."}
{"text":"Great people making amazing pizza.  Get the Presto Pesto with chicken!  I could eat this everyday."}
{"text":"Cardboard crust. Owner overcharged us on veggie pie and was dismissive. Won't go back."}
{"text":"We have been wanting to try this place for quite a while.   We finally got the chance tonight. It was a rather unfortunate experience.  Our pizza was burnt and thus overly crispy.  My fiancé got take out then picked me up from work.  By the time we got home,  the pizza was no longer edible as it was way too crispy and salty. It was also so greasy that it stained the car seat.  I wonder if the person who pulled it out of the oven didn't notice the obviously blackened bacon.   I'm shocked that they didn't offer him a discount, a redo or even a free pizza.   He didn't know that it was burnt until we got home and we are too far away to go back. There was also an unusual afttertaste that I can't quite place. A very disappointing experience. My fiancé, one of the long lost Ninja Turtle brothers will still give them another try though."}
{"text":"A rustic pizza shop owned by two people who are passionate about their pies. The owners are not only super friendly but like to discuss the recipes and ingredients used in their pies.  We are addicted to the pulled pork pizza which  is topped with amazing coleslaw when it comes out of the oven.  Our more simple go-to pizza is the margherita. If you want a small dinner for two one pizza will suffice. But if you want to walk away nice and full, two pizzas will do the trick.  If you go once, you will return many times for what can only be described as a zen pizza experience."}
{"text":"Flavourful crispy pizza in a small but welcoming shop.  About 4 or 5 tables but the people there are super friendly and helped us decide on our orders.  Had the good karma pizza, and you can taste the onions, artichokes, and seasoned chicken. I wanted to try the pear and proscuitto, i'll do that for next time if i'm around the area. My friend had the mushroom and cheese which is simple comfort food.   The pizza crust is thin and crispy, almost like a pita. If you're into a more dough-y thick crust kind of person, it may not suit your fancy.  Environment is friendly, casual and comfortable with upbeat music :) The staff made conversation with us, which I appreciate, especially John, the owner. He gave us his special chipotle sauce with carrots and lime to try and it is not the typical sauce drenched with mayo, it's quite refreshing in the sense where you taste the apples, but it's not mild in flavour. He recommended a great french bakery, and showed us his favourite ice cream."}
{"text":"I agree with Matthew's & Leslie-Ann's reviews. The pizza is probably one of the better ones in the area, but it's still not \"great\". In fact, I find there to be a residual taste to the crust, that I think comes from the olive oil spray they use when they press the dough to thin it before baking.  The sauce is excellent, and the toppings are good. I do find it a bit pricey for the size of the pizza you get."}
{"text":"This place has this interesting 'hippie' feel to it. Can't really put my finger on why.  So we can to put in an order. We go for pickup, and someone else goes in first. He brings two pizzas, they say, yep that's it. Luckily we overhear and tell him that's our order. Why would there other people claim there order was theirs? We must have chosen good toppings and they didn't want their gluten free ones.  The problem lies in why a name was not taken when accepting an order?  So onto the pizza. Actually, it was really good. No more think crust pizza. This is a regular style with crust pizza. There toppings tasted very good, the crust did not taste like cardboard.  I would comes back. Local small business owner for the win! But take a name to sort through your orders!"}
{"text":"First off they've got a Blues music streamed in from some internet station. That alone is good for one star. This tiny little hub of a pizza place on Annette St. is a neighbourhood gold mine for absolutely delicious pizza and stand that spoon straight up in your organic, fair trade coffee. I'm a funny girl when it comes to the 'za. I either love it or I hate it. At Buddha Pie it was an absolute love affair from first bite.   It is a super thin crust pizza (and I think gluten free) with a big crunch factor and I really dig that. The thing that sets Buddha Pie's pizzas apart I believe is the tomato sauce. I ain't tasted sauce like it here at any other pizzeria in the city, not even Libretto, and that is saying something. They use a brand of tomatoes called Valaroso and this is where their magic starts. The only place I've tasted tomatoes akin to these was in the Tuscan region in Italy. Add another star!   Buddha Pie also sources their cheese from the Cheese Boutique so tally up another star for that smart move. Not only using premium cheese but sourcing it from a local business. I like these guys more and more. The fresh basil hadn't been obliterated into pulp so it was a real treat to taste it against that gorgeous tomato sauce. Tomatoes and fresh basil, one of life's most simple yet most savoured pleasures.   The pizza menu is small, offering up 5 choices (three of them are meatless, two all cheese types, one vegetarian), then your traditional pepperoni & a BBQ chicken option. All pizzas are prices $12.99-$13.99 and are perfect for sharing for two. The menu also offers up four sandwiches all prices at $7.00. Can't speak to the quality of the sandwiches but I'll definitely be back to BP to check them out.   I took my girlie pal Barb for lunch and she loved it. Pizza and two lattes set us back $20.50. My only complaint would be that it would be handy if they gave us a little plate to eat our pizza off. The pizza got put down on the table and they gave us some napkins. With that being said we managed but I know this would be a sticking point for some people. It's a tiny spot, seating for about 10 people so BP is really geared to the take out crowd.   Finally the fourth star for the really cool couple behind the counter who really show their customers the love with such great pizza and make you feel just like an old friend dropping in. When they put the pizza down on the table he asked us...\"this your first pizza with us?\". They cared and it showed. I've made some new friends on Annette. I'll be back to Buddha Pie. The 'za awaits."}
{"text":"I got a cheesesteak and it was tough as hell it was pretty fatty and it was very blan..to make things worse they were very rude and uninviting, I just felt awkward.  I'm sticking with IWTP"}
{"text":"Went here after a day at the CNE. Some very interesting pizza choices. We ordered 4 pizzas (for 4 people) (very veggies, mediterranean sundance, Buddha bomb and buffalo buddha)  Nice decent flavors.... the only cons...would be you have to pay extra for gluten free crust? I was under the impression everything in the restaurant was gluten free, the restaurant is really stuffy ...way too hot and I found the crust to be on the hard side... almost like a pizza cracker? lol The poor guy was over worked... they definitely need an extra set of hands in there and a fan..."}
{"text":"There was another review that gave a lot more detail, but I will try to put it all in a few points.  1. The pizza here is about average. To say that the pizza here was amazing would be overdoing it, perhaps to the point of saying Pizzeria Libretto did not exist.  2. The pizza is thin crust. It has decent flavour and quality toppings, but is just ok.  3. Prices here are reasonable at 12-15 per pie. Two adults could share one a be comfortably full.  4. The night I ate here they did not have drinks of any kind, so I went to the corner store for a pop. Seating is available, but limited.  5. The owner is an absolute delight. You will want to come here to meet someone who is more passionate about customers than just about any business owner anywhere.  All in all, good but not great. Amazing service."}
{"text":"Crisp , yeast crusts  Minimalist decor BYOB! Fab pizza  wi thoughtful ingredients- simple is better Such a cool owner chef TRY!! Of the earth"}
{"text":"Amazing pizza options including gluten-free dough! This place uses fresh pineapple instead of canned which is important for me since it's my kids favourite topping. Would definitely order from here again!"}
{"text":"I stumbled across this place by accident and I'm glad I did.  I was intrigued with the name and the look of it.  Some of the best places i have eaten at were holes-in-the-wall kinda places.   This met that prediction is spades.  John and Beth were working - I know that because they introduced themselves and knew practically everyone by name. I tried their Buddha Bomb and it was all that i had hoped for.   They have a great little thing going there - nice people, relaxed atmosphere and the pizza is some of the best I have ever had.  Their hours are a little light but maybe I'm just jealous.  Cheers!"}
{"text":"I'm writing this review because somehow my old review can't be found anymore but the experience was SO BAD even though it's been a couple of years I'd highly NOT recommend people to go here.  I was there with my husband and we were sitting on the tables outside of the window, with my view facing inside the pizzaria. As our pizzas were taking out of the oven I see the owner (white hair, oldish guy) drop the pizza on the ground pick it up and place it back onto the plate!!!! At the point I'm saying to my husband 'Omgosh he just drop the pizza and now he's literally bringing it out for us to eat!' When the pizza arrives half of the pizza is COMPLETELY MANGLED like the tops are all gone and unrecognizable, I say to him 'Ummm, I just saw you drop that pizza!' To which he said 'NO' and I responded with 'I saw it with my own two eyes you dropped it, pick it back up and brought it to us.' Then he retaliated saying he 'well I DIDNT are you calling me a liar?' .....!!!! I was so angry at this point, why the f would anyone accuse someone of dropping a pizza and the worst part is he won't even own up to it... He just walks away. I go in and tell the waiter who's working behind the counter that were leaving cause he drop to pizza, he just nods because he saw it happen as well.   WHAT the f kind of service is this. Never go here, if he can do this kind of dishonesty right before our eyes I can only imagine what goes on behind closed doors, recycled food, old stock? Maybe. I also read another poor review from someone else here on Yelp of this restaurant and the owner personally messaged her saying that she's never been there before...! Ummm he sounds kind of PYSCHO."}
{"text":"I've been delaying reviewing Buddha Pie for some time. I really want to like this place and I feel bad giving it an average review given how awesome the owner is and how much potential there is. But, the bottom line is that despite the amazing reviews here and elsewhere (e.g. BlogTO) the pizza here isn't that amazing.  The owner and operator of this small pizza shop is awesome. The minute you walk in the door he starts chatting with you like you're an old friend. He's very proud of his pizza and will explain all the ingredients to you and walk you through the process of making a pizza.  The dedication to top quality ingredients and craftsmanship is impressive. Buddha Pie's flagship pie, the Zen Margherita, uses Mozzarella di Bufala and Valoroso tomatoes imported from Italy; tasty, locally-sourced basil; and high end flour. The owner is genuinely interested in what his customers think about his pizzas and is continually improving his method.  The pizza is a decent imitation of a traditional Neapolitan pie but nothing more. It could be so much better considering the high quality ingredients. Unfortunately, I think the fact that the owner has no prior experience cooking professionally is working against him here.  First, the tomatoes are excellent but should be pureed or at least crushed up rather than left whole. The basil is put on fresh after cooking. An interesting idea but it fails to bring out the full flavour of the herb. It's hard to go wrong with Mozzarella di Bufala but it doesn't seem to melt quite right; I think the oven needs to be hotter.   The dough is in serious need of improvement. Buddha Pie makes their dough fresh every night but they don't seem to understand the delicate art of breadmaking. They use Fleischmann's yeast rather than a nice, natural live yeast. And, while I'm not a bread expert, I believe the process they use for making their dough needs improvement. The dough tastes too much like pre-made grocery store dough to me. If they want a proper traditional pizza they'll also need to get a hotter oven to get a nice texture to their crust as well.  The end result is a good pizza but it tastes like something you'd make yourself at home not a traditional Neapolitan pizza. My theory for all the amazing reviews is that people are swayed by the owners friendly personality and his talking up the ingredients. I was even raving about how good the pizza was until a couple hours later when I started to evaluate it critically. But, who knows, maybe some are just into this style of pizza.  I don't want to sound like I'm trashing Buddha Pie too hard. I like this place and it has massive potential due to the impressive commitment to quality and self improvement. Over time the pizza will certainly improve. I think they would especially benefit if they temporarily brought in a proper pizza maker or baker  to show them the ropes."}
{"text":"A few major blips--mostly in service--detract from good food and good intentions at this west side pizzeria.  I had to go way over and out to this neighbourhood at lunchtime recently, so I popped in. I've heard the pizza's good, but I've been hankering for AGES for a real-deal Philly Cheesesteak sandwich, so I was excited about trying theirs.  The first disappointment was that apparently they were out of these. At 2.30 in the afternoon? But yes, it happens, so no big deal, although already my disappointment was tainting the experience. I didn't want to get a whole pizza to myself, and the server encouraged me (with a free taste--excellent sales strategy) to order the homemade black bean chili.   What actually convinced me, though, was the description of the chill on the board, which stated it came with a side of jalapeno cornbread. That clinched it for me--what better on a cold day than a slab of warm, homemade cornbread?  So my second major disappointment was that the chili arrived without the cornbread, and a chunk of ciabatta instead. The bread was fresh and chewy, but it wasn't the cornbread I wanted. Worse, I wasn't told when I ordered that there would be no cornbread--and I may well have ordered something else had this been the case. Instead, when I mentioned the missing cornbread upon paying, the server said, \"That's because I haven't made it yet.\" Okay, first of all, if you managed to get to 2.30pm without having time to cook a featured item on your daily menu, maybe reassess your scheduling.   Second of all, and more fundamentally, if you don't have it, don't put it on your menu. Simple. This subtle deceptiveness is all over menus and the restaurant industry, and it means customers trust menus and restos less and less. When I order a meal, I expect to receive it as described, and when you're dealing with a chalkboard (as at Buddha Pie) rather than a printed menu, it's even easier to make the necessary alterations to the menu--and there's no excuse for not doing so.  In their defence, the chili itself was excellent: rich, thick, with complex but balanced spicing, and a generous dollop of sour cream; liquidy enough but not watery, with pleasant crunch from corn kernels and heft from beans. (But then again--I also make a great chili. Chili is not hard, and I could have made it at home.) The music was great too, though, and the staff seemed cheerful and nice enough. The styrofoam bowl the chili was served in was a bit of a turn-off, but again no biggie--it is a takeout joint after all. However, the final problem came when I paid the bill.  The meal I ordered was advertised as $7.95, and I ordered no drinks or extras. Yet my bill came to $10.12. Even with 13% HST added, the total should have only come to just under $9. So where did the extra dollar and twelve(ish) cents come from? The bill I was handed wasn't itemised so I have no way of knowing. Again, this kind of thing comes down to trust. They may seem like small things, but the fact that a) I didn't get the meal I ordered and b) I was apparently overcharged for it are enough to make me really skeptical about whether I would go back (especially if the same inconsistency that means they hadn't got to the cornbread yet also means I can't be guaranteed that I'll get the sandwich I actually wanted in the first place). I won't be back until I happen to be in the neighbourhood again, when I'll be happy to give them another chance, but if the same problems resurface, no more Buddha Pie for me."}
{"text":"Amazing crust and such creative pizzas! The funguy is my favourite. Also the owner is hillarious and very welcoming"}
{"text":"A personal pizza pie prepared in under 15 minutes you say? Inconceivable!  Well not at Buddha pie, heck you can even get a delicious Aiden's gluten-free crust if you ask. Now that is Amore!  Buddha's is a cozy lil' pizza place with a small seating area.  Empty boxes of pizza line the walls with drawings on them created by gratefully pizza satiated kids and artistic pizza lovers.  It's never boring while you wait for the pizza here as there's plenty of diversions, from reading the off-beat Blues Music posters (and of course there is some groovy Blues music playing in the background complete with images of Jake and Elroy plastered about) to the wise sage advice offered from books like \"Everything I know I learned on Acid\" scattered about the place.   Hubby ordered the Memphis pulled pork which is gourmet smoked pulled pork in signature BBQ Sauce, freshly sliced Mozzarella and then topped with homemade  \"Buddha Slaw\".  Hubby's reaction once eating this meal atop a pizza was just simply  \"MmmmMMMmmmMmmmM!!\"  I got the Very Veggie on a gluten free crust, sans onions and added goat cheese and I gotta say, it was pretty damn well the best G-Free pizza I've had in TO!!  The owner here is a super cool and friendly dude who also knows alot about sound tech was having an intense convo with hubby about speakers and headphones, and don't you know it by the time they started talking 'bout Sennheiser headphones our pizza was as good as done.  On my way out friendly owner/dude and even gave me a little brown paper bag filled with fresh sprigs of Basil to put on my pizza.  Talk about great friendly service!!!  Did I leave Buddha Pie knowing what the sound of one hand clapping was like...hmmm, maybe not, but forsure my tastebuds did experience a moment of pizza inspired Satori!!!  Please get your ass to Buddha Pie NOW, your later reincarnations will thank you for it!!!"}
{"text":"I was shocked to find that such great pizza comes from this small shop on Annette St.  We ordered 2 pizzas for pick up and were told that they would be ready in about 40 min.  We got the Zen Margherita ($13.99) and the Presto Pesto with goat cheese ($14.99).  Both pizzas were great.  Sizing is a bit on the small size.  The Margherita pizza came with a bunch of fresh pesto that we could add to the top.  I actually found the cold leftovers of the Margherita tasted even better than the fresh pie.  Mostly a take out place but there are 1-2 tables inside for seating.  Worth checking out and better than Pizza Pizza and Dominos."}
{"text":"Buddha Pie is better than many other pizza options in this area but I do not think it is one of the best pizzas in the city. One of the biggest downfalls to the Buddha Pie pizza is the crust, it just does not seem right. I have eaten pizzas all over Italy and in Toronto and just don't think this crust is up to snuff. It's better than, say, Pizza Pizza, or one of the chains, but it is not as good as it could easily be. The canned tomatoes, although imported from Italy, are a big problem for me, especially when used when fresh tomatoes are available. The tomatoes, to me, taste like canned tomatoes, a bit tinny and acidic, not fresh. If they were made into a sauce, this might bring out some of the sweetness in them. They also make the pizza a bit soggy, letting them drain a bit before using them may help this problem too.   Buddha Pie has its issues, but the owner seems extraordinarily pleasant, and the pizza, although not perfect, is better than the average take-out, especially in High Park, which often feels like the bermuda triangle of take-out options."}
{"text":"This place is the bomb. I don't know why I ever bother getting pizza from anywhere else. Definitely my favorite pizza place in Toronto. My favorite is the Smoked Chicken pizza with béchamel sauce. YUM. And the owner is so sweet and funny and great with kids. Not much seating, but worth standing up and eating the amazing pizza if you have to."}
{"text":"We moved to the neighbourhood two weeks ago and have been here twice already.  I got the Pear and Black and Blue pizza the first time.    Both were great and last my husband and I three meals but I will order the Black and Blue without mushrooms next time as I wasn't really a fan.  The second time we got a Quattro to split and it was very very good.  Again one pizza was two meals for us so at $15 that is a great deal.   Remember to bring cash or debit as he doesn't take credit.   I look forward to trying the whole menu!"}
