{"text":"Their lunch menu isn't very good but their dinner menu is great. They have a large variety of food that all tastes good.   They have a live singer at night though, so it's pretty loud. The decor is also pretty old.   They have friendly and fast service but don't really speak English.   All in all I enjoy eating here."}
{"text":"Come here on a Thursday, Friday or Saturday night!  Because that is what I am doing next, next and next Thursday. This place offers something special that you can't find anywhere else in Scarborough. Live band with experienced Hong Kong lounge singer in a HK style cafè. I felt a weird vibe when I sat down because this place is located in a sketchy ass looking plaza. On top of that, they still have the  decoration for Chinese New Year and Christmas on their walls. Regardless of all these flaws, everything about this place suddenly became enjoyable when the music started. The live band even does a bit of crowd work and took request all night. I highly recommend you give this place a shot because it is an unique experience."}
{"text":"This is the best HK cafe overall in GTA (that I've tried). I've tried HK Bistro downtown, which was ridiculously cheap but with questionable quality. I've tried Cafe Triomphe which is pricey and only passable quality. Buddy offers a large selection of HK Cafe dishes at VERY reasonable prices.   They have a lunch special menu and I ordered Portuguese chicken for just $7.50 + tax. It includes a drink and soup. Cafe Triomphe charges $9.99 for the same thing and you have to add $3.50 for a drink and soup (plus tax). The value is clearly here when you compare with other places. Portion size is great too. Tastes great too.   Will come again."}
{"text":"I don't mind trying new Hk cafes. I love the style of food and the variety of food. We were in the area so we decided to try this place. Once u walk in it is already a weird cafe with a live band stage on one side. The restaurant is really old, run down and dirty. I understand it's a Hk cafe so decor isn't important but i shouldn't feel like it's dirty. The carpet on the floor seemed dirty and the table and sauces had a film of dust.  I didn't find the menu to have a lot of items and the food wasn't that great. I ordered a corn beef and egg sandwich and there was a lack of egg or corn beef. The chicken wings in the other hand were huge but flavourless. Don't think I'll be coming back here even if I'm in the area."}
{"text":"I like this place. I find the workers here rly nice and their food good. I ordered a hk tea and a sandwich to go and they packed it all up for me and didn't mind me sitting there while I waited for my ride. Definitely a good place for a quick bite. It's not luxurious in decor."}
{"text":"I can't recall the last time I was at a restaurant and felt so displaced. Upon walking in, I first noticed the Christmas decor...before even getting to the interior of the restaurant. Turning into the interior, I then found myself wondering why it was so dark. There's mood lighting, and then there's this. It was just dark. The inside looked like a wonton noodle restaurant...with strobe lights. Yeah. The round tables are square tables that have expansions to make them round. Very obvious extensions. No tablecloths here! An awkward, tiny little candle is placed in the centre of the table. Tea is served in brown plastic cups. The bowls are typical Chinese restaurant bowls. The plates are like big teacup china saucers, complete with floral pattern. It doesn't fit together...at all. Did I mention that the strobe lights are on? Yeah. While I'm having my baked rices and chow mein, the strobe lights are blinking in fluorescent greens and pinks. That's a first.  It's a Tuesday night. They have a live band with a singer, a guitarist, a drummer and a guy on the keyboard (keyboardist?) There were 17 patrons in the restaurant including a baby under the age of one, and a toddler under four. Less than a fifth of the restaurant was occupied. Do I detect an issue? If you're paying a live band to play for 17 people, the money has to come from somewhere...  The menu. It's a mishmash of Chinese tea house (cha chan tang) classics like baked rices and sizzling plates, Chinese entrees (stir fried green beans with salty fish), and Filipino entrees (sisig sans rice anyone?). It's also more expensive than I've ever seen before. Yeah. We're paying through the teeth so that we can listen to that four piece live band.   Had:   Shredded pork chow mein ($11.99) - Crispy noodles, but sauce was a tad bland. Most expensive shredded pork chow mein I've had, and it definitely wasn't worth the price. The same item at lunch is $5.99. Not cool. (Insert musical interlude: salsa time! One older couple begins to dance.)  Baked pork chop with rice ($10.50) - Comes with soup. Russian borscht was decent. Pork chop had some crispy bits. This sounds very odd, but my piece of pork chop was both tender and chewy (tendon? ligaments? whatever they were, I didn't like them). The tomato sauce was not tomato-y enough. What I mean is that they put too much thickener (I'm guessing cornstarch and water). The rice base had a bit of egg in it. I'll give them that. There was also cheese on top. (Insert musical interlude: Rumba time! Singer's words, not mine. Older couple still dancing. Strobe lights still pulsing. My nerves are still twitching.)  Baked ox tongue with rice ($10.50) - Also comes with soup. Same tomato sauce as above. Also same rice and cheese. My piece of ox tongue was really thickly cut, and tasted and felt like chewy beef shank. It also had a funky aftertaste. When done properly, ox tongue is supposed to be like butter. This was definitely not butter. It also didn't taste like tongue. Not pleased. My dad's piece was also chewy. My mom said hers was tender. She got lucky, I guess. The cheese in this dish gives it an almost tomato cream sauce taste. Like when one mixes the tomato and cream sauces in a ying yang fried rice. Not unpleasant, but unexpected. (Musical note: We're into rock and roll now. Um...not with my food please)  Baked Portuguese rice with seafood ($10.25) - With soup too. This one was the cheapest thing we ordered. It was also the most decent tasting. The others I'd give a 2/5. This one was a 3/5. Solid. I would have preferred the sauce a tad stronger, once again, but this one didn't taste like thickener. This one also had a decent amount of seafood. The shrimp I had tasted pretty good.  Trying to get the waitress's attention the entire night was interesting, but not in a good way. Raising one's hand in the dark doesn't do much. Using one's voice doesn't work particularly well either. I was trained to use my indoor voice indoors. I walked over to the waitress to get our bill. Even next to her, she couldn't hear me above the music. I had to yell. Actually yell. Then while I yelled, she still didn't understand doggy bag, so I had to mime as well. Should anyone read this and still decide to come, remember: non-verbal cues are your best friend.  If you enjoy live music in various musical genres, a relatively spacious (empty) dance floor, and strobe lights with your Hong Kong style teahouse (not), then this is the restaurant for you! P.S. If you're into kareoke, the menu states that you are allowed to sing two songs on the kareoke machine while the live band is between sets. Have fun!"}
{"text":"the corned beef & egg sandwich was disgusting  bread was cold & tough; like Wonderbread that's been left out for days  corned beef didn't taste right  and unlike the photos posted on yelp, the layer of egg was so thin that at first I thought it was scrambled w/ the corned beef  altogether, it was a big ball of mush in my mouth  took a bite & immediately wanted to gag  never have I been so revolted by a sandwich  and along w/ a milk tea (which had no tea taste & thus most likely instant-made), I was charged $7.60  this is ridiculous considering the quality & market price of ~$5; would have rather thrown my money down the lake   oh, and dont even get me started on the service  the server was sitting & didn't even bother to get up  just pointed me to the counter w/ a face that obviously implies she doesn't want to be there decor is also outdated, dim, and dirty  doubt they'll last any longer if they don't shape up"}
{"text":"I've been coming here a few times now. This place is getting worse and worse. The first and second time here the food was pretty good if you order dried rice or dried noodle.  One night I walked inside when there was singing and I sat down for 5 min where was no one serving me. The waitress was just chatting so I walked out. The next time I came to eat the HK Chinese style fish and spaghetti the fish didn't tastes right. Then the worse time was the last time when I other special noodle. I waited 10 min then I saw the cook came out of the kitchen and saw me. He ask the waitress if I order anything. That's when they realized my order wasn't in. 2 min later I over heard the cook asked the waitress if there was shrimp in my noodle. Wtf??? The noodle finally came and it suppose to taste little sweet but it tastes like a normal salt tastes noodle. Wasn't even sure how it tastes. This will be my last time coming here. No wonder every time I walk in around 2-3pm there was no one here. Before it had at least few table when I walked in. I think they should change the staff and cook."}
{"text":"4 star from JK?....well I gotta try this place now. Got the spaghetti bolognaise, baked fish with rice, a corned beef scrambled egg sandwich and a HK style milk tea. My Chinese is piss poor so I had to show the waitress what I wanted based off JK's posted pictures. The sandwich was heavenly and done to perfection. Everything else was okay. I found the first bite to be very good at first but after a few more bites the food tasted boring. Good think I had my HK style milk tea to keep things interesting. Overall it was a decent meal and its a great place to get my milk tea fix."}
{"text":"Black peppercorn chicken steak lunch special tastes really good and is very cheap at 6 bucks plus tax.  Comes with soup and a drink for that price probably one of the best values in Gita."}
{"text":"Don't be fooled by the no frills appearance. It's the best hk cafe in the area. Great HK milk tea. The curry beef brisket is also quite good. Also unlike most hk cafes the waitress women are really nice."}
{"text":"This use to be my go to place for a quick takeout after work before heading back north. Food use to be solid, tasty and service was pretty good. It was a solid 4 star because the food was that good. That was months ago.  Fast forward to a few months later and the chef has left. It's sad because the food isn't what it use to be and it's not even passable imo. Luckily I ordered the fried chicken leg with sausage on rice. Honestly, you really can't screw this dish up so I was lucky. My mother didn't fare too well. She ordered the baked beef bolognese with spaghetti.The sauce was very dry, had a really nasty frozen old meat taste to it. It lacked the correct seasoning, had very very little tomato sauce. There's really no where on the dish to even hide the bad taste because its just meat sauce and spaghetti. My mom could barely finish 4 bites of the dish and had to push it aside. My mom isn't a picky eater like me, she always finishes her food no matter how mediocre it is.    When the waitress came over to pick up the dish she noticed the amount of food left and asked my mom about it. My mom just quietly told her the dish tasted really bad and asked if the chef left. We were notified that the chef left a few months ago. About 10 minutes of so another waitress came over and picked up my plate and made small talk with mom. It seems like the waitresses/owner cares about their customers and they notified the manager/owner about the issues.   I will probably come back in a few months to see if they've changed chefs and give it another try."}
{"text":"We stopped by because we wanted to give this place a try as it was new in the area. The ambiance was definitely lacking. The place is dirty, dark and no renovations have been made since the previous restaurant. The menu in my opinion for the dingy place was overpriced so I expected higher quality food to make up for it but I was really let down. Service is also extremely slow. We ordered two noodle soups. Pork chop noodle soup and fish broth vermicelli. The first one came in 5-10 mins, but the second one didn't come until my friend had already finished her food. I mean, if there was any complications or required more time to make, they should've let us know or indicate somewhere on the menu that this particular item would take longer to prepare. It was absolutely ridiculous and an awful experience. We basically had to take turns watching each other eat. Will not be returning."}
{"text":"We came here on the way to Thousands Island. We were craved for HK style cafe and stopped by hoping enjoying a good authentic Cantonese meal. What a disappointment! We regretted and would never returned. The restaurant was not clean and we were afraid the same of the food. We ended up left mostly of food on the table."}
{"text":"\"wanna go out for lunch?\" says my friend \"not really but i want HK milk tea\" i replied  So during our lunch break, my friend picked up me up and took me to this little joint not so far from where I was. The restaurant was near empty during the lunch hour, but the service was so nice. We were seated and given menu that i found surprising - it didn't just have hk cafe items, but a ton of cantonese cuisine dishes and cocktails. You have to flip the rather thick menu all the way towards the back before you can find the lunch specials that exist for hk cafes. I didn't really like what was offered on the lunch specials (all rice dishes) and got a satay beef rice noodle dish ($8) while my friend got the special with spaghetti bolognaise. The lady working there was super nice and gave me a soup for free and I added on the HK-style milk tea.   I should add that the lady greeting us and taking our order is the most friendly and POLITE HK cafe server I have ever seen in my life  My food was okay. Nothing special, nothing terrible. I can't say much more beyond that."}
{"text":"Buddy HK cafe in one of the more sketchy plaza in Scarborough and has quite a mixed menu.  There is the usual Hong Kong Cafe favoirite includes Hot Sizzling Steak/Mixed Meat combo, One Dish Meal, Curry Dishes, Congee and more. Surprisingly there is some Szechuan items too.  Good pricing and big portion and decent food. Buddy HK might have the wining combination to be sucessful in Scarborough!  All lunch special comes with complimentary soup and drink..even my $4.99 item, the cheapest in the menu.  Beef and Fish Balls Noodle ($4.99) and American Angus Sirlion Steak with Gravy ($8.99) were both well prepared with good ingredients and care. I came with zero expectation and everything were way above what I expected.   For the Steak entree, we requested to have vegetables instead of rice and with no extra charge we ended up with this huge plate of carrot and broccoli! The steak was cooked medium rare and not chewy or tough at all!  Even the HK Milk Tea was smooth and silky!!   Bonus: Waitstaff is so polite and friendly... really? Greeting me with a smile and kept saying Thanks?!"}
{"text":"2 and a half stars for buddy.  im not sure how long this place can last.  its okay, nothing special.  The restaurant was pretty empty.  if im in the area i might try it again but i would not go out of my way for this.  the pepper steak on rice is not the best as the gravy came out cold."}
{"text":"My family comes to the HK cafe often and it is an incredibly good deal!! You get a choice of soup (vegetable or chowder) and also a HK coffee which is on par with HK cafes. The fried rice and noodle dishes taste really good and are authentic. They do need to work on the ambience/decor and marketing as this place looks really empty and dark. If you want a cheap place to eat and authentic HK fare, it is a place to try out at lunchtime."}
