{"text":"We went for the first time last night. Nice decor and that's about the nice things I can say about the restaurant. We had the BBQ combo for $69.99 that totals 21 oz of 3 types of meat. That's it! The sides were mediocre in taste and quantity. The meat was tender but bland. We had to order 3 side orders of rice (extra charge) and an order of bimbimbap. Total bill was $102 and we still came home hungry. Very disappointed. Needless to say we will not be going back again. For a Saturday night, the restaurant wasn't even full and no line ups. I will be surprised if the restaurant is still in business in the next 6 months."}
{"text":"Not even worth one star. 
Never going back - Deceives and cheats customers! 

My third visit to Bulgogi Brothers was a big disappointment. I will never be going back again. I am usually not very picky with food or restaurants, and being Korean, I never thought that I would write a bad review about a fellow Korean restaurant but I was absolutely outraged by the way this restaurant conducts business.

I went with three of my colleagues and orderedmarinated rib (Galbi) for four. Usually two ribs with certain meat are for one person. However, 3 out of 8 ribs came with portions that were 1/3 of the others. It was clear to me, a Korean, and even to non-Koreans that the amount of meat given to us was extremely smaller in portions and of bad quality. The meat had more fat than meat and resembled something of dog food.
We complained about the amount of meat but manager who served us told us that they're selling ribs per weight - 300g for 1 including rib bone following Korean HQ manual. I am Korean but haven't heard of ribs being sold in weight. Regardless of their 300g standard, it appeared to all of us that the meat was nothing close to 300g. They brought another rib for us to compensate for the shortcomings of the ribs but we refused and we realized after that they put a 15% discount on our bill. We weren't especially pleased with the fact that they believed that a discount on our bill can compensate for their service.    

I found it outrageous how they handled the situation and even after complaining, they continued to serve us with poor-quality meat in abnormally small portions. They are not a trustworthy restaurant, deceiving customers with meat claiming their \"300g\" weight policy. All we wanted was the right amount of meat for what we paid for."}
{"text":"I ordered gangdaenjang and it was my first time trying this dish but I found it to be overly salted. I probably drank a liter of water after just because of this. Not completely sure if this is how it's usually made so I can't fully judge.

The food was overpriced for the quality and service is subpar. You literally have to stand up and wave your arms to get the waitress' attention. One thing I enjoyed though was the complimentary Melona bar for dessert."}
{"text":"Great service. Good price and pretty good food. It is a real Korean own restaurant. Very clean . Large dining room with a bar and grill section. Very different from the Chinese run Korean restaurant. Price for a is $10 or less. That's the rice in a stone pot. Not a big portion but enough for an average eater."}
{"text":"Good food. The side dishes are tasty and well-presented. The main course included salad, fresh beef (they cook for you), and a choice of cold noodle/spicy soy paste. It's a little bit on the expensive side, but it's worth the price and the service is one of the best I have experienced."}
{"text":"Would not recommend. Despite the hype. Service poor, staff spoke little & understood little English. VERY EXPENSIVE & menu pictures false advertising...$35 for a small strip loin that I have to cook?!  Rice in stone pot small serving & cold!"}
{"text":"I went to Bulgogi brothers with 2 of my friends last night because we heard that the place was newly opened. When we went in, the atmosphere was clean, simple and seemed organized. It was up to this point when it was good. All in all, the meat quality was good but I found the marinate to be too sweet. Here are some of my major complaints:

1. When the waiter came by to take our orders for drinks, we tried to order a pitcher of beer, which the waiter said the taps were dry. I then pointed to the menu and ordered a bottle of Ashahi beer which was priced as $5.50. My friend ordered a bottle of Kirin beer which was also priced the same ($5.50). When the beer arrived couple minutes later, with the Asahi bottle significantly bigger (650ml) than the Kirin bottle (330ml). I asked the waiter if both bottles are priced the same and he told me that the Asahi bottle was priced at $9.50. I told the waiter that I ordered the small one but he said \"sorry, we only have the large bottle in stock tonight\". How can he say this and why didn't disclose this in the first place? I even told him that I pointed to the menu and ordered the $5.50 one but it seemed he didn't even care. I attempted to talk to the manager but at this point I was too tired to deal with this. I felt that I was scammed and ripped off by this experience.

2. The waiter, waitress management is quite chaotic. There was no single responsible waiter for our table. There were at least 5-6 staffs that were serving the table. With this arrangement, no one was accountable for the service. As such, when we requested certain things, many times, they did not deliver/respond in prompt manner (see number 3 for example)

3. We ordered a dish of dumplings as an appetizer and 3 servings of bulgogi, steak, and galbi derivative combo as main dish with 3 bowls of rice. After 15-20 min, the meat combo came out before the dumpling was delivered to our table. I then asked a waitress when the dumpling was going to come. 5 minutes roll by, there is no response. I ask a different waitress and she comes back after 5 minutes saying the dumpling will be ready in 5 minutes. The dumpling came out after 10 minutes. I find this not acceptable because the appetizer should have come out first before the main dish. The dumpling was under the appetizer column!

4. The food is way too expensive here. I am not a heavy eater but I seriously felt hungry after sharing the 3 servings of meat combo (priced roughly $55). All of us pointed out that the picture on the menu had way way more meat than the actual dish that came to our table (also another scam). I also did not like the fact that rice bowls were not included as part of the combo."}
{"text":"I've been to many Korean restaurants and this place is very very expensive. Food is average nothing special about.  They don't serve many side dishes as other Korean restaurant I believe this is due to their high monthly rent ?

Anyways I will not recommend this place to anyone, their serving portion is very small.  Complete waste of money."}
{"text":"1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 4
Service: 5 
Ambiance: 4
Overall: 4.5

Extra information:

* Open for lunch & dinner
* Franchise from Korea
* Free Wifi
* Serves alcohol
* Good for large groups

Bulgogi Brothers is newly opened Korea based franchise restaurant up in Richmond Hill. Located at 140 York Blvd where all the restaurants are gathered, Bulgogi Brothers offers clean, brightly lit dining area for small and large groups.

I visited Bulgogi Brothers for lunch on a Saturday with my family. Once I walked in, I was surprised to see how big the restaurant is. They have a separate dining room area as well as bar area which is rare for Korean restaurants.

We were seated in a booth near the window which could easily fit 6~8 people. Menu is quite simple, focusing on Korean BBQ and couple appetizers. Since we were there for lunch, we decided to try 2 out of the lunch specials they offered. Lunch special varies from $16~18 which includes different types of bulgogi, chicken salad, side dishes and choice between cold noodle (naengmyun) or gandaenjang.

Just like when you get bread and olive oil to start at other restaurants, Bulgogi Brothers started off the meal with a basket filled with traditional Korean snacks. The basket was filled with steamed corn on the cob, fingering potatoes and edamame. 

We were all given small bowl of sweet pumpkin and sweet potato soup to start off. It was mildly sweet and quite appetizing although usually I don't really care for things like this.

There were 6 different types of sidedishes served with the meal. Some of them were namul, sweet pumpkin salad and kimchi. I liked the White KimChi (MulKimChi) and the sweet pumpkin salad

Ordered: HaeMul GungJung Mandu 5/5

* Fried dumpling with seafood (mussel, shrimp and squid) with spicy sauce for $12.99
* 8 pieces of fried dumpling with seafood were served on top of this bowl that was specially designed to keep it warm
* You are suppose to dip the dumpling into the spicy sauce and then eat it with the seafood
* Shrimp, mussels, squid is covered in spicy sauce with green onion 
* Dumplings came hot and fresh just out of the fryer and it went really well with the sauce
* This is def a fusion Korean dish but I really enjoyed it

Ordered: GwangYang Style Bulgogi 3/5

* Sliced beef bulgogi with fresh sweet sauce for $18.99
* Both of the lunch specials we ordered came with chicken salad
* Teriyaki chicken with salad topped with oriental dressing
* Had sliced tomatoes, cucumbers, lettuce and red pepper
* Salad wasn't anything special but the chicken was quite tasty with the teriyaki sauce
* Bulgogi comes in a round plate with already cooked garlic, onions, mushroom and sweet potato
* Once they bring this to the table, they do the cooking for you
* I liked how the garlics already come cooked so I didn't have to wait so long
* The meat was a little tough and the marinade was tad too sweet for me 

Ordered: ChaDolYangJi SukJu Bulgogi 5/5

* Sliced brisket bulgogi with green pea sprout and sesame leaf for $17.99
* I much preferred this one over the GwangYang Style
* Brisket is used for this and it is fattier and the sesame leaf adds more flavor
* Because we ordered lunch specials, you get a choice between Cold noodle or GanDaenJang
* For the cold noodle you can get plain (MulNaengMyun) or spicy (BiBimNaengMyun)
* I ordered Spicy cold noodle (BiBimNaengMyun) for one lunch special and GanDaenJang for other
* GanDaenJang is a Bean paste with tofu, beef and shiitake
* Basically it was like concentrated version of DaenJangJjiGae (Soy bean soup) and it's eaten with rice
* Cold noodle is served in a small bowl but it comes with everything (egg, beef slices and cucumber)
* I liked how the portions were small and the noodle already comes pre-cut
* This was one of the best tasting Spicy cold noodle I tried in Toronto so far
* Still it was a little too sweet but the spiciness level and the consistency of sauce was just right

Service was pretty amazing at Bulgogi Brothers. Servers were friendly and attentive and they were always there when I needed them. They check up on our table quite often and asked if we needed anything. They were so polite...it reminded me of dining at nice restaurants in Korea.

Also, another thing I noticed about the restaurant is that they have an awesome ventventilation system! It was not smokey at all inside the restaurant and I didn't walk out smelling like Korean BBQ after.

Summary: Bulgogi Brothers is a great addition to Korean restaurants in Toronto. It's a great way to introduce someone to Korean cuisine or Korean BBQ. They serve good quality food and provide excellent customer service. If you are looking to stuff your face full, this might not be the place for you (I suggest Korean Grill or Chako). Price point is a little higher if you think of other Korean BBQ spots in Toronto, but I think this place is totally worth it."}
{"text":"The service is excellent. They cook for you. The beef quality is excellent. Definitely worth the $$$. It is a different experience compare to regular Korean BBQ restaurant. Totally recommend to go!"}
{"text":"***3.5 stars****

Went for dinner last weekend at Bulgogi Brothers, no wait to be seated which was a surprise since it was Saturday night. Place is pretty spacious (where Melting pot used to be) and decor is modern.  We were in the booths which were ideal size to sit comfortable for 5-6 people.  

Portions are okay and pricing is on the higher end but you pay for what you get.  The meat quality is very good.  What set this place apart is the service!! The server came to cook our meat and served to each person on the table.  

What we ordered:

B9. Noon Kkotdeungsim Modeum Gui  $58.99
R1. Chadol Daenjang-jjigae  $10.99
R9. Dolsot Bulgogi Bibimbab $10.99
Seafood pancake (which was on a different hidden menu you have to ask for). $14.99

Everything we ordered was good except for the seafood pancake which was tasteless.  I had to add my own salt to it.  I should've known it wasn't good when I saw the table beside us only ate 1/4 of it and didn't even want to pack it to go when they left.

At first they only gave us the corn and Edamme beans Banchens. We had to ask the  server if there was any other different type. She said No!! but after 5 mins she came back with 8 different types.  So I was kinda confused why she said No to us.  

I am not sure but we were extremely thirsty after eating here so it seems like they use a lot of MSG more so than other places.  Other than that this place would've gotten 4 stars from me.


Rating:

Service: 5/5
Food Quality: 4/5
Comfort 5/5
Decor  5/5
Value: 3/5
Parking: 3/5"}
{"text":"...3.5stars to be exact. great atmosphere, upscale dining type of look. the staff was extremely welcoming and friendly, as we had walked in what looked like past their closing time but they were more than willing to seat and serve us. while i knew it wasn't your typical all you can eat korean BBQ, i didn't know what it really was until we opened the menu. it's more like fine dining korean BBQ. 

we ordered:
b9 - noon kkotdeungsim modeum gui which consists of:
ribeye, excellent. 
bulgogi, good.
short ribs, excellent. 
r2 - kimchi-jjigae, good. 

the quality of meats were top notch, however the prices were slightly high for the amount of food. the meat is cooked in front of you which is uniquely different but it felt like our server was practically dining with us. i like it, i would definitely return - its a refreshing change from the stuff yourself silly korean BBQ ayce places. 

if the management is reading, may i suggest renaming to \"Korean Steakhouse\" to distinguish the unique experience as opposed to grouping yourselves with the conventional Korean BBQ places."}
{"text":"This is my first time at a restaurant like this for bulgogi.  I've had bulgogi before, but from a counter service type of place.  
I really liked this place.  It was my coworker's first time eating any Korean and the server was extremely patient with us and explained the whole menu to us.
We got the dinner for 2 with the vermicelli appetizer and the first soup.  Everything was delicious.  The server took a good bit of time explaining the restaurant chain and how they have to import certain ingredients if they can't get anything similar in Canada. She kept raving about the special salt.  I'm not a salt person, but I put the salt in my rice and put the bulgogi on the rice as I'm used to eating it and it was very nice and you know it's freshly made since it's cooked right in front of you.

They tell you to watch your knee when entering the booth.  I heard that right as I hit my knee, but I survived."}
{"text":"Recently went for the first time. The service was good but the menu was pricy especially considering all the AYCE Korean bbqs in the area. Obviously the photos in the menu always look good but I found their pictures more misleading than usual. Theportions appear much llarger and everything looks so much better in the photos (this is even after considering that the menu always looks better). Wasn't terrible but definitely have had better."}
{"text":"-highest quality meat you'll ever eat at a Korean BBQ

-side dishes were also high quality (kimchi was also individually thinly sliced) and somewhat unique (e.g., the squash)

great flavoured BBQ. it's not AYCE, but it's good enough. if you want cheap AYCE, go elsewhere--this place is about quality , ambience, and service. again, i felt the portions were sufficient. even the paper towels and toilet paper were high quality! LOL!

-the vent, which is built into the table, sucks up all the smoke, so your clothes don't end up smelling.

-plum tea was excellent, too

-it's a shame there's no location in toronto,t hough"}
{"text":"Don't order the combos.
Order a la carte.  You save money and it's much more satisfying. 

Side dishes 
Awful.  Flavours are way out of proportion.  Nothing I ate was balanced.  It was either too sour, too salty too sweet or too bland.

App salad 
Too sweet, and also too sour at the same time.  It's like the chef had a numb tounge tonight and decided to double down on all the seasonings.

The Fried Dumplings were normal, but the sauce that came with it was too salty & spicy --I can eat spicy but the salt and the spicy-ness level overpowered whatever else was in the sauce.  I can't taste anything except for Salt & Hot.

Main dish 
Bulgogi was bland.  Really I have nothing good or bad to say about it, because it was neither.  The reason for this could be because the side dishes & the app was so over-seasoned, it numbed my own tongue, making everything I ate after it, bland.

Dessert was a tea.  It was the tangy tangerine teas that you can buy in syrup form, from H-Mart / T&T and really you should just do that, because the tea dessert served was also way too sweet.

Service
We sat down, we ordered.  No tea, no water for a good 10 minutes.
We decided to flag down a waiter or waitress to get some tea.(a tip for anyone thinking of going, give your arms and shoulders a nice warm-up before sitting, it'll come in handy when you have to wave frantically to get someone to help you).

In the end
If you want your fix of Korean food / BBQ, go to any family owned Korean restaurant on Yonge street, you will come out happier because it feels like you were treated like family, fuller because the food is cooked with care, and a thicker wallet because it's expensive to eat at Bulgogi brothers.

I always go to a restaurant at least a few times before making a final verdict so I'll do just that, after my next paycheque.

Brandon the General Manager is a very nice and knowledgeable guy.  I feel bad for writing a review with 1 star because he is so nice."}
{"text":"Let me start off by saying the reviews that are less than 4 stars are from people that don't know good korean bbq.  Reviewers that have given this place an ok or bad review are people that don't know quality and service and are just cheap and gluttons because they are so used to these crappy all you can eat dives.  They only expect quantity and not quality.  

The ambience is extremely pretty and spacious.  The dining room has large spacious booths for up 6-8 people and also 2 seater booths for couples.  I loved their BBQ grill which seems extremely high tech.  There are no vents above you, only around the dropped bbq grill in the table.  So when you leave the restaurant your hair and clothes don't stink like you just stood in front of a grill all day.  They also have a large bar space and patio with LED lighting that changes colours and you could totally have a private event.  

Let's talk about service.  I love the fact that the servers will squat/kneel down to your level when talking to you so that you're not straining to look up and it's nice to be more interactive and personal.  They also cook the meat for you which I'm sure a lot of people aren't used to, but I like this because they know how to cook it properly so you can experience true quality korean bbq.  I really enjoyed the service and that alone makes this place stand out.

Now the food.  This is where I believe people don't understand korean BBQ.  These AYCE places have ruined the reputation of Korean bbq's.  I have to say when I tried the beef I was in love.  They seem to use top quality AAA aged quality beef.  And since the servers cook it for you properly when you take the first bite the beef melts in your mouth. *drool*.  I ordered the 3 person combo for my husband, me and my brother.  I do recommend the combos so you can get a variety of everything.  Two men and one woman and we still had a lot of food left over.  The 3 person combo, which by the way are fairly new on the menu - not on their website) consists of 3 banchan appetizers (Korean side dishes); choice of starter (we had the bbq pork short ribs - lots of flavours and succulent), then three beefs (1st; rib eye - OMG! talk about melt in your mouth goodness!, 2nd;  bulgogi which thinly sliced strips of beef with green onions, 3rd; LA galbi - once gain melt in your mouth yumminess.  After the meats they serve each person a bowl of rice and 2 types of soups (i think all jigae).  BTW, the boricha tea they give you is one of the best I've had in all my life (I'm 35 1/2 years old and I'm Korean).   I may have been born here and can't speak Korean well but I know my Korean BBQ.

Again, this place is for people that enjoy food, not for bingers that love a good deal.  If you want quality, quantity and exceptional service this is the place to go."}
{"text":"Nice Modern Decor Restaurant. Higher-End Korean BBQ. Not All You Can Eat. 
Wait Staff Cooks Your Food For You at Your Table. Small Portions though."}
{"text":"This is some high end Korean BBQ!  We were surprised at the remarkable service and the quality of the food. lots and lots and lots of food.

I would pay the price just for the ambience ( relax, family oriented) and quality...but for the price to taste ratio..im hitting up ktown!"}
{"text":"Horrible service. Overpriced food. Horrible attitude from hostess. 

We had to ask for tea repeatedly, they never checked on us.

We had to eat elsewhere after our dinner because the portions were very small.

Would not go back, and would not recommend anyone going back..."}
{"text":"Food was good but not worth the price. $28 for their best cuts of beef on the menu and minimum 2 orders of meat. Side dishes were limited and portions were small so that's an automatic minus 1 star for me. And to make things worse the side dishes can only be refilled once more. Service was good since the place was dead. Bill came to $83 after tax and tips for 2 people for lunch. For the money we pay I really was expecting much more. I recommend going to Sariwon instead. Much better value."}
{"text":"Finally, a fancy Korean restaurant with the new style of Korean food.
I really enjoyed the food and service. The meats are not what i'm used to. It's not plentiful but has great flavour. Reminds me of Japanese style Galbi."}
{"text":"My visit was with friends on a Friday night - initial impression the décor is definately a step up from your average Korean BBQ restaurant - modernly western. 

The tea of the day was Corn Tea - pretty good.

Service - extremely disorganized and the servers looked stressed out and over worked, however they were courteous at the same time. It was nice that the floor manager stopped by frequently to check in on us. 

Pricing - Wow, this place is expensive and the portions are small for what premium you're paying for \"good quality beef\" 

Dining experience - well - ummm, our entire party was annoyed by the time we got to the half way point for dinner. I'll breakdown the reasons - for a few things  - we ordered MegKuLi to go with our meal and it never arrived, after asking after it twice - we were finally told that it was sold out. So we were like - Ok. 
Then we found out that they had messed up our order - despite the fact that we had pointed to what we wanted to order - we had shrugged this off - because the dish that had come was one that we were thinking about ordering but had chosen something else in place for it.  We had to ask after our add-ons as well - you can get a soong tofu or a nyan-mun for an additional charge which is worth it.
 
Final Assessment- ok, but in all honesty not worth the premium you pay for the quality of beef. - call me cheap but there are other places that offer better bang for your buck and you're not still hungry and feeling poor afterwards too."}
{"text":"Great food and amazing service. A real Korean establishment as most other Korean food have been watered down in Toronto. I loved the bibibap and the staff are traditional Korean, bowing at every instant, and explained every dish."}
{"text":"Changed my mind about Korean BBQ!
I've been to a few Korean BBQ places (mostly all you can eat) before and not enjoyed it. I decided to give it another chance tonight with a bunch of coworkers. 
BEST KOREAN FOOD IN TOWN! The staff is extremely knowledgeable and welcoming and want you to have a great time. We went with a party of 5 people and had an amazing time. Brandon (General Manager) was extremely welcoming and helpful. Great selection of Korean liquors as well. 
Must check it out if you are in town!"}
{"text":"very tasty!

we ordered bulgogi in a soupy broth (can't recall name, but most popular choice and first on menu) in form of 'lover's combo' so we got fried dumplings, sides, and dessert tea too (sweet potato soup, plain kimchi, spicy kimchi, greens, corn tea, citrus tea, and some other things i can't recall).

more pricey than regular korean restaurants, but still reasonably priced.

service was very friendly.  our waiter was attentive and spoke english well.  another employee was very friendly when we arrived and left too.  we went on thanksgiving monday during lunch hour and it wasn't too busy so don't know if friendly service would be consisistent."}
{"text":"It's a bit on the pricey side when compared to Hana-bi (my all time favourite) but its very decent food!  Would probably come again :)"}
{"text":"3.5 Star

Bulgogi Brothers Grand Opening Today!!

Lunch Specials (starting from $16.99), a good way to try out what they offers, since that includes:

- Soup (chicken with a really thick consistency)
- Warm Chicken Salad (Chicken is a little overcooked and dried..but have good seasonings)
- Main
- Noodles or Rice 

Banchens are really good, nicely presented and definitely house made as the flavours are quite unique. My fave is the pickled hot pepper.

For Main I opt for their Seoul Style Bulgogi, which is the most popular items in the menu.

The beef is well seasoned with a mix of sliced beef, onion, vegetables and cooked right on my table. Nice to have someone else cooks and serves when I am eating out. 

For the side I decided on the Naengmyeon (Korean Cold Noodle), perfect for this hot summer afternoon, as I was sweating and drinking the cold tea like I am down in equator. The noodles is nicely presented... like a mini version of the one I usually have...  the broth though lack the subtle flavour of beef... 

Services is good since the manager/supervisor was taking care of me most of the time.. took my order and cooked my food... My own waiter though is a little indifference and green... but is the first day, I do understand that.

Bulgogi Brothers does give me faith that I can go enjoy Korean BBQ alone.. or even for lunch as the menu are all priced per person and there's no minimum order. 

Decoration is chic and modern... There is a bar area if you want to just have a drink or something small...and even a patio........ Soju cocktails for Happy Hour, anyone?

PS, I think some sweet is missing for my lunch... if I can have a Sikhye, then it would be perfect!!!"}
{"text":"Bulgogi Brothers was good. We ordered a plate that included a few heart shaped patties, short ribs and a long piece of kalbi. We also order the fried tofu abd the vermicelli ( I know it's not called this but I don't remember the Korean name). As we ordered the meat combo we could add I think $5 for a noodle or soup. We chose the cold noodles. The tofu wasn't really soft but was okay as Korean tofus are typically harder. Was the meat plate worth the cost? No. I only say that because the heart shaped patties were not worth it. 

Service; pretty good. The waitresses would help you cook the meat right in front of you. Mind you I went on a weekday so maybe it will be different on weekends. 

Overall: food was good but for the cost of it I didn't find it that that amazing. Maybe I will go back and try it again"}
{"text":"Bulgogi Brothers (Twitter: @BulgogiBrosCa & Facebook: BulgogiBrothersCanada) is a recently open franchise Korean Restaurant and I finally made it for a late Sunday lunch. Finally a good Korean Restaurant open up in Richmond Hill and I work only a few minutes away, just can't believe I haven't been earlier.

The space is very spacious and very clean compare to most of the other Korean Restaurant in Toronto, with a brightly lit dinning room and they even have a private room for bigger groups...
Plus they have a very large bar area, which remind me that I must come back to try some Korean cocktail. 

 The menu is pretty simple here focusing mainly on Korean BBQ with a few appetizers, rice and noodle dishes to choose from.

I find their Lunch BBQ special starting at $16.99 to $18.99 quite reasonable given the portion are rather large, plus it also include salad, soup and choice of  cold noodle (naengmyun) 
or soybean paste (gandaenjang).
And the good thing about Bulgogi Brothers is, each person can choose their own type of meat whereas most other Korean BBQ resto in Toronto, you need minimum of 2 order per meat per table.

Love how they label their teapot and list it's benefits :)

 Steam Veggies
Saw Justine (foodigatorj) 's post here and they had the corn which look so much prettier :(

It came with a rather large salad for each of us.
A small bowl of Sweet Potato Soup each, it was thick and sweet 
6 side dishes

We order one each of the Gwangyang Style Bulgogi & the Chadolyangji Sukju lunch special.
Once they bring the meat to the table, the will cook it for you one type at a time. 

 Gwangyang Style Bulgogi $18.99
~ sliced beef bulgogi with fresh sweet sauce
The meat here is pretty flavorful but on the sweet side, not much dipping sauce needed

 Come with 3 dipping sauce, a spicy sauce, sesame salt & spicy bean paste
The waitress told us the bulgogi is best with the spicy sauce which was but on the other hand I didn't find much use with the salt, didn't really do anything.

Comes with side of lettuce allows you to make lettuce wrap together with the meat (Ssam Style) and it's perfect with the Spicy Bean Paste sauce

  Chadolyangji Sukju $17.93
~ sliced brisket bulgogi with green onion, bean sprout & sesame leaf
 Love the fatty part here, the meat wasn't marinated which allow you to taste the meat and perfect to dip however you like into the dipping sauce. I find this delicious even on it's own but given the marinated nature of the previous one (Gwangyang Style) which was better eaten with rice or as lettuce wrap :)

 With our lunch special, we each got to choose between cold noodle (naengmyun) 
or soybean soup (gandaenjang)... so we order one each to try.

Bibim Naengmyun
~ cold noodle in their signature hot spicy sauce served with beef & hard boiled egg
 There's a choice between the regular and spicy cold noodle, I normally prefer to order the regular version with have a slightly sour tangy cold broth which I find extremely delicious and refreshing although my love for spicy food.
But Justine (foodigatorj) aka the Korean foodie named this the best spicy cold noodle in Toronto, so I must try it. It was indeed delish and love how it's drenched in hot sauce.
It was so cute since this is a side for one person, it's served in mini portion but the noodle still came pre-cut (other Korean resto normally give you a scissors at the table and you'll have to cut it yourself)

 Gangdaejang
~ fermented soybean paste boiled with pork, shiitake & tofu and served with Rice
I was expecting some king of spicy soup that you usually get with your Korean BBQ meal but this was really thick and definitely not a soup. Together with the tofu, it's thick and salty on it's own but it perfect eaten with rice. I end up falling in love with it 
It looks like a tofu dish with spicy sauce =P

 Green Plum Tea & Honey Lemon Citrus Tea
This was also included in the meal and I'll have to say that I can't decide which one I like better.
The lemon is sweeter with the honey but with a slight bitterness from the lemon skin while the plum look extremely dark was very light and refreshing.

Verdict :
Love everything I had and will be back to try some other dishes
Price is higher for dinner which make it a bit steep but I would suggest to come try it out for lunch.
And I think that the 2 portion we order here will easily feed 3 or even 4 if you order an extra app.
This is a very convenient location for people in Richmond Hill who are looking for authentic Korean food without traveling over to Yonge & Finch area."}
{"text":"I went here with my girlfriend and she loves korean barbeque. So she was a fan of it from the start. At the time we went it was the first couple months it had opened. We weren't impressed by the fact they seated us after somebody who came in after us. They tried to make it up to us by giving us tea at the door with a few waiting chairs at the time. 
I decided to give them a chance because I know it is hard to start a new business anywhere in anything. When we got seated I looked at the menu, it was upscale version of the korean barbeque I was used to. They had very different kinds of bulgogi, and we tried a few. My girlfriend liked the heart shaped ones, so we ordered those ones along with some other things.  
I remember being very thirsty after dinner, but it was ok due to the fact that they had introduced me to melon bars, which I love to this day. It wasn't all that memorable, so I won't be coming back."}
