{"text":"I love Buon Gusto Ristorante!   My husband and I had dinner here for the first time a few days ago and I am so glad we did! From the moment you walk in the door you feel as though you've walked out from Las Vegas and into a quant yet classy restaurant somewhere in Italy. The staff was also very professional and quick to fulfill every need.   Right away our server brought out fresh, hot sliced bread with olive oil, garlic and balsamic... Wow! Great start to our meal.. I ordered the pasta with garlic and olive oil which included a salad with their house made ranch(which was creamy and delicious). My husband had the lasagna which came out piping hot.. still boiling in the pan.. I can definitely say that the lasagna was the best I've tasted.. the presentation being a plus. His dinner also included a salad which he upgraded to a caesar salad. To top our meal off, we had Chef Joel's signature bread pudding for dessert. WOW!!!! I would come back specifically for this dish. It was served hot with an addicting rum sauce as well as freshly made whipped cream that had been frozen to deliciousness.    I would definitely recommend this restaurant to anyone. We cant wait to return."}
{"text":"Just like being back east! Always up to par. Great service, fresh home made food, cozy atmosphere. My favorite place to go to for incredible Italian food. They never cease to amaze. Some of my favorite dishes are the Veal Trieste, chicken francaise, chicken Marsala and rigatoni with sausage. These dishes are mind blowing! Even the traditional eggplant parm or lasagne is made perfectly. They know what they're doing here. Always a favorite!"}
{"text":"Meh, meh, meh. After waiting 25 minutes and watching everyone who ordered after us get their food first, I was treated to a very generic baked ziti. The sauce was extremely sour and tasted worse than grocery store pasta sauce. My husband had the pleasure of being served linguine del mar with three unopened mussel shells. After pointing this out to the server, he said sorry and quickly rushed off. There was no offer to redo the dish, to bring up mussels that are actually open or to offer a discount of some sort.   I'm appalled that the cook either didn't notice the defective mussels or just didn't care. I'm even more appalled that we were expected to pay full price for a dish that did not deliver what was promised.  The only memorable things that I will take away from this restaurant are the poor customer service and boring food."}
{"text":"I was a stranger in a strange land, or so I thought. Had to visit Henderson for biz, so checked Yelp for a place to eat... Well, I walked in and it was like stepping into a friend's dining room. An Italian friend's.  I had a glass of red while I waited for a table - they kept checking back with me until I was seated - and the food was fabulous. One of the nicest parts was that everyone was happy there. Patrons were walking in with these pleasant little looks on their faces, the staff seemed to love working there, and the owners (a husband and wife team) were incredibly sweet to me and to each other.  I NEVER expected warmth and great food in Vegas! Can't wait to go back!"}
{"text":"Chef Joel makes an amazing chicken fettuccine Alfredo. The chicken is expertly seasoned, the cream sauce was the perfect constancy with a wonderful flavor."}
{"text":"Dined here last night with my wife.  This is a tiny place so seating took awhile but worth it.  Fresh bread came out first with great garlic & olive oil for dipping followed by house salad, both excellent.  We wanted the Italian Wedding soup of the day but they had just taken a large take-out order that wiped today's batch out.  We had: 1) Calamari:  very good but we've been spoiled by better.  Their marinara was the bomb.  Solid choice in any event.  Probably would try something else as an appetizer next time.  2) Veal Picatta:  Excellent prep.  We were told by owner that they don't even pound the veal cutlets flat until we order.  Everything made fresh and flavors prove this.  Knowing this I'll try the Veal Parmesan next time just to get more marinara.  3)  Cattleman's (all meat) Pizza:  Good choice.  Nice crust and good flavors on toppings.  Would do that one again."}
{"text":"Do not come here for lunch.  We were the only table in the restaurant and our food took almost an hour.  We had to get it to-go.  We were told after waiting 30 minutes that there was a catering order ahead of us and that our food was just starting.  We should have been told that from the beginning. After getting back to work and finally being able to eat our food, I was told the pizza was not very good, the fettucine alfredo was bland and my pasta was mediocre.  We also did not get any bread as promised."}
{"text":"The pasta and chicken Marsala were very good.  The restaurant is a bit small.  If you go during dinner time, it's very cramped but the food made up for it.  Call for reservation to avoid waiting in line."}
{"text":"We took a day off the strip to visit some places off the beaten path while visiting Vegas. They have amazing lunch specials! All four members of my family ate (drinks included) for less then $25 and had food leftover. The service was great, we were there during a slower time and they were very friendly and chatty. The chef came out and told us he was making a new sauce for the pizza with onions in it. I would definitely recommend it f you're looking for somewhere that will fill you up with good food with out costing an arm and a leg. And they have free bread and oil & vinegar as well!"}
{"text":"This place has the best Italian food I have had in the Las Vegas area so far. Over the past six years I have eaten at so many Italian restaurants out here and somehow this little cafe evaded me. On a chance encounter (I was going to try another joint called \"Bratalian\" a block away but they had closed for dinner) I found this place thanks to Yelp and boy was I impressed.   To start I ordered a Calamari appetizer which was second to none as I order Calamari everywhere that has it. I then had a slice of cheese pizza which was superb, and the salad was very fresh with some black olives, a slice of artichoke heart, and a pepper. I also tried the Penne e Broccoli Chicken, a noodle, chicken, and broccoli dish as the name implies.   I paid maybe twenty-five dollars and took home most of the entree as I was completely stuffed. For the prices this is the best Italian food you can find in Vegas in my honest opinion. Two can dine here for under thirty dollars tip included and still take some food home.   Keep this place at 5 stars please as it deserves it!"}
{"text":"Great place to eat. I love coming here everything is so good and the prices are reasonable. The bread is amazing."}
{"text":"Got the spaghetti with meatballs. Food was alright.  Mondays they have reduced staff, so if it gets busy you'll have to wait a while for service. Even with a 8+ person party coming in while we were dining we still got decent service, and they managed to whip up some extra scampi sauce for my mother.  The comments about this place being a \"hole in the wall\" are pretty much accurate, size-wise. This place is about as roomy as a walk-in closet, and you can get seated right next to the kitchen area, so there's constantly people going past or around you, especially to access the little cabinet in the hallway.  As long as you can stand the small space, the food's good, if a bit expensive. If you're in the mood for Italian, definitely consider this place -- just be wary if it's busy."}
{"text":"Visiting from LA. Went to this pace based on the Yelp positive feedback.  Hard to believe the ratings. Early Friday dinner, not crowded yet took nearly 45 minutes for an order of ravioli and a small pizza. The there was the bland taste. Ever so slightly better than big box chain Whitewash Italian. Pizza crust tuff, as if old or overworked. No sauce to speak of and overly cheesy. Ravioli on the hard side of al dente, nearly tasteless meat filling.   On the positive side, the staff were very friendly and apologetic on the long wait. Perhaps locals prioritize service over food. Otherwise visitors should go elsewhere."}
{"text":"Wonderful food and very friendly service. It's a small neighborhood place  with character. Pizza and salad both excellent and they bring you warm bread with olive oil and balsamic."}
{"text":"This place has some legit Italian food. Its got a nice cozy feeling to it, a real mom n pop kind of place. The food was really good and the Tiramisu we had was baked right there in the restaurant and not shipped in from somewhere else or microwaved."}
{"text":"We decided to try Buon Gusto after reading the reviews on Yelp.  What a great discovery!  We went in for lunch....about 1 p.m on a weekday and it was busy (always a good sign).  My husband had the Boo Boo's Baked Spaghetti (excellent) and I had the Tortellini with Tomato Cream Sauce (also excellent).  Tortellini is often tough, and these were so tender....the cream sauce was perfect.  They served a generous side salad and piping hot italian rolls.  Apparently, it is more casual at lunch - where at night, they are supposed to have candles on the table, Italian music, etc.  We watched the pizzas coming out of the oven....and they looked delicious.  It's fun to find new restaurants....and this one is so close to the Anthem area in Henderson.  Definitely will go back!"}
{"text":"I love this place! My son found it on Yelp and we have dined here 4 times now.  The food is excellent, always Hot and fresh.  The staff is all wonderful.  Great service and good attitudes.  Just a great overall atmosphere.  Keep up the great work! I can't wait to go back."}
{"text":"I cannot say enough about Buon Gusto; this is my favorite restaurant in Las Vegas.  The rigatoni with mushrooms is heaven on a platter, in fact, I have never had anything bad at Buon Gusto.  Their eggplant parmesan (they have a few versions, all good) as well as their lasagna are also contenders in my \"best dish ever\" competition.  Finally, you have to have a cannolli.  OMG, just OMG.  So good!"}
{"text":"I love this place.  It is tiny, cozy, and casual.  The service is always warm and friendly.  The food is outstanding and priced relatively well.  The salads that come with the meals are amazing.  I've tried several of the veal and chicken dishes and I've loved them all.    I recommend going here for sure."}
{"text":"Great little family owned restaurant.  We were seated immediately and served great, warm bread with oil and vinegar. Could have made a meal of that it was so good. The restaurant had a very quaint feel. It also had a surprisingly extensive menu with all of the customary Italian dishes. The prices were very reasonable and the staff was prompt and friendly. Both my wife and I loved our meals. Our two young children loved their pizza. You must try the homemade Tiramisu. We will definitely be returning."}
{"text":"Small trattoria tucked away in an Albertson's strip mall. Look for the big yellow shoe/car in the parking lot that is right next door to this wonderful Italian food nook. Fresh dishes with just the right amount of spices! I always bring friends there and they love it!"}
{"text":"This was my high school hangout. That is, before they closed the campus because of some punk @$$ kids getting into trouble on lunchbreak. How much trouble can you cause in forty five minutes, honestly? Regardless, the food is great, but the incredibly friendly owner (who is present everyday) and the small style of the restaurant give the oterhwise typical Italian/pizza joint distinction. Steve is the big guy who is always around, and willing to chat up a storm in his thick New York accent and on occasion is known to offer free desserts. The pizza is crispy and cheesy, not like the overly doughy chains that surround Buon Gusto. The lunch special, if it's still offered is two slices a drink and a salad for around six bucks. Pretty good deal for lunch on the go! If you have the extra time, you can take a seat in the back and have a server bring your food out, but it seems silly when you can just yell \"Hey Steve, I'll have the special!\" Buon Gusto is student friendly, family friendly, and overall friendly, and if you go more than once, I almost guarantee they'll remember your name and treat you like a regular.  Recommended pizza: Cheese. It is so good, it doesn't need any toppings. Get a Caesar salad too if you plan on sitting and hanging out."}
{"text":"Regretfully after a very disappointing meal I feel the need to write this review. I have been coming to Buon Gusto for the last 6 years since moving to the area. I always was satisfied. The New York style eggplant was always great. In the last 2 years I find everything has gone down hill. From the inexplicable wait to be noticed and seated to the inattention by the wait staff the evening was a disaster. First the wrong wine, then an awful wine, then a bug in the wine then a cockroach on the floor, a nice evening out gone wrong. After all that, the food tasted bad. I/we won't be returning which is sad because it had been reliable. From other reviews I see I am not the only patron who has noticed these things."}
{"text":"My husband and I have been here a couple times and it just gets progressively worse. The last and final time we had horrible service and a cockroach came to visit us. The manager came and grabbed it off the table and not another word was ever said about our little friend. The food has gone downhill as well. Will not be back."}
{"text":"Wow. Yelp hooked it up! The girlfriend and I were running around all day and were running on fume's. After a place I wanted to try was closed, I fired up the Yelp app and it took us to Buon Gusto.   I do not live on the side of town where Buon Gusto is, so I have never heard of it. I would also rather go to a family run place (which Vegas lacks) than a chain so off we went.  All we could say, is excellent. These place is a small restaurant in a shopping center, very nondescript. Once we walked in, we were immediately greeted and offered any seat. Drinks were offered right away and we went right to ordering.   I had the baked ziti with meatball and my girlfriend had the chicken milanese (sp?). Before the entrees came out, we had warm bread brought over and a small salad, which was definitely the best side salad I've had in awhile. Once the entrees came, WOW. True home cooked Italian dishes which we quickly went to work on, with enough for leftovers. I normally dont like leftovers, but the food was so good I took it home and ended up eating it later.   I will definitely be back to this spot when I am in the area and cant wait!"}
{"text":"My husband and I were looking for a new place to try, and we found Buon Gusto on Yelp.  We ordered ahead of time and took the food home, so I can't comment on the speed of their service when you come in and sit down, but we called fifteen minutes before they closed, and they were super nice about taking our order and helping us, which can be pretty rare when people are getting ready to close and looking forward to going home.  A lot of the time when you order to go, the food is cold and not very good by the time you get home, but ours was delicious.  Helpful, cheerful staff, yummy food, and great service?  I'll be back."}
{"text":"Tried out this little place on the spur of the moment; will never go back. We almost left when we waited 20 minutes to be seated when we could see the open tables...but he came back just as we were about to leave. Then another person came in, got seated next to us and served -- while we waited. and waited. We didn't even get an opportunity to get a glass of water for over a half hour. We eventually got our salads over an hour in to the torture, and our food another half hour later. The food was mediocre, over-sauced and not terribly flavorful. The waiter was constantly apologizing for 'The wait\" at each stage of the waiting game, and thanking us for our patience -- but would do nothing about the fact that we had to continue using way too much of it. We should indeed have walked out earlier -- at least between being seated and ignored -- because the food and horrible service were NOT worth the wait."}
{"text":"Awesome, authentic & tasty Italian food! Best I've have had since moving here from Chicago 18 years ago!!! Delicious!!"}
{"text":"My wife and I used to go quite a bit before we started having children.  The mom and pop who used to run Buon Gusto before were awesome.  A true mom and pop joint.  About two years ago we dined there and we could tell it was under new ownership.  There was an older gentleman waiting tables.  He told us he bought the restaurant from the mom and pop and his son, a culinary school graduate, would be running the business.  Fast forward two years.  We ordered some to go food.  Chicken trieste, lasagna, and children's chicken strips.  They said it would take 40 minutes.  When I showed up the reatuarant had only two people dining.  There were 5 people working and goofing off.  The hot food had been made, who knows how long it was sitting there.  The man working the front then went and made the salads.  When they were wrapping up the food I asked if the pasta side was in the bag.  He said no, would you like it? I sure would because it says on the menu the chicken trieste comes with a side of pasta and red sauce.  The man working the front went and told, who I believe to be the son chef.  At that point, the chef brought out an attitude.  I got our food, took it home and we are it.  It wasn't bad, but it wasn't the Buon Gusto we were used to.  The service sucked, and the restaurant was empty.    It is easy to see the new owners have no clue about customer service.  This place will be closed or under new ownership in a year.  It's too bad because it used to be so good.  Well, not anymore."}
{"text":"Excellent service and the food was spectacular. Would definitely go there again. Our waiter had some outstanding recommendations, which we took advantage of."}
{"text":"Really, the place brings a level of perfection that you rarely find at Italian places. The service is excellent. You're greeted with warm smiles from the minute you walk in, at every moment during the meal, and on your way out.   The place has that whole in the wall feel to if. Nicely decorated and great oldies music playing.  Might I recommend the pineapple pizza? It was exquisite! Sometimes I get the chilly cheesesteak which puts firehouse subs to shame :)"}
{"text":"This was my first time here, I Yelped the establishment after craving Italian food. I was hoping for more of a Florentine styled pasta and sauce, but this place blew me and my taste buds away!  It's literally a small hole in the wall situated in an Albertson's plaza and next to a shoe repair store. The establishment is small, not too many tables. They offer take-out as well as dine in. The ambiance makes you feel like you're with family and friends, the food is just out of this world! I've been to Italy and I can honestly say this is as close as you'll get to finding real Italian food! I live in LA, but the drive to this restaurant is well worth the trip. Great service, fresh food, what more can one ask for!! 5 BIG Stars for me!  I will be back end of the month for more!!  =)  Visited again last week of February - just as great as the first visit! Need I say more?!"}
{"text":"This little Italian restaurant is wonderful. I've had so many great lunches and dinners here and the food is exactly what you would expect when you have that craving for saucy Italian food. I think they probably make the best tiramisu I've ever tasted.   I've ordered from their catering menu for a few parties and have never been disappointed. The prices and quantities were excellent and you can't go wrong with a tray of tiramisu for dessert."}
{"text":"Look the food is great don't get me wrong. In fact it's some of best Italian I've ever had. But that doesn't excuse bad service and rude employees. The employees are slow and they seem to not have a care in the world. In fact they specifically seem to make you wait an absurd an amount of time for anything because it's like they know they have great food so they don't have to care. I've literally waited once for 2 hours to get my food when the restaurant was half empty. It was so bad it was 10 minutes before they closed that I finally got my food. Is for this that I have to say I will not be dining here anymore until they get their act together. Again great food but some of the most arrogant teenager employees I've ever dealt with."}
{"text":"I just don't get it.  The food is terrible and way overpriced."}
{"text":"From entering to service to exiting it was outstanding service, no rush feeling service with a smile music great oldies fare price for great food Henderson has a great pizza place."}
{"text":"Just had the pizza for the first time and it was amazing.  True east cost style and taste. and the sauce and great crust were great!.  Been here many times for dinner in the past and was concerned when ownership changed hands.  Haven't been back for dinner since new owner and chef took over but from the review looks like they kept up the amazing food."}
{"text":"Omg. The gnocci with tomato cream sauce is TO DIE FOR!! Not to mention the owner and staff are all super friendly and great to visit!!! They just don't make restaurants like this anymore!"}
{"text":"The place is great...reminds me of my first job working in my late aunt's Italian restaurant...everything was on point ...thanks for being in business...I'll be back!"}
{"text":"Best kept mom n' pop secret in Henderson!! I don't want you to go there, because I want to keep it for myself :). But make sure you go often so it stays open for all to enjoy!  I haven't had a dish I didn't like. The pizza is FANTASTIC! Nothing tastes canned or preserved. I heartily suggest \"boo boo's baked spaghetti\"... simply spaghetti marinara with a layer of melted cheese out of the oven, but to die for.   It's a small dining room, but worth the cozy atmosphere. The employees always look happy to be there, and always willing to be of service.   So glad I found this place :)"}
{"text":"Ate here for the first time today. Absolutely delicious. My wife had the chicken with capers and I had the meat pizza. So good! Then we followed it up with the gelato and for a second, I thought we were back in Italy."}
{"text":"I was there yesterday with my one love. And we loving this place. When we get there from the outside it does looks like a Togo place so we get a lil skeptic about it. But we decided to come in anyway. It's a small lil mom and pop restaurant. The service was friendly and good. The food was on point. But the stuffed mushrooms may need lil more works on. Other than that the artichoke was excellent, the sausages and mushrooms rigatoni was so  good. The house soup was wonderful. I would recommend this place to anyone."}
{"text":"I used to eat here pretty regularly when the past owners were here.  The food was always absolutely wonderful.  Coming from an Italian family I can say this was the best.  We were greeted and seated quickly and the waitress was very nice.  The new owners (who say they are the original owners) stated they didn't change any of the original recipes.  Well, they should have kept the past owners recipes!  The Alfredo sauce tasted like a white sauce.  No Parmesan cheese to it at all.  She asked me if I wanted some \"fresh grated Parmesan\"; it had no flavor.  The ranch dressing was disappointing because the pasted owners had a touch of garlic to the ranch dressing, this was very bland ranch and too much of it.  The pizza that I use to LOVE is gone as well.  The crust was burnt and very little topping.  Their bruschetta is not what I know as bruschetta!  The bread is not toasted and it is smothered in cheese.  Very little tomato and basil.  The couple next to us were complaining about the pink sauce being sour and the spaghetti and meatballs was too dry.  It looked dry to me.  The desert was a let down also.  The current owners have made my favorite restaurant Ho, Hum or worse.  The fancy menus don't cut it.  I'll take the paper menus and much better food.  Until the people in the link below come back,  I won't be back.  Joel, you've lost so much weight!  http://s3-media1.ak.yelpcdn.com/bphoto/pcM-WayzF95ixjBwn2_h8A/l.jpg"}
{"text":"First time diner, had take out because I can't get out right now. All I can say is wow! Really great Italian. Can't wait to try the pizza and the cheese steak. Give it a try."}
{"text":"I took my girlfriend to Buon Gusto before ice skating at the Venetian and we had a wonderful, memorable experience.  We were seated next to the kitchen in a very small two-top with the same table about 8 inches to our right. While the seating was less than awesome, the staff was fabulous. Our waitress greeted us, seated us and impressed us for the rest of the night. She was knowledgeable of the menu and their ingredients as I'm vegetarian and my girlfriend is a hard core meatatarian. I ordered their signature eggplant and she ordered the special, salmon and shrimp. While we chatted and waited for our meal, generous free bread servings (with olive oil and vinegar!) and salads with homemade ranch assuaged our hunger.   But then, a gentleman dining alone was seated next to us. While it seemed awkward at first, the close proximity of our table brought us to talk to the man, who owns Bread and Butter, a local breakfast and bakery we'll visit soon. He makes their bread, fresh, and trades it for a bowl of pasta once a week. Think about that. These businesses have such a friendly relationship, they just trade food for food. That is exactly the kind of good hearted folks who work here. While it was funny to listen to the kitchen chatter while we were waiting, I could see how some people would find it distracting or unpleasant. Though, BOTH owners came to visit with us, check on the quality of our meal, and ask about our Thanksgivings.  The environment at Buon Gusto is warm and inviting. My girlfriend put it best, \"I feel like I'm in my Italian mother's house, but I'm not Italian!\" Go there. Do it now. You will not regret it."}
{"text":"This restaurant \"used to be great.\"    It was recently sold and the new owners have made some changes that we really feel have made this restaurant a \"no go\" for my husband and me.   First, I have given this place a \"second try\" hoping that the new owner was just getting it together.    We arrived on what appeared to be a slow Tuesday evening.   I had to wait for 5 minutes before being seated - this is a small place and they were not busy!   I was finally shown to a table which was next to the kitchen......hello, could you have given me a better table towards the back?     I sat and waited for my husband to join me about 10 minutes later.    The food we ordered was extremely salty!    When the Owner came over to ask how our meal was, I told him the sauce was extremely salty and I couldn't eat it.   He then, get this, told me that only seniors from Sun City Anthem tell him this and they aren't a very good judge of food due to their age.   What??????    He also said that he hears this about once a month.......really?  BTW, I ordered the chicken Parm dinner and the presentation was awful and the chicken was pressed, processed chicken.      Never returning to this restaurant.     If I could give this restaurant no stars I would have done that in this review."}
{"text":"While I was eating my mouth was a bit surprised the flavor was great and the texture was spot on! I have just gotten so used to going out to eat at any Italian restaurant and the pasta simply isn't cooked to the perfect texture. Usually it's too soggy. Most places have good and interesting flavors but who does pasta perfect?"}
{"text":"Don't bother to go here.  We went for lunch because we had an entertainment coupon since we are from out of town.  Got there at 2pm and were the only ones there.  Waiter was friendly.  He brought our drinks (glass of house merlot $7.95). We then had salad and bread which were good.  I ordered pasta with chicken and broccoli (not much flavor), my husband ordered a personal pizza. It took about 40 minutes before we got our meal and the waiter said that only the sauce was a little burned, however the bottom was black. We told the waiter that it was terrible after taking 1 bite. The waiter said he could bring a slice of sausage  pizza which took another 10 minutes it came overdone but not burned. The waiter apologized and said he would give us back the coupon and adjust the bill. When the bill arrived it was $1 more than it would have been if we would had received the meal we had ordered. Certainly will not be going here again even with coupon."}
{"text":"Was looking for a place close to home for Italian food and came across Buon Gusto and read raving reviews on yelp! Everything we had was excellent. Good sign- We went there at 8.30 p.m. on monday night and there were quite a few people eating there!  The server brought some really warm bread and an amazing olive oil, olive and garlic dip with balsamic vinegar. We thought about just having one slice each but ended up eating the whole bread!  I ordered portabella mushroom ravioli in a red pepper sauce. This was divine. The red pepper sauce was a rich, cheesy sauce with a great red pepper taste. The ravioli was almost melting in my mouth.. D ordered a vegetarian pizza which had a generous helping of cheese, artichokes, olives, and roasted eggplant on a thin crust pizza base. Excellent again.  Everything seemed to be freshly prepared and of great quality.  HIghly recommended!"}
{"text":"Their pizzas looked good in pictures Chicago like so I went for the gusto and ordered many toppings. I like that flavor burst. I figure they must charge 4.00 per topping. Well I was up to 28.00 with my big mouth. What I really want is a pizza with no rules. Endless toppings and a price that won't break me. Now for the taste. I was expecting some spices on there such as oregano basil salt pepper so there went half the flavor. I didn't feel the love with the cheese. I only like regular mozzerella, not low-fat. In fairness, the pizza with all those toppings I picked, did make the pizza flavorful. The price might scare me away for next time however. Thank you for the experience though. I did enjoy!"}
{"text":"We have never eaten in the dining room, but Buon Gusto  is now the only place from which we will order pizza.  It's worth the shlep to pick it up as they don't deliver.  The crust and sauce are perfect in consistency and taste.  Another great item is the house salad dressing...I wish they would sell it by the bottle!"}
{"text":"The only reason this place gets 1 star is because 0 is not an option.  Apparently this is a new location for this restaurant.  It is a total disaster.  The fun begins when we are offered a table by the door on a cold night when multiple other tables are available.  15 minutes later we are asked if we would like something to drink, and we ask to see a wine list.  10 minutes later wine order is taken and 10 minutes later it is actually served at which time we ask for bread and to order.  15 minutes later order is taken, bread is delivered, and water appears.  20 minutes later an undercooked, tasteless pizza is served.  10 minutes after that a salad drenched in balsamic vinagarette is served ( I had asked for dressing on the side).  20 minutes later lukewarm, tasteless, eggplant baked ziti is served.  Waiter apologizes for how busy they are.  I don't expect that to be a long-term problem.  Owner is visible, but apparently oblivious to what a disaster is occurring.  Multiple other diners are equally unhappy and several of us commiserate.  There are a multitude of other Italian restaurants in Henderson.  Every one of them is light years better than this."}
{"text":"While visiting family in the Henderson area we were looking for a late night dinner spot.  Italian sounded good, but we wanted to avoid the chains in the area.  The in-laws had heard of a local place with a good reputation but couldn't remember the name.  A quick search on Yelp narrowed our search down to Buon Gusto. It was the perfect find!   They have a small dining area and take out service.  We opted for dine-in.  A little cramped for our party of 5 but the atmosphere is pleasant and service was friendly and helpful.   The food was fantastic.  The sauces have a great homemade taste and the pasta was cooked very well.   My salad was super fresh and crisp and the house dressing - balsamic vinaigrette -- was lovely.  The star of the table was the Chef Cisco Style Eggplant entree.  A must try.  Sliced eggplant tossed in a marinara rosemary sauce, smothered in cheese and baked.  So amazingly tasty. The other dishes were very good as well.  The one disappointment was the wine by the glass selection.  Very limited and what they had was not good quality. Overall I highly recommend a visit to Buon Gusto."}
{"text":"The Brooklyn hero was amazing!  The house salad dressing was excellent and service was great."}
{"text":"We LOVE Buon Gusto's food.  We have eaten at Buon Gusto a dozen times now so I have a good sense of this restaurant and its fare. This is simple Italian cooking done well.  There's no pretense to this little restaurant at all. There are not a lot of tables, and it always surprises me that there isn't a longer wait.  I suppose people calculate the wait potential based on their small seating area beforehand. I know we do, and we've only been one Friday and one Saturday because we fear a long wait.  The service here is excellent with the exception of one waitress who is slow, unable to multitask, and inattentive, but the excellent food overcomes her inabilities.  ALL of the wait staff are friendly and courteous though.   We have a few favorites on their menu, and I think all are their signature items.  The Artichokes Italiano are fantastic.  A prefect combination of creamy, acid, saltiness, and garlic.   Use the bread to mop up the remaining sauce, it's THAT good.    You can't go wrong with ANY dish that uses their roasted red pepper sauce.  The sauce is creamy and the sweetness and toastiness of the red pepper shines through right up front and you get nice peppery notes on the finish. A wonderful sauce.  The Sausage and Mushroom Rigatoni is excellent.  The fresh mushrooms are not overpowered by wonderful sweet Italian sausage.  The tomato cream sauce brings it all together for a truly well balanced pasta and meat dish.   Finally, finish it all with their home made tiramisu or with their salted caramel gelato.  We love Buon Gusto.  Love the food, the staff, and the service.  I almost hate to write a review that sings its praises as we want to keep this lovely little gem of a restaurant all to ourselves."}
{"text":"My husband and I have eaten here twice.  Today though the place was jammed packed with customers. The servers were great! Their food was fantastic. And they handled a big crowd the best a little place could. You guys rocked and the food was great!  Thanks for dinner."}
{"text":"I come from a big Italian family and I am grown to my family's cooking. I must say that it is very difficult to find a place that serves food as good as Buon Gusto. I have been to so many restaurants throughout my life. I lived on the east coast and the west coast and been to so many places that just served mediocre food. Some of it was good, but not great. I remember my cousin went to Buon Gusto and she told me about it. She said to me that she could not believe how authentic-tasting the food was, and how it was just like our family's cooking. My mom is such a wonderful cook so I know the difference between Italian food and great Italian food. Everytime I come here, everything is on the money. Every detail, ingredient, and server is incredible. The place is so welcoming, warm, and so intricate. The food is TO DIE for. And I don't know about you but if the food is this good, I don't care how much I pay for it. This place has yet to disappoint me or anyone that I recommended it to. I honestly feel like I am eating right out of my mother's kitchen. Incredible food and service, and I highly recommend this place to anyone who wants great quality and great, authentic Italian food. You will not be disappointed at all. I will be coming here for as long as I live in Vegas. I feel like I just want to scream and shout to the world about this place!"}
{"text":"Ordered take out last night.  Wanted to go traditional.  Ordered spaghetti and meatballs, penne with meat sauce, and then a salmon with broccoli.  And a side of mozzarella sticks w sauce.  All dinners came with a great side Italian salad.  House dressing is awesome - oil and balsamic.  Pasta - the pasta - was fantastic.  The sauce was fantastic. Salmon was cooked perfectly.  If that wasn't enough, the portion was very large.  Huge.  Take out was amazing.  I picked it up and it was hot when I got home.  5 stars.  Will keep going back.  If you haven't tried Buon Gusto - try it.  You will be back.  David Grant."}
{"text":"Unsanitary conditions and rude staff!  We we're waiting to be seated and the waiter on duty (long grey hair, pony tail, mustache) was clearly flustered at how busy he was and was very rude toward us and the other couple waiting to be seated.  While waiting, we observed this waiter step behind the pizza counter and proceed to plate salads with his bare, unwashed hands (no gloves, no tongs or other serving tools).  Needless to say, we left in search of another place for dinner."}
{"text":"its a small family owned Italian restaurant, alley kitchen type. The pizza is very good. I enjoyed my linguine and clams its the old school Italian way mama makes it... without the nagging."}
{"text":"For those thinking of eating here:  Beware!  There are new owners without the same high standards as the previous owners!"}
{"text":"I absolutely love this place! The new owner, Kimberly is the sweetest. The food is incredible, but the portions are very large, so come hungry!! It's a small venue... so it may seem a little packed at times, but that (to me) just makes the place feel more intimate. Kind of feels like you're at home with your family. :)    I thoroughly enjoyed myself, and will definitely return. Great service, great food, and a wonderful new owner!! Thanks so much!    OH!!! I can't forget the CANNOLI'S!!! They're a MUST!!"}
{"text":"Love this place!!!!  Food is excellent and service is great! Try their chicken pesto salad...YUMMO!"}
{"text":"Everything about this place is horrible. If you want real pizza, go across the way to Guiseppies. They have real pizzas and good service."}
{"text":"Veal parm was bland. Other veal dish bland also. Ceaser sal. mediocre.. Cuginos across from UNLV is waaaaay better! And cheaper!"}
{"text":"Went for lunch and was pretty excited based on all the good reviews. Unfortunately I wasn't too impressed. Maybe they do Better dinner wise? My boyfriend and I both had sandwiches. They were alright. Only one older gentleman was really doing any work, our server. Willing to give it another shot though. Will probably order dinner to go instead."}
{"text":"Best scampi!! & The shrimp parmesan is amazing!   We took my family here for the first time and they were all pleasantly surprised (and all plates were finished- no leftovers).  Every one of us left full and happy!  It is small, which I prefer (they probably have about 15 tables or so).  Buon Gusto is by far one of my top Go-To places for Italian food!!!"}
{"text":"We were so disappointed in the food and the service tonight. We have always loved this restaurant, and we were excited to try the new location. They had one waiter who was frazzled all night. He took a long time to take our order. He never refilled our water. The meals came out at different times, and the pizza came out 15 minutes later than the other meals. We asked to speak to a manager but no one was there. We won't be going back!"}
{"text":"A nice little family-owned restaurant to take a date for a fantastic Italian meal. The atmosphere reminds me of Little Italy with the red-checkered tablecloths and \"That's Amore!\" playing in the background. It's great supporting local businesses especially when they offer great service. Put Buon Gusto on your list!"}
{"text":"Went there NYE for dinner and had a great experience. Waitress was funny and had a great knowledge of everything on the menu. The only thing I found wrong with this place is that it is a little too small for the amount of tables in it."}
{"text":"Well I was hoping but this was better than montesano's Italian restaurant I could tell you right now it is not pizza was subpar the mushroom and sausage rigatoni which everybody raved about on Yelp was okay but nothing spectacular definitely not a 5 star - dish the best thing about the meal was the bread that we had to wait a while to get what's good when I eat here again I doubt it"}
{"text":"My parents have been trying to get me to try this place for months. We grew up with the best Italian food in NY and this place is just like being in a typical Mom & Pop Italian restaurant in NY. The veal parmigiana was unbelievable. So thin and tender the butter knife slipped right through it. The portion was also huge. 3 cutlets filling the whole plate. Had to take alot of it home. We also had the Seafood Del Mar which is basically Seafood Fra Diavolo. Amazing. Just the right amount of kick in the spicy marinara sauce. Tasty muscles, clams, shrimp and calamari. Very friendly and attentive staff. Very reasonable prices. Highly recommended."}
{"text":"We order all the time thru bite squad. Great for pool parties and other events. No complaints."}
{"text":"Buon Gusto receives my first 5 star review. I base this rating comparing price with quality. This little Italian restaurant in Henderson is a great night out for the value. I had tried both their pizza and the Baked Ziti and all of it was as good as you can get anywhere.   The staff was very attentive and courteous. They handled order changes very well and where gracious to our needs.  The décor was a little dated but could still be considered relevant for a small neighbourhood restaurant.  All in all, if you are looking for a moderately priced Italian restaurant, this is defiantly the place."}
{"text":"Lovely place!! Sometimes the best spots are right around the corner, hidden and unnoticed. The ambiance is very Italian!! Lol I feel like I am in an Italian village upon sitting down. The servers are extra courteous! I love it! :) Very respectful. The food is really good!"}
{"text":"I was in town to run a half marathon and I was looking for a local pasta place.  I checked Yelp and found Buon Gusto.  The ratings were great so decided to give it a try.  I can honestly say, it was worth the trip.  The place is really small and certainly local.  We arrived early (4:00 pm) since we had a show to catch, but I knew I needed to eat prior to the show.  The restaurant was already getting busy even at this time of day.  We were a group of 5 so we were seated at one of the 2 larger tables.  The waitress was really friendly and helpful.  The food was amazing. The portions were ok, I would truly recommend the side portion dishes as they appeared to be almost the same size as the full portions but they are way cheaper.  The only thing I did not cared for was that we had to keep asking for more bread ( which the bread is awesome and could not get enough of it :) so we asked for additional bread since we were 5 adults and the bread is not large.  But once we asked we got more bread, so it was ok.  Overall, the food maybe a bit more expensive than a chain Italian place, but I rather pay a little more for a small local business that the food is good.  Not to mention, they serve Coca cola products, which is awesome.  Many restaurants in the area serve Pepsi, it is just not the same to have a \"Pepsi and rum\"..."}
{"text":"Small, friendly, great service!!!! Had the lunch special rigatoni with tomato cream sauce. Outstanding! Will return."}
{"text":"Looking for a hidden gem? Then you need to visit Buon Gusto. This placed was recommended by a friend of mine and I have been back with my girlfriend 4 times in 2 weeks. Good service, Good prices for the portions & Great delicious tasting food. I would definitely recommend anyone visiting this restaurant. You won't be disappointed. Try the lasagna & the Ravioli portobello mushrooms. So good!"}
{"text":"One of my favorite Italian places in town, always coming back for more. The manicotti is awesome along with the fresh bread and dipping oil !"}
{"text":"Still my favorite...Chicken Franchese the best..... New location is great... service wonderful... house Chianti yummy"}
{"text":"We found this place by chance. We were originally going to go to guisseppes. Thank god we didn't go. This place was amazing. It's a small place but very intimate. Staff was so attentive and welcoming. Food was awesome. I got the lobster ravioli and my boyfriend got the \"boo boos baked spaghetti\" both were delicious. For dessert we ordered the pumpkin gelato. It was so creamy and hit the spot. Definitely found my spot!"}
{"text":"Paid way to much for chicken with No Pasta. Giuseppe's  30yards away just as good if not better and they have a $10 menu"}
{"text":"Ate here for the first time this weekend and was blown away by the baked eggplant.  The Chef came out and talked to us and he was very friendly, as was the wait staff.  I had a great experience there and the food was amazing.  Do yourself a favor and eat here!!!!"}
{"text":"I love the candlelit charm of an Italian restaurant and Buon Gusto has exceptional service and food to go with that charm. Expect to wait if you visit Buon Gusto during peek business hours. Buon is a small and very popular restaurant; the food, service, and charm are exceptional.  I had the clam chowder soup to start my meal and that was a perfect amount of food to hold me over until the eggplant parma appetizer. The eggplant parm is made with garlic, pancetta, and sherry wine. It was great! Honestly, I might try it next time as my entree.  Have you ever had pumpkin lasagna? For my entree, the chef had created a lasagna experiment. One of the owners sold me on the lasagna with a pumpkin sauce. If expecting a red meaty sauce, you might have been disappointed. However, I was forewarned about the substitute and details of the creation. I tend to enjoy trying new and different cooking creations, so I was excited to try pumpkin lasagna. The owner's enthusiasm sold me. His description was spot on. I really enjoyed the off menu creation. You'll have to beg the chef to recreate this pumpkin sauce next season.   All meals are served with warm bread and soft butter. The restaurant is clean and the decor includes checkered tablecloths and hanging grades, garlic, and peppers. You'll see jars of peppers and pasta - and of course no Italian restaurant would be complete without the \"Buon Appetite\" prominently displayed. I will definitely visit again next time I am in Henderson."}
{"text":"Stumbled across this neighborhood restaurant.  Like that it is small and intimate and the staff friendly. It looks very old and dated but the food was good. I had the eggplant and could have used more meat but loved its cheesiness.  Bread was delicious.  White pizza with basil and broccoli could have used some of my cheese. Crust is thin and with the bread so delicious probably would have been tastier with a thicker crust.  Wouldn't make a special effort to return but if in the neighborhood I may stop in."}
{"text":"I love this little family run italian place.  They have some of the best italian food in town.  The chicken millanese (order it wet) is fantastic - you never need a knife.  Also try the pasta with Vodka sauce. Great little ambiance and friendly service."}
{"text":"Recently made a return visit and discovered that Buon Gusto now offers gluten free options. Pleased to have chicken marsala sans flour, and substituted with coconut flour. If you don't mind the texture of coconut flour, I think it makes an excellent replacement than not having the dish at all. The marsala was nice, a little sweet, but just happy to eat it again gluten free!"}
{"text":"I am Italian and hard to please when it comes to authentic food. I would recommend this place to the fussiest eaters. Just like mama and nana made. No processed food here. Place is small, but quaint and clean."}
{"text":"It was a friendly place. The service was good. The servings were large. The place was not a Strip restaurant for atmosphere but it serves good food. The atmosphere was neighborhood type. So was the price.The chicken breast Marsala was very well done and the portion substantial. The side dish of penne with fried garlic and olive oil could stand alone. The salad was fresh and nice but nothing exceptional. The bread was very good and served warm. My 3 guests had sausage & mushroom rigatoni, chicken parmigiana, and linguini del mare. They were all good  tho' not outstanding. The teramisu was outstanding, however. Overall, the quality of food is comparable to Nora's and Pasta Shop Restaurant, and better than Gina's Bistro. You also get more for your money. I would recommend it."}
{"text":"What happened? Did this restaurant change owners again??  One of my favorite meals is Chicken Francese with Penne Alfredo. I can't find Chicken Francese anywhere, and this place always made it so good, along with the Alfredo sauce. I've never dined in, always ordered togo which took 45 minutes each time. That's fine, I don't mind the wait considering how delicious the food WAS.  I ordered  $60 of food to go. None of it was even... ok. The chicken francese tasted old and not how it's supposed to. I don't know what was put on top... garlic...? But it was crunchy. The Penne Alfredo had absolutely no alfredo... and whatever was put in there had no taste. Our togo order was wrong too.  There must have been a change considering the other bad reviews. Sad that I now have to say my goodbyes to this place."}
{"text":"It will be a shame if you don't give this place a try.  It is one of the best Italian restaurants around.  There isn't anything on the menu that will disappoint - and the atmosphere is very friendly.  Lynda"}
{"text":"Horrible! Antipasto was 4 pieces of meat, 1 piece of cheese and tons of lettuce. ?!  Italian wedding soup straight out of a progresso can. Same with the red clam sauce. Pesto sauce ok but the tortellini was way over cooked. Eggplant was ok but bitter. We were 4 adults and they gave us 5 slices of bread! Talk about cheaping it out! Service was nice but very slow. Predict this place won't last. Empty on a Saturday night!"}
{"text":"Super good! Everything was delicious and the staff was great. I ordered the baked ziti and they used penne pasta. Thought that was unusual but would definitely come back."}
{"text":"I used to love to love this place! Steve was a great restaurateur! However the new owner should have taken some lessons and certainly not changed the menu. We waited an hour and a half to have our entrees come out looking nothing like what I was used to. The Chicken Francese  came out all mixed together and they put red sauce on it. The sausage on my Dates plate was ground sausage ....which would have never left the kitchen before!  I'm only giving one star because the Drinks were cold and refilled. Saying sorry for the delay and blaming it on staff not showing up only goes so far....."}
{"text":"We decided to come here on a whim wanting to try something new and it was actually really good. My husband got a large pizza with chicken and sundried tomatoes. I ordered the chicken Parmesan.  The pizza was okay but the chicken Parmesan was very very good.  I would come back for the chicken Parmesan for sure!  The manager was very nice and talkative but our actual waiter wasn't that great; maybe it was just an off night for him.  The gelato was super yummy too!"}
{"text":"Excellent service. The service is probably what stuck with me more than the food. The restaurant is located in the corner of a shopping center on Horizon Ridge and Eastern -- pretty difficult to spot unless you are familiar with the area.  Inside of the restaurant is compact, charming, and homely (in a comforting way). The male server that greeted us may have been the owner. He was interested in hearing how we heard of the place, made sure to explain the menu and offer suggestions based on some of his favorites, and checked in on us regularly throughout the meal.  We opted for the calamari \"best in town\" as an appetizer ($8.95). It was fine, cooked tender but overkill on the batter.  The food, or perhaps what I ordered, wasn't mind blowing or innovative. It was simple chicken marsala, and sure maybe it is partly my fault for going for the basic, unimaginative option, but to my credit the menu did claim \"best marsala in town\". Not sure that I will agree there. There really is only so much you can do with a straightforward dish like that, hence why I will not dock them more than a star for the food. The chicken was cooked well, marsala wine sauce was fine, and the mushrooms were...mushroomy?  The meal did come with the option of soup or salad; I opted for the chicken and mushroom soup. The soup was really, really good. I also opted for a side of baked ziti in regular tomato sauce. That also was not very memorable. But the meal was a great value for $16.95.  I love Italian food, it is the first type of food I learned how to cook and excel in, so maybe I should just not go out to eat at Italian places because my expectations are really really high. I go as far as making my own homemade pasta and sauce with as many natural and fresh ingredients as I can.  I have yet to be wowed by an Italian eatery with the exception of Scarpetta."}
{"text":"Absolutely fantastic food!  We ordered our meal to-go.  I ordered the \"best lasagna you've ever eaten\" and let me tell you... it was.  My husband (who is on a low carb plan for eating) had their low carb special with grilled sausage and onions with peppers.  He loved it!  My kids had pizza and thought it was fine.  I tasted the pizza and it was better than average...  The prices were fair, and the quality was superb.  This is my new favorite neighborhood spot for sure.  Next time I will try one of their gourmet pizzas.  The bread that came with my lasagna was delicious.  I wondered if it was the same dough for the pizza.  Thanks!!!"}
{"text":"We went in around 3:30. Lunch specials are only good til 4pm. When we ordered it was a few minutes before 4pm and they didn't have any pizza slices and only had 1 couple there and they weren't eating pizza. He said if we wanted it, we had to wait about 20 minutes for it. We ordered the pasta vodka and the pasta with olive oil and garlic instead. The pasta vodka was pretty good but the olive oil and garlic was extremely dry. We also ordered the Brushetta and that was not your normal Brushetta you would find at an Italian restaurant. It was on a piece of toasted breaded but covered in melted cheese and oil...not good. Probably wouldn't go there again."}
{"text":"YUMMY!!!!   Had an eggplant dish that was so good and the chicken masala was the best I've ever tasted.   The fresh bread was given with olive oil, garlic and balsamic for dipping.  Our server, Heather, was fun and friendly.  Great neighborhood atmosphere.   Definitely will be a go back."}
{"text":"Josh is so awesome! He always remembers me by name and knows my usual order.  Everyone there is so nice and welcoming!  The food is really good and great quality!!! It's family owned and worth going out of your way to find it. You are missing out if you have not been here. A real city secret!!! Love this place!!!!"}
{"text":"Love this place for the its NY style Italian restaurant atmosphere. When I'm there I always feel like I'm back in NYC eating in Little Italy. Everyone is friendly and plates are priced/portioned well. My girlfriend and I love doing take outs from here whenever we want to stay in and do dinner/movie night together. She loves their gnocchi with cream sauce and I love their rigatoni with mushrooms and sausage in roasted pepper cream sauce. Each entree comes with salad/soup and bread.  I want to try their pizza one day too, since I've heard many good things about it. Definitely give this one a try."}
{"text":"Looking for some good hole-in-the-wall Italian food?  This is it! We had a large group of 8 or so and they were able to accommodate us just fine. All of our drinks and breads came out so fast since it was a late lunch (I think it was like 3pm or something) and we were starving!   The servicer was very attentive and constantly checking on us. We all ordered our own dish, some pasta dishes and a pizza. The pasta turned out great and everyone from our party seemed to enjoyed their dish. I don't think the pizza was that outstanding to mention it.   Overall, a good decent place to eat some Italian without having to go to the strip for it. :)"}
{"text":"Same restaurant - different location. We were in the Anthem Center and saw that Buon Gusto opened right here just 2 weeks ago, so we really wanted to be supportive and try it. The restaurant has 2 small rooms. The one away from the door has a bar area with 2 TVs (hockey game on while we were there). Our server, Drilon, was at our table very soon after we sat to get the drink order. Drilon is super friendly, the type of server you like immediately and will overlook a lot. Good thing we weren't in a hurry cause it took a really long time for him to come back to get our main order. And then an even longer time for the food to arrive. The meal comes with soup or salad. We each went with a salad. A little heavy handed on the dressing, so next time I will get dressing on the side. Overall, a pretty good side dinner salad. I ordered the chicken cacciatore with a side of penne in marinara sauce ($17). The chicken came buried in a brown sauce - to the point where you couldn't see the chicken. Not a great presentation. A fairly large portion and quite tasty. The penne made its appearance much later and was room temperature. My wife got the chicken Angelo, her go to dish when trying a new Italian restaurant. It was just OK. For her pasta side she asked for penne. Instead she got the meal served over fettuccine. Not a major offense except we were charged an extra $1.50 for the pasta for her dish. When I asked why her pasta side was an extra $1.50 while each of the other sides were included in the meal, I didn't understand the reasoning but I wasn't going to spend a lot of time on it for $1.50. I was torn between 3 and 4 stars, but the very friendly service and my dish being so tasty, I rounded up. Can't get too upset with the slow service - they are only open at this location for 2 weeks. I definitely will try them again once they have settled in."}
{"text":"shhhh don't tell anyone about this place! Actually please do...Its all great...from momma behind the counter, comfortable, friendly, and incredibly professional yet casual service, and hefty portions of incredibly fresh and delicious classics that force you to over-order so you can take home a doggy bag...not much more to say other than that its our job to support quality local joints like this rather than the corporate-driven slop forced on us in the LV Valley."}
{"text":"Last night was the second time I have eaten here and it was just as amazing as the first time.  Around Halloween they serve up a seasonal pumpkin lasagne that is delicious.  Last night I had the lobster ravioli with creamy roasted red pepper sauce that was spectacular. We love the quaint atmosphere and that this is not some generic chain Italian place."}
{"text":"Oops. My bad. I didn't get the memo they moved."}
{"text":"Just wish I had been here before now! Have seen it for years. Finally made it in as a friend took me for bday!!! I am somewhat jaded about Italian because lived in NY for years. Love pasta sauce.. pizza. Atmosphere and service. Great for family night out.. date night. Or take out. Will be back."}
{"text":"So we just tried the new location! Same delicious taste if not better (if that's possible) I'm very happy to see the increase in space and tables! In the mean time we just have to be patient as they grow their staff! The food and service did take a while longer, but we were not in a hurry and the food is soooo worth the wait! Everything was hot and fresh served! They have tv's and a bar area plus a huge pizza oven! Congratulations and I'm so glad you are back Buon gusto! We travel 1/2 hr to come enjoy the food! Our server Randall impressed me he was waiting at like 10 tables at once #respect and still smiled and provided great service! Owner stoped to say hi and also kept her cool and thanked us for coming to the new place, just 5 more minutes up on Eastern"}
{"text":"This is a quaint little place that appears to be family owned and operated.  When entering I noticed lattice with plants running down, small tables with green and brown checkerboard patters (they were plastic mats, kinda lazy) and lots of small nooks covered in assorted items. It's feels a bit cramped with the beer fridge, wine rack, and wait station all in the dining room, but overall seems to work.  I ordered spaghetti and meatballs ad I fell that it's the true way to measure an Italian restaurant. If they can't do that right, walk out and never return. I have had quite a lot of frozen meatballs, sauce from a bottle and overcooked pasta. This was NOT one of those places. The meatballs were about baseball size and obviously fresh. I was sitting close enough to the kitchen to hear what was going on, and never heard a microwave.  The meatballs were seasoned and browned well and you could taste the fresh basil. The sauce was perfect as was the pasta.  The only thing I did not agree with was the wedding soup: tasteless, bland, and barely warm.  I would definitely return."}
{"text":"We saw Buon Gusto on Yelp last year and gave it a try.  We were so pleasantly surprised we will go back again this year.  Comfortable and GREAT food.  We are really looking forward to our return visit."}
{"text":"I used to love this place and am truly devastated to be giving it such a sad rating. I hadn't been to Buon Gusto for a while so when I was in the area, I decided to go get some of my favorite pizza to go.  What a surprise when I get home and open the box to find a pizza that looks nothing like I remember. The pizza was burnt in some places and looked undercooked in others. Unfortunately,  the taste was off too.   I took one bite and went to my pantry to make it a cereal night. To be honest, I just wanted the old pizza. This was a disappointment all around.  I guess they have new owners. I wish I had read Yelp before ordering. So, here is your takeaway from my review: If you LOVED something in the past, check Yelp before going as you may just be disappointed if you don't."}
{"text":"Awesome food. Love the bread, salad, pizza and pasta. The service is great as well. I highly recommend Buon Gusto to anyone looking for authentic Italian food."}
{"text":"Pasta: over-cooked Lasagna, drenched in Cheese, no Bechamel. Pizza: dough and sauce okay, way too much cheese, boring  Service: unattentive old man.  Atmosphere: Vinyl tablecloth, tacky deco, could be in the Bronx  No reason to ever go back."}
{"text":"BRAVO!!!  Great service. Fantastic food. The chicken cacciatore was delightful. Try the Sicilian sauce!! Molto Delizioso!!"}
{"text":"On Sat 7.30.16 We ordered 2 entrees to go, the Sicilian Eggplant parm and Crab cake entrees. The upside The food was great, the crab cakes were right on, they are homemade and delicious.The eggplant was cooked perfectly with plenty of cheese.  The downside When I got home and opened the boxes, I noticed the Penne Marinara included in the menu description was missing. Apparently if you dine-in, you do get a side of Penne marinara. If you get your order to go, you do not get the Penne Marinara. I called to ask about this and I was told it was because of the cost of the \"To Go\" box.So that leads me to a question, if you dine in and can't finish, do they charge you extra for the \"to go\" box then? I felt very disappointed about this and might not go back there because of it. Little things can make a big impression."}
{"text":"I love this place everyone is so sweet and the food is to dye for! The pizza and Del Mar are my favorites, oh wait can't forget the cannoli."}
{"text":"This place is old school Bronx for sure. I heard from a girlfriend that it was pretty good but alwayd just passed it by just reminded me of a hole in a wall that really did nothing for me! Should have known better!! Because being in the food bizz fir over 30 years i should know better. Walked in chase a handsome younger guy greated us and was as genuine as you can get introduced us to Chris prepping in the kitchen and before you knew it not only was Chris working on one of the best philly steak steak but  Joz Philly cheese steak!! And Chase was hard at wirk making the Best slice of pizza by the slice!! I love this place!! Best pizza and employees in town and thats hard to find!! Will be back"}
{"text":"This is a surprise strip mall find. It's a tiny spot, tucked away at the very end of the strip mall. It's nothing fancy to look at it, but it's cute and has an authentic feel. It can get busy, but we only had to wait maybe 10 minutes for a table to free up.  The staff were very polite, friendly, and attentive. Our waters were never empty, we were checked on numerous times, etc.  It's a pizza, pasta, and other Italian fare restaurant (duh). I was quite excited to see penne alla vodka on their menu (a serious fav of fine). They also have some delicious sounding raviolis and other pasta items. Everything we ordered was great and delicious. Portions are good - not overwhelmingly large, but you might walk out with leftovers. And most everything comes with a soup or salad. Neither are anything particularly good or fancy, but they get the drop down. The bread and olive oil garlic dip is delicious.  They have a small drink menu with at least one of most types of popular wines and some bottled beers. It's nothing to write home about, but it's enough to compliment your meal.  All in all, a very pleasant meal was had here. We were well taken care of. The food was yummy. And everything was decently priced. So yay! I've found a new neighborhood restaurant."}
{"text":"What a great place for Italian food!! Everything from the atmosphere to the service to the food, it was all legitimately GREAT. The Meatball parm is second to none, huge flavor full meatballs, perfect amount of sauce, melted mozzarella and great crusty bread.  My friend had the Chicken Parm and had nothing but great things to say about it. I look forward to bringing my family here for dinner very soon. It is great to see a small family owned restaurant putting this much care into the food and customer service!!"}
{"text":"Let's just put this out there, if you mess up, fess up.  My lover and I got dinner entrees, his being baked ziti with sausage and I getting crab cake entrees. The salads were delicious but when our entrée came it was a different story.  His ziti tasted microwaved. The noodles were mushy and the sausage was sliced so thin. Mine was supposed to come with pasta, but didn't.  Two greasy crab cakes in a huge pile of an inconsistent, lumpy, sad excuse for a roasted red pepper sauce. I was offered gelato in lieu of no pasta.  No thanks, ice cream doesn't make everything better.  So I received the appetizer crab cakes but was charged for the entrée.  When I told the waitress that, she tried to tell me the crab cakes were different size vs the app and entree. Get out of here lady. They took 1.80$ of my meal for their mess up. Worst 60$ I've spent in a minute.   I do what you do everyday and you shouldn't disagree with the customer when you guys obviously messed up.  I don't believe there was a person there over the age of 22 and the maturity in that place really showed.  Won't ever be back and you've been warned!"}
{"text":"I love this place. The portabella mushroom ravioli is to die for. This place definitely reminds me of good restaurants back in NY."}
{"text":"I visited this place just to try portobello mushroom ravioli in red sauce after viewing some pics on yelp. The waiter was very friendly. After he brought me a water I asked if it would be possible to sit outside, the weather was too good to be indoor. He set up everything for me in a minute. So, overall, I was very happy with service. And food was super tasty! I got ravioli and tiramisu. Both are 5 out of 5."}
{"text":"My wife and I usually go out to eat on Sundays when Buon Gusto is closed so we made a point to go there Saturday and finally try it. The service is great, a very friendly staff that make you feel at home. My wife ordered the Broccoli Penne and I ordered the Buon Gusto. My wife's Broccoli Penne was great no complaints, the Buon gusto however was just a little better than average which was kind of surprising since its named after the place. For desert we tried the bread pudding which is 6 out of 5 stars. I would give this place 4.5 out of 5 stars but thats not an option so well go with 5."}
{"text":"This resturant changed ownership, and the food is horrible. We had the sicilian baked ziti, which had no flavor and the eggplant didnt taste fresh. We also had side of broccoli that was mushy. I ordered a meatball that had no seasoning, and it taste just like balled up ground beef. The kids meal pasta was too buttery. The last time I was there the food was tasty, but this time it wasnt good at all. Sorry, we wont be back."}
{"text":"We came here on our Vegas trip last weekend and they were amazing! We searched and searched for a nice Italian place to eat and couldn't come up with anything that peaked our interest. I found this place on yelp and decided to call. I told them we had 13 people coming and would be there within 45 minutes. We arrived and they already knew who we were! The place is definitely on the smaller side (which we didn't realize) but they accommodated us well. We had to wait a bit for our food because their kitchen is smaller but it was worth the wait. We chatted with some locals while waiting and they were so friendly. They gave us some ideas on what to do and where to go.  The food was by far AMAZING.Definitely family style Italian. Reminded me of home to be honest. The portions were well worth it and plentiful. The bill wasn't that bad either and they were able to split checks efficiently and easily for us. I would definitely return when I make it to Vegas again and I loved how they made us feel like family!"}
{"text":"This is my new favorite restaurant! The food was amazing! I felt like I was back in NY. The staff was very friendly. I can't stop telling my friends and coworkers about this place. Save room for dessert!"}
{"text":"I felt inclined to write this review after my experience last night.  My friend and I wanted some good pasta so I recommended we go to Buon Gusto. My friend had never been and I'd been to Buon Gusto several times and always had wonderful experiences there - except this time. It took 10-15 minutes just to be acknowledged upon arrival. No host/hostess was in sight.  After we were seated, they took our order quickly and returned with our salads and then we waited...and waited...and waited. They didn't even offer us bread while we were waiting until we asked. The bread was fresh and soft but the oil was an overkill. Imagine 95% oil, 5% vinegar. 35 minutes later as we waited, a cockroach decided to join the party. It ran across the wall under one of the paintings and attempted to hop in my friend's purse. We let our server know but by the time he returned with something to kill the cockroach, it disappeared. That should have been our cue to leave but instead we decided to relocate to the front dining area. One hour and 15 minutes later plus 2 and a half loaves of bread, our food arrived. I ordered the sausage and mushroom rigatoni, and my friend ordered the champagne chicken. The sausage and mushroom rigatoni was subpar. It was basically rigatoni drowning in a store bought vodka sauce garnished with a handful of mushrooms and cut up sausage. The champagne chicken was terrible. The texture of the chicken breast was like plastic and it was pale in color. Neither of the dishes were hot either. It was definitely not worth $20.00. To top it off, the server was rushing us to pay our bill. They didn't offer to give us a discount on our bill and a manager didn't even come to our table to apologize for the cockroach or the wait for our food. It wasn't even that busy! Honestly, we couldn't get out of there fast enough.   The only positive things about our dining experience was the bread and the salad."}
{"text":"5 stars all the way! Mom called our food \"home-made\" that's a high compliment from the mother of the International Diva aka yours truly.  Look no more Henderson folks, Buon Gusto is everything all the yelpers said!  And ya'll know  (with my sister Tina's Texan accent) I have traveled enough to tell you this is real Italian. Mom ordered the special which by the way was enough to feed two: Manicotti, delish. I asked our sweet waitress to give me her best shot: Rigatoni with sausage and mushroom on a cream sauce. OH MY JESUS!  I need to tell you to try their tomato bisque, out of this world.  We're planning a couple of birthday parties already up there, Steve was very friendly and told us he could set up a table for 15 no  problem. So there, for all of you who think we don't have good food in Las Vegas, take that!"}
{"text":"We were first timers here the other night, because of the Yelp reviews.  Wow!  WOW!  I use Fettuccine Alfredo with chicken as my litmus test for all Italian restaurants.  I just do.  Sorry.  This is THE BEST Fettuccine Alfredo I have ever had, EVER!  When you think in your mind what it's supposed to taste like (butter, cream, noodles not TOO thick), this is it.  Just simply amazing.  You must try it if you're a fan at all.  We shared it because the portions are HUGE!  The house salad is included for each diner if you pay the $6.95 plate fee.  Worth it.  The house salads are yummy.  We're going back soon and a lot.  Best Italian in Vegas.  No question."}
{"text":"This place was introduced to me by my friend Gina. It looks like it would be a pickup and go kind of place cause it's so small, but there is dining inside and it's very quaint. Make a reservation, alot of regulars go here...  Best calamari I've ever had and the owner is so friendly and interacts with the customers. Chicken Francaise (sp?) is \"heavenly\"!! Caesar dressing is authentic, which is hard to find-- (no brainer right?) Buon Gusto does everything right!!"}
{"text":"Food is ok - but waiting 50 minutes for to go order is ridiculous!! Not a do over do to the wait time!"}
{"text":"Walked in to the smell of cleaning agents.  They had mopped the floors.  It was nice and warm inside, brick wall paper, picnic table cloths Christmas music on the radio. Server greeted us quickly.  Ordered Caesar salad with my spinach and cheese ravioli. Our salad was sitting on the counter for 5 min before being brought to our table.  We found ourselves waiting for the main a bit longer than we anticipated.  The server apologized for the wait.  I requested my ravioli with Alfredo sauce.  It tasted great!     The sauce nice and thick. I remembered reading on the menu that our meal comes with bread.  I asked our server he responded, \"would you like some?\"   As we are once again waiting... I find myself slowing down so that I can save some pasta to enjoy with the bread. Yayy! The bread is here.... Nice little loaf. Soft and warm inside with a thin harder crust. I was in the mood for dessert but opted out to avoid more wait time.  Our check was brought out on a cute plate that looks like a slice of pizza.  Looked cool against the picnic table cloth. We waited for everything except for our bill.  The prices looked good on the menu $8 Lunch with salad.   My ravioli was around $10. It would have been a good price, but I was charged $2.95 to change my sauce and an extra $2.50 for Caesar instead of the regular side salad.  The server did not inform me of any of those charges. Overall the server was pleasant, my food tasted good, but I would have liked our food to come in a timely manner."}
{"text":"This is an updated review THIS WAS SOLD TO NEW OWNERS. So completely different nothing tasted the same. The old owners family biz are long gone. Bunch of teens sending out microwave meals only a matter of time before this place closes."}
{"text":"We decided to try this place because of the other (mostly) great reviews on Yelp and it was close to our house.  I was craving Italian and wanted to try a non-chain restaurant.  We arrived at the restaurant at around 630 on a Wednesday evening and the place was full.  It is a very small restaurant with about 8 tables total, but we were seated and greeted very quickly and with a smile.  I will say that the service we received was very friendly - no issues there.  I ordered the baked lasagna and added a Caesar salad ($3 surcharge), my wife ordered the shrimp scampi, my son the spaghetti & meatballs and my daughter the kid's fettuccine alfredo with the broccoli cheese soup.  We were provided a bread basket with oil and balsamic vinagarette - tasty.  The ambiance was fine, although we were seated right next to the kitchen door - it's a small place, so that wasn't really an issue for us.  We received our salads and soups and I will say that both me and my son were disappointed with the caesar salads - the lettuce was drenched in dressing and it wasn't very pleasant.  I certainly don't think it was anything special to warrant an additional $3 upcharge from a regular salad.  The soup, however, was very tasty.  Our entrees arrived shortly after and after tasting a few bites, we all looked at each other with a level of disappointment.  The food is NOT bad at all; however, we certainly have had much better at other places.  The meals, in general, were very bland.  There was nothing special about any of the entrees and it certainly did not warrant the price $15+ each.  There are a lot of Italian eateries in town and there was nothing at this place that would compel me to return.  We wanted to really like this place as we are all in favor of supporting family-owned businesses, but the taste has to be there and it wasn't for us."}
{"text":"Did not care for their food. Red sauce was not good. Looked like tomato soup. It was my bday gift from a friend. Very disappointed. Will not return. Wished i had gone to nearby Giuseppe's."}
{"text":"This is the best Italian place in Henderson as far as I'm concerned. And a bunch of people must agree because the last two times I've been we've had to wait for a table. It's small, but the food is outrageously good. Especially for the price. The team of regular servers that you'll see everytime you go are outstanding. The prices are more than reasonable considering the quality.  Secretly I hope not too many people find out about this place because it's clear they are going to blow up and then it will be impossible to get in. They are destined for a much bigger space. The pizza is excellent, but the pasta dishes are the stars here."}
{"text":"One of my girlfriends invited us out to this place with the promise of everything tasting awesome on a Friday night.  It's located in a small shipping center and if you're driving by, you would miss it!  We had to wait for a little bit, probably 20 minutes, but this place is small and it was 6:30 on a Friday night.  While we were waiting, the kitchen gave us free garlic knots.    Once seated, we were seen by our waitress immediately for drinks and appetizers.  We ordered the fried ravioli, cheesy garlic bread, and  calamari. Everything was good, but the fried ravioli was the best I've ever had!  It had plenty of filling and just enough crisp.  For dinner I ordered Bobos baked spaghetti and Sean ordered lasagna. It was all very tangy and delicious! If you hate garlic, maybe you won't like it so much but we do and we loved it! It was even better the next day.  We'll definitely be back for date night!  It's family friendly and has a nice dark atmosphere."}
{"text":"I finally have gotten around to writing a review for this place.  I love it here.  It's a very east coast, non-corporate type of place.  When someone wants to go out to eat and are visiting my at my place, I take them here.  At first, I was addicted to the Sicilian eggplant then I tried the sausage and mushroom rigatoni.  I don't think I've gotten anything else since.  This is so much so that when I stumbled in there yesterday evening, Steve says, \"You look like you woke up this morning and wanted the rigatoni.\"  The man knows me too well.  Normally, I get the salad (which is excellent), but this past time I decided to try the Italian wedding soup.  Not bad.  The artichoke appetizer was great as well as Cabernet. I think I've eaten the entire loaf of bread with the garlic, olive oil, and vinegar every time I've gone in there. While it may not be my favorite cannoli in Vegas, it still is pretty good.  Actually, everything I've had here is good.  I've had a few people ask me what is the restaurant that I go to the most-- this is it.  Is this the best restaurant in Vegas? No.  Is this my favorite restaurant in Vegas? Yes. There is just something about this place that feels like home.  That in itself is a feat not to be scoffed at."}
{"text":"DO NOT EAT HERE!! It's become apparent that the many 4-5 star reviews were given to the previous owners and this place is not as good as it comes across. My girlfriend and I were lured in by the positive reviews and it was a close location to our house. Unfortunately, our food was extremely questionable to the point that I had to ask the waiter if it was frozen.   The chicken parm was one of the worst dishes I've ever been served (soggy, tough, and bland), and we ended up sending the food back.  Overall, it's overpriced, bland, and I'm pretty sure it was frozen. You're better off at the Cheesecake Factory or even Olive Garden for that matter."}
{"text":"Not only was the food AMAZING, but the service was just as great. They were even kind enough to take pictures for us during each of our food courses :) This will be a very special place for us to eat at for years to come and I can't wait to go back again!!"}
{"text":"I was so hopeful that this would be a great addition to the neighborhood but it was disappointing.  The bread and oil served as you arrive turned out to be the highlight of the meal.  My ravioli was tasty except for the huge black pepper pieces that overpowered it.   The service was awful.  Worst waiter I've had in a long time.  Not sure if I will go back to give them a second chance"}
{"text":"This was the tastiest meal I have had since moving to Henderson. I ordered the tortellini in pesto as a takeout. It came with a salad, and OMG he salad was DELICIOUS! The salad included artichoke hearts, tomatoes and olives. I'm not normally a salad type of person but it really hit the spot. The tortellini was delicious too. I will definitely return to try more things!"}
{"text":"This place is tucked away in a strip mall and it doesn't look like much. It's very small and it gets packed up quick, making reservations is a good idea. The service is slow, but what do you expect during rush hour. The decor is so so very New York I'd assume. The bathroom is a bit scary, but the food makes up for it. The bread is delicious and fresh, especially when dipped in the garlic balsamic olive oil. My 4 year old always gets the pizza which is made fresh, my 11 year old gets the cheese raviolli, baked spahgetti they are both smothered in soft gooey mozzarella cheese. I like the clam linguine with red sauce, very yummy!  Remember service is very slow, so be patient, and that's the only reason they didn't receive 5 stars from me. When you get you check at the end they bring you tootsie rolls, my little boy goes crazy for it. Me and my two boys are fans of this place, my husband's never been. My 4 year old has been saving his allowance money so he can take his daddy to dinner here for father's day. That's how good this place is. :)"}
{"text":"We have been going to Buon Gusto for 3 years. It was our Italian go-to place for sure. Our last 3 visits have been terrible. New management maybe? Service is so very slow now. The guys that work there look like they could care less about you and their attitudes are poor even with delivery orders. We had one guy say that our order was \"gross\" because we asked for a sauce substitute on baked manicotti.   The food quality has definitely gone down hill as well overall. After being regulars, we were bummed about the downward trend in service and quality and won't be going back again."}
{"text":"The best Italian food in Las Vegas hands down. This place is always consistent with everything, very friendly and helpful service. Definitely resembles my mom's and grandmother's home cooking back in New York and Jersey City. I brought my mom here when she came for a visit and the food brought tears to her eyes. Now we come here everytime she visits, truly the place to be. This is real home Italian cooking at its finest. I highly recommend!"}
{"text":"OMG the pizza is awesome!!! The dough was so fresh and the crust was cook perfectly. I have dined in before and had a wonderful experience with the staff and the food was awesome. When I decided I wanted pizza I figured I would they them out since they offered fresh dough from N.Y. and WOW I had 6 people over and 3 picky eaters and everyone was happy. Again this time the staff was very friendly and curtious."}
{"text":"By far my favorite place in Vegas to get delicious, real, authentic Italian food. The fresh bread is amazing, the lasagna is to die for and the breeding pudding is unreal! This little place has put all the Italian food I've ever had to shame. I crave it weekly. I can't wait to go back again!"}
{"text":"Great food, comfortable atmosphere.  This is a local delight."}
{"text":"This place is amazing. Great food. Great service. Ok prices. Ok atmosphere. Try their pesto gnocci. It's amazing."}
{"text":"I've gotten food to go from this neighborhood Italian restaurant 3 times in the past, all without incident and all very good.  Today, however, was quite different.  I called in an order to go at 3:55 pm and was told it would be ready in 45 minutes.  I arrived on time and no one there could find a record of the order until the waitress that had taken it over the phone said yes she remembered it, but that they had gotten busy and that's why it wasn't ready.  She said it would \"just be 6 minutes to make it\" (a well done pizza and spaghetti & meatballs).  While I don't know much about cooking, even I knew that wasn't a realistic time.  And, if it truly would only take \"6 minutes\" to make, why did she tell me \"45 minutes\" in the first place?  But, worse than that was her attitude, which I would describe as indifferent or apathetic: she had no problem with accepting the order and giving her word that it would be ready and waiting for me, and then just blowing it off when I arrived.    Maybe I caught the staff there on an \"off day\".  Be that as it may, I'd suggest that if you order food to go from Buon Gusto, you get a firm commitment on their intentions to follow thru on it."}
{"text":"After the great bread and incredible home made salad dressings, I started thinking that I had finally found a Henderson version of Chicago Joe's (5+ star IMHO).  Well, they were about 80% of the way there.  The Mushroom Sausage Rigatoni was good...not great.  Other dish was ordered with shrimp and showed up with chicken...we complained a little but ate it...and it too was simply okay.  In short, I'm sure well go again, any place can have an off moment/day.  One other note, prices were a little high for the dishes not to be excellent."}
{"text":"We first ate here a few months ago.  The pasta and veal dishes were OK, but not spectacular.  Then last night I had a really strong craving for pizza.  But except for Settebello (which does a very crispy crust with minimal toppings), we have hated all the local pizza places, especially the chains.  I remembered that Buon Gusto also made pizza, so I called in an order of our traditional toppings:  sausage, mushrooms, and onions.  Oh, my goodness, did that HIT THE SPOT.  The crust was New York style (thin, but chewy) and the toppings were REAL.  Yes, Virgina, someone makes a pizza here in suburbia that is not canned and processed.  The pizza sauce was fresh, but not overwhelming.  And we were eating this pie after a 15 minute trip in the car!  I imagine that eating it inhouse (as we prefer to eat all our pizzas) can only be better.  I have to stop talking about this now or I will want to order another one right away."}
{"text":"This little hole in the wall has lived up to its stars. I visited once for lunch and once for dinner, both with my school-aged boys in tow. It's a cool little place to go to enjoy your meal. It's got this neat little Italian deli feel to it, but with table service.   For lunch, there are some really good specials. 2 slices of pizza and a drink, or a slice of pizza and a salad and a drink for $4.99. The pizza was tasty, and the waiter asked if we wanted to add toppings to the slices, which is great if you want more than just cheese. I'm guessing they charge for it, but we just had the cheese.  Their house salad is delicious. It's not just a few pieces of wilted lettuce on a plate with some bottle sauce plopped on it. Tasty veggies on top, and the house vinagrette is tangy, tasty, and should be sopped up with the hot bread they bring you.  Our dinner experience was a little different. My boys and I happened to go on a Friday evening, and we got seated at a table by the front, which meant we got stared at while we ate our food by the folks either waiting for a table or sitting at the chairs at the front waiting for their takeout order. It's a tiny restaurant, so I don't fault them for that. If you're looking for an intimate dining experience, this may not be the place for you.  The boys split a pepperoni pizza, and you really can't go wrong with their pizza. A great meal at this place would be a house salad, pizza and a beer. No doubt.  I tried their signature Buon Gusto chicken entree. The way it sounded on the menu and the way it came out on the plate were different. The menu called it a \"medley\" of fresh vegetables sauteed with chicken. The menu said it was a heathly menu choice, so I figured I'd watch my waistline and order it. The dish came out looking like a dish I make with all the leftover chicken and veggies I have in my fridge. There was a large amount of onions, which I picked past. There was no starch with the dish, which was odd, considering the fact that it's an Italian restaurant. Then I read the online menu after the fact and read that with chicken dishes, you can add a starch for a price. That's fine, but I wish the waiter had said something when I ordered.  The service was fine, nothing to write home about. Perhaps they just need to talk to their waitstaff so that they are more knowledgeable about the menu and can turn their tables over faster with quicker service.  All in all, if you stick to the basics, you're fine. Their pizza is tasty. Thier salad is yummy. They bring you a basket of hot breat and butter. And if you want to wash it down with a beer or wine, well, they have that too.   It's a cool little place, and I'm all for supporting the small businesses in this economy. Go to Buon Gusto. Enjoy the food and the vibe. But you may just want to stick to their Italian basics."}
{"text":"Great food! Great service! awesome portions! dream about their food after only being there once. Can not wait to return! Love the New York feel but the food comes out like it was made only for you!!!!"}
{"text":"We've been waiting to try this place for a while so we found an excuse to drive out to Henderson, after going to the movie theatre we decided to check this restaurant out. It's a very casual setting, kinda like a pizzeria back east, with the red and white checkered table cloths and all. As soon as we walked in we were told to sit anywhere and the server took our drink orders right away.   I ordered the chicken francese with a side of penne with marinara sauce. My meal came with a small salad to start which was really good. The chicken was rather delicious just the right amount of lemon flavor in it, not to much. I thought the size was small, looked like a chicken breast pounded out and cut into 4 pieces. I scarfed it down rather fast then worked on the side of penne which tasted perfect, if you ask for bread they will bring it to you to scoop up any leftover sauce.   My only complaint is that IMO it's not worth what they charge, it's not fine dining. $15.95 for my meal and they charge an extra $2.95 for the side of pasta, pasta is customarily included with the meal at Italian restaurants. Don't like the nickel and diming. If the lunch portion was this much I wonder how much the dinner portion is. Not stingy so just saying.   Other than the quantity and price the food was still good and the service was equally good to. Servers were very friendly and kept checking out table for refills. I will definitely give this place another chance, maybe the portions are better at dinner. I wasn't full when I left."}
{"text":"This place is a little piece of old New York in the desert. It's not very large inside but wonderfully charming and quaint. The staff is friendly and the food is Noo Yawk Italian to the max!!! Hubby and I live a good 20 miles away but well worth the drive. Love the salad with house dressing, great pizza with crispy crust, delicious eggplant parm, and  everything else we've tried has been great. What a hidden treasure this place is. This is the real thing, not like the formula food in the chain restaurants. Leave Vegas outside and enter New York. Buon Gusto!"}
{"text":"They have new owners, so be patient.  Understand it was a busy night, and the new owners are still trying to get adjusted with the staff so service is slower than usual.  I also got nervous when I heard the owners son is the new chef.. (please don't change all of the recipes)  We were seated about 15 minutes after arrival. Now we waited another 10 minutes before our drink order was taken. Another 15 minutes and our order was taken, and then 20 minutes later our food was served. Yep.. 45 minutes from the time we were seated.   Food was delicious. Gnocchi with Tomato Cream sauce has not changed.. Yay!!! The rest of my party enjoyed their food too.   On a side note, where we were sitting to where I could see the prep area where salad greens were being cut. The knife that was used was rinsed off with the water from the soda fountain. Not sure what was cut with the knife before, but not too sanitary.   Hopefully on our next visit things will be back up to speed and prep procedures will be reviewed."}
{"text":"Buon gusto is what every other Italian restaurant in the valley wishes they could be. Everything about this joint screams old school New York style Italian. Buon Gusto meets every requirement for a five star review. The staff is friendly, the atmosphere is homey and unpretentious, and the food is the best Italian I've found in Vegas.  Whether your in the mood for pizza or pasta Buon Gusto is your one stop shop for all things Italian."}
{"text":"Coming from the best Italian in Las Vegas I'm gonna tell you where to get the best Italian food.  Coming from jersey it's real tough to find real Italian food. Well hidden away from the neon and chrome of the strip and far far away from dumps like olive  Garden is this gem. I'm addicted to their eggplant parm and their chicken cacciatore is the best I've had since leaving Jersey. Go to this place first chance you get! Go, Now, and treat yo self"}
{"text":"Health Grade B.  Do not go here!  This weekend it was close to 80 degrees in there, most of the time you could here people in the kitchen using foul language and their current Health Grade is a B.   Stay away.  Their food sent me to the toilet multiple times.  This use to be my favorite place for pizza in town."}
{"text":"All I can say is this. I live in this area and ate there a few times under the old ownership for which the owner was a complete douchebag. After watching this family on the Food Network I thought, \"Didn't you do your homework?\" Based on the former owner's reputation, I would have changed the name or stressed the fact that they are under new ownership. The food was God aweful. After all, you are talking about a city that rated the Olive Garden as \"Vegas Best Italian Restaurant\" for at least 10 years. I would rather go to Montesano's. I love to patronize a family business. Maybe i will give them a shot."}
{"text":"Me and my family have been to buon gusto numerous times love the food and the staff is great chicken parmesan my favorite pizza is delicious all always satisfied"}
{"text":"A colleague and I dinned at Buon Gusto last week after looking online for a good restaurant in the area.  We were attending yet another conference and were in dire need to escape the insincerity of corporate America.  We were promptly greeted by the owner who sat us at a charming table. The service was prompt and the menu was priced reasonably.  The owner took the time to make menu recommendations and answered all questions.  Needless to say, my spinach and Gorgonzola ravioli was exceptional.    What you should really know   At the end of the evening, we were having difficulty getting a cab back to the hotel.  The owner was very attentive and after hearing that we would have to wait 30-50 minutes he promptly took off his apron and directed us to his SUV. In less than 5 minutes we were back at the hotel compliments of Buon Gusto.  After a long week of exhausting meetings and corporate niceties, this was genuine service.  In short, Buon Gusto doesn't do anything different - they just do it better."}
{"text":"I love all the homemade flavors, super fresh and flavorful. A party in my mouth.   Highlights:  -Homemade balsamic vinegar dressing. So stinking good! I never enjoyed a house salad so much!  -Chicken Marsala: Large portion! Definitely good for sharing. Super yummy and everything a chicken marsala should be. Plenty of mushrooms too.  -Tiramisu: I ate the whole piece. By myself. Enough said. (super light and airy with a hint of alcohol. A perfect way to end the meal)  Lower-lights: -Calamari: They were good and not too oily except that I feel they kind of lacked flavor. They needed a lot of salt and could have used some seasoning. Even with the marinara sauce it was a little bland.  -Veal Parmigana: A little pricey ($25) but it was a large portion. It was so completely drenched with sauce and cheese that you couldn't really taste anything except tomato sauce. And the breading on the veal just slid right off. Too soggy of a dish for me.   Overall: super friendly staff and wonderful homemade tasting meal. I definitely want to come back and try some other delicious plates on their menu."}
{"text":"I love pizza here, you can design your own pizza, that's so great!. However, i decided to give 4 stars 'coz of 2 following reasons: - Your menu makes me confused  - Too noisy when enjoying your meal"}
{"text":"The lasagna is a must!  This is one of those small private owned must try places."}
{"text":"Just had and amazing experience at Buon Gusto Ristorante the food was fantastic and our server, Shannon, was very friendly and helpful. I will definitely be returning due to such great service and feeling so welcomed while I was visiting Henderson."}
{"text":"I don't know if any of you remember your first experience with eating pizza.... when that first bit of goodness oozing with mozzarella and sauce hit my tongue, I was in heaven.... so much so that I couldn't stop eating it and, 4 slices later, my little tummy (I was around 5, I think) had too much and needed to relieve itself. Yes, stories of me yakking the first time I had pizza were legendary and told at many a family reunion. SIGH. I had a similar experience (minus the yakking, thankfully!) when I had Buon Gusto's version recently. I could not stop eating the Across the Border (we subbed the chicken for shrimp) pie we ordered to takeout. DELISH!! The crust was perfect - slightly crispy on the outside but soft when you broke into it; fresh toppings (especially those shrimp, which I think were cooked in garlic before they were added to the pie -- YUM); and the sauce-to-everything else ratio was perfect: not too much to overwhelm, but not too little to get lost in the sea of toppings. On the night we stopped by this cozy resto, it was filled to the brim, with a few folks waiting outside for a table. There's a reason to wait, folks: these pies are all that..."}
{"text":"Very cute little place with great service & delicious food! What a surprising place! We will be back!"}
{"text":"I came for dinner and ordered the meat ravioli dinner which comes with a salad and bread. After an extremely long time I received my salad. When I asked for bread I was told they could just give me a small slice.  They said they dole it out. I had to wait a long time for the meat ravioli. Will not be coming back."}
{"text":"Most residents of Vegas wonder why anyone would ever eat out for Italian food.  Can you blame them?  The general impression is that  Vegas only has ridiculously expensive Italian restaurants on the strip and corporate Italian for the locals.  And the sauce at an Olive Garden or Macaroni Grill is only 1/2 a step up from the flavors found in a jar of pasta sauce at the grocery store.    But look deeper my friend.  Just like the U.S. is a melting pot of international cultures, Vegas is a melting pot of relocated American cultures.  And one of those great culinary cultures is Italian-American.    Buon Gusto is the classic east coast Italian restaurant.  It's cozy.  It's simple.  The menu items are delicious.  At it's best, Italian food consists of simple flavors.  But a great Italian cook knows that when those flavors come from fresh, quality produce and ingredients, there are few cuisines on the planet that can match Italian food.  Buon Gusto's pizza will cause you to over eat.  The crust is tasty and crispy, but not paper thin.  The sauce is just sweet enough without losing the tomato flavors and the options of fresh toppings are vast.  Our first time there, we had the veggie pizza and left with extra inches on our waists because we just couldn't stop eating it.  The next time we went, we had the Napa Valley White Pizza (white pizza with artichokes, tomatoes, onions. etc) and the Eggplant Pesto Pizza (white pizza with eggplant, roasted red peppers and tomatoes).  Even the pizzas without sauce are killer.   But that's just the pizza.  The pasta is equally outstanding.  The sauces make the dish and Buon Gusto makes their sauces fresh daily.  We had the Vodka cream sauce and the marinara and both were rich and so tasty that we kept sopping our bread in the sauce after the pasta was gone.    I'll admit that I was one of those people that spent most of my life wondering why people would order out for Italian.  Buon Gusto is the answer.  A marinara sauce may be simple, but when it's made fresh that day, by people who care about its quality, it's amazing.  Just writing this review makes me want to drive across town and have dinner there."}
{"text":"My favorite little homey Italian joint. Only a few tables, but every things good. I like most of the veal, and the sausage mushroom rigatoni is their star. Pizza isn't perfect, and soups lack some authenticity, but service is warm and welcoming.   We go at least once a month, it's just too cozy not too. Sometimes you can find coupons in the little direct mail coupon books."}
{"text":"Fabulous food, great service!  Lobster ravioli was served in an incredible sauce.  Bread was hot , crusty and had great oil served with it.  Veal pram and chicken picatta tops any Italian restaurant we've eaten at lately.  We will definitely be back!!!"}
{"text":"Good Italian food, large portions, reasonable price. Small, family owned. Never disappointed. The bread with garlic olive oil n balsamic vinegar excellent! Save room for dinner though. : ))"}
{"text":"Had the sausage and mushroom rigatoni. Have been going there for a long time - but this was my first visit in about a year. Kind of not the same taste- the sauce was a little too much tomato taste. The sauce was the reason I would go here for this dish. Maybe a bad day? I'll return again but I hope they are not skimping on the quality. The ownership did change a while back. See you soon for another shot."}
{"text":"A hidden gem in Henderson! A blink and you miss it sort of place, tucked between a Port of Subs and a shoe repair store. This place is truly a Mom-and-Pop sort of place, homemade meals and friendly service. So far, I've tried the Gnocchi all Vodka and the Chicken Trieste. I prefer the chicken. The gnocchi itself was tender and clearly home made, but the sauce tasted more like a cheese sauce than a tomato Vodka.  The Chicken Trieste consists of thin sautéed chicken breasts in a red wine sauce with mushrooms and artichokes. Your order comes with a side of penne pasta, perfect for the extra sauce with the chicken. The complimentary bread is delicious, pairing well with all of the various dishes. I haven't yet tried the desserts but I plan to!"}
{"text":"It was really good until they changed the owner in March 2013.  Foods were ok but not as good as before.  A little disappointed."}
{"text":"Buon Gusto. I'm very much in like with you.   Knowing this place gets packed on Saturday nights and the fact that they only boast eight or so tables, the GF and I decided to call-in our order, thinking this would be faster, that was not the case.   We went with Italian style sub sandwiches, one chicken parm and one meatball with a side order of sausage and marinara, the very classic and basic of Italian deli style eats. Once ordered we were told it would be about 15 minutes, upon arrival we found out our food was still not ready, but we were reassured that everything would be done shortly. Another ten minutes later, still no sandwiches in my hand.   After waiting another five minutes and noticing the place wasn't that busy, we asked how much longer, \"they should be done very soon... what was your order again?\". Excuse me, how do you know if the food will be done soon if you don't even remember what my order was? Hearing this response and realizing that the fella behind the counter didn't seem to care about the tardiness of our food, my GF got a little heated and exclaimed that we had been waiting over thirty minutes for two sandwiches. The fellas response, \"thirty minutes, are you sure?\". I was stunned at that response and thought my GF was going to jump over the counter. After this delightful interaction our food finally arrived and we headed home.   After unwrapping everything we noticed it was piping hot, this was good sign. The cheese was still melting and everything looked and smelled fresh. The bread was super soft and the sauce was flavorful and had some heat to it. The meatball sub was a very heavy meal, but the meatballs were great and a little misshapen, which hopefully proves the fact that they make them in house. I only had a bite of the chicken parm, but the chicken was tender and the breading was crisp.   After a rocky start at Buon Gusto, the food more than made up for the wait time. This isn't me saying I like waiting thirty minutes for food, but if you're going wait that stuff better be on point!"}
{"text":"Talk about a hole-in-the-wall, I have been to this mall a hundred times and never noticed this place until I checked on Yelp for Italian in the area. This is like walking into a small Mott Street eatery. The family loved it, the service was warm and personal, we were treated like family. We had the Veal, Alfredo and Lasagna. All three entrees were excellent with exceptional taste and texture, very authentic NYC fare. My son had enough Alfredo for lunch the next day as the servings are generous. The Gelato after dinner was superb one serving was enough for 3 to share. It might be hard to find, and easily overlooked but it is worth the effort to find this hidden gem."}
{"text":"Finally had the time to try this place since it's been in my bookmarks for quite a while. It has a really casual feel to it and was really clean. Their menu had a lot of different options of pastas, entrees, pizzas, salads and sandwiches including 8 lunch specials for $8, Tuesday- Friday, 11-4pm. I wanted to try them but I  was craving pasta and for some reason I'm really weird and feel like if I have pasta without any meat/chicken (what all their pasta lunch specials were ), I feel like my meal is incomplete. I know I know, I'm weird lol. Sooo I ended up trying the sausage and mushroom rigatoni and my boyfriend tried the chicken trieste. It took a little long, about 20 minutes for them to come out when there was only us and another small table dining. Oh and all entrees come with a salad and fresh baked  bread but just like Jill D. said in her review they didn't bring us any bread so we asked for it since my boyfriend's entree didn't come with any pasta and he needed something to soak up all the delicious sauce! Definitely ask for it if they don't bring you any, it's a little bread loaf of perfection; warm, chewy and comes with garlic evoo! Yum Yum!!  The main thing I was surprised about and not expecting were their rich and creamy sauces and the fact that they definitely were not skimpy with it or their ingredients. And thank goodness their sauces actually stuck onto the pasta and didn't slide right off.  Usually when I order a type of sausage pasta in other places,  I'll get like 5 pieces of sausage perfectly placed on top and we call it a day but this pasta here was LOADED!!!! I feel like there was 3 links of chopped sausage in there and same with the mushrooms! The pasta also was cooked well, not too mushy or too hard. Sometimes I feel like Goldilocks describing porridges lol but really, it was \"just right\"! :) My boyfriend's dish was also a little plate of perfection! The flavor of the sauce was just soo delicious! Yes I know, I'm sprung on their sauces lol. It had a really nice wine flavor and was loaded with artichoke hearts and mushrooms on top of two chicken breasts.  Why is there missing one star you ask? Well, it's because of the service. Everyone was really nice and professional yet I had to request our waiter to fill my water after waiting a few minutes and after he visited our table and didn't notice. I also had to request for the bread. I hate requesting for things, I mean if it says it comes with it, then just bring it out! I also had to request extra silverware when he took it away with our salads but didn't bring any new ones to us with our entrees. However, we didn't have to request our check lol. Don't get me wrong, these people weren't just standing around being lazy, they were all doing tasks and were hard working  but you can't forget about your customers! Overall, better than I expected and will definitely be back especially for the price! :)"}
{"text":"I would be giving this zero stars if I could. We ordered food to pickup tonight and when we got there 30 minutes after the call was placed (like they told us) they told us they forgot to put the order in and to just wait 10 more minutes. 25 minutes passed and STILL our food was not ready. When we finally got the order there was several things wrong with the order, example: sauce was watery and tasteless and they forgot the chicken on our dishes,  hair in our food, etc. And when we told them that they forgot the chicken they respond saying, \"oh sorry do you still want it?\" Um yes we paid for it?? UNBELIEVABLE."}
{"text":"This restaurant used to be so good. I don't come here extremely often because they are pretty pricey and I think they have increased their prices.   However, the last two times we have eaten there and taken out, the pasta has been dry and everything just needs more flavor. They always put tons of cheese; however, I feel like it's just to hide the sad sauce.   I wish you will get better we might try you again."}
{"text":"Very small restaurant, think reservation.   Not as good as the original owner but they are trying with many of his recipes."}
{"text":"My friends offered to take me out for dinner for my birthday.  Based on the reviews for Buon Gusto, I chose this restaurant.  My husband was surprised, considering I could choose anything, even a casino steakhouse. But I love the idea of finding a \"hidden jem\", so I thought, okay if I'm wrong, it's my choice, it's my birthday.   Buon Gusto was everything the reviews have said and more.  The pizza actually made me tear up because it was so much like the pizza I had in New York when I was little and my mom took me there to visit my grandparents in Brooklyn and I haven't had anything like that since.  The salad was so fresh, the dressing perfect. Bread with a light crunchy crust, cloud soft inside.  We don't eat a lot of food at a time anymore, so the four of us split an antipasto, a medium cheese pizza and ala carte portions of rigatoni with sausage and Fettuchini Alfredo (okay, so I'm not a perfect speller).  All excellent, excellent, excellent. In Hawaii, we have a saying \"Sit long and talk much\".  That is just what we did -- it was less busy than we feared, maybe because it was a Thursday, but we got there at 6:30 and were seated almost immediately.  The atmosphere is so comfortable and welcoming, it really is like you are visiting an Italian family in their home.  They make everything right in front of you, well-timed service and as heartfelt as it comes. All the staff connected with us at one time or another, in a genuine way. Smiles. Drink refills without asking.  I mean, how much better does hospitality get? You don't have to dress up, you don't have to spend mucho bucks -- I really didn't think places like this existed anymore. Go for excellent food, comfortable atmosphere, great people. The only reason why I gave it five stars is because you can't give them more! Such a nice birthday surprise! (and I got to be right, can't beat that!)"}
{"text":"Ordered take out Pizza, 3 dinners. When I went to pick it up they were understaffed. The guy who was covering the dining room did not have a clue. The cook was very young and was being instructed by a nice woman (the owner) who was getting my order together. She was very nice just a bit overwhelmed. I was just happy I didn't dine in. The dinner portions were very small for the price. The food tasted good. Loved the sauce lots of garlic. It tasted great on the New York cheese pizza. I don't mind paying more as long as there are left overs for the morning. This was not the case here. They need to make larger portions or lower their prices. Also hire more people."}
{"text":"We discovered this gem about a year ago and have been coming back ever since. The staff is amazing, they recognize us when we walk in the door! Their bread is crisp on the outside and warm on the inside, and normally my family will finish at least two loaves.  My parents favorite meal is the veal parmesan, but I love their penne pasta in vodka sauce. My husband loves their baked ziti with sausage. My kids really like their pizza, however they never finish their meal because they eat so much of the bread they serve. We are from New Jersey so it's nice to have a good Italian meal that tastes like back home at really great prices.  One last thank you to the owner and Kimmy you always make us feel so welcomed!!"}
{"text":"Had dinner tonight at the new Anthem location. Food as always was hot, fresh, and delicious! Our server Drilon was attentive and friendly. Great experience! We'll definitely be back!"}
{"text":"Don't.  I was going to leave it at that but I've written enough reviews to know it would never make the front page.  We (my wife and I) have eaten here previously, but it's been over a year and felt it was overdue. Bad choice.  We were seated at 7:30 pm on a Tuesday night.  We gave our orders, she had the chicken Marsala and I had the Vodka Penne with chicken. The salads were good, one small serving of bread was brought to the table and never replenished.   Sad, really because the sauce in both dishes were really good.  I mention that we were seated at 7:30 because it was after 8:30 when our meals finally arrived. While the sauces were good, the chicken was rubbery and had an odd taste.  There was a man who came out and chatted and said he was a chef but they were not letting him work.  He said he was training them. Did he never watch Hells Kitchen?  If someone is in training, you taste the meals before sending them out and that clearly did not happen. Oh, did I mention he was drinking a beer as well?   So, back to my original statement. Don't."}
{"text":"I loved it! We went on Monday night so we were able to enjoy the 50% off bottle of wine. I got the chicken piccata and my son had the fettuccine alfredo...both were amazing! Also the portions are huge. They both came with salad before the meal and a basket of bread. I loved the bread!! Our server was very friendly and accommodating. I really liked that the restaurant is a little hole In the wall. It was later so it wasn't really busy I actually liked that we practically had the restaurant to ourselves. Will be back soon!!!"}
{"text":"Just had this last night for take out. My husband had the rigatoni with sausage and mushrooms. It had a nice red cream sauce And was very good. I had the baked ziti with meatballs and it was just ok. Too many onions and the sauce and meatballs lacked flavor. They also need to use butter on the bread served. Very plain and not even toasted or warmed. I would be willing to try this place again next time I'm in town."}
{"text":"So wanted to like this place. Decent service even though the air conditioning was out in one room and not working great in the other room. Kids spaghetti was perfect for my son. My hubby enjoyed his spaghetti with meat sauce and my ravioli was ok. We ordered chocolate cake for dessert and it had mold on it. Immediately began second guessing all the other food. Waiter was kind and reassured us everything else was fresh but that's just an image that stays with you."}
{"text":"Tried them for the 1st time tonight, got a large vegetarian pizza, and it awesome. I'm not vegetarian kinda guy, but it really tasted great. Great toppings and sauce, dough was cooked perfectly. I will definitely return."}
{"text":"The pizza was delivered on time and warm. The pizza was good but not the best. The sauce had a weird flavor to it. The ingredients were good though. One of the pizza items said meatball and it didn't taste like your typical meatball but all in all the pizza was ok."}
{"text":"Great lunch specials.  Great service and I love there meat ball sandwiches.  Definitely a great local family owned restaurant. An asset to are neighborhood."}
{"text":"Loved the food at the previous location.  Had dinner at the new location and we were very underwhelmed.  Lasagna had no taste and pasta dish had so much garlic that it wasn't edible.  Won't go back."}
{"text":"If I could give it 0 stars I would. We have gone here for years and enjoyed the food and service from the family owned restaurant. Well....just went today and either it has changed hands or is under new management. None of the previous family owners or staff were there. It was sooooo dark in the place that we had to use the flashlight on the cell phone to read the menu. We should have left at that point. My partner ordered a lunch special which was a slice of pizza and a side salad. I ordered a hot sandwich which also came with a side salad. I asked what dressings they had and when the waiter mentioned caesar dressing I said I would have that. He then told me that caesar dressing was $1 extra. Told him not to bother. We then ordered our drinks. He never bothered to bring staws and we had to ask for them. About 5 min later my partner was served her pizza and salad. Her salad had ranch dressing on it but you had to really look to find any. Guess ranch is expensive as well?? I got my salad. After about another 5 min I asked if there was a problem with my sandwich and was told rather rudely that it took time and would be ready soon. Another 10 min and my partner had already finished her food and I told they guy to forget the sandwich and bring the bill. He rudely told me it had only been 5 min and it would be ready soon. Anyway he finally bright the bill and had charged us for all the food and drink even though I had cancelled the sandwich before it was served. We gave him a $20 bill and asked for change. The revised bill and change did not show up so went to the counter and told him to give me the change and to revise the bill. Eventually another person came over and revised the bill and we got our change and left. I have not had this rude of service anywhere in years and not once did anyone in the restaurant apologize or even say they were sorry. The pizza was just ok, dont know about the rest of the food.....never got any. The staff even had the nerve to suggest that rather than change the bill they would fix the sandwich to go. It would only take a couple of minutes. !!!! Right !!!!! Anyway dont know when it changed hands but this place is horrible now. Will not go back...you could not pay me enough money to return.  There are many more places to eat in the area and suggest you try any of them....they cant be as bad as this place. No wonder they had so few customers."}
{"text":"Kim is doing a great job running and working  She always ask and makes everyone feel at home . I hope you will give it a try and enjoy it like I do ."}
{"text":"The service was terrible. The meat on the antipasto plate was grey looking like it was old meat. The waiter forgot to order my food and his ravioli were just ok. Was not impressed"}
{"text":"excellent food! such a great restaurant! food tastes really authentic. drylon was our waiter he was very nice and polite! will be coming back!!"}
{"text":"Great neighborhood Italian restaurant, especially in a neighborhood overrun by Italian restaurants. Love their white pizza. Small place, but very clean with super friendly staff."}
{"text":"This is a small italian joint nestled in near Anthem. The food is good and prices are reasonable. The staff is so italian I would be suprised if everyone here is a made man. The stories they have are great and add to the atmospher. I recommend at least trying this place out."}
{"text":"This time the food was not as good as the first time. The meatballs were heavy & dry. The pasta sauce was just too too sweet! We were really sad to see the quality of their dishes going down"}
{"text":"So the Friday night debate today was where to order from... I wanted Capriottis, he wants lasagna. He paid so I go with it and I'm sure I'll find something , not being s huge Italian food fan.   I stuck to appetizers, I wasn't disappointed! I got the artichoke Italiano and the stuffed mushrooms. How refreshing is it to go to a smaller Italian place and they use real crab meat instead of dumping breadcrumbs in with some onions and charging 12 dollars for it? The Mushrooms were awesome and they give you some lemon to hit with , elevating the flavor To a higher level. They were good  The real star of the show were the damn artichokes... life changing. These were so delicious. I swear I'm going to tell everyone about them.   My only gripe would be no utensils to sneak a bite on the way home and they don't do complimentary bread.   I'm defined going back, if for nothing but the damn artichoke"}
{"text":"I came here on a Sunday afternoon when the dining room was closed but they were cooking orders for pickup. I had a really nice chat with Joel while I waited for my pizza and gnocchi. Nice people run this place and the food is delicious. I've been here several times between 2012 and 2014 and have had consistently good food and good service. It feels good to support local business and be enthusiastic about it. This place has always been great and continues to be."}
{"text":"This a great little restaurant.  We ordered a pizza and the Linguine Del Mar.    Pizza was really good it had a nice thin and crispy crust.  Linguine Del Mar had very fresh seafood and the sauce was incredible.  I can't wait to go back and try some other things on the menu."}
{"text":"Just came to the new location.. tons of more room and customers. But customer service is down from my previous experiences with this resturant at the old location.   Got the mailer coupon for the free spaghetti with the XL pizza. Alert these coupons are for take out only!!!!! Thank God I showed to him as we ordered our drinks. I was hoping they would allow me to eat here but the server simply told me no it's only on take out.  Sigh.... Ok well I sit for a few minutes but it felt odd so we went to the store across the way to grab some beers. When we come back the pizza is ready but they forgot to put in the spghettie so pizza getting cold now and still waiting on the pasta.  I certainly won't be back. Too bad."}
{"text":"Just superb.  A hole in the wall gem that is for real Italian. Don't let its location in a shopping center put you off...once in the door, you are in southern Italy.  We frequently drive I-15 from LA. While scanning dinner options we stumbled across Buon Gusto.  Sounded easy enough to find, so we ventured off the highway and are so glad we did.  What a find!  Great, friendly staff and excellent down home southern Italian. Portions are large enough to take half for lunch tomorrow.  We highly recommend it!"}
{"text":"I tried the meat raviloi's  and cheesy garlic bread. The cheesy garlic bread was crunchy and had a nice taste, but i feel it should have been complimentary. The ravioli sauce had a nice strong taste and the ravioli were cooked to a good texture. I will come back."}
{"text":"Just had a wonderful dinner at Buon Gusto tonight. The service was excellent and the chicken Parmesan was one of the best we've eaten. It is a nice small quaint restaurant in Henderson Nevada. We recommend it highly."}
{"text":"I ordered takeout which consisted of a meatball parmiagian hero and rigatoni with sausage and mushrooms dinner (which included a salad). The rigatoni dinner was excellent. Delicious sauce with perfectly cooked pasta. The mushrooms were fresh and delicious  and I loved the thinly sliced sausage. The meatball hero was good too though I prefer a meatball with more bread crumbs; the sauce, bread and cheese was very good. The staff was very nice and  the wait time to get my order was fast. I will definitely be back to try more!"}
{"text":"Go! We didn't even know this place existed. When we walked in we were immediately greeted by AJ.  We were seated within ha couple of minutes. He made recommendations that were very tasty. The best part of this restaurant was the service. Although there was absolutely nothing wrong with the food, AJ was very attentive and polite. He is a great asset to this establishment. I would say to ask for him when you come in , but someone famous is going to steal him away. He is too good to last too long. Love the atmosphere. Also loved being treated like a lady in the restaurant that cost lest than $100 a plate. Ladies know what this means."}
{"text":"Went the other night with the fam and had the gnocci with pesto cream sauce...OMG!!! It tasted like little pillows of heaven. Is it sad to admit I'm still thinking about it 3 days after I ate it. Can't wait to go back and have it again."}
{"text":"I am originally from New Jersey, I do not know too many things in life, but I know really good Italian food and good Italian restaurants. Buon Gusto moved right up to the top of my list for Italian food in the valley and best of Henderson. The food is top notch, I have had the Shrimp Parmigiana, the Chicken Marsala and the Chicken Parmigiana, all were excellent. The chicken melts in your mouth. The salads are great with homemade garlic ranch and raspberry vinaigrette dressings and excellent quality lettuce. Even the oil and vinegar for the bread was about as good as I have ever tasted. The service was phenomenal (thank you Chris!) and the rest of the staff is excellent. My only regret is that I waited five years after moving from the Northeast to find this place, but I will be back again and again! Buon Gusto means good taste in English, but this place has great taste!"}
{"text":"I don't mind eating with other people, but I felt like I was in the closet. My table was literally in the runway for the kitchen and a freeway of customers and severs were constantly hovering over me and wanting in line to get by on the single lane isle. Service was a little slow as was waiting for the food. We brought the kids, 3 and 4. They were very understanding and kind to my little monsters, which I really appreciated. They were \"real\" people.   But that being said. My primary reason for being there was the food. I like cheese. I love cheese. But if I can't see my main course because an impassable mountain of cheese is blocking me, then that would be too much cheese. After I mined for my noodles, my meal was actually pretty good.  So interesting place put needs some refining for me to return."}
{"text":"Their service is fantastic and the food beyond words. I tried the Linguini Del Mar, the fried calamari and I was delighted. Their bread pudding is the best pudding I've tried. The restaurant is usually packed, just make sure when you go you have enough time, but I think it is worth it."}
{"text":"Great Italian. Very friendly service. Owner seems to genuinely care about his staff and customers.  Waitress was very attentive, made sure to refill our drinks often.  She also forgot to ring in something that we ordered, but immediately told us once she realized. I appreciate when service staff is honest, and it turned out we were stuffed, so we decided to just get it to go.   It's a small place, but they seem to be always busy. (may have to wait for a table, but totally worth it)   Now about the food: Meatballs are very flavorful (I recommend adding them to the top of the manicotti dish, which is now my favorite.  The soup of the day was chicken pot pie, and it was seriously one of the best things I've ever put in my mouth. Sooo yummy.  Other entrees I'd recommend are lasagna, baked Ziti and the gnocchi. I haven't tried the pizza, but I'll definitely be back."}
{"text":"Was a much better experience than last time. Had special lunch for only $8. Spaghetti and meatballs, salad, drink and bread with dipping sauce. How great is that!  Also our server Kimberly was a delight. A must try lunch special."}
{"text":"I've been going to this place for 10 years but a few years ago I believe they changed owners and since then this place has been very poorly managed. On this particular night I ordered 2 large pies and was told they would be ready in 25 mins for pickup. Well it's 45 mins now since the order and I'm still sitting here along with 3 others waiting. The guy next me ordered his food 50 mins ago.  As I was waiting, I watched as the management was stressing that they were about to run out of mozzarella cheese.  I'm not sure what was more of a shock, 1) that they no longer use fresh mozzarella on their foods and pizza and buy their mozzarella at Sam's club in bags, or 2) that they had almost run out of cheese on a Saturday night! What kind of Italian restaurant runs out of  mozzarella cheese on a Saturday night? Who is responsible for ordering supplies? Unreal. Anyway, 55 minutes and $50 for (2) large cheese pies, and to top it all when I got home they never cut both of the pizzas! The mozzarella cheese was awful on the pizzas. It had a really funny taste and we ended up throwing out 1/2 of each pie. It's extremely unfortunate because this was one on of my favorite Italian places in all of Las Vegas. This is the 3rd time I've had problems with food from Buon Gusto and for me 3 strikes you're out. I will not be returning or recommending it to any of my friends. Also note, I understand places get busy on Saturday nights and I was actually surprised when they said it would be ready in 25 mins. However, don't waste my 30 mins of my time because you can't estimate when an order will be ready."}
{"text":"You don't need to be located in a luxury resort on the strip, charge exorbitant prices, or be funded by a wealthy venture capitalist to offer 5 star quality food. All you need is a dedicated mom-and pop style of management, a good understanding of traditional cooking and service with a smile. These things can be found at Buon Gusto.  I had the pleasure of dining here on valentines day with my girlfriend. It was, not surprisingly, quite packed. We were seated fairly soon by a friendly hostess. The place is tiny and quaint--- a decidedly humble little establishment with traditional Italian themed decorations lining the walls. It's nothing too fancy but a real fan could care less about the lack of extravagance--- its clean and well maintained.   The bread was delicious-- better than I've had at Annie's Gourmet, and about as good as I had at Ventano's. The salads were excellent-- the best I've ever had at an Italian restaurant. They didn't skimp on the olives and the home made balsamic vinaigrette will be the best you've ever tasted. They offered us each a glass of wine with the special, which was penne pasta with a creamy sherry wine sauce and sliced chicken, topped with bruschetta. It was a unique taste to me-- I've never tasted such a wonderful mix of flavors in Italian cooking. We treated ourselves to canoli's for desert which were, of course, heavenly-- far and above the best I've ever had.   The waiter was friendly throughout the experience and the rest of the staff was polite. The employees here seem to take pride in the quality of their service and the regulars clearly know they've stumbled on to a real gem located in nondescript suburbia. There is no doubt that we will be returning to sample the many other delicious sounding dishes here."}
{"text":"Great homemade Italian Food. Buon Gusto is a family favorite. If you nearby, try Buon Gusto!"}
{"text":"Went on a Mon eve with 3 others based on a friend's recommendation. The food was average @ best. Calamari and pizza were average. Crab cakes were horrid; deep fried to resemble oily hockey pucks and for 18$, expected a bit better than freezer to fryer. Wine helped.  Chef/new owner stopped by table to ask how food was and gave honest opinion that crab cakes usually not deep fried, particularly Italian style. Chef said that he could not change the recipe as he has so many regulars. I would question the palettes of that demographic. He asked where i was from originally and when advised from east coast he responded that east coasters are too picky about seafood. Eh?   He is young and in need of serious guidance on customer relations, Italian cuisine, freshness, and interior design. Maybe a visit back east is what he may need?  Am giving it two stars as our server was quite friendly and helpful."}
{"text":"This is a little Italian restaurant nestled into a strip mall on Horizon Ridge/Eastern.  I liked the cute, casual, Italian chef-style decor and the service which was very friendly and attentive.  The bread was delicious...I wasn't even hungry anymore when my food came!  The ravioli was good...but nothing spectacularly awesome to set it apart from any other Italian joint.  My husband said the same about the ziti.  I would return to try out their lunch specials, but I can't see returning to spend 40 plus dollars on dinner."}
{"text":"Food was absolutely amazing,  i keep coming bqck to try different menu items.   I have not been disaappointed.   Kimberly who has been our waitress for years is now the owner and has kept up the Buon Gusto tradition.   Love this place!"}
{"text":"I'm someone who if I'm going to spend money on Italian food, I want it to be at least a 4-5 star type place. I really wanted to like this place. The service was excellent. The bread at the beginning of the meal was fresh and delicious. However the pizza was below average. As in I would stay away from ever ordering it again. The lasagna was very good. It tasted a lot like my wife's lasagna which is good, but we both felt to pay to go out we want better than we can make. I will probably try them again down the road to give them a second shot. Just sticking to pasta this time. To put my ranking into perspective... a chain like olive garden would get a 1-2 star from me. So they were better then the pasta co's, littering our nation. If it's this place vs those types of places without a doubt come here. But there is better out there."}
{"text":"Family owned and the best!  My favorite is baked ziti with sausage or meatballs!  Both are delicious and comes with house salad and fresh baked bread with olive oil all for under $15.  Go on Mondays and get 50% off wines!  I am a true Italian and love this place.  It is about as authentic as you can get and has reasonable prices, great service, small and intimate.  Check it out!  You won't be disappointed!"}
{"text":"What a lovely little spot!  Its very tiny inside, maybe ten small tables total, but the food is fabulous, the servers friendly, and  the interior cozy & inviting.   I had the signature twice-baked eggplant. OH. MY. GOD. WOW was that good! Brought tears to my east-coast vegas-weary eyes. The sides were delicious, the pizza piled high with toppings, the bread fresh and hot... Its a winner folks!"}
{"text":"It is very unlikely and rare that I write a review under 4 stars on Italian eateries, because quite honestly, Italian food is very difficult to screw up. (In my eyes and taste buds at least).   Gave this place a second chance after my first experience was not great. This time I ordered the most basic; pepperoni pizza. Sadly, once again they could not compensate for my first bad experience. My pizza was hard, almost burnt and tasteless. Customer service was also just as bad as the first time, except last time it was a busy night, this time there were only 2 tables being served. Waitress was missing in action for the majority of the time. She seemed very inattentive of our table needs and to top this all off, our pizza was $23 (without tax.)   Not worth the price, will not be coming back."}
{"text":"We got take out so I'm not going to give them 1 star, but our food was ridiculously bad.  We ended up getting some common takeout items like a cheese pizza, garlic bread, and a caesar salad. The pizza tasted like Red Baron. Just cheap ingredients all around. I was expecting a lot better from the four star reviews! Oh well, we learned. Save your money, go somewhere else."}
{"text":"This place is Hendo/Green Valleys best kept secret! Oh my goodness. Its a special treat each time we eat here. Everything is so FRESH..including the bread they serve you while you are waiting for your meal. This is not regular dinner bread that most places serve. My boyfriend always gets the crab cakes..they come with some sort of amazing sauce on top..they are the best crab cakes I've ever had. The pasta is to die for..if only I could ever pass it up and try the pizza!   The staff is always super friendly and nice, not common here in town. I can't recommend this place enough, just hope it doesnt catch on too much..there is not a lot of seating! ha"}
{"text":"Closed on the day after St. Patty's day. Poor form. I guess business is just that good. Congrats."}
{"text":"One of our favorites. It is hard to just order a Pizza for take out.  You need to throw in some artichokes, a salad, some spaghetti and some extra meatballs.   Stop and get a nice bottle of wine and your in heaven. Dining in is a lot of fun - not at all fancy just fun with good food.  Highly recommend it."}
{"text":"Food was extremely high priced for a place with only 12 tables. Pizza wasn't anything special--kids size was same as mine, but kids pizza is $7 and mine was $16.00...not sure how that makes sense.  My boyfriend ordered the Buon Gusto chicken and it was terrible. We would rather have gone to Grimaldi's, Maggiano's, or Firefly to spend that much money."}
{"text":"Can't believe I've never reviewed this place!  I have gone for years.  Outstanding food!  Super lunch specials that INCLUDE salad and a drink!  Great value!  Pasta always cooked perfectly by a chef who must really know his stuff.  Great for dinner also with all the classic Italian dishes on the menu."}
{"text":"Wow this place used to be great but service is less than tolerable. Walked in to get a table and waited for 10 minutes before anyone would acknowledge we were waiting. We left. Fast forward two weeks tried again to make a call in to go order, the server didn't even know what was on the menu. Hung up this time and called another nearby eatery. Sad to say this place has gone to crap."}
{"text":"This is a terrible restaurant. The service was bad, the food was disappointing, and the decorations were corny. We walked into the restaurant at around 4:00 pm and were the only customers. I ordered a lemonade with no ice, however, I received a lemonade WITH ice. This isn't that big of a deal, but we were the only customers. I ordered the New York style eggplant while my boyfriend ordered lasagna. Soup came along with our orders. When we received the soup, it was obvious that they had used leftover pasta from another day. The pasta was in pieces and had different kinds of pasta. When we received the main dishes, and my boyfriend opened his napkin, a bug crawled out!!! Like WTF??? And when he called the waiter over to tell him about the bug, the waiter asked if he brought it with him into the restaurant. The plates didn't look clean either. If we found a bug in the napkins and the plates were dirty, I can't even imagine how unsanitary the kitchen must be. I lost my appetite after the bug incident and we decided to just leave. Never again."}
{"text":"The BEST Italian restaurant I have ever had the pleasure of eating at. The chicken piccata was to DIE for and the pizza is the best in town! Our food server, Randall, was a real hit. He was extremely courteous, very attentive and seriously the best waiter we've had at a restaurant. We appreciate giving local businesses our money when they are 5 stars, and this place is definitely over 5 starts!!"}
{"text":"The service here needs improvement.  I keep coming back only because the value for money, and the good food."}
{"text":"Sooo... On the great reviews of my fellow yelpers we went out and tried this place! Thanks people! We happen to be locals in the area and have never been here.  So glad we did!  Buon Gusto is like your typical Italian eatery in New York.  Looked much like a pizzeria, however, with a dining room that extended a bit back.  The wait was not bad and when we were seated - the servers were attentive.  I ordered the Gnocchi w Tomato Cream sauce and Geo had the Chicken Alfredo. Wow! Both dishes were fantastic!  We also had the Antipasto for an appetizer - too much food for me as a salad came with our meal.  Still, I have to say that it was so fresh that I did not mind eating salad twice.   With all the great choices on the menu from hot sandwiches to perfect pastas to fish entrees... we will definitely be back!  Next time we want to try their lunch specials.  The flavorful food compensates for the lack of pizzazz you would normally seek in a restaurant outing.  We are grateful to have found a great local spot!  I will highly recommend that you come and try it out even if you do not live in Henderson.  I am sure that Dominic, the owner, would love to have ya!   Buona Salute!  your constant companion,  ~deirdra"}
{"text":"Very nice place!!! relaxed, casual atmosphere and extra large portions are amazing....Will definitely go back again!"}
{"text":"Waited over 30 minutes for our food. Was it worth it? Nope. Food didn't have any taste I had to season myself.  I don't think I wanna come back again. Poor server was really nice. But What's up with the kitchen? What a shame."}
{"text":"I love the lasagna and calamari! I'd definitely try this place again.  Plus the staff was super nice!"}
{"text":"First, let me preface this review with some background.  I married a wonderful Italian woman who loves to tell stories of growing up in Denver and visiting the checkered tablecloth and candle restaurants of that city, especially the one owned by her uncle.  When we first entered and sat down, I saw her looking around and getting a little misty-eyed with nostalgia.    The menu did not disappoint either.  This is not a trendy joint with dishes prepared in the latest fashion.  This is the simple, home-cooked staples of an Italian family: gnocci, pasta with sauce (which the waiter refered to as \"gravy\", always a good sign), and a pizza take-out service that was hopping the entire time we were there. My wife ordered the gnocci, and after sampling the dish, shoved one in my mouth saying \"That's what a gnocci should taste like!\"  Don't expect fancy, but do expect great traditional Italian food served with a minimum of fluff and fancy.  My wife and I have made two trips back (30+ miles each way) since our first visit, and both visits have affirmed our first impressions.  Take the time to check this place out.  I don't think you will regret it!"}
{"text":"This restaurant is a family favorite. Whenever we descend upon Vegas, we always make a point to have dinner from Buon Gusto! My favorite (and always will be) is the Penne alla Vodka. But honestly, every item that we have ordered has been amazing!"}
{"text":"My family and I came here when we first moved to the area and we were looking for somewhere to eat, found this place on yelp and I'm glad we did. Everything that was ordered was delicious and the serious was quick and very friendly. My wife and I have gone back on several occasions and we love this little hole in the wall."}
{"text":"First time going. I went during lunch time and they were not busy! Well... I wonder why.   Food is good but the portion size is a joke. I got the lunch special and it was a good size for a kid. I left super hungry no reason to go to that place if you are hungry because you will leave hungry."}
{"text":"After reading decent reviews on Yelp, we decided to check this place out. BIG MISTAKE!!!!  This place was awful. After we sat down, it took a good twenty minutes before our order was taken and another ten minutes before we got our drinks. My father-in-law had to order three different entrees because the waitress kept coming back telling us they were sold out of everything he tried to order. I ordered the whole wheat pasta; I wouldn't have minded paying the extra $3 had I not seen the cook walk to the storage room and grab a grocery store box of whole wheat spaghetti. After about 40 minute of waiting, we asked our waitress if we could have our salads. Apparently she had forgotten that she didn't bring them to us. About an hour and half in, our food came, but not mine. It took another ten minutes before my store bought pasta was cooked. Overall, our food was extremely disappointing.   I don't know what show on Food Network they were on, but if you said Worst Cooks in America, I'd believe you.   Unless you need to waste two hours and a decent amount of money on crappy food, skip this place."}
{"text":"This review is overdue and is based on my experience at their old location. Really good locally owned Italian restaurant. Have only been here for lunch.   Chase was our server. He was so nice and told us it was his first day serving. He did such a good job serving and was eager to please.   Started off with complimentary bread served with butter and a really good garlic infused dipping oil. Had the lasagne and the lunch special of penne pasta with vodka sauce. Served with a really fresh salad. One of the cooks came out and asked how everything was which I always appreciate them asking.   The lunch special was a good sized serving. I even had leftovers to take home but that could be because of the salad or that I ate a whole loaf of bread with the insanely good dipping oil.  Other people eating were a mix of local couples or families and business people on their lunch breaks.   Now I need to visit them in their new location. Get out and support local businesses and help your neighbors do a little happy dance by supporting them :)"}
{"text":"We had the baked Ziti and Pizza and it was 4 star good. It's a nice cozy little Italian restaurant. The prices were reasonable and we'll be back again."}
{"text":"We have been to Buon Gusto old location and have loved it! However we just visited their new location on Anthem Dr and was very disappointed. They put us in the back room where the floor was very dirty, there were dirty towels and napkins on the table next to us. Service was very disappointing, mixed up our drink orders. I believe that opened too soon."}
{"text":"Absolutely delicious italian food outside the valley in Henderson.    The meal started with bread and a salad.  The bread was good and the salad was an iceberg base and also contained artichoke.  The veal parm was delicious!  The cutlet was tender and the portion was large.  It was served with a modest amount of pasta and I also ordered a side of meatballs.  The meatballs are delicious - you should get them.  The sauce is top notch.  The restaurant is small and welcoming and the staff is very friendly.  The staff talks up the food and they clearly take pride in what they prepare.  I highly recommend this restaurant and I will definitely hit it up again."}
{"text":"Delicious!  I've had the lobster ravioli, fettuccine alfredo, mushroom ravioli, and various tortellini dishes.  I love love love their house dressing (Italian type vinaigrette), and the chunk of bread you get with every meal.  We have yet to dine in, as we tend to do a lot of take-out for our date nights while the kids are in bed, but I have no reason to believe it would do anything but improve our opinion of the place!  It's my current favorite Italian place in Vegas/Henderson."}
{"text":"Oh so good..!  I highly recommend the Chicken Marsala with a side of Fettuccine Alfredo (for which there will be an upcharge).. That was the only turn-off - chicken entrees with no side unless you pay extra.."}
{"text":"A few friends were surprised to find such good reviews for a restaurant in this curious location, in a strip mall on the border of a bunch of commercial offices and cookie-cutter residential developments, so I decided to tag along with them. After visiting, we're now only surprised that it got good reviews.  Our experience was very much Jekyll and Hyde. The food was either really good (artichoke appetizer, sausage and mushroom rigatoni, clam linguini) or very disappointing (fried ravioli way overdone, lasagna pasta mushy and falling apart, veal parmesan so smothered in sauce that the breading just fell off).   Same with service:  All the staff were friendly, but service was excessively slow. Slow to get seated, slow for waiters to acknowledge us, slow for food to get out, and slow to get refills and the check. I hate ragging on friendly servers, but when the service is this slow, it's bad service even if they're friendly.  It does not help that value proposition was suspect. Dishes are not large to begin with, plus they give a lot of pasta and sauce but seem stingy on the meat and stuff that matters.  Almost forgot - wine list is very disappointing, but they offer cheap corkage, so bring your own if you insist on coming here. But I'd just as soon recommend to go elsewhere. There are a lot of better Italian options - even in the close-by areas."}
{"text":"Delicious food! Amazing staff! Very cutesy atmosphere! Will definitely be returning here as soon as I am back in Henderson. Excellent prices and delicious options!   I had the sausage and mushroom rigatoni which was amazing! The portions are huge! My niece ordered the kids menu ravioli and there were over a dozen ravioli's in her dish. My sister ordered the spaghetti and meatballs... oh my! The meatballs were delicious!   Amazing little place hidden in a very boring shopping center. However, once you're inside, the interior is amazingly cute. They offer eat-in and to-go orders. Can't wait to eat here again!"}
{"text":"I would say that this place is pretty good.  The food and the friendliness of the servers are 4 stars.  However, there are other issues that bring this place down.  First off as many people have stated, the service is slooooowwww and the time it takes your food to get out is slooooooowwwweeeeerrrrr.  It took forever.  Secondly, I disagree with people's comments that the portions are large.  We all found them to be rather small for the price.  My girlfriend had the Chef's eggplant parm, my friend had lasagna and I had chicken franchese.  My chicken came out on a huge plate with what amounted to about 3 chicken fingers worth of meat.  Not worth $16 or $17 for the plate.  It was a $63 bill before tip for three people where no alcohol was purchased and there was only one soda bought.  That is a bit stiff for pretty good food but average amounts of it."}
{"text":"The hours are right on line for Thursday. CLOSE 9:00. We were on our way tonight and called at 8:35 to place our order over the phone so it would be ready when we got to the restaurant and lo and behold, the person who answered the phone said that \"It was slow, so we closed.\" REALLY? I asked to speak with the boss who was not there and I told the worker that the web site said 9:00. He said, the last customer left at 7:45 so they decided to close. He told me that he would change the time on the web site. REALLY? Since when do the employees determine business hours? Buddy, if the boss pays you for a full day, you should stay till 9:00. The \"Boss\" should do more checking up on his workers. I don't care how the food tastes, that is pretty poor service I never got! Used to be a good place....now, not so much!!! Time for a new crew!"}
{"text":"I've only had their Brooklyn Hero...Amazing!  The fresh crusty bread, the meats, cheeses and house dressing was a treat for the palet. I forgot the two guy's names but they were so Brooklynesque in their casual way but so polite and gracious and accommodating to every guest the two times I was in.  I see some negative reviews posted and all I can say is my experience was not yours.  Everyone has a bad day but I got lucky perhaps.   Ah'll be bach!"}
{"text":"First time at the new location. Waited at the door for someone to seat us. After a few minutes we were seated (2) by the window. It was sunny and it was uncomfortable pulling in the chair because the table leg was in the way. At first I though oh that's just me, but another Patron came and said the same thing. Waitress was wonderful and food was great. My suggestions would be to get rid of the paper napkins and table paper. And get some food runners. The waitress should not be running the food, getting the bread, bringing all the drinks. You have a great location and great food. But you need to step up your service. Window treatments would also help."}
{"text":"My good friend grew up in New York City, and Buon Gusto is one of her favorite place to eat in Las Vegas. It didn't take much arm-twisting for her to convince me to try it out for dinner on a recent Friday evening.   The owners hail from Brooklyn and serve up excellent food at fair prices. It's a smaller restaurant, complete with memorabilia from NYC all over the walls. When we arrived it was packed with another party waiting to be seated. Sandi, one of the owners, was working as the hostess and she was great. Not only did she give us a pretty accurate idea of how long we would be waiting, she also came over to let us know when the party seated at the table we were going to be sitting at was done eating.   Our waitress took our drink order and brought out some complementary warm bread and oil to dip it in. We had my friend's two children with her that were starving, so she ordered food for them while I continued to look over the menu. When their slices of pizza were ready, the other owner, Steve, brought them out to our table.  I ended up ordering the spaghetti and meatballs, my friend had the eggplant parmigiana, NY style. I was given the option to switch to whole wheat or gluten free pasta for an additional charge, I didn't do it but like that it was an option. Both entrees came with choice of soup or salad, I chose the salad with house dressing (made in house as all house dressings should be) and she had the soup which was Italian wedding soup. Both of these came out very quickly. The salad wasn't anything to write home about but it the veggies were fresh.   We waited close to an hour from the time we ordered for our entrees to come out. Our waitress was very apologetic, which we appreciated, but she made the mistake of telling us our food should be out in \"4 minutes\" ( not \"a few minutes\" which would have made more sense) which of course did not happen.   In the end, the food was worth the wait. The meatballs were excellent, and the portion was massive. I would go back in a heartbeat, just going to make sure I don't have anywhere to be immediately afterward..."}
{"text":"I ordered food for take out. There was chicken parm that I added a side pasta. A chicken francese and added a side pasta and a 1/2 garden salad with buon gusto dressing on the side with grilled chicken. The chicken parm was horrible. The chicken was burnt and the sauce horrible in taste. The pasta was over cooked and the sauce was just as bad. The chicken francese was full of pepper and no lemon taste and the pasta was also disgusting  The salad for $8 was put in a styrofoam container that was the same size as the salads that came with the 2 chicken entrees. They forgot the chicken and the buon gusto dressing was watered down and tasteless. So all 3 meals were inedible and we wasted a lot of money on garbage and that's where it went in the garbage. Will not go there again to eat there or bring in."}
{"text":"Im enjoying my leftovers from Monday evening with my family. The food and service are always wonderful. It's always a shame that there seems to never be a functioning high chair though. On Monday, there wasn't a high chair with a belt to restrain our 1 year old who'd rather stand than sit. The last time we came in a month or so ago, there wasn't even a high chair available. I walked out to go to the other Italian restaurant in the same center and they came out after us saying they can now get one from Port of Subs next door. I really love the food, but I will hesitate to go again until my youngest is out of a high chair."}
{"text":"One of the best capellini pomodoro dishes around. Great taste. Spot on. Also ordered the meat ravioli, very good. Nice house salad included with bread with both dishes. Will definitely return!!"}
{"text":"A friend of mine introduced me to this place a long time ago when we picked up a Bronx Bomber pizza to go and ate it watching football.  I remembered it as the best pizza I've had and have been bragging about it for a long time.  Since then, I've brought a few others and each time, all my friends were less than impressed but I attributed it to my overhyping the place.  I finally brought my family last night to refresh my memory and to use a gift certificate that one less-than-impressed friend had bought me as a joke for my birthday since I told him it was the best pizza.  We ordered the extra large Bronx Bomber, the linguine with clams, and a side of meatballs.  As much as I wanted to validate my past opinion, the food was really just average in my humble opinion.  You can tell the ingredients were fresh but the flavors were just so-so.  The pizza was ok, the linguine was better though my family thought it was a little bland and oily, but the meatballs were lacking (which surprised all of us since this is a very authentic Italian restaurant).  The service was great and the small little mom and pop atmosphere was very homey.  Would come back but will definitely not be hyping this place anymore as having the best pizza."}
{"text":"We had dinner here a few weeks ago.  It was fine, but the food was pretty pedestrian.  The wait staff were friendly enough, but not mistake-free.  Our server forgot to bring our soup before bringing our main courses, so he asked if it was ok to bring it to go.  We said yes because our other food was there, but it wasn't really a good solution overall.  At least he could have given us a little bigger amount given the mistake, but we still got just the small cupfuls.  We split a large caesar salad.  It was plain - no shredded parmesan or asiago, just romaine, dressing, and croutons i think (obviously not memorable).  I can't recall what  my husband ate but I had something with the red pepper sauce that is supposed to be one of their signature dishes.  It was just ok.  The ambiance is friendly and homey - vinyl checkered tablecloths.  The prices aren't too bad but I don't think they should be any higher for this sort of place.  I was really looking forward to trying Buon Gusto, which had been recommended to us and was sad to have been disappointed.  Probably won't end up back there as there are a lot of alternatives (Pasta Shop, Ventano's, Gaetano's all nicer, Montesano's seemed like a better deal for the money with similar ambiance)."}
{"text":"I'm a big fan of their pizza and the linguini w/ clams. Small, quaint, cozy little spot with a very friendly owner & staff."}
{"text":"I am really surprised that there are more positive than negative reviews for this place? I am a really picky Eater from NY and feel I assess Italian food pretty well :) I was disappointed in my meal here.  I ordered the baked ravioli with extra sauce , it cam with a sub par salad that I did not like at all and did not really have extra sauce.  The sauce reminded me of Ragu or Delmonte from a can.  I know that it was made there but it was not very good.  I got a slice of pizza for my daughter which was decent.  I would go back for a slice but there definitely is better pizza around here such as Verranzos on Windmill/Eastern and Grimaldi's on Eastern.  I wouldn't return to this restaurant except for a quick slice if I was in the shopping center."}
{"text":"My absolute favorite Italian restaurant plus Chef Christoph is so cute!! Wish I lived closer I would be there daily"}
{"text":"I can't say enough good things. I was going there on a first date ish so I was kind of uncomfortable, but when I walked in it was like I was walking into my Auntie Angie's house with fifty of my relatives. It was that homey warm feeling that is only created by one thing - love.   The food is awesome. Just all of it. I felt welcomed there and wanted and they just get it. Tommy one of the owners stopped by and chatted with us for a bit (This was like a month ago and I still remember his name - I hope.) I work in the service industry and I take a lot of pride in my job, and it is nice to see that there are others that do the same.   If you're a local, support locals running a business. You won't be disappointed. This is one of the best experiences I have ever had in a restaurant, period. Thank you!"}
{"text":"Pizza is okay for Las Vegas. Buon Gusto is a lovely Italian restaurant, and you might expect appropriate music to set the mood. Unfortunately, the radio was blaring idiotic music from \"Old School 107.5,\" and that selection made the place unbearable."}
{"text":"Meh. Service was fantastic but food didn't deliver like we hoped it would. The decor and atmosphere is very East Coast. The menu prices, for a homey pizza joint, do not reflect the quality of ingredients in anything. Pizza has a dry cracker crust (bleh) and toppings are of mediocre quality. For a small (9\") pizza, toppings should not be $1.50 each and if they need to be that expensive, they need to shine. This is not true. Pepperoni is tiny and not that great. Also, pizza cheese is average, bland and not much flavor. Pasta dish prices are a bit high; most baked pasta dishes range from $13-15 and that's way too high for pre-cooked pasta to simply get smothered in pre-made sauce and cheese and thrown under a broiler for 10 minutes. Unless it's enough to feed two people, that's a high price but if it tastes great...this wasn't the case though. What I suggest is that quality of ingredients steps up a notch, the theme and style of this place is awesome but the menu needs to reflect what it's going for. Good sauce, good cheese, good-to-go!"}
{"text":"What an amazing find in the middle of Henderson!!   I went here the other night and was greeted by Chris who is so friendly and enjoyable to talk to!!   Now let's talk food!! I had the chicken parmesan Not only was it absolutely delicious!! the chicken was perfectly cooked!! the sauce was amazing! and the portion was so big I had leftovers for 2 days afterwards!   Most of the entrees come with salad and that's not your run-of-the-mill salad it is a nice salad with your choice of garlic Ranch homemade dressing or a wine-based balsamic dressing.. I tried them both and they were phenomenal!  You're also served a full loaf of sourdough bread and the best oil vinegar balsamic dressing to dip it in I've ever had!!   I also tried the tiramisu for dessert and I normally don't like tiramisu very much, it was absolutely one of the best desserts I've ever had!!   What a great find I can't wait to go back again and try something else and to bring all my friends there!!"}
{"text":"This place was pretty good.  Great service and quick for lunch, but definitely not a lot of \"healthier\" options."}
{"text":"What a hidden gem this restaurant is! We came in because we are new to the area and had a coupon from The Entertainment book. The food was delicious and sauce was homemade. They also make their own ranch dressing which was also delicious. They served the food with warm bread and butter and everything was superb. We ended the meal with some gelato and I'm so glad we did!  The restaurant is very small and homey inside. The staff was pleasant and eager to please. All in all, a good experience."}
{"text":"Tried their new location in Anthem and it was a very poor experience. Grossly under staffed. Waitress eventually took our order and never saw her again till it was time for the check. Food was average but the parade of dishes being returned to the kitchen was steady. Forgot to serve our side dishes. When credited from bill they over charged the entree to overcome the difference, sneaky. Not very personable and distracting with all the drama of being short staffed. Not a relaxing experience, couldn't wait to leave."}
{"text":"This place was FANTASTIC!!! I tagged along with my husband on a recent business trip. Wanting to avoid the strip and other crowded establishments I consulted Yelp to find some recommendations. After pouring over the dozens of recommendations we finally decided on this one and could not have been happier! It is a darling little Italian restaurant in a local strip mall and was very clean and welcoming. Our waitress was a young girl- I didn't get her name, but she was AWESOME!! Upon hearing it was our first visit- she went out of her way to explain the menu and give us options that were better than being at home! My husband wanted a very specialized plate that wasn't on the menu and she didn't bat an eye, said it was no problem at all! The food arrived and was absolutely as close to home made as you could ever hope to get! It was the most delicious Italian food I've ever tasted!  I'm not sure if I'll ever tagalong again, but if I do, you can bet that will be revisiting this place again!!! I highly, highly recommend!"}
{"text":"Okay for Italian however if you want food to go call it in an hour early and check your order before you leave. A little disorganized.  I still go here about once a month so the food is good! Lasagna is above average."}
{"text":"My all time favorite Italian restaurant! It's really small and tight inside but it gives off the family restaurant feel to it. It's so cozy and home-y? Not only that, the food is amazing! The service is on point. Everything is good. The Rigatoni is number one of my recommendation list."}
{"text":"I have eaten here a couple of times in the past and had an enjoyable meal..l grew up in the Bronx New York and know my Italian food. I took my sister here who was visiting from New York. She ordered the lasagna and was quite disappointed. It amounted to what looked like one big pasta noodle and gobs and gobs of sauce  It was supposed to be meat sauce but I'll be darned if I could find a hint of beef in it.  Very little cheese as well. Also the bread portion for two was really tiny. I ordered the eggplant parmesan New York style and it was pretty good. However I did notice that the portions got a lot smaller and it was not as good as I remember. Also the side pasta was really tiny. I'm guessing their main chef may have been off that night. Anyway I doubt that I will be back. We should have sent the meals back or should have said something. On the positive side our waitress was very nice and efficient."}
{"text":"I had a really bad experience here in the past, but needed a quick pizza place. The guy at the counter knew me from my review and just apologized in a very gracious way. I felt very special and like they heard my review. I think the pizza is awesome and understand places have bad days."}
{"text":"We have gone here for over a year, the food quality has always been average to slightly above average with a few stand outs, such as the potato gnocchi with pesto. Our last few visits have been increasingly disappointing and when we took an out of town guest there recently  and they were out of several items and food was very mediocre, we decided we won't return."}
{"text":"Great hole in the wall, family owned restaurant! I loved their pizza crust on the artichoke pizza. The chicken Marsala was also excellent. Staff is super friendly. I'm definitely coming back."}
{"text":"What can I say.   Upon entering the restaurant we waited more than 5 minutes before someone seated us and there was no one else eating in the restaurant at  the time.   The meal I had was terrible.  The pasta was over cooked, the sauce tasted as if it came from a tomato paste can.  Did not finish the meal.  The service was lacking.  Just before the main course was served we asked if there was supposed to be any bread served and the server said she forgot to bring it.  If the food had been decent the price would have been great.  Will not be going back."}
{"text":"A local favorite.  Fresh baked bread hot out of the oven with a delicious garlic, balsamic vinegarette to start.  A crisp Caesar salad and the Penne e Broccoli(I like the wheat penne).  Dinner was delish . Love the service here.  It feels like home. I recommend this to anyone looking for a genuine Italian homemade dish."}
{"text":"My mom and I used to LOVE this place. But since the new owner, this place has turned upside down. The new staff are not  helpful, and you wait 15 minutes to be seated when the place is empty. Food is okay, but not wonderful like it used to be. Menu items have been changed and replaced. So disappointed.  Once placed a to-go order for a meatball sandwich when driving home from work. Took 30 minutes to get to Buon Gusto, and they didn't even start my sandwich when they said it would be ready in 15 minutes. Save your money, this place is not worth it anymore!"}
{"text":"This is by far the best home cooked food you will find in Vegas.  Friends from north Jersey and New York who are Itilian and love Itilian food have tried this place and say it is the best in Vegas.    The prices are extremely reasonable and you will not be disappointed.  You will find it hard to believe how they can serve such great food at such a reasonable price.  If you love Itilian food and have not tried this place, you are missing out."}
{"text":"Was out with the family looking for a place to have birthday dinner for my granddaughter we came upon a small normal looking little restaurant my wife says let's give it a try upon entering the restaurant it was warm cozy and felt like my grandmothers house in Italy we were immediately welcomed and sat Our waiter I believe his name was Randall immediately approached the table introduced himself and proceeded to go over the specials of the night and take our drink orders upon returning Randall brought warm bread and special drinks for the kids we ordered our dinners which were all amazing I could name individually but would take up two pages ,upon the ending of our meal Randall brought out special birthday dessert for my granddaughter and the other kids and proceeded to sing happy birthday to her without any mention to sing from me or wife,I understand they're moving to a new location soon and I will be one of the first in line due to the wonderful food and the amazing service provided by Randall and the staff at This amazing hidden gem ,I suggest you all try soon before you can't get a table. Thank you again Randall looking forward to seeing you again"}
{"text":"Oh my god, so we stumbled across this place on accident and i am so happy we did!  Buen Gusto has this cool, back-east, authentic Italian-American, casual vibe that makes you feel right at home. Then, the staff is all so friendly and full of smiles and pleasant conversation that it makes the small space seem perfectly intimate.   We got the sautéed artichoke appetizer which was insanely good, we ate a ton of delicious bread dipped in olive oil and herbs, and then we shared a huge plate of delicious home made ravioli. We topped it all off with an inexpensive bottle of red and after a long day of golfing, it more than just hit the spot, it became our new favorite spot.   The best spur of the moment culinary decision we have made yet!"}
{"text":"i went here on the advice of a friend after i was complaining about how there was no pizza places that are like the ones back east that i loved.   it is a small hole in the wall and has the atmosphere of a big city pizza parlor. i was told they even import the dough from NY. and it was true. although when i went i did not go for the pizza we had the pasta. the girl that was serving us even put up with all my questions and the owner was walking around striking up conversations with all the tables.  back to the pasta it was the best i have had in a while they make the sauce for each individual dish. so its not made in the morning and sits around all day.  far drive from the house but well worth it.  oh... dont forget to try the cannoli best i have had in vegas."}
{"text":"Great food. Great wine. The food will make your taste buds go wild. I love the fact that its authentic cuisine. Highly recommended!!!!"}
{"text":"Are closed on Sundays and not open until 3:30 on Saturdays. So you'll never have lunch there on a weekend. No clue why.  No booths."}
{"text":"Not impressed. We had a pizza and the mushroom ravioli. The pizza was alright, nothing special, but the ravioli was not good. It was covered in so much red pepper sauce that you could barely taste it. We went on a weekend around lunch time. We were one of 2 occupied tables. Service was not good. Had empty glasses a lot of the time. I found the music to be too loud and not appropriate for the decor/surroundings. A bit over priced as well. Will not return."}
{"text":"The food was GREAT.  Staff was very accommodating and prices were on the low side, plus a traditional atmosphere  -- all in all, a Home Run."}
{"text":"I've tried a few tasty dishes via coworkers (garlic and oil linguine with clams, delicious, sausage rigatoni, yum, and chicken tenders with fries, equally delicious!) and was convinced to visit when I had a hankering for some pasta. I was just ordering take out, but admired the dining area while I was there. Very cozy. Definitely unexpected for a spot in a shopping center. I ordered the baked spaghetti and a side of their housemade meatball. The baked spaghetti was not what I expected. The portion was very generous, but so was the very overwhelming mozzarella cheese that was \"baked\" on top. I attempted to scrap off as much cheese as I could to make it bearable. The spaghetti was good though and the meatball was great! It also came with a side salad that I thought was wondeful. Especially with the marinated artichoke, peppercinis, and their amazing ranch dressing (seriously, THAT is how ranch should taste!) So my first experience wasn't fantastic, but I blame it on my ordering a dud since I've had other pastas from there that I thought were great. Will have to give it another whirl! They have wonderful lunch specials and overall, the prices are decent for the amount of food.  Edit: I had to bump them up a star for their PIZZA! Wowza. I'm not a cheese pizza kind of gal because it's way too boring and the cheese can be too much (at least the way most people make it). However, my New Yorker friend, who constantly vouched for this pizza, told me that the cheese was the way to go. So, I had to follow suit. We ordered a whole pie, so it was fresh and hot. I have one word for it, heavenly. Pizza perfection (disclaimer: I love thinner crust!). There was a nice, light crunch from the bottom of the pizza, the soft and thin layer of dough, sauce, and cheese. No flavor was overwhelming except the sweet harmony of these three things. The crust was still dough-y, but had a nice texture to it. I love being able to fold my pizza slice in half too. Oh, it is just so GOOD! After that first experience, I had their pizza three times within a few weeks. Every time, it didn't disappoint. There's not very many places that I drool over pizza, but this is one of them!!"}
{"text":"I love this place!!! It is very cozy and the staff is always amazing! Food is great but the desserts are even better (I recommend the bread pudding)! Definitely a restaurant worth trying if you haven't already!"}
{"text":"The best pizza in the area bar  none.  The  crust is light and delish.  Staff super nice.  Locally owned, a plus.  Vegy pizza is my favorite but the kids usually demand pepperoni.  Oh well, the crust is the same and it rocks!"}
{"text":"We just ate at this restaurant based on the recommendation from other yelpers.. It was amazing service was great and the food was delicious... Excellent home cooked Italian food...   Its moderately priced but you get a lot of food for what you pay for. The portions are large and it comes with  soup or salad. The bread came out hot and fresh...   We for sure will be visiting this place more often now that we found it.."}
{"text":"My experience is much like the others that have left poor reviews. After reading the \"good\" reviews we decided to give it a go - MISTAKE! This place is awful! I don't mind waiting an exorbitant amount of time for my food if it's going to be fabulous, but this was certainly not the case! We waited almost an hour for salads, with tasteless dressing and all lettuce, the cheese pizza was just ok (nothing to write home about), the vegetarian pizza was improperly made and and after an hour and a half you would think it would come out right? We ordered a kids pasta Alfredo that we had to ask 3 different servers for and it was the last item brought to the table! Kids dishes should be served first not last - after 1 hour and 30 minutes!  This is a mistake never to be repeated!"}
{"text":"Food was good but expensive.  I bought cheese tortellini w/ pesto, chicken marsala, and cheese ravioli for ~$40.  Cheese ravioli portion was alright but for $17 mu chicken marsala contained a handful of mushrooms and 3 small pieces of thin chicken.  Like I said the food was good but not $40.  I'm going to try their lunch menu in the future."}
{"text":"Ordered take out and what a disappointment.  Chicken parmesian was soggy and had no flavor besides chopped garlic. Bottom of the dish was filled with grease. No pasta included with that dish just the chicken and a side salad. Not worth the price or the hype."}
{"text":"We love Buon Gusto so much we come a few times a month and have been coming for years it was recommended by the Food Network and we have been addicted!!!  The service is Great comfortable atmosphere and the food is delicious. We love our server Drilon!!!  He is great with kids and so is the atmosphere Thank You"}
{"text":"My wife and I had been wanting to try all the little local Italian restaurants in the Henderson area and ate here last night.  Service was great. Food was very good. I had the pizza and my wife ordered Sausage and Mushroom Rigatoni which was great.  We order a Caesar and Side House salad, both were really good.  We'll be going back and only reason for mark down is that the pizza, while good, lacked the wow factor of a few other pizza places in the area."}
{"text":"I don't get the ratings. Not homemade, not flavorful. I had the gnocchi with tomato cream sauce. Store bought gnocchi with a bland sauce. Got boring real quick. Husband had beef ravioli and said it tasted like it went from a freezer to a microwave and then was too long in the microwave. Sauce was bland. Pass on this one."}
{"text":"Disappointing. Ownership changed and now the pizza is \"ordinary\". Actually - not so great. When the formula works, why change? Dad taught me, \"If it ain't broke, don't fix it!\" Heed."}
{"text":"This place is awesome my family are all regulars. consistant good food and service i got a great value in there catering menu. My daughter birthday party was a home run!"}
{"text":"I came here twice in the past month with friends locally and then some really authentic friends from New York.  Here is my dealio.  a. 5 Star - The chef / owner comes out to talk with you.  Love it!  Very cool.  b.  3 Star - Food - Pretty darn good. I had the Shrimp Fradiavolo and you know what, it was okay. I am not sure if it was the small shrimp size or the small quantity of shrimp, it was just okay.  Came back a few days later and had the Linguine Del Mar. I liked this dish much more.  The noodles were just right, al dente.  The seafood was very tasty and tender. Again, they don' tout much in your dish, but this was a very tasty, tender dish.  c.  Aw Shucks - My friends from New York are both Italian and I have eaten many italian dishes in New York / Long Island.  They drove here from the strip because I was remembering Buon Gusto from the old days and all I can say was, they were really not I guess, \"whelmed\"  .  Is that even a word?  They were not overwhelmed or underwhelmed.   d.  Service - The week  before the service I had was really great!  The wine was good, the bantering was great and our experience was just right.  This last time, I am not sure how well trained the waiter was, but he got an order wrong, and so two of us started eating our hot dish and the third one came out so late we were done eating and watched her.  I found that odd at best. There was no accommodation, they charged us for everything, but the experience with two people eating , one person waiting and then the other eating after the first two are done, is just plain dopey.  e.  Coffee - Now any great italian food needs to be followed by coffee.  I wanted an espresso and they had a Kuerig machine with the cartridges. My colleague asked for a cappuccino and that was when we learned about the Kuerig.  I was going to ask for an espresso, but I decided not too. I do wonder if they have a proper coffee machine or not, but at this point, after waiting for the food like we did, I did not want to linger any longer.  I really enjoy supporting locally owned restaurants.  I like the atmosphere, the family feeling, the great decor, the nice people.  I will definitely be coming back.  Just not a five star situation at this time based on my last two visits within one week of each other."}
{"text":"I would never have found this place if my wife hadn't been craving Calamari.  We figured that if we were getting some apps we should go to a place we had never been. She started looking at Italian restaurants that were semi-close to where we live and Buon Gusto popped up.  The reviews were great so we headed on over.   I have driven past this restaurant a number of times and have never seen it.  This place is pretty nice.  It's very small, warm, and welcoming.  The Calamari was very lightly breaded and had the right amount of salt for seasoning.  My wife loved it and even though I'm not the biggest fan, I thought it was pretty great as well.  My wife ordered the Manicotti and it was some of the best I've ever had.  I had the Sicilian Style Eggplant which is baked and topped with Mozzerella cheese.  It was very good and there was a lot of it.  The waitress was great and the timing of the appetizer, salads, and entrees was perfect.  The owner was in the kitchen making pizzas and he was fun to watch and listen to.  I do wish that the food was a couple dollars cheaper for each entree but that won't stop me from going again."}
{"text":"A real gem. All sauces are made onsite daily and are superb. You can't go wrong with any meal!"}
{"text":"I have had Buon Gusto bookmarked for some time, and I finally went for lunch.  Very glad I did.  I arrived before noon on a Tuesday and was the only person in the joint.  I was served immediately.  I had the chicken parmesan sub, which comes with a side (choice of fries, cold pasta salad, or dinner salad) for $6.95.  This is a substantial sub, the length of the bread is not long, maybe a little more than 6 inches.  But, it's PACKED full of sauce, cheese, and a perfectly fried chicken cutlet.  I'd rather have more items in the sandwich and a shorter roll than a foot long roll with hardly any ingredients.  So, this was perfect for me.  Everything went together well, the sauce is seasoned well and the chicken is juicy.  This is a great example of what chicken parm subs should be.  And, served with a side for only 7 bucks!  Great price.  Because it was my first time and I had read good things about the meatballs (I also skipped breakfast, so I was sufficiently hungry) I decided to get the side of meatballs, which is $5.95 for 2 large meatballs smothered in sauce.  These were fantastic.  I didn't finish one, like I said, I had the sandwich, but I took the remainder of the meatballs home.  They were even good cold.  Juicy and paired well with the sauce.  These were winners.  Buon Gusto is a fantastic neighborhood Italian joint.  It's reasonably priced and operated by friendly people.  This is what small neighborhood restaurants should be."}
{"text":"Found this place on Yelp by accident and what a happy accident it was!  Arrived around 7:30 on a Friday night and there was a very short wait. We waited in the front by where they make pizzas and that was interesting to watch - also looked delish.  We got the last table in the back which was very cozy, warm bread with olive oil and vinegar to dip,  Waiter Dave Z was delightful and joked with us throughout the meal, as well as being very attentive.  Wine all around - now we were set to read the menu.  I had the Chef's signature eggplant and it was outstanding.  My husband had the penne pasta with broccoli and chicken, which was also excellent.  My friend had spaghetti with meatballs which was very good, too.  But my friend Coleen had the sausage and mushroom rigatoni which was out of this world.  All the portions were heaping and I was amazed to see her all but finish it - I have NEVER seen her eat that much!!  She's an awesome cook in her own right and could not stop saying how incredible this dish was.  The owner came over and shared some of his thoughts and stories about his business - this was truly like having dinner with an extended family.  We are sad that this place is over 2 hours from home but we plan to stop in each time we have to visit Vegas.  Had no room for cannoli so we took one home and shared it for breakfast.  Yummmmmmm.  Here's the hard part - I easily give this place 5 stars and that's uncommon for me.  Usually something about the restaurant turns me off or isn't what I thought it should be.  Not Buon Gusto.  And if I give it 5 stars then I'll have a longer wait next time I go because all of you want to try it, too.  Hmmmmm.  My karma would be all FUBAR if I gave this place anything less than a five - so have at it!"}
{"text":"Only went here to get the free spaghetti and bread with a purchase of a large or extra large pizza. The pizza was uhm eh? It was very thin and not tasty for 26 fricking dollars HAHAHAHA. and they didn't give us the free bread or spaghetti but we were given a different kind of pasta and charge 3 dollars for ONE meatball that wasn't even that big. Y'all better off with little ceasers at least they have more marinara sauce on their pizza. Do not recommend this place at all. I would like a refund, does the food network mention any refunds??"}
{"text":"Food so good I'd lick the plate. Service makes you feel like your in a four star restaurant. T"}
{"text":"After a beer festival in Lake LV, we needed to fuel up. With the positive reviews and comforting looking food it seemed it would be a winner dinner.   We were started off with some fresh hot bread, oil with garlic to dip. They ask if you want balsamic in it too which I never refuse. Man, I love/hate good bread. Love the taste, hate that I can't stop. Entrees come with a salad or soup. We got one of each. The soup was pasta fagioli, which had various pasta and white beans and had good flavor, though a tad salty. The salad was good with olives, tomatoes, onions, artichoke, pepperoncini with vinaigrette.   We got sausage rigatoni with tomato cream sauce. The sauce was solid, well seasoned and it was plentiful with sausage. We also ordered the linguine clams with red sauce which was a nicely garlicky clam flavored sauce and the clam pieces was so plentiful every bite had clams. This is a good thing that the portions were not skimpy, but not suffering in quality. I asked if the pasta made in-house, but it's fresh stuff delivered from a spot in New Jersey. Some people may find it oversauced a bit, which doesn't bother me - it's bread sopping time! I was too full with all of this pasta and bread.   Its a tiny busy eatery, but many servers and runners so the service was pretty decent even when our main gal was busy. Everyone was friendly and polite. Lot's of \"ma'ams\" we're thrown around which I'm not used to.   Charming little place. If this wasn't across town from us, I could see us going here on a regular basis. Food taste to portion to price ratio is really good. For $15ish a pasta dish we had bread, soup, salad and entree which I think is reasonable for all you get. This is like, Olive Garden formula and prices, but homemade and homey. I'm a fan, and would consider their something I would try to hit up anytime we're never Henderson."}
{"text":"Cozy atmosphere topped off with a warm welcome from Chris when my niece & I stopped in for some dessert. Excellent customer service. Chris offered suggestions which we welcomed & definitely enjoyed! The cannolis were amazing! We will definitely become regulars here! Much thanks to Chris for taking care of us!"}
{"text":"Bon Gustos knows how to put garlic to good use. From their olive oil for bread dipping, to every item on the menu, it's like a trip to Italy! We enjoy dining at Bon Gustos as often as possible."}
{"text":"As a born and raised East coaster from NJ , I would have to say this place so far is the most authentic Italian restaurant I've been to since moving to Las Vegas. Walking in just reminds be of the little Italian spots u'll run into either in North Jersey or Lower East Side Manhattan. Ok enough about the decor now the food!  So far I only had spaghetti and meatballs at let me say, it was soooo good!! You can tell the sauce and meatballs were defiantly homemade and not from a jar or frozen. The pasta was al dente which is should and moist.  The bread and dipping oil was so delicious as well.   This place is defiantly a a hit for me. I will be back for seconds in the near future"}
{"text":"Our favorite for Italian...  the shrimp scampi is amazing!  The best we've had!  Can't wait till they move up by Anthem (soon)!!"}
{"text":"One of the best well rounded Italian restaurants in Henderson!!!  This is a small Mom&Pop New York style Italian restaurant and I found it in Vegas Weekly. I've been coming here for a year, so I've tried most of the stuff on the menu.  The is food here is spectacular!!! Fresh daily, and you can definitely taste the quality.  The meatballs are delicious, and the Chicken Marsala and the Piccata are both my favorites dishes.  The pizza it's great but I prefer to just ordering the entrees because they are so many other specialty pizza joints around the area. You must try the homemade Tiramisu it's simply divine!!  I have never had a problem with the staff, great customer service and they are friendly. Last few times I went when they weren't busy, I would strike up a conversation we shared a few laughs.   I must say I will definitely continue to go back."}
{"text":"Drilon was a great waiter!! We love this place!  So happy the restaurant has moved up close to our store!! This is definitely the place to go for good  Italian food!!"}
{"text":"Why oh why can ONLY 5 stars be given????? Buon Gusto is the most amazing little gem in this city full of corporate sell outs and manufactured poor quality slop that other places try to pass off as edible.   The food itself could earn 5 stars, the service and the staff, all are worthy of their own 5 star rating. I discovered this place during my pregnancy and I fell in love. For those of you that aren't aware, serving disgusting food to a pregnant woman is grounds to get your innards pulled out and handed to you. That night we had ordered take out from another Italian chain just down the road and they screwed up my chicken piccatta. So after tears, and brow beating my poor hubby we threw that in the trash and ventured out for one of my crazy cravings for that hour. Note to any good husbands who have been on the receiving end of such hormonal upheaval, it will cease and the monster who has possessed your wife will be evicted shortly after the baby is born. There is hope.   Enter Buon Gusto, the heroes who may very well have saved Hubby's life and sanity at least for one evening. We walked in and the smell alone was worth bottling and selling. Whilst in the throes of pregnancy, smell and taste can either make or break your entire day. This my friends, made it. Oh Chicken Parmesan Sandwich how you changed my life, that very night. It was pretty much a religious awakening. Of course being the dainty, figure conscious little thing I am, I devoured my food and demanded to try Hubby's and my older son's as well. Heaven.   This food could end wars, restore virginity, right all wrongs, find the Lindburg Baby, solve the Mystery of The Bermuda Triangle and . . . . . . . . be the mitigating factor in solving the National Deficit.   Please go in and be prepared to be treated like family, eat with good people and most of all leave with a sense that your money wasn't wasted here.   The only thing that they could possibly do to make it better you ask?????? Come to my house and cook, okay and do the dishes after =)"}
{"text":"What comes to mind with my meal here?? Lackluster to say the least.  After seeing so many positive reviews on Yelp, Cesar Q and I decided to stop by.  We were greeted upon entering the restaurant and told we could sit wherever we wanted.  We sat down and were immediately asked what we would like to drink.  Our beverages were brought and we placed our order.  Since we both ordered an entree it comes with a small green salad with your choice of dressing.  My salad arrived and there were so many tiny sliced olives (I despise olives) so I was forced to pick through and push them to the side.  All in all my salad was tasty.    Our entrees came shortly after our salads.  We both ordered the same thing, chicken franchese with an add on of a side of pasta.  The chicken was brought to the table and both my hubs and I looked at each other puzzled.  The meal that was set before us sooooo did not represent what we saw in all the awesome yelp pics.  Our chicken appeared to be one small chicken breast that had been pounded out and cut into 4 small pieces.  It was surrounded by a bright yellow sauce.  Now don't get me wrong, the sauce was tasty but it was seriously YELLOW!  The chicken was not browned as it should have been (imho).  Eventually the side of pasta was brought to the table (chicken already consumed).  We asked for bread, kinda wondered why we had net gotten it sooner.  Guess you have to ask.  The bread came after we were done with the pasta so we basically scooped up all the sauce.  The restaurant is small but very comfortable.  Decent ambiance.  I don't mind paying for good food and while we did walk out satisfied I was not pleased with the portion size considering what we paid.  $15.95 for the chicken and an additional $2.95 for the side of pasta.  The meal for 2 came to $40 plus tip for lunch.  That's nuts!!!"}
{"text":"Save yourself a trip. TERRIBLE service and mediocre food. My eggplant parm was scalding in the outside and cold on the inside/soggy and flavorless."}
{"text":"Their bread is soooooo good. Had the cannelloni. Ot.was.good. the calamari was very good too."}
{"text":"After having three people tell me I needed to try this restaurant. I made an attempt the past 4 days but every time I called or drove by it wasn't open. Tonight finally it was , I ordered take out. I ordered baked ziti with eggplant and garlic bread. First let me say that the guy (not sure of his name but has lots of ink)  who took my order and was at the counter when I arrived was super nice , excellent customer service. I got my order nice and hot.  House salad dressing was delish ( was recommended) now for the baked ziti. Not totally what I was expecting it was ziti with cause topped with cheese and 5 pieces of eggplant. Flavor wasn't bad  didn't have much ricotta cheese in it. I guess I should have asked but the eggplant was just that pieces of eggplant. I was thinking it would be baked into the ziti.  I will probably try it again but  go with a different dish"}
{"text":"I used to go here on a weekly basis at the old location on Horizon Ridge, but then they changed owners a couple years ago and it's gone downhill ever since. The service became terrible and the food was worse. Hadn't been in almost two years.  I just saw it at this new location in Anthem and decided to give it another try because it used to be amazing. I tried to order something to go. The hostess got it wrong literally seven times (I even wrote it down for her at one point) and I had to go back to the kitchen entryway twice to ensure they got it right, and they still forgot the bread.   It took well over 30 mins for two plates of pasta, bread, and side salads, and they had to re-do my check twice because they charged me for the tortellini I originally wanted (but they were out of it and didn't tell me about it for ten mins).   Side note: The hostess who took my order had no idea what tortellini was (at an Italian restaurant) and when I said I wanted Thousand Island dressing and Caesar dressing (for the salads, of course) she thought I wanted them as the sauces on top of my actual pasta. Wow.  The place was deserted during dinner rush on a Saturday night- people at three tables out of what seemed to be about 30 tables possible, the air conditioning was sorely insufficient (I was literally sweating while I waited), and everyone looked absolutely miserable- customers at tables, other pick-up customers, and everyone on staff.  I am giving them one star because I somehow actually ended up with acceptable food in the end."}
{"text":"My friend and I came here by looking at the Yelp reviews and let me tell you this small joint has some of the best italian food in town. The bread is so hot and fresh and we ordered chicken parmesan and wow it was so moist and the marinara sauce was cooked perfectly. The owner was there and he was super nice and we were the last people to leave and we never felt rushed. The house salad was pretty good because of the dressing. When I'm in henderson I go here :)  PROS: atmosphere, service, food CONS: a little pricey"}
{"text":"Can't believe the pasta's clams is from the Can food & Italian restaurant doesn't serve \"capuchino\" !!"}
{"text":"Food is good, service is TERRIBLE.  Went in on Sunday and there were two tables occupied and nothing much happening.  The 3 employees were in the kitchen talking the whole time and it took FOREVER to get food and drink refills.  The service has declined since the move.  Hopefully they fix this....."}
{"text":"Just had a delicious dinner with friends at Buon Gusto Restorante. I had the Chicken Marsala which was delicious and ample. It came with a nice house salad and pasta or a green vegetable . 0h yes and nice ItLian bread.The price was moderate and  our waiter Drillon was friendly, helpful and efficient"}
{"text":"Great to see a locally owned restaurant that's this good!  Servers are very friendly and welcome you as if you were dining at a friend's house.  This, in my opinion, is a must in any Italian restaurant.  So kudos to the owners for creating such a warm and inviting atmosphere.  Dinner menu is a bit pricey, but the crisp cold salads, piping hot delicious bread, and large portion sizes more than make up for it.  Oh and by the way, fight the temptation to dig right in for just a few seconds for fear of burning your tongue, because all the entrees come out hot!  Maybe the portion sizes could be cut to accommodate a better price point?  But, that's just me thinking aloud, I guess that's what their lunch/take-out menu is there for.  Overall I'd highly recommend Buon Gusto to anyone who enjoys a great Italian meal with plenty of left overs!  =^)"}
{"text":"Service was terrible. Took FOREVER for our food. Tables are way too close together and I could here everything the person next to me was saying. The new owners don't hire very well And they never filled our glasses will not be coming back for a while."}
{"text":"I love this small, local Italian restaurant!  Being from NY, I often long for those non-chain gems.  The ones whose decor is charming and welcoming; where the service is genuinely hospitable; where the food is like a warm reminder of home cooked family dinners.  This is one of the closest I've found to that in Las Vegas.   We noticed right away how small the restaurant is, but I like that about it!  It wasn't overly busy when we went but I could see how it would get tight at dinner time on weekends.    The food was delicious!  It had the authentic home cooked meal flair.  The portions were so generous.  I took half a plate of baked ravioli home because I just couldn't finish it.  And I'm so glad to have leftovers to enjoy!  Even the side salad was a great mix, although I wasn't as crazy about the house balsamic vinaigrette as I thought I'd be.   We often get coupons for this place in the free newspaper that comes to our door - either 3 dollars off a pie or buy one meal get one 50% off (good only during the week after 4pm).  But there's also a yelp check-in offer for the same.  Every penny counts, especially since dinner can rack up when you add wine and desserts (which are pretty reasonably priced!).    Will definitely be back here for dinner and to try the pizza, especially since I'll only be 10 minutes away soon!"}
{"text":"So we found this place on Yelp! (where else?!) while searching for a good Italian restaurant in the Southwest/Henderson area. Walking into this place was just like walking into my grandma's kitchen... this place was full of yummy aromas, simple decor and small dining tables that made it all a very inviting little place.  You can tell this place is family-owned and it shows in their friendly (and awesome), yet informal service. Upon sitting down you are greeted by a big smile, a basket of warm home-made bread and a mixture of herbs and virgin olive oil-- which you can refill as many times as you'd like. By the way, the bread they serve is pretty much the BEST bread you will try in Vegas.  We all ordered different dishes to try: Sausage mushroom rigatoni, penne all a vodka and linguini del mar and they were all amazing. You can taste the dedication and fresh ingredients put into every dish and will rejoice in the huge portions the will serve you! Now, while all the different dishes we ordered were awesome, I would recommend the Linguini del Mar as it is the tastiest of them all.  Do yourself a favor and come visit this place. Your tastebuds will thank you for it!"}
{"text":"We went to eat at bon gusto tonight, we were met by a horrible smell, like dirty deep fry....or something foul smelling. We left because we could not sit down and enjoy our meal in this smell. We never had a bad meal here before..... never smelled this foul smell before. Please close down your kitchen and clean it properly. We will come back at a later date and check on you guys..... Erik Lindqwister"}
{"text":"Great little neighborhood restaurant, the food was outstanding!  I had the chicken Marsella and my wife she had the chicken Parmesan , both dishes were great!    The food fresh, the dinning room was clean and Kyle our server was friendly and took good care of us."}
{"text":"This place is all about the food.  You dine in an extension of the kitchen, right alongside the chefs as they work the kitchen magic.  The food is excellent and the people are friendly.  The dining area is limited and it does get pretty busy during meal times.  They only do reservations for parties of 6 or more, so you might have to wait to get a table if you go before 8pm.  Their house original, the Veal Trieste, was excellent.  It is served in a cream sauce with artichokes, mushrooms & port wine.  Boyfriend got Chicken Cacciatore, which was also very good.  All of their entrees come with fresh baked bread, soup or salad, and a side of penne pasta."}
{"text":"WHAT THE HELL HAPPENED TO THIS PLACE? New ownership and it went downhill, that's what! The older husband and wife sold out and the new owners don't have a clue.  Came in and noticed decor was gone and it was bare looking. We were greeted by a 'host' who was a guy with unkept below shoulder hair wearing camo shorts and a wrinkled shirt. Acted like he was stoned. I couldn't believe any restaurant would have a host or server that presented themselves like that. We were seated, got our drink orders and then no waiter for 15 mins. We called someone over and placed our food order. It came out WRONG. Like COMPLETELY WRONG. And the delicious soft bread the used to serve is no more - not even offered.  The food was so-so. Pizza was burned black on the bottom and no flavor. Pasta was meh. Meatballs were mush.  Overheard waiter and cook using foul language in the kitchen.  Just terrible. This was such a great spot. Never again."}
{"text":"Really good experience, ate there last night and had a little wait but overall great food, great service. We will be back!"}
{"text":"Awesome authentic Italian food.  This place is a hidden gem. It is a total joke in the wall and it is well worth the trip.  We went with the chicken Marsala and the rigatoni sausage and mushroom. Both were outstanding to say the least.  The tiramisu is to die for if you can save room for desert.  The staff and owner is super friendly.  Had a 20 min conversation w him and it was like we had been friends for years.  This is a must try"}
{"text":"This cute little restaurant is quite good. I have eaten here half a dozen times, and will definitely return soon. I love the meatballs, and the pasta dishes, next time I will try a pizza. Check out this place, you will not be diappointed"}
{"text":"Food was on the cold side and tasted like it had been reheated... Ordered chicken marsala and got chicken in a bunch of watery sauce. Prob will not visit here again."}
{"text":"Andrew, thank you for a nice evening. You worked your culo off tonight! Great service my friend and the food... the Chicken Marsala, Chicken Parmigiana, Spaghetti and Meatballs! ...and the Louis Martini Cabernet was all amazing! My personal favorite is the Chicken Marsala... the best I've tasted, in my 58 young years. Kim, the new location is perfect... and you've been open only two weeks?! Bravo! Bravo!"}
{"text":"Great family owned restaurant which we happen to come across excellent lunch menu very reasonably priced will be definitely coming back to see them with the whole family"}
{"text":"My friend and I decided to come here a few days ago since: 1. I had never been and 2. she hadn't been in a while. When we go there, the venue was very small, and we had to move the table forward so we could both sit comfortably (I'm 6'8\").  The waiter was very professional, which was nice to see. He was able to accommodate my friends tomato allergies and make suggestions around it as well. We looked at the menu and almost everything was at least $14. Luckily, we had gotten there around lunch time, so we were able to chose from a menu of $8. Unfortunately, there is no substitutions on that menu, so my friend could only goose from two dishes.   I asked the waiter what the portions were like for the lunch menu, and he said that they were just a smidgen smaller than the dinner plate. We both ordered our drinks and food, and that's when we got bamboozled. They added $3 for the chicken in my chicken Alfredo, and when I asked for caesar dressing, they wanted to up charge me another $2. I said no, so we waited for our meals. My coke was pretty flat, so I was already in a sour mood about that. When the chicken Alfredo got there, it was 40% pasta and 60% sauce. The chicken tasted off and was very watery. We wanted to get dessert, but the next time we saw the waiter, he brought us our check instead of asking about dessert. We took that as a sign and went elsewhere.   Overall: 1 star for atmosphere, 1 star for waiter experience, 1 star for allergy accommodations, -1 star for price/up charging, -1 star for food quality. I probably would not come here again unless I had too, and I probably would not recommend it to anyone else."}
{"text":"Wow!  If this wasn't such a small restaurant I would have to give it 5 stars, but the food is worth waiting for.  And on most nights you will wait.  I had the Portabella Mushroom Ravioli with the red pepper sauce, Mom had the scampi with was also great.  I can't remember what the others had but we were all delighted.  Not a great fan of their pizza which promises to be \"New York\" style but is too dry in the crust for my NY tastes.  Go - you won't be disappointed."}
{"text":"I really thought I had posted a review for Buon Gusto, but Yelp is telling me no..  Let's get this fact out there right now, Buon Gusto is one of those restaurants I would happily drive a couple of hours to go eat at, it is that good.   Every now and again we foodies run across a hole in the wall that is so good, we really shouldn't post about it on Yelp, just in case the crowds get to big, well Buon Gusto is one of those places.  We have eaten there probably once a month for the last 6 months, the food is good, no scratch that, the food is superb, the service is good, the prices are a steal.  Now, the big thing, this is a New York Italian joint, my wife orders the Chicken Marsala (the best she has had she claims) but I go for the pizza, why ? Because it is the best in Vegas, pure and simple, I love pizza and this joint puts out a pie that I would happily compare to any that I ate in new York.  Oh, lastly, if you are still hungry, try the tiramisu, OMG, it is to die for."}
{"text":"Thank you Buon Gusto this is the best  chicken picccata I have had since we have been here... I thought it was hoing to be diffrent w/o linguini noodles but the penne was just enough... Delicious.  THX U KIMBERLY!!!"}
{"text":"We've been coming here for 9 years.  But I am concerned for the future of this restaurant based on our dining experience last week after the new owner had officially taken charge for over a month.  Apparently you need to be a \"friend\" for him to even stop to say a word to you.  The food was very good, everything was the same as previous owners' menu except the salad no longer had artichokes.  Already cutting food costs.  Very slow night with something \"not working\" in kitchen.  And check seemed high for what we had.  Servers were very stressed and we left all stressed out.    I think we'll stick to take out.  The pizza was $4 higher for dine-in than take-out."}
{"text":"Was craving a super basic but NY style cheese pizza.  The pizza at Buon Gusto was on point!!  The crust was perfect and they used the perfect blend of cheeses.  We also ordered an antipasto salad with oil and vinegar dressing and the dressing was so good my husband drank what was left on his plate!!!  Will definitely be coming back for more!"}
{"text":"Watery mush, that's what we got for take-out. I understand cooking gluten-free can be a little challenging but you don't serve food to someone that looks like this. No excuse. Truly disgusting and overcooked pasta with water as a \"marsala sauce.\" The only reason they got 2 stars instead of one was the good customer service from the manager Kimberly when I called to complain about our meal, she refunded our money and apologized for the disappointing meal but the damage was done. You should do some quality control on the kitchen before sending food like this home with someone. We won't be back."}
{"text":"We enjoyed an authentic New York Italian dinner at this small family owned  restaurant. Dinner began with hot, fresh french bread and soup or salad. The house dressing is great!. The fresh, homemade, red sauce was amazing!  We waited 20 minutes to get a table because it is so small and very busy. The delicious food more than made up for the wait. We ordered a meat pizza, white pizza, eggplant and baked ziti.  Portions are generous and the service was excellent. This would be a great place to order take out too!"}
{"text":"Pleasant experience, went for lunch. Mixed clientel. Local and Business people. Friendly and cozy. Manager and waiter Randy was very helpful and had a great sense of humor. Chef Chris came out and gave some recommendations. Had the Lemon chicken. Light , delicious and elegant tasting. Sauvignon Blanc was perfectly temperatured. Desert,  (had one each) , very good. Walked out as a happy camper. Life is large here."}
{"text":"We tried the new location tonight in Anthem Village.  The lasagna was awesome and the chicken piccata was unbelievable.  Our server Drilon was very attentive. We will be back soon!"}
{"text":"Well we're do I start.     Ordered a large pie cheese nothing out of the norm and fried raviolis.   The pie took over an hour and it was not like the place was packed.   Very unorganized and the older gentleman with grey hair and a pony tail has the worst attitude.   Won't smile actually looks like he wants to hurt someone.   Food was mediocre nothing to talk about"}
{"text":"This little hole in the wall packs some big taste. We came to this family-owned Italian restaurant to celebrate our friends' engagement.  They are regulars and said we'd love the food; they were right.  We were greeted warmly and informed that the food would take a bit longer due to a large catering order that the kitchen was also cooking.  No matter since it didn't seem like much of a delay at all.  We enjoyed bread, dinner salads, and conversation before our main courses arrived.  I had the chicken marsala and it was a generous helping of three pieces of moist chicken with a very tasty sauce and lots of mushrooms; I highly recommend this dish!  Believe it or not, I didn't have any pasta, but my friend's spaghetti and meatballs looked delicious.  I love little hole-in-the-wall places like this over a chain restaurant any day. The service is friendly and the food is good. PS-our friends are having Buon Gusto cater their wedding reception, which means I get more chicken marsala tonight--grazie!"}
{"text":"Very disappointing. Atmosphere was great. Old Italian music playing. Looked fun and great. That is where it ended. Our server said she was new and couldn't answer basic questions about the food. I ordered a sweet tea and received a raspberry iced tea. Then someone came by to refill my tea and refilled it with unsweetened tea. Hmmmm Dinner comes with salad and bread. Bread was very good. Nice oil and vinegar dip. Salad left us wondering what the hell?? Just really nothing to it. Just boring Entrees=Spaghetti and Meatballs and Baked Penne Pasta with Meatballs. The sauce they use is sweet and tomatoey. Yech. Just not very good. Meatballs were full of herbs that overpowered the flavor. Big size too much herbal flavor. Will keep looking. Must be affordable great Italian food somewhere in this towm"}
{"text":"*UPDATED REVIEW Very upset how our meal was dealt with. My family placed an order to go for chicken Marsala and champagne chicken. They told us it would take 40 minutes. When my dad went in to pick up the food they told us him that don't have champagne chicken anymore (something they didn't mention on the phone when the order was placed 40 minutes earlier). My dad asked what they made instead and then he found out that the gentleman who took our order never actually placed it to be made so nothing was prepared. They told my dad it they could make the chicken Marsala, because it would only take \"5 minutes.\" They were unapologetic for their error and didn't even take responsibility. You would think that people who take orders would know what they do and do not have on their menu. Really sad to give them one star.   I have always had a soft spot in my head for Buon Gusto. I grew up eating their pizza every now and then and it was always fantastic. I even love it now as I've grown. The only thing that is making me not give it 5 stars is that they did have a change in either ownership/management. Since then I've noticed the quality and the service isn't 100% there. Right after the merge I remember waiting an hour for our meals. Another time they messed up an order 3 times. And once they even forgot to put mushrooms in a chicken marsala dish. I know that some of these things may sound like final straws, but I've had the patience to stick to this restaurant. I feel like if those who are there now really become passionate about the place it can be restored to the same quality it was at before.  I would still recommend it to anyone; it may just be a hit or miss."}
{"text":"LOVE IT!! This is really my kind of place - near my house, great food and what you may consider a \"hole in the wall.\"  There are maybe only 8 tables, so be prepared to wait if it's busy. Luckily, we were there on a Tuesday night and it was pretty slow. We were immediately seated and given some time to look over the menu.  Our server was a bit awkward, but it's no big deal. You really get your money's worth here - I ordered the chicken piccata, which may have been some of the best I've ever had. To start, we were served fresh out of the oven baked bread with oil and vinegar. Then we had a really good starter salad. I was surprised at the quality of this salad - the lettuce was crisp and fresh, they added artichoke hearts, cheese, tomatoes, etc.   Along with your entree, you get a choice of pasta with either marinara or garlic and oil. It wasn't too big of a portion and was a perfect complement to my meal. The flavor of the wine sauce and the chicken was fantastic! I took home leftovers, which I had in my lunch at work the next day and everyone was very jealous.   It was so good, and very reasonably priced and I can't wait to go back!! It was a perfect date night."}
{"text":"I ordered food from this restaurant for my family on Saturday, August 6th.  The tortellini with a cream tomato sauce was inedible so it was thrown away, I requested angel hair pasta with the chicken masala and they didn't include it, the stuffed mushrooms were cold and tasted fishy, and the antipasto was a joke...sliced deli meat on top of lettuce!!!  They say never say never?  I'm saying never.  I will NEVER patronize this restaurant again."}
{"text":"A small mom and pop restaurant that has amazing Italian food and exceptional service. It's a little small so you may have to wait but I have to say I have not had anything bad here. I know that's a broad statement but it's true and there's not much more to add that others haven't already commented on. (By the way the sausage and mushroom rigatoni and chicken franchese are worth eating all the time, even if it will force me to keep my shirt on at the pool] I would absolutely put it in my top 3 Italian restaurants in the city."}
{"text":"I NEVER write a review but this place is amazing one I'm from NY and it reminded me of home! AJ was our waiter and he was amazing he was funny made great recommendations I had the chicken Marsala and it was one of the best that I have ever had I also had dessert- bread pudding was amazing as well all and all service was on point! I will definitely be back!"}
{"text":"I had the chicken marsala linguini excellent and tge Itialian wedding soup was delicious."}
{"text":"Tried this place for the first time after hearing it was good. ..I came in around lunch time and the place was empty. I picked up penne alla vodka to go. It was super watery and had no flavor. The full portion actually looked like a lunch portion. And for $15 including a salad, it was not worth it. This place may have been delicious back in the day, but don't waste your time."}
{"text":"One of our favorite italian restaurants.  We've been coming here for years.   Love the sausage rigatoni in cream sauce.   Fresh bread to dip in the oil and balsamic while waiting for your food.  Always have enough pasta leftover for 1-2 meals."}
{"text":"Let me start by saying that ever since living in Italy I am extremely picky about Italian food. But, Buon Gusto shines every time. It is a small family run New York style Italian restaurant. The place is tiny, so expect to wait for a table, sometimes up to 30 minutes. Don't worry the food is well worth the wait. They always start you off with warm bread and an olive oil and balsamic dipping sauce. It is perfection, especially after the wait. Your dish will also come with soup or a salad. They have 2 homemade dressings, a delicious ranch and a house oil and balsamic dressing that is fantastic. You can't go wrong either way, but I love to dip my bread in the house dressing. Yum! I have tried quite a few dishes, but here are some of the highlights:  I am in love with the sausage and mushroom rigatoni. It is tossed in a creamy tomato based sauce and just so delicious. You won't ever regret ordering this, trust me.  They make a mean baked ziti as well, their signature pasta sauce is just delicious. You definitely want the sausage, as the meatballs are lacking in flavor.   They also have fantastic thin crust pizza's! I have tried both the California white pizza and Steve's cattleman and they were great. I love white pizza and the California definitely hit the spot. But, they also make a fabulous red sauce so be sure to try that as well. The individual size is perfect for one.  Overall, you will not regret a visit to this small mom and pop shop. The food is delicious and the service is always on point."}
{"text":"The crab stuffed mushrooms. I burned my mouth eating them. It was AMAZING!!!! Then the pizza half pep/saus the other half just pepperoni. The crust was light and airy. They changed it. I could have sworn they had a hint of garlic throughout the crust. Where you could just eat the crust with some of their ranch. Which was made in house. Not too sure he it was now. Still good still ate it. But yeah. Check it out though."}
{"text":"I like the food at this locals place but it was crowded the wait for the table was short but the food took over an hour to come out of the kitchen Food was good but I am not sure why there was a long wait. So if it's crowded leave"}
{"text":"My new fav spot for Italian! Huge portions, great prices and everything was delish. The pizza dough is shipped in from New York and stretched by hand.  I got it with big strips of proscuitto mmmm.  Sausage mushroom rigatoni w tomato cream sauce was similar to what I've had at other places but at a fraction of the price. The calamari wasn't the best I've ever had as I read in other reviews but it was really tender and yum.  Can't wait to go back to try other things from their menu."}
{"text":"Tiny little old school Italian joint with amazing service and classic food. The great folks keeping this place going have a strong work ethic and superior customer service. Take out or dine in, it's a wonderful meal. Try the lobster ravioli or the Italian Wedding Soup, but everything is good!"}
{"text":"Once again Buon Gusto netted 4-1/2 stars overall after a dinner service.  This time my party of four initially had a long wait for water and butter, but service was otherwise first rate.  Veal Marsala with mushrooms and Marsala Wine Sauce yielded a fine veal entree, except our server reported that the kitchen ran out of veal after fulfilling one order.  So Diane sacrificed, and ordered a different dish.    Chicken Fricasse was a very good soup of the day, paired with fresh Italian Bread.  A Caesar Salad tasted good.  And Spaghetti with Bolognese Sauce and Mushrooms came out fine.  No aioli was available, so we did not order Calamari Fritti this time.  Chocolate and Pistachio Gelati were very good but the Salted Caramel Gelato tasted saltier than I would have preferred.  A special advertised Yelp check in discount of 50% off a second entrée was graciously honored on the spot."}
{"text":"I was never an Italian Food Lover until I started coming to this place about a year ago when Steve and his wife owned it.  They are great people!  This restaurant has new owners as of the beginning of the year and it has taken them a few months to settle in.  They did try changing a few of the recipes which was not in their favor.  They have now gone back to the original recipes and as of last night, I swear they have enhanced them in the best way possible!  Everything was absolutely tasty!  My favorite dish (the only one I eat) is the Chef's Cisco Style eggplant!  It is incredible in my opinion however I have never eaten eggplant at any other Italian restaurant.  The flavors of this dish are incredible!  I love all the garlic they use on their dishes!!  Their balsamic vinaigrette is so incredible it makes me want to lick my plate when my salad is gone but instead I use my bread to soak it up so I don't embarrass my husband!  They do offer Gluten Free products which most people don't know."}
{"text":"Their pizza is thin crust, cooked well done, which makes it nice and crispy.  We ordered the Bronze bomber that had the usual meats, pepperoni, sausage, meatballs and good amount of the regular vegetable and peppers.  This was a perfect pizza with 3 different sizes to choose from depending on your hunger level.  My husband ordered the chicken cacciatore, that is pounded thin, again with onion pepper and smothered in Sicilian red sauce.  Super tender, with a familiar Italian fennel taste to the meal.  Add a side of spaghetti for $2.95.    The warm baguette style bread is baked fresh and comes out super soft and irresistible.  The bread is paired with their chopped garlic, olive oil and of course red vinegar.  The garlic permeated the dipping sauce and that's why it was so addictive.    The ambiance is nothing to write home to.  It feels like a super outdated, casual place that you wouldn't expect from the exterior.  I'm surprised they have outdoor seating, which is unusually located just a step away from the parking lot.    The prices are not the most competitive, but the meal was memorable for us."}
{"text":"This one is tough for me. Its more like 2.5 stars but since our waiter was so great and it was a packed Friday night I will give them 3 stars. We arrived about 5:30 and it was starting to fill up, by 6 all the tables were full.   We started off with the artichokes italiano. Sauteed artichokes with pancetta, wine and garlic. I really liked this dish, and served with warm bread it was very good. For our entrees our waiter recommended the sausage and mushroom rigatoni which came with a house salad. After waiting about 15-20 minutes the salads arrived. Very small and bland. Just a little bit of lettuce, 2 pieces of tomato and a couple slices of small olives. The blue cheese dressing was bland.   After another 15 minutes or so the entrees arrived. It was just OK. The rigatoni was well cooked and the tomato cream sauce was pretty good, nothing great though. I didn't care for the sausage at all. It was like sliced links and not ground sausage, and there wasn't that much in the dish.   I would like to return during the week and  give them another try. Our waiter was very nice, although the service was terribly slow. Again my quest for great Italian food will continue on!"}
{"text":"I love good Italian food. I love small, secluded, family run businesses. So, I had no choice but to fall in love with Buon Gusto's. May father brought me here to try the Philly Cheesesteak. It was the best I have ever had this side of the Mississippi. We went back with some friends and tried several dishes, all of which were delicious. Most recently, I had the Buon Gusto chick bowl, a bowl of grilled veggies with diced chicken and a sauce. It also came with a salad (or soup) and a side of pasta. I loved it! There was enough food to take some home for lunch.  Give them a shot and say hi to Steve for me."}
{"text":"Went in to use my buy one get one 50% off.  No soup, waitress on the very green side and one little misstep after another not a great experience including having my card run twice due to forgetting to run my discount.    Call us former regulars"}
{"text":"I'm going to make this short and sweet, due to the fact that I don't feel a need to put any more thought or effort into this horrible establishment.   Pros:   The party napkins were a nice shade of red that appealed to the eyes.   Cons:  Service Dining Experience  Soup was terrible and cold My mom makes better meatballs and she's a vegetarian  Food order was completely wrong  Restaurant doesn't know the difference between ziti and penne  Total lack of knowledge from staff Low quality taste in food    So many more negative thoughts on this place. Just want the owners to know they ruined a much needed family dinner, and that I will never be coming back nor recommend this place to anyone."}
{"text":"I found this place in my entertainment book and it has a good deal so i said it's worth trying and to my surprise this hole in the wall family restaurant is good. Home made bread is good and the crab stuffed mushroom is great. We ordered the Linguini del mar and Lemon chicken for dinner and both of them is really good. Renee our server is so friendly and accommodating too."}
{"text":"After an afternoon of shopping, my friend and I were famished and decided to try Buon Gusto for dinner since we had a coupon.   We walked in at 8pm and it took some time to get seated since it's a pretty small place. We were finally seated and our waitress took our drink order.   I ordered the baked ziti Siciliano and the Italian wedding soup. Our order took a pretty long time coming out and after about 20 minutes of waiting the waitress came out to let us know that she was sorry for the wait since they had apparently closed down the kitchen without letting her know and that they had to start it all up again to cook our orders and that of another table that came in before us. I'm a little surprised and disappointed that they decided to close down the kitchen a good hour before they were scheduled to close. Seems like a bad business practice.   If we had known that the kitchen was closed, we would have found another place to eat, but after waiting so long we figured we might as well wait it out.   The soup was lukewarm, not surprising after hearing about the kitchen snafu. Our entrees finally came out and they were decent. My pasta was good and I enjoyed the sauce quite a bit. The eggplant was overcooked and had an unappealing texture.  Our server was sweet and she kept an upbeat attitude despite all the shenanigans that seemed to be going on in he kitchen. The kitchen staff seemed to be playing around and more focused on wanting to leave for the evening, which made us uncomfortable and we ended up rushing through our meal to leave.  I see this being a decent spot for take out, but try not to come by too close to closing time."}
{"text":"This is the real deal Italian food.   I never thought that after living in providence, ri there would be a place for vodka penne anywhere else......I was wrong.  These people know Italian.  It's authentic comfort Italian food.   The staff is amazingly charming and friendly.   They love to discussing their art....and yes this food is art.   Bravo!  If you have a hangover, come here!!!  The food will be mothers milk to your tummy."}
{"text":"Maybe I came on an off day, but I've been here for 40 minutes without my food. When my spaghetti arrives, it tastes good -but not worth the extremely long wait. The food tasted fine for the price but the wait is what killed it. Felt a little ignored as far as service went even though only two other couples were in the store and they only had 1 call in order."}
{"text":"To start, they bring you out fresh baked bread with garlic and olive oil for dipping - our bread was slightly undercooked but it is by far the best bread we've been served at a restaurant in Vegas so far.  We got the Sicilian Eggplant Appetizer - definitely a PASS.  Terribly mushy and nothing like delicious Sicilian eggplant we've had in the past.  The salad that came with my dinner was a large helping and good.  For entrees, I got the Chicken Angelo and my husband got a personal size pepperoni and pepper pizza.  Both were VERY good.  My chicken was tender and the wine sauce was delicious.  My husband's pizza was thin, crispy and cooked perfectly.  The rating really goes down a star because of the service.  The kitchen was almost chaotic and there weren't many people in the restaurant yet.  We could hear the chef in the back BEATING the heck out of my chicken - it was very loud, went on for quite a while and made it a little awkward in the dining area for the patrons trying to carry on conversations.  My dinner came out not too long after the beating stopped, so that's how we deciphered it was actually my chicken (which was very good, but my goodness!).  My dinner also came out long before my husband's and we could see the waiter standing by the oven cooking the pizza.  I guess because we ordered such different items it happened that way?  The other 2 tables in the restaurant both had their orders screwed up.  One table behind us had their food come out immediately after they were brought their salad - they were at a small 2-person table that only fits 1 dish each so they immediately handed up their salads and said, \"I guess we won't be needing these anymore!\"  Also, as a final note, the ambience is a little overdone.  At first, it seems like a nice dimly lit place but then when you try to read the menu, it's pretty ridiculous.  The menu you see on their website is the same menu they give you in print - a fancy designed tan background with somewhat small print.  We both found it REALLY hard to read in the dim light and we both have perfect reading vision.  Overall, it was OK but we won't be back with so many other choices for Italian food in the area."}
