{"text":"Don't get turned off because it's in a strip mall. The food is definitely better than a lot of restaurants in Little Italy in NYC.  It's a neighborhood gem!"}
{"text":"A quaint little restaurant conveniently located in Murrysville.  The owners came to our table throughout the meal checking on our dishes and our satisfaction.  The food was very good as were the deserts.  The meal started with in-house made bread. WOW.  We then had edemame. The red snapper was the best ever. Additional dishes included scallops and crab cakes, polenta and eggplant.  Dessert was tirimasu and canolis.  The service was excellent throughout the meal.  I will definitely dine here again."}
{"text":"Amazing Italian food! Restaurant is small and seating is cramped and the service can be a little slow (in true Italian style). They also do not have a liquor license so it is BYOB. With all that said have eaten their food 3 times in the last month."}
{"text":"This is a hidden treasure in Murrysville. I went to this restaurant when it was located in Plum. The food is outstanding. The meatballs are delicious. The chicken Romano was so tender. I love the eggplant..it is my favorite. The owners make you feel like family. I love them.Angelina is the sweetest woman you will ever meet!"}
{"text":"Great food , very nice staff, been going there from the 1st day they open !"}
{"text":"Best Italian restaurant in Pittsburgh. Like walking in to your grandmothers kitchen preparing an amazing meal just for you. Very personable staff, amazing food, and a very cool vibe...go here immediately!"}
{"text":"Food was excellent.   Staff was friendly and we had a nice conversation with the owner."}
{"text":"Terrific food. Pasta, tomato sauce, veal parm all great. Owner, wife and at least one son run the place. Byob. Lacks \"polish\" ie appetizer quickly followed by soup and salads with no busing of table first. I felt rushed but I am definitely going back"}
{"text":"Not sure what the food tastes like waited hour for them to open. Was turned away because we did not have reservations. There was only 2 other couples in the place. REALLY"}
{"text":"The only thing remarkable about this place is the price. There is no value in mediocre food at a premium price. Will not go back."}
{"text":"Quite competent Italian restaurant with BYOB.  My second time eating there with consistent food and service.  Appetizers of prosciutto and melon, and meatballs, were good; main dishes of eggplant parmesan, veal parmesan, and lasagna, were all very good. The pasta that comes on the side with some of the dishes was cooked al dente with good sauce.  The salad and homemade dressing were very good.  The proprietors are very nice, friendly, and sincerely want to make sure you enjoy your meal.  This restaurant is very good value and worth repeating."}
{"text":"Best Italian restaurant in Westmoreland county.  Angela's recipes must be more valuable than gold.   High quality, very friendly, and awesome food."}
{"text":"Food is very good but way over priced. After several visits over the years we still find the wait staff to be in-attentive and without much training."}
{"text":"Excellent food and service here!! I had not heard of this restaurant but was given a gift card for Christmas. They have been open for 5 years and all homemade pasta and fresh bread. We met the owner Angela and she was super friendly. I had the special tonight which was lobster tail and my husband had the veal parmigiana. Both dinners were incredible!! Dinners come with 2 sides so we had pasta and salad and the dressing should be bottled it's that good. We will definitely be back!! Oh and it's BYOB."}
{"text":"After reading the reviews, my expectations were high and I was . . . disappointed.  This is a restaurant with an identy crisis . . . is it a pizza shop or an Italian restaurant?  

We arrived on time for our reservation to find nowhere to wait for our table.  Patrons have to wait in their cars.  Our table was jammed halfway under a counter on one side and directly in the path of passersby on the other.  The bright florescent lighting and lack of music (basketball on TV instead) did nothing to create ambiance.  Service is slow and confused.

We ordered the antipasta plate and stuffed banana peppers for appetizers.  Aside from the prusciutto, the antipasta was ho-hum.  The peppers were very undercooked and still hard.  The bread is delicious, however, although we had to beg for dipping oil.  The dinner salads were OK, but the house dressing was a little too acidic.  For entrees, we had crabcakes and veal picatta.  Clearly very high quality ingredients were shamefully not well prepared.  The crabcakes (actually balls) were made with too much breading and were overcooked.  The picatta was way too heavy on the lemon and too light on the capers and white wine.  The side pasta was the highlight of the meal.  The pasta was al dente perfection and the tomato sauce was extremely fresh and flavorful.  Everything lacked presentation.  For instance, the picatta was five pieces of veal on a plate with sauce poured over it.  No style, no garnishment, just thrown on a plate.

This was an not an inexpensive meal ($100 for two) and definitely not worth it.  Might try the pizza (take out), but not likely to return for dinner."}
{"text":"Love it!! I had the Veal w/gnocchi and it was fabulous! The veal was so tender I just cut it with my fork, the gnocchi was done to perfection!  I've tried the Vodka and Bolognese sauce! Both are fantastic!  The meatballs are wonderful, the chicken Piccata, the Cavatelli, and the homemade pasta are excellent  dishes too!  Lasagna is next on my list!  It's my new favorite,  just good Italian food and good people running it!  Our service was great! Oh, the cheesecake was also excellent! Good old Italian homestyle food!"}
{"text":"Food was excellent    Chicken Parm and Chicken Marsala was tops.  Had to try the Pizza so ordered it for home.   Wow I'll be back !!! Excellent"}
{"text":"This is a very good restaurant for sure.  Nice Italian food (the complementary bread is maybe one of the best I had in the US) and good service.  The antipasto is great as well, while the cheese ravioli are fresh and tasty! The place is small so you have to make sure that you make reservations beforehand or be prepared to wait for a long time! All-in-all I would definitely go back again if I am around the area!"}
{"text":"We went to dinner here last night to celebrate my husband's birthday.  Since the actual day fell on a Tuesday we weren't up to traveling too far or being out too late yet still wanted something unique that was not a chain or chain like restaurant.  I have seen this place over the years as it is located in the same plaza as the Shop n' Save but never tried it.  I wasn't able to confirm reservations since they are closed Sunday and Mondays, and don't open until 5 pm during the week, and his birthday was on a Tuesday.  I sent an email but didn't receive a reply so I was anxious about going without a confirmed reservation.  Luckily when we arrived we were they were accommodating and sat us quickly.  The place is small, only about ten or so tables, and they were moderately busy.  I recommend making a reservation.

They are BYOB which has its ups and downs in my humble opinion.  They charge $8.00 as a corkage fee.  So for us that made my moderately priced $12 bottle now $20.00.  I think the price is outrageous especially for a small party, when all they did was provide glasses and the waiter didn't even have to pop the cork as this bottle was a twist off.  Twist off fee anyone?  Needs to be lowered.

Our waiter was extremely attentive as well as informative, though I was a little confused on his explanation of the pastas.  At first he said all were homemade (in house) as was the different sauces or gravies have you, but some were imported from Italy.  He brought us some homemade bread which typically I wouldn't partake in but I was intrigued and it was warm and chewy, a great bread.

Upon ordering I went with the mussels which is advertised as an appetizer, but I found the portion to be satisfying if you aren't super hungry.  Matt went with the chicken parm, and two sides.  He chose the pasta and asked for spaghetti.  The sides were marked Penne but the waiter easily made the substitution but informed us it was just the standard spaghetti unless he wanted the up charge of the homemade.  This struck me as confusing again back to the original explanation, is it imported from Italy or purchased at Giant Eagle.  This really confused me, but he chose the standard.  

Our wait was a tad long but we weren't in any rush and enjoyed our wine while we waited.  The food was delivered and we dug in.  My mussels were solid 4 out of 5.  The broth was a white wine, garlic and lemon sauce.  It was good, but heavy on the lemon (which was ok for me, but maybe not others) and definitely a little heavy with the butter.  The mussels tasted fresh and I was pleased.  I used the bread to sop up some broth though I could only eat so much before it became too rich.  I tried Matt's marinara on his pasta and did not care for it.  I found it watery and bland.  He seemed to enjoy it and I will let him detail it in his own review.  Lastly we ordered a piece of Tiramisu.  The waiter brought out 2 forks, and though I tried and thought it was quite good, the piece was intended for the Birthday guy.  The owner often stopped at our table asking us if we needed anything and if everything was good, so service was standout excellent.  Very warm and attentive.  The prices were a little high for some dishes but overall a very positive dining experience."}
{"text":"What a great surprise this is in the tiny strip mall it sits in!  A true gem of an Italian restaurant!

Terrific food and generous portions, plus a friendly owner and family make this a true, old-world Italian, dining experience.  It's BYOB, but not to worry - as the liquor store sits a few paces away should you want some wine or spirit to accompany the meal.

This place will go toe to toe with any of the top Italian restaurants in the REGION and I'm not kidding.  Fresh, homemade bread and pastas, plus some delicious entrees make this a winner!  The eggplant parmesan was sliced thin and layered to perfection...the ravioli's were full of flavor...and the sauce reminded me of my grandma's!  Can you tell I sampled multiple plates at the table?  Even my kid's macaroni and cheese was out of sight!

Not to mention, it's always fun to break out the Italian and talk shop with folks every now and then.  Molto bene!  Molto delicioso!  Can't wait to go back!"}
{"text":"Cannot say enough good about this place. Roberto, Claudio, and the gang truly make you feel at home. I have yet to leave without a hug from the mother (owner). Great appetizers, pasta is some of the best you'll find anywhere (I personally can't pass up the Gnocchi w/ vodka sauce.) Unlimited bread, and BYOB are icing on the cake."}
{"text":"A genuine Italian restaurant no questions asked. They treat you like family. The food is great no matter what you get and you get more then you expect too. Don't be fooled by the small venue, the inside is very nice. It is also BYOB."}
{"text":"We'll definitely return to this terrific  BYOB Italian restaurant where we were treated like family! Delicious Meatball appetizer offered on the house was just the start of a great dining experience. Crab cakes, lasagne, salmon, and tuna in generous portions were all very good! The whole family made us feel very welcome!"}
{"text":"So based on the Yelp reviews, I ventured into this establishment.  My 3 Star rating is solely based on the family that runs it.  Great people!  Great attitude and service.

The food is actually mediocre at best, not really what I expected after the stellar reviews on Yelp.  Breaking it down:

BYOB - no problem, brought a great bottle

Table bread - excellent and flavorful, would have rocked had it not been served cold

Appetizer - cheese wheel, again very very good with a nice marinara to dip it in

Wedding Soup - over the top bland and unimpressive

Veal Parmesan -  See my pic.  Veal was really over breaded and over fried.  the sauce was sparse with very little cheese.  the noodles were mushy.  the sauce was watered down.  not much sauce or cheese on top.  For the record, it was not bad, just average.  I added salt, pepper and grated parmesan in picture.

One Yelper said the portions were generous, I think my pic disputes that claim.  The restaurant does NOT have that old skool Italian feel like another Yelper mentioned.  It is small and very bright, not dim and dark - usually a candle on table like the traditional Italian restaurants have.   Also, I asked for grated parmesan, it was brought it a pizza style shaker jar."}
{"text":"Service a little slow , prices a bit high, portions are small. Not a good value. BYOB charge pricey. Claustrophobic dining area. I won't return. 
Better values at other nearby places."}
{"text":"This place never ceases to impress us. Literally one of the best restaurants we've ever eaten at... no just in Pittsburgh but anywhere. Excellent sevice, incredible food and an awesome relaxing environment, highly recommend checking it out. Wonderful owners and a very accommodating staff make this a can't miss for us."}
{"text":"Friday night, my boyfriend and I decided to try it without a reservation.  They squeezed us into a little table and I'm so glad they did!  Table bread - delicious.  Served with Land O Lakes butter. Edamame appetizer was delicious, too.  Homemade spaghetti with pomodoro sauce was really good - al dente- not a huge portion, but enough.  My boyfriend really liked his cavatilli with vodka sauce, too.  Service was great - very friendly staff.  Definitely going back!!!"}
{"text":"My guest was dressed in street clothes and a camo jacket.   We approached the hostess and politely asked to be seated for dinner.   We were told the wait would be 15 minutes though there were at least three empty tables and all chairs at the bar unoccupied.   There is no waiting area in this place.    
     It was clear to both of us that we were not welcome because of our dress.  If there is a dress code management should make that known.   Too bad because we wanted to try this place. But never again.  
     We left and dined next door at a place called \"Crave.\"  The folks working at Crave seated us immediately though the place was packed, and made us feel welcome right off."}
{"text":"Wow what a fantastic place.  Visited Buon Cibo via a referral from a friend.  It truly has been the most pleasant dining experience I have had in a long time. The food was fab and the staff of the restaurant was extremely friendly and kind. I felt like I was in my relatives kitchen. I had the chx Marsala with the homemade side of pasta. The salad was crisp and fresh. Angela's tiramisu was fantastic. I am a believer in this place it is the best around.  I will be there often."}
{"text":"I am Italian and grew up on amazing Italian cooking so I am very picky with Italian food. I can honestly say finally a great Italian restaurant in Plum/Monroeville/Penn Hills area!!! The food here is amazing and comes highly recommended. The only restaurant in the area that serves cavatelli and EXCELLENT SAUCE.  For those of you who do not know what a cavatelli is go and try them immediately. We went with a party of 6 and everyone was equally impressed. Pizza was great, chicken excellent, the only chicken picatta I have ever liked, and crab cakes amazing (as good as if not better than Monterey). This deserves no less than 5 stars! Go get some great Italian cooking you won't be disappoineted."}
{"text":"First time trying Buon Cibo with a group of us (party of 9.) had reservations on a Tuesday and good thing because it's small but the place was packed! 
It was great from the hostess/ waitress,  decor, to the food. 
The owners came up to our table and we're very nice and welcoming. Our waitress Katie was awesome she answered all of our questions and was a great server. 
It's BYOB. Which is a plus. 
Literally everything was excellent and you can tell the dishes were all homemade and done with passion. 
I'm not a red sauce person because I'm so picky about it, but I had the traditional sauce with the fettuccine noodle and  a meatball it was delicious! If you're looking for a homemade cozy real Italian place this is it!"}
{"text":"We went there last night. Had a great time. Had great food. I loved their cheese ravioli and tried their lobster tail. Very very good   We love the atmosphere. Owners walk around all night talking to tables. Felt like we were family. Did not feel rushed   Appetizers pizza roll. A Small is huge and fantastic best pizza roll I have ever had 
Highly recommend"}
{"text":"Went here for a dinner with family and loved it. The food was terrific, and spanned every option from veal to pepperoni rolls. (Protip: Get at least one pepperoni roll as an appetizer; best I've ever had). The family that runs it is super friendly, and that friendliness extends throughout all the staff.

Wonderful home-style restaurant, and I'll be coming back soon."}
{"text":"My wife and I came here with a group of friends over the holiday.  The food was pretty good.  I had Cavatelli, which is made fresh and I would recommend over the eggplant parm, which my wife had.  I did a meatball with mine, which I also say is a must add.

The place is really small, but the staff is exceptional and very friendly and accommodating."}
{"text":"My wife brought me here for my birthday on a Tuesday night around 8pm.  Looking at the reviews and tips about this place they say you should call for a reservation ahead of time because it's a small restaurant.  My wife did call the day before but nobody got back to her so we just walked in hoping that it wouldn't be busy.
 
     When we walked in it was half full and a little busy.  It is a small restaurant.   We waited just outside the front door for somebody to greet us.  We saw that they did have a bar with a TV so we could have walked up there to sit but since it was my birthday we wanted a table if we could get one.  The waiter came up to us and asked if we had a reservation.  My wife said she did call but nobody got back to her.  He apologized and went to the back to see if they had space for us.  What looked like the owner a nice older gentlemen came up to us and asked 2?  We said yes and he took care of us.  They had seats available and we got to sit down in a 4 seat square table.  We felt welcomed.

 This restaurant is BYOB so we brought some wine.  It was $8 for a corkage fee which is a lot especially in Murrysville but we still chose to have some wine.  We looked over the menu which had a lot of good options on it.  We don't eat Italian all that often but when I do I like a good Chicken Parmesan.  Since this was the first time we came here I wanted to test out their chicken parm to see if this will be a place that we will come back to.  So I got the chicken parm with marinara sauce, spaghetti on the side, and French fries.  What French Fries?  Yes it was my birthday so I got me some French fries!  Carrie ordered their mussels.  While waiting for our food we got some of their homemade bread which was really good.  

 The food came and we enjoyed it.  Carrie liked her Mussels.  You can read her review on those!  My Parm was very good.  I had the choice to have their homemade spaghetti to go with the Parm or just regular and I choose the regular to see what it taste like.  I will get the homemade pasta next time to see the difference between the two.  Overall it was a very good chicken parm.  

 Our waiter was very nice too.  Everybody there gave us good customer service and checked on us a lot.  I wasn't planning on having dessert but the waiter and my wife convinced me to get it since it was my birthday.  I looked over the menu and the waiter really recommended trying their Tiramisu and I did.  I'm glad I ordered it too.  That was the first time I ever had Tiramisu and it was excellent!  I can't wait to have some more!

 Overall it was a great birthday dinner with my wife.  This place is small and its family owned.  People came in here knowing each other and just talking at the bar.  It was neat to see.   This will be a place that my wife and I will be back to try out their other food items for sure."}
{"text":"Positives:  Nice welcoming atmosphere. Good service. Provolone cheese wheel was tasty and had a nice breading. My wife's eggplant parm had the same breading and was also delicious. Generally, I thought the sauces were also good. Negatives:  For me the biggest negative was the poorly made fettuccine. It was too thick and heavy. Some of the noodles stuck together. And everything was way overpriced. It's bad enough to pay $18 for poorly made homemade pasta, but another $3 for one golf ball sized meatball?  And an $8 corking fee?"}
