{"text":"I went here for dinner with Eric L. and the menu options were many.  I ordered the spring rolls and a main basil vegetable noodle.  Spring rolls, were just okay, I must say that I have had better in the past.  Basil vegetable tofu noodles were awesome and quite flavourful.  Washroom doesn't appear to be as clean as it could be, the washroom itself was tidy.  Lots of vegetarian options, plus they are willing to swap things out for you if you wish."}
{"text":"Quick lunch. Red curry chicken had a lot more heat than flavour. Chicken itself ok, not too rubbery. Service friendly; nice, bright room. But an utterly forgettable meal."}
{"text":"The key to great food is their freshness. Buppha Thai uses the freshest ingredients in their food. Their spring roll sauce is very unique and well balanced. One of the reasons I am their regular is that their extensive menu. Not all Thai restaurants have what they have on the menu. I especially love their Bangkok Noodle, Garlic Chicken, Ginger Chicken, Fried Tofu and Vegetable, and more.   Don't just get Pad Thai or Green/Red Curry every time you go to a Thai Restaurant, why not try something different and you may find your new favorites :)"}
{"text":"I have to amend my previous review. I've noticed that on sunday Buppha thai is like a different restaurant. I don't know if they have different cooks, or if they use leftover food from the week, but on sundays when I've ordered the food has tasted:  Dry- the cashew chicken (that I normally love) also i tasted a bit like shrimp, which is what lead my to believe that it had been sitting around in a container that held shrimp. Seriously it was like warming up leftovers 3 nights after the meal!  Bland - the pad thai  I am just speculating. I just don't understand how a restaurant can be SO DIFFERENT on Sunday.   I suggest lowering your expectations if you choose to order from Buppha Thai on Sunday. But during the week it's still yummy."}
{"text":"I love this place. I try to go at least once a week. Great, friendly service and really good food.   Try the curry pad thai and the fresh springs rolls. Both are amazing."}
{"text":"I ordered from here on a whim the other day when I found myself in the uncomfortable predicament of a) not having any food in the house and b) desperately craving Thai food.  I had never ordered from here before, and I'm glad I did.  My craving led me to a couple orders of rice (coconut and sticky), a beef and basil dish, and cashew chicken.  Delivery was a bit slow, but they had problems finding my place.  To be fair, most delivery people have issues finding my place, so I can't totally hold it against them.  Everything was well-packaged and arrived warm enough to eat without reheating.  The rice was good, and well cooked (of the two orders, the coconut rice was the standout) and the beef and basil dish was appropriately spicy and incredibly filling.  The real star of the meal, however, was the cashew chicken, which was citrusy with just a bit of heat.  The chicken was moist and delicious and the cashews just added to the overall flavour.  Even after eating to a point of almost bursting, I still had enough for two days of leftovers for lunch at work.  Not too bad for $40 spent overall."}
{"text":"Just an average Thai place.  The menu is quite extensive and has alot of meat and vegetarian options.   The portions are plentiful and the food is tasty, however a little greasier than usual Thai places.  The spring rolls are pretty good.  The service was fast and friendly. The washrooms however could use some renovations and cleaning."}
{"text":"How has this little gem been missed?  The location looks a little tattered on the outside but on the inside this is a warm and well kept place.  I went late on a Sunday night so I was the only one there.  The server was very polite and friendly.  They have a decent size menu broken down into various standard categories.  I had the cashew chicken and coconut rice.  The rice was a little bland but the peanut sauce it comes with was definitely different than any other peanut sauce I've ever had.  The sauce was a little gritty, like they turned off the food processor just before its completely pureed.  It also have an excellent spice blend.  The chicken was very good also.  The vegetables were crunchy, not over cooked.  The chunks of orange were a nice change to chunks of pineapple that you would traditionally get in this kind of dish.    The only thing that stopped me from giving these guys 4 stars was the portion to price ratio.  I found that the portions were a little small for what you are paying ($10 to $15 for an entree)."}
{"text":"I used to order from here all the time - at least twice a month. They used to be my favourite thai delivery place. Unfortunately things haven't been going well lately.   The pad thai has zero taste, the noodles are overcooked and still wet, therefore not absorbing any sauce, there's just no spice or flavour. The portions have gotten smaller and hey. If you have allergies, make sure they really truly understand. They sent shrimp pad thai after I said three times \"no shrimp contact\".   I'm glad I looked before I tasted, otherwise I'd have died. Luckily the manager is really nice and followed up with a phone call to apologize and a free meal. A free, tasteless meal, but free and nice nonetheless.   I guess I'll be looking elsewhere for my thai fix. Makes me sad. I liked these guys a whole lot. :("}
{"text":"The restaurant is a little dingy inside, but the food is great, the service is friendly, and the prices are very reasonable."}
