{"text":"The wait was toooo long for a burger (35+ minutes)  A couple sitting next to us had already waited 50 minutes for their food.   When we finally got our burgers - he enjoyed the marrow burger but my juicy lucy was sadly not.  The burger just had no flavor and I've cooked grass fed beef numerous times at home and marveled at the difference in taste but this burger was totally tasteless and was overcooked.  Fries were luke warm which fries should never be and beer was too expensive ($5.00 for a bottle of OMB Cooper that local grocers sell every day for $10 6 pack and it's brewed less than 20 miles away).  They seemed totally overwhelmed the ambiance is non-existence & could have been overlooked if the products were better.  There was a write-up in Ft, Mill times recently about this place - hope owners get it together. I don;t think I;ll be back but wish them luck."}
{"text":"First visit, only 3 other people in the location.  The other tables were not eating yet, no one was working in the kitchen till after we ordered and the food slowly came out.   They managed to suck every last drop of moisture from the patty, way over cooked and small.  I ordered mine with caramelized onions they are on the menu,  I received about 6 little pieces of onions that were partially cooked/grilled,  not even close to caramelized.   The fries were not bad.  My daughters burger was the same and they forgot her cheese.  It's not like they were busy. I will stick to 5 guys or Bad Daddy's."}
{"text":"I'm sorry to say that we will not be back. My wife and I tried Burger Craft for the second time, months from our first visit, in the hopes that it would be better. Sorry it failed again.  We arrived around 12:30 on Tuesday afternoon and the place was pretty much empty, there were 2 guys sitting and 2 ladies at the counter ordering. We knew what we wanted but the order process took about 5 minutes. We had a rewards card from our last visit but forgot it the man at the register said he would figure out the points and bring me the receipt shortly.  We ordered 2 Guac Burgers, mine had a GF bun, fries and fountain drinks, with a BOGO coupon it was about 21 dollars.   We found a seat and waited....and waited....and waited. The 2 guys that had been there finally got their food, then the 2 ladies ahead of us. Ours was about 5 minutes behind them but we had to ask for it to go so we could get back to work as we only have an hour for lunch. All told we spent about 30 minutes just on waiting. For a place that was pretty much empty that was crazy. That was our big clue and we even commented on it but chose to ignore it and give them another try.  We got back to the office and found our burgers to be tiny, burned on one side and tasteless the guacamole was bland the bacon was chewy and the fries were greasy.   Oh and my receipt....never got it. My fault on that one.  I understand that this is a \"healthier\" burger joint BUT for what they charge, the wait times you experience and the overtly bland atmosphere and uncomfortable seating, I'd rather not even try this place again and we won't. Quite frankly I'm not certain if this place will make it to the one year anniversary. And that's sad, I really wanted them to do well and the people that work there, from what I've experienced, are really nice. The formula just isn't working at least not at this location."}
{"text":"I believe this joint has only been open a little over a week.  They still have a lot of details to iron out!  Have been here for almost 45 mins and there are several people who ordered in front of us still waiting on their food!  They seem to be doing online orders as well, which seems like a bad idea to me when you cannot fill your in-house orders in a timely manner!  Once my food arrives (7:30 pm now) I will post about quality of food! I have my 3 and 6 year old with us, so we will see if we make it to dinner!!  It looks like people are satisfied with the quality of food once they receive it.  Fries just arrived!  I have noticed that nothing seems to come out together.  3 out of the 4 of us have food!  It has all arrived!!  I ordered the BLTE burger that includes an egg, bacon & maple syrup on it = fantastic, my wife made her own burger and loved it!  The food is incredible, they just have some operating details to work out!  4 stars for food, 2.5 stars for operations due to links that I feel will be worked out over time!  The staff is extremely hard working!!!  Overall 3 stars right now.  Look forward to trying them again in the future!"}
{"text":"Had my first visit to Burger Craft today, and the burger did not disappoint! I had the Bone Marrow Burger and oh my God, it was so simple and juicy and the flavor was simply amazing. The Cajun fries are also amazing!! Looking forward to trying the Juicy Lucy and BLTE burgers along with the sweet fries! Highly recommend"}
{"text":"Took an hour for the burgers to come out and they were very mediocre. They seemed very small and the toppings were not generous. I had pimento cheese on mine and there was barely any on it. The place was loud (full of screaming, unattended children) and the long wait for the food left me feeling disappointed.   For the price (which was pretty high for what it was), there are many better options in the area."}
{"text":"I've been twice now, the burgers are good and service has been quick.  The fries were mediocre, onion rings are great."}
{"text":"The salad was delicious. I got the burger salad, very fresh ingredients and the burger was cooked perfectly. It had great flavor. I know organic ingredients are more costly, so I thought the price was not bad even though the portions were smaller. Don't get the guacamole! It was really good and homemade but such a small portion for $1.75. The salad was a good size though!  My husband ordered a build your own single patty burger and fries. There was about 15 fries, and the burger was the size of a slider :-(. There's an option to get a double patty. He should've gotten this! My friend got a black bean burger made in house and said it was delicious. Her husband got the sweet potato fries. They were bland but fresh and a larger portion then the white.  The staff was very friendly and helpful. It did take longer to cook the food but they made it fresh. Overall we enjoyed it and will be back when were in the area."}
{"text":"Very expensive. $32 for 2 small burgers with toppings, a small order of onion rings, & 2 fountain drinks is crazy. The meat is good quality, but very dry since everything they cook is overcooked & well done (no matter how you order it). The onion rings, while huge, were extremely greasy and bland. Really wanted to like this place, but we will not be back."}
{"text":"I'm giving this 3 stars because overall i really enjoyed my food, but things could have been better.  First off let me say this, I got the \"Marrow\" Burger and fries, neither the flavor of the burger or the fries disappointed at all.  Everything about the burger screamed fresh; the meat, buns, and the toppings.  I like burgers, and I'd put it my top 5-7 burgers I've had, and I've had some good ones.  With that being said, I had a couple of problems that will prevent me from being a regular.  Price being the biggest issue, my burger, fries, and drink ended up being around $15.  We have a family of four, so you can see how this adds up pretty quickly.    I do not have a problem paying a decent amount for a burger, but it has to hit out of the park on both flavor and portion size for me to do so, this one was halfway there for me.  The burger overall was pretty small, not what i would expect from a place that charges $10 for a burger.  I was really underwhelmed when I saw how small it was.  I'm giving 3 stars only because the food was fantastic, however portion size and price are dragging it down.  If i felt the price was more inline with portion size, Id easily give this 5 stars."}
{"text":"I was excited to try this burger place as the hamburger meat is 100% grass fed. I was quickly disappointed when I looked at my sad burger.  I ordered the BC burger and was expecting to see a little more than bun, meat, cheese. The BC sauce was unusual and I really can't find the words to describe it.  :/ The fries were very good.  I have high hopes for this place as the concept is great.  Def needs some tweaking of the menu or cook to add flavor."}
{"text":"We were so impressed, we asked to see the manager, Trevor, who said he's new there and he's worked hard to make the place deliver orders super fast and ours came out in about 10 minutes!"}
{"text":"My husband stopped in for carry-out tonight. He was the only customer, but they still got both of our orders wrong. I ordered a bean burger with mushrooms, onions, and swiss. I received a bean burger covered in spinach. He ordered the monthly special which included beer cheese, bacon, barbecue sauce, and onion straws. His burger was overcooked and missing bacon. The only positive was the mac n cheese."}
{"text":"We went here the second week it was open and had dinner. The food was really good and fresh, not frozen. They are a little pricey for my family since we have six members, but I guess you would expect that for a place that has grass fed beef. They also have gluten free products. They even have a kids eat free night on Thursdays I believe. We tried the special of the day which was a double cheeseburger combo for $9.99. It was a very good tasting original burger. We did wait an extremely long time for our food but the manager on duty made up for it. I'm not rating them on time it took since they are new and have to work out their kinks. We will definitely be back to try again."}
{"text":"I've been here three times now and their burgers are delicious. Service has been a little slow but they are new and the food is worth it. I highly recommend their burgers bowl and disco fries (I like to counterbalance my healthy food with really unhealthy options)"}
{"text":"The food was exceptional. I have been very pleased with the cleanliness of the restaurant as well as the price points for 100% grassfed beef. It is so cool they partner with Strauss and everything is non-gmo. Which I can't think of a better concept especially being located right next to the Planet Fitness gym. Great food!"}
{"text":"Greeted with warm hello from multiple employees. They just opened 90 minutes ago, and food was great, service was top notch, and the price was right. We will be back."}
{"text":"Terrible. Even my collage age son did not like the burger, and didn't even finish. The turkey burger was so strange looking, and no taste. It was more like a turkey sandwich. It didn't appear ground, it was a large piece of turkey. The salad with a burger patty on it, was not good. The hamburger was tasteless. Unless we hear there there are major changes in the food, we won't be back."}
{"text":"I expected so much more...  Grass fed beef is more expensive, I get it, but when you're going to cook with specialty ingredients, you have to learn to do it right. The burgers may as well have been McDonald's value menu burgers for the size and consistency. They cooked the life out of that beautiful meat, a sad end for a product that has had so much extra effort put into it before it arrived at this underwhelming burger joint. I'm not sure why it takes 20 minutes to cook onion rings, they were not worth the wait. It's a costly meal for small portions and poor technique. Offering run of the mill ketchup was disappointing at best. Definitely will not be back, I'd be surprised if they last long. 2 stars for a few good beers in the selection, but overall not worth a visit."}
{"text":"Well the workers were friendly We waited for 20 minutes for our food Which is fine for fresh and hot food  The fries were average The onion rings looked great but were average Buns were good but could have been toasted more The toppings were good; now they did have a very thick cut The burgers were cold; I mean the cool or cold side of room temperature.   Really disappointed when the best part of the meal is such a let down. It id really like they cook the meat first then wait 10 minutes for everything to be cooked ???  I was so hoping for a good hamburger experience."}
{"text":"Expensive. Atmosphere is not comfortable. Food is tasty. Burgers are small, especially for the price $6.99. Yes I know it's grass-fed beef, but even the onion rings are $2.95 for 4 onion rings in a small order. (That's .75 an onion ring) I like the concept of \"clean\" food but the interior needs a better vibe."}
{"text":"Friendly service. Great meat, natural grass-fed, non GMO. But wait- I have to order the gluten free bun to get non-GMO bread on a great burger? They're normal white buns are just potato buns.   These makes absolutely no sense and you are not asked about the bun selection when you order.  Child burger size portions are good enough."}
{"text":"So I really have mixed feeling about this place. On the good side, the burger is good and the quality is good. They have a good selection and additions to a burger. On the other hand, I live a mile away and very rarely ever think to eat there. It's not that it's a bad place. It's a great place. It's just kind of there for me."}
{"text":"Was good. Definitely paying a premium for the freshness and organic quality. Wait time was a bit excessive, but I wouldn't have a problem going back."}
{"text":"So I stopped in here yesterday which was a Friday around 2:45pm. I was the only customer which is not odd at that time, lunch hour crowd is now gone. I wanted to order a quick burger on the run to take back to work with me as I was in a hurry. Walked in and didn't see anyone working for at least 5 minutes. Finally the cook walked out and stated someone would be out to help me soon. Waited another 4 minutes and was about to leave when someone finally came to the register. I ordered a burger bowl ( no bun ) to go with romaine lettuce, mushrooms, avocados and cheese. Took ten minutes to make it. Got back to work and it wasn't a burger bowl, it was on a bun, and no lettuce. :( I was so disappointed. The burger itself was good, just not what I ordered. I will be back to give it one more shot as its close to home and I have to support my local businesses. I did notice that kids eat free Monday through Thursday nights with an adult meal so I'm sure I will be back soon with my daughter!"}
{"text":"I returned for the $5 burger Tuesday nights. Despite seeing the signs on my first visit, no one bothered to communicate this to the most of the employees. The employees were nice and one of them knew it was $5 Tuesday (we saw the sign on the way out; for some reason it was not facing where people could see it).The owner/manager was not there this time so that probably explains why the workers did not know about it. The burger tasted a little better this time and the lettuce and tomatoes were fresh. Unfortunately, the fries are frozen and are a small portion. For $3 an order they should be fresh and/or a larger portion.  It will probably become a regular Tuesday night stop for me, but I just can't justify spending $13 on a small burger, frozen fries, and a fountain drink regularly, even if the beef is allegedly better. Having the owners write fake reviews is not going to help their cause either. If you see look at the filtered reviews, you will see a glowing 5 star review from Suzanne B. That is Suzanne Bonham. She is the CEO of the franchise company that operates this restaurant."}
{"text":"I really wanted to like Burger Craft.  I appreciate that grass fed beef is much healthier, but here's the thing.  It's lack of fat also means that there's a very good chance it will be dry and tough.  That's not qualities you want in a burger.  The patty itself is much smaller than I expected I would get for a $9 burger.  Since it's so small and so thin, it's very hard to get a good char on the outside while retaining any juiciness on the inside.  5Guys can get away with a medium well burger because the meat has so much fat...these grass fed burgers can not.  So you end up with a dry, tasteless patty.  The toppings were ok but not very generous for the upcharge.  I ordered onion rings.  They looked delicious, big and fat...but they were very greasy and not very flavorful."}
{"text":"They had 3 people in the entire place and I had noticed previously when in the area it always appears dead, as you will see I now know why.  The menu is very confusing, they special they have listed on the board out front has a single burger and a side for $6.99 but when asked that is the lunch only special.  So we got 3 burgers and an order of onion rings and two drinks $28! The order or onion rings was 4 onion rings or as I see it $.75 each, really.   The burgers are ok at best, the noise level is unbearable and it's impossible to hear just about anything even now while sitting here with a total now of 6 people.   This place isnt going to make it, save your hard earned money and go to McDonalds."}
{"text":"Delicious!  Awesome quality meat.  Super nice employees.  We are here on opening week & you can tell they're still getting the hang of it so be patient with that :) you definitely get what you pay for, I'd say the prices are great for the quality of food. If you're looking for a lot of meat, I'd go with the double on the burger!  Great atmosphere.  Overall awesome new spot."}
{"text":"Paid about 12$ for a hamburger. When asked what kind of bread it is on... her reply was \" just a plain white bun from walmart.\"  i wanted to be nice and just give them a try. Nice staff but management needs to consider a better choice of bun rather  than a 98cents per dozen buns from walmart. Hamburger was beefy , fries were great... staff were attentive"}
{"text":"The food was great. We went at an off time and were the only ones there. There were two people working and they stayed in back mostly which is good and bad. Good because who wants someone staring at them while they are eating but bad because if you need something it takes a while to get someone's attention. My suggestion- get a bell for your customers on the counter. They have the best sweet potato fries! The only other downer is if you make your own burger it can get REALLY EXPENSIVE. My 10 year olds burger (only the burger) was over $12! The add ons (most of them) are .75 each which adds up really quick!"}
{"text":"They have a large selection of toppings, I tried the Carolina style burger and cheese fries, the food was excellent and the staff was friendly, one of the toppings they offer is peanut butter and jelly. Next time I will have my kids try that on a burger. Overall this will be our go to burger place"}
{"text":"Lesson learned - Thursday night is Kids Eat Free (with the purchase of an adult meal). If you don't have kids or earplugs, don't go on this night. Kids everrrrrwhere.  The fella and I stopped in for dinner, and two burgers, an OMB Captain Jack, and a side of fries & onion rings cost $27. The burgers were solid but a little over-cooked for our taste (we like some pink), and the fries and onion rings were tasty but were lukewarm. It didn't take an inordinate amount of time to get our food, so I don't think they sat for too long before we got them. Not sure why they were room temperature.  Burger Craft is a step up from a fast food restaurant and makes for a good, low-key dinner night, but don't expect to be wowed."}
{"text":"We went last night and it was terrible. I ordered a burger bowl, my husband a burger, we split a regular order of onion rings and each got a fountain drink. The whole meal came to $35 which seemed high for what we ordered.   The place was empty except for one table already eating but it still took a while to get our food. When the food was brought out it was terrible. The burgers were so overcooked they were like tough little pucks. It's a shame to destroy what is supposed to be a  high quality meat. No telling if it actually was a high quality meat because it was totally killed.   My salad was tiny.  I ordered mushrooms (for an extra charge) but they were missing.  I mentioned the mushrooms were missing to an employee and he said he would bring me out some on the side. He brought me a tiny cup, with no joke, what looked like one chopped up mushroom. I can't believe that I paid extra for one mushroom.   The order of onion rings was only 4 onion rings, and they were absolutely disgusting. They were super greasy on the outside but thick and doughy on the inside like they weren't cooked long enough, but low enough of a temp to let the oil sink in.   There is no way we will return. I'm super disappointed with the products and angry we dropped $35 on what was nearly inedible."}
{"text":"So, this restaurants downfall is the kitchen and management for not fixing it. Over an hour wait for two kids meals and a hamburger is insane. I watched people complain multiple times throughout my wait about the same issue.  Food is good, but slightly overpriced.  This restaurant has potential, but must fix the kitchen issues before I'll be back."}
{"text":"This place is really good so far.  I've not had a bad burger yet and the onion rings are pretty epic.  The location is also great and I never have trouble with parking.   My kids love the massive hot dogs!  It's a fun park/picnic style atmosphere.  I also appreciate that the meat is grass fed and not astronomical in price!"}
{"text":"I will never return to this restaurant.  For 2 simple burgers and an order of onion rings, I waited over an hour in a store that was not full with 4 cooks in the back.  When I got my order, the burger was overcooked and the onion rings under cooked almost to the point of being inedible, and had I not been starving by the time it arrived, I would not have eaten it.  I've had better burgers at 5 guys, for a lot cheaper and without being nickel and dimed for all of my toppings ($2 for cheese on a burger that was already $6??). I have never written a review for a restaurant in my life, but when quality and customer service are this bad, I simply could not NOT review it.  I can only be thankful that I went without small children.  Do not go here."}
{"text":"We went here the first week it opened so I'm not going to comment on the service,  it was very slow and they messed up two of the four orders we had and also heard two other customers arguing at the counter for other issues but because it's new it will need time to settle in and I'm sure they will adapt and improve.   My issue is that it cost us, two adults and two kids about  $60 for us to eat, thought that was expensive for single burgers and small orders of french fries.   I know it's grass fed beef but the single burgers are rather small and the portions of small fries are also \"small\". Nothing stood out flavor wise to make us need to come back.  Honestly,  it's cheaper to go to Five Guys for same quality with better size portions.   I wanted to like it more being a local place but the prices will keep us from going there that often."}
{"text":"Pretty good, very fresh and convenient to home. I don't do burgers much. But there's was good. I like that all the beef is hormone free. Only issue is they have ran out of stuff a couple of times when I've been there. I really wanted the portobello burger on one occasion but they were out. Other than that not to bad."}
{"text":"I went here when it first opened and was not impressed. Burgers were very small in comparison to the photos on line. We waited a half hour for our order because they forgot to make it . Everything is a la carte. I ordered a burger over greens . I literally got lettuce , a burger and one grape. Not what I had in mind ."}
{"text":"Finally! A good clean hole-in-the-wall burger place in the south. We came in on a Sunday evening and the place was empty for the most part. It's a simple place that creates great tasting burgers. We tried the Quac and Marrow burgers with sweet fries and onion rings as sides. Food is fresh and burgers were well balanced and flavorful."}
{"text":"We went here three times within the first 4 days of opening. The burgers are great  and the Mac and cheese is AMAZING.  There were some timing issues- we had two orders at the table that came 30 minutes apart- but I am sure those bumps will get ironed out the longer they are open."}
{"text":"Visited Burger Craft for lunch today. It was a little disappointing. It wasn't bad, it wasn't great. Just mediocre. The service was good. But WAY over priced for the food you get. Spent nearly $14 for a burger, fries and drink. I could have gotten a better tasting burger, with much larger sized patty for less than half of what I spent there and would have been MUCH more satisfied just down the road. I love seeing new unique eats in the local area, but I'm afraid I have made my first and last trip to Burger Craft."}
{"text":"Oh how I wanted to have a good experience at Craft Burger but it was not meant to be.   The negative reviews below are 100% accurate and detail experiences similar to mine.   The \"single\" burger is VERY small - I mean REALLY SMALL - and mine was cold when I received it. When I brought it back up to the counter I asked if the burgers are grilled to order. The young man behind the counter commented that \"they are grilled fresh UNLESS HE (the grill chef) HAS SOME THAT HE GRILLED EARLIER\".   So I guess you have a 50/50 chance of getting a fresh, warm burger.   Prices would be fair if the burger was double the size. It is REALLY SMALL.   The grilled jalapeños were a nice touch on an otherwise very underwhelming burger.   The onion rings were huge, but they were so greasy that they were totally inedible - see similar comments in other reviews.   Swing and a miss. A big miss."}
{"text":"This is a tough review to write since I enjoyed my hamburger but they definitely have some kinks to work out before I would become a regular.  When we walked in we were a bit confused since the menu was not posted anywhere. While we looked at a printed copy someone came out to turn on the TVs that normally display the menu. The girl who took our order kept asking the guy turning on the TVs for help which meant he had to walk all the way around the counter and back several times. We arrived just as they opened so I was surprised one of the many people standing around didn't help instead. Sadly the milkshake maker was not working.   After we sat down the fries and onion rings we ordered came out pretty quickly. The burgers were several minutes later. I loved the fries and onion rings which were both well-seasoned. Unfortunately the hamburgers were not as flavorful as I would have hoped and overwhelmed by cheese. The tomato and lettuce were a good portion. Contrary to other reviews I thought my double burger and half my boyfriend's small fries (with a couple bites of onion ring) was more than enough for lunch.  Someone came around to bus tables and clean up trash as we went and she was super friendly. I also saw her refilling people's drinks so they didn't have to go to the soda machine.  The first visit was a bit of a mixed bag so we will probably go back in a few weeks and hope that some of the details get worked out."}
{"text":"Not a good first visit. Give them a little more time to work the kinks out.  The veggie burger was just too \"squishy\" - when you ate it it just squished out all over the place. Un-appetizing.   The CYO burger I had was OK. A little under cooked. And too much mayo.  Fries were good.    It took at least 30 minutes to get our meal.    And there were only 3 other folks in the restaurant at 6:30 pm on a Tuesday night."}
{"text":"The people that complain about these burgers are probably used to eating burgers chalk full of hormones fat and grease. These burgers are lean and tasty, but not fatty like burgers at most mainstream restaurants. I've tried Blackcow also, another burger joint close to this, and they weren't nearly as good IMO. And they were the same price but not grass fed.  If you are health conscience and want to eat grass-fed, non-hormone fed beef, this is a great tasty option."}
{"text":"So this is a mixed review.  Actually a little heavy on the negative side.  I ordered two burgers to go and then proceeded to wait nearly 30 minutes to get my burgers. I watched in agony as the hostess took my $7 hamburger and squished it into a little brown box. When I got home I was highly disappointed in the quality of the burger. The bun was like a bun I can buy at the grocery store. It wasn't even toasted well. The hamburger patty looked like someone had put a brick on it on the grill and flattened it completely. When I pay so much anything I expect it be presented better then it was. My One caveat is that I did complain to the manager about the slow service and getting my hamburger and my meal was completely comped by management. I wish them well in Fort Mill I will try them again I hope they're better"}
{"text":"I absolutely loved this place! Something to keep in mind is that grass fed meats taste a little different than the fatty hormone filled crap most places serve. It's also a bit more expensive. If you don't care about what you or your family put in your bodies and only focus on $$, then there is a McDonald's across the street. In life, you have to pay more for quality.  Update - restaurant closed. It's a shame but I really loved the place that took it over, \"Sabor\"! Burger Craft definitely had some staff issues. Our orders took a long time to complete and typically had an error or two. I did enjoy it, but what are ya gonna do. On to Sabor!"}
{"text":"These burgers are delicious, and their sweet potato fries are some of the best! The atmosphere is rather awkward because the space is too large for what is there, but it has potential if they rearranged and added tables.   The staff is friendly and seemed to know what they were doing. I've been here several times now without complaint about staff.   I do wish that their garlic aoili had more punch, for a dollar extra I was underwhelmed. The one time I ordered avocado it was so hard and unripe that I literally couldnt eat it. Otherwise, I loved the food."}
{"text":"First time visiting this restaurant.  Had heard about it from others.  Gotta say, I was not overly impressed.  Burger and ingredients were fine.  Burger cooked to desired temp and toppings were fresh.  That bun, however, was deplorable.  I asked what kind of buns they used and the gentleman told me it was a \"potato\" bun.  Poorest excuse for a potato bun ever!  It was borerline stale-not light and tender as most potato buns are.   I got a side of onion rings.  They looked beautiful when they arrived at my table.  4 huge, lightly breaded & fried rings--perfect, IMO!  I thought they were going to be the highlight of my meal.  Not.  Much to my dismay, they were grease bombs with the onion itself having little to no flavor.  And, to make matters worse, there was a huge pile of oil at the bottom of the stack--it was leaking out under the rings.  Gross.   I know that grass-fed beef is more expensive and therefore costs more.  But I've had much bigger better burgers and sides at other burger specialty places for the same amount of money. The person who took my order was very deliberate in telling me that they had not had a \"grand opening\" because the wanted \"to get the kinks worked out.\"  I'd say they still have a  bit of work to do. On the plus side, service was very good, however, and the place was very clean."}
{"text":"This place is located across the street from my favorite Harris Teeter (this one has more organics than any grocery store in the area).   Love the grassfed beef, non-gmo an organic ingredients. Both of our burgers and the sweet potato fries were delicious. The prices are higher than non-sustainable options, but they are about right for organic/ grass fed.   The place was clean, airy and refreshingly free of televisions and other noxios elements.   Staff was very friendly, happy and polite. They were able to answer all my questions.   I am so THRILLED to see sustainable food options like this moving into the Fort Mill area.  One improvement I would like to see:   Organic sauces, ketchup, mustard to go with these awesome burgers.  The store is new at this location and I have a feeling that some of these problems mentioned in other reviews are just \"working out kinks\" and getting employees trained/ up to speed.   My message to the owners of this Burger Craft is this; Stay true to the Organic and Sustainable food movement. Don't let anyone tell you that people in Fort Mill don't care about this. We do!"}
{"text":"This is my new burger joint!!! Brought the fam in for dinner and the burgers, burger salad, and kobe hot dog hit the spot - good meat makes good grub! We also went rogue on the buckets o' fries, sweet tater fries, and godzilla-sized beer battered onion rings. Sweet baby.... Just when I thought I was done, the chili cheese fries showed up and my stomach kicked into overdrive. BAM. I look forward to working my way through the menu and enjoying the trip..."}
{"text":"I have been here a few times since they opened, good food but kinda small portions.  If you want a LOT of food, not the place unless you order a lot of food.  They pride themselves on quality not quantity.  LOL  Overall, I liked it a lot and will definitely be back.  Great flaovr and nice people.  I did have a small issue with my to-go order once (cheese was missing) however the manager/owner made it right for me.  I will be back again!"}
{"text":"Love this place! Burgers are great with tons of toppings options. Fries are always hot and tasty. Mac n cheese is on point. They carry local brewery beers so that's always great to go with our burgers"}
{"text":"I've been here 3 times and they have never got my order right. The burgers are also tiny and bland. Worst burger restaurant I've ever been to. I don't know why I keep giving them more chances but this is definitely my last time going there. I recommend going to Blacow burger instead because i always have a positive experience there."}
{"text":"Mediocre experience at best. For starters, only one register was open and the workers seemed confused with entering the order. As such, took about 10 minutes just to order.  The place itself was clean but the decor seemed unfinished.  Walls were bare and lacked any discernible theme. Most importantly the burger was small and did not taste any better then a fast food place. Onion rings were not to my liking, heavy batter and greasy. Fried were good, not great"}
{"text":"The word I have for this place is \"deceptive.\"  There is no \"craft\" going on here. Using the word leads the customer to believe that particular skills are going into the making of their meal. If any \"crafting\" is to be done, it would be on the part of the customer, as they choose topping combinations for the burgers.  I ordered a burger in a bowl. I requested that the burger be \"medium.\" I received a bowl with a couple large handfuls of baby greens (like the ones you buy in boxes at the grocery store), a well-done, dry patty, and a glob of greasy \"caramelized\" onions. There was a side of something called \"HM Vinaigrette.\" The HMV was ok. Apparently I was supposed to add more toppings a dollar apiece to make my experience more than ordinary. The burger was completely devoid of salt or any other seasonings.  The deception was really in full force with the fries. You could pay $2.95 for regular fries or $4.95 for a bucket. We asked about that. There were 4 of us. The cashier held up a small tray and said, \"this is the regular fries.\" Then he gestured to a bucket on the counter and said, \"That's the bucket. It holds about 4 trays of fries.\" So we bought a bucket.  They don't tell you that they stuff paper down in the bottom of the bucket to about the halfway point and put the fries in on top of that. Not. 4. Trays. Worth. But it was ok because the fries were no great shakes. Lukewarm, not salted well. We had plenty for our group.  The burgers my companions had seemed ok. One that should have been medium was also overlooked and dry. Oh, and the buns...no craft there. It's like they went to Food Lion and bought bagged buns, piled them under a tray or something to squish them down, and then served them. This is BURGER place! The bun is an important component! The seating is also not great. There are picnic tables along the edges and they are huge. You could put 6-8 people at each one. But the tables in the center, which were nice for a group of 4, had really awful chairs. You know how some chairs have weak backs that just go back too far when you lean back? And how some have rounded backs so you can't hang your purse there? That's Burger Craft."}
