{"text":"food is decent, good if you're craving a burger. I wasn't amazed and the burger gets sloppy towards the end. Also the breakfast is OK, nothing special"}
{"text":"Wait where is the one on 35th ave and van buren that is the best"}
{"text":"Best. Tuna.Melt. Ever.
Fabulous tuna, served on your choice of bread - I chose sourdough, and it was thin, crispy, buttered and grilled to perfection. I asked for a few onions on the side and added it to the sandwich, which made it PERFECT. I've been eating tuna melts for years, and this one takes top prize. The tuna was still cool (a MUST with a tuna melt), and the bread and cheese were hot and melty. Fabulous flavor/temperature combo.
My husband has had the burger, and loves it; he heaps even more praise on the pastrami - in fact, he says it's as good as The Gold Star in LA, and that is the highest praise he can give.
The fries are excellent - thick, crispy on the outside, fluffy on the inside and hotter than the hinges of well, you know.
When you order a sandwich or burger combo for $3 extra, you get fries or onion rings and a gigantic 32 oz. drink.
The tuna melt combo and pastrami sandwich (VERY LARGE and on fantastic bread) was about $15. Not super cheap, but well worth the money.
Next time we'r'e going to try the onion rings, and one day we'll make it over for one of the breakfast specials.
Ooops - I almost forgot - the fried zucchini is out of this world! A huge portion is served piping hot and crispy outside, with tender, sweet, juicy zucchini spears inside the excellent coating,and a side of ranch dressing. Almost a meal in itself. OUTSTANDING!
The place is clean, bright, and busy. The staff is friendly and fast.
If there were one of these on every corner, McDonalds, BK, Jack,  Wendy's et al would be out of business. Can't ask for better than this!"}
{"text":"I decided to try this place over the weekend. I got the Mexican burger it was really good. The fries were normal diner style fries. They were ok. The wings though - those were seriously awful. Literally topped my list of worst wings ever. They were covered in a thick breading and you couldn't even make out what you were eating. I thought they were boneless until I bit into one."}
{"text":"2 homemade 1/4 pound burgers a huge order of zucchini and a house salad for $18. The burgers were good. The salad was full of fresh veggies and the zucchini was hand cut and breaded: terrific. Sorry no pictures. I was too hungry to take any. You'll just have to eat here and take your own."}
{"text":"Over priced for a burger joint with really thin patties. I just moved to the area and I was looking for something close to a Tams burger in Los Angeles. Food was ok. If you plan on dinning in try to eat your food quickly before it gets cold. Since they have a ceiling fan directly over your table (on full blast). French fries look like seasoned fries but aren't. I think they just don't change the oil out. I'd suggest take out."}
{"text":"This is definitely a new town favorite granted alittle  to much is offered but everything is still good and service was amazing ty for the great experience and you have won me as a customer"}
{"text":"Pastrami. How can you mess that up ?
A lot of places do . Not burger shoppe. The hamburgers are also really good. I love the mexican burger. And the onion rings. Service is good and timely. They get us out on time when we go there for our lunch break."}
{"text":"This place used to be so good . I wrote an amazing review for this restaurant but now I must retract my statement. Today I went to the Burger Shoppe to my surprise they have new management the owner decided to keep the previous name . The food is horrible now . I ordered a cheese burger in which the cheese never melted thousand island sauce was a like eating glue , fries were beyond greasy. Disappointed beyond belief"}
{"text":"Everything I have tried from Burger Shoppe is good! Burgers, chicken sandwich, salad and breakfast all are delicious!"}
{"text":"There food is disgusting I had a omelet it was burnt no butter on toast it use to be good not no more never go again. They even didn't care when I made a compliant."}
{"text":"Well the fry's are good. In my mind, if you call yourself \"The Burger Shoppe\" it should be a great burger. That's not what I received. It's a frozen patty, nothing special, tastes frozen, with no sense of effort. The avocados were not ripe and so hard they had to be removed from the burger.  The quality did not meet $10 combo price. The menu is overwhelming with way too many choices. Staff was friendly and were the best part of the experience."}
{"text":"Don't fall for the mediocre reviews. Those aren't from regulars. Those in the know can attest to the food. The menu is robust, as are the portions. Breakfast is great! Especially for the price. But you can order from burger menu from the time they open until they close. Patty melts to avocado burger, sandwiches to hot dogs.... and chili fries. You can't go wrong.

This Dive is the best....."}
{"text":"My husband and I love the carne asada quesadillas. The sauce they come with is so good. I highly recommended this place."}
{"text":"I went in to get breakfast and ordered a cheese and mushroom omelet. The cheese was processed cheese and the potatoes looked like dehydrated potatoes. I asked for butter on the side of my dry toast and it was liquid something, it was not butter. They did put lots of mushrooms in the omelet but there was no flavor to it at all.
For the price of the omelet and coffee it was $9.08.
I would not recommend this place for breakfast at least not the potatoes and cheese. 
Not worth the money"}
{"text":"Burger meat was not high quality and I didn't love that they mixed raw onions into the lettuce."}
{"text":"Good best pastrami in town just like home los Angeles i have only had pastrami and chili cheese frys"}
{"text":"One of my favorite spots in Phoenix . Simple, affordable, and good flavor .  its a diamond in the rough ."}
{"text":"Oh man!  I love this place, always hot fries, fresh tasting patties and never a sour puss behind the counter. I highly recommend this place."}
{"text":"Very nice bacon cheeseburger and no need to add ketchup or any other sauce. It will take away from the tastiness that is already there. Remember to keep you ticket stub cause they will check. Good service."}
{"text":"Some of the finest Pastrami and cheeseburgers in the valley. I also like to order the chili cheese fries and add on top fresh cut tomatoes and pickles. I've been coming here ever since I found out about this place. All the food is cooked fresh to order and the employees work hard to make their customers happy. What's not to love?"}
{"text":"Not only is this place cheap but the burger was great for my party of 4 adults one kid who eats like an adult and a baby we paid 55 dollars total and this came with fries and drinks Honestly the burger was so big I can't even finish it and for that price you could not go wrong. We probably had about 7 burgers 6 fries and 7 drinks and chili cheese fries for that price"}
{"text":"$3.29 for burger , fries and soft drink is a-ok  the burger was not bad 1/4 pound patty flame broiled. and the french fries were ok to . Its not good enough for me to go out of the way to get there . But its OK ,I saw this place on yelp with all its 4 and 5 star reviews and wanted to see what this place was like for myself. well it gets only 3 stars because of the value."}
{"text":"I've been coming here for years and the food was always pretty good. But lately it's gotten real greasy. The attitude of the employees has gotten real bad. But the last straw is when I ordered a burrito and asked for a extra salsa and was told it was 55 cents for a extra one. I'll take my business somewhere else."}
{"text":"Looking for a burger place. My other place closed at 2.. was wah. 
   This was pretty good. I had the bacon avo cheese burger meal. Good iced tea. Bf had Hawaiian with Avo and a salad. Then he ordered 3 street tacos. Small with ASADA.  He liked them I thought a bit chewy. 
   I was looking at a pastrami Sammy being prepped.  Now THAT looked better than my burger. But I'm happy. My void is filled. No pics too hungry for phone."}
{"text":"I move from cali two years ago and so far this is the first burger place that I could actually say I will be back ..... it did take a while to to get my phone but it was worth the wait ....."}
{"text":"What a shame this closed down... we really enjoyed it and their fries were so so good. I hope they see this and maybe think of reopening!"}
{"text":"They should change the name to The Greasy Pit. A coworker suggested this place, but I blame myself because I should have known better. Plus another clue was that all of the occupants of the 4 vehicles before me were 300lbs+. Only dare eating at this place if you don't mind dying young of heart disease. I've never eaten a taco with so much grease before. I mean I could literally barely taste the beef because the taste of grease overpowered it. It also sent me running for the toilet a couple of hours later. Charming I know. You've been warned."}
{"text":"I use to love this place. A few days ago I went back because I really wanted to get the bacon cheese burger and chili fries. The burger didn't taste the same as before and instead of giving me chili cheese fries they game a chili burger which was disgusting. Oh and the cashier (not Patty she's awsome) was the rudest person I've ever met. Once she gave me my order I said thank you and she just closed the window and didn't say anything. Sadly I think I won't me coming back."}
{"text":"Get the chilli cheese fries and the bacon cheese burger. ...reminds me of California eaten"}
{"text":"An old school burger stand of sorts!  They have a little bit of everything. You may have to wait a couple extra minutes for your burger but it is well worth it for a hot fresh burger."}
{"text":"Prices are average. The patties are thin so I would recommend getting 2 patties. The bun is nothing special and they only have generic ketchup which is very noticeable. The burger had a good fire grill flavor. The fries were average. Nothing bad but nothing special either. I would go back if I was in the area. Bring cash as the credit card system is awfully slow."}
{"text":"The food here is the best the burgers and the pastrami's  and chili cheese fries and the beef dip are 10 + 10"}
{"text":"Burger place is awesome first time being here just visiting the Arizona area coming from Los Angeles the employees treat you with full customer service the manager give you respect and treat you like family very family-oriented. They must place to visit for a good fast bite to eat. What is great and affordable. I Give It 2 Thumbs Up"}
{"text":"Reminds me of Compton Cali! The \"Tams\"'so if you like the LA burgers this is the spot!"}
{"text":"The worst fucken place ever to much money for nasty ass food should've just gone to in in out for better food and quality and cheaper don't come here also this place is not clean enough they need a busser don't COME HERE TRUST ME !!!"}
{"text":"Two words: greasy goodness.

I suppose I should write more, since there is more to say about this little gem called Burger Shoppe.  The Shoppe is in what some would call a sketchy part of town, but that shouldn't stop you from coming by for some good food.  They have an extensive menu that includes great burgers, hot sandwiches and some Mexican dishes thrown in for good measure. I've had their cheeseburger many times and have never been disappointed. And, I've also had their gyro, which is very, very yummy.  And, their fries are fantastic too.  Crispy on the outside and warm and fluffy on the inside. (Ironically, that is also how I describe myself).

Another great lunch spot if you work near the Capitol. It can get pretty busy around lunch time, and parking can be a bit horrendous, but it is all worth it in the end."}
{"text":"What more can i say about this place it makes me feel at home it should he renamed the California Burger Shoppe it's amazing as soon as I walk in I forget I'm in Arizona the smell the atmosphere is amazing the people grilling and take your order are awesome so all in all the staff is cool the burger let me tell you are legit not on a flat top but they arreally grilled man the shredded lectus is crisp and fresh the tamatoes are perfect and the pickles are nice and crunchy and not over powering this place is one of a kind for the best burger in the Westside no not Lenny's or any other burger place the you can think off for the best burger you have to eat at Burger Shoppe it's a MUST"}
{"text":"BABY I AM........... Home??? 

Wow this place seems so much smaller than I remember it I said to myself as I walked through the doors. Sure there was the small outdated brown booths and view of a check cashing place to look forward to but gone was the original feel and owners of this temple to all things greasy. There seems to be a change in the pricing so the past information on the combo meals needs to be updated as well and there is an added Mexican food menu (to reflect) the neighborhood to look forward to. It has been so long since I have been here I decided to take a quick look around and see if they had kept any of the things that made this place so great. Yes they still make great burgers, need to get that out right now!! Wow why all the anger? It Is because I have to travel all the way to phoenix from the east valley to get a good tasting burger! I mean good meat cooked on a grill, topped with a big pillowy bun. Lettuce that is not brown, tomato slices that are not slimy and onions. The best Jerry the best!! (quote Kenny Banya- Seinfeld

For all the changes I am glad they did keep the food pretty much the same (smaller fries) however the one real change which I wish they would have not have made is the lack of staff. I stood off to the side looking over the menu as others walked in and the front counter guy just kept walking past them. No greeting or even a moment of acknowledgement in some cases. Yes I understand they are very busy but as an employee you should treat all customers as if they are the only ones in the place. People will come to your place to try your food but they will return based on the experience they have. Note to owners/ workers: Take a few minutes to serve up a smile with the plate of fries topped with steak and cheese."}
{"text":"I absolutely loved this place, I use to eat here all the time in Arizona. I grew up on it. When  they opened this location k was excited. Now they are permanently closed :(. I'm super sad that's why I gave it a 4/5 stars. :(
I hope you try again maybe in a better location? Green Valley might be a better choice. :)"}
{"text":"The food here is cafeteria food at best. The location is convenient as it is close to my office but after screwing up 90% of my orders I will never come here again expecially when the manager has the audacity to argue with me about what I just ordered. Her and her daughter need to take a year long vacation because they are doing an awful job never argue with a customer over a $5 burrito and pay better attention when they order.  You just lost a customer who buys breakfast every morning and lunch everyday good job!"}
{"text":"Usually pick up from here! Smells amazing! You also get a free drink if you buy food after 7pm. They have breakfast,lunch & dinner options. They have a family deal 4 Burgers, 4 fries & 4 drinks for like $28. Not a bad price.  I definitely think you guys should try it out. Also they deliver thru UberEats."}
{"text":"Great lunch, haven't had their dinner yet.  If you get the breakfast there do not get the breakfast burrito, it is crammed with potatoes and hardly any meat.  The hamburgers are pretty good."}
{"text":"Ordered cheeseburger, fries and small onion rings... Onion rings only because someone said they were good at this place.

20 minutes to get food, watched as my fries and onion rings sat on the counter for 15+ minutes of that. Burger sucked, fries were cold and tasted like old oil, surprisingly the onion rings weren't too bad even cold and stale.

Won't be back, ever. Service was bad, the food was bad, wait too long for bad food."}
{"text":"Just had the mexican burger it was pretty good! And the girl was nice she even let me finish my food while they closed up because I got there right when they were closing!"}
{"text":"Been coming here for years. There burgers and fries are good but the stake sandwich and onion rings are the best."}
{"text":"Huge selection, great people, fantastic food!
Just met the owner, this guy knows his food.
The restaurant's name is the only disappointing part, it greatly undersells the menu and quality of this diner.
Will be back, often!"}
{"text":"Will DEFINITELY NOT be back to this place!  The hamburger patty is like a big mac patty fro Mc'D's!  I got the chili burger because the kid at the counter suggested it.  I waited about 20 minutes....which was the least of the problems.  I ordered onion rings with it too.  The guy brings it to me & there's COLD CHILI on my COLD BURGER!  The bun broke like a cracker into several pieces.  The piece of cheese they put on top of it was cold & not melted even a little bit!  The onion rings were so damn hard....I couldn't even eat them because I thought I'd end up breaking a damn tooth!  Wow....this place is GUARANTEED TO FAIL MISERABLY!  Mark my words!  Save your money & go elsewhere."}
{"text":"great burger place with a huge menu.  good service too!"}
{"text":"\"oh look they are FINALLY opened\".... and after giving it a try, I will never go back!!  One star for the edible fries. When you walk in your taken back by the large menu and its $$ for the quantity tried a burger since its a burger shoppe, wrong choice, it was terrible the burger was a frozen beef patty (smaller then Mcdonald's cheeseburger) but with no flavoring, Just don't understand how the meat was cold inside they cook to order?? and the bacon was undercooked & chewy, trashed the bacon along with the beef.  Service was poor, Girl taking orders just stood there didn't say Hi, or  take your order so after a couple of uncomfortable minutes  I just started ordering. very odd. Woman who I going to guess was the manager was telling the other workers what to do because they all seemed lost.  When a man who was patiently waiting on his food, questioned if his order was correct they girl handed him a bag with a unsure \"ummm... yeah?\"  While I was waiting noticed the received a B rating wish I saw that before I ordered. Why a B when you just opened, not a good sign. But the WORST thing is there is NO bathrooms unless they are outside, they should at least have a sink to wash your hands very unsanitary, thankful I had a bottle of water in the car to poor on my hands yuck."}
{"text":"There is a lot more than burgers here.  The menu is pretty big and offers a lot of variety.  I have eaten here three times and the food has been consistently good.  Everything is cooked fresh.  The dinner plates are $1.00 more than the combos and come with a really good salad as well as fries and onion rings.  Get a dinner plate!

I had breakfast for the first time today and I will definitely be going back.

This is a small local business.  I think the owner does all the cooking
  
Give this place a try.  You will not be sorry!"}
{"text":"I just love the drive-thru service I get most every weekday morning. Mary Jane (\"Squirt\")is always so happy and puts a smile on my face. I love their french toast, pancakes and their breakfast special. It's amazing the difference a good employee can make.....it's the main reason I stop there."}
{"text":"Wow. Amazing. Had a burger and it was so scrumptious, so fresh. The prices are reasonable. Your food is made fresh so don't expect it to be ready in 3 minutes. People must be finding out about this place because it is crowded right now. Your food is served on a real plate, not paper, not plastic. Makes you feel like you are in a diner. I love discovering places like this. Wonderful."}
{"text":"Lunch break spot been gong here since High-school great eats for 30 plus years and still great"}
{"text":"This is not that bad of a place, this area really doesn't have to many burger joints. Besides your usual fast food franchise. I drive down McDowell a lot and never noticed this place until recently. I think this place recently opened?

Their menu really reminds me of Douglas Burgers in California, very wide selection. From your Burgers and fries to Burritos and Tacos. And everything else in between. This location was very clean and the people working there was very courteous. I was hungry, so I had a carne asada taco, and a chili burger. I was very satisfied with this. Might not be the best, but it was just fine. Their chili burger actually reminded me of Tommy's Burger, of course another Cali's burger shack. 

Overall I was very satisfied, and will come back from time to time."}
{"text":"So, yeah.  This place gets a bump.  I've eaten there a few times now and the food is consistently great.  The pastrami sandwich might be my favorite in town. The burgers are terrific.  All at an unbeatable price point.  GO."}
{"text":"WOW! This place use to be called Burger Factory, but the original owner took over it and changed it big time. The place looks really different and is worth stopping by!

I ran into it by accident and now a hardcore fan. The PRICES and the FOOD is awesome. Get the Pastrami sandwich and you wont be be disappointed. Today I had burger and it was one of best tasting burgers I've ever had in Phoenix since moving here 10 years ago (well worth the $10). Tasted like it was char-broiled authentic.  

I would say out of a scale 1 out of 10
Cleanliness : 10
Customer Service: 10
Food : 10+++
Parking: 9

CONS: They didn't have coca-cola but all well I settled for sprite."}
{"text":"I love this place it reminds me of the hamburger stands in my home town...long beach ca"}
{"text":"Not bad place, clean and fast! burger taste great, the outside might look outmoded, but the newly remodeled inside is great!"}
{"text":"Friendly staff, clean eating area, lots of seating available! & cheap food! Anything from Mexican food to a burger! I'll definitely be making a trip back soon!"}
{"text":"As soon as we saw the menu we just knew we'd be in for a treat. I ordered pastrami, a cali burger on grilled sourdough, and Breakfast!! The pastrami was the best I've had since visiting California!!! The breakfast is also done on the griddle which just makes everything better. The food was delicious and my family was happy and full. The customer service was awesome. This is my family's new favorite spot"}
{"text":"Crazy amount of choices to eat. Something for everyone. It's not just a fast food burger joint. It's more like a diner. Giant portions of food and everything made fresh. Great service. I can't wait to go back to try other things. And there's a drive thru in case I'm being lazy or the kids are sleeping in the car!"}
{"text":"I just end started a little project in the area and this place popped up on Yelp as open now, 6 am and with good reviews.   Large breakfast platter with items I ordered exactly as I expected.  It's clean and friendly full of regulars.  It ain't the Biltmore but I do not go there for breakfast anyway.  I want a breakfast like this from people like this with customers like theirs"}
{"text":"I'm not one of those assholes that \"takes away a star for a long wait\" so with that said, lets review! Be ready to wait. They cook it fresh, they're new, they're getting the hand of things still. BUT THEY COOK IT FRESH. I'd rather wait 10-15 minutes for a fresh patty that tastes like it just came off the grill, than have a bag handed to me 60 seconds after ordering like McDonalds. Price wise, you'll spend the same on a meal as you would as a McDonalds meal. Difference - it's cooked fresh and the fries are even better! I got the avocado burger, not sure what the hell my fiancé ordered but don't really care - I know they forgot his cheese so he had a hissy fit over that but luckily we're American and Italian so we have a whole friggin deli in our refrigerator. My burger was amazing!! Avocado was fresh, everything was fresh and clashed together so well! I don't know jack about foods clashing and what doesn't work and what does work.. But my burger was THAT good. The guy at the window was super chatty, on a normal day - I'd love it, I was tired though so just wanted to get our food and skedaddle! But customer service - 5 stars as well. They seem very personable and fun! I HIGHLY recommend this place! And if you're down the street at the McDonalds or Del Taco or whatever else is less than 2 minutes away.. I highly suggest you come to your senses and relocate your car to the Burger Shoppe's drive-thru or actual sit down area. You're welcome.

Oh, and I'd of posted a picture of my piece of Heaven, but I pretty much devoured that thing after the first bite. IT WAS THAT GOOD."}
{"text":"It just wasn't what I thought it would be...I was thinking there would be all kinds of burgers nope but they do serve everything under the kitchen sink from bacon and eggs, fish, mexican food. I was planning on getting a burger but saw the menu and got something different and as you can see from the picture it was a bad choice."}
{"text":"Love this place. Great burgers and lots of fries or onions rings complete the order! Highly recommend"}
{"text":"The breakfast is the star here..  Eithier the burrito or the plate.  Plate is cheaper then burrito but both are great for the price!"}
{"text":"This place is awesome has been awesome n will continue to be awesome.  The food is always good n the staff are always happy to help u in anyway they can.  I have been coming here for over 13 years and have never had a bad meal.  My personal favorite is the Colossal Burger and it matches the title to a tee. If u r in the area and want a good burger swing on by and give it a try u will not be disappointed!"}
{"text":"Not impressed. I can order a better hamburger from Burger King. The fries lacked luster and the bread for the burger was stale. The burger had no flavor. Maybe the Mexican food is better than the burgers.  I may return to try the Mexican food but outside of that this place is a no/go for me."}
{"text":"I went back in today. The health rating was up to an A and everything looked a lot better. I had the pastrami melt. It was really good. Their pastrami is top notch."}
{"text":"Excellent! Burger was juicy, chili cheese fries were awesome. Onion rings were crispy. We will be back! Would recommend you try it."}
{"text":"I was working in the area and went there today and had the double cheeseburger, which came to a little over 6 bucks. I watched them make it on the grill. It was much better than other places \"6 dollar\" burgers. Excellent burger! 

I would have given this place 5 stars if it was cleaner. Overall, this place is not bad, food is good and priced well. Would go back,"}
{"text":"I've been going to the burger shoppe for years now and haven't had a better burger anywhere and I travel a lot. I live in north Phoenix and will go out of my way just for a chance to eat here. Burgers are perfect. Breakfast burritos are big and delicious. And you have to try the zucchini sticks. Best of all the prices are really cheap how do they do it."}
{"text":"Went for lunch today with he wife and grandson. Had a great pastrami burrito, carne asada burrito and kids hot dog. Everything was good. Customer service was good. No complaints. 

If you have never tried a pastrami burrito you have to try this place."}
{"text":"Decided to try after seeing the Now Open sign.
The place is small & wasn't too busy. Ordered the Avocado burger combo. The burger & fries were a generous size-couldn't finish it all-so good!
The service was great; everyone was friendly!
There were a few interesting characters/customers there, but all in all a good old fashion burger joint!
Will definitely be back!"}
{"text":"I have it a 4 because of the burgers, but stay clear away from the chicken tenders. I don't even think it's real chicken! Such a let down considering the burgers are good."}
{"text":"Very good food and wonderful service. The onion rings were a little greasy, but the burgers definitely tasted like a home-made burger right off the grill. The fries were fresh and salty, and I love them like that! The fried zucchini was very good and it is so much more than it seems! I paid $4 for more zucchini than I would get at other places for double that! Very good prices and very good food."}
{"text":"Just a good solid burger place!! The burgers are cooked  to order over an open flame grill, and the fries are like steak fries! Yum!! The burgers are a good size and they have a buy one get one fry deal going on! They only have American cheese, otherwise I would have given them 5 stars! Also, the price is a little bit high for combo- $9.50."}
{"text":"Not the greatest.  However if one is striving for independence, you have to have a burger better than Carl's Jr or McDonald's. Doesn't happen here...I can't imagine a place that has 60 items on the menu and still focus on the quality of the output...Overall great service and nice people"}
{"text":"Let me start off by saying they're F***ING RUDE AS F***!!!! but I'll allow it for some bomb ass breakfast burritos probably the best I've ever had in the valley! their breakfast plates are pretty good too for $6 burgers are hit n miss sometimes good sometimes not fries are good too if u like steak fries ranch is fire!"}
{"text":"I have been watching and waiting for Burger Shoppe to open for months. Yesterday I saw the \"open\" sign turned on and tonight I stopped in. Turns out they have been open for one week. Still nearly brand spanking new.

It was quiet in here tonight. Like nobody-there-but-me quiet. Not that I mind. I prefer a quiet restaurant. But I do wish people would find this place and show it some love. They are new and no doubt will suffer some growing pains. But lets pull together and fight through that and help them grow.

Burger Shoppe reminds me of a place back home in California that I like to visit when I am there. There is something about that classic burger diner that I love. But it doesn't stop at burgers. There is a Mexican section of the menu too. Tacos, burritos, asada fries. Yes please. And there is a whole section dedicated to actual meals which include steak. Not bad. There are loads of choices when you come to Burger Shoppe.

Tonight I went big and ordered the colossal burger. That is a burger trimmed with the standard lettuce, tomato, pickles and onion. Then they top it with pastrami and toss in some thousand island dressing (or Russian?). It was a towering burger that was honestly hard to eat. The taste of the burger was fresh but standard. The pastrami added a punch of salt. They lost me with the bun. It was terribly dried out to the point that it was unable to hold itself together. Other than that, a solid burger. The fries were on point too. Not thin shoe strings nor steak fries. They were cut just right to crisp up on the outside while staying fluffy on the inside. And they were plentiful. And evenly salted. They didn't even require ketchup. Right on.

As I said, there are bound to be some growing pains. Like stale buns. Or trying to get their credit card kiosks and operating systems up and running. There was a fair amount of trouble shooting going on tonight. But come by and check them out. Burger Shoppe deserves a chance."}
{"text":"We waited 8 months watching with anticipation and it was worth the wait. Helluva menu, reasonable prices, excellent burgers fries and yes they had me at avocados! Chicken veggies salads American Greek Mexican polish sausage.    Breakfast lunch dinner we are going to try them all especially since we live in Cadence right around the corner. Yum!!"}
{"text":"Prettty good burgers. Very tasty only things I don't care for is there cold soggy fries  but over all food. Is awesome  just make sure they give you fresh fries"}
{"text":"First time ordering here today.  Like other's I was anxiously awaiting it's opening.  I got a Bacon Burger combo, a pastrami sandwich dinner, and a turkey sandwich combo for the family. Everything was on point.  The burger tasted great, the sauce they had on it was a good touch.  The pastrami sandwich was also good.  Large portion and it came with fries, the onion rings, and a salad!  You don't usually get that a drive thru joint.  The turkey was good too, basic sandwich, but it was good.  This place hits the mark in terms of giving some diversity in quick service american food that is not a chain.  So I definitely recommend this place and hope they continue to grow and business comes through."}
{"text":"We saw this burger shoppe with my hubby. I got so curious so after work, we went there and saw the menus!! So much to choose lol and yes there is a drive thru! I tried teriyaki burger....... its Delicious!! Big and satisfied!! Worth it and i am soooooo happy i found a gooooooood burger place!! And they gave us their phone number. You can call them ahead so u can pick them up later. This is good if u dont want to wait. But i hope sooner or later they can have delivery! I dont mind paying delivery fees.  10 stars for this burger shoppe"}
{"text":"I love this place because their burgers remind me of  those from Tommy's burgers & Tams burgers in Cali, which I miss so much. so glad to have that style here intown at this place. This place also has really good Chili cheese fries and Fried zucchini...simply bomb."}
{"text":"I hate to give bad reviews on food but this place does not compare to the same burger shoppe on Thomas and 35 Av. I had a cheese burger combo and the beef pattie kinda tasted like the sausage from McD's. ..call me crazy but true.  I also noticed that they'll pre deep fry the French fries, let them sit, and serve them from there. I doubt I'll get another burger from there again but will definitely return as they have a lot to offer on their menu -  hopefully those items are not as bad. I do want to give it up to the Staff however, as they have great customer service."}
{"text":"One word to describe this place is AMAZING!!!!. We move to Vegas 2 years ago from California and been looking for a good burger place . Well it's safe to say we have found it . This place is very clean service is great and like I said food is amazing. It reminder us of a Cali burger joint we go every get are in town . Burger Shoppe is the spot you must try ."}
{"text":"I really love this place. It reminds me of a little restaurant where I used to live in Los Angeles! They have similar items and serve Mexican food and all kinds of burgers and breakfast items. 

Been here about four times and will continue to come back as long as I can! I always get the cheeseburger with fries and a drink. The first time I came we were the only people ordering (we were in the drive thru) and I love that you can see them cooking everything while you wait. Sometimes it takes 10 minutes but it is worth every second. Everything is FRESH off the grill! Even their fries are sooooo fresh and crispy and amazing. 

We went inside the restaurant one of those times just to see what it really looked like. It's small, but very cute - there's condiments at every table! Didn't eat in, but will next time! Can't wait to see this place busier as more people learn about it. 

To be able to pay $7 for a meal that's FRESH every time you order is a steal! I can't wait to try everything else on their menu!!!"}
{"text":"The wait was long but It was our day off we had all the time in the world today, however the two cars behind us didn't and left. We ordered a double cheese burger with bacon and a side of onions rings with ranch. Paid $10.99 We went to the park and my husband and I split the burger. Delicious, fresh tasting and filling. Definitely worth the wait. Made for a huge satisfying lunch. I suggest dining in because it may cut down on the wait time if you are in a hurry. 

P.s. ranch was so good it's what all other ranch dressings aspire to be. So satisfied"}
{"text":"$2 extra for mushrooms? That's way too much for about 10 slices. Maybe less than that. The burger was average and so was the service. A double cheeseburger with avocado, mushrooms, and fries racked up to $14. You would think the ranch would be free but nope, they charge $.50 for each one. Only one came with the meal. I'm probably not going to go back."}
{"text":"So I came here thinking I was gonna get a great LA style burger but I was wrong. This place is not the real deal. Chilli cheese fries were horrible the Chilli out of a can watered down. The thousand island was OK but something was off can't quite put my finger on it. The star of the menu the reason i drove over a half hour the burger was under seasoned some what raw sloppy put together on a f..... paper plate with the bun all smashed after being man handled in the back by the under payed cook that doesn't give a rats ass what he puts on his people's plate. You been warned."}
{"text":"This is one of my favorite places to get a burger. They have a wide selection of different foods and I can order my food online."}
{"text":"Philly cheese steak was well done, plenty of meat though and it had decent flavor.
Burger came out very good. The have dinner plates available too"}
{"text":"Great choice for home style burgers and food. The pastrami sandwich is also bomb! Their deal for the 2 for is excellent and fries are always great! I prefer onion rings and they have some pretty good ones too :)"}
{"text":"Good quality burger, and fries! Reminds me of back home in Cali. Will definitely be coming back to try other things off the menu."}
{"text":"I have to agree with Lloyd. It used to be the next best thing to the pastrami and burgers like the hamburger stands in East LA. As the pic shows, the bigger half fit in the fry bag and when I mentioned something about it I got a deer in the headlights look. I guess it ia back to driving 5 hours for a quality pastrami. Burger Shoppe is turning out to be like their initials..."}
{"text":"I decided to try a new burger joint. Food was fresh and served quickly. The burger and fries were good, but the place could use a bit of remodeling."}
{"text":"I ordered a pastrami sub with swiss cheese for $9.19
the sub was small and the swiss I ordered ended up being 
fake orange \"cheese food\" not swiss. By the time I got back to work the sub was soggy and the fake cheese had stuck to the soaking wet sandwich wrap, requiring an extensive removal process.
And I had to pay $.60 extra for the fake cheese.
I wont be back."}
{"text":"Love it here! Me and my friends make it a point to have lunch here often..The fried zucchini is wonderful! Great little place in the heart of Maryvale..And well worth it"}
{"text":"Just tried this local place for the first time. We ordered 2 California Burger Combos from the drive-thru. The order came to around $20 - on par with a Farmer Brothers or Tommy Burger. Food is made to order, so don't expect a super fast delivery. But it was still pretty quick. When we got the burgers home, we were disappointed to find the avocados hard as rocks, and rather brown and even black. They were inedible. Being a major component of the sandwich, this was not good. Other than that, the burgers were very tasty. The fries were fresh cut and tasty as well. We'll try again...but they need to step it up."}
{"text":"This place is easily the best restaurant in the neighborhood. Although there are not many choices, the food here is outstanding. It's your basic burger joint"}
{"text":"If I could give this place zero stars on their customer service I would! I had Santos as my server and she was extremely rude. She had an attitude and she seemed to be entirely negative. I have never eaten here before and it is a shame because the food was amazing but the service I received was less then desired. I realize this is a fast food type of joint but I have experienced better customer service at McDonalds. 
It being my first time, I had questions about the menu and Santos couldn't answer a single question and she even rolled her eyes at me.  When she would speak she would mumble her words making it so that I couldn't understand anything. After I placed my order she didn't give me my number so I didn't really know how to get my food. I DO NOT RECOMMEND THIS PLACE TO ANYONE!!!!! GO TO LENNY'S BURGER INSTEAD!  
Also there is another location such as this one on McDowell. I'll be going there as opposed to this burger place, unless Santos happens to quit."}
{"text":"The food is ok.  But it's a sad state when a burger, fries and a drink costs 9 bucks or more."}
{"text":"Gross absolutely disgusting . You couldn't pay me to eat there again felt like throwing at the mean ass people who work this hole"}
{"text":"This place reminds me of the scores of \"Greek Burger stands\"  that exist in the Los Angeles area. They serve breakfast, lunch, and dinner but specialize in burgers, fries, onion rings, and deep fried zuchini.

They use an old fashioned flat broiler which produces the best tasting burgers. I had their Colassal Plate which consists of a pastrami cheeseburger, fries or onion rings, and a soda. Very well executed and delicious. I recommend. A bit pricy though....."}
{"text":"Great food. We love the Family Pack - 4 great burgers with fries and comes with a nice big drink! Affordable and good tasting."}
{"text":"Rating is for the breakfast. The American breakfast with toast, eggs, hash browns with a choice of bacon or sausage is sooo delicious. They make it fresh and usually it's a less than 10 minute wait time. Some day I may try one of the lunch/dinner options like the burgers and fries."}
{"text":"This place is less than a week old so patience is helpful but the wait is worth it. Being a recently transplanted So Ca resident, I was disappointed Vegas Valley lacked the burger fast food places that also have Mexican food, big breakfast burritos, breakfast, dinners and salads. And Chili Cheese Fries! Giving four stars as the food was worth the wait and the learning curve a new place needs to overcome I.e items not available yet, so help wanted sign in the window should help improve the service."}
{"text":"We tried the Burger Shoppe located on Thomas Road and had a great experience. We were hopeful for having the same experience at this location but it was HORRIBLE. The place was dirty, the help was unfriendly. When we ordered, they didn't even ask us if we wanted something to drink- so instead of bothering her -because clearly it was a chore to actually HELP a customer-- I just drank the water I had with me. 
We stood at the counter to get our food. Our fries had just been served up and were on the tray. The gal was just about to hand the tray to us when the original woman barked at her and told her she put too many fries on there. The girl then grabbed a handful of the fries and threw them back.
We ordered a side of ranch for 50 cents and it was SO GROSS. It almost tasted like mayo or tartar sauce. We asked for a new one. Tasted just as bad. 
Bottom line: don't go here. Thumbs down."}
{"text":"Usually go for the burger, u cant beat the buy 1 get 1, and it taste fantastic! Never go for the service, always rude girls working the front counter. However, I thought we'd change up our usual. I got a tuna melt (not horrible). We got my daughter a bean burrito, the beans were old and she didn't want anything to do with it, and this kid eats crayons! My boyfriend got the carne asada burrito, meat was ok but they just put anything in that thing to fill it. Potatoes, lettuce, and even some hamburger meat. If we ever go back again it will only be for burgers and NOTHING else."}
{"text":"Let me start by saying I used to be a big fan from back in the location at 27th Ave & Van Buren in my old neighborhood. I went very recently to the 35th Ave & Thomas location . I get a Best Buy that is $7.79 ( that is outrageous first of all for a burger, fries and a drink ). Be ready if you want 1 slice of cheese on that , it will cost you .54 cents for 1 slice of damm cheese that is probley processed with tax , you will be excepted to pay for a Best Buy with Cheese $9.00 , They young girl in the window who was young Hispanic with her hair in a nappy ponytail at the drive through was rude and unprofessional when I asked her about the price . She got a attitude and turned her back to me in such a rude manner and never said \" Excuse me while I get a member of management for you \" . I get this dude face popped out of the window, who I have seen since I was in high school working there , I am sure it is the owner's son. He was no better in fact he was a jerk who does not care for his customers . He was just as rude and the young girl . I guess she ratted me out for telling her to her face I would out this all over social media. This guy never introduced himself , gave me his title , name , nothing. All he says is what is wrong no \" Hello , My name is John Smith, I am the manager here. How may I help you today \". Who does that ???   Now I know where the workers think they can get away with such bad, rude and unprofessional behavior and treat loyal, faithful customers like shit. That is my main issue I had with my most recent stop here. The lack of clear lack unprofessionalism and rudeness of the team here. They follow the lame excuse for a so called manager who cant even handle his own team. The food at this location at 35th Ave & Thomas is Cafeteria Food, though I am sure you get better food in high school cafeterias . Expect soggy , uncooked fries from this location but not the 27th Ave & Van Buren location. Next time I will go out of my way and go to the 27th Ave & Van Buren location , where they treat you with dignity and respect always."}
{"text":"Reminds me of the burger joint back home. Good prices for big size burgers. I ordered the double chili cheese burger. I loved the burger tasty and juicy. The chili could be thicker a little runny for my liking but a great taste. Onion rings were golden, crispy and delicious. All I needed to go with that is a shake but they don't have it on the menu..hint, hint. Will be back to try something different."}
{"text":"Mediocre at best kind of expensive if you want to pay $10 plus $2.50 to make it a combo this place is for you not charbroiled and they were out of regular Coke and Wild Cherry Coke today not very prepared to run the business no signage for the menu"}
{"text":"I had a great and unexpected pastrami-topped burger and some fries here. Nothing about this place grabs your eye, it seems a little run down, and the neighborhood around it doesn't seem great. But they nailed my burger after a long morning, and I appreciated it."}
{"text":"I've always driven by and wanted to try. Super tasty burgers, so many options, crispy fat fries...it's a bit small so if you're more than 5 to a group, don't expect to sit together (although close maybe). I don't know how it gets at lunch/dinner rush so order ahead if you want to avoid the lines. The site it a bit tough to navigate on mobile."}
{"text":"I have to give this place 5 stars since it's the closest thing that reminds me of my fav burger shop in LA. They actually have that great thousand island dressing that is hard to find out here in AZ. The burgers are fantastic and the prices are great. I love their french toast for breakfast, again it reminds me of the mom and pop burger joints that they have out in Cali which are not that common out here. Let me warn you, this is by no means the healthiest of places but it sure does hit the spot."}
{"text":"Been coming here for years since I work a half mile from there. The burgers are good and freshly prepared. The burger special is a good buy, but the key find is the breakfast burrito which are one of the better ones in town. No frills and the menu has quite a selection. They are fast and generally consistent with good tasting food. Better than a fast food place"}
