{"text":"Excellent service and food. Cheap beer! Will return again!"}
{"text":"I had the pleasure of visiting Burgers N Beer Coventry on Sunday May 19 for the first time since the previous spot there McNulty's (where I spent many nights) had closed and I must say I was impressed, it definitely didn't look like anything I remember prior.....totally redone and I love it.....laid back quiet atmosphere for Sunday with just you and friend or a group...I will definitely be back had I not ate prior I would have for sure ordered some food so I will next time.....the drinks were awesome......You'll will see me again!"}
{"text":"The absence of fellow customers should have been my first clue something was not right but I wanted to try a new place on coventry out.The beer selection was rather poor given the name. My server \"inadvertantly\" added an additional beer to my bill then acknowledged she was aware if the error, was given a different beer than what I originally ordered (which I presume my server told incorrectly or simply thought I didn't know the difference). Burger was well done when ordered medium. Overpriced overall and not worth it. Will not be back."}
{"text":"Blegh. This place was not impressive at all. Located in the old McNulty's space, it's almost like being in a drunken, filthy, and questionable ghost town. I can still hear the bass beats pummeling my eardrums and see the frat boys hitting on girls in tissues-for-dresses, and said girls spilling their cranberry-vodkas all over each others plasticky stilettos.   When we got here, I was unsure of what to expect, but was also not surprised when we saw a big cavernous area with large windows, high ceilings and not enough of anything to fill it all up. We were also 5 of maybe 10 people in the joint, which made it even stranger. Our server was nice and attentive, but I think he was disappointed when we only wanted food and water. We clearly weren't sticking around for the evening.   The food itself was sub par. I was craving a burger (ie some juicy pink meat) and I ordered the deli burger for extra meaty deliciousness. I was sad to find that my burger was very overdone and didn't taste like much of anything. There were no seasonings, which could have helped since the meat was flavorless and overcooked. It was like eating a pan of completely browned ground beef and nothing else. The toppings themselves were better and I ended up eating them after I couldn't bear any more of the burger. Cheese and salami. I should have just ordered cheese and salami on that indulgent garlic bread, because there was nothing wrong with those! (I think garlic bread may not be the best choice for some burgers and I'm surprised it's not just a select option for some of them...)  My fiance got some wings and that mistake followed him the rest of the night.   It was nice to have a pickle on the side."}
{"text":"I wouldn't say it's my favorite burger but they are solid and the garlic bread buns are a nice touch."}
{"text":"Walked in at dinner time to an empty restaurant... Two bartenders flirted with each other the whole time we were there. Kids meal said that sliced oranges were a choice for side dishes. Our dinners I don't think are even worth mentioning they were so forgetable. After we got our entrees, it took an extra 15 minutes to get a side cup of canned mandarin oranges for our son. I am 100% sure that our waiter was actually sent out of the restaurant to a grocery store to buy a can of mandarin oranges to put in a bowl to serve to us. F*ing stupid. Do not go here. Please close this restaurant."}
{"text":"Two stars because our waitress was attentive (possibly because they were empty and she was bored).  Otherwise, travel elsewhere."}
{"text":"This place is a bust. I kind of knew it would be when we came in for dinner and were the only ones in the place, but still wanted to see for myself what happened of the old McNultys. So here is what happened: it looks and feels the same, but there are now tables where underage kids used to dance on the platform. The burgers are bland and mediocre at best, come a la carte, but worst of all are way overpriced for what you are getting.  I hate to say it but I'd stay away!"}
{"text":"I think over time,  this will become a nice neighborhood joint. Its very similar in style and vibe as Panini's. It still seems very new inside, and the fact that there aren't a ton of people going there yet makes it seem that much more new.   Dustin had the western burger, and I had the corned beef Reuben. The sandwiches and burgers are all a la carte, and sides are separate. I see that many have complained of this, but the sides seem large enough to easily share with at least one other person. The kids menu had all the normal things on it, and you got fries or orange slices with. We asked for the orange slices, and I guess were the first ones to do so. It seemed to take a long time to get the mandarin orange slices (like from a can) so they either couldn't find the cans, or had to send someone to run over to Marcs! Whatever, they came eventually and its not like my two year old noticed the difference.   Some others have complained about the wait times for service and food despite the lack of crowds. We did not have that experience! We were greeted immediately when walking in the door. The highchair was easily accessible and brought to the table with us. There was no issue when I asked for a substitution on my order. The server checked on us a few times, and let us know the oranges were coming, and apologized for the wait. I'm not sure if others expect their food to cook faster if its not busy, but food take time to cook no mater how many orders are in. We only waited about 15 minutes for the food to be cooked.   I appreciate a place that is kid friendly, but not too quiet (the louder it is the less people will notice my child's crazy antics!) We would come here again if in the mood for a burger!"}
{"text":"How are these guys going to survive with worse food and worse prices than the guys next door? I'm not going to say who the competition is, but let's just say they're cold blooded.  Went one night after work my colleague got a burger and I got the nachos. The nachos only redeeming quality was the jalapenos. The cheese was completely flavorless. Colleague said his burger was overcooked and leathery. Sorry guys, I'm headed back to the old stand by."}
{"text":"I wish zero stars was an option, I'm actually in the restaurant as I write this review I have been waiting 30 minutes for a draft beer. When I asked for some help I was told it was impossible to get help from anyone but the person who is currently doing a terrible job. The apparent manager is sitting across from me eating, relaxing having no care for the current abysmal state of her restaurant. I won't be back any time soon, a place like this does not need to be on Coventry. Don't worry it won't be here in 6 months if they keep treating people like this. Also this place is brand new please explain why two people are working and the manager is enjoying a relaxing evening in her knockoff Uggs sparkly boots literally not a care in the world. Needless to say she won't be able to afford those when she loses this job, which she is terrible at"}
{"text":"Burgers N Beer is in the location that used to be McNulty's Pub. I looked up the reviews of the old Coventry staple, and found this assessment:  \"1. Are you a frat dude? 2. Are you underage? 3. Are you a creepy old guy looking to pick up someone underage?  If you answered Yes to any of the above questions, McNulty's is for you.\"  Considering I have to plead guilty to one of the above three (not the last one), I suppose I'm a bit biased. Even so, I think it's fair to say this place was better as it was before.  I've been to Burgers N Beer twice now, and both times the vast empty space was a bit intimidating. Maybe it fills up more during lunchtime, but as far as I've seen this location is much too big for this restaurant. The plus side is, of course, that service is relatively quick and you get a lot of attention from the servers. The first time around, the owner himself was walking around and asking how things were.  Appetizers are fairly standard; the spiral cut fries are nothing special, though you do get a lot. The loaded fries are especially massive, don't try to undertake an order by yourself.  The burgers here are actually quite good, albeit a bit pricey. They are about the size of a B-Spot burger, which is slightly smaller than most restaurant burgers. But like B-spot, they are still plenty large enough to fill you up, and considerably better than what you can get elsewhere. All the burgers come on what appears to be half a loaf of garlic bread. The stuffed burgers may seem underwhelming at first sight, but  the good stuff is on the inside. Fries have to be ordered separately, which is disappointing.  The beer selection is okay, and fairly cheap. If anything this place might be a good alternative to come drink if price is an issue, though the atmosphere leaves a lot to be desired.  So overall, while the burgers are good, this place doesn't seem to stack up compared to its Coventry neighbors. For a great beer selection, go to the Wink. For a good restaurant atmosphere, almost anywhere is better, unless you're looking to avoid a crowd. And for cheap drinks? Well, once upon a time we had McNulty's for that. Burgers N Beer is an unhappy replacement."}
{"text":"My fiance and I have ben waiting since spring 2012 for this place to open. And finally around late November we finally checked it out (becuase finally it was open past the summer 2012 date).   When we walked in, the resturant seemed virtually empty. We actually almost thought it was closed. Then someone quickly spotted us and seated us close to the bar area, which is in the back left side of the resturant. We were then greeted by a server who gave us the daily special and the happy hour special.  First thing that made me a fan was the $1.25 Killian's. Honestly the cheapest price I have ever had for a beer I greatly enjoy. So they got me with the price and the beer quality served. Then, my fiance and I ordered some Onion rings, and as requested they got it out to us before our meal. the server assisted us with what to order, and we got our drinks in a timely fashion.  when our food arrived the burgers were sereved with a garlic bread and I believe sides were ordered seprately. I had a jalepeno stuffed burger which was not disappointing and filling. Honestly, I just wanted someting to eat while I was drinking cheap Killians. The serever provided checked up on us regularly, and ensured that the food quailty was good.   In conclusion, i think this place is great if you are  going for Happy Hour. the drinks are cheap, and the service is pretty good. It seems sparse, but you dont like crowded, loud, areas to eat and drink (and drink on the cheap) its a good place for you. However, the cons are the burgers are a bit pricey, but the concept of the different burgers are interesting. So I guess its worth the price (I havent had anything else like it), but honestly it should be closer to $6 becuase no sides are served with the burger.   I would visit this resturant again, espcially for Happy Hour."}
{"text":"I have been waiting to try this place for months as it had a coming soon sign up forever.  I love burgers and I love beer so how could the combo go bad?  I feel bad about only giving 2 star since the service and people there all seem very nice.  That being said, I cannot see this place lasting.  The menu consists of a long list of burgers and a few sides.  The first shocking thing about the menu is that there is no choice of sides with the burgers... because they don't come with sides.  At $8 plus for just a burger, they had better be amazing.  They are not amazing.  I had a veggie burger which was a frozen prefab patty that you could buy at any grocery store.  Almost $8 for that and not even any fries?  You must be joking.  The garlic bread buns are good, but come on.  That is BS.  The WAY overpriced order of onion rings were also crap... oily, burnt, too big, flavorless.  A joke for about $5.  Winking Lizard is practically next door.  Go there.  This place, honestly, sucks."}
