{"text":"I got the burrito bowl. You get to chose what you can put in it like at Chipotle. However, the \"bowl\" is a plate that gets what you chose to be piled on. That is the only thing I would change is the plate to an actual bowl."}
{"text":"Burrachos is a fine Mexican establishment to get a burrito. It compares very well with the other well known Mexican establishments like Qdoba, and Chipolte.  It is very similar in pricing, quantity, and most importantly quality. I ventured to this place with my good friends Alex N. and Bri W.  Alex enjoyed a monstrous burrito with the barbocous Beef and Bri enjoyed a heaping plate of nachos with its wonderful Queso. I myself had a chipotle Chicken burrito. After devouring our lunch we all seemed satisfied and content with out lunch decision. 

So points of concern. Their pinto beans looked like Busch's baked beans. They were tasty but there was a little original concern. Also their Queso was a little thin causing Bri's chips to get soggy fast. 

All in all ,for less than 6 buck a piece, it was a good quick meal. I recommend it if you are just wanting to stop, pick up something ,and eat it when you get home."}
{"text":"Burrachos is locally owned but the men who use to own kwik trip. The ingredients are fresh and they offer some fun foods. I think that Burrachos chips top those at either Qdoba or Chipotle but far. In addition, the queso is amazing. Its a plus for me that the chicken is all white meat as I do not eat dark at all. The carnitas are good for \"fast food.\" While their prices are a little bit higher than the competition the food is worth it. Only down fall for me is that the shop is a little cold and unwelcoming."}
{"text":"I have been to both locations and both times have had decent experiences. I know that both under went management changes about a year ago. So, I'd like to say that they've gotten better than when they first opened; however, I cannot speak from experience, as I only visited after the change. I am not a fan of the lime and cilantro rice; however, when fresh their queso cheese is amazing. I usually stray away from the burrito (it's simply too many carbs for me); however, when I have ventured into the land of carbs it seems to be a decent burrito. I highly recommend the nachos, if you are eating in. To be exact, chicken nacho with corn salsa. The Sun Prairie staff is espically nice, and if you frequent enough, some will remember what you normally order. Considering this is a chain, I'll take it."}
{"text":"It's not bad. It is also hit and miss. Tonight,  the food was not very warm and the chicken was dry. Last time I was there it was better.  For what it cost, it was filling and not horrible. That said, pancheros on the west side is better. They make fresh tortillas. The tortilla I had tonight was warned up, but still a little stiff.  I think they could do better. Even just rotating the good they have on hand would help. If it's a slow nigh, having a whole line up of ingredients sitting sort of sucks.  Better than subway next door."}
{"text":"My husband and I have lived in the Sun Prairie/Deforest area for a few years and just finally got to drop in for lunch! We stopped by around noon on a Saturday and we had our food made up within minutes.

The staff was extremely friendly. The restaurant itself was very clean and all the windows were great.

We'll be back!"}
{"text":"We originally came here for a happy hour because Burrachos sounded so close to \"Borrachos\" (literally meaning drunks in espanol). Well, they don't serve alcohol. It is a nice clean place with fast service. I've definitely had better burritos in the area at local competitors."}
{"text":"I'm happy to say that after having successive bad experiences at Burrachos in Middleton the establishment has taken a turn for the better.  In addition to my review I sent in a comment via their website and received a apologetic response from the newly-appointed store manager.  He made several immediate changes which were apparent the next time I stopped by.  The staff were all friendly and the burrito was made properly.  I've returned several times since and have always had a decent experience.  I've tried several of the different burrito options and I've found that the carnitas pork is actually quite good, while I found the chicken to be a bit dry.  So I'm happy to say that this place has gotten better, and also that giving feedback can actually make a difference.  Who woulda thought?"}
{"text":"I was pretty disappointed with my entire visit here. The service was SO slow. We waited in a line of six people for about 30 minutes. I considered leaving around 15 minutes, but decided to stick it out - big mistake. The food was cold, and really had no flavor. All I tasted was tortilla (I had tacos). The restaurant was not clean, the staff was not friendly. With all the similar restaurants, there is no reason to go here. I walked out disappointed that I wasted my money on cold, mediocre tacos. Learned my lesson."}
{"text":"I loved this restaurant, was obsessed, went twice a week. However I went this past week and they got WAY smaller containers that are literally half the size as before and they are still charging the same amount. The lady assured me that they were the same size, absolutely not honey. Very disappointed because I always thought so highly of this place. I understand them down sizing and wanting to change containers but do not charge me full price for half of the food you used to serve. I won't go back."}
{"text":"Just felt like the Multiplicity version of Chipotle. Same concept just not well executed. Didn't seem like a value for the money"}
{"text":"Many companies try to copy the Chipotle model and fail. Burrachos isn't bad food, but comparing it to Chipotle is unfair. This is similar to comparing McDonalds to Red Robin. Sure, they both have burgers and fries, but the similarities end there. Same with Burrachos and Chipotle. The caliber of the food isn't the same.

You order at the counter, starting with your basic dish. In my case, I went for the burrito bowl. They asked what kind of rice I wanted, and my choice was brown or white. I chose the brown as it is the healthier choice. I knew the Chipotle model was not being copied as soon as the rice was being dished up. Rather than some scoops of rice, the rice was measured out into a thin layer meant to cover the bottom of the plate.

I was then asked if I wanted beans or vegetables. I went with black beans. Again, rather than getting a decent scoop of beans, they were measured out and placed atop the rice. Same for the meat. Same for the salsa. Same for the cheese.

The taste and texture of the food could best be described as \"fair.\" My ground beef tasted overly seasoned and dry. That's a personal preference, as I know some people will prefer that, and I can't fault Burrachos with it. The rice was crunchy in some areas. That is something that should never happen. Properly-cooked rice should always be soft and never crunchy.

It is easier to suggest the restaurant model more closely matches Subway, where everything is measured down to the wire versus Chipotle, where portions are scooped out and unmeasured.

The price was in the ballpark of Chipotle, Qdoba and similar-modeled restaurants."}
{"text":"Nice ingredients, priced right, mellow atmosphere and all the noms for growing boys. Queso blanco is yummy."}
{"text":"There are lots of places to get this type of burrito these days.  I think this is one of the best choices.  I find the quality of food to be very good, the prices fair, and the employees have always been friendly and really seem to care about doing a good job rather than just performing their corporately mandated duties.  Their dessert bars are also excellent and taste like home made!  I've had plenty of Chipotle and Qdoba in my days, all are very near to me, and I prefer Burrachos."}
{"text":"I llike this place. I've heard it called the Subway version of Mexican food, which is pretty true. You get in line and order your basic item (burrito, tacos, other things) then customize it as you sidestep down the counter. One thing to remember: you get a lot of food. Last time I got a burrito and ate the whole thing and regretted it. Not because it wasn't good, but because I was like a python that had eaten a wildebeest. 

The food isn't fancy, but I don't think it's any worse than Pedro's, and for a lot less money. Also, you can drink beer! I love a fast-food place where I can booze it up. 

The people who work there tend to be a mellow bunch, which I also like."}
{"text":"Not good!  It's like Q'doba's tasteless cousin.  The burritos were warm for 2 bites then cold the rest. The kids meal was pitiful.  Save yourself a bad experience and go to Qdoba."}
{"text":"I was apprehensive about eating here for lunch. I had read some not so great reviews online. My co-worker said we should give it a shot... So we did, and we were pleasantly surprised at how good it really was. 

I actually like Burracho's better than Qdoba or Panchero's. I had the chicken quesadilla, my friend had chicken and steak nachos. Everything was delicious! Prices are a little on the higher side, overall I'd say they were pretty competitively priced with Qdoba and Panchero's with more superior food offerings."}
{"text":"The food at Burrachos was surprisingly fab. I ordered the \"Classic Burracho\" and it was perfect. The queso here is super gooey and delicious the tortilla strips add irresistible crunch. I vote better seasoning and meat than chipotle/qdoba.

Definitely not light on the calories, but as far as fast food and build-your-own-burrito places go, a this restaurant is worth a try."}
{"text":"I've been going to Burrachos for years.  Between the usually cold food, and inconsistent portions depending on who is serving, I continue to be disappointed.  If there was another burrito spot in Sun Prairie, I would likely not return - but they currently have the corner on the market so I persist.  It's expensive for the portion sizes, and the staff look like they are just going through the motions.  Immediately after every time I go I swear I will never be back, but a few months go by and my penchant for Mexican food gets the better of me."}
{"text":"Portions are skimpy and the preparer forgot about our quesodilla until we reminded him and by then it was burnt.  He remade it but forgot some of the ingredients.  We weren't offered anything for the 2 screw-ups.  We won't be back."}
{"text":"It has been 6 years since I last went here, almost to the day, and not much has changed besides the staff. We went here right at lunch time and were surprised to see just one, little old couple sitting in the dining room staring at us like \"what are you doing here?!!!\" The staff behind the counter immediately pounced like they were bored to tears. I ordered the same exact thing I ordered six years ago. A veggie burrito with brown rice, black beans, corn salsa, guacamole, and lettuce. My dining companion ordered the barbacoa burrito with everything on it. 

I love second chances bro. For me, for you, for everybody unless you murdered someone. However, Burrachos second chance went down the tubes. The burritos were not good. The guacamole was mushy and bland, the corn salsa was just heat, no flavor to the rice or beans, the lettuce had that nasty, bitter taste to it that makes you go TING! as your eye twitches, Neither of us finished our burritos, and that is pretty serious. 

Now some of you might be saying \"well you didn't get any cheese or sour cream on yer burrito!\" and you'd be right. Homey don't play that. But know this, I can go to Chipotle and get the same exact burrito, and it is just soooooo good that I forget that dairy even exists. This just isn't the case at Burrachos."}
{"text":"Dry and bland.  There is nothing memorable or special about this place."}
{"text":"I hate to compare but think Chipotle... this is the style of restaurant you're walking in to. You enter a line of endless choices, bowl/burrito or nachos. Basically you substitute rice for nacho chips. 

I went with a bowl; cilantro white rice, chicken, corn salsa, sour cream and cheese. I love the dual cheeses! The corn salsa was different but still good, it had more of a plain salsa taste to it. Chicken was wonderfully seasoned. 

My husband also enjoyed his chicken/steak bowl and my stepson had his steak bowl devoured in minutes. I was worried the portion was too small but it ended up being a couple bites too big for each of us so that's good! 

Line went quick but it did get pretty busy. Definitely a good lunch for us."}
{"text":"Similar to Chipotle or Pancheros. I'm sure devotees of those two places can tell the difference if they ate here, but I can't. Overall, it was good food that filled me up at a reasonable price. Definitely good for a quick lunch or dinner. A good substitute for Chipotle or similar if you're in Sun Prairie."}
{"text":"As always the food service and atmosphere is excellent. I always order the burracho and have never been disappointed. I have brought friends and family here and everyone went home happy. The staff is friendly and my order is always on point. This is a frequent stop for me."}
{"text":"Good, but not great. Sometimes the food tastes fresh - sometimes i doesn't.  Good space and friendly people."}
{"text":"I disagree with the other reviewer. This place is MUCH better than Chipotle or Qdoba. Fresh ingredients, attentive staff, and a clean dining area. Far more choices too than the other, more well known franchises.  Check it out. You won't be disappointed."}
{"text":"This is another one of those places where it is what it is.  Don't come in thinking it's the be-all, end-all and you'll be fine.  It's basically like Qdoba or Chipotle.  There's nothing overly special about it, but nothing wrong with it either.

I got a chicken burrito.  It was really good.  I liked it.  It was overloaded with toppings.  I can't hate.  Was it beyond expectations?  No.  But it was solid and I didn't feel like I overpaid.  

I'll go back in the near future.  

Oh, and try the Boylan's Root Beer.  It was unique and good, if you like root beers."}
{"text":"Cold flavorless burrito. Didn't feel liked roving all the way to chipotle.  Won't make that mistake again."}
{"text":"Good food. Clean. Yummy chips. OK service. A bit pricey for what you get. We had two steak burritos with one order of chips and just 2 waters. About $20"}
{"text":"Skip these franchises. Very poor quality guacamole, it was not fresh, as in, it was some kind of long life guacamole, and they were very skimpy on the portions. Go to authentic Mexican restaurants for good quality/price/proportions. The staff were attentive and smiling."}
{"text":"I am a big fan of this Burrachos! 

We have ordered from here numerous times for catering in my office. It is always a huge hit and people *always* ask where it's from, as they like it so much. 

The food just seems really fresh and delicious. The chips are crispy and wonderful. The queso, omg. It's dangerous. The shredded lettuce is also something that should be noted.. It's not wet or soggy or watery like some places tend to be. It's very good and easily a foundation for a taco salad if you're not into a burrito or nachos. 

The staff that sets up the spread has always been incredibly friendly and does a great job presentation wise. It always look clean and professional. Also, they are never late - that's awesome!"}
{"text":"We stopped here on a spontaneous lunch date.  Being a Friday at noon, the restaurant was busy, but not packed.  The food was fresh, but most exceptional was the service.  The employees genuinely smiled and interacted with their customers.  They were pretty quick-we were fifth in line and seated with food in less than 10 minutes.  Tables were actually being wiped down between customers which is unfortunately becoming less common these days.  I would go back and would recommend this place."}
