{"text":"Great quality food served by great qyality staff. Awesome food for an awesome price. Would definately recommend!"}
{"text":"Huge portions
Washroom kinda gross I'm always skeptical of restaurants with dirty washrooms
Very nice people 
Slow service 
Good food"}
{"text":"The most amazing food and friendly service.The portions are 

huge and choices are great.Also the only place open on new years Eve.Keep up the great work Anooshen.regards.Rashid"}
{"text":"This was my second time here and it's safe to say that I will now be a regular. The beef tacos and burritos are delicious - jam packed with toppings and flavours! They give you very generous portions as well. The prices are affordable and definitely worth every cent. They also sell Jarritos drinks! Yum! Stop by this place whenever you get the chance. You won't be disappointed!"}
{"text":"Better than their competitors, you know...the boyz. Great selection of fresh toppings and delicious sauces. Try the jalapeño sauce if you like a burrito with a kick."}
{"text":"Really good burritos! Portions are amazing and the ingredients are always fresh. If you're looking for good food and friendly service, you should give this place a try."}
{"text":"The food here is so amazing! I still haven't had the quesadillas but I've had the ground beef, steak, and crispy chicken burritos (a small is huge and so filling!) beef and steak tacos, supreme fries and churros and everything is just so tasty. The service is great, the people there are always so nice. My friends and I love this place and we will continue to come here, and also, all the food comes ar a great price."}
{"text":"Really great food with even better service the people really care about you and what you order. 

The burritos have the taste to back it up and there is many different kind that you can try. 

I have had the shrimp and chicken burrito and the both get an A+ in my book. 

I would recommend this place to a friend and I will be going back."}
{"text":"Great staff and even better food! Was in the neighbourhood and was craving for some Mexican food. Found this little hole in the wall and what a treasure I have found. I ordered the crispy chicken burrito with a lime Jarrito. My friend had the Beef Steak quesadilla with a combo. It was only an $2.50 upcharge to get the combo! what a great deal!! I love that there is no extra charge for the toppings, you can have as many toppings... and oh are they generous. I am a sauce girl and I love my sauces. Their burrito and chipotle sauce are just divine. I will be back, no doubt about it. For a meal that filling for less than 10 bucks. I am a happy happy girl!"}
{"text":"1230pm on a Friday and they are closed. What a joke. Did they go under? Hate businesses that just work whenever they feel like it. Sucks driving to find this out. Won't rely on them again."}
{"text":"Came by on my lunch break from work one afternoon and upon initially entering the restaurant looks wonderful, the seating was nicely laid out and it was very clean. The staff was also extremely friendly and very helpful. 

As for the food I was very excited to be getting halal  Mexican food as it is pretty rare in toronto haha, so I ordered a steak burrito. Overall the burrito was very well put together and the topping blended well , I just found the steak meat to be very chewy which wasn't pleasant. The burrito also kind of fell apart towards the end but I guess that's something that can't be helped. I plan on visiting once more and trying a different menu item and maybe it'll be a better experience."}
{"text":"Excellent food! Particularly useful for Canada's Wonderland goers who don't want to pay an exorbitant amount of money for half a fry at the park. The ground beef burrito is fantastic as well as the crispy chicken burrito (my boyfriend's order). The ingredients are fresh and the staff is very accommodating. It was around $20 for both our orders and it kept us full all day. There's also A/C in here and their drinks are nice and cold (perfect for a hot day). Definitely would come back :)"}
{"text":"Little mom and pop shop. Has a newer renovated look to it. Very clean. was treated excellent. Worker was very friendly and helpful. Very upfront and honest. Burrito was packed, large variety of toppings( they give you as much as you want) and homemade sauces& guac. lots of meat aswell. They give you a good portion of guac at no extra charge.  For 4.50$ extra you get any drink and there supreme fries which is like a whole other meal on its own( comes with meat and any burrito toppings) best value of any burrito place in Vaughan no doubt. Tasteful and fresh however definitely not authentic Mexican flavors. They are also on uber eats. Good spot just kind of weird flavors sometimes. They are under staffed on busy nights ( Friday, Saturday) sometimes tastes are not consistent. I've waited a really long time on several occasions. Will give it an overall 4 for their selection and variety as well as homemade sauces but a 3 for the flavor."}
{"text":"This place is hands down, delicious. One popular meal that most students get are the Supreme fries, very crispy, very tasty with the variety of topping and sauces."}
{"text":"To start off, the pricing rating on Yelp for this place is wrong. I paid 9$ for a single small size burrito (Large just contains more meat, thats all) and that's not even including guac which is not free btw as other reviews say. 

For another 3$ or 4$ you can get fries and a drink. 

The burrito itself wasn't bad but it also did not stand out. What completes it is the sauces they offer. 

The location itself is decent. No WiFi though but they do have a Dre Beat Pill...yeah that's the sound system. Ohh and there also is a BitCoin machine there...incase you want to buy a 500$ coin while you wait for your 9$ small size burrito

I'm pretty sure they use the same fries as Costco"}
{"text":"Stumbled on this place while driving through the plaza.  They have great food, especially for its price. They have their own homemade sauces. Their jalapeño sauce got my attention. Definitely worth trying.  Got their supreme fries. Ended up sharing it, too large to eat to myself. Would definitely come back and try more of the items on their menu."}
{"text":"Had a chicken burrito today and the quality of the chicken and burrito was amazing. Service was friendly and I would definitely go there again, probably one of the best burritos I've had in a while."}
{"text":"Can't argue with a nice fat burrito with a variety of fresh toppings for 10 bucks!  I stopped in for a fast lunch in an area teeming with restaurants.  This is a burrito bar kind of place, but also has a seating area in case you are not into having burrito drippings all over your pant legs and car seats.  

I had the ground beef burrito, assembled exactly the way I like it, and a Jarritos soda to go along with it.  Everything is fresh and juicy, as evidenced by the puddle forming on the table.  It was all pretty good, especially if you are not a fan of spices and seasoning.  I mean really, not in favour of bold flavours.  This was a great burrito, and I will be back should I develop an ulcer that requires me to avoid the hot stuff and spices."}
{"text":"The service here is very friendly but also very slow. I think that speaks to the quality though because they make everything to order, and it comes out very hot, very fresh, you can see them firing up the chicken in the back as you place your order.

The food here is good, lots of options for your burritos, however the burrito I had was the crispy chicken burrito and it was very dry and didn't do a lot for me. The poor lady behind the counter kept asking me if I wanted more sauce or salsa on it, and I realize now she was trying to tell me \"hey dummy, this isn't going to be very good if you don't balance out that chicken\"

So that's on me. 

We also tried a few other items on the menu like the quesadillas and the steak burrito and they were just fantastic.

So don't go here if you're in a rush and listen to the lady behind the counter if she's trying to hint something at you, but otherwise I'd definitely check this place out if you want some good, quality mexican food."}
{"text":"My girlfriend and I were in the mood for some mexican food and seeing the positive reviews for Burrito Squad on Yelp, we decided to check it out.  The owner of the place is a warm, friendly person and gave us excellent service.  I ordered the Large Steak Burrito and she had the Crispy Chicken Burrito Bowl.  The ingredients were fresh and there were multiple toppings and sauces to choose from, including the burrito sauce (mayo based), chipotle BBQ, sour cream and mild salsa.  We also ordered the Supreme Fries and Guava Juice.  The portions were large, the prices were fair and the food was delicious!!  We will definitely be back in the near future."}
{"text":"I think this is as 'meh' as a burrito can get.

Came here to grab a bite before we went to Wonderland, and man were we overwhelmingly underwhelmed. We got the Crispy Chicken Burrito and we've concluded that you come here to fill yourself up, not for the taste of the food. It's pure sustenance to prepare you for the whole day because damn the burrito was huge, dry (oh so dry), and lacking of any exciting flavour what so ever.  Even with habanero sauce, jalapenos, and whatever else we put in our burritos it was a challenge to scarf down. 

The only redeeming quality is the Costco fries they serve. I've heard the Supreme Fries were pretty good? Maybe just get those and the various Jarritos flavours they offer."}
{"text":"Had the chicken burrito. Loved it!
Very fresh and large portion size. Very nice owner. Will definitely go there again"}
{"text":"Found this place after Wonderland. Great burritos and quesadillas. Service is super nice. Could use a few more seats but the food was superb!"}
{"text":"Decided to come to this little hole in the wall for a late night bite. We ordered the chicken burrito bowl and the ground beef burrito. These were definitely tasty and very flavourful. The chipotle sauce is amazing and I love the fact you can put as much toppings and sauces as you want! Guac is NOT extra!! To add, it definitely isn't Mexican, but some kind of fusion Tex mex/middle eastern food. Besides that, it's definitely delicious and fresh food! 

UPDATE: 

Came back here for a quick lunch, music was so loud I could hear it from outside, there was trash on the floor and tables. I ordered a small crispy chicken bowl, lettuce was wilted and soggy, tomatoes tasted off and sour (I made my friend try them as well and she said the same), I couldn't even put guac on because it was brown. Overall I was disappointed by the cleanliness and really did not enjoy it at all. Went to pita land right after."}
{"text":"Dropped by for lunch... Got a chicken and a steak burrito... 

Crispy chicken seemed more flavourful...
Steak was tender..

All the ingredients seemed fresh and the portions were quite generous.. Burritos in hand was quite heavy... I appreciate the habanero hot sauce.. Had the right amount of kick... 

Service was welcoming and friendly... Seems like a mom and pops family run place...

Food prep was a bit slow thou even thou it seemed a bit slow at the time..

I'll likely visit again next time i have a burrito craving..."}
{"text":"Parking: Free - big lot with easy to find parking.

Washrooms: One bathroom - relatively clean?

Experience/Venue: When I ate here, I asked for a spicy burrito. The Burrito Squad attacked me in the bathroom the next morning and I was late for work. These guys are thugs.

The size of the burrito only means you're getting more or less stuffing lol."}
{"text":"Good food at reasonable prices. They give generous quantities, I think the rice can be improved just a little."}
{"text":"Ordered one large ground beef and one beef steak burrito with the wife. Quality was ok but there was not enough meat, seriously, for $10 each? It was mouth fulls of veggie and carbs. I gave up eating half way, would not want to see what a small is, apparently even less meat."}
{"text":"These guys are right food is fresh! Cooked to order. I got the fish tacos, the fish is just fried a little dry, I was expecting beer battered which is my fave but it was not. I got everything on it with chipotle sauce pretty yum. I also got the supreme fries definitely a must have, that was my fave part. Just like Taco Bell but better and more. My bf got the chicken and the fish burrito. Needed more tomato, just should of asked for more. Needs guacamole and beans needed to be cooked more they were on the hard side. Not sure if we would come back although they are cheap"}
{"text":"Delicious halal burritos.  I had the fried chicken burrito.  It's a shame it's far from where I live otherwise I'd go regularly."}
{"text":"We drove quite a distance to come check this spot out. We saw the yelp reviews and wanted to see what the hype was about. This place went above and beyond my expectations. The service was phenomenal and the food was so good! I ordered the ground beef tacos and filled it up with their fresh toppings. So mouthwatering! Definitely will drive back!"}
{"text":"I had the cravings for burrito for lunch. Having a short lunch time I wanted to place my order pior for pick up. I called 3 times giving them 10 minutes apart. They did not answer any of my calls. My lunch is ruined now.. I'm starving."}
