{"text":"My mother and I were on our way home from grocery shopping when we decided to stop in for dinner.  
This was our first time here and we will be back.
I had the chicken bacon ranch on a wrap and a small order of fresh cut fries. 
Mom had a half Italian hoagie with everything.

I'm picky...And I enjoyed my wrap except the bacon could have been cooked a little longer.
But I'm not going to let that be a overall ruiner. 
The fries were great too...Next time though, I'll add cheese or gravy...They definitely needed some kind of sauce to dress them up.

Mom really loved the Italian...Fresh bread and meats were especially delicious.

I think next time I'm going to try the Buffalo Chicken roll....Or wings...Or the pizza, lol"}
{"text":"I'm addicted to this place I live right down the road from it and I can't stop getting their ice cream I recommend this place to everyone their Pizza is really good too and don't forget the amazing milkshakes I'm really glad I get to live down the road from here so I can have it every day"}
{"text":"This place is awesome! It's one of our local favorites!!  A 3 topping x-large pizza is only $12.99!!  This place is a jem.

The ice cream is great too!!  Forget about the chain pizza. This is the place to go to."}
{"text":"Very good food I ordered the spinach calzone and it was awesome , ordered the breaded cauliflower appetizer and a large house salad good as well. The delivery driver was very nice."}
{"text":"Always liked their pizza but got a large 3 topping today and was very disappointed.  Very skimpy with the toppings.  Was told the pizza would be ready in 45 minutes arrived to pick it up 5 minutes early and it was already sitting out.  Not hot.  I will give them another try because I have been satisfied before."}
{"text":"This is a fabulous place to get good food at a great price!  I ordered one of their lunch specials today and it was only $6. It was a one topping small pizza, a can of pop, and a desert! (Get the home made ice cream sandwich...the best!) It was really good food and I didn't feel guilty at all for eating lunch out because of how affordable it was!  I found out about Buster's from a coworker who is gluten free. They have a gluten free pizza that she orders about once a week. She said its fresh and less expensive than the frozen one you would get at a gluten free store. Honestly, I don't have a bad thing to say about Busters."}
