{"text":"So I was in the area and after hearing a lot of stories about the place, decided to have lunch there. Place needs some renovations but their low prices and wonderful tasting food completely make up for it. I ordered the veal parmigiana with rigatoni and it delicious. The tomato sauce was amazing and I would be very surprised if it was store bought. My buddy got the veal parmigiana sandwich and it actually looked better then the food on my dish. His was cheaper too. My dish also came with some delicious garlic bread.  My bill came to just over 12$. As I thought about it more and more, I felt like this place deserved more then the tip I left them. Will definitely leave 30% next time I go there. Definitely recommend to anyone in the area. Was also jealous of the pizza that the people at the next table ordered. Pizza for sure next time."}
{"text":"This is the best take-out pizza I've had in Toronto (by a long stretch).. It brings back memories of how pizza should taste... As a bonus, it's pretty good value compared with the chain places and the eat in section is really comfortable."}
{"text":"Came here with some work friends! Cozy restaurant and staff friendly! I didn't think the pizza was anything special but the lasagna was great! Homemade and very tasty! Their house wines are also pretty good :)"}
{"text":"Was hungry for pizza, looked up pizza delivery on yelp, read the reviews, and so I looked online for menu. Website was plain. But had what I needed to see. Called had a pleasant conversation and ordered a large pizza with pepperoni, bacon, Italian sausage and extra cheese, and a veal parmesan with hot peppers and mushrooms on a bun. It didn't take a long time for delivery. I must say my husband and I were pleasantly surprised. We were sad that they missed the sausage on the pizza. But it was perfectly baked, the veal was tender and flavorful. The marinara tasted homemade. And the price was right. I am eager to try the rest of their menu."}
{"text":"I dropped in today for lunch and had a good veal parmigiana sandwich and a drink for $8.50 taxes in.... the veal was hot, the bun was fresh, the mozzarella cheese was plentiful and stringy... mushrooms and peppers were good but could have used a few more to make it perfect. 
There was a steady flow of customers that were greeted as regulars.... the place is small... seating about 25-30.
I like to support the mom and pop restaurants so I will definitely drop by again if I am in the area."}
{"text":"I just ordered from Buzz Buzz tonight,  If I could I would give it a 3 1/2 star rating.  It was better in a lot of ways that your typical chain store pizza with fresher ingredients and more like homemade pizza, but a few faults kept it from 4 stars for me.  The delivery was reasonable and the pizza was very hot when it arived. My only major complaint was that the crust was over done.  The crust was almost as hard as a bread stick, even when hot and fresh and was a little on the bland side.  The toppings were a little uneven, but there was a decent amount on the pizzas.  The price was great and so was the service."}
{"text":"I have been eating here since the 80s. Amazing place. I'm more in love with their Greek food that they serve. Souvlaki, pita, salad, rice and the yummiest potatoes!!!!  Their garlic bread is my fav. Great price, great food and friendly atmosphere.  Must go if your near Yorkdale."}
{"text":"BuzzBuzz! Is the defacto pizza parlor for our office.

We are big time repeat clients. The pizza slices are good, while the veal sandwiches are better. if you're eating in, you'll find the decor dated, but it's part of the charm.

All in all, very reasonable prices and quick service."}
{"text":"I was craving pizza and happened to see the signage of Buzz Buzz Pizza while driving. The area that this place is located at is kind of ghetto and rundown so beware. I ordered a pizza with two toppings. I was shocked because I was expecting it to be mediocre but it was actually delicious!!!!  I wish I lived closer to this place because I would order from this place once a week. It's unfortunate that it is located in such a ghetto area.  I can see ppl not being tempted to come in because of the sketchy area, poor signage, and the lack of modern decor. If I ever happen to be in that area I will be sure to pick up a pizza!"}
{"text":"The pizza is good with wonderful taste. I like the fact they use real bacon chopped up on the pizza. A large with 2 toppings is $15 including tax. This would be enough for 2 adults 

I would order again based on the other reviews."}
{"text":"I usually go in for a pizza slice...........today I decided to sit and eat some right from the oven pizza.
Ordered a small Pepp, Mush, Grn Pepp....................they made a mistake and made me a medium.
They charged me for a small............10 points for excellent customer service for doing this.
I had a coffee with my pizza.....coffee was very good................better than MOST other places.
The pizza was properly cooked, so that the bottom has some char spots, the crust is slightly crispy, but not too much.

The sauce had a nice balance to it............as someone else mentioned, just a slight spice to it somewhere.
The other toppings were really good.
The only very minor detail they may want to address......try to even the toppings out more......pizza seemed to appear \"centre-loaded\".
Still tasted fantastic though!!!

I will be back time and time again.................I may venture into a chicken parm sandwich next time...........who knows???

Definitely recommend for lunch or dinner......MILES better than PP or PH.............."}
{"text":"Wasn't sure where to order delivery at my hotel. Very pleasantly surprised. Pizza was delicious. Arrived hot and was in my hotel room about 20 min after I called and ordered. Felt like prices were good too. I'd order from here again."}
{"text":"A little family owned place with gold veined mirrors on the walls and a multitude of sports pics with various little league kids. The store seems to support a lot of local sports program's and I like that. (You just don't see these displays in the big corporate 'joints'). I have been here a couple of times now and haven't been disappointed in the food.  I really don't like pizza, but they put some kind of spice on theirs that really gives it a unique and nice taste. And the toppings? They load on whatever you ask for, they don't just 'sprinkle' them.  Last time I had the pork souvlaki and it was great.  The chunks of pork were huge. I couldn't finish it all and the seasoned potatoes I kept in the fridge overnight and served with dinner at home next day.  Best to call ahead if you're doing take out as nothing is pre-cooked, it's all done at time of order, so you might be waiting a while. It's cheaper than Pizza Pizza and waaayyy tastier. I highly recommend this place if you're in the area!"}
{"text":"We used to work down the street from this place they loved the pizza but I didn't like it that much. I loved the spaghetti from ther but now my company has moved from there. I now go by and pick up several containers of there meat sauce, both my wife an I really enjoy it. I do recommend trying there food I don't think you will be disappointed"}
{"text":"Lol - this was way overhyped. We were excited to try a non-chain pizza spot in Toronto. Read the reviews and thought sure let's try this. No taste at all. Wouldn't order again. Also they told me two different prices on the phone and upon delivery."}
{"text":"One of the biggest surprises I've had in Toronto. The place doesn't look that appealing from the outside due to its location but it's Toronto, so the food is what matters. I think it's a family run restaurant. The server was super courteous and the pizza was great. Didn't end up spending more than $7-8 for lunch got almost half a pizza with a pop. Can't beat that. It also wasn't just a standard pizza. It was a GOOD pizza to my surprise. I'd go back there for lunch in a heartbeat. It's nice to walk into a family run place this well in a big city like Toronto where anyone can get lost in the big name restaurants around town."}
{"text":"Was here on Monday after my intended restaurant Forget me not Cafe was closed for the day.

Loved the pizza, when I finally got it.  The place was packed which is a great sign.  The people were nice and the pizza was fresh. Now I have another place to go on Wilson."}
