{"text":"By the Way Cafe in the Annex sort of has the feel of eating at a friend's house, as far as the space goes anyways. It has all the elements of a cozy space that just feels comfortable and easy to relax in. 

No complaints as far as the food goes either. By the Way has a decent sized menu with enough on it to keep most people satisfied. Despite being busy, our food arrived hot and was cooked perfectly: softly-poached eggs for the bennys, light and golden fried crust on the calamari. Where By the Way loses some points is with the service. It seemed to take forever between times the server came to our table. So overall we waited quite awhile to get, well, everything, but the quality of the food made up for most of those waiting times. 

This may be one of those places that is completly hit-or-miss, but the time I was there, the food was defintiely a hit."}
{"text":"It's never a good sign when there's a \"Help Wanted\" sign hanging in your restaurant window 10 months out of the year.  How badly do you treat your staff when you're not able to keep any for more than 10 minutes?  Unfortunately for Annex-ers By The Way is the ONLY breakfast/lunch place that's even 1/2 descent in the area.  So, if you're on the search for 1/2 descent then this is the place for you.  Just don't expect your server to be terribly knowledgeable, she's probably only been there as long as you!   Oh, and don't complain to the owner...he'll tell you that they're been there for 35 years so they \"must be doing something right\".  That's the kind of answer you want when you're forking over $20 for a burger they screwed up.  
So they've been there 35 years but maybe it has more to do with a perfectly positioned patio and shafting employees than it does with food and service.
Please someone, OPEN A NEW RESTAURANT IN THE ANNEX!!!"}
{"text":"For an early saturday morning breakfast, btw proved to be a good choice.  Nice outdoor patio, friendly service and an interesting array of omelette choices; different ingredients and cheeses provided interest and variety. Our table ordered three different omelettes and they were all good, served with crispy home fries and a toasted bagel. Worth a try if you are in the bloor and brunswick area."}
{"text":"Came across B.T.W Cafe as a result of another restaurant in the west end not being opened yet.  Got there @ 12pm ish, about a 30-35 seat restaurant.  We were seated after 5 minutes, so not bad, as I could see this place having line ups out the door.
My brunch date had the eggs benny with spinach & home style potato's. 
I ordered the \"sandwich\"... wanted to be different from what I was seeing around the other tables... good choice!. The multigrain bread toasted perfectly, FRESH & slightly chewy, the chicken breast grilled nicely, with pesto, goat cheese & grilled red peppers (maybe throw in a few more peppers for extra tastiness, if the owner/chef happens to read this).  The fries that came with the sandwich, I requested \"no salt\" added.  Yummy, shoe string fries cooked nicely, dry, lightly crispy & hot in temperature.  It's easy to screw up fries.  Undercooked, burnt, over-salted, or cold.  They got it right on today... hopefully their consistency remains the same for my next visit.
Both of us had coffee & it was a good brew.
The service was good, we never felt rushed, rounds of coffee & water refills were constant."}
{"text":"The food here is hit and miss, but the service is something you can count on to be terrible. I've been here for brunch about a hundred times and for dinner about 2-3 times.  I like the mediterreanean eggs special that isn't on the normal brunch menu, but it's on the weird and sloppy handwritten one.  That's my favourite dish there, so I rarely switch it up because it's too risky.  It is quite expensive here for what you get and for how badly you're treated at times.  

One time, I tried to go for casual drinks with a friend at the restaurant's near-empty patio on one cool, summer night only to be told by the waitress that she wouldn't ordinarily allow people to sit on the patio if they patrons were \"only having drinks\", but she would let it slide this time.  WTF??  It wasn't even the dinner hour, it was a weeknight, and there was only one other couple there!  I was appalled and embarrassed by HER behaviour.  We gulped down our one drink each and got the heck outta there."}
{"text":"I just got back from dinner at this cafe. It's in a cool location in the Annex. The staff is nice. They have a decent selection of beer. I had the chicken kebab. I thought it tasted quite bland. I got vegetables for 4$ extra, and they also tasted bland and there were few of them. The atmosphere is OK. With all of the other great options around town, I wouldn't go back there."}
{"text":"A bit crowded, but cozy. Great service, too! I ordered a cheddar omelet, came with hash browns, fruit, and a bagel and jam, all under $10. The food was amazing, I'll definitely come back here."}
{"text":"Servings are small but often delicious: the Eggs Dilemma is worth trekking up to the Annex for. Tasty food but I could often eat two of anything served (and I'm not a huge eater, before you ask!)."}
{"text":"In Toronto for a long weekend and came across this place on a search for breakfast. The patio area was nice, reminded me of a hippy restaurant on the beach. The service was good, the staff was very friendly and the food came fast but not too fast where you couldn't enjoy yourself and relax. We had the french toast sandwich with Brie and apple and an omelet with sun dried tomatoes and goat cheese, hashbrowns and a bagel. Very filling and a good start to a day of sightseeing."}
{"text":"We were there for breakfast this morning. Very limited seating only about 12-15 seats but being early it was not packed. I had an omelets and it was delicious. Came with hashbrowns and bagel. 
Very good service quick and easy .
Very impressed.
 Only downer was the debit machine was not working"}
{"text":"OK guys so here's the deal. The place is open earlier than most joints in the area so that is good for the rare times one is up before noon on the weekends. The fruit bowl that my partner ordered was quite good and she enjoyed it quite a bit. Service was average, nothing spectacular. Seating is ample outdoors and in but just my luck I got seated in the window where I was blinded during the whole meal. The coffee is pretty good, but not strong enough to knock out morning cobwebs. Finally my meal was fine but not fantastic because someone went overkill with the toaster on my English muffins. When you get your bill at the end you will be aware this is not one of the good value places in the area. Worth a stop if you like to eat outdoors in the summer on a patio or if no seat is available elsewhere."}
{"text":"Excellent service, very sweet staff, delicious food, and a great atmosphere. 

Made a reservation online for 7 people on a Saturday and it worked out perfectly. All my friends were well taken care of, even my friend with dietary restrictions. I ordered the Meze plate and everything was delicious, especially the Baba Ghanoush!!!! 

Woohoo!!!!!"}
{"text":"my food was average, coffee was good though. Expensive but had friendly service"}
{"text":"This place lacks consistency in the kitchen and with the service. 

I have been here a few times and everytime it's a new experience. I was in yesterday and it took the waitress 15 minutes to acknowledge and then another 10 minutes to get coffee, another 20 minutes for food. She didn't say \"Hi or How are ya?\" or  apologize for making us wait so long, or was friendly at all, she just came took our order and just plotted the bill after she took our plates. Didn't ask if we wanted anything else or more coffee or anything. 

That being said I have been to the restaurant and experienced wonderful service from other waitresses, who might be more seasoned than this waitress, and always managed to stay friendly and on top of things.

The food is really good,but I have found at time if you get the eggs benedict one egg will be hard while the other will be runny- just simple things like that is what frustrates me.

I really hope that management gets more staff in or better training, or something to improve the experience."}
{"text":"I used to live in the Annex and we'd go to By The Way regularly for brunch.  I've never gone for other meals but brunch.

In the summer the patio is great.  It's big and the sun shines right on it.  In the winter, the restaurant gets very crowded and there are frequent waiting lines.  

The food is pretty good.  I really like the different eggs Benedict.  They use an amazing dill sauce that just keeps you coming back.

Service is ok.  Usually pretty friendly but it does take some doing to get their attention for requests and the bill.

I now go to By The Way when friends are in town or I simply want good egg Benedict."}
{"text":"My wife daughter (6mo) and me went there this morning-already open 5min before opening hours. That was a good thing, as 15 min later nearly all tables were filled with people.
Very attending waitress which brought a included glass of tap water and took flawlessly the orders. The menu is reduced to two sheets of paper, but that is definitely IMHO the better option as offer much crap.
The eggs came perfectly stirred with potato-mash (name here:fries) , very very nice set up so the eye had its fun as the stomach.
All together: excellent service, good food, no point to argue about"}
{"text":"Great patio, quick friendly staff, the food is great, the coffee is better. Bad review people are braindead. Only complaint is often have to wait for the bill a little too long."}
{"text":"AMAZING FOOD!! 
I have been here a few years ago when travelling to Toronto and recently came back. I was pleasantly surprised with how consistent the food was. Excellent each time although years apart. Great burger and their fries are to die for. Great job guys keep up the great Cafe!!"}
{"text":"THE GOOD:
Fresh brunch foods and refillable coffee that is better than average.  Had the goat cheese omelette.  Delicious.  I would definately return here.  It was pretty busy when we arrived at 11:30 on Sunday.  Would pop in around that time or earlier to ensure seating.

THE SO-SO: parking is on bloor so depending on what events are going on in the area, you could be circulating the streets for a while.  Parking free up to 1 pm on Sunday's so arrive early to park and brunch before the meter starts.

THE BAD: none"}
{"text":"We have been coming here for years, the quality of food and service always bring us back.  This place offers one of my fave brunches, eggs charlottine with a creamy dill sauce. (and I don't like dill). We get the house made hot sauce to balance it out (spicy harissa). Potatoes are cooked with onions. Dinner is less busy, offers great options like perfectly cooked calamari, tabouleh salad and delicious burgers. Great spot for family, single or especially a date"}
{"text":"This is a favourite brunch spot in Toronto. Their patio is great for people watching and the service is fast and friendly. Eggs florentine w the special dill flavoured hollandaise sauce is a must try - divine! Recently renovated it is even nicer in the winter months. Cozy and reminiscent of Europe or NYC.  Vegan and licensed. Enjoy :)"}
{"text":"I'm honestly surprised by the poor reviews from other people, I suppose it all boils down to what you order. However that being said, the service was amazing and our waiter was really attentive, he came by to check on us from time to time.

Came here for late brunch after making a regrettable decision of not making reservations at the two other brunch places we went to, I took a chance on By The Way and it didn't disappoint. Tired as well as hungry and not in the mood to go hunting for yet another brunch place we decided come to By The Way. Although, it was packed we were quickly seated and brought menus.  I order the Eggs Charlottine which is a smoked salmon and spinach eggs benedict. The order came with a side of fries. The dill hollandaise paired really well with the smoked salmon and spinach. The dill in the hollandaise sauce made it refreshing and didn't make it seem so heavy. The portions were a good size. The decor was quite nice."}
{"text":"Great outdoor patio with covered seating. Coffee is strangely spiced but good. The huevos rancheros and omelettes are delicious. Decently priced for what you get."}
{"text":"Hmmm.. I'm a bit shocked at the other reviews. I lived a 5 min walk from By The Way Cafe for 2 years and I visited By The Way Cafe quite often, but only ever for a quick coffee meeting or a long delicious brunch. Once I had a surprise party there for my girl friend. We managed to seat 15 on the patio - the wait staff were very patient with us. All in all, I would save I've been here 15 times and have never had a bad experience.

I really really love their eggs benedict (I've tried them all, but my fave is Eggs Florentine) because their 'hollandaise sauce' is not greasy but a nice light lemony dill sauce. Their coffees are great. The drip coffee sometimes has a cinnamony under-taste to it. The lattes come in a big comfy bowl-mug."}
{"text":"$4.52 for a small Americano, to go. And it took 10 minutes to make, though the restaurant was completely empty. Do I really need to say more?

The food is OK, I've eaten there twice before, but considering there are a hundred places with basically the exact same menu less than a block away (or there's always Grapefruit Moon a few blocks away, if you want actually good food for reasonable prices), I guess it's just indifference and out-of-towners that fill this place up.

It's not for people who care about food, or value."}
{"text":"Had a fantastic experience here for Valentine's Day. After our original plans fell through, we were lured in rose petal covered tables by candle light. There was a price fixed menu for a four course meal at about $100 for both. 

Got soups and salads to start, oysters and scallop skewers second. Got steak and gnocchi for mains, and cheese cakes for dessert. 

Service was fantastic, but our food took longer than we would have liked. They may have been going for the intimate and paced dining experience. However, we are efficient eaters and would have liked to be in and out in much less time than two hours. The food was good, but nothing blew me away. No issues, just no heroes in our edible line up. 

Competition on Bloor is stiff. I'm happy to have gone on Valentines. I'm not sure I would on a regular day."}
{"text":"I like this place okay, especially for brunch - their bagels are very good.

I think it's safe to say that it's a little hit and miss, though.  One time my wife got a burger that was inedible because it was so undercooked.  I am all for a rare burger, but this was just not cooked which isn't the same thing.

Also agree with others who say that, even though it's okay, there are better options around."}
{"text":"It's been a few days. I don't remember exactly what we ate. I remember four of us dropped in at lunch on a sunny Sunday with no reservations, were seated immediately, were served by helpful and friendly staff. (The expediter was a little glum, but I'll get over it some day.) Yes, the tables were too close together, but the food was tasty, and it came with more delicious fries than we could finish."}
{"text":"A reliable brunch spot with consistently good, fresh, non-greasy breakfast items. Based on the food I would give this place 4 stars, but the long wait and small size of the restaurant leave me giving it a 3. I understand there are smaller venues, but there is not much room for customers to wait inside without awkwardly hovering over other tables or getting in the way of servers. A few times I have waited outside for a table to open up, including in the winter when it is cold out.

One time when I went for brunch, I waited 20 minutes outside, which was fine. What was not fine was after we had finished our meal, we were promptly brought our checks (when we all still had mimosas and coffee left) after paying, we were asked to leave since there were other customers waiting for a table, despite having unfinished drinks. 

The omelettes are a generous portion and the potatoes are always quite yummy. The coffee is quite good as it has a hint of a cinnamon flavour to it."}
{"text":"The best part was the rosé. Everything else was pretty subpar. Ordered the \"crispy\" calamaris. Nothing crispy about them, they were soggy and flavorless. Hummus was no better than what I could buy at the store, same with their pitas. My friend had the tuna salad which he described as bland. Completely disappointing and way overpriced for the crappy quality.

At least the service was decent."}
{"text":"We were on our way to am early afternoon screening at Bloor Cinema and wanted to grab a bite to eat beforehand.  We stumbled upon BTW and decided to try it since we had both never been.

We were seated right away, served beverages almost right away.  We ordered our food also relatively quickly.  No complaints about slow service at all.

We were sipping our juices and coffees and I noticed a group of three walk in.  The guy beside us had just left (freeing up a table for 2), and there was only another table for 2 available.  I decided to interfere with things and offered to move to the other table for 2 so that the group that just walked in would be able to sit together.  We hadn't gotten our food yet, so it was an easy move.

My freshly squeezed grapefruit juice was delicious and refreshing.  I ordered the craziest thing I could find on the menu - a French toast sandwich!  Basically, they stick sliced apples (cooked with cinnamon) and slices of brie cheese between two pieces of French toast.  They give you syrup in a small dipping dish and plenty of fresh fruit.  It was just heavy enough, yet not gross.  Admittedly, I was starving - but I scarfed down my meal pretty quickly.  Delicious!

My date enjoyed one of their exotic soups - large portion, and seemed to be quite thick.  I never paid attention to what he ordered for his main... but I don't think there were any complaints.  I was too busy devouring my meal.

I was impressed that they weren't mixed up after we moved to a different table, since we ordered at one, and received our food at another.  Then, they did something that won me over - when they brought our bill (again, this part of the process did not take long) they told us they discounted everything by 15% because we were so kind to change tables to accommodate the other diners!

It truly wasn't a big deal for us to change tables, since our food had not yet arrived.  I hate stuffing my face in front of the starving people in line, so it just seemed like a sensible move to me.  I'm glad BTW was so grateful and appreciated our gesture.  It's not often that you get surprise discounts like that!

Great food, great service.  Will be back!"}
{"text":"I had a fabulous meal here for my gf's birthday. I ordered a poultry special, that arrived in the form of a leg of chicken, *perfectly* cooked, juicy and seared wonderfully. It was laden with a cream sauce full of mushrooms, and came with seasonal vegetables (cauliflower, green beans and carrots), and was sitting on a bed of potato gratin. It was all seasoned perfectly and was spectacular. I'm a total food snob, and way too places places screw up chicken or don't season enough. I was pleasantly surprised!

The service was excellent as well, very kind staff that even made an accommodation for a friend due to food restrictions. I was impressed. Many places don't give a shit.

Local oatmeal stout from a local brewery was delicious. Cozy atmosphere. Baba ghanoush and pita bread was fantastic! Will be back!"}
{"text":"My husband and I stopped off at By the Way Cafe for a light dinner after exploring the area during a recent trip to Toronto and we were pleasantly surprised.  We dined in the patio area as it was a warm evening and had a great time!  The service was was quick and friendly and the food was delicious.  I started off with the soup of the day which was a tomato and lentil soup and it was absolutely scrumptious!!  They have an extensive menu, but you just can't go wrong with their chicken kabobs and basmati rice.  Not a crumb was left on our plates!!"}
{"text":"First time I went (a few years ago) I wasn't very impressed.  This year we decided to give it another shot, they have upgraded their look and it is much more pleasing and inviting than it was.  We go to this place for breakfast some times, the scone is delicious, the eggs are pretty yummy, coffee is good, service is good.  All round a good experience.  :)"}
{"text":"We were attracted to this place because of the nice outdoor patio. The food was pretty good, but the service was super slow."}
{"text":"Always wanted to check out this little spot near my place so I finally went for brunch last week. For the price (45 for two) it did not live up to my brunch desires. We got the steak and eggs and the huevos divorciados. Don't get me wrong, it wasn't bad at all, it just wasn't what I was expecting. 

I do have to say I love the atmosphere of the place, and the staff was great too, it just wasn't my favourite spot I've ever been too. I do always believe in second chances though so maybe I'll try going for dinner or lunch one day! Sadly Not everyone can be the queen-b of brunch."}
{"text":"Because its pricey, tight and only somewhat tasty...

Stopped in here on a Sunday night for coffee and dessert.  Its nice in a very Toronto-ee , eclectic-ee kind of way.  They do have a patio that looks like it would be fun to hit in the summer.  However, for atmosphere and quality of service and food... I felt like everything on the menu was over priced. 

All I have to say is... $3.00 for a coffee that was brewed with Cinnamon,  when your sitting in a cramped place that looks like a renovated bakery at Christmas -- its a little off putting... If you are an average cafe -- then you should have an average price.  Not be an average cafe and overpriced.

Recommendation;
The caramel pecan cheese cake was quite good.  However this place is not somewhere I would try again because...


it's pricey, tight... and only somewhat tasty


Made a dessert stop
'By the way' is overpriced
Mediocre food"}
{"text":"I don't get the harshly negative reviews for this place! It's the kind of food and the kind of space, (with a nice patio right  on Bloor) that really puts the \"home\" in \"homestyle.\" It's not *stellar* but it's comforting and good quality.

The eggs benedict (of which there are a few varieties - you can get it with spinach, smoked salmon, etc.) are nicely done, as are most of the breakfast items (great French toast!)

Their standard menu is a little bit weak in its content. It offers light fare with a Mediterranean/Middle Eastern slant, including salads (the Nicoise is nice), a burger, kebabs, and platters with tabouleh, hummus and/or falafel.

Fortunately, the extensive and often rotating specials list usually has something eye-catching enough to warrant a try, especially the daily soups - most recently, I had chilled borscht with a punchy, just-picked beet flavour and soft tacos with chipotle beef, refried beans and salsa verde. The food might not knock your socks off but it is made well, simply, fairly quickly, and with good ingredients. 

I am quite fond of the fries that come default with any of the sandwiches - they're of the little, curly, crisp filament type, and have a satisfying salty crunch. I'd eat a whole plate if it wouldn't probably give me a stomach ache afterward. 

The service could be better - a bit rushed and inattentive - and though some people have noted that they find the prices off-putting, I certainly didn't mind paying $12 or somesuch thing for a tasty soup and sandwich with fries and a chance to kick back on their shady, comfortable patio."}
{"text":"Came here for dinner & drinks with a friend. There was room on the patio on a warm Friday night which is rare! We had beer & a burger/lamb kabobs. They were fine. The better part of the experience was just sitting on the patio enjoying the sunset & people-watching on Bloor. It's lively but not extremely loud so you can have a conversation without shouting. This is a good place to catch up with a friend or maybe take a date.

Our server seemed a bit hard of hearing and busy with other tables, but otherwise service was okay. I'd come back for patio drinks but would skip the dinner menu next time."}
{"text":"I've been here for brunch and it was okay. Service was good. Food was mediocre.

I came here yesterday and was fairly disappointed. The chilled gazpacho tasted like canned salsa that they just poured into a bowl. 

I came in here craving pasta but the servers highly recommended the fish... I believe it was called the BC snapper with veggies and rice... I'd say the dish was a 2/5. It tasted really weird. The flavors didn't really go together. It was sweet, then creamy and a bit sour from the artichokes. The sauce was what threw me off. If there's a next time, I'd pass on this. But I really should've trusted my gut and gone for the seafood pasta. 

The service was horrid. Good luck getting your glass of water refilled. I had to ask for a refill which is unheard of! The staff lacks customer service - or my server did at least - and fails to pay attention to detail."}
{"text":"This place is good.  Had brunch yesterday (Eggs Charlotte) that was quite nice.  Possibly the best brunch in the Annex.  Big menu, tons of options.  My friend had a lamb pita that he said was great as well.  

GREAT patio, that features live jazz as well, which of course I'm a supporter of.

Decent coffee, and a very good latte.  Our server was really great, offering up suggestions, quick coffee refills, even though she had a bunch of tables.

Will definitely be back."}
{"text":"BTW is a reliable brunch spot that is open when other things aren't. It's nice, but it's nothing to write home about. It's in the centre of the annex, which is fantastic for a stroll around afterwards. There is a nice patio, prices are average, food is average, service is average. They open early, though, if you're into that."}
{"text":"Went here for breakfast in a weekday. Pretty empty. I got goat cheese and sun dried tomatoe omelette. I think it tasted very good, it came with home fries (fried with onion, not crispy), bagel, butter and orange piece.

Coffee was normal, not very tasty,  but had refills. Staff were very friendly and nice.

Overal a decent experience."}
{"text":"Came here because my friend and I are always passing by and meaning to try it and because Insomnia was going to be an hour wait.

Was immediately seated (! Amazing considering it was 11:30am on Sunday). Got the brie and mushroom omelette ($11). It was ok.  My friend got the omelette with cheese, ham, veggies and hot sauce ($12, hers was pretty good).  The omelettes came with a slice of orange, home fries (not crispy but quite flavourful), and a large sesame bagel.  We were pleasantly surprised by the size of the omelettes (pretty big). We also liked that the food didnt taste/feel heavy or greasy.

Coffee was decent. Service was quite good. Server was attentive and checked in on us and gave a refill of coffee without asking.  

Great option if you're looking for a decent brunch with good service and you don't wanna wait to be seated. Will definitely come back :)"}
{"text":"I've eaten here a number of times over the years and have come to realize that the quality of brunch just keeps going down. What began as a convenient place to go for brunch in the summer and enjoy the sun on their lovely patio has become a pretty blah place to go to with meh food on a good patio. 

Last time I went I had the Huevos a la Mecicana. My eggs tasted really weird. I couldn't tell if they were old, if the cheese was old, or what was wrong. But the whole thing just tasted off. I couldn't even finish my meal. It was really quite awful.

I'm willing to give BTW one last chance to see if that was maybe just a one-off. The patio is quite nice that I'm willing to try another meal to enjoy the sun!"}
{"text":"Great food and atmosphere each and every time I go. I usually go there for dinner with either husband for a more intimate dinner or friends for great food and drinks. Very nice patio in the summer :)

The service has been consistently good and the food has never let anyone in my group down. My favourite is the lamb (skewer or cut) and the Mediterranean plate. What I also like very much is the fact that the chef designs specials daily. All great, flavourful additions to the regular menu.

Been going there for years and will continue to go. Highly recommend it!"}
{"text":"Pretty standard brunch spot. Nothing spectacular but solid enough.

Hash browns were really good.

If you need to grab a bite you won't go wrong."}
{"text":"A great place for dates or going out with friends. The dimmed lighting, candles and art on the walls create a really pleasant ambiance. 

Got the duck dish with sweet potato mash from their special menu as well as some calamari and their vegan chocolate cake. I recommend all of those dishes as they were satisfying and flavourful. 

I also got their Cider Miranda (or at least that's what I think it was called...) which was hot apple cider and rum. Quite nice, served hot, while a friend of mine got their blueberry tea with amaretto. The amaretto is served in a cup and the tea is poured from a separate teapot. Because of this the drink stays warm for longer - will probably get that for myself next time if it's still winter. 

Service was fast and efficient. The waitress was also very accommodating in helping us split the bill (which was a little complicated with things being split 2 or 3 ways). 

Recommend and will return :)"}
{"text":"An exercise in mediocrity. I'm sure the place is kept in business by the reasonable wine list, overpriced food, and visible patio.

The combination platter (hummus, babaganoush, tabouleh, and Israeli salad), was extremely fresh and very tasty. Also, it was served before we had any cutlery or napkins, and with only two small pitas; which were good, mind you, but not really enough. I can't speak enough about how much I enjoyed the Israeli salad...however, these are some of the easiest dishes in the world to prepare. It would be offensive if they WEREN'T done well. To be fair, the rest of the menu turned me off, so I ordered a chicken caesar salad. For $14. Which was a side serving of lettuce with a whole chicken breast. Cost to the restaurant was likely $1. Tops. Again, the dressing was well done, and the lettuce was nice and fresh, but I felt pretty horridly ripped off. My date had a so-so burger with disappointing fries (done in a healthier oil, though), which was also $14. It's simply not worth how much they charge.

Perhaps it was because I was cookbook shopping that day and spent a good twenty minutes pouring over Charlie Trotter's fantastic first release, but I was appalled at some of the combinations on the specials menu. Scallops with chevre? Really? That's the kind of pairing advertised by cheese companies attempting to sell their product at fancy supermarkets (which in retrospect may well have been where they got the idea from). Looking at some of the other dishes gave me very low confidence in the knowledge of the kitchen staff, leading to my boring, safe choice.

The wine list was interesting and definitely not to complain about, serving a tasty carmenere and a surprisingly good shiraz. Every bottle was priced at $38, which would make for some decent high-class patio people watching. That is, if the patio furniture wasn't Walmart overstock from five years ago.

Our server was impossibly friendly, and I mean that as both a compliment and an insult. She was trying very hard to be nice, and I could tell she actually was; however, it wasn't hard to see she was putting it on more than a bit. She was also fabulously inattentive, though I suppose having an entire patio and dining room to yourself is a bit much to ask of a server.

In the end, the total bill was $74, for three glasses of wine plus two entrees and an app. If you've got a little cash to burn, by all means, you could do worse. Regardless of financial situation, you could do much, much better."}
{"text":"The service is good and it's a pleasant vibe. I always get the Bennie with lox . My only complaint  is that the I wish the potatoes were less wet/mushy"}
{"text":"My dad was coming to visit in the morning and we needed a place to go. I don't normally eat out for breakfast, so I checked some reviews online and came across this place. I ordered the goat cheese and sundried tomato omelet which was delicious.

The choice to serve with both home fries and a bagel seems odd, but quite welcome for me. (Although I wish it wasn't an EXTRA $3 to replace potatoes with salad.)

If you're looking for some place to go for a great breakfast occasionally, this is a great choice. Unfortunately a little bit spendy for my tastes when most of the food is easily made in your own kitchen for much less."}
{"text":"Loved sitting in the window, alone, in a welcoming environment, while stuffing my face with delicious hummus. 10/10 recommend if you are dining alone as it is quite peaceful. My server JASON was awesome!"}
{"text":"Yikes!  I'm not really understanding the \"meh, I've experienced better\" displayed here.  Was something amiss in the yummy dill hollandaise of your eggs benedict?  Did someone spit in your zatar, sun-dried tomato, and goat cheese omelet or spill your cinnamon-spiked coffee down your back?   Was something unsavory floating in your fresh grapefruit juice, or did that ideal-for-Bloor-people-watching patio cave in on you?

No?  Then shuttie.  

It's not cheap, but neither is any other brunch establishment in this neighborhood.  But it's unique, Israeli, mural-filled, and scrumptious, and by the way (HAHAHA OH MY), they have some very attractive and enjoyable staff who keep the ambiance lovely and the coffee flowin'."}
{"text":"Was in the neighbourhood saw this beautiful patio so decided to give it a try.

Smoothie: I really like it. I know most people won't associate healthy smoothie with Sunday brunch. But it is good to have options! Plus, the smoothie tastes delicious! 

Omelette: I personally like French style thick buttery omelette. This omelette feels like mushroom/chorizo/harvarti wrapped in egg wrap. Tastes great tho! 7/10

Omelette comes with bagel and home fries. I have to say this is most creative home fries I've ever had. It is not deep fried. Cannot figure out how they make it. But bonus point to healthier way of cooking fries!

I saw other people order French toast sandwich looks very yummy! I would come back and try that!

I also saw a lot of old couples here. Seems like a nice neighbourhood brunch spot with no crazy line."}
{"text":"This is my first time back here since they did their huge reno. I must say, I'm impressed by the great flooring, different furniture and better set up! Our server was friendly and I ordered the calamari to start - spicy (boyfriend mentioned that it tasted like they just brushed them with chicken wing spices - good point). I then had the mussels. I was disappointed. This place isn't cheap but the mussels were in a flavourless broth - which is the whole point. It's not rocket science, I've made fantastic mussels in the past, with garlic and white wine and was super satisfied. I wouldn't order these again. They had a tomato broth base but tasted like nothing. Boyfriend ordered the chicken breast with veggies (in the $23 range) it, however was super! I'd order that one again for sure. The bartender was really helpful when I'd explained that I wanted a beer that was similar to Hoegaarden and so he suggested a great one (from Quebec, actually - who knew?). I'd go back, but would definitely ask more questions about my food before ordering because it's not worth paying that much for a mediocre dish."}
{"text":"This place is passable for brunch but very mediocre for lunch or dinner. It's way too expensive for what you're getting, which is basically the equivalent of what a slightly below average home cook would make in their own kitchen. Everything looks and feels dated. Skip it!"}
{"text":"From the exterior, it looks like a cool and chic little cafe. Their patio is a definite plus because you can sit there, soak in the sun, and people watch on Bloor.

A friend and I went to BTW for their Brunch menu. Being such a hot day, I had no desire to eat really so I just ordered the Fruit Salad. The friend ordered their poached egg dish. For $8, I was not impressed with the Fruit Salad. There were way too many melons and after a while the taste became redundant - I ate only half of it. The a-ok coffee was bottomless, which is always nice. I know that I can't judge a book by its cover, but the poached eggs looked 'meh.' Nothing out of this world. My friend tells me that BTW uses their own unique dill sauce rather than the usual Hollandaise.

It wasn't all bad though ...
Location, location, location; a few blocks from both Spadina and Bathurst stations, it's right in the Annex. There's tons to do both before and after your meal here. Also, the aforementioned patio is a definite perk to this establishment.

The service was superb. Our server was great. She was always coming around to check on us and constantly brought coffee or water to our table if a refill was needed.

I don't think that I'll be back as there are more similar places in Toronto with better food.

A solid two star ~"}
{"text":"From the reviews and the pics, I thought it'd be better. 

I had the smoked zuchhini in tahini for an app. The tahini was rather bitter!!

chicken kebab with rice and salad: SOOO boring, i've had better food at the mall food court. 

Don't waste your money at this restaurant."}
{"text":"First and foremost, I have to vehemently disagree with \"Miranda B\" when she says this place is the only half decent place in the Annex. There are shizzle loads of places in a one block radius. I mean it's the Annex for Jebus' sake, of course there are great restaurants around. 
That being said, this place was sub-par. Forget the fact that my server looked prepubescent, but I have to say my order of the \"veggie burger\" was the weirdest thing ever. The burger had actual whole peas in it that you could even pick out. I swear that there were even portions of the pod in there. I was really put off by the buger and ate only half. The fries on the other hand were great. They were pretty shoe-stringy but not overly crisp. They came with an interesting dill dip. 

Bottom Line: Go for the fries, pass on the veggie burger"}
{"text":"I've eaten at By the Way Cafe several times over the years at others' whims, but have never once suggested it myself. I guess it has a good location and sidewalk patio and if you're not feeling like pub grub or sushi on this strip, it may look like a haven for contemporary fare. 

This most recent visit solidified how I really should put up a fight if/when my next meal date suggests going there. Although it was nice to be able to sit on the patio (despite the chill) and the service was not bad, the food at these prices left quite a bit to be desired.

Our wine arrived quickly, but my glass had leftover lipstick caked onto it and floaties inside. My sesame crusted scallop mango strawberry salad sounded a lot better than it actually was. The main problem was that the scallops were undercooked (and not in that tasty sashimi sort of way, but rather the mushy from being left out to defrost kind of way). My dinner date's chicken kebab was served on a substantial metal skewer, but were rather puny. He claimed that it was alright tasting though.

I'm not saying that I find By the Way to be expensive, but in the Annex where cheaper (and different, but better) options abound, this might not be the best option."}
{"text":"I would not surprised if a whistle blower would reveal that By the Way only hires skinny servers. It is so crowded that I can hear the conversation from the other table. They were talking about nasty in laws....shhh... 

I am not really a fan of this place. 

The food is adequate. Not bad. Not good. Adequate. I have been many times for brunch and it has yet to impress me. And I am not hard to please. Ask my friends. 

The wait staff though is friendly and try to squeeze in between the small gaps between tables. There's a patio outside overlooking the impressive Bloor Street! 

Visit if you want a sit down diner and if you want to hear other people talk about their lives..."}
{"text":"I'd visited btw cafe in the past and could recall neither a positive nor negative experience, so when I noticed an empty patio seat on a Sunday where all brunch spots were packed, I didn't think twice about a second try!
As a result Btw will now be one of my local brunch standby spots! To begin, you will be seated and taken care of much quicker than other notable brunch spots in the Annex; I found the service to be both attentive and pleasant! The coffee was good and refill were offered frequently! 

As for the brunch itself, I opted for the herbs, goat cheese and sundries tomato omelette, and I was very pleasantly surprised with how nicely it was done! The omelette had plenty of cheese, but it was not overpowering. More importantly, the sundried tomatoes were not too dry or chewy as with some other places and added a nice zesty taste! Homefries were also a win as they were adequately seasoned and cooked! The only downfall was the underwhelming bagel, which I should have just replaced with toast! 
Overall, Btw joins Insomnia at the apex of my Annex brunch list!"}
{"text":"Tried to go here for brunch with my family from out of town. Not super busy, but they only had seating for 2, and we were looking for a table for 3. They offered to sit us at a table for 2, or for us to eat on their un-heated patio. We offered to have a drink on the patio, and to settle up when a table for 3 opened in the restaurant. The host refused with a huge smile and said it was \"one or the other\". Even if we settled our bill.. Sadly I will never be returning as we were happily turned away by the host of By The Way, and had a much warmer welcome across the street. Avoid if you can."}
{"text":"I like this place and come here every now and then. 

Their regular menu is quite boring, but they always offer daily lunch and dinner specials that aren't horribly priced and sometimes offer exciting flavours. They also offer vegetarian options in these specials, so that's always a bonus (though I once had an extremely bland veggie lasagna). Try their fried calamari- it's great! I'd like to come and try their famous brunch one day (which they offer late into the day, I believe)!"}
{"text":"A friend and I came for brunch on a Friday morning. The place was fairly busy but we snagged a table that had just opened up by the window. The waitress was very attentive at first. She got us our coffee and tea and returned a few minutes later to take our order. She was prompt with coffee refills and to check on us after he had our meals. She did the famous disappearing act that happens at many restaurants when it's time for the bill. Not sure what happens with this phenomenon as you would think they would want to be paid and turn over the table quickly for the next patrons.

I had the Huevos Divorciados. A fitting meal for brunch as I had just wrapped up business at the court house to unfortunately file for divorce. This eggy dish is your typical Huevos Rancheros but with two different kinds of salsa - Salsa roja and salsa verde. It was a solid meal. The potatoes were tasty, the eggs cooked to perfection and a nice portion of beans.

The place isn't anything fancy, but the brunch was solid."}
{"text":"We came here for a friend's birthday.  My order got mixed up and the waiter set to task to fix it and saved the day!  The patio was lovely and I am now a fan of grilled fruit.  Who knew how good it could be on a salad!  Everyone enjoyed their dinners including me.  The salad was most memorable because it was delightful."}
{"text":"An ordinary brunch place. I wouldn't give a two star rating if the service wasn't sooo slow. We waited an hour for our food! The food is not that great considering it's a bit pricey compared to other brunch places."}
{"text":"I would have rated this place a zero if it was possible. To start with the man server who was working there was very rude and unwelcoming. He wasn't willing to answer our questions in a friendly manner, and instead would laugh with sarcasm. We were also denied service because we only wanted to order lattes and desert. The male server said he couldn't serve us because \"I have a $5 minimum order per person right now\" and that \"this is not a cafe\". However, our order would have been higher than $10 and this location is a \"Cafe\". So since we specifically went there for the desert, we asked for the desert to go but the server still said he cannot help us with that. We were pretty shocked at this point as this is the absolute worst cafe/restaurant we ever been to."}
{"text":"Good breakfast. Nothing too special but tasty and laid back. Coffee isn't great but there was no need to wait in line for Sunday brunch which is always appreciated. Service was good."}
{"text":"You know... I didn't have high expectations for By the Way because of its yelp aggregate at 3 stars and the description of \"Mediterreanean/Middle Eastern\" food didn't tickle my fancy for breakfast.

Anyway, I was blown away by both the service and food! It was busy, we got lucky and were seated right away. I got the chorizo mushroom havarti omelette, which is one of the best omelettes I've had in a long time. My girlfriend got the huevos rancheros (or whatever it's called), which she liked... but she definitely liked my omelette more because she stole about half of it. It's okay, the meal comes with homefries AND a bagel! Nice touch, reminded me of montreal. So even though my girlfriend disregarded my love for breakfast, decided I'm fat enough and ate my food, I still walked away satisfied.. MORE than satisfied. This place will now sit high on my list of choices for breakfast on the weekend!"}
{"text":"A friend of mine (whose friendship I may have to reconsider after this terrible recommendation) suggested that I try out the brunch here. I ordered the eggs benedict and because of this unfortunate meal I now know to ask about the method of preparation on eggs florentine at every restaurant I visit.

The English muffins were smeared with a grotesque combination of thawed frozen spinach and pesto. There was so much of this vile liquid on the English muffins that it rendered the rest of the meal (eggs, homefries) nearly inedible. Won't be back."}
{"text":"I was waiting for a friend and decided to grab a coffee and read while I was waiting. This looked like a cozy cafe and so I decided to try it out. When I was seated and I ordered my coffee, I was told that I \"must\" order something to eat ..so just so you know, there is a $5 minimum to sit at this cafe... I guess they have to maximize revenue per table but then i think they should call themselves a restaurant and not a cafe! 

So my rating is not about the food (I didn't order anything here and went to Future's Bakery across the street instead). My low rating is because they didn't seem to have their \"minimum order\" rule visible anywhere that I could see outside or inside the cafe. And I also didn't appreciate the way I was spoken to and feeling so unwelcome."}
{"text":"Came here tonight (Fri), w/ hub and little one.  They had both a highchair, and booster seat available.

We were welcomed from the get-go, though it was .packed.  A nearby church was offering a show later on, and the whole restaurant was filled. 

Still, one of the two kind servers, made it happen for us.  Despite not having a reservation, this time.

Eating out with a child can be tricky, so we searched the net and decided on this place based on its location and its menu.

Lots of choices- veg. and non-veg.  Prices were fair.  Especially once you get to their dessert menu.  An average of $5. for any slice of cake is unheard of for me!
There were dinner specials.  

Above all, service was not only good, but basically impeccable.  It's my first time using the word in a review, but tonight... the service from one of the two male servers on duty (he wore glasses, and his last name matched that of a variety of apple; didn't get his first name), was just that.  Stellar, consistent, attentive.  He just knew how to do his job, he anticipated and added considerate touches to ease our time there.  It's exactly what service should be about.  
I knew I'd be yelping kindly about this place.
I wondered if I was going to start this review off with \"Are the servers at By the Way paid extremely well - you'd think so, given the high level of service we received this evening!\"

Food itself was good, average.  I'm a foodie (I love and try to seek out particularly yummy foods), and can be quite picky about foods.  I had the linguine special, hub had a burger.  Mmm, the thin fries came with a cool fresh dill dip.  So good that I ignored the ketchup as I indulged in his frites.
My linguine had pesto, red peppers, artichokes.  I think I was craving an alfredo feel to my dish, so I found the pasta to be dry.  
Despite this, I still ate everything.

For dessert, we had a tart lemon tart.  Nice crust, but a touch too tart for me.
I'd eat another one, sure.  And another 2-3 if it was less tart.

Definitely, we'd go back.  We plan to.

We'll make RSVPs for next time, though."}
