{"text":"We went to Bywoods over the holidays and it was amazing! Our two children were with us and they especially loved the calamari, we had to order a second helping. The flatbread starter was amazing too. We had the flank steak and lamb for our mains and they were both very tasty. I will definitely go back. I highly recommend Bywoods."}
{"text":"Had a Friday night meal and drinks at Bywoods. Fun cocktail listing and good variety of foods.  We had:  Fig Flatbread - so good! And big enough to be your main!  Squid Piri-Piri - This was awesome. Be prepared - its quite spicy! Beet and Goat Cheese salad - Very nice."}
{"text":"I'm am so glad that I braved the cold to eat here tonight.  Let's start with the cocktails. Each one is unique. Our table of 4 all had something different and we all enjoyed them. I had the crab apple. They are well-priced, too, for 2oz drinks.  For an appetizer we had the venetian-style piri piri calamari. Perfectly done and the batter was light. The piri piri sauce was delicious.  We each ordered a different entree - and again, there were no complaints. I had the pasta with pulled pork and kale in a tomato sauce (not the official name, but close enough). You think the portions might not be enough, but we all were full at the end. I even had some leftovers (yay!).  We indulged in dessert and were not disappointed. I had the lemon curd no bake cheesecake while others ordered the no flour chocolate cake and creme brulee. The cheesecake was delicious - a lovely tart lemon taste. Two of our party also ordered cappuccinos.  It was a lovely dinner. We were able to take our time to order things and were given \"breaks\" in between each course. It was a welcome change to being rushed through meals at other restaurants.  Next time you go out for dinner, go to Bywoods. You will not regret it."}
{"text":"Second time eating here.  Highlight from the first meal: I asked for some Parmesan on my pasta, and the waitress tells me \"there's already a lot of cheese on there\" and then grouchily brings me the cheese.   Pasta was unappetizing, didn't finish.    Second visit, a couple months later. I order the steak. It tastes off. I eat a lot of steak, and a lot of good steak. Texture was terrible. When I send it back, I'm told that the reason the steak tastes like that is that it has been dry aged for 36 days in the basement. Maybe in the bathroom?!   I love being told that I'm wrong because their food tastes awful, that I don't know my dry aged steak, that's why I didn't like it. Nonsense. I have dry aged steak frequently, my favourite is from the Roast butcher down the street.   Don't eat here. They are simply trying to pick up business from the Prop and the Rushton.  To their credit, they serve a decent halibut according to my in-laws."}
{"text":"I keep walking by Bywoods and the interior decor looked comforting and casual, but it's never busy. We finally decided to give this place a try since we had a voucher for a free margarita pizza.  Some patrons really pushed the idea of casual. I was in jeans and nice shoes, but a few tables over a bunch of young women were wearing sweat pants. Jeans are fine, sweat pants looked out of place.  Beer and wine list were simple. They were out of my first choice, Erdinger, so I settled on some Flying Monkeys Stereovision instead. It was pretty early in the evening (7:30) on a Friday, I was surprised to see that they were out of some of their beer selection already.  The pizza arrived pretty quickly, and it was saucy and cheesy but rather bland. The sauce tasted store bought and it wasn't very impressive. It was a fine appetizer to split between two people, but really it was a rather small flat bread. There are far better pizza offerings available on this short stretch of St. Clair.  I ordered the fish of the day, a small strip of fresh salmon served over fingerling potatoes in a lemon based sauce with olives. At least, that was the description. The salmon was properly cooked, not over done, with a nice crust finish. The sauce was flavourless - no hint of lemon, shriveled up black specks that must have been the olives. It was nicely plated but a disappointing choice.  My partner had the penne pasta with chorizo sausage. The sauce and chorizo were flavourful but the pasta noodles were ordinary in flavour.  Portion sizes were adequate and we didn't feel up for dessert. Service was friendly and attentive, but we won't be back. There are many other great Italian options within a 4 block radius that are similar in price point, we'll stick to those."}
{"text":"I was invited to Media Tasting dinner at bywoods (@bywoods760) and I can't help but feel excited since there's a lot of restaurant along St.Clair that seems to be so under-explore. bywoods is the latest endeavor of Tony Cappellano and the Boom Hospitality Inc team with Chef Craig Dehne helming the kitchen.  The space is divided into two adjacent dinning rooms with a small front patio.  The bywoods ~ gin, organic rosemary, lemon juice, sugar & club soda ~ I am disappointed to say that it tasted very bland to me, almost like gin with water and ice... even after squeezing the lemon wedge in didn't help much.  Prosciutto Pizze $15 ~ fig, gorgonzola & dressed arugula ~ Love the crispy flatbread with the mount of fresh arugula on top and knowing how much I like fig and prosciutto, this was so perfect for me.    Vegetarian Pizze $14 ~ goat cheese, leek, red pepper, grilled artichoke, tomato, red onion, black olives & fresh marjoram ~  I was glad that this came second since this one has stronger flavor than the first one. What's not to like with this classic combination.  ~ Only wished I had a glass of wine in hand.  Mediterranean Salad $13 ~ vine tomato, cucumber, red onion, black olives, feta cheese, marjoram ~ With tomatoes in season, this was obviously delicious  Beet Salad $12 ~ goat cheese, charred red onion & arugula tossed w/ walnut dressing ~ Beets will always be one of my favorites but Ican never justified paying that much for a small plate of beets given how easy it is to make it at home. . Pan Seared Scallops $16 ~ grilled chorizo, avocado mash, mixed greens, black olives & jus ~ Thought it was a cute idea to have the scallops on top of the chorizo but not sure if it actually translate that well, though the whole thing look rather weird with the avocado mash on top.  ~ That aside, the scallops was perfectly cooked perfect with the saltier grilled chorizo and love the jus as well.  Linguine with Shrimp $21 ~ spiced light cream sauce & spinach ~ At first glance, it looked rather dry and I was thinking that I will be rather bland and tasteless but although with the lack of sauce, it was delicious and flavorful.  Pan Roasted Lamb Sirloin $26 ~ apricot, potato puree with smoked paprika & sautéed spinach, Moroccan spiced jus ~ Love love the lamb, it was perfectly cook and not overly seasoned so you can taste the yummy lamb flavor.  ~ Oh and did I mention that we all thought it was a sweet potato puree even after tasting it?! It was actually potato with smoked paprika that gave it the color and taste... really I still think they are lying and it's sweet potato since it was sweet and sweet potato texture-like.  Grilled Flank Steak $21 ~ arugula, mushroom, cured tomato salad, salsa verde & jus ~ Never a huge fan of flank steak since it's always too dry/not fatty enough...  ~ but they did a pretty good job here and the salsa verde which tasted and look like more of a pesto to me was the real star of the dish. ~  I will probably order this in a heartbeat just because of that pesto.  Chocolate brownie  ~ was rather bland and could have use a better quality chocolate when the dessert is made not that sweet.   Verdict: ~ Another great find on St.Clair, perfect spot for people who are only willing to travel to mid-town ~ Would definitely come back again"}
