{"text":"I had read about this place before and it had very good ratings, with that being said, when expectations are high, disappointment isn't far behind.  This place not only met expectations but surpassed them.  I got a cheeseburger and onion rings combo and it was under $10.  The burger was HUGE and perfectly cooked.  The meat was moist and the bun was hearty.  Toppings were fresh as well.  That it self was good enough but the atmosphere was very nice and clean and bathroom was spotless.  Great place and I will def. be going back again."}
{"text":"I have always wanted to try C & Dubbs. Yesterday, I finally did. My expectations may have been a little too high. If you're looking for a traditional burger that tastes like its homemade, try C&D. I had a cheeseburger. I found the quality and taste to be comparable to Harvey's. Good. But nothing special. Perhaps other items on the menu are better? I enjoyed the fries. They were crispy, and not too oily. The service was good. My order was prepared quickly. C&D doesn't offer much by way of atmosphere. It's outdated and not in a way that's charming. I think they could step it up by offering more creative menu options and updating the interior."}
{"text":"I can't believe it's taken me this long to eat at C & Dubbs but better late than never. As everyone else says, it's a classic burger joint with delicious patties that you expect from places like this. They are thick and juicy and were contained in a bun that was soft yet sturdy enough to hold the crazy amount of toppings my husband and I had asked for. Fries were great but what made them better was the old-fashioned gravy served with it. YUM.  We were also feeling super lazy so we ordered through skipthedishes.com which was a terrific experience. The food arrived warm and was packed in a way to ensure your food was delivered looking the way it should. My only advice if you do decide to order through this website is to order ahead of time as it took 45-1 hour to get here as I believe it all depends on the delivery driver. If you want to give it a try here's my code that you can use on that site for $10 off!: https://www.skipthedishes.com/r/4mPeqsvYkk Also, if you do order online you can pay with your credit card!  I will return to try more of the delicious eats at C & Dubbs!"}
{"text":"I haven't had a good burger in a long time and a friend recommended that I come here. I got a mammoth burger and it certainly hit the spot. It's one of the best burgers I've ever remembered having. It's leaps and bounds better than five-guys. The place was spacious and had fantastic feng shui if you are into that kind of thing. Definitely worth checking out."}
{"text":"I come here at least once a week with my girlfriend to split chicken strips and poutine. The food is great, I didn't mind waiting for them to make it fresh and the staff are always welcoming and friendly and it is very affordable."}
{"text":"This is my go to place when I crave for a burger. The burgers are great and so is the service. It's a laid back atmosphere and the menu is pretty straight forward. I usually get the banquet burger which is a sizable bacon cheese burger and a poutine (their fries are amazing). I usually get the food to go and there was an instance where one of the guys offered to help bring the food to the car because my hands were full. It was a really nice gesture."}
{"text":"3.5 stars.  This place has been here as long as I can remember.  I have eaten here a few years ago and recently ate here last week and I was satisfied, it was exactly what I was expecting and remembered it to be.  At this place, you are going to get a big burger, that will hit the spot when you just want a regular old burger and don't want to go to a chain.  This is not one of the trendier burger places that are more common these days, with more upscale buns, toppings, and AAA beef.  It's just a good large burger that will hit the spot.  It's a greek family that owns the place, and they serve some greek food as well.  Overall it's a place that I wouldn't drive out of the way for, but would happily go to if I was super hungry, craving a burger and passing by."}
{"text":"This truly the best burger in town. I live in Toronto and I drive here just to have the burgers. Great fresh burger and fries every time. I don't think you can find a better combo price anywhere. Great value for the money. The onion rings are great also. Food is made fresh to order. Prepared fast and delicious! Friendly guys and great service!"}
{"text":"Amazing burgers. Huge Portions. Great fries.  Burgers are delicious. Other options: hot plate, gyros, pitas, salads, etc.  Staff are always the same there, all working there for years. Extremely courteous, polite, and timely.  Very clean and comfortable area. Big TV showing sports/manly shows (ie. shark week). Outdoor table for summertime. Closed Mondays; open LATE.  $10-$15 combos.  Only downside: CASH ONLY -- ATM ON SITE"}
{"text":"The best cheese burger and fries with gravy , love the cooked onions on my burger. and great portions."}
{"text":"3.5 Stars I came here a couple of times and the burgers are decent but nothing special. I would continue to come here if i wanted a quick burger. The place opens pretty late too so its a good late night snack. The people working are friendly and prices are good (Like $4 for a burger)."}
{"text":"I have been going here for 9years now and I have tried many other places. This is the best value for the quality (taste) and amount of food that you get for what you paid. Staff is awesome and very friendly, they know me by my name and already know what I like on my burger so I don't even have to say what I want.   My favourite burger place"}
{"text":"Wonderful food choices, burgers, souvlaki, home made onion ringers, fries it never ends."}
{"text":"Holy crap! Sumo burger...be warned. It's FILLING! My first bite didnt even dent this monster burger. Two massive burger patties layered ontop of each other covered with the bun makes your eyes burst and prepares your belly for a feast. It took us 25minutes to finish this. There is so much meat in your mouth you forget about how this tastes, all you can think about is how you can finish this burger! Cash only. The inital tastes of the burger were alright, once my taste buds got suffocated by the beef meat it was all a blur. If you have this for lunch, you won't need dinner. You have to go in just to experience it. Go in hungry. Don't get fries. The burger is more than enough,"}
{"text":"If someone said to me \"Hey fatty, tell me the second best burger place in Canada\", I wouldn't tell them C N Dubbs. Because it's the best."}
{"text":"I've had better food at carnivals, served in much the same environment. The burgers are greasy and flavourless, and the onion rings aren't much better. The fries were flaccid. The store was relatively clean. I won't return."}
{"text":"Wowwww that home burger combo... Omg best thing I've had in a while, all it costed was one single ten dollar bill. If u like Harvey's you'll love this place."}
{"text":"This place has seriously improved their appearance since I last visited several years ago but the food is about the same as I remember it. Awesome!  I have noticed the decline in quality of certain other burger establishments that have been staples in the West for years. What I don't understand is the continued, if not increasing patronage to these places. (I went to another popular burger place a little further east of C & Dubbs a few weeks ago that has been a neighbourhood fave for years. The lineup went out the door, it took me over 20 minutes to get my food, it was expensive, portions were extremely stingy; 4 frikkin onion rings in my onion ring/fries combo, and the food was awful)! Anyways, enough about them...  C & Dubbs was awesome! I was passing by with wifey and kid and decided to stop in. Neither of them wanted anything upon entry but when I sat down with the behemoth of a burger they gave me and a city block sized basket of fries, they dug in. And there was plenty for all three of us! And like I said, it was awesome! People going to that other place I mentioned should really get on over to C & Dubbs. Then they'll remember what the other place USED to be like."}
{"text":"What day is this? What year? I'm so confused, right now. Why you ask? Well likely because I've been in a meat induced COMA for almost 24 hours. A side effect of the first foodie challenge in the GTA which took place yesterday right here at C & Dubbs.   A group of 6 of us sauntered up to the famous Mississauga building (famous for the pickle slice racing scene from the movie Billy Madison) to take on their in house burger champion THE SUPER SUMO. But Kris what is The SS?   Well friend, let me educate you some. The C&D SS Burger is 1.5 pounds of fresh chuck piled high on a kaiser bun topped with the works including cheese and bacon - Ya heard? Ya this burger is the cousin of the ham sandwich responsible for the choking death of former Mamma's and the Pappaa's lead vocalist Mamma Cass. (I actually have no evidence to substantiate this claim but it's a fun fact to pretend).  But seriously this burger was a mighty beast, I was the one legged Ahab and this was my Moby Dick. Except in my version of the story I ate the S%^& outta this burger and managed to destroy it with only minor next day coma collateral damage.  The question I've been getting all day from friends and yelpers alike \"did something that big actually taste good?\" And my answer is a resounding YES. This was a great quality burger. Only points lost were for the bun falling apart midway through BUT with that much beef and toppings I would have collapsed as well... and come to think about it, when I got home I made like that bun and fell apart.   Kudos to David L's son for making this burger look like a happy meal, consuming it in a record time of 4 minutes and 29 seconds. Honorable mention to Abbas N for showing up and trying to finish it.   This little burger shop just a stones throw away from Sherway Gardens Mall on the Etobicoke/Mississauga border not only does burgers but shawarma, fish and chips, poutine and pretty much anything your little clogged arteries desire.   CASH ONLY"}
{"text":"I drove 30 minutes on saturday just to try this place, and the verdict is...dont drive 30 minutes to this place just for their burgers, but if you are in the area it is a worth a try. $3.99 for a hamburger not a bad deal.  Taste, Service and Quality 3-.3.5 at best. it is an old fanshioned diner kind of a place, also serves greek food and fish and chips  PS. cash only but ATM on site"}
{"text":"The most recent city of Burgasm Hunt 2011 is Mississauga. Initially I had planned on paying a visit to Original Gangster Burgers, only to discover the O.G. face down and lights out, with a \"For Lease\" sign on the door. Alas poor O.G, we hardly knew ye *pours out a 40*  Anyway, next stop was C & Dubbs Hamburgers.  Armed with only a very vague recollection of where it was located, and despite being wedged among about a million eateries in the Dundas/Dixie area, the place was extremely easy to spot while driving, and thankfully, it was still open. It should also be noted that while closed Monday, they're open until midnight Tuesday-Thursday, 1am Friday and Saturday, and 9pm Sunday.  The interior is very clean, presentable, and spacious.  As they use a few nicknames for their burgers (Sumo burger, banquet burger and a couple of others), I had to inquire as to what was what, and the kid behind the counter was more than helpful and courteous. If you're looking for just burgers, you have the choice of a standard hamburger/cheeseburger, the banquet (bacon cheeseburger), the half-pounder (I forget the name), and the Sumo (the big daddy full-pounder). While I was hungry (but not too hungry) I opted for the half-pounder along with a banquet for later on or the next day, and the total was under 10 dollars.  The burgers were prepared in a timely fashion, and they also have the standard selection of toppings. Another thing I noticed while getting my toppings was how much the employees seemed to get along, and it just gave off a real 'family-owned' type vibe, and I dig that.  Anyway, I took the burgers home and gave the half-Sumo a shot. Mind-blowing loin-obliterating burgasm! By FAR the best burger I've had in a long time, and that's taking into consideration that I went to Five Guys only a couple of days ago. it was just so flavourful, melt in your mouth good. The bun tasted as though it just left a bakery, it was THAT fresh. My God! It was so delicious that I immediately afterward ate up the banquet burger as well, which was just as consistent.  This truly is as good as it gets, and I can't wait to return."}
{"text":"It's Harvey's like. Nice clean place, with uninspired interior. Photos of old leaf players on the wall too high to notice. Other art includes watercolours of fruit, Greek urns and Italian landscapes. Mustard and carmel coloured paint complete the look. Okay back to the food. Tasty burger, great looking onion rings but doughy and greasy. Really nothing special, but if you need to eat it will do the job."}
{"text":"Great food, great service! The food was quickly prepared and everything was very fresh. They also have a TV on the sports channel, which is a plus to all hockey fans wondering how the games are going. The poutine was very good, the gravy is not too salty, which is awesome! Like other people mentioned previously, the portions are really big. I got the cheese burger combo with the poutine and I couldn't finish it all!"}
{"text":"First time here after hearing about its stellar reputation and we were not disappointed. They give you so much food for the value it is unreal. The burgers are charbroiled goodness and the fries and gravy are delicious. Definitely worth a try."}
{"text":"Ever since the old white building up the street i have been coming to this place so thats about 30 years or so.  This place is an icon of fast food and large portions.  This time i had the souvlaki on a pita with fries and gravy.  They still got it.  If you are hungry, this is the place to go.  Its not fine dining, but its decent fast food."}
{"text":"A very decent mom and pop type burger place that reminds me of so many that used to exist across the GTA.  Now with the invasion of higher end gourmet burgers it would seem many of these shops have all but disappeared.  This place offers up a nothing fancy super sized honest grilled burger.  There's ketchup, mustard, relish, onions, lettuce, mayo and tomatoes offered up for garnish.    It's a classic burger and sometimes that's all you need."}
{"text":"Serving sizes are HUGE, prices are very reasonable but didn't find the burgers or poutine anything special."}
{"text":"C & Dubbs aka C & W's from years back.  This place has been around for years, decades.  How long I'm not entirely sure but the food has been pretty much the same this time as I went last time which was a very long time ago.  I had recently come here on Monday the 23rd of March only to find the establishment to be closed on Mondays so I was sort of disappointed.  I had returned on the Friday past (27th) to get my fill of what I had missed earlier in the week.  This place is a very down to earth mom and pop type of burger joint.  They also serve chicken fingers and fish and chips basically it's a fried food cafeteria style type of place.  We were here however for burgers since this is what the place is known for.  Honestly it has probably been over a decade since I last ate at C & Dubbs.  A lot has changed with me over that time.  I have what I think developed higher standard for food over that time.  When I was younger say... in my early 20's a burger was a burger was a burger and without a baseline standard in which to measure a young person really has nothing to compare experiences to.    What I am saying is when I was younger this place would have done me just fine.  Today I have a much more spoiled taste and established burger sense.  The burgers at C &  Dubbs are basically what I can make at home, literally.  To start things off the burgers are just frozen.  I saw them putting them on the grill and cooking them.  They are preformed frozen patties.  I can make those at home like I said.  While I had 2 x 8oz patties to make a 1 pound burger (Sumo) there is nothing defining or special about this whatsoever, not in how it is cooked, served or what is put on it.    In today's burger market especially in the GTA there is a myriad of establishments to get your burger fix from chain fast food to what can be almost called gourmet although burgers are not really a gourmet type of food.  C & Dubbs blends in with the older mom and pop shops of years past sort of in league with let's say Apache Burger also on Dundas but in Etobicoke close to Kipling Station.    The pricing is not out of this world but for what you're paying and what you get I could make this at home.  It's about 10 bucks plus tax for a normal combo.  The fries are probably better than your average chain but I'd think Wendy's or A & W have tastier burgers than C & Dubbs.  The poutine was good not great and the food was ok, not exceptional.  Because of that I can only give it a 3*."}
{"text":"Very good and clean atmosphere and very nice manager ^^ I just spoke to him today and their food looks amazing"}
{"text":"Reminded me of that great Harveys flavour-memory from twenty years ago, except this happened today!  The burger was grilled to perfection. The fries were a top notch piar.   On my own after work, I wanted a treat after a successful day. C & D met the mark, and I sure came in with expectations.  About the decor, didn't bother me since the food stole the show."}
{"text":"I pass this place almost everyday on my way to work and I've never dared go in because it didn't look that appetizing, however I got off work really early and decided \"what the heck\".  First off - it's cash only. Second - service is fast and friendly.  In terms of the food, the burger was fairly good and the patty taste almost exactly like Harvey's except 25 to 30% bigger (arbitrary number based on \"gut\" feel - pun intended\") but a bit cheaper.  I would give the burger 4/5.  However, the fries were not crispy and were very bland.  For one of the few times in my life, I actually added ketchup to my fries and even then, it wasn't great.  2/5 fries.    So the meal was decent, and really, a large burger, fries and pop for $10 even (tax-in) is a great deal these days.  I'd go back."}
{"text":"C & Dubbs has been a go to place for many many years starting off in a small barn looking building which was very small with few seats and not much time to move around.  Then moving into a plaza with a larger dining area.  For those of you that are not aware this is the home of the infamous Sumo Burger and Super Sumo Burger.   The names of the burger should speak for them selves but in case they don't let me sum it up for you....INSANE.  The Sumo Burger is 1 lbs of meat and the Super Sumo is 1.5 lbs of meat.  Not only are these burger massive but they taste amazing also.  Its massive and super messy and super hard to eat.  A good burger is a messy burger.  Well that's what I say at least.  I have visited C & Dubbs many times but my last visit i realized I had never reviewed it.  On my last visit of course I had the Sumo Burger but I shared the fries as the burger and a whole plate of fries would have been way to much for me.  Burger was super juicy and tasty.  Dripping with goodness.  Fries were super crispy and tasty.  Seeing as I always order the Sumo Burger when I visit C & Dubbs i think next time i'm going to step out of the box and order something else that is on their great menu.    ALERT !!!!! Mississauga and Etobicoke and all surrounding areas C & Dubbs = Great charbroiled burgers.  Make sure to visit you wont be disappointed."}
{"text":"The bf and I were on the road late at night and needed some eats. We decided to stop here based on the fact that it was the only place still open late during the snow storm and wasn't having a private party (I dunno, string of bad luck for us? Two other places we tried were...).  Burger patties are flavourful and traditional in taste. Tomatoes are actually cut thickly, none of this shaved tomato crap you get at fast food chain places.q  Poutine has real cheese curds, but the gravy is the more rich fatty type (not the dark thin deliciousness you typically get in Quebec). Still okay with me.  Overall slightly (...hmm very) artery clogging, but it hit the spot. :)"}
{"text":"The burger was okay, the onion rings were okay and the fries were soggy.  The portions were huge.  I was really looking forward to a char-broiled hambuger.  The burger itself was nothing special but the char-broiled taste was satisfying.  I enjoyed selecting my toppings and that was a big plus.  The onion rings were the kind I normally love, home made and big.  Downside was they were a bit greasy, but some people love that.  The fries were the biggest disappointment.  They initially looked very good but when I  started to eat mine they were soggy, not sure why, maybe under-cooked.  Overall I can only rate as okay and it is not a place I would go back to."}
{"text":"C and dubbs, probably an underrated burger joint. Every place serves up burgers, but these bad boys know how to do it up for a king. Would definitely recommend to go again, the prices and portion serving is jaw dropping."}
{"text":"Yelp's First Foodie Challenge :   Bring on the SUPER SUMO.   1.5 Pounds (Three 1/2 Pound Patties) of MEAT.   Piled high. HUGE BUN. Lots of toppings.  The Challengers:  Me.  Kris U.  David L's 18 Year old son.  The competition:  It started with a 3,2 and a 1.   I toke a second to look at my burger. Size it up. How in the hell was I going to bite this?  I look up.  David's son.  Half the burger is gone.  WHAT. HOW IS THIS POSSIBLE.   I had to catch up.  Pulled off the bun, and went straight for the patties. Delicious, hot steaming, meat.   But alas, I was no contender. I didn't have what it takes to take the Sumo Challenge.   Little David junior ruined me. I have no yelp reputation now.  He did it in 4 minutes and 29 seconds.   I continued on, but couldn't eat more than half of that thang.  One day, I will come back.  One day, I will look that burger in the face again, and one day.  I will own IT.   Side Note:  1. The BURGER WAS HUGE. See pic. 2. The Fries WERE MASSIVE. 3. The place was really clean and spacious. 4. The prices were cheap. 5. WTF was I doing in Missisauga?"}
{"text":"Burgers are alright....nothing special. The onion rings r huge...delish"}
{"text":"If you want a big meal, definitely come by here. They never fail to serve up the portions leaving you so full and greasy. I can never finish it so I have some left overs all the time (more for later!). Prices are affordable for sure and its good for those hungry and on the budget people. Taste wise is mediocre since I've had better but its pretty decent and very filling. You have to try it at least once. *thumbs up*"}
{"text":"Average burgers at best. If you like a frozen patty, this might be for you. Fifteen years ago this might have been good, today it can't compare to better/real burgers available.."}
{"text":"Great old school diner burger place  Few left in the city and this is definitely one of the best ...especially in the west end !  Great Burgers and fries huge onion rings that are extra fluffy !!! Great bunch of guys behind the grill super friendly !! I'll definitely be back ! Great place !"}
{"text":"Looking for a fresh and tasty burger or a delicious poutine? Then this is the place to come to!   C & Dubbs makes everything fresh on the scene. They accept cash only and have an atm located conveniently beside the front door. The menu is very rustic and old looking but considering the prices of some of the newer burger joints the prices at c & dubbs is quite affordable, especially for the freshness and quality. There is a glass visor dividing  the chefs and the customers allowing you to see your foods progress as it's being cooked. They offer take in and take out and have a fairly large seating area with two television screens for your viewing pleasure. The walls are decorated with various hockey stars and there is a very large window allowing you to see in and out of the restaurant.   I had the cheese burger combo with fries and it was so much food I honestly couldn't finish it all. It was really fresh and delicious and didn't have the typical fast food feel to it. The fries are also freshly made and delicious!!!"}
{"text":"Nothing special at all.  As prior reviewer noted, burgers are all frozen.  The bigger the burger you order, they just stack more of the frozen patties onto it.  Also tried the souvlaki dinner there and the \"salad\" was a bunch of wilted iceberg lettuce and tomato chunks they take out of the toppings trays for the burgers and then toss it with a bit of raspberry vinaigrette that comes from a gigantic commercial jug.  They'd do alot better by my if ANY of their stuff was homemade -- but it's not."}
{"text":"The food here was amazing couldn't ask for a fresher or tastier burger, the poutine was amazing topping fresh and I love the speed in which you get your food all in all it Was a wonderful burger experience I would definitely return"}
{"text":"It smells amazing in this place. Good small name burger joint! I went out of my way to try this place after seeing positive reviews on this and other food review websites. Upon entry, you are greeted with the aromas of traditional burgers and milkshakes. There are a few wooden booths to sit at, well spaced so that you don't feel as though you are invading on other customers.  The menu seems varied including burgers, hot dogs, fries, chicken burgers, chicken souvlaki, etc. after some deliberation I decided on the chicken fingers after the person ahead of me ordered the same. Each is delicious white meat breaded and cooked to perfection.   It was accompanied by the poutine which was the real menu I was wanting to try. This in fact was disappointing, the fries were fresh and they use real cheese curds that slowly melt as you eat it. I believe the downfall was the gravy which I found on the sweet side (or at least not the salty side). It made the whole dish too neutral and not exciting. I finished it but would never order it again.   The food is prepared in a timely manner and their selection is great. You get a hefty portion for the price you pay (which is similar if not slightly higher than most burger joints) and the food comes out steaming.   I may never order the poutine but I'll definitely return to this place."}
{"text":"Their home made patties are definitely not home made. Processed meat that's served on a bun with other ingredients. I'm actually very disappointed. The burger joints that I go to and order the homemade actually serve home made.   I don't understand how a restaurant can serve such low quality beef. I know they have good reviews but I am bewildered. Not fresh at all. Period. If I had ordered a previously frozen patty I would understand. But I didn't. Home made = made fresh in house. Laid the premium but was dissatisfied."}
{"text":"I live for the local.  This place has really good burgers and although this may sound bad, you can tell the folks behind the counter love them too.  I'm an outsider, from the states.  Met my wife up here and the first time I was visiting her 15 years ago, she took me to this little rinky dink run down place that had burgers and fries.  The burgers and the folks working there were great.  They have since moved to their current location which is like walking from a shack into a mansion.  What a change.  I was somehow afraid the burgers would be different, but they're not.  They are still great.  I do have to admit that I am a total wimp and order the small one, but I load it up with all kinds of stuff and share a fries with my wife.  Every time we visit her family, we always at least once make a stop here at C & Dubbs.  I haven't been there in at least six months, but I'm excited for the next time we drive up."}
{"text":"I'm kind of at a loss for words here. After reading such glowing reviews of the place I decided to give it a go since it was near my house. Arriving at the place I could see it was a typical diner looking establishment, not a problem since I figure it must be sort of an overlooked hidden gem. To start off the place looks clean, well-lit and it's spacious. We ordered a banquet burger combo, and I got just a home burger on it's own. Substituting regular fries for onion rings (huge mistake), and a pop that came with the combo. We didn't wait long; after 3 minutes went by we were called up to customize our burgers. It was then that I noticed where they place their fries. In gray plastic bins sitting on a pull out shelf under the grill sat a bunch of stacked plated onion rings, complete with grease run-off on all sides. At the moment I didn't really think too much of it, although I found it kind of gross/lazy but whatever. So we get our food, sit down and start eating. Well to start with the burgers, they were fine. Charbroiled and tasted thoroughly cooked (unlike others, we didn't experience a frozen taste). It was a big portion and for the price, you get your money's worth. However imo I've had better at pretty much any other burger place in recent memory - basically it doesn't really stand out taste wise from like say, Harveys. After digging into our burgers we tried our onion rings. Let me just say now, it was the worst onion rings I've ever eaten by far. No hyperbole, it was simply just awful. Incredibly thick batter, very oily, with no distinct onion ring taste. After eating a few it ruined my appetite completely.   On the upside, customer service was good - the staff were really polite and personable. I'm willing to say that my bad experience was entirely because of the onion rings, since apparently the regular fries are good! However I probably won't be trying back a second time since I think the burgers are just okay to begin with - they're filling, but nothing to write home about. Good for a late night dine with friends, just avoid the onion rings at all costs."}
{"text":"What can I say? Had to check out this place after some great reviews given! Cozy little setup, doesn't feel at all like a place where you'd get a burger from though! The souvlaki an stuff though fits right in!   The burger itself nicely done, a bit thin slab of meat for my taste and even with the bacon on top still not worth the $9 tag though. The toppings are nice, I liked the cooked onions  but I'd kinda hopes they had been hot rather than cold.   The fries though were quite terrible. No taste, no seasoning. I can manage that, salt / pepper was around but the fact that they tasted undercooked, wasn't nice at all. Left them as is.   I'm not brave enough for the super sumo yet but maybe soon! Gonna come try that one day when I've starved myself enough. Leave the fries though!"}
{"text":"Its been a while since I visited this place but I had a late night craving for burgers so I figured I would refresh my memory and maybe write a quick review ;)  More of your traditional style road side burger joint, for what it is I have always enjoyed my experiences here and the food has always been consistent and on par with what I would expect from such a place. Located off of Dundas in a small plaza in etobicoke  the space is fairly small but somewhat cozy with a retro road side diner feel. I haven't dined in for quite a few years but the place seems tidy and clean so I wouldn't be oppose to doing so in the future.  I find the service to be fairly quick and polite, the open style kitchen is always nice to see in these establishments as it does offer a little peace of mind knowing what happens to your food before you get it. I will say that this was the only reason I knew the patties they were cooking were indeed frozen (as I have now seen mentioned in another persons review already posted.... that'll teach me for not researching on yelp first!!)   However that being said I thoroughly enjoy the burgers here. I find them huge, juicy and they don't have that weird, gamey, meat taste that I sometimes get from burgers. They do not boast the greatest selection of toppings but truthfully sometimes I just want a good plain old fashioned banquet burger like the ones I used to get at my aunt's big family picnics.... that is the ones my uncle Bruno didn't burn to a crisp ;)  The fries and onion rings are not the best I have ever tasted but certainly no where near the worst, I do however thoroughly enjoy the gravy which is rich and savory and look forward to trying their poutine. I have never gotten any of the slushies and shakes but I am certainly not adverse to trying them too,  I  slushies!!!  I find the prices competitive, I understand the fact that this is a very standard burger place but the competition is charging the same if not more so I still feel its worth what you get as the portions are huge!!! The only downside to that would be the 24hr meat induced coma Kris U spoke of but again whether that is a downside is yours to decide I suggest you check it out for yourself"}
{"text":"I remember their burgers as being okay. Today I got their chicken burger. There was SO much bread I could barely even taste any chicken. But to make matters worse, I believe I just got food poisoning from the chicken. Excellent.  Also, their onion rings are literally just batter. There's no onion. This place is SO outdated in comparison to all the other burger joints around."}
{"text":"Literally drove here just to try it after all the great reviews, and was underwhelmed. People who love this place need to go and try Burger's Priest or Holy Chuck. Maybe it's not fair to compare because the place are totally different in atmosphere and everything else but absolutely nothing stood out to me about this burger except wilted lettuce."}
{"text":"Standard burger and souvlaki spot that gets it right.    Large fry and onion ring portions.  Nice job."}
{"text":"Okay guys.  My first review after reading a million reviews from other users over the years.  So I finally tried this place after it being on my To Do list for a long time and if I had to describe it in one word: A'ight.  The order:  Banquet Burger, Poutine, Banana Shake.  The Damage: 'bout $14  Burger.  Definitely big.  A Kaiser is one of my favourite buns for a hearty burger so I dig that.  Slice of processed cheese on a burger is key, but you can't screw that up so no points there.   Bacon was good.  Had some thickness to it, but they were short and curly so not every bite was a banquet burger.   The patty itself was just average- nothing unique or memorable about it.  Gets points for size but that's about it.  Poutine. It was fine.  Gravy was that typical burger joint gravy (light brown, salty and thick).  Cheese curds were low quality, but generous.  A lot of these places don't use real curds so I was was happy to see this.  Banana shake was great.  Tasted like quality.  Something is in there that gives it a unique flavour.  I don't think it's fresh banana.  It's probably the type of syrup they use or the type of ice cream. Either way, a very unique tasting milkshake.  Would I go back?  Yeah why not, but only if I'm in the area.  Not disappointed, but nothing I'll remember when I wake up tomorrow."}
{"text":"Awesome place for burgers, onion rings and most notable Poutine.   Fair prices compared to your 5 guys, Burger priest etc.  This place has been around for a long time and the front of old restaurant was shot for an old 1994 Adam Sandler movie Billy Madison.  Worth swinging by foe poutine"}
{"text":"Fantastic! My wife stopped in to get takeout. We loved the burgers/fries and onion rings. The burger was very tasty, cooked just right and not too salty. The fries serving was huge and found them very tasty (they got extra points for having malt vinegar). They onion rings were tasty as well. We will most definitely be back for more."}
{"text":"If you love Hamburgers, then you'll love C & Dubbs. Their prices are great, and everything is made fresh. Their burgers are HUGE, and I'm not even talking about the homeburger...they also make amazing fries and give you a ton of them! Why pay $10+ for an Angus burger meal at McDonalds when you can pay about $7 for WAY better quality food, service, and atmosphere."}
{"text":"Place is average nothing special at all...the kinda place u go when your high and need a quick greasy bite. It's also not very sanitary. The cook w the mustache kept blowing his nose n did not was his hands . The rag they were using to wipe up the trays smelt horrible . Also place has so many flys I'll pass"}
{"text":"I absolutely love this place. Very big portions, exceptional flavor. I'm usually very skeptical of mom and pops restaurants but this place is out of this world. The guy who works the grill is super nice, I'm assuming he's the owner."}
{"text":"I've been going to C & Dubbs for as long as I can remember and its about as classic of a restaurant as you can get in Mississauga.   Every single time I visit I get the same order. A homeburger combo with a poutine instead of fries. It has a pretty good name for the burger because it tastes just like you want your burger to taste everytime you have one at home!  The homeburger is just a treat to eat. The patty is the right mix of greasy crispy and juicy and it has been perfect everytime. The toppings are to your choosing and they are always fresh.   But the main reason I keep coming back is for the cheesy deliciousness that comes in the form of a C & Dubbs poutine! The cheese curds are always melted a perfect amount and stick together with the roght amount of fries. The gravy is hot and tasty and this is a poutine that doesnt need any extra toppings to make it better.  If you ever need a burger that definitely wont let you down C & Dubbs is the place to eat!"}
{"text":"Pull up 10:40 on a Saturday, time indicates open until 1am. Place is already closed and the staff ready to go home.   The practices of a garbage business, obviously. I thought this was a staple in Mississauga, as far as an older business that shows how hard people use to work and make good food.   Go support a real business like Apache Burgers. This is a garbage wannabe."}
{"text":"First time at C & Dubbs, Fresh cut fries are really good. Reminds me of the chip trucks. Burger was a little over charred but taste ok. Bun WAY to big for the size of the patty."}
{"text":"Best fries in Mississauga  for 40 years. The milk shakes are old school  too! The original location  was in the film Billy Madison.  It's worth the trip."}
{"text":"Came here for a UYE with my son (read Abbas's review!)  The Super Sumo burger is HUGE!! See my pics!  My son finished it in 4m 29 sec! Looks like we have to keep working to feed him...  Taste was good, though it is hard to get really excited about a burger... the fries portions were huge. None of us could finish them..."}
{"text":"Well...  was told that this was such an awesome burger place.  And maybe several decades ago.... It was!!I  But not any more.   I was totally underwhelmed.   It was ok.  But frankly, five guys is better.  So is McDonalds Angus!   So, no, I won't be coming back.   Cheers..."}
{"text":"Love the burgers, they're all juicy and tasty. Price is also good for the size we are getting.  The fries are also great and kids love them!"}
{"text":"Pulled up to C&D's with a hanger for that a big burger I saw in the pics. Walked in, asked about their patties, was told all the patties are frozen, but, the Homeburger was made for them using their own recipe, SOLD!  I ordered the Homeburger combo, upgraded the fries to a Poutine and added another side of onion rings because they looked really good.The burger was huge in size (8oz patty), the poutine and rings were also generous.   With a big smile on my face, took a big bite into the burger.  What was this...dry and bland!. What a disappointment, the bread appeared to be on the dry side, which would have been fine had the beef patty been juicy and not dry as a hockey puck. It was completely overcooked,  so much so that the cow's distant cousin was thirsty! I was unable to finish my burger. I'm not sure where other reviews wrote about that \"Juicy\" burger, but this was not it...I'm extremely disappointed with my burger !!!  On the other hand, the onion rings were fantastic and meal like due to the thick batter coating each ring. The fries were also very good on their own. However, combined with the sauce and cheese that was cut to look like curds (was definitely not curds, perhaps it was mozzarella) It was a sloppy mess that caused the fries to get soggy and the melted gooey cheese that lacked texture, ruined the poutine.   I compare this place to the old burger places of yesteryear that used to serve up broiled burgers in big round buns with a large portion of fries and a drink for 5 bucks. They were the greatest burgers at the time when the alternative was Harvey's and Mc D's. This place remains in that era and serves up that same type of food, of course there are many that still like that and this is the place for you (if they don't dry out that beef patty).  If you are looking for a modern take with a burger that has more of a gourmet taste, thick and juicy, IMO, you may want to investigate other choices."}
{"text":"TLDR: craving some hot, juicy and cooked fresh to order hamburgers? Well, here's the place!   What a hidden gem! It might just be the best burger I've ever had! Their burger combo ranges from $8-$15 (depending on what you want - cheese burger, poutine, onion rings, bacon burger, etc). The price isn't so bad if you compare it to a McDonalds Angus meal.  Anyways, I ordered the cheese burger with a side of poutine. The burger was HUGE, and so delicious when eaten fresh, the toppings were also very fresh, nothing to complain about the burger. The poutine was also super big, and also super delicious, the gravy was hot, so the cheese curds melted fairly quickly (just the way I like it!).  My friend ordered the cheese burger and onion rings. The onion rings could be a bit more crunchy, it had very thick batter so the rings were kind of on the softer side - I don't recommend the rings.  Side note: They also serve souvlaki dinners.  But, try their burgers, you won't regret it!!"}
