{"text":"Perfect little pizza shop in Jean Talon Market.

Food: 4/5 $5 gourmet pizza slices.
Service: 5/5 Extremely friendly.
Environment: 4/5 Nice pizza shop. Smells amazing.
Washrooms: N/A
Worth it?: 4/5 Great snack while at the market.

Stopped here for a quick breakfast before some market shopping. We were English speakers and they accommodated wonderfully. The guys there was super jolly and nice. 

The pizza was great. They have wonderful combination. I will definitely come back next time I am around."}
{"text":"This place serves a fresh, delicious and hearty slice of pizza. The crust is light yet substantial---this is not a thin crust joint. The toppings are unique...potatoes, caramelized onions, smoked meat, interesting cheeses. It is five bucks a piece and super filling, making it a scrumptious deal, to boot. I always go to the market hungry (naturally. It's all about the snacking), and I followed my nose here, as I'm sure many people do. Who can resist the smell of fresh pizza? Not me, baby! I will be back, probably soon. The counter service is quite charming as well. Good vibes all around."}
{"text":"While we were exploring Jean Talon Market we were looking for a good place to eat. Strolling the booth of many vendors, C15 pizza look good and my initial thoughts were right. The crust was soft and tasty, from the sauce to cheese, it was pretty delicious slice of pizza. Enjoyed this one alot"}
{"text":"So I stumble onto this small pizza shop while walking in the marché Jean-Talon. Smelling the delicious smell of caramelised onions and dough, I walked over to see what's up. After talking to the staff, she recommended the C15 pizza slice, their namesake, might I add, containing cheese, mushrooms, a type of cured meat which escapes my memory right now (I think it was bacon), and tomato sauce.

First, as you can see from the picture, the pizza is not a typical slice of pizza. The toppings were great, quality wise. The sauce was just perfectly tangy, sweet and salty at the same time. The mushroom was tasty, and the meat was smokey, salty goodness, and the onions helped cut through the heaviness of the cheese and the meat.

 It's the square slice. The thick crust was packed with flavour, albeit it could have benefited from a few more minutes in the oven. It was a bit too pale. Same could be say on the cheese.

Amazing service, friendly smiles, and solid slice of pizza. Would come back, often."}
{"text":"when at Jean Talon - this is a fantastic location to grab a slice of pizza"}
{"text":"Bonne pizza avec garnitures originales. J'ai essayé la carbonara avec fettucine, lardons et fromage. Délicieuse. Endroit idéal pour apaiser une petite fringale."}
{"text":"Pizza done well! Dough was bready and full yet crispy, reminds me of pizzas I had in Argentina (fugazette)! Toppings were generous and their signature caramelized onions was a very nice touch. 

We tried: 

The Montreal: smoked meat and caramelized onion. Hearty choice for the meat lovers. 

The Goat cheese one: balanced and welll flavoured vegetarian option! 

HIGHLY highly recommend, the crispy bottom of the dough was one of a kind."}
