{"text":"I love the fondues here. Have tried the white chocolate, the coffee chocolate and the matcha. All are very tasty and sweet. If your not a fan of sweetness desserts this place is not for you. But the coffee dipping is not so good my personal opinion cuz of the coffee beans kinda bother me. If dont like brownies you can ask them switch to waffles or any things else. I definitely recommend this place. 4 stars bcuz the price is a little high for very little amount of fruits and waffles"}
{"text":"Beautiful setting. Extremely slow and inefficient service -- coffee took 30 mins to come and they came long after dessert was finished. We ordered Earl Grey Fondue. It was underwhelming. We are quite disappointed overall..."}
{"text":"My food was good, the chocolate fondue was great, lots of variety of stuff on the side to dip. The waitress was super friendly.
The place is pretty unique, I haven't seen something like this in stc before. It's like I'm in the mall... but not.
They don't have a washroom inside, is this even considered \"inside\"? You'd have to go out to the mall for the washroom which feels kinda awkward. Maybe it's just me.
I got the matcha chocolate fondue and it tasted like matcha kitkat SO GUD. Yes. I can eat this all day"}
{"text":"Tried a white chocolate fondue. Dont be fooled by the large bowl of chocolate dip, the bowl curves so it isn't actually deep at all. The serving is pretty scarce for the price. There should be a washroom in the restaurant"}
{"text":"This is the new location that just opened at STC. The good thing is there's plenty of seating especially behind the wall. I got the sa-weet chocolate sharing for two option and for 30 bucks it was def not worth it. I mean it was good, not amazing but good...but definitely not worth its price. Probably better to explore something else on the menu considering this thing was pretty small. 
."}
{"text":"I'm just rating the dipped ice cream to-go, but honestly, I loved the coffee flavoured dip! Definitely a must-try since it's got a bit of crunch to it, plus that coffee flavour that I sometimes crave and love so much, I mean they go great together in my opinion. The wait time was fast since we were first in line and service was friendly and knowledgeable on fan-favourites. Went with my gut feeling though, since the server said that chocolate and dark chocolate were popular. Just a little too plain for my liking so I recommend the coffee"}
{"text":"If you are a chocoholic, this is the place for you!

We got the classic milk chocolate fondue, which came with approximately 8 small brownie cubes, 8 waffle bits and two small cups of fresh fruits (strawberries, pineapples, and bananas)

We also got the marshmallow, graham crackers, peanut sauce, banana in toffee sauce and dark chocolate sauce. This came with a small grill to roast your marshmallow.

The total for all this came up to approximately $30.

This was adequate for 3 people, but we went after a huge dinner. If you decide to skip dinner and go straight for dessert these portions are way too small. Hence, the 4 stars instead of 5

I would consider this a one time experience and probably wont consider going back."}
{"text":"Came here for a mid mall snack yesterday.   First time coming to this chain, but see more are popping up.

Had an ice latte and a parfait.    There was no wait to get in and maybe it's cause of the price.   Everything is pretty over priced here.   

$6.95 for the iced latte.   It was not the greatest.   The parfait was one of the cheaper desserts ~$12 in a cup with 2 scoops of ice cream a chopped up brownie and some raspberry sauce.   The sauce was tart and worked well with the vanilla bean ice cream but the chocolate drizzle they used to decorate the cup on the inside hardened before it came to the table so was impossible to eat.

Didn't eat real food but some of the food coming out looked delicious.

Staff was really friendly, unfortunately the product itself would make me not want to come back for sit down.   

I would love to try the soft serve with the different flavour dips but I think that is already starting around $7 ."}
{"text":"Located upstairs of the food court in Scarborough Town Centre, this cute chic-looking dessert shop was perfect for a late night sweet. Although the mall closes at 9, this place stays open until 10:30 and serves up a variety of instagrammable desserts (chocolate fondues, ice cream cones, and waffle and fruit platters). 

My friend and I were craving ice cream so I got the coffee-dip while she got the black sesame-dip. We both got the regular size (smallest available option) and the portions were still pretty huge! I couldn't even finish mine and it took me so long to get to the cone that by the time I did, it wasn't crunchy anymore. 

Their soft serve was creamy, not too sweet, and held its consistency well, even after 30 minutes of eating! As for the coffee-dip, I thought it was a little too sweet but the flavour was really delicious. The richness of the ground coffee beans was nicely complemented by the slightly gritty texture of the chocolate shell that encompassed the smooth and creamy ice cream. The combination altogether was a delectable treat and it only came up to ~$6 after tax. I would definitely come back to try their other flavours (and hopefully bring a +1 to share it with)!"}
{"text":"I had such high hopes for this place but I was actually quite disappointed with my order like just look at it . Some items on menu were pricey and way toooooo sweet. I really don't know haha I think it was just this branch"}
{"text":"Absolutely horrendous. I came here for brunch with two friends and we waited forever for a server to take our order. They came by a few times asking if we we're ready and we told them we would like to order. As soon as we said that, they would walk away - it happened literally 3 times. Not to mention - everyone working there was very young and it just wasn't a place that provided good service. The food wasn't great either. I ordered chicken and waffles which were mediocre. However, my two friends ordered different types of waffles and it came completely soggy and gross. They ate at the very most 1/4 of their food. Unfortunately, the hot chocolate and hot cocoa drinks was the only good part about our visit."}
{"text":"Ordered Capcha Matcha-- a little too sweet for my taste, but good if you have a sweet tooth. It's drizzled with the matcha dip, which was delicious! The waffle was loaded with strawberries, whipped cream , and ice cream as well. The dessert matches perfectly with the Cacao 70 mocha with dark chocolate. 

The place itself had a nice ambiance--bright and modern.  If you choose to dine in, they have an array of brunch options on the menu. It's a great new place to eat out here at STC, but it can be a but pricey."}
{"text":"Very nice dessert place inside STC. Love the elegant vibes! Tried the double matcha and triple chocolate fondues, at first we asked whether we can combine 2 flavours for the double fondues. After the server checked, she able to allow us to mix 2 flavour for one order. That's pretty awesome as we got to try different flavours! Both are equally good, but the cups are too shallow, its not as deep as it seems. Overall, good place to chill and catching up with friends."}
{"text":"If you are someone who loves dessert/chocolate and is willing to try something new just like me--don't. You will just disappoint yourself #do #not #upgrade #to #waffle(s) #Cacao70STC"}
{"text":"Cacao just opened at STC, the seating area will officially open this weekend (either Friday or Saturday).

It's located upstairs next to Tim Hortons right next to the escalator.

I'm so excited! This delicious eatery sells desserts such as waffles, crepes, chocolate pizzas, cake and much more. They also have brunch and hot/cold drinks. Everything on the menu is amazing. Today I tried the hog chocolate from this location (YUMx100).

What's unique about this location is that they offer dipped ice cream (with lots of flavours - shown in the pic)."}
{"text":"Beautiful brand! The decor and vibe is very boho and the menu is tastefully designed with bright colours.

There's also a nice variety of items! The sit in menu has so many choices (almost too many) from chocolate pizzas, fondues, to waffles (both savoury and sweet) drinks, cake and ice cream. The prices can be a bit hefty ($30 for a pizza!), but the servings are so big. I recommend sharing with a friend because it's quite filling.

I got the dipped ice cream from the shop (black sesame), and the scoop was HUGE. It was like 3 scoops worth? I found the dipping too sweet and had to eat the soft served ice cream with it. The cone itself is sweet too so it was a lot of sugar at once. Overall, the portion was too much for me, I wish they offer a smaller size."}
{"text":"I got a coupon from a friend that went to I had their free dipped ice-cream. ummm the place looks incredible and very nice to be just to chill with a couple of friends or a date with a girlfriend. 

As for the dessert... the dipped ice with a-ok... the chocolate dip was so thick that I feel like I'm eating more chocolate then an actual dipped cone. 

If the chocolate was a thinner consistency maybe the dip would be better. They only had vanilla ice-cream so I wish they had a choice of chocolate or twist like the ice-cream trucks... Not sure if you understand how the ice-cream trucks have the 3 choices of ice-cream then that nice thin dip. When you take a bite that brittle chocolate with the bite of ice-cream is just so tasty. 

I would like to try their other hot cocoas or dips. I did enjoy the praline dipped cone."}
{"text":"Cannot compared this place to the original one from Montreal or the one at Distillery District. Their food are slightly different compared to other locations. Service was good but atmosphere is terrible. Is a open concept/ food court style. Every who passed by can see what your eating. As STC is a busy mall there is 0 privacy."}
{"text":"Pretty sweet stuff. Love chocolate!
Had their buckwheat crepe. It had mushrooms, basil pesto, swiss cheese, roasted red peppers and ham. Good stuff I've never had one with buckwheat.

We had the dark chocolate milk shake. It was very warm. We told the waitress working and she was really nice about it and had it redone. They basically blend it again with ice cubes. It was better but still the ice was bigger then the straw and it would get stuck while drinking.

The funny part was getting our water in cups verses glasses. Overall this place has alot to offer whether your dining in or on the run. 

We'd try this place again."}
{"text":"Woah, I'm in Scarborough?? The interior decorating of this place blew me away. The space is perfect if you want to shop and grab a drink or snack with friends at the town centre. Which is something I haven't really wanted to do here since high school. the space also photos really well, with all its colours and character showing through. Unfortunately the cappuccino I ordered was not as impressive...which is why I'm giving them a four star. I'm hoping if I come back and order food it will do the place justice. Or hopefully it's because the place is still new, maybe within a couple months the drinks will be just as good as the decor"}
{"text":"The cappuccino milk froth is too much. And should practice on pouring the milk, expect to have decoration on it. But there's none. The food is fine. Just a little bit expensive."}
{"text":"I have been wanting to try Cacao 70 since it opened in STC. There's an option to dine-in at the restaurant that serves complete entrèes and dessert as well as the option to get take out, which only serves waffles, drink, and soft-serve ice cream. I decided to get take-out because of its dipped cone. From scoping out the photos on Yelp, I saw that Cacao 70 not only offers the flavour of the dip in chocolate but also unique flavours such as chai, black sesame, matcha, and earl grey. 

I am a super fan of earl grey tea, so naturally, I decided to get that flavour dip with my soft serve. My first bite into that cone was... WOW!! I was immediately hit with the white chocolate flavour but as that taste mellows out, the earl grey essence starts to emerge. The floral aroma from the earl grey just permeates throughout my mouth... I could only say that it is indescribably delicious! I don't know how Cacao 70 imbued flavour in the dip but the earl grey flavour did not taste artificial. 

Also, the thickness of the chocolate dip... OMG, I was in shock! The thickness is probably a good half a centimetre thick, which is comparable to Dairy Queen's chocolate dip that is a whole lot thinner. Even though the dipped cone looks small, because of the amount of chocolate on it, I would say it is probably about half a hershey bar worth of chocolate--which I find is plenty enough to eat in one sitting. Although paying $5.25 + tax for a regular-size dipped cone is a bit on the steep side, I believe it is worth it for the quality, flavour, and quantity of the chocolate in the dip--Cacao 70 does deliver in its chocolate!

Service wise, I was not greeted or thanked so I would say the customer service front could be improved quite a bit. Even though I was simply getting take-out, receiving some service would have been nice. Nonetheless, I was happy to see the worker wash her hands before she made my dipped cone so at least on the sanitary front, I don't have to worry about getting sick after eating here. 

Overall, would I return? HECK YES!! I still have other dipped flavours to try!"}
{"text":"Tried their matcha waffle ice cream combo. Waffle is freshly made which is really nice. Couldn't tasted much matcha flavour in the dip but the soft serve ice cream is good. And I really like their whipped cream (usually not a fan). Overall it was nice, although it doesn't look huge but definitely enough to share between 2~3 ppl"}
{"text":"I've been so impressed over the years at how STC has upped its game, proving to the world that Scarborough can be fancy too. And now, Cacao 70 brings the mall's overall coolness level up to that of...dare I say...Fairview Mall?!

Every nook and cranny of Cacao 70's aesthetic is so insta-worthy that I just want to run across the beautiful hexagon floor tiles and sink into the pastel pinks and giant green leaves on the wall.

Now I just need to get this comment about the service out of the way. We came in around 9pm (it closes at 1030pm) and the waitstaff were all super awkward. Awkward about how we were coming in so late, awkward about seating us, awkward about us taking our time with the menus and then finally awkward with us paying the bill.

I can't comment much on the food or ice cream, as my friend and I only shared one item off the menu: the cheesecake ($9.95). It was worth every penny for the geeeeeenerous square of crustless (why?!), delicious dessert topped with some sort of magical nuts, berry sauce, berries and a small dollop of melted matcha chocolate. It was plated beautifully, incredibly rich and tasted very, very good. 

I will be back. With a camera. And hungry for cheesecake...aaaaaand maybe some soft serve."}
{"text":"The meat lover omelet is to die for!! Simply delicious, no pictures of it because my fiancée and I could not wait to devour it. The after party waffle was simply exquisite, like the French make it."}
{"text":"Interesting to see this open at a mall! The stc location is very spacious, located at upper level where old food court was. Their chocolate sauce is really good!! Ordered the strawberry crepe with chocolate sauce to share! Would come back and try their other desserts! For $11.50, the price is decent for a crepe."}
{"text":"Taste bad .. not hot for waffle, cold drink not cold .... finger print on the plate .. the spoon is bigger than the ice cream...."}
{"text":"My friend and I wanted to try Cacao's ice cream dip. Oh boy... it was one sugar load mess! X_X

As we approached to the front counter of the take-out area, the cashier immediately greeted us with a smile. She was very friendly and asked which flavour dip we would like for our order. She suggested the Earl Grey and Matcha chocolate dip as they seem to be very popular.  

We end up getting the black sesame and earl grey ice cream dip. On my first bite, I didn't notice the sweetness level and I thought it was pretty bearable. As I try to indulge in this massive sugar loaded ice cream, I started to feel the sugar kicking in. I got to tell you, I LOOOVVEEE white chocolate but the black sesame dip is dangerously sugary. It felt like I just placed sugar packets in my mouth T_T!!! Just make sure you have water close to you because H2O will be needed to chase it down the sugar lingering in your mouth. I'll give them credit for the intense black sesame flavour in the black sesame dip. However, the sweetness really overpowers everything and ruins the overall experience :( .The vanilla ice cream itself had a creamy and smooth consistency. The waffle cone had a perfect crunch and tasted very fresh.  

I liked how bright and welcoming the place looked. They displayed a lot of their take home items including chocolate bar and DIY hot cacao. I think these can be nice gifts for friends or family members. The take-out menu boards were presented elegantly and easy to understand. I LOVED their coffee table which included all the essentials (ex. wet naps). For all those clumsy eaters (ex. ME!), you will need to visit that coffee table!! The benches outside of the take-out area felt very comfortable and spacious and I believe a large group of friends can chill and relax at that area.  

Will I come back? Maybe ??? If I do come back , I might try the dark chocolate dip . I really hope it wouldn't be as sweet as this one. I might also consider their dine-in option and try some of their food items! ^-^"}
{"text":"Prepare to be impressed! The place is lovely, the staff is friendly and the food is to die for! Seriously recommend the triple chocolate dip!"}
{"text":"I am not a huge dessert/sweet fan and I found this place to be so-so. Besides dessert, there is also other options that is available such as omelette etc. We ordered the hot chocolate which didn't taste very good to me. We also got the fondue, it only a little bit of fondue they give you however they make it look like a lot but the bowl only goes 1/3 of the way. There is a good selection of options to dip your fondue in such as fruits, brownies, waffles etc. There seemed to be a overload of sugar as well. The price I feel is very expensive as well for the quantity given. 
It is however a very beautifully designed location."}
{"text":"This place was one of the worst ice cream places I tried in my life. It's just vanilla soft serve and they dip it in matcha sauce and the price is so not worth it. It was unbelievably sweet I don't know how I finished it. The best I cream place I probably had was Tahiti this place doesn't even compare to that. I saw they have other savoury type of foods but stc old fast food places were pretty good before this place came in. I give it 2 yrs"}
{"text":"Cacao 70 is now open at STC! I ventured there and tried their soft serve dipped in earl grey white chocolate. I thought it was just a tad too sweet and it lacked the earl grey flavor. I am willing to go back and try their other flavors. Unfortunately, the earl grey was a miss for me :("}
{"text":"I had really high expectations for this place since going to the one in Montreal (which my friends and I loved by the way). Going to this one, I'd have to say I'm a little disappointed. Their cone dipped ice cream was $5 for the regular;  they dip a vanilla soft serve into different chocolate flavours (e.g., early grey, matcha, black sesame... etc). The ice cream I got was early grey dipped and it was great, definitely tasted like the tea and the colour was so pretty which made it look even nicer. Then I went a second time with my friend for brunch. She ordered the smoked salmon breakfast platter which came with panini bread, greens, yogurt sauce, potato wedges and literally just 3 small pieces of smoked salmon for $17.95 (although it comes with a side sample of fondue and fruits) but for that price? And the taste? She was not pleased. The aesthetic however, sold me. It was beautiful in there, clean and minimal - definitely picture worthy. But if I were to go there again, I'd probably just go for their ice cream and skip the breakfast/brunch platters."}
{"text":"Decided to try this place out with my boyfriend. We ordered the Sa-weet Choco Sharing plate and a quarter of the triple chocolate pizza. We were confused when the pizza arrived because it was pretty big for a quarter, we found out later in the bill that the server, Monica, placed in an order of half the pizza. The Sa-Weet Choco sharing plate supposed to include Graham crackers but weren't even on the plate. The server never came around and asked how we were doing and never really seemed to be around after our food has been given to us. I've never felt so scammed from any place before. This is the first and last time we'll be going to this place."}
{"text":"Taste not really that good and price is way expensive. Most of the servers are ok....just the one girl serve me there seems don't know what she was doing there or maybe she got drunk. I asked for hot water have never come. Not came to take order until her colleagues told her I was waving my hand for so long. Anyways all other server serve me but not her..... so leave me no chance that I can only give them very little tips"}
{"text":"The ratings don't lie, it's a decent place but too expensive for its worth.
Had the after party waffle and classic milk chocolate fondue. The waffle was $15 and the fondue was $11. 
The after party waffle was fresh made, but was relatively small for its price. Tasted really good though, rich and sweet chocolate with whipped cream and strawberries. You might get tired of it if you're eating it on your own though, but it definitely satisfies the sweet tooth. 
The fondue was disappointing - the chocolate dip was delicious, good quality chocolate, but the stuff you dip with was underwhelming. Stale brownie, old waffle bites, and a small bowl of fruit. Brownie and waffle bites were in small proportion as well. Fruit was fresh though. It could have been really good had they tried harder to get fresh desserts to dip with! 
By the way, the pot of chocolate is a lot shallower than it looks! Its only a quarter of the volume of the pot.
You know, I'll probably give this place another chance with the take out stuff (dipped icecream an waffles, drinks). Their chocolate is great, and I want to see it highlighted in their other offerings."}
{"text":"I absolutely LOVE the aesthetics of this place! It's pretty and cute and their chocolate is delicious!! I had the matcha fondue and it was fantastic! I'm definitely going back to try their earl grey and coffee flavoured chocolate fondues as well. The gave a fair amount in terms of portions and the service was good too. My only complaint would be the price."}
{"text":"I've only had their dipped ice cream at this location so I am speaking from that takeout dining experience. The decor looks beautiful after the renovations at STC. However, the dipped ice cream was less-than-stellar. They have a lot of flavours to choose from, but the chocolate is far too thick and sweet to accompany the already-sweet ice cream underneath. It's a small cone you get but I ate the top and couldn't finish it. I don't like wasting food but I just couldn't finish it. The ice cream quality isn't the best either, there's this powdery aftertaste that gives you pause after each bite. I think I will stick to their regular products the next time I'm there."}
{"text":"Cacao 70 was pretty hyped up so I thought I'd give it a go. Very spacious and open at STC and is pretty inside.

The menu is very overwhelming, a lot of stuff on the menu, some seem way too similar and there are no PICTURES! My friend ordered a banana split and I ordered a chocolate ice cream cake. Though the presentation was really nice, everything tasted sub par. Cacao 70 does a very interesting, weird and original twist with modern dishes. You can find both a better banana split and ice cream cake at Dairy Queen. My friends dad went for a hot chocolate, and paid $7 for \"trash.\" With that said the pricing is unreasonable. 

I would never go here again, and will definitely warn my buddies to do so as well.

For better in restaurant desserts D Spot and Demetres, save your time and money, don't go to Cacao 70."}
{"text":"Came here a few days ago to catch up with one of my friends and to have some dessert. I personally love the Downtown Toronto location and after reading a few 5 star reviews for this location I had high expectations. 

To begin, our waiter was kind but the service was not good! We constantly had to look for our waiter because he was no where to be found. Don't get me wrong, he was nice but we constantly had to ask another waiter to call him. The waiter also didn't come check up on us.

The dessert was really good! I had the American-style hot chocolate for a drink and the choco-nut waffle for dessert. The American-style hot chocolate was just okay, because it was way too sweet for a hot chocolate! It literally felt like someone melted chocolate, added some liquids and presented it to us. I mean the first few sips were okay but it got worse towards the end. The choco-nut waffle was amazing! Despite it being smaller portions than the Downtown location (because I have seen other dishes of people around us) and it was really good. 

All in all, I would come back but just for the desserts, not the drinks. Also, this place is expensive compared to other dessert places in Scarborough. $17 for the waffle that was small and cut into 4 pieces."}
{"text":"I really love this location only because they serve matcha.  Matcha dipped cones, matcha fondue, matcha waffle.  Can you say matcha much? Lol 

Also their brunch items comes with a free fruit fondue which is great plus this location is great if you want those aesthetic instagram photos :)"}
{"text":"I wasn't expecting to eat here as I was just running errands in the mall. I had a large Presotea in my hand and decided that I wanted food so I headed over to Cacao 70. To my surprise, they didn't say anything about me bringing in a drink from elsewhere. We were seated promptly on a Saturday afternoon. 

The entire place is very aesthetically pleasing from the tiles to the wallpaper and the decor. It's open, spacious, and airy. 

I personally thought our server was a little awkward. When she came to take our order, she approached our table and said \"hello\" and just stood there. No \"may I take your order?\" or anything of the sort. I  don't see an issue with the pricing like some of the other reviews. I think it's fair considering the type of cafe you're in.

We ordered the Savoury Waffle ($15.25) and the Smoked Salmon Bagel ($11.75). No drinks for us since I had my giant Presotea!  The waffle was delicious with the ham and sunny side up eggs. I don't eat mushrooms but you can't taste it in this dish. Quite a good portion and I only finished half of it. I would NOT recommend the Smoked Salmon Bagel. The bagel itself was not good. I just think this dish could be improved upon.

Regardless, I will be returning in the future to try other food/beverages on the menu. I just won't order any bagels!"}
{"text":"Came here on Chinese New Year and they also had a grand opening event with free hot chocolate. Sampled their dark hot chocolate and also their sesame hot chocolate. You can tell that it is made of real chocolate, and it is very good. However, it is usually around $5 and is a small cup, so you definitely are paying for good quality. I did find it overly sweet and rich, and I think it would have been better with more milk. The interiors are beautiful though and very modern looking. They also have lots of other things to try like crepes, fondues and dipped ice cream cones. I would love to try their ice cream cones next."}
