{"text":"I walk in out of the cold after dropping my car off at the mechanic and am ignored for 10 mins by the cashier and cook who seem to be having a spirited discussion in the back even though eye contact was made (along with a lot of coughing to make then aware of my presence). Finally she comes to take my order. She then acts lost as I order the very first thing on their menu, at the same time the cook comes in and asks me what my order is in an angry voice, I advise him that I am in the middle of placing my order. She apologizes for him and tells me he is just \"passionate\" - I already decide I hate this place at this point but my hungry so I make do. Haven't even gotten my food yet but this place is garbage just by the service alone. They clearly don't care about their customers."}
{"text":"The owners are nice people. The coffee is great, the place is new and clean, and the food is made fresh! The place is very new, they opened around xmas time."}
{"text":"I have only done take out. Food is very good Italian fare. BUT The vegetarian choices are non-existent. You have to ask for pasta or pizza with veggies. This starts to get expensive as you add a few toppings. It will be great if they can add some vegetarian pizza or pasta to their menu."}
{"text":"Met some friends for lunch. The food was amazing and the service was very friendly. Very accommodating !! The pizza is so yummy!! The salads are delicious . We will be back! If you like fresh homemade food this is the place to eat!!"}
{"text":"I've been here a few times already and really enjoy their food each time. It is a family run restaurant and everything is made fresh, fresh, fresh!!! The restaurant itself is very comfortable and clean.  The crusty bread for their Italian sandwiches is so fresh, crusty on the outside and nice and soft on the inside. I've tried the chicken parmesan, meatball, and eggplant parmesan sandwiches - all made homestyle and not too heavy or oily. You can feel good about what you are eating...  Also tried their family dinners for take out, i.e. pizza and penne a la vodka with meatballs - very tasty, good portions and value.   This place is a family owned Italian cafe and its evident they truly take pride in what they serve. A truly hidden gem and we are lucky to have this in our local neighbourhood!"}
{"text":"Went here for lunch. Very small place. We ordered the hamburger and veal sandwich. Hamburger was delicious, juciy and big! Service was quick so a great spot for lunch! Definitely will be back."}
