{"text":"Beautifully decorated and a good relaxing place to hangout. Service and food presentation were really good. I ordered a Croissant sandwich with salmon salad toppings which tasted delicious. Food portion was big for the price I paid. For drinks I ordered a cappuccino. It was a bit strong for me and the taste was ok, nothing special. Maybe next time I'll order the latte. Overall, I really liked the store ambiance and the service. I will visit Cafe Alice again."}
{"text":"This place is a little hard to find in Langham if you're unfamiliar - I usually go through the entrance from the underground parking. 

They were out of the caramel dessert that night but tried everything else. Lava cake is pretty standard. I liked the lavender creme brule. And cake roll one was alright. And tiramisu was also pretty standard. 

Chicken wings were small but juicy. 

And most importantly, really friendly owners and staff."}
{"text":"Came here the other day to do some work. Pretty interesting concept having the darts area and pretty/cutesy decor on the other side. I ordered a chocolate lava cake. I wasn't AMAZING but pretty good and chocolatey for only $5.99. Would love to come back and try their espresso drinks and lunch service."}
{"text":"The interior design of cafe Alice is really nice and the staff was super friendly and helpful (I think my servers was named Andrew). They also have darts to play with! 
I got the croissant sandwich, it was really good. Super flakey, warm, buttery, apparently they bake their own croissants. The fries were also really crunchy and delicious, the cream puff was a bit expensive in my opinion for its size. 5/6$ a cream puff. 
Overall I enjoyed eating here! 
Why 4 stars not 5? Because they didn't have a lot of the salads and no roast beef, the wait was a bit long... It might be because of how many people there were."}
{"text":"I saw this place while driving by and knew I had to try them! I came here to try their desserts and drinks. Who knew they also had food! 

I had the Lava Cake and Cream Puff. Both were really good, but I'd prefer the lava cake just because I love sweets. The cream puff was very light, I probably would have enjoyed it more if they offered it in different flavours. 

Although desserts were yummy, it wasn't amazing. But for their service and decor, I would definitely come back again. Prices were very reasonable and they also have dart machines which is quite unique."}
{"text":"Cafe | Snacks | Entrees | Desserts | Darts | 12pm-12am | Langham Place | LLBO coming soon

Inside Langham Place at Parking Level 1. You can also enter from the outside across from Nissan Dealer.

This little cafe is opened by a George Brown alumni with all food made by them. They offer entrees like NY strip loin steak with fries (which I recommend), salmon, chicken etc. A variety of snacks such as chicken wings, curry fish balls, crispy fried etc. 

This little place is good for chatting and a quick meet up. They mentioned to be soon liquor licensed which will be great with darts and snacks.

They have a variety of homemade desserts like macarons, lavender creme brulee and lava cakes. 

Definitely will keep trying their new menu items."}
{"text":"Cute little cafe with Alice in Wonderland theme. Good ambience for coffee and dessert. We ordered the lavender creme brulee, lava cake and a macchiato. 

Absolutely loved the Lavender creme brulee! It's not too sweet and had a subtle scent and taste of lavender.

Lava cake was also very well-done with the right amount of sweetness so it's not too heavy.

I also liked the macchiato as I personally don't prefer anything acidic, would be even better if they also carry cortado in their menu.

Overall a very good impression for  first visit, friendly service, fairly priced menu, and great desserts!"}
{"text":"I was looking on Yelp for some cafes around the Markham area and stumbled on Cafe Alice. It's a new cafe that recently opened up so my friend and I decided to try it out. It was a bit difficult to find the cafe. It took us about 10 minutes to find it. If you don't know the plaza very well, you must enter from the underground parking. The interior of the cafe is cute and has pink flowers hanging from the ceiling. The wall is painted like the movie Alice in Wonderland. They offer iced and hot lattes, espressos, food such as dim sum and pasta as well as desserts. I ordered a hot vanilla latte and lava cake and my friend ordered a hot hazelnut latte and lavender creme brûlée. We were not disappointed! Our server was really nice and attentive and refilled our water once we were done with our food. They also have darts if you don't want to grab drinks or dessert. This place was not as busy when we arrived around 6pm on a Friday but it seems to get busier around 9pm. I would have rated a five star if there was more variety of food and if the location was easier to find. Overall this is a quiet and cute cafe to go to if you want to grab coffee with a friend, get some studying done, or even play darts."}
{"text":"Grand Opening today!!
Been going to this cafe before they are open, attended their special pre-Opening events, and was here a couple times during their soft opening.

Kangen water is one of the special thing here.
Dessert is their specialty here.

But beside cafe food, desserts, espresso, soda drinks and such, they have something you don't usually find in a cafe - darts machine.

They have 4 units of Dartslive2 machine, which is a electronic dart board machine that uses soft tip type of darts to play.

It's a really unique cafe, and I am sure I will be here again soon. (As many as few days a week!)"}
{"text":"The dessert was not bad and a fair price. Considering most items were about $5-6. I did find the desserts to be too sweet for my taste buds. I had the lavender creme brulee but the sugar top was too thick for my preference. The Japanese roll cake was alright. 

The environment was very cute and the chairs were comfortable. However, in the corner there was a section for darts and I found that strange given it seemed like the theme was meant to be \"cute\". There was a nice floral decor hanging on the ceiling and the painting on the wall was beautiful. My group of friends and I went around 11, so it did start to get rowdy with the darts. 

The customer service was fantastic though! They were always attentive and made sure our glasses of water were always filled. 

It's a nice place to visit, but I wouldn't bring your date here if you are planning a late night dessert."}
{"text":"It's nice spending an afternoon here. Music was not too loud and relaxing. They serve Sloane tea, which is one of my favourite tea brand. 

I started off with the curry fish balls - Authentic Hong Kong curry sauce ($6.99) the flavour of the curry was pretty good. Except the fishball tasted a little fishy but the curry was good! 

The croissant section on the menu, you can choose many different toppings, such as the grilled chicken breast, Italian salami, tuna salad, apple & potatoe salad, salmon salad. I have chosen the smoked salmon with onion as the side toppings. The croissant tasted very nice, buttery and flaky and crunchy.

I've ordered the BBQ wings, 1/2 lb grilled Chicken Wings marinated with a hint of honey and ginger flavour ($6.99) it was a good small sized wings, dry on the outside, while still moist and juicy in the inside. The wings reminded me of a nice summer chinese style bbq day with the Chinese style wings. I really enjoyed it. The wifi was stable and fast, good ambiance to do some work on my laptop. 

The service was nice and friendly, they will ask you if you want to refill more hot water and how we found the food. They will watch and clean our plates away. Very attentive service. 

Also it was nice to run into a kids party, where they brought their own birthday cake. They order chicken wings, steak and salad platter. The wings smelled so nice that I had to order my own! Nice venue for kids party too. The kids and adults seem to both enjoy it!
 
Based on the food, price, service, ambiance. 
I will definitely come back again!!!"}
{"text":"This is suppose to be an Alice in wonderland themed cafe. You wouldn't know that without stepping inside or reading Yelp reviews (or taking a wild guess why it's called cafe Alice). 

Now that you know, try and find the entrance. There is one on Kennedy, and another from within the parking lot. It's not easy to find from inside this deserted mall though. Alice didn't enter the fantasy world through some obvious entrance either, so it's all part of the theme. 

Interior is well decorated. Alice in wonderland is painted across the entire wall. Cafe Alice... the painting.. rabbit hole-ish entrance.. I'm seeing a connection here. Flower decorations.. chalkboard menu.. dart games in the corner.. tables and seating for maybe 20-30 ppl.. it's clean and cozy. 

Ordered the kangen soda, lava cake, and croissant. At $3.99 for the soda, I got a pretty small cup that's about 80% full. I would expect a larger and fuller cup. The soda isn't anything special either. Whether it's kangen or not, you probably won't taste a huge difference. You also won't get the same benefits kangen advertises when you drink a small cup once in a while. The peach flavor is a nice touch though.   
Lava cake is pretty standard. Not much to say about it other than, it being one of the more popular items on the menu. I'd like to see this dessert elevated with some fruits or decorations to make it less boring. 
The croissant is super flakey and tastes pretty good. The grilled chicken breast was pretty thin and dry and didn't get much of it either. There was more lettuce and tomatos than chicken. Very disappointed!

Overall service was pretty good. We had a large group and was well taken care of. 

Now back to the theme. I think this cafe could go one step further with their menu and rename and design some of their items and offerings after Alice in wonderland. That would add a nice touch to the whole experience and really tie it all together. Otherwise, good effort."}
{"text":"Saw the popular reviews on Yelp and decided to give this place a try. 

We ordered a Japanese Roll Cake, the texture was a bit dry to our liking but the taste was good. We also ordered a Tiramisu which was okay, we've had better ones before. 

We also ordered Mochas to drink, not sure if they were trying to attempt latte art on there...but if they were trying to, they need a bit more practice. Drinks tasted good and acceptable.

We were also given free chocolate chip cookies on the house. The texture was not your typical chocolate chip cookie. It was soft and crumbly. It might have been a bit under in the middle. 

I noticed that they were applying for a liquor license as well, not sure where they are going with the theme and food of the cafe. I wouldn't be surprised if it turned into a lounge later on. 

I would suggest this place for afternoon tea not sure about other things."}
{"text":"Service 5/5
Atmosphere 5/5
Food 4/5

Just went there for dinner and I have to say that the service is exceptional - owner and servers were so nice (celebrating birthday, they gave us free item on the house!). We tried the steak (medium rare cooked just right with a brim of fat and the fries were really good as well) and giant smoked salmon croissant with special Alice sauce (very crispy, huge and good value). It's small and cozy with dart boards on the side and beautiful paintings on the wall."}
{"text":"I was so excited to try this place out the place looked nice, you get the place darts and it's not loud. I loved the ceiling decoration (Sakura blossoms) and the drawings on the walls with the Alice and wonderland storyline. 

Let's begin with the beverage. The owner/waiter was very kind to ask us if we would prefer hot or cold water. The mugs and cups were very uniformed. 

As we were looking at the menu the waiter was very nice to let us know what was not available before ordering anything. They constantly kept an eye on their customers to see if they need any assistance or water.

The beverage: the cappuccino taste like a regular cap, nothing too special but I wished there was something special. The iced hazelnut latte was ok. The presentation is like getting a iced latte from Starbucks, milk at the bottom, topped with espresso and flavour. 

The food: the smoke sandwich was amazing. The croissant  was so fresh that it slices of croissant kept breaking off as we cut up each bite. There special sauce paired with the smoke salmon perfectly. There were so much smoke salmon that there are smoke salmon every bite. Although we only get two side toppings for the dish we really enjoyed it.

The dessert: the eclair was nice it had fresh strawberries in it. The cream puff could of been a little more fresh. Now last but not least the lava cake... the baking of the lava cake was not very well down. The edges from the cake was so edgy that the presentation was not pleasing. The cake was undercooked that the lava cake was not lava enough and the surrounding of the cake was very thin. The decoration with the chocolate syrup could of been better. It would be nice to have a couple strawberry slices instead of whip cream as decoration. 

The free chocolate chip cookies were great. Loved how the chocolate chips were small pieces instead of the chunky chips."}
{"text":"This newly opened cafe will definitely be a hit for the millennials in the area with its aesthetic decor and food items! Right when you walk in, you will see a part of their ceiling covered with flowers hanging down with makes for the perfect brunch photo. They also have a big painting of Alice in wonderland which goes well with the cafe and their name! The only thing that I would say is odd are the dart machines at the back of the cafe, which makes the place not as high class or fancy. 

I was able to try their croissant sandwiches where you were able to DIY with their selection of meat, sauces, and toppings! I highly recommend Alice's secret sauce!! The croissants was very flaky and buttery which I love and there is two different sizes to choose from. Overall I would definitely come back to try their other dishes but I would have to say some items I think are a little bit pricey."}
{"text":"Very good hot food. Nice atmosphere. Awesome for lunch, dinner, or desserts. Only minus is that they don't have the caramel much. Otherwise very good."}
{"text":"Attended the grand opening of Cafe Alice. Cafe Alice has already been opened for over a week with their soft opening. The cafe is located outside of langham square small . The entrance may be hard to locate for first time visitors. There are two entrances to the cafe: one facing Kennedy for those walking to the cafe and the other entrance is located inside the P1 underground parkjng next to the spa.  If you need see t and t and the escalator underground, this means you went too far.

The cafe is fairly big, with comfortable chairs and cute alice in wonderland cartoon designs on the wall. The cafe style is mostly self serve where first order and pay at the counter and then sit at the table till they bring you the items at your table. I  really liked the comfy and simply leisure style of the cafe wher you can sit back, chat and relax.

I had the opportunity to try their fresh baked croissants, their macarons and also their yogurt parfait.  I also ordered a cappuccino. Cappuccino was good but I didn't find it hot enough. I already had two coffees earlier so I couldn't drink more coffees or yet I would have wanted to try more of their coffees. Their croissant was fresh and not too overly buttery. The flakiness was perfect. Their macarons are small and I found them to be slightly oversweet. The lavender macaron though had a great strong lavender scent. 

There is quite a variety of baked good too such as cakes and puff creams.  Their official menu will be released soon. Their soft opening menu is currently being available. 

Darts lovers will rejoice. Not just a cafe, there are also five darts machines to play darts. I wanted to try the darts machines but will leave it for next time :)

Oh caution. I followed the out sign at P1 thinking it was going to bring me to the exit but turns out the out sign is only for residents to exit using a fob key so do not follow that out sign. Just use the same way u came in from. Recommend to drive slow as tons of car traffic in and out from the business nearby.

Cafe is off to a great start. Wish them all success."}
{"text":"This cafe is a rare find in Markham, super cool, with board games and several meal options that should please everyone, you can have something light, full meal or desserts, just the variety of food is amazing, lots of options to select for every hunger level!! I have tried their chicken croissant sandwich, salmon with salad they were all yummy!!! Their mango pudding, cheesecake and puffy custard pastry was delicious, I ha: cappucino with them. They have very friendly owner and staff, very cozy atmosphere, board games around. I liked their decoration. They have 2 doors, one from Kennedy street, the other one from oarking lot. If you park at p1 you can enter easily from there, I have parked at ground level so it was a bit of a challenge to find t!e door sibce it is one level down, plenty of parking by the way, it was totally worth it. From all the things I have tried I liked croissant sandwich mit, bon appetite!!!!"}
{"text":"Inside was nice and they had darts if you get bored. Good place to hang with friends. 

Should add bubble tea or something. Don't really want caffeine late night :)"}
{"text":"Cafe Alice is a super cute cafe near Kennedy and Highway 7 that seems to just have recently opened up. I came here with a friend on a Friday afternoon to get some work done while enjoying their pastries and coffee. The place was a bit hard to find - just a heads up, its front door faces Kennedy. If you're coming from parking lot or T&T, there are stairs that lead down to a door that's at the street level on Kennedy - take those doors out and turn left and you should see the teardrop shaped sign. The employees are very friendly and said they would update their info on how to find them better. 

The interior is very cute and the highlight is definitely the cherry blossom ceiling in the middle of the cafe. They also have a chalkboard with new items as well as a cute info illustration of different espresso-based drinks that tell you what's in an americano, latte macchiato, etc. The only thing that seems a bit off is the random dart machines in the corner near the washrooms. I guess it would make more sense at night when the place turns sort of into a bar, but during the day it seemed a little out of place.

My friend and I ordered an americano each as well as a plain croissant and a cream puff. I loved the americano as it wasn't too strong and didn't leave a film on my tongue like some other coffee shops do. The croissant was so flaky while the cream puff was delicious and not too sweet. 

I would definitely come here again to study but also to check out what it's like in the evenings"}
{"text":"this is not only a cafe, but a place to chill, get some work done, relax to play darts. Even though it's named as a cafe, try their steak, it's well made. Love this place"}
{"text":"Love this place atmosphere. The crossiant and coffee are best on the menu. Their new pork chop and rice lunch special is yummy too."}
{"text":"This is a cafe located in Langham Square. It's a bit tricky getting in. You'll need to go through the underground parking to get into the cafe. Advice: Go in from the South Unionville Ave and park underground. Do not go in from the T&T entrance because you won't be able to go in. I learned the hard way.

Inside, it's very spacious and the seats are pretty comfortable. The drawing designs on the wall looked pretty cute. They also have a darting area but I believe you need to pay extra. One thing I would say is that it'll be nice if they have blinds. We went around 5 so the sun was shining on us through the window. 

We were greeted by the owner/worker who served us water when we sat down. He'd let us know that there are certain items that weren't available on the menu. That was helpful because other cafes I've been to, they would let you know when you order which is annoying.

Their menu ranges from dessert to baked goods to dinner meals. The prices are fairly reasonable. I ended up getting the smoked salmon croissant with lettuce and mushroom. One thing to note: if you order the croissant with toppings, it's $2.50 for the croissant and $3.99 for protein and 2 toppings. The way the menu is structured it might be a bit misleading as it seems like it's $3.99 for everything. It came out to $6.50 before tax which is still good value!

One small complaint I do have is that it did take about 20 minutes for it to come. It wasn't busy and it was just smoked salmon. I think the croissant is made in house. However the waiter was nice enough to apologize for the long wait. The croissant came and I am surprised by how much smoked salmon there is. Definitely worth the wait! Croissant was very flakey and the best part is, it was toasted perfectly. Not burnt!!! 

The service was exceptional. They were very friendly and were always smiling. We stayed for about 3 hours socializing and they kept serving us water and didn't kick us out. They even gave us free cookies which was very kind  of him.

Overall I would recommend this place for couples or with a smaller group of friends. It's a cozy place to socialize while having some baked goods. I will definitely come back next time to try their dessert."}
{"text":"I went to this café with a friend around 9 pm on a weekday night. Though it was pretty difficult to find, the interior was quite spacious with enough table room for my chunky laptop! The menu has a wide variety of items, including espresso beverages, homemade desserts and food.

We ordered a flat white, a lava cake, and nachos with beef. The lava cake was delicious - chocolatey and dark, and just the right sweetness. However, the flat white tasted far too mild to be a flat white. The nachos were a tad dry, though they added more cheese at my request. Upon leaving, they asked for our feedback and gave us a box of macarons on the house! Overall, it was an average café experience but the interesting dessert options and top service would make it a good alternative to the other dessert cafés in the plaza. 


Pros: dessert was delicious + very reasonably priced. Top notch service. 

Cons: nachos and flat white were underwhelming."}
{"text":"We entered the cafe from inside the Langham Square parking level 1 (P1).

Ordered croissant sandwich, Kangen soda and lava cake. 
The croissant was flaky and buttery. There was a contrast of crispy shell layers and inside soft pillowy layers. I think the croissant on its own whether it's been sitting the whole day since it was baked in the morning or steaming hot fresh from the oven it would still be good! Good croissants takes time to make because they laminate the dough. Delicious! 
The size difference between delicate ($2.50) and giant ($5.99) is double in size. If we are in the neighbourhood, I would return for another croissant!

What we ordered:
In terms of the grilled chicken breast croissant sandwich - it is expensive! 
The filling includes sliced pieces of chicken (a bit dry), lettuce, cherry tomatoes and dressing on the side. Small pieces of chicken, lettuce and tomato is $3.99 alone. Add that to $2.50 for croissant, the sandwich is over $7 with tax added. 

Peach Kangen Soda ($3.99) was okay. Ionized water with peach flavour added to the beverage. Sounds cool and interesting - ask the owner what Kangen soda is... he would explain it better. 

Lava Cake ($5.99) is a rich and chocolaty classic dessert. The cake contains fudgey chocolate in the middle. The sweetness was okay - possibly something fresh like berries would be a good addition.

Service was attentive, present and friendly."}
{"text":"Arrived there at noon when they open but they didn't open till 10min after. The food was mediocre, tried the terriyaki pork but it was dry and lacked flavor. Don't get the samosas, they resemble a chip with a bit of stuffing. The service was fine for a small business. Interior is resembles a lackluster attempt of Alice in wonderland theme. Reviews are probably high because they offer you free macaroons before you leave."}
{"text":"One of my favourite cafes in Markham!! It's located in the T&T Plaza with both entrances from the parking lot and from Kennedy.

The guy who works here (might be the owner) really raises the bar for services in cafes. He basically explained the entire menu for us while pointing out some customer favourites.

He checked up on us with the menu and made sure we had everything we needed. We got the lavander creme brulee, cream puff, and espresso. The espresso was decent. The lavander creme brulee was amazing and creme puff did not disappoint either.

We finished our dessert and stayed for another hour or two just chatting away. The guy working here did not bother us at all. 

Love the environment!"}
{"text":"Service here is phenomenal ! This is my new go to for a good cup of coffee and dessert. I ordered the teriyaki pork chop on rice which was the daily special, the pork chop was juicy and I enjoyed every bite of it! The hazelnut latte was amazing ! I liked the presentation of the latte because it came as a two toned. The latte was made just right! Not too sweet and highly recommended! They use high quality coffee beans. The cream puff had strawberries inside which went well with my latte. Their tiramisu was mediocre but still a pass. The staff are very attentive and polite. It's a nice place to relax and they also have dart machines which is a unique touch to cafe Alice! At the end when I asked for the bill they gave me a cute box of macaroons on the house! Came in with no expectations yet Cafe Alice met all of them. I left happier than when I first stepped foot into this cafe. I'm excited to go back to try the rest of their menu!"}
{"text":"A cute little cafe in markham. My best friend told me about this place so we decided to check it out! 

I tried the lavender creme brûlée. The hard caramel was actually a bit too much and thick that I couldn't break it. The custard was super good though. It had a very subtle lavender taste which is so unique. 

Service was prompt. Aesthetics in the cafe was very pleasing. You can take cute pictures in there. 

I will come back to try other items on their menu!"}
{"text":"Went there today at around 2 pm! Hard to find the entrance, need more sign inside the mall to show the way! The back door is in P1 underground, kind of creepy, the main entrance is facing kennedy!! Finally my friend and I found the way to this place, unfortunately They are closed! Very disappointed!!"}
{"text":"[LOCATION] - 2/5
This place is located on Kennedy Rd. and Hwy 7 at the plaza with T&T Supermarket. I had trouble finding the entrance in the underground parking lot, and the entrance from Kennedy Rd. was quite a walk from the parking lot. 

[SERVICE] - 5/5
The service was hands-down the best part of our experience. He was friendly, and very thorough when he explained the menu to us. 

[DÉCOR] - 5/5 
I basically came here for the Alice in Wonderland theme. The cherry blossoms on the ceiling were so pretty, and the hand-drawn menu on the chalkboard was also very cute. 

[QUALITY] - 3/5
Food quality was average, but I think this spot is more well-known for the ambiance. 

[ORDER] - 3/5
- Garlic Bread - $3.99: the presentation of this starter was nice, but the actual garlic bread was hard and didn't taste like garlic. 

- Ding Ding Noodles Soup - $7.99: noodles were al-dente, egg yolk was perfectly runny, and ham was average. A solid choice, but too pricey for a bowl of instant noodles. 

[OVERALL] - 3/5
I admit Café Alice has cute décor, but the food was just okay and too pricey. If I come back here, I would give the desserts a try because they look pretty good. Overall, I wouldn't recommend this place if you are looking for a substantial and inexpensive meal."}
{"text":"ADORABLE, newly opened cafe at the T&T plaza. Before coming here, we always wondered where the heck is this sakura-adorned cafe?? If you're familar with this plaza, it's near the south west end of the underground parking lot at T&T. There are 2 doors that you can enter from; either from the street or from the parking lot. There's signs, don't worry.

Once you make your way in, you'll immediately notice the sakura decor in the middle of their ceiling. You can't stop yourself from taking pics. It's pretty spacious inside the cafe, and there's even a darts area for all the dart fanatics out there. On their walls you'll also notice paintings of Alice in Wonderland, and even a cute little bunny on their drinks menu. 

Staff are very courteous and friendly. Andrew even gave us some free treats on our way out :) Who doesn't like some delicious freebies?

We tried their irish cream iced espresso and their lavender creme brulee. The coffee was nicely presented, completed with rainbow sprinkles and whipped cream (of course!). It was a little too sweet even with the ice melting; next time I would ask for less sugar. The creme brulee was delish with the lavender, especially with the little pot it came in (certainly helped with ig purposes).

Their menu selection is a bit limited at the moment but they are still growing, so keep an eye out for this cafe and drop by!"}
{"text":"Captivated by the beautiful décor, I finally decided to give this new café a try!

They have two entrances, one facing Kennedy and the other is located at the underground parking lot beneath t&t. 

Once inside, my friend and I were greeted and sat down by the friendly staff. The beautiful blossoms on the table and on the ceiling are great for photos!

My friend ordered the New York Strip ($21.99) which was nice and tender. The flavor was there and was prepared well, only lacking a bit on texture. 
I ordered the smaller croissant, which actually isn't that small! The croissant itself is $2.99 and you add $3.50 for a choice of meat and two toppings! The croissant is freshly made in house with real butter. It was one of the best croissants I've ever had, with a super flaky and delicious crust! The sandwich itself was very simple but the croissant's flavor and texture was just too amazing, a must try! The menu was a bit hard to understand but the owner let us know that they are currently working on a new and permanent menu. 

We also ordered a latte and a cappuccino, both tasted very rich and authentic. I preferred the cappuccino which was slightly sweeter than the latte.

Upon getting the bill we were surprised with the 10% off because it was our first time visiting! Very nice gesture for a new café!

Everything about this café was very aesthetically pleasing. The ambience was lovely and makes a perfect little space for studying or for a cup of coffee with friends. Pricing is also great, as most items are very affordable! I'm surprised that they open until 2am on weekends, which also makes it a nice place to stop by for a late night snack. Overall, I love the concept of this new café and will definitely be coming back to try their new menu items!"}
{"text":"Never again.

I came to this cafe on an afternoon to catch-up with a highschool classmate. The cafe was a little hard to find, you have to walk around the outside of the plaza, and surprising that door is sometimes locked, so there's a sketchy entrance from the underground parking lot LOL.

The interior is beautiful, I love the sakura embossed ceiling and cute flower centerpieces! My eyes lit up when I saw the dart machines :P

We sat down at a seating of our choice and before we ordered, we were informed that 1/3 of the menu was unavailable LOL so jokes.
We ended up ordering garlic bread, lava cake, and a rose and lychee soda drink.
The soda drinks were disgusting LOL
The garlic bread was incredibly hard.
The lava cake was cakey and seemed almost packaged and microwaved.

The worst thing was the service. Is this place owned by 2 middle-aged men? The server literally snuck up to our table and stared at us for a good 3 minutes, where I paused as I was talking, thinking \"...uhm...what do u want?\" and he scrambled to piece together the sentence \"how's everything going?\"

Bottom line - creepy."}
{"text":"I think even at a 3 Star it's already pretty generous. I think a more accurate rating would be 2.5. The food is really mediocre, I opted for both the beef curry and the croissant sandwich because people kept saying it's so delicious. Unfortunately that's not how it went for me. Maybe it's because I went for the smoked salmon topping but honestly they shouldn't event include it as an option if it didn't taste good. I do not recommend this whatsoever. The taste of the salmon clashes indefinitely with the croissant and it tasted really gross. 

Beef curry wasn't any better. For 9.99 it was plated strangely and barely any curry. It was also very small in proportion. The only \"curry\" I'd say that it had was the kick from the spiciness from the super watery sauce. Very disappointed. 

Jasmine crème brûlée, an equal disappointment. The sugar wasn't even properly torched and the rest of it was just really sweet, you couldn't taste the jasmine if your life depended on it. I mean, maybe if you lie. 

Before I left the store, I bought a few macarons which I enjoyed. They were a little too sweet for my liking but they're macarons, nothing wrong with that. 

Service was great. There wasn't really a highlight of my night so I won't be back, especially because there are so many great restaurants elsewhere."}
{"text":"I found out about Cafe Alice through Yelp. With the pretty decor and an average of 4 star reviews, I knew I wanted to try it. Unfortunately, they didn't have the floral ceiling when I went in last night. The only thing that's really \"Alice\" themed is the mural on the wall. I do think that they can step up their game in this regard.

It was a little hard to find. We drove around the plaza looking for the entrance but couldn't find it. You either have to walk through the parking garage to get to the cafe or walk to the entrance that's facing Kennedy.

The cafe was pretty empty on a Wednesday night; there was only one other table. Our server was very friendly and went over the entire menu with us. He gave us his recommendations and told us which items were most popular. All the desserts are made in house. 

The table next to us had nachos and I instantly craved for them! I ordered the regular nachos (no meat) for $8.99. It's a decent size and just enough to share between two people. They use salted tortilla chips - I tasted salt in every bite (I personally liked it!) It also made me really thirsty but they were too busy playing darts (I had no issue with this, it was a quiet night & they're very laid back) so my friend and I got up to get ourselves a jug of water.

For dessert, I ordered the Lavender Creme Brulee. It comes in the cutest little container but is a big portion and can be shared between two people. I think it was a little over-torched, which made it bitter. I also don't think it was mixed thoroughly. Most of it was good but some of it was too milky/creamy for my liking. We didn't end up finishing it. I also couldn't taste the lavender, but my friend could and commented that it was very light.

Overall, I thought the food was alright - nothing special. Perhaps I would've felt differently if I ordered actual food such as their croissant sandwiches or the steak (which is what our server recommended). It's a nice little cafe to try but I don't plan on returning."}
