{"text":"Always wanted to try this cafe in my neighbourhood. Somehow, I have two hours off from my regular schedule today and was able to drop by.  As I stepped inside the cafe, I was greeted warmly. This cafe offers light breakfast, lunch, desserts, tea and coffee. According to their website, they open early at 7:00 am almost every day. I am delighted to enjoy a dessert and a cup of coffee after work.

Chocolate Hazelnut Mini 
It has a rich flavour of hazelnut though it's mixed with chocolate mousse in the middle. The chocolate flavour is not too strong and It is not too sweet. It's a nice light dessert after work.

Macchiato 
It is a coffee with chocolate flavour. I can taste both chocolate and coffee and they are well balanced in proportion. I feel relaxed. It's a nice beverage after work. 

I would want to come again to try other kinds of beverage and desserts."}
{"text":"We had a lovely Mother's Day coffee date at Cafe Milano. I wanted to surprise my mom with customized latte art via Ripples after another Markham cafe that has the Ripples machine (that I won't name here) fell through. I'm so glad we turned to Cafe Milano since they went out of their way to help me surprise her and make this a wonderful Mother's Day! For starters, the machine was having some issues so they patiently troubleshooted it with me, and when the image didn't translate/print as ideally as the original photo itself, they made us a second cup on the house with a sweet mother's day message on it. The service was friendly and attentive throughout our visit (e.g. they met my volume of whispering when trying to figure out the surprise latte art, would come by to check in on us) and the cafe itself is clean and cute! We also enjoyed their Chocolate Super Crunch cake (Mom liked how it wasn't overly sweet!). I'd recommend Cafe Milano as a place to treat your mom, catch up with friends, or just grab a cup of coffee!"}
{"text":"I have been only once for a Turkish coffee, a sandwich and a muffin cake.  This is the only place nearby in the hood that carries Turkish coffee.  The Turkish coffee was so rich.  The Italian sandwich was about 6 inches long with delicious cheese and deli meat. The muffin cake tasted like a really, really soft muffin.  Extremely friendly staff.  They also have coffee arts, other bakery items, cakes and macarons.  Overall 3.5 stars."}
