{"text":"Well, I would have liked to actually review the food, but unfortunately #Cafe8 was closed. My husband, and I, recently watched an episode of \"Check Please, Arizona\", where @Cafe8 was reviewed. The guests on the show gave it fairly decent reviews, so this morning we decided to give it a try. We looked up their Website, and it indicated they were open from 8 AM until 3 PM, with the kitchen closing at 2:45 PM. So, we drive 9.5 miles, only to find out they are closed from July 17 through July 23. There was nothing on their Website indicating they would be closed. With that being the case, we are not inclined to give them another shot. Might have been an oops on their part, but 9.5 miles is kind of a long drive, just to find out the restaurant is closed, and then have to find some place comparable, without knowing the area. Too bad, as their food sounded like it would have been very good."}
{"text":"It's hidden between the laundry place and sprouts literally on the corner of the plaza. It's delicious!!! Healthy close to home!! The owner is super polite Alex lol my kids talked his ear off!"}
{"text":"We are from Tucson and did a search for gluten free and this place popped up. What a pleasant surprise. We will come back when we are in the area. My wife had the gluten free French toast (phenomenal) and I had the white turkey and mashed potatoes and gravy.l and gluten free bread. It was one of the best I've ever had and it's not even thanksgiving yet. Prices were very reasonable and portions were perfect!"}
{"text":"Horrible service!  We had a party of 9 that must have been too much to handle. We were seated for 10 minutes before anyone came to ask for drinks (not even water)and another 15 minutes to get our drinks which were nothing more than coffee and tea (and they were out of the mint tea). After placing our order , it was about another 30 minutes when our food started coming out. The last dish to come out, was the danish French toast, and it was 15 minutes after all the others, most of us had already finished eating. The eggs were hard and cold. The wrap was greasy, they were out of the mint tea and whipped cream for the waffles. This whole breakfast experience was about 90 minutes. I understand that they are not your typical breakfast restaurant, but there was a lot that could be improved upon here."}
{"text":"By far the best quiche in town! Tried the omelet with a side of potatoes, they just do food right. Gluten free menu available too. What a gem of a place!"}
{"text":"The best food around.  Excellent service and must try the monkey bread with pecans."}
{"text":"Horrible Lunch I ordered Grass Fed Beef Burger medium rare.  The burger had the consistency of a overworked meatball.  No pink to be seen.  Squeezing the sandwich released a pool of grease.  Wife had pork tenderloin sandwich.  The pork looked like it had been boiled in water rather than roasted.  Had that dreary gray color all the way through with all moisture sapped out of it.    The flavored teas were good.  The breakfast reviews look promising but avoid this place for anything on the lunch menu.  There are far better Greek inspired lunch spots than this place."}
{"text":"DO YOUR PART IN THE CULTURAL REVOLUTION... SUPPORT LOCAL BUSINESS! My girlfriend and I went in on a busy Saturday morning for breakfast. It is an itty bitty little spot, but the service was fast, nice strong coffee. Her regular (not gluten free) French Toast was outstanding, and my breakfast \"Everything\" bagel was awesome too. All the pastries and quiches looked and smelled amazing, though we were too full to go for more. It's not far off the freeway and it looks like they just added dinner service as well. We will be back!"}
{"text":"Cafe 8 is the best example of a restaurant/bakery that caters to the gluten-free crowd that I've ever found.  Co-owners Tracey & Alex Chaker have created a pleasant oasis of calm refinement where you can get absolutely the best GF baked goods plus as well as all the usual breakfast and lunch staples.  I've never found better GF baked goods anywhere.  Tracey's GF waffles are amazing, her GF muffins are wraith light.  Had I not been told, I would not have guessed her baked goods were GF and that is quite the testament for anyone who has tried their hand at GF baking.    Besides being a master baker, Tracey works the front of the restaurant while Alex runs the kitchen turning out piping hot breakfast and lunch delights.  When I asked Tracey her secret to GF cooking she said she mills her own GF flour (the exact proportions being a well kept secret) and the use of more baking powder than one would in non-GF baking.   If you are gluten sensitive or a celiac and find yourself in the Mesa area, you will be very happy with a visit to Cafe 8."}
{"text":"Very frustrated with this place. Many reviewers keep saying that this place is good for vegetarians and vegans, and the face of the menu even mentions that they serve vegetarian food. There were very few options available to my husband and me - he is a vegetarian and I am a vegan.   I do not go to places assuming they will always have an option available for me, but when their menu specifically mentions vegetarian food, I expect more than 3-4 options in a large menu.   My husband was able to have a grilled cheese sandwich, and I ended up having the vegan salad, which was way overpriced for what it was. (romaine, grape tomatoes, walnuts, cucumber, and some cran-raisin type things on top)  The owner and server were very kind, but if you are looking specifically for vegetarian food, this place does not have a lot of options, even though it has been sold as such."}
{"text":"I was driving around today looking for a new place to eat and I saw this cafe 8 and decided to stop. I was so delighted to see that it offered organic foods, and bakery items. They offer regular menus and gluten free menus.  The owner is also the chef in the kitchen and he did such a fantastic job. Our food was absolutely delicious . The portions were plenty enough to fill us up. I think I have found my new place to eat.  I highly recommend it to everyone.  the lunches are under $10 ."}
{"text":"Great little place to get good food, meet good people and have a good conversation. I love supporting the Mom and Pop places in town. The owners are very nice and the food is great! I will be back."}
{"text":"Discovered this place after a wrong turn, and so glad I did!  Just starting an allergy elimination diet and gluten, eggs, and dairy are off limits for awhile.  Not being experienced in eating with these dietary restrictions, it's been challenging.  I talked to the owner, Tony, and he provided a lot of information and options.  I had the coconut cream iced tea (something new and absolutely love it!), and a bagel with homemade hummus, cucumber and tomato.  Can't beat the price - it's the same or less then I would spend at Starbucks.  Decided to grab something to go for lunch and chose the pork tenderloin sandwich on a gluten/dairy/egg-free roll, subbing hummus for the taziki sauce and homemade tomato basil soup.  Again, reasonably priced in all - with tax I spent about $17 for breakfast and lunch.  The owners were very involved and personable - excellent customer service.  Tony mentioned working on a dairy free taziki sauce so I am looking forward to seeing if he can make it work.  The environment is intimate, similar to a coffee house, and quiet.  I just wish it were more visible - it's tucked away in the corner and without the sign by the curb, I wouldn't have noticed it."}
{"text":"Oil With A Side of Omelette!  Friendly and helpful staff, gluten aware, clean and inviting atmosphere.  Unfortunately, our omelettes and small potato fries were absolutely swimming in oil."}
{"text":"Made me a great omelet. Seems business is a little slow but hopefully a few more good reviews will help."}
{"text":"I love that they have a gluten free menu, AND it actually tastes amazing!!! Love this place and so does my toddler."}
{"text":"A little hidden gem! If you're looking for a wide variety of tasty, appetizing gluten free breakfast and lunch options, then look no further. Cookies and muffins are freshly baked! And the coffee is good!"}
{"text":"Just today I found Cafe 8 and I know I will visit here often and will bring some friends on my next visit. I had French toast and it was the best I've ever had. Coffee was mighty tasty, too. Casual, relaxed, clean, friendly environment - a perfect balance. Tracey was very attentive and so very professional and kind. A pleasant find this morning!"}
{"text":"Phenomenal food, great service and quality ingredients. I couldn't have asked for a better breakfast/lunch spot. I would highly recommend."}
{"text":"20 bucks two eggs two sausages  coffee an English muffin 4 two oh and a half a slice of orange.  No hash browns. No chicken fried steak. No biscuits and gravy. What kind of breakfast places is this. Gluten-free and sweet tooth I guess. Waiter was pleasant. He must be the owner."}
{"text":"By far the BEST breakfast in Arizona. Delicious omelette with top ingredients-asiago cheese, avocado, fresh red bell pepper- and excellent coffee. Dinner menu looks fantastic. Understated and tucked away, this little cafe is definitely worth a stop!"}
{"text":"I really wanted to like this place because they have a lot of gluten free options but I didn't like the cooks attitude or the waiters answer. We ordered a griiled cheese with the Canadian bacon on the side, when it came it was in it. She said oh you should've have told me? Then I can hear the cook argue with the staff. I don't like that. It also made us feel uncomfortable."}
{"text":"WOW!! I am a super sensitive celiac I have been eating at Café 8 since early November, at least 2-4 times a week.  Not one time have I gotten ill or even felt poorly after eating.  The variety,  flavors, the staff, my family we love them all.  \"Be sure to specify Gluten free\"  Tracy and Alex are extremely careful with every dish.  Even the blue cheese on my salad is gf. The pastries are decadent.  The toast/bread  is the best gf bread I have ever tasted."}
{"text":"Alex and Tracy treat us like family. And the food is healthy and very delicious. I would recommend everyone go and experience good food and hospitality."}
{"text":"Stopped in to this place on a whim and it's a hidden gem! Great food, prompt and friendly service. We had brunch; omelettes with air fried sweet potato fries and organic berries on the side ."}
{"text":"First time for hubby and I at Cafe 8 today. It was wonderful! So nice to have a place that actually cares about the health of its customers. Nice atmosphere, friendly staff, amazing food. Many gluten free options. Healthy food with low salt, sugar, and fat, but no compromising the taste! It was delicious! We will be back!!"}
{"text":"If I could give zero stars I would. Was so excited to find this restaurant on Yelp after reading all the great reviews. We arrived and were immediately seated, but still waiting for one to arrive (total of only three in our party, and one was my 5 year old son). Let me start by saying we ended up walking out after 20 mins. By the time we left, no one had come to take our order, NOT EVEN DRINKS. I had to listen to Angela (waitress) curse and drop f bombs behind me and my son while she was trying to set up a party of six. Then the staff immediately takes drink orders for that party after we had been sitting their for 15 mins. We waited another five and NO ONE ever came by. Now, I saw four staffers since I entered and it is a SMALL place. Such a shame because the menu looked delicious and I heard it was great. But never going back, and unless you are willing to spend three hours of your day on a meal, don't bother. Unfriendly, unprofessional, AWFUL."}
{"text":"Me and my mom were craving something light and good. We found it! Good food. Very friendly staff."}
{"text":"I ordered the prime rib sandwich on sourdough with \"air fries\".  The good: Vegetables on the sandwich seemed fresh. The fries were unsalted so I could salt them to my taste and were definitely not oily (convection oven cooked would be my guess).  The bad: The waitress asked me how I wanted my steak and I responded medium but ended up with well done (the steaks were thin so it would be tough to avoid over cooking them).  The steak they served was not prime rib and not rib meat at all.  I've eaten and cooked prime rib on many occasions and this was definitely not prime rib.  The in-between:  service was a bit lackluster.  The server was cordial and accessible but not very warm nor inviting.   I would have personally preferred my sandwich bread toasted a bit more.  It was at that stage in toasting just before anything turns the slightest brown so it was just starting to get crisp.  If I had ordered something else I probably would give them 3stars but ordering prime rib and getting something else knocks a star off the rating for me."}
{"text":"Delicious food, wonderful family owned business. Almost all their menu items come gluten free!! (please specify when you walk in, because they have BOTH - regular and gluten free menus.) The wife, Tracey does all the gluten free baking herself and her GF banana cake is to die for ... as are the cheesecakes!!! We tried them for dinner this past weekend, first time. I got the cheeseburger and my husband got the prime rib. They were both delicious. Both came with a wonderful salad. All GF! The owners are lovely people, very engaging. we had a great time and will definitely be back! For Mesa AZ this is a little piece of heaven!!! Please support this restaurant!!"}
{"text":"Delicious food, and desserts! Warm and cozy atmosphere, and very friendly owners. Mostly gluten free menu. Definitely a must try! $$"}
{"text":"Good  atmosphere and great food. The coffee is great. They can improve their salsa, I can't tell if it's made at the cafe or from a bottle."}
{"text":"I ordered the chicken pita and never again will I go back. The chicken was so over cooked I couldn't even chew it. I told the waitress and she did nothing about it."}
{"text":"Have now the experiences of walk-in, take-out as well as dining inside with a party of four. Take out was the grass-fed beef gyro. I'm all for the cow not passing on GMO chemicals and DNA to me, which is why I found myself going to this establishment in the first place. The gyro was descent. A little flat on flavor, but then, I often remind myself that ALL of the gyros I've had have probably been modified in multiple ways so this is like  Neo eating a real gyro for the first time - if you feel me. Anyways, I'm a fan of hot sauce on most everything, so all was good.  From order to meal in my hands and exiting, only 10 minutes had elapsed. Not bad!   My dine-in experience was pleasant. Saturday, late, late afternoon. We felt well received as the server was kind while asking us about our gluten/diet preferences, while politely providing us with suggestions and alternatives.   We had a the tzatziki with the pita bread, and gluten free crackers (none of us are celiac but we make feeble attempt at eating as little wheat as possible) as the appetizer (4 of us). If you love garlic, this dish sings your tune. 4/5  2 grilled cheese sandwiches were ordered - 1 without prosciutto. Both delish. 5/5  The grilled chicken breast was added, and was of high quality, but lacking somewhat in the spice/taste department. 3/5  Last, a thin-sliced, mushroom pizza. My father ate only a couple slices of it because he was pretty full at this juncture. 5/5  Overall, if you're looking for a real deal mom and pop joint, whose service lives up to its quality of food and good health, then this is a no-brains contest to patronage. From what I've tried (see above) of the dishes, 75%ish have the flavor in point too. I'll still give it 4/5. Work on some more boldness in your flavor and that number will increase."}
{"text":"A cute mom-and-pop-shop style cafe tucked away.   We lived nearby so we decided to stop in for brunch one day. The cafe was pretty small, but everyone was so friendly. Gluten free options available. We ordered the make-your-own 3 egg omlette, which was perfectly savory and the apple Danish french toast, which was very sweet.  The side of potatoes were cut into very, very tiny pieces, which made them super crispy. Something I've never tried before.   They also have an area up front where they sell baked goods, but we came on a Saturday so everything sold out pretty fast.   Overall, good atmosphere, friendly service, and great place to go to support a local business."}
{"text":"We had a nice lunch. Friendly helpful staff. Service was good. Food was very nice. Chef is accommodating on changes. Definitely return."}
{"text":"Best breakfast I've had in years! All organic, even homemade strawberry jam for toast, and they have a large selection of gluten-free & dairy-free items to choose from. My new favorite breakfast/brunch place. Gotta try it, if you've never been there!"}
{"text":"I feel bad for myself that I only just found this place today... Seriously! Walked in because We were in the area and starving and I wasn't really expecting much. But, holy crap was I wrong. If every restaurant / cafe was like this, our world would be so much better. Everything is homemade from scratch- dolmades were amazing. Tomato soup, amazing. They ran out of hummus- no big deal, the owner just made it real quick. Coconut and pear iced tea... Who has coconut and pear iced tea?! Awesome. We were stuffed but I got a blueberry muffin to go (no way I passing that opportunity up) and yep, that was awesome too. They have a vast gluten free menu and also have veg items. If you haven't been to this place yet, just do yourself the favor and go- I will definitely be back!"}
{"text":"Located right between UPS and Sprouts.  Went here on a quick lunch break but they don't do \"fast\" which is okay but we should have ordered by telephone earlier. Got food for takeout.   Big robust salad, yummy tomato basil soup.   Don't really care about gluten free food so I can't comment on that.   Will return. The owners are a couple who used to run a stand at the farmers market."}
{"text":"Rude owner/chef. We have purchased soups, sandwiches and pastries. Always good, a bit expensive but tasty. We always support small businesses. Have seen several come and go from this spot. Rooted for them to win. Came in this morning for a variety of pastries and the chef/owner stood like a mean troll at the front. Was condescending and rude when I inquired about the muffins. He told me in a curt tone that they were muffins. I replied that I knew that, but wanted to know what type. After this unpleasant exchange, he left me standing there for several minutes. I asked if I needed to wait for the hostess. He said in an unpleasant manner that he could help. He had such a nasty look on his face, I was uninterested in buying his meanly baked goods. No matter how tasty, if you are charging $4 for a muffin you better be nice. I don't have to spend my money there and I won't. He can keep his food and his nasty attitude. It's good that others find this place friendly. He wasn't friendly to me. I won't return."}
{"text":"Really good food, they cater to people with gluten allergies, $2.50 for a soda."}
{"text":"A nice corner restaurant in a strip mall, friendly service. had a traditional breakfast, eggs done perfectly, bacon, diced breakfast potatoes that were diced so small they were almost to small.and toast. overall a good breakfast for your monies."}
{"text":"Cafe 8 is a wonderful surprise. Don't let the small size fool you! My wife and I enjoyed a delicious meal this morning. She had the Gluten Free Meatball Sub with Pepper Sauce and Sweet Potato Air Fries. I had the French Toast and the Two-Egg Plate with Sausage and Toast, and we shared a Gluten Free Donut. All-in-all, we ate well for about $30. Portion Size was small bit above average. Flavors were on point. Servers did their best although they were probably understaffed for a busy Saturday. Their Gluten Free selection was more extensive than others we've seen. Most, if not all, of their desserts and pastries are Gluten Free.  Bottom Line: Gluten-free or not, this place is worth a try."}
{"text":"Refreshing to have a place with so many options that I could choose from! I can't have gluten or dairy and the server was very helpful in helping me choose. It's a really small place so it's close quarters for a private conversation. My husband's meal was pretty good too. I was impressed with the server's willingness to change the menu item to be exactly what I wanted (and could eat)."}
{"text":"For our first visit the service was good, the food was good and the people were very nice.  The desert options made my kiddos' day.  I am guessing this is family owned and there is not a lot of staff, so service is not lightning fast, but they do a good job keeping everything moving and making you feel welcome. This is far for us but we will make another trip for sure!"}
{"text":"Many gluten free options!  Have now been here twice with family and we have ordered gluten free items and non gluten free.  I love that they really understand food allergies and prepare their food with healthier options--no high fructose corn syrup used here and some organic items as well.  The french fries are air cooked so no  oil here, but are very good.  They have a large variety of sandwiches where you can have gluten free or regular bread.  They even have gluten free meatballs subs what a treat!  Just make sure they have buns when ordering instead of just sandwich bread and maybe order a little extra sauce.  Have only tried the gluten versions of their waffles and french toast.  Both were delicious and plan on trying the gluten free.    The gluten free desserts are amazing.  Have tried the Key Lime pie and the owner even let me order raspberry muffins to be picked up on a designated day.  What a treat.  Both were good, but if you like Key Lime pie it rivals any gluten containing version.  The muffins are a little light on flavor, but still enjoyable.  It's a family run business with good service and nice sized menu to pick from.  We will definitely be returning and would highly recommend it."}
{"text":".Very good food, and filling. Could not eat the whole thing.its very quiet with a hint of music playing in the speakers"}
{"text":"Beautifully decorated and thoroughly done with love! You can tell the family takes pride in their business & loves serving their customers. Felt very welcome & the food was delicious! I had the breakfast wrap with bacon, husband ate the 3 egg omelet served with home fries and the toast came with home made jam, so tasty! We'll be back"}
{"text":"Love the theme that this cafe has. Came from California and wanted a good authentic breakfast and this was the first place to pop up in the area.   If your looking to break out of the norm and try something new this is the place for you!"}
{"text":"Im in love! They only use local grass fed meat, cage free eggs, aka how food should be. They also have an extensive gluten free menu. Also great options for those following paleo. So happy to find a place actually serving quality food for an affordable price, without all the harmful preservatives and hormones that have become all too common place elsewhere. Thanks Café 8!"}
{"text":"The food and service here are amazing. When you're looking for a place where people pride themselves on quality and customer service... This is the place. The eggs benedict special was probably the best I've ever had anywhere. The only negative was it is an $11.25 dish and the side of home fries was almost comically small. Totally worth it over all, would give 5 star rating but the bathroom was nasty. Easy fix people!"}
{"text":"I was looking for a restaurant near my parents that had gluten free options.  We try to eat healthy and local when possible.  This place nailed it.  5 of us had lunch on a Friday. Salads were fresh & tasty!  Pear iced tea was fab!    Gluten free strawberry shortcake was to die for!!  We will be back. It's not a large space. But hopefully business will grow and they can expand."}
{"text":"What a great find!  Such a cute little cafe in Mesa.  The food was very good.  I had the Belgian waffle with fruit.  It was delicious.  I will definitely be coming back to this place.  The staff was really nice and the atmosphere was very relaxing.  Nice place to grab lunch."}
{"text":"Went here today for lunch, 11:30am. I had the grilled chicken and veggies with fries. I think the chicken came from the freezer because I heard the microwave oven door a few times and it took about fifteen minutes from order to table. I was the only one ordering food the entire time I was in the place. Cafe 8 is small, about 12 tables. The place is clean and nice appearing inside. This was about my fifth trip here, never really been overly disappointed. Today was a decent meal. About $17 for meal and tip.  My entire service was fine; service, food, cost, etc. No complaints. I would recommend dining here. Probably not a good place to bring a baby or a hugely obese person."}
{"text":"Chef just set me up with the best Eggs Benedict! He nailed the Hollandaise! OMG!  This is my fourth time here. These chefs can cook, always spot on! I wanted my birthday breakfast 'Eggs Benedict' (not on the menu). They perform miracles here! Perfect Hollandaise, egg, butter, lemon (just a hint). I couldn't be happier!!!"}
{"text":"I really want to give this place 5 stars, it's cute and has an entire gluten free menu, cage free eggs etc we had breakfast and while the waffle was delicious mom had to have the eggs re cooked and while my eggs were great the potatoes had zero seasoning and the toast wasn't toasted. Other than that great place I will give it another try another day."}
{"text":"New to AZ so I am exploring all the cafes and restaurants around Mesa area. I found this place through yelp and this is my first time here. The place is a nice cozy place. The lady who helped me was very nice and the guy who I believe is the owner was super nice too.  I ordered a ribeye steak sandwich with a side of fries. It was very tasteful, and I loved it. I Definitely highly recommend this place to everyone and I will come back more often to explore their menu better :)"}
{"text":"This is an awesome family owned cafe that offers the best gluten free meals around. Everything  made from scratch. Very friendly atmosphere and delicious food."}
{"text":"Really good gluten free food.... They work hard to help provide safe food that's tastes good!"}
{"text":"Ate there for 1st time. Unfortunately not a good day for them. Let's start with the food: the waffle was not hot when served and by the time the \"heated syrup\" (barely warm) was brought to the table the waffle was stone cold. The omelette was pretty good, the eggs were ok, and the toast was so-so. I would like the toast to have some color Rather than look like just dried bread.  Now to the service. I had to continually look for someone to fill my coffee cup, the waitress kept forgetting things we asked for, and why would you ask if we want the potatoes that came with the order. This was only the waitress'  2nd shift so I understand. However when you have someone new you don't leave her to her own defenses. The other waitress was very busy so she couldn't help that much.  Our waitress tried hard.  Not sure we will go back."}
{"text":"Great food and great service! I ordered the bagel sandwich and my friend tried their oatmeal...delish!"}
{"text":"If you ever want great food in a awesome atmosphere go to Cafe 8. The owners are always working there and have the best attitude I've ever encountered. Everything is made to order and always fresh. And don't get me started on the desserts.. UNFORGETTABLE!"}
{"text":"Very good food, especially breakfast! Owners are super nice and the place is adorable. Great baked stuff. They also sell olive oils and vinegars (chocolate balsamic, blueberry balsamic, etc). Glad something good finally opened near Sprouts!"}
{"text":"The menu is large for such a small place.  Plenty of the choices, all looked appetizing.  Lots of healthy options as well as \"regular food\".  We got there early, I don't think all of the bakery items had been put out yet I think that's why the bakery selection seemed limited.  The cupcakes and pies that they did have displayed looked very tempting.    It sounds like a small thing, but one of the items I like the most is their fresh ice tea.  It's so nice to find a place that offers real-good-uncomplicated tea.  I usually don't care for herbal tea (I drink regular black tea unsweetened) but this stuff is soooo good."}
{"text":"we absolute love this place-the Belgium waffle was exceptional with real maple syrup for an extra dollar- we have taken people there for lunch and will do so again real soon the owners are great as well"}
{"text":"The food was delicious. I was amazed at the gluten free menu. When I asked the owner if certain foods were in her foods she readily answered my questions. I will definitely come back to this cafe and try other items."}
{"text":"Café 8 offers a number of gluten free options. I had the tomato bisque soup which was very tasty but heavy. Also tried the gluten free blueberry muffin which had a very light texture making it one of the best gluten free muffins I have ever tried."}
{"text":"The brisket omelette is incredible,  huge to say the least.  The sausage and egg portions were just as large and tasty.  The coffee to die for! ! Highly recommend this place and the strawberry shortcake was the bomb!  .  Nice little hidden gem."}
{"text":"My mom and I came here for lunch due to hearing about the good food.  She ordered a grilled cheese with a side Greek salad.  I ordered the half of turkey club and tomato basil soup.  Everything is homemade and tasted great.  We also ordered the mint lemonades which were delicious.   However- we waited 35 minutes between ordering and getting our food which for what we ordered was quite ridiculous.  When we asked how much longer she said that the fries that we ordered take 12 minutes to cook which was one of the reasons for the wait-we didn't order fries!  After telling her this, it took even longer to make the salad that we actually did order.    Since we had to leave by a certain time-as soon as we got the food we needed our take home boxes and the check.  She had to put our food in the boxes as we were trying to eat it.  Not great experience and long wait for sandwiches.  However the food was good."}
{"text":"Excellent little breakfast/lunch spot. Not suitable for large groups nor anyone in a hurry. That said, it's worth the wait for excellent food. Great gluten free options as well. Love it and will be back often!"}
{"text":"Very happy with their gluten free options!  I have celiacs disease, and finding somewhere I can eat good food is a challenge. I love their quiche and their blueberry muffins."}
{"text":"The food is great, there are so many GF options, in fact they have a whole menu with Gluten Free options. Food is cooked to order except of course for the muffins which are superb. The GF blueberry muffin was so moist and delicious I had to double check if it was really GF!  Excellent service too and prices are reasonable. One of my fav breakfast spots now."}
{"text":"The facebook page says vegan/vegetarian food.  I took friends there tonight who came up from Tucson.  The only thing on the entire menu vegetarian or vegan was the tzatziki.  I assume the sign they have out front and how they write up their facebook page, they might mean only the baked goods?  We left and enjoyed the pomegranate café, making sure to tell anyone in our group of friends who don't eat meat to steer clear."}
{"text":"What a great find!! We only picked this place because they were close and had a decent salad menu but it turned out to be a gem.   It had a surprisingly robust Gluten Free menu with lots of delicious choices. We ended up going with the brisket sandwich on the recommendation of the waitress and I am glad I listened. Their GF bread turned out to be really good and the sandwich had the perfect ratio of meat to cheese to mushrooms. The Village salad (Greek salad) was fresh and tasty and the tomato bisque was amazing!  We got everything to go so we didn't get to experience the service in full but what we did experience was pleasant.   Hope to make it back here before we head back to CO."}
{"text":"Took my daughter out for brunch because they have a gluten-free menu! She ordered the waffles and I had the breakfast sandwich (both gluten-free). Super delish! This is a made to order cafe so the food tasted and looked its freshest! We actually didn't wait long for the good to arrive (I was pleasantly surprised!) Waitress was warm and friendly! Definitely bringing the whole family back here for a treat!"}
{"text":"Great food and service  The Belgian waffle and breakfast wrap where great!  I definitely recommend this cafe."}
{"text":"Great food...the owners are awesome..I would highly recommend eating there. The food is really high quality. real beef and turkey. The soups are homemade and also very good.  The monkey sticky buns are amazing...don't leave there without getting at least one...will review more after eating there again..:-)"}
{"text":"This is my new breakfast spot! I'm so sad it's not open on sundays because I can't go tomorrow! I'm going to eat through this menu- today I started with the gluten free egg sandwich and every bite tasted amazing. Gluten free usually is dry and chalky, this was moist and delicious! I had to get a blueberry muffin to go... delicious! So light and fluffy! I can't wait to go back, debating getting dinner to go tonight because the bakery is so great. Try it! You won't regret it."}
{"text":"Cafe 8 has the best Greek dressing in the area! The staff is very friendly as well. The entire menu looks great, cannot wait to try the sandwiches."}
{"text":"My sister and I got the Cafe 8 omelets. SO GOOD! The owner and his wife are the bakers, chef and wait staff. Such good service! The meal was fantastic. The omelet comes with a side of potatoes and they were delicious. The omelet itself was cooked to perfection. I've had omelets everywhere but this is the best one I've ever had. My sister agrees! We will definitely be back!   Also the environment of the restaurant is quaint and welcoming. Their menu is excellent for gluten free eaters and great for vegetarians. Two thumbs up!"}
{"text":"Love all the \"clean eating\" organic menu choices that aren't like eating grass. The coconut iced tea is a great summer treat and their custom pear sauce is great on broccoli and as salad dressing. Steak is great, salad variety scrumptious, and gluten-free menu expansive. Highly recommend!"}
{"text":"Trust the reviews! This place was like having mom cook and bringing it to the table hot and delicious. Service was so friendly and warm. We would be regulars if we didn't live so far."}
{"text":"This is certainly one of my favorite places to eat with my girlfriend, we go here pretty much once a week if not more since we found this precious gem. I definitely suggest everyone come here to eat, try the French toast!!!! It's amazing :) They also have a gluten free menu as well as vegetarian and vegan options!"}
{"text":"This used to be my favorite spot for breakfast, especially because of their gluten-free options like the breakfast wrap (which they were unfortunately out of during this visit). My mother and I met up at this spot early one morning last month. Three other parties were present in the cafe, and perhaps two or more arrived awhile after we did. One hour after ordering and after being reassured twice by the hostess that our French toast and omelet would be right out, my mother and I (sitting in the opposite corner mind you) heard the following conversation from the kitchen: hostess-\"Can you put her French toast on? They've been waiting.\" Cook (male) - \"I'll make it when I'm good and ready!\". The cook's tone was so nasty and rude to her. I don't know if this is a family owned cafe, but either way that kind of talk is unacceptable. My mom and I left immediately and we will not be coming back after witnessing both awful staff and customer service."}
{"text":"A small cafe with excellent gluten free options! I went for breakfast this morning and after asking for a recommendation, got the Danish apple French toast. It was wonderful! The food was delightful and didn't taste gluten free which is always exciting. I had a spiced cake pop for desert that was also excellent. Took a brownie and a muffin to go and I'm looking forward to them for later!!"}
{"text":"Wonderful gluten-free desserts. I just wish they offered more - they're out of a lot of stuff by the time I get there so go early!"}
{"text":"We didn't eat here because we wanted breakfast and they only serve it till noon. :( but! We had iced tea which was delicious! Both kinds are awesome! The staff was very nice and the food looked good! Breakfast cravings are tough lol! We will definitely be back!! Everything is homemade and they have an awesome gluten-free menu and cater to that type of diet. I will change my review if the food here is as good as it looks, 5 stars for sure! Can't wait!!"}
{"text":"Stumbled upon this cute little place heading out to Superstition Springs mall. Great little find for sure. Nice people, good food and not the overwhelm pose of the bigger places. If you are in the area come check out this little gem!"}
{"text":"So, the website says the cafe is open until 6:00. The sign on the door says it is open until 6:00. Yet, when my wife and I  walked in at 5:25, we are rudely turned away  because they were setting up for a  private dinner apparently. Would be nice if they at least put a closed sign on the  door...probably won't be back. I have to disagree with the reviewers who thought the owners were friendly.  Thought we were treated pretty rudely."}
{"text":"Truly Gluten Free So many choices. Are you or a family member gluten free? Finally, a place for breakfast or lunch where everyone is fully satisfied. I was torn between GF pastries, bagels, quiche and finally decided on GF Belgian waffle. Wow! Bob enjoyed a hearty breakfast with his choice of non-GF toasts. Great coffee. Pastries to go! Family owned, pleasant atmosphere and service. If you're tired of restaurants that claim a gluten free option when what they really mean is order this selection without the bun, the fries and the dressing...and we'll charge you the same price....you know the drill... you're going to love Cafe 8."}
{"text":"Definitely a great place to have a really good breakfast., small, cozy, great service & awesome food. It was pretty cool when the cook came brought our food which as I said was BOOM!  You gotta check it out.."}
{"text":"The staff is very friendly and the food was excellent!  We had the omelette. My kids had the parfait and scone!"}
{"text":"At first glance an unassuming little place, the service and food is like home! Delicious coffee. Dark meat turkey sandwich is lightly toasted with mayo- so tender and moist. I got half a sandwich with bowl of tomato basil soup that was perfectly spiced. What a happy surprise to find this cool spot!"}
{"text":"Tried this place for the first time today - small but clean and comfortable. Tony was the perfect gentleman manning the front of the house and you can feel that this is a family owned restaurant by their welcoming spirit right from the start. I requested strawberries with my French toast, which was happily accommodated and it was delicious. Ordered a side of potatoes, which we good but would have been better if pan prepared instead of deep fried.  Hubby enjoyed his meal as well, which had a Mediterranean flare. Alex the owner/chef greeted us after the meal and was super friendly. Will return again sometime."}
{"text":"I had lunch here with my sister. We shared some hummus. My sister had the Greek salad and I had the Café 8 Omelette. The food was super delicious. Honestly if I lived on that side of the valley, I would eat here often.  It was really busy when we first arrived. The place is small so if you have a party larger than 2, I would suggest calling ahead to make sure that they have space unless you don't mind waiting.  I'm giving them 4 Stars instead of 5 because the owner was upset with the guy that was working the counter and scolded him in front of everyone. He also sent him over to apologize to both my sister and I for not seating us more promptly... This kind of confused me, while I appreciate the fact that the owner was trying to be proactive, we honestly had not thought anything of the almost 10 minutes that we waited. It was busy and we had a baby car seat with us, so we needed to find a place to fit both of us and the car seat. I felt like it was a little harsh to send an employee to offer an apology for some imagined slight. I feel that the situation with the employee could have been handled with a little more tact. I would not have appreciated that treatment if I were that employee.  I will definitely go there again when I'm in the area."}
{"text":"Love the organic menu with grass fed beef. The lady took our order was really friendly & food tasted amazing. The fresh blueberry muffin was yummy & the French toast & eggs, bacon & potatoes tasted great. We will definitely be back as I want to try the lunch menu."}
{"text":"I can honestly say this was the worst lunch I have ever had!  I dont even think it deserved one star.  I ordered the chicken pita sandwich and the pita bread was more like a flour tortilla (thin and extremely chewy), the chicken was rubbery.  Gross!  I couldnt even finish 1/4 of my sandwich.  And the fries - how do you mess up fries??  Ugh.  Please do not waste your time or money."}
{"text":"The food is decent. Their fries are pretty dang good. My main complaint is the fact that I was charged three times for my meal!"}
{"text":"I LOVE Cafe 8. They have an extensive GF menu and they even have decadent GF desserts. I have yet to order something I didn't like and they even do custom orders. They are really amazing."}
{"text":"Omg gluetin free! Yes! I have gluetin allergy people in my life And bake my own stuff... But their goodies taste so fantastic! I might be replaced :).    They seem to have wide selection of gluetin free stuff but at 2pm, most stuff was gone :((( so I'll be back early next time !   Pecan bars are absolutely amazing even for non allergy person like me. Yum yum !   Friendly staff. Great ambiance :)"}
{"text":"I've been for breakfast a couple times.  A small, family run restaurant which is right up my alley!  I've had the breakfast wrap both times because it was AWESOME!  Tracey and family are friendly and make you feel welcome!  Thanks for the great breakfasts!  We'll be back-next time maybe for lunch!"}
{"text":"This is my favorite place for breakfast because of the homemade pastries and delicious waffles. You just can't go wrong with their menu of tempting suggestions and favorites."}
{"text":"Just tried Cafe 8 today.   While the service was OK, the food was also just OK too.   Nothing great, and even a bit overpriced for the taste or quality.    Because this is a small struggling business I am giving it three stars although I could have gave it last for several things but I'm being gracious on this one.  Look, I am all for small businesses succeeding, as they are the backbone of this great Nation.   But the ones that WILL succeed are those that are on their game.   Cafe 8 needs to get on their game, or they'll be just another statistic in the future.      On another note as well the location is stuffed in the corner of a small strip mall but that would be all the more important that the inside of their business looks on its game. It was really just a bit shabby inside and needed a good throw scrubbing and upgrade. That was one detractor.      Another detractor was the kitchen staff came out to deliver our food, and as much as I hate to say it,  they were less than professional in appearance.   Sorry, but neatness and cleanliness are critical in the restaurant industry.   If you are going to send your kitchen crew out to deliver food to the tables, then they need to look presentable and obviously working in the hot greasy kitchen does not always allow for that.    They would best be served to stay in the kitchen rather than greeting the customers who are now looking at food that they are getting ready to eat and seeing a crew that is less than presentable in overall appearance.   This tends to give the customer concern as to whether their food has been handled properly or not.   Just a recommendation but consider presentability in every aspect of your business.   Again I will reiterate I am all for the small business succeeding. but you need to pay attention to detail. When you stop paying attention to detail you'll lose the business at some point."}
{"text":"We went to this place for brunch expecting it to be OK. When we got in we immediately felt welcome. After we were seated I took one look at the menu and knew what I wanted. I ordered the turkey breakfast wrap and it was delicious. My mom ordered French toast which was also amazing. After we were done eating we saw someone with a huge muffin and decided to get 2 to go. We are currently eating one is I write this and will definitely be back for more soon"}
{"text":"Awesome quaint Mom n' Pop place! The food and service was excellent! So happy I stumbled on this hidden gem!"}
{"text":"Was very excited to try out this restaurant for their gluten free options.  My husband and I arrived at the restaurant around 5:15 pm.  I ordered their grilled chicken breast dinner with seasonal vegetables and roasted potatoes and my husband ordered the non gluten free French toast.  I was a bit shocked when my dish was brought to the table and on my plate were frozen vegetables that consisted of corn, carrots and peas. The chicken was very large and didn't taste bad, but was far from exciting.  The roasted potatoes where cut like French fries and were undercooked and tasteless. I don't know if we just came in on an off night, but I am not sure I will be back.I paid $11.95 for a meal I could have cooked at home.  My husbands French toast was nothing special either.  Very sad, as I thought I had possibly found a place that I could get gluten free options.  I did order a piece of their gluten free cheesecake and it was absolutely delicious, so the meal was not totally a flop."}
{"text":"We tried out Cafe 8 for lunch. I do not give 5-stars lightly but Cafe 8 nailed it.  I like to eat gluten-free and heard that pretty much everything on their menu is gluten-free (they also have several \"raw\" options to try). I had the mediterranean combo appetizer. Now, I LOVE mediterranean food. These were the best dolmades that I have ever had...including in Greece. The hummus and tzaziki were outstanding. And the presentation was first rate. My husband had a pear and gorgonzola salad that was delectable.  Not sure what the dressing was but it was very light and flavorful.    The gluten-free dessert case gave us a challenge: which amazing looking item to choose to try. After a very satisfying meal, we could really only try one. We chose the delicious-looking triple-layer carrot cake. Wow! ridiculously good. No clue by taste that it was gluten-free. I would go back again for just the desserts. I imagine the other items are equally delicious.    At one point the pastry chef (owner?) came out and chatted with us for a bit, explaining her passion for cooking and some of her cooking philosophies. Our server was great and prices were very reasonable.  We will definitely return."}
{"text":"A friend and I met here for lunch. I was excited to try some of the delicious things people mentioned here on yelp. I ordered the club on gluten free bread and the soup of the day, tomato basil. Everything tasted fresh, my only complaint was my bread was a little too toasty and tore up my mouth. Next time I would probably ask that it was lightly toasted or not at all. I had planned on getting a baked good to go but unfortunately they only had a couple items available that day so I hope to try out the carrot cake sometime.   I will go back and try other items. I love the fact that restaurants are opening up that are catering to alternative and healthy eating options and not just the usual greasy food stops."}
{"text":"Well I did like this place, they do have gluten free donuts that are awesome, but there's is very limited space, very limited staff, drinks are ridiculously high with only one refill for even tea that's over 3 dollars. I waited over an hour and only had one cup of water... I told them if I could get it to go cause the wait was too long. My wife is limited to what food she can eat since she has celiac and has to eat gluten free food... But this was absurdly too much of a wait time to even speak with someone. Won't go back till they have more help and better service."}
{"text":"It is tucked into a corner, and easy to overlook but the food is exceptional!  My wife had the omelette and I had the breakfast wrap. Both exceeded our expectations. We felt indulgent and shared the Danish apple French toast. Worth it!  On top of it all the coffee was high quality.  We'll be back for sure. We came because of Yelp and it was a success!"}
{"text":"Firstly and most importantly, the food is amazing. They offer several gluten free options as well as regular food and unlike most places now days they are always willing to make adjustments to your meal if requested. If you haven't tried this place yet, you are seriously missing out.   Secondly- I read some of the reviews posted on here and noticed that reviewers continually made notes about the wait time for their food. If you didn't know already, practically everything in this establishment is made to order. Nothing comes out of a bag or a box- this is true made from scratch in a mom pop type store- quality like that takes time.   Lastly- for a little perspective- this is a family owned restaurant. Tracey and Alex run this store day and night. Even though they are ONLY open six days a week- I'll bet you on that seventh day they are still prepping and preparing for Monday."}
{"text":"Really happy this place exists. Delicious gluten free options. Owner comes out and served food. Very friendly. I was very comfortable here. I will definitely be back."}
{"text":"I love this cafe!  Tracey and Alex are wonderful!  Can this man cook!? Heck yes!  Tracey knows about food allergies and makes the best gluten free goodies!  My favorite breakfast is the bagel with egg and bacon.  My daughter loves the grilled cheese and soup.  We both like to take home the gluten free quiche. Love the European ambiance and classical guitar music. Keep up the great work!  Chris"}
{"text":"What a disappointment!  Never even got to try the food, because they took too long to take our order!  Used the bathroom and it wasn't clean, not a good sign.  The restaurant in general didn't look very clean either.  Won't be going back."}
{"text":"We go every Saturday! Food is amazing and fresh, service is wonderfully inviting. A must go!"}
{"text":"For our weekly lunch outing I had decided to try out Cafe` 8.  It was a good experience.  A very polite young man Tony, who seated us took our drink and food order. I got the Turkey Club which featured thick slices of homemade Turkey freshly cooked bacon and very fresh thickly cut  tomato's.  I ordered the tomato and Basil soup as a side ... right away you could tell it was home made with supper bold yummy taste.   The only down side was the soup became to acidic for me so I couldn't finish it...    All and all a really nice dining experience.  Thank you Tony for the great service.    I cant wait to try them for breakfast. they had some really interesting coffee and Olive Oil for sale there."}
{"text":"My boyfriend and I LOVE this little cafe. We have been coming here for over a year now, and have become friends with the owners. Tracey is WONDERFUL, they have regular and gluten-free options. The food is to die for. My favorite dishes are the French Toast with a side of fruit and the Turkey Breakfast Wrap! :D They are a family owned business, always super busy and always eager to serve you! Highly recommend this place!"}
{"text":"The food was amazing, love the atmosphere and the owners are so passionate about what they do. I finally found a Gluten Free restaurant where I don't have to worry about cross contamination or lack of knowledge by staff. 5 stars hands down. The whole roasted turkey is delicious and the omelets are so fresh and huge! Will be making this my go to place for good food and fresh baked gluten free goodies!"}
{"text":"Just ate here for the first time. Ive never written a review...ever...but felt the food here was worth it. It was excellent. All fresh ingredients. Being a local, I would like this place to stay open for a long time so I would definately recommend this place. My wife hade the prime rib beef open faced sandwich and i had the grilled cheese with applewood smoked bacon and homemade tomato basil soup. It was all excellent! And hot! Everything on the menu looked original and good! Can't wait to come back!  --Jason (from E. Mesa)"}
{"text":"Found this place last minute, and I am certainly pleased to have found them! They have healthy selections, and I enjoyed one of the best breakfasts in AZ."}
{"text":"It is fusion vegetarian/gluten free place with Mediterranean recipes that also serve breakfast, lunch, and dinner.  I opt for a Tomato salad (slice tomato with olive oil, chopped garlic-hallatosis, and Feta Cheese) and my friend went for a typical American breakfast.  I felt great after eating it but my friend was quite delighted with the food but not my breath.   I had to rush home to brush my teeth, tongue, and mouthwash immediately after I eat but I know it is good for me yet my colleagues at work had taken shelters from stink bombs..Great place for friendly and health conscious dinning experience.."}
{"text":"I just recently became gluten intolerant and this place has so many options for someone with a limited diet. Foods is always delicious and fresh. I would recommend something specific but everything I've had was good!  Price is a little more expensive, however all gluten free food will be."}
{"text":"Stopped in for breakfast one morning when we were in the area. Greeted by Tracey who owns and runs the place with her husband. Very nice little placed tucked in the corner. I had an omelette that came out super fresh and hot as everything is made to order and its worth the time.   Great service and conversation, amazing food and so glad I stopped in. Will be back many times."}
{"text":"This place is amazing! my husband had their breakfast Wrap which has the most perfect texture! the tortilla perfectly crispy and i had the french toast which was also cooked to perfection. I left there feeling full and satisfied and the service was excellent our waitress was very sweet!"}
{"text":"I moved a bit further away from this establishment than I'd like to have.  I'm not able to frequent as much as I used to, however, today I was able to stop in and try the gluten free donuts Tracey puts together.  While I know, putting the words \"gluten free\" in front of something can often mean bad.  The muffins and scones, and now donuts that I've tried are all delicious.  Had the opportunity to talk to Alex and Jordan a little bit before I left.  Alex is Tracey's husband and it is their cafe, Jordan is the ever pleasant smiling face to greet you.  This place is and has been consistently all-around goodness. From atmosphere, taste, and service, you can't find better.  Give them a try if you haven't."}
{"text":"This food is so good! I'm gluten and dairy free and they have tons of options for me! They have gluten free doughnuts (home made!) on Saturdays and they were wonderful.   I had the GF French toast and sausage and it was delicious. My boyfriend had a three egg omelette that he loved, with sourdough toast that was amazing.   We will definitely be back, the owners are amazing and we can't wait to go again!"}
