{"text":"If my fried chicken hadn't been incredibly dry, I would have given this place four or five starts. It's cozy, cute without being ridiculous, and served us a hot meal without a long wait. Our waitress was friendly but didn't invade our space. My partner's burger was par, and my sides of mac n cheese and potatoes was the same. It was okay food served hot, but the price was right and we were just glad to find something open at the unusual hour of 3 pm. The atmosphere is quaint and the food is just fine--mostly the price is right."}
{"text":"I did my dinner yesterday. It was southern hospitality at its best. The hostess was wonderful I felt like eating at home. I wonder how I did not find this place before. Home styled cooking. Will come back"}
{"text":"Chicken Fried Steak and Country Fried Steak.  Both. On the same menu.  The fried catfish was very good, as was the meatloaf.  If you're looking for southern cooking- this is the place."}
{"text":"Had a ton of Oatmeal delivered to our office (catered). Everything was delivered ontime. Easy to order and super nice deliver. Oatmeal was perfect."}
{"text":"Great value and the grits were delicious. Best part of my breakfast for sure.  Service was very good- felt like a neighborhood place."}
{"text":"Tanya was awesome, knew the menu like the back of her hand, great service, great southern food!"}
{"text":"Stayed at the hotel across the street on an overnight.  Good food at a good price.  Everyone enjoyed their dinners - the Thanksgiving Dinner Platter for me with everything you would expect right down to the canned jellied cranberry sauce (my preference!), the catfish and grits for my husband, and the Mac 'n' Cheese for our M'n'C connoisseur kid.  The hushpuppies are just what they should be - crispy on the outside, tender on the inside, a little sweet and no weird add-ins.  So good, we went back for breakfast the next morning!  Not many places get \"eggs-over-medium\" right - Cafe South did!  We'll go back whenever we are in Charlotte."}
{"text":"First of all the food is not that bad.....the thing that gave this place 1 star for me was the way their staff are treated...the owners Paul and Pete are horrible, they belittle their staff and yell at them in front of the customers....for example...I had went their for breakfast and ordered their breakfast special which consisted of eggs bacon and grits I also got the biscuits with a side of country gravy. I started spooning out my gravy for my biscuit when I noticed a chewed piece of gum in there. I got my waitress and showed her as she was appalled at what I had found. She asked if I wanted another one and I did so she went to get it. She came back and said my manager thinks you put that in there so I'm sorry but I can't get you another one. At that point I was ready to see the manager.....as she was comming back to the table I witnessed the manager/owner PAUL run in the back like he was a coward....like you can't even fix this problem and it's a BIG problem, chewed gum in my gravy. So maybe after 10 minutes he finally came over and DID nothing, not even comp my meal...as I was leaving I had overheard some of the girls talking saying Pete had gotten on the cooks earlier for chewing gum..so obviously the gum came from the cooks not me....so you have lost a lot of customers (I tell everybody I know not to go there) and got a BAD review all because you didn't try and make my experience okay over some GRAVY!!!! DONT GO THERE UNLESS YOU WANT TO BE BLAMMED IF SOMETHING IS WRONG AND LIKE TO WATCH YOUR WAITRESS BE HUMILIATED AND YELLED AT IN FRONT OF THE WHOLE ESTABLISHMENT....one more thing...if your waitress doesn't come back to the table dont take it out on them that would be PETE telling them not to go back because you sent something back....yes one more thing look at your checks and make sure they didn't forget to price something or make sure everything you ordered is on the bill because once you go to pay and they didn't charge you for your appitizer your waitress is going to have to pay for it even if they catch it and charge you for it they STILL make the waitress pay....HORRIBLE PLACE OF BUSINESS BECAUSE OF THE OWNERS!!!!!!!! ( if I could have gave 0 stars I would have because you dont treat people like that....)"}
{"text":"My wife and I loved it. I know all reviews are done based in the persons personal experience but that is the point! This place has great customer service from the beginning you walk through the doors. The staff is very friendly and professional. The food was great, very tasty and reminded me of moms cooking - very few places do that. I would definitely come back! Love it. 
 Their coffee was also amazing."}
{"text":"The best American style fried chicken I ever had! I was traveling around the town and so glad to make a stop to dine here!"}
{"text":"Great addition to Southwest Charlotte.  Clean and LOCAL atmosphere with great food!  I had an 8oz burger with the tortellini pasta salad.  I was very impressed with the quality.  Amazing service too!"}
{"text":"Much nicer on the inside than I thought it would be. The breakfast was your usual fair for a really good price. Portions were large so don't over order. The lunch and dinner menus looked tasty so we plan on coming back to try their other dishes."}
{"text":"Clean restaurant with good service. Was around 8 PM on a Saturday night. Not very busy.

Would have rated higher, but my baked sweet potato was a bit old. Other than that very enjoyable experience.

Plan to come back for breakfast - as it's close to the Marriott courtyard where we are staying.

Portions were good sized took some back with us."}
{"text":"Fantastic place!  When I saw Pete there, I knew everything was going to be outstanding. Great vegetable selection.   Clean and friendly."}
{"text":"Went for breakfast with the family. Excellent services! Excellent food! Southern hospitality! We will be back!"}
{"text":"Cute cafe. Nice atmosphere.  Overpriced typical breakfast fair. Pncakes taste like add water boxed with your choice of add ons (ie chocolate chips pecan blue berries). 3.95 for one thin pancake. Grits were creamy good.  Coffee is weak. They need a better brand. If u r not into pancakes its okay. They dont give you healthy portions. Waitress was very nice"}
{"text":"I walked down here for dinner as I'm staying in a nearby hotel.  It's a really great family, casual atmosphere.  

The menu is huge, and it was very hard to decide!  Prices are very reasonable.  Food portions were more than enough, and everything was delicious.

Service was great as well.  Everything was timely, and the staff was very friendly.

I'm in Charlotte for another week, and will definitely return."}
{"text":"As others have posted I found the food bland.  I tried the Country Style Steak with green beans and corn.  It also says delivery available on their website but when called to have delivered to hotel next door they said they don't deliver.  Still wanted to try it out since it was close and not a big chain- was disappointed with the food that I got. It wasn't horrible...just nothing great as these kind of country places usually can be."}
{"text":"Excellent ! My husband had the fried chicken, salad & homemade mashed potatoes. I had the 6oz ribeye & 6 jumbo fried shrimp, salad & baked potato & we had an appetizer of homemade onion rings. Such a wonderful surprise to find this restaurant ... the cornbread served with the meal was delicious as well, we couldn't eat all of our mea,l we were way too full ! Sandra took such good care of us and had the sweetest nature & funny also .... Best meal on our week long trip thru the mountains this past week !! Cost was reasonable as well. Mark & Robin T"}
{"text":"Restaurant opened today, and my daughter and I decided to give it a try, since we were staying at a hotel nearby.  

We came for dinner, and I ordered the fried flounder and popcorn shrimp combo, while my daughter had the spaghetti with a side of mac and cheese.

I found the shrimp to be really good and flounder was decent.  The hush puppies were very good, and I ordered green beans and okra on the side.  The green beans were full of flavor and clearly made from scratch.  The okra was standard restaurant okra and was fine.  

My daughter said she liked the spaghetti, not as good as home, but better than what the school serves, so I guess that's a passing grade.  She was more fond of the mac and cheese, which was clearly made from scratch and appeared to be cooked in the oven, as opposed to over the stove.

We split a red velvet cupcake for dessert, which was very good and clearly made from scratch (all the desserts look fantastic), although very small and overpriced, which is surprising considering how reasonably priced the dinner menu was.

We will definitely dine here again, as the menu is original and diverse in selection, and, for the most part, the food lives up to the \"home cooked\" billing they give it."}
{"text":"The wait staff are friendly and engaging. The food was great. I work near here and will definitely be coming back frequently."}
{"text":"Great services and great food 
It was full and we were sorted very fast 
The price was also very reasonable"}
{"text":"I would say this place was 'just Okay'. Our server was great, very nice and informative. Drinks were filled promptly, food came out quickly and wasn't terrible. Just not an outstanding experience. 

The building looks like it used to be a Bob Evan's and the menu reminded me of the same. Around 11:30 we had choices anywhere from eggs to filet mignon and quesadillas! 

I had a patty melt with fries and hubby had a Ruben burger with gravy fries. Again, food wasn't terrible, but I don't think j would go out of my way to go here again or recommend it."}
{"text":"I have eaten here many times with family and friends and it is always great, and the service is very efficient. I love the large menu and there is always something for everyone."}
{"text":"Been passing this place for over a year now and finally decided to give it a try. Should have kept on driving. The service was friendly but unprofessional. I do realize that this is a diner but still one expects a certain level of knowledge from their server. I ordered a veggie omelet and when it got to the table it was the meat lovers omelet. The server did even care that I had gotten the wrong item. By the time I got my correct order everyone at my table had finished their food. I took one bite and the eggs were ice cold. They still put the omelet on my check! Will never come back..."}
{"text":"The atmosphere is welcoming. The servers are fast and help each other. I suggest asking for Mary. She is wonderful and wears a genuine smile. She truly loves to serve. Don't ask for her on Sunday because she's church bound. We enjoyed Mary very much. Cheers and enjoy"}
{"text":"I came in by myself around 3pm on a Tuesday. I ordered the Buffalo Chicken Wrap and it was great! The sauce was a little spicy so be careful, I love spicy though. The sauce was just the right amount where I could still taste everything in the wrap, so it was not over powering. The wrap was cut in half perfectly too, so if you wanted to split it or take it home that's a great option. It also came with fries that were warm and crispy but still potato-y in the middle. The meal cost about $10 and was very good!"}
{"text":"Service was great and effecient. Turkey sausage was over cooked and pancakes were average."}
{"text":"My review is mostly for the staff, I used to work down the road from here and would stop by to meet my mom for lunch about once or twice a week. We became somewhat of regulars and the staff wave and say hi when we walk in. everyone is attentive and friendly and the food is pretty good as well. It has a great diner feel and its always worth stopping by."}
{"text":"Formerly Bob Evans buy MUCH better food!  Been here 3 straight nights for work and transportation.  Great food!  Great southern charm and fantastic service.  Will be back tomorrow!"}
{"text":"I love this restaurant and the people that work here are amazing.  the food here is not average like the dimwit  David v say. I love their biscuit and David V. you are just like the Hitler of yelp with no consciousness of your words or review. you have have a very limited experience of it in daily life.  Your mind and thought are so narrow as reflected in your reviews.life has a higher purpose  than just writing stupid review on yelp. Just because you can go on yelp and write and accusing this restaurant serving you food from a can? life has higher purpose and there is something divine out there. Find yours and stop writing these kind review online. it only show that you David is nothing but a shallow prick. Be a divine person and not a hater. the life you think that only involve eating and writing bad slanderous review is not true.There's much more to it ,a deeper sense of purpose. this life of yours right now wasting writing bad review on yelp.ultimate aim of any human is to attain moksha. since you have not attain yours so that is why you would go on yelp and writing these kind of review. Stop spreading hate and lies on yelp and online and be a better human  being. This world would be a better place to live if you and people like you would just attune yourself to better intuition. you have infinite consciousness so
 Clear your mind and your hate of the love of god and insanity of mankind"}
{"text":"Nicely hidden gem serving genuine southern fare if you're interested in a simple meal out. Very generous portions served by polite staff. The fried okra was just like my grandma's and the chicken- fried steak was as good as I used to get in East Texas. Go for the fried green tomatoes for an appetizer."}
{"text":"was at a nearby hotel on business....came in for dinner....had a grilled chicken salad and cup of chicken noodle soup and both were outstanding...nice place....big...comfortable...they serve drinks.....fresh made desserts...there's a counter bar with stools up front so it's good for solo dining."}
{"text":"While out and about, my wife and I came across this restaurant. Similar to a Perkins, the waitstaff was quite friendly. On this occasion, we tried: 

Deep fried catfish w/ff & sweet corn
Chopped BBQ pork w/fried okra & collard greens

Definitely a nice touch to Southern cuisine. Next time we're int he area, we'll search for this place again."}
{"text":"Great food and service at a terrific price!  It doesn't get any better if you are looking for a casual family meal.  We were in town for the weekend and after having lunch with my wife, we went back for dinner with our children.  The next morning for breakfast, my children asked if we could go back again!  Three meals in a row at the same place is a testament to how good this place is!"}
{"text":"My husband and I were staying at a hotel near this restaurant while traveling through town. After reading reviews online, we decided to give this place a try for dinner.

Now, I know that every restaurant and every cook has an off day and I'm sure that this was what happened here.

We started off with the Cafe fries (fries, cheese, and bacon) and it was pretty good. Fries were crispy and the homemade ranch was definitely good. Unfortunately, one of the appetizer plates came to our table with old food crusted on it. 

I ordered the chicken fried steak with mashed potatoes, Mac and cheese, and cornbread. It was just awful. The potatoes had the strangest consistency and had an unidentifiable and unpleasant taste. I asked my husband to try it and he agreed. The chicken fried steak in itself was fair and the mac and cheese was greasy. The cornbread was a bit tough. 

My husband ordered the three cheese baked ziti with meat sauce. As my husband put, \"it's not good\". I gave it a try and agreed with him. It seemed almost watered down. 

Our waitress was a doll and was super sweet. She was very helpful and friendly.

If we are passing through town again, we won't be back."}
{"text":"My husband & I had flounder; his was blackened perfectly & mine was grilled. The green beans were just like my grandma's with a little onion & seasoned just right. Our plates were scraped clean. We shared a red velvet cupcake which was moist & delicious. We also enjoyed the sounds from the 60's. Great experience!"}
{"text":"I've gotta say, I have not been treated that well in years.  The food was good, but Theresa treated us like gold. Her attention to detail and genuine kindness was wonderful.  She got all of our special requests exactly right. My niece has very strict dietary restrictions, and she made sure that everything was handled correctly. The prices were fair. We will be back!"}
{"text":"Had the Thanksgiving Dinner and it was excellent! Comfortable atmosphere and very nice waitress."}
{"text":"My wife and I went for bkfasf two times. Fantastic place and very cheap. The  biscuits and hashbrowns worth the calories. The staff couldnt be nicer. This is certainly worth checking out. If we are ever in Charlotte again we will go for sure. Authentic southern food and their fry cook must be terrrific."}
{"text":"Glad I came across this gem in south Charlotte  I had the breakfast special with french toast, and the order was at the table before I finished 1/4 of my coffee. Also, the staff was very welcoming and pleasant. I will definitely be back!"}
{"text":"not bad at all for breakfast. they have a 4.95 special everyday if you are on a budget or you just don't want to spend a lot . my wife and I had omelet and one biscuit and gravy and two drinks and it came to almost 40 bucks with tax."}
{"text":"This restaurant is exactly what they advertise. Good home style cooking. I had the fried chicken with mashed potatoes and salad. Salad was cold and crispy. The chicken came out hot and was very good. Our waitress Michelle was fast, friendly and took great care of us.  Nothing fancy but done well!"}
{"text":"Polite and fast service. Western Omelette and breakfast special were good. Only for a 4 instead of 5 is it didn't blow my mind awesome. It was a quick, cheap breakfast that satisfied my hunger. Calming atmosphere and relaxed southern feel."}
{"text":"I was delightfully surprised by the food. The fried chicken was phenomenal and came highly recommended by the server. The fried green tomatoes were small, medallion size but you get about eight of them. The combination of the green tomatoes, feta and fresh diced tomatoes was different and good but the fried green tomatoe itself...I've had way better. I also had their chicken and rice soup...wow! So good after adding a pinch of salt and pepper.

On weekends you can get breakfast up to 1pm and guess what....drum roll please.... banana pudding is a vegetable. Yes people, you can get a very nice, shareable size scoop as one of your sides. It was good too. Hubby and I scaped the bowl.

Everyone was friendly and truly treated you like family. When our server returned with the food she said, \"Food's here. Take them elbows off the table like granny said. Granny gone get ya.\" Wow! My granny used to always tell me that. 

Although I've stayed in the nearby hotel twice already this is my first visit here but after this great experience it will not be our last."}
{"text":"Servers are always \"Southern\" friendly and it seems like nothing is a problem. Everything I order there is good and frequency for lunch or breakfast because my office is close by."}
{"text":"Great service and excellent food ! If you like good ole home cooking this is the place to go !"}
{"text":"Kim was my server. Did not have to wait long to be served. Packed at lunch. Ordered cheeseburger with fries and onion rings. Also ice tea.

Food came out fast...service was great. But the food was pretty average (but not bad). Typical diner food."}
{"text":"We had been here several times and the food and service was always wonderful.  While sitting at the counter during a busy rush, we heard the waitress call for a new waffle to go.  She told the man plating the food (possibly the manager) that she had dropped the waffle on the floor.  The man said \"let me see that,\" and took the waffle in the back.  After standing there for a minute, he came back out and bagged it up.  The waitress reminded him that it fell on the floor and he said it was a new waffle.  She exchanged looks with other severs who all shook their head.  One even apologized to us for what we saw.  Obviously one bad employee out of the whole crew but, unless you know he's not touching your food, you can't trust what is served to you."}
{"text":"My mom said it best. \"The prices were great! The food was just okay.\"

Since my whole family was in town visiting, I was trying to make sure we got a few local places under our belt, outside of the typical chains ( like IHOP, Waffle House, etc). Since I've driven past this place many times and it always looks pretty packed, I was eager to give this place a try. 

Based on the reviews, I was ready to be beyond WOW'ed and I just wasn't. The hostess was very friendly and seated us very quickly. Our waitress was okay. She wasn't very enthusiastic or knowledgeable about the menu or great at making suggestions for first time diners. But she kept the coffee and water glasses full and got our order so I guess that makes up for it. 

Everyone ordered something different, so we could share and before we knew we had pancakes, french toast, a meat omelet, bacon, hash browns and grits flying around the table. 

My favorite by far was the french toast, it's made on challah bread and ready thick and filling with a touch of powder sugar...yum! 

Everything else was just pretty standard. Not bad. Just standard. There was one small downside, I wasn't a fan of the grits...perhaps that's my fault because I was secretly comparing them to Flying Biscuit...oh well! 

I mean I'm not writing this place off completely. I definitely want to try their lunch and dinner options. But for now, this place is just A-Ok. 

On a personal note, there's a waitress there named Mary and even though she didn't wait on us she is super friendly and extremely professional. As we were leaving she chatted with us, and even complimented my grandmother on how good she looked for her age...she also made sure to thank us for coming in and told us to have a great day. When I go back, I'm definitely going to request to sit in her section! She's a real jewel to the restaurant!"}
{"text":"Not a good wine selection but man was I hungry after a 4 hour drive. The Greek salad on romaine  with chicken was very good. My bf had the stuffed chicken, collards and green beans. He thought the chicken was very good. I would eat here again."}
{"text":"My wife and I recently stopped on a Sunday around 12:30 for lunch. We were given breakfast menus, which I thought a bit odd given the time, but breakfast is probably my favorite meal to eat out, so we rolled with it.  Judging by the looks of the place (both inside and out), I'd guess that it used to be a Bob Evans at some point (but don't quote me on that).  
The service was outstanding- our food was ready in probably 5 minutes (granted, they were pretty simple orders, but even still...).  My wife had scrambled eggs, grits, and a biscuit. I ordered turkey sausage, egg, and cheese on a an English muffin with a side of hash browns. The food was hot and tasty and prices were pretty reasonable. 
Apparently they serve lunch and dinner too, but I'm wondering when that might be if they're still handing out breakfast menus past noon."}
{"text":"My family and I were passing through on our way back home to Florida. We had the best breakfast ever. Tasted just like they say, home cooked. The HOBO breakfast was awesome, forget the cholesterol. My kids loved their chocolate chip pancakes. Thank you to our friendly and kind waitress Kim, and the rest of the staff. Your service is excellent, your restaurant is clean and comfortable. We'll definitely stop by again on our next road trip."}
{"text":"The baked goods seem to be home made and are really good (I loved the cookies I got). The food portions are really big. The staff is super friendly. That's the good, the not so good is that the food is just ok. Nothing I had was bad nor was it that great. I had a burger one trip and I had some sort of pasta the next trip and I wasn't impressed by the taste but for the money and the amount I got I felt like I was ok with the whole situation. I recommend you try this spot out for yourself. Loads of people are always coming and going so maybe my tastes are off on this one. You be the judge."}
{"text":"Came here today for breakfast. It was really well priced and the food was quite good, though the hash browns were a little disappointing. I also do wonder how the food gets out so quickly, because it didn't taste premade or anything. 

I definitely want to come back sometime for lunch or dinner. I really enjoyed breakfast! 

Staff was friendly. Our waitress seemed a little stiff at first but then she loosened up a bit. 

I learned it used to be a Bob Evans, which is the first place my family and I ate when we first moved to NC, so I suppose it was a bit nostalgic. The decor was confusing though. It was almost like a cross between a diner and a trying Italian restaurant, though I really loved the clock shaped like a skillet! 

5/5. Nothing was so wrong that I had to take a star away."}
{"text":"had breakfast there - good prices, although the special does not include your coffee! Good quantities. Only negative is that I prefer butter rather than the oleomargarine they have at the table."}
{"text":"We recently met some friends here for lunch and we were pleasantly surprised with our visit!  Our service was excellent, the food was delicious, and the prices were very reasonable.  

Looking at the menu, I saw the typical diner-style offerings that were common in joints owned by Greek families when I was a kid growing up in Charlotte.

Here, you will find a huge selection including sandwiches, salads, burgers, or a vast selection of entrees including the traditional \"meat & 2\" offerings (including baked or fried chicken, thanksgiving dinner, fried catfish or flounder, meatloaf, etc...).  The entrees are served with your choice of a roll or cornbread. 

The side dish options include such southern staples as fried okra, mac & cheese, green beans, collard greens, mashed potatoes, Lima beans, corn fries, onion rings, rice, fried squash, candied yams, banana pudding, and many more traditional southern favorites.  There were so many yummy sides that on my next visit, I may have to go for a veggie plate (you can choose a veggie plate with 3 or 4 sides). 

For my lunch, I decided on the baked chicken (you get to specify whether you want white meat or dark meat), corn bread, mac & cheese and fried okra.  Everything was well-seasoned and cooked perfectly.  The mac & cheese wasn't as good as grandma's - but it as close as you can get in a restaurant! 

2 of the folks at my table ordered dessert, so I got to try a bite of each.  First the pecan pie - I would not order this. It is nothing like grandma's - too much mushy filling and not enough pecans. Disappointing... it seemed to be \"commercial grade pie\" rather than \"home-made pie\" in my opinion.  

Next up was the peach cobbler - our server really talked this one up, but again, it fell short of my expectations. It was better than the pecan pie, but not as flavorful as I had hoped.  (Maybe they can do a better job on this when fresh peaches are available?)  In any case, next time I'll just have to order my own dessert and of course, it will be the banana pudding.

All in all, this place serves up good honest food - nothing fancy - but just yummy.  I really wish there were places like this closer to my neighborhood!"}
{"text":"The food I ordered was decent. My experience would have been better had I been allowed to change my order when I asked. I didn't realize upon placing my order quickly that a better entree was on the menu. I placed my order and within two minutes asked to change it. I was told \"your food is already made.....accompanied with a blank stare from the hostess/server\". This in my opinion is poor customer service."}
{"text":"Ended up here as Cracker Barrel was full. I had initially stopped here several times for take out. The breakfast was incredible.  I had a meat omelet and the best team ever. Cheesecake was definitely the best I have had in a wow. Please stop by and eat as you will not be disappointed.  May start to eat here more often.
."}
{"text":"I've only been here a couple of times but always enjoy.  Breakfast is simple and good.  I did venture for lunch recently and to my surprise had a very good experience.  I was wanting seafood and they offered many choices like fresh Mahi Mahi.  But after perusing the menu I found it difficult to choose.  Jumped on meatloaf with sides of Mac cheese and collards. Service was attentive a at all times and everyone was friendly.  Mac and cheese was made from scratch, as well as the meatloaf.  All of it was what I would have expected but the cooks need to learn to cook from the heart and increase flavor.  All of the food was just missing something; it was not poor quality but just the three stars I gave them.  I will definitely return but with a bit lower expectations."}
{"text":"The restaurant was recommended by the hotel staff on Mainstay. We looked it up on Yelp and the reviews were good. There were 5 of us in the party, and Michelle (Alisha) was our server. She was great. We dint have to wait to order. She was there taking it as soon as we knew what he wanted. Our cups weren't empty before it was being filled again. The food was delicious and plenteous. Between the party we ordered chicken tenders and fries, chicken Caesar salad, gyro pita and fries/onion rings, and hickory now burger and fries. I've never seen a salad with so much chicken. We were all very pleased with tv speed of getting our food too, because we ended up getting there later than we like eating. 
All in all, reasonably priced and good food. Friendly service as well."}
{"text":"Went for a real breakfast. We went on a Friday morning and were seated right away. I had eggs over easy sausage patties and potatoes. I don't usually clean my plate but I did on Friday. Today I went for lunch once again the food was good. I didn't clean my plate but took my left overs with me. This will be a regular spot for me. The staff is friendly and the service is fast."}
{"text":"I drive past this restaurant like 3 times a week so it was finally time to stop in and give it a try! I am so glad I did! From the moment I entered he restaurant it felt so homey and familiar, which is amazing for never being there. It reminded me of the small restaurants I had in my hometown in Pennsylvania. Our waitress was named Tia and she was so wonderful. She was kind, friendly and had the biggest smile on her face every time she visited our table. Their menu is very expansive and great for home cooked food! But they have so many other things like pasta, gyros, burgers and wraps! Their prices are really decent as well and you get a lot of food! I love the style of French fries they have (those breaded crispy ones)! I would definitely come back here again and again!"}
{"text":"We decided to try this place after seeing it a few times. It was a former Bob Evans, and sometimes when places move into an ex chain, it can be bad or good. The menu is HUGE! Theres something for everyone and at decent prices. I had the open faced turkey w/ mashed potatoes, and mac and cheese. The turkeyw as thick and so juicy, really good yellow gravy and mashed. The mac and cheese is home made, but wasnt as awesome as id hoped. It isnt bad though! My fiancee had the bbq chicken and she got 2 massive pieces with fries. Service was good, food came quick, and i cant complain."}
{"text":"I came in from out of town tired of the same chain places. I stopped by Cafe south and was highly impressed. The food was fresh and home cooked. This is a local family owned place and I feel amazing about being able to support a local place. I would tell anyone in the area to come eat here and support a local establishment. The food was amazing and the service was as well."}
{"text":"Would not have thought that the food in this place would be exceptional, since it has a Bob evns atmosphere to it, but the prime rib and BBQ shrimp was pretty good as were the pickled beets.  Dana got the Arnold Palmer recipe just right and was a great waitress.  Took very good care of me.  I would go back for sure, especially since I did not leave room for the hot fudge lava cake. Yumm!"}
{"text":"Nice place and the owner and staff are super nice. The seafood is fresh and delicious. Fried chicken is great. Not a fan of the desserts but everything else is delicious. I usually get a shrimp plate when my husband and I go here. It is fresh, crisp and reasonably priced."}
{"text":"Meh. I don't know how they have their 4 star rating here on Yelp. It is a bit of a sad place. A bit run down (like the outside appearance), and a bit icky. 

My main tip is they don't serve breakfast all day. Total bummer.

The menu is rather large but the food isn't that good. I got the fried chicken, mashed potatoes, and grilled vegetables. The chicken was ok. Fried well, but dry and not special by any means. The mashed potatoes were under seasoned and cold with very little gravy. The veggies were gross. First off, they were frozen.  Come on, frozen veggies?? And \"grilled\" is a stretch. You can't fix frozen veggies. 

We also got the chicken parmesan, kids spaghetti, side of Mac and cheese, side of fruit, and banana pudding. 
The pasta dishes were acceptable. The Mac and cheese was good-although dry, and the fruit was oranges and cantaloupe. 

Bottom line, for $55 plus tip, it wasn't worth it. We have fond several really great places to eat here while on vacation and this was our first flop. We wouldn't go back."}
{"text":"Let me state right up front there's nothing really shout-worthy going on here, IMO.  But, it is a solid, Greek-owned family restaurant that has the basics down pat.  Southern cooking and charm, all tucked into a refurbished Bob Evan's shell.    Ample parking, good seating, fast and friendly service, good food, and a great location.  I even was introduced to Mary, even though my server was Shay who did a great job, too!  Bottomless coffee until I said no (the coffee was just OK).

So why not 5 stars?  Because they focus on good--not great--southern-style fare.  Want your biscuits and gravy?  They got 'em (although Midnite Diner rocks this one, they came close).  Want grits with your livermush?  Sure (although Candyce B. thinks Flying Biscuit has their grits beat--I agree).  Pancakes?  Yes.  Three egg omelets?  Yup.  Cafe South has a good thing going here, and I doubt they are interested in tweaking it too much.  I will save my last star for those rare places in this crowded space truly reaching for it with remarkable, \"OMG you gotta try their take on .... \" kind of fare.  But, I'll be back!"}
{"text":"Fantastic southern food with large portions. I got the country fried steak and it was amazing. If you are in the mood for some comfort food, it is worth the stop."}
{"text":"Located in a former Bob Evans building, this family restaurant has great made to order options for breakfast, lunch and dinner.  Their daily specials are on a chalk board near the register, as you enter.  The staff all friendly, but Kim my server, was especially attentive and kept my iced tea filled.  I ordered catfish, hash browns, scrambled egg whites and toast. Everything was hot and fresh. Was fighting a cold this morning and wanted comfort food. It hit the spot. If in this area would definitely eat here again, as I saw some specials and menu items I'd like to sample."}
{"text":"Came in early on a Saturday morning. The staff was very night and the food was delicious. I had ordered my eggs over easy and when it came out it was overcooked. I didn't complain, but the chef felt bad and sent out a replace egg a little while later. Excellent service."}
{"text":"I went there today for lunch with two friends.
The place was busy but no packed. We had to wait a little to be seated.
Our waitress came and asked about our drinks and came back after a while to get the order. 
I had grilled beef tips with green beans, being very honest I wasn't expecting much but I was surprised how the meat was perfectly cooked. I have been to known steakhouses that couldn't get their steak together and Cafe South really impressed me. 
One of my friends got a Pita burger and the other one steak with fried veggies. We all enjoyed our food that took a little to get done but the waitress kept us informed all the way and was very nice.
I wish they had more servers for lunch time, I had to rush back to work because took a while for my food to get done. I also asked for rolls and she brought me corn bread. 
Overall it was a good experience but they need to improve the prep time.
Unfortunately I didn't not take pictures this time because I was really hungry !!!!"}
{"text":"A-OK perfectly describes our lunch visit to Cafe South today.  I would not go out of my way to eat here, but we will probably return for the occasional lunch of meat, tea and two for a reasonable price.   We also thought that breakfast is probably really good here, so we may have to blow off work one morning to try it.  

Located just off of Arrowood near the 77 exits (previously a Bob Evans), the signage made it easy for my co-pilot to spot.  Parking was fine.  If you need to get back to 77, you will need to make a u-turn at the light after exiting the parking lot onto Arrowood, or exit through the back of the parking lot and drive between the hotels to get to the stoplight.  

Arriving at 11:30, a little before the lunch crowd which seemed to all be regulars, we were quickly seated by the smiling hostess and then immediately greeted by our friendly waitress who took our drink order.  Service was 5-star - our drinks were kept filled and food was quickly brought as it popped up at the pass.  

The lunch: We ordered the spinach artichoke dip as an appetizer.   I ordered the country fried steak, white gravy on the side, with sides of collard greens and mac and cheese.  When asked if we wanted dinner rolls or corn bread, we simultaneously said \"corn bread!\".  

Spinach artichoke dip:  Served hot with tortilla chips.  Standard dip, nothing fancy or odd.  Was creamy and tasty with plenty of spinach.  
Country fried steak + gravy:  Instead of one large piece of meat that takes up the plate and is difficult to slice, my serving was two medium sized pieces of meat (a little larger than a Wendy's burger patty). The meat was tender and the fried coating stayed on the steak when cutting.  The gravy was a little bland, but nothing the salt and pepper shaker couldn't help.  (I find diner type restaurants typically are on the bland side of seasonings - you can always add salt and/or pepper to suit your taste, no big).
Collards - the first few bites were okay, again not a lot of seasoning, the last few bites were a little bitter.
Mac and cheese - sort of like homemade, but again on the under-flavored side.  It was fine.
Cornbread - yummy!  It is cake-like in consistency and sweet.  Good with a swipe of butter.

The dessert case looked amazing, with different kinds of cakes, pies and baklava, but I was way too full from lunch to even consider it.  Fast, friendly and priced right, this is a neat little diner."}
{"text":"Put some south in your mouth at Cafe South.  After dropping off a colleague in Charlotte, NC (and before a long drive to Charleston, SC), I decided to pop in here in search of a hearty meal before hitting the road.  The menu is chock full of Southern comfort food items.  I opted for the chopped BBQ pork plate with choice of two \"vegetables\", which could include things like mac and cheese or mashed potatoes (both of which I ordered.)  Hush puppies come with any plate meal, but can be swapped for cornbread or biscuit.  The pork was quite good, not overly smoky or with too much sauce.  Mac and cheese was very tasty, with a good creamy texture and browning on top.  Was less enthused with the mashed potatoes, which tasted reminiscent of instant spuds from a box.  After dinner, I ordered the caramel apple pie.  Rather than a traditional pie crust, it had one made of buttery shortbread.  It was delicious and just the right serving size.

Service was very congenial, stopping often to chat for a minute.  Cafe South is just a solid, good 'ol Southern-style diner."}
{"text":"As we approached the restaurant, we saw them cleaning inside the window ledges. Always a good sign.  Fast and friendly service. My wife had the grilled chicken tips and I had meatloaf. Both were great and cornbread is sweet."}
{"text":"Numerous positive Yelp reviews led us to walk over here from our nearby hotel for dinner. We were seated promptly in a booth and immediately could tell the building previously housed a Bob Evans, with the exact same lay out of tables, booths and counter I've seen many times before.

Hungry from driving all day, we looked over their lengthy southern comfort food menu. Indecisive over so many mouth-watering options, I finally decided on one of my faves, hot open-face turkey sandwich with mashed potatoes and gravy. When our waitress came back and looked at my quickly disappearing meal she said, \"I'm not even going to ask you how your meal is...you should slow down and taste it.\" Yeah, it was pretty darn good, just like her sense of humor.

With a convenient location (right off I-77), wonderful food, affordable pricing and great service, I completely concur with all the other positive reviews. If you find yourself in the area and hungry for some tasty southern dining, find Cafe South and enjoy."}
{"text":"Stopped here on our way further south on a Wednesday evening. Were seated right away and our server was very friendly. Lots of items to choose from and our meal was excellent and reasonable priced. If ever coming this way again, we'd definitely stop here again"}
{"text":"I feel generous and bad for giving this place 2 stars. I know that's confusing.... Why? Service was excellent.... Our Server was full of energy and super friendly and competent. That wasn't the problem.... 

The food was! Though it wasn't God awful,  it was average at best. The fried green tomatoes were over breaded big time.... Couldn't taste the tomatoes.... And they were bland. 

Country style steak was bland and unevenly cooked. Definitely a lack of salt and seasoning. 

Hummus was ok, and my friends chicken was ok. 

Again our Server was a Sweetheart.... But that by itself doesn't save this place from Blando Hell. 

Not recommended!"}
{"text":"Our waitress Dana was awesome for starters! We were seated almost immediately and this was on a Sunday after church. A good crowd was already seated.

The food was good. I had one of the many \"specials of the day\", which was stuffed flounder over rice (brown rice was available upon request & fish was stuffed with crab) and it came with two extra sides. I opted for the \"huge\" baked sweet potato and their mac and cheese. On top of this my entree also came with hushpuppies. Purely impossible to fit all of that in my stomach,  so needless to say...most of it came home with me.

My husband had the country fried steak with mac and cheese and collard greens. Collards weren't like \"home collards\" but he did finish it. It did the job and was seasoned. Mac and cheese was good, again not like home, mine or my mom's! My fish was good and hubs chicken fried steak was good (according to him). The corn bread was warm & soft. The fried chicken our Uncle had looked and smelled delicious along with some of the other guests at the table.

We will definitely return and hope to get Dana again. She definitely added to the experience and rating. Very sweet, attentive & on point :)"}
{"text":"One evening when there were horrendous thunderstorms and the traffic was dreadful, I stopped here to grab dinner and kill some time. It is a former Bob Evans and the lobby is not so inviting. There are business cards all over the place and the check-in area could use a refresh. Similarly, the bathroom was rough around the edges. I am pretty sure there were blood stains on the walls.

Anyway, the food was decent. The meatloaf was quite tasty but the yams had a funny metallic taste, almost as if they came out of a can. My server was really nice but I do not recall his name.

Anyway, this is a convenient, cheap southern diner. It is nothing you would go out of your for by any means, but would be good for a quick, inexpensive lunch. If the lobby area and restrooms were touched up, it would probably have left a better impression."}
{"text":"Went here for breakfast for the first time and had a really good meal. Our server was a little \"spaced out\" and kept spilling things, knocking over things. etc. but we were her only table at the time. She was very friendly, just a cluster...the restaurant is very clean, looks brand new, the staff is friendly, the food is good, and the prices are right. The breakfast menu has several different options to choose from. The Hobo breakfast was delicious as was the omelet we ordered.

Some advice for the owners:

Get real pancake syrup dispensers-slapping down a bottle of Aunt Jemima's on the table is pretty tacky.

Get a better pancake recipe. The pancakes are super flat, dry, and over cooked. I know this not ihop, but I can make better pancakes than the ones we were served."}
{"text":"What a great breakfast or meat and 2 location. Was touring in Charlotte and this place happened to be across the street from the hotel. Decided to give it a shot for breakfast based on Yelp reviews and will certainly return on my many trips up here.

Nice little Greek diner setup with amazingly inexpensive prices. Large portions. Tried the catfish and eggs for breakfast and absolutely loved the light and flaky batter on the fish. Almost no oil. The scrambled eggs were a bit dry, but the bacon, english muffins, creamy grits, and home fries were all absolutely delicious.

Saw the Baklava and pies / cakes in the cooler as we were leaving and it looked absolutely divine.

Service here was spot on, very friendly, and attentive. Good stuff!"}
{"text":"This has been our favorite restaurant to come to during our stay in Charlotte, NC! I've had the Chicken Gyro (fantastic, the chicken was so flavorful) the Flounder Fish Sandwich (came plain, ask for lettuce & tomato) the Spinach Omelette (so tasty) the Breakfast Special! The service is friendly & quick! It reminds me of a Marie Calendars restaurant. There are delicious looking deserts in the display, but I've always been too full to try them. I also saw little 4 packs of wine bottles which I'm guessing you can get to go, especially if you are staying at one of the hotels near here. The grits are soooo good! You have to try this place if you haven't been here before! I bet you will like it too!"}
{"text":"Well worth seek out.  Easy to get to off I77.   Lots of menu choices.   Attentive waitstaff are happy to coach a Yankee to make good choices. The peach cobbler is a spectacular finish-save room."}
{"text":"A family owned business with exceptional customer service & wait staff. Not to mention the only Resturant  open during the winter blast in February 2014..thanks for feeding us when no one else would!"}
{"text":"This is becoming my \"go to\" breakfast cafe when I am traveling Interstate 77. The hostess and waitresses are friendly and I have found the service to be quick. 

Breakfast is authentic southern with biscuits and gravy, the hobo breakfast and grits featured. The omelettes are tasty and my kids have tried every type of pancake.

Portions are generous. Twice, a breakfast eaten around 9 am has carried me through the drive to central Ohio. I will be stopping back my next time through. Maybe for dinner?"}
{"text":"A good breakfast at a very nice price. The eggs, bacon and sausage were good. The hobo breakfast suffers from bland gravy and lackluster home fries. Another negative is the artificial butter spread provided at table. The coffee was very good though."}
{"text":"The price was good and that was nice. The staff were good and made sure we were happy. The food is average and I can tell you why I say this. Breakfast is not hard but and what I had was good, but the lack of \"FRESH\" kind of set me off. The Biscuits are from a can and you can tell. They taste like it. It's not hard to make biscuits. Probably one of the simplest things to make but I can make canned pillsbury biscuits at home. I go out to have things I can't make at home with ease. There are other canned items on the menu like the mushrooms and other veggies. When I asked the owner about the biscuits he said it was for \"constancy\" purposes.  The grits were good but they had been sitting for a while and had the \"Grit Skin\" on them. Still pretty tasty.


Rule one of a restaurant is if you can get it local and fresh you do. Stop ordering everything from the back of a SISCO truck. Overall not bad but I don't see me going back there anytime soon. Nothing really awesome to write home about.

I think there is tons of room for improvement. The place is clean and in good shape now the food needs to match the offering. You can't have \"HOME COOKED MEALS\" on the sign and get biscuits from an can and using canned veggies...that is not \"HOME COOKED\""}
{"text":"I happened to be on a pretty jam pack business trip to Charlotte, North Carolina lived right next to this traditional southern food beauty. We were recommended this place by the hotel staff we lived at, we happened to reach there half hour before closing but that did not change their attitude towards us. The waitress was simply outstanding, so were the chefs cause the food looked and tasted delicious. The chicken was crisp tender and everything you say about a perfectly cooked golden fried chicken. My friend ordered Country Style Steak, I am not a beef eater but he said that it was probably the best steak he had ever eaten. He went there the next day too! 
Food was perfect service was great. All in all a must visit for anyone going to Charlotte."}
{"text":"So we saw the reviews and thought we would try it out so glad we did! The waitress was kind and punctual. The food came out 10 minutes or less after the order!! The Mac 'n Cheese was possibly the best I've ever had. Reasonably priced and amazing fresh quality! Was too full for the banana pudding. Next time ;)"}
{"text":"This is a great restaurant for good home cooking. My husband and I like to eat here on evenings when I just don't fee like cooking. I usually get the chicken pita plate, and it is excellent. The chicken is juicy and flavorful, the tsaziki is homemade, and the salad is fresh. I definitely recommend trying this place out!"}
{"text":"Just plain out pricey for no apparent reason. The breakfast special, which is not so special will cost $5.95 and Lord forbid you want cheese, this will set you back another .95 cents. We order delivery daily for another restaurant and these people are less than 2 minutes from our company but they refuse to deliver unless we have a $25 order. It's fine because the food isn't really that tasty and the host/cashiers are always rude. So, thanks for saving us money."}
{"text":"not sure about the food, but who ever the girl is that answers the phone can be a little friendlier and less attitude."}
{"text":"Friendly atmosphere, attentive staff... The chicken and rice soup of the day was superstar!  The peach cobbler was very gelatinous and the bread part was just a blueberry pancake, so I wasn't super impressed by my dessert choice.  I've got my eye on the banana pudding and the stuffed flounder, though.  Lucky for me, I'm staying at the Hyatt, which is just a few steps away!"}
{"text":"I very much enjoyed my dinner at Cafe South. I was staying at a nearby hotel without transportation. I did not feel like cabbing or Ubering (is that word in the dictionary yet?) so I decided to give it a try.

I found the food to be very good and the service prompt and friendly. I had a gyro pita platter which included a serving of moist, tender gyro meat with tzadziki sauce. I am watching my carbs so I substituted grilled veggies for fries. They weren't anything really special but they weren't bad at all. The side salad that came with it was served on the same plate as the gyro meat. I would have rather had it on a separate plate but that's just me. Very minor. The salad was fresh and tasty. Nothing exceptional, but good (the tomato could have been prettier).

The service was great. Very nice server and, again, very prompt. I was in and out in a jiffy. All-in-all, a very enjoyable meal. So much so that I am planning to return in the morning for breakfast."}
{"text":"Yes!!!! I lucked out and found another awesome diner!! Again I love places like this it seems to have an at home  nostalgic feeling. I ordered a vegetable plate and was very satisfied . The prices are very reasonable. The staff is very welcoming and friendly I will definitely be back!!!"}
{"text":"Perfect service and great home cooking. May be the best fried chicken I have had this year. Not fancy at all,  but clean and fast. My salad came with my tea and the server checked with the kitchen to see if they had white or dark meat chicken hot and ready so I would know which to order if I did not want to wait the 20 minutes for a fresh batch.  

I am in town on business and could not stomach another bag meal. Give it a chance. You will not be disappointed."}
{"text":"I am a regular for breakfast and brunch at Cafe South. They have a great staff and really good food. The prices are creeping up but still offer a good value on most items. I definitely want to try their dinner menu!"}
{"text":"First of all let me start by saying, the prices are amazing! Food was great, hospitality... THE BEST. We had this wonderful waitress named Mary, she was a doll, super friendly, patient and exceeded our expectations, by far the best service, food and prices. I go every chance I get since I live a bit far."}
{"text":"I have been here for several meetings with no issues until last week.  As a result I will not be eating here again.  Despite the fact my group has the meeting."}
{"text":"I saw many other positive yelp reviews and thought I would try it. I love country fried steak so I ordered  that. It was excellent. Very tender. Gravy was good also. I got the fried squash and the mac and cheese. The mac and cheese was very good as well. The squash were ok not terrific. There were many other items on the menu that I would like to try. I am absolutely going back."}
{"text":"There is an expression that I've used from time-to-time, \"So good it'll make your tongue slap your teeth out!\" and that definitely applies here!!!  Most restaurants that have a menu as busy as theirs is not very good at anything by default, but here is the exception, folks...they are good at EVERYTHING.  I have sampled many different dishes on different days and thus far I have yet to be disappointed.  My absolute favorites to pinpoint are the Meatloaf w/ red sauce, fried squash, and their Corn Bread (which tastes so good it should be on the dessert menu)."}
{"text":"I really enjoyed the food and the service at this location. Was at the front lobby just stopping in to take a look at the menu and one of the Friendliest employee ever. She was very informative and extremely happy for me to be in the area. Just from that alone, I sat down ate all of her recommendations. Awesome place to spend your afternoon."}
{"text":"The place looked nice. Food & service were good. Breakfast was reasonably priced but $2.25 for coffee seems a bit steep."}
{"text":"I wanted one last 'local' meal before heading back to Portland after being in Charlotte on business.  I looked to Yelp as I often do for a highly rated, local place. I am also trying to get my parents out of their chain restaurant rut.  Cafe South fit the bill.

Being the middle of the afternoon we were seated immediately.  Mom ordered a chicken quasadilla; the portion was more than she could eat in a sitting & the chicken tasted fresh grilled (as opposed to cooked, frozen, thawed & served).  Dad got a burger; he's not a man of many words but commented 3 times how good it was.  

I ordered the crab cakes which came with 3 hush puppies and choice of 2 sides. From the long list of side options I picked mac & cheese and a sweet potato (which the sound of which I was drooling over).  The crab cakes were perfectly seasoned, the onion batter hush puppies (which I prefer to corn bread HP's) and the mac & cheese was perfect. 

My one complaint, why I gave 4 and not 5 stars: When our food was brought to our table the waitress at that time informed me that they were out of sweet potatoes, causing me to have to order another side.  I was disappointed that I was not made aware of this when I placed my order or prior to it being delivered to the table.  The waitress- who was kind, friendly & funny- did not bring a menu back.  Since I could only recall a few, I selected sweet potato fries instead, which I had forgotten were $1 extra (the only side, I will mention that had a surcharge).  One would think since they ran out of my 1st choice they would have offered the fires without the surcharge but I was charged it anyway.

If you are traveling I77 through south Charlotte and need a break & good food this is your place.  Good, quality food at a good price without the boredom of a chain.

PS-- Not being aware the building formerly housed a Bob Evans, my father actually commented it looked like one. lol"}
{"text":"A Great Find

As part of building our new Carolina home we had an appointment in this neighborhood after lunch, so we chose to try this well rated restaurant. We were very pleased with everything, especially the diverse menu and the friendly service. Everything was delicious.
We plan on many returns with and without the grandkids."}
{"text":"Fantastic breakfast and lunch meals. Wonderful service every time. I've eaten hear 30+ times and breakfast for $4 can't be beat. Try getting that at Starbux. Lunch is a bit pricey (I think) but fresh and served promptly."}
{"text":"Nice place. The food was, well dinner food. Not amazing, but good and filling. What one would expect from a nice little dinner. The staff is super nice and inviting, my server Marabe made my experience all the more enjoyable. She was sweet, attentive, and helpful. I only came here while I waited to meet with someone and I'm glad I came in. The only. Complaint was my open face sandwich came with a slice of cranberry sauce that had probably been exposed to air a little/awhile too long. Other then that my experience was good. The Caramel apple granny was so good, glad I saved room for dessert."}
{"text":"The food was very good and the service was just excellent. The staff was super nice and made sure to keep checking on me. This is as solid a breakfast place as you are going to find in Charlotte."}
{"text":"We happened upon this place because we were staying in a hotel across the street which I had a \"continental\" breakfast which wasn't worth fooling with.  It is obvious that this was a Bob Evans in a previous life.  The waitresses were all very friendly and happy to serve.  It was a good homecooked meal and contrary to what another reviewer said, we had homemade biscuits.  I know canned biscuits and these were not.  I asked for a small (condiment size) bowl of their sausage gravy to go with my eggs and hash browns and was not charged.  I can't say the gravy was the best I'd ever had but everyone has their own recipe.  I'm willing to give them a pass on that.  If I stay in that area again on my next trip to Charlotte, I will return to this restaurant."}
{"text":"Absolutely awesome experience! The food was delectable, the portions were huge and our server Mary was fantastic! 

We will definitely be back! :)"}
{"text":"Good spot to grab some grub. Pretty typical diner food. I had the fried chicken and it was good. Husband had the grilled catfish sandwich and that was nice too. 
Our service was a little off. She might have been new and going through the usual kinks. 

Food was good. Pies are overpriced."}
{"text":"The waitress  we had was fantastic. Recommended the loaded fries and wings both were great.  Everyone enjoyed their food. Definitely recommend stopping in with the family.   We had a large group and the waitress didn't miss a beat."}
{"text":"The hobo breakfast and that gravy they put on top is out of this world...strong enough to cure the worst of all hangovers...banana pudding is off the chain...fries are whatever, onion rings are good,  shrimp on a stick is good but pricey, and the steak and cheese is really good. 

Overall it's a great establishment, good music, but a lil pricey."}
{"text":"Very delicious food and friendly staff! I definitely recommend checking them out if you're in the area.  I normally get the baked chicken which is always great.  The \"Thanksgiving Dinner\" is awesome too."}
{"text":"This place was convenient to our work location while on business for 2 weeks.  We made 3 lunch visits here.  
Visit 1
fried pickles to share-4
me-chicken salad sandwich with chicken rice soup.   chicken salad sandwich-3 chicken and rice soup 4
person 2-Grilled chicken salad-5
person 3-salad and fries-no rating because not sure how they were.  
Visit 2
me-grilled chicken salad-5 and chicken rice soup 4
person 2-grilled chicken salad  5 and chicken rice soup 4
Visit 3
me 
turkey club and fries-2   
chicen noodle soup 2 
person 2 
turkey wrap 2
chicken noodle soup 2

Service was always fast and good.  And they always offer to give you a soda refill in a to go cup when you pay.  
Day 3 we went back for chickn pot pie but they only have it on Wed!"}
{"text":"It was a Friday morning.  I was hungry, and wanted a break from the norm, so I pulled in to the relatively new Cafe' South on Arrowwood Rd.  

You walk in, and it looks like a clean all night diner, but the place is not open all night (Which is ok with me). A few random nick knacks on the wall, and a simple open floor plan.   There is a counter at which you can eat that overlooks the kitchen through viewing / serving windows.

When the hostess sat me, she instantly asked what I wanted to drink, and had it to me before I was able to look through the first page of the menu. 

Speaking of the menu, I was looking for a \"house specialty\"  on the menu but really nothing was blocked off or bolded as to make me think that they had one.  The menu (breakfast) was filled with standard breakfast fare.  Eggs, Omelets,  Breakfast Meats, and Pancakes.  

The silverware rolled in a clean napkin was also clean.

The service was fast and courteous, tho there were only 3 other tables, so i can not vouch for if they get busy.

So far so good.

I ordered the Sausage & Cheese Omelet, Hash Browns and a Biscuit.   Seems simple enough to me.  

Over all the food was not bad....

The Omelet:  The omelet was a bit over cooked for my taste (I know different people like it different ways)  The sausage was spread around in the omelet well, but the first few bites made me wonder if i had ordered cheese.  The second half of the omelet was were all the cheese was.  The omelet as a whole was a bit bland.  Not much flavor in it at all.  I was actually reaching for the salt, Which i never do.    If you like your omelets a bit fluffy and not dry and flat, i would vote you stay away.

The Hash Browns:  The hash browns were out of a box.  Not much different between these and Waffle House hash browns.  They were cooked again with no seasoning at all, just browned up on the flat top.  Once again I reached for the salt and pepper (to be fair, i do use pepper a fair amount)

The Biscuit:  Ahhh.  The glue of a good breakfast.   Being raised in NC i love me a good biscuit.  When it arrived alone in its little basket it looked super tasty.  Big, Fluffy and Golden Buttery Brown.  This is where the fantasy ended.  Again, the biscuit was bland, tho it looked as if it was baked fresh there, it tasted like there was a box somewhere in its life.  The middle was not fluffy like i had hoped and dreamed, but more dense and a bit heavy.  Kind of a sad ending to a mediocre meal."}
{"text":"Great place to eat! It was right across from the hotel we stayed in! The food was excellent and very reasonable! I will definitely be going back!"}
{"text":"Forgettable Salmon and Raspberry Vinaigrette Salad. The Salmon was completely not pink. I don't spend a lot of time in Charlotte, so I don't know if that's par for the course. There were more staff than patrons at the restaurant, which I attribute to the apparent recent opening ."}
{"text":"This has become one of our favorite spots! Especially for breakfast. The grits need NOTHING......NOTHING! I've never  been able to eat restaurant grits without doctoring them up but Cafe South's font need anything! And ask for Keyonka's section....she always takes great care of us!"}
{"text":"Stopped in with the family on a rainy evening.  Once inside was greeted right away and had the opportunity to enjoy some fantastic offerings.  Freshness and quality was great.  Some of the items enjoyed by the family included fried pickles, meatloaf, blackened tuna, steak, fried okra, grilled vegetables.  Was a bit disappointed with the mashed potatoes and the salmon cakes.  Dessert was fantastic with a warmed apple pie in a shortbread crust topped with vanilla ice cream and the banana pudding."}
{"text":"This place is as authentically southern as you can get. If you can get the veggie side plate and still give a place 5 stars then you know its delicious!! I had fried okra (not too greasy, still crispy in the center), the mac and cheese (not Krafty at all), 'naner puddin' and green beans (not too buttery but flavorful). My husband had the gyro - random but he said it was seasoned perfectly. 
I could not say more of the service. Our waitress was so attentive and was constantly filling our glasses, asking how our dinner was, and just checking in. I wish that this place was close to me, or rather I don't, because I would have a sluggish arterial pathway and a bounty of fluff around the thighs ;) 5 star service, 5 star foodie find!!!"}
{"text":"Good breakfast and pretty good service. The meat lovers omelette was large and disappeared from my plate.  So that's a good sign."}
{"text":"American style, food.  Laid back environment.  Don't let the quaint set up fool you! The service was excellent! I've been in Charlotte a week and this, by far, had the best service.  Prices were great.  Portions, huge! I'll definitely be visiting again for quick eats when I'm up."}
{"text":"I am a sucker for Thanksgiving dinner all year round except around the 4th Thursday in November. Being from Jersey, diners are life up there so this one was ok. The food was hot and the mac and cheese was not that greasy. Great service, rolls are terrible, but the stuffing or dressing for you southerners was excellent. Id go back."}
{"text":"Great country fried steak, mac & cheese, iced tea. The cornbread and mashed potatoes & gravy were good as well. Server was friendly and quick. Would like to return."}
{"text":"The chicken was suspect in my greek salad., it was old & rubbery.  Also there were bugs crawling in the dining room and when the waitress was notified of the bugs she said you cant do anything about them. Makes you wonder whats crawling in the kitchen. I will not be returning."}
{"text":"My grandmother and I stop here all the time on our way through Charlotte. It's nothing fancy but it's a delicious place. The fried pickles are the best I've ever had and I've never had a bad experience. It's literally a diamond in the rough for good food"}
{"text":"Southern Breakfast at an Affordable Price.

I came here with a group of six, during the Morning Shift of Sunday, and the food about if anything slightly above average for some breakfast and it came out quickly. Clean area, and a fair price for the food that you get. The only note is that the food could be plated more elegantly, but that is just being picky at the least. I would come here again if I'm in the area."}
{"text":"For years I would pass by the building and think what a great place for a restaurant.  Well, not only a great place but a great restaurant.  This has become my go to breakfast place.  Clean, friendly and the best breakfast in Charlotte.  Don't miss the Hobo breakfast or the pancakes."}
{"text":"Good hardy home-cooked food. the atmosphere is non descripted but good food for business traveler. Very friendly staff"}
{"text":"I've been back to Cafe South a few times.  The last two times I had the same server and she is the reason why they lose a star from me.  

If you get a server named Lee, be patient with her.  She's not the the best.  She's very friendly as all of the people working here are but the service just suffers.   In my first experience with her, she wasn't busy but would rather stand behind the counter than to refill my drink. When i ordered meatloaf, she also didn't ask me if I wanted the brown or red sauce and just gave the brown sauce.  

The 2nd time Lee was my server, it was crazy busy in the restaurant but the same mistakes were made.  She even had help with her other tables and at ours drinks went unfilled and when she did, she filled tea glasses with the wrong thing.  Sweet went in the unsweet glass and unsweet went in the sweet glass.  Also we didn't get our cornbread until we were almost finished eating.  

Foodwise, this place rocks.  The meatloaf is my favorite.  The cornbread is the best I've tasted at a restaurant and the banana pudding is awesome. 

Everyone is very friendly here and you get plenty for your money here.  Just watch out for Lee."}
{"text":"Delicious food, great choices, and wonderful staff! 5/5 stars"}
{"text":"Cafe South is essentially a diner. Take it for what it is. If you are looking for something gourmet, this is not your spot. If you are looking for reasonable prices and comfort food, definitely try it out. 

The restaurant is clean, comfortable, and inviting. I have been here several times for both breakfast and dinner, and I have not been disappointed. I was there most recently for breakfast and had the hobo breakfast, which is hash browns, green peppers, onions, and bacon topped with two eggs and gravy. It also came with a biscuit. It came out quickly, and the eggs were poached exactly as I had requested them. The biscuit was fluffy and light and was not greasy. I also tried my friend's grits and wished I had more room to help her finish them, but the hobo had filled me up. Service was prompt, and our coffee and water were filled continuously. Everyone in our group of 7 was satisfied. Cafe South is definitely worth a try if you are in the area and looking for something quick and familiar."}
{"text":"Literally stumbled into this gem while staying next door at the Hyatt place.  Needed relief from \"diet food\" I've been good but felt I needed a break.  This place serves real food with genuine sincerity.  It's a must try.  Yes, I went deep (fried chicken, mmmmm) but since my stomach shrunk, I believe I didn't do much damage. LOL.  Thank you Cafe South for saving me from powdered eggs and fast food!"}
{"text":"Every time I come to town, I come and eat here everyday I am here! The bacon is always perfect,  eggs no matter how I have ordered them are made  expertly, the servers are polite without being pushy,  and the food arrives quickly. I couldn't ask for a better dining experience"}
{"text":"Very large menu.  Welcoming staff.  Excellent desserts. Reasonable cost. Much more attentive staff than chain restaurants. Tia was our waitress and did a great job!!"}
{"text":"The fried chicken was awesome fried to golden perfection an crispy . The fried squash I asked for it to be fried hard it was an again crispy. This is my new southern place to eat yum-o can't wait to go back the shrimp looks good. Right off arrowood an I-77 great location , if your looking for southern food look no further :)"}
{"text":"We visited 3 times during a 2 week business trip.  We had a rule of no repeats, but we were running out of options for a quick lunch by week 2 that wasn't fast food, and we also had a no fast food rule. The 1st time I had a chicken tender salad.  The chicken tenders were juicy and delicious.  I cant remember what my friend had, and the 3rd party probably had burger and fries because that is all she eats.  We also had fried pickle chips that were very crispy and tasty.  The 2nd trip I had delicious chicken and rice soup and club sandwich, I'm not sure what the other 2 had.  Really the only reason we returned the 3rd time was we saw the chicken pot pie on our 2nd trip and regretted not ordering it.  Unfortunately, we didn't know it was a Wed special and we returned on a Thursday.  We were very disappointed about that.  So I had a chicken club wrap which was very large and my friend had a club sandwich.  The 3rd party did not join us on that trip because preferred corndogs at the gas station.  The service is a little slow but I am sure its because the food is all made fresh.  I am still sad about the chicken pot pie!"}
{"text":"My favorite breakfast spot right now. Hobo plate please and thanks! Great customer service, their staff is awesome and the food is ready quick!"}
{"text":"Really decent breakfast and decent prices, the service was outstanding!  I definitely want to come back for lunch or dinner.  Our meals were ready quickly.  Nice diner type food place."}
{"text":"This is my favorite restaurant to go to to grab something to eat. The selections are large and the dessert is really really good. I usually  come here one a week for dinner."}
{"text":"Awesome Place!
Cafe South is my go to place for Saturday Brunch!
Discovered this place several months ago and won't go any place else when I want breakfast on the weekend.  The food always tastes great and is prepared correctly!  The staff are friendly and efficient and seem to enjoy their jobs!   If you are looking for a great breakfast place, give them a try!!   I'm going to have to go back for lunch or dinner!"}
{"text":"Good food, great service. We stopped for breakfast while traveling I77, a little trickier than some stops to get to but not hard and well worth it. A delicious change from fast food chains."}
{"text":"The Gyro was excellent, with very good tzatziki. Quick & courteous service. Second visit had even more tzatziki on the side for the crisp hot fries. Relocating to Charlotte and cannot wait to try everything else on the menu. If you want a good fresh meal that won't empty your wallet your visit here will be well worth it."}
{"text":"Love the breakfast here. Service is not quick but by NC standards not slow either. The food is great here. Been here three or four times now and always happy with my meal. The people with me were happy with their food. So that's a lot of happy people ! Oh and on a sat or sun don't come too late for breakfast or you'll be waiting for a table!"}
{"text":"Came here when I was staying at the Hyatt nearby.  The prices are reasonable, and the food is solid.  Sweet tea is a little too sweet IMO.  

Good place to grab a bite if you're staying at the hotel... or in the mood for some hearty, albeit, lackluster food.  I'm surprised at how well this place does business.  Came in pretty late but still had a fair amount of people eating.  Supreme Beef Tips is more the kitchen utilizing all the meat and saving on food costs!  

I won't go out of my way to eat here again, but if I'm at the hotel (for whatever reason in the future), then I'll def go by here.

dmo out."}
{"text":"I'm a breakfast girl and love good grits being primarily gluten free. The wait was quick, super service, and the value for the meal is excellent! Best grits I've ever had! Good and filling fare. Nothing fancy. Could do a bit better on the coffee."}
{"text":"I've been here a number of times in the past and was expecting the same experience during our most recent visit. We stopped in on a Sunday morning and we're greeted by staff. Our waitress was friendly, attentive, and personable. I have absolutely no complaints regarding the staff. My biggest complaint is with their prices. Breakfast spots are always known for cheaper prices so when our bill rang up to $30+, we were not pleased. We didn't mention it to management because it is what it is, but we won't go back and I wouldn't recommend it to anyone else. They don't offer many breakfast combos or platters, so you're forced to order pancakes separate from eggs and a side. I don't recall the name of my combo but I had two scrambled eggs, turkey sausage, grits, and pancakes. My turkey sausage was awfully dry and lacked flavor. The grits tasted good and it's pretty much impossible to mess up scrambled eggs so the meal was decent. NOT $15+ worth!! I ended up taking my pancakes to go but didn't have an appetite for them when I got home (probably because I kept thinking about how ridiculously overpriced they were) and they ended up in the garbage. I'd recommend that the owners reconsider their menu options and prices. Offer better breakfast platters and make their prices comparable to other restaurants that are similar in style. I wouldn't recommend trying this place knowing that there are other breakfast spots in the area that are better quality and more reasonably priced."}
{"text":"The parking lot wasn't very full when we pulled in at 6:30 on a Friday night, which was off-putting. Arriving inside to a nice country atmosphere, we were immediately sat in a booth. Our waitress, a delightful older southern lady, came right over and had our drinks out instantly. Our fried pickle app, which turned out crisp and tasty, came out pronto as well. While waiting for our food, my bf noticed there were a lot of people working. While it is a large establishment that can fit a large crowd, there clearly wasn't a need for so many servers.  Dinner came out quickly. My meatloaf was clearly not homemade and rather disappointing - scraped off the tomato sauce and went with ketchup instead. The piping hot green beans  were lacking seasoning, however, the homemade Mac n cheese was the clear stand out with vast, down-home flavor! My bf had the crab cake, which were melt-in-your-mouth delicious. In my bf's words \"they've got yum inside of them!\" He paired it with onion rings and fries which were equally delicious. Oh, I also forgot to mention the sweet tea - on point! The desserts, which were displayed near the entrance, all looked spectacular. We will definitely be returning."}
{"text":"I'm a fan. Me and my coworkers frequent this place for lunch. Friendly service, great food, decent prices."}
{"text":"Enjoyed a great sandwich combo here today with a good friend and we were very impressed! The service was great, the food was great, as was the atmosphere. The company we work for has relocated to this area and we're both delighted to discover this convenient restaurant. We are both convinced, Cafe South will be a favorite hot spot for lunch!"}
{"text":"4 years later I can always come here for some good food and excellent service! I have not tasted one single thing on the menu that hasn't been good. Eat here probably once a month and never disappoints. Right now I'm obsessed with the Ribeye Steak Sandwich....so good. The steak is perfectly seasoned and never dry. It has definitely become one of my go to restaurants in Charlotte."}
{"text":"I came here for breakfast on a Sunday.  The restaurant was pretty full, but there was no wait.  The waitress greeted me right away and was talkative and friendly.  She brought me a water and asked if there was anything else I wanted.

I ordered a basic breakfast: eggs, sausage, and grits.  Everything was ok.  My eggs were a little overdone and the sausage was average.  The grits were really good.  

They have an extensive menu for breakfast and lunch.  I would like to come back sometime to try lunch.  The prices are all very reasonable."}
{"text":"Wow what a nice breakfast find within walking distance of hotel just off the Hwy 77 on the outskirts of the Queen City of Charlotte NC! Talk about great down home Southern style cooking at its awesome best on a take it Easy Sunday Morning to boot, couldn't have planned it any better had I actually known the area I was staying in pre-NFL SNF game in Uptown Bank America Stadium. I even enjoyed the ribbing given by loyal Panther fans to the lone wolf make that Eagles fan wearing wrong teams (as in visitors) ballcap lol Gotta love it & would have done the same had it been in the City of Brotherly Love"}
{"text":"Been coming here for years, the food is close to hotels, the staff is very friendly and the food is very good. Cooked to order, foods always hot and they have a diverse menu. I am a Charlotte native and even though there are endless places to eat, Cafe South is always a favorite of mine."}
{"text":"This is a great find. They have such an extensive menu you are bound to find something for everyone in your group. I had the veg plate with mashed potatoes, fried okra and mac and cheese. The potatoes and okra were great however the mac and cheese left a lot to be desired. They were bland and very little cheesy flavor. My boyfriend had the candied yams as one of his sides and it was almost like dessert they were so good."}
{"text":"Just a killer breakfast.
Everything was perfect and the service was splendid."}
{"text":"Typical diner. Food and service was good and fairly cheap. Servers are always nice, food comes out quick and hot."}
{"text":"On the way to the city of Charlotte I love to go check out this great place. The food is amazing and the staff are good at providing great service. I'd recommend the Hobo Casserole it is my favorite there."}
{"text":"got the hobo breakfast!  It was wonderfully yummy.  will definitely be returning."}
{"text":"I graduated from culinary school and I've eaten all over the world. The food here is really flavorful. The service was quick and personable and everything is priced just right. I highly suggest you stop by if you're driving through or staying at one of the nearby hotels. Great food!"}
{"text":"Came in after debating a few times while driving by. Greeted and seated quickly and my server was at my table to greet me instantly. I order the country style steak. It was good. I was surprised because if it isn't like Cracker Barrel, I typically don't like it. I like theirs. The gravy was thick and delicious. I order a house salad which was good and fresh. I also ordered Mac and cheese for my side. Now, I'm pretty picky when it comes to Mac and cheese so it was bland to say the least. Maybe I'm just a Mac and cheese snob. Lol. I recommend this place."}
{"text":"In the never ending search for the ultimate greasy spoon in Charlotte, Cafe South is making a run for that mantle. I truly appreciate any breakfast joint that still has a bar for you to sit at. Kudos to the hard work of the employees of this great little spot in South Charlotte."}
{"text":"My wife and I checked out this place at around 3pm which is a bit of a weird time. Our food came quick and was nice and hot. The wings were surprisingly good, worth the try for sure. The lava cake they have is very good also. Jazz was our server. Thank you so much for the good service and helping to make our day that much better."}
{"text":"We love the fried chicken and collards here. The waitstaff is friendly and the food is surprisingly very tasty. We have been here four times now & have received our food in a timely manner. The banana pudding didn't look appalling but don't let the looks fool you. It was pretty good! We have no pictures to post because everything was eaten before we could snap a picture."}
{"text":"super sweet staff. I had the soup and it was very good. I think though you might want to try the fried chicken, I heard it was super good. Cornbread was amazing"}
{"text":"This was a great restaurant.  It was like a combination between a diner, a po folks (for those of u local Charlotteans) and a Cracker Barrel.  

The menu was extensive so a bit overwhelming but southern staples were clearly the theme throughout.  We were here for a client lunch and the menu items ranged from meatloaf to fried chicken to wraps to salads, gyros.
They had veggie platters and familiar items like hush puppies, biscuits, sweet potatoes, etc.  

I ordered the Greek salad with grilled chicken and it was very good! I was told the owners are Greek so there was no surprise there!  We ordered a basket of hush puppies and they were excellent!

My associates ordered a veggie platter with Lima beans, fried squash, collard greens and green beans.  She enjoyed it very much and it was served with cornbread.

My other associate ordered a grilled chicken plate that came with a side of veggies, brown rice and a side salad.  

Everyone really seemed to enjoy their meals and we really enjoyed the price tag.  You can get a lot of good food for a very reasonable price!"}
{"text":"This place is surprisingly good to have such a large menu. The food was fresh and tasty...like home cooking. I got spaghetti with meat sauce which comes with a salad and garlic bread. The bread was awesome, soft inside and perfectly toasty and garlicky out. Spaghetti tasted like my dad used to make. :-) My husband got a club sandwich and said it was really good as well. Solid go to home cooking restaurant with lots of options and great selection of homemade desserts! Service was also great."}
{"text":"Good for the most part. Entrees are hit or miss.  Chopped steak and fried chicken is delicious.  Meatloaf, lasagna and flounder is awful.  Breakfast is good."}
{"text":"Decent breakfast. Quickly came out. Very nice staff. Cute clean place with reasonable prices."}
{"text":"We stayed at the hotel next door, and after a long drive enjoyed the short stroll to dinner. After reading Yelp reviews, I chose to order the meat loaf with tomato sauce and 2 sides, macaroni and cheese (YUM! As good as Mom used to make!), and grilled vegetables, which were pleasantly seasoned. DH ordered the blackened catfish, coleslaw (very good!), and baked sweet potato. Service was fantastic; menu is incredible (so many choices!); portion sizes are generous; and food came quicker than the time it took me to decide what I wanted to order! Prices are very reasonable. For dessert, we shared an order of the molten chocolate cake and added vanilla ice cream--also very good. I highly recommend this place!"}
{"text":"We were really sad to see Bob Evans go as we really enjoy their breakfasts and especially their dinner plates. So when Cafe South eventually opened in the same building with very few changes, we thought we would give it a try.

Yep, nothing structural has changed. The same doors, the same hostess stand, the same tables and the same counters. The menu, on the other hand, has changed quite a lot. It's what I would call \"New York deli\" but with a Southern flavor. A wide variety of plates and meals, ranging from meatloaf to burgers to baked chicken to Thanksgiving turkey dinners. Breakfasts include the usual egg plates, but also a challah French toast and grits and biscuits. Like I said, Southern.

For dinner, I went with the meatloaf and for some reason, the brown gravy. Dumb mistake on my part. Meatloaf should be with a tomato sauce. Don't get me wrong, it was okay. But I feel like I let the side down.

Service was very friendly. Helpful and sincere. Enjoyable, even.

We will absolutely be back again!"}
{"text":"We stopped here while traveling at the recommendation of our hotel. There was a vast menu selection making it hard to choose. I decided on the Gyro platter and it was amazing! My whole family enjoyed their meals! Our waitress Jazz was very personable and funny. I would recommend this restaurant. Good food. Fast friendly service. Thanks!"}
{"text":"We saw all of the great Yelp reviews for Cafe South, so we headed...South..to try the breakfast food out.  The eggs, bacon, and hash browns were fine, but nothing amazing.  The biscuits were cold and kind of hard, so the butter did not even melt, which is an unfortunate thing.  We also fired the belgian waffle which was average, and fell right in line with the theme of this place.  

Unrelated rant:
This isn't a complaint about Cafe South in particular, but why are belgian waffles so damn expensive??? $4-6 for some batter that costs the place somewhere in the neighborhood of about $0.05 - $0.10 to make.  And God forbid you put some whipped cream on top, with strawberry syrup, or potentially a sprinkling of chocolate chips.....BACK UP THE F'n BRINK'S TRUCK at that point, bc this mixture of flour and water is going to run you about $12!  Stop laughing, Pancakes....bc this applies to you, too, you consistently overpriced syrup delivery system! It's time we knocked waffles/pancakes down a peg.  Far more creativity goes into making a cinnamon raisin bagel, then throwing some batter on a hot surface and spraying it with whipped cream, but we don't bow down to it and pay $5 for the chance to eat it.  

...but anyway, Cafe South wasn't that great, so I probably won't be going there again."}
{"text":"Excellent, all the way around! Beautiful, clean in an awesome location. Staff are like family and the food is awesome.
If in the area do drop in, you will be so happy you did."}
{"text":"Ordered from here for the first time with a coworker and we must say were very disappointed in the food. The lady that took the order over the phone was rude and when we picked up the food, she was very rude when I told her it would be separate Check. Had an attitude when I stayed these are to be paid separate.
Did not get a warm or welcomed greeting when I arrived. Peach cobbler cold and seemed like it was left over from Sunday dinner.
My chicken fried steak tasted sour. 
Fried squash was good and Mac & cheese was okay."}
{"text":"Stayed the night in Charlotte and thought we'd find breakfast on the way out of town.. Cafe South is a gem! Our server Mary was great. I had staples of eggs, bacon and hash browns... No complaints! The coffee was delish also!"}
{"text":"Food wasn't bad...but it wasn't all that great either. This place was recommended to me and Im glad I came...I guess?? Not really a place Ill come back to not necessarily because of bad service, the waitress was friendly and awesome but I paid $20 (meal and tip) for average."}
{"text":"Breafast anyone?  This is my Sunday breakfast spot,  good service, good food,  good prices,  great place! 

Spanish Omelet with hash brown and toast
Hobo special comes with everything you could ever want!"}
{"text":"Friendly staff, clean restrooms, standard cafe decor.
the menu for this place is very diverse. 
Don't expect world class cuisine from a cafe, and you won't be let down.
For what it is,it's fantastic."}
