{"text":"Mauvais service Breuvage pas vraiment bon Pâtisserie sèche Ambiance ordinaire Le café n'a pas changé depuis 20 ans. Je suis un grand fan de Second Cup mais cette adresse, c'est pas la meilleure de la chaîne."}
{"text":"I like this Second Cup location, the staff is always friendly, and it has a nice atmosphere. Great place to work. The only downside is their pastries / muffins etc. are ALWAYS stale. Each time I think it'll be different, it's not. Just good for coffee and tea."}
{"text":"Une de mes terrasses préférées pour les chauds après-midi de fins de semaine. J'aime aller y prendre un café glacé (ou toute autre boisson fraîche qui y est servie) et relaxer en lisant ou en écrivant, tout en regardant les gens passer sur le trottoir. Bon endroit pour prendre un peu de soleil, même si c'est parfois un peu bruyant (la rue est tout près). Souvent, l'été, des gens de tous âges s'y rencontrent pour jouer de longues parties d'échecs."}
{"text":"Bien pour mon 200eme avis je choisie d'écrire sur le second cup café de l'avenue mont royal car c'est ici que je venais soigner mes insomnies (sûrement à cause du décalage horaire) il m'était impossible de m'endormir avant 4h du matin et il se trouve qu'ils sont ouvert H24 donc génial pour venir profiter du wifi tout en mangeant ou en buvant un petit quelque chose et lorsque c'est a 400 mètres de l'endroit où vous êtes hébergé c'est encore mieux.   Il n'y a pas vraiment de décoration particulière, juste deux murs de pierre, des tables en bois, toutes les sortes de café en grain différent accrochés au mur et bien sur il y a la terrasse. Parfait lorsqu'il fait beau ce qui est le cas ici.  Les vendeuses sont très gentilles et super agréables. Il y a également 4 gros fauteuils en cuir dans lesquels il est trop bon de s'enfoncer mais ils sont vite pris d'assaut ceux là.   Je trouve que les prix sont vraiment corrects par rapport aux autres. Sandwich pour le midi ou encore salade et plein plein plein plein et encore plein de choses bien grasses et gourmandes. La seule raison qui m'empêche de leur mettre un 5 étoiles c'est parce que mon muffin au bleuet était très sec, trop sec même, du coup une étoile en moins mais à part ça tout ici est sympa."}
{"text":"Je vais vous dire les vraies choses: Je suis une snob du café. J'aime encourager l'économie locale en sirotant une tasse à saveur 3rd wave pendant que je fais mes devoirs ou que je vagabonde sur Feedly avec mon laptop en écoutant du Indie rock en background. Mais il arrive des moments où j'ai besoin de faire mes devoirs, et je sais pertinemment que ma productivité n'est jamais invité lorsque je m'installe dans mon salon. Dans l'optique d'économiser du temps, je choisis alors l'option la plus proche de chez moi: Le Second Cup. Un peu plus de motivation et je pourrais descendre 5 rues plus loin et aller au mignon Moineau Masqué (ce que je vous conseille de faire), mais encore une fois, je serais probablement distraite par les viennoiseries et les gros ballons blancs suspendus au plafond, et la beauté de leur café risque de m'inciter à instagramer chacune de mes gorgées au lieu de travailler. Donc Second Cup ce sera.  L'avantage de cette location, c'est qu'elle est grande, la décoration est jolie avec un gros foyer et BEAUCOUP de divan. J'adore les divans, je suis toujours à la recherche de divans lorsque je visite un café. Il y a moins de facteurs de risque qu'un divan ne soit pas confortable que si c'est une chaise, qui elle ne sera pas confortable 75% du temps. Donc, c'est très chaleureux et les employés sont sympathiques. Par contre, la clientèle est habituellement très bruyante, et étant situé sur un coin de rue achalandé (Papineau/Mont-Royal), il arrive souvent que des sans-abris y viennent se réfugier (l'endroit est ouvert 24h!). Les employés sont très diplomates (et doivent être habitué), alors si un peu d'action ne vous dérange pas pendant vous sirotez votre London Fog à l'érable, c'est un endroit sommes toute correct pour venir faire des devoirs ou passer un bon moment entres amis.  Mais mon conseil final reste; si vous avez 5 minutes de plus, il y a d'autres cafés bien plus intéressants à distance de marche!"}
