{"text":"Sadly disappointed with our dinner. I am a firm believer in patronizing the local establishments but unfortunately, I would advise against Café supreme as it is right now. I dined with two others and we were all disappointed. As we sat down another table warned us not to order the special which was stuffed cabbage. They said it was very dry. I was disappointed as that is what I wanted to order. I did order it but asked for extra sauce. My two other guests ordered the stuffed chicken and a hamburger. I added the French onion soup to my meal and I could only eat about three spoonfuls. I can't describe accurately what it tasted like other than it did not taste like French onion soup. The color of the soup was black rather than a brown and it had a very bitter taste. My stuff cabbage was dry and tasteless even with the added sauce, and my continual addition of salt. My friend's hamburger was also dry and tasteless. She had to ask for extra barbecue sauce to put on her burger. My other guest ordered the stuffed chicken which she said was very dry and tasted like it had been reheated. The breadsticks were also unfortunately very dry and tasteless. I hope that there are changes made in the kitchen because local restaurants and not chain restaurants are very needed."}
{"text":"They make a great double espresso Americano! Food is great too.  Always fresh. Marco the Supervisor is very friendly. Knows most people by name. Great customer service. Go around 1130-1145 for the best choice in lunch selections. They will sell out fast!  Great music too!!"}
{"text":"Cafe Supreme was the go to place for a great burger!  I have been there several times, frequent patron.  That has changed unfortunately.  I ordered a burger and Cole slaw.  My burger was horrible! !.  It was compressed, grey matter and had absolutely no taste!   I was so disappointed and still starving.  My Cole slaw was swimming in a mess of mayo.  I asked our server if they changed the burgers and she said yes, we changed the meat.  She apologized and was very kind about it all.  It's not her doing, it's management's decision to change the menu.  Not a great decision because we will never go back.  In light of all of this, she took my meal off of the bill."}
{"text":"The food at Cafe Supreme is pretty good quality, their bread and butter is the sandwich and two salads for about $10 with a drink, which compares favourably with food court prices. But the real draw is that you don't have to eat underground in one of the PATH food courts amongst the masses. They have their own seating at fairly nice tables which are actually above ground (in fact you can even see out of some windows). In the summer they have a small patio outside. It's not the kind of place you would want to go to every day as the food would get a bit repetitive, but every once in a while it's a nice change. 

Be careful as Cafe Supremes are not all created equally, some are better or worse than others."}
{"text":"Jazz night tonight they were understaffed ended up leaving when we eventually could get our tab.  Irwin needs an alternative place for Jazz night this place is a joke."}
{"text":"Best pizza in the area, also love their hoagies (pot roast). The chicken marsala was very good my last time there i would recommend to anyone. I noticed they did some updating in the bar too."}
{"text":"Service is unbelievably SLOW! My wife and I stopped in with our kids. Assuming that since we were the only party ordering food we would see a quick turnaround time from order to food on the table. Not so. The order consisted of 2 salads, standard kids fare and a chicken sandwich. We waited for 25 minutes with hungry children. Won't be back as this was not the first occurrence and had hoped the other experiences were flukes."}
{"text":"Good food and good beer selection. I recommend the pecan chicken salad. Service is great. Took nearly two dozen friends there and they handled it with ease."}
{"text":"The only good food that is good to get here is the basic American/greasy food, like the burgers, pizza, wings, or appetizers.  Sometimes I am in the mood to just go get a burger that is not a fast food burger, along with something fried for an appetizer, and this is the place for that.  The other menu items are either bland or not cooked properly.  The service is sometimes OK, but tends to be a little slow and lacking even when the restaurant is empty.  I feel like this is another restaurant around here that used to be good 15 years ago and fell apart.  That, or when I was a kid I was too young to notice the bad quality."}
{"text":"Had a family lunch (21 people) last Sunday. I called ahead earlier in the week to make a reservation. I will say they did a pretty great job of taking care of us.  We ordered many appetizers, sandwiches, salads, and pizza. Everything was prepared in a very timely manner, and everyone loved everything, especially the pizza.  The staff kept all of our drinks full pretty much the whole time. The price was what we expected to spend, and service was excellent. Not the fanciest or hipster-friendly place, but we're not that type of family anyway. I give 2 thumbs up, and we will be back for sure."}
{"text":"I order delivery pretty much every time I get Cafe Supreme. I order at least three times a month for myself and co workers, and almost every time there is either something wrong or something missing. The food is delicious, and on the cheaper end, but when the order is messed up I don't want to eat it. I am lactose intolerant, and request for no cheese on my hoagie, and almost every time I order there is melted cheese all over the hoagie. It ends up in the garbage can because I can't eat it without getting sick. Wish they'd double check orders."}
{"text":"Quite possibly the worst place I have eaten including trips to rural India. Food is terrible and service is worse. Used to frequent regularly but hadn't for a while. Stopped in after an outing with the family and it was mid day on a weekend. Two or three at the bar and no one seated at a table eating. Waited an hour from order to being served. All basic stuff like salads, burger, and pizza. Not worth the money or time."}
{"text":"I go here regularly on my lunch. They make delicious sandwiches and it's a quick run downstairs to get some hot tea. Just writing about them makes me want to run downstairs for a tuna and alfalfa sprouts right now!"}
{"text":"This restaurant is under new ownership.  We hear that the new owner has managed restaurants in different states before buying Cafe Supreme.  The menu has not changed a lot aside from the introduction of daily specials.  The prices are reasonable for the quality and the portion size.  My husband were there in February and March of 2013 and were extremely pleased.  All of the workers seem to be working hard to change the reputation!!  The food is really very good and the service is much better than anything that I have every experienced there in the past; very prompt and complete!  We had the Yankee pot roast and the fish sandwich both times.  Both were delicious.  The coleslaw and homemade chips are \"over the top\".  We eat out a great deal and would make this one of our favorite new places even though the restaurant is out of the way for us.  This is a restaurant worth trying."}
{"text":"I have been eating here for 20 plus years .. I ordered and 8 cut pizza along with other items , as I usually order , and it was awful. I called and complained and to their credit the sent out another pizza and quite frankly it was just as bad ... 20 years of eating a great pizza and they screwed it up in one night ... there are to many pizza places in Irwin to be loyal to this crap and to boot ...... BILL the so called manager hung up on me WHEN I called for the second time to complain  .... never again..."}
{"text":"I really thought it was expensive until I ordered from here I love the food and delivery is fast and friendly."}
{"text":"I've stopped here a number of times and always had a positive experience.  I am surprised that the reviews are on the low side.  Tonight pizza was 1/2 price and it was very good.   We were greeted right when we came through the door and service was prompt.  The girls were very nice to us and dressed professionally.   The place was very clean - including the bathroom.   
      The food that I've enjoyed here in the past was always good.  Overall, this is a nice place and worth a try. Skip the chain restaurants and support the local independent establishment."}
{"text":"Had a late dinner with friends last night before going to the Lamp Theater.  Food was very good. Prices reasonable. Server was friendly and efficient.  Only downside it was very noisy. Dinning is only in the bar."}
{"text":"I visited this restaurant on 2 separate occasions and on neither occasion was I impressed.
The first time was very average (Mother's Day), and the second time couldn't have gotten any worse (Father's Day).

Mother's Day had a buffet and neither the food, nor the quality of food was very good.
The mix of buffet items was very random and didn't fit together and none of it was very flavorful or good.
It seemed food created in bulk for the purpose of having bulk food.
Quality was lost, service was so-so.

The first trip was so-so, as mentioned above, so we gave it another go to order off of the menu and see what their normal food items were like.
The second trip, it was an absolute disaster...

We ordered our food and our waitress was very young, and lacked basic waitressing/people skills--she actually pulled her phone out of her pocket at one point, checked something, and went back to talking to us.

We ordered and when the salads came out, they were not much but browned lettuce mix.
I asked for Vinegar and was given a table side bottle of vinegar.
It had fruit flies and a film floating in the bottom of the bottle.
I asked for a new bottle and pointed out the contents of the first one.
The second bottle was riddled with fruit flies--no salad for me.

The meal came out and the waitress either didn't record what I told her (simple request of sauce for the pasta on the side), or she just didn't care when she picked it up from the kitchen that it was wrong.
People, as a waitress/waiter, you don't even take the plate to the table if its not what the customer ordered!
The \"Cajun shrimp\" that was in the pasta was sooo ridiculously salty that i couldn't even eat it... me... I couldn't eat it.  
I.  SALT.  EVERYTHING!
My husband says that food is just a platform for salt for me!!!
...and I couldn't choke down this shrimp!
The sauce was a tequila lime cream sauce... it was the most horrible thing I've ever tasted.  I asked my mom to try it because I thought I was just being hypercritical at this point and even she thought it was terrible!

The next thing that happened was the waitress dropped one of those heavy drink glasses on my mom and niece!  Yeah... right on 'em, and said she was sorry, but it was a snarky, \"sorry 'bout that\" completely lacking in any type of remorse--it felt more obligatory and rude than anything!

Finally, since my meal was so bad (to say the least), the waitress told us that she was going to \"take care of it on the bill\".  It took us 20 minutes after asking for the check to get it! 
You wanna know what \"took care of it\" looked like?
They took about $4 off of our bill that was over $75.

Nice Job, Guys.....

We won't be back!

PROS:
[Sorry, not trying to be a jerk, but I can't think of one]

CONS:
Service is incredibly poor;
Lacking basic health standards--shouldn't be fruit flies in 2 out of 2 bottles of vinegar;
Food was terrible."}
{"text":"We have ate here twice in the last month or so.  The first time our entire meal was burnt and in edible.  This is not a good thing when you have two small children waiting for dinner.  We figured we would give it another shot and while our food wasn't burnt it was mediocre at best.  I'm not sure what has changed but we used to get great meals from here in the past.  We will not be returning.  I will say that the waiter we had on both recent visits was fantastic!"}
{"text":"Pros: Food is consistent. My faves are the wings, salads, burgers, and their Italian hoagies. Staff is generally friendly. Prices are reasonable, portions decent. Lots of seating areas, so you can sit at a table or booth (although there are only 3), sit at the bar and watch a game, or sit in the more formal dining room. Place is never really busy, so you can usually find a good spot.

Cons: Again, food is consistent, so sometimes consistently sub-par. Not wild about their pizza (always seems under cooked). Definitely stick with a salad, burger, or sandwich. 

Biggest Con: It is always cold. Winter....draft from outside maybe? Summer....A/C way way too low. Take a jacket!"}
{"text":"My boyfriend took me here the first time a couple days ago and it was great. The food was good. Our waitress was very friendly and efficient. Would recommend trying! The raspberry BBQ chicken wrap was awesome. Same with the provolone wedges! Will be back again soon!"}
{"text":"Gross pizza and it tasted like it was frozen. Can't seem to find a good pizza place near Irwin and this was by far disgusting and I found a hair in it. And not to mention the driver was not friendly. She was annoyed she couldn't find our house even after I told the lady over the phone the gps doesn't work. I stood on my porch trying to flag her down 3 times and she just kept driving past me! Deffinetly will not be ordering from here ever again! Should get my money back but ain't even gonna waste my time!"}
{"text":"One of the best pizzas in town (I'm also a fan of Jioio's): fabulous crust, perfect sauce, and not greasy at all. The staff is great, too!"}
{"text":"Never again. This was my second try at this establishment. Wine in a dirty glass to start - followed by a decent French onion soup. My main entree was bland. Very, very bland. Over cooked pasta did not add anything. Thanks, but no thanks."}
