{"text":"2.5/5~ Stopped by J-Town for dinner tonight with my friends and decided to eat here. This place is actually merged with the Niwatei restaurant. The interior feels pretty cozy and on one side there is really pretty Japanese dining ware you can purchase.  The menu is pretty basic with all the familiar Japanese dishes such as ramen (which is part of Niwatei), curry rice, and udon. The main dishes are around $9-11. I ordered the chicken karage udon and found it just alright. The udon was a bit overcooked and only came with 3 pieces of chicken karage. For $11 I expected a little more than that. Also ordered the deep fried takoyaki since that is one of my favorite things to eat. Again, it was just alright and on the pricey side. $6.80 for 6 of them. I tried a bit of my friend's curry rice. The curry was pretty good but thought that there was not enough rice served on the dish.   I'm pretty disappointed as I really thought this would be the place to get good Japanese food. Will definitely come back to J-Town to try the other restaurants but won't come here again."}
{"text":"Yummy! Try their stir fried noodles! The portions might be considered as small, but I find it fills me up at exactly 80% full. I love stopping by here for food when I go to j-town!"}
{"text":"If you are craving real Japanese food like udon,  soba, chicken omelette rice etc. Come eat here. The place also has a grocery store,  amazing bakery, and more. This is not your typical Japanese restaurant that you see in downtown."}
{"text":"I really like this place! It's attached to JTown which is convenient because i like to pick up random japanese things haha.  The japanese curry here is really good, try the cutlets with curry and rice. Soba noodles are good here too but it's not that big of a serving.  There's also onigri and little snacky things like red bean inside a fish shaped pastry thing. BTW the onigri on weekends is significantly bigger than the ones on weekdays! They're so yummy =)  So after you order you take your number which is on a wooden block, find yourself a seat and grab some water (that you will need to pour yourself) and enjoy!"}
{"text":"Hmmm... I should be much more forgiving since it was in the middle of this huge 4PM Sunday late lunch/early dinner chaos but... their yaki udon was very salty. I wonder if I should have gotten their omu rice or any of their katsu kare instead. It was only 9 bucks with taxes + my awesome 'tipping skills' ($2 in the jar for a $7 meal). I got addled by their system of numbers on wooden blocks. LMFAO! Those damned numbers are always throwing me off. Will definitely visit again since it's fairly close to my church & my stomach starts growling 20 minutes into a good sermon as I'm using all my brainpower/the little brainpower I have-- to soak up the preacher's words like a ShamWow cloth on cocaine & write careful notes about anything I can... not that I'm a model Christian. Far from it, actually. Just have a horrible memory & the attention span of a blackfly so I need to keep myself busy... & believing in a higher power keeps me modest & level-headed (or at least I'd like to think so)."}
{"text":"I'm a big fan of J-Town with the various shops under one roof and decided to eat lunch while I shopped. The restaurant was by the J-Town supermarket and had a cafeteria-like atmosphere and decor.  Most items were about $10 with many udon and rice dishes. I ordered the pork katsu don (battered pork cutlet with rice) and Japanese curry. The water was self-serve.  The curry was spicy and tasty but I wish there were more vegetables in it. The pork cutlet was nicely deep fried and crispy but the pork was really tough and was hard to chew. This had to be the worse cutlet I've ever had. I was disappointed."}
{"text":"The curry chicken was excellent. It's crispy and fresh tasting (ie they don't use old oil). The curry is home style in that it is not as thick as I'm used to - but still very flavourful.  In fact I dare say the curry is drinkable when you have finished your rice.   I look forward to trying other items on their menu next time."}
{"text":"Always my go to place for an authentic curry katsu meal.  They have been around for a while, but they manage to keep the quality and portions the same throughout the years.   For those in the know, I actually like Japanese food, but am not a big sushi fan.  So when I need to get my Japanese fix on, I usually head to my two staples: ramen and katsu.  This place seems to customize their own non-spicy Japanese style curry sauce, which is a gravy like sauce with a mild hint of spice.  Mixed in is some beef, potato and carrot.  To the side is a heap of rice, and the piece de resistance, a thick and juicy pork chop topped with Japanese style Worchester, but thick like ketchup.  Making this place authentic, they always add a side of Japanese red pickles.   For $10 with a free pitcher of water on the side, you can't beat this for an authentic Japanese experience.   When you're done be sure to check out some of the exotic ingredients at the supermarket next door like sweet pickled chestnuts and natto (fermented soybeans)."}
{"text":"This place has a lot of basic cafeteria style items done Japanese style. I went for omrice  though a lot of other items were tempting.  Nothing fancy here just your regular goodness. Simple rice with a ketchup base and chicken chunks served wrapped in an omelette topped with ketchup and nori flakes. Such a simple dish yet tastes somehow combine well in a harmonious way no wonder this dish is popular with kids in japan. The udon dishes ordered by other people eating here looked good. I wish there were cafes like this in downtown but hey it gives another reason to visit J town. 3.5 stars overall."}
{"text":"Love their curry pork katsu! The pork is very juicy and delicious. I love how their curry is a bit sweet and not very spicy. The rice is perfect, not too hard and not too soft.  I have been to this place for over 10 times and their quality of food are always the same. The service is good. The cashier always has a smile on her face and speak gently to the customers."}
{"text":"Curry cutlet rice dishes and udons are delicious! The cutlets are always crispy and the udon comes with a very VERY juicy piece of mushroom. I sometimes get udon just for the mushroom!"}
{"text":"I had high hopes for this place. Huge disappointment! We ordered #15 and #13 chicken rice wrapped in egg and pork katsu curry rice. Both dishes came out lukewarm on the cold side. Not piping hot as expected. Flavour is also very blend. Also, I could barely find any chicken in that chicken rice."}
{"text":"Home Style Japanese Cooking? Domo Arigato.  I'm sure most of you J-Town fanatics have been here before in this semi Food Court setting in a serve-self dining area where you pour your own Water but at least you'll notice it's next to the tap with a Brita filter on it while when you finish the meal you put your own dishes and garbage away(think Ikea).  The Menu Board reads Home Style, which has always been successful to most patrons that has come over the years.  From left to right, Soba items, Udon items, Curry items, Meal items, and Rice items.  31 items in all and if you don't feel comfortable ordering in Japanese or butchering the English term, then simply use the Numerical system.  Ichi, ni, san, shi...  You pay up front and tip in the Jar as necessary and as I didn't have 2 pennies, the staff took it from the Jar.  I knew there's a reason I never bring COINS with me.  She gave me a wooden block #18 while she went to the back with 1 Male & 2 Female Cooks.  I ordered an item that didn't have a \"Takes Time\" sign so my meal came out pretty quick.  #8 Udon with Tempura Shrimp($7.98) had a good Kombu stock, slurpy chewy Udon, a couple Fish Cake slices, Shrimp Tempura, and a Shitake.  The Shrimp Tempura was a funny item as you know what to expect when Tempura gets wet but I ordered it knowing of this fact but the look of this Tempura was very good if I imagine it prior to the soaking.  Upon being impressed by the Udon, Broth, Fish Cake.  I was additionally surprised by how perfectly cooked the Shrimp was inside the Tempura and had just the perfect bite that all Shrimp should have.  Wait....  There's more, that unassuming Shitake that looks like a Shitake and you don't expect much from it?  It had such good flavour as I believe it must have been marinaded in some sort of Shoyu sauce.  All things considered, this meal was very good for the price and this cool Fall weather as the broth came out steaming hot.  Also on a sidenote, I believe this would be a good Vegetarian choice or just leave out the Shrimp and go for the Tofu($6.98) or Plain($5.98) options."}
{"text":"I used to really like this place when it first opened. You could get home style Japanese food for a reasonable price in a cafeteria style setting. I went this past weekend after a year long hiatus; it was unfortunately a disappointing experience. Firstly, the service could use an improvement. I was standing by the counter ready to order and the employee just stood there staring blankly at me. The food came out pretty quickly after we ordered, which was nice because I was hungry. When the food came out though was a huge disappointment. I've had katsudon here before and it was really good, which is the reason why I ordered it. Look at my photo; I was disgusted by what came out.Anyway, I've definitely experience better.  Good for: cheap eats"}
{"text":"Not the most glamorous seating area but Japanese curry is spot on and they bring it to where you sit. You can also puruse the connected grocery store while you wait."}
{"text":"The curry udon was delicious! Sauce was rich, noodles were cooked just right. Love the fact that they serve authentic Japanese home-cooked food - a rarity (it seems) that is served in Toronto! A few things that I wasn't too pleased about: I found a tiny piece of foil in the curry sauce and the staff were a bit inattentive. However, the curry udon was so good that it makes up for the cafe's shortcomings. I'll be coming back to try out more items."}
{"text":"Omelette rice: fried rice wrapped inside the egg, seaweed powder on top, and the red sauce is modified ketcup/tomato sauce. Recommend. Pork katsu (fried pork chop) curry on rice: pretty self-explanatory, the bright red stuff is just sweet ginger. Good.  See pics of their cold soba, omelette rice and pork katsu curry at: http://www.fringta.com/2011/08/cafe-green-tea-3160-steeles-ave-e-inside-j-town-2.html"}
{"text":"I have eaten here some time ago. I did like the quantity and good value for the money."}
{"text":"Fast food Japanese style food court style pick a number pay take the number and sit down.  They do deliver to your table but you clean up after tray to rack Omelet Chicken Rice 2.5/5 - little chicken  - luke warm  Curry Tonkatsu 3/5"}
{"text":"Cafe Greentea is a 'restaurant' with cafeteria-style set up inside J-Town.  I had the Katsu Don from here yesterday - they gave us ALOT of onions. I love onions so that was a plus. Food was pretty filling and delicious. Price was decent. I would most definitely come back to try their curry katsu rice as I saw a lot of people ordering it."}
{"text":"Simple and delicious food. Affordable and many options available, including vegetarian dishes. You can choose between soba, curry, udon and others. They also have Millie Creperie chocolate and green tea flavours!!  I had the Tempura Udon, perfect for cold weather. Ask for the S&B chilli pepper!!!"}
{"text":"Went there for a pork cutlet on rice and the egg wrapped chicken fried rice. It was a joke. The pork cutlet is smaller than my palm. For that price, I am expecting alot more. It's less than half the size of what I would get at fast ninja or katsuya. For the fried rice, I would need a magnifying glass to find the chicken. And the rice is tasteless. Will never buy from this place again. Very disappointed from a Japanese owned restaurant."}
{"text":"I've known about this place for a while now, but seem to come to all the surrounding restaurants every time I'm in J-town. Finally got a chance to check it out for lunch on a Sunday, craving curry and katsu. The restaurant is set up cafeteria style, complete with clearly labeled menu overhead, self-serve water jug and numbered wood blocks to take back to your seat as you wait for your food to be delivered to you. The space is bright and spacious, so its comfortable even without the frills.  I had the pork katsu curry rice and was pleasantly surprised by the quality and flavor in the dish. The katsu was thinly breaded and cut on the thicker side, which allows for a better appreciation of the juiciness of the meat while delivering on the important crunch factor. The curry carried chunks of vegetables and was well spiced, but had that characteristic sweetness I've come to associate with Japanese style curry. The mound of rice helped soak up the curry, and the little pile of pickled vegetables cut through the grease to keep the meal going. In all, it was a well constructed dish and satisfied any cravings."}
{"text":"Many people may mixed up Cafe Green Tea and Green Tea Lounge... As some of the reviews here are actually in Green Tea Lounge.  Cafe Green Tea has no Ramen, nor Takoyaki, etc.  Cafe Green Tea is located beside Heisei Mart (the supermarket).  Like it, because of their good quality of Japanese family style food.  Dislike it, because their portion is getting smaller and smaller.  My recent visit was end of April for lunch, and I felt ~80% full......  Positive thinking: 80% full is very good for my health.  My ichiban favourite is Yaki-udon.  It takes time to make, so need to wait like ~20mins or more.  Oh... most of my favourite dishes take time to make: Omurice, Katsu-don, Oyako-don... If I don't have time to wait for my favourite dishes, Curry Chicken on Rice is another good option.   They also have good bento box for bulk order. If you order at least 1 week in advance, and there's a minimum order.  Really love their Chicken Teriyaki Bento and Tonkatsu Bento.  Sometimes they are able to delivery to the venue, but sometimes we will need to pick up at their restaurant.  My bulk orders went very smooth in the past years. They are very nice and I wish I will order from them again."}
{"text":"Maybe the cafe has changed, but I found the tofu udon that I got in the last visit (Jan 2013) was about the same standard as the udon I made at home.  I won't go as far as calling it a total loss, but at best I will regard it as a hunger filler, not an enjoyment."}
{"text":"Pretty good place in J town. It's in the corner nearby Shisho tree. Came here for lunch on the weekend with my cousin. We both got curry pork katsu.   The katsu was pretty tasty. Thick cut slices of pork and very crispy and crunchy. The curry sauce tasted good as well. Not too watery. Good texture and not too salty.   We also ordered a side of karage, which we both didn't like it too much... The chicken pieces were smaller than other places that we've gone to and it sort of tasted like a chicken nugget from mcdonald's despite  the crunchy context.. Wasn't that good..    Service was good, food had come out quick,  and our waitress was nice. Only thing is,  there glass cups of water are way too small... Would rather if they have given us a larger glass... It's just easier that way instead of them always having to come back and refill our glass all the time.   Gonna come back to this place for sure, and probably try something different."}
{"text":"In terms of lunch counter services, this place is one of my fallbacks for lunch, especially if I have a craving for Japanese-style Curry.  The storefront is nothing fancy, but it hits the all right boxes for Japanese curry  takeout lunches at my desk.   Pricing wise - it is pretty reasonable - usually rings in around $12 after taxes.   Service wise - it's pretty straightforward, I wouldn't say it is the friendliest service you would ever encounter, but they do the job without any extra production..  Foodwise - the portion is enough to be filling and I really like the pickled plums they enclose as a side dish to help clear the palate after finishing the meal.  The rice that is served with the curry can vary from time to time, sometimes nice and fluffy and sometimes a little too soggy for my taste. The curry is usually nice and savory with just a mild kick. I usually pick between either the chicken or pork katsu; both are pretty good. I find that the chicken is a little bit better, but you can't really go wrong with either. They have other dishes, but I usually just beeline it for the curry."}
{"text":"Use to enjoy this place more. I noticed their cutlets seem to have shrunk in size or maybe my appetite got bigger? Most likely it shrunk cause even he rice portion seems less.  Still flavourful, but the chicken was too dry. I like the food court style as I can grab a pastry for dessert after my rice.   Overall $10 plus some change for a chicken katsu rice."}
{"text":"I've been a regular at Cafe Green Tea for almost 10 years. My favorite dish is the Curry Chicken with Rice. I've tried to find other restaurants to benchmark against, and none of them compare (in my opinion).  -First of all, this is a \"cafeteria\" style experience; order at the register and wait for  you food with a table number. -Staff is extremely courteous  -atmosphere is very \"Japanese\" since it's owned and operated by a Japanese individual. This just adds that little something to make the place feel authentic.  -Meals are reasonably priced, curry chicken is $7.98, if I'm ever feeling famished I add an extra side of chicken for $3.00.  -Service is what I consider quick, usually you'll have your meal in front of you within 10 minutes max, regardless of dish.   Cafe Green Tea offers good value, great taste, quiet atmosphere, and the location is very accessible.  (close to the 401 and 404)."}
{"text":"This is the food court on the right hand side of the entrance to J-Town supermarket. The food is decent but there are a couple things that gave it a mediocre rating.  First, the portion is small given its price. The curry chicken plate comes to over $10 after tax and it has maybe 6 pieces of small chicken (see photo)  Second, the wait is just too damn long! You'll easily wait 10-15 mins for your food for a simple dish, which isn't fitting for the venue given it's a food court and people are looking to be in and out."}
{"text":"Now part of a place that encompasses 2 restaurants and a shop, Cafe Green Tea is a nice place to go for some authentic Japanese food.  Pros: Authentic Japanese food  Cons: Side dishes not done as well as could be  Like I said, Green Tea cafe now shares a larger location with Niwatei Ramen and Yamachu Japanese tableware store.  Even if you sit in Green Tea Cafe, you can order some of Niwatei's Ramen as well. When I walk by though, I still see the old location and it still looks open so I'm not sure what's going on for sure.  Maybe both locations are still open?  The decor of the new location looks a lot better.  The older location looks like a cafeteria basically. The new location has better tables and chairs as well some really nice booths with cushioned seats.  It's a much better and open atmosphere if you ask me.  My GF ordered the tempura udon and I got the pork tonkatsu ramen.  We also ordered the boiled spinach and chicken karaage side dishes.  The side dishes came out first and to be honest, they were a little underwhelming.  They looked nothing like the pictures in the menu, portion size and appearance. The taste was OK, but could of been a lot better.  At $4 and $6 respectively, I wanted more for my dollar.  The udon and ramen were much better.  Both tasted great and I have to mention the broth of the ramen was one of the better ones I've had.  I wished there was a extra noodle option but sadly, there wasn't.  Service here is very good as with almost all Japanese restaurants.  The waitress was very nice and polite throughout our time there.  Overall, the whole experience was excellent.    I like Green Tea Cafe very much.  I've been here in the past and had their curries are excellent as well.  If you like Japanese food, this is a place you should definitely try."}
{"text":"Good Japanese food court style restaurant in the J-Town complex.  Meals are priced from about $7-$11 for various meals such as udon, soba and rice dishes.  I ordered the tempura soba noodle soup.  Not a big portion but good texture and flavour.  Service was fast and friendly.  Look forward to trying out some of the other dishes!"}
{"text":"Here is the deal: beggars can't be choosers. There is no other complex in the Toronto area like j-Town where you get Japanese grocery, sushi, ramen, izakaya, dollar store goods, clothes and videos. So we are lucky to have this place with its Japanese ownership... so no Korean-owned 'sushi' or Chinese 'Japanese grocery store' here.  There are notable omissions here, like an actual sushi restaurant or actual ramen (not the frozen package kind which they serve here), but those aside I have been coming here for years and will continue to do so.   Now with that said, the restaurants leave a lot to be desired. Perhaps even Japanese being away from Japan makes them lose their way or a lack of competition makes them lazy, but Café Green Tea's Japanese Yooshoku (western style Japanese food) and noodles, etc. that area standard cafeteria/restaurant fare in Japan. They have soba, curry, breaded pork, chicken and omelette rice.  The food is good and cooked with Japanese recipes, but it is not done well to be honest. The curry is too watery and lacks much of the ingredients. The katsudon (pork cutlets on rice) clearly lacks enough dashi (Japanese stock base). The taste is weak because of it and the broth at the bottom of the bowl is too light, which is a telltale sign. One can find issues like that with most of their meals. A wooden menu on the side wall in Japanese (with translation on the side) proclaims they also have oden. Yumm oden!  All meals are deliberately under $10 and could use a bigger portion. All the ingredients are fetched from next door which is the owner's supermarket. Finally, they are open and closed noon to seven. It would be nicer if they stayed open later.  The service and time to ready the meal varies and the premises could really need a coat of paint and some new furniture. Get with it."}
{"text":"Located inside J-town,  you have to walk all the way to the end to get to this restaurant.   When you walk inside, it looks like a cafeteria.  Walk right up to the front and you will get a host of japanese food that you can pick.  The prices are reasonable.   I ordered the katsu-don but you can order other stuff like their curry cutlet on rice or tempura on noodle.   Once you order and pay,  you will be given a number which they will call out and you have to go and pickup.   The food taste was ok.  I wouldn't say that I was blown away but it was reasonable for the price.    This place gets extremely busy during the weekends.  Mainly cantonese customers coming in to eat.    If I am looking for a quick japanese food for about $10, then i'd come again."}
{"text":"Whenever I bring my car to Don Valley North Toyota for service, I stop next door at J-Town to get baked goods from Bakery Nakamura, Japanese groceries from Heisei and lunch from Cafe Green Tea.    One thing you can be guaranteed at all the shops in J-Town is that they are all Japanese owned and operated and completely authentic Japanese.  The one thing I noticed about Japanese restaurants not run by Japanese people is the rice is not right... Koreans tend to make it too soft, Chinese too hard and often don't even serve Japanese style short grain, slightly sticky rice - Kaiju, and AYCE sushi places are prime examples.    I must sound like Goldilocks - this rice is too hard!  This rice is too soft!  But at Cafe Green Tea the rice is just right!  When you grow up on rice, texture is important!  The curry, katsu, ebi fry, tempura and other traditional Japanese lunch items are all authentic as can be as well.  The potato salad that comes with the katsu meals is very Japanese style - more like potatoes mashed with mayo and a bit on onion, corn and peas thrown in, the serving of potato salad is painfully small considering its one of my favourite parts of the meal!  I'm weird, but it's just like my sweet Gramma used to make so it's a very sentimental thing for me.  Line up, order and pay for your food and get a wooden block with your order number and sit in the seating area reminiscent of someone's kitchen with mix and match tables and chairs, it is all part of the experience.  Prices are reasonable considering its all authentic.  If it's not fancy enough for you there are plenty of other places to eat in J-Town!"}
{"text":"When my husband and I moved back to Toronto from Japan, we were so excited when we found Cafe Green Tea in J-Town.   It had all the typical comfort food in Japan like tonkatsu (deep fried pork cutlet) and oyakodon (chicken, egg & onion rice bowl).  It's a cafeteria/ fast food style place which may not be too appealing to some people.  We decided to come for lunch today since I had a craving for Japanese style Hamburger rice.  It might sound strange to have hamburger with rice but believe me it's so much better than with a bun.  If you like this dish and you are ever in Hawaii, you must try loco moco (hamburger with fried egg with gravy on rice).  We came here a lot a few years back but not recently and the food is just as good as it was before."}
{"text":"been there. had curry udon (medium hot only, not that fabulous at all, nor generous). waitress not very friendly (but cookers bearing large friendly smiles). have been sick the following night. will never go back."}
{"text":"It's a bit tricky sometimes keeping track of all of the mini stores inside of J-Town. Cafe Green Tea is on the east side of the complex. I ordered the curry rice with breaded chicken ($9.98+tax) for dinner one night. It only took about five minutes from order to service so they are quite efficient. You get about a bowl of rice with enough curry for all of it. The breaded chicken had a nice crisp exterior, but because the chicken is thin, the inside wasn't as tender as it could've been. The food is good and it's enough to fill you up. It's nothing extraordinary but it is a decent option for its cost."}
{"text":"I wish that there are more little Japanese places like Cafe Green Tea.   The Shrimp Tempura Soba noodle I ate here is a Foodie dream noodle. There are so many complex taste in every bite and each different items in the noodles give one different senses of adventure for your tastebuds.   BTW, this is the only place where I been to the actual orders are bigger and more appetitizing than the photos... I could not stop smiling when the 2 older ladies at the back was so excited when they saw their XXL shrimp tempura set they ordered.  Yes I will be back... Yes I will see more noodles Yes I think the Japanese girl server has a nice and friendly smile!  They accepts Visa and Interac!"}
{"text":"Authentic Japanese cafe (food court) inside J-Town.  Ordered the plain udon, hot soba w/ tempura and katsu-don.  Simple, quick n delicious."}
{"text":"For the price you pay ($10), the curry pork tonkatsu is pretty average. It's filling enough and the curry is still delicious but it's not any more special than what you can make yourself. That being said, I love coming to the J-Town area to try a bunch of their nearby food options."}
{"text":"I have been here many time given that I use to work nearby a few years ago which means I end up having lunch here quite a bit... Cafe Green Tea is located inside Heisei Mart, the J-Town Supermarket, so it great to shop while waiting for food ;)    I find myself coming back again and again for one thing and one thing only...  Katsu-Don $7.98 ~ It's a bowl of rice topped w/ deep-fried pork cutlet, egg and fill with a yummy onion sauce/broth.  ~ This is my favorite katsu-don in Toronto and the kind of comfort food, perfect when served piping hot in the winter. ~ Love how the rice are immerse in the sauce, there's more of everything then rice.... It's such a heart-warming dish.   Cold Soba $5.98 ~ I always see people order this, so I decided to finally try it but really there's nothing special about this... def something you can easily made at home.   We also usually drop by Sakanaya, the mini fish market next door to grab a sashimi platter. And a hint, they discount these platter by 50% or more at the end of the day ;)   Verdict: ~  Love their Katsu-Don and will be back again and again for it ~ And no harm in dropping by next door for some fresh sashimi"}
{"text":"Had a craving for omu rice.   So went there and ordered ice coffee and omu rice.  The omu rice today was quite disappointing, though I am left to wonder did I ever like it here?  More precisely where can I get good omu rice now.  The egg was too thin, there wasn't much meat inside either.  The iced coffee is excellent though, much better than what you'd get from McDonalds or Starbucks, though it's $2.50 + taxes."}
{"text":"Been to J-Town more than a few times.  The small Japanese place is interesting but for the most part, we went for the food and dessert shopping. Cafe Green Tea is...A-OK.  Nothing fantastic.  The portions are as expected...Japanese Portion!  Being of a more robust size, meals are are snack-sized for me.   we ordered the Tonkatsu with Curry and the Tempura with Udon.  The Tonkatsu had luke-warmish curry and the Udon broth was not all that tasty. Oh well.  At least the bakery for dessert was great!"}
