{"text":"BRUNCH! Such an incredible meal that I can't understand why everyone doesn't like it! Anyway, I adore this spot  it is located in a moderately busy shopping center and I have never had an issue with parking. Let's move on to the menu...

Coffee: I love coffee, while I may be no expert I drink it in all forms: black, sugar/cream, flavored. I understand that traditionally they do not offer flavored coffee but somehow I was able to get vanilla added once and it was very tasty. Was not disappointed. 

I am in love with the eggs Benedict on a croissant. While I only divulge in meals like this every once in awhile it is amazing. I don't really care for English muffins but a croissant.....mmm mmm mmm! The croque Monsieur and croque Madame are also very appetizing. 

The service is always on par and I have never had a bad experience In that aspect. Never too long of a wait and a speedy checkout. I hope you get a chance to check this place out bc it does not disappoint!"}
{"text":"I came here with a friend for the first time yesterday, and the food is amazing. Since I'm part French, I had pretty high expectations for this place, and I wasn't disappointed. I ordered the chicken and wild mushroom crêpes as well as the banana flambé crêpes. Both tasted absolutely amazing! The banana flambé wasn't that sweet either which is a good thing. The prices aren't too bad, but I do think it's worth it for how delicious the food is.

The customer service was alright. I made a reservation at 1 on a Saturday and it was completely packed in there. When they seated us, they forgot to lay out the silverware. Our waitress seemed snobby and slightly rude at first, but she got much nicer afterwards. I don't know if it was a coincidence or not, but I felt like they didn't pay attention to us as much as the other customers. 

Parking was horrific. There wasn't a single space in front of the restaurant. I ended up parking near the movie theater. The walk wasn't too long, but it was extremely cold that day, so it was painful. And I ended up getting sick."}
{"text":"We had a large group that attended.  The service was outstanding.  Our server was pleasant and very helpful, often coming to our table to see if anything was needed.  The atmosphere is also very nice.  Being in Philips Place, it has a comfortable feel and is very pleasantly decorated.  I personally got the seasonal vegetable risotto with shrimp.  The risotto was a bit undercooked as the rice had a bite to it, but it was edible.  A few people got the trout almandine and liked it.  One person gave me a bite of her beef to sample and it was like a pot roast - would have been better with a reduced wine or gravy sauce.  One lady got the crab cakes and said they were ok, but she was from Maryland and had some expectations  :-)  One person got the mussels and really liked it.  A couple of people got the pizza and it was so-so.  But hey, you're at a French restaurant afterall, and you order pizza ?  The cheese plates were VERY good quality cheeses and I highly recommend them for a nice starter.  Overall, go for the service and atmosphere.  You will have a lovely time."}
{"text":"I visited with a friend of mine for dinner. We had the Escargot, Risotto and Beef Short Rib Bourguignonne. The escargot were delicious, fragrant with garlic and butter. The risotto was filled with flavor. The short rib itself was a little underwhelming, It lacked seasoning, in contrast to the vegetables that accompanied it, which were sublime. 

Regardless the best part of the night was our waiter, Jay. He was radiant and always available with suggestions and wit. I would definitely recommend that you give this restaurant a try."}
{"text":"One of my favorites with great service. There is not a single item on the menu that is not perfect!"}
{"text":"ate here once when they first opened and during restaurant week (should have known better) and it was just decent....really glad I went back. The Trout Almondine was 1st rate. My wife's veggie crepes were stellar as well.....cant wait to return. Great coffee as well...."}
{"text":"I have visited twice, once for lunch and once for Sunday brunch - lunch was good but it's hard to beat Sunday brunch - get the beignets, they are worth every single calorie! Had a reservation, so no wait to get in, service was wonderful on both visits - would love to visit again for brunch or dinner"}
{"text":"I have been there twice and found the service and food to par with some of the best food in town and gluten free options to boot."}
{"text":"This was my first time at Café Monte. The ambiance, customer service, and food was great. The beneits were super delicious!!! I also customized my omelette which was zesty and savory."}
{"text":"Seven of us headed to Cafe Monte for a birthday celebration that was a disaster as a meal and the evening only salvaged by the duty manager doing right by us when it came time to receive the bill.

We ordered drinks that took some 15 minutes to arrive but it was still another 15 minutes before our food order was taken, with 4 of us ordering from the a la carte menu and the rest from the prix fixe. In time the a la carte entrees arrived but it was 20-30 minutes before the prix fixe entrees arrived. The excuse given was that the orders from the different menus were given to the kitchen at different times.

The food met with a mixed reception from rave reviews from some through to indifference from others. My caprese salad had no basil or olive oil but did have a rather gloopy balsamic dressing on the side. It tasted fine but was not what I expected. My steak, cooked rare as requested was pretty good. The trout was enjoyed, as was the lobster/crab crepes. Two people had the scallops with risotto ... both enjoyed the scallops but they differed greatly in their feelings for the risotto.

If the kitchen and wait staff could get their act together this would be a decent mid-range restaurant but it seems they have some way to go. In the end the duty manager seemed sincerely apologetic and ensured there was appropriate consideration when it came to the bill. That was appreciated but we would rather have had a better experience."}
{"text":"This used to be a reliable spot for pretty good food at moderate prices.  But, a few months ago the place lost their long time chef, and its general manager.  Even the once great croissants are no longer consistently good.  Last time I was in, I got food poisoning: I called later in the day to tell them-and the person answering the phone didn't seem to care.  I left my phone number and name-and no one called me back.  After recovering (three days later!) I finally called.  The manager was \"sorry\" but I had to demand that my charge be credited back to my card.  She wasn't offering!  I'd have to say, sadly, skip this joint.  My sausages, which I believe were the cause of my illness, were the size of silver dollars, and just about as thick, overcooked, cold, and tasteless.  Really, how do you mess up sausage?"}
{"text":"After more than three visits, I have tasted a variety of dishes. Everything you would expect from a French restaurant and the service is wonderful. It is conveniently located near the mall and it has small dishes that are delicious and I'll be in budget. Great salads, French onion soup, quiche, and omlettes. My friend sat at the bar and ordered coffee and baguette stat. They delivered with a smile."}
{"text":"Went today to eat with my friend and her young girl and i loved it. Everyone is so kind and the food was amazing. I would call the make reservations on the weekends because they get fully booked fast."}
{"text":"Owner did reach out to correct the situation."}
{"text":"Wow!!! What an amazing place! Food is wonderful, but the real gem there is Kat. She works the bar and I can not begin to put into words how she has blessed my life with her kindness. She truly makes me excited to go back there. 
The food is amazing, but for a broke college student it can be a bit pricey. Way worth it thought!! Splurge and pamper yourself with the great food!! 
I will continue to go back there!"}
{"text":"This place is wonderful. Fantastic food, great atmosphere, friendly, attentive wait staff. This is one of Charlotte's unsung gems."}
{"text":"The best brunch I've ever had! The smoked salmon eggs Benedict and banana flambé Belgium waffle were delicious! I highly recommend this restaurant to anyone looking for a great brunch!"}
{"text":"Glad this wasn't our first time here.

On a busy new year's Eve day for brunch, the place was just not on the same page.

People who came in after us finished their meal before ours came out.

The sausage I ordered was ice cold.  Nothing more disgusting than cold meat.

I ordered no toast due to dietary issues, of course they pile toast on my plate.  I'm very sensitive to sugar.

My kid ordered fruit instead of fries... got fries of course.

When we complained, they bring over macaroons, which of course I cannot eat.  Nice thought with an equal amount of thoughtlessness.

Poor form today.  Gotta clean it up, or this might be the last time in.  Pay better attention to details."}
{"text":"Cafe Monte is absolutely my favorite restaurant in Charlotte!  I must enjoy this restaurant about three or four times a month!  The host and hostess work to get you your preferred seating and the service staff is outstanding. I've never ordered anything that was not delicious, not to mention the wonderful atmosphere!  Warning; you must make a reservation for the week-end nights two or three days in advance!  Enjoy"}
{"text":"First time @ Cafe Monte for Brunch today. The food and atmosphere were great. The restaurant is a bit loud though. I had a Croque Monsieur and fries. I enjoyed everything we ordered. The wait staff was friendly. The service was a little slow but we were not in a huge hurry so it didn't bother anyone. Look forward to trying this place out again."}
{"text":"Delicious fresh prepared food with a French flair. Walking through the door one forgets they are in a suburban strip mall surrounded by chain steak houses and the mall. Cafe Monte is as close as you can get to an authentic French cafe in the queen city. 

Our table ate:

1. Smoked ham crepes. Perfection with a generous dollop of cream.

2. Kids crepes with nutella and strawberries. Um, can't go wrong with chocolate and strawberries.

3. French country breakfast. Includes hash brown, sausage, toast, eggs. Traditional fare, but with flair.

4. Eggs benedict - this also included the hash browns and eggs were poached to perfection.

Food was delivered within 5 minutes of ordering on a busy Sunday, service was always there with water and coffee refills.

This is a gem of a brunch spot. Can't wait to try their lunch menu."}
{"text":"As usual... the same great flair and comrade re.  Bravo n music starting now.  Even if u come in early or alone u will get the same attention as a party of 10.  Never had a bad meal or glass. U need to get with this.  Peace"}
{"text":"Having had Cafe Monte for breakfast a good while back I was expecting the food at dinner time to be on the same quality. We had the fondue as an appetizer which was good. Ordered the duck confit as my main. Presentation was lacking seems like they just threw the food on there. The duck was really dry and basically the only part I enjoyed was the skin. And for $20 meh I ended up eating everything because I was really hungry. Probably won't be going back with there being so many French restaurants around."}
{"text":"Came here first on a Thursday morning around 11 am, and was surprised of nice interior. I was expecting a small little café that served sandwiches and coffee, and was surprised of how deep the restaurant is. 
I ordered a cup of Earl Grey, the Parisienne Omelette, and my husband ordered the Eggs Benedict and a shared order of crepes with maple. 
The Omelette was very good stuffed with brie cheese, and came with toast with jam and butter, a hashbrown soufflé thing. My husbands meal looked very rich with hollandaise and running yolk- something I wouldn't enjoy. The crepes were nothing to write home about, I can make them better, and the maple wasn't maple, it was aunt jemima crap. Thank goodness we had a groupon, I didn't look at bill, but after my second visit when I paid the bill I realized what a rip off this place can be.
Second Time, 11 am on Sunday, seated right away, I went with two clients and brought my toddler son with me. I had the Earl Grey, and Endive Salad with added chicken, blue cheese, and apple. They ordered Florentine Omelette which was similar to my Parisienne omelette I ordered before, and the pate which I tried and did not like (kinda dog food like) , granted I didn't know what to expect, bc it is nothing like foie gras! My son had a kids meal grilled cheese and ham on croissant with pomme frites, and for 6 bucks it was plentiful and delicious!! They ordered mimosas, tea and café au laite. The bill came to 71 for breakfast and it was my treat.. So of course I was a little salty that my tea was close to 4 dollars for steamed water and a tea bag! My salad was expensive as it was and since I added chicken I think it tacked on another 6 bucks(another kids meal) and there def wasn't enough chicken to equal 6 bucks! Her pate was pricy for what it is, dog food and bread. lol

Overall, Would not pay full price here, and only come with groupon!
Never again order hot tea. But, I did like what I ordered and want to order more."}
{"text":"I went here for a weekday lunch yesterday with coworkers.  The atmosphere is cute and quaint.  I felt like I was in a little French Bistro.  The menu had many options and I had a hard time choosing.  I went with the hamburger.  I think it would have been good had it not been so undercooked.  I usually prefer my steaks on the rare side, but this hamburger was a little too pink even for me.  The french bread while I was waiting, the side of fries that came with my burger, and a chocolate macaroon for dessert was delicious though!  I will give this place another try sometime."}
{"text":"I ran across this restaurant when I was researching places in Charlotte that served French-style beignets. I am used to the ones from Cafe Du Monde, in the French Quarter. When we sat down, our intention was just to get an order of beignets, but when we saw the menu we decided to try some of the different items on the menu. We started with the Four Cheese Fondue (gruyere, swiss, mozzarella, pecorino) It came with bread as well for dipping. It was so good. Melting Pot has nothing on their cheese fondue. My husband had the Duck Confit with broccoli, fingerling potatoes, duck demi-glace. The duck slid off the bone. The broccoli was cooked to perfection. The fingerling potatoes where possibly the best potatoes we have ever tried. 
I have a black pepper allergy so my options where somewhat limited, but I ordered the Shrimp & Artichoke Crepes with spinach, lemon bechamel. The lemon bechamel was so creamy. the lemon gave just enough kick to send your mouth watering for more. I think the combination would be better on pasta then with the crepes (crepes got a little soggy), but I would and will order this plate as is again. To finish off our meal I ordered beignets that came with some preserves, and a hot chocolate. The hot chocolate was very rich, but I could tell it was made with milk and not water. My husband had the lemon tart. I do not like meringue, but this was really good. There are flambeed marshmallows on top of the tart and the crust is somehow flakey but thick and buttery at the same time. I was not disappointed with any part of the meal. We will be going back and try some of the other fantastic looking foods on the menu."}
{"text":"I really wanted to like Cafe Monte...some of my friends just rave about it.  On a recent trip for Saturday brunch, however, my omelet my was nothing short of tasteless.  My friend wasn't impressed with her meal either.  I may try it again, but only not for brunch."}
{"text":"Have been coming here for about 3 years,  and I am beginning to wonder why. 

Was in for dinner recently, service was good, wine was good but at $14 a glass for  Sauv Blanc over priced. I had the \"herb roasted\" chicken.... dry, and flavorless. She ordered the crab cakes which were a style I have Never seen before ... 3 round disks that were flattened beyond recognition maybe 1/4\" thick, total weight Maybe 2 oz! Half the plate was filled with red pepper aioli ... ( mayo and canned red peppers) seriously the mayo was twice the weight and surface area of the crab pancakes ?? I guess the \"crab\" was the accompaniment ?? the remainder of the plate was filled with spinach that was barely warmed and wilted mixed with very obviously canned peppers and nothing was done to hide that fact. We rarely complain, but did this time, the server ( Caroline I think) was very good about it. The replacement pasta was better but not by much. 

Great location, but with the new competition the kitchen needs to get its act together.
I am giving 2 stars for the service only."}
{"text":"We found the place on Yelp and decided to stop in for lunch before running some errands in the neighborhood. The atmosphere was delightful, and the food was excellent. My wive ordered the Parisian omelette with Gruyere rather the the Brie and cheddar offered on the menu. Unfortunately, it came with the Brie. They offered a replacement which we declined, but they comped a second glass of wine. My chicken and mushroom crepe was huge and delicious. We will return the next time we are in the neighborhood."}
{"text":"Eggs Benedict and Beef Short Rib Baguette are recommended. They have the skinny fries which were cooked perfectly. Everything was delicious. The kids were a fan of the Nutella crepe with a side of fruit. The staff was also very friendly and accommodating with our children. We will come back again."}
{"text":"I have eaten here 5 times now, either alone or with a friend. The food is really good and so is the coffee and bread. Friendly service and great outside seating in the shade. A relaxing spot to have a meal or snack. Bon Appetite!"}
{"text":"Cafe Monte is the best restaurant in Charlotte! Everything is delicious, very authentic and comes out quick. Our waiter Sean was fabulous too! Try the fish, crepes, salads...well, everything really!! Feels like I'm back in France."}
{"text":"Always the perfect place for lunch or dinner.  The food is always delicious and the service is just right.  Love to go there and share a bottle of wine and a few hours of conversation.  I am never disappointed!"}
{"text":"My husband and I eat regularly at Cafe Monte because it is one of our favorite restaurants.  Yesterday I ordered an omelette with egg whites.  Half way through my meal, our server, Jennifer G came very apologetically to our table and said that she had discovered that the kitchen had made the omelette with whole eggs.  She had the kitchen re-make the entire meal, which I took home and had for dinner.  Both Jennifer and the manager were so very apologetic and took the meal off of our bill.  The service is always like this at our fave restaurant."}
{"text":"Best steak in Charlotte, NC - especially for the price ($22!) Better get the béarnaise with it as well"}
{"text":"We went here to have brunch with a friend that was driving back to Nashville, TN following our meal.  We had reservations for 8 and while the food was decent, the customer service was horrendous.  Our checks were brought to us before our whole group finished our meals. Beyond that, the hostess came over and stood right by our table...paused long enough for us to look up...and said (rather loud and rudely), \"I need this table set up for 12.\"  We had been there an hour at this point. While I realize brunch is a busy time, I found this behavior unacceptable and will not be dining at this restaurant for this very reason."}
{"text":"The atmosphere was great during Sunday brunch, good mix of people(After church crowd, older, younger, those recovering from Saturday night, etc..) decor was very much French bistro, outdoor seating and forced to walk by the pastries and goodies as your seated inside. The service was lacking.. I will echo the not refilling cups of coffee trend the other reviewers mentioned. The classic eggs Benedict were great and the hollandaise was perfect. The ham and egg croissant was very uninspiring and was served alone on a plate, some fruit or salad would have been nice. Will return to try their fries and onion soup.... to see if that influences my rating.... until then..."}
{"text":"Cafe Monte is a great place for a Sunday brunch.  I just happened to run into this little spot while visiting the Palm steakhouse.  Cafe Monte is located at the adjacent parking deck.

The interior of the restaurant is clean, lively and very inviting; everyone seemed to be having a great time when we went.  The service was great and the waitress was very accommodating and didn't mind taking a few minutes to explain a couple of menu items for us.

I enjoyed the \"french country breakfast\" along with a side of french toast.  I must say, that Cafe Monte has some of the best french toast in Charlotte.  The french toast was crispy and golden on the outside and nice and soft in the middle, just the way I like it.  I washed my meal down with some very good french roast coffee, and I must say that this was some of the strongest coffee that I've ever had in my life, it was a real pleasure to drink such a beverage.

The best part of the meal was the check.  My two entrees (french country breakfast, coffee and french toast) totaled around $22 and it was totally worth it.  I don't recall what my frat brother had, but he really seemed to enjoy his meal too.

I recommend giving this place a try.  The lively atmosphere alone, makes the meal very enjoyable."}
{"text":"Cafe Monte did not disappoint!!!!  I bought a couple of $15 Groupons for breakfast and decided to give them a try.  This is a gem of a restaurant on Fairview.  Forget the Groupons - I will be back monthly for this delectable treat. 

The music in the background adds the right ambience.  The patio seating is the best.  The French bakery meals remind me of home - New Orleans.  I highly recommend them.  The customer service is by far the best in Charlotte. I had the fruit de mer omelette with smoked salmon, crab, lobster, scallions and tomato.  It also comes with seasonal fruit, Toast with butter and jam, and a potato cake.  I was so excited I even ordered the wild mushroom, goat cheese and arugula pizza to have for lunch later."}
{"text":"A great new addition to Charlotte- casual dining. The portions are just right, at a good price and there's something for everyone.

Service is very slow though."}
{"text":"This place is amazing. A work colleague took me here for dinner, and I was really impressed. The entire host and waitstaff are highly professional and look after the customers' individual wishes and concerns throughout the meal experience. Of course the most important part of going to any food establishment is the quality of the food itself, which I can confirm is excellent at Cafe Monte. I had a pizza that was just the right size and was topped with fresh ingredients. When I found out that the establishment also serves breakfast and brunch, I went there several times for that, too. I usually get the parisian omelette with brie, which is the perfect breakfast if you are really hungry! Since I have been to Paris several times and studied francophone culture, I appreciate as well the attention to detail with respect to the furniture and overall decor. I guess it feels like being in an authentic French brasserie but without the actual Parisian, unpleasant side order of waitstaff attitude!"}
{"text":"My wife and I used to love Cafe Monte; went all the time.  Then we took my brother in law there a year or so ago for his birthday, and noticed a significant decline in both service and food.  We took a year off after that and tried it again this weekend.  It's actually declined a bit further still and I doubt we will be back.  French onion soup, which used to be pretty good here, came out tasting like dirty dish water (I think they must have actually made it wrong).  Steak was a poor cut - fatty and not remarkably prepared.  Prices remain pretty high ($20+ for an entree).  Menu hasn't changed at all in years.  Wait staff pushes you out the door.  Over the course of the meal, I noticed other customers complaining about one problem or another.

Given the competition in Charlotte, they need to step it up.  Perhaps freshen up the menu, retrain the wait staff, improve the food to justify the prices.

Positives: bartender mixes good drinks; great live jazz some nights.  We really did once love this place so I hope they get it back on the rails."}
{"text":"I have eaten at Café Monte before and have enjoyed it thoroughly so I was surprised at what happened when I stopped in for lunch today. I was seated at the little bistro table next to the window and ignored. While waiting for up to 15 minutes without so much as a glass of water, I noticed that others that were seated after me had been given water menus and conversation by their waiter. I went up to the hostess to ask her why I was being ignored by the waitstaff. I had my jacket on and was ready to leave as there are numerous other restaurants in the area. The manager came over as I was leaving the restaurant and asked for a minute of my time. I explained why I was upset and why I was leaving. He said he wanted to make things right and offered to comp my lunch if I stayed. I went back to my table. The waitress came over and apologized for ignoring me. Apparently during the table assignments to the waitstaff my table was missed and no one was assigned to it. The manager brought my lunch over and apologized again and the hostess came over to the table and apologized as well. They made things right and  turned a bad situation around. I left Jennifer a nice tip. I will return to Cafe Monte.
PS-The chicken salad plate is fantastic, and their coffee, although not French press, is excellent."}
{"text":"Excellent almond croissants!  Waiter was attentive and professional."}
{"text":"Very poor service. Food is slightly above average for a typical brunch place. Restaurant is grimy along the walls. This place used to be great for brunch, but you can tell the owners have really allowed it to settle into mediocrity. They have also botched two take-out orders recently - made me wait 45 minutes once and completely messed up the second time.

Also, don't get the lobster salad - made a family member sick for two days.

Avoid and go elsewhere for brunch."}
{"text":"I just finished breakfast at Cafe Monte.  I ordered the French Country Breakfast.  The meal came out in a timely manner, but with no skillet potatoes.  I didn't realize this until after my server delivered the food.  I finished my meal before anyone came to see how things were.  I informed them that I did not receive the skillet potatoes, and was assured they would account for that on the bill.  They deducted $1.10.  A side of skillet potatoes sells for $3.50.  I understand there may be a portion difference, but I don't feel $1.10 was a sufficient discount for not receiving (fully) what I ordered, and having to let them know at the very end of my meal.  I like Cafe Monte and will come back, but this was not my best experience."}
{"text":"I love this place, food is great, service is awesome and the food to die for. My favorite spot to go to. Just went for restaurant week and there menu was the best"}
{"text":"Went there as it was my mother's pick for her birthday dinner and she loves their salmon. The baby spinach salad was good but the french onion soup was bland.  Unfortunately, three of us ordered steak options and none of us were impressed. Meat was tough and not flavorful. One was the nightly special and the other two were regular Steak Frites. Total bill with tip for a salad, soup & 6 meals - no alcohol, was $180. Service was fine but with quality and cost, we won't be back. If you like salmon, give it a try, but I'd pass on ordering the red meat."}
{"text":"Dined a Cafe Monte today with a friend and had a great lunch.  The chicken salad is always great and the atmosphere is buzzing.  The place was packed and the staff were happy and helpful."}
{"text":"Last Saturday, my husband and I stopped here for brunch and we really enjoyed it.  The ambiance in this place transports you to a cute Parisian cafe and gives you a full French experience.  On top of that, their service was great.  I really enjoyed my cafe au lait but wasn't too thrilled with my florentine omellette.  The omelette wasn't all that flavorful and it definitely needed more gruyere.  On the other hand, my husband's fruit de mer omelette was amazing!  The flavors of the crab, smoked salmon and lobster complemented each other quite nicely.  We will definitely be coming back to see how their dinner menu holds up!"}
{"text":"I lowered my expectations ahead of time since I'd read the other yelp reviews, but Cafe Monte managed to outdo themselves with bad service AND bad food.

Our server passed by us several times, and when after 10 minutes I asked pleasantly if my companion and I could please order some water and coffee, he literally rolled his eyes and walked away. Then he served the beverages with no utensils or napkins. 

I won't quibble with the uninspired menu -- it's Cafe Monte's choice to offer what they wish, and mine to patronize the place or not, based on looking over the menu in advance. 

But the simple strawberry crepes were stone cold -- not room temp, not chilly, but obviously just plated straight from the fridge and served! (OK, in fairness, they may have been run from the freezer through the microwave on \"defrost.\")

The filling was the same pasty, tan substance as the topping. I thought it might have been a flavored cream cheese but I discovered at first bite that it was neither flavored, cream, nor cheese. 

Should I have sent it back? If I had seen our server, or any server, I might have. Rather than ask my companion to wait while I attempted a reorder, I nibbled the few slices of strawberries, picked at the crepe itself, and chalked it up to another mediocre suburban restaurant outing. 

Au revoir, Cafe Monte."}
{"text":"The food and ambience were spot on for brunch. We found the service to be lacking but it would not keep us from coming back."}
{"text":"Excellent food.  Excellent service.  Great for brunch or dinner.   Two thumbs up.  Way up!"}
{"text":"Great brunch.  Excellent cafe au lait and espresso.  Very good burger and delicious fries.  My wife had the steak and eggs.  Casual, comfortable and satisfying."}
{"text":"I've been here for lunch and found the food ok, the service less so. Mainly, I've come because of the outpost of Amalie's bakery. 

Still, I was excited to hear about the breakfast hours and made the rush-hour trek to try it out. Unfortunately, doors locked, lights off, nobody home. 

I don't know who posted the breakfast information but, if they are going to start serving in the mornings, they haven't yet. One start for getting me out into the rush hour."}
{"text":"This is such a great place to eat, but try to go at an off time. At the popular times, they still serve you well, etc. But I just like to go for a relaxed meal. On a Friday recently we made sure to go before 6pm and it was so nice. We had a relaxing meal, and the food was awesome. My husband had a nice thick swordfish steak, and I had the Chicken mushroom crepes. YUM! My martini was the best I've had in a long, long time."}
{"text":"The food and ambiance were great! It was hard to choose what to order because everything looked so delicious! We will definitely be back to try more on the menu! The only negative was the cappuccino that I ordered was served warm rather than hot. Otherwise great experience!"}
{"text":"Good food if your not celiac. Their \"gluten free\" menu is available upon request. I requested a gluten free meal off this menu and unfortunately was not served a gluten free meal. Very sad because it was yummy but completely not worth being so sick after. Will not return and I hope they take cross contamination and gluten free allergies more seriously. If you can't comply just do not offer the options."}
{"text":"Wonderful evening!  The atmosphere,  service, food - all were outstanding.  I had salmon. My date had veal shank.  Everything was superb!  The veggies, mashed potatoes -   wonderful. And, the bread is amazing.  Frankie was our server. Job well done!

I am looking forward to returning for breakfast!"}
{"text":"Excellent brunch!!!  I have only been a few times to this place but the staff is very helpful and the food is of good quality.  I have only been for brunch and it was delicious!!  The atmosphere is really cool here too.  Definitely very cafe like :)"}
{"text":"As always, had a great customer experience and a fabulous brunch...this time on Easter Sunday! It's our favorite brunch location in Charlotte!!!"}
{"text":"You know those restaurants you go to, eat at, aren't particularly thrilled or disappointed, and the restaurant kind of just disappears from memory?  

This is how I felt about Cafe Monte the first time I dined about one year ago. Service was on the slowish side, and the croque madame was like something I could make at home.  It was good, but not memorable enough to go back for another one.  

I recently went back for take-out,  after a French onion soup craving.  To my surprise, the menu had expanded and now included some items like a lobster Louie salad, which I was so looking forward to, paying an $16 for.  A good crab Louie on the West Coast is well worth $16. 

Unfortunately, it wasn't worth it here.  The soup was pretty standard to be honest.  Granted it was takeout, so the soup wasn't steaming, but even if it were served fresh from the kitchen, the cheese would at least have a nice golden brown coloring to it.  The cheese on this thing was white as white/pale yellow as can be. I would pay $4 for a cup of this stuff...not $7. 

Moving on to the salad.  I was more than bummed.  The Louie usually has avocado, hard boiled eggs and sometimes asparagus and some other variations, depending on where you get it. 

Here at CM, there was just leaves...and chopped lobster meat.  The lobster was plentiful, don't get me wrong, but it was as tough and bland as rubber pencil erasers. I felt ripped off.  I could envision the chef taking salad leaves out of a bag, and sprinkling pre-boiled lobster on top. 

Hmm, so far not so good. At the time I was HON-gree, so I ate both. On to dessert. 

The dessert case here is beautiful.  There was french macaroons and coconut macaroons, various croissants and fruit tarts, and a bottom row of cakes. I chose a slice of carrot cake, and a blueberry muffin to take home to my husband who likes a good blueberry muffin. 

I'll tell you.  The cake could very well have been from COSTCO.  No, wait, the COSTCO carrot cake is better.  I'm not kidding.  This one was dry and the only saving grace was the frosting, which moistened things up. The blueberry muffin too was dry as if it weren't fresh. (It was $5 badly spent, and I was mad at myself.)

TIP: I should have asked if they made their pastries in-house, or bought them from someone else.  Also ask when they were made. 

The saving grace?  My kind server who prepped my to-go order, gave me two free French macaroons. Were they light and tender on the inside? Yes.  The shells, nice and crisp? Indeed.  The flavor?  Very off. I think a good macaroon should have a distinct flavor, and if you don't know what flavor it is, could recognize it. I couldn't tell if it was apricot or honey...heck, it could have been ground beef flavored, and I wouldn't have known. 

The reason I give CM 3 stars versus 2, is the good service I got the second time around from the server and man at the host stand.  The order was about 7 minutes late.  (I called and was told it would be 20 minutes, it ended up taking 27 minutes. Hey, my car has a timer in it so I took note!) The ambiance is quite nice, very Parisian. I've heard nice things about their brunch and perhaps it's true.  For dinner, these two items which are pretty difficult to get wrong, fell short.  

The star count could go up if perhaps CM thought of itself like a bistro, and lowered their prices.  Focusing on a few really great items and making things more consistent. 

Go if you have a BOGO coupon from one of those coupon books or group-buying sites.  I would spend my $ on LuLu if you really wanted some French."}
{"text":"Good place for dessert, excellent customer service, live music on Friday night. A safe bet in an upscale neighborhood."}
{"text":"We reserved a table at Cafe Monte last Saturday for a special occasion dinner. The front half of the restaurant really does feel like a french bistro, and with a wonderful duet of a trumpet player and a piano player, the music was great.

Service was attentive. We brought a bottle of wine from our cellar and corkage was $15. Our server noticed the bottle in its neoprene carrier as soon as she showed up and asked if we had white or red, and what style glasses we wanted. 

My husband and I were both dying to try the steak frites, since we loved that dish in our favorite restaurant Paris. He ordered his au poivre, and I ordered mine with Bearnaise sauce. I'm docking Cafe Monte one star because they completely undercooked my steak. I ordered it medium, and I received a steak that was rare, as in cool in the middle. My husband ordered his medium rare and he also received a rare steak.

I prefer my steaks medium, but will eat just about any steak on either end of the spectrum of doneness so as to avoid sending it back and risking spit, so I kept my mouth shut. Be prepared to have your steak undercooked if you eat here.

Aside from that one issue, everything was great. Hopefully they'll get some more knowledgeable cooks in the kitchen in the future."}
{"text":"Been here a dozen times. We first started coming because my wife studied French in college and we've been fortunate enough to travel to France numerous times so Cafe Monte seemed like a great place to visit (and it is close). Tonight was the first time with a groupon. We tried to use it last week. When we arrived on a Tuesday we were told no additional discounts with their wine special only to find out groupon is considered a discount when the check arrived; even though our food far out priced the groupon. Tonight we arrived at 7, all \"specials\" were gone. Ok, but this is the 3rd time this has happened in recent visits (2018). Yes, the specials are that good (especially the coq au vin) and it sucks that you need to be a \"seasoned\" guest who arrives at 5 to enjoy the specials. So we order off the menu. My wife gets  the steak. Again for the third out of four recent times the steak came cooked not to order (she wanted medium, not well). This seems to be a trend as the time I tried their beef wellington I was underwhelmed that the pastry part was dry and filet was medium well (no good for BW). My wife is GF and Cafe Monte offers GF bread as an option. We asked 3 times this evening and still nothing. I feel that the last 6 months the service and now the food have both gone from a 5/5 to a 3/5. Again, this is review is off of a dozen visits in the last 2 years, not just one. I really hate writing reviews that aren'5 5/5, but I feel that after 12 visits and multiples visits in 2018, this is needed."}
{"text":"I don't get to travel to Paris very often - okay, not at all - and all flights to Paris from here can be pretty costly, even if they're direct flights. But when I'm jonesing for un fixe Parisien (I made that up), I can't go wrong with Cafe Monte. 

Portions are generous - I recently got an arugula salad with a pretty hearty serving of roasted chicken, with a massive side of berries - so you won't leave hungry. And don't forget to sample their pastries, with a delicious cup of fresh brewed coffee to go with it. 

Love, love, love the decor and the atmosphere. Okay, so it's not really like the bistros that line the streets of Paris, but, what the hell, this is Charlotte, and this is as close to the City of Lights as some of us will ever get. 

So don't whizz all over my dreams, okay?"}
{"text":"Food is ok. I had risotto and that's hard to pull off. The flavors were off and it was bland. I feel like the food is well cooked but not flavorful everytime Ive been there. The deserts are perfect so just for coffee and tea it's fine. I felt like I was under dressed and I was wearing a skirt and cardigan...it was lots of stuffy old ladies who lunch and I defintely felt a little up turned nose my way by the wait staff. The menu is puzzling because of all the Italian food on a French menu. Wtf? I did enjoy it for my couponed price and might be back for carrot cake but maybe to go."}
{"text":"I've been to Cafe Monte quite a few times for brunch- so I can't review any other meals.  It is a great place to meet your girlfriends to have brunch and then head next door to Polished Nail Salon for pedicures. ;) I love their french toast, and have heard my friends rave about the eggs benedict.  I definitely recommend this restaurant for a nice, relaxed brunch.  The weekends can get very busy, but I've never had to wait very long to be seated.  Good service, nice ambiance."}
{"text":"Simply fantastic! Using Zaget categories, Cafe Monte gets 5's on all; Food, Decor, Service, and Cost."}
{"text":"I ordered the tuna melt and it was amazing!! Super friendly stuff and awesome vibe! Definitely would go back"}
{"text":"First timer at Cafe Monte for Sunday Brunch and it was amazing. We made a reservation for 12:30, restaurant was very busy. Very bright and light atmosphere, nice French decor. Nice outdoor seating area. Wait staff is awesome, our waiter Frankie was wonderful! 

Okay on to the food. We started with the beignets, if you don't know what those are they are fried dough balls with powdered sugar and Cafe Monte's beignets were the best I've ever had! Lightly friend and soft on the inside, you can either get three or five to an order. For the entrée my mother got the quiche florentine and a side salad, the quiche was very cheesy but not overly so, and was delicious. My father ordered the quiche lorraine with a side of French fries, both were delicious! I ordered the beef short rib sandwich, which comes on a warm baguette with beef, provolone cheese, and arugula. It was hands down the best sandwich I have ever had! 

Portions were very generous, prices are very fair, service was very attentive and kind, five stars!!!"}
{"text":"Went for brunch this past Sunday.  Food was good, but not anything special.  Service was just okay from the seating to the actual meal service, which was a bit slow.  I had the Benedict Monte, wife had the crabcake Benedict.  Again, nothing particularly wrong, just not so great.  I don't think we will be back for breakfast.  Terrace cafe is a better choice, pancake house maybe too depending on what you like."}
{"text":"If you'd like to be treated like an American in Paris with snobbery, nasty looks, and complete lack of service then Cafe Monte is for you. Not only was the hostess rude and uncaring but the food took forever to arrive and was lackluster when it did. The bland omelettes needed salt/pepper badly but we couldn't seem to get any. The coffee tasted like stale diner coffee. It was just an awful experience overall. I don't expect to be treated specially with an infant but do expect some basic understanding. 

When I told the hostess my babies hands were ice cold outdoors and we really could use an indoor table, I was told we would now be at the end of the wait list (which was now 45 mins long). No \"I'm sorry mam\", straight face, inconsiderate tone. She was also unfriendly to my husband when he initially approached her for a table. 

My suggestion- dine elsewhere. For $14 an omelette it felt like highway robbery. 

Update: the owner was very prompt in responding to our negative experience and offered for us to come try cafe Monte again. We certainly will, as we had heard great things. His attitude was professional and apology sincere. I was impressed with the communication and it assured me our experience wasn't typical."}
{"text":"I'm going to do a pro & con list to make it as easy as possible to lay out my thoughts about the restaurant. Consider my review more like a 3.5.

Background/Facts:
- I've eaten at Monte more times than I can count. 
- I visit mostly for breakfast and brunch. 
- I've been to Cafe Monte several times for dinner.
- My husband has celiac disease and cannot have any gluten.

I'll do the con first so as to end on a positive note. 
Con:
- Biggest problem is food quality consistency. I tend to find a favorite dish and order it over and over again. Doing things this way makes me aware of any changes made to the dishes (also, simply the poor execution of said dishes). So, for example, I can't help but notice when the English muffins served as part of Monte's Classic Eggs Benedict suddenly become smaller and very hard. I wonder each time I order Eggs Benedict if the poached eggs will be runny as one would expect or hard boiled. I detect when a chef uses way too much onion in the quiche Florentine, and I lament when the quiche is hopelessly soggy. Knowing that the food can be fantastic on the next visit keeps me coming to Monte. I just wish they could tighten things up when it comes to the consistency of ingredients and food/cooking quality.

Pros:
- Beautiful atmosphere. Sun streams in during the mornings, and the restaurant feels romantic at night. The music from French artists adds to the delightful feeling at Monte. I like the furnishing and decor choices whoever designed the space made. It hits on a lot of what Americans expect French cafe dining to feel like, but it does it without being overly Disney-fied. Also, there's usually plenty of parking close by.

- Servers are always friendly, knowledgeable and helpful, which is especially important when dealing with the gluten-free thing. We eat there so much, the employees know us by name or at least face.

- Coffee is always great!

- Great place to take out-of-town guests.

So there you have it. Cafe Monte will remain on my restaurant list in maximum rotation, but I am watching the consistency issue. I hope I am not let down."}
{"text":"My wife and I celebrated our 5th anniversary this weekend. The ambience, staff and food made it a very memorable experience. It was extremely busy on Saturday, but we managed to find a place at the corner of the bar that was quiet and intimate. 

We had several delicious small plates including a salad with strawberries, a cheese plate with a freshly baked baguette and the most amazing burger we've had. Our server even gave us complimentary glasses of champagne which accompanied our carrot cake. We would have tried the chocolate tart that  looked amazing but it had already sold out. 

We would definitely return and highly recommend this restaurant."}
{"text":"My whole family went here for Christmas Eve dinner.  Hoping to experience a nice evening, we were disappointed.  The duck and salmon were was too oily.  And the steak was tough.  The flavor was nice, but definitely left something to be desired.  But we were very disgusted when they pretty much kicked us out.  At 9:35 pm!!  They started clearing our whole table before some of us were even through with dinner.  As we started to get ready to leave, they even turned the music off!  They just couldn't wait for us to get out!  The last time I am taking my business there."}
{"text":"Just walked in to grab a coffee and pastry. Stood at the counter for 2 minutes waiting for service. I was completely ignored by 6 different people who made eye contact so I walked right back out. Not pleased."}
{"text":"My wife and I have been eating here since the place opened. Like a good French wine, the place improves with age! The service is always great and rarely is the food anything but great!"}
{"text":"Our third time here for either brunch or dinner. Each time the quality of the experience has declined. This time the hostess quoted a 15-20 minute wait. After waiting for a half hour asked how much longer the wait would be and was told \"I told you it would be 30 to 45 minutes\". Had that been the case I would have walked out. 

Ordered eggs Benedict which were very good served with a greasy cold disk of potatoes that tasted like they had been fried with fish. I should have substituted salad. The other three at the table said the meal was ok and all remarked that it was not warm enough. 

I still can't believe a French restaurant does not have Salade Nicoise on the menu. Ah well!"}
{"text":"Would have loved to try this place out but we were turned away which is a complete first in my life! They said they were not taking walk-ins but offered the bar which was empty. We said we would sit at the bar but then were told we couldn't sit at the bar because we have a child. Why offer the bar when you see we have a child when it's \"against the law\" to sit at the bar with one? We have sat at other restaurants at the bar before so I don't know what's different here. We are new to North Carolina so out of curiosity I asked what the different rules were regarding children since we have sat at other restaurant bars in North Carolina with our child with no problem and the manager was very defensive and rude. I have a feeling they just didn't want a child occupying a seat that an adult could potentially sit at making the restaurant more revenue. Very disappointed."}
{"text":"How does this place stay in business? After having an acceptable lunch, we decided to try it for dinner. My beef dish was inedible, the red wine served warm, the hummus refrigerator cold, and everything else at best mediocre. It's a very nice looking restaurant, but after this experience, and after talking with several other people who have also made the major mistake of trying to eat there, we will not be back."}
{"text":"Despite my terrible experience, I really did appreciate the response I received from the owner of the restaurant, Mr. Smith. He approached me with class and professionalism.

I do feel that it was my responsibility to report that incident to the proper authorities who conducted a thorough inspection of the restaurant. It is clear to me that this was an isolated incident that will probably never happen again. The roach or moth (whatever it was) did create quite a situation but I am ready to move on.

I wish Mr. Smith, his staff and his establishment all the best."}
{"text":"Amazing coffee, lovely staff. Great place to spend a rainy afternoon inside, or sunny day outside on the beautiful patio surrounded by palm trees. Like a mini getaway in the city."}
{"text":"Came here for brunch twice and both times everything was great!
It does get very packed for brunch so I would suggest making reservations ahead of time!
The bread they give you before your meal is so soft and yummy!
The first time I came here, we tried the escargot and beignets for appetizer and they were both really good!
I had the chicken and mushroom crepe which was delicious and huge portion! 

The second time I came here we had the french onion soup -which was a bit bland and sweet ( not our favorite) 
For my entree, I had the lobster and crab crepe- SO yummy! they give you tons of crab meat!
My husband had the steak and egg which he was satisfied with. 

I also got an order of the almond chocolate croissant to go which was to die for!!!

This place has quickly become one of my favorite brunch place!! yum!"}
{"text":"This was one of the best food I had in a while. We came here for lunch and everyone's food was great, specially the French onion soup."}
{"text":"Disclaimer: I've only had take-out from Cafe Monte, so I can't attest to the ambiance or service.

What I can tell you is how amazing their pizza is, more specifically the Mild Mushroom pizza. Oh my this pizza is divine. It's a decent size for $14, can feed up to 2 people. The crust is light, not too heavy nor oily. There are mushrooms a plenty on this baked pie, nestled in with a heaping amount of goat cheese. If this doesn't sound yummy enough, the finished product is covered in a giant's portion of fresh arugula.

I totally want to try something new, but this pizza is so to-die-for I can't bring myself to order anything else.

FYI: bogo coupon in the Charlotte Citipass book!"}
{"text":"Step one foot into this Parisian Bistro, smell the coffee, see the people, fall in love! If you've never been to France, the decor, music, and food will take you there. Right here in Charlotte!!! I finally made it to Cafe Monte one Sunday for Brunch and the place was full of people!!! I was alive when I walked in. Really reminded me of a Bistro in Paris. I waited for close to an hour for my table, which is reasonable on a busy Sunday afternoon with no reservation. After being seated, my only complaint was that I wasn't getting good natural lighting for food pictures lol! I had coffee to start, the Cafe Au Lait (I think). Wasn't all that thrilling. Anyway, I ordered the Waffle with flambeed bananas, bacon, and of course frites! Everything was good. The bacon (which I call a gateway meat seeing that I don't eat pork) was marvelous! My guest had the quiche. She thought it was a little overcooked. Our waitor wasn't the most attentive, but other than that, we really enjoyed this place. Hope to get back soon!"}
{"text":"We've only been here for breakfast. The restaurant is pretty small, and it gets busy. Don't be surprised if you have to wait. 

The crepes and quiche are delicious. The coffee is not great."}
{"text":"We love this place for brunch.  I would have given 5 stars except the wait for food and service was unusually long this past Saturday and the food didn't come out very hot.  Service is excellent and food is worth the price.  We love the ham & cheese crepes, salmon Benedict, traditional breakfast, bananas foster crepes."}
{"text":"Food is good, great price, but it's a shame, because the service is not. 

Ask the server to take a pistachio, French Macaron off the bill, as the Manager told me it tends to be harder than the others after I brought it to her attention. She went to confirm; Manager comes back and says \"I offered to give you another one not to take it off the bill, but ok.\" BRAVO! Great response. Monte would be proud!

Same server gave me a coffee saucer with this random debri on it, I asked what it was, she looked at me puzzled & said, \"Coffee grinds\" (didn't look like coffee grinds to me) .... \"Ma'am please give me another saucer, thank you.\""}
{"text":"Worth a trip out of your way to go to.  Excellent food and super friendly wait staff."}
{"text":"The wife and I recently went for dinner at Cafe Monte on a friday night. From the moment we entered the building the ambiance was perfect, low lighting, french classics playing in the background, pretty lively but by no means overwhelmingly busy. The food that I had, warm baguette to start, steak frites for my main course, finishing with the crème brûlée, was all excellent. My wife also enjoyed her risotto and french macarons. Excellent experience, would recommend."}
{"text":"I thought $6.00 was a lot for french beer, but the bartender sold me (only three beers on tap and one was Stella A).  I was not disappointed, beer was great, with a hint of cinnamon. 

We had a large party, so we had to remind the waitress for more bread and she forgot a few drink orders, but she was friendly. 

I had beef over mashed potatoes and it was succulent, tender to the touch. Everyone was raving about the salmon, which looked good.  The creme brulee is awesome, I tasted the chocolate mousse , which was good but the brulee was great.  Tables are a bit close together, so I would not plan on a quiet conversation unless you go late afternoon."}
{"text":"French stuff intimidates me--Chanel, Bastille Day, their food, wine, accents and the list goes on. 

But once again I was introduced to a new place thanks to my bff, Groupon. I went here the other day for breakfast and it was decent. I split the eggs benedict (quite tasty) with another Yelper while sipping on coffee....when we could get refills that is . Even though there were only three other times in the place (so want to say joint but thought I would class it up a bit), our waiter seemed to be MIA most of the time.  You know what would make this place better? A little person who goes by the name of Monte walking around to each table in a striped shirt, beret and thick mustache while reading french poetry. Cmon, how can that not make you smile??"}
{"text":"The food is good, but the front of the house staff is rude and the manager doesn't seek to find resolution with issues. I'm not sure how they train their waitstaff, but our waitress had no idea how anything was prepared and made us wait a long time to find out. The manager wasn't helpful with a coupon we had. Additionally, the front of the house staff wasn't welcoming, or courteous. I was completely unimpressed with their staff, especially in the competitive southpark market. Fortunately, their food is very good."}
{"text":"Everything was perfect. Especially the poached eggs. Which is so rare. The food is delicious and the environment is relaxing."}
{"text":"I absolutely love this place. It's not too pricey compared to other french restaurants in town and definitely not stuffy. The beef and asparagus crepes are the best. They often have live music and people singing on the weekends, which I love."}
{"text":"My daughter and I love this place for lunch.  It is so cute.  She loves the nutella crepe and I, the tuna melt.  We both order the pomme frites.  They are the shoestring style that are thing and crispy.  We have also been here for dinner on several occasions and Cafe Monte excels in that are also.  I haven't had anything yet that I didn't like.  Service is always excellent."}
{"text":"Love, love, love this restaurant!!

Rachel, our server was great!

Chef Justin is also incredible!! He normally works nights and I'd highly recommend getting a taste of what he creates!!  

I ordered the croissant, mashed potatoes, and a side of sauteed zucchini and squash. Yum! Amazing! These croissants are very French.. So of the best I have tasted. There mimosas are also some of the best I've had. Really good orange juice with the right amount of fizz to it combined with a good pearing of wine.

Trout & Pom frites -  Loved it!! Way better than anything my friend has had here!!! Her favorite so far! She liked it best with mushrooms and no capers. 

Cesar salad - croutons were the best part. The romane was wimpy, hardly any crispness to it. 
    Dressing:
    · Cesar- Not good, hardly any flavor bland with light fishy after taste
    · Champagne vignette-  good

My friend ordered the Salmon one time & salmon eggs Benedict another. She said they were both outstanding and perfectly cooked! 

For dessert: The original coconut macaroons bring me back to my mom's cooking. Incredible!!

Highly recommend this place!!"}
{"text":"Good ambiance, pleasant selection of french songs, food though not that great. Heavy sauces flooding your meal is not quite what you would like to eat. The vegetarian crepes were ok but too much sauce. Penne pasta hasd a heavy sauce, again too much. Tea is grocery store type, coffee not great either. Service unattentive. I would recommend it for the ambiance and maybe a glass of wine or beer."}
{"text":"This place is located in the south park area ergo it gets a lot of traffic and its always packed. That being said, it's not all its cracked up to be. If you go on a Saturday, expect a large crowd and loud music to the point you cannot hear yourself.

The food is ok. I'm not going to do a cartwheel over it at all. Definitely not worth the long wait."}
{"text":"Wonderful experience! Though I just stopped in for coffee before meeting a client, I was greeted promptly! The cappuccino was amazing, the staff kind and professional! Would highly recommend and I'm most definitely coming back. The patio area was tidy and chairs are comfy which usually isn't the case with outdoor seating. Beautiful inside and out!"}
{"text":"My son and I enjoyed this restaurant. We went on a Sunday so there was a wait but it was well worth it. We ate some macaroons while we waited. Breakfast was superb and I loved the people there."}
{"text":"We' We' Cafe Monte'
This place is amazing from the service to the ambiance to the food. The only reason I didn't provide them with 5stars is because it's ridiculous to charge $5 for a scoop of ice cream to accommodate a dish that is served hot and typically with ice cream in the perfect world (bread pudding).

We visited Cafe Monte for the first time during Queens Fest after riding past on a regular while visiting Whole Food. We were impressed with the staff upon arriving for our reservation and how nice they were and how quickly we were seated even though we were early.
The 3 course meal plus a glass of wine went as follows:
Salads: I had a tasty arugula salad with grilled peaches atop and my husband had a duck salad that he devoured 
Main course: I had the scallop risotto and my hubby had the sword fish both were extremely tasty. 
Dessert: we both had the bread pudding which was amazing and even better with the ice cream that cost $5 for one scoop to share (Really).
The wine was tasty as well we were given the house Pinot Grigio and Pinot Noir .
Overall we will give them another try and not order ice cream unless it's included with the dessert (-;"}
{"text":"My partner works at 11 a.m. on Sundays, so it's difficult to find a brunch place that opens earlier than 10:00 a.m. so we can enjoy a nice, leisurely brunch.  For that reason alone, we normally just go to the Original Pancake House.  On the drive there, we were reminded of Cafe Monte, a place we had always driven by but never stopped.  We turned into the parking lot and discovered -- what's this? -- they open at some crazy-early hour on Sundays.  We walked in and I was immediately excited, as I was reminded of the French cafe at Epcot, as well as an awesome coffee shop in Chicago.  The restaurant was immaculate and decorated so perfectly, giving it that French feel.  The accompanying, relaxing French music only added to the mood.  We were seated right away.  We walked past the display case of pastries, past the grand counter/bar, and into the dining room full of dark wood accents, large mirrors, and vintage images of Paris.  Already I was glad we had picked Cafe Monte over OPH.  

We were greeted promptly by our server and ordered coffee.  The coffee was brought out in small stylish cups and I was worried -- being the big coffee drinker I am -- that it would be a challenge to get refills.  I'm happy to report that not once did our server (or other servers or manager) allow me to see the bottom of my smallish cup.  

I went with the Parisian omelette on the menu, which was ham and bacon with your choice of cheese.  Naturally, I chose brie.  We were in a French restaurant, right?  It was full of ingredients and very flavorful.  The brie really accented it.  Served with it was a thick round hashbrown patty, a small bowl of fresh fruit, two slices of -- ta da! -- toasted French bread, and whipped butter and freshly made (?) jam.

Everything was absolutely perfect about our experience that I can't say enough about it.  The pricing was slightly more than you might normally pay for brunch, but it was totally worth it.  The atmosphere, the service, and the food were everything that I needed for an awesome brunch experience, so I'd gladly pay the couple extra dollars.  Thanks, Cafe Monte!  We'll be back!!"}
{"text":"Went to Cafe Monte last Sunday for a brunch. It is a very nice kinda upscale bakery/restaurant. For the brunch I ordered a Charculerie Plat as a appetizer for all of us to share and with its assortment of cured meats, olives and patte it really hit the spot to start off with. For a main course I had the Parisian Omelette which came with a fruit cup for a side. The \"Parisian Omelete\" may sound kinda fancy but it's really just a ham and cheese omelete but since they prepared it with brie instead of american cheese I guess that made it a little more classy than usual. Either way, the omelete itself was well prepared and tasted as good as any omelete I've ever had. The fruit in the fruit cup was actually pretty fresh which is a big bonus for me since a lot of places seem to kinda fall short in that department. 

Our group had a lot of people (I think 20 spread out between two tables) and the servers did a very good job of keeping up as well as the kitchen. My water was always topped off and I never felt either neglected or overly annoyed. The only thing I would say was a little bit of a minor turnoff was the prices on the plates. Could have probably shaved a dollar here or there but otherwise it was a good dining experience."}
{"text":"Great spinach salad with rotisserie chicken.  We had a very friendly waiter who was so kind to baby and brought him fruit to munch on!  I really liked this place.  Very classy with an authentic french bistro feel.  Love the chairs....feels like Paris!"}
{"text":"This place has it all--great food, wonderful atmosphere and a charming decor.  I have been here many times and always enjoyed my food. The eggs benedict is marvelous and the wine list is superb. The servers will help you choose a good wine to go with anything.  Sometimes we go just for apps and wine!  The bakery is part of Amelie's and is delicious!"}
{"text":"Cafe with romantic atmosphere. Good but limited menu choices for entrees. Inattentive servers (even when they're not busy) and too many mistakes made. I like their quiche too much!"}
{"text":"We had a perfect Sunday brunch from start to finish!  I made the reservations via OpenTable on Saturday night for a 10am Sunday brunch, we woke up earlier than expected and hungry.  It was super easy to update my reservation to 9am using the app.
We arrived just before 9am and were warmly welcomed by the hostess.  We were seated right away and our waiter brought us waters.  My husband ordered Benedict Monte and I got Crab Cake Benedict.  I don't like runny eggs so I asked for mine to poached medium-hard.  As surprising as is may be, it is rare for a restaurant to get my eggs right, but Cafe Monte poached them PERFECTLY.  I almost couldn't believe it.  My meal was absolutely divine.  And the small bite of my husband's was very good as well.  We completed the meal with a Nutella crepe and fresh strawberries. One word: YUM!  
All the staff we encountered were pleasant, friendly, and helpful.  Our waiter was attentive without being annoying.  Our entire experience was fantastic.  We will be back."}
{"text":"Best place in Southpark to get brunch! I recommend the french toast. The staff is always friendly, and you can make a reservation because it does get crowded on Sunday! Love this place."}
{"text":"My family hosted a rehearsal dinner here for my wife and I (60 guests in our party), and had a fantastic experience from start to finish. The staff, including Monte himself, consulted with us to create a unique food and beverage menu specifically for our event. I can honestly say the entire evening was flawless, which is a testament to the caliber of people that work at Cafe Monte. In fact, many wedding guests came back to Cafe Monte for brunch the day after the wedding. I highly recommend Cafe Monte for large dinners/group events: the food and wine, service, and atmosphere are all top notch."}
{"text":"i'm kinda obsessed with they're soups!!!! dislike the servers and they're arrogance but the soup I love!!"}
{"text":"Cafe Monte is a favorite among several friends, and I have had some exceptional experiences here, and some experiences i wish I could get in a time machine and avoid, hence the mediocre stars which regresses to the mean. The ambiance tries to evoke a Parisian bistro atmosphere which is mostly succeeds at.  It benefits from a great location in SouthPark. Typical entree prices are about $12-14.

Here's my advice to have a 5 star experience:  1) Get the crepes. I don't care if you want a sandwich, or a plain old eggs breakfast. Forget it. Get the crepes. Best savory crepes in Charlotte, hands down. I have had the chicken coq-au-vin special crepes and they were OMG.  I also had the shrimp and artichoke crepes with lemon creme and they were similarly amazing. As in \"I don't care if I gain 10 pounds from this one meal, I'm finishing every last bite\".  2) Go on a weekday or a late weekend lunch. Forget going on a nice sunny brunch. We went once and literally were there for 2+ hours and our food (regular eggs) took 1.75 hours to prepare after we finally got our order in. It just is jammed, and the kitchen apparently doesn't know how to deal with it. 

Their quiche is pretty good, and their dessert is OK, but crepes are the standout. I wish Crepe Cellar had savory crepes as good as Cafe Monte. Maybe I might come back when they have jazz?"}
{"text":"ate outside on their small sidewalk.
Inside looked very nice, but the weather was too nice
I was pleased with the food and the desserts were sinfully delicious."}
{"text":"Good food, decent prices and great service. We went to Cafe Monte with a couple friends on a Tuesday night. They were having there special food and wine pairing that I guess they have once a month. Unfortunately, you do have to reserve a seat for the evening so we were not allowed to participate. I am not sure if it is worth the $55 they charge for it or not. 

We started off with their cheese and aged meat appetizer ($16) which was delicious. Our food came a little to quickly as we were not even finished with the appetizer when the food arrived. My wife had their special. It was four seared scallops over a real meaty lobster risotto ($26). Her meal was absolutely phenomenal. My friends had the basil pasta with chicken and the crab and lobster crepe ($22). There honestly was not anything overly special with the pasta but it was good. I believe it is the cheapest thing on the menu for $16. The crepe was not visually appealing at all but made up with it with the taste. It had a good portion of crab that made it really good. I had the duck confit with fingerling potatoes and brocollini ($24). The dish was sub par. Duck should be crispy on the outside skin and moist inside. however it was the opposite. The skin was not crisp and the inside was dry. I tried to compensate the dryness with the sauce but it just didnt work well. The server was fantastic and asked what I wanted instead. I had the steak with frittes. It came with a NY cut steak and frittes. She did not charge me for the steak so I do not know the price. Although it was good it was nothing special and I would probably not order it again there. We did not have dessert but you can actually see all there desserts as they have a little pastry counter. Their tiramisu looks really good. 

Ultimately, not all the food was stellar but I would go back and have that scallops with lobster risotto anytime."}
{"text":"No one every wants \"French Food\", but this place will change your mind. Great atmosphere, and our server was fantastic. My wife had the chicken and mushroom creeps and it was great.   I had the short rib baguette and it was in the top 10 sandwiches I've ever had. Everything blended together perfectly.  We look forward to our next visit."}
{"text":"We went here for Sunday brunch.  I would recommend a reservation.  We had a party of 6 and were seated immediately at 1230pm.  Excellent service.  Everyone enjoyed their food.  We had HOT BEIGNETS that were great to share for a starter. Entrees for our table were Croque Monsieur, Lobster & Crab Crepes, Fruit De Mer Omelette,  Benedict Monte and Herb Basted Salmon.  They were all fantastic.  We will be back!!!!"}
{"text":"I really enjoy this place.  I like the atmosphere and the gluten free options.  Belgian waffles? Yes please.  It is a little pricy.  It does remind me of the little cafes in Paris.  I would go back again and again."}
{"text":"One of my favorites in Charlotte!  This is my go-to place when I want a guaranteed delicious meal.  I love sharing the cheese and fruit plate or yummy hummus as an appetizer, or having any of their delicious salads to myself.  My favorite main course is the basil pesto penne with chicken--never disappoints!  Other favorites are the seafood crepes and pizzas.  This is also a great place for brunch.  Think french toast, delicious omelets, and eggs benedict.  I've also enjoyed (way too) many desserts.  You could easily come for the coffee and bakery treat alone.  

They often have live jazz music which makes the atmosphere even more fun.  This is a perfect date night spot and also great to get a group of friends together.  I'd recommend Cafe Monte to everyone!"}
{"text":"Tres Bien! 

Hopefully that's right....I'm brushing off my high school French classes....so forgive me in advance. 

I'd had this place on my radar for a while. And since I finally had a few days off I decided to give them a try. I'm sooooo glad I did! 

The atmosphere is adorable. I loved the decorations and flowers on the tables, it truly makes you feel a bit fancy. 

I stopped in for lunch and started with a bellini. That thing was delightful. It packed just the right amount of flavor and liquor and I could have helped myself to a few more. For my meal I went with a classic the croque-monsiuer. It's basically a ham and cheese sandwich on steroids....because it's got so much extra goodness!  There's crispy bread, it's stuffed with ham and cheese and then topped and baked with guyere cheese on top....OMG....seriously I can't tell you how good this sandwich was. I enjoyed every bite! It comes with a side of fries, they weren't my personal favorite a little too \"crispy\" (burnt) but if cooked a little less they'd probably have tasted a little better. But they certainly didn't take anything away from how tasty that damn sandwich was! 

I figured why not go all the way out and splurge on dessert....so I ordered the beignets. And I did not regret my decision at all. They were by far some of the best I've ever had. My goodness. Basically it was hot sugary goodness in a basket....trust me you will want to give these a try. They are absolutely worth it. 

I'm ready to go back, I want to try their brunch and other sandwiches and entrees....and I will make it a point to get the beignets EVERY time I'm here."}
{"text":"Great service, great atmosphere and good food. We kept it relatively simple but enjoyed our meals. My husband got the French country breakfast, which gives you a taste of everything, and as the waiter told us, is the most popular order. The wheat bread was nice and thick, whole grain and different than your typical store bought bread. I had the eggs Benedict. The hollandaise sauce was tasty and the poached eggs were perfectly delicious. I think the Canadian bacon could have been a tad crispier but still tasty. The English muffin could have been toasted more as well. The potato cake was unique and their spin on home fries; it was nice and crispy on the outside and softer on the inside. I didn't even need any ketchup or sauce with it. I ordered the Americano and the waiter came back to fill it with regular coffee when I was done (complimentary), which I thought was a nice touch. Next time, have to try the beignets!"}
{"text":"Café Monte is a great brunch spot.  Our server yesterday was amazing.  The best service I had in a very long time.  She was always around right when we needed her.  She was polite, and able to explain the menu very well.  I really appreciated her as a server.

The food was delicious.  They have awesome savory crepes but for sweet crepes, this is not your place.  The sandwiches are also good if you are more of a lunch person.  The do offer pastries from Amelie's and their coffee is also good."}
{"text":"Let me start by saying that I love Cafe Monte! Their food is so delicious! The service is generally great as well, but the most recent visit was mostly unpleasant. We attempted to redeem a dinner groupon (30 dollar value) for lunch (I completely overlooked that!) and even after speaking with the manager he still wouldn't budge to make an exception (our ticket was $30 before tax and gratuity). While I understand that there are policies in place etc, I was mostly displeased that they would haggle over a few dollars. And while this situation was mostly my oversight, the entire ordeal left me with a poor impression of their customer service. I always highly recommend Cafe Monte to my friends and it is my favorite place in southpark, but this incident definitely dampened my enthusiasm about eating there or recommending it to others.

PS. I received a personal message from the owner with an apology after I posted the above review! I was blown away and gladly changed my stars from 2 to 5! Thank you Monte!! We will be back =)"}
{"text":"The food was done well and very tasty! I had 1 complaint, everyone's eggs Benedict was cold, Not lukewarm but cold. I think it's important for restaurants to serve food when it is ready and always hot. Other than that this place was really good."}
{"text":"This used to be my favorite brunch spot (mainly for their Eggs Benedict), but after the last three times I've ordered EB here I'm strongly considering looking somewhere else now. The main issue I've been constantly having is that they over-poach their eggs; the yolk is not runny whatsoever- it'll be of a gelatinous state. Even when I've requested that they be undercooked they'll still come out overdone. Also, their hollandaise sauce has started lacking the vibrant flavor it used to have; now it's close to being bland. The newest issue I experienced today is that they no longer serve a nice, thick slice of Canadian bacon on it... instead they have replaced it with two paper-thin slices of deli-style ham (per side). For around $14 I expect the better quality that they used to serve, not the poor excuse of an Eggs Bene they are now trying to pass off."}
{"text":"Truth be known, the food was and is always great. My complaint is with the manger .
We brought 2 friends with us to celebrate their birthday. When we arrived, I told both the hostess and the 'Manager\", that we are celebrating and I wanted a surprise chocolate desert for their birthday. Both agreed to take care of it
Of course, at the end of the meal, the check came and no birthday surprise. Needless to say, I was pissed. I asked for the manger. I told her that she let me down and all she could say is \"sorry, what can I do\". I told her that she went from hero to zero in 30 seconds.
I wonder what you have to do to become a manger?
Well, we will be back for the food, with no confidence in making any special requests to the \"Manager\"."}
{"text":"We enjoyed discovering your restaurant for the first time. We truly enjoyed the food and the ambience."}
{"text":"Fancy little brunch place. Came here with my family so it definitely meets their uppity standards. Good place to take your parents when they come in town. Decor makes you feel like you're in Paris. 

All I can remember is that the potatoes were so flavorful and delish. I would come back there just to eat a plate full."}
{"text":"Cafe Monte was a great choice for dinner last night. The setting and ambiance was great. They had a band playing Christmas music. The place was busy. We started with French onion soup which was great on a cold day. Then we got the steak frites with Bernaise and the salmon. The steak was cooked perfectly and the frites were crispy and hot. The salmon was really delicious. The prices were very reasonable for the quality. Hot chocolate tastes like Swiss miss and our service was a little lacking. The baguette and butter you get with dinner is so good too! We will be back"}
{"text":"This review is just for brunch. I had a very bad dinner during restaurant week. I would only visit cafe monte for the brunch. Good selection and flavor doesn't dissapoint.  Crisp airy waffles and the hollandaise sauce for the Eggs Benedict was well made. It can get a bit loud and very crowded though."}
{"text":"The excellent service was my favorite part of the dining experience.  We had a slight issue with extra charges not being explained when we swapped side dishes, but it was only a matter of a few bucks.

The steak fritte was very tasty but the french fries were insane!"}
{"text":"Went to Cafe Monte after purchasing a groupon. Made a reservation for a Sat night and off we went for a little date. 

Entered to a half full (at best) restaurant that gradually filled up over the time we were there. We were seated at a nice table that was up against a pillar so we didn't have to deal with being in the middle of the room (which I hate). 

We were given a wine list and menus upon being seated. I am 5 months pregnant and it really shows at this point and the husband had given up drinking for Lent so we passed on the wines. This seemed to off-put the waiter a little but I let it slide b/c he was still nice enough. Felt like we were a little rushed to make decisions about what we wanted to order and when I asked for more time something about the demeanor of the waiter made me feel bad about it. 

We ended up ordering a cheese plate and french onion soup to start. The cheese plate arrives at the table with no explanation as to what the various cheeses are. This really bothers me. There was a cheese that had, what I later asked about, mustard seeds inside of it that was very delicious, but even upon asking about what was in it, all I was given was the answer \"mustard seed\" and that it was the waiter's favorite cheese. Nothing else about it or the other 3 cheeses on the plate (which I equate to a brie, cheddar and goat). Frustrating. 

My husband loved the french onion soup. I took a few bites and found it to be pretty tasty but am not much of a soup person and wasn't in the mood this night so that is all I can say about that. 

For entrees I had the steak frites and husband had the flounder special. First let me say that the portion of steak I received was very large, which would have been fantastic, had it been fantastic, but at best I rate it as pretty good. The frites were nothing spectacular, but all seemed to disappear from my plate with no problem so I would def order those again. 

Husband's meal came out looking like it was sitting in a stick of melted butter and had an overall greasy appearance. I don't eat fish, so I didn't try this but he later told me it was, in fact, greasy, but that after a few bites he was able to move it out of the drippings and then it actually had a good taste. Both entrees were served with green beans which I could take or leave. Nothing spectacular there. 

Ended with an eclair and a coffee for the husband, both of which were enjoyed. 

All in all it was a decent meal and I am happy that we went and gave it a try. Perhaps if we had been able to order drinks and wine it would have made the whole experience better, but that just wasn't in the cards right now.

I would like to give big props to the lady who kept my water glass filled until the minute we were getting up from the table! That truly made this thirsty pregnant lady happy."}
{"text":"Loved that the mussels and fries reminded me of Belgium.  The cocktails were delicious and the wine choices were lovely.   I also had the creme brulee which was delicious.     I went with a group of 6 for dinner and everyone enjoyed their meal.  Service was good and ambiance was relatively quiet."}
{"text":"I'm a first time patron.  Service was very good, and it should have been - it was pretty quiet for late lunchtime.  Was expecting to fight a crowd, but I guess I am thankful I didn't have to but also curious that I didn't have to.  Got lucky I suppose.  Made a mistake in ordering the hamburger \"medium\".  It was tasty and I managed to eat the whole thing (waaaay too much bread) but it was also overdone, well beyond medium.    Got salad instead of fries and that was a good choice.  Used an Entertainment 2015 coupon which made my lunch price an extreme bargain.  Will definitely be back."}
{"text":"Me and the wife tried went for brunch and and a great experience. I ordered the Quiche Lorraine with salad and the portion was plentiful and tasty. My wife had the French Breakfast and upgraded her toast to a croissant which she raved about. We had to wait about 20 mins for a table but it was worth it! The service was real good as well. Would definitely go back and recommend to friends. We were seated at a small 2-person table which was crammed next to another table and which was our only discomfort."}
{"text":"The food is delicious but the service is less than desirable.  For lunch with a friend it took 2 hours and it is not because we were sitting around getting lost in conversation.  We both ordered iced teas and two salads with chicken on top.  I got my tea refilled ONCE, and after finally taking our food order, it took 50 min. for the salad to be served.  During the lunch hour, this is just unacceptable.  I have not returned to the restaurant since which is unfortunate because this used to be my go to place with friends."}
{"text":"Food and service are consistently stellar. 

My most recent visit included a family member with pretty major food allergies and he inquired about a dish's ingredients. The waiter seemed a little nervous and sent out who I believe to be the owner, who was extremely gracious.

Everything was delicious and we plan to return soon. Some of our favorites are the Trout Amandine, Beef Bourginon short ribs, Mussels with frites, and any of the crepes. Their desserts are also to die for.

Fabulous place overall, check it out, you won't regret it."}
{"text":"To poach eggs so perfectly when a restaurant is packed is an art form that has been masterfully achieved by Cafe Monte. I feared it was overhyped.  My skepticism was shattered and I can't wait to go back. New favorite brunch in Charlotte."}
{"text":"Loved the atmosphere. It has a real french feel. The food was good as well. We got he beignets for the table and they were amazing. I would highly recommend them. I'm not a coffee drinker so I got the hot coco and it was fancy like any other coffee which was a nice touch. I got the Smoked Salmon Benedict. It was good but I was not a fan of the potatoes that came with it."}
{"text":"I've been wanting to try Cafe Monte for some time now. I found myself close by around lunch time the other day, so I decided to stop in.  I was seated immediately and my server promptly came by to bring a menu and take my drink order.  

Honestly, I was a bit under-whelmed by the menu. I was really hoping for some really nice French dishes beyond just crepes and quiche.  The menu options were ok but not outstanding.  So, I decided to go with the Chicken And Wild Mushroom Crepes in madeira creme ($14).  

I really wanted to try the pommes frites to see if they are as good as I have heard, but I wasn't really that hungry and my server told me the dish I ordered was pretty large.  So, when she brought my plate out, I was glad I skipped the fries on this visit.  The crepes were cooked perfectly and smothered with delicious creamy chicken & mushrooms.  I would order this dish again. 

When I first walked into the restaurant, I had noticed a counter with all sorts of yummy looking pastries, so I decided to order a coconut macaroon to go.   It was tres yummy! 

I agree with Nicole's assessment - this may not be the best French cuisine in town, but it is solid.  On my visit, the service was good very good and I would go back."}
{"text":"Make a reservation, or wait.

I ordered the seafood crepe...overall the food and coffee were great. 

However, the atmosphere in this place is just stale. The people aren't very pleasant at all. I'm from NJ so you'd think I wouldn't care, but I do. When in Rome...since moving down here, I find most of the places I visit, the people are extremely nice and accommodating, I mean SUPER NICE! So whenever I go to a business and people are not, it really stands out. 

I like to enjoy the COMPLETE experience of eating. I would never eat with someone I didn't like, not unless there was endless wine, so I'd eventually not even care. Point is, the food is really good, but I doubt we'll be back."}
{"text":"Service was very good      space is quite nice   location is good   

My wife went recently .... All in all very good for brunch.... 

SC"}
{"text":"I was very excited to try Cafe Monte I can't really give a full review since I didn't eat a real meal here so I'll be back soon.  The outdoor patio is very nice and the service was excellent.  The desserts when you walked in looked amazing (note to self for my next visit).  The menu had the traditional french dishes and they had a nice special on a Prosecco which was just what I was in the mood for.  I opted for the endive salad I would highly recommend it was delicious and shared a meat and cheese plate that was nothing spectacular and fairly pricey.  I'm coming back to try some mussels for sure and maybe brunch:)"}
{"text":"I've had Cafe Monte in my brunch/breakfast sights for quite some time now. Just waiting for the right moment.....to no avail. I made it in closer to 1pm with my wife and started wavering on whether or not breakfast was the right call for sustenance. Cafe Monte was welcomed, despite my late rise. 

I had heard whispers of this French cuisine in the quaint corners of Southpark...bistro music filling the art-laden walls. I was happy to find all of these. The interior is welcoming, spacious and occupied by very cushy chairs. I was enthralled with the music. Timeless and tasteful for the French decor. 

I was a little put off by the host. We waited for a few minutes before anyone even acknowledged we were waiting to be seated. A minor faux pas that can be fixed for sure. The service, once seated, was fast and friendly. 

I ordered the steak and eggs. A rather generous portion of sirloin, cooked medium rare, croissant, beautiful hash browns and eggs. My only hangup with this meal were my eggs. I had ordered them over medium and they were served waaaaay over hard. More along the lines of hard boiled. Rather displeased with the texture, but the rest of my plate made up for it. The steak is wonderfully cooked, flavorful and seasoned. The hash browns are served in a \"puck\" shape and need no ketchup. 

The coffee is also delightful. Black, bold and piping hot. 

I'd definitely venture back in to Cafe Monte. A few slight changes and they'll be a 4.5-5 star in my book! Oui!"}
{"text":"Food was wonderful.  I've had better seating at a McDonald's as they crammed 7 people at a small table for 6 in a crammed corner. We would've enjoyed the food more had we been able to sit comfortably as I had to get the food to my mouth while resting my arm across my husband's chest.  It was also not pleasant being rushed by the wait staff to finish my food so  they could clear the table.  Enjoyed the food but I don't expect we will be back."}
{"text":"Always a treat to dine here. Enjoy the scratch made Hollandaise sauce, beniets and brunch service. Friendly staff too.  Can't go wrong."}
{"text":"I love the ambiance here. It was like being in France (art, decor, music, lighting). We came for dessert and were pleasantly surprised by the options given to us. I was a big fan of the fondue with dark chocolate and the variety of dipping options! Croissants, macaroons, and strawberries yum!!! Also great service and coffee was bold.

Can't wait to go back!"}
{"text":"First of all, this is not a gen-x-er restaurant for brunch. 
It was a nice surprise though. We got here early and by 10 the place was full and the vibe was great. The Jazz music was not my favorite, it was not detracting. 

Food: we were worried that we would have to stop at Wendy's because these pricey places tend to have small portions, especially when the menu is a-la-carte. I'm full so all is right with the world. 

Coffee: French toast was not too sharp. Cafe au Lait and Cafe Americana were both good, not 3.85 and 3.25 good, but good."}
{"text":"Cafe Monte is an excellent brunch spot for those with discriminating taste buds and small appetites.  I arrived with excitement and left hungry.  I know they are going for a \"French\" feel...but it just isn't my place of choice.  I will say our waiter was  GORGEOUS  and the piano man kept me entertained...a no go in the future."}
{"text":"Amazing breakfast! Always come here when I'm in town because the food is consistently delicious. Highly recommend the French country crepe with Brie, the potato cake has a hint of Rosemary which is so elegant. The coffee is outstanding and the entire mood makes you feel as though you are in a French cafe!  Back for dinner 2 days later!"}
{"text":"This place is pretty much neck and neck with Georges. Great food and service, nice atmosphere. The beef wellington and duck pizza are great."}
{"text":"This was our first time here. I got the crepe with berry compote and my husband got the quiche lorraine. We both ordered the cappuccinos as well. The food was nothing spectacular, just average good food. I wished the crepes would have been filled with some sort of filling. The berry compote on top of the plain crepes was good. Everything was good, just got exceptional."}
{"text":"Ooo la la

My two favorite places in Charlotte are French inspired..  Cafe Monte and George's Brasserie. 

Cafe Monte is great for coffee, pastries, breakfast, lunch and dinner.

Quiche Lorraine is awesome. I love that it comes with a small side salad. The perfect low carb meal.

The coffee is strong enough for me and that is saying something.

I do adore the pastries, but I can't always have them. Booo on calories and sugar.

Recently a friend and I popped in for coffee and breakfast while we sat and used the free WiFi to shop for vacation packages...  we still have no found the right vacation, but we did enjoy the meal.

You have to try:

The quiche
The charcuterie
The crepes
The Macaroons

They outdoor patio is very cute on sunny days.. very peaceful on weekends because the parking lot is less active."}
{"text":"I like Cafe Monte a lot, I am not sure why there are so many mixed reviews. The waiters may seem indifferent at times (possibly this is part of their French ambiance) but I have never had bad service here. They have started being open for breakfast again. They serve European (read excellent) coffee. Their side salads at lunch are really good as are their sandwiches. 
They have a frequent eater card but I am not sure what it does.
If you or your friends are in the mood for a French experience then this is the place to go in Charlotte. They just started offering all you want moules on Mondays, they are very good."}
{"text":"Very tasty and good food options.  I have lunched there 3-4 times and it has become a favorite. The chicken salad croissant is to die for."}
{"text":"Friendly staff and great management. I go mostly for the desserts. BEST éclairs I have EVER had. Food can be a bit pricey but as some of the other reviews indicate, the quality is top notch. Macaroons are yummy also!!"}
{"text":"Smoked salmon eggs Benedict: AMAZING! The food here is great, I have yet to have any bad dishes here. The bread is also to die for. Salads as good, entrees are good, desserts are good, service is great. Love the atmosphere in this place. Highly recommended."}
{"text":"I stopped in for a glass of wine after a unsatisfactory dinner some where else.  I had a glass of Pinot Noir and a great chat with the bartender.  He was nice enough with no hesitation to plug in and charge my phone for me.  I glanced over the menu and it looks great.  I hope to come back soon and try the wonderful food.  Watching from the bar, the staff was very professional and the atmosphere was very bistro like and relaxing."}
{"text":"I didn't eat there but I bought a pastry to go.......three words  CHOCOLATE ALMOND CROISSANT!!!!!! You'll hate yourself if you miss it."}
{"text":"Amazing food! We both got the French onion soup and the short ribs sandwich and holy moly it was delicious!!"}
{"text":"My wife and I came for restaurant week. I had the tuna steak with risotto, she had the sea scallops. We had peppermint gelatto and bread pudding for dessert. All of the food was amazing. Out experience was made even brighter by our wonderful server Lisa. The restaunt feels upscale but not stuffy or too formal. Overall, a wonderful experience!"}
{"text":"I've been to Cafe Monte's many times over the years, as it is one of if not my favorite restaurant in town.  The food is always excellent and the service has also been uniformly good.  I love the Benedict Monte, but have had other dishes that are also wonderful.  A great place really for all occasions.  One of my neighbors goes there for the coffee.  I've used it for dates with my wife as well as extended family meals."}
{"text":"I've dined here several times.   Each occasion delivered stellar service, wonderful food, and exquisite attention to detail.  Today, I ordered the crab cake benedict:  eggs were divine, hollandaise sauce spot-on with its requisite tangy notes, and the cakes were more crab than filler.  And, it was served at the proper temperature, too.  My coffee was refilled routinely. 

My server, Sean, is a top notch professional that added the punctuation point to my meal.  What's not to like?"}
{"text":"Really cute decor on both the interior as well as the exterior. Great place for business meetings/lunches as well as casual or dressy lunches, brunches and/or dinner with family and friends. Food was moderately priced french-cuisine. Dessert display was impressive and wait staff was both friendly and attentive :)"}
{"text":"This was my first time at Cafe Monté, and it was delicious. I had the brioche French toast with berry compote and maple syrup. My boyfriend bad the beef short rip sandwich. His fries were to die for!"}
{"text":"The area was very quaint and the restaurant had a cute French set up. You can tell the thought that was put into constructing the concept of this restaurant. The food was good but it in my opinion nothing too extravagant. I ordered the salmon which came with mashed potatoes and a veggie medley primarily made up of squash and zucchini and I would say my fav part was the mashed potatoes. My cousin let me taste the trout which I will say I can see why it's a fan favorite but her potatoes and green beans looked extremely dry. I will say if in the area I would go again but def don't see myself craving the food here"}
{"text":"We regularly go to Cafe Monte, mostly for Brunch, but sometimes for Dinner.  Service is top notch and the food is some of the best in the city.  Authentic, fresh and lively, as if you went out to park yourself in your favorite Bistro in Paris.  The Benedict styles are my favorite, the quiche is very fresh, and you cant go wrong with the mussels, or any of the omelettes.  For coffee, I usually have an americano and my wife a latte, and they are also excellent, as good as any high end coffee house.  My only problem with the place is that we sometimes make the trip and there are just too many patrons waiting for a table.  I wish we could reserve or they could have more coordination in that sense."}
{"text":"Excellent service, great food. I had the trout amandine, which was a great blend of textures and flavors; my wife had the shrimp risotto, which was also delicious (although not as visually appealing). We shared the escargots, which came cooked into puff pastry and were very tender, but they lacked the snail flavor we expected. Still good, though. My wife had the french onion soup, which she also enjoyed. Overall, a great place for an anniversary dinner."}
{"text":"Lobster served just right ...steak delicious ... felt comfortable from the second we walked in..Dine in Charlotte often love this place"}
{"text":"One of my greatest joys in life is eating and trying new restaurants. I'm not sure why it took me so long to get to Cafe Monte, but I finally did and stopped here twice in one week. 

It's a great atmosphere for Sunday brunch (off the menu) or to meet a colleague over coffee in South Park. The environment is nice, the service is attentive and friendly, and the coffee and food is great! The decor is very French and adorable. Although many people are dressed well because of the neighborhood it's in, I also saw couples that were out for their morning walk or stroll around the neighborhood stop in wearing more casual wear; a place to stop in no matter what you are wearing.

They have a cute, casual bar area to grab coffee and a croissant, little cafe tables outside, or a large dining area with booth seating lining the walls or full tables. Great for small and large parties alike. 

I ordered the Benedict Monte and it was very good. I could only eat half due to its richness in flavor, but that is French food for you. Unless you like that much rich taste, I would recommend ordering a couple items and sharing with your partner to give your taste buds a bit of variety."}
{"text":"I really loved my experience here and I can't believe I haven't been here sooner. I came for brunch with a friend one Saturday and I chose to have breakfast. It was really good and they were not stingy with the bacon!! The eggs were cooked perfectly to my specifications and the hash browns were delish!! The atmosphere is really nice although the seating is only so so. That would really be my only complaint.  It definitely has that cafe feel and I can't wait to get back there and try dinner and one of their chocolate croissants!!"}
{"text":"Hostess was rude. One of them anyway; the other was stunning. Atmosphere inviting and relaxing.  Wait staff phenomenal. Food was fantastic. Good wine selection. French beers even, if you can trust the French in a brewery. But alas, no Creme Brûlée. How could a restaurant professing French in title run out of that?"}
{"text":"Wow! What a great experience. Sat outside for Sunday breakfast/brunch, Jennifer was our waitress and she was delightful:) Amazing food. Omellete, toast, quiche, crepes, lattes, americanos...all of it. Nice atmosphere too. We will be coming back!"}
{"text":"I went to Cafe Monte last week, this time for dinner. I had previously gone for a brunch weeks ago. Now that was perfect, really. Both visits I got a glass of rosé. Each time I got a huge glass and at $8 it's a steal. 
We started with the frites and grilled artichoke hearts which were pretty good. I'd eat just those two things for dinner next time. 
I got a Groupon since this restaurant usually has one available. My husband got the trout which he enjoyed but there were a few bones in it. I got the shrimp and artichoke crepe. I was expecting a lighter dish so when I got a plate loaded with what I think was two crepes and a béchamel sauce it was a bit much. It did taste ok but wasn't what I was expecting. Our server was a bit rushed. 
We had a fine time and it was worth it having the Groupon but I prefer brunch there."}
{"text":"Perfect for a quick nosh or a full meal. Top of the line service. Put this on your must visit list."}
{"text":"We love coming here for brunch. You typically need a reservation for Sunday brunch or be prepared to wait for a while. The service is usually good and the food is great. We have our favorites and generally order the same thing- the chicken club and the short rib sandwich. I really like the short rib sandwich, it is so flavorful. The frites are good, thin and crisp.  - I do wish they had something like truffle Parmesan fries. I order an extra side of the garlic aioli to dip my fries in."}
{"text":"The past two times my husband and I have eaten lunch here have been absolutely wonderful and we have had the same waitress (short blonde hair and glasses). Our service was al at stop notch, and except for the horribly loud yoga moms next to us this past time- it was great. Food is great, service is great, and I always get a kick out of the interesting south parkians who roll up there at lunch time."}
{"text":"I don't know what I was waiting for. I wanted to try this place for two years before Groupon finally got me in the door. I now regard those two years of my life as having not been lived to their full potential. With one meal Cafe Monte instantly became my favorite restaurant in Charlotte. Everything is as it should be from the decor to the food and service. 
 I took my girlfriend there for dinner and our reactions to everything we had ranged from satisfied to blown away. The hors d'oeuvre of hummus and olives was good but not extraordinary, as olives and hummus are difficult to mess up but incapable of ever being good enough to change one's life.
 For our main course she had the trout amandine, which instilled in her the conviction that the inclusion of capers in a recipe doesn't necessarily ruin it. I had the steak au poivre which I had trouble deciding if I should eat slowly, savoring every rapturous morsel or rub all over my body while drooling like Homer Simpson with a box of donuts and crying tears of joy. I trust you'll share my girlfriend's (and no doubt, the other diners') relief that I opted for the former. However, I make no promises that future meals at Cafe Monte will be enjoyed with such restraint. 
 While the desserts looked outstanding, we simply couldn't take another bite. I ended the meal with a cafe au lait while my girlfriend finished her wine. As should be expected from a French restaurant, the coffee was what coffee should be: espresso, or at the very least, French press. Perhaps they have drip coffee too. I wouldn't know. I stopped reading as soon as I saw cafe au lait.
 So I'll be back for sure. In fact, should I ever find myself on death row, Cafe Monte will need well-rested chefs, a fully stocked kitchen and the catering van gassed up to deliver my last meal. I'm totally serious! It may be a little pricier than I'm usually willing to pay for, but hey. It wouldn't be my money. In the immortal words of the Kids in the Hall sketch, \"Screw you, taxpayer!\""}
{"text":"Absolutely perfect. The service was excellent . Javier was on point. The French onion soup was fantastic. The chicken and mushroom crepes were superb. All around excellent experience. Highly recommend"}
{"text":"Very nice French-style Bistro. Went for dinner. I had the Steak Frites, and they were more than happy to substitute the green beans (now known somewhat pretentiously in the French vernacular as \"haricot vert\" - duh, green beans in French!), which are not my favorite, with very yummy wild mushrooms! Steak was a NY Strip, again not my favorite (I'm a ribeye guy) but it was good and cooked medium per my order. However, they gave you a choice of Bernaise or Au Poivre sauce, and I chose the Bernaise. MOST EXCELLENT! Very buttery (Hollandaise base) so good choice! My wife had the Beef Shortrib, and that was yummy too. The taste reminded me of a really good potroast (but up a few notches). The wine special was a Chilean Cab for only $22! In a nice restaurant like this, $22 for a good cab IS a find by anyone's standard (wine snobs excluded). 

For desert we had their house-made Mousse, which was really good! Very chocolat-ey (is that a word? I'm using it anyway).

Our service was excellent, with a very attentive but not overbearing waitress. Food was served hot and was delicious AND very affordable! French Bistros in the bigger cities (NY, Chicago, LA) are MUCH more expensive. Our dinners were just over $20!!! Coming from Las Vegas, THE MOST EXPENSIVE food town in the US (YES, it IS!), our meal would have been more than DOUBLE in LV.

So overall, a VERY good meal and affordable! Definitely a must return!"}
{"text":"Maybe the best French restau in Charlotte. Great food and ambience!! Great food, great service!!"}
{"text":"Love this place. The crab cake sandwich and lobster and crab crepe are awesome. My husband loved the herb chicken.  It's a bit pricey but well worth it!"}
{"text":"Menu options we great - decent selection for vegetarians and gluten free individuals. Was very upset with the quality of the food itself. None of the food we received was seasoned (even the slightest), the waffle came out incredibly cold, etc. 

I really wish the quality of the food was better. Maybe I'll come here again in the future... for the time being I'm disappointed."}
{"text":"Came back with 97 yr old dad for lunch.  It was a risk as his tastes run to macaroni & cheese, pancakes and diner food.  How would he react to French cafe atmosphere and food?

He liked it.  Especially all the ladies that come in from shopping.  Yes, somethings never die!  

Ordered crepes, which he liked.  Generous portion and we both like the rich, fresh coffee.  A real treat and rare find in local restaurants.  Service is excellent and just enough checking to refill coffee and to see if all is well without hovering.

Atmosphere is relaxing and comfortable.  

Menu offers a nice mix of European/French fare along with fairly well-known meals.

A very nice place to have a relaxing meal.  This could be and excellent and safe first date place.  Ummmm.

Will be a regular over time."}
{"text":"We love this place!  We have been many times and our food has always been great.  Our waiters have always been prompt, our meals up without a long wait, and everything is fresh and hot.  I love their half chicken, steak, mushroom Crepes, and omelets.  Vegetables are always served with the correct crispness (not soggy, soft like you get in some places)!  

We love the atmosphere.  While many reviewers say it just isn't like being in Paris... I beg to differ!  Right down to the authentic bistro chairs... this place IS French!  The music, the decor, the window boxes, etc.  all French!  Yes, the shabbiness is missing but the rest is all there.  I can sit and feel like I am back in Paris for just one meal and step right back out into reality when I am through.  :)

Our family really enjoys the decor, AND the food at Cafe Monte.  We will be visiting many more times in the future."}
{"text":"Great food. Loved the salmon croissant sandwich as well as the Florentine omelet. Service was top notch, great location and atmosphere. Cant wait to go back."}
{"text":"I went there earlier this week expecting to be wowed. I was left feeling underwhelmed and a bit upset. Being a new transplant to the Charlotte area I've looked to groupon and yelp as a way to explore my new city and find new gems. Based on the reviews here I jumped at the chance when groupon offered a deal a few months back. Anyone who knows me knows that I'm a francophile...french food is my weakness. 

I chose 4:30 on a Wednesday so I could beat the dinner rush and just enjoy some quiet time by myself with my Kindle. I was the only table there so my waiter wasn't busy. He slammed the menu down and disappeared. No nice greeting, no specials, were given. Five minutes later he comes back and asks am I ready to order? I asked for wine recommendations...none were given, he instead gave me the wine list and left again. Cam back a few minutes later...I ordered my glass of wine, starter and main. Five minutes later he brought the soup and none of the oft praised bread was offered. Disappears, never checked on me. 

Half way thru my soup the entree was dropped off. Never checked on. Are you getting the picture? The place was empty, what was his excuse for such poor service? At this point I'm livid. The soup was meh but my entree of Chicken With Mushrooms crepe was pretty yummy. I knew I should have just called it quits but I'm a sucker for creme brulee. Big mistake. It was flavorless, thick and had this weird pasty taste and mouth feel. I thought that was the final insult but no...there's more. Not only did the waiter not look me in the eye and thank me for my visit...he reached from behind me and dropped the check over my shoulder. WOW! I was pissed...I debated asking for a manager but at this point I was just over it and said screw it. Why bother? Just never come back and leave it at that. I'm not sure why I was treated so poorly. I was an easy table, an easy 20% tip for the waiter even though he was a douche. I've worked in the service industry so I tip well even if the service is crappy. All I wanted was a nice afternoon out by myself."}
{"text":"We popped in for lunch and it was our first time. We had their \"house\" Boudreaux and it was excellent, we split a duck-goat cheese- wild mushroom pizza and it was wonderful, for our entree we had the tuna melt and pommes frites!"}
{"text":"Visited here a couple of weeks ago. Food was great, but the whole reason we went was for the Beef Wellington, which is only prepared here once a week. We arrived 2 hours into dinner service to find out that they had already sold out... pretty disappointing considering we drove from Kannapolis to here just for it and it was only a quarter-way through the dinner service...

Oh well, better luck next time!"}
{"text":"Hands down, this is probably my favorite restaurant in Charlotte. Every time I go here it's wonderful service and great food. I typically like to go on Mondays because of the unique good specials they have for that day. But everyday of the week they have a special, just depends on what you like. Anything and everything on that menu rate great. They have a old school bartender that mixes and serves the drinks just right. The Moscow mule is delicious. My favorite dishes on the menu is the muscles, crab crepes, and chicken crepes. Spectacular place, I love it."}
{"text":"I went there as treat for my birthday with two of my closest friends..The prices..well is a bit pricey, but the food there is asboslutly mouth-watering! The service there was slow... it took about 25 mins. for the waiter to come and ask us for our order."}
{"text":"First time was a charm. Really liked the food. Had the crab cakes Benedict and it was full of lump crab meat. My wife had waffles and she said they were great. Feel good after the meal, not too full and not too hungry. Want to try lobster night on Fridays!!"}
{"text":"I'm in Charlotte for business and asked the staff at the front desk for restaurant recommendation.  She enthusiastically recommended CM.  

I was very disappointed.  The service was terrible. I asked to tell me what most people (regulars) ordered when dining there.  He replied \"steak, chicken, fish.\". I said I wanted to know what items the ordered from the menu.  He pointed to the Trout.  What a jerk.  He brought my dish, which came 5 minutes after I ordered & was not very appetizing in presentation or taste.  I ordered the wild mushroom & chicken crepes... Not good.  I left him a 10% tip which was over tipping.

Wish I had gone to PF Changs instead.

Beautiful city however, I wish I was staying longer."}
{"text":"Were seated immediately on a Saturday morning - completely forgot how busy it could've been and was surprised a table was available.

Started off with beignets after seeing everyone else had ordered them - I immediately understood why. Light, puffy, and not too sweet. Amazing with the berry preserve.

Also ordered berry crepes - very small and probably not an amount worth what we paid for, but they were good.

My new go-to for a nice breakfast."}
{"text":"3.5

I came here today for brunch. When we arrived (party of 4) around 11 we were told an hour wait. We ended up being seated after 30 minutes. They also take reservations through open table, but we found that out after the fact. Next time I'll book one. 

I ordered the Florentine quiche ($12), which came with a side salad. The salad had tomatoes and cucumbers on it with a lite olive oil dressing. Very light. The quiche was good, but nothing that blew me away.  It was actually quite creamy, but that could have been from the cheese. I wish the crust was a little more flaky, but overall I enjoyed it.

Others in my party got the Benedicts and then all enjoyed them. However, the breakfast potato it came with was very bland. Again- good but nothing special. 

Our service was great and fast, however I wouldn't be too eager to return again. Nothing stood out to me to come back again."}
{"text":"I've had breakfast and dinner here, and loved it all!

Friendly, professional service.  Upscale environment, romantic ambiance. The star is the food, though.  Delicious! Everything I tried was delightful.  Go here!  It's a wonderful date night or a nice place to meet your bestie for breakfast or lunch.  You can't go wrong!"}
{"text":"Quickly becoming one of my favorite places in Charlotte. I love the atmosphere and the food is DELICIOUS. I love to sit at the beautiful white marble counter on Saturday morning and have brunch with my husband."}
{"text":"I've been 3 times for lunch. BEST chicken salad I've had that wasn't homemade. The service is consistently amazing too! I haven't had a bad experience and will continue to visit!"}
{"text":"I honestly do not see how this place is rated as high as it is.  Went there on a Sunday and it was packed.  Waited 30 minutes to get seated.  Saw several people complaining about their meals and service.  Hostest was nice. Waiter was slow.  Soup came out 2 minutes before the main meal.   Tomato soup was bitter.  My girl got the seafood omlet.   meh.....100% unseasoned.  Got the croque monsieur.....again plain....no seasoning and way too much cheese and not enough ham...I could make a way better one at home.  Side salad had maybe a teaspoon of dressing on it.  Total waste of 50 bucks."}
{"text":"The professional attitude of the staff and the food quality and presentation satisfies any perfectionist!"}
{"text":"Trout Almandine was delicious!  Beautiful presentation.  Great place for girl's night out.  Diverse wine list.  Dessert menu looked amazing."}
{"text":"Went for brunch with my girlfriend and got the shrimp and artichoke crepe which was wonderful. She got the smoked salmon croissant, seemed like a very popular item and was very fresh. Will be back soon!"}
{"text":"I revisited this french restaurant again last night, taking my boyfriend for his first visit.  It was a very pleasant and delicious experience.  Our waitress was not only accommodating but was very knowledgeable about each dish.  The salad with goat cheese was awesome and they made something that used to be on their menu that is no longer for me as a special extra!  We own 2 restaurants and are very picky about service, food, quality, ambience & prices.  It was worth every single penny and we will definitely be back.  Thanks for a great date night!"}
{"text":"Great Ambience! Great good. Service can be slow at times, but everything else makes up for it."}
{"text":"My husband I ate here for the first time over the weekend and we loved it.  We sat outside on the patio and enjoyed the \"French\" music they were playing.  The sword fish was amazing!  Fyi-it is kind of expensive..."}
{"text":"The food is ok...and ok is not word I wish to use to describe French food. I had the duck confit...it was ok. I've had better at Asian joints. My wife\"s chicken wasn't seasoned to her liking. I had the French Martini and the beignets. Both were good!"}
{"text":"I hate to be writing this review after reading many of the other reviews on here and having high expectations for a delicious brunch. Cafe Monte has been on my list of brunch spots for a while and I was really looking forward to a nice meal.

My fiancé arrived a little after 10 am on a Sunday. We were fully prepared to have to wait for a table so we put our name in and were told it would be about 20 to 25 minutes. We were offered a spot at the smaller bar/ railing where we could order but it was so tight it didn't seem like a comfortable place to eat so we agreed to just have coffee there. About 15 minutes later we had yet to be served or even approached by a server. Spots opened up at the main bar so we moved there with the hope of finally getting some coffee. Service was still quite slow and many others were served before us. We were holding out for our table so we only ordered coffee and refills were few and far between.

After about 45 minutes of waiting for a table we were too hungry to wait anymore and decided to put in our order at the bar. Over an hour after we arrived we were told our table was finally ready but elected to stay at the bar. We ordered the monte Benedict and the fruit de Mar omelet. We were both very disappointed with the lack of flavor and seemingly poor quality of the ingredients. My fiancé stated that his omelet could have come from Denny's. The potato cakes on the side of each dish lacked flavor and the hollandaise sauce on the Benedict was flavorless and arrived to me already congealed. 

Overall the service and quality of food were both extremely poor. The food was also quite expensive for brunch and there are too many great brunch spots in Charlotte to waste money on bad food."}
{"text":"The side of sauteed Spinach was incredibly salty otherwise the color was wonderful and it smelled great. The side of sauteed mushrooms looked really good, but they were way too peppery. I never season my food, when its cooked right there isn't any need to but whoever made those dishes had a very heavy hand. I NEVER leave food behind and I didn't even finish half of them. 

I had to ask for a steak knife. Waited until someone bothered to make eye contact with me to ask for it by the way. The steak was cooked perfectly - rare just the way I like it and the texture wonderful. The thin french fries were great too, very good! Flavor, texture etc. but as I ate the steak there was way too much seasoning on it as well. Seasoning shouldn't over power the flavor of a good cut of meat and this did. 

The biggest issue I had: the staff really needs a lesson in professionalism. I heard one woman behind me talk about a female condom which was just PART of their conversation. They were all huddled in the back while there were people at tables on the floor. Totally turned me off. I saw waitress and waiter in disagreement in the middle of the dining area while setting up a table. One couple complained they had been sitting there ignored. The gentleman got up and said something to a waiter and the manager came over and appeared to make amends in a grandiose way.  My own waiter walked by and for some reason never made eye contact. I was not sure why  - to be clear I NEVER give anyone a hard time nor am I anything other than friendly. Even if the service and food are not up to par. 

I was seated in the back, on the left (if you are facing the kitchens) so had a birds eye view - and ear - to everything. I told one friend that I actually felt like I was in restaurant boss type episode and there was a hidden camera somewhere, it was that ridiculous with the staff and how they were acting. 

The Manager must have realized I heard what I shouldn't have heard because he gave me a box of free pastries and apologized. The staff treated him, quite honestly? - like crap. It was embarrassing. The fact that those kids (some of them - others adults) acted in such a manner in a restaurant that I'd heard NOTHING but rave reviews about? It was disappointing. 

The fact I heard him trying to discipline them - they ignored him - was probably not smart on his part either. He seemed frazzled and angry and just disgusted. Lets just say the atmosphere that night was a 1 star. If the staff acts up like that? Get them in the kitchen and send them home, don't do it where patrons can hear.

In all fairness maybe (hopefully for the owner) this was not a regular occurrence because friends of mine RAVE about this place. For breakfast and dinner saying it was one of their favorites. I went on a Coupon to try it out, and at first loved the atmosphere but it went downhill from there. I also can't see paying that kind of money for a meal that was \"eh\" 

I always eat every bite on my plate and I savor each one. I didn't take anything with me except the free pastries and my french fries. 

I judge a place on different criteria and I have a sensitive palate and nose. LOVE food. To cook it, eat it, buy it, read about it etc. I think I am a good judge of what I see, taste, smell and - hear.

I'd recommend other places before this one for DINNER - may consider giving them a shot for breakfast type fare and will say the ONE WONDERFUL thing - the best thing about this place - the desserts. They were a little stale but it was after 9pm so that isn't a biggie in my book. 

I bought a slice of Carrot cake and Tiramisu - the waiter had closed my bill without asking me about desserts at all by the way......I watched a waitress across the room RAVE about them to a full table of people ( I was solo) and she had me craving them. He was going to give them to me for free because he closed the bill out. I insisted on paying for them and will tell you that it was \"THE BEST\" carrot cake I've ever had! I'd order a whole one for my birthday cake if I could. 

The free pastries the Manager gave me? Macaroons are awesome almond cakes too and croissants with chocolate in them. I would recommend this place as a BAKERY and I may give them a shot - after hearing a friend say the crepes were really good - for breakfast. However, not my first choice or even second for Dinner. 

For the owner? You have your work cut out for you, I am not a professional in the food service industry but you should consider \"Restaurant Stakeout\" if you find your patronage decline."}
{"text":"UPDATE: The owner reached out to me to please come back and give them a second chance. I'm glad that we did. We decided to go for dinner this time and had a great experience. I made a reservation (even though we were going on a Wednesday night) just in case. Turns out we didn't need one, but the restaurant was pretty full by the time we left. Our food was magnificent. My husband and I both ordered the spinach, arugula, goat cheese salads and they were great. The dressing on them was the best part. The complimentary bread they bring to to table was also so good! For our entrees I ordered the salmon and my husband ordered the trout and we both agreed that it was the best trout and salmon we've had in Charlotte. It was all so good! Our server was great and she was knowledgeable about the menu. For dessert I got the lemon tart to go. I wasn't super impressed with it, but it was sweet which is what I wanted. Overall I would recommend this restaurant, just maybe not on Sunday for brunch without a reservation. 



I can't actually describe the food seeing as how we never received service. The husband and I were just wanting to go to get a couple cups of coffee and some beignets as a nice Sunday treat. We got there and the wait was 40 minutes which made sense because it was Sunday at brunch. We asked if we could sit on the patio sooner and the hostess said that was an option. She sat us at a nice little patio table in the sun. We had menus and immediately were served a couple of waters. Perfect I thought to myself this is going to be a lovely morning. Well we waited about 15 minutes and no one had come to take our order. My husband went inside to make sure we had a server and the hostess said oh yes just one minute. Another 15 minutes and we were tired of waiting so we left. Get it together. The food that was coming out to everyone else on the patio looked awesome. So maybe try a weekday."}
{"text":"Superb service, great food and wine selection. Perfect mood for a date night. Loved the duck confit pizza. The place is small and intimate."}
{"text":"Nice ambiance, friendly and attentive service.  Had Pizza Margarite for lunch.  Nice crust, good amount of cheese...a little salty.  I'm new to town, so I drove around a bit trying to find the location (GPS kept telling me I had arrived, but I hadn't)."}
{"text":"Enjoyed lunch today. The steak and eggs were phenomenal, and the croissants (made in house) were wonderful! But even more so our waiter Zachary was absolutely amazing! Very kind and generous gentleman who did everything in his power to make our wedding anniversary special. Can not say enough how much we loved the food, the staff, and Zachary."}
{"text":"On my birthday my wife knew I wanted escargot so she called around and found that Cafe Monte would be willing to make it for me during breakfast hours. The owner was a fantastic person and even brought me a complimentary glass of wine to compliment the garlic butter of the escargot. Needless to say we have found a new IT place for special occasions and random cravings for French food and top notch customer service. I insist that you should give this restaurant a chance; you will leave very pleased."}
{"text":"Really hot place for brunch. Reservation is definitely needed unless U come around 9-10 is on Sunday morning. Nice food as well. I tried the lobster and crab crepe, creamy and fresh. Recommend."}
{"text":"Somehow we've missed this little gem in the heart of Southpark.  We enjoyed the escargot, but mainly went for the live music -- glad we did.  The talented trio not only performed songs in French, but a good many Sinatra hits.  Though the mixed drinks were well mixed, the personalities of the bar staff were flat."}
{"text":"I love this restaurant for the wonderful food, lovely atmosphere and excellent service. Today was no exception. My husband and I came for lunch to celebrate my birthday. I received a birthday certificate for a free entree which made made the experience even sweeter. It was wonderful!"}
{"text":"My hubby and I brought parents and a cousin here for an early Sunday breakfast. We did not make a reservation but were seated within 5 minutes around 9:10am. We had a seat in the back which was nice for people watching and it was away from the door on a chilly day. 

I ordered a latte with almond milk and was disappointed to learn there were no dairy-free milk options. I opted to stick with water. My husband had a hot chocolate and OJ and seemed to enjoy both but I took a sip and personally felt his hot chocolate tasted like Hershey's syrup that was melted and mixed with water and milk. 

I ordered two golden crepes but after reading reviews online added in the regular vanilla yogurt, berry and granola parfait without yogurt. I really just wanted a small cup of Greek yogurt but that was not an option. The berry vanilla option was fine and supplemented the very small portioned crepes. I personally think both were over-priced at $8 each and wouldn't rush back for breakfast. The crepes were served cold which didn't help. 

Everyone else really enjoyed their meals and the breakfast platters were huge. My MIL ordered the GF Belgian waffle and said it was good but was cold and not crispy. 

Our server was nice and efficient. It wasn't my favorite and I won't be rushing back for breakfast but I would try them for dinner."}
{"text":"I had a great date night here. First off the ambiance was very nice - live jazz at a good volume, crowded but not packed, and nicely decorated dining area. Our server was attentive and did a great job of presenting the specials.  The food came out at a good pace and we were never left waiting. We ordered the oysters and the escargot for apps, both were delicious. I got the risotto for my main meal - very cheesy with lots of vegetables and shrimp. Serving size was enough to take home. My boyfriend got the lobster which I tasted and was also very good (although I'm from Boston so I have had better lobster). Beignets for dessert were also great! And even with 2 apps, 2 main meals, 1 drink, 2 dessert, and 2 cappuccinos the total was less than $150 (before tip). Overall a great dining experience. I would highly recommend this restaurant."}
{"text":"I've written reviews for Cafe Monte before. My husband and I started dining there shortly after arriving in Uptown, Charlotte almost eight years ago. Lovely, charming French Bistro, wonderful staff and excellent food. When we left uptown we moved to SouthPark where we could just walk to Cafe Monte, and we did. (Mostly) same, wonderful staff, same fantastic food, beautiful presentation. We live in Ballantyne now and make a point of dining at Cafe Monte when visiting SouthPark. Just ate there this past week and had a chat with Monte who came to our table to say \"hello\". We marveled at how he managed to maintain his standards, consistency in the kitchen, well trained staff. We told him that Ballantyne NEEDS a Cafe Monte (specifically, BALLANTYNE VILLAGE!!!). So here I am on Yelp shouting it out: \"Monte, PLEASE open a Cafe Monte in Ballantyne Village, pretty please?!?\". There now, got that off my chest. :-)"}
{"text":"Good experience on my first visit to Cafe Monte. I love the casual yet classy atmosphere and the warm and welcoming feel you get inside. The service here was spot on. My server was very attentive, and receptive. For dinner I had the lobster and crab crepes with a side of pommes frites. The crepe entree is very filling and full of good flavors. The pommes frites are thin and crispy and nothing less than amazing. I'll definitely return again soon."}
{"text":"I came to Cafe Monte for the first time today with two friends and everything was great from being sat, to service, to food, to paying. We had a great waitress who was knowledgable about the menu and offered suggestions. I love quiche so I just had to try it and it was to die for, baked to perfection  I will definitely be returning soon!"}
{"text":"Our server Rachel was very friendly, knowledgeable, and made sure to replenish our drinks and check in a timely and professional manner. Our salad and entree was amazing and the ambience is elegant and relaxing. Love this little gem. Will certainly be returning to Cafe Monte."}
{"text":"Very nice place and great service. Food and pastries very tasty... we had the Benedict monte and a french onion soup... both very good! Will return"}
{"text":"Definitely going back! Good food, good service, fun atmosphere. Lunch with friends a delight. Ate outside on the sidewalk on the side, not on Fairview."}
{"text":"Arrived Monday at 1245 pm, it was packed. Had shrimp and artichoke crepe and chicken salad crosissant (sadly there were out of the short rib baguette as conveyed by our most apologetic server).Both lunch dishes were tasty, more than generous portions. Always feel you get your money's worth at Monte's. An added bonus was the arrival of Charlotte Panthers tight end Greg Olsen who was greeted with a mini standing ovation."}
{"text":"This is cafe is a little on the pricey side but very doable for the quality you receive.  It is much more than the true definition of a cafe as far as I can tell bc they do much more than coffee and pastries (although they do both of these superbly well!).  their breakfast is top notch complete with Omelet and crepe choices in the classic French style.  Ive had their omelets, croissants, and espresso drinks and they are all top notch in my opinion.  In this respect I would highly recommend it as a breakfast/cafe/ and definitely a brunch stop.  I will have to return for dinner at some point but i have all the confidence that it is every bit as good as its true Cafe offerings."}
{"text":"My first check in getting ready for my first review tonight!   : )


My very first check in and my very first review! I have been to Cafe Monte many times, but never reviewed because I did not use Yelp. However, since I use Yelp often to find reviews, and I am moving to NYC in 3 weeks and will be using Yelp A LOT, I thought it only fair to start contributing. So I headed to Cafe Monte with my main man, Dudley.

I sat outside at the little 2 person tables on the side of the building. It was very hot outside, but I am a summer fanatic. My server was very sweet and was a great balance between taking care of my needs and letting me do some work on my laptop and relax with my dog (free WiFi yay!). 

I got there right at 3:30 and they had switched over to the dinner menu, but they still let me use my lunchtime groupon anyway. No guilt trip whatsoever about it! I ordered the Chicken Mushroom crepes and a side of the Gruyere scalloped potatoes. I have included pictures.

The crepes were so, so, so good. Most enjoyable was the yummy cream sauce as well as the TONS of mushrooms. I will be ordering a lot of mushroom dishes as they are my favorite food in the entire world. The chicken seemed as if it were pulled from the bone- very tender and flavorful. There were about 3 or 4 well stuffed crepes with chicken, 3 different kinds of mushrooms (that I could tell), and that delicious sauce.

The potatoes were not as amazing as I had hoped. They were very thick slices of russet type potatoes with a ton of butter and Gruyere cheese only on top. It would have been great if they had more cheese through the dish. They were ok, but I only ate a couple of bites.

They were so canine friendly! My waitress offered and promptly brought out a bowl of water for Dudley, which after he was done drinking, became his plate. Duds loved the crepes and potatoes, and for a dog he is somewhat picky, so that says something!

I love this place. So much good stuff, and on my next trip back, I will make it much earlier so I can do breakfast!"}
{"text":"We went for brunch today, and it was our first time visiting Cafe Monte.  I was immediately impressed by the atmosphere - it feels like a French cafe complete with a pastry case, and it was great for lounging and slowly waking up on a Sunday morning.  We got the Benedict Monte, which was delicious on a croissant instead of the traditional English muffin, and the French Country Breakfast, which the chef very nicely substituted egg whites for the eggs.  The coffee was delicious, and the service was friendly.  The $30 price tag was a little more than some breakfast/brunch places, but it was definitely worth it!  We'll definitely be back."}
{"text":"I love breakfast.  I especially love eggs, with warm, runny yolks, oozing over some variety of carbohydrate ... mm mm.

Eggs.

Ok, I digress.  Do you know what else I like? I like Cafe Monte.  Why? Because they fed me some excellent eggs.  We had been wanting to try Cafe Monte for quite a while, and once we discovered that they were in our Citipass (the best $25 you can spend, btw), we decided to give them a go for a late Saturday morning breakfast.

The restaurant's space itself is beautiful.  It has a turn-of-the-century Paris vibe that really sets the mood for the food.  Our waiter was helpful and polite in an unobtrusive way that seemed peculiarly French.  Mind you, I've never been to France, so that's a statement of instinct.

Let me not forget the food, for it was delicious.  I ordered the Benedict Monte, with two beautifully poached, wispy eggs, ham, tomato, asparagus, potatoes, and Hollandaise sauce, served with a croissant.  It was fabulous.  

Though our Citipass voucher is now spent, we will return to Cafe Monte at full price with no hesitation at all."}
{"text":"All I can say is this restaurant is amazing and totally impressive every time I go! Hubby and I went for dinner last night. It was a lovely evening, so we got to sit outside on the patio. Our waiter, Shane, was very attentive and personable!

I got the Risotto special that had rich, perfectly seared scallops and lots of fresh vegetables! It was so creamy and savory, I loved every bite! And luckily I brought home leftovers for another enjoyable meal!

My husband had the monkfish special which was over potatoes and vegetables. He really liked it as well! Staff is wonderful and the menu is amazing! We are definitely going back and we don't eat out that much!"}
{"text":"Delightfully surprised as I am not a fan of French cuisine but my wife brought me here and I'll be returning!! Good was great, coffee superb and atmosphere is peaceful. 
Delightful jewel in the crown of SouthPark!"}
{"text":"Cafe Monte has impeccable service and makes me feel like I am right back in Paris when I walk through the doors! From the traditional Parisian bistro chairs to the paintings/decor I feel like I am home again! Highly recommend for the single dinning or great date night location!!"}
{"text":"Came here yesterday for brunch with some friends and had a really good time. We were seated immediately with no wait. Staff was nice and the food came on time. 

I had the crab cake Benedict. The crab cake Benedict was really good. The potato it came with didn't have much flavor but they quickly replaced it with fries after I asked them to with no issues. 

Nice place to eat brunch in South Park."}
{"text":"We came back to Cafe Monte after having had a bad experience in July. The owner contacted me and gave me a gift certificate to make it right which I appreciated very much. I waited until now to be able to go with my dad again as he lives out of my state. The certifícate didn't sway our opinion at all because we don't need those to eat places lol. It was an altogether different experience this time around though. The waiter was extremely attentive and sweet, especially considering we brought my 8 year old and some places in Charlotte seem to frown upon children diners. My dad and I had cram of mushroom soup and coffee to begin and wow, that coffee was fantastic. The soup tasted so fresh and earthy. He went on to have the seafood omelette which he devoured by the time I had a chance to ask if he liked it lol. The filet and eggs I had were perfect, I didn't need a steak knife, it cut like butter. My daughter finished her burger and fries and went on to have some madeleines which she fell in love with. Me and my dad finished with a lemon and pistachio macaron and they were the perfect way to end a perfect meal and experience. Thank you café monte, we will most definitely be back."}
{"text":"Nice little joint in South Park. A bit commercialized, but still a lovely environment. I went for brunch on a weekday and it was good as usual. Highly recommending getting a Group / Living Social for this place, it will keep you and your wallet happy.

Lobster Crepe, Crab Cake Benedict, Steak and Frites, a lot of good menu items. One point of advice, don't get the Beef Wellington when it's their special, they suck at making it, stick to their core menu items."}
{"text":"If I could give this place no stars I would. Terrible service and terrible food. The food is dry and bland and nothing about this place is represented here in the reviews. We took my mother here for an early Mother's Day lunch and we ordered after waiting forever and then my mom found a bone in the chicken salad sandwich, the French toast tastes like a kitchen sponge according to my sister and and nothing but onions in the Lorraine quiche and not gluten friendly as far as many options for those. AVOID IF YOU WANT A GOOD MEAL!!!!"}
{"text":"Love this place for a quick trip to New Orleans without the flight. The Cafe Au Lait is superb. Fruit is sweet and seasonal. The Smoked Benedict was just okay. Eggs were overlooked and Spinach a bit gritty. The restaurant was very gracious. Will come back."}
{"text":"A friend and I tried this place for lunch one afternoon.  You feel like you stepped into a bistro in France when you walk in.  Our waitress was extremely polite but the wait on drinks and food was a bit disappointing.  
We split a pizza and it was delicious.  Would definitely want to back for brunch."}
{"text":"At here for the first time yesterday. Locale great, can actually hear conversation. Sean. our waiter, did an excellent job and knows his food. Excellent menu. Wife had salmon, perfect. I had steak, perfectly prepared and seasoned, but slightly tough. Perhaps not choice. Sampled the duck confit and it will definitely be my next dinner here. Highly recommended."}
{"text":"The restaurant, bistro and bakery opens pretty early in the day.  However, I made reservations for today at 4pm.  It was moderate for a weekday.  I ordered the crab cake sandwich with a side salad.  I really enjoyed it.  For dessert, I had the triple layer carrot cake with butter crunch icing.  I will definitely go back."}
{"text":"EExcellent shrimp with scallops and risitto. Rich and cooked to perfection. A++ in my book."}
{"text":"First time here for breakfast and I'm really impressed.  Excellent service, great atmosphere, generous tasty food.  Sorry I have been missing it for this long.  Started with the beignets and then had a wonderful egg white omelette.  Arrived here 5 minutes before opening and within 10 minutes the place was full of patrons.  Place was packed with a line out the door and still service was excellent.  This place knows what they are doing."}
{"text":"Stopped in for dessert and coffee with a friend, as it was recommended to me by yet another friend.
Cafe Monte did not disappoint. Their dessert menu left me with a very hard decision as to what to choose!!
My friend and I split a raspberry chocolate mousse torte (I hope I got the name close to being correct) and a fruit tart. They were both amazing. 
Wonderful, friendly service. This place is GREAT!!!"}
{"text":"I knew I came to the right place with the crowd flowing in on a rainy Saturday afternoon. We were lucky enough to beat most of the crowd and immediately started off with the beignets. Light, flaky, warm - perfect snack as I debate the many options on the menu. 

I ended up going with the short rib sandwich - the nasty weather left me wanting something warm and rich. This sandwich delivered; tender short rib bathing in provolone alongside sautéd mushrooms and onions with a garlic aioli, topped with arugula to cut through some of that richness. 

Others at my table ordered the tuna melt, chicken salad, and BLT. All received top compliments.  

Service exceeded my expectations, especially for the lunch hours. Our server knew the menu down to each ingredient and made great recommendations. 

I am looking forward to trying the rest of the menu."}
{"text":"Gosh I really want to like this place more.  I want it to either taste better or cost less.  As it stands, the food is decent, not outstanding, and the price is certainly high.  This past Sunday we took all four of the cherubs out to breakfast.  We arrived promptly at nine am and were quickly seated.  Kiddos were presented with a menu - white paper - no crayons, of course.  They only pretend to want children to eat here.  We ordered two kids meals (nutella crepe with fruit on the side) and one of my children ordered off of the adult menu.  I ordered an omelette - the waiter suggested brie cheese - I agreed and it was an excellent choice.  My husband did not like his egg benedict breakfast - he said it was really bland.  The potato cake they served with the breakfasts was also bland. however my daughter loved it.  I have had the nutella crepes before and I loved them but they were only so-so this morning.  My kids were well behaved, everyone ate well, and all was good ... until we got the bill. Over $70.  Really?  My husband asked that I please, please, never let us eat here for breakfast again.  Agreed."}
{"text":"I absolutely love this restaurant. Provides an authentic French cuisine and dining ambience. Food is always superior, and service is usually fabulous. I have always had great experience with my server at Cafe Monte. Jennifer S is a fabulous waitress by the way, I believe she's up for some sort of competition with other servers here and I vouch for her excellence in service! 10/10 recommend to anyone considering"}
{"text":"I love this place! Prime rib sandwich is SO good. It's a little pricey but I think it's worth it :) Great lunch spot while at work."}
{"text":"Try the seafood omelet! Try the crab cakes! You can taste the sea and it's worth every penny. Absolutely delicious."}
{"text":"We went here for breakfast when they first opened and it was delicious, so we decided to try dinner last night. Bad move. While the desserts were good, everything else was sparse, bad, or both. My scallops & shrimp entree was a salt bomb that boasted 2 measly scallops & 2 small shrimp atop undercooked risotto with green beans buried under it. My husband got the large portion of mussels and frites and while the broth was good, the portion was quite small. My mother-in-law ordered the salmon, which while it was the only meal sized entree, was overcooked to a dry inside, brown outside finish. I had a coupon for $15 off the bill and I still feel like I've been had. There is no way we're going back for dinner. Beware of restaurants bearing coupons.

EDIT: Owner messaged that they make their own desserts and have not worked with Amelie's for years."}
{"text":"If you love an authentic French restaurant this is the place because they are rude & stinky"}
{"text":"Their food is always delicious!  Their pizza was excellent and their veggie crepe was delish!  Will be coming back for more!"}
{"text":"Excellent food and attentive wait staff.  Never felt rushed nor looking for service.  Food (mussels,  swordfish,  chicken, pasta) all arrived quickly and hot.  Everyone loved their selections.  Decent portion sizes."}
{"text":"My hubby and I arrived 3 minutes before our reservation time and were seated at a table back in the restaurant. Cozy, Parisian atmosphere and our waiter was prompt to our table. We ordered a Hendricks Martini and a glass of merlot which were quickly delivered. Once we got our drinks we ordered the rest of our meal. Escargot in puff pastry and Brie en croutes arrived, but only five minutes later our entrees arrived. We told the server we needed more time. About ten minutes later our entrees came back but my beef Wellington was medium well instead of medium rare when I cut it through. We sent it back and I had lobster and crab crepes which were delicious.
We ate creme brûlée which was yummy and brought home chocolate raspberry mousse cake.
I'm looking forward to trying Cafe Monte again!"}
{"text":"I found this from a living social. And since then, I have been in love with this place! I will never get tired of their Charcuterie - various cured meat and pickled vegetables! It's just simply delicious and I feel like I'm in Europe.  I am a big fan of their moules frites and shrimp & artichoke crepes are very yummy and big.  I always like to treat myself to some macarons afterwards! 

Very quaint place and so close to where I live. It's a win win situation!"}
{"text":"It was my first time for lunch here today, and the interior decor is nice, they have some beautiful artwork. The bar area is nicely decorated with a big wine shelf. It is also a spacious restaurant with lots of tables...and they have outdoor seating as well. There is a piano on the left as you walk in, so I'm wondering if they ever have someone play it in the evenings. 
I got the most expensive thing on the menu just for the fun of it: crab & lobster crepes. It was just okay, I was sort of disappointed. Service is great though. Good hours, open pretty much all day every day except Sunday, I believe...

I don't recommend the crab & lobster crepes, the crepe and the stuffing came separately and didn't taste all that great."}
{"text":"Food here is very good.  Brunch was amazing, and they also offer vegetarian options as well.  I ordered the open face veggie sandwich with a potato cake,  super good. Love this place"}
{"text":"My boyfriend and I just checked out Cafe Monte for the first time. As soon as we walked in, I felt like I liked the place. Soft jazzy music playing, interesting art on the walls, lots of tiny bistro tables and a beautiful marble bar. Very French feeling, and I would imagine if you were visiting for dinner it would feel downright romantic. The wait for a table inside was about forty minutes so we opted to squeeze into two seats at the bar. We waited for almost fifteen minutes without anyone coming over to even get our drink order, and my boyfriend got seriously ancy at the wait. He finally went to talk to the hostess and after a few minutes the bartender came over to take our order. He seemed very nice and competent, so I would venture to say the issue was more of the restaurant being pretty majorly understaffed vs poor service from the bartender. I ordered a Bloody Mary and Ham & Egg Crepes and the bf went with Bananas Foster French Toast. The Bloody Mary was very good and tasted especially fresh. And the bartender seemed to have a very generous pour of the vodka which I always appreciate! Our food came out in a reasonable amount of time, and I couldn't have been more pleased with my crepes. The crepes themselves were perfectly thin and airy and filled with scrambled eggs and smoked ham. The best part was for sure the rich and creamy four cheese sauce drizzled over the top. Very toothsome. My boyfriend's meal, on the other hand, was not so great. For one, they brought him a plate of plain french toast instead of the bananas foster he had ordered. Since he was hesitant to send it back and wait even longer, he resigned himself to just eating what was in front of him. After a few bites, he put his fork down and described it as \"flavorless.\" I was skeptical that he was just in a complainey mood at this point, and tried a bite for myself, but he was right. \"Flavorless\" was a pretty accurate description. The bread was very visibly burnt and it tasted as though it has been quickly flipped in the egg batter and would have benefitted from more of a soak. I could taste a hit of cinnamon in the batter, but other than that there wasn't much going on in the flavor department. After awhile the bartender came to check on us and my bf mentioned he thought his order was missing the Bananas Foster componenet. The bartender studied his plate for a moment and agreed. He came back with a teapot full of the elusive Bananas Foster topping and suggested my boyfriend spoon it over the top. He left without giving him a spoon to do so with, which kind of drove my boyfriend over the top. His french toast was by now cold and he was just over being in the restaurant at this point and ready to go. Can't say I blame him. All in all, I really enjoyed my food and wasn't particularly bothered by the service hiccups. I would happily go back to try it again, but it's safe to say it will be a pretty tough sell to entice my boyfriend to return."}
{"text":"Food was ok. The prices were very reasonable and service was very good! I would go back for apps and drinks. The inside was cute and of course French inspired."}
{"text":"We were gifted a groupon to Cafe Monte. 

Ambiance was ideal, no strident music or harsh lighting. Bakery case promised future delights.

Grateful for a concise menu, hate to read a book to choose my meal.

The warm baguette with butter was so delicious it did not last on the table. Waiter graciously offered another one.

Chose beef bourguinon, meat was seasoned well and so tender, only needed a fork to enjoy. Au jus was beefy and could have used some extra bread to 'sop up'. Baby onions were sweet and mushrooms were finely sliced.  Winning dish!!!!

My dining companion  chose the roast chicken. Sadly, the herb seasoning did not infuse the meat. Without a sauce, there was nothing to say.

Macarons were nuggets of artistry. Enjoyed tremendously. 

Minus one star since service was polite but we felt 'tolerated',  there was no attempt at engaging in conversation or inquiry about special ocassion. Another table merited a long and involved conversation. 

A lovely place to enjoy when you tire of the chain restaurant scene."}
{"text":"Met my aunt on Saturday for breakfast. We arrived at 9AM when the restaurant opened so there was obviously no wait. The waiter was friendly and promptly took our drink orders, we also ordered our food with the drinks. 

I saw steak and eggs so I went with that, medium rare/poached. I was amazed at how much food came out on the plate. The steak and eggs looked amazing but so did the freshly sliced tomatoes, fried potato round and the croissant. Not only did everything look good but it tasted amazing. The steak was tender, moist and perfectly seasoned. It seems like the best steaks I've had are for breakfast! The croissant was warm out of the oven and melted in my mouth, it was phenomenal. 

I definitely look forward to coming back to Cafe Monte for breakfast or any other meal."}
{"text":"It's a traditional french bistro and the ambiance takes me back to Paris - right down to the woven chairs. 

The menu is again traditional french and it has a good variety of things to try. The salads are very good... they have roasted chicken as opposed to grilled chicken in most places so that's a plus (I think it adds flavor to the chicken being roasted and not grilled). I had their brisket baguette sandwich (a little disappointing that it was greasy as all hell, but it was good). Their french fries are very good (sprinkled with Parmesan and parsley). 

For lunch, come early (before noon) or this place gets busy, busy..."}
{"text":"We stopped by here for brunch and the experience was great. They do reservations which is a plus so I was excited to try it. I could see parking being a bit difficult during peak hours but this time I had no trouble. There is also a parking deck close by. 

The decor of the places was great. It has a real \"homey\" feel to it. The staff was great and seemed very pleasant. I went with the Fruit De Mer omelette(salmon, crab, lobster) which was great. I'd definitely recommend it. They also serve you fruit and bread with this. I'll be going back to try out some of the dinner options"}
{"text":"Came here for dinner with a gifted groupon. Definitely make a reservation if you plan on coming on a Friday or Saturday night, as you may be waiting a while. Luckily, I preemptively took my own advice and came with reservations.

We ordered the duck confit and the chicken and mushroom crepe. While waiting, we were served a freshly baked loaf of bread, which was fantastically gooey on the inside. Good bread is hard to come by, an this one impressed me (5 stars!).

While waiting for the food, we had the chance to check out the ambiance. Two things stuck out in my mind: noise and clientele.  Most notable was the noisy buzz of music and talking. Whereas many movies may romanticize French restaurants as quiet establishments with perhaps a soft piano, Cafe Monte was buzzing with life jazzy music and rather loud conversations and unruly drunken laughter from a neighboring table. This made talking with my companion difficult to the point of leaving with a raspy throat. I would have preferred a more relaxing and quiet environment.

Secondly, we both noticed the rather stuffy clientele. Many (boarding of most) men were dressed in 3 piece business suits and ladies in fancy evening gowns. Don't get me wrong, there is nothing wrong with having a fancy night out, but there was an air of pretension that seemed out of place. Cafe Monte is a nice restaurant, but it ain't the Ritz. It made for some fun people watching, particularly when we added our own voice over, but overall contributed to making us feel under-dressed (despite wearing a nice button-down shirt and slacks). 

The food came out in generous portions, laded in butter and cream. The chicken and mushroom crepes were pretty good (4 stars), but the guilt of all that creamy sauce comes fast. I defy you to finish all of it. The duck confit was a little above (3.5 stars), but broccoli over-salted (coming from a lover of salt).

We both left with a feeling of 'meh': by no means bad, but not exactly memorable. We also agreed that a much needed run was needed the following day and that we didn't feel the need to return. I will say that I may have since had some impure thoughts regarding that bread of theirs."}
{"text":"After the 1st experience we had with the hostesses and my review, management reached out and apologized and asked to give them another chance as this is not how their customer service usually is. So we went back today and it was a total 360 degree difference. The food and service was outstanding and we will return the next time we are in the mood for the brioche french toast and monte benedict.  Best eggs benedict around."}
{"text":"Just tried Café Monte last Friday night and was pleasantly surprised! I usually \"pass\" on strip mall/shopping center restaurants (Yes, Philips Place, you are a shopping center), but you are truly in another place once you walk inside Café Monte. The ambiance is really intimate, but casual - live music in the front, dim lights (but not dark and creepy). 

Our table was in the farrrrrr back corner, probably not my first choice - but they sat us for our reservation the second we walked in which is the way it should be! I love restaurants that are organized and know how to handle reservations!

Our waiter was sort of attentive and sort of nice - but everything else was so good, I can let that go. We had the Steak Frites and Salmon - both were really delish! Next time will probably skip the steak and go for the crepes and something from the appetizer menu. Maybe fondue?

The wine list had affordable options, their house white was a nice pinot grigio for 22 bucks. But, my favorite part of dinner was the chocolate mousse with fresh fruit for $6. Yum yum yum. My friend and I shared it and didn't even finish the whole thing (but we were also stuffed from dinner). 

Cute place, would love to go back!"}
{"text":"Ate here for Queens Feast 2017. Lovely French inspired restaurant with a huge menu. Excellent service as well."}
{"text":"There used to be a shortage of French restaurants in town about 10 years ago and I was one sad panda because I couldn't get my fix on a whim.

That has changed and with the opening of Cafe Monte, the availability of tasty and accessible French cuisine became a reality.

First time for brunch?  Get the steak and eggs. 

For dinner, get the Escargot Traditionnel.  It's not as garlicy or intense as the escargot I had in Paris.  It's light but flavorful and served with a puff pastry.  The pate is delicious as well (this coming from someone who hates pate).

You really can't go wrong with any of the entree's.  Everything is delicious.

The service is good and the ambiance makes you forget for a moment that you're in Charlotte."}
{"text":"Decided to try something new on a Friday morning for brunch. Coffee was tasty, but service was slow. The seafood omelette was a bit wet (in a puddle).  But the quiche was tasty. Not the best experience for the price.  
Mixed reviews on whether we would go back."}
{"text":"My friend, Arlene, told me that I would love Cafe Monte and she was completely correct.   Normally, I am a little hesitant on fru fru French places as I don't like all the heavy sauces and cremes.  Today, I might have had the best egg white omelet ever. I told the server exactly what I wanted in it. It was elegantly presented on the plate and simply  delectable. They served it with a cup of fruit, some really good toasted bread, and a potato cake that looked like a muffin. Not sure where they got the strawberry jam from, but I need access to their strawberry patch!  I had to get a little extra, which was no problem.  My bread likes lots of jam.  /  Superb service, stunning atmosphere, and overall one of my best dining experiences yet.  Parking can be a bit challenging, so go there knowing that it might take a few circles around the parking lot to find a place.   Trust me, it's well worth the effort.   Two Thumbs up and then some."}
{"text":"Met some friends here for Sunday brunch.   The food was delicious!  I had the Crab cakes Benedict.  Service was good and there were nice size portions.  The mimosas were a little small but good."}
{"text":"Amazing service. Delicious. C'est magnifique. Crab cake Benedict had perfect poached eggs."}
{"text":"Went for Sunday brunch.  One word: spectacular.  I want to come back for dinner because they seem to have all the delicious French delicacies that you can't get at very many places in Charlotte (duck confit, escargot etc.).

The food was delicious and the service was excellent but the most surprising thing of all was how beautiful this restaurant is.  I felt like I was in a Paris at a cafe when I walked in but yet it did not feel like a wax statue, it felt authentic.  I cannot wait to go back.  One of the best restaurants in Charlotte."}
{"text":"Months ago, when me and Bryan were \"newly dating\" and still trying to do sickly romantic things I suggested we try this place for brunch.  It was a Sunday morning and pretty busy.  We had to wait about twenty minutes but enjoyed a mimosa and a chocolate croissant at the bar prior to our table being ready.  It was heavenly! (The croissant was flaky and had just the right amount of chunky dark chocolate).  We were seated and the menu was fantastic.  I ordered a spinach and Brie omelette.... Bryan got a breakfast crepe.  Service was good and we were eating within 10 minutes of ordering.  I keep meaning to go back again for another brunch, as it was memorable..... Perfect for a sappy third date :)"}
{"text":"this place seems very popular with the south park milfs ( moms id like forget) lots of 3 and 4 tops of moms sinking bottles of wine and sharing plates .   Ok now the rest , as mentioned  in most reviews the service is awkwarkdly slow at times  between drink and ordering . I suppose thats manger wants patrons to drink before meal , who knows but can the majority of reviewers be wrong?     -   ok now dinner ,   endive salad great no complaints , entrées   beef bourguignon & confit duck .  The beef was very good and reduction was ta ta tasty  served over a big bowl of  yummy mashed potatoes with mushrooms (ok)  carrot (meh)  and  pearl onions (yay)   the portion was BIG -    the duck confit  was tasty but the plate was small compared to the beef . It was very tasty and served with fingerling potatoes , potatoes were avg compared to the mash  . All in all postive if you want straight forward french inspired food you should be ok here . Besides that it should be supported for fact its not a bs chain restaurant
ps
charlottesucks"}
{"text":"seanis the best sever I've ever had please request him always kind and prompt the food is literally some of the best in town burger royal and short rib sandwich are amazing"}
{"text":"Lovely food. My wife had the mushroom crepes & I had lox on a croissant w/Crème fraîche w/light dill. Great coffee and great cappuccino. Service very adequate & friendly. We sat outside and were annoyed by a mother who left her little girl in her car seat with the SUV engine running while she had lunch. obnoxious behavior with an entitled attitude!"}
{"text":"I was very disappointed on Saturday, July 22nd.  We had reservations at 8pm for 5 of us.  Our service was horrible.  I drank 3 glasses of water (mine, my wife's, and my mother-in-law's) and the waitress never refilled our waters or asked if we would like anything else to drink.  We had to ask for another bottle of wine.  
After we finished the appetizers, the gentleman that delivered the food was irritated because plates were never cleared.  They delivered the food and cleared the appetizer plates all at once.  No one ever checked to see if we enjoyed our food or wanted anything more to drink.  At this point, it was 9pm and the restaurant really was not that busy.  Our waitress must have been more concerned about getting off her shift then the service she was giving us.
We have dined her before and loved it.  This was not a good experience.  The food was just okay and with bad service... it does not make us want to return."}
{"text":"Bread. Bread. Bread. Bread. Bread. Bread. 

This is what I chanted as I walked into Cafe Monte, knowing it was a French restaurant. 

Bread. Bread. Bread. Bread. Bread. Bread.

I continued to mutter underneath my breath as my stomach complained about its emptiness. 

Bread. Bread. Bread. Bread. Bread. Bread.

The baguette comes sliced. It is soft for a baguette but nonetheless delicious with olive oil. We ask for more

Bread. Bread. Bread. Bread. Bread. Bread.

pieces of it swim in my French Onion Soup, which has the perfect thick cheese on top that I don't care to finish.
_______________________________________
My Duck Confit comes. I know it sounds snobby but a girl can't help what she likes and I happen to like. Confit.

The outside of my my duck confit was a little dry but the fingerling potatoes on the side were still delicious as well as the broccoli florets. My coworker's lobster and crab risotto was tasty as I snuck a bite but I got a little sand grit from it admittedly. Maybe it was my bad karma.
_______________________________________
Time to pay for the meal and it requires a decent amount of:

Bread. Bread. Bread. Bread. Bread. Bread.

but before we go, my boss has ordered crepes with strawberries and rich chocolate filling to share. I enjoyed dessert so much that I as I walk out the door, I no longer think:

Bread. Bread. Bread. Bread. Bread. Bread.

only...

Crepes. Crepes. Crepes. Crepes. Crepes."}
{"text":"Love the food at cafe monte. We stop by for lunch or brunch over the weekend. Lovely atmosphere and delicious food. Highly recommend the egg benedict and the trout."}
{"text":"Found this place today and glad we did. Food was delicious and lots of different things to choose from. Service was great and parking was easy. We\"ll be back."}
{"text":"This is one of my favorite breakfast spots in the area. For the amount of times I have been here, I have only tried one thing on the menu (it is so good that I just keep ordering it time and time again) - the quiche!

The food is great, and the ambiance is adorable. The only reason that I am not giving it 5 stars is the service. Every time that I have been, the service has been sub-par, which is so unfortunate considering that this place is so wonderful in every other way. If you are in the area, stop by and have a quiche for me!"}
{"text":"SERVICE WAS GREAT!!!
My daughter and I went there for the first time the night before last. It was a pretty busy dinner crowd and we were greeted by two gentlemen at the front. As we did not have a reservation I fully expected to wait if necessary. The wait was brief and the decor was nice, along with the hustle of the crowed/staff the place was alive. That seated us at a small round table that my daughter loved. It had a little European feel she said. We were greeted be a young lady named Rachel she was our server and she was fantastic, very attentive with an easy approach. We started with some escargot and charcuterie. The escargot was great however the charcuterie wasn't my favorite. Not that it was bad I just found the pate a little dry and they gave me cheddar cheese with it and the very firm sausage was cut way to thick almost impossible to chew. But the veggies were great. We then moved in to entrees I had the Beef  Burgunion (sp)while my daughter had the Duck both were wonderful. 
Now what really stood out in my experience was the all around service, you see before we where served but right after Rachel had taken our order it dawned on me that I had forgotten to request no mushrooms in my dish. So one of the gentlemen who sat us was walking by and I expressed the situation to him. He assured me that it would be no problem and walked to the back. What's impressive there is that I'm sure the kitchen hadn't gotten my order yet because I hadn't even received my apps yet. So clearly the communication amongst the staff is stellar. 
In my experience the food was very good and the service was great, I'll defiantly be going back."}
{"text":"4.5 stars -- Great service - so friendly - food was really good - crepes with nutella and strawberries (fresh) -yum! will be back..."}
{"text":"I am a huge fan of brunch and am always looking to try a new place. I instantly noticed the charm and french inspiration of Cafe Monte. The restaurant had a very cozy atmosphere.

The food also did not disappoint! I mean how can you go wrong with a buttery croissant? I decided to branch out from what I would normally order and ordered the steak and eggs. The steak was cooked to perfection. I ordered eggs poached, which doesn't always work out, but they were good extremely well. The potatoes where definitely one of my favorite parts, crispy and flavorful. Overall, none of the food disappointed!

In short, Cafe Monte is a french cuisine delight! I will definitely be returning for more!!!"}
{"text":"I recently realized that, despite being a very regular customer of this place, I have never checked in or written a review. Time to right the latter part of this wrong. 

My boyfriend and I discovered Café Monte thanks to a Groupon his mom gave us for Christmas. It's not exactly convenient to where we live, and I might not have otherwise gone there. That was 3 or so years ago and I've lost count of how many times I've been, for both brunch and dinner. I read through some of the negative reviews and I'm genuinely perplexed; I've never had a bad experience here. 

I love the atmosphere, and the service is always good if not outright super. But the food. Mercy, the food. I've tried just about everything on the menu at some point (either ordering it myself, or taking a bite off my dining companion's plate) and have never been disappointed. Certainly, there are things that aren't really up my alley, but that's the case wherever you go. 

Some of my favorites are: the French country breakfast (that skillet potato is the best); steak and eggs; lobster & crab crepes; beef & asparagus crepes; trout amandine (I sub asparagus and mashed potatoes as my sides); beef short rib bourguignonne (very good on a cold winter evening); mussels & frites; roasted artichoke hearts; four cheese fondue; and the brie en croute. 

They do nightly specials, too. Off the top of my head: Monday is all you can eat mussels, and Friday is lobster. I've taken advantage of both specials at some point, and really enjoyed both. 

Prices are fair, in my opinion. But, PRO-TIP, keep an eye on Groupon, Living Social, etc. because they frequently have deals available.

I'd definitely recommend this place. In fact, when friends and family come to town we almost always go here. Hopefully the negative reviews were isolated incidents, which is unfortunate but, in my experience, not the way Café Monte normally functions."}
{"text":"My favorite spot especially for brunch. But let's get real seriously everything here is to die for. Always great service and the atmosphere is perfect. I wish I could dine here every day. Love!"}
{"text":"I absolutely love this little restaurant! The food is delicious every single time and I have tried nearly everything on the menu!! My husband and I both say this is our favorite restaurant in Charlotte. It never lets us down - if you're looking for a delicious place to grab some food, look no further! The staff is great as well!"}
{"text":"My husband and I went here for our anniversary dinner and this is my new favorite restaurant! We loved the atmosphere, & great service from our waitress, Lisa, who was so pleasant and attentive to us. Great food. We especially loved the Cherry Tomato Salade with Whipped Mozzarella Cheese & Balsamic Glacé. The Beef Short Rib Bourguinon with mashed potatoes Pearl onions, Mushrooms & Carrots melted in our mouth. Grandma's Cheesecake was a delicious dessert. Plan to go back to this place. Would love to try more of their bakery goods."}
{"text":"Wow!!!  The short rib baguette---are you kidding me????  Sssooooo good!!!!

The atmosphere was fantastic for a quick escape from
\"America\"....French music, waiters/waitresses in black vests, white shirts...good place!!!"}
{"text":"A nice little place, tucked away in Phillips Place.  I just happen to see it from the road and decided to pop in for a drink and a bite to eat.  It was a Tuesday night and the place had only a few tables occupied and as I wasn't in the mood for table service, I opted for the bar.

The wait and bar staff were all buzzing around..........except they were not buzzing around the customers.  There were multiple instances that the bar staff and wait staff gossiped about everything which was unprofessional - but considering the average wait staff aged looked to be barely out of the 20's I'll give them a break this time.
It took a while to get drinks....we had to ask for water......but we did get our order of a meat and cheese plate and an order of Crab & Lobster crepes.

The chesses and meat plates in this town continue to be small portioned and a bit disappointing......Vivace is the only game in town where you get a nice amount of everything.....Cafe Monte...take note.  The one plus is that they serve a VERY inexpensive breakfast during the week.

The main dish, which was shared between me and my GF was good...very rich.  All and all it was a good experience until the I was handed the bill which was fair pricing wise and had it returned to me with a larger around of over $10?  I asked the waiter and he had swiped my card for another larger bill.  He corrected the problem, but handed me the corrected charge slip that required a signature..but only one copy...the copy for the store....meaning if the correction didn't go through right I would have been screwed...so I had to ask him for my own copy.  

So in closing, taking away the factor of either inexperience or just plain non-paying attention wait and bar staff, Café Monte is a cute little café in South Park worth checking out.......if you have the same issues I did.......then one time might be enough *grin*."}
{"text":"Went for brunch today with my wife, and we had an outstanding experience. The food was exceptional as was the service by Jennifer. 

My wife had a Caesar salad and the mussels and frites entree. I went the breakfast route and had the florentine omelette which came with fruit, a potato hashbrown thing and toast with butter and jam. Everything was perfect Just to press our luck we ordered a tiramisu. Also perfect. 

I don't leave reviews very often because it's so easy to rant when things go poorly. It's nice to have a compelling reason to leave a positive review. We highly recommend this place!"}
{"text":"I have to say that I love this restaurant! It has been a stand-by for me over the last several months. I can (almost) always rely on great service and great food. I've been multiple times for brunch and it is certainly one of the best brunches in Charlotte. I've also been many times for dinner and they never disappoint. The mussels and frites and the endive salad are some of my favorites!

The reason for only giving it 4 stars and not 5 is that I went there this past Friday night with 3 other friends. Their advertised closing time is 11pm on Friday nights. I arrived at 9:40pm and was told that the kitchen was closed but that we could have coffee and desserts. Now, I totally get it if I was arriving after 10pm, but I told the manager that we were very hungry and were looking for a full meal. 

It won't stop me from going there again, but keep in mind that even if you arrive well before they're closing hour, you may get turned away."}
{"text":"I went to Cafe Monte during restaurant week. Surprisingly it wasn't very busy. However, I still didn't receive the best service. It was as if the server was just going through the motions because he knew he was going to get the 18% tip that was added to every bill during restaurant week. 

The food was very good however the portions were extremely small. There was a couple next to us who seemed to not order off the Restaurant week menu and for what I could tell the portions seemed larger. So they might have reduced portions for the special menu that week.

The escargot was amazing. The Caesar salad and tomato bisque was just okay. For an entree I got the Fillet Oscar which was cooked to perfection. I will definitely stop back and try it again during a normal time and hope for better service."}
{"text":"We first went here with friends, by accident.  Our original spot was closed and we happened to drive by and said let's try it.  No dissapointment at all!  Service was impeccable and they went out of their way to accommodate my food allergies, making it a delightful and very delicious meal.  Five star for them and looking forward to eating there again!"}
{"text":"Coffee menu here was limited, but it didn't surprise me since they cater mostly to lunch and dinner patrons. One can choose from a french roast drip coffee, espresso, cappuccino, cafe au lait, and several boozy coffee concoctions ranging anywhere from whisky to Grand Marnier. The non-boozy coffees were priced anywhere from $2.75-$4.25 and the boozy coffees were all at about $10. I chose the house blend coffee and it was smooth and fairly rich. Pretty much restaurant style coffee with a little more quality to it. 

Dessert menu had several choices to it such as cake slices, creme brulees, mousse, fruit tart, and chocolate fondue. Prices ranged from $8-$10. I went with the coconut creme cake. It was moist and flavorful and had a wonderful caramel creme running though the central layer. 

Generous amount of parking out front. Dining room seemed a little cramped with tables. The bar area was a little roomier with bar seating mixed in with 2 and 4 person table seating. The bar area was the only part with some windows. The rest of the place had dim lighting and richly painted walls. Cozy though. There were several tables outside in front of the place as well. Hostesses were efficient and welcoming. Waitress was very polite, patient, and attentive. 

Bathrooms were one at a time and gender specific. Very roomy and bright and pretty clean. Piped in music too! 

Will come back!"}
{"text":"This is a really good restaurant, don't go there often, but when I have it's been good. Their Quiche is delish! It's not too badly priced, considering.  I have not had any bad meals there.  It's worth a try if you are in the area and want a good meal.  The staff is wonderful!  Soups are fabulous too!"}
{"text":"This is more of a 3.5star review as I will return but can't definitely say I'm a fan (right now).  Disclaimer: I had to bump up the staring  for Yelper readers but still say this is more of a 3.5 for my own quality control purposes. 

We dined during Spring Break and had
I, the Risotto
kid chicken dinner (they served white meat - IMPRESSIVE) 
sorority sister - braised beef (pot roast) THIS WAS BETTER THE NEXT DAY. THE FLAVORS CONGILED AND MWAH :* EVERYTHING WORKED. 

The dine in isn't stuffy. Pretty relaxed. Didn't sit outdoors but on another occassion I might just. The risotto wasn't anything to write home about. The broiled chicken was seasoned well and juicy. The side dish wasn't memorable but no complaints from the kid. I tasted the Beef with the petitite carrots and mashed potatoes. Took pictures of the dishes as they were presented well. 

The next day that beef dish was off the chain as the seasons really burst in your mouth. 

Service - ok, 3 stars. Solid nothing spectacular. 
Ambiance - ok. More like a cafe which precludes the best name for them and it's nice to have so many French options in CLT. It doesn't take me to France but it does remind me of WestBank Gretna/New Orleans. So it's French-esque.  Enough to get your fill. 
Location - VERY SMART. This is the crowd/side of town to cater to. 

I consider this place to be smart dining. Nicely appointed. Would feel comfortable having business lunch or dinner or a family gathering. 
They get 4 stars for offering a GroupOn then graciously accepting it and not having a funky attitude like some places do when you redeem a GroupOn. 

End Result: I will return."}
{"text":"My friends and I were looking to try something new this Sunday for brunch and this place seemed to have it all. The brunch menu was filled with tons of choices and seemed to have something for everyone. We started off with beignets that just melted in your mouth. Next we ordered escargot baked in butter garlic puff pastries that was excellent and had a beautiful presentation. The sandwich I decided on was the beef short rib baguette and it was to die for! Great job and we will be back for dinner!"}
{"text":"This place looks like your typical cheesy (no pun intended) American take on an Italian eatery, but Cafe Monte is actually pretty good. Super spacious and open, it's got a great atmosphere. A lot of families were there when went there recently, which makes sense: it's in Philips Place, literally right next to that gigantic movie there (and near Upstream). But it wasn't annoyingly family-oriented or anything, so don't worry. 

Nothing too exciting on the wedding--just your basic Italian fare, but it gets the job done. I had penne a la vodka, my go-to, and it wasn't bad at all. Super affordable, too, which isn't always the case in Philips Place. Again, this place is really conveniently located. If you're headed for a flick, as we were, this is a great place to grab a quick but non-fast-foody meal. Equally good for a post-movie glass of wine or bite. We'll definitely be back."}
{"text":"I loved this place! Our waiter Xavier was so nice! If you dont want to spend too much money on wine you can order the bottle of the day for 24 $ and ours was excellent! We had the escargots (delicious, especially if you love garlic). We also had the moules et frites, a must have, specially with their bread! Finally a creme brulee... To die for!"}
{"text":"Great atmosphere but food is not very flavorful. I had a salmon croissant with a side salad and fruit tart for dessert. The fruit tart was not sweet at all and the croissant was loaded with cucumbers, just didn't work on the sandwich. It is also very expensive for the lackluster quality of food. Two meals and a kids meal with two desserts were over $60 after tip and we drank water!
 If I needed to grab a quick coffee and muffin I'd probably stop in but being the Whole Foods is right next door and offers better tasting food, I doubt I'll be back."}
{"text":"Best French Cuisine in Charlotte! Cafe Monte offers a great brunch menu that's affordable and delicious! The service is great, and the atmosphere is warm and welcoming. I've been a few times for Brunch/ Lunch. There's always a crowd, I would recommend making reservations.

Personally, I love the French Onion Soup and Escargot. There's a Groupon available, be sure to download it! Cafe Monte also has a great wine selection, and the bottles prices are reasonable."}
{"text":"Looking for a romantic, intimate setting for date night with live music - look no further. We found this place thanks to Groupon for their $17 for $30 option in an effort to try a new restaurant. 

Upon arrival we were quickly surprised but the live band and European-feel decor. We were quickly sat and started off our meal with complementary home made bread with butter, and ordered the Charcuterie appetizer to start. We also ordered a bottle of wine to share, one of the cheapest ones they had at $28. Most bottles here range from $28-$130, but majority in the $30-$50 range.

The Charcuterie was a great spread of different cheeses and meats and pâté with toasted bread to enjoy. My boyfriend ordered the salmon and I ordered the mussels. Would order the Salmon again, the Mussels were good not great, but sub your fries for the mushrooms and I promise you will not be disappointed! 

Overall I would absolutely come back here for a romantic evening, birthday or anniversary where I don't mind spending about $100 on dinner for two people. Excellent service and food all around!"}
{"text":"Half price bottle of wine for $15 - how could you go wrong?

Authentic French food in a bistro style settings. Had their macaroons and they were delicious.  Tough place to come to if you are dieting."}
{"text":"Café Monte

Beautiful indoors and out, also beautiful food! I've been here twice before, and I have never been disappointed.

Hospitality is not abundant here though. The hostess had no smile and seemed very bored or in a funk (coming from a hostess, you are the very first impression to a guest, so make a good one).
Service was also a little slow, but he apologized and did his job. There was no extra conversation, or small talk. He just brought us drinks, food, and the check! I can't really complain about that, it's all servers really need to do, but a little talking and personality would be nice!

Overall, great food and atmosphere! I got the open face vegetarian, and it was delicious, as were the fries that came along with it. My dad got the baby spinach salad, very light and tasty! We had the vanilla and pistachio macaroons and those are just so cute and sweet! Love it!"}
{"text":"This is one of those places that is \"fancy does not equate to good food\". One review on here said they have the best crepes in Charlotte, seriously? Have you tried Hazelnut Creperie? I personally thought their food is a bit dry, portion extremely small. Ok, I admit, most fancy places have small portions. However, I found nothing exciting or special about this place at all. The food was edible, the atmosphere is nice and upscale, and that is about it. I also ordered Wine, it is Ok, came chilled, but flavor wise it is just average."}
{"text":"I LOVE Cafe Monte. My wife and I discovered Cafe Monte soon after we first moved to Charlotte. We purchased a living social and gave it a try. She got hooked on the Charcuterie and I on their steak and eggs. We both love their macarons too. I would also recommend their various crepes. The shrimp and artichoke and the lobster/crab crepes. Oh yeah and the short rib baguette delicious, too! LOL

When my parents come and visit or friends from out of town, we always always take them to Cafe Monte for breakfast or a late lunch. And occasionally we'll walk by and order some macarons or a fruit tart to go.

The dining area and bar area are great. If you want to hang out somewhere fun and have a nice conversation with a friend you'll like the ambiance. The service is top notch as well. 

The prices might be high for some, but you can taste the quality in the food. In my opinion it's totally worth it. I'm really high on Cafe Monte and suggest that you give it a try. You won't be disappointed."}
{"text":"Came here for brunch and I wanted to like this place.  Nice decor and warm and inviting host.

Once seated, it took ten minutes to greet us. We had water on the table 15 minutes after being seated. We ordered mimosas which were pretty tame and they were $8. Not worth the price. 

My lady ordered a smoked salmon croissant. It was a little bland given the description. I ordered the madam sandwich, which was a toasted ham and Swiss with Dijon and two fried eggs. It was more of a hangover sandwich than a culinary concoction, but i was hungover so it served its purpose. 

Overall the place was ok for brunch. Atmosphere was great. Food not memorable. Service was memorably bad"}
{"text":"Paul was our wajtwe he was awesome.  You could see he had other tables but he never rushed us our food was amazing and we were super happy woth our mimosa.  Thank you Paul."}
{"text":"GREAT place.  Unique foods,  very authentic.  super friendly wait staff.  And the decor was perfect.  Must try."}
{"text":"Had a great experience here for brunch. They don't advertise it but do have a gluten free menu (that has a lot of options) and it's clear their staff has been trained. 
The food was delicious-only reason I'm rating 4 stars instead of 5 is because of the prices and a very slow server"}
{"text":"I really enjoyed my crab cakes benedict here and the shrimp crepes looked fabulous as well.

It was super-busy on a Friday at lunchtime with a 45-min wait!  Luckily I was able to snag some bar seats that you can seat yourself.  The lovely girl behind the bar was swamped as she was the only one working behind the bar at that time taking care of 20 customers at the counter, plus walk-up/take-out customers as well as making beverages for the table servers.  She took good care of us though and with a smile.

The restaurant itself is very tastefully decorated with some delicious breakfast, brunch, lunch and dinner options.

I definitely would call ahead for reservations in the future and not chance the long wait.  The parking lot fills up very quickly as well, but there is parking at whole foods lot (if you're lucky) or around the Hampton Hotel or the other Phillips Place business.  There is a stair up to the restaurant from Phillips Place, so it's easy to get to if that's where you park."}
{"text":"We ate at Cafe Monte for brunch prior to a matinee show in uptown Charlotte. It was only a few minutes from uptown and well worth the drive. We both throughly enjoyed our meal. The restaurant is chic and lovely. We would definitely return..."}
{"text":"Enter this bustling corner restaurant decorated in the theme of a French bistro and you will immediately be greeted by the lively music and friendly staff. If you are dining on a weekend you will most likely also be greeted a rather noisy establishment. The ambiance is usually mellow during the week if you are looking for a casual atmosphere. 

If you are ordering wine I strongly recommend the La Posta Malbec. Why strongly? I don't like Malbec and my boyfriend doesn't like Malbec but one sip of my sister's glass was enough for us both to order our own glass. 

Ever since the first time we ordered the four cheese fondue we decided to keep it as a staple item for our visits. The cheese has a delicious sharp undertone and the fondue is full of more cheese than will be absorbed by the bread they bring with it. They never seem to bring enough bread with it but we save the tableside bread they bring with dinner service to gluttonously leave no bite of cheese behind.

My previous favorite was the seared scallops over mushroom risotto but has since been replaced by the Beef Short Rib Bourguignonne which was phenomenal with a hearty cut of beef so tender no knife was needed. I will definitely be ordering this again!

This restaurant was close to a 5 star review but unfortunately on our last visit the beignets that I had absolutely raved over during a brunch visit came out as a burnt dessert. Hopefully on our next visit I will be able to update my review after a perfect dinner service."}
{"text":"This is 1 of 2 of my favorite breakfast spots in Charlotte. I like it because while they have the usuals of eggs and waffles (both with a twist you won't find in diners), the French inspired menu gives Cafe Monte a uniqueness I haven't found elsewhere in town. Crepes, quiche, great espresso, even steak & frites are all good bets."}
{"text":"Great food and service every time I go. One of my favorite regular dining spots."}
{"text":"I get it- but I don't get it.  Let me explain..We went on a busy Sunday morning and asked if we could sit outside. We were told to pick any table but the problem is that all of them had not been cleaned since the last customer.  We sat at a table with someone's leftovers for about 10 minutes and no one came out to bus the table.  When I went back in to speak with the hostess, I told her we had moved to a less dirty table.  Once we sat down at our new table, I knew it would be an interesting meal.  I swear we were sitting right next to the Real Housewives of Charlotte.  Each woman had downed a bottle of wine and their conversation was very loud and obnoxious.  Then, my mimosa came out with what looked like a pubic hair hanging off of the side - yum.  The food was fine but it was nothing to write home about.  Like I said before - I get it, but I don't get.  This place has a lot of potential but I could not deal with the type of people that choose to dine here."}
{"text":"Great french restaurant in SouthPark (in the building next to Whole Foods)! I was in town due to Hurricane Irma and staying in the new Homewood Suites hotel across the street. 

The location is great with plenty of parking. They have outdoor seating as well for the beautiful weather lately. I came in early Saturday and it was definitely busy with a 45 minute wait. Thankfully, the bar seating is first come first serve and there were two seats available. 

The service was excellent and the food was just amazing. I had a delicious almond latte and mimosas with my meal. We ordered the rib sandwich and baguette with various butter and jam. Everything was so good! I came in a few days later and also tried the waffle and fresh berries. It was great! 

There are so many great selections! This is a great place for brunch, business meetings, or just some time to catch-up with family and friends. I look forward to visiting again!"}
{"text":"The food is tasty, the presentation is excellent however my only negative is the food and portion size does not justify the cost.  The cost is 35% higher than other comparable restaurants in the area.  Once you put the price aside everything else is great."}
{"text":"Cafe Monte is one of Charlotte's truly great restaurants.  We have been going there since we arrived in Charlotte and the food and service have been consistently outstanding.  There tonight and found a new favorite meal - Short Rib Poutine.  Absolutely outrageously delicious and totally decadent!! Live in Ballantyne now but the drive up to South Park for Monte is so worth the time. You owe it to yourself to go if you have not as yet."}
{"text":"Although I can only speak for the crepes, we've always enjoyed our meals when we've been there. The flavors in the chicken and mushroom crepe are absolutely outstanding! We did not enjoy the flavors in the seafood crepe nearly as much. The food is extremely rich and leaves you very full by the end of the meal."}
{"text":"This is still one my favorite places in Charlotte. The food is always delicious and the staff is exceptional. If the beef wellington is on special- definitely try it."}
{"text":"Good food and service. Better gluten free selections than most restaurants. Great service.

Coffee and drinks are also worth a look."}
{"text":"I have been wanting to try this place and when I saw the charlotte dealsaver it was a sign that we should try it!  We made reservations for a Sunday morning for brunch.  I'm realllly glad we did.  They were slammed!  We were seated promptly and immediately were brought waters and asked what we wanted to drink.  It was too early for mimosas so we both went for an espresso.  It was yummy.  We both ordered the ham and egg stuffed crepes with some kind of heavenly cheese sauce.  For dessert we ordered beignets.  They were delish but I wish there was a cream dipping sauce instead of the jam.  The service was excellent and the environment was nice."}
{"text":"I have stalked this menu for months, thinking that once I actually had time, I would be able to indulge. Sadly disappointed.
My highlight was the Escargot.. placed on small buttery, flakiness... I was in heaven for 2 secs. I ordered the Parisian Omelet, requested NO ONIONS, and received ONIONS. 
Ordered scrambled eggs with cheese, received NO CHEESE. The potato cake was fried alittle too hard to enjoy.
The staff was courteous however, I didn't receive what I wanted. Since the order was takeout, this made the experience even more distasteful and disappointing. A waste of $30!"}
{"text":"Good service, great food! We got the all you can eat mussels (Monday night special) and the beef & asparagus crepe. Both were delicious"}
{"text":"This is one of our regular places. Always really good specials and french martini is yummy. Just go and love it."}
{"text":"My husband and I went to Café Monte for breakfast this morning. He had classic eggs Benedict and I had Florentine omelette. They were delicious.  We really like the ambience. It looked like a French bistro inside. We will definitely go back."}
{"text":"When I walked in, I noticed how warm and inviting the atmosphere was. I checked out the fresh desserts, and my mouth salivated.

The menu offered an array of fresh French dishes, including escargot, duck, and crepes. Brian and I split the lobster and crab cakes, along with the mussels and frites (french fries).

Our meals were decadent, fresh, and flavorful. The service was superb. The price was extremely modest for the quality of food we received. The portions were generous, and our experience was wonderful.

Would I recommend Cafe Monte? Absolutely. If you are in the area, check it out. Bon Appetit!

Read more about my experience here: http://www.ginapacelli.com/2015/04/16/north-carolina-cafe-monte/"}
{"text":"A girlfriend and I grabbed lunch at Cafe Monte a while back and I'm happy to say it was solid. The best French cuisine in Charlotte? No. But a nice lunch choice if you're in SouthPark? Oui!

With French cafe cute insides, Cafe Monte hosts really great, attentive service and a nice array of items. I haven't been yet for an a.m. or p.m. meal, so I'll just focus on my lunch. I went with the B.L.T. with a side salad - damn good bacon, soft yet crunchy bread and a light touch of mayo, exactly the way I asked for it. The side salad was fresh albeit a bit heavily dressed. But I have to note that my friend's french fries were outstanding. I couldn't keep my paws off of those hot little frites. Good thing she shared! 

I definitely want to head back to Cafe Monte and try some more deliciousness."}
{"text":"Delicious brunch!  Our group had Classic Benedict, Salmon Benedict, Crab Cake Benedict and Croque Madame.  Can't wait to come back!"}
{"text":"A very good choice for Queens Feast they had an excellent restaurant week menu. Small and quaint they pack them in a bit more for CRW it seems but the giant pics of France will take you away. The CRW menu includes a cheese plate course. I had the beef short ribs which were perfectly braised tender and juicy. The bread pudding dessert was great as well. You can't go wrong here if you are in the mood for a little French cooking."}
{"text":"LOVE their brunch. I have never been disappointed. Their bread is so fresh and delicious. Always have great service too!"}
{"text":"Lovely cafe to visit while shopping in Charlotte. French onion soup to die for and a wonderfully diverse menu for every palate."}
{"text":"Went for breakfast early one morning. Sat at the bar and had excellent service and who doesn't love an omelette with bacon and brie? The breakfast was amazing and I'm already looking forward to my next meal there."}
{"text":"I've never been to France.  I know people who have, and I know people who grew up in France, but from the stories I've heard, Cafe Monte sounds like it could exist quite easily on many Parisian corners. It's casual and sophisticated at the same time, unobtrusive and genuine. And the food is killer.

Cafe Monte has become my favorite brunch location.  Their cuisine is in the country French style: very comforting, a light hint of French sophistication, and features ingredients you would easily expect to find on the farm or at the market. My first venture included the Benedict Monte, a hybrid concoction that seems to fuse the French and American versions of this dish into a delightfully delicious meal. Soft, crunchy English muffins, oozing eggs, and a smooth Hollandaise.  I've also tried the French country breakfast, which is equally amazing. The coffee is great, too - nothing over the top, just good tasting lattes and coffees.

If the lunch and dinner offerings are just as good, I could see visiting here very often."}
{"text":"Great food and service, one of our favorites places to go for a celebration or to take company."}
{"text":"This place has gone down hill from what it used to be.

Dined here Sunday morning and was surprised that there were a number of empty tables at 10:00 (the service will tell you why).  We were a party of 2 and the snobby hostess wanted to seat us on the back wall bench seats between two tables that each had crying babies.  When my wife asked for a different table she huffed and puffed like it was a big inconvenience.  So she puts on on the other side of one of the tables full of kids.  Seriously?  There are plenty of other open tables.  We should have left at that point.  Waiter was terse, slow and never asked how our food was. Food ok.  All that and its $45 for 2 for breakfast.  I don't think so."}
{"text":"I really liked Cafe Monte - you can tell even when you walk in that this bakery means business. The pastries are awesome! The people behind the counter are really nice and accomodating. You need to try this place if you are in town and have a sweet tooth - you won't be disappointed!"}
{"text":"Fantastic food!! If you want breakfast they have an amazing breakfast menu! The staff are delightful. I would definitely recommend it."}
{"text":"This restaurant is tucked in Phillips Place,  next to the Whole Foods, and located on the corner of the building and looks small from the outside, but is spacious on the back.  
We went for dinner,  around 8:00, and the place was busy but not packed. The prices are on the expensive side but not terribly expensive. It is a great place for a date or double date. It was supposed to be jazz night but I have not noticed live band, but heard jazz music pumping from the . 

We started with cheese fondue which was great, not too sour and without aftertaste that grocery store bought fondue leaves.  The bread that accompanies the fondue was superb, wished we could take home some.  

We ordered for our plat principal the shrimp risotto and the trout Amandine, both were flavorful and great. I was eyeing the crepes but decided for the trout,  and it didn't disappoint me; I will try the crepes next time. 
As dessert we ordered the beignettes and came 6 BIG pieces,  enough for 3 to eat. With wine glasses and coffee our bill came out $78, which was worth it, but hoped it would be a little less than that. 

Definitely returning in the near future for another meal!"}
{"text":"Mon Dieu! I can't believe I haven't reviewed Café Monte until now!

Café Monte is a cute little French café in South Park. I have been grabbing brunch, lunch and dinner here now for years. For brunch, I particularly love the Fruits de Mer omelette, which beautifully combines my two favorite foods, eggs and seafood (lobster, crab and smoked salmon, oh my!) For $15 dollars, you get a huge seafood packed omelette, fresh fruit, two pieces of delicious grainy bread, and a sand dollar sized hash brown.  I do order other things, but the Fruit de Mer omelette never ceases to delight.

The tomato bisque is another favorite of mine.  The French fries are also perfectly thin and crispy. They are almost too good to be true! And no meal is perfect without one of their exquisitely crafted cappuccinos. One of the best I have had!

It's been too long since I've had dinner there, so I leave you with my brunch recommendations until next time! The duck confit pizza is really calling my name."}
{"text":"Yummy yummy yummy!! All of it! Had the crab cake sandwhich- but ended up not eating the bun because it was too much- anyways it was so tasty!! The Creole sauce made it better than most other crab cakes. Then split the coconut creme cake with my friend and we could not believe how amazing it was. So moist and every bite was heavenly. I wish I could have seconds! I loved their side salad that came with my meal and it was a very generous amount too which was suprising! Get it with the vinaigrette :)"}
{"text":"This is and will remain one of my favorite restaurants in Charlotte. The food, atmosphere, and service are almost always perfect. I just will not order the lump crabmeat salad again...it arrived, a beautiful mixed greens salad, with a tiny mold (about the size of an individual serving can of cat food) of bits of crabmeat...distinctly not \"lump\". It is a pricey salad, as you would expect, but I think they are making too much profit on this one. Definitely not worth the money.  Cafe Monte...you can do better!"}
{"text":"Came here for a fantastic Sat brunch.

Pros:
- delicious and fresh food
- large portions
- yummy mimosas
- friendly service
- reservations on opentable
- cozy but classy atmosphere
- outside seating available

Cons:
- expensive (spent almost $30)
- parking can be difficult during peak times

I got the croissant with smoked salmon and cucumbers with a salad as a side. The salad was really light and refreshing. The croissant was buttery and flakey. And I was happy with the generous portion of smoked salmon. Mimosas weren't on the menu for some reason but they have them! I would come back but only for a special occasion. It's pretty pricey otherwise (though it's southpark so to be expected I guess)"}
{"text":"Cute place, nice atmosphere for all occasions, solo at the bar or with friends- date in the dinning room. 
Excellent service & attention to details. 
Creating menu at times but still yummy"}
{"text":"It is always wonderful to have a brunch at Cafe Monte!! Benedict Florentine on hot croissant, chocolate chaude.. I can't think of a better way to start my Sunday morning ;)"}
{"text":"You know, I came here once about five years ago and never came back. I'm not sure why. This past weekend I met my friend for breakfast around 9am on a Sunday and we were seated right away with no wait. The table was tiny, but it was fine. Our server was very friendly and attentive. I ordered the open face vegetarian sandwich and it was so delicious. The pomme frites were thin and crispy as well. I'm so glad that I decided to come back to cafe Monte. I will be a regular for sure!"}
{"text":"Am I in France? Am I in Charlotte? I'm so easily confused after entering the doors of Cafe Monte and I love it. 

Talk about a restaurant that doesn't make you feel like you're sitting in SouthPark! Let me preface this review by saying that I work close to Cafe Monte and by close I mean a mere 3 floors in the up direction. 

I've been to Cafe Monte many a time. On some occasions its for a quick cup 'o joe (skip this if you can because their regular coffee isn't the greatest), on others its for a to-go box of french fries (no judging) and last night it was to part-take in my first dinner experience.

For the sake of this review and your time I'm going to focus on din-din. For a Thursday night it was pretty packed so my thoughts are to make a reservation if you can. You're always greeted with a smile that makes you feel like you've come home after a long vacation. I love it. 

The atmosphere plays a big part of love for this French inspired bistro. Oh oui, it does. My dinner experience was a part of Charlotte's restaurant week so again, I could sample a few different things which I love.

Decisions, decisions! There were too many good ones to choose from. Do I go Coq au Vin (they're specialty), the short ribs (a big fave of mine) or the scallops (mmmm scallops)!?!? In the end I went with the scallops as my mainer and started with the tomato bisque. The bowl of soup was a little on the large side but I apparently had no problems polishing that sucker off. 

The scallops can on a bed of roasted zucchini and summer squash risotto. Can you say YUM?!? I didn't manage to get through it all but I noticed my fellow dining companions managed just fine with someone looking pained as to whether or not they could lick the plate.

We had a d-lish vino (from the headache I'm feeling today, it was a bit too d-lish).

My thoughts: GO. GO NOW. It's a great hidden gem off the beaten track."}
{"text":"Second visit was better than the first - we brought our 4-year old who gushed over the grilled cheese (and I agreed, good cheese in a grilled cheese makes all the difference)! My lump crab salad was delish and my husband's risotto was perfectly cooked. It's not a \"cheap\" meal out, but you pay for quality - the place was definitely jam packed and proceeded to stay that way.... We ended the meal with the vanilla macarons and while quite pricey, they were fresh this time around (they were broken and semi-stale last time). Quality was by far improved - the only downside was the hostess who took awhile to see us and approached us while talking on the phone \"I will be right with you\" - felt a bit off but as noted, it all came together!"}
{"text":"Great food and service. The crepes were stellar!!  Desserts were wonderful. Check this place out."}
{"text":"Our waiter Richard was awesome! He was knowledgeable and helpful. The food was great. We had the scallops and lobster specials as well as the charcuterie entree. I asked for brussel sprouts instead of fries and they accommodated my request easily."}
{"text":"First the food is good but the restaurant service is bad. Today is not busy and service still too slow and never come back to my table ."}
{"text":"Love this place! It doesn't advertise much and it's not on the side of the road with huge signs. So it took us a while to notice the place, but now that we love the place, my wife and I think that it's actually nice that not 'everybody' knows this place.

It's a really wonderful, pretty looking place with an awesome team of people who knows what service is. They know what they have and they know how to make what they have sound delicious. Most importantly, they were patient with us asking if we could get pictures or what the menu was.

And the food... I had the Duck Confit. It was great! I usually like the taste but dislike the aftertaste or the flavor some duck dish have. In this case, it was a hit. Out of the ball park! And how about the salmon my wife ordered. It was also delicious. Our drinks were fabulous as well.

Lastly, we were lucky and got to hear the wonderful band play some jazz music too. I felt like I was back in Europe. So if you like that kind of atmosphere, and if you like duck and seafood, go check it out. I promise, it won't disappoint."}
{"text":"Very uneven service tonight. Menu has also gotten tired. 
We will be looking for another go-to Southpark restaurant."}
{"text":"I enjoy the brunch here.  Spent last Sunday and had their spinach quiche with fruit.  Service was great, conversation was great and the coffee kept coming. Perfect"}
{"text":"Amazing!!! Totally recommend this place. The basil penne was melting in my mouth. And the dessert... wonderful!"}
{"text":"Delicious food! My fiancee have been here many times and we are always satified with the food and the service.

The bread is very fresh and the beef tips are always good!"}
{"text":"Last night was my second visit and the love affair continues.  Everything was delicious with one exception, the Escargots starter.  It did not have much flavor.  That being said, my husband's Trout Almondine was the best he's ever had and my Chicken and Mushroom crepe was delicious enough for two meals. The bread was divine and the service on point. Once again, a terrific experience at this restaurant."}
{"text":"Excellent service. The coffee was very good, as was the crab and lobster crêpes. Too many tomatoes for my taste, but I could easily move them out of the way and still enjoy the dish."}
{"text":"They do some things well but a few problems drag down the overall rating for me. On our most recent visit there was no one to greet us and we had to wait for a little while for someone to seat us in a nearly empty restaurant at 11:20 AM. Once seated everything was fine, the waiter was good and the service fast and not \"overbearing\" My biggest problem with Cafe Monte is the inconsistency of the food. We have been 3 or 4 times, it has ranged from fantastic to meh...our most recent visit was ok. my quiche was good but nothing special, mushroom soup was good, frites could have been better. My wife's pulled pork french dip was not bad but a little soggy and too much bread which was a little greasy. we were offered a couple of uninspired dessert choices but as we left, noticed some lovely pastries in the case. We would have ordered some of those had they been offered.  All in all, it's OK but I long for a great French Restaurant in Charlotte."}
{"text":"Service is divine. Food is mediocre I hate to say. And it's expensive. We had dinner (my mate and me: a romance night out) and got tables in the corner sitting side by side which we loved. But the trout almondine is loaded with salt, and our $17 house special appetizer last Sat. might was cold in the middle. Wine service is exemplary: glasses are filled full for that $9. glass. I am torn about this place because they are so nice. Maybe I will try a simple salad next. Ha. Or just wine and dessert!"}
{"text":"This hidden gem popped up randomly one morning on my search for brunch. We decided to make the drive and were thrilled with the service and food! The atmosphere is very much like a true French bistro (except much larger) and the wait staff are all dressed to the nines even for brunch. 

I recommend getting a reservation if you would like a table in the main seating area because the food is truly that good. I had the crab cake Benedict and my date ordered the croque monsieur. They were both prepared excellently and the cheese on the croque was done perfectly. The side salad was also in traditional French fashion and was simple and delicious. 

I am looking forward to trying dinner here sometime in the near future!"}
{"text":"I like to keep things short, so the skinny is: Very good food, very slow service. For me, that is not a huge problem, but I've been here 5 times and its always the same, does not matter if crowded or not. Trying to keep your girlfriend engaged in cheerful conversation when she is hungry and wants to order is not the most pleasant experience! Gentlemen, when your gf wants to order, don't attempt to make light of the situation and crack some jokes, track down the waiter and make him take the order! - Life lessons."}
{"text":"Every time we visit Charlotte, we inevitably end up back at this old time fave for a French bistro meal before or after shopping in this tony area.  Cafe Monte has the look and the feel right with the woven back chairs, the dessert case resplendent with French pastries, and waiters dashing about with long black aprons.  Our hosts over Thanksgiving love to come here for a monthly tasting of French wines, which sounds like a fun evening the last Tuesday of every month.  We just love to come for brunch, lunch, or dinner!  Expect everything to come in a cream sauce and just go with it, even if it is the day after Thanksgiving!  Their salads, pomme frites, savory crepes and even their pizzas are very good.  Since we had homemade apple pie at home to finish, we somehow managed to depart without trying any of the pastries.  I've saved those to try on our next visit along with the duck confit pizza I should have ordered instead of the very tasty pizza margherita."}
{"text":"The crepes at this place are phenomenal!! I was very pleased with my brunches here.  The restaurant is unique inside with a lot of seating and even a bar area to sit.  There is a patio for warm days and nights.  An overall fun atmosphere.

Service is great.  I have had dinner here once for restaurant week and was very pleased.  Never a bad experience."}
{"text":"Last night i went with a party of nine to Cafe Monte.  The service seemed off.  Granted the server was busy, but it took about 20 minutes for him to get back for our orders after bringing our wine.  The entree also came out well after we were finished with our soups and salads.  They also seemed to be out of several things like mussels,  wines and one of the specials.
Service aside, the food was pretty great.  I started with an endive salad with blue cheese and pecans.  It was perfectly balanced with a sweet Dijon dressing.  For my entree I enjoyed a crab and lobster crepe in an herbed cream sauce.  It was delicious.  
Next time i am in Charlotte, i would love to try this little bistro again."}
{"text":"Solid, affordable brassiere fair served in a comfy, airy space trying its hardest to look vintage Paris. I'm about as comfortable at Phillips Place as Billy Graham is at a \"bama rally, but the staff did a perfect job of chilling me out and filling my tummy.

Noteworthy: The ratio of women-to-men the entire time we were eating hovered at about 20-to-1. Which I found extremely amusing. Another fun moment: when the staff and tables surrounding a 10-member elderly ladies meet-up all hushed and waited for them to finish saying grace. Tehehe.

We chose what we assumed would be lighter entrees - his was the open faced veg sammich, mine the quiche florentine (10 and 9, respectively). I've never had a slice of quiche like the slice I had today - they somehow managed to make fondue into a pie. It was amazing, but not in any way a healthy choice, although the side salad helped to balance it out a little. His was equally surprising - although it appeared light on the butter fats, it had a hidden decadence that we both found interesting and irresistible. The frites were insanely thin and perfectly fried. Awesome. I'm going to have to try the pizza and benedicts, but maybe on a saturday when I can take a long nap afterwards. Ya.

I think I'd be tempted to give Monte's a fifth star but for one thing; the coffee. Anyone that's been to France knows how seriously the baristorial arts are taken there - and if you're going to go French Bistro as intensely as Monte is trying to, your coffee had better be up to snuff. My au lait  was not satisfactory - tasted cheap, stale, and like it had been made with skim milk. Not a problem with construction but ingredients. And $3."}
{"text":"I love Cafe Monte. I'm so happy that they continue to put deals on Living Social and Groupon. Even if they didn't, I'd still frequent this quaint little restaurant. Beware...it can be quite busy on Sundays for brunch, but that's my favorite time to go! Order a cafe latte and sit back and people watch. It's almost like being in Paris. And then the lovely waiter brings over a plate of delicious prime rib on a french baguette and piled high with pomme frittes. Oh my yum!! I admit, I order the same thing every time! I have tried other things on my friend's plates, and it's all perfect. Merci!"}
{"text":"Tasty variety of appetizers. Among my favorites are the pate, artichokes and Bre. Delicious short rib. Good wine selection. Romantic atmosphere. Has live music on Fridays. Great table service. I need to come back here more often!"}
{"text":"Love love love this place! 
Not only great food and great service but wonderful ambiance!
Their Brioche French toast are to die for!!"}
{"text":"The croissant and omelet were amazing!  I got the smoked salmon, crab, lobster, tomato, and chives omelet with egg whites and it was very fresh and delicious.  It comes with a choice of bread (I got a croissant...best choice!), fruit, and potatoes.  My husband got the French toast, which I might get that next time because it was so good.  Coffee is awesome too.  I think we will definitely be back soon!"}
{"text":"So good! Went with a large group, and then went back with a party of four. The mussels in white wine sauce were very good. The risotto with jumbo scallops was very rich, and amazing. Best meal I've had in years. 
Great wine selection. A must try."}
{"text":"This is my favorite restaurant in South Park. Whether you go for breakfast, lunch, or dinner... you will not be disappointed. For dinner, I order the chicken salad with a side of fries. Oh my gosh. The fries are the best I've ever had and the chicken salad is incredible. I love the romantic atmosphere and the attentive servers (always kind and welcoming). I feel like I'm eating at my Aunt Diane's kitchen when I eat here. Well done."}
{"text":"Superb food served timely with excellent service. Amazing selection of food choices. Great atmosphere- can't wait to go back!"}
{"text":"This is my favorite restaurant  in Charlotte. Everything is delicious... Everything! The taste is authentic French cuisine, but the portions are definitely southern.  You will not leave hungry."}
{"text":"Brunch at Cafe Monte never fails. 
Make sure to make a reservation for brunch on the weekends! 
Today we tried the smoked salmon crossiant with house salad, and the classic eggs benedict with a side of sausage. Everything was delicious and fresh. Thanks for never letting us down!"}
{"text":"Love going on sat night to enjoy the musicians.  Think the staek and frites is a great value. Wonderful mussels.
 Place just FEELS like Paris.    Great staff"}
{"text":"Whether it's their wine dinners or Sunday brunch, this restaurant brings creative classics and great service.  The price point is easy  and the food is yummy.  The atmosphere is a little crowded, but lively.  The wait staff is always knowledgeable and personable.  Always a treat!"}
{"text":"This is such a cute brunch spot! I was craving some french toast and Cafe Monte was the closest place with decent ratings. I of course got the brioche french toast with a side of bacon. The french toast itself had 4 very huge and fluffy slices of brioche bread. It was airy and buttery and toasted just enough to get the crust hard, but soft in the middle. Very good for a simple french toast. I also got their coffee and it was delicious. It was a bit strong black, but with a little bit of milk it was perfect. I've noticed most of the customers are older ladies and I think the ambiance caters to that. Would love to come back and try an actual french dish."}
{"text":"Meh. I got the salmon croissant and it was flavorless and my husband got the hamburger royale and it was super greasy. Disappointed in flavors. It seemed their clientele consisted of elderly people and middle aged woman. What earned them 2 stars? Bread and pomme frittes."}
{"text":"I was really hoping to like Cafe Monte, but I didn't because - the first impression was ruined by our interaction with the hostess, who just seemed so disinterested in her job. Not that she wasn't attending to us, but there was no pleasant greeting, or even a smile on her face. The food tasted good, but it was the absolute opposite of healthy. I had the shrimp and artichoke crepe w/ spinach and bechamel. I was expecting there to be a little bit of the cream sauce around the crepe, but the entire crepe, all the shrimps, spinach and artichokes was dunked in the bechamel sauce! I enjoyed the first bite, but after that I was just filled with guilt, and couldn't finish the entire dish. Same with the vegetarian crepe that my friend ordered. The club sandwich tasted great too, but only for the first two bites until your mouth and throat were coated with all the butter / oil from it. Now on to the good things: I had heard that they are usually pretty slow with their service, so we sat at the bar, and fortunately avoided the slow service :) The waitress was attentive and sweet. The owner was walking around, and was very sweet too. I really really wish they'll improve their food and make it a wee bit healthier, and when i read a review that says that, I'll be sure to go back there!"}
{"text":"I've lived right next to the restaurant for 2 years and I've never had a bad experience. Their menu and wait staff are phenomenal and always take care of me.

If you are hesitant to go, find a Groupon for them and you won't be disappointed."}
{"text":"I try to do a monthly girl's brunch with a group of friends from the Charlotte area. We rotate between restaurants. The only rules are that the restaurant must serve brunch, they must have booze (sadly, only after noon on Sundays - so much for separation of church & state...), and they must offer some kind of eggs Benedict. 

After all, I believe the Latin translation for brunch is mimosas & eggs Benedict for all. Right!?!? I read that on the internet somewhere, it must be true. 

We always make reservations so we don't have to wait. We checked in but had to wait to be seated until our whole party was there. That's fair, but I sometimes scowl because I want to 'get started' with a drink. 

On this occasion, I opted for coffee instead of booze. The coffee was good & strong. I ran out and had to wait 5 minutes for a refill once, which frustrates me. Also, on this occasion they really weren't that busy. There were a handful of open tables before 1PM. I found the service to be subar. Not terrible, but not on point. We frequently found ourselves looking around for the waiter when we needed refills or wanted to order. 

My friends got different dishes, which I don't recall... But I surely remember my order. I ordered the eggs Benedict. It's a brunch staple, and really hard to mess up. It's not something I make at home, so when I have the chance to order it, I do. 

Oh man - it was AWFUL. Absolutely awful. I've had different 'takes' on Bennies before, and I've had them where the sauce was maybe runny, or too buttery... and I've also had them when the egg was grossly over or under-cooked. I would have graciously taken any (or all) of those flubs over what I got.

The egg was cooked fine. The ham was fine. The bread wasn't toasted fully, so it was mush. The sauce - OH MY, THAT SAUCE - was repulsive. It was thicker than most, but that wasn't the biggest issue. It was SOUR. It was not only sour, but had God knows what in it. It arrived doused in the Bearnaise sauce, and even before tasting it I tried to scrape some off to no avail. Then I tasted it and it was disgusting. It was bitter, sour, and just plain nasty. I know some Bearnaise sauces (depending on recipes & taste) can be a little tart, but this was inexcusable. I tried to wipe off the egg & ham and eat them plain, just to get some protein and value out of the dish. I only succeeded at eating maybe one egg and some ham. 

Normally, I wouldn't hesitate to tell the waiter this was terrible and request a different dish. But, the waiter never came back until long after everyone else was done. Someone else cleared our plates, and our bill was dropped off. 

So after driving a good hour into the area to do brunch, and paying"}
{"text":"This is my second time for brunch. When I first came to this place, the waiting was around 40 minutes as I came without reservation on Saturday. This is a pretty popular place for brunch. This time, I came on Friday after lunch time and there was no problem to get the table.

I ordered lobster and crab crepes last time and I liked the creamy sauce on it but it was a bit salty for me. The portion is good though.
This time I ordered croque madam and it was great. I really liked the pommes fries it came with, thin and crispy. The food is good here and I like the atmosphere. It will be good to avoid busy time for waiting,also the noise level will be a bit high."}
{"text":"New favorite brunch spot. The food was delicious. The eggs were perfect and not dry, the bacon was crispy on the edges & it had flavor! The beignets were hot and tasty. Our server was on point and so professional. Only negatives which are so minimal... but the water doesn't seem filtered so get sparkling water if that bothers you. Also the mimosas are $8 which it would be nice if they were a little less since they come in champagne flute. The food is reasonably priced for the quality and quantity. Will def be coming back soon."}
{"text":"Would only recommend coming for brunch. Because dinner items are good but are slightly overpriced. I guess you're paying for the ambiance more than the taste."}
{"text":"When I  was first moving to the area, my realtor brought me to Cafe Monte for breakfast, and I remember a good experience. We sat inside, and I had the Eggs Benedict.
Today went to lunch, and did have a reservation--my dining companion likes to eat outside.  Our reservation was for 1:00.  Our table was not ready and had to wait about fifteen minutes.  Another person showed up, and was seated right away at a table outside, they too must have had a reservation.  My guess is they were regulars, as the waiter seemed to know them, and spent a fair amount of time talking with them.
Our waiter was very slow and seemed to spend a lot of time socializing with the regulars who were seated before us.
We finally did give our drink order.  We have a running test, my girlfriend likes lime in her water, and we will always order, asking for lime--the test is if they actually listen and bring the lime or lemon--our waiter did not pass.
My girlfriend had the Quiche Lorraine, and I had the Beef Short Rib Baguette, which is supposed to be their more popular sandwich.  The sandwich -- short rib, caramelized onions, provolone cheese and arugula.  I could not detect any onions, and the sandwich was too greasy for me--I couldn't finish it.  The quiche was very good, and my girlfriend finished her whole plate, which doesn't happen often, so you know it was good.
Our waiter never did come around to ask how everything was, never asked if I wanted another drink, must have been too distracted talking with the regulars at the other table.  I was finally able to flag our waiter down to ask for our check.  The hostess didn't seem very friendly as well. I would think management or the owner realize that the hostess is the first impression and the wait staff represent the establishment.  The restaurant was not that busy, so I really can't understand the slow service.  Based on this experience, I don't think I'd go back."}
{"text":"This place is awesome. I've always had good food there and the service is always friendly and attentive. I've gone for dinner and brunch and they've both been fabulous. One of my favorite entrees is the chicken and mushroom crepe. It's just delicious and creamy and full of flavor. I had a delicious cappuccino and eggs Benedict for brunch which was also delicious. The restaurant is a little unassuming from the outside, but the inside it adorable, with great big pictures of Europe and a cafe feel. Definitely would recommend to anyone!"}
{"text":"Went to Cafe Monte for the first time Thursday night for dinner to use a Livingsocial deal that was about to expire. 
We made a reservation and when we arrived the restaurant was about 3/4 full. We were immediately seated at a small 2-top with bench seating on one side. I found this table to be too small and the server had to keep awkwardly moving items on the table in order to fit everything. 
The bread they bring out to start is warmed and very delicious. My husband started with the soup du jour which was a carrot bisque and it was great. 
For our entrees I had the vegetarian crepes which were flavorful and substantial, covered in a rich, creamy sauce. My husband had the crab cake sandwich and that was good but not the best. The fries were skinny, crispy, and plentiful. The portions seem to be quite large for a nicer restaurant. Would love to try dessert there but we were too full this time. 
The service was good and prompt. 
Bottles of wine are half price on Thursdays but if you use any other promotion (such as a Livingsocial deal) they will not give you the drink special. I thought that was strange considering we spent over the LS amount on our food alone, but that is their policy."}
{"text":"One of the best gems in Charlotte! 

Food is consistently prepared perfectly, as well as amazingly quick! Dishes are out within minutes of ordering! 

Escargot for a starter is fantastic, NY strip or duck for an entree are delicious!

Staff is always knowledgeable, and even excellent.

Check out live music on Friday's, it's a great atmosphere. It's one of our favorite restaurants in Charlotte!"}
{"text":"We checked yelp reviews and picked this place, and it was well worth it.   Great food and atmosphere"}
{"text":"I have tried Café Monte for the 4th and final time.  

I keep wanting to like this place.  Nice décor and while the menu isn't large, there are many things on it that sound great.  This time I ordered the mussels and the duck confit.  Both were very disappointing.  The mussels came out in an unappealing cream sauce that I can very easily trump at home.  The duck confit was just so so and did not have much flavor.  How duck fried in duck fat isn't an explosion of flavor is beyond me.  I find the frozen duck confit from Reids to be much better.  I do have to give them credit for their starter bread, however.  It was fantastic and may be the bread that I've had in Charlotte.  

Sorry Monte, but that's the last time that I will see a credit card charge with your name on it."}
{"text":"This place is totally about the atmosphere. Frequently attended by live musicians, it is a great venue for a drink and a book, or catching up with a friend. The service is extremely professional, and very attentive. They don't make everything - but they do have all the standards, and the outside patio is very pleasant during good weather.

It's adorable. If you're into adorable, you'll like it."}
{"text":"Great food. The quiche Lorraine was exceptional!"}
{"text":"We went for our first time this weekend and loved it! It was a rainy Saturday so the \"french bistro\" atmosphere seemed perfect. We got a table quick and had a very attentive server who gave us the full rundown of the best items on the menu. 
Outside of the cute set up - the food was amazing! Zero exaggeration - the best French Onion soup I've tasted to date, and that's saying a lot. My bf had the french dip sandwich and it was perfectly cooked in every way. Hot with melted cheese and just the right amount of au jus. I had the banana flambe nutella crepes and they were excellent. They also had great looking pastries and every kind of coffee you could think of. Overall, great place with great service and great food. Will definitely be back!"}
{"text":"Had their smoked salmon Benedict and it was amazing atmosphere was great but it's a bit expensive."}
{"text":"FYI.  This is a French bistro, not a Italian place like some one has suggested.   Beautiful decor complimented with great classic french food.  

I've had the Steak ou Pouvire and Duck Confit, which are both fantastic.   My wife have several different version of the crepes. 

It reminds me of the bistro in Paris or Vienna.  It's a truly refreshing addition to the South Park restaurant scene."}
{"text":"I came here for a working breakfast with my team at work. I've had this place bookmarked for years now. I don't venture to this side of town often so I was pretty excited.

The restaurant is very large but still intimate. The place is clean and the restrooms are lovely. 

I didn't have any coffee but others claimed it that it wasn't very strong. 

I ordered the smoked salmon eggs Benedict. Very good. The eggs were properly cooked. I didn't care for the side of hash/potato at all. My meal was good but honestly, nothing wowed me. Others at my table ordered the french country breakfast and the seafood omelet with no complaints. 

Overall, this restaurant wasn't too bad. Personally, I don't understand all of the hype. I would probably come back to try lunch but probably not breakfast. It could be a possibility that maybe my palette isn't refined enough to appreciate Cafe Monte but it is what it is."}
{"text":"Ive been there for dinner and breakfast. Breakfast is great ( croque madam is the way to go) and dinner is yummy as well, great wine and sometimes they have live piano playng.
The chocolate ECLAIR is the best I've tried in my entire life. amazing, amazing, amazing!"}
{"text":"Excellent quiche Lorraine. Crisp, warm & fresh! 
Excellent chicken & mushroom crepes with cream. 
Chicken club sandwich not my favorite. Skinny fries so good. Busy place!"}
{"text":"Ok well maybe I was a little harsh because the service is usually good maybe a little snooty one time but I've waited tables before and maybe he had an off day. Food is good and that's what it's about in the end."}
{"text":"Just stopped in to hang with a friend and grab a couple of drinks. So I cannot discuss the food (which smelled delicious) but I CAN discuss the decor, bar, staff, and bathrooms: all of which exceeded expectations. The staff was very nice, good conversationalists, and knew their stuff. The bathroom was, frankly, very nice and reminded me less of a bathroom than a nice lounge. I loved the entire decor of the bar area and place in general. Not a sports bar, but plenty of TVs. So, NOT the cheapest place in the world - but what do you expect for a place next to Southpark/Philip's Place/Whole Foods? Just a wonderful experience overall."}
{"text":"My wife's favorite restaurant in Charlotte. From the service to the bread to the burgers or fish - you basically cannot go wrong.

I used to have the trout and my wife the salmon. However, their burger is really good (love the frites, too). And my wife is now stuck on the trout. She also likes the various coffees and pastries offered.

Don't forget to ask for the bread. The freely give it, but sometimes you have to ask. It's warm - crunchy on the outside, soft on the inside. Perfect.

Nice atmosphere. Not too stuffy, but the place has some character.

This place is usually hopping on the weekends. Try a late lunch if it's a Saturday."}
{"text":"This place is a sure bet for great food! My boys have extremely discerning taste and this place is perfect for them!"}
{"text":"Very cute place. Reminds me of a french cafe upon walking in. We were seated quickly but our server took some time to get to us. I will say it was busy though. We had the pate as an appetizer, was alright. My husband got the steak and frites, it was delicious! I had the mushroom pizza, nothing to write home about. The bottom was not crispy at all. Id like to give it another try."}
{"text":"My husband and I had brunch at Cafe Monte this morning and it was amazing! When we first walked in, I wasn't sure because the hostess was on the phone and took 2 consecutive phone calls without even acknowledging us, but a 2nd hostess came to the desk after a minute and seated us quickly. We had the beignets as an appetizer. An order of 3 was large enough for us to share and they were light and pillowy perfection! My husband had the Benedict Monte and loved it. I had the steak and eggs. I asked for a side of Brie cheese and Hollandaise and had my eggs over medium. My favorite part of the meal was my Bloody Mary! The waiter even made sure to get my husband's mimosa in a less girly glass. Service and food were great and the dining room is sunny and inviting while maintaining its high class feel."}
{"text":"First time here with both my wife *and* my daughter. Smiles and enjoyment all around!

Yes, Sunday brunch on a sunny day is going to be busy and we were waiting for every one of the twenty minutes that the hostess said it would be. No fault there.

We started off with a plate of beignets, which had the required heavy dusting of powdered sugar and also a small pot of strawberry jam for dipping/scraping. Very hot and very tasty. A nice starter while you look over the menu.

For mains, we each went with omelets or the crabcake benedict. Each was a good portion with plenty of filling and lots of hollandaise on the benedict. The hashbrown potato casserole was very yummt and the omelets also came with a small bowl of fresh fruit - blackberries and blueberries and such. Nice.

Very good coffee. Cappuccino was very good.

Service was good, ambiance was great and the food was very good.

We'll be back to Cafe Monte for sure."}
{"text":"The sword fish tonight was one of the best things I have ever eaten. The service from Lisa was OUTSTANDING."}
{"text":"My new go-to brunch spot in Charlotte. I will be back to work my way through the menu. I'm not sure there is much I can leave in this review because I'll be back. I tried the eggs benedict, and it was delicious! The atmosphere is chic. Make sure to make a reservation since it gets busy. The bread they bring to the table is warm, soft, and delicious. Make sure to come hungry!"}
{"text":"My first time visiting the South Park / Charlotte area and my brother suggested brunching at Café Monte. At first, I was a little hesitant (being that there's a Tupelo Honey also in the Charlotte area), but I LOVED it. 

I ordered the French Country Breakfast and was extremely satisfied! My brother and I also shared the Brioche French Toast and it was delightful (with or without Nutella, my favorite). I was also surprised to find hot beignets on the menu!!! 

Also, our server, Kyle was extremely attentive and hospitable. The French decor and the ambiance was outstanding. All this and more made this local French bistro a place to return to when in the Charlotte area. An \"A++\" in my book!"}
{"text":"We returned to Café Monte last night with a $18 for $30 Groupon deal. Of note, Wednesdays are half off bottles of wine at Café Monte. Also of note, other promotions are not valid when using a Groupon, limit one promotion per table. We still purchased a bottle of wine, a French Merlot, Nicholas for $34 at full price on top of the food covered by the groupon. We were seated right away, they had a good crowd going in the back of the restaurant. I guess it makes it easy on the servers. There were about 10-13 other tables dining at the same time. Our server, was ok, she should have mentioned the limit one deal per table much earlier than she did. We ordered the seasonal risotto with shrimp, $18, and the bf got the basil penne with chicken, $16. 

I love the complimentary bread that's brought out at the beginning, it makes me want to buy a whole baguette before I leave. Very fresh and soft on the inside, yet perfectly crunchy on the outside, just the way a French baguette should be. I prefer Café Monte's baguettes over Amelie's . The food was brought out surprisingly fast, it was not the case last time we were here. My risotto was generously dressed with tender shrimp, loved it, and a copious amount of veggies. The zucchini and mushrooms came out perfectly. It had a balanced, creamy yet flavorful taste. It was a good sized portion, I only left a little risotto standing on the plate when I was done. The penne was also good, need a little more seasoning but it had a generous amount of chicken and pesto cream sauce. Bill came to $37 after the Groupon was applied due to the full priced wine bottle, eh, will keep the 1 promotion per table in mind for next time. 

Remember to look for a Groupon/Living Social deal, it really helps considering the average price of a meal here. Oh, lunch/brunch menu all day on Sundays! Cheers!"}
{"text":"Back when I ate things like steak, I used to order the steak and eggs (when someone else was paying) or some sort of quiche (when I was paying). Because let's be reasonable, when you're poor, $17 bucks for steak and eggs isn't exactly the most exciting thing to fork over your hard earned cash for. Delicious, but expensive.

In any case, I used to head over here for brunch on Sundays after a long morning at church or for a working lunch during the week and truly, there are some gems on the menu.

Their pommes frites are delightful, and an excellent complement to many of the sandwiches offered. I make sure they comprise some part of my meal every time. Salads, omelettes, etc. are all great options as well.

As for the dinner situation, I haven't been in the evening. It's just such a lovely little spot for breakfast or lunch. 

There's a pastry case that looks fabulous and they have a full-service coffee bar. I usually just order regular, though.

Be warned, however, that there is generally always a wait around peak brunch times on the weekend."}
{"text":"My niece and I came here for our Sunday Brunch.  We missed our reservation time and they quoted us 35 minute wait to seat 2,  Our table was ready in 15 minutes.  I was torn between the quiche Lorraine, lobster and shrimp crepes and crab cakes Benedict,  I went with the quiche Lorraine which was served with a side salad. I also ordered french onion soup. My niece went with the steak and eggs.My quiche was cooked perfectly and the soup was great as well. The steak that my niece ordered was very, very small looked like maybe under 3 oz.  Its a good thing that she is a small thing or else she would have certainly not been satisfied.  The service and atmosphere was nice. My only gripe is that the restaurant is relatively large and popular and they only have one restroom. There was a constant line. Other than that I really enjoyed our Sunday brunch and I will definitely return for those crepes."}
{"text":"Cafe Monte was a good French lunch spot. The prices are a little inflated for the product, but we had a really nice lunch. The Monte Cristo's were not exactly what I had in Paris, but just as good. We may be back here in the next year, but will not seek it out for a lunch spot. Perhaps we will return to try the desserts :)"}
{"text":"DELISH!! The food is amazing here and the service was wonderful! As soon as we sat down we were greeted with waters by our server Naida. Plus, throughout the entire visit I never saw the bottom of my coffee cup - for those like me with the coffee addiction this is a huge plus!!"}
{"text":"I just experienced the ABSOLUTE WORST SERVICE of my life!!!! My date and I were REFUSED SERVICE at Cafe Monte. Management indicated they were closed at 9:45...despite the signage indicating the close time as 11:00. Not to mention we called ahead and the 11:00pm close time was indicated then as well. The manager was a complete JERK. He was condescending and rude. It was unbelievable!!! To add insult to injury after reluctantly and agitatedly giving us a gift card as we were walking out the manager stated \"just remember we close when we feel like it\" to which I responded \"so how will we know when we can come back?\" His response...\"you'll figure it out\". Unreal! Do not patron this business."}
{"text":"This rating is based on the fact that this is a brunch spot. Our food was great and lived up to the hype I made up in my head after Yelp listed Cafe Monte in an email being one of the top brunch places. Make sure you grab a reservation because i heard them tell people that there was a 3 hour wait if they were trying to walk in. The bar was actually good as well. Making a brunch drink is typically rushed, causing inconsistency but I felt that they did a good job! We had the beighnets and the Monte Benedict. Couldnt have asked for more in our experience here!"}
{"text":"I love a place where you can get great food but at the same time be able to relax and enjoy the company your with while you wait for it to come out. 

On our first trip there for dinner my wife and I were first taken by the openness and decor of the restaurant and as we looked around you could slowly begin to hear the music playing in the background. \"We need to come back here again,\" was our first reaction before we even tried the food. 

I had the steak and frites and they were incredible. An even better reason for coming back again. 

We tried brunch on Sunday morning recently and instead of waiting the 10 - 15 minutes we decided to sit at the marble topped bar and enjoy the morning. Again a phenomenal time and we had a chance of discovering a different part of the restaurant and the time someone had taken to try to make it feel warm, inviting, and almost cozy. They succeeded."}
{"text":"Great atmosphere, they have a wide variety of dishes.  Have been here several times, very consistent.  From the drinks to the dinner everything is great."}
{"text":"This is a gem in Charlotte that has both high quality brunch and dinner. I know of no other place that has beef Wellington (Saturdays) or a fruit de mer omelette on their regular menu.

Not only the rare items are what make CM special, but it's atmosphere screams class without being haughty or needlessly arrogant. Such a balance is tough to do.

As for economics, you get a greater-than-fair portion and quality for what you pay, so you won't feel shortchanged. I have visited 7 times in the last 16 months with my visits becoming more and more frequent. 

I would only suggest that the beef wellington be served on more than just Saturday, but I understand given the labor intensity of the dish, that may be a tall order. It's possible they may accommodate a request for one on an off day given enough notice, but you'll need to ask.

Bottom line, go give them your money. You won't be disappointed"}
{"text":"Went here for the 1st time on a Tuesday night, because my boyfriend's French acquaintance always goes here. Ambience was relaxed, cozy, & romantic with dim lighting & candles. The bread was delicious! I couldn't stop grabbing some before our food came. I had the duck salad & it was very tasty with a subtle but perfect sweetness, thanks to the dried cranberries sprinkled throughout. The baby potatoes were a great touch. I tasted my friend's risotto & it was great! Nice consistency (tip: ask for a spoon to eat it with). I also tasted my boyfriend's herb salmon & it was nicely done. No complaints on any of our dishes. Will definitely come again!"}
{"text":"Admittedly what Cafe Monte is attempting is difficult.  It's hard to recreate the atmosphere of a French bistroo in an upscalish surburban outdoor mall with convenient parking.  To make it really authentic you'd have to make it just a bit shabbier, with the faint smell of 100 years tobacco use, the tables crowded closer together, the bathroom fixtures 70 years old.... and of course charge 3.00 for a water.

But there you have it..... they can only do so much.  Ambiance was as French as the aforementioned would allow.  Service was fine.  Beers were great.  I had a burger (quelle horreur) but only because I had only two weeks in the States and was on a massive burger run.  It was OKish.   I should have ordered a French menu item.  I have to say the pizzas looked interesting.... if not very Franch.

I'll give them 3.5 stars and stop by again when I'm back in town and maybe order the herbed chicken crepes which sounded good."}
{"text":"I came here for brunch and left feeling a little underwhelmed with the food.  The other people at my table seemed satisfied with their meals but mine came out unappealing.

I ordered the smoked ham crepes.  I guess maybe I was expecting real ham and not diced deli quality ham.  

The second thing is with the sauce, it was splattered all over the plate with no real quality to the presentation.  A real chef would have cleaned up the splatterings so it looked presentable.  

And the last thing is that the dish really had no flavor to it.  It was all sort of bland.  

Frankly, I've had better breakfasts at a chain restaurant.

Additionally water glasses often went unfilled.  Here's a suggestion, if you notice that people are drinking a lot of water, leave a pitcher on the table so they can refill themselves instead of having to wait for a server.  

Sorry Cafe Monte, I really thought you were better than this."}
{"text":"Enjoyed every meal I've had here. Crepes are so authentic and the Berry Compote is amazing. I grew up in Europe and, surprisingly enough, this place feels very close to home for me. The macarons are delicious and perfectly priced; the service is amazing and genuinely a great experience each time. Wish there was more than one location!"}
{"text":"Just enjoyed an amazing meal.  Excellent service!  Our waiter, Jay, suggested the Duck Confit Salad and Escargot appetizers which both were excellent.  The specials, Beef Wellington and pan fried Grouper equally delicious!  Wonderful atmosphere.  We will be back for more!"}
{"text":"BE CAREFUL, you might want to pay with cash.  My wife went there two weeks ago for lunch, left a 20% tip and they added another $1.00 for good measure.  That is my review.  Enjoy!"}
{"text":"Stopped by for lunch while combing every inch of Charlotte for car dealerships who will meet my price.  It was a Saturday, noonish and the place was pretty full with the seats on the patio all taken on a sunny day.  I took a seat at the bar, was greeted promptly and offered a menu and a drink.

I wound up ordering French Onion soup and a Croque Monsieur (one can never have enough melted cheese in a meal).  One nice touch is that I was asked if I wanted the soup to be my side with the sandwich, an offer that I accepted.  The soup itself was hot, as in really, really hot, to the point I melted some skin off the roof of my mouth in my haste to shove the first spoonful in.  The broth was in need of salt in a pretty big way and also benefited from some pepper.

The sandwich was very nice with tons of melty, turned crispy on the edges, cheese.  While it also benefited from the salt and pepper shakers, I would certainly order it again.  I truly enjoy French bistro style food so will likely try Cafe Monte again when back in SouthPark."}
{"text":"I wanted to love this restaurant from the moment I walked in.  A Sunday brunch with friends let me experience the ambiance, delicious food, great pastries (thanks Amelie's), and rocking bloody mary's.  From this description alone you'd expect a 5 star rating, but with this restaurant it's the service which destroys it.  It often times feels like you're playing Russian Roulette with a 4 bullets loaded.  I just don't understand it.

The first time we went it was magical.  The second time we went (also with another couple) the service began to show its wear and tear.  All the other times were a toss up between amazing and atrocious with no indicators to give you advance warning.

The last straw for me came after a very difficult day in which my wife and I were hoping Cafe Monet could turn it around.  From the first impression we could tell the waitress would rather be having a root canal than take our order.  This wasn't the first time we'd encountered that look in Cafe Monte, but with an almost empty restaurant (we went in early) you think she'd want to milk every ounce of tip she could

Attitude dripped from her monologue and our lack of alcoholic drink orders brought a sigh to her lips.  All I wanted, nay... craved, was a chocolate croissant and an almond croissant warmed up.  This was the text book definition of a SIMPLE order.  I'll give you a second to figure out what happened next.

She screwed it up.  She gave me a chocolate croissant and then an almond chocolate croissant.  She didn't care less about the screw up.  After tasting the incorrect almond croissant I asked for the correct one to be brought out.  She snagged the plate and then disappeared.  Actually, most of the time she was disappeared which is an amazing feat for an empty restaurant.

When the correct croissant finally came out it was cold.  C'mon.... seriously?  I asked for it heated up and received barely lukewarm.  Suffice it say, my tip reflected her total lack of caring.  I'm done with this place.  If I want French I'll go to Georges Brasserie and if I want pastries then I'll go to Amelie's."}
