{"text":"Ordered the Crispy Chicken Club Salad, and it was on point. Im usually picky about my salads...fresh greens, good chicken and most of all real bacon. It was a good sized portion including a side of bread. Very pleased! Will be back."}
{"text":"Two friends and I recently went to Cafe 56 because it was conveniently located across the street from our residence. At first, we were pleasantly surprised by the delicious taste of the food and conversed about how we would be frequenting he establishment. As we were walking out we were discussing grabbing a beer at a local pub when all of a sudden it hit me, I had to drop one. I was the driver so I rushed everyone into the car and sped back to the house. Once we got there it had set in with all of us. We all took turns, one at a time, destroying the facility with no remorse.  Once the debacle ended, and the premises had been cleaned the decision had been made. We would not be returning to the Cafe 56 again.  P.s. after this occurrence, we began referring to taking a dump as, \"taking a 56.\""}
{"text":"Love the food, it is fresh! Great place to meet friends and enjoy. Service was timely and accurate. Music was good too."}
{"text":"Great place to pick up one of over 56 different types of salad for lunch or dinner. Fresh ingredients and the huge amount of choices make it easy to eat healthy whether you want to dine in or take it to go on the run."}
{"text":"Love everything about this place. Their sandwiches are delicious and made fresh. I love the soups too. Food comes out face and accurate"}
{"text":"Driving by saw the sign Cafe 56 and sounded interesting and decided to check it out.    I guess they have 56 different salads sounded amazing but its not.  Add an item you just created #17!  Take out an item you've created #19, add different dressing to #3 there you have it!  It's so confusing its like walking into Forever 21 and have cloth all over the place and just looking at the menu selections stresses me out.  The food was  descent nothing to talk about.  We are talking about Salads!  How bad can it be and how great can it be."}
{"text":"I had the Gump Salad. It was delicious! I'll be back. It was my first visit."}
{"text":"pewter mug salad - the best!  if you've never had one, try it and the pretzel bagel - classic!  or any of the 50+ salads they have  veggie chili also amazing as are all soups  some awesome sandwiches too"}
{"text":"So my daughter picked up 4 salads for me. So close to 40 bucks we spent. Got home and they forgot my salad dressing on my oriental salad. My daughter got the gump salad and she bit into a raw shrimp. She was sick to her stomach and had to throw the salad out. I called the store. The girl said I could drive back and they would remake the salad. Well I live 25 minutes away and just don't have that time. So I called back again and spoke to the supervisor and he couldn't do any better than that but said I could call tomorrow to speak to the manager. I felt I should be compensated. Send me certificate in the mail and I will come back when I am Around there. Anyways, it is very disappointing and I would not recommend because if you have an issue management does nothing to make it better!  Save your cash and go elsewhere!!"}
{"text":"I've eaten here several times, and the food is always good. The service is adequate but its a great place to get a delicious salad."}
{"text":"I live around 15 minutes away from Cafe 56, and I only recently tried it today for dinner. I came around 5 with my sister and mother, and our order came to an oriental salad, a Singapore salad, and a Philly cheesesteak wrap. I can only speak for the oriental salad, but it's delicious! It's very simple, but it works. Grilled chicken, mandarin orange, crispy noodles, and sesame seeds over mixed greens. Everything was great, although the mixed greens were more of an iceberg lettuce mix. My salad had exactly one piece of spinach in it. I'm not complaining, but I'm sure other people would like some darker greens. We came around 5 or 6, so there was no wait at all. Cafe 56 is more of a lunch place, so it took all of 10 minutes to get our order of 2 salads and a wrap. The salads each come with a pretzel bagel, and the wrap came with kettle chips. Overall, the experience was good and I am definitely going to try another of their 56 salads."}
{"text":"this place has so many options to choose from. I am in love with the Napa Valley salad with FF toasted sesame dressing not the raspberry they recommend. Each salad come with a yummy pretzel roll (more like a bagel) salted or unsalted options. Lately however I love their chili's and the have baked potato days MWF....the potato options are fun, big and yummy too. It is so hard to decide what to eat now."}
{"text":"While the salads here are great, I do not recommend coming here during lunch. The marketing team in my office ordered lunch from here and were disappointed by the order mixup. I went to pick up the food that we ordered via phone and was directed to the back of the line behind the customers that have not yet ordered.   If you can get here at a less crowded time, the steak salad is an excellent choice!"}
{"text":"Love going to this place when I'm on the east side of cleveland. Always fresh and great vegetarian options. Love the salads that come with pretzel rolls."}
{"text":"Ingredients were fresh.  The food tasted great.  The only problem is that we were initially served the wrong meal.  It was cheerfully corrected.  I had Gump shrimp.  My mother had caribbean chicken, made with 'regular' chicken rather than the normal seasoning.  Cafe 56 pretzel bagels are the best!"}
{"text":"I don't understand the negative reviews. I got a caprese sandwich with bacon and thought it was delicious. Service was friendly and fast and the food was fresh."}
{"text":"If you want a great salad, this is your place.  Its a simple place you get in line and order.  Nothing fancy, just great food.   Soups, wraps, sandwiches are also good and fresh. Can also order take out if you want fresh food to go"}
{"text":"For us \"Insurance People\" working in Mayfield, Cafe 56 is our go-to spot for a healthy lunch. Seriously, not a week goes by without a Cafe 56 stop! I was there today and ordered the Millionaire salad. Mixed greens, artichoke hearts, strawberries, dried cranberries, crumbled blue cheese and chicken...Yum! Their taco salad is also one of my favorites (and also the daily special on Thursdays) but I had to pass it up for a lower-calorie choice today. Damn diets! I was eying up my neighbors sandwiches today and even though I am more of a salad girl, I might have to try one next time. The chicken salad sandwich looked amazing! Priced like a Panera, but the food is MUCH better. Check it out!"}
{"text":"best salads in all of northeast ohio! you've gotta try the jane fonda, and the pretzel bagels are the best. im telling you you must go!!! never too crowded either, 5 stars from me."}
{"text":"So, I went back today to cash in on my replacement salad.  I purposely ordered a different salad for a different experience.   Lettuce was supposed to be mixed greens... it was romaine, which is better than the crappy iceberg last time.  HOWEVER... the dressing was once again, not the one the menu said it would be.  Last time, it was supposed to be green goddess, and who knows what it was, it only resembled green goddess in some ways.  Today's was actually worse:  it was supposed to be their stone ground mustard dressing, and I honestly have NO idea what it was.  It SEEMED like it might have been a creamy Italian with chunks of bleu cheese.  Which, wasn't terrible, but for God's sake folks... if you go through the trouble to list specific dressings with specific salads... put it in there!  Otherwise, just give me a list to select from, and don't whet my appetite for something I am never apparently going to get.  Ugh.  I did however get my pretzel bagel today.  Yay!    So, while the ingredients are fresh looking and tasting, it would be nice to get the ones I order.  Staff continues to be friendly, but I really need my orders to be consistently correct.  If I wanted this kind of service, I'd go to McDonald's, where I know the bag will be wrong as I leave the drive through.  Sigh.  I'm done.  Just can't face this place again."}
{"text":"This is a great place to get a healthy sandwich.  Choose from a selection of wittily-named dandwiches and salads, pick up a fancy drink or a brownie and eat.  The portions are pretty large, but nothing like Slyman's, so you can finish it if you want, or take half home for later.   The downside is that tortilla chips are served with no salsa or anything to go with it.  Dry tortilla chips don't make the best accompaniment to a sandwich, but that's what they give you. The free wireless is a big plus, and can give you something to do while you wait the 5+ minutes for them to concoct your sandwich."}
{"text":"Very good place for salads and wrap.  Grilled steak is well marinated to top the sale or have in sandwich.  Lots of fresh and tasty veggies and the sale dressings are very good.  Absolutely worth a try .. wish they had one in Solon."}
{"text":"One of my favorite spots for eating out healthy. Great salads and wraps."}
{"text":"This place used to be great when I lived in the area.  I recently started a new job which put me back in close proximity to the restaurant and it's really gone downhill.  It starts with simple stuff, like pick up orders not even been started when I arrive 30 minutes after ordering.  Chips are always burnt.  Salads are lettuce fields barren of meat.  Once in a while you get lucky and get the old food quality that I was used to, but it seems like the glory days of old are gone."}
{"text":"I hate getting ripped off by restaurants which is happening more often these days. I have gone to Cafe 56 for years and my go to salad has always been the pewter mug salad. It's supposed to be made with shredded cheese, lettuce, tomatoes, wide strips of ham and turkey. When they started making them years ago they were good with all the proper ingrediants but slowly they started cutting the ingrediants by using thinner and thinner strips of ham and turkey and sometimes none at all yet never changing the price of 8.95. Today, I bought the pewter mug salad but this time it came with virtually no ham or turkey only one tomato and loaded with nothing but cheese and lettuce, very expensive for just lettuce and cheese. Stop ripping customers off by cutting back and eliminating key ingrediants that make the salad yet still charge high prices for getting an inferior product. This has happened too often and I believe this will be my last time I go there. I have complained about this in the past but no changes have been made for the good."}
{"text":"I wish I could give them a better rating because I love their other restaurant 56 Kitchen. Their vegetarian chili soup was served lukewarm and I didn't care for the flavor.  Their veggie salad was tired and consisted mostly of head lettuce. It would be hard for me to come back unless they do something different."}
{"text":"Think back to the last time you ate a salad and examine how it made you feel. Great! Now, throw all of that away and try a salad from Cafe 56.  What does it take to make a good salad? How about a great salad? Salads are odd. I can go to the store and buy the exact same ingredients that restaurants use to make their salads but mine never seem to turn out tasting the same. Its the difference between craving something, like CHOCOLATE, and just eating it because its healthy or you are on a diet. I really truly enjoy all of the wonderful flavor that Cafe 56 is able to pack into that bowl.  Cafe 56 is great. For me its in an extremely convenient location; right near where I work. Yeah, sure, sometimes the wait is a bit long for a quick grab-n-go but they do make each and every salad right there in front of you. If you're picky about waiting, try ordering online. This location lets you pre-order and just pay and go!  So far I have tried many different menu items. According to my yelp check-ins I have been here something like 25 times.  Salads: -Millionaire (with chicken please!) -Napa Valley -Arizona Sun -Chicken Caesar -Beef Taco Salad -Fajita Chicken Taco Salad  Other: -comfort bbq chicken sandwich on ciabatta  Each one of these menu items has a unique, distinct, flavorful taste. You'll be sure to enjoy every bite with some left for later! These salads are quite large!  Want to dine in? It can get busy in here during lunch hours. However, I have never been left without a spot should I want to sit and eat. Later in the day? No problem! They're open until a good hour and theyre usually quiet in the early evening.  So what are you waiting for? Go try a Cafe 56 salad! They're each around $10 so you don't have much to lose.   Fun tip: Try the tropical green tea. Its bananas (that's youngster for amazing)."}
{"text":"Tried the fajita/salad/baked potato. Everything tasted good. Watch out as the food portions are really huge and most of the times are served with a bagel"}
{"text":"In general I really like the menu and the food at Cafe 56. I come here about once a month and haven't eaten anything I didn't like. For me, the inconsistencies seem to be the issue. As others have mentioned, sometimes I they are out of the pretzel roll for dinner. I usually eat a late dinner so I see how this could happen but it also happens frequently enough that I would think they could just start baking a few more. I've also had the wrong dressing given with my salad as others have mentioned and since I always get take-out I don't notice until I've arrived home. Today I ordered 1 to-go salad at lunch and had to wait 25 minutes to get it. And I even beat the lunch crowd there but it appeared that the staff (only 3 people at lunch, including 1 who was taking orders who must have been very new) was making carry-out orders from phone-ins. By the time I returned to my work desk I didn't have time to eat my food due to the long wait to receive it and my afternoon meetings."}
{"text":"Unbelievable salad selection- fresh and made to order! 2nd time here in 3 days! Great lunch stop!"}
{"text":"Helpful hint for those who are in a rush - you can order your grub online, walk in, pay, and get back to whatever else it is you should be doing in no time flat. Definitely order ahead at lunchtime if you don't have the time or patience to wait!"}
{"text":"I used to love this place, but the last few times they can't manage to get an order right to save their life. I always order to go so unfortunately don't discover this until I'm home, 30 minutes away. The ingredients are fresh, but if you aren't dining in where you can inspect every salad, it will probably be wrong.   It's annoying for a $10 salad to be wrong."}
{"text":"I really hope the Owner Jay reads this. This is a salad place, they make salads. Shouldn't be that hard. Our office has been coming here for 4 years, and finally decided to say something. First, the staff..they have 1 good employee, the rest are lazy and just don't care. No pride in doing their job. The house dressing is different each and every time I order it. Somet times it is thin, sometimes gelatinous, and some times just oily with no flavor.  Brown lettuce? Why can't the lettuce be fresh and crisp. I don't want brown lettuce and those hard white parts either. The place is dirty, clean it up. PLEASE, be a salad place and provide the one thing you specialize in...SALADS!"}
{"text":"Love This place I usually get the original pewter mug salad which is ham and turkey it's really good with blue cheese crumbles on the side the salad is very fresh nice and crisp the ingredients if you want hot are cooked right in front of you they have other menu items as well but I just stick with the salad it also comes with bread been going here since I was a kid very good place would recommend for everyone to try very healthy place to eat."}
{"text":"Food is good just expensive and they charge you for every add on which seems silly because it's in most items. Simple things like enough dressing for your salad would be nice when paying $10 for a salad. Staff although busy doesn't have to seem so rude they rang up my order in correctly and when I ask them to correct it on the bill they charged me for an extra salad I was at first argued with and told 3 times its correct until she actually looked at it and then corrected it. No sorry about that our apology just moved on and said it'll be up in a minute. I will move on and use another restaurant next time."}
{"text":"I was pretty stoked to find this place on Yelp when in the area for business.  I had a little bit of trouble though, actually finding this place.  In midst of a strip mall/shopping center, it was easily lost right next to First Watch.  I love the concept-56 salads (and other stuff too) and it took me awhile to decide.  It seemed like a lot of the salads had olives, which I wasn't really feeling.  I settled on a philly cheese steak salad.  I was disappointed to find the 'mixed greens' seemed to be iceberg lettuce topped with some darker greens/spring mix.  I was hoping for a bowl without iceberg.  The facility was nice, the service was mostly friendly (though the open concept gave me a front row seat to some attitude exchange between workers) and wifi from next door helped me get some work done.  Overall, the options were solid and I'd go back simply because when on the road, finding a lunch that's not a sandwich or a heavy plate is always a win in my book."}
{"text":"Great place to grab a quick salad. Came here and got the longhorn salad, which I would recommend. Not sure how healthy the majority of the items are on the menu. Sure there may be some but don't fool yourself, if your salad has BBQ sauce, ranch and a fried tortilla you are downing some serious calories."}
{"text":"It's been three years since I've visited Cafe 56, but an evening class I'm taking required that I stop for dinner near my work.  On this occasion, I let a co-worker select 'what's for dinner'.  She chose salad from Cafe 56.  So I called ahead off I went.  The salads were ready when I arrived.    I ordered the asian dinner salad, which was $8.96.  The salad had a fresh grilled chicken breast in it!  Yum!    Pros: big salad, bread and dressing included  Cons: expensive, not enough dressing, mostly iceberg lettuce, unable to shake bowl to mix dressing due to being filled to the brim  I'd visit again."}
{"text":"I would normally give this place 5 stars but today is not it. If someone ask that the seafood and meat not touch, its a reason behind it.  Tried the stuffed potato for the 1st time and it was not good. I finished it because i dont send food back. It was cold and felt as if it was thrown in the microwave before being served.  The salads are getting smaller with each vist and the greens are becoming more white.  3 stars is because other visits have been a alot better....."}
{"text":"I have come here several times over the last week and the salads are delicious. Buffalo chicken Salad Yum! There are so many different choices and they cook the food to order(10 minutes tops). I would have given it 5 stars; however after 20 minutes I still didn't have my food today. When I asked about the status(because my coworker got his before mine and he ordered after me)  they said they couldn't find a ticket for my salad. Yesterdays service was quick and had no issues with the ticket printing. It was pretty busy today; I am just assuming they gave my salad to someone who came in to pick up a to go order."}
{"text":"I love this place. I have been going here every so often for over 5 years now. It clean and crisp inside with a friendly staff and great, healthy, fresh food cooked in front of you and AMAZING salads. This place is a lunch MUST."}
{"text":"Great salads!!  The service is amazing too! There's a husband and wife who work there that are always such a pleasure!  Thank you!"}
{"text":"I came.  I ate salad.  I left happy.  What more do want?  Late lunch on a Sunday shopping adventure led us to crave a salad or something other than a big sub or burger.  So this place pops up on Yelp and hey, look, the pictures show salads and salads and more salads.  What could go wrong?  The answer? Not really anything.  Consider this a fast casual joint where you sit down after ordering your food at the prep station.  So you don't have servers, you pick what you want off a big board, and everyone is happy.  Can only speak about the Greek salad, but it's exactly what you'd expect from a Greek salad.  I agree that it is on the pricey side, but it's basically what you would pay for a dinner salad at a sit down joint.  They do get you for $0.50 for extra dressing because apparently they'd go under if not for that, and you do get some spring mix with a lot of iceberg, but it's a salad.  It's all about the toppings and dressing, and they didn't skimp on the chicken, olives, or feta.  All the salads look to have been equally crafted.  The staff was friendly, and the joint was just a little messy, probably from it being late in the day after lunch rush, and it's starting to look like it has some wear and tear, but I would recommend it to anyone looking for a change of pace lunch experience."}
{"text":"Hadn't been here in a long time, but I was craving a nice fresh wrap. Well, the spinach was sub-par, strawberries looked bad, and the spinach wrap was stale. Pretty irritating considering how long I waited. Next time I'll just go to Roly-Poly where I've never had a bad experience."}
{"text":"I love this place. I get the Napa Valley every time I'm there. It's absolutely amazing. The staff is friendly, the recognize that I'm a regular (which is huge to me) and the food is definitely good quality. I don't feel like I'm eating garbage. I would recommend this place to anyone looking for a healthy and unique salad."}
{"text":"Jay and izzy are the man.  Love the art on the wall and the food is great. Wonderful place in Solon hosted by two of the best in the biz. The pizza is amazing. The salads are the bomb and the staff is friendly. Can't wait to go back."}
{"text":"You have to wait waaaay to long for what type of restaurant this is and what kind of food they make. They make made to order salads that aren't very complicated at all yet my coworker and I had to stand and wait for about 30 minutes today on our lunch break for a salad that consists of lettuce, chicken and cheese. Not to mention out of the three people working minus the girl ringing people out only one person was moving at a pace that seemed acceptable for a lunch rush. The other girl stood at the grill and watched the chicken cook while she ate pieces of food out of the bags without gloves on. Another thing that was pretty gross was her not wearing gloves to put the food onto the grill and handing the guy prepping the salads cooked chicken (that went directly onto people's salads) with the same hand she just grabbed the raw chicken with. Kinda nasty I probably won't go back which is unfortunate bc the salads are actually good but I'm not trying to get sick or waste my entire lunch break waiting for a salad."}
{"text":"Went to Cafe 56 today for lunch as I had been before and it the food decent. Unfortunately the same did not hold true this time.  First there was the wait to order (25 minutes), I understand that places are busy at lunch but this was just ridiculous. And then when I was at the front the guy taking my order picked up the phone to take other orders. And when told to focus on the people in the restaurant by (I assume) a manager he just ignored. Then as he was taking my order he disputed what I was saying, even thought I was reading of the board - exact quote \"you mean the smoked turkey??\" (my response was I dont know it says turkey, what a silly thing to argue with a customer about).   After placing my order it was another 20-25 minute wait to get the food, which turned out to be mediocre. I have had better greek salads for less money at corner delis.   I definitely will not be going back when there are better restaurants on either side that have friendly quick service and better food.   Ways to improve: Make sure there is proper, friendly, staffing at busy times (IE - 12-1). Ensure that the food quality is consistent and can beat out the \"corner deli\""}
