{"text":"Tonight I stopped by with out of town guests for some fab desserts and everyone was glad we did. From pecan chocolate cake to lemon tiger and m and m cheesecake well each person was tickled with their choice! As has been said there is a myriad of options for drinks and I decided to go with double espresso to offset my sweet treat. If you go for a main, the chicken nachos are a hit! Great terrasse however if you're inside it may get a bit loud when busy. Fun place to visit with a group."}
{"text":"Love this place anytime. Always friendly. Great place to go with friends to sit down and chat. It cool place to for a date or group of friends to gather, the menu is good."}
{"text":"Difficile pour moi de donner plus que la moyenne pour la première visite,n'ayant que commandé un Cafe. Le Cafe etait excellent surtout que je suis arrivé lors d'un moment calme et le serveur m'a demandé d'attendre pour me faire un s'il et frais :-)  excellente initiative.  Le wifi est gratuit. Les fauteuils sont confortable. Il est possible de s'assoir sur des fauteuils de différentes hauteurs dépendant de notre Comfort. Le serveur etait excellent et à son affaire.  Je vais revenir pour essayer la nourriture. Je crois avoir trouvé mon Cafe régulier et j'en suis heureux. Surtout qu'il est à quelques minutes de chez moi.  Le bémol qui me fait hésiter à donner plus d'étoile est le stationnement.  De chaque côté il y a des commerces avec des stationnements privés.  Et sur la rue bien c'est un boulevard ou le stationnement est interdit . Astuce: une fois à l'intérieur demandez au serveur où stationner.  Il vous indiquera si il est possible dans celui d'un des deux comme ce fut le cas pour moi."}
{"text":"Came here during my lunch break and I was really impressed by the great service. The waitress greeted me with a smile and seemed to enjoy her job very much, which I appreciated.   I was blown away by their latte selection! If I recall correctly, their beverage menu was 3 or 4 pages! I hesitated between the papaya/tiramisu latte and butter pecan/rum latte, but I finally ordered the former. It was scrumptious!  Their lunch menu is also very reasonable.   I would recommend to all my friends."}
{"text":"The food is amazing my l time favorite is the chicken nachos! Also they have a huge list of drinks and you can make up your own. The staff is also super nice the waiter always remembers us and our order always ready to answer my questions! One of my favorite spots in montreal!"}
{"text":"Great food, great music, great drinks, and great service  The food:  For a lil cafe it has better food then most big name places and well worth the price. You can get a verity of sandwiches and  wraps (very long wraps around 10-12 inch) both are panini pressed and both come with a side dish (if your new try the pasta salad, its light and has a nice burst of taste) they also have pasta and nachos,  nachos are best shared unless your very hungry and i would suggest trying the chicken caesar nachos.  the drinks: Big selection here, you have hot chocolates, hot and cold late, Italian sodas, and the smoothies. that's all i can remember at the moment that may not seam like a lot  but each has flavor combos for ex:  a pineapple and chocolate hot chocolate, a pina colada and melon smoothie. I once counted over 80 drinks on the menu and with each type of drink you can make your own flavor mix or ask them to make a new one for you.   The cafe: The cafe its self is just a great pace to sit down in and  chill be it alone, with a loved one or with friends. the music is different each time, some times its easy listening others with techno but it never takes away from the relaxing nature of the cafe. even the waiter has a nice soft voice and gentile smile to add to the feel of the place.  to sum it up, this is a great place to go into to hide from the cold and get a nice bowl of  mango hot chocolate (the bowl is the biggest size and its a bowl with a handle) or to just go in to sit down for a nice meal and relax.  Once you've gone to try it i bet you'll be back and you wont be alone the next time."}
{"text":"Un bon café de banlieue, c'est n'est pas un coffee Shop. Il y a un service d'alcool pour ceux qui n'aime pas trop le cafe. Beau lieu de rencontre à lasalle. 6/10"}
{"text":"Crazy Sandwiches         or... Allow me to elaborate  They have a triple decker, smoked ham, apple and Swiss cheese sandwich...and I think there may be another meat in there.   Douse the thing in maple syrup and serve it on not one, not two but THREE WAFFLES. At this point, you have something that can only be described as tripledeckerhamapplemysterymeatmapplesyruponwaffletastic....and it is.          Wash it down with one of there huge frozen drinks...Froz-i-nitas, I believe they are called.  wakawaka"}
