{"text":"I've been here a few times and the food has always been pretty good. Good ingredients too. Worth a try.   Their \"order is ready\" process needs some work. If you sit down to wait, you may miss them yelling your order is ready (happened twice). What's the point of the numbered buzzer if it doesn't buzz??!!  They could do a better job explaining how to order and the cashier is moody. If you get stressed at people, you shouldn't greet them. Hire someone who's always smiling and happy (I.e, chick-fil-a).   Update 6/22/17 - Food is still great and the staff is improved! Very friendly. The buzzer works too!"}
{"text":"Ugh. I regret having to give so few stars, but the quality of Cafe 55 has tanked in the last year or so. I went in today for the first time in awhile and was quite disappointed with my meal.   I ordered a north coast rice bowl with pork, and it's a 180 from what is used to be. A large portion of the meat was basically just fat. Where there used to be mandarin oranges, there was now some kind is small oranges cut in half with the rind still on, in a little plastic cup. What am I even supposed to do with that?   Way too expensive for the product. I can't say that I'll be returning, despite the fact that I used to be a regular here."}
{"text":"I drive past this place on my way to work every day and had no idea it was there until I found it on Skip the Dishes.   Really really clean inside which made me happy, with a nice seating area (got take out though). Employees were really nice. I got a Happy Dragon with Brown Rice w/o meat. Took a couple of minutes to get my food. Bowl looked tiny for the price ($11) but I only finished about 1/3 of it and I'm full.   I was expecting to basically get a stir fry (Happy Dragon - Broccoli, Snap Pea, Peanuts, Peanut Sauce, Scallions) but it was a raw veg on top of rice. I was really expecting it to be stir fried or steamed at least. But this is healthier I guess. Pretty tasty, I loved the sauce but wish there was more of it!!!   4 out of 5 because of price point. $12.65 (got a can of pop as well) plus $2 tip is too much for my everyday lunch. I was hoping to find a weekday staple."}
{"text":"Cafe 55 has been open for about a month.  They serve breakfast and lunch on weekdays.  It seems that the focus is to serve people working in the area during the day.  I wouldn't call E.55th and St. Clair a hot spot yet but they are in the process of adding a brewery and market in the same building.  The space is airy and simple.  I was entertained people-watching out the large windows to E.55th.  They serve breakfast and lunch bowls as well as a few options to grab out of a display case.  This was our second visit.  We first went a couple days after open and left unimpressed.  The food seemed like it lacked sauce and the place seemed understocked.  We had to give it another chance and I'm glad we did.  You order up at a counter and they call your name when it's ready.  I had the Rise and Shine bowl.  $8 was about right.  They advertise it as healthy and I'll admit it tasted clean but the portion size was enough for two meals.  I can't complain. The roasted potatoes and scrambled eggs were fresh and tasty. The bacon, though, seemed more like smoked pork belly chunks- it made the dish.  I added hot sauce because it just made sense.  Service was friendly at both visits.  We'll be back for another quick breakfast or lunch."}
{"text":"I enjoyed my first few visits at Cafe 55. It's a part of a larger redevelopment called Hub 55, spearheaded by the St Clair Superior Development Corp. Soon, a brewery will also open next to Cafe 55. It's wonderful that places like Hub 55 will bring more attention and investment to the area.  The environment is bright, open, and modern/industrial with plenty of seating. I came here mostly for lunch, though it meant that I had to take a special trip. Thankfully, my supervisor was down for the visit!   Cafe 55 serves healthy, local (?) food. I had a \"build your own\" bowl with the North Coast style. Can't say no to beets! The marinated tofu went a little strangely with the flavors, so I wouldn't recommend mixing the two.   The main issue with Cafe 55 is that the prices are pretty high. Even though you get fresh and healthy food, $11 is pretty hefty for a lunch meal. In addition, it's not very affordable for surrounding residents, some of whom are the poorest in Cleveland.   Overall, it's an enjoyable atmosphere with great drinks and food. I'll be sure to come back to support Hub 55 whenever my coworkers and I take a special trip for lunch."}
{"text":"Very nice healthy (but pricey) meal selections.  Unfortunately, portion size has changed even though the bowls have not.  You can feel the difference when you pick up the lunch bowl.  No longer a hunger satisfying lunch nor worth the -$11 price tag."}
{"text":"What a nice addition to the lunch options in the area. Fresh, healthy, tasty, and reasonably affordable food (sort of) in a really nice open space.   Can't go into a ton of detail on the food because I've only had the one thing yet - but I'll definitely be back. I got the Happy Dragon bowl with pulled pork and greens - and it's pretty delicious. Think Asian inspired salad with smoky pork. Yes, please.   Staff was super friendly and easy -- just grabbed a bowl to go and it was quick and easy.   I'm looking forward to seeing what they do with the brewery they're opening next door... And trying a few more of the options.   I say sort of affordable, because I have to say that I think $11 for a bowl of greens with a smattering of meat and a few other veggies popped on... probably shouldn't be $11. It was kind of small and not a lot of meat for that price. BUT - it was really tasty, and was enough that I didn't get hungry until about 4 hours later... So, it's not too bad of a deal.   So welcome to the neighborhood, we're glad to have you. :)"}
{"text":"Very confusing experience. We went as a group, most of whom had been here before and enjoyed it enough to return. The menu options at lunchtime (breakfast options are not served all day) included four bowls and two pot pies, along with various premade sandwiches in coolers and two soup options. One of the bowls was sold out at 1pm. Most of the group ordered bowls while two ordered pot pies. When the third of five bowls came out, it contained very little rice, which was listed as a main ingredient, and contained lots of spring mix greens, which were not listed on the menu. The Thai Shrimp Bowl I ordered was to contain shrimp, rice, basil, coconut, lime, chiles, and peanuts. The person who took my order came over to tell the last two of us who were waiting on bowls that the kitchen had run out of rice, and gave us the option to get the bowl as a salad instead. I took the offer and received a salad that consisted of spring mix greens, warm shrimp, warm roasted broccoli, and a large amount of overpowering wasabi dressing. The only ingredient in my salad that was listed on the menu was shrimp. At this point, everyone in the group was ready to go, so I did not press the issue further and simply left after eating a few bites. If you decide to try this restaurant, verify upon ordering that your meal will be made according to the way it is listed on the menu. The person taking our order was not able to answer almost any of our menu questions, so be warned about that as well."}
{"text":"They're known for their lunches but go for breakfast! Their breakfast bowls are delicious and their coffee is even better! The employees are great and so fun and if you go on the regular, they will for sure remember your favorites.   It's a newer restaurant in an upcoming era which will soon be taking off. It is connected to the brand new Goldenhorn Brewery and right across from Sterle's. I really do believe this area will be blowing up soon as one of the restaurant areas you have to go to.   I cannot say enough of this cafe, the employees, the food, and the atmosphere! Get there as soon as possible to have your taste buds blown!"}
{"text":"I give 3.5 stars to Cafe 55. I wanted to really love it... and I didn't. :( I was really excited to hear about this place opening on E 55th. That part of town does not have a lot of fresh, healthy lunch destinations, and it has not seen a lot of new construction investment- so the Hub 55 project that houses Cafe 55 is really exciting.  The aesthetics are pretty nice- you walk in and it feels bright and open, but with an industrial feel. They have a nice seating area that seems like just the right amount for the crowd they attract (it's not a ton of seating, but when I was there, at 12:30 on a week day, only 2 groups were dining in). They had cucumber mint water on the counter, which was a nice touch. The food. I had one of the bowls- mexico city with brown rice. It was $11 which seems pretty steep for something that seemed really comparable to a burrito bowl at chipotle that would cost $6.50. It was tasty, and definitely seemed fresh. But there was not a ton of meat, the cheese was in weirdly big chunks (instead of being grated or crumbled), and my rice was pretty under-cooked (some crunchy pieces). And nothing seemed to have all that much seasoning. The cilantro was really the main flavor in the bowl.  Like I said- they're new, and I'd like to give it another try. But my first visit wasn't too impressive. The breakfast sounds tasty-- maybe that will be my next trip!"}
{"text":"I have been looking for quick, inexpensive places to grab lunch near downtown Cleveland. I read about Cafe 55 in a Cleveland Scene article and knew I needed to check it out.  There is plenty of free parking in the lot outside the building, and the inside of the restaurant is very open and well lit. I stayed and read inside of taking my food back to the office!  There are lots of options, and you can even make your own bowl if one of their pre-made ones isn't to your liking. I got the Mexico City bowl, and it was so fresh and enough for two meals. I ate the second half for lunch the next day and it still tasted great.  Looking forward to heading back for lunch another day!"}
{"text":"As I walked in I noticed how sterile the atmosphere seemed but the small crowd seemed eclectic. The person at the counter was very friendly and helpful but didn't know how Groupon coupon worked but instead of pretending or trying to figure it out she immediately had a supervisor show her and knowing what you don't know means you're truly a very smart person and I expect she is now in a position well below her potential and 10 years from now will be the CEO of some company.  I ordered a lunch meal called the \"Clevelander\" which was rice, beef, sausage and salad greens, We had to pick up the order cafeteria style and the only napkins presented were cocktail napkins, I was given a fork and a butter knife that was filthy dirty, I looked at the other butter knifes in the holder but they all seemed to be in the same condition so I decided not to use the knife. the food presentation was good and the salad mixture was good and fresh but oddly very warm, plus there was no dressing anywhere in sight, the brown rice was OK but not tasty, the beef was cubed and overcooked but not tough, the cut of beef was poor and I made a joke to my lunch partner that there are better cuts of beef in a can of Dinty Moore Beef Stew, the sausage was store bought processed thinly sliced and over cooked and all this for $11 dollars.  Will I go back? Not anytime soon but after some time has passed I'll go back and see if any changes have been made."}
{"text":"Awesome customer service and the bowl was super fresh and delicious! I will absolutely return when I'm back in town!"}
