{"text":"DON'T STOP! KEEP DRIVING BY THIS PLACE!  I live in the neighborhood and have driven by for a while now. I have seen this listed on Restaurant.com and read the reviews so my friend and I decided to try it on a Saturday night. We arrived an hour before closing. One other table was occupied and left shortly after. We ordered drinks and wanted to look over the menu. Waiter was back before the drinks or water arrived wanting us to order. After the drinks arrived then we ordered. I was craving eggplant parm after reading the reviews here and my friend ordered shrimp in a tomato cream sauce. We were directed to the salad bar after ordering. Not bad, small selection of toppings, but just iceberg lettuce in the bowl. A mix of romaine would have made it more appealing. The chef (I assume) brought our dinners to the table and warned of \"very hot plates\". I had to touch the edge of the dish to move it and it was luke warm at best. I cut into the eggplant parm and it was not hot and was tough like it wasn't precooked before baking it. The tomato sauce was good but the entire dish was not edible. The shrimp in the other dish, which was barely warm also, were tiny salad type shrimp with the tails still on. The tomato cream sauce tasted like they opened a can of Campbell's Condensed Tomato Soup, mixed a little cream in and poured it on. Meanwhile the waiter started turning the chairs upside down on top of all the tables immediately after our food arrived. (still was 30 minutes before closing time) Then the waiter sat down one table away and started eating his dinner out of a to-go box. I had to interrupt his feeding frenzy to ask for our garlic bread. He said he didn't think they had any garlic bread but I could take some croutons from the salad bar. I do not make fun of large size people but this guy was wearing a tuxedo shirt that was hanging out the back of his pants which hung down way to low. Again I had to interrupt the feeding frenzy to ask for our check. No offer of dessert was made, not that I would have ordered anything else after all this. There was no mention of the leftover food nor any questions asked why we hadn't finished or entrees. When food and service is this bad in a restaurant I do not bother complaining to anyone who doesn't seem to care. Chalk it up to experience - KEEP DRIVING BY!"}
{"text":"Alllriiiight....So, in an effort to both stave off my hunger and give this place ONE more chance, as I'd heard they had gotten better, I went and ordered a pizza from the place.  I ordered my favorite combo: Sausage, green pepper, and onion, size small. $15 dollars later, I took it home, and  opened the box. It looked like a larger version of a Totino's party pizza. Tasted like a worse version of the same. Sauce: tasted like unseasoned crushed tomatoes straight out of the can. Cheese: While the pizza was still hot, there was no oooey gooey threads that are such a delight when pulling a slice off the pie. It seemed to simply cover the sauce and help the miniscule toppings adhere. Toppings: diced so small they pretty much blended into the cheese with no real crunch or pop of the veggies, the sausage was ok, but the tiny crumbles didn't really satisfy. Crust: Tasted like unraised dough. A little chewy, and didn't seem very fresh.  It didn't make me sick, which was a bonus, but it didn't really make the mouth happy. Just boring, underseasoned, uninspired, and overpriced.  I'm not even going to expound on my disbelief that anyone who has been to Italy would find this food even remotely close to authentic, let alone delicious.  I'm DONE."}
{"text":"it makes me sad to see so many reviews that are not great about this little gem..  It is so amazing to me and a close set of my friends..  I love there eggplant, the portion is huge and comes with a side of pasta, i can seriously eat from it for 3 days.  My besty always gets the manicotti or stuffed shells and it looks amazing, also the lasagna is sooo good.  it comes with salad bar and bread, the prices are super reasonable, especially for how much food you get.  I love the location right in the heart of 7th ave district with all the cute shops around it and stuff, also has an outside seating area that is nice..  Maybe the people that tried it had an off nite, i have eaten here at least 10 times and never had one problem. the owners are super nice and always make us feel welcome..  Gooo, now!!!!"}
{"text":"It appears this place finally closed. there's now a sign up saying there's a Filiberto's coming soon. I wish another small business would open up there instead of Filiberto's."}
{"text":"I am huge fan of this place. I love the pizza. Its thin and crispy. Pesto with prosciutto is the best. If you're a purist ask for the prosciutto to be added just after it comes out of the oven. We've tried it both ways. I've been several times. The pizzas really  are great. The pasta that I have had there are really good but didn't impress me as much as the pizza did. The frozen drinks are amazing. Each one is worth a try. I prefer the sangria. I value any restaurant where the owner greets you at some point during the meal. Its shows a sense of pride in what they do. I would normally only give a 5 star rating a restaurant that I feel needs absolutely no improvement, but I think they've had a few unfair one and two star ratings, combined with the owners interaction with the diners, and the fact that they are on restaurant.com(I'm cheap) I definitely am giving them 5 stars.  P.S. We happen to get lucky enough to try a soup that was specially made for some prominent clients requesting soup the following day. It was simply amazing. It would be a great addition to the menu."}
{"text":"I reallly dont know why people are giving this poor reviews.  The food was so yummmy! and the Portions are hugeeeeeee!!!  Service was perfect! Quick and constantly checking on us.  The Lasanaga was good and the Chicken Marsala was the best Ive ever had!!!!"}
{"text":"what a shock that such a little tiny divy place could be so delicious! we had a bday party for a coworker here and the food was divine!  The stuffed shells YUM, the pizza so good, and the alfredo I could go on GREAT FOOD  With the bad reviews of this place is a shame, anyhow I definately didnt see any chairs empty while we were there, its really worth a shot."}
{"text":"Caffe Italia is a great casual place that rivals the quality of North Beach. Lunch specials are very reasonably priced, ingredients are fresh, service is friendly and a glass of wine won't break your budget."}
{"text":"Yeah, okay. That's all I can muster about Caffe Italia. I've seen this place bustling at times, but today was not one of those days, and it's always a little unnerving to try a restaurant that is virtually empty. However, that worked in my favor, as I grabbed a lunch to go and what was promised in 10 minutes was delivered in less than five. I ordered the capilini with pesto. I liked that the pesto and oil were evenly mixed into the noodles - sometimes you end up with chunky lumps of pesto and that was not the case with this dish. I also ordered a side salad, which was a disappointment of iceburg lettuce, tomatoes, olives, and a pre-packaged dressing given to me in two separate styrofoam containers. Granted, I got my order to-go, but a fresh dressing in a container would have been a bonus. And TWO styrofoam containers for a salad? I don't get it.  I also don't like being scolded when I visit your establishment. Please forgive me for not seeing your small sign on a wall filled with 30 other signs, telling me I can't use my credit card for a purchase less than 10 dollars. First of all, why not? And second - if it's that important to you, make the sign more prominent. Not bad food, quickly prepared, not horrible service... I'll be back when I want quick Italian, but I won't be craving this place or taking out of towners for an experience."}
{"text":"I work very close to Caffe Italia and i must admit the food is great.  Yes, the owner employs young people who don't really know how to serve propely.  But you're not at a 5 star restaruant.  It's a neighborhood place w/GREAT food.  I've got friends from NY who raved about the sause."}
{"text":"Cafe Italia is now a Fileberto's. I was saddened to see this change.  :("}
{"text":"$12.95 for spaghetti? Do I get a chicken parm with that?  Nope. We have to pay for a bread basket?!  That's not cool.  First of all, this place always looks empty or closed when you drive by.  I don't know if it's the lighting, but it's not the most inviting place on Melrose on 7th Ave.  My husband and I decided to give it a chance and actually drove into the parking lot to see if it was opened.    When we walked in, we didn't know if we should order behind the counter, be seated, or pick our own seating.  Once we were seated by our host/waiter, he gave us menus.  We were shocked as to how much they were charging for simple Italian dishes.  My husband ordered a calzone which was cold in the middle and I ordered a meatball sub which hardly had any mozzarella cheese and the roll was very hard.  The marinara sauce was on the clear side lacking in richness and spice. Overall, this place left us wanting more for the money.    If you're gonna spend $$, you're better off heading to Harley's Italian Bistro up the street.  The quality of food is much better for the price and has a more restaurant feel to it.  Not only that you do get chicken parm with your spaghetti for about the same price Caffe Italia charges for just spaghetti AND you get all you can eat fresh bread for free."}
{"text":"Living with a guy that is practically an Italian chef himself, you would think I would be ready to bomb this place like British bombed the Italian fleet at Taranto in 1940 with Swordfish bombers.  Such was not to be the case, as the Italian owner acquitted himself nicely in the face of such grim history.  Let's face it...the military history of Italy lends credence to the statement they can cook but not fight.    We arrived on a Wednesday night and the place was fairly empty, just a total of four tables were occupied.  We were quickly ushered to our seats and perused the menu, which consisted of too many varieties of spaghetti at about $12.95 each, inter alia (that's Latin for \"amongst other things\").  I finally settled on a meatball panini for $7.95, being budget conscious and all, while my dining companion selected the eggplant parmesan.  He also ordered the coffee, which turned out to be fantastic.    Salads soon arrived at our table, followed by tasty bread which we dipped in oil.  But, there was no vinegar, and we both commented on this failing.  The salad wasn't bad, but it wasn't great.    Our entrees followed very quickly thereafter, and I munched into the large bread wrapped \"torpedo of bread\" (continuing the military theme of this review) filled with large meatballs, sauce and melted cheese.  It was really very good.  I was expecting the Buca di Beppo crapola giant meatballs that King Kong would turn his nose up at, but these were tasty and quite good.  The \"panini\" was very big, though, and I could only knock out half of that.  Meanwhile, my dining companion's eggplant was hot, tasty and good.  The spaghet?  Not so much.  The portions were large, and he also ended up with a lot of take home food.  I'd like to see this place put on a diet, both in terms of prices and food size.  I can hear Gordon Ramsey screaming at them now.  \"The portions are too big, and the quality isn't commensurate.  Get it right, you monkeys!\"    So, overall I was really impressed, hence the four-star rating.  Maybe I just had low expectations, because I can see where some might not have been as pleased (referring to the other reviews on here).  I probably would have given it 3.5 stars if that were an option.  The service was good until it came time to get the check.  I could see the server dining with the owner and someone else when we were wrapping up, which I found odd to say the least.  Overall, B on the food and C on the service, but like Arnold said it best, \"I'll be back.\"  And I'll leave the Swordfish bombers at home next time."}
{"text":"I finally had the chance to try this place this evening.  Why the four stars? Well first of all they are open late. Secondly, they offer Yelp discounts! I was pleasantly surprised to see the discount deal pop up when I checked-in using my Iphone.  I was glad because I wasn't really digging the salad bar, but my pasta dish was decent.  I ordered the Spaghetti Cilantro Pesto. One of their Mexican-Italian Fusion signature dish.  However, it was missing something. Oh yes....Cheese!  It was a good thing I ordered it to go and ate it at home. I put a little grated Gruyere cheese and a dash of Cajun Parmesan spice, and the food tasted much better.  I would probably go back and try something else. I relished  their strawberry lemonade, and  I also like to support independent businesses, so I am being generous with my rating. So there!"}
{"text":"I walked in with high hopes for this place. I was hoping to find a great Italian place near my house. Their pizza was very good. Unfortunately, their 4 formaggi had blue cheese in it. Who does a 4 cheese pasta with blue cheese? Theres no point in adding any other cheese because of the over powering nature of the blue. So when I bit in this, I was pissed.  Being an Italian lover, I have never not been been able to cope with some meh pasta, but this was so bad I could make it through a ravioli. AND I LOVE RAVIOLI!  I returned it and the guy was helpful, saying they'd replace it when they opened the next day but I just wanted my money back. Which lead me somewhere else to get something to eat.  Also weird, they were blaring Mexican music which I thought strange for an Italian place. Concluding, its expensive (except for pizza), the 4 fromaggi sucked, and I'm going to try it again only because of the pizza and how nice the guy was."}
{"text":"We decided to stop by here and get some dinner after driving by and actually noticing for once that it is open.  We should have kept driving and eaten at Harley's instead.  Inside, the place is pretty plain and a little bit cheap looking.  I don't really have a problem with this, as Giuseppe's is pretty much the same.  I do have a problem though when my waiter hands me a menu that has masking tape covering half the options on there.  So, what'll it be tonight, spaghetti or pizza?  After scouring the menu in search of something a little more \"original\" we both settled on the Tortellini in Cream sauce with Ham and Peas.  I got this mostly because I was hoping for a pleasant reminder of my favorite dish at Beppo's that has long since been removed.  That pleasant reminder was not there.  The pasta was clearly not handmade, and reminded me more of the stuff you buy in the refrigerated aisle at the grocery store.  The cream sauce was okay, but again tasted like a grocery store brand that came in a bottle.  The peas were certainly canned.  They were a rather unfortunate shade of putrid green and the ham tasted like the Costco ham cut up in to small slivers.  Simply put I was less than satisfied with my meal.  There are so many things about this dish that could be changed to make it a wonderful dish.  Sauce is so easy to make and an uncomplicated cream sauce would do wonders for this dish.  Even frozen peas would taste better than canned.  A trip to Calabria deli to pick up some good Italian Ham could move this dish from unremarkable to spectacular.    These shortcomings are pretty much unacceptable in my book when there is a far superior Italian restaurant just blocks away.  If they can do it, so should you.  I probably won't be back."}
