{"text":"So rude; the owner once again was telling off a customer!! I just keep thinking shes having a bad day but then I see/ hear her rip her customers apart."}
{"text":"The coffee is generally pretty good, but like most coffee shops, only as good as the person making it. I have found that when the owner makes the coffee my fancy espresso drinks are better than average, but the other staff (over probably the last year) produce unpredictable results. The sandwiches have been quite mediocre. The new push has been on crepes. I have not been impressed with those I have had...again, middle of the road. I am astounded at how OCD they are about what toppings you can have on them. They do not like to deviate from the standard. This is not a large commercial kitchen, so when I pay decent money for something I would like the option of leaving off a toping I dislike.

As for the \"art\" on the wall...uggghh
Coffee shops should not try to be cultural centres...starving artists are usually found in coffee shops not art galleries!"}
{"text":"Cute little cafe with modern decor and local artisan's work on display. My hubby and I went for breakfast on a Sunday morning and were able to be accommodated right away. We had our little 6 monther with us and there was no problem finding room for his car seat.

We each started breakfast with a vanilla latte. Both drinks were hand crafted with the perfect foam-to-liquid ratio (in my humble opinion). The espresso had a delightful nuttiness to it. In retrospect, I should have found out what brand/roast they are using. We each had a savoury crepe as well. I had the smoked salmon and hubby had the egg. Both crepes were very well done. The crepe itself was light and just a bit sweet - which I love! The smoked salmon crepe came with a dijon mustard which I had not expected and I found it to be a bit overpowering. Hubby said his egg crepe was delicious - they used freshly shaved parmesan on his. None of this powdered parmesan.

The staff was very friendly. As we cleared our dishes the manager (owner?) asked us how we enjoyed our experience and whether there was anything we would change. I mentioned my thoughts on the mustard and she was very receptive. I really felt like she was not just soliciting my opinion as a pleasantry, but because she was honestly looking for feedback. 

We will be back."}
