{"text":"I came here quickly to grab an iced latte to go.  The place itself looks fantastic  with its black & red decor and plenty of seating.  They have a menu of food items and beans from JJ Beans (I miss Vancouver!) so I was looking forward to my drink.  Disappointed.  It tasted more like cream (not even whole milk) than anything else.  The espresso seems to be an after thought.  I didn't finish the drink.  A $4 plus small drink wasted."}
{"text":"Been coming here for 6 months since moving back from Australia where the coffee  culture is competitive - the coffee here is on par with the best baristas have to offer in Brisbane, Melbourne or Sydney - well recommended for lattes and a healthy lunch :-) - service is always with a smile too @-@"}
{"text":"Caffè Art Java on Mont-Royal was, when it first opened, my favorite cafe in the whole world.  Great location; sleek, but inviting, ambiance; decent food; and mind-blowing lattés.  What wasn't to like?  I was a steady-going regular for years.  I was concerned when I learned the founders had sold the place, but I hoped the new owners would leave everything more or less untouched.  And at first they mostly did.  But things still started to slide.  The new owners started advertising their menu using grainy photos--appropriate for late-night Chinese take-out, but not an upscale cafe. The kitchen and barista staff turned over almost immediately--to be replaced, we think, by the owners. And so the food became barely adequate and the coffee, frankly, went to hell.  I eventually stopped being a regular, but I still went every now and then because the ambiance was still great. No more. One of the owners forced me to pay for a tisane that I never received.  Some time ago, I ordered a tisane that never arrived at my table. I got so engrossed in my work that I didn't really notice; in fact, I only noticed that it hadn't arrived when it was time for me to pack it up and go. So I left, slightly miffed that I never got my tisane. Annoying, but mostly harmless and certainly innocent. It's the kind of brain fart that can happen to any server.  A week or so later, I went to the cash to pay my bill and the owner who was working the register presented me with TWO bills: one for that day's tisane, and one for the tisane I never received. I protested, saying that I had never received the earlier beverage. The owner insisted that she distinctly and specifically remembered preparing this tisane, which I never received. This went back and forth several times until I thought it had been made clear that if she made me pay for something I never received, I would never come back. The owner insisted, so I paid both tickets.  The owner's decision to push the issue over my strong protests (no matter what she does or doesn't remember) says everything that needs saying about the new management at Art Java. Maybe she thought she was being tough or something, but did she really think I was trying to wriggle out from paying $3? I was a _regular_. Does she not realize that she's basically calling me a liar and a thief? In any case, $3 is apparently more than my good opinion (which, at bottom, equates to all of the business they might ever get from me) is worth to them.  At Art Java, every penny counts--but every customer, not so much."}
{"text":"For coffee nuts or west-coast transplants, this place is a must. They use Vancouver's own JJ Bean product, they use actual barista-grade soy milk (not the cereal-tasting stuff) and the staff clearly know how to make specialty coffee drinks. (The croissants are also baked on site each morning, which is basically worth another star by itself.)  The luxury seating area is also a nice plus for people who want to just sit and read or talk, and you've got free 2.4/5GHz WiFi N.  What's not to like?"}
{"text":"Good breakfast, very large serving. the service was vg. The coffee was good. They only had one style of brewed coffee made. Lovely setting, in the sun on the street."}
{"text":"J'ai aime le repas,  le cafe artistique le service 'l'ambiance  ,la musique et on peut recevoir le service en français."}
{"text":"On my trip to Montreal I discovered a few things: The Yelpers there aren't as generous with their FUCing, and there is apparently such thing as 'Yelp Rating Integrity.' Supposedly, if I give too many things high ratings, you'll all think I'm an easily pleased push over that just wants everyone to be nice to each other...  Yeah, well, this place was awesome, just like everywhere else I went -- Yelp Integrity be damned!  Caffé Art Java is faaaaabulous.The chocolatines were great and my chai latte was fab (no art because it's difficult to create pretty things without dreamy brown coffee to draw the pictures, sadly), but thing I was most impressed with was the steamed milk. I am a foam nazi. if the foam is weak and watery, everything tastes 10 points sadder. Even if it's made with the steamed tears of baby unicorn-centaur cross-breeds. This steamed milk was so thick! I kept marveling at it's ability to stay on my spoon when I turned it upside down.  \"Look, baby! It's not moving! Right way up, upside down, right way up, upside down... IT'S JUST STAYING ON THE SPOON!!\"  Yep, and I was no longer jealous of his cappuccino art. My steamed milk is strong and independent, like a white Beyonce! Who needs art when you got all of *THIS*? Yup, that's what I thought.  Five starts, Caffe Art Java, five stars."}
{"text":"Hum, I don't know that this is a chain. It is so chic I thought it's one of the kind. :-) I have only tried white chocolate J-ice here. It is delicious! A bit expensive but worth it~  The downside of this cafe is - they do NOT have free internet what a waste...."}
{"text":"Les pommes de terre au déjeuner sont excellentes, de même que le café."}
{"text":"Felt overdone. Service was slow with no line. Smelled like paint thinner when I was there."}
{"text":"As far as I know there are two Cafe Art Java in Montreal, this one and another one in the Mont Royal area. This is the best Coffee place in the entire city and I am not joking, if you are a Coffee snob, this is where you should go, forget about Starbucks, Van Houtte or god forbid Tim Horton ;). They serve perfect cappuccinos, I seriously miss it."}
{"text":"I've always had a great espresso here.  Brunch is always packed and the wait can be a little long at time to get food....but the staff is very efficient and courtious.  The food is tasty and fresh."}
{"text":"I dunno what else to say that hasn't been said. I love coffee and I can seriously say I've had the best coffee in Montreal at this place. By coffee, I mean espresso, not drip. The Leftist espresso from their machine is sweet and delicious. Great staff who are always willing to talk coffee and answer any questions. Hit this place up. Not a lot of Starbucks which is great to see so it drives traffic to places like this. Hard to find 2 great coffee places period in Toronto without passing 25 S$ stores on the way. GO THERE! -- Their. Muffins. Are. Great."}
{"text":"Food is good. I came here for breakfast and also, mostly, because I could work with my laptop and using wifi at the same time. They serve good food. But the service was terrible. I waited 15 minutes seated and no one came to say hello or something, and the place was far from being busy... I had to get up and ask the waitress for a coffee... Then I ordered food, which was serve really quickly and was good. But then I had to ask for another coffee, and for another..."}
{"text":"I really wish I could separate out reviews for service and reviews for food, because the food here was actually very tasty (although not especially special).  The servers, however, kept forgetting about us - after we were seated on the tiny back patio it was like being sent into a void where it took forever to even flag down a waitress to take our order, the food took a good while to come out and they forgot part of the order, and nobody ever checked on us."}
{"text":"This place is close to my office and it's definitely a huuuuge step up from the Starbucks one block away. The food is unfortunately average at best, but the beans are delicious! I almost always get the almond latté and it never disappoints - creamy and delicious! :)"}
{"text":"J'étais ici pour le brunch du samedi. Nous avions décidé d'essayer un endroit différent cette semaine-là.  Première impression: ça semble bien. En entrant, la déco est propre et moderne. Mais en se dirigeant vers l'arrière (pour avoir plus de paix), je remarque que les tables sont irrémédiablement tachées et les banquettes sont défraîchies et déchirées. Une visite à la salle de bain confirme que l'entretien n'est pas une priorité: des taches de moisissures ornent les murs. Une rénovation et un nettoyage en profondeur ne seraient pas de trop.  Côté bouffe, j'ai pris le pain doré Art Java qui était excellent. Toutefois, il est servi avec du sirop \"de poteau\" plutôt que du véritable sirop d'érable. Je vous conseille fortement d'essayer les pommes de terre maison. Elles sont bonnes et pas trop salées. En revanche, elle baignent dans l'huile. Heureusement que la portion servie avec les déjeuners n'est pas trop copieuse, sinon c'est une crise de foie garantie!   Mon copain a pris l'omelette trois fromages (emmental, cheddar et brie) et oignons verts. L'omelette manquait cruellement de sel (et je ne suis pas quelqu'un qui mange salé, au contraire je trouve que tout est toujours trop salé). On cherchait les oignons verts (je crois que j'en ai vu 2 mini-morceaux dans toute l'omelette). Les ufs étaient très aérés ce qui donnait une drôle de texture à l'omelette; on aime ou on n'aime pas.  Le service était tout de même courtois, ce qui a un peu racheté l'expérience.   Bref, j'ai bien aimé le pain doré et les patates, mais je n'y retournerai pas."}
{"text":"My first thought after the first sip of their Latte: I'm not going to Starbucks anymore.  My latte's ratio of steam/milk was just perfect, and the barista was hasty and efficient during the preparation and seemed very experienced. The latte was slightly expensive, but definitely not overpriced.  Also had the Tomato and Garlic Soup, which was pretty mediocre, and it was slightly cold. The Milanais Sandwich, on the other hand, was quite tasty and full of flavours.  The interior ambiance is great, and the decors were very nice, good for lunch or to enjoy a cup of coffee."}
{"text":"Good coffee, good espresso, tastey food. Not too pricey, but expect to pay a little more for the deliciousness. Good environment for working especially when the rush is off. Casual music. For some reason they have a bunch of TVs with the food network on (muted). Never really understood that. Sometimes a line builds up when they are under staffed."}
{"text":"Their latte is amazing! It's the perfect blend of bitter and sweet. I don't think they have their president Kennedy outlet still though."}
{"text":"Art Java had me at the first sip. Ever since, I have been addicted to their fantastic lattes. Their foam is rich and dense - It is literally to DIE for!"}
{"text":"Way cheaper than the Art Java location on Mont Royal, but service and food are also a tad more basic. The wifi is much better however, even at peak hours (the Mont Royal location only offers a mediocre/erratic Ile Sans Fil wifi access)."}
{"text":"Relaxed atmosphere and reasonably busy. Serves one of the very best coffee in Montreal. Service is efficient, comes with smiles. Killer carrot-cake, and I mean K.I.L.L.E.R. Casual lunch fare is always well executed and presented, if a bit pricey."}
{"text":"The staff is very friendly and service was fairly quick despite the line-up. I stopped in twice for latté and both times I really enjoyed the richness of the coffee. That said, while I know that lattés shouldn't be served steaming hot, I did find these to be a little too on the cool side for my liking. Also, one of the reasons I stopped in was to get some fabulous art on my latté but sadly, there was none to be had. I had heard that these guys did an amazing job, and I was a little eager to see what they could do - had the camera in hand and everything! I guess I'll have to give it another go :)   Overall, a good coffee spot, though a bit small."}
{"text":"Les choses se sont beaucoup améliorées au café. J'y ai mangé une assiette d'oeufs bénédictines très originale, et mon accompagnatrice des crêpes Red velvet moelleuses à souhait. C'est propre et le service y est excellent. À réessayer!"}
{"text":"My first time to Montreal, I was there for a week of meetings in the winter.  Yelp didn't seem to do Montreal then, so I checked coffee geek or something like that to find out where to get espresso while I was there.  My meetings were right across the street from where I was staying, and this place was about a mile away.  Every morning I walked round-trip in the snow to get a cappuccino -- they're that good.  Really really good.  Great shots, perfect milk, straight pour with free-poured art.  The art itself isn't a big deal to me, but to do art like that, you need good foam;  so good art is a sign of good foam.  One day I got a sandwich, intending to keep it for later, but it came pressed, so I ate it.  It was fantastic -- called grand-pere, and I can't remember exactly what it had in it, but I've had a couple more since then, and it comes with choice of salad (the garbanzos are really good).  The bagels are good too.  There's a little room in the back with comfy chairs, tray tables, and TV's; the music is OK.   I've been back to Montreal several times since then, and go to this Art Java location almost every day.  And they definitely DO have free internet."}
{"text":"One of the best places to get a cup of coffee in the city.  Finally, the \"third wave\" of Barrista artistas arrived to Montreal with Art Java (first on Mont Royal and then this downtown location). A few other places have opened up since that are probably better but you still can't find better espresso drinks in the downtown area (most of the points of comparison - the chain places - don't even come close). Sandwiches are slightly overpriced (and taste like they come from the same place as Java U's) and the environment is slightly sterile/generic but the artfully decorated macchiatos hit the spot."}
{"text":"Espresso was above average, and good for a non-espresso \"specialist\" type cafe. Not at the level of top espresso cafes. Drawn slightly cool and probably a little long. But was fully drinkable w/o milk or sugar added.  I'll search around more next time I'm in Montreal. Croissant was very good. Friendly service, good pricing. Nice location to relax, also."}
{"text":"Had a really good brunch here.  A small serving of waffles with eggs, fruit, and sausage.  The restaurant opens up into the sidewalk, nice with the spring weather we got."}
{"text":"Caffè Art Java est le meilleur café pour aller travailler sur le plateau.  Les banquettes sont tellement spacieuses que vous pourrez être à votre aise, sans parler qu'il y a des prises électriques à chaque deux mètres. C'est vraiment idéal pour s'installer pour faire des travaux de groupe ou rencontrer un client.  Pour ce qui est de la nourriture, rien à redire là-dessus. C'est très bien.  Le chaï latté est un des meilleurs à Montréal je dois dire. C'est presque un dessert dans je le bois tellement c'est bon.  Je recommande!"}
{"text":"Latte art is precious - or at least that's what I realized in most of my cafe wanderings. My americano was one of the better ones I tasted in Montreal and my lemon poppy seed muffin was moist. I was there just before a lunch rush where the paninis looked fresh and the clientele looked social, if not a bit on the corporate side.  What really gives Art Java bonus points is the ample seating and wi-fi. For that, I say merci beaucoup!"}
{"text":"This was our first breakfast stop during our weekend in Montreal.    Selection of sandwiches, specialty coffees, pastries...your usual coffee shop far. However, what is unusal about this place is that it also has a full bar and serves cocktails later in the day and throughout the evening.  My capuccino and chocolatine were delicious.  There was a bit of a translation issue though as the barrista ended up adding skim milk to my friend's cafe americano - who does that?  The coffees were a bit on the pricey side, but I didn't mind.  I loved the decor and overall vibe of the place."}
{"text":"The latte was so good that I had to dish out my first 5 star for a coffee shop. The latte they serve was truly exceptional....even when I order it iced. (I draw my line for iced latte at about 20 below freezing)  I have no idea where they got a croissant from, but that was incredible as well. It's hard to imagine this being a chain store.  I'm a huge fan of croissants, and their croissants are well layered with buttery flakes. This can't be good for my health, but it's utterly delicious for my taste buds. This is going to break my starbucks addiction while I'm in montreal."}
{"text":"Just another generic coffee shop. I've been about six times, I can't find anything negative to say about it, but I can't find anything fantastic either. Sometimes that's a good thing. The place is clean and the coffee is fresh. They also have real bagels, not the fake kind that you get from Tim Horton's that taste like stale bread. Personally, I'm gonna keep going."}
{"text":"Loved it :-)   The latte was amazing and I can't stop thinking about the delicious soup I had that day. The weather was super cold and a warm bowl of soup was just what I needed. Delicious!   I hope to visit this place in the near future :)"}
{"text":"I stopped by this place for breakfast earlier today. Good coffee, quick service, and close to my hotel (delta Montreal). The croissant was alright, I was expecting a little more there. A homeless person came in and caused a small scene, which was handled right away. All in all a good experience."}
{"text":"Le Plateau Mont-Royal est rempli de bons cafés et, malheureusement, cette place ne fait pas ma liste. J'ai trouvé le lieux un peu drabe et je n'ai pas vraiment trippé sur le goût de leur café. Celà dit, si vous êtes dans le coin, c'est certain que je vous conseille Art Java au lieu des chaînes dans le coin (Second Cup, Café Dépôt et Starbucks)."}
{"text":"So wonderful we stopped here twice on our vacation. Excellent chai lattes and americanos. Delicious croissants. We weren't able to get on the free wifi (must be a password), but no big deal. I definitely recommend."}
{"text":"I was in a hurry and about to board a train but I saw that this place was close and a change from the larger chain coffee shops so I checked it out on the weekend.  The service was friendly and fast.  I actually didn't order a beverage that was prepared there (probably should have!) but I did grab a snack that was made in store and it was great.  It offers lots of space, free Wifi and there are televisions (on mute!) which is something that you don't often see in cafes."}
{"text":"Coffee is so-so but the food is incredible. Gorgeous salads, amazing pastries, great sandwiches. All this with free wifi, great service, and the staff being totally cool with us hanging out on our computers and phones (after we were some eating) for an hour trying to find lodging for the weekend. Good deal for good food & vibe."}
{"text":"It used to b amazing, still is pretty good. Cappuccinos were the best in town but they seem to have redefined the formulations of lattes and cappuccinos since they got taken over by the owners of the other downtown AJ. If you used to like cappuccinos, go for the lattes now. Cappuccinos are much stronger than they used to be."}
{"text":"Had a quick meal here -- ham and cheese on a croissant - and it was delicious.  Fabulous croissant.  Free wifi, great location and all in all, a very nice break."}
{"text":"I was in Montreal for a week and this became my home away from home.  Great layout, skilled baristas, high-class eatables, and more flat screen TVs than Lil Wayne's Range Rover for some reason."}
{"text":"This is our favorite coffee place in Montreal! The coffee is wonderful, I always enjoy their cappuccinos and lattes.  Their desserts are a nice treat and the service is amazing!   Great place to go on a Saturday afternoon! Not overly priced for the quality."}
{"text":"As with most coffee shops here, the coffee is delicious and very reasonably priced. My friend and I ducked over for a break during our visit to the Musee McCord just a block or two away. We had croissants, too -- the almond version was decadent and rich, perfect fuel for a day of walking the beautiful streets of Montreal!"}
{"text":"Searching for a perfect cup of Cappuccino is not that easy in Montreal.. Maybe I am just too picky but I found the few I have been too either too mild, too frothy, too sour, until I have the cappuccino at Caffe Art Java.  One of the best cup I had.   The vibe though might be a little commercial but the drinks and the latte art is definitely exceed my expectation!  There is also a more quiet room at the back if you want more privacy without listening to the barista talking about their weekend plans..  Free wifi!  I will be back!"}
{"text":"It looked artsy and independent from the outside, but once inside I realized they were trying way too hard.  The person who took my order didn't do more than just grunt to me and didn't tell me that I could pick up my drink along a separate wall.  It was a bustling Saturday afternoon and the place was empty.  You would have thought he'd been more happy to see me.  When the barista handed me my drink I realized they'd gotten my order wrong.  Somehow, my order for iced coffee became a chai latte.  I can't really blame the French/English barrier here as they were both speaking to each other in English.  When I pointed out that my order was incorrect.  He sighed and said that he wouldn't be able to redo it until his manager came back because it was a different price and he didn't have the authority to change it in the till.  What?  Not knowing when he'd be back, I decided just to leave and make my way back to the hotel...in 90 degree F weather...with a piping hot chai latte.  What saves this from the 1 star category is that I'll admit that it was a darn good chai latte!  Spicy and frothy at the same time.  I would have liked it much better on a chilly day, but I'll take it."}
{"text":"Avec une note déjà pas mal haute et des avis de gens d'ici et d'ailleurs, j'étais curieuse d'essayer ce café de la chaîne Art Java qui se situe en plein milieu du centre-ville. J'y suis donc allée pour prendre un latte et travailler pendant quelques heures entre deux réunions.  Le service a été très bien, les prix sont justes et ça tout pris pour que je résiste de prendre un des muffins à la citrouille et aux épices qui étaient encore dans le moule. Je me suis installée à l'arrière sur une chaise confortable avec un plateau de style \"tv-dinner\" pour y mettre mon laptop et mon café. J'ai bien aimé l'ambiance et le latte mais je n'ai pas été époustouflée par quoi que ce soit. Tout était bon et correct, rien de plus, rien de moins. Définitivement un bon endroit pour une petite pause dans le centre-ville."}
{"text":"Unless the quality of the coffee in this place gets better it won't garner a lot of stars from this knowing reviewer.  The place on av president du kennedy bears the same name but is miles above this place in terms of the quality of the espressos.   If you are not overly discriminating with your coffee then it will be like any other cafe."}
{"text":"The actual coffee is worth 4 stars but the employees push this place over the edge to give it that one extra star.   The coffee here is definitely enjoyable. Take it from a self professed coffee snob, it's good.   I've been popping in regularly for the past 7 years on my occasional trips to Montreal and it still is my favorite coffee spot in the area.   As with any other place, it depends on how good your barista is. And John Bigsby is one of the best. But I'm sure he'll move on to bigger and better things soon. But this place will almost remain rock solid."}
{"text":"While in Montreal in the fall I was making my way to the train but desperately needed a cup of coffee. I popped my head in here, being the first place I saw and it turned out they sell JJ Bean coffee.   JJ Bean is a coffee roaster from Vancouver and I have a total love affair with it. Finding it in Montreal absolutely made my day.   The cafe itself is quite cute, lots of places to sit and work. Looks like it mostly serves the uni crowd but all in all it was a great find!"}
