{"text":"So I have actually gone to Caffe d' Amore many times.  Most times, my review would be closer to a four star.  Let me just say using mason jars as coffee holders= ingenious!   I've now taken to using them in my daily life.  I literally now just throw my closed mason jar of coffee in my purse, no spills and im off to work in a hurry.  ANYWAY... the coffee in general is fantastic and flavorful.  However, this review is for one visit i had in december.  I ordered a coffee...fine.  The girl behind the counter \" accidentally\" hit the update button on the iPad cashiere device thing.  The result was her telling me to come back in 10-15 minutes to pick up my coffee and pay because she couldn't help me at this time.  Take note... the coffee was already made.    So whatever, I was on a break and I wandered around the public market for 15 minutes.  I came back and she just said \" yeah.... its not happening\" and in a very flippant, I dont care about your time sort of voice further said \"sorry.\"  This might be the perfect time to use the whole hashtag thing of #sorrynotsorry.   Needless to say, I left uncaffeinated and not at all more ready for my day than when i had first started my coffee seeking endeavor 20 minutes before.   Due to this customer service and loss of time, I haven't been back... maybe one day I'll venture back."}
{"text":"Caffé d'Amore is has the best mochas in Pittsburgh. They use perfectly roasted Commonplace beans pulled to perfection and the highest quality locally sourced milk. Combined with unique homemade syrups, you can't go wrong whether you're a purist drinking only the best espresso or wanting a tasty flavored latte."}
{"text":"Fantastic little pop-up at the PIttsburgh Public Market.

Had an Iced Chai Tea latte which was delicious and with little ice! [just how i like it]. Make sure to check out newest addition of an Affogato made with Homemade Ice Cream from Family Farms Creamery, delicious looking"}
{"text":"I don't hesitate to say FANTASTIC! I worked with Paul and Sarah to confirm a catering order (for a very large group) with very little time after our vendor canceled on us just before our event. They were not only great to work with but the coffee drinkers were over the top happy with the drinks! 

After this great experience I took my family to visit, and the coffee drinkers were hooked! (I'm not a coffee drinker) The combination of delicious drinks, sustainably sourced goods, and such friendly people make this an amazing business!

Catering - A+, Shop in the Strip District, A++!

Added plus - they operate out of the Pittsburgh Public Market, which is quite frankly one of the best places to go to support local business!"}
{"text":"First off, Caffé d'Amore is in the Pittsburgh Public Market. In the nearby stores and booths you can purchase a $7 smoothie, sample many different kinds of olive oil and try out your taste buds at Pittsburgh's oldest kombucha brewery. Here you can purchase a top quality espresso drink. So it's in good company. 

It's kind of like the other locations in this market. Walk up and order whatever you order and then stand there and consume your purchase while clogging the aisle, or just take it and leave. However you do it, you'll likely be happy. I left happy when I ordered a cappuccino once. The next time when I ordered an espresso I left mostly happy. It was decent shot using Alchemy blend from Deeper Roots. I would have preferred something single origin but this was fairly decent. Yes they use Deeper Roots coffee out of Cincinnati. That also made me happy to see them featuring one of the few quality roasters from Ohio. 

Also if you check in, you get a dollar off your drink. Oh, and the name says something about catering so umm, I assume they cater or something."}
{"text":"Th!ey make the best Cafe Mocha's! They also make very good Ice Tea and they have many different kinds of tea to choose from.  All there ingredients are from local business's!"}
{"text":"I've been ordering chai lattes less and less now because I enjoy a spicy chai mix rather than a sweet one. Plus, a lot of places just carry a popular brand of chai concentrate that's not good.

I really dig when people make their own chai mix, and they certainly do! Plus, they carry local milk to use in the lattes, so you know it's going to taste legit. 

One thing I found interesting was that they judge the steaming temp by feeling the carafe. I'm an extra hot type of girl, so I'd be worried they'd burn themselves on my frivolous needs! But it's nice of them to try at least:)"}
