{"text":"I drove 30 min starving to get here and try the food but when my friend and I walked around the corner... there was paper in the windows. Confused, my friend and I looked around for the entrance but there was a sign in front of the door for a different restaurant down the street. Nothing said Cafe Bon Appetit was closed but it obviously is. Don't come here anymore, BECAUSE ITS FRICKIN CLOSED!!!!!!!!!!!"}
{"text":"I'm always looking for local spots to try and this has been on my list for awhile. As soon as we walked in we were greeted by very friendly staff. I knew right away I wanted a savory crepe. I settled on the egg, ham & cheese, my dining companion got a tuna melt. The crepe was one of the best I've had since being in Paris. I know that sounds dramatic, but it really was delicious. The crepe was definitely the star of the show but the tuna melt was very good too. Fresh greens, balsamic vinaigrette, swiss cheese, served on a roll. The tuna wasn't drowned in mayo..again just fresh with lots of flavor. Both served with a side of greens.  So far this is my favorite in the neighborhood. I really appreciate having something nearby that offers fresh, quality food, made to order.  Having just moved from Pittsburgh which is such a foodie town, I was spoiled by having tons of great local restaurants to pick from. If this place was there it'd be busy 24/7.  I'm happy it's here in Coventry tho."}
{"text":"I've been on yelp for years but this is the only place I've written a review for. Do yourself a big favor and eat here!  My wife and I were fortunate enough to find this place after being in town for just a couple of days. Walking over at this very moment to grab a sandwich.  This will make 3 days in a row. Food is amazing and staff is super friendly."}
{"text":"Randomly passed the Whiskey Bar last night and thought to check it. To say the bartender was rude is an understatement. While all my friends ordered a drink, I opted out bc I was driving. The bartender proceeded to tell me that I HAD to order a drink or leave bc this wasn't a \"park\". I told him if I left so we're my friends and he didn't seem to care so we got up and left his shitty, overpriced bar."}
{"text":"I had the worst service of my life here. My husband and I went there for brunch. We took our time looking at the menu because we had never been there before. The boy behind the counter rushed us to order, and we decided not to eat there. He called us liars for changing our minds, yelled: \"Fuck you!\" and flicked off his middle finger to us. We will never go back!"}
{"text":"I enjoyed this place once and unfortunately every time I go there and order the same thing it turns out drastically different- the most recent being stale apricots on a Greek salad. Wait times are beyond what I would consider reasonable (25mins) for a takeout place. It is good food 1/4 times that you order. Staff is spacey and inconsistent"}
{"text":"I'm something of a snob when it comes to buffalo chicken wraps. Theirs is excellent. Very fresh and good and spicy. Great atmosphere--bring a date here!"}
{"text":"I love this place, its small and trendy and the chef and hostess do their best to make you happy, not that its that hard. I ordered the Salmon special and mentioned I was hungry, so Simon the chef added a spoon full of pasta to my plate and came outside twice to see how I was doing, more to be exact how his food was doing, lol  Thanks again!"}
{"text":"I was working from home and decided to use UberEats to order lunch (my experience with UE has no bearing on this review, but for those wondering, I'd give the driver 5/5).   I was in a craving mood for crepes and came across this place - close, had crepes, and at a good price. Bingo! I made two small stipulations with my order 1. No nuts on the crepe and extra whipped cream. I also ordered a smoothie.  When I got my order, I noticed the drink wasn't included. The Uber driver was confused, as the restaurant did not provide him with one (keep in mind UE drivers don't work for the restaurant and are just the messenger, so they rely on the restaurant to get  the order right). He immediately offers to drive back and see what he can do. In the meantime, I decide to pop into my lunch. The crepe isn't pretty, but it's in a to go container, so that's no surprise.  Nuts were included, but just a few so I picked the out went for it. The crepe was amazing - even better than I had hoped!  Then I got my smoothie. It was warm and tasteed terrible. I felt bad pouring it down the drain after everything the UE driver did to get it but it was inedible.   I think a lot of the negative experiences had to do with the business getting familiar with the UE process (they are a new to using the program) so I will likely go into the establishment in the future to see how it goes. The food was amazing, so I'm sure my experience was a fluke and can't wait to try again!"}
{"text":"This place is seriously amazing! The food is delicious, the price is super reasonable, and the people running it are incredibly friendly! Great stop before a show at the Grog Shop ^_^"}
{"text":"From all appearances this place is closed! Sign on door is for their Whiskey Bar."}
{"text":"This is a small, healthy, Mediterranean inspired cafe.  I would consider it mostly a carry out restaurant.  There are two sidewalk tables and a few tables inside.  The menu is limited.   They have the usual lunch time fare - Sandwiches, Wraps, Organic Salads, Smoothes, and Crepes.  They had no sides or side salads on the menu, which i found strange. Vegan and vegetarian dishes were available .  I got the gyro sandwich and Lebanon wrap.   Both were fresh- made to order and reasonably priced (about $8).   Both were good but nothing special.  They staff was very nice and the place was mostly clean. I will go back."}
{"text":"I was going to the Chipotle in Coventry for a burrito and noticed a sign in front of Bon Appetit, \"lebenon wraps $7\". Sounded worth trying. Oh, wow - wayyyyy better than yet another McBurrito! Thinly sliced amazing chicken, hummus, cucumber sauce, lettuce... It was amazing."}
{"text":"Great place! I have been wanting to get something from here for a very long time but always end up walking to the chipotle next door. I'm happy I stopped. Their buffalo chicken wrap knocks Chipotle's burrito out of the world  Fresh food, reasonable prices and local."}
{"text":"Nice break from typical food choices. Different cultural food options. The Lebanon wrap is my favorite by far."}
{"text":"It took a while for my husband and me to actually spot this place, but the menu looked interesting so we decided to stop there for a brunch (the inn on coventry had a huge line!), and I am so glad we did stop there: the place is small but everything is extra fresh, tasty and healthy. The staff is super friendly (including the manager, which even tried to get a bee off of us). The house burger was cooked to perfection and the twist of the gyro sauce was amazing! We also had the chicken deluxe: the chicken was tender and tasty, the vineagrette was delicious, and it was not super stuffed with millions of thing, there were fresh veggies (you could taste each one of them) in the correct amount to actually enjoy a sandwich. We will definitely go back woth some friends!"}
{"text":"It was actually really good and I was pleasantly surprised!  The café environment doesn't really match the website or even my original perception of the place, but the food turned out pretty good.  I got a tomato basil and mozzarella sandwich with an added grilled chicken on it and it turned out quite good.  The guys that work there are very nice and make sure that you get what you ask for.  I don't know if it says it anywhere, but it's also a whisky bar and i think it might connect to the bar next door (don't take my word on that).  I'd definitely go back, plus they are on Uber eats so take the opportunity to try them out!"}
{"text":"Amazingly fresh, healthy, and delicious. Reasonably priced for significant portions. We have had the buffalo chicken sandwich (don't be fooled - this is not your ordinary bar food buffalo chicken), the smoked salmon wrap, and the tomato mozzarella basil sandwich on ciabatta that was to die for. I love the little patio and the international flare."}
{"text":"I can't believe I discovered this little gem. We went in for a takeaway lunch in a Sunday. My husband's first choice wasn't available (no biggie) and the person taking our order (I believe he was the owner or at least the manager) offered us free drinks to make up for it. We sat outside while our order was being prepared and he came out to ask if we're like fresh grilled peppers on our sandwiches. He and the other person took a lot of care in making our food and wow - best sandwich I've had in a looooong time. My turkey wasn't sad-ass lunch meat, but real live (ok not LIVE) sliced turkey breast. The veggies were crisp and fresh. And the bread had just enough chewy without cutting my mouth up like a food dagger.   I will totally be back and hopefully I can force myself to change my order to try one of the other delish looking sandwiches or salads! Thanks for the great service too!"}
{"text":"Lots of options on the menu.  I had the turkey deluxe sandwich, tasty, the greens were outstanding.  Friendly service, went with my kids and were very patient. Prices are reasonable"}
{"text":"I am so confused at the lack of hype for this place! I predict this little cafe will get some new attention in the coming months. So impressed with the menu, the service, the quality of the food, the price!   What is bon about bon appetit? Let me break it down:   * So affordable. The menu ranges between $6 to $12. This is ideal for all the students nearby * For the price, the plates are delicious and healthy, no greasy meat - no poor quality veggies * Generous portions - ie, you don't have to order three or four things to feel full, which is often the case with similar cafes (I am thinking of the new additions to Uptown nearby, which are advertised at the same price but offer portions half the size) * Variety on the menu is just enough to be diverse without being overwhelming * Service is top notch, friendly and polite; the owner knows the regulars & treats them well * Offers dine-in option with Edison string lights, a clean, romantic set up for couples or small groups  I ordered a chicken avacado salad, around $10. For the quality and quantity of this, believe me when I tell you that you won't find a better deal around Cleveland. I was full well before I finished.  Truth be told, I'm considering an apartment in Coventry now because there is - at last - a great place to eat there without breaking the bank. I'm thoroughly impressed and I genuinely hope more places like this will open up around CWRU and Coventry.   Bon Appetit, raising my glass to you. Keep up the spectacular work! Wishing you more customers and prosperity this new year!"}
{"text":"Stopped in today because the chipotle line was too long. So glad! The food was INCREDIBLE and tasted fresh. The service was awesome too- they even made me a smoothie so I could try even more stuff. Try the 'detox' smoothie with pomegranate and Orange juices. So good. The chicken was perfect. Will be back."}
{"text":"My prior review was terrible. However, I've had the pleasure of getting to know the owner and he's a great guy. He explained that he terminated the guys from my horrible visit in the past. Everything and everyone is amazing. The owner gave us a private tour of the Whisky Bar... he has a great selection. You won't be disappointed."}
{"text":"Enjoyed a fresh salad, falafel and coffee.  Delicious! Served by a nice chef."}
{"text":"This place is awesome! Super fresh ingredients, great menu, I love the Lebanon. Also staff is very friendly. Highly recommended."}
{"text":"Saw the great reviews so I decided to try this place.  Very very average and the service was not great. The guy taking my order was so unfriendly. I will try this place once more because of the good reviews. Maybe it was an off day."}
{"text":"My boyfriend told me there was a great sandwich place up the street so we went.  I love euros so I wanted theirs but they had a wrap I wanted instead of the sandwich and they made it just how I wanted it! His step-mom told us to try the hummus as an appetizer and we scraped the plate it was so good! We went to tip them and they said they can't keep their tips on a credit card though?........ I'm a server and I think thats bologna! I gave them cash and told them to keep it :) hands down best little place to go to"}
{"text":"This is the only place I go on Coventry Rd and never get disappointed! All of the sandwiches we tried are soo good it's kind of bizarre to me! And the salad... Portions are giant, taste super delicious! It's always funny when I see people walk by and go to Chipotle.. Seriously people, give it a try and you will be coming back over and over again"}
{"text":"I ordered via Uber eats yesterday. I ordered a turkey club and a detox juice. Amazing! Despite the club having bacon on it, it wasn't greasy at all. It was delicious. The different spices used to season the veggies on the sub were fantastic! The bread was soft and the entire sub was easy to eat. The detox juice was amazing! I loved the flavor, the texture and the color. It rocked. Would highly recommend this place"}
{"text":"This place is SPECTACULAR!! This little cafe in Coventry has the best black bean burger I have ever had- and I am vegetarian, so I have eaten many black bean burgers! The flavors are out of this world and the gyro sauce is killer. Also, the chef is very attentive to what you are looking for in a meal and is excellent a providing suggestions on what to order. He will also make things a special way if you are craving a specific type of meal. All in all, a wonderful place high-quality flavorful food.  Best vegetarian food on the menu: Vegetarian Crepes, Black Bean Burger, Vegetarian Platter"}
{"text":"Dog-friendly patio, awesome staff, delicious fresh food made to order. Mediterranean cuisine. Pick-up orders. 2 table indoor space, 5 tables out front. LOVE it!"}
{"text":"What can I say about this small cafe. We visited here for a late lunch. First off, there is a whiskey bar downstairs. The prices are reasonable and the food is great. I had the grilled salmon wrap with a mango tango smoothie. My smoothie was so delicious!   My co-worker had the grilled chicken deluxe sandwich. He said that his food was great also. Overall, this place is awesome and I would return again."}
{"text":"This place is delicious and adorable. I had the grilled salmon salad and the salmon was cooked perfectly and the roasted tomato, avocado and lettuce were fresh and tasty. The portions were generous and the staff were extremely kind. On top of the delicious food, the place itself is tastefully decorated and feels warm and homey. I will definitely be back-- and soon!"}
{"text":"This is a review of the whiskey bar in the basement.  I haven't tried the food, so if you are wondering what the food is like stop reading this review now and disregard the 2 stars.     So I walked in the place, which is pretty cozy, intimate and looks to be a nice place.  There are about 10 seats at the bar and a few small tables scattered around and they have live music, which is a nice touch.  But I am here for the whiskey - bourbon, to be specific.  I ask for a menu and notice that the prices are a bit high, but I am here on a mission, to try a specific bottle I heard they had here.  It's a rare bottle, but not an amazing, Booker's Rye or Pappy Van Winkle type bottle.  I am there to try 2016 Old Forester Birthday Bourbon, which, if you can find it, is about $69 a bottle.  So it's not on the menu, but I see it behind the elegant bar, all lit up and surround by some Orphan Barrel bottles.  I ask how much a pour is, and the bartender tells me $100!  I laugh, and say \"that's really expensive\" to which he replies, \"it's very hard to find\" (it's $20 a pour at Society Lounge). So basically they are trying to sell a shot from a bottle which they paid $69 for at almost twice what the bottle cost (~25 one ounce pours per bottle).  For $100 I can get a pour of 20+ year old Pappy Van Winkle at most other fancy whiskey bars.  I promptly walk out and vow to never return again.     I drive over to Lizardville and buy a pour of  2016 Booker\"s Rye, which was recently rated the best whiskey in the whole world, for $22.  As I sip this masterpiece I laugh to myself about how ignorant and/or greedy the owners of Cafe Bon Appetit are...  If you want to be a serious whiskey bar, treat serious whiskey drinkers with a bit of respect, because if you are willing to shell out $25-50 for a pour of alcohol (let alone $100), you are most likely going to know whether it's worth it or not."}
{"text":"Favorite place to eat on Coventry. Salads and sandwiches are amazing and the service is excellent."}
{"text":"My husband had a huge, tasty burger grilled just right.  I got the Lebanon wrap and it was delicious and hit the spot. The chef and girl who took our order were friendly and quick. We will be going back!"}
{"text":"Awesome new place at Coventry!  Quiet laid back little takeout place that has a few seats inside and out.  The sandwiches were delicious and very fresh tasting.  I had an italian sandwich with some meat, spring mix, melted cheese and tabouleh on grilled ciabatta bread and my wife had a wrap.  Both sandwiches were amazing and at great prices."}
{"text":"Many people may not know that there is a cool speakeasy style whiskey bar downstairs with live music.  It is a very intimate environment with seating for around 30 people.   The bar offers one of the most impressive whiskey selections in the area.  Additionally, there was a really talented live musician playing acoustic guitar at a good volume where you can still chat.    We ordered the emerald, whiskey sour, and old fashioned.  All were done very well and you have many options of whiskey and bourbon to choose from.  If you are into more rare bourbons, this is the place to go - they have many selections you will not be able to find at a store.   Be patient here as the bar tender really is passionate about making he drinks and takes his time to perfect the drinks.  It does take a while to get your drink due to this if it is a busier night."}
{"text":"Awesome place, great food, owner knows how to cook! I passed this place a few times on my way to chipotle and was amazed at the delicious (and healthy) looking meals and it has become a regular staple for me. This is not a fast food place so expect to wait about 5-10 minutes for food depending what you order. A lot of the menu is very health conscious but it's all absolutely delicious and it's all under or around 10 bucks. Between this and luna, I barely need to cook anymore :)  Any time I have friends visit and they want to try something other than the usual chipotle/jimmy johns, this place never disappoints! Check it out."}
{"text":"Since the place my boyfriend and I had wanted to try was closed, we checked out this cafe because it was nearby. As we were standing outside deciding whether or not to go in, the chef, who was on a break, told us to try it because the food is good (because he's the chef), so we went right in. The strawberry blueberry smoothie and scrambled eggs were good (which you can't really mess up anyway), but that's about it. The bacon was okay, but I was not a fan of any of the other meats on my plate because they tasted too dry. Also, the French toast tasted almost stale to me. Oh well, I'm sure Cleveland has better!  Taste | 2 Atmosphere | 2 Presentation | 3 Service | 2 OVERALL | 2"}
{"text":"Being in the Coventry area, and with time running out on our 30 minute free meter, we quickly searched Yelp for a place to eat, and came upon Cafe Bon Appetit.  Seeing the highly rated reviews, we took a chance, and ran in, with 28 minutes to spare on our meter.  We ordered the Lebanon wrap and Buffalo Chicken wrap. And then it took us 25 minutes to get our order.... after waiting 15 minutes, we just switched our order from being in-house to take-out.  Now, both the wraps were made with care. The wraps were neatly made, bound tightly, and came out piping hot. However, the tastes weren't anything that great, and the wait literally took forever. We had to run out to get the car (as we all know how tight the Coventry cops are), and with one minute to spare, our orders were finally ready.  Now, I understand the yelp reviews. There's not many healthy wrap places in Coventry- but I really just didn't really get any \"wow\" experience from the wraps.  So, if you have time to spare and just want a warm wrap, definitely stop here! But definitely not, if you're in a hurry!"}
{"text":"Male owner of the whiskey bar establishment was extremely rude and unprofessional. I went there with a small group and one of my friends wasn't going to order a drink due to being our DD. The owner told him he had to either order a drink or leave. Everyone else was ordering his overpriced drinks so I don't understand why the owner acted the way he did. The place was empty for the most part, so he wasn't losing customers from no table seating available. I would avoid this location if I were you."}
{"text":"This place is awesome - the Chicken Avocado salad is amazing and I always get the Detox Me blended juice.  The salad is big and filling and definitely makes you feel healthy and energized.  This place is awesome, convenient and a welcome addition to Coventry."}
