{"text":"Cafe Holt is perhaps one of the greatest unknown treasures of our great city. Situated on the lower level of the glitzy Holt Renfrew department store on Sherbrooke, Cafe Holt serves up lunchtime treats in a fabulously chic environment. This place gets hopping around lunchtime with in-the-know businessmen and women stopping by for one of the deliciously concocted tartines. And make no mistake, the tartines are the star attraction. 

The tartines are what can best be described as an open-faced sandwich on Poilâne bread flown in thrice weekly from Paris--glamourous, non? The tartines are absolutely, 100%, delicious. The Grilled chicken breast is perhaps my favourite: chicken, chevre, red peppers, arugula, and a truffle honey that will knock your socks off. The Lamb brochette is another favourite with a distinctly Lebanese quality to it as it is served with hummus and pickled turnip. These delicious treats can be washed down with a glass from the carefully edited list of highly drinkable wines and and made-to-order cocktails. The cocktail list changes with the season--as does most of the menu--and I recently enjoyed 'Sweet Summer Strawberries.' WARNING: serving alcohol in a luxury department store is similar to free cocktails in Vegas. It'll loosen you up and make swiping that credit card far too easy for one's own good! Trust me, I've made that mistake in the past ;).

The service at Cafe Holt is really quite good. The waitstaff are always on hand to answer questions, refill your water glass, or fetch your car from valet. The price points are also not overly outrageous. A glass of wine and a tartine will set you back $30, a reasonable fee considering the environment and the quality of the food selection."}
{"text":"I just love this place for lunch.  I've been here 4 or 5 times, and each time it's just as good as before.  The room is gorgeous.  The staff is efficient, if not always friendly.  And the food is always so cleanly refreshing.  It's not your standard fare, you'd find at many places.  It's not, but it borders on vegetarianish sensibilities.  It's almost like you are eating at the corporate dining room of a swish Japanese cosmetics company...  or at least how I imagine such to be.

I really like this place.  Can you tell?"}
{"text":"This cafe is located on the lower floor of Holt Renfrew, and the decor is modern. Service is friendly and fast. 
My fav is the Chicken Tartine or the Caprese Tartine, which are both open faced sandwiches using Poilane bread.  I could literally eat them every day, and do each time I visit the area. 
If you enjoy carrot cake, you must try theirs!"}
{"text":"Cafe Holt is situated on the lower level of Holt Renfrew.  Came here for a late/light lunch with a friend.  The space is very white and modern looking with a small bar.

As it was my first meal of the day I was hungry and got a starter and a main dish.  As a starter I chose the lobster and crab ravioli.  Portion size was great (about 5 raviolis) and it was very tasty.  My main dish was the taleggio grilled cheese.  It was good, but I found it to be a little too small for the price, since nothing was accompanying it as well (unless you count sprigs of alfalfa sprouts an accompaniment).  It is a tad expensive, but its of good quality and offers a variety of choices to suit all kinds of tastes.

They also have a decent wine selection.

The service was acceptable and efficient.  (I have sat at both the bar and a table before).

In all, Cafe Holt offers a nice refreshing fresh tasting lunch when its getting harder to come by in the downtown area."}
{"text":"We went here late one evening when we wanted a light supper, and it was perfect.  Good service and fresh food -- crisp greens, fresh bread, and moist chicken.  Lemonade was nice & tart!  Definitely would go back."}
{"text":"Great for brinch. They sell also high quality truffle pesto"}
{"text":"A chic cafe located in a luxury department store. The food was surprisingly decent and well worth the 'luxurious' price tag. Tartine (open face sandwich) is their specialty and most of the varieties I have tried were absolutely delicious."}
{"text":"Okay, I was a bit surprised at how good this place was. Maybe because most department store cafes are usually mediocre, but I've been here twice and have left happy both times. 

They specialize in open faced sandwiches, have a pretty decent wine and cocktail list and serve Illy coffee.

The lamb tartine is well made, served with hummus. I love their beet salad, a perfect refresher. 

However, my favourite would be the brunch tartine, basically like eggs Benedict with smoked salmon. Delish!

Service was spot on and the tab, well a bit pricey but worth it."}
{"text":"The beef tartine is delicious. The parm fries are also the best fries in Montréal. Now they have more options in the menu and we love it! Everything is made with fresh ingredients and you can tell, and the portions are perfect."}
{"text":"Fancy pants! This place is very expensive but ideal to impress a mentor/ supervisor or to take your MIL to eat somewhere downtown. I ordered the Dahl soup on a summer day which was a huge portion and absolutely delicious. Make sure you save up, a bowl of soup here sets you back at least $22."}
{"text":"A lovely place to stop by and enjoy your coffee or meal. So special service by workers. Deserts were good. Coffee is soft. Very good atmosphere."}
{"text":"Cafe Holt was located on the lower level of Holt Renfrew and the MAIN reason I decided to eat there was because my last name is Holt so I thought it'd be interesting to try. The place was a bit pricey ($15++). We went for brunch at around 11:30am and they had a separate menu for brunch. The sign said that food was 25% off between 11am and 12pm! The main thing I noticed was the excellent service. The server was extremely polite, kind and attentive. He immediately brought a tray of salt and spices. I ordered the brunch tartine, which had spinach, ham, poached eggs and really good sauce. It was delicious and filling (~$14). Overall, I would recommend this as a good brunch or lunch place if you're interested in tartine. They also have a decent selection of wines and coffee. Though a bit pricey, I still believe its worth it.


The Menu:
http://s7d9.scene7.com/is/content/HoltRenfrew1/Holts_Cafe_Montreal_Spring_Menu_enpdf"}
{"text":"Très bon, très chic, très frais. J'y avais mange une tartine avec du saumon fumé c'était impeccable. Quand on est dans les parages du centre-ville c'est un bon spot pour s'arrêter se faire plaisir à la fin d'une bonne session de shopping"}
{"text":"Excellent!  Soup and salad were delicious!  Beet salad was so tasty perfectly done with hazelnuts.  Soup of the day is excellent most days.  A fantastic lunch in the city."}
{"text":"The service was fantastic, the food delicious and surprisingly affordable. Although this isn't the place  for avant garde or québécois cuisine it's perfect for a quick bite while walking downtown or in the area. Thanks for the great experience!"}
{"text":"its expensive but its holts! the foods quite good..."}
{"text":"The food is pretty decent, and so is the service. Very small portions. The items were a bit off key, some were not balanced with flavors (either too bland, or too overpowering). I'd have to think before I go here again, though the ambience and decor are nice."}
{"text":"Cafe Holt, nestled on the bottom floor of the Holt Renfrew store next to the Men's Department was the perfect spot for this weary shopper to sit down for a glass of vino before continuing his hunt for the perfect purchase.

I asked the waitress if I could sit at the bar to just have a glass of wine, and she pleasently said yes.  I went over, got settled on my comfy bar stool and was given the wine menu.  The bartender suggested I try this Muscat Sec she had and it was delicious, so I ordered a glass.  I was THEN informed I needed to order an appetizer to go along with it.  FROWN (Also the reason for docking a full star - I don't like being tricked into buying something.  Had this been the policy, I should have been told when I asked the hostess if I could just have a glass of wine - which was $12, so adding the extra $6 for the cheapest appetizer made for a $20 snack!).  

Aside from that bit of tomfoolery, the wine was DELICIOUS (They wouldn't/couldn't give me the vineyard it was from because it was exclusive to Holt but they did offer to sell me a bottle on the spot.)  They gave me the latest Holt Men's collection catalogue to peruse while I waited and enjoyed my wine - all in all a very pleasant experience!  Great menu from what I saw, but I wasn't really looking for food.  A tad expensive, but hey, it's Holt Renfrew - what do you expect!  The staff was friendly, nice and easy on the eyes :)"}
