{"text":"Very good service, nice people. Nice latté.   Very bad guac and chips.   No air Conditioning."}
{"text":"It isn't often that I go for brunch in Montreal and I'm treated with service that seems genuine. Decided to try this home-y and down-to-earth café in St Henri with a friend this weekend. We were greeted by a bubbly server who was very accomodating of my dietary needs. What killed it for me was the less-than-stellar food. I ordered the Huevos Rancheros, the house special, and wasn't all that amazed. That being said, I would give them another shot and revisit for the service and the ambience, perhaps trying something different on the menu."}
{"text":"The Sud Ouest breakfast sandwich I just had was amazing!  I got it with the home fries which were delicious.   Crispy and smooth all at the same time.  Found my new St Henri breakfast place!"}
{"text":"I had high expectations for this restaurant because of the reviews, but unfortunately was disappointed.  The food was nice, nothing extraordinary for the price that is, I've had much better brunches in the plateau, verdun and NDG, we thought we would try it since we live close by.  Our server was quite obnoxious, and when I sent my so called cappuccino back and ask him for a bit more froth on it (because it was quite flat) he was slightly aggressive towards me and wouldn't look at me for the rest of the service and only addressed my husband.  On the other hand the other servers who came to our table were more pleasant.  Let just say we won't be going back.   Julia M"}
{"text":"Ich hätte gerne noch mehr Sterne vergeben, toller Laden. Super leckere Speisen (Frühstück), gemütliche, bis ins Detail geschmackvolle Einrichtung, netes und freundliches Personal."}
{"text":"The food was great, we enjoyed it! Price was ok. Menu was stained, so only 4*. Everything there is old and used, a little fresh up would be nice :-)"}
{"text":"If you love independent restos at an affordable price with some earthy decor and homemade cooking - you've arrived"}
{"text":"Amazing food! Just had the quesadillas and they were delicious. The guacamole was awesome! Really enjoyed my Blueberry/Rosemary Vodka infused lemonade as well as my dessert in a jar which consisted of gelato and a homemade cookie. SO GOOD! Great atmosphere and staff. Table comes equipped with playing cards if you just want to grab a drink and chill out."}
{"text":"Nice place. I was close to Atwater and i was looking for someplace to get a good brunch. I was surprise the menu on yelp was totally different from the one they propose. I choose pancake with bacon. It was ok, nothing special. I could have make the same at home. The moka was delicious. Wifi available. Nice service but it was a little slow for my taste. Good place if you have a group and you feel like eat at home."}
{"text":"This cafe is full of natural light, vegetarian friendly options, and friendly staff.  I have their classic breakfast once week and I always enjoy it. The food is reasonably priced and always very fresh. The Decore is very inviting and well considered."}
{"text":"This place is really a gem in the city; delicious combinations of quality ingredients with a good variety for vegans/vegetarians. The space is rustic/hipster and has a cozy feel to it; perfect to relax but also hip enough for a date or catch up with a friend. Always accompanied with great service."}
{"text":"Great service, vibe, ingredients and food.  We gaily stumbled yon this cafe on Friday night and they were perfect"}
{"text":"Café qui me faisait de l'oeil depuis un petit moment. La carte est fortement alléchante entre des sandwichs originaux, des soupes, des burgers, des tacos, des cassolettes, etc ... De la bonne cuisine réconfortante comme on l'aime. Mon sandwich avec du tofu fumé à l'érable avec tomate, cheddar était très bon. L'ajout de sirop d'érable dessus est très bien pensé et donnait la touche qu'il fallait. La portion de frite était costaud, une bonne portion pour caler la faim. Les 2 autres personnes avec qui j'ai mangé ont aussi apprécié leur plat. Service un peu lent cependant mais il y avait du monde donc on passera. On peut parler d'une bonne pioche ;)"}
{"text":"I loved the vegetarian offerings at this spot, in particular the tofu scramble bowl. The coffee was prepared perfectly and I came back twice for the toasted croissant. The space fills with beautiful, natural light and is both cozy and hip."}
{"text":"Good food, amazing burgers, brunch and smoothies ! Horrible services, not organized at all, we have to ask several times for water and also to get our menus. Just get organized !!!"}
{"text":"One of my favorite places in St-Henri, I go here almost every week! The brunch is amazing (love their eggs Benedict and huevos rancheros), and they have some of the best brownies I've ever tasted. Great place to study, and the staff is super friendly too."}
{"text":"Cute little café close to Atwater market with stylish decor. Food is decent but nothing wow. I tried their vegetarian quesadillas and had high expectations for the guacamole, but yeah as mentioned before wasn't impressed."}
{"text":"Je viens de déguster un des meilleurs déjeuner de ma vie!  Le Burrito déjeuner était tout simplement parfait!  Avec une belle portion de hash Brown bien assaisonné et un pico de gallo et un bon café!  Vraiment impressionnée par ce joli petit café.  Nous reviendrons,  juste pour voir si les bénédictines sont aussi bons!"}
{"text":"This place is amazing. The food is spectacular and the staff are so friendly. A must stop every time you're in the area!!!!"}
{"text":"This unpretentious café really hit the spot for me today. I was looking for a place to chill for several hours, drink bottomless coffee, and have the best breakfast potatoes of my life, and by golly I found it.  A few reviewers complained about the underseasoned/unremarkable food - but in the six months since those reviews were posted, I think the management definitely took note because I did not have that experience today. My meal set my tastebuds on fire and had me reaching for my phone to tell you: this place is the real deal. It's got the look of a cute, out-in-the-boonies breakfast spot, sweet, smiley, and generous servers, BOTTOMLESS COFFEE FOR $1.50, and the fruit on my plate was actually ripe. Mind you, it's June, so I'll check back in with you in six months and let you know if they're still pulling that off.  The portions are generous but not intimidatingly so, the prices are fair, and the decor is clean and slightly quirky, without being distracting.  It's just a great spot that does exactly what you'd hope for by looking at it, and I'm very happy I wandered in here today."}
{"text":"I've walked by this spot probably hundreds of times and never thought to walk in. After hearing that it was under new management we decided to give it a shot for brunch. I loves me a nearby place for brunchin'.  All-in-all, I can't say I was disappointed probably because I didn't really have any expectations. The space is extremely cute; the service was good; the portions were generous; but man-oh-man was the food under-seasoned. I doctored my huevos rancheros with a ton of salt and sriracha and it still remained a nice plating job (although I have to say I enjoyed that the corn tortillas were fried). My partner had the same deal with his herbivore plate. The stinker here is that a few blocks away is Café Joes- arguably the cuter breakfast café, with lower prices and seasoned fare.  At the end of the day, if I were to head back I think it would just be for a coffee and baked goods."}
