{"text":"Had a wonderful lunch there yesterday with my 92 year old fussy Czech mom. We both loved the homemade luscious mushroom soup, Russian egg, roast beef with blue cheese chlebricky (or small wonders),fabulous chocolate desserts and perfect cappuccinos. House white was excellent. A perfect lunch spot."}
{"text":"I discovered Café Prague with a friend while looking for a new lunch place in Outremont. First of all, the place is lovely : it's well decorated, the atmosphere is relaxing, and the waiters are really nice and quick. I was surprised by the lunch deals they have : not only the prices are quite cheap, but the food is delicious! I had little \"merveilles\" (small sandwiches comparable to tapas) and a salad, both excellent. I didn't try the cakes but we did take chouquettes, and they were among the best I've ever had (and also a lot cheaper than those you can find at Première Moisson, for example)."}
{"text":"Un petit bijou.. Service impeccable et nourriture raffinée. Les brunchs sont exquis. L'ambiance est chaleureuse et le décor nous rappel un petit bistro parisien."}
{"text":"Tout est bon,mais pas exceptionnel .utile quand vous êtes dans le coin.assez cher tout de même.la référence a Prague se retrouve dans l'assiette."}
{"text":"Bonne option pour le brunch avec leur formule à 20$: jus frais presse, verrine, plat et dessert pâtissier. Le décor rappelle des cafés d'Europe, c'est petit et pas bruyant. J'ai bien aimé et j'y retournerai. Le seul truc qui déçoit est de n'avoir qu'un choix pour la formule, aucune option ni changement possible."}
{"text":"Pour la qualité : 5 étoiles Le service: 2 max. Serveur qui oublie, manque de synchronisation. Ne Donne aucun extra.. Prix: cher. Le brunch très bon mais 20$ plus taxes sans café inclus... Ouch!  Atmosphère : 5 étoiles le matin au soleil. Avec fiston, ami ou chum... Ça vaut donc la peine mais pas souvent pour le porte-monnaie..."}
{"text":"Très bon service, endroit super joli et propre et leur américano était merveilleux!"}
{"text":"For me, this is a 5 star place when in Montreal. Really good. Service, coffee, cakes, almost everything including the atmosphere. Will definitely visit again."}
{"text":"Had the best coffee ever here and the food was great!   Didn't get 5 stars because a place with czech in its name should have strudel for sale."}
{"text":"Outremont, sur l'heure du dîner.  L'autobus se fait attendre.  -Bonjour! -Salut. Est ce que c'est possible de prendre juste un p'tit espresso vite vite? -Ben oui. T'es à la bonne place, tu vas en avoir un vrai à part de ça. Simple ou double? -Simple. -Parfait, il reste une place au comptoir pis tu peux même prendre la grande table qui est là.  *pense* CE GARS EST TROP COOL! *il me ramène mon change* *C'EST BON! MIAM!* *la bouffe semble excellente, je dois revenir* *c'est beau en plus* *il est tellement cool que je lui laisse 2$*  -Salut, merci beaucoup! -Merci à toi ma chère, tu reviendras nous voir! -*avec tout le chic qu'on me connait* YES!  That's all, folks!"}
{"text":"Nice little cafe in Outremont. Great decor and very good espresso. Had a Croque Monsieur for breakfast and it was delightful. Check it out!"}
{"text":"Cafe Prague is a nice coffee, snack, breakfast/lunch spot. Nicely decorated, table seating and good coffee."}
{"text":"Café Prague is decorated in a classical café style and provides a pleasant, and calm environment to enjoy a cup of coffee and one of the many treats they have on offer. The espresso they serve is comparable if not better than the best available in Montréal. The treats I have tried so far were excellent, and not overly sweet.  Update: Unfortunately the quality of the coffee seems variable depending on the barista. When the owner is there he usually pulls a good cup."}
{"text":"Lovely looking place with gorgeous high ceilings. Really nice coffee to be had here and every member of the staff is friendly and warm. I come here for lunch now and then as it is close to my office. The little toasts are always super good and come with all sorts of toppings: Russian egg salad, tuna, smoked salmon, various types of meat, etc. The desserts are all quite gorgeous looking as well, but usually I am too full to go there! I will say that it is kinda pricey, but at least the food is good, so that helps to take the sting out of the lunch bill.  They lose a star for saying that the soup was vegetarian...it had chunks of bacon and the guy shrugged when he saw me picking them out."}
