{"text":"Excellent coffee. Their filter coffee was excellent.
Small but appetizing slection of baked goods"}
{"text":"Small independent cafe in Rosemont with a pleasant ambiance, an appetizing menu, and, well, that's kind of it. I want to like this place--really, I do. But I can't get past the lukewarm (coffee drinks should be cold or hot, not \"just right\"), weak-ass, slightly chalky mocha I got served. Everything else _seems_ fine, but given that I just got served a crappy coffee in a place that bills itself as a coffee-shop, I don't feel terribly confident in their secondary offerings.

I can love a cafe that serves only decent coffee, but this experience did not clear the all-important fails-to-suck benchmark. I might give this place a second chance if I happen to be out this way again, but mainly because there aren't many interesting alternatives nearby."}
{"text":"The cafe is cute and hosts family/kid activities on occasion, however, I have found the coffees to be mediocre. Have been there 3 times and always felt underwhelmed. Haven't tried their food. I really wanted to like this place as I live in the area and there aren't many coffee houses around."}
{"text":"Belle découverte! Les plats sont simples et très bons! Que dire des desserts, on a envie de partir avec le comptoir! J'ai été conseillé pour prendre le dirty chaï, je n'ai pas regretté! Mardi est une journée parents, il y a une petite salle de jeux pour occuper les enfants!"}
{"text":"J'ai emménagé à une rue de ce café il y a 3 mois, et quand je les découvert, j'étais tellement contente de savoir que j'allais pouvoir boire un bon lattée chaque matin avant de partir au travail. À chaque fois, je prend un lattée régulier et mon fiancé, à l'érable. Délicieux."}
{"text":"J'ai beaucoup aimé cet endroit où je suis allée un lundi après-midi avec 2 amies. Il y avait de l'espace où s'intallée bien que l'endroit soit petit. Le service était super chaleureux et les produits offerts bien intéressants. La gamme des breuvages fait à base d'espresso, une belle sélection de thés camélia sinensis + quelques trucs un peu plus funky tels que latté à l'érable, london fog etc.
La petit sélection de pâtisserie est faite sur place, bien intéressant quand beaucoup de cafés s'approvisionnent chez les mêmes pâtissiers, ça fait changement et c'était bon.
Possibilité de manger un peu aussi, le grilled-cheese était simple et très bon à la fois (on peut réinventer le grilled-cheese, mais sérieusement à quoi bon?!)
Donc, très agréable qu'il y ait un café de ce genre dans ce coin un peu \"éloigné\" de la ville!

Vivement de les encourager et réencourager !"}
