{"text":"This place is original Mile End, in all its raggedy, weird, homey, D.I.Y., independently-owned and operated glory. Critics who rag on its weirdness must be the kind of folks who use the term \"foodies\" to describe themselves but actually just judge a place on the decor....the johnny-come-latelys who bought apartments out from under all the artists and now just want to scrub the neighbourhood clean and open high-end bistros that no one can afford. Café Le Dépanneur is a hold out and is also one of my favourite places to get breakfast. The food is tasty, homemade and affordable. The staff are nice. I can see how some love or hate the music thing... the musicians are hit and miss in the same way an open mic can be either great or totally awful, but the whole thing is actually really charming. So no, maybe it isn't the best cafe for a date (unless you are the fun type who can make the misfortune of a bad musician into a conversation piece) and maybe it isn't good for silent study. But I still adore the joint. Give it a chance and you might too."}
{"text":"This is one of the best cafés in the Mile End, and I'm a frequent visitor.  They have reliable, stable, and free wifi, excellent espresso, and food that's far above decent, even if it is a tad on the pricey side.  The all-day live-music performances and vintage décor lend an ambiance that's apt for conversation, people-watching, or individual work.  My only regret about this place is that it closes at 6pm."}
{"text":"I just finished reading other online reviews of this place, and my opinion is going to be the black-sheep one. The atmosphere is a not-so-subtle line between artistic and pretentious, cozy and crowded. There is a piano. The decor is raggedy, as if someone was thinking, \"This place clearly needs improvement. However, isn't it a clever idea to pretend that this is on purpose? It'll work.\" It does. I must say I did fall for the charm. They make great lattes: hot, sweet and running down your throat. They give you the delicious sting that one so badly enjoys first thing in the morning. I was trying not to gulp mine so fast so that it would last. They serve them in slim, tall glasses.   Now on to the food. We went there for breakfast, and I ordered a Debile Emmental grilled cheese sandwich, which on the menu says sun-dried tomatoes, asparagus, cheese and jambon. Being a vegetarian, I asked for mine without jambon, and could they replace it with avocado? They didn't have any avocado, and didn't make any suggestions for new ones. The waiter did smile though. Everyone smiled alot.  When my meal arrived, I peeked into the sandwich and saw that there were no sun-dried tomatoes. Now, $11 is a pretty decent amount of money for even a meal that you actually do want, so I got up the address the issue and revert the mistake. So when I went up the counter, two people had a \"What the hell now\" look on their face, as if I came up to the counter with a complaint on a regular basis. When I told them, there are no sun-dried tomatoes in my sandwich, they said that there is sun-dried tomato pesto. I peered at the menu, and pointed out, that nowhere in it is the mention of pesto, just sun-dried tomato. They shrugged saying that menu is wrong and that I shouldn't rely on it. I explained, \"The entire reason I ordered this sandwich is because of the sun-dried tomatoes. If I had known, I would have ordered something else.\" And in response to this, instead of apologizing, they rolled their eyes. They repeated, \"Yah, that menu is not good. Would you like more of the paste on the side\", the young boy offered. I suppose it was a nice gesture, but really he was just piling on the consolation prize. I said, \"It's fine, thank you. Really though, you should get your menu fixed.\"   All I got was another eye-roll."}
{"text":"Wonderful cafe! The owner had just stopped serving food but was kind enough to bring us soup and sandwiches. The soup was wonderfully delicious and came with warm bread and butter and my friend loved her sandwich. The cafe au lait was also excellent on a cold December day.  There's live music, a cozy atmosphere and a book store across the street. Definitely a place I'll come back to next time I'm in town."}
{"text":"Love this place! Great atmosphere, live music all the time, delicious drinks and food. Well priced also. Only problem is that it is often very crowded and sometime hard to find a table."}
{"text":"I was really close to give one star but since this place has some potential..."}
{"text":"I like the atmosphere and that this place is close to my house. For me thats as far as it goes. Theres definitely much better coffee and service to be had. My order has been incorrect on 2 occasions and even though I brought it to the attention of the cashier I still paid (10+) for it."}
{"text":"wow i was impressed by this place. really great decor, really good food, super nice staff, awesome concept and cool live music that does not disrupt your brunch/cafe experience. free wifi, great tasting coffee (so rare in north america in general!)  just go for it!!"}
{"text":"Big fan of this cafe.  Good breakfasts with fresh fruit and friendly baristas.  Free wifi, comfy couches and a warm atmosphere.  Sadly, it doesn't get any sun, so during the summer it feels a little dark, but a perfect place for a coffee and a chat."}
{"text":"Sympathique café de la rue Bernard, qui craque comme un vieux grenier ou les genoux de votre grand-mère. C'est un endroit bien fréquenté des locaux, qui passent aisément tour à tour de la langue de Shakespeare à celle de Molière. La table y est peut-être vieillie et penchée, mais on y sert un excellent café. Le menu offre toutes sortes d'options carnivores et végétariennes.  Le dépanneur fait vraiment partie de la trame sociale du quartier Mile-End, cul-de-sac traditionnel des aspirants artistes en tous genre. L'endroit est utilisé même après sa fermeture pour des activités sociales, des cours ou des conférences. Les artistes visuels exposent aussi en ses murs.   C'est aussi un endroit privilégié où apprécier les talents de la scène musicale indépendante. Un tableau noir au dessus de l'entrée indique les musiciens amateurs qui viennent s'y produire d'heure en heure, de 10 heures le matin à 5 heures le soir, du lundi au dimanche. Pour un peu plus de calme ou d'intimité, dirigez vous à l'arrière et asseyez vous dans la \" grotte \", une redoute sombre mais équipée de fauteuils et de divants de velours. La connexion Internet fonctionne à merveille.  Points plus : Sérieuse ambiance chaleureuse de quartier; Vous croiserez peut-être le chanteur Jean-Leloup, qui est un habitué; Très bon coin pour baigner dans l'ambiance hipster, artsy, indie, mais sans prétention.  Points moins :  Il n'y a pas toujours d'endroit où s'asseoir disposant de prises de courant; L'endroit peut-être bruyant par moment, donc pas toujours l'idéal pour travailler."}
{"text":"L'endroit idéal pour bruncher, relaxer, prendre un café ou écouter l'un des artistes qui sont présentés au Dépanneur Café ! Une belle adresse pour les locaux ou les visiteurs !"}
{"text":"A little raggedy around the edges with nice lattes and live music playing. The deck behind is a great place to start on the books you purchase from the small an interesting bookstore across the street, Drawn & Quarterly."}
{"text":"Thanks to the Indie Coffee Passport I got to check out this neat little coffee shop.  The service was friendly, the coffee delicious, and the surroundings rather interesting.  I've got to echo Risa with the ramshackle description.  It looks a bit as though the place was furnished through garage sale finds, and not the super funky \"oh I just found this MCM credenza at a garage sale for $10\" kind of garage sale find people post over on Apartment Therapy and everyone gets jealous, more like \"I found this in an alley\" kind of finds.  The place is a bit worn, there is produce and supplies all over, but it's comfy like going over to an ancient aunt's place.   The performer's playing the piano in the corner complete the mood. Despite all of that, it works, feels comfy cosy, and I will be back the next time I'm in the area and in need of some caffeine."}
{"text":"C'est l'un de mes cafés préférés à MTL. J'y vais pour les Musiciens \"live\", la décoration, le cachet.... le divan et le piano.J'y consomme soupe, \"grill cheese\", carré aux dattes, café et les déjeuners. Les déjeuners sont servi avec une généreuse portion de fruit. J'aime plus particulièrement l'omelette jambon-fromage et le sandwiche western.... les deux à 9,88$.     Si j'avais ouvert un café se serait celui-la. Je l'adore pour la même raison que d'autre le déteste soit la présence de musiciens qui performent presque continuellement. Le Dépanneur permet litéralement à une communauté d'exister. Sans lui certain des musiciens ne pourraient pas rejoindre un si large publique. Chaque fois j'y ai fait de belle découverte. C'est un des cafés les plus vivant de Montréal. Ils se situe dans le Mile-End un de mes quartiers préfèrés à MTL et un des poumons artistique de la ville. La décoration style magasin général est de bon goût. Il y a un divan confortable un piano et des tables bigarrées. La section derrière le comptoir de service est plus calme et donne accès a une petite terasse bien jolie surtout par une belle journée d'été :)  Le menu offre une sélection de sandwiches, \"grille cheese\", soupe, biscuit, desert, déjeuner, du BON café, tisannes et thés :). On nous offre une sélection intéressante et quelques mélanges surprenants. L'hiver quoi de mieu qu'une bonne soupe avec un \"grille cheese\" en écoutant du folk :))) .  Le seul point négatif pour la nouriture c'est l'assaisonnement de l'omelette aux légumes. Les olives en trop grand nombre gâche le tout... c'est franchement trop salé...  En résumé un petit bijou de café parfaitement intégré dans son écrin....le Mile-End :)!!!"}
{"text":"C'est un joli café aux allures hypster de l'avenue Bernard. On commande au comptoir un délicieux sandwich déjeuner ou un grill cheese pour moins de 10$. Il sera servi à votre table en 5 minutes.   On peut s'installer confortablement sur l'un des sofas tout près du piano pour flâner ou écouter un pianiste. Il y a un horaire pour les musiciens tous les jours de la semaine.   Il fait par contre très chaud car pas d'air clim!  Somme toute très charmant, on l'ajoute à ses favoris."}
{"text":"Cafe dep is a great spot to hear live music over a very reasonably priced breakfast. If you want to experience an authentic, unmistakable Montreal plateau eatery, this is it.  Highly recommended for breakfast."}
{"text":"Awesome to find out that they have a regular open mic/live music schedule"}
{"text":"We stayed at the B & B upstairs which included free breakfast at this cafe.  Each morning we thoroughly enjoyed our brunches (we're not early risers).  The atmosphere is very bohemian which made us feel right at home.   The food was excellent.   And when you factor in what we saved on that meal each day, it made the room (found on airbnb) all the more affordable.   We would definitely eat here again even if it wasn't included in our accommodation!"}
{"text":"J'adore ça venir jouer de la musique ici parce que c'est super relaxe. L'ambiance est agréable. On se sens bien. Le café est bien. Et la bouffe est bonne. C'est surtout végé, alors on se sens comme à la maison. Y'a des artistes qui joue à chaque heure de la journée. C'est une superbe place pour découvrir les artiste de la relève et ceux qui font ça pour le fun."}
{"text":"One of my Mile End favorites. Love the music performances. Great coffee and baked goods, cool staff. Overall a good crowd and a great vibe."}
{"text":"Café Le Dépanneur is a magical little spot with great coffee, a variety of grilled cheeses, and a stream of live-music all day. Relaxed and sweet!"}
{"text":"Un super endroit chaleureux, sans prétention, bouffe simple, mais délicieuse, bon allongé, bon smoothie et les shows d'artistes rendent cette place merveilleuse!"}
{"text":"I hate the all-day music here... it's the WORST place to do work/have a conversation.  I don't like the dark back room. I don't like the way it's hard to plug in your laptop. I just don't really like it here.  The coffee/service/food is good, though. I just can't stand the rest of it."}
{"text":"A pretty cool little spot for a drink and to chat with friends. I liked the vibe, it felt like somewhere artsy that my hippie mother would have dragged me to as a kid, and thus it was nostalgic. There was a relaxed feel, from the staff, to the decor, and the live music playing was loud enough to enjoy, but you could still have a conversation at a reasonable volume. The latte I had was really nice, with just a touch of sugar like I requested. I think they use LaVazza espresso, which give it a smooth, easy-to-drink quality. If I'm in the area I would definitely stop by again."}
{"text":"Et bien voilà, je disais que je reviendrais pour profiter de sofas, et c'est fait! Un lundi après-midi nuageux, ma tablette, un magazine, un bon (même très bon!) grilled cheese aux tomates séchées, asperges, basilic et emmental,un  cappuccino au lait d'amandes et un guitariste live comme musique d'ambiance. J'adore j'adore j'adore. Et leur gros biscuit aux pépites de chocolat est pas mal bon aussi! Définitivement un de mes cafés préférés!"}
{"text":"Oh, le Dépanneur. Toujours le repaire hipster par excellence, en plein cur du Mile-End, accueillant et un peu bordélique, reposant avec ses grands sofas et parfois intense avec ses musiciens toujours présents. Super endroit pour prendre un repas simple mais excellent (le combo soupe du jour et grilled-cheese est un incontournable à mon avis) et faire de belles découvertes musicales.   Ça sent l'art, le café et le fromage grillé. Parfait pour y passer un samedi après-midi à l'abri des soucis.   Le service est sweet mais parfois trop relax ou friendly pour les non-initiés. On s'y habitue et on finit par apprécier! ;)  PS: LE CIDRE CHAUD. C'est oui. C'est comme un drap santé dans ton intérieur. Prends-le. Ça pétille et c'est plein de cannelle."}
{"text":"Mein neuer Lieblingsplatz in Montréal! Der Besitzer hat mir ein kleines nettes Zimmer über seinem Café vermietet. Also man könnte sagen ich wohne hier.  Der Service ist sehr freundlich und aufmerksam. Das Essen ist super lecker! Es gibt eine Auswahl an tollen Salatvariationen, welche stets frisch vor den Augen des Gastes zubereitet werden.   Das Frühstück ist ebenso sehr lecker und reichhaltig. Die Preise sind mehr als fair! Für umgerechnet 6 bekommt man hier einen Riesen Frühstücksteller mit Ei, Sauerteigbrot, Obst, Ahornsirup und Marmelade. So viel, dass ich es fast nicht ganz geschafft hätte aufzuessen!  Für Teeliebhaber gibt es hier eine große Auswahl! Ganz besonders toll fand ich den Chai Latte mit Soyamilch oder Mandelmilch! Hier wird kein industriell hergestelltes Sirup verwendet sondern eine hausgemachte Variante.   Fazit: Falls ihr mal nach Montréal kommen solltet, dann schaut hier vorbei! Es lohnt sich auch ein Spaziergang durch das coole Mile End Viertel, in dem sich das Café befindet!  Hier erwartet euch viel Live Music! Das ganze Viertel erinnert irgendwie an New York's Greenwich Village in den 60er Jahren und versprüht ein authentisches Bohemian Flair! An jeder Ecke steht ein junger Musiker mit Gitarrenkoffer und erinnert an eine jugendliche Version Bob Dylans :-)"}
{"text":"Dans le cadre de l'indie coffee passport nous sommes venus dans ce café.  En boisson ca sera un americano et un thé glacé, beaucoup de choix pour le thé glacé. Je pense que c'est l'un des meilleurs thé glacé que j'ai bu :) Nous avons pris un grilled cheese \"Le gaspezien\" (thon) ainsi qu'un \"marquis de sade\" (camembert, épinard, jambon, oignon rouge et olive verte). Il était tout les 2 très bon et bien servis en terme de garniture. Accompagné soit de soupe, soit de salade ou de fruit. La portion de salade et de fruit est bonne. J'ai d'ailleurs trouvé les fruits de bonne qualité (comprendre murs et sucrés)  Au niveau de l'ambiance on s'est laissé bercer par les 2 concerts pendant notre repas, cela colle très bien avec l'ambiance posée du café.  Pour le service on m'a servi mon grilled cheese sans jambon et après m'en être rendu compte et avoir mangé la moitié ils m'ont proposé de m'en refaire un gratuitement, j'ai apprécié le geste  Une bonne expérience que je vous conseille :)  Attention car pas d'interact mais un ATM ;)"}
{"text":"There's something uniquely charming about the up and coming Mile End neighbourhood and this little resto on Bernard. For a brief moment, I thought I was in Parkdale.  Food here is ordered and paid for at the bar and then delivered to you. Very much like being at a pub in England. Food was cheap for brunch! Three filling meals including pain dore (french toast) with generous portions of fruit - apple, banana, grapefruit and orange, crepes with fruit and grilled cheese with fruit and hot bevies for all-one americano, one double cappuccino and a hot chocolate, came to just under $30.00 or $35.00 with tip. Super affordable and the coffee was strong. You can even switch out the fruit for soup or salad. I'm opting for the grill cheese next time since they do a ton of different varieties.   Even more awesome was that local artists play hour-long sets of music all day. Plus you know a place is a winner, when teas and freshly made juices come in mason jars. Cuuute! Music, wifi + yummy cheap eats?! I'm in and coming back for in-house made baked goods."}
{"text":"Mellow, ramshackle, tasty cafe on Bernard with a tiny green spot in the back and live acoustic music at the piano or up front in the window. For singer-songwriters looking for afternoon gigs, Cafe Dep might be worth checking out. The coffee is strong here, the breakfast is fresh and tasty and alright, but if you're sitting in the window with a lovely crooner nearby everything tastes extra fine. (Assuming you like a crooner.)"}
{"text":"A charming, cozy cafe option on Bernard Ouest. Vintage / shabby chic decor with lots of personality.  They make excellent grilled cheese sandwiches and the coffee is pretty decent as well. Also very well-priced overall."}
{"text":"First of all : The Carrot Cake.   Oh god. The Carrot Cake.   With a capital C like.... CHESUS CHRIST !   I asked for your traditional salmon bagel. I was really not expecting such a big plate with this huge salad (soooo fresh)  So when they brought me the (pretty big) slice of Carrot Cake, I wasn't sure I would be able to finish it.   Ahahhaha. Stupid me.   No really, just go and try the Carrot Cake.   I almost forgot to talk about the coffee. I guess it was good.  Carrot Cake."}
{"text":"Really great place to hang out. I just feel happy whenever I'm here. Could be the great lunches (tomato cheese sandwich is great, and the grilled cheeses as well), the live music in the background, great fresh juices and coffee....A great place to come and spend time."}
{"text":"My first brunch in Mtl! The crepe avec jambon et fromage was good, they gave a lot of fruit with it. The coffee was good too! Internet doesn't work, but the place was nice and quiet"}
{"text":"This is an all-day music place. Quite rare in Montreal. If you go there to work and be quiet, I think you are missing the point."}
{"text":"We enjoyed a great breakfast (included with the Airbnb).  Great omelette with fresh fruit and coffee.  Big windows at the street let the summer breeze in."}
{"text":"I can see how the live music can be a problem talking, but I totally dig the vibe. This is better than anything considered to be like \"The Village\" should be.   The grilled cheese was surprisingly good, and the coffee was expectedly good. I like everything about this place actually. And while I'm sure some acts are hard to occupy the same space with, when we went, the singer was a delight."}
{"text":"This is a very special place. It is very relaxing to have nice music with your coffee. They have wonderful musicians that play soothing music. If you want to focus on your work, they have a room inside as well. Im lucky enough to come across this coffee shop in my short visit to Montreal. It definitely made me fall in love with this place."}
{"text":"Plus de café glacé à 16h et impossible d'en faire un (heureusement qu'on est dans un café et que c'est l'été... !). Un thé glacé sans glace. Un verre d'eau avec plein de particules non identifiées. Une porte des toilettes des plus transparentes. DURE la vie de café de nos jours.  Si j'y retourne ? Non."}
{"text":"Des super bons grilled-cheeses, un décor éclectique et des performances musicales privées à toutes les heures. C'est un mariage parfait d'éléments qui garantissent un coup de foudre pour cet adorable café. J'y suis allée en un beau dimanche après-midi, et c'est un vrai paradis pour relaxer avec un bon bouquin, écrasé sur l'un des vieux divans. J'aurais pu y passer des heures mais j'avais d'autres plans pour ma journée. La nourriture est délicieuse et faite maison donc c'est une bonne place pour un repas qui est à la fois santé et copieux. L'éclairage est un peu sombre donc selon la journée, vous préférerez peut-être allez ailleurs, mais pour s'enfermer quand il fait froid, c'est idéal. Le Dep est définitivement un nouveau coup de coeur!"}
{"text":"My friend and I had been out and about wandering in Montreal for what felt like hours and desperately needed a coffee. There were people milling around outside and so we decided to pop in and am I ever glad we did.   The place reminded me of a cafe that used to exist in Vancouver called Rhizome and instantly I felt at home. There are a few tables to sit at, or a couple couches and the best part was when we got there there was an open mic and someone playing live music.   We ordered coffee and sat for a while to enjoy the music.  The guy working was super lovely and made some delicious coffee for us."}
{"text":"Sympathique mais souvent très très long à servir. Autour de 30 mn pour des grilled cheese et des crêpes."}
