{"text":"One of my favorite cafes in Montreal.  The staff here are sociable, friendly, and fun to converse with.  It's always great seeing them around after coming here for a while.  Only real downside is that the fly situation here is out of control.  What in the world, it's like that horror film scene when the insects start gathering to kill and their sheer numbers block out the sun!"}
{"text":"This place is the worst. We came in to get two coffees and croissants before our trip back to NYC. The barista told us there's no filter coffee left so she would make us lattes. At first we thought: how nice. But it turned out she was also charging us for two lattes without even asking if this was ok. In the end, we were charged $26 for two lattes and 2 small pastries. When we asked why the bill was so high, we were treated like stupid Americans. Very rude staff, unprofessional and flustered. I visit Montreal quite a lot and usually love their coffee scene, but will never come here again."}
{"text":"I had heard rave reviews about Neve, so I decided to check it out. I'm a bit of a chai latte fiend, so I was super happy to see that the barista used the actual spice mix for my latte. Yum.  The place itself is not pretentious, but I feel that the crowd can be. I overheard an obnoxiously loud conversation about what the word \"artist\" embodies and how the person didn't like what the word stood for. Pretty heavy conversation.   Would I come again? maaaaaybe"}
{"text":"Love this cafe! It has a low-key, unpretentious vibe (which I will always prefer in a cafe). Lots of places to sit and talk, read a book, or work on your computer. The space is simple and inviting- everything from the floors to the walls look a bit aged, but in a cozy, rustic way.  We ordered a pot of jasmine tea with a large chocolate chip cookie. The tea was served in a very beautiful iron pot with small white tea cups. The chocolate chip cookie was absolutely delicious- it seemed freshly baked and the chocolate chips were huge and still gooey.  Would definitely recommend as a place to do work, hang out with friends, or sit quietly with a good book."}
{"text":"This place is way too crowded, which is not their fault, but it is cramped due to the arrangement of furniture, which is something they could do better. So, it's not very cozy, but is is still worth coming here to stay for a while.  The tea is much better than I expected and reasonably priced. The fresh trays of cookies are expensive, but it's nice they have something tasty to eat."}
{"text":"Based on some other Yelp reviews my wife and I decided to visit this place to get some work done. We were on our honeymoon, but a job opportunity had opened up at work, and I need to get a resume and writing sample submitted.  My wife is really sensitive to caffeine, so we ordered her a decaf Americano, and I drink coffee like a maniac, so I ordered a Cappuccino. I used to live in Seattle, where I was introduced to delicious coffee, and since then I've been an absolute pretentious snob.  My wife loved her Americano. She said it was rich and hardly had that stale decaf taste. My Cappuccino was amazing! It was rich, sweet, perfectly balanced between wet and dry, and the heart-shaped latte art was really impressive. You could tell that time and focus was put into making the coffee, and it made it all the more enjoyable.  The one issue we had was that there were no available outlets, because the place was packed, so we couldn't charge my computer. This meant we had to leave earlier then we would have liked. I think, had we come during winter break from the local colleges, we would have had an easier time, but c'est la vie."}
{"text":"Café Névé is one of the best cafés in the Plateau.  The espresso is delicious, the baked goods are of insurpassable quality, and the sandwiches are both wholesome and appetising.  The ambiance is one where fervent conversation and tranquil (or not) individual work coexist.  The one issue with Névé is their wifi access.  They seem to be using a low-quality router/gateway (likely one meant for use in a home).  The consistent deterioration-then-total-failure pattern of the connection today was indicative of flooded NAT tables from the underpowered router not being able to handle people using P2P file-sharing (e.g., bittorrent).  Further, the lack of being able to log on suggested DHCP saturation, for which there's little excuse when we're dealing with private IP addresses.  A higher-quality router, or maybe even some QoS policies on the router to limit torrent/P2P traffic, would go a long way."}
{"text":"Chouette endroit pas loin de la station Mont-Royal. Le café est très bon et le latte a un vrai goût de café latte sans être noyé dans le lait. Il y a des tables pour s'asseoir et travailler, mais l'espace étant petit, vous n'aurez peut-être pas la chance de pouvoir en profiter.  Il y a le WiFi et une petite bibliothèque sympa (avec Harry Potter!).  N'habitant pas loin, j'y passe assez souvent et cet endroit me manquera beaucoup quand je partirai!"}
{"text":"Yes, I can confirm everything the previous authors have written. I came here on a te basis of previous Yelp reviews and I can say I LOVE IT! Great coffee, insanely good cookies and super cool atmos. It's true, at the moment it's full of hipsters on their macs but I got a seat very quickly. Will be back for sure."}
{"text":"Lecker Kaffee und Tee. Freundliches und aufmerksames Personal. Schöner Platz zum Verweilen mit schnellem stabilem WLAN."}
{"text":"Barista asked me if I was only having a cookie as if that was below par to warrant a seat.  Later,  I casually asked to have salad from a seated position and was refused.  \"Go to the counter and order\". No please no niceties.   And not progressive by any stretch."}
{"text":"The coffee is good. The food is good. The service sucks. Their employees are always talking between themselves and don't seem able to smile at their customers. I still go from time to time because I like their lattes, and every time I wish there was a smiley, friendly person behind the counter, which is never the case."}
{"text":"Neve, you little snowflake in the heart of the plateau.   You make a sweet a** americano, and freekin awesomely fresh baked scones and yogurt granola cups.   Unfortunately I've never had a chance to chill in your log cabin/ hipster den, because you're always jammed with students.    Has anyone else noticed the decor matches their amazing blends of Metropolis coffee? those be some good beans!"}
{"text":"Terrible coffee and latte. Cold service. Bad decor and terrible seating. Over priced. I let a fly have the rest of my latte. Strangely enough, it didn't keel over.  If you are not a hipster and you  like great and expert made milk based drinks that are cheap and served by a friendly staff, then go to cafe olympico.  It makes me sad knowing that some people live their lives never tasting a great latte.  If you are a hipster, this place is perfect for you.."}
{"text":"The best place on the Plateau...to get robbed and to be badly served! 3 bucks for one sip of coffee latte and the service to match! Too bad, the decor is attractive!"}
{"text":"Their matcha lattes are really good and you must try their decadent cookies! Probably the best I've ever had :)"}
{"text":"If I lived in Montreal I'd spend unhealthy amounts of time at this café. I'm a latte fiend and this was one of the best I've had. They use 49th Parallel beans, but somehow manage to make them taste better than Crema in Toronto. Maybe it just tastes better because I'm in Montreal, where I get all giggly when a fuzzy Gen Xer with a Scrabble-tile pin says \"Salut,\" I feel the urge to wear giant scarves and pet random dogs, and everything I do is to the soundtrack of \"Laisse Tomber Les Filles\" by France Gall. Just me? Okay. This cafe has some of my favorite things: off-the-main drag location, chill neighborhood vibe, good selection of baked goods, salami panini, smooth lattes with a double shot, and - bonus! - a brunch menu. Would be perfect if it were transplanted to Toronto, tattooed French-speaking staff and all."}
{"text":"Best latte in town, but that is my personal opinion. It's complex and just rocks my taste buds! They have good beans including some from Iron Pig in Toronto. Brewed coffee leaves to be desired, that's where they lose a star. Food is ok cookies are great!"}
{"text":"2 thumbs way up for the latte and the cinnamon scones. The chewy chocolate chip cookie that I took to go, really hit the spot later that night."}
{"text":"Cute tiny coffee shop, a bit on the expensive side. I don't drink dairy milk and paid over $6 for a small almond milk latte, which I won't repeat. I've had a few espressi there since ($3 for a double) which were fine but not amazing.  There is one long community table, that's all. I like the concept in theory, but in the end gravitate more towards coffee shops where I can find a cozy armchair or a corner to myself."}
{"text":"I just come for the donuts stuffed with custard.  Amazing!  It depends when you go because there might not be any left when you get there.  Really awesome espresso as well.  Laid back atmosphere.  It would be a good place to chill on a Saturday or Sunday morning with the paper."}
{"text":"Busy, lively cafe.  A hipster haven with friendly employees and cheerful atmosphere.  However the food is quite mediocre and flavorless.  The coffee is sour and unappetizing.  The ambience comes from the interesting people who frequent and work there, but in a neighborhood filled with amazing patisseries and affordable Portuguese restaurants the food simply doesn't compare.  It's a little island of Toronto in the middle of the Plateau, for better or worse."}
{"text":"Ordered the machiatto today. Shot was extremely sour and under extracted. Cafe ambience was nice and hip. By the way, the fruit juices are not fresh squeezed. Instead, it comes in a plastic Oasis branded bottle."}
{"text":"Best chocolate chip cookies! Coffee was good and also looks like a great place to get some work done."}
{"text":"Great lattes. Nice little terrace sitting area for the warmers months."}
{"text":"Yummie.  Self and boyfriend enjoyed Cappuccino Caffè Macchiato - really good coffee and nice presentation. Also on offer were the same or similar delicious chocolate chip cookies also on offer in Cafe Neve. Same owners?  Worth a visit - like the industrial interior.   Its a small and quaint coffee stop."}
{"text":"**** wow wow wow **** Cafe Neve completely lives upto all those great yelp reviews.  Visited several times during a recent visit to Montreal .... Mostly due to being stranded in a fab city thanks to hurricane sandy. Tried Americano, espresso, cappuccino and moccachino.   Can I mention the peanut butter and chocolate cookies. OMG to die for. Kept thinking a moment on the lips a lifetime on the hips but hey no way was I not enjoying every delicious bite.   Very busy even late at night but you'll always snag a seat when the hipster crowd tighten up a little in the seating area.   Very pleasant staff.  Highly recommend you put on your places to visit when in Montreal."}
{"text":"Note: This is a more sour blend of coffee like what is served at Neve and Myriad. If you like that type of coffe you will like this. If you prefer a more nutty type of coffee (think Vielle Europe, Cafe Italia, Cafe Olympico) then you will not be impressed. Expensive.   Delicious cookies ($3 and face sized- like maybe 500+ calories).  Nice staff.   Hipster young people on laptops. Limited seating. No lunch fare."}
{"text":"decent coffee.  large cookies. busy study environment.  hip."}
{"text":"Great strong iced lattes made with love by talented local musicians.    the first time I went, I got a bit buzzed from the latte. I had not realized its strength.  I could understand why someone might choose decaf.  great flavour,  but not a fan of the coffee jitters.    Went again yesterday and ordered the smoked salmon on a bagel with cream cheese, capers, red onion and spinach and though it didn't look very fresh, it was. It tasted incredible.  Had another iced latte, but didn't get buzzed this time.  the food / coffee combo was a win!    I also can't help but get the chocolate chunk cookie everytime i go.  very sweet."}
{"text":"Coffee: 5 stars Ambiance: 3 stars Service: 3 starts Food: don't know  There are few spots on the Plateau that have coffee this good. In fact, I usually have to trek up to Mile-End to find something comparable.  The beans/grinds they're using are really something else: bold, full bodied, and very well-suited for holding their own in lattes, cappuccinos, and mochas. In fact, I usually drink black coffee or straight espressos, but I make an exception here. I'd recommend trying the mocha; it's particularly exquisite.  The service, however, tends to be kind of aloof and slow. For what it's worth, though, these baristas seem to *really* know what they're doing.  As for ambiance, it tends to be loud, brightly lit, with awkward seating. In fact, it's very difficult to get a table, and in more than a year of living around the corner, I've never been able to nab one.  I will admit, though, that I rarely walk by without popping in to get a coffee."}
{"text":"Juste en bas du Mont-Royal, au coin des rues Rachel et de Bulion, la toute petite porte vitrée du café Névé ouvre sur un grand local offrant un concentré de hipsterness des plus courus à Montréal. Le café Névé est encore tout jeune mais son mobilier usé ne fait pas dans la frime; l'endroit est fréquenté en quasi permanence, oscillant entre le plein et l'archi plein. Ses comptoirs et tables sont occupés par les coudes d'étudiants de l'Université McGill, pour la plupart, ou de jeunes zazous vaquants en sandales sur les trottoirs du plateau les fins de semaines ensoleillées.  C'est un bon endroit pour y boire un café qui s'y trouve excellent et bien tassé, travailler sur ses travaux, se faire chatouiller les oreilles par l'anglais qui y est ambiant, ou en français également, ou encore sans plus prendre une bonne bouffée d'air frais de jeunesse. Si vous avez faim, on y sert en plus quelques bons paninis à essayer!  Bonus : -Musique indie; -Le service en français est sans problème ni commentaire; -On y sert le café Pig Iron; -Sur la table du fond, on retrouve une antiquité, une vieille fournaise personnelle, pour les froides journées d'hiver!; -parfois, on aime le bleu pourdre... plaisir coupable.  Malus : -les prises de courant pour votre portable ne manque pas, mais les places peuvent souvent manquer; -Les employés, toutefois sympathiques, ont parfois l'air dans leur bulle (où les clients ne sont pas), mais le caractère indépendant fait lui-même tout à fait hipster, vous ne trouvez pas? Donc plutôt s'en foutre et profiter du bon café est une bonne stratégie.  Passez voir le frère cadet du café Névé sur l'avenue Mont-Royal, le tout menu café Flocon! Définitivement héritier du même style.  Accès : Amis cyclistes, la piste cyclable Rachel passe juste devant la porte. Le métro Mont-Royal est votre station la plus proche. Le stationnement est un peu plus difficile aux heures d'achalandage, mais c'est possible de trouver des espaces dans les rues suivant l'axe nord-sud."}
{"text":"My favorite coffee spot in Montreal.    I'm a big enough man to admit that I am a huge fan of a sweet flavored cafe mochas.  Most places in Montreal use unsweetened chocolate flavoring or cacao and I must either add my own sugar or drink a bitter mocha.  Not here, Café Névé has come to my rescue.  Along with the best mochas in town, Café Névé also offers a variety of sandwiches, cookies and delicious baked goods.  I'm a big fan of their spicy Southwest jalapeno & corn scones and warm, moist cinnamon rolls.  The place is usually packed with the hipster crowd camped out with their laptops, so it can be tough to find a spot sit down sometimes.  If you don't like their food options, you can always grab a coffee and head across the street to Romado's for some chicken."}
{"text":"Love the cold brew/iced drinks I've had, can't speak to their hot drinks. They also have some decent options as far as buying coffee beans goes, including their own and some other roasters.   The best part is probably not the coffee, but the ridiculously huge cookies (I buy beans here as an excuse to get them). My favorite is the salted caramel macadamia, though it's not meant for people who don't love sugar."}
{"text":"The newest addition to the Névé empire, the downtown Café Névé is located in a space shared with a recently-opened Frank & Oak retail store.   Fair warning, this isn't like the other Névés around Montreal. There is only a coffee bar on the main floor, so no seating. This location is suited more for grabbing a cup to go as you exit Peel metro, or after checking out the rest of the retail space.   The fare is what you'd expect to find at a Névé - think coffee from Pig Iron and baked goods. Nothing to really write home about, especially if you've been to their other locations that offer more - sandwiches, for instance. And seating.  Hopefully they'll offer more as time passes, as they just opened. So far, this new Névé is a nice alternative to the nearby Humble Lion and Melk, which tend to have lineups during peak hours."}
{"text":"Bad service, didnt take our order while waiting and started with a new customer although i was there first"}
{"text":"It's a nice coffee shop. Cute for meeting friends, etc. The lemonade was only ok but the mocha was great."}
{"text":"Un autre excellent latte sur Rachel tout près de  St.-Laurent dans le plateaux. Embiance vintage"}
{"text":"One of my top 10 favourite cafés in Montreal!  espresso and latté are amazing given the fresh light-to-medium roast they use.   The sandwiches are original and delicious!   The brunch is also a must try!!!   Recommend this place 100%   Not a very cozy place but ambiance is completely worth it !!"}
{"text":"Biscuit maison excellent et thé de très bonne qualité! Ambiance assez hipster et musique d'ambiance \"chill\"."}
{"text":"I don't know what's going on with their choice of blend, but espressos, lattés and americanos all taste bland and watered down"}
{"text":"Très bons breuvages et meilleurs biscuits au monde! Belle déco & ambiance décontractée. Par contre, il manque souvent de places pour s'asseoir... Wifi gratuit!"}
{"text":"My husband and I just moved  from NYC to Montreal. We love coffee and this was one of the first places we came for coffee in Montreal. I am very happy to say Cafe Neve is  a cool spot, with friendly service and good coffee!  :)"}
{"text":"Always love stopping in at Neve for a quick cookies & latte. It's become more of a studying/working hotspot among locals, but it's also a fun place to crash on he couches and catch up with friends.   Their lattes are stupendously delicious and the perfect side to a fresh baked cookie. Make sure to ask the staff to notify you when the cookies come out of the oven, nothing beats warm chocolate chips melting in your mouth.   I've always found the staff friendly and have often come here with my kids. Needless to say they are fans too!"}
{"text":"Cool little place. Tasty espresso. If it's on a Saturday or Sunday and you're working they will ask you to work at the large table. Cool set up none the less."}
{"text":"Have stopped in a few times for a latte, so I feel confident in saying they provide consistently excellent coffee. Pastries are no slouch, either."}
{"text":"Very good coffee here on Mont-Royal. Folks are really nice and take pride in the product. Miles better than nearby pretenders. Very small (cramped) with communal tables (and power, so bring a portable powerstrip with your laptop to make friends).  Rating Scale: 1 Star: Avoid the town in which this place is located just to be safe.   2 Star: With so many great places to choose from, why risk this one? 3 Star: I'll try it again or consume here in a pinch. 4 Star: I go here regularly if financially and/or calorically feasible. 5 Star: I look forward to taking my wife or friends here."}
{"text":"On a sunny winter afternoon, Café Névé is filled with 20-somethings wearing big glasses and Canada Goose coats, tap-tap-tapping away on their laptops and cellphones.  I was looking for a sunny spot to relax with my knitting and a good cuppa joe, and, following the recommendations of other Yelpers and the book Dévorer Montréal, I headed on over.  The soup (apple-ginger-fennel) was quite tasty and homemade. The café filtre and giant cookie were fine, but nothing special. (I am a good baker and can make better at home). They did have soy milk for coffee and a dairy-free soup option, merci beaucoup, much appreciated.  It cost a little more than I was expecting to pay versus other coffee/lunch spots in the Plateau. All the students on laptops had little cast-iron pots of tea which they kept getting topped up with hot water -- that might be the best strategy for an affordable \"coffee shop office.\"   For me, Café Névé was too loud and too dark. The layout is kind of like a tunnel, with a nice southwest-facing window by the door, but long windowless walls leading into the café. The tiny pot lights didn't do enough to counteract the lack of natural light. Probably fine for working on a laptop but not adequate for seeing my knitting or for reading a book.  With the abundance of other choices in the area, I'd probably go somewhere else next time. Sorry, authors of Dévorer Montréal, this isn't among my coups de coeur."}
{"text":"Good space, fair price, friendly staff. They have several branches so you can get the experience easier. Music might be a bit loud, but who knows, you might like it ;)"}
{"text":"If you like busy, bustlin' third wave coffee shops then you'll love the energy at Névé. This place is always packed which is always a really good sign BUT a pain if you're looking to stay.. It might be a wait to sit at a table.  The coffee is good which also helps ;) As for other edibles, I've never tried anything other than their chocolate chip cookies which are both pleasing to the eyes as they are to my taste buds."}
{"text":"Horrible service from this downtown location inside Frank&Oak. I came around 4.45PM because Yelp said they were open till 6PM but they were closing at 5PM. This happens sometimes and it's all good but the barista didn't bother to inform me that she closed her bar. I asked for tuna sandwich and she seemed very annoyed at my request. She said she couldn't grill my and sandwich so I said ok I'll take it cold. I thought their grill was broken or something, still had no idea they were closed. She took a really long time to cut my sandwich and pack it into a brown bag. Then I asked for a latte and she seemed further annoyed, letting out a sigh and rolling her eyes. While filling up her portafilter, she informs me that \"everything is already closed!\" And I'm like omg so sorry, felt bad that she had to redo everything but seriously if only she had informed me earlier, I wouldn't have ordered in the first place. She was also pretty aggressive when I wanted to pay debit, overlooking that only take cash. Also, assuming she had already cleaned and closed the bar, she should have thrown out the first espresso after opening because there are chances of it containing residues of the cleaning agent but she went ahead and served it to me anyway. The portafilter cleaning brush fell on the ground while she was closing the bar again she just went ahead and used t to clean the machine anyway instead of washing it first. I was already having a lousy day and came here for a good cup of coffee but had to deal with a barista guilt tripping me for ordering. The coffee was great but not worth all of this. She was also unhappy with my $2 tip on my $11.50 meal. Probably not coming here anytime soon since there are so many other options nearby (Melk, Myriade, Humble Lion)"}
{"text":"Wow!!! This place had some killer coffee! I think I sucked mine down in 3 drinks and still wanted more! It's a small quaint place with friendly baristas. It was a bit of a walk from where I was staying but well worth it!!! If you're into thick creamy lattes and great flavor then This is the place for you!"}
{"text":"Rain, shine or snow, this place is a hidden treasure on Mont-Royal street. Whether you are on the go or are looking for a pit stop to satisfy your urge for an espresso shot, a flavorful macchiato, simple cortado or a rich latté I strongly recommend you to make it a point to drop in.   All brews include a double shot of expresso and usually you'll have a good choice of beans between special roasts from Anchored Coffee (Darthmouth, NS), Cut Coffee (Toronto, ON) or Pig Iron (Mississauga, ON). The viennoiseries come from its headquarters at Café Nevé; worth mentioning are the freshly baked the ham and cheese scones which hit the spot for a quick breakfast or afternoon snack.   Service from the baristas is impeccable, genuinely friendly and fast! It really shows when you love your craft and take something simple as roasted beans and transform it a delicious cup of joy!  The only drawback is the lack of space, with around 12-16 seats, depending on the time of the day or day of the week, it could get crowded quick. My recommendation is either to order your favorite cup to go or sneak in on early Saturday/Sunday morning for some \"me-time\" to catch up on emails and news.  When asked why people keep on coming back, the coffee barista tell me it's because of the experience and the ambiance. I guess he's right!"}
{"text":"The Allongé coffee I had there is the WORST I have had in Montréal!  I threw it away after a few sips. Maybe they have not cleaned the espresso machine lately, who knows. Also, $3 for an allongé?   The cook also wiped a dinner plate with his T-shirt, in full view of customers.  On the upside,  great ambience, super cool patrons and nice looking pastries... Perhaps just bring your own coffee?"}
{"text":"On y va pour travailler (bien qu'assez bruyant), lire le journal ou boire son latte. L'endroit propose un menu somme toute complet, du matin jusqu'au soir, préparé derrière le comptoir par les employés qui sont à la fois caissier, barista et cuisinier.   J'ai essayé le Focaccia Matinale avec deux oeufs pochés, suisse, pesto, roquette et bacon, très satisfaisant."}
{"text":"Apparently good java is hard to get in Montreal so a search led to this spot. The setup is unassuming and seems like a hideout for students and people who can somehow work in a noisy environment.  WiFi seems to be a min draw here as saw a lot of people just sitting there and browsing the internet. I ordered a cappuccino and got a scone to boot as well. Scone was decent. Here is the verdict for the cappuccino Espresso: Strong Crema': good Milk frothing: good Latte Art: decent The drink is a traditional size but is quite good.  3.5 stars."}
{"text":"Unassuming cafés are a dime a dozen in Montreal.  Walk a block there's one; walk one more, there's another.  But Café Névé did something right to catch my sister's attention.  She's a brisk, focussed walk-er.  Only she knows how or why she spotted it.  Névé is cute, unpretentious and communal.  The only cringe factor came from the hipsters behind the counter.  A little too much-ster.    The coffee was good.  And while I prefer a cappuccino in the afternoon it was a little too pricey for me.  For me, the focus shouldn't be on the coffee anyway.  Névé serves happiness on a sheet pan - cookies and other baked goods.  A simple pan on the counter, next to the register.    I looked at the pan and the chocolate chip cookie whispered, 'eat me', which probably means I'm stressed out about something.  I don't ever crave sugar or hear voices unless I have a lot going on.  So I get the cookie.  Two hours later while waiting for dinner reservations, I took a bite of the cookie and I swear I nearly lost my mind.  It was one of the BEST chocolate chip cookies I have ever had.  EVER.  My enthusiasm for this cookie is off-the-charts.  It was sweet (but not painfully).  It had the nicest burnt caramel like crust on the edges and a soft, chewy (but totally cooked) centre.  The cookie is that f*cking amazing."}
{"text":"Le café latté et le panini que j'ai commandé étaient excellents, le service est amical et rapide. Seul bémol, il y a beaucoup de clients et avoir une conversation privée peut être difficile étant donné la proximité de ses voisins de table!"}
{"text":"My favourite Cafe Neve location, right in the heart of downtown inside of Frank and Oak. Perfect to grab on the go or to sit and relax/shop."}
{"text":"Great lattes, great service and a great atmosphere. Keep up the good work.   The cookies are to die for."}
{"text":"?????????????????????????? ????????????????????????????4???5???????????? ??????????????????? https://www.youtube.com/watch?v=XMCNhgBu0EM ??????????????????????? ????????????????????????? ??????????????????????????"}
{"text":"Névé is one of my favourit cafés in Montréal. I love the coffee there, friendly staffs and good music make the café even more comfortable. https://www.youtube.com/watch?v=XMCNhgBu0EM I recorded a video from an outside seat of the café, and added music on it. The video captures the peaceful atmosphere of the café, you can enjoy the slow time there."}
{"text":"The cookies. OH, THE COOKIES. I've changed apartments at least five times in Montreal, subconsciously moving closer and closer to Café Névé, I think. Now I'm right across the street, and can run out in all hours of the day to satisfy my craving for the best cookie in the city. I know that's a grandiose claim, but I'm not even exaggerating.   The atmosphere is warm and buzzing, the baristas friendly, albeit occasionally coolly detached in their barista way, and the food is very reasonably priced and always satisfying.   The coffee is wonderful. Seriously though, have a cookie."}
{"text":"I came in needing a good wake-me-up coffee, so I ordered a cortado. Perfect. Deep rich complex flavour. I don't know the roast/beans, but it was just right. Not bitter or over-extracted; just full of delicious caffeine goodness.   Great ambiance. I had a pastry (excellent), but when I saw the croque monsieur another patron ordered, I wondered if I had made a mistake--it looked superb.   Free wifi too.   Life is good at Cafe Neve."}
{"text":"A regular spot for me when I am in Montreal, have had awesome mocha there. It does get crowded though"}
{"text":"Ridiculously good and giant chocolate chip and oatmeal raisin cookies. The coffee was only so-so. Chill vibe."}
{"text":"One of the best cortados I've had in Montreal. Great ambiance, interesting newspaper and magazines, friendly staff. I did not try any of the food items this time, but the scones looked yummy."}
{"text":"Hipster, crowded, and very humid (in winter at least). The lattes I've had at Café Névé have always tasted authentic and on-par with indy cafés in Montréal. It's also right next to Romados. The price is right, and they take credit. I wish they could offer a free drink with the purchase of a bag of beans though, like some other cafés do."}
{"text":"I stopped by here to get some work done. I spent a couple of hours here and was pleased with the crowd and setting. The atmosphere is awesome. The cappuccino was good, but it was very small (like three drinks small)."}
{"text":"Location: In the the heart of the Plateau. Since I'm a big-time walker, I don't pay much attention to subway stops other than the ones I frequently use so... from my POV, Mont-Royal is likely the closest, then you've got a quick 5-10 minute trek. Street parking is available but like finding a needle in a haystack in this neighbourhood.   The place: I LOVED the space. I don't know why, but it reminded me of a local coffee shop or general store in Maine. It's got a warm and cozy feel to it, with wood accents and pops of blue, and a pretty large counter where you place your order. They have a small array of sweets on offer, and two types of beans if I recall - Anchored and Cut. Maybe I lucked out, but the place was not infested with a large proportion of hipsters when I went, and that pleased me immensely.   The goods: I had a Cortado and really enjoyed it. It was a little more bitter than I normally like but this did not affect my enjoyment whatsoever. Tasty!  Though I didn't order anything to eat, I did pick at my friend's chocolate chip cookie and thought I might just die from sheer ecstasy and the foodgasm happening in my mouth. I don't know who makes these for Nevé but I need their number. That said, I don't think I could eat an entire cookie because they are gigantic. And chocolatey. And like, gooey. Yum.  Service: Good. The guy at the cash was friendly!  Price point: I think my Cortado was $3, so on par with most places."}
{"text":"À mon avis le meilleur latté de Montréal. Pas beaucoup d'espace sur place et souvent plein dans les périodes de pointe, mais pour les amateurs de café, c'est un must!"}
{"text":"My fellow yelpers weren't kidding about the cookies. Yowza. Very good, but very rich. I took me two days to work my way through mine. Definitely a lot of people camped out with laptops here, but it's a great spot, so I can't blame them. I came by a few times during my time in Montreal, and enjoyed my coffee in a sunny spot by the window. I like that their coffee is locally roasted, but it didn't blow my mind or anything. Very solid choice, and I would return, but it just missed the 5 star bar."}
{"text":"Delicious house made peanut butter chip cookies, especially fresh out of the oven.  Super friendly staff.  Busy on a late Friday afternoon, but not overflowing.  Tea is good, mostly $3, a few at 4. Served on a platter with cup, small teabag dish, and a heavy, black metal tea-pot.  Coffees range from 2 (filtered) to 3-4 (espresso-based) with artfully made designs.  Two comfy couches near the entrance, single washroom near the back, bench/picnic table seating in back, two/four tables everywhere else.  Max capacity around 30."}
{"text":"I came by car from the US for a short stay. We went jogging in Mt. Royal park and on our way back to the hotel stopped for a cup of coffee but realized that we forgot our credit card at the hotel. Surprisingly the guy at the cashier wasn't in the mood to trust us to pay him back later on (with a nice tip), like we did in the Cafe near by who were more willing to trust strangers."}
{"text":"Very cute café, the kind the Plateau is famous for. We stopped by after a trip to Au Kouign Amann and grabbed an ice coffee.  The inside was cozy, with nice seats and plenty of wooden tables. Many customers were working on their computers or reading. Probably a great place to avoid procrastination!   Unfortunately, the ice coffee was too diluted. Too bad, because the flavor was otherwise great!"}
{"text":"Cozy, friendly, perfect noise level to work.  Delicious pain perdu!! Moist inside, flakey outside."}
{"text":"I stopped in here after having a so-so experience at the hip coffee joint across the street (a block down). I wanted better coffee.   And Cafe Neve hit the spot. Great service, amazing cappuccino. Comfy couches. Was glad I found this gem."}
{"text":"Minuscule café parfait pour un petit drink réconfortant pour la route. Mon chai était bon et j'y retournerai assurément!"}
{"text":"Nice spot,  with good coffee.  It's not a cheap cup o'joe but it is good.  The space is small and narrow with a long table running through and the Batista counter is at the end.  It's not noisy and a conversation with a person across from you could be done easily.  I don't think it's good for groups,  since it would be hard to get a bunch of empty seats together,  but if you are 2-3 people you might get by, and it's definitely good if you're there on your own with your laptop or reading material. It's steps away from the metro,  and in my case close to home,  so definetly a spot worth returning to."}
{"text":"Was lucky enough to have this cafe down the street from where we stayed. Besides the good coffee, their service is exceptional: friendly baristas + good coffee + cozy atmosphere = 5 stars"}
{"text":"Great coffee, and the best chocolate chip cookie in the city. Cool hangout - relaxed, hip, young, but not terribly noisy - so quite the pleasant spot. I want to try their mont-royal location too!"}
{"text":"Neve is awesome, Coeur de Pirate is awesome. Maybe that's why I see her there, try the London Fog."}
{"text":"Oh man I feel like such a sucker. I really didn't want to like this place and it has sucked me in. I walked past this place one day late at night when it was closed and looking sad and dark with all the lights off except the one from the fridge display. And the sandwiches were still in the cabinet. At this moment I promised myself I was never getting a sandwich from this place. ever. Fast forward one month to this monday, I decided to find a cafe where I could take my laptop and do some study in peace. The overwhelming opinion on Yelp was that Neve was the place for this so next thing I find myself in Neve, on my laptop eating one of their sandwiches... This place has a cool vibe and the sandwiches are O-K and the coffee and cookies are a cut above. But if you want to come to Neve be willing to work for it. Be willing to turn up at 1 o'clock as I did and have all the tables taken, and be willing to share couches and bench space with strangers just to get a place. Because if you're not willing, there will be others who are.  The people who work here are really cool too, enough so that I hesitated in writing this review as I don't want them to be angry at me that I outed them about the sandwiches."}
{"text":"Petit café sur l'avenue Mont Royal proche du métro, il ya une dizaine de places assises. Le café latte au lait d'amande est bon. L'ambiance est sympa, un endroit sans prétention comme je les aime!"}
{"text":"This cafe is small and could be easy to miss while walking along Avenue du Mont-Royal. This is a sweet find. The coffee is made just right & it's local. The interior is modern & rustic, with a long table situated right down the middle of the space. A nice place to commune over coffee with others or have a solitary experience."}
{"text":"Ok I realise I'm not a \"regular\" nor am I a student packing a laptop to tweet and FB all day; but for the staff to pretend I'm just not there ain't cool! Serving stale crappy coffee with plenty of bad attitude ain't cool either! Will avoid this place at all costs in future, will not recommend it to anyone either."}
{"text":"Probably got the same barista as the other reviewer. Very rude. I was the only client on a quiet Monday afternoon. Lots of channeling on her espresso which would not have bothered me if the service was decent."}
{"text":"My first check in abroad! My boyfriend and I came here to work because of the free wifi.  The lattes were delicious and the food is also really good.  My boyfriend got a grilled cheese sandwich and I got something that had spicy dark chicken in it. I really enjoyed it.  There is one unisex bathroom near the large table. Also, there were loads of little tables for people to sit at and one giant one towards the back for larger groups.  The only thing I had an issue with is the large table only had 2 outlets for the entire table. Everything else about the cafe was good."}
{"text":"Névé, névé... Ont-ils vraiment encore besoin de présentation? Le Névé, je leur dois mon amour du café. Leur succursale sur Rachel est le premier endroit où je me suis arrêtée lorsque j'ai déménagée à Montréal et que j'ai eu envie d'assouvir ma soif de caféine. Le Névé a fait connaître à mes lèvres le doux velour d'un cappucino parfait, et les arômes finement balancées d'un café préparé avec passion et minutie. Depuis, ils ont ouvert plusieurs succursales, et leur petite dernière se situe sur Stanley en plein cur du centre-ville.   Je passais justement dans le coin récemment, et il ne m'en fallu pas moins pour aller me chercher un cappucino. Je peux donc vous confirmer en toute certitude que l'amour y est toujours; la même délicatesse qu'aux premiers jours, les baristas toujours aussi charmeurs, et on y propose évidemment leurs fameux biscuits aux pépites de chocolats (les meilleurs de Montréal, indiscutablement!), douilet réconfort pour oublier le froid qui s'installe sur Montréal. Névé, je t'aime d'amour!"}
{"text":"Tenu par les mêmes proprio que le café Névé, la qualité de leur produits est donc identique: De merveilleux cafés et thés (chauds ou froids) et des biscuits à mourir. C'est petit, on se trouve chanceux lorsqu'il y a une table de disponible pour se prélasser avec sa tasse, mais sinon c'est le parfait pick-up coffee shop pour quand on a besoin d'un bon café, vite!"}
{"text":"Après avoir lu et entendu tant d'éloges à propos de leur café, je me suis dit que cette journée froide de printemps était parfaite pour aller faire ma première visite au Café Névé. Verdict? Tout est charmant à souhait. Pour commencer, la place est tintée d'un joli bleu vintage, c'est mignon et ça donne de gout de rester a l'intérieur pour relaxer même s'il y a du soleil dehors. Ensuite quand on arrive au comptoir, on se fait accueillir par une équipe bien détendu et souriante. Je commande un cappucino et le foccacia avec oeufs pochés, bacon pesto et aragula. La première gorgée combla toutes mes attentes; une succession d'arômes de caramel et d'agrumes, c'est le genre de café qui nous fait encore plus réaliser que celui du Tim Horton ne mérite pas l'appellation de \"café\" (pas que jen doutais avant, mais je comprends tout simplement pas tous ces gens qui ne jure que par le Tim; GUYS, SORTEZ DE CHEZ VOUS, LE CAFÉ DU TIM C'EST QUE DE L'EAU CHAUDE SALÉE ! Mais je m'éloigne du sujet, continuons.). L'assiette de foccacia arrive quelques instants plus tard, et qu'on ne se laisse pas berner par la description simple du repas; ce fut encore une fois une explosion de saveurs. Oeufs parfaitement cuits, savoureux pesto et bacon cuit a la perfection sur un foccacia bien frais ont constitués un mélange de saveurs parfait. Et le plus beau dans tout ça est que je ne me sentis pas sur le bord d'exploser après avoir fini mon assiette (c'est rare, croyez moi), mon appétit avait été comblé avec succès.   J'avais envie de rester encore un peu pour faire des travaux scolaire, je finis donc de siroter mon cappucino tranquille en me laissant bercer par l'excellente musique indie jouée en background, agrémentée de temps à autre par le son du grinder à café. Puis, une délicieuse odeur de beurre vint me distraire: une nouvelle plaque de biscuits aux brisures de chocolats venait de sortir du four. Je me laissa tenter, et pris un americano du même coup. Je vous jure que ce biscuit est le meilleur que j'ai mangé depuis que jai commencé mon exploration de Montréal, et il va être dur à battre. Comme ceux qu'on nous servait à la cafétéria de nos écoles secondaires, mais encore plus frais, tendre et savoureux, un goût de beurre bien présent mais pas imposant (sauf quand on arrive au centre du biscuits; l'extase) et des gros morceaux de chocolat juste un peu fondant, vous voyez le genre. Et l'americano était excellent lui aussi, comme de fait.  En gros, si vous cherchez un beau café où relaxer tranquille un après-midi, le Café Névé est l'endroit tout indiqué. On vous servira du bon café et de la bonne bouffe si vous avez un petit (ou un gros) creux. La prochaine fois j'essaierai le Café Flocon, beaucoup plus proche de chez moi et tenu par les mêmes proprio; on dit que c'est plus petit, donc moins propice pour y trainer durant des heures, mais tant que ça me fait un spot a proximité pour avoir du bien café je dis pas non! :)"}
{"text":"I've been coming here everyday for the past two weeks to meet up with colleagues and never has this place disappointed me. We stay here for a good 8hours to work and it has everything you need; from extension cords to free open wifi to self-serve water, and of course caffeinated drinks to get you through the day. The atmosphere feels home-y and even if it's bustling with people, you're not disturbed by any loud noises. It could get a little dark though, if you're not on your computer and sitting on the very inside. They also only have one bathroom, which could be inconvenient but I never found it a problem. The beverages are pretty good, and they have a cool selection of scones, croissants, muffins, and their giant irresistible cookies... They serve light food as well!   Overall a very chill place to study or work."}
{"text":"Delicious cookies and cappuccino!   Decor is nice. Very plateau-ish look. Staff was friendly."}
{"text":"Hipster vibe, relax mood, ideal for sipping a coffee while working/studying.  Only a few minutes away from downtown but far enough to stay outside of the student buzz. Best triple  chocolate cookie ever! Excellent lattes!"}
{"text":"Love this whole place. The ambiance is lovely. There is plenty of cozy seating and a good place for people watching.  The latte I had was great and the cookie was amazing."}
{"text":"Wowz. This place is hipster heaven! Such a friendly crew running the show here, which is a pimp blend of nouveau prep gentlemen's attire, bro accessories, hip haircut station and seriously ace espresso-based drinks. It's all about the bromance in this place, peeps, and it's truly sweet. I asked for extra steamed milk for my Americano, and I got it with a smile. Overheard at the counter (by a female customer): \"Keep on the good vibes, man!\" Oh, one more thing: musique par excellence."}
{"text":"This hipster workstation-style café blends industrial chic with punk rock and tattoo culture. With a Ramones soundtrack and scroll script lettering on the chalkboards and counter signs, you're sure to feel at home here as an inked-sleeve wearing espresso connoisseur. Piercings? Yep. Thick-rimmed spectacles? Oh yes. Also, intimate convos left and right.  Great place for an afternoon perk, break from work, slam it down and go kind of coffee moment."}
{"text":"I wish I could give a better rating. It really isn't a bad place. It's chill and hipster. But what I had there tasted awful.  I ordered iced tea but what they gave me was not lemony nor did it have any citrus flavour typical for iced tea. It wasn't even sweetened!! Furthermore the color was blood red! What are they playing at? Sorry, this iced tea detered me from wanting to go back. Maybe the coffee drinks are good, but definitely not this damned \"iced tea\"."}
{"text":"I decided to stop here to catch up on a bunch of school work since it seemed pretty quiet and cozy. If I could rate it on ambience alone, Café Névé was definitely really cute. They had clean walls with several tables all lined up with chairs to go along with them as well as potted plants hanging from the ceiling (I did end up getting my hair momentarily entangled in one of them but that's beside the point.). I ordered a chai latte which came in a mason jar (much hipster wow) as well as one of their chocolate chip cookies. To be honest, I didn't find the chai quite chai-y; it lacked some of the spice that I would normally expect and tasted more milky than normal. The chocolate chip cookie, while good, is still not as good as Kitsuné's (now Nocturne) in my opinion. Maybe I should come back and try another one of their drinks because it does seem promising, and I also was quite productive studying in there."}
{"text":"Terrific service, cookies, and cold brew. This became our go-to spot for coffee while in Montreal. The gals behind the counter at each location were always super sweet and the cold brew really hit the spot.   The cookies are something else. Crispy on the outside, chewy on the inside, and mass amounts of every kind of chocolate under the sun. I'm sitting here on the couch wondering if I should go back and buy a couple to bring on the plane for our schlep home tomorrow morning.   Need coffee and a cookie? Look no further. You won't find better."}
{"text":"Terrific service, cookies, and cold brew. This became our go-to spot for coffee while in Montreal. The gals behind the counter at each location were always super sweet and the cold brew really hit the spot.   The cookies are something else. Crispy on the outside, chewy on the inside, and mass amounts of every kind of chocolate under the sun. I'm sitting here on the couch wondering if I should go back and buy a couple to bring on the plane for our schlep home tomorrow morning.   Need coffee and a cookie? Look no further. You won't find better."}
{"text":"Super pour le brunch! Des oeufs bénédictines au saumon excellents et pas chers! 10$ taxes incluses. J'aime ce spot"}
{"text":"Had a nice pot of tea and read a book for a couple hours. Great place to read or do work, or have a conversation. Welcoming and warm environment!"}
{"text":"Sooo good. This espresso is the best I tasted in Montreal, and that's saying a lot! This place is small, but charming. Great ambience in here. The staff is knowledgeable and I think they're all perfectionists when it comes to coffee: I saw them toss a couple mounds of ground espresso, shaking their head as if it wasn't up to par. The baristas are incredibly nice and helpful (bilingual as well). I came here 4 times throughout my short stay (I drink a lot of coffee), and vehemently recommend it to anyone visiting Montreal!"}
{"text":"Café Névé - the first time I glanced over was while I was at Romado's Chicken, and I stopped, threw down my chicken, and said OMG it's Café Névé! (to my friend visiting from Vancouver) and she was like, um, did you need a coffee? If you don't know by now, I always need a coffee, especially when I haven't had a coffee from there yet!  I ordered a soy latte and the barista was super awesome and sweet, I determined this from our short conversation in french, and also from the fact that she was smiley. I like smiley. It was beautifully made and tasted great! I eyeballed the desserts case and told myself I wouldn't get one, even if they did look divine!  My second time here, I did. I saw the dessert box, and got the low down on the cookies, and when he said biscuit au chocolat et beurre d'arachide, my eyes grew huge, and I said yes. yes, a thousand times yes. (Okay, I didn't but if I was to be dramatic I would have). I ordered another latte and this time the barista/ cash staff were both exceptionally nice as well. The cookie was to die for. I will vouch for this cookie. It was delicious!!!!!  So, the only issue I had was the lack of seating that I found, which seems to always be the case. there seems to be a good solid crowd of regulars that hang there, and that is cool, but I wish that there would be more seating. Maybe I need to choose better times. Café Névé though is fast turning into my fav Plateau haunt!"}
{"text":"Great coffee and pastries- I really enjoyed my chocolate latte. I was able to sneak a bite of my friend's chocolate croissant..amazing- super fresh and flakey."}
{"text":"I asked for a drink with no ice and they serve me a less than half full drink. The audacity that these ppl believe have. I loved this place and come quite often but due to SUCH EXTREME CHEAPNESS never going to come back.  Btw it was a green tea lemonade. They just needed to add more FREE water. But they wouldn't. Ask yourself if you like to be treated poorly. If yes, please come on down."}
{"text":"Very good food and coffee with a cozy seating area. Sometimes suffers from hipster service and french language snobbery, but mostly awesome."}
{"text":"Pro:  - Hipster decor (more precisely, it resemble a run-down fish shack), typical hipster barista (handsome, white and young, with attitude), right in the hip part of the plateau, and in front of Romados, this gotta be the biggest pro Cafe Neve has.  Con: - Below mediocre quality bean (and yes, I've tried this place 3 times in the past 3 month), which translates to medium-low quality expresso and pretty god awful drip coffee. Essentially, it's a bit bitter, rather sour, not aromatic, and rather stale (the bean I mean, and maybe the drip too)  - Bad lighting, hard seats, music a bit too loud, this place is more of a people watching place rather than comfortable student cafe. Unfortunately most of the table are on the site where there's no windows, and since most tables runs more sequential than parallel, you're stuck watching the barista.  - Minimal customer service. The baristas are good looking, but no more better looking the the average plateau dwellers. Perhaps they have more piercing, but definitely have less friendiness. Over-accessorized grumpy average hipster is what I'm trying to say.  - Slightly over-priced coffee. Their expresso is 3 $, expresso based coffe 3-4.5. I've had better, for less, with better customer service.  - Coffee might or might not be organic or fair-trade. There are certainly no signs in the store indicate that they are.  Summary: Over-rated, over-priced, over-rude coffee place. Perhaps their cookie is their redeeming quality, but really, you are on the plateau. You could have so much better. Romados' pastries are just across the street.  May I suggest Cafe Rico?"}
{"text":"Beau design, mais leur chocolat à le goût du   chocolat  Nesley.   Vous   comprendrez  que    le   goût  n'est  pas   extra   !C'est pas du vrai chocolat. 6.7 sur   10"}
{"text":"Really delicious cuppa joe here, so much so that grabbing it to go (in environmentally friendly paper cups) is fine but I go back on my own with new music in my headphones and a quiet hour ahead of me just to drink the coffee properly, sitting quietly, with a little cream and fresh chocolate chunk cookies as big as your face.   I had a delicious vegetable Thai soup here today. I tried to order the French Onion but was told honestly that the soup on special was made fresh in house and the onion was bought in and... \"a good source of cheese.\" While I am always glad to know a cheese source, I will choose fresh homemade every time. I was not disappointed, the soup was amazeballs, and the service was 5 gold stars for honesty and accuracy in reporting."}
{"text":"Cafe Neve is another one of those fantastic hipster coffee shops in Montreal. Along with the usual espresso delights are their fantastic selection of baked goods, both of which are more than worthy of trying.  It can get a bit crowded sometimes, so be prepared to squeeze a little for a seat. On a typical day, you'll find a bunch of students and young people either studying, hanging out, reading, and the like.  The baristas are friendly, and, of course, relatively superbly gorgeous."}
{"text":"Omfg...seriously the best chocolate chip cookies ever!!! Huge, warm, and perfectly balanced between chewy and crunchy. LOADED with chocolate chips/pieces without being too overwhelmingly chocolate (though I admit I'm a passionate chocolate lover...). Way better than Insomnia cookies (hailing from USA, particularly Philadelphia and DC)."}
{"text":"As my partner Lisa says about Neve, this place is \"the most Brooklyn\" of all the cafes in Montreal - casual, comfortable, eclectic decor, funky design, stand-out espresso drinks, very solid food and good music. That, and the proliferation of hipsters sitting there. All the time. This is a good thing though since some Montreal cafes can be kind of dead in the middle of the day - and hanging in those kind of places makes me feel a bit guilty for being a perpetual student and enjoying a summer in Montreal with no real work to speak of. They just need a few outdoor tables and at least a token french pastry or two to complete the scene...then I could comfortably rate this as the top Montreal coffeehouse."}
{"text":"After three or four visits, Flocon has joined my top tier of coffee spots alongside Tunnel, Couteau, and Myriade I+II (Pikolo is still uncontested in first place). As other reviewers allude to, this is a third wave shop: the coffee is bright/astringent/sour/bitter (the choice of adjective seems to betray one's overall feelings on the third wave).   If you like beards, tattoos, cardigans and skinny jeans, you will swoon for the pleasant and professional staff. A little bit of Mile End on the Plateau's main drag.   The seating is limited to two large tables with ample extension cords for laptops. On a weekday, one rarely feels self-conscious about occupying a seat to do work - a lot of their business is carry-out and the place is rarely full (weekends are busier). But be considerate and don't cross that crucial 2-2.5 hour line without ordering more stuff..."}
{"text":"Indy, little coffee shop serving good lattes and tasty baked goods. I had the zucchini muffin, which tasted yummy. The service was warm and friendly, and so I would go back. It is a simple recipe to make a good coffee shop: good coffee, tasty treats, nice ambiance and good service. This place has all the boxes checked."}
{"text":"Tiny but with great impact with fab espresso! Cosy and just oh so perfect on early Sunday mornings. Bring along your newspaper and you're good to go ;)"}
{"text":"Brilliant coffee. This used to be my home away from home every Sunday. The guys who worked there on Sundays were phenomenal. And now without further ado, the coffee: it was heaven. Silky but not weak. If I were to compare it to a note in a piano keyboard, it'd be a mi bemol.   What amazed me more, every Sunday, was the consistency in taste. Every cup was made to perfection through a choreographed dance of flawless man-machine interactions; culminating in the perfect cup of coffee for my Sundays regardless of the temperature outside.   I highly recommend their cappuccinos and (my favorite) Corrado."}
{"text":"Good espresso - the barista knows what he is doing but the beans aren't amazing. Casual atmosphere with plenty of power outlets and free wifi.  Coffee:7/10 Work venue: 8/10"}
{"text":"Nice, weird space inside with bright accents of color. Friendly service and delicious cookies. The iced cafe au lait was a bit bitter tasting, but still better than other cafes (looking at you Second Cup), especially the nearby Starbucks. It can be a little cramped inside and the barista misunderstood us and made 2 drinks when I asked for 2% milk."}
{"text":"Je me demande parfois s'il y a quelque chose de plus difficile à trouver sur la rue Mont-Royal qu'un bon café...  On te le sert étiré de beaucoup trop d'eau, ou avec une mauvaise mouture, le plus souvent préparé avec des grains de qualité très moyenne, ou trop torréfiés  (le plus souvent, en fait, c'est tout ça à la fois)...  Aussi, ça a été un ravissement que de découvrir (et vraiment, il faut le découvrir au sens propre du terme, l'endroit étant si petit et discrètement enclavé entre d'autres commerces qu'il est difficile de l'apercevoir si on ne le cherche pas) ce sympathique café ou le produit est à l'honneur d'une façon presque maniaque.  D'abord, on y trouve des mélanges d'une très grande qualité qui sont presque impossibles à dénicher ailleurs à Montréal, et qui offrent des saveurs très distinctes de celles offertes par les torréfacteurs montréalais ou italiens (essayez le Red Line espresso, pour voir...)  Ensuite, le suivi des produits est maniaque.  On y offrait auparavant le Hair Bender, de Stump, qui a été longtemps un des mes cafés préférés et dont la notoriété n'est plus à faire.  Celui-ci ayant décliné en terme de qualité durant la dernière année (je puis en témoigner), les propriétaires n'ont pas hésité à chercher ailleurs une perle rare que j'ai découverte hier avec ravissement (et dont le nom m'échappe).  Évidemment, on sait aussi, au Flocon, vous préparer un expresso parfaitement équilibré, selon les règles de l'art.  Finalement, si vous voulez accompagner votre buzz de caféïne d'une buzz de sucre, leurs biscuits au chocolat sont aussi bons et cochons qu'ils en ont l'air (vous verrez, ce n'est pas peu dire...)"}
{"text":"This coffee place was just near our apartment when we holidayed in Montreal, so we pretty much went there every day for breakfast: CAN$3 for filtered coffee, CAN$3.50 for mint tea and CAN$3 for a huge cookie was our usual order. Everything was great. They also have some lunch options around CAN$8-12, but we haven't tried any.   The staff is young and nice, and the atmosphere of the place is pretty relaxed - they have a Wi-Fi so many people work a bit here."}
{"text":"Coffee smells very different. Music was not very loud and disturbing. Overall it is not unique but if you are around  and are looking for a place to go, that is a good one"}
{"text":"Great coffee and tea. Great place to meet and work. Very mile-end without the judgement. One of our favorite places in the area.....and the food it good. Especially the cookies! Cookies, cookies, cookies. The C monster is a regular."}
{"text":"This small (small!) coffee shop is owned by the same people as Névé - and the coffee is just as awesome. The espresso is good, and their milk-base coffees (lattes, cappuccinos, etc) are some of the best in town, hands-down.   There's a few small tables inside, but not much else. It's find if you and maybe one other want to sit and read/have a chat, but not much else.  They also have the same big chocolate chip cookies as Névé, which are my favourite in all of Montreal. I'm not sure what else they have in the way of food, but I don't think there's much in the way of a full meal."}
{"text":"This is one of my favourite cafes in Montreal. Owned by the same guy(s) who do Cafe Flocon, it has great coffe, snacks, and cafe food.  The coffee comes from Vancouver, and almost has a ginger-bread taste to it (it's a good thing, trust me). I haven't had their coffee straight-up (black), but I'm pretty sure it would be worthwhile.  By far my favourite thing on the menu is their big chocolate chip cookies - I rate them the best in Montreal.  The vibe is always chill, but it can get noisy when there's a lot of people coming/going for takeaways. In the quite times, it's a great place to sit with your laptop and get some work done (the wireless is always good for me)."}
{"text":"Try a chocolate chip cookie, seriously amazing-chewy and sweet! I got some oolong tea and I was so excited to have it served to me in a cast iron pot. This place can be super crowded, full of hipsters... So expect to share a table or to wait a while for a spot to open up."}
{"text":"Amazing lattes. The baristas are chill and friendly, and the whole place feels like a narrow hollowed-out ship with the wood elements and pseudo-nautical theme.  I especially like the small drawings that adorn the register and walls, including one which poses the question, \"Why do cats purr?\" with an accompanying doodle of a purring cat seen to have bees on the inside. Because obviously."}
{"text":"Great coffee, friendly service, cozy environment. This is a great place to go to get work done, though it does get busy and it can sometimes be hard to find a seat (with good reason). I highly recommend checking this place out."}
{"text":"Cookies. How can you resist? It is sitting on the counter ever so innocently - but calling your name. It's huge. It's great.   Sandwiches - more or less your average sandwich. :)"}
{"text":"Delicious cold brew. They offer a good variety of other espresso based drinks. They have almond, soy, and coconut milks as well. It's an interesting concept of a clothing store, coffee shop, and barber all in one space that seems to work."}
{"text":"Good coffee, great snacks, and nice atmosphere to get some work done. Can be a bit crowded, and plugs are very few and far between, so if you plan on using their free Wifi, be prepared to strategically plan for a spot near a coveted power outlet. The selection of baked goods is limited, but they have amazing chocolate chip cookies which are worth ordering. The espresso was certainly very good - though not as good as Kitsuné. Though I am not sure I'd go out of my way to get coffee here, I will stop by if I am in the area."}
{"text":"Un an et demi plus tard, rien que ça, j'écris enfin sur le Café Névé. Un an et demi, voilà ce qui me sépare de mon dernier passage par \"mon\"real lors d'un printemps déjà très chaud. C'est au Café Névé que j'ai trouvé fraîcheur avec leur iced rooibos avant de reprendre la route direction le Mont-Royal. Le staff est à la hauteur des produits qu'on y trouve, au top!  Depuis Bruxelles ma belle, je pense souvent à ma ville de coeur. Lors de mon prochain voyage, bientôt je l'espère, un passage par ce café sera un must."}
{"text":"Névé stands out from the many other cafés on the Plateau by focussing on serving carefully prepared high quality coffee.  They serve coffee made from 49th Parallel beans (which can also be purchased to brew at home). There are also cookies, patisseries and sandwiches available, although while reasonably tasty, these don't represent quite as good value as the coffee.    The interior seating is a mix of shared tables and benches, intriguing-yet-precarious bar stools fashioned from bicycle parts, in addition to a couple of comfortable couches.  The couches are bathed in sunshine on sunny days, and provide a perfect vantage point for people watching.  Névé's clientele reflects the neighbourhood, relatively young and trendy.  There is free wireless internet available, and it appears to be a popular local café for laptop users.      Basically the draw at Névé is the coffee.  Besides that, it's a pleasant spot on the Plateau, like others in the neighbourhood."}
{"text":"Anciennement Flocon Espresso, le Café Névé est définitivement à essayer. Le goût unique de leur café est assez reconnaissable et, franchement, un des meilleurs à Montréal. Si vous comptez rester sur place, gardez toutefois en tête que les places sont (très) limitées. Le printemps ou l'été, je vous recommande plutôt de prendre votre commande à emporter et de vous asseoir sur un des bancs extérieurs de l'avenue Mont-Royal. Oh, et aussi, les biscuits sont délicieux. Presque trop."}
{"text":"Chouette petit endroit pour boire un café dans une ambiance un peu douillette. C'est typiquement le genre de café où l'on peut se poser avec un bouquin (il y a d'ailleurs à disposition plusieurs livres et magasines)  ou un peu de travail en retard car il y fait bon et calme. Sans oublier que le café est très bon et il y a plusieurs types de laits différents ce que j'apprécie beaucoup étant végétarienne."}
{"text":"Best hot chocolate and expresso drinks ever!!"}
{"text":"Beau petit café urbain sur Mont-Royal, petit frère du Café Névé sur Rachel, même bon latté + wifi gratuit !"}
{"text":"Café Névé aka the Blue Bottle Coffee (San Francisco / Oakland) of Montreal !"}
{"text":"I really enjoyed finding this place when vacationing in Montréal.  A small, quaint, and personal space.  An amazing moka: the best in the city (based on my experience).  Keep up the great work Flocon!"}
{"text":"Le Café Névé, tout le monde en parle. Alors forcément, on y va avec beaucoup beaucoup d'attentes. Et forcément, beaucoup on la même idée que nous, au même moment, alors forcément, on sera nombreux et il n'y aura pas beaucoup de places assises.  ET POURTANT !   Le service au bar est rapide et agréable, le menu fait saliver (Foccacia aux oeufs pochés et pestoooo !!) et ça sent bon le café. Le vrai. Il y a plein d'étudiants cachés derrières leurs écrans, d'autres qui travaillent et même des familles. On s'installe au bar, il fait grand beau et on se demande si à ce prix là, notre assiette sera minuscule. Mauvaises langues que nous sommes !! Nos plats arrivent et ça sent très bon, et c'est aussi très beau et pour finir c'est délicieux.   Nous sommes repartis comblés et heureux, car c'est vraiment une belle place qui change des chaines pour bruncher, ou des endroits bondés hors de prix. On se sent dans le salon d'un pote qui cuisine bien, et ce pote on veut le garder !"}
{"text":"Great, unpretentious cafe in the heart of the Portuguese neighborhood of the Plateau. Great breakfast options, yummy baked goods, tasty sandwiches, free wi-fi, and in all likelihood the best, most lovingly made coffee in Montreal (and I'm not even a coffee person!). Great place to come on a rainy Sunday morning to either chat with a friend or by yourself with your laptop while you're busy scribbling way on your literary masterpiece."}
{"text":"Très bien situé: en face du Romados! C'est un coin tranquille quoique très près de l'artère Saint-Denis. Excellent choix pour se retirer un peu et passer un petit moment plus concentré, à lire ou à gérer des tweets, par exemple!  Il y a des prises à portables partout, et de belles grandes fenêtres. Le design intérieur est quand même assez cool aussi. La musique peut parfois être un peu agressante (surtout si on est assis direct devant un haut-parleur).  Les cafés sont très bons et leurs gourmandises aussi, seulement c'est un peu cher parfois. Cela dit, quand je vais là-bas, je paye surtout pour l'espace.  Endroit assez hipster, mais ça reste sympathique.  On peut y déjeuner jusqu'à 15h aussi, très chouette."}
{"text":"It was a quiet and slow afternoon at Cafe Neve.  Cappuccino and Cortado was both nicely crafted with lovely latte art.  Good as a pit stop when you are in the area.  Barista was friendly.  We left happy and caffeinated."}
{"text":"Café Névé just opened a new location downtown on Stanley, a few steps from metro Peel. It is located in the new Frank & Oak store (same concept as their Mile-End location). I dropped by today for a latte before heading to work. The location is beautiful- they have a few tables in the store where you can sit and have your coffee / eat a cookie while watching people shop.   The barista was super kind to me! Unfortunately, the latte was nothing special. I couldn't really tell you how the espresso was because the whole thing tasted like cardboard for some reason? No idea why.  I definitely will be back since it is at a prime location and their baked goods look delicious. Hopefully my small latte will be worth the 3.75$ next time! Unfortunately it wasn't this afternoon."}
{"text":"J'écris cet avis tout en sirotant un délicieux café du Névé, mais à partir du confort de mon chez-moi plutôt qu'en direct! J'ai tellement adoré le goût de biscuit aux épices qui se dégagent d'un simple latte que j'en ai profité pour acheter des grains de Métropolis (Red Line Express) pour faire durer le plaisir même à la maison.  C'est définitivement un paradis pour les hispters du coin qui passent leurs journées à siroter un café tout en étudiant ou travaillant sur leur Mac. J'ai presque l'impression que je devrais faire enlever les verres de mes anciennes lunettes pour en faire mettre sans prescription et pouvoir vraiment \"fitter dans l'décor\".  J'y suis allée à un moment extrêmement occupé donc j'ai dû m'asseoir aux bancs près de la fenêtre. Pas mon premier choix, mais après quelques minutes, le soleil m'a réchauffé et j'avais l'impression de revenir au printemps et je me suis perdue dans les pages de mon livre pour une bonne heure de bonheur. Parfait pour un dimanche après-midi après une semaine mouvementée!"}
{"text":"J'ai vu mes premiers flocons de neige en fin de semaine, en plus de goûter aux délicieux cafés de Flocon. Le p'tit frère de Café Névé, Flocon Espresso est extrêmement bien situé sur la rue Mont-Royal, tout près de plusieurs de mes commerces préférés. Il est tellement bien situé en fait, qu'il vaudrait la peine d'y passer pour se commander un café à savourer en jasant avec ses amis pour faire passer le temps lorsqu'on attend dans l'une des nombreuses files pour le brunch.  Le café comme tel est un des meilleurs de la ville. Leur lattés ont un goût de pain d'épice et il est si joli on dirait qu'il s'est mis une robe juste pour nous. Je sens que j'aurai possiblement besoin de me munir d'une passe mensuelle pour le métro parce que je vais devoir retourner à Flocon assez régulièrement et j'habite un peu loin de là. Sinon, les cafés de Flocon risquent de hanter mes rêves.  Les pâtisseries et les géants cookies sont aussi à s'en lécher les babines juste à les regarder. J'ai partagé un biscuit avec mon chum et après trois bouchées, j'avais tout le sucré que je pouvais prendre. Il a finit le reste - j'ai vraiment aucune idée comment les gars font pour manger tant!"}
{"text":"A great matcha latte to grab on the way to mont royal station as this cafe is a mere two minute walk from the subway. They have milk alternative options and are quick on the service. Workers are always friendly as well. The only food option I've had is the matcha croissant, which I wasn't too crazy about. The cookie are massive & I've been eyeing them for quite a while now - I'll indulge one of these days..."}
{"text":"SO...I JUST WANTED TO SAY, PLEASE DO YOURSELF A FAVOR AND GET THEIR COOKIES--they are heaven. Sometimes, they only have the chocolate chip cookies, but I personally love the white chocolate macadamia or the peanut butter. Super rich, slightly gooey in the inside and basically perfect. Not to mention their food and coffee are not too bad either. It's also a great place to study since they have wifi as well. Although it does get pretty stuffy and sometimes packed during the weekends, it's still a great coffee shop to go to. Worth a visit if you're in the area and craving good coffee or the amazing cookies."}
{"text":"Warm, homey, bustling.   Superb espresso, homemade chocolate chunk cookies, free WiFi."}
{"text":"I adore Flocon. It is teeny tiny and as soon as you walk in, you cannot help but swoon over the smell of the best espresso on the whole island. Their espresso is fab and their lattes are positively gorgeous. If you can score a table, you're lucky, but the neighbourhood is so much fun that I prefer walking around with my drink in my paw, soaking up Mont Royal. While I've never tried the baked goodies, they look amazing and tempt me every single time, be strong JJ, be strong..."}
{"text":"I honestly don't understand the hype around this place. I wish I did. I consider myself to be an avid coffee fan and I have yet to find a Neve drink that I really enjoy. Although they have a plethora of dairy-alternatives for lattes and cappuccinos (major pro!) the espresso is oddly acidic and sour (major, major con). Come summer, I'm always up for cold brew or iced coffee, but the cold brew at Neve always tastes like slightly flavoured water to me. This goes for the iced teas as well. Sadly, every time I spend $5 on a beverage here, I immediately regret it.  I've given Neve many chances to change my opinion. I really, really want to like them. They're close to my office. The staff are usually very kind. And don't get me started on the heavenly chocolate chip cookies... (Seriously, they are the reason I keep going back and the reason I'm giving Neve 3 stars instead of 2. Maybe the best cookies in town. I will give them that.) But I simply can't get over the lack of decent-tasting beverage options. I'm really not picky with my coffee, but I just can't get down with a watered down, sour-tasting espresso."}
{"text":"TWO WORDS: HOMEMADE CHAI.  So good. I ordered mine as I usually do: dirty + soy milk. Came out so freakin' perfect. Flocon is the perfect place to take a rest while you're touring Rue Mont-Royal. The chai is a must."}
{"text":"My wife and two friends took a 3 day trip to Montreal and stayed in the Mount Royal area. Every place we visit, we search for the best coffee rated on Yelp and this place won the cake. We stopped in for a great cup of iced coffee and a latte.   My only regret is not trying their famous chocolate chip cookies. They looked amazing!  Also, the baristas speak English at this coffee shop (a plus for us American tourists)."}
{"text":"What a lovely little cafe. Overshadowed by big sibling cafe Nevé, this delightful little space is spartan enough and serves some phenomenal coffee. Today they were serving Anchored, Cut, or Pig Iron beans. I went with a cut cortado and to date this has been the best cortado that I've ever had. Thankfully I showed up immediately after the patisseries arrived so I got to enjoy a still warm croissant to the Beach Boys, which the barista was subtlely humming along to all thea relaxing while.  Easily the best cafe in the plateau/mile end for relaxing little coffee and newspaper reading on a Sunday morning."}
{"text":"Great coffee, tiny place, cakes and muffins are good too. Best coffee in that part of the city."}
{"text":"Great coffee, great food, good prices. All around fun, though a bit too hipster (yes, that is possible)."}
{"text":"Great, great coffee.   Has a nice, warn rustic vibe to the place - authentic and comfy. Has decent sized sofas to lounge, also has a large common table.  I've been meaning to check out the other coffee spots in the hood but I keep heading back here.  I would skip the breakfast, as it was a just a wee bit pricey for the fare. It'd been fine if all you're looking for is a MTL hangover breakfast that comes with a great, great coffee!  It does offer free WiFi."}
{"text":"I felt like I was in a cafe in Brooklyn, and yes, that IS a good thing.  Great coffee, wonderful baked good (croissant, pain au chocolat, scone were all wonderful), excellent service, ample seating, lots of laptops, beards and big frame eyeglasses.  It's a bit off the beaten path but definitely worth the deviation."}
{"text":"One of my favorite spots :) great chocolate chip cookie and chai latte :)"}
