{"text":"Lets say its a new comfort food space. The pad thai was good and the grilled chicken was juicy and tender. A bit too spicy maybe but i like it. The potato spring is definitely a must order. Service is basic, i can see there's improvement from previous reviews. I would install door closers though on the bathroom though."}
{"text":"I wanted to like this place, really. However, as far as first impressions go, Cafe Unique17 didn't fare very well; they're going to need to make quite a few improvements before I'll consider coming back again. I'm aware that they opened very recently, but I don't think that's an excuse for a lower quality of service.

On decoration alone, I'd give this place four stars: the area is spacious, and I absolutely love the murals, which featured many pokemon and famous anime characters, as well as Venom from Spiderman. The glazed wooden tables were cute, but there were no napkins readily available, which became a problem when we had to address a light spill. Though the lighting is warm and cosy, it's a bit too dark (as you might be able to see from the pictures).

The food, however, is two stars for me. I personally thought the menu was disorganized and a little hard to read, but we were excited to try many of the items. In total, we ordered three potato springs (two garlic flavoured, one spicy mayo), some bubble tea, two popcorn chicken, and pad thai. I didn't try the pad thai, but I heard it was pretty good. However, the two plates of popcorn chicken were cooked inconsistently (i.e. different colours), and our potato spring (garlic flavoured) tasted kind of disappointing - like... a potato. 

Our main issue was with the bubble tea. Though we stayed to eat, all our bubble teas were served in to go cups. I ordered the regular special, 30% sugar, which tasted fine - as in, what you expect 30% sugared bubble tea to taste like. I've definitely had better tapioca; it tasted a bit like the tapioca I tried once to make at home. However, my friend ordered the lychee 100% sugar, and, somehow, it tasted the same. Maybe a fraction sweeter. Lastly, our matcha bubble tea was accidentally made with two times the concentration of matcha powder, so we all flinched a little when we tried it. They made us another one, but it still tasted bitter, even though it was supposed to be 100% sugar. My friend had ordered it in a large size, but she couldn't finish it. 

When we went to pay, the prices weren't bad. The servers were very nice, but it was clear that they needed at least a bit more training. I don't mean this as a personal attack, but this three star rating is a very generous three stars.

At least there was free wifi."}
{"text":"They have this supposingly \"super spicy!!!\" noodle soup (with 3 exclamation points) but it's NOT EVEN A TINY BIT SPICY...the broth isn't even red. They just added some chili oil on it and that's it...

The \"garlic\" potato tasted nothing like garlic. 

I'm only giving 2 stars because of the HK milk tea which was pretty decent."}
{"text":"Was offered the free coupon for a bbt.  Taking our order took 10 minutes of waiting in itself. Then we were told that they ran out of the most common toppings - tapioca and grass jelly.  We still decided to order and ended up waiting over 50mins, before walking out empty handed.  I understand the place is still new and they have some issues to fix.  Nonetheless I won't be going there any time soon until they rectify their issues.  I hope management reads this and takes the feedback constructively."}
{"text":"The place is fairly new with nice decor so I thought I would give it a try with friends. I was curious to try the tomato ramen and the fried chicken. Unfortunately the food quality was not there... I could probably make better fried chicken using a microwave at home! As far as the tomato ramen it was really bland and acid tasted like boiled water with tomatoes no spice or flavour to it. Hopefully they will review the menue"}
{"text":"We were looking for a coffee shop/bbt spot to chill near chinatown and we found this place. It is spacious, would be a good study place for students. They have a great selection of meals, desserts and drinks. First, the service was really slow. We waited around 20 min for our order and there weren't many people ( 2:30pm ish). Fortunately we had time to spare so it wasnt a big deal for us at this time. But we still noticed the slow service. Second, we ordered egg waffles , HK hot milktea and matcha bbt with mixed jelly. My matcha bbt had an after taste of intense powdery matcha. Not the best I've drink so far. Egg waffle was fluffy and good. Hk milktea has a little sweet taste to it which I like my milktea a bit sugary. This place would be a good spot to chill with friends and prices are not so bad either. But the service has to improve. Will come back."}
{"text":"Good food! Quiet environment! I also go to different Chinatowns and try different Hong Kong food. This cafe is one of the best!"}
{"text":"Bonne découverte, café très sympathique. La deco est top et le service est plutôt bien. J'y suis allée suite à une article sur MTL blog et je ne regrette pas. Le prix de leur gaufre style Hong Kong est un peu excessif mais c'était un délice. J'y retournerais pour un lunch la prochaine fois, leur carte est plutôt attrayante. A tester."}
{"text":"At the first glance, I find the restaurant inviting. It wasn't the case, my friend ordered the noddle and pork tonkatsu and what a let down it was. It was just a ramen pack served with an cold premade pork cutlet. Also, I ordered their braise pork with rice. It was just taco bell meat serve with some mushy rice. In conclusion, the restaurant and the price seem inviting, don't go to cafe unique 17. it's a huge waste of money."}
