{"text":"Though this cafe closes earlier compared to many other cafes in the city, this is a place to visit if you love coffee. It's also a lot smaller than expected, but this makes the cafe much quieter than other places, so if you don't like loud places, this would be a good fit for you.
Coffee wise, I'm not the biggest fan of 49th parallel coffee, so I can't say much. If you like it, then you'd be happy to hear that Cafe difference serves coffee from 49th parallel. :D"}
{"text":"They took coffee seriously here. I had filtered coffee, which was full in flavor, definitely on par with the high end drip coffee in the San Francisco Bay Area.  The hot chocolates came with coffee art! It was the best hot chocolate I ever tasted, though my son had to add more sugar :)"}
{"text":"The best espresso drink I have had in a while. They have picked their roaster well and the espresso roast is a blend. Dramatically different taste. Agree with most of the other reviewers. Will be visiting them often during my stay in Montreal"}
{"text":"So this place was literally a block and a half from the venue of one of my BFFs wedding. Once I found out how close this was I was eager to stop in, and considering the proximity figured I'd have plenty of time to do so. Wrong! I tried like 3 different times but was foiled each time by their hours.  However, perseverance has always been high in my vocabulary so I finally made it in! 

A window of opportunity finally opened up while we were in between hair/makeup and waiting for the limo to take us to the bridal party photo sesh. I seized the oppty and ran with it! (Or literally ran to it).   The rest of the bridal party looked at me like I was insane considering we were sitting in the lobby coffee shop, they just didn't get it. But it's ok, it was worth it. 

By this point we were already 6 hours into our day and I was overdue for my next caffeine bolus. We ran the 2 blocks over in our heels, up do's and long dresses and returned with cold brew in hand plus a little more spring in my step. I was ready to grab our 2 hr photo sesh by the horns! 

The shop is a minimalist coffee bar offering the basics- espresso based drinks, great quality coffee and cold brew.  It was a hot summer day so I opted for the cold brew... It was worth the persistence. The baristas were very friendly and efficient. I only saw I lonely cookie sitting on a tray but I was a bit pressed for time and for their Sunday hours, it was relatively later in the day so that might not be representative of their norm. Worth a visit, will be back!"}
{"text":"A very solid cup of coffee, they carry the 49th Parallel brand(as does Café Myriade) which I like."}
{"text":"Possibly the best coffee I have had in Canada, could maybe do with some more space as the seating is a bit tight and you end up talking over the people next to you but the most important piece is the coffee and they do that extremely well"}
{"text":"Best coffee in the area. Staff are delightful and space is great. We're blessed to have such good coffee so close to home!!"}
{"text":"Très mauvais Chai Latte, ça goûte l'eau chaude parfumée. Très peu d'espace pour travailler."}
{"text":"The coffee and food here taste good. The coffee beverages are authentic and would satisfy the average coffee lover. The location itself is clean and bright. I only gave 1 star because: (i) the coffee beverages are only available in one size - and it's TINY. It's much smaller than a starbuck's tall. I like to sip my morning coffee for more than 2 minutes so I wish they at least had the option of a bigger size; (ii) The staff was surprisingly rude. For example, they have a tray of pastries at the counter but nothing is labeled and you can't tell what's inside of them. When I asked the girl what they were she was visibly perturbed and sighed in annoyance before telling me what they were. There was a short guy with dark hair on the beverage station. When I asked him if he had lids for the 'to-go' cups he rolled his eyes and pointed to a counter off to the side as if to say \"they're obviously right there\". It was rude and unnecessary. I was only in there for 3 or 4 minutes and left the shop feeling like a bag of crap. Not a good way to start the day. I hate to say it, but at least the staff at Starbucks have basic customer skills like smiling and being polite to customers. I won't be back to this coffee shop."}
{"text":"Excellent coffee drinks. I had an espresso and latte both were above average the pastries were good as well."}
{"text":"Le café y est très bon. Malheureusement, considérant qu'on se trouve en plein quartier des affaires, le service est excessivement lent et souvent désintéressé!"}
{"text":"Just outstanding owner-barista with an attention to detail bordering on fanatical (like weighing the coffee before pouring). Using the best of the best espresso machine in the world with out-of-this-world temperature control (within 0.1C tolerance). Fantastic selection of grains from boutique roasters.Bottom line: the coffee tastes fabulous and they know how to draw the milk just hot enough without burning it. It draws a regular crowd of aficionados who, rightly, swear by it. As I do. Highly highly worth the detour."}
{"text":"Expertly made coffee at a cafe that is (easily) walkable from downtown and Old Port. A rare bird in Montreal indeed.

The cafe itself has this minimalistic-industrial vibe going on befitting its location in the financial/commercial district. I'd say it's more of a place to get your coffee and go rather than a place to settle in and lounge - but that's OK because not all cafes have to look like the house and home section at Anthropologie.

One final note: try the chocolate chip cookie =)"}
{"text":"Dropped in for a coffee to go...it's damn good coffee!  It tasted familiar and I asked if they roasted their beans or ordered it from somewhere in Canada and the barista let me know the beans I was having was from 49th Parallel in Vancouver!  So Vancourites, if you're missing your awesome coffee from home you should drop by here.

I also ordered a scone which was also delicious and was on my way.  I'm not to sure about the amenities at the shop but it's a cool little space but I think the people watching might be at a minimum unless something is happening at the convention center since it's off a smaller street in Old MTL.

Oh yeah - staff was really friendly"}
{"text":"Very cool design, great service, but the most important part... the coffee was not great. It was bitter, and I've had 49th beans before, so I know it's not the coffee."}
{"text":"Yes! Quality beans, handsome sorta business-hipsterish patrons, almond milk and freshly baked goods. Exactly what I needed to pick up en route to the office after a very short night (seriously, who in their right mind would go out for drinks on a Sunday night?).

My almond latté was A+. I just wish it came in a bigger format for extra rough mornings. I also picked up a raisin cinnamon brioche and a chocolate chip cookie (for afternoon cravings. Also, just because it looked AMAZING and sorta gooey!). Considering that the brioche was devoured in probably less than 120 seconds, I can safely say that it truly hit the spot.

I loved the industrial feel of the place, but it's definitely not the kind of café where you would spend the whole day, trying to get work done. And you know what? That's just perfect, too. There's nothing worse than hitting a crowded café where students have taken over and you can't even find a seat to eat a bite for 5 minutes before you're on your way to more incredible adventures in this crazy life!

Now that Art Java on President-Kennedy has closed down (RIP), this spot will probably become my regular coffee place whenever I'm working in Montreal :)"}
{"text":"Tucked-in between two other coffee shops in the heart of the financial district, Café Différance stands out like a little giant - mostly because of its amazing staff and impeccable brew.

I've had the pleasure of stopping by many early Saturday mornings and tried the punchy Espresso, the smooth Macchiato and my favorite, a creamy and frothy Latté! Annie the friendly Barista explains to me that the secret of the thick and rich foam is to carefuly warm up cold milk to its desired temperature, layer by layer, and not to rush it. As for the perfect espresso shot, you have to get the timing right. Too fast and coffee will be too light. Too long and coffee will taste burnt. Last, acidity has to do with the type of beans... luckily you won't run out of choices as you will find different types of roasts from Phil & Sebastian, Bows & Arrows and 49th Parallel.

To accompany your beverage, you have to try one of the fabulous pastries that are baked on premise... ham and cheese scones, blueberry and white chocolate scones, giant chocolate cookies, mini-cup sized brownies and so many other treats.

When you have time, stop by for a quick fix with the superior quality you'd expected from an independent coffee shop. Also say hi to young and energetic owner Daniel and the four baristas who are sometimes all there during busy weekday mornings!"}
{"text":"Wow c'est ce que vous allez dire a votre première gorgée de café!!! Même décaféiné même écrémé peu importe"}
{"text":"I stopped at cafe difference on a rainy afternoon. I ordered a chai tea latte and sat at one of the bar seats along the window - there wasn't a ton of seating, but there also weren't a ton of people so it worked out. The chai was good, though I tend to prefer it spicier. The baristas were very nice, and let us wait out the rain inside even as they were closing. I'm not sure if they normally have WiFi, but they did not when I was there, which was kind of a bummer. Overall, it was nice but nothing in particular stood out to me."}
{"text":"They know their coffee. Only place I've found in Mtl that knows what a cortado is. Cool hip staff and modern clean interior. If this place gets busy they have a larger staff to handle it. 

Not a place to find food."}
{"text":"Great coffee but the food is stale and not fresh. The food ruined the coffee experience. I've been here before and came back for their coffee. Today I decided to have breakfast and buy their pastries but they were dry and stale. Get their coffee but avoid their food."}
{"text":"Consensus best Americano in the downtown area and the best I've ever had.
Literally did a blind taste test vs Neve, myriade and melk. Differance was the number one pick of the vast majority.
It's the best. Hands down."}
{"text":"I'm lucky for this to be round the corner from me. The coffee is great and they have non dairy options. A treat every time."}
{"text":"Pretty good soy steam, pretty good cow milk steam, pretty good espresso pull. Okay chocolate chip cookie."}
{"text":"One of the best lattes in downtown Montreal!  For some reason as foodie as Montreal gets, we're just not as picky of our latte.  Can anyone explain why?  However they make it with the right ratio of expresso and milk, and obviously better beans and milk than most."}
{"text":"Great coffee place making some fantastic espressos. Very busy in the morning! I got a cappuccino and it was made well. Espresso was nutty and strong and the milk was nicely steamed. Close to many downtown attractions"}
{"text":"Not a bad coffee place, but I do find the service lacks a smile and a special \"thank you for coming here, we appreciate your business\". The nonchalant attitude kills it for me.

In case your around this area (downtown Montreal - corner Viger &  Beaver Hall), I feel you can find better for cheaper..."}
{"text":"Un incontournable lorsque je dois aller au Palais des Congrès lors d'un de ses 1 milliards de salons. Ça me dérange pas de me lever plus tôt pour aller a un rendez-vous dans le coin juste pour être sur d'avoir ma petite demie-heure à moi au Café Différance avant. Ça en dit long je crois! 

Le cappuccino au lait d'amande est parfait, ils ont des beignes de Saint Donut et les baristas sont toujours souriants. En plus, on dirait qu'il y a toujours un rayon de soleil dans le café, c'est comme une place faite pour le bien-être et le bonheur matinal. Pas de divan, mais c'est pas grave, j'avais pas de place pour donner une 6e étoile."}
{"text":"49th Parallel coffee. Yes, yes, a thousand times yes. Amazing huge chocolate chip cookies melt in the mouth. If it wasn't so expensive for coffee, I'd be here every day of the week. Right now, it's a special treat. Totally worth it though. Am thankful for places that make coffee like this!"}
{"text":"Great coffee. Fast service despite the long lines."}
{"text":"My coffee was delicious,  but my friend did not like hers. The place has a simple modern look. It's overall a good coffee place."}
{"text":"As a faithful Plateau resident who has a variety of amazing coffee shops at her disposal, I was a bit surprised to find a pretty good coffee shop smack-dab in downtown Montréal. Walking in, it seemed to me that Café Différance is the type of place where opposites somehow come together, if not attract - both corporate executives and hipsters in the same building, that is. It had a sleek ambience that wasn't too overbearing for a coffee shop, bringing two of my favorite things together seamlessly.

The cappuccino that I ordered, brewed 49th Parallel, wasn't my favorite, but it definitely wasn't on the acidic side either. The taste sort of teeter-tottered on the border between smooth and bitter, but since I do somewhat prefer a stronger coffee I won't complain. The real star of Café Différance, however, lies in the baked goods, or at the very least their muffins. I got the blueberry and (apple?) muffin, and it tasted as good, if not better, than it looked. The bursting flavors of the fruit, the sweetness of the muffin, and the extra sugar flakes on top (which was totally not unnecessary in my opinion) created an amazing balance that harmonized perfectly with the slight bitterness of the cappuccino. As a self-proclaimed \"muffin nut,\" I would definitely give it a 10/10.

The bottom line is that I can say with utmost certainty that I will come back for the pastries so I can have the excuse to \"sample\" (aka pig out on) them all. And who knows? Maybe I'll find another drink that will be even more up my alley than this time's."}
{"text":"Good coffee, but very little choice of allergen free food and drinks.

Gluten free options are very poor, as well as the lack of lactose free & soy lecithin free options in drinks and snacks. 

Expecting to see this in the near future. 
We have 2016..."}
{"text":"J'ai essayé le Café Différance pour la première fois cette semaine et je le visiterai certainement à nouveau quand je retournerai dans le coin. Le café est très bon. J'ai aussi essayé les croissants... juste assez chauds et croustillants! Miam!"}
{"text":"It's the best coffee shop next to my square victoria office.  Whenever, I am in the neighborhood I get a filtered black coffee; it only comes in one size. 
Also, the place is really small, with few chairs and tables, and baristas are friendly. It's not the traditional coffee place where you wanna stay for long hours with friends. I usually have a takeaway."}
{"text":"Best hipster cafe in the area and not just because there is zero competition. 

But if a new cafe should pop up, here are ways to blow this place away. You're welcome in advance for the free consultation -

1. Crack a smile. Or at least, appear life like. Seriously, there is mild barista depression up in here.

2. Up the pace. This ain't NYC but this ain't Sleepy Hollow.

3. Ambiance. Offer something memorable. This space is 'nice' and 'the norm' but is that they way you'd want a date to be described...

The product, which it's mainly about, is aces."}
{"text":"Stopped in from the cold to grab an espresso drink and it was delicious. They have nice window seating that allows you to people watch as you enjoy your coffee. There's not a whole lot of seating but the important thing is the coffee!"}
{"text":"Le café est sympa dans son ambiance, pas beaucoup de places pour s'asseoir mais une musique de fond qui colle bien avec l'ambiance souhaité .
Il y a un bon choix de boisson chaude et froide ainsi que quelque biscuits et pâtisserie. 
On a pris un chocolat chaud, un chai latte et un biscuit avec des pepites de chocolat.
Le biscuit bien bon, le chocolat aussi mais un peu déçu du chai latté. Pas trop à notre goût comparé à ce que l'on a déjà bu dans d'autres café. Je pense que c'est ce qui fait que l'on passe de 4* à 3*.
Le service est sympa même si pas facile parfois de se faire comprendre en parlant francais :)"}
{"text":"Petit café au coeur du centre-ville. Le café est bon et abordable et le service est bien sympathique. Je compte bien y retourner."}
{"text":"Stopped this morning on our way to the train station for coffee and pastry. The croissants were very good, and my wife really enjoyed the huge cookie. 

They have a nice selection of iced coffees and teas that I'd like to try. 

My cappuccino was nicely done including the \"flower\" in the foam. 

The ambiance is just OK. The seats are pretty hard, and the concrete floor does not beckon you to stay for a long time. 

Overall we were glad we stopped here."}
{"text":"Alright, admittedly this lacks a dose of what I usually look for in a cafe, a sense of cozy warmth, some respite and love and welcome. But this is a well polished, fast moving, and very friendly member of that new breed. Carefully sourced and roasted beans, professional baristas, all that third wave precision in a pocket sized sliced of old mtl, plus big windows to boot. There's a line that flies quickly, even now when the block is bogged down by construction. Not relaxing, but good for a great brew on the go."}
{"text":"Good atmosphere, nice decor, knowledgeable staffs, tasty coffee with lots of pastries to choose from. Must come if you are in the neighbourhood.
The staff didn't ask me the size I wanted for my latte and just got me a large one, when I just wanted a small one..."}
{"text":"Great cafe.  Introduced to Cortinos.  The staff is friendly and craft fine drinks.  A must visit if near convention center."}
{"text":"Café Différance is one of the classy coffee shops smack dab in the middle of the financial business district. As such, it's frequented mainly by business people and their super fancy cars and suits.

The modern decor fits right with the whole business crowd. It's got that clean, sleek, classy look. Although I'm very non-business-persony, I still very much appreciate the modern feel of the place. 

The baristas were cool and gorgeous. The coffee was fantastic. The latte art came with the coffee, as always. I would have given this place a 5-star rating if it weren't for the crowd. 

Stay classy."}
{"text":"Top quality coffee drinks. I especially love their cortados (petite latte). I go here everyday that I'm in downtown Montreal."}
{"text":"This is a third wave joint that's in my top coffee echelon for the city. Best coffee south of René-Lévesque; the closest great alternatives are Tunnel in the Eaton Centre, Pikolo on Parc, and Pourquoi Pas on Amherst. The great chocolate cookies mark them as a member of the Névé-Flocon café empire, and like Flocon, this is a spot I'll go out of my way to visit. Good wifi; very good pastries; efficient staff making espresso drinks faster than average for a steady stream of Caisse/Bourse/etc. professionals as well as baristas from other leading cafés. Seating is ample enough but more angular than cosy, in keeping with the austere concrete and glass decor."}
{"text":"Excellents cafés servis ici de torréfacteurs réputés:

Phil & Sebastian
49th parallel
Etc...

L'endroit idéal pour un \" in and out \" 
au centre-ville. Grande clientèle de bureau.

Viennoiseries; croissants, danoises, muffins, etc.

Une bonne adresse café!"}
{"text":"We tried to go here a day before but realized it was closed so we tried next day again and oh boy it was worth it! The staff was knowledgeable and knew how to please his customers. 
We took a Americano with stemmed milk and the taste of the coffee stayed in my mouth until we drove all the way to Qubec city ! Really recommend this place."}
{"text":"Great little coffee shop. No gluten free options on the weekends and during the week they sometimes have a gluten free brownie.  They have a place that supplies them with baked goods.  
49th parallel coffee(Vancouver BC), Phil Sebastian roasters(Calgary Alberta) and Bows & Arrows (Victoria BC) espresso.  Nice little coffee shop."}
{"text":"Great ice-coffee (cold brew). Good croissant. They serve Fentimans (botanically brewed beverages) which is my favorite brand of soft drinks. I worked there for few minutes on my laptop (they have internet)."}
{"text":"My favourite cafe in the financial district.

The coffee is great, the service is fast (well, by Montreal standards), and the pastries are tasty and fresh.

The venue is modern, and it's good if you just want to grab your coffee to go or stay and read/catch up with someone briefly."}
{"text":"I would rate the cafe 4 stars but I have to give it 5 because of the lovely staff. Best coffee in the area. Beside my work place so I go there almost everyday. Their Chocolatine are perfect too."}
{"text":"Awesome coffee! Had both cappuccino and flat whites and both were delish. Also had a chocolate croissant which was flakey and fresh. Friendly service also. Clean and bright seating area. Recommended!"}
{"text":"Great cappuccinos and croissants. Very well priced and friendly service. This is the perfect place to sit down with a coffee and a good book and enjoy a delicious pastry."}
{"text":"Beau petit café local indépendant dans le Quartier International. Bon latté + dessert, bon service + wifi gratuit. Ambiance calme pour lire un livre ou surfer sur le web."}
{"text":"Si les biscuits au pepites de chocolat sont fraichement faits, il faut les essayer!!! Un delice, vraiment cochon! 

Le cafe est évidemment excellent!"}
{"text":"Café Différance was one of the best coffees we had during our recent visit to Montreal. It was bit of a walk from our hotel to Victoria Square, but well worth it.

The shop is pretty small but there is a fair amount of seating. Café Différance has a small selection of baked goods also. We had the sweet brioche and it was so good we went back for seconds. 

I had an espresso with steamed milk and it was excellent.  Café Différance is a great little place and highly recommended."}
{"text":"It is a nice little café close to old port and Chinatown, it can get really busy around noon time despite the fact that they don't serve lunch. The rest of time the café is quiet and ideal for students to go studying. The interior decor is a mix of rustic and organic style, adorned by green plants that are particularly nice. The café is bright, so I like it a lot. Their coffee is quite nice, and the price is fair. I would recommend it to everyone."}
{"text":"The taste of latte was quite good. I really liked the latte art. The environment is good for chatting but not really good for working or studying for long time because there's only one plug near the front window."}
{"text":"If not for the indie coffee passport I would have never made it down to Differance, but I'm glad I did! Friendly staff, nice atmosphere, and tasty coffee, what more to ask for? 

They're brewing 49th parallel and Phil & Sebastian, all good there.

The only downsides - while the place was mostly quiet, rocking out to good music, huge crowds would just pop up from time to time. Also, not much seating, and you essentially sit in front of a big mirror. Best not have anything sensitive or incriminating on your laptop..."}
{"text":"I came here one morning for a cortado and croissant. Croissant was decent, cortado was excellent. The espresso was strong and flavourful, and with just the right amount of milk. It was reasonably priced and pretty centrally located. The cafe itself was bright, airy and unpretentious. Loved it!"}
{"text":"Je passe souvent devant, en voiture, quand je dois aller prendre la 720 et j'ai finalement décidé de m'y rendre expressément pour un café. On dit « bar à café » sur la devanture et c'est exactement ce que c'est. Le décor est simple et le café est en toute évidence le focus de la place. On y sert des café espresso Bows & Arrows, des thés de Camellia Sinensis, du chocolat chaud, des chais latte et quelques pâtisseries. Vers midi, pas mal tous les croissants et viennoiseries sont partis mais il reste encore des géants biscuits aux pépites de chocolats (plus gros que ma tête!), des muffins au chocolat (qui ont plutôt l'air d'être au triple chocolat...) et quelques autres desserts bien sucré. À la caisse j'ai aussi remarqué qu'ils ont des cartes cadeaux rechargeables, du style « les cartes à la Tim. » Une bonne idée de cadeau pour quelqu'un qui travaille dans le coin, ou même un achat à faire pour soi-même quand on veut bien gérer notre budget latte!"}
{"text":"What a pleasantly well done Peach & Raspberry scone, crispy outside and just slightly chewy textured inside. Both peach and raspberry hints are represented well. Goes perfectly with this creamy and rich yet simple Latte. If you want to get away from your run-of-the-mill Starbucks, this is several ticks superior at the same cost. 

Ambience is simplistic, soft background jams, seating at the front window for street view. Nothing less, nothing more."}
{"text":"As a jaded Plateau dweller, I come to expect garbage from anything south of Rachel, so I was so surprised to find this little diamond in the rough of centre ville. The staff is nice, the drinks are made quick as, and on top of that everything is delicious.

The coffee is carefully prepared 49th parallel, which albeit not my favorite roaster, still is pretty bulletproof. The pastries, oh man. We're all going to get fat. Tasty gooey brownie muffins, fluffy crunchy croissants, and plenty of other tasty butter filled options await.

Yes I am normally a sucker for places that feel like an old Victorian mansion-cum-coffeehouse replete with comfy couches and books filled with books, but the sleek design ensures that all the corporate drones working next door won't be scared away by anything too different while also being hyper effective at serving happy coffee guzzlers."}
{"text":"Hands down one the best coffee shops in Old Port. If you like lattes, do not hesitate to go there. Froth is perfect and coffee tastes great. You won't regret it!"}
