{"text":"Big, well-lit café with great coffee and a very \"local\" vibe- business cards, local products on the shelf. Although I had my coffee to go, it looks like a nice place to sit down with your computer for a bit of work. Friendly service. They offer sandwiches and little lunch items, pastries, but nothing extensive. I will be back!"}
{"text":"Accueillant café de quartier qui propose de la nourriture faite maison et un espresso qui est un des meilleurs que j'ai goûté ! L'endroit est très lumineux grâce aux grandes fenêtres. Intéressant pour aller y travailler / étudier vu l'excellent wifi."}
{"text":"Another café visiting with our barista passport .

Café Mucho Mucho, what an adorable name. The place is a huge, but completely empty around 4 pm. Only one wall of this cafe is beautifully decorated; a board with hooks, and teacups hanging on the wall. I actually found it really cute.
Bunch of chairs with tables, and two sofas. 

Our service was good; she was limited with her English but she was trying her best. I switched to French to make it easier on her. 

When our coffees arrived, she gave a piece of chocolate with it. My cappuccino was a delight because it was creamy. 

Something felt amiss. The vibe wasn't cool."}
{"text":"Accueillant et bien situe toutefois, mes breuvages n'étaient pas à la hauteur de mes attentes chaque fois. Je crois qu'il y a du potentiel dans ce petit café, à suivre!"}
{"text":"Spacious and good for work or study. Fast wifi. OK coffee. Music could be better. Nice seating counter next to the window."}
{"text":"I visited this cafe with my friends as it was our next stop on our barista passport. It was a quiet cafe with a lot of space to sit. The decor on one side of a the cafe was really cute with teacups hanging on the wall. Both the service and coffee were good. I guess I have been visiting many unique cafes lately so this cafe didn't blow us away. So if you are looking to just grab a coffee and chit chat with a friend, then this cafe would be good for that. But it is not a unique or instagrammable (is that a word?) experience. I would recommend this cafe to students. I would imagine its a good place to get work done as it really wasn't busy."}
{"text":"I loooved my cortado! Probably one of the bests I've had and I had it without sugar! (Also my first cortado lol)

So this cute cafe in rosemont is a great spot to study or have meetings. They have tables, high table by the window and couches. It's a very bright lit cafe with cute decor all throughout. They also have a comments book by the door. 

My friends and I went after work. Unfortunately there very very very little options to eat something, so we just ordered coffee. They have a big selection of drinks if ever you wanted something. I ordered a cortado which the barista brought to my table and also offered us a complimentary small chocolate. 

Where does this cafe lose points.... the lack of availability of food to order around 4pm. Also which bothered me more was a language issue. Just know that my friends and I are perfectly bilingual and freely speak both languages everywhere we go. However the barista working here didn't speak English at all. My friend used 3 words to order her coffee and repeated it several times, yet she didn't understand until a friend said it in French. I was very disappointed for a food business not to be able to serve their customers in both languages, especially because we live in such a high touristic, metropolitan and multicultural city. I am not saying she should be perfect but it would have been nice to see some effort made to communicate. When someone tries to do something where they're struggling the other person will help them out. Unfortunately if the customer is struggling to make an order, they are not likely to return to the restaurant even though the food might be good."}
