{"text":"Service was fabulous food was excellent atmosphere fun entertaining will eat here again with a little pricey but good"}
{"text":"Pas mal bon mais un peu cher. L'assiette manquait peut être de légume/salade. Mais le service est très bon."}
{"text":"Nice one!  I lived in San Francisco for 6 years and this is the closest I have found in Montreal to a real taqueria.  Spicy sweet potato is rad and so is the verde.   Thank you for filling a void in local cuisine!"}
{"text":"Best chicken tacos in Montreal   Friendly service. Fresh food carefully prepared."}
{"text":"Best burrido in Montreal even if it is ridiculously expensive. Take what you can get. I often come here on the weekends after a morning at Allez Up. Good espresso too!"}
{"text":"Tastes good very delicious good for group. Will bring mu wife and kid. Gf hud hgg hdd uf. Ge hrf htd hf fff rrf fr fed hyt yttrr fdde gt"}
{"text":"Dios Mio! Attention San Diego burrito shop owners, Cafe Cantina has landed in and offers a familiar flavor so hard to find in Montreal ... Quesadillas are prepared with just the right amount of cheese and crisp to it. Guacamole is smooth and fresh. Seasoned Sweet Potato Tacos are devilishly yummy. Burritos come in one size - giiiaaaaant. All in all everything is made fresh to order so you won't be disappointed.  My favorite lunch pick is the Spicy Burrito Carnitas with the perfect balance of rice, beans, meat, salad, tomatoes, guacamole and creamy sauce - delicious!  Owners Serge and partner Marianne lived in California for a while, operated a Mexican restaurant in France and have now carved nice niche in the heart of those seeking for the best burrito in Montreal. Stop by to satisfy your craving for the real deal - it's only a few minutes from downtown!"}
{"text":"I have passed by this place many times and finally taken the time to stop and eat. The food was amazing! My husband had the huge burrito and I had the tacos. The waitress was very sweet and I'm glad we stopped in for a quick bite"}
{"text":"Everything we've tried is very good. Menu a little limited but so far excellent.  Would love if they were open more often."}
{"text":"A nice addition to the neighborhood! Pointe St-Charles is not the place where you would expect a good taqueria, but it is! It's owned and operated by a family that lived in San Francisco and got the idea from there.  Food is very good and fresh. They have \"aqua fresca\" only from time to time since the locals don't buy it, so I am trying to mount a campaign, so if you go ask for it!   ;-)  I had a cheese quesadilla that came with a nice plate with salad, salsa, nacho chips, a nice meal for under $10 !"}
{"text":"Très belle place de mexicain dans le Sud Ouest. La seule chose plate est qu'il est rarement ouvert en dehors des heures de bureaux (aka le midi la semaine).  J'ai eu la chance d'y goûter durant une de mes journées de congé et ça fait du bien de goûter un burritos bien rempli et très épicé.   Leur spécialité et le naked burrito, qui est un burrito dans un bol. J'ai préféré y aller avec un burrito normal, car je suis un peu pudique.  Je recommande de l'essayer à tout le monde qui travaille dans le Sud Ouest ou pas loin pour avoir un bon met mexicain."}
{"text":"Good Mexican. Much better than anything else around. Great for takeout, but the place is charming and is nice to sit down in as well. A must have in the area!"}
{"text":"Glad we found this little place through yelp. Was looking for a take out mexican place and found this one.  We ordered mix of chicken and beef tacos - both of us preferred the beef but the chicken was not bad. Salad, Beans, Rice - all were quite good.  We liked that they were well set up for take out. Staff was super friendly.  We will definitely go back again for take out."}
{"text":"That was fun. Unexpected.   It started with a big dry Irish stout _ La Sang d'encre, from a Quebec microbrewery, to be precise, toward the end of a long workday.  Was starting to swerve while sewing, so called 'er quits for the evening, and the next thing I knew I was on my bike in Point Saint Charles with a spirited fella from Peru called Carlos, who showed me a Patricia Piccinini creature creation on his smart phone calling it a Pokemon. (...=D run on sentences Ms Crenshaw, my last literary teacher, in high school, might find cringeworthy.)  Kinda surreal.  I set him straight. He didnt care.   The two fellas running this place were a real pleasure. Great vibes. The ambiance is perfect. Interesting and skillfully painted murals on the rear walls where I sat and where Carlos rejoined me -now wearing his beautiful Corazon Peruvian soccer jersey, and gold- to chat more in Spanish, and flirt.   I had one of the special du jours: enchilada mole. I'd only had homemade mole with tamales during youthful adventures in the Sonora Desert...way before most of you yelpsters were born =D I'd wager. So not a lot to base upon. This Montreal mole was a little sweeter and thinner, but was a great accompaniment to the chicken enchiladas, beans, rice and a very sophisticated salad.    The meal was clean, excellent. Fair portion.  I really could have eaten a bit more though. Under $20 with gratuity. Pretty authentic Mexi- Cali fare from a couple of Quebecers! Thanx gentlemen!    I can see myself swinging in to eat here again.  Thanx Carlos for directing me to Cafe Cantina!, (Carlos, I learn is a cook at a Peruvian eatery in Verdun, -will check that out next time at Lachine) Sound intel always welcomed."}
{"text":"Enfin! Un bon café et resto mexicain rue Centre!   La Cantina est une petite place rafraîchissante dans le quartier. On y retrouve toute l'ambiance des taquerias californo-mexicaines. D'ailleurs, les proprios, un couple bien sympas, ont vécu en Californie, près de San Francisco.   Et cela paraît dans leur menu: quesadillas nourrissantes accompagnées de salade légère, énormes burritos, chilis, enchiladas et autres délices mexicains.   La semaine dernière, j'ai essayé la salade de quinoa. Elle était É-NOR-ME et débordait de bons légumes croustillants et de fromage fêta. La vinaigrette était délicate et subtile. Le cocktail santé, composé de carotte, céleri, pomme et gingembre fraîchement pressés, était vitaminé à souhait et fortifiant. J'ai terminé mon festin avec un bon biscuit à la mélasse et épices. Le biscuit était frais, tendre et délicieux.   Je me suis laissée tenter par un suçon mexicain à la mangue et au chili! Le sucré-acidulé du fruit dansait dans ma bouche avec le salé-épicé du chili. Surprenant, mais tout à fait jouissif pour les papilles gustatives.   Le week-end, il y a des brunchs. À essayer!"}
{"text":"I just ate a beef burrito and now I have to roll myself home. If I make it, I'll likely be back to Café Cantina. If not, well, it was a great last meal. Either way, if you eat here, you should probably bring a wheelbarrow to roll home in.   Can't speak to much because the burrito was all I ate, but judging by the contents of said burrito and by the plates that passed me by, this place doesn't mess around."}
{"text":"Loved the Burrito ! I came with some friends to the next door pub, which doesnt serve food so we went to grab a bite and well this was next door. The food is not cheap 9-11$ per dish but it is worth it. I had the Vege burrito and it was seasoned and spiced perfectly. If you like spicy food ask in advance mine was mild and altough it was huge it was so good I could have eaten another. If I am ever in the area again I will surely stop there."}
{"text":"Stellar service, spicy salsa, super yummy margaritas (not too sweet! #winning) - I have no complaints about this low key amazing Mexican joint. We had a steak burrito that was, true to our server's promise, the best I've had in this city. It was enormous, had tons of guac, and came with an understated simple slaw that was secretly awesome. We also got the carnitas tacos, which were fantastic. The plate comes with two filled tacos plus two extra tortillas, plus rice, beans, and salad... So you can make even more tacos with all the goodness that falls out of your taco.   I will be back so often they will be like, CA, we're sick of you, stop coming here. Love it love it love it!"}
