{"text":"On va dire que c'est un petit café qui n'a rien d'exceptionnel mais qui dépanne quand même pas mal lorsqu'on est dans le coin de la rue d'Ontario. Endroit très spacieux avec un vrai coin ordinateur-wifi, il y a une terrasse juste immense très agréable pour les journées d'été. Le personnel est sympa.   Le gros moins: - lorsque j'y étais il n'y avait pratiquement plus rien en boisson fraîche ni en petits rafraîchissement maison alors qu'il était à peine 16h et qu'ils sont normalement ouvert jusqu'à 00h00. Pas de smoothie, ni thé glacé, ni lait aromatisé non presque plus rien.  - niveau nourriture pratiquement pareil.   Le gros plus: - les prix. Ils ne sont vraiment vraiment pas élevés. À peine 3,30$ (taxes comprises) pour un muffin et une bouteille d'eau donc vraiment rien pour Montréal."}
{"text":"Situé dans le local auparavant occupé par une succursale de Presse Café, Jamocha Café offre une expérience sensiblement comparable à celle offerte par le Presse Café. Dans les faits, on y retrouve le même mobilier et le café y est similaire. J'ai commandé un sandwich, et de ce point de vue, je dois dire que je préfère ceux du Presse Café, tant celui que j'ai mangé était ordinaire. La force de ce café, dont la surface est étendue, est qu'on y travaille confortablement, l'espace et le réseau Wi-Fi gratuit aidant. Donc, un bon endroit si vous souhaitez travailler dans un café de la rue Ontatio."}
{"text":"C'est un café correct pour travailler et pour se prendre un lunch quand on a oublié le sien à la maison. Je suis allée à l'heure du lunch et ça n'étais pas trop occupé, donc la combinaison de wifi gratuit et grandes tables pour travailler était exactement ce que je cherchais. Ils ont un bonne variété de plats et le service est bien correct. J'ai pris deux salades : une aux légumes et moutarde dijon, puis l'autre légumes et pâtes à l'orientale, ou bien plutôt simplement à la sauce soya. Les deux étaient super bonne et j'ai bien aimé avoir l'option d'un lunch sans trop de pain. Ils ont aussi des plats chauds et des plats du jour qui ont l'air de changer régulièrement. Somme toute, c'est un endroit qui mélange le style cafétéria avec le style café sans fla fla. C'est argent comptant, mais il y a un ATM au café même."}
