{"text":"Ça fait longtemps que je fréquente ce café et le service est toujours impeccable !  La bouffe est délicieuse !  J'aime particulièrement leurs salades!  Je recommande aussi le couscous tunisien!  Un must!"}
{"text":"Plats chauds et froids en grande variété. Menu santé et maison. Grand choix de salades. J'adopte!
Manque un peu de lumière naturelle si vous la recherchez.  
Terrasse sur le trottoir, mais c'est bruyant sur Rosemont. 
Je recommande chaudement pour les plats chauds.  J'ai pris le saumon et la purée de carotte froide et une salade.  C'était vraiment délicieux."}
{"text":"Excellent service and food quality plus taste! Got the chocolate banana crepe which was delicious and not too sweet. The salmon fume was fresh and the sides were of equal caliber."}
{"text":"Une de mes endroits favoris pour les repas du midi. Des plats du jours nourrissants avec choix de salades et service très courtois. Sans prétention, chaleureux, peu dispendieux."}
{"text":"My favorite coffee shop in Montreal...by far. Reasonably priced deliciousness and great hosts!"}
{"text":"It's nothing special - but in this neighbourhood it's a gem. Drinks are OK - if you like your hot chocolate hot - you need to stress that out! The iced coffee was a weird slushy. But - one the two occasions that  I came in I - I was in the area with friends and this is all there was.  My friends who ordered food were happy with what they got. The staff is friendly and that is great."}
{"text":"Service was a bit slow. Also paid  $30 for one chocolate crepe and salmon benedictine. Didn't feel it was worth the price."}
{"text":"I really wanted to like this place better. 

Searching for a cute place to kill an hour with my daughter on a mild Saturday afternoon in February, we found Cafe Carpediem after having tried several in the area only to find them already full.

Cafe Carpediem had plenty of space, and I can see why. This cafe has all the elements of a great neighborhood cafe, but somehow just misses the mark. 

Their decor has all the hallmarks of a cosy cafe; whitewashed slat-board walls decorated with interesting objets, the pews as seating, tables made of floorboards, giant clock on the wall, chalkboard menu board; but somehow it's not coming together and comes off as \"shabby\" without the \"chic\".

The staff was friendly, but not particularly warm and the food and drinks where passable but by no means great. The latte was on the slightly bitter side (although drinkable), the hot chocolate was far too sweet and felt like it might have been made with hot water instead of warm milk. The croissant was a bit sad: heavy, dense, and a bit doughy and the tiramisu square I had was unremarkable.

Perhaps I caught the place on an off day, or the winter \"blahs\" have slowly crept there way indoors here and they have let he place go. The majority of the other reviews rave about the place, and, as mentioned above, they have all the elements necessity for a great little place but just miss the mark. 

I'm sure that with just a little love this place could be as good as the reviews say it is with only minor adjustments to the decor and quality of food."}
{"text":"Voilà enfin un café de quartier qui sait nous offrir des plats simples, avec une présentation sobre et un décor particulièrement réussi.

La vitrine du buffet réfrigéré regorge toujours de plats invitants; facile alors de se composer un menu simple ou plus élaboré. La grande ardoise derrière le comptoir permet de facilement prendre des décisions si l'imagination vient à nous manquer.

Que ce soit un lasagne végétarienne, une pointe de quiche ou une grillade, tout est à point. On peut notamment déguster de pommes de terre rôties délicieuses et une s salade aux carottes bien croquantes.

En sortant du métro Rosemont, cela doit être un arrêt obligatoire.... même pour un bol de café ou un allongé. Et profitez de l'ambiance, relaxez!"}
{"text":"J'ai donné ma machine à café espresso à des amis. Je suis un peu triste, et je m'ennuie un peu, mais ça me donne l'excuse parfaite pour essayer tous les cafés de mon nouveau quartier pour trouver qui fait le meilleur latte (et qui a les meilleures viennoiserie!) C'est mon chum qui avait suggéré d'essayer ce café puisqu'il n'était qu'à quelques pas de notre appart et pas loin du métro qu'il devait prendre ensuite pour aller travailler. On a tout deux commandé des lattes et des chocolatines qui nous ont été emmenées à la table. Il y avait comme option aussi quelques choix de petit déjeuner et ils ont l'air de faire des salades et sandwichs pour l'heure du lunch. Quand nos latte/croissants sont arrivés sur des belles petites assiettes, et réchauffés en plus, j'étais bien contente d'y être allé même si de l'extérieur, ça na pas l'air de grand chose. Les tables sont confortables et quand même assez grande. Je crois qu'ils ont wifi gratuit, donc ceux qui veulent s'y installer pour travailler devrait en profiter!"}
