{"text":"I go for lunch often. It's a good alternative to higher priced comfort foods in the area.
Family run. Welcoming . Simple. Authentic."}
{"text":"Great for students. And anyone for that matter. Yummy food  feels like you got invited into donors house and their mom cooked for you."}
{"text":"legit, mexcan food, took a lil time, nothing too long tho, very friendly happy vibes, reasonably priced, cant complain pretty solid"}
{"text":"Tacos! These are small and cheap, so you better load up! It's easy to miss this spot, but don't! I recommend getting the chips and guacamole as well."}
{"text":"Delicious tacos at great price. We tasted all except the mushroom tacos and had the guac for appetizer. Super fresh and great flavours! Will definitely come back"}
{"text":"This place is great. Delicious authentic Mexican food at a low low price. Perfect neighborhood spot to pop in for a quick bite."}
{"text":"Surprenante découverte! Petit resto de quartier où on y mange d'authentiques tacos. La sauce piquante maison est particulièrement bonne! Par temps froid, je recommande la soupe de tortillas très réconfortante!"}
{"text":"This place is amazing, authentic, friendly and without any of the pompous pretensions of other trendy restos in this up and coming foodie neighborhood. Their tacos are pure  authentic Mexican. They recently moved down the block and now do authentic Mexican breakfasts. Just got back from trying the breakfast and was blown away. Good food. Great people. Will be going back for years to come."}
{"text":"Fantastic solution to a cheap & easy grab and go meal that feels home cooked and comforts you during your lonely nights at the apartment. The guac is a MUST!"}
{"text":"No frills homestyle taco joint with some Mexican foods for sale on the side. I really think they have improved since they first opened, adding more taco flavours and definitely attracting more customers. I have a real soft spot for this place!"}
{"text":"Amazing quality, very affordable, it's too bad it is now surrounded by Mexican restaurants. Haven't bothered visiting the other ones since this one is so good. I recommend the guacamole and the beef tacos."}
{"text":"Definitely authentic and delicious. Service was friendly if slightly inattentive, but didn't bother me much. Can't speak to any of the meat options but the cactus tacos were awesome. To say this place is cheap is a bit misleading though; at $2.50 each the tacos aren't expensive, but $6.00 for a bowl of soup, small serving of guacamole, or quesadilla at a place like this can easily run up your bill. Stick to the tacos and you'll likely be a happy customer."}
{"text":"I love the place, love the family and the tacos speak for themselves ...incredible flavour. Don't miss the best and most authentic cochinita in town and I live next door"}
{"text":"Des taco très simple ordinaire mais une qualité qui fait en sorte que C très bon et savoureux avec leur différence sorte de salsa sauce frais fait maison ca donne le goût de retourner demain"}
{"text":"Very simple tacos. Small restaurant. Authentic ish. Cheap. Limited menu. It both gave us a stomach ache. Too bad wish we could have returned. That's all you need to know."}
{"text":"Fresh.Delicious.Authentic. 
We had 14 Tacos- guacamole- and the best part were the Jarritos"}
{"text":"A fanstastic restaurant!  Amazing food, prices and service.  One of the best things to happen to St-Henri in the 10+ years I've lived here.  Every single thing I've tried on the menu is great.  Please support this place so I can eat there for years to come"}
{"text":"We loved all the 5 varieties of tacos that we tried. My dining partner said it was the best guacamole ever! Highly recommended for its great value and yumminess. There is not much room to sit, it's more of a take our place. We will be back!"}
{"text":"Quaint, fun and unique, this spot has a lot going for it. There is literally a mama cooking in the kitchen, so the food is pretty good. Plus the tacos are $2.50 each, so definitely great value. 

Be warned the place is small, so large groups can be an issue."}
{"text":"Rico rico rico! Little spot with good food with that authentic taste. Eating here makes me feel like I'm eating at my friend's mom's house. Yummy horchata best extra cold. Cheap good eat."}
{"text":"Best tacos in town. Staff is SO nice, prices are ridiculously low, portions are wonderful. So authentic and warm. GET OVER HERE."}
{"text":"When my wife and I decided to travel to Montreal Quebec, I would have never assumed that a Mexican taco shop would have been on the list of restaurants that we would visit.  However, we were looking for a small and simple restaurant to try near a park we wanted to visit.  While looking on the map in my Yelp app, I came upon Café Frida.  

When you are walking up it is nothing spectacular, actually quite typical for a taco stand. When you enter you are almost transported to a border town in southern Arizona. With the bright colors and the Mexican poster boards on the walls.  It is really quite comforting for a southern Arizona boy.  Something that was unlike every other location we visited in Montreal, the owner actually didn't speak any English.  She spoke Spanish and French.  Luckily for me, my lovely wife speaks Spanish and was able to save the day. 
 
I ordered the three tacos that I would get in my hometown of Tucson Arizona.  A carne asada (beef), carnitas (pork), and a chorizo (spicy pork sausage).  When they hit the table I was instantly satisfied.  The smells and the look of the food were immediately comforting.  As for the flavor, it was a 10 out of 10. All three of the tacos were wrapped in a delicious corn tortilla and the fillings were incredible all in their own way.  In addition to the tacos, we also ordered guacamole with chips.  The guacamole was a perfect avocado salsa.  With fresh onion and tomato and a prefect amount of cilantro.  The jalapeno addition was just enough to awaken the taste buds without being too spicy.  Overall, Café Frida was everything that both my wife and I could have hoped it would be while looking for a small simple place to enjoy a quick bite to eat."}
{"text":"Fresh, authentic abs tasty food at an affordable price, although cash only.

We had chicken quesadillas and beef tacos, along with a side of guacamole.

Tacos and quesadillas were both tasty and surprisingly not greasy. Guacamole was better than 99% of the other guacamole I've had in Montreal.

Nice service too. Well be going back to try the sopa azteca as well.

I'm glad to have cafe frida in my neighbourhood!"}
{"text":"Cute place for seriously authentic, Mexican cuisine, its super small and it makes for a better dining experience, I tried the chips and guac, tortilla soup, chorizo tacos, pork tacos. And a churro

Everything was home made, fresh ingredients, everything was very very good. It's easily my benchmark for Mexican food in Montreal"}
{"text":"Very good! Very affordable! Would be awesome if they could have the oaxaca cheese to put with the beef tacos. And I wish they would have tacos al pastor (the closest would be cochinita). But if you're looking for authentic Mexican this comes super close. Hole in the wall type thing with only 6 tables so don't be afraid to order take out."}
{"text":"I was in the neighbourhood running some errands when we found this place. I recently went to a taco place in the city and had a pretty bad experience so trying Café Frida is definitely golden! 

The tacos are delicious and so inexpensive! They give you a great portion of meat. Each tacos cost $2.50. I tried cochinitas (pork and red onions) and also the beef tacos (grilled beef with pico de gallo). Also ordered a Jarritos soft drink (Mexican cola) in lime flavor. They have lime and mango. They also have churros which I did not get to try but hopefully next time! 

This place also sells some other Mexican cooking items such as peppers, sauces, seasonings... etc. I would definitely come back."}
{"text":"Decent and authentic tacos at a very affordable price! only downside is that lineups/wait times can be long during peak hours.  Will try phoning the order in ahead of time next time.   Laid back and no nonsense decor with a few tables for those who wish to dine-in. 

We came when this place first opened and had the pork and cactus tacos as they were out of chicken and beef. The guacamole is chunky and delicious as well, as is the homemade hot sauce!   Service extremely friendly and welcoming.  A great addition to the neighborhood."}
{"text":"food was fresh and delicious. service was family-like and friendly. at only $2 a taco, you cant go wrong."}
{"text":"If I could say one thing about Café Frida that I found particularly out-of-this-world good, it would have to be the carnitas taco. The first bite into that pillowy piece of heaven was like a tangy yet savory flavor explosion in my mouth and the pure definition of a foodgasm. Although the four other tacos that I ordered (the tinga, beef, chorizo, and cochinitas) were amazing as well, they all paled in comparison to the carnitas, and I feel bad knowing that it might have influenced my decision in not giving it a perfect review.

If I had to choose between Café Frida and Café Mezcal solely based on tacos, Café Frida would win hands down. Their tacos are bigger and way more satisfying and filling in every way possible, although it has a much more limited menu in comparison to Mezcal. However, I would 100% come back again for another five taco feast - except next time, I'll probably just order those carnitas since I will never stop raving about them."}
{"text":"I thiught it wss pretty over rated. Not that cheap 6bucks for a quesadilla coming alone and not that big. Same for the tacos. 
Good but a salad along with the tacos would make it better. They didnt even come with lemon..

Casual."}
{"text":"Great Taco place! My boyfriend and I, always end up coming back for more.

Place is small, but very honey and friendly. The staff are great too. Very accommodating.
Great place if you want to have some great home style taco for a good price. Would definitely recommend this place."}
{"text":"You can't beat the price quality of this place.  Great tasting food and friendly service.  My kids also love the tacos at this restaurant."}
{"text":"Best taco place in town. 2.50$ for a taco, authentic and delicious. The Tortilla soup was also the best I've had outside of Mexico! Great spot in an up and coming neighbourhood."}
{"text":"Had supper here last night with wife and kid. Very good food. Made fresh and prices are very good. I will be coming back again. 2 tacos for five buck and excellent pico de gallo."}
{"text":"Taco was amazing for a reasonable price too. Highly recommend the chicken and pork taco"}
{"text":"Delicious little tacos especially the cactus yumm. 

Love the warm service and family ambiance.  I have tried the whole menu and I keep returning to the tacos. 

Absolutely worth a try"}
{"text":"This place is a the REAL deal. There are a lot of taco joints in St-Henri now (something I'd never thought I'd see as I've been living here or visiting family here for almost 20 years), but this is the only legitimate taqueria. I'm not slagging the other places, but Frida is so tasty, simple and wholesome. I would say it's just a tad expensive for what you get, but the quality is certainly there. This is my go-to for a quick lunch with a friend or a snack in the afternoon as I live and work nearby. I love their quesadillas and really enjoyed the tortilla soup I recently had. Service is friendly and prompt."}
{"text":"Went there. Ordered 2 of every taco, a quesadilla, and one of each temales. Every taco was well seasoned and tasted different from the next, especially the cactus! 

Awesome place that hits that Mexican itch. This place is good."}
{"text":"Tried every taco and loved each one.  This is my favorite mexican in mtl right now. Amazing crispy churros filled with dulce de leche.  Ordered for takeout for my entire family and we enjoyed it at the adjacent park.  Kids had cheese quesadillas.  Love Frida!"}
{"text":"My favourite taco place in town. They may not be the most flashy, like the guys just down the road, but they are one of the most down to earth taco joint you'll find in town. And the fact that I live close by definitively skews the points a little bit...try them out when you're nearby, their tacos taste great!"}
{"text":"It's exactly what you're fantasizing about when you think of a hole in the wall place that is really a portal to another world of food and delight.  This is it.  I think the little place is actually located in Oaxaca, Mexico, but the door is on the street in downtown Montreal.  

This is down the street from our place, and completely missable if you blink twice while walking past.  Even with the bright decor, the front door looks like it goes to a dark room because of the second door behind it.  So all you get to see is a peek into a semi-fluourescently painted Mexican Grandma's kitchen. 

If you're lucky, you'll be there when they've made tamales.  Buy them all.  Chicken mole is the best tamale I've had anywhere.  

The cochinita is sweet, and may be cloying for you, it was perfect for me.  The carnitas were solid, and tasty.  The nopales taco an amazing and savory treat. Didn't try everything, only had one quesadilla (chicken -- good, but not great) but MAN, overall, this is the best authentic Mexican food you're going to find in Montreal.  This is it.  One of those gems.  The hibiscus aqua fresca was delicious and holy WOW the guacamole is the BEST I'VE EVER HAD. 

I grew up in Southern California and have been following good Mexican food ever since--do not miss out on a true gem of a Mexican delight!!"}
{"text":"Vraiment drole qu'un petit resto express soit mieux noté que les 2-3 autres resto mexicains 'trendy' qui sont sur la même rue.  Mais c'est totalement justifié, excellent service et super bonne bouffe authentique vraiment pas cher. Guacamole maison, tacos savoureux et vraiment BONS prix. 

Bien sûr avec un endroit aussi pithoresque, ca manque un brin de peinture et rénovation, mais si tu passes par dessus l'apparence ordinaire du resto, tu y trouve une petite merveille."}
{"text":"Beau bon pas cher! Plusieurs variétés de tacos et quesedilas le tout fait maisons par les propriétaires très sympatiques.. ummmm quesedilas tacos guacamole et boissons diverses latinos, ils ont un menu varié et le petit restaurant est toujours rempli!"}
{"text":"When I went to visit Montréal this past October, I never thought I'd end up having some of the best tacos I've ever had in my life.  But sometimes the world really is stranger than fiction, and it happened.  And at an unimposing little shop in a slightly less-than-gentrified neighborhood.

I have got to say that the tacos I received were fantastic.  From the appropriately toasted 6\" single corn tortilla to the spicy but not overpowering red and green sauces in squeeze bottles on the side of the bar to even the perfect price point of $2.50 CAD/taco, it was as if every star aligned that evening.  Albeit I had just driven something like 6 - 7 hours to get there that night, but if it truly was delirium and sleepiness, I'd want to return to that state as often as possible to enjoy the tacos as much as I did.  I had the cactus and mushroom as well as the pork, and while the pork was pulled and tender in a succulent pickled salsa, the cactus was amazing.  Now I have had cactus before, so it wasn't amazing because it was a new experience, but rather because of how well-cooked it was.  Typically when you eat cactus it either ends up being too soft and watery and unappealing or too much like celery, but dare I say these nopales were as tender, but not overcooked-soft, like something like broccoli or a green bean.  They had bite, they had texture, they were cleaned correctly (no spines for me, please!), their vibrant verdant color was still retained, and they screamed freshness.  Seriously killer.

There is really no reason to not go here.  Café Frida is authentic, delicious, and will give you a whole new look on tacos that you've likely not experienced before.  They have a slightly larger competitor a little bit down the street from them, but don't be distracted - this is where the real deal is.  Dig in, folks!"}
{"text":"Very delicious and very friendly staff.  If you one to try to taste something you should ask for the \"Pozole soup\".  Mexican food \"Mexican mama\" style."}
{"text":"I love this place! Best tacos I've ever had, period. And it's cheap too (2.50$/taco)! Follow them on Facebook to know when they have fresh churros. Yummy!"}
{"text":"Wow!!! Belle découverte! Petit resto express familiales sans prétention!!! La soupe aux tortillas est un délice ainsi que leurs différents tacos aux choix de boeuf, poulet, cochinita+++++

Essayez leur déjeuners traditionnels mexicain en brunch à leur nouvel emplacement!!! Plus de choix et plus de tables pour manger sur place!"}
{"text":"Mom and pop shop two dollar tacos down the street? Yes yes yes.
I ordered the pork tacos and was really impressed. If I had had more change on me I would have gotten an horchata too while I was at it. I have no doubts however that it's delicious.
I'm actually concerned that I'll just stop cooking and live off of tacos and churros now. Worse things have happened, I guess.
Very much a hole-in-the-wall type deal and absolutely worth it.

Heads up: it's cash only for the time being."}
{"text":"Lo mejor de lo mejor! I love this place the tacos are delicious!!! I hope they stick for a long time."}
{"text":"I'm having trouble writing, I can't stop thinking about those delicious delicious tacos. 

Seriously this is some kind of taco induced writer's block. It's like the after glow of a great date, only... you know... tacos. 

At $2.50 a piece the price point is perfect. It's a, quiet and relaxed little hole in the wall that will surely get busy once people realize what a gem it is. 

After two visits I've had all of the tacos, and I have to say the Cactus and Mushroom is the standpoints, it's like some sort of divine and playfully spicy bell pepper. 

What more can be said about a great taco. Good shell, great filling, perfect level of spiciness. Don't be worried about being heavy handed with the sauces on the side, they're both pretty mild. 

I'm strongly considering going back tomorrow."}
