{"text":"I went to Cagney's for a birthday dinner for my friend. It was a group of 12-15 of us. The food and the service were... well... downright fantastic.  I had the prime rib, medium and it was absolutely phenomenal. Everyone else was thoroughly satisfied with their appetizers and their mains. Though the menu tends to be on the more pricier side, the food is definitely worth it. They don't skimp out on portion size and the flavour is there to match. We had a single server and she had a few helpers as well and they were all fantastic, very friendly and up-to-par with their attentiveness. My one friend even got an ego boost because he thought the server was actually flirting with him. Whether or not she was, who knows but I'm sure it made him feel good about himself - which is always nice ya know? Thanks Cagney's, hopefully I'll be back soon."}
{"text":"I  like a place where the people  are as excited about the place and I am when I am there.  There is something real special going on at this place.  From the minute I walk in I am treated very special.   Then he comes to the table and says I just got in this really nice Red and I know you will love it.  It goes from there to what are you thinking about eating- I tell him and hand him the unopened menu.   I have even heard that his Mom still makes the cheesecake- not sure if that is correct but I can tell you, it sure taste like it.   The food the wine and the atmosphere is simply awesome.  And I have not been there for a few weeks.  I miss Alex and I need to get back in there."}
{"text":"Food was good but service lacking. Appears that with the reno they have not been able to match service with the upgraded ambiance. Think it is worth a second chance."}
{"text":"Look, it is a nice place. Staff Is very good. Only problem!?  Cooks need to learn what chicogo style Is. Drinks were made properly and very good. The bartender (Olivia) knows her craft. Food was over all good. The service excellent and  Would recommend if you don't want to drive the toronto traffic. It's refreshing change from the mundane chain places  (moxies, earls ext) will repeat.  And order the lamb. It's to die for!"}
{"text":"While visiting from the U.S. we were looking for somewhere nice to eat for our 5 year anniversary. In checking yelp, this seemed to be what we wanted. Pulled in the parking lot and saw exactly what was described here on yelp,  a somewhat rundown strip mall. We had high hopes based on reviews and were not disappointed once we entered. The atmosphere and service was great. Food was also very good. Would definitely go there again."}
{"text":"When you get to the parking lot you start to wonder about where you are going to eat. You open the door and are instantly taken by the great feeling atmosphere. The servers are great, knowledgeable and attentive. Drinks and appetizers were fabulous, the main courses were perfect portions and presented beautifully. Great place for a date, social gathering, or just a night out. Definitely a spot to go back to"}
{"text":"Beautiful decor. Intimate atmosphere. Excellent service. Exquisite food & wine. Very impressed."}
{"text":"We love this gem of a restaurant!  Food and service are fantastic.  It's situated in an unassuming strip mall between a bowling alley and a liquor store, so could easily be overlooked.  Don't let the location fool you.  This is a great restaurant.  Perfect for couples or family dinners and boasts several round tables perfect for family gatherings.  Note that this review was submitted prior to the reno and revamp of the restaurant into a wine bar."}
{"text":"Perfect restaurant to have an intimate gathering. Most places don't take reservations during Saturday's. Cagney's not only takes reservations but they accommodate your every request with a smile on their face. I know it's not easy to host groups of over 15 people but they did it with ease. Alex was awesome with handling the reservations and our waiter Phil.   Ambience- Romantic, intimate, loungey  Service- very accommodating. Especially on a busy night, they tried their best to make sure everyone got their meals and their drinks.   Food- Scrumptious! They start you off with fresh bread and a honey garlic butter. The menu has a good selection for carnivores pescaterians and vegetarians. I had the prix fixe menu with a Caesar salad, salmon or the main and cheesecake for dessert. All equally delicious.   Libations- extensive wine list and the cocktails are classics with a twist. My only gripe is I wish they would offer more wines by the glass. The cocktails are a little pricey but you get what you pay for which is quality.   Overall I will definitely be returning to try the rest of the menu!"}
{"text":"Was looking forward to taking my wife to diner Christmas Eve I made the reservations online and the restaurant showed it was open. Read great reviews and my wife was excited to dine with our party of 5. Booking was made at 8am on the 23rd and someone from the restaurant called at noon to inform me that due to a shortage of staff available on Christmas Eve they will be closing now. The kicker is not even a sorry about your birthday plans etc or bring her back another time and we will make it up to her. NOTHING was said!  Scratch this place off my list frequent patronage eateries."}
{"text":"Fantastic ambience, fantastic food and very courteous servers! Me and hubby were here today for our anniversary lunch.. the food was delicious, served timely.. they also gave us complimentary desserts!:) I highly recommend this place for special occasions"}
{"text":"Don't be discouraged by the interior/exterior, this restaurant is awwwesome!!! In fact, I kinda like the decor, it has character and it reminds me of an old church converted into a restaurant. They have been in business for 34 years which is way before I was born so I reckon that says alot don't cha think?"}
{"text":"The inside is spectacular.....Alex the owner came and spoke with us, we were happy to hear it's been a family business for over 40 years. We had Salmon Loli Pops that were packed with flavour and the steak was amazing"}
{"text":"I discovered Cagney's through Workperks, a discount offering website that's partnered with my company.   The first time I saw Cagney's I didn't know what to expect based on it being in a plaza and a plaza that's not very appealing. Cagney's is a diamond in the rough, a very rare treasure in an unsuspecting location.   Once you step inside you understand the reason why people write reviews for this restaurant. It's newly renovated and is a fun blend between exquisite and hip. The lounge area features different types of entertainment ranging from bands to vodka tasting events. It also features a few flat screen TV's to catch sporting events, news, etc. The dining area is very classy and comfortable. The restaurant features beautiful design as well as cool blue lighting to give it a crisp modern feel.   Service at Cagney's is EXCELLENT. You feel the same type of hospitality that you would feel visiting your grandma's house right after giving her her first grandchild. This is more than just a joke, it's actually a family owned business and you FEEL it, despite it looking like a restaurant that could settle comfortably in downtown Toronto or Yorkville.   The food is EXCELLENT as well. They have specials to choose from and the prices are what you should expect for a quality restaurant. I've been to Cagney's several times and have taken two people there who both loved it. I would STRONGLY recommend this restaurant whether you're living in Mississauga or anywhere in the GTA. It's worth the commute."}
{"text":"Your reviews work people! Went here to check out the French onion soup. Was not disappointed, by far the best I've had. Brought back memories of having it as a kid with my grandparents....sniff Oooey gooey goodness!  The Caesar salad wasn't bad, a little overdressed for my personal taste but it was garlicky yumminess. I loved the decor, all wood and stained glass.  Felt like I was in an old church.  Super cozy!  I'll definitely go back for dinner sometime. Fast, pleasant service too."}
{"text":"Business dinner Seated in the lounge area round table at front Recent renovations successfully executed,  very well done modern comfortable seating cool accent lighting Very friendly waiter almost too friendly although our first choice for wine was delicious he seemed to hope that we would change for the 2nd bottle - very talkative as well he wanted to know everything about each of us? Everyone enjoyed their apps and mains. The only criticism I had about my 10 oz steak was that the meal may have sat too long before arriving at the table not quite piping hot. Will return"}
{"text":"Came here for a special birthday cause for the prices we figured it would be  exceptional. Food was cold, items were not served as per the menu and worse of all the waitress was inexperienced and had no clue what was going on. After the meal we addressed our concerns with Managment in private and he said \"I will take care of it.\" His idea of \"taking care of it\" was offering us a free shot of liquor. Gee thanks a lot but we have to drive. Thanks for nothing. Will not be returning and don't recommend this place. Poor bang for the buck. One star for being open."}
{"text":"I have been to this place quite a few time with work colleagues as big groups. Let talk about the place first as its very different than lot of restaurants I have been to. This place is a hidden gem and is hiding in one of the plazas in Streetsville.   The service was fantastic as they served us (20+) fast, nicely, friendly. The orders were taken accurately and all the food came out together and was cooked well and was warm at the same time. The two servers were great and they did separate billing as well. The food was delicious and I didn't hear any complains from my fellow colleagues.   Last thing I hear was they were renovating and I would love to check it out soon again."}
{"text":"Debated hard between giving this place a three star rating v.a. four star rating. Wanted to choose the latter, because I decided to give it the benefit of the doubt and assume that I ordered the wrong dish, but after careful deliberation, it does deserve the former.  We came for a company dinner, and were greeted by a very friendly waitress. She gave us sufficient space but also checked it when necessary. Take note that this place isn't made for sharing, and so we each had our own individual main. We started off with wine and appetizers - ordered a grilled calamari, saganaki, crab cakes, and steak bites. We also received complimentary bread with honey garlic butter. The butter was so good and rich, while the bread smelled so fresh! It was like it was freshly baked. The crab cakes were nice and crispy, and the saganaki came with a great show! The waitress yelled \"opa!\" and lit the entire cheese on fire. My ultimate favourite was the grilled calamari. It was so fresh, and came on a salad bed that was seasoned perfectly with balsamic vinegar and olive oil.   While the appetizers were good and impressive, I really wasn't a fan of my main. I found the majority of the plate to be too greasy.  I had decided to live a little and ordered the surf and turf, getting the 8oz New York Steak with the 9oz lobster tail. I got it with a side of baked potato and vegetables. The lobster tail came with a heated garlic butter, while the potato was served with sour cream and butter. The table also got some buttered mushrooms to share. The mushrooms were so delightfully soft and buttery. I also liked the grilled vegetables, but found them quite oily. Overall, everything was actually quite greasy, which is exactly why I was tempted to give this place three stars. My medium rare steak was quite stringy and not at all tender. It came slathered all over with a generous layer of fat. I wasn't a fan, and so left half of it untouched.   Meanwhile, the lobster tail was dry and under-seasoned. I understand that it was to be consumed with the melted butter, but I believe that a good lobster tail should be flavourful and tender as is.   That said, my colleagues thoroughly enjoyed their steaks. Most of them ordered bone in steaks, so that likely made the steak fattier and more flavourful, unlike my New York Steak. Two colleagues ordered the Tomahawk steak to share, and it was massive! Came with a supreme light show with a sparkler, and was so impressive in size. I was given a bit to sample, and was blown away by the taste! My portion was perfectly seared, and had a solid proportion of fat, allowing the flavour to come all the way through. It was an explosion of flavour!!!  Would I come again? Maybe, but I'd be more likely to splurge on a better steakhouse. And even if I did come, I'd take care to order it with a bone in steak, where chances are that the steak is more flavourful and tender. No more surf and turf for me, no thanks!"}
{"text":"This is a great place. On the outside, it looks like a Chinese buffet but when you walk in, it looks more like a Vegas Steakhouse. Its modern decor looks like something from the Cosmopolitan Hotel. The service is great, the drinks are amazing and the steaks are juicy. I've eaten here 2x and going back gain tonight. The ribeye is crazy good. Make sure to check out the shrimp cocktail. The shrimp look more like lobsters they're so big.   The wine list is short and sweet. They've got a nice selection of wines and they're not over-priced. I'd recommend this restaurant for anyone looking for a upscale steak place for that special occasion. They will not disappoint."}
{"text":"Cagney's has been in the Streetsville community for 40 years from what I'm told but have you been in recently? Well you should! This is no longer your fathers bar/restaurant, heck it's not even your grandfathers restaurant anymore! After an intense overhaul and remod it's now a sexy, beautiful, and modern spot that's ready to accept dinner, drinks, dates, and everything in between!  I was in this week on Wednesday and sat at the bar to enjoy a drink and some lunch along with making use of their free WiFi and multiple outlets (USB/power split) along the bar for folks like me looking for a HUB to do work or hang out during the day.  I'd heard that they were doing craft cocktails and doing them right so without question I figured - \"it's 5 o'clock somewhere\" and ordered my go to cocktail, the Old Fashioned.  Tickle me surprised, and other local spots take note - Cagney's is THE ONLY spot doing these RIGHT. Many try to make an OF but so many fail... most in fact! The Cagney's OF, uses earl grey simple syrup, and I believe Jim Beam Bourbon with Orange bitters -- the aromatics of orange coming off of the drink were fruity and wonderful. Plus points for making use of a proper large block ice as opposed to chipped or crushed ice. Excellent balance between alcohol and sweetness. Perhaps just slightly heavier on the sweetness.  To eat, I had the chicken club sandwich on the reccomendation of my server. She sold me when she told me it was made with double smoked bacon! It's a huge serving of chicken breast, topped with a delicious ailoli, and that DS bacon all pressed together and toasted to perfection. Easily the best chicken club I've EVERY had.   I was warned by my server that The side Caesar salad would be the best I've had and it too was incredible. Fresh dressing, not from a bottle, a generous helping of Parmigiano flakes and croutons and a nice slice of crispy pancetta/bacon on top! Definitely a top contender for first place!  Amazing overall, and I cannot wait to return to try out more of their menu - there are some good things cooking in Streetsville (an area to watch).  Eatcrest Out!"}
{"text":"Exceptional food and great service! Love the wine selection and suggestions, also love the fish tacos!"}
{"text":"Went here for a work event. Great dinner and nice ambiance. Very formal environment and pretty pricey though. Would definitely recommend it for a date night!"}
{"text":"Been coming here for years and today got the chance to see what they did from the renovations .  Had the lunch version bison burger which was very good saw another review about it being dry this one was not .  They kept the traditional cesar salad (not as garlicky now) added a prosciutto chip and shaved grano padano was also supposed to have crustini but it was omitted (server apologized).  The decor is beautiful and lots of light from a big window., very open not as maze like.  I was very impressed with the chandelier.  It was not busy though I bet not everyone knew they reopened for lunch recently.   It's not a family restaurant any longer now so forget the kids meals it's adults only which was fine by me. Though this might be the end of us having lunch there during the work week it's priced out of range for casual lunch.  My Opinion fine dinners here would be nice (Angus meat choices)."}
{"text":"Atmosphere : decor modern contemporary very clean. Was expecting the food and service to reflect .  Food : service was rushed out , they didn't allow enough time to finish our appetizers before bringing the main course .  The meal was mediocre , I could have dined at the keg and enjoyed a comparable meal for a fraction of the price .   Service : our sever was not very educated with the menu. When asked the type of oysters that were served she was clueless and could not provide much insight on wine.  To their credit they did compensate us with free dessert for the rushed dinner service.  I definitely would not come back."}
{"text":"This is my favourite date spot in Streetsville... And a fine example what a good reno can do to modernize and revitalize a seemingly tired business.  Its unassuming location in a strip mall may keep it off the radar of some snooty snoots, but to those people I say, \"your loss!\".  The freshly redone space is very stylish, clean, and modern, with romantic textures and visually interesting design cues. As for the food, it is always top rate. Nice cuts of meat and fish, always well prepared and beautifully seasoned to suit most palletes. I find myself craving many of their dishes soon after a night there.... The Arincini appetizer with braised short rib is the most decadently rich, beautifully executed dish I may have ever tasted.  They NAIL this dish.  Try it!  The staff is professional, knowledgable and friendly... And the service is on par with most higher-priced downtown fine dining experiences.  It's a great place for husband and wife trapped in burb life  to steal a date night out now and again. I've been here several times with my wife, as well as friends and colleagues, and I always leave happy and well-fed.  If you are looking for well prepared, tasty steakhouse goodness at a fair price while enjoying a charming ambiance, you will definitely enjoy a night out at Cagneys.  My one tiny complaint is the menu is fairly static, and wine list a tad shallow, and I'd love to see a bit more variety and risk-taking from the talented kitchen team... But that is really a minor criticism that likely comes from visiting so many times :) And I certainly will be back soon!"}
{"text":"Very nice place the restaurant is amazing the food is delicious. Varieties of wine selections. It also has a nice lounge area .suitable for a chill weekend. Cheerz to y'all."}
{"text":"The food is great, the service is great. The reason I'm giving only 3 stars is because the music is TOO LOUD! One shouldn't have to yell at their fellow diners to be heard. Once the restaurant fills up it sounds more like a nightclub rather than a fine dining restaurant. Everyone is screaming to be heard and all the while, the music is blasting.. I do mean blasting. Turn down the music and permit your diners a conversation.. for crying out loud... (pun intended)  LOL"}
{"text":"I had such a wonderful night having my 30th birthday at Cagney's last night.    The food was good, not amazing...but what I had was good.  We got a Caesar salad and calamari for our appetizers, which I enjoyed.  For my main, I had steak and lobster and the lobster was HUGE!  Lobster was a bit overcooked, but I still enjoyed it.  Unfortunately my steak was overcooked, so I informed my server who had another steak made for me which was greatly appreciated...but then it was too rare when I got it back again.  I didn't want to send it back again and I was full anyway as I ate my lobster and veggies while I was waiting for my steak to be remade, so I just left it.  I wanted my steak medium rare, I got it medium well the first time and rare the second time.  I'm tired of trying all these expensive steak houses and they can't cook it to my liking.  The steak was also lacking a bit of flavour for me.  So I'm going to stick to The Keg if I ever have a steak craving.  Food...3/5  Service was on point!! My server was AMAZING!! Unfortunately, I can't remember her name.  We had an issue at the beginning as some ppl didn't inform the server if they were ordering from the prefix menu they were offering for the Savour Mississauga week.  I believe my group and the server were both at fault as the server should have asked if we were ordering off the prefix meal when taking our initial orders as the portion sizes are different when ordering the prefix meal.  So our server stated that some of us could not get the prefix meal as the salad we got was a full appetizer salad, we asked to speak with a manager and our server spoke with the manager who stated it was ok and those who originally wanted the prefix can still do so even with the larger salad.  Thank you!! This is what great customer service is all about.  Also, we got complimentary champagne which was greatly appreciated.  My server was so pleasant and polite the whole night and apologized many times for my steak being cooked wrong.  Service...5/5  Atmosphere was BEAUTIFUL!!  From the outside, you wouldn't think the inside could be so beautiful.  I loved the feel and decor of this place...5/5  Overall...aside from the little mishaps, I enjoyed my birthday and I do not regret having it at Cagney's.  Customer service absolutely goes a long way and I would probably still go back, probably just wouldn't order a steak....possibly something else lol.  Thank you Cagney's for allowing me to celebrate my 30th birthday with my special ladies!"}
{"text":"Well, today I made good on paying my losing bet with my Son-in-law; Leafs beat Blackhawks a few months ago for a steak at venue of choice! Aleks chose Cagney's which didn't rank on my short list but they have free WiFi. We arrived at 1:20pm and were seated immediately in a large half-moon booth within the dining room, with low lighting and quiet Spanish music. Our server, who didn't introduce herself, was pleasant and efficient. Our order...$19 Peppercorn 6oz Steak sandwich with home cut fries for me and Aleks selected the 8oz New York Angus Steak with fries and vegetables for $32. Medium-rare was our cooked preference. To celebrate my gloom, two Cameron Amber ales for $7.99 each. Meal preparation was surprisingly quick and it was delicious!!! It was also nice to be able to carry on a conservation while dining without having to compete with the restaurant sound system. We decided not to have dessert as the meal portions were lunch perfect. Upon finishing our lunch, our plates and cutlery were cleared promptly. I requested and received my bill quickly and Ivana, our no introduction server, was rewarded with an 18% tip for a terrific meal experience! Yes, $89.31 is an expensive lunch for 2, but it's cheaper than getting my daughter back...from my Son-in-law! Debt settlement completed."}
{"text":"One again great service and food quality at Cagneys! Gus and Alex are wonderful hosts and the ambiance is only superseded bybthe food quality."}
{"text":"I went to Cagneys for a date night with my husband. While dining, the service was excellent. I ordered the Butternut Squash Ravioli. Later than night and the next day I was extremely sick. I had to visit an urgent care center because I was so ill after dining at Cagneys, and it was determined that I had food poisoning and I was prescribed antibiotics by the doctor. I was still ill three days after dining at Cagneys.   To prevent this from happening again to anyone else, I decided to call Cagneys to advise them about my experience. I spoke to the manager Gus,and I explained that the service that night I ate at the establishment was wonderful. However I was really sick after eating my meal and that I was told that I had food poisoning. Gus then began to argue and yell at me indicating that there was no way I became ill from eating at Cagneys. I was shocked by his behaviour, totally unprofessional. He continued to yell at me even after I explained that I just wanted to ensure that this didn't happen to anyone else.  I would never recommend this establishment. I will make sure that I post this story on every review link I can find."}
{"text":"Best burgers  and service  in along time. So pleasantly  surprised.  Went for lunch.. and the burger was fantastic, as a middle  aged  American  I feel I am an expert!"}
{"text":"Used to go there years go before the Reno I think it's a wanna be steak house  Great idea but serious overprice when you compare to the big boys  Paid quite a bit for a meal which came under cooked and had a seriously rare steak that didn't have much flavour  Could have spent the same money anywhere else but gave them another shot  Staff is attentive  Place is clean and layout is great for the space tat exists  Portions could be better  I got a scoop of rice and one slice of a pepper with a steak  $12 for a Caesar to drink  $12 for a Caesar sale which used to be homemade with romain but is now iceberg and is clearly not a homemade dressing which is disappointing as used to be a staple . $20 for a 8oz burger Dry souvlaki which also was sad But it's a great spot if you come with a large group I could see good times there just have a hard time justifying it"}
{"text":"I've been to Cagneys twice in the past just for drinks and apps and had an enjoyable experience but my past visit for dinner was very disappointing. I'll start by saying the fresh bread and butter, and crab were good. But we were let down with the inedible mussels that had to be sent back. Once I was half way through my meal my boyfriend finally got his replacement for the mussels ( shrimp). Which wasn't taken off the bill. Experience and service is a must during a dining experience, and this left a bad taste in our mouths. I think this restaurant is trying way to hard to be in the high end category, and doesn't make even close to the cut comparing food and service to prices. To sum it up, it was a disappointing 200$ meal and won't be back."}
{"text":"Our meals were fantastic and the service was phenomenal. They made my husbands birthday dinner very special!"}
{"text":"I went here before the renovation and had posted about this place previously. The owner, Gus, is a complete jerk. His \"restaurant\" placed an ad on clip deals for $30 gift certificate for $15 dollars. I decided to purchase said certificate and when I tried to redeem it, I was heckled by the waitress and the owner stating that I must be crazy to think the whole meal will cost only four dollars. Tried to explain that I found the coupon/deal on clip deals and showed them the website and the owner blurted curse words and threatening words, along with threatening to call the police. I then called clip deals to advise of what had transpired and they offered me a gift card to another place. The humiliation and the brash attitude of the owner and wait staff at this place is something no one should ever experience. I cannot believe my experience in this low down, dirty place.  Negative infinity rating for this place."}
{"text":"Date night! We were actually supposed to go to a steakhouse in Orangeville but couldn't get a reservation. Thank god Cagney's came through.   My SO couldn't believe the location of Cagney's. Located in a plain looking plaza you would never think this place looked the way it did in the inside from the outside. You would also never think this would be an upscale restaurant.  We were seated promptly and I was a little upset where they put us, but oh well. Beggars can't be choosers. We were seated in the bar area right by the window.  I would have wanted to see more of the beauty of the restaurant and the chandeliers.  THE FOOD: We decided to start with the saganaki and the Caesar salad. We were also given some warm complimentary bread. Apps came out in a timely manner. They lit the saganaki at our table and everything. Like it should be. I would have liked it to be more burnt lol but that's ok. It was a bit salty but edible. If you put a piece in the buns they give, it taste so much better. The bread takes away from all of the saltiness. The Caesar wasn't anything special. I wouldn't get this again nor would I recommend it. Very basic. I can't agree with the other reviews.  I thought this would have been made table side or something, but it just didn't stand out.  Since I find myself to be somewhat of a prime rib connoisseur (lol) I had to get the prime rib. Side note: I actually read an article recently on insauga that listed the top 5 most expensive restaurants in Mississauga and tonight I have officially been to all of them. At 3 of those places, I had ordered the prime rib...and now 4 of those places. I got the regular cut and it was a nice size. They also serve it with a generous amount of mash potatoes and just enough veggies. The first bite of the prime rib was amazing. I was definitely feelin it. Although the more centre \"leaner\" pieces were a bit hard to cut, not as juicy as the outer parts. But still good. My SO got the chicken peppercorn and he loved it. He cleaned off his plate and even ate his veggies...and he hates veggies! Lol. He even enjoyed a couple pieces of my prime rib.  I couldn't breathe at the end of the meal but OBVZ had room for dessert. I had to try the homemade cheesecake. I'm sad I didn't love it. I didn't really enjoy the crust. There must have been some chocolate in the graham cracker and/or chocolate drizzle which threw off my taste buds. I haaate when chocolate and any fruit collide. I would have preferred an old school New York type cheesecake.  THE SERVICE: Our server Jackie was great! She was always prompt and always left just enough time between checking up on us. She also had no problems with taking pictures for us at the end. She for sure added to making the experience great!"}
{"text":"Good service and good food. A little more expensive than anticipated but overall a good experience."}
{"text":"After a long bookmark life I finally got to visit this place for my big 3-0! And now a few times after that point ;)  Been for brunch, lunch and dinner now...  Service is always so good, friendly but not fake. I've had their ribs, pasta, fish special, calamari and a bunch more.   Everything was delicious and good portions. The wine list is great and fairly priced.   The interior is nice and modern but wish it was a bit more comfort over leather.   Booking process is easier and beat part is that it's in sauga!"}
{"text":"Went here for date night and arrived to a strip mall. The ambience was modern with lots of purple lighting. That's unfortunately where the highlight ended. Our server was not trained in customer service in the least. The bread arrived at the table warm however their homemade butter should actually be offered for dessert. Took about 30 minutes to have out water refilled. Ordered the lamb skewers for our appetizer and the server decided it was appropriate to take away the plate while there was food was still on the plate. Despite mentioning that we were still working on it, she responded with \"the mains will be ready shortly\" and proceeded to take the plate away. As for the mains, the New York Strip was a good cut however, not cooked as requested and not seasoned at all. The gnocchi had an extra layer of oil on top of the dish. Needless to say, we didn't stay long and skipped dessert."}
{"text":"Beautiful ambience for an elegant lunch/dinner. Food was fantastic and service was great."}
{"text":"I found this restaurant to be very different from what their website would suggest.  My wife and I were looking for a romantic anniversary dinner, and this place seemed to fit the bill.    Although it was priced as an upscale restaurant, we found the atmosphere and service to be anything but.  Our original server checked on us twice in the first 5 minutes, then appeared to forget we exist.  Another server stepped in after we had been there half an hour, but we almost walked out when we went more than 15 minutes without seeing a server.    The atmosphere is fine if you're facing the back of the room, but you can't really hide that you're in a strip mall, and I spent most of the meal distracted by people walking right in front of the store window on their way to the bowling alley next door or coming from the LCBO on the other side.  Very disappointing.  We had pescatore pasta and salmon.  The food was ok, but not spectacular.   The pasta had some unique seafood on top, but ultimately just felt 'ok'.  The wine also was just 'ok'.  The review so far would have rated 2 stars.  I bumped it up to three because the serving staff and maitre'd that took over for our original waiter were very nice, and talked intelligently about the food and wine pairings, making sure to greet us on our way out and acknowledge the special occasion we were celebrating that evening.    Ultimately, the food and experience weren't worth the price tag to us, and we will not be returning.  This felt like a casual restaurant with an upscale pricetag, and did not meet our expectations.  We know of better places to spend $100."}
{"text":"I'll start off by saying that I give this place a 3.5 stars. Came here for lunch after reading some awesome yelp reviews, and scoping out the place for a potential when friends come to visit later this year.   The restaurant is in Streetsville, which is a beautiful cute little area, so I was a bit surprised to see the restaurant located in somewhat of a strip mall, next to a shoppers and a Scotia bank...the inside decor, however, was spectacular. Very classy, sleek and modern. Service was impeccable throughout our lunch.  Food, unfortunately, was a bit of a hit or miss. We ordered the steak dip with fries, and the calamari.  Calamari was alright, but either over or under cooked - the texture was just weird, gooey and slimy; not the usual crunchy-chewy I'm used to. Batter was also oily. The aioli was delicious. The fries were also soggy and limp, but the steak sandwich was marvellous - the beef was tender and moist, the ciabatta was crunchy yet soft. Loved the dipping sauce.  Would definitely consider coming again, maybe for dinner next time, and skip the deep fried stuff."}
{"text":"This place is such a GEM. Its been in streetsville for as long as i can remember. My family has gone here, ive gone here and i hope i can take my kids here one day. The decor hasnt changed. Its very very old BUT its nice. It has large wood paneling and outdated seat covers but the ambiance is unreal. You feel so at home when you walk in this place. I consider it to be very romantic. The lighting is just that perfect tone and the booths are so large you feel like your in your own space. Ive eaten here many times and love it.  The place is family owned and the owner is a very nice man. You can tell they have a passion for what they do. The bar area is closed off from the rest of the space which is nice. I just love it.  The food.....unforgettable!! They have THE BEST french onion soup a person could ask for. Its like love was just baked all inside it. The cheese is perfectly on top the soup is just salty enough that it doesnt take away from the flavour. The bread and onions are perfectly cooked inside. Its just to die for. The Cesar salad here is famous. Everyone knows the Cesar salad is the bee's knee's! You just gotta have it. The menu is a good size with all the right foods on it.   Overall.....GO HERE, you wont be disappointed!!"}
{"text":"Amazing food, amazing decor, love the hot bread. Friendly staff.   Very expensive! If I can afford it I will return."}
{"text":"Great service! Seafood pasta had amazing huge shrimp. I didn't really like the salmon in it though. But very tasty sauce. Wish they had calamari in it. Wine was good as well"}
{"text":"i liked it, didn't love it.  have eaten at the now defunct guelph location as well.  actually one of the wife's and mine first dates was at Cagneys in Guelph.  ribs were decent, sort of the boiled and sauced type.  didn't seem like a lot of love went into the food overall, sort of reminiscent of The Keg-style chain food  I'd put it on par with the Keg really, that's my closest comparison IMO"}
{"text":"I've now been here twice.  Amazing service, the owner Alex is visible, approachable and a great guy.  Amazing interior and a very upscale atmosphere.  Had oysters both times ... They get them directly from Rodney's on King Street in TO.  Don't let the shopping plaza location fool you ... This is a great find in Mississauga (Streetsville)."}
{"text":"Food was served cold, potato did not melt butter. The décor was great, but light from the parking lot shone in our eyes on one side of the table making us squint all night.  They missed out first drink order and we could not get water without having to flag down a server. should this not be something they are aware of at all times ?  We did get attention when we ordered a $150.00 bottle of wine, but by then the tone of the evening was set."}
{"text":"I came here during a work team dinner and we had a fixed corporate menu: choose 1 item from 3 appetizers, 4 mains, and 2 desserts.   Environment: Honestly upon walking in I thought I had walked into a bar/night club, because the lights were deem and it was neon purple... They really tried to make the space hip and trendy, as the dining space was beside the bar table, which also glowed.  The size of the restaurant wasn't very big, and despite it having a private dining room for large groups, our group of 15 had to sit outside with the regular customers, and it definitely felt a little tight.   Food: From the corporate menu I picked the Caesar Salad, Chicken Breast with Peppercorn Gravy, and the Chocolate Ice Cream.  The Caesar Salad was very interesting because the garlic Caesar sauce was actually spicy, to the point I had to continue to drink water.  The Chicken Breast was probably my least favourite item from the night, because the meat was too dry and too stiff to cut into, and its dry texture was also difficult to chew. I did really enjoyed the peppercorn gravy and it paired well with the mash potatoes on the side. But just from how bad the chicken breast was, I wouldn't recommend getting this dish.  The Chocolate Ice Cream was had a cool presentation, as it was actually vanilla ice cream in the middle, covered by another layer of chocolate ice cream on the outside. The flavour was great as well and I really enjoyed its smooth texture.  One thing that I found quite funny was that their water actually came from a pre-packaged bottle that basically looked like a wine bottle. However, I did not taste anything different between this premium water and tab water.   Service: Service was kinda slow for us, as the servers spent more time taking care of the small groups of customers than to check up on us frequently.  I've noticed that sometimes the servers would just stand around near the bar table immense in their own conversations, as opposed to checking if any customers need anything."}
{"text":"Very nice restaurant, great for special occasions. We had lamb skewers, a burger and the chicken peppercorn, all three items were very flavourful and well made. The atmosphere and ambiance are perfect, great decor inside. Derek is very nice and accommodating."}
{"text":"This place is seriously a diamond in the ruff. From the outside you would not know what foretells inside but I can tell you as soon as you enter the doors it's like you are instantly teleported to another world.  This place is elegant and chic! The decor is modern, fancy and tres chic! You feel sexy just dining in the ambience and that is what attracts me to this place.  I came here for dinner in December 2016 w/ a girlfriend. Our waitress (Jackie) was exceptional!! What really impressed me was when she saw that I put my gum on my side plate and took a napkin and removed it. Never, I mean never, have I had a waitress done that in my entire lifetime dining experience.  She was bubbly, attentive and just a joy to be around. Please, please tip these girls well. They work very hard. I also appreciate their appearance. They match the decor perfectly and are all dolled up to perfection.  Now, let's talk about the food. Omg, the Greek dish   With the chicken skewers, rice and Greek salad is so tasty. It's by far the best Greek dish I've tasted and I've been to a lot of Greek spots. Clearly the chef is doing something right if you are spitting out Greek food better than actual Greek restaurants.  My friend ordered the ravioli and said that it was quite tasty as well. The presentation of the dish was beautiful. I can really appreciate restaurants who don't get stingy with the seasoning.   I came here last week for my birthday lunch and Everything was perfect. It was lunch but the chef was able to accommodate me on my usual dish which is from the dinner menu.  I would like to add that this place is really nice to take your boyfriend/hubby on a date. The atmosphere at night is really nice. It's live, poppin and has a great energy to it.  I will continue to visit the place. To all the people running this place you are doing one hell of a job."}
{"text":"I've been here on several occasions and while the food may be good, it's by far nothing to write home about.   Ambiance: While the ambiance may be nice, I feel it \"isn't for everyone\", the lighting I feel is reminiscent of a club of some sort and doesn't really match the price point the restaurant is at. While a dark restaurant may signify expensive, they just don't do \"dark\" right.   The food: While the ambiance may just be me being too critical, I feel the food is what really takes this place down (from my experience). I have given this restaurant a few chances and they have failed me on each occasion, I found the soups to be way too salty and the burger to be something I can get from Hero Burger. I also had a steak on one occasion and perhaps I just went on a bad day, but it wasn't what I expected it to be.   Service: Had the food been good I would have rated this place a solid 4 star. The service is very good; the wait staff is very attentive and will try and rectify and issues you may have. While the kitchen did try and fix the food, it just came back the same.   All in all I would still give this place a try, perhaps someone else will have a better experience than me, I just wrote a review based on what I experienced."}
{"text":"Cagneys is the sort of place that you will have known for ever or happened to try it because of a review. It's location inside a strip plaza on the north end of Streetsville would probably not attract many passing fine dining folks.   However, once you're inside, you see a renovated space with a 90's Vegas vibe and a modern seating plan. The look would be more South Beach were it not for the beveled mirror tiles.  However that minor design flaw aside, the ambiance and seating options are nice. There is a lounge area with some large booths, tables for two and the bar. There is a second area with more traditional tables. The two spaces are divided by the entrance and a nice wine wall.   The menu has something for everyone, even though many know it for its steaks. We had the grilled calamari appetizer which was hot, tender and tasty. My guest had the veal parm which she felt was a bit dry. I had the 12 oz New York which was cooked a little on the medium rather than medium rate ask, but the flavor was great. Judged on food alone I might have given the appetizer a 4.5 and the entrees a 3.5.   Service from the initial greeting to the great care Jackie provided us was professional, quick and when appropriate, playful."}
{"text":"I've frequented Cagney's several times now and each time I'm never let down.   From the service to the food and wine, everything is impeccable.   Every single item that I've tried has always been delicious; steaks are always done perfectly to request, salmon and pasta dishes are packed with flavour.  Highly recommend!"}
{"text":"Took my husband here on Saturday night for his 40th birthday.  I checked online to see if we would have to make reservations before arriving - there were tables available at every 15 minute interval so I figured we'd be fine.  We arrived and were met at the door by the manager who was eager to seat us, until he saw my husband holding a car seat with our 3 week old baby.  His demeanor changed immediately and he told us they were full, and the wait would be 20-30 minutes. There was no line up, and several people left as we stood there speaking to him.  He very clearly did not want us dining there and took us for idiots which is what we would have had to be to not see what was happening.  Needless to say we left and dined at The Keg instead, while our baby slept through the entire evening (as we knew she would since we timed our dinner around her feedings so as not to disturb other diners).  We will never be back to Cagneys, which is a shame since we are constantly on the look out for new great restaurants to host work functions. Your loss Cagneys!"}
{"text":"I decided to have my birthday dinner at Cagney's after the high overall ratings. This was my first time there so I only expected the best based off reviews. It was quite empty Sunday evening so one would assume the service would be top notch.  I didn't expect the beautiful restaurant to be located in a random strip mall in Streetsville. Once you step inside the restaurant you forget that it's even in a run down plaza. The interior of this restaurant is very exquisite and definitely fancy.  Everyone enjoyed their meals but we all just thought it was good. We expected to be wowed for the price the meals were. Service slowed down when our meals arrived. By the end the waitress wasn't around so we all just punched in our bill amount and completed the transactions.  My friend had been there before who said the service was amazing. I guess we missed out on that part. It was okay for our first visit but I don't think we'll be back."}
{"text":"I was responsible for organizing our company's sales meeting dinner. I wanted to pick a place different than the usual Americana style restaurants that were situated near our hotel. My initial contact was with Alex the owner of the restaurant. Upon arrival we were greeted by Alex's sister and she was very nice and welcoming. The place is classy with a very nice décor. Looks like a sexy restaurant Vanderpump style (SUR).   Derek and Jared were our waiters and their service was exceptional! On the ball service and very courteous. I'm glad I took the chance to bring our group here based on the great reviews I read on YELP.  The overall presentation and quality of the food was definitely worth the money and we will be back here again real soon."}
{"text":"Compared to other steak places, this place borders the side of being over priced. That being said the food was quite good. Ordered the veal and as you can see in the picture it's GIANT. For $39 it was a dinner special that same with a choice of salad to start, veggies (which is just 3 pieces of asparagus) and a side. Very filling and delicious but pretty pricy. It sits in a fairly run down plaza but once you set foot inside the restaurant it's a fairly upscale atmosphere."}
{"text":"Probably one of the best Lamb Chops I've ever had. Made to perfection. The atmosphere of this place is gorgeous and the food matches."}
{"text":"I've been meaning to try Cagney's for a while now and finally got to take my dad there today for Father's Day.   Overall: Food: 10/10 Setting: 10/10 Service: 6/10  Here's why:  I absolutely love the lighting and ambience of the restaurant. Everything from the dim purple lights to the comfortable booths to the tabletop candles made it look and feel classy.   My dad ordered the regular cut roast prime rib ($36) and I ordered the BBQ pork back ribs ($33). His came with vegetables and mashed potatoes; mine came with fries. Of the two, I definitely recommend the prime rib. It's tender and seasoned to perfection. The vegetables top it off very well. As for the pork back ribs, I would've preferred some vegetables on the side. The servings for both were huge and neither of us finished our plates. Overall, the food was amazing--the prime rib was the best meat I've had at any restaurant I've been to.   However, the service was a little off. Once seated, we had to wait around 10 minutes for our waiter to come to our table to take our order, even though the restaurant was fairly empty. Immediately after saying our orders, he forgot them and asked us again. Along with our meals, we ordered the cactus lychee martini but even after we had finished half our meal, the drink hadn't arrived. I asked the waiter about it and he seemed to have completely forgotten about that order and only went back to get us our drink when we had almost finished eating."}
{"text":"Gord and I had brunch today at Cagney's.  It's located in a strip mall on the main street so there is lots of free parking.  We got there right at 11am just as they were opening.  It was renovated late last year (we'd never been before) and is really nice inside.  There are lots of different seating areas, depending on what you are looking for.  From where we sat, I could see the wine room (it's just beyond the entrance) ... that's a room I wouldn't mind being locked in!  Our server was Roshan and he took excellent care of us!  He was very friendly and helpful.  Roshan started us off with a bottle of mineral water and banana bread.  I love banana bread!  Gord and I ordered Mimosas.  Yum!  I ordered Johnny's Breakfast (named after the chef).  It was delicious! I saved the big bowl of fruit (strawberries, blueberries and melons) 'til the end and it was a nice way to finish.  It was a lot of food and I shared some with Gord. Needless to say, I had to say \"no thanks\" when Roshan suggested dessert.  Gord ordered the Classic Eggs Benedict.  He doesn't have it very often and really enjoyed it.  I took a look at the supper menu and it includes hamburgers, chicken, lamb, ribs, seafood, pasta, etc.  Given the fact they have a wine room, I bet it would be a nice place to have a glass or two.  If you are in the Streetsville area, I'd suggest you check it out."}
{"text":"Like some others have already said, this is one hidden gem. Their staffs are friendly, decor are very modern and pleasant. While their dishes do come with a hefty price tag, but they taste wonderful and VERY generous portion. Yes, their salads are big, so keep that in mind when ordering. Their steak are done to perfection, rack of lamb tasted fresh and seasoned perfectly, and fish...I asked for pink-in-the-middle salmon, and it was done. They only had two dessert choices this night: flourless chocolate cake and house cheesecake. We hate it so much that we fought over who will get rid of them last....I mean hate the sight of any of it left, that is....well we DID have a small chunk of the chocolate cake left ONLY because we were just so full. We'd definitely come back and try other stuff."}
{"text":"Prior to the renovations we were regular customers but since the renos we have been just 3 times and that's probably it.  Our dinner last Friday was tasty (except the Caesar salad) but not exceptionally so and the ambiance can be repeated several times over at most any local restaurant. The thing that will deter us is the price.  We have no objections to spending $100-$150.00 for dinner; we do that EVERY Friday night,. But you can get better and more consistent dinners at \"The Keg\" or \"Gabriel's\"  ( the latter is just down the road).  The Veal Parmigiana at Cagney's is double in price to anywhere.  While the old Cagney's needed a makeover the new Cagney's does as well."}
{"text":"Very good food! The Caesar salad is a must have. The sauce is homemade and it makes this Caesar the best I've ever had! I had the 14oz ribeye and I definitely recommend it."}
{"text":"Atmosphere is really nice.  Very upscale and relaxing.  Food was a great experience.  We had the mussels (amazing sauce.. I mean amazing),  double Cuban lobster tails,  and rib-eye bone-in steak.   Well presented and cooked just right,  except for the steak.   It's probably more of the Chef's style than anything else,  but the steak was charred too much for my liking,  and half the cut was medium rare and the other half was a full on medium.   Still juicy and delicious either way.   Service was friendly and not bad,  but our server was the reason for the lost star. Almost spilled the decanter once,  then knocked over the empty wine bottle .  She kept rearranging my eating space and it was irritating. Manager was friendly and energetic.   Wine selections are simply fantastic.  The cap of it all was the cheesecake.   So light and awesomely delectable!!  My only concern I saw was the seating for a large group... It's placed down the centre isle of a section of two seater booths.  I watched a party of ten arrive and stand around the tables all the while their backsides were in the faces of those at the booths.   I'd certainly not want to sit there and eat such a delicious meal with someone's bum right at my table side.   That's the other reason for the lost star.  I had suggested to our server that the Manager go apologize to one specific patron who was clearly not impressed -  and he didn't go over, and they left not looking too thrilled.   It's a shame to possibly lose a customer over something that could be avoided,  or at least rectified.   I'd come back and I'd bring people with me for a nice night out.   ( but not sit in the large group section haha)  Well done!"}
{"text":"Cagney's is definitely my goto restaurant. Their service is impeccable, their atmosphere is beautiful and their food in consistently tasty. Their menu is robust and the dishes have almost exceeded expectations. Their prime rib, burger and Caesar salad are must-tries!"}
{"text":"The place is really classy.. not something you would expect in the middle of Mississauga.  I would definitely go for a fancy dinner there if I was willing to spend a lot of money for good food. The place use to have a nice classic touch where you can come with your family and kids to enjoy dinner, now it is way more modern that I would prefer to got for only 2 people rather than with the family. Food is great... like i said before, not something to expect in Mississauga.   Great food, modern, but way too pricey!"}
{"text":"Hands down best Caesar salad in the city! Great steaks too! Wonderful place to host a party of 8 more, great for families and friends, great service and cool atmosphere. Very professional!"}
{"text":"My favourite restaurant in Mississauga! A family run 'gem' in an unassuming location. Best place for steaks, seafood and greek food. Their ceasar salad is the best and my favourite is the 'Surf and Turf' combo. Very inviting atmosphere, always 5 star service and great food all the time! Have been here many times over the past 20 years and my meals and dining experience here have always been memorable ;o) Great place to celebrate a special occassion!"}
{"text":"The new renovations breath life into an old tired area of Streetsville.  The parking lot and general building reminds you of a rural small community stuck in the 80s but Cagneys interior is modern and sleek.  The whole dinner experience made our large group of 13 people quite happy.  There were definitely some highlights and room for improvements in the food.  Service was attentive and earnest but pacing was the only weak spot.  Our dinner was 3+ hours.    The interior is filled with sparkly fixtures among a mostly black interior.  The glass 'wine library' is an impressive sight. It's a huge contrast to the aging building and pot holes the size of a Honda Civic.  We arrived to a smiling hostess and pleasantly a table already prepared even though we just called 15 minutes before.  Service started on the right foot!  The menu is just the right size and had great variety.  For apps we decided to share several plates.  Mussels, flatbread, charcuterie, roasted beet salad, calamari, and another salad. The highlights were the mussels and charcuterie.  Mussels broth was full of flavour with a nice dose of bacon to contrast the perfectly cooked mussels.  charcuterie had these awesome sweet spicy peppers the size of a pinky nail and just great with the generous sized charcuterie plate.  Roasted beet salad was wonderful with the fried goat cheese!  The flatbread was just ok because the bread was lacking flavour and was a bit too doughy.  Calamari was ok as the coating was light but not crispy.  It was a big under seasoned as well.  The Greek salad was generous in portions with lots of fresh vegetables.  The mains came out nearly an hour later.  It felt too long but it was worth the wait.  Sea bass was wonderfully cooked.  It wasn't overcooked and perfectly seasoned.  The accompanying asparagus was crisp and tender.  Salmon was well cooked too and not overdone.  The potato mash was tasty.  The steaks was exactly as ordered and all pasta was devoured.  I would say the seafood is a definite strength if the kitchen.  The desserts are made in house and we were given the choice of apple crumble, warm brownie, maple creme brûlée, or cheesecake.  My creme brûlée was ok.  Nothing was wrong with it but it didn't wow me.  I was expecting more maple flavour.  It just tasted sweet to me.  The berries that sat on top of the brûlée was all sour and out of season.  As colourful as they were, it'd be better to serve something tasty.    Overall service was attentive and warm but the concern is pacing. It felt too long between each interaction and dish.  Perhaps people have 3+ hours for a leisure dinner but for a business dinner among colleagues, it would have been better at 2 or. 2.5 hrs max.  Aside from that, it's a nice experience compared to other long tenured restaurants in Streetsville (aka Saucy).  If definitely recommend this place for its seafood!"}
{"text":"Came here to celebrate my birthday dinner with some girl friends. It was a week night and it was pretty quiet. The staff were friendly and pleasant. I really enjoyed the decor and cleanliness of the restaurant. I also really liked how their menu had a variety of options for apps and entrees. It was so hard to choose! I went for the supreme entree w caesar salad, salmon and veggies. I was really happy with all my food. My friend made some changes to her salad but either our server forgot to tell the chef or the chef forgot to follow the requests. It was frustrating because she just wanted to eat her salad instead of waiting. Also when it was time for the bills we told our server how we would like to split them up. She nodded and rushed off without hearing our requests and when she came back it needed to be fixed. I would have liked the server to take the time to listen to our repsonse before running off.  Aside from those small issues i had a really great time and was pleased the quality of my food."}
{"text":"Cagney's...always leaves me scratching my head.   There's just something about this place that doesn't sit well with me. The location is a bit awkward for a restaurant that charges an average of $40 per entree. But I also find the whole vibe here somewhat artificial. It's clear that they put their money where their mouth is. The restaurant is well designed and inspires a nice ambiance. Yet, there are small moments in the Cagney's experience that make you wonder what's under the surface here.   For example, I had a party of 6 come in last night for Mother's Day. Myself, my son and three generations of moms. I noticed immediately that nobody wished these wonderful women a happy mother's day. They also seated us in this award configuration of a booth extended out with a table which made it incredible awkward for servers to place things around us on the table. The seat I sat in had a plate sitting on it. Albeit, a clean plate but still.   I was really impressed with our server, Warren. He comes across as a guy that really likes his job. There was an instance where he had to come and tell us a part of our order was no longer available. He did it with so much grace that I don't think anybody really cared. This guy should be given a raise otherwise some other high end restaurant might pick him up.  Overall, I'm giving Cagney's an \"A-Ok\". It's trying too hard to be a high end restaurant and it's not. Which is ok. Poor people should have the opportunity to feel rich once in awhile."}
{"text":"The restaurant post-renovations is beautiful! Everything is class - whether you're sitting in the dining area or the lounge, where they sometimes have live jazz music playing. The steaks are delicious and priced in the range of what you'd expect for high-end dining.    The only thing I'm not crazy about - is the location.  It's at the back of a not-so-appealing plaza, very misplaced for a restaurant of this stature."}
{"text":"Once I entered the place, I loved the wallpaper colour, the fireplace with dark grey stones and to my left, a glass room of wines. On the counter, a vase with colourful real flowers which is a nice touch. To the right side, there is a very long bar and that area of the sitting is mostly in silver. We were seated in the dining area at a booth that faced a nice round table which I would love to come back with a group of friends.  Happy:  Their renovations is quiet impressive and modernized. Classy and chic! I love it! The waitress was attentive to us and didn't forget anything. We ordered ribs + fries and fish tacos + spring salad. For the appetizer, I got a cream of broccoli soup which was not too creamy and the colour of it was different to what I'm used to. It came with a slice of crusted bread with shredded parmesan cheese. The fish tacos were hard to eat as the fish strips were longer and bigger than the tacos themselves. I realized that I shouldn't eat too much battered stuff, so at the end, I ate the fish separately, some without the batter. The salad was tasty and had a variety of items to pick from. The greens were fresh! The fries came in a bowl and it was hot. Not salted which is nice, since we like them with ketchup.   Not happy:  It's a bit pricey for lunch, but for a celebration, I don't mind spending the money. So it's not a restaurant I can afford everyday, but would to return to it for another celebration.   Verdict: Atmosphere is wonderful. Food was delicious. We were well taken care of. There's no bread at the beginning which would have been nice. As I mentioned before, this place is good for a celebration and bringing a date too!!"}
{"text":"My wife and I decided to try this steakhouse out for our 1 year anniversary. Environment was nice. Staff and service was good. Being a huge steak person, the food wasn't up to my expectation. We started with a french onion soup which came out too salty. For appetizer we had the calamari fritto that was cut too big and chewy (tasted like the calamari was boiled, then fried). For the main entrée I had the New York steak. When the steak came out the plate was covered with oil and the steak was not warm at all. The plate and veggies was even hotter than steak. We brought it to their attention which they offered to put it back on the grill and sear it for a bit. The steak was a bit bland that I needed steak sauce (which I normally don't use if the steak is flavorful). Overall it was a disappointing steak house I've ever been to."}
{"text":"I've just been there once since it was renovated, a couple of times before then.  The renovations are sharp.  I've always liked the food, prices are reasonable.   The last time I was there, the service was very attentive."}
{"text":"Great find on Yelp. I was told this place has been here forever but newly decorated. All appetizers were good except for the fried squid was to salty. I had the crab legs and the were really good. Just the portion seems small compared to one pound in florida. But still acceptable.  Service acceptable only thing I kept asking for water and not brought automatic."}
{"text":"If there was a zero rating I would put it. We ordered steak without bacon to be split between me and my husband. They didn't split it , so it was sent back for a while . When we finally got it and had a few bites, we realized the bacon was wrapped and burnt around the steak. We were furious as we could not eat bacon. They never offered to remake the meal. No compensations were made and we had to pay for half the meal even though we ate something that we def did not want.  Plus, it was expensive without the service of an upscale restaurant. I would not recommend this to anyone."}
{"text":"Throughout the entire evening I was here, I wanted to give this restaurant/bar 3 stars.... but I've decided on 4 stars when I met the manager, Alex! He was super friendly and fun.  We arrived around 11:30pm or so, the kitchen was already closed. Every seat in restaurant were also \"not available\" and we HAD to sit at the bar. The music was blasting and was extremely loud as well.   The cocktail menu is amazing! I didn't like the Winter Mojito (my favourite has not be replaced since No One Writes To The Colonel), but the Cagney Libre was very cute and sweet: $8, rum blanco, lime, cola, bourbon soaked cherry juice  My boyfriend had a few cocktails with bitters and he enjoyed them very much.  The renovations made this restaurant very modern, young, upscale, and very trendy. We thought it was a new bar! Definitely will visit again :)"}
