{"text":"The flavors are strong and beats most of the other Indian Pakistani restaurants around town.  Worth a drive out there to try it."}
{"text":"Horrible! I ordered 3 Plain biryani for take out. When I dished out the food for my family we found small pieces of meat in the bottom and we found a large piece of white plastic. All 3 containers appear to have old biryani at the bottom of the container which they obviously tried to cover with fresh biryani on the top. Will not be returning."}
{"text":"Came for halwa puri breakfast. Got potato and channa water for curry. Beverages were warm and the ice requested came after we had finished our food if it qualifies for that. Extremely slow service combined with tasteless overpriced food."}
{"text":"Good place with decent price for Indian food. Their buffet has a good selection of items. I'd suggest trying their meat dishes which excel above others.   I tried their kabab platter, nehari, chapli kabab which is excellent. Their Faluda is excellent.  Money you will spend for the quality of food is well deserved. I'd have given this restaurant 4/5 but I think there is opportunity for growth and improving customer experience."}
{"text":"Super slow service... Only 4/15 tables were occupied but we had to wait for 30 minutes for our initial as well as any further orders... Sunday brunch is a busy time and they should staff better."}
{"text":"Today we tried Haleem and goat brain masala.... They were both tasty until we found couple hairs in brain masala(it's a mishap so over looked it) they gave us half price off for that item..."}
{"text":"Best Biryani I've had in Calgary. Great price. Parking sucks though, super tight. If you have a newer vehicle I would suggest street parking and walking."}
{"text":"I never had good experience in this place. this place just looks dirty to me. Their food has more oil than actual food products. We their had biriyani once which was really old because we could smell the rotten rice. That was so disgusting, we threw the whole thing away. Forget about service. No one comes to table to take your order. You have to bring menu to table and go to them and order."}
