{"text":"This place has such a cool vibe!! And the DJ was amazing!!! Would highly recommend! Plus I have a gluten allergy and they were extremely accommodating!"}
{"text":"Dang. This is a bummer. Atmosphere is great and adorable! But please don't waste too much of your money on the food. It's sub par and over priced."}
{"text":"unrealistically cheesy. food is just okay and they play awful music lol. I give it a year"}
{"text":"Came here for my husband's birthday with a large group. The restaurant was accommodating (make reservations well in advance) and we were excited to try it out. The concept is fun and the staff did a good job keeping up. They did a great job of ringing up everyone's food on separate tabs and then you could combine as you wanted, or all pay separate. My husband said they had the best Moscow Mules he has had yet. Where they failed was when the valet told a few in our party that they were full and they would have to just come back another time. I know they are new, but then need to figure it out as the parking is valet only. Also a big failure is the menu. It's very expensive and they are trying too hard. Think camping, think burgers, hot dogs, s'mores, that type of simple food will get rave reviews. I'm a vegetarian so am used to limited options. However for me and the two other vegetarians, the choices were very limited like 3 items (a pasta, a pizza and a beet salad). We tried all three and though meh. The beet salad had no flavor and the others were just ok, not really all that good."}
{"text":"First off, the originality of this place is truly inspiring. Instead of copying existing fads and successes (*cough cough* Cold Beer and Cheeseburgers) they've generated their OWN ORIGINAL IDEA. This place is working towards making the next big thing!!!   The menu is one of a kind.. I mean this place has alligator pizza! There's nothing like it. As for myself, this place had a variety of vegetarian options which was a HUGE PLUS. Ordered the hummus and the Death Valley pizza. The hummus was home-made and the veggies were fresh! The pizza wasn't a typical Chicago style pizza as I was expecting. It was lighter on the sauce and cheese all on a homemade crust. It served its name. It was hot just like Death Valley. I loved it, but if that's not for you they also have a build your own pizza option to make your pizza dreams come true. This place has many menu options and can make mods to fit your needs.  In addition to the incredible food, there were a million \"little things\" that made me smile. The restaurant is whimsically decorated with bicycles, hand calligraphed signs, CAMPING TRAILERS, boats on the ceilings, and outdoorsy furniture. There's a small camper near the front of the restaurant where the hostesses will welcome you. One of the workers was wearing acid wash jean shorts which was pretty awesome. Another was wearing timberland boots with a flannel. The entire atmosphere puts you at ease and l promise that it will do an unexpectedly good job of lifting your mood, as it did mine."}
{"text":"The concept is awesome. The interior designer hit a home run. The games are cute. The drinks were good.   Here were the snags We had a party of 6 and the hostess said she had 'no idea' how long the wait would be and she was very confused. She said she didn't know how she would put two tables together. And asked 'should I go talk to the manager'. Not her fault on not being properly trained.   When we did get seated we all looked over the menu. We had questions. What is 'camp sauce'? Our waitress said 'I don't really know, none of us do'. Then we asked about another sauce with the brussel sprouts and she didn't know, but she did go ask the chef.  Again, I don't blame the staff on not being trained.   The menu was way too much and they tried to get too fancy with it. I know we are in a foodie city now, but it's a camping theme. Put more hamburgers choices or brats on the menu, or reinvent some camping food. The items on the menu where not cohesive with the theme.  I agree with a previous reviewer. The price point was way too high and our food was bland. A $22 cheese plate?!?? Two of us got fish and chips and we had to wait and wait for the vinegar to even make it edible. Finally one of us got up and had to track down the waitress after she forgot.   My kid's chicken strips were so burnt they were black and like jerky. We asked where the special 'camp sauce'  was, it was supposed to come with the chicken strips and they 'ran out'.   Go for a drink, atmosphere, and the games. Don't go for the food. We have so many amazing places to eat in central Phoenix and this isn't one of them."}
{"text":"Tried for first time. Great food, great service (Amy). Ahi poke, wings, shrimp and beet salad all awesome!"}
{"text":"Their drinks are great!   The food was terrible, of the 20 people at our table 17 people said their food was salty. Im wondering if management read yelp reviews that said the food was too bland, flavor doesn't mean salt! We got the Koreans wings and regular fries. Our order got messed up and was given dry chili fries and wings which was fine because I would've been mad if I had paid $5 for fries of the same portion and quality of fast food places for under $2. FYI dry chili fries is actually drIED chili pepper fries, its super salty! $14 for a handful of fries mixed with Some dried chili peppers, chili powder, sweet soy sauce and 5 shrimps is insulting. Wings were ok but salty as well. Staff was very nice but needs more training.   I would come back for drinks but not the food, it too overpriced for the low quality you get."}
{"text":"Camp Social is a must visit on 7th Street! Highly recommend over the other places on what is now restaurant row. Incredible atmosphere and great food. Open space, great design, and fun games in the back. Don't pass on the ravioli and ribeye sandwich (cooked to perfection with homemade bread... delicious). The pizzas were fabulous with plenty of options to choose from. Service was on point and made great recommendations.   Don't pass this up!"}
{"text":"The atmosphere, drinks and food were amazing. The total experience was one my wife and I will cherish for some time. We were lucky enough to eat in the camper after having drinks at the bar great time"}
{"text":"Cool vibe. Fun staff. New space. Service needs some tweeting but they just opened. Definitely will come back and brings friends! :).  Two sets of tire swing seats on right side of bar. Awesome.    Mystery beer bag was fun. But just ended up getting Coors inside. Would be more fun with a more obscure beer."}
{"text":"Had lunch there today. Menu is a bit all over the place. Ordered the brisket sandwich which came with fries. Sandwich had a LOT of kimchee on it - too much in my opinion. Others at my table had a couple of the salads, the steak sandwich and the chicken sandwich. Nothing was extraordinary. Outdoor patio looks nice. I want to try again for a drink, but won't return for lunch. Way too may places in the neighborhood for mediocre food."}
{"text":"Super fun environment!! Great music! Love our server - energetic and very familiar with the menu! The lamb scrumpets are delicious and so is my drink, sangria."}
{"text":"Great atmosphere and service. Josh was our server. Excellent bartender and recommended some delicious dishes. He recommended the camp burger and great smokey mountain pizza....so good!!! The beer were tasty! The decor is inviting! Great atmosphere! We just ordered the s'mores! Not on the menu! Just ask."}
{"text":"if you come to Camp Social do not park in front of the flower shop or Otro cafe next door.  The owners are complicit in letting Maverick tow company illegally tow your vehicle.  The signs are not up to code.  They take your car to this location in Glendale.  They then extort $185 to release your vehicle which is illegal and above the allowed towing charges.  Today when many of us went to Maverick Tow, which is unmarked and surrounded with barbed wire, the police were called in order to release our vehicles.  Please be smart and do not be a patron of this center until they change their practices."}
{"text":"First time here... the place was empty, sat at the bar, had one drink and had to wait 25 minutes to for a second. The bartender was closing out his own shift and no one wanted to help us. I had to leave my seat and grab someone just to close out. I wasn't even able to order my food. Needless to say, I had such high hope for this new local place but I won't be returning."}
{"text":"Okay. This is honestly like you're at a camp in the middle of nowhere! It's run by teenagers. They have no idea what's available from the bar or what the menu is comprised of. They had 5 people wait on us within 5 minutes because no one knew who our server was. Makes it hard to have a conversation when they try to take your drink order 5 times!!! They over-charged us by 3 times before we called their attention to the error. Food = subpar! This place is amateur hour. DON'T waist your time."}
{"text":"The atmosphere is nice, the food was decent. Wasn't blown away with the food however it wasn't horrible either. I'd go back and enjoy the atmosphere and some drinks. Maybe try their appetizers"}
{"text":"I've heard the smores are awesome but casual business lunch it didn't meet expectations.  I had the Rock Fish and my invite had the burger.  Both were below par, not as much flavor and were on the bland side for the price. More tatar, lemon, zing, different bread, fresher greens vs. iceberg and fresh fries would've made a world of difference.  Rock Fish is a tasteless fish so you need to dress up the batter and sauces!"}
{"text":"From the reviews and photos we were VERY excited to try this place. But I would have to advise NOT to come unless you are just drinking. The Poutine is made the completely wrong way so the French fries become incredibly soggy. And the cheese board  is nothing special. I would highly suggest not eating here."}
{"text":"Stopped in after protesting Tuesday night and was happy to see the place was hopping at 9 PM.  Absolutely love the vintage trailer and camping theme.  The vintage Scotty trailer at the entrance has been transformed into the hostess station, and the cheery gal was complimentary and engaging and sat us immediately.  Our waitress Jessica R. was so friendly, funny, and knew the menu well.  We started with cocktails and the meatballs as an appetizer.  Meatballs were huge with lots of flavorful sauce and cheese.  Tasted a little bland, but I don't eat a lot of lamb or pork, so that might have been the reason, still very good.  Had the Caesar salad and Avacado Toast for entrees.  The Romaine is grilled slightly for the Caesar, which made it tough to cut (maybe serve it with a steak knife?) but worth the work for the extra flavor.  Very thin toasted croutons and shaved cheese and a great dressing.  The Avacado Toast came with an egg on top, cherry tomatoes, pine nuts and homemade toast.  It had a great garlic flavor in the tomatoes, and I was too wrapped up in my salad to try it before it got cold, but it was still fantastic!  Jessica recommended the S'mores for dessert, so we tried them.  Home made marshmallows, pre-loaded on skewers, our own personal tiny hibachi (I love all things tiny) HOMEMADE graham crackers with a hint of ginger, and good old Hershey squares all added up to deliciousness and fun.  With the huge inverted canoe overhead, hung with lights as a rustic chandelier, all of the visual interest of corrugated metal siding, huge glass garage-style door, turquoise accents on the vintage trailers and neon signs, and fun outdoor patio visible from inside, it was just the perfect evening.   The cherry on top was getting to meet one of the co-owners who told us the history of the restaurant (the owners are from Chicago and used to camp as kids in Wisconsin) who genuinely cared about our experience and food.  He stopped by the table twice during our meal, and the place was busy.  A good restaurant always has good management and ownership, so I predict good things for this location, and eagerly await the opening of another, soon (shhhh - don't tell them I told you!)  I also saw the chef visiting with several tables which is so rare here .   Don't miss the large booth that was custom built by a local cabinet-maker to be the spitting image of a classic Shasta Airflyte!  Great place for a small group or family meal.  We will definitely be back!"}
{"text":"Sat at the bar around 4:30 and at first received good service and he was explaining the menu and specials. Ordered an appetizer (which he forgot for about 20 minutes to put in) I think asking for a glass of water irritated the bartender and after that it went down hill. Waited at least 15 minutes from when our drinks were empty to when I had to bug them for another drink. He seemed completely irritated. Looking around the bar, it appeared everyone was looking for another drink. Watching them at the station making drinks, it is all ice and when they pour short, they top it off with ice and soda. Asked for my tab, took 2 times and once received after 30 minutes of waiting, literally threw the board at us. Maybe a bad night for the 2 bartenders but would not recommend this place."}
{"text":"AMAZING! Atmosphere, concept, food (the poutine is worth a review all on its own) and people. All so perfect. Great for a family meal or somewhere to go out with friends!"}
{"text":"We tried this place out as a group, and at first glance, the theme and decor of this place is quite novel and cool.  I liked the ambiance the most, but there were several drawbacks that detracted from the overall experience.  The first drawback was when we first arrived and were basically forced into valet parking.  At least offer a choice.  The establishment is so close to the parking lot that it really isn't necessary.  If you want to play into the whole \"camp\" theme, ditch the valet, you don't get valet when you arrive in the woods ready to camp, right?   The service was spotty.  We enjoyed the bar area while waiting for the rest of the group we were with.  One bartender was quite friendly and attentive, the other, quite nonplussed.  Once seated at our table, the server we had was not very efficient, but again, we were a group, and I know it can be challenging.  The menu is definitely unique, but overpriced for what is served.  Ordered wings and a pizza, quality was not bad, enjoyed our meal.   In all, not too bad, but could improve in several areas.  This place might be more enjoyable dining as a couple or small group, rather than large group."}
{"text":"Visited Camp Social today after hearing good things from our friends. Not a good visit. No parking available, had to park down the street and walk back. Seated right away, that was a plus, but we were all adults seated where all the kids were. We wanted to talk, but it was so loud our party of four were unable to hear each other.  Menus came, and to my delight they had gluten free buns, bread and pizza. Whoo hoo!  Always a huge plus since I have to eat gluten free or I  get very sick. Discussed this with our server, he was good about telling me my burger would come on a gluten free bun. Great! Our food came all at the same time. Cutting into my well done burger, I couldn't cut through it. Bun was frozen! Not cold, but frozen straight through! We called our server over and told him, he said he would get it right back to me. The other 3 of our party started eating, my food didnt come back out for another 20 minutes. Really? How long does it take to give me a new bun? Plus, my well done burger by then was black and dry as shoe leather. For a 14$ hamburger, it should be top notch.  Ugh. Server said he was sorry, but didn't offer to comp my food. I would never have complained as my son was paying, but this was an awful experience. We will never go back. Camp Social, you have a lot of competition, hope you can improve."}
{"text":"I had seen the signs of camp social, and the articles going around about it opening. From what I read I thought it was going to be spectacular.  I honestly thought it was going to be something similar to the Yard on 7th street.  Can you imagine having a campfire/Forrest environment where you feel like you're camping with activities for your family?   Walking into the restaurant I thought the decor was perfect.  And immediately I wanted to take the kids to the area where there are games. I was so let down at the back room.  It is poorly laid out.  You have the bathrooms back there as well.  The ping pong table is kind of in the way and all of the little games are smashed in the back.  I was just hoping for something different- like what you would see at The Duce or the Yard.  The dining experience was not a good experience.  It is overpriced.  We bussed our own tables.  There were a million open tables and the hostess put us at the front of the restaurant which means the 5pm sunlight was in your face and it was hot- they don't have any shades from what I saw.  We did not have our drinks filled often. and they did not bring the food out together. I don't think there is any training in place there for service.    I have heard mixed reviews but the restaurant did not live up to the expectations set.  I would recommend going and trying though.  I also had a party of 5 table."}
{"text":"This place wasn't that great at all. Cute theme and vibe however way overpriced for what it was. The food was mediocre at best and took forever to come. I came in a group of 9 and everyone's food except mine came at the same time and then I had to wait another 5 ish mins for my pizza, which was boring. The crust on the pizza was very tough and hurt my jaw to chew and tasted so bland. There was hardly any cheese on my margherita pizza and no basil. Many people in my group got the camp burgers and were not satisfied. The burgers were very basic and boring. Presentation of the food was not great either. We got the smores for dessert and the homemade marshmallows didn't burn correctly and tasted kind of weird and the homemade graham cookies were extremely hard. My friend in our group had the chocolate cake and didn't like it, actually no one in our group liked it either. I or no one in our group will be coming back to this resturant. I do NOT recommend this place. You will be paying too much for mediocre food and will wait forever to get that mediocre food."}
{"text":"We had the best experience ever! Tried something new way out of our neighborhood! Anna was amazing and is the best server! We will definitely be back for more!"}
{"text":"I've been waiting for this place to open up for a while now. I stopped in this evening for a round of cocktails with some friends and found the staff to be very welcoming. The manager checked in on us to make sure we were doing ok, and our server did his best to accommodate.   The Salt River Float was delicious! A root beer float served in a mason jar that didn't disappoint. I'll certainly come back to try more drinks and dishes when I'm in the area."}
{"text":"Was really excited to try this new place, and it did not disappoint!   For starters, the atmosphere/decor is really phenomenal, like something out of a Wes Anderson movie, which is about the highest aesthetic compliment I can give.  The service was friendly, enthusiastic and professional, both from the server and from the manager on duty who checked on us several times during our brunch.  Most importantly of course, the food was terrific. We started off with the poutine, which was delicious and served with crinkle-cut fries and included fried pickles. Between the four of us, we tried one of the pizzas, a fried walleye sandwich, and even a sausage salad (!) - and all of us commented that there were so many awesome-sounding things on the menu that we need to visit again soon to try more. This place is really fun and unique, and I hope they do well!"}
{"text":"I left a review somewhere but I don't remember where so here's another! I'm on the fence with a 3 and 4 star review because the trout and atmosphere was great! We had a lot of fun taking pictures too. But the lamb appetizer was terrible and I would have liked to have seen another side with the entrée. It comes a la carte if you want extra besides just the fish and that adds up. I will go back because I heard the fish and chips were good so TBD!"}
{"text":"I question whether the owner of this restaurant has ever been camping. The food was mediocre, the decor was gimmicky, and a vast majority of the clientele was comprised of business bros. I saw a business bro playing ping pong against another business bro while talking on the phone with what was surely another business bro, all while \"The Macarena\" played over the speakers. Camp Social? More like Camp I'd Much Rather Stay My Ass at Home."}
{"text":"Pretty fun place to go.  Tire swing bar stools, camper to sit in for table, really cool atmosphere.  Food was pretty good, fun Smores dessert.  Kids had fun playing ping pong and other games. Give it a try!"}
{"text":"Such a cool vibe! Josh the bartender is super sweet... and easy on the eyes!!! We had the poki bowl and mussels! Cool bathrooms and overall decor! Really chill cool vibe here and food is really good too!!! Fun place to kick it!!! Mussels & extra bread a must!!!"}
{"text":"I actually went to this bar on a total whim as the bar we were at was closing and it was the only place open.  But, I was pleasantly surprised!  Nice staff, drink prices were very reasonable and the atmosphere was really cool!  Very comfortable, lots of games to play and they even started the fire for us.  The only reason I didn't give them 5 stars is because I don't know about the food, because we weren't hungry.  So, I maybe upgrading it after my next visit which will probably be fairly soon!"}
{"text":"The dip for the pretzel was terrible, the added crab had zero flavor! The Margarita pizza had very little mozzarella with a chewy crust! With all the choices around, this won't be a choice again!"}
{"text":"Camp Social is so much more than just another new restaurant on 7th st. This place has so much energy to their atmosphere and the food will bring me back time after time. I am so thrilled to have people behind the bar who throw their passion into the crafty cocktails being made. You can tell the staff actually wants to be there.. rare!!! It is simply a good time no matter what and I will highly recommend enjoying the tire swings and kicking butt in the game room between courses!!"}
{"text":"Had been wanting to try Camp Social for many months now. And I was not disappointed. We had an amazing server who was sweet and funny and took amazing care of us. The kids had a blast playing ping pong and Jenga. We had a burger that was super and a duck sandwich that was off the chain good. The kids split two Hawaiian pizzas and loved every bit. Don't forget to order the s'mores they are amazing! Thanks for making our experience wonderful!"}
{"text":"Camping with friends.   The burger and fries were cooked perfectly.  The \"LAZY SUNDAY\" Beverage was delicious.   Looking forward to coming back soon."}
{"text":"Loved the atmosphere! Great drinks! Food was decent. We had the pretzel with beer cheese, chicken nuggets, cheese burgers, short ribs, salmon, grilled veggies, s'mores and creme brûlée Birthday cheesecake! Big bill, big fun! The kids enjoyed the shuffle board and ping pong. Complimentary valet parking! To top it off the kids grabbed otter pops on the way out. Good place for Birthday celebration! (Kids and adults)"}
{"text":"This place is pretty cool! We decided to go for the first time for my birthday and I think we will go back again. The beer cheese and pretzel along with the Philly cheese steak fries were awesome appetizers. The entrees we got weren't quite as good but they weren't bad either. The tableside s'mores were super fun and delicious. Just be aware, the live music is fairly loud and it can get pretty warm in there. Other than that it was a good experience."}
{"text":"Josh the bartender was great. Told we had a hour wait but we counted five plus empty tables for over 30 minutes. Hostess informed us they are all reserved. This is money they are missing out on, sound business decision? It's always great at the bar,  just saying."}
{"text":"Huge disappointment.  The noise level is ridiculous.  You can't carry on a conversation with the Music so loud.  Food was ok but very over priced.  Bummer because the concept is very cute.  And if you still decide to check this place out, don't sit by the west windows- you will die of heat stroke.  Waiter was very nice and personable - short little stubby hostess was snotty.  There ya go."}
{"text":"We came in with a group of six adults and four kids thinking that the kids could play games while the adults socialized.  The game room was taken by four, 20 something young adults.  Our kids came back immediately saying the kids were cursing and appeared drunk.  We tried more than half the menu to our complete disappointment.  The pizza being a very expensive miss.  Fried chicken, lamb scrumpits,  Brisket, Hobo stew, sausage salad, rib eye sandwich, Ravioli and Brussels all had issues.  So much competition with such better food close means I will not be back for some time."}
{"text":"Had the most basic brunch there (eggs, bacon, sausage and country potatoes) & it was delicious! And bottomless mimosas for $15 you can't beat. Crystal was my server, she's a small spunky fun human and can't wait to go back!"}
{"text":"Very upset and disappointed.  My husband and I were at the location on 7th Street in Phoenix on Saturday.  We sat at the bar and ordered a drink and wings.  We were told we had to provide a credit card when sitting at the bar.  I told the bartender we would be paying in cash but she said they still needed a credit card to hold.  Service was ok, wings were terrible!  We paid in cash for our bill, and come Monday morning I found my credit card was also charged for the same bill that we had paid in cash. Called the place and they said they would put a credit back to my card, but we have yet to receive that credit.  Was this an accident or did someone pocket our cash and then charge our credit card with the hope that we would not notice it? I think the latter!  Would not recommend this place AT ALL!"}
{"text":"Been here only once to celebrate a friends birthday. Can't say anything about their food since I was only there for drinks. Their old fashion wasn't that good but the beer that they have called Orange Blossom was really good. The atmosphere was ok. The music was meh top 40 stuff and it was too bright in there."}
{"text":"Fantastic food, excellent atmosphere, amazing service!! If in downtown Phoenix this is a must go!! They have everything you can ever want.the server Jason was so attentive and recommended so amazing food and drink options."}
{"text":"Visited for my daughter's 21st birthday from Washington State,  they treated us exceptionally well and we were able to reserve \"the camper\" and it made the whole experience! The food was fantastic, as was our waitress Bianca. Atmosphere and attention to detail were spot on! Can't wait to come back and swing on the tire swings at the bar."}
{"text":"I'm currently at camp social and our bartender, Daphne was wonderful. The service was also great who comped our entrees because it took so long. Overall, they were great people. We weren't in my rush for our food!"}
{"text":"I'm going to start off with the food. Food was ok, in my opinion a bit expensive. I got a salad with no protein and it was $13...yikes! My husband got the fish fry and gave it a C. My kids liked the fried boneless chicken. The bread service was the bomb, but $5 for a \"can\" sized piece of bread??? The fig mule was delicious and the s'mores drink was a bit disappointing. We also got the meat & pickle board, $22, and there were maybe three thin slices of pickle, a few slivers of carrot & some gross liver mousse along with 2 other meats. Not worth $22!!!  Now onto the atmosphere...EXCELLENT! Good vibes, a small game room that the kids loved, outdoor patio looked chill & the tire swing seats were rad!   We will go back & order just a burger & fries...Keepin' it simple."}
{"text":"Not a good lunch experience mostly due to the waiter Devin. He entered the wrong salad so it came wrong. The correct one came after I was done eating though. He still charged us and I asked him to remove it but he did not. The food was just ok."}
{"text":"I was less than impressed with my first visit to Camp Social. The theme was very cool throughout the building, but the service was sub-par. We decided to sit at the bar because there was a long wait for seating (we should have just waited to be seated if we knew what was in store). The bartenders were not friendly, and checked on us one time to get us a drink (didn't care to ask if we wanted any food). I was expecting better service as there were only two other people at the bar. But the bartenders decided to spend all of their time chatting with one of the other people at the bar. They did take a break from talking to the person to eat a pretzel and cheese that was mistakenly brought to the bar, while they were on their phones. I basically had to wave my hands around to get their attention to get our bill. We would like to give this place a second chance, but there are so many other places to go in the area that will offer better service."}
{"text":"Super fun place for drinks, great food and friends. The starry sky and tire swings are adorable. Our very attentive server Andrew was spunky and made conversation with our whole table. Will definitely be back!!!"}
{"text":"Good afternoon fellow camp goers. Unfortunately I'll never see you back at the camp grounds. This will be my last experience there. First we sat and did not see a server close to 10 mins. Long enough I had to go to the bar and get my own drinks. The real reason we were there was to have lunch. The chicken on my salad was so dry I think they may have left it on the camp fire all night, I barely could get a knife through it. My squash was as hard as uncooked potato's and my salad was as dry as a creek bed in the middle of summer. Lastly my sons French fries tasted like the bark off logs they used to make the bar. I should have ordered the tire swing with a side of ranch and a steak knife. Cocktails were great the outside bartender gal was nice and quick making drinks.  Hopefully they get a new chef for the new restaurant they plan to open next door.   We salute you!"}
{"text":"I ordered the Hobo stew. Every stew I've eaten had vegetables and meat. This one was light on meat and there wasn't one vegetable I spent 14.00 for a small portion of light gravy with a few pieces of meat. We wanted cheddar biscuits, they were out of them at 4:00 in the afternoon. We couldn't find any cheese curds in the French Poutine. It was not worth what we spent. The place has a cool design, how ever it will be my last visit."}
{"text":"I've only been to Camp Social once, about a month or so after it opened.  I checked Camp Social out because it was new in the neighborhood and I was on a hunt to find a new place to house a monthly Happy Hour for my Meet Up Group.  I was excited about the concept of the place.  It fell flat to me.   Totally flat!  My friend and I stopped in one evening for happy hour.  We were sitting at the bar (in the regular seats, not the tire seats although they are really cool) for quite a while before the bartender ever came over or said anything.  It was about 3 parties of 2 sitting at the bar and a huge party of what looked like colleagues sitting at a larger table in the bar section.    When the bartender came over I ordered a red sangria.  That was the special for the day I believe.  My friend ordered a well drink - vodka with cranberry.  The sangria was nothing exciting.  The bartender never came back to us, we had to flag him down for a drink.  Because of that and the fact that the drinks weren't that good we decided to leave.  Maybe if my first time would have been on let's say ... a Saturday, I think it would have been a different experience, but on a Wednesday evening, it was pretty lame.  I decided not to host my monthly Happy Hour for my Meet Up group although there's plenty of space for large groups."}
{"text":"Camp social was a let down for us.  The drinks were syrupy sweet.  The food was mediocre at best.  We had poutine, ravioli, and a pizza.  The menu at this place is huge and maybe they haven't fully figured out who/what they are yet? The waitress took forever with the water.... the silverware.... the drinks.... then when the food came they forgot to leave the gravy on the side for the poutine like we had asked.  Overpriced for what it is.  Won't go back"}
{"text":"Service is always amazing here! Drinks are great! Just tried the Paloma for the first time and it is delicious! Really cool atmosphere... but the food is subpar.  Recommendations:  Pretzel with cheese Hobo stew  The other foods I've eaten are only ok nothing to crave or dream about :(  I come back for the service, drinks, and atmosphere!"}
{"text":"One of the best Chicken sandwiches I've had in a while.   I think they put a little Cayanne pepper in the better... It was very tasty!"}
{"text":"Limited variety of foods. Everything is fried. Pricey. Sat down. Saw the menu and the food type. Walked out. Not worth it to me. Basically just a bar. Looked cool from the outside but not what I went hoping for...a good solid healthy meal."}
{"text":"This place is amazing.  I've lived in Phoenix for 2 years and I've tried a lot of places, all promising great burgers.  This one delivers.  I had one of the best burgers I've ever had along with appetizers and drinks.  There were three of us and everyone's meal was out of sight.  The atmosphere is fun and different.  Our server Jason deserves a special shoutout and thank you all at Camp Social."}
{"text":"We loved our server, Daphne! Happy campers over here. Great, quirky, original establishment."}
{"text":"Friday night is a date night tradition with my wife. We try to pick a new place each time. I am so glad we chose Camp Social. The atmosphere was relaxing. The staff friendly and gregarious. Special mention to Jessica, Amber and Alli. Also like to say thanks to the manager Anthony for making sure our experience was top notch.  The tire swing seats at the bar are a real novelty. We stuck to the appetizers, but they were of excellent quality and taste. Really nice selection of beers and wine. Also tried some of their signature cocktails. Highly recommend the Mule.  Put simply, if you are looking for a nice relaxing evening at a location with a fresh theme, then this is your place. the 7th Street corridor has a lot to choose from so put this on your must visit list."}
{"text":"I really wish I had something different to say, as I really wanted to like this place. Walked in and immediate loved the feel and decor of this place, however no one was as the door to greet us so we were a little unsure of whether we were to seat ourselves or not. After a minute a cute hostess popped around the corner and was very friendly. Told us it would be a short wait for 2, but gave us the option for open seating at the bar, which we opted for. Sat down at the bar and after a couple minute a bar tender came over and handed us 2 menus. But that was it. Made eye contact with him a few more time over a 10 minute period and nothing. Someone else came behind the bar to deliver food and asked us if we had been helped yet, we told him no. He walked away. We thought maybe he was going to get someone to help us, but nothing. So for a good 15-20 minutes we sat at the bar with nothing. Not even an offer to get us a drink. So we left. My 2 stars are for the decor and ambience, but that's it. Disappointed."}
{"text":"We were looking to find a place to have a few drinks, snacks, and games to kill time on a lazy Sunday funday afternoon. Camp Social was the perfect place for all of the above!  I loved the ambiance, it had a very nostalgic camp-themed vibe with the ability to roast your own marshmallows for s'mores and to chillax with a drink on some tire swings or inside a camper trailer. Btw, I loved their fries! Their recreational room consisted of 2 arcade games (Pac-Man and a hunting game), jumbo-sized connect 4, jumbo-sized jenga, and my favorite....shuffle board!! It was not crowded at all on a Sunday afternoon and we had a great time!! Definitely a good place to go for games since The Yard oftentimes gets crowded."}
{"text":"Different and fun decor! The name says it all! The ice-cream sandwich was the only thing I tried in the menu. The menu seemed limited. I did like the happy hour daily favorite cocktail choice. $6 for the stargazer raspberry vodka, peach, cranberry and Red Bull. Tasty for sure. Good spot for meetings and just hanging out on a Friday. Service was nice and attentive. No real wow factor for my first visit but will be back."}
{"text":"The fried chicken was awful. The combo of cinnamon and their \"camp sauce\" was so bad I couldn't swallow it. Loved the decor and the servers were really nice. The only reason I would come back is to play pingpong and have drinks, but I wouldn't touch the food other than French fries."}
{"text":"Had the beet salad and the Brussels sprout and kale pizza. The only reason I'm giving two stars is because the beets on the salad were, well, beets. I wouldn't go back if someone else paid for it, unfortunately."}
{"text":"Attractive decor with lots of t.v's to cover sports. The decor is meant to resemble a camping lodge, and, the service is friendly and efficient. But, the food is mediocre at best. I ordered the Campfire burger which arrived overcooked for med.-rare, but, the bun was way too thick and doughie. The fries were not freshly made and dried out. We also ordered the chicken sandwich which was much better, but, the same old fries. Same with the third sandwich which was o.k., but, with stale fries and the too thick bun. I hope they change the bun selection, and, whoever supervises the kitchen should never let fries that old out the kitchen. Doesn't anyone taste them prior to plating?"}
{"text":"The decor was super cool. The tire swings were a nice touch. Visited here when it was super new, and as anything new the place was working out the busy crowds. Other than the food coming out delayed the service was great."}
{"text":"Came here on a Monday night with my friend after work. The bar is pretty big and there was quite a few dudes sitting there but the place didn't look all too busy. There were two blonde bartenders it looked like and they weren't checking on any of the patrons that were drinking. My friend and I sat for 15 minutes and not once were approached. We sat awkwardly and waited and got more annoyed but also noticed that nobody else at the bar was being helped either. Several customers looked over at us like they were on the same page as us waiting for service...except at least they had beers!  The worst part was that after we got up and decided to leave I mentioned to my friend that I could have sworn I made eye contact with one of the bartenders so she saw me sitting there waiting for service. As soon as I said that my friend said the same thing happened with her! \"I know she saw me sitting there!\"  Anyways, we went down the street to cold beers and cheeseburgers where we were greeted right away and had some awesome food. It seems to be that service is quite an issue with this place. I don't see it lasting long. Maybe get some new bartenders that actually touch tables...or even just the damn bartop for that matter."}
{"text":"Loved this place! It gets pretty so I would make a reservation on the weekends. I ordered a hummus plate and fried pickles and loved both! My friend got the cauliflower and French fries. Next time we have to get that snores it looked unreal. Great device especially for a new place! Good drinks too and cool patio."}
{"text":"Has some room for improvement! High priced for ok food and drinks, service however was excellent!"}
{"text":"I love the camp theme that runs throughout the restaurant, but the menu and food was just meh.  Yes it's cool that they have tire swings at the bar and travel trailers where you can sit, but aside from a few camping themed names on the menu its just another burger and pizza place. OK, they do have S'mores available for dessert, but it seems like they could go much further and how long will it be until they get a cease and desist letter from Warner Brothers for menu items like the Elmer Fudd's Duck Club and Yogi Bear's Picnic?   As for the food, our group had a variety of burgers and sandwiches and while it wasn't bad, there was nothing memorable about it either.  Sure, it seems like it would be a fun place to go for drinks, but if they're going to stay competitive on the increasingly busy 7th Street corridor they really need to step up their food game."}
{"text":"Good menu, avg quality, terrible service. Very young & inexperienced staff.  Duck pizza soggy & too sweet. Fried chix sandwich had too much breading; brioche bun was best this about it. Had a broken glass, server eventually came by and replaced it with a plastic cup; but no ice for the tea"}
{"text":"Went for happy hour on a weekday. The staff is friendly and attentive. The appetizer, the pretzel and cheese, was tasty. I think the valet parking is a bit much. It's free but doesn't make sense. There was plenty of parking close and yet we had to use valet. Nonetheless, it was a fun atmosphere to socialize and unwind."}
{"text":"Not a Happy Camper!  3rd visit. Food decent, fun atmosphere. Arrived ahead of any expected lunch rush. Initial greeting, waitress lacked serious personality. Then noticed patrons who arrived after us were getting food before us. So I looked for help. Finally our waitress shows up long after our food finally arrived and told me she had a 20 top with separate checks. Soooo sorry. Not acceptable as we are all here for the same thing. You can't handle it. Then look for help. No excuse. Plenty of staff had little to nothing going on. Probably won't return"}
{"text":"The atmosphere was really cool but food was slightly less than average and the place was so crowded you could hardly walk through. The waitress was great and the drinks were pretty good. Not sure if I will go back."}
{"text":"Service. Still solid. Friendly staff. Drinks and food come out pretty quick.   Food. Still really good. Pretzel is awesome, burgers are great, pizza is good.   Drinks. Still strong. They swapped Pacifico for Modelo on HH, and they did away with the abysmal mystery sack which I fell for once.   Atmosphere. Still my favorite spot on 7th to pop in to. Laid back, multiple bars, good crowd.  They put Below Average Joe's out of business, so they are definitely doing it right. Hope they are here for a long time."}
{"text":"Went today with my wife for the first and I was more excited than the staff member that greeted us. No \"is this your first time here?\" when we arrived or explaining the concept.  We got seated and there was some confusion over who our actual server was going to be so we just went with it and spoke to whoever came to our table (they tried). Got our drinks and food pretty fast, I ordered the prime rib sandwich and when I got it the steak was falling out of the bun, not even big enough for the steak. The steak was incredibly chewy for being cooked at medium. We saw a few manager types lingering but they never came over to greet us or ask how our experience was. Also is this a jocko sporto bar or a camping themed restaurant? Yeah when I go camping I have 20 huge flat screen TV's showing football and baseball games. Maybe play some hooky americana/camp music, deck the place out more like a camping motif, picnic tables etc to enhance the experience and not try to be a Scottsdale style sports bar. Teach your serves and hostess to convey excitement in the product and how to sell it, not i'm cute and I smile and we sell draft beer. Ok experience, not bad but not great."}
{"text":"This place has a really cool vibe! It's dog friendly too which is always a nice perk. The reason for the 4 stars instead of 5 was the food was nothing to write home about. I only tried the breakfast pizza but it was ok, nothing amazing. I'll give this place another try and order something different to see if it was just an off day for the food! Otherwise I'd recommend this place!"}
{"text":"Awesome, unique place!  It's a great spot to get a beer (day or night).  Make sure to ride the tire swings at the bar."}
{"text":"Really fun place. Super comfortable tire swing bar stools. Great bartender. Went at open on a Sunday and service was great. We want to get a hotel nearby and Uber so we can both drink unlimited mimosas. We'll be back."}
{"text":"This place has so much potential. The ambience is super fun, they did it well! It's definitely a cool looking camping themed spot! Our actual experience wasn't that great though :( We made reservations a week in advance for Easter brunch. They advertised as having bunny festivities, Easter specials and was in the list of many \"places to go\" for Easter brunch online. When we made the reservation, she spouted off 3-4 brunch specials on the phone. Sounded great! When we arrived on time, they had just opened, it was completely empty, and maybe one family was seated. All other tables were completely empty. Our hostess said they needed us to wait 5 mins (which was 10) in the front because they only had one server on that morning (who just arrived) and they needed to get things ready. (Couldn't they have at least sat us at one of the empty tables with water?) It was odd for a reservation with no one there. (Note: They were also playing loud rock music all morning, and had the big garage door closed and it was dark. - which I thought was weird for advertising \"Easter\" brunch. It just felt off for 10am. Maybe this just is a better lunch spot than breakfast?) So when our waiter came, he was nice and energetic, but very rushed and unprepared. (Maybe he was the second waiter that finally showed up that am?) First I said, \"what are your Easter specials?\" He said \" I don't really know, and I should have looked, but I think there is a ham,potatoe and carrots thing. We all laughed a little and someone muttered \"oh I will take that!\" (In a joking tone) but in all seriousness I said, could you maybe go find out and then let us know? He politely did but when he came back he said \"yeah just like I thought it's ham, potatoes and carrots. Plus one more special.\" First thought: that's your Easter brunch special? Wow, it sounds special. . Second thought: Um, that didnt match what the girl said with my reservation.  third: bet he didn't check. & final thought: how come there were 4 when I called but only 2 now? Unsolved mysteries.  We all decided the safest bet was to skip any specials. So we gave our orders, and when he came back with drinks he said \"oh there is also carrot cake pancakes\" to which one of us said \"oh great! and switched our order\". I guess I'm happy he at least found them out but, honestly?? It all felt like a calamity and I kept thinking? It's ok to have issues some mornings, but if you are advertising everywhere for Easter brunch, should the specials be posted, the restaurant be staffed and ready, the room be bright and fun? - felt like we made the wrong Easter brunch choice. Well, In the end, food was pretty good. Nothing any of us raved about. 2 of us ordered the pulled pork/egg skillet..pretty good. Portion was small. We both felt it would have gone over better if there was a side of toast or side of anything with a small portion. Someone said Carrot cake pancakes weren't very fluffy but did taste good. They also were accompanied by potatoes which our table all thought was strange..maybe put some bacon or sausage with your pancakes, why would you want 2 starches? As a gluten free eater- I also really appreciate they have gf toast & pizza but would love if they had gfree pancakes. They are so easy to make and go along way on your menu if you also have breads/pizzas for lunch options! We did hear the waiter got the orders wrong at the table next to us..but all in all- everything did come as planned to us. Also, the manager came by to say hi which was kind.  Overall: -Great looking place, great potential! -Menu is fun, may need some help & re-thinking with sides & pairing -wouldn't recommend for am atmosphere unless your adult drinkers. - definitely have some staffing/training issues here.. - gluten free pancake option would really help -since you already have g free bread & pizza) These guys are new- so with a few changes. This places has lots of potential."}
{"text":"Service was bad ass thanks Andrew. Awesome server. Food was literally some of the best I've had."}
{"text":"This establishment has a great atmosphere, great drink selection... and........ bad, overpriced food! Wow! Mussels for $15?? I can get those across the street at The Yard for less money and more quantity. I got the \"brisket and kimchi sandwich\" ($15) and honestly felt a little insulted when the waitress brought me what looked to be a small sandwich with lunchmeat contents and crinkle fries that I can buy in the frozen section. My boyfriend got the Korean wings and they were so spicy they were almost inedible."}
{"text":"Unhappy camper here. Started off with a very tight valet only parking lot and then quoted a 2 HOUR wait when we checked with the hostess despite having MULTIPLE empty tables in the dining area. We were told those were for reservations, but after a 45 minute wait no one filed those tables.  Overall a very poor flow. We left without eating. Thanks for nothing!"}
{"text":"I was really excited for this place to open because I LOVE Camping! The atmosphere was great and the service and managers were awesome! However, I feel like they were kinda expensive for the amount of food you get. Also, their food seemed to lack flavor but I did only try the appetizers & beer. I will try again and get an entree."}
{"text":"This place is sooo cute!! I live not too far and I will say, this area has been needing a fun place like this. Not the loungy cocktail bars midtown is known for.   I went in with some friends Saturday night and we managed to grab two of the tire swings at the bar. Perfect timing. We made ourselves comfortable and ordered some drinks. We were having such a good time, next thing we knew we were halfway through the drink list. Our bartender definitely knew what he was doing. He was so funny, and so attentive. An exotic looking, handsome man too. Anywho, the Firefly i specifically remember loving! A must try!!   We didn't eat, but I'll definitely be coming back to do so. The staff was saying they're intending on kickstarting a weekend brunch soon. Maybe we'll give that a try!"}
{"text":"First time here with 9 of us (5 kids!) and was a hit for all of us!!!   Kids had fun in with he game room and adults loved the food and drinks!   Andrew our servers recommendations were on point!  We will be back!!!"}
{"text":"Andrew was super attentive and super friendly! The atmosphere was great and I will definitely be back!!"}
{"text":"I was really looking forward to this place opening. I often go to Joe's Midnight Run and kept peaking at the new décor that was being added. This place is ADORABLE! I love the camping theme and the canoe light fixture on the ceiling is awesome. I could definitely see taking tons of cute photos all around the restaurant. I will be back, just for that!  The food was pretty good. I wish it had been great but I know it's a new restaurant and often they continue to refine recipes and make things better so I'm not too worried about the next time. My friend and I ordered a few different things and shared some bites with one another. Hands down the best thing I had was the poke of the day. It was ahi tuna (my fave) and was an incredible size portion and very delicious. It would have been nice if there was more of the black rice because the tiny amount was a little random. There were also too many shredded carrots on this but I did like the flavors all together - had it been portioned a little more equal this would have been phenomenal. I definitely will order this again!  My friend ordered the hummus and fried Brussels sprouts and she really liked the sprouts but not the hummus. I tried it, as well, and it was fine to me but did have a little bit too much of a floral-like taste.  Overall, I am excited about this place. The food has potential and the décor truly makes this place unique!"}
{"text":"Two stars mainly because I really wasn't impressed with the food. I had the everglade pizza. The $15 alligator sausage pizza had little to no cheese. All the toppings fell off immediately when I picked up the slices. We also had the smores that came with fire that you can roast the marshmallows. The presentation was cool but it was pricey for what you got.  The atmosphere was meant to have a camping feel. Tire swings at the bar and trailer were clever choices. They also have a ping pong table, shuffle board, giant jenga, and connect four that customers can play for free in the back. Service was pretty good. Positives- I came with a big group of 20 people and the food came out all at once."}
{"text":"Cool place to hang out and watch the game. I haven't tried the food, but the sangria was so good. The chef walked around passing out donuts, it was so cool. The atmosphere is really nice. Overall I'll return to try the food and more sangria!"}
{"text":"Went here for the first time when they opened and we've been back every weekend since then.  Great crowd with solid drink prices!  Our favorite bartender Tau keeps us laughing when there's a lull in the drink orders, and there's always an attractive crowd here.  Definitely a sure stop  for drinks while in Phoenix.  The food that I've tried thus far has exceeded all expectations that I've had.    The Death Valley pizza is amazing, but don't venture to this order if you don't like spice.  The Hobo Stew is unbelievable and hearty, great to eat with the bread.  Poutine!  Need I say more!??"}
{"text":"Came here just for drinks for a bit bday party. Staff was great choices in pint with all the popular mules and whiskey drinks so comparable to other places.  The service and decor gives them a 5star from me.  Always had multiple people checking in, never sat for more than a few minutes when someone needed anything g.  Talk about cool decor. Check out the Photos already posted!  Tire swings campers coolers for tables.  They thought if it all. Top notch, I'll be back to try the food"}
{"text":"Concept is truly cool, but the food items do not fit the theme in my opinion.  Sure, there are fish options, but where are the s'mores desserts (not alcoholic drink), where is the potato salad, hot dogs, brats, chili, beans, corn on the cob? The chili fries aren't even fries with chili drenched on top of them.  It is a chili powder...wow.   I think that with some modifications, it would really be a hit. Just a suggestion."}
{"text":"I think this will be my last trip to Camp Social. Their prices are too high for what you get. Tonight they couldn't bring the indoor temperature down to a non-sweaty level and their bathrooms were flooding and closed. It's a fun atmosphere and the food is decent, but again, not worth the price being paid."}
{"text":"What a fun experience! We went to celebrate two birthdays was it was perfect! Conor was an awesome server. He was friendly and quick. We sat in the trailer which was super fun. Check it out, totally worth it! The food was all amazing. Between us we tried the pretzels (must have!!!) wings, burgers (Elmer Fudd was legit), pizza, and you cannot skip the S'mores! So fun and so good! We will definitely be back!!!"}
{"text":"Came in with my fam and had a great time at Camp Social. Our waitress, DAPHNE, was one of a kind. She suggested many dishes and we really her service and were impressed with the Brussels sprouts, their Fig Mules, avocado toast, hummus, and the grand finale-- their awesome table side s'mores!   To be 100% honest, Daphne made our experience. She was so passionate about the food and venue that she made us want to come back for the dinner and late night experience- we were surprised and excited that they are open until 2am--"}
{"text":"Great place for appetizer and a drink but forget dinner.  Camp social has a heat bar with great service. But the menu??  It just tries too hard to be something it's not.  We had craft beers and the bar staff (josh) was really helpful. For appetizers we tried the fried pork rinds (courtesy of the guy next to us) and the fried fries poutine (still not sure why they add fried pickles although they were good). Dinner was a charred caesar salad and the fried fish sandwich.  The salad dressing was clumpy and the fish was chewy.   I'd do the salad again without dressing. Skip the fish altogether."}
{"text":"I liked the atmosphere and the service was spot on from Dave and other staff. Some unique stuff on the menu but I was in the mood for a hamburger. That was probably my mistake, should have tried something different. The hamburger and fries were average, based on my meal and overall food my review is 3. My sister got a ribeye sandwich that was pretty tasty, I enjoyed that more.  I also saw potential in a fun atmosphere and themes such as s'mores for dessert. I really wanted to give this place more of a 4 because of the kind service and the potential for me to come back and find something better. Will probably try this place again and perhaps update at another time.   Also; definitely appreciated a manager comping one of my friends meals because it came out incorrect. They really took care of us."}
{"text":"Very average restaurant.  I wanted to really like the place but was not impressed.  Meatballs were ok.  My husband ordered the walleye sandwich and it was , again, ok. Tartar sauce was tasty.  I ordered a sausage salad and they brought me the wrong salad. I immediately noticed and advised our server.  He apologized and put in the order for the correct salad.  I had to wait about 15-20 minutes for the salad and my husband had already finished his meal minutes after  getting served.   When we got the bill, there was a charge for the salad.  An experienced server would have removed the salad from the bill for the inconvenience, to rectify his mistake that he admitted to, and to create goodwill.  Our server's resolution was to charge us for the wrong salad since it was $2 cheaper than the one I had ordered.  He also said his manager was difficult to locate so he couldn't ask him to remove the cost.    Lesson here readers, hope you don't get served an incorrect order as Camp Social doesn't give their servers autonomy to comp a mistake and apparently the leadership is not around to support them."}
{"text":"Tooley is a super rad bartender, great conversationalist, & was kind enough to compensate a food item that was not our favorite. Fun atmosphere & laid back tunes."}
{"text":"We went on a Saturday night for a birthday party and it was packed!  A+ on their décor -- the camping theme was on point. From the tire swings to the trailer, they made sure every aspect of the restaurant stuck to the theme.  There were about 30 of us and most of us just ordered appetizers.   I ordered the mussels, and that was probably the best thing I had all night. The sauce was a little more on the spicy side, but that made it more flavorful to me than the other things they had on the menu.   The spicy pork shanks were ok as well, nothing spectacular.   The pork rinds were good, but I would have wanted them to be crispy. I liked that they came in a paper bag, but a lot of them were a stale, like it had been sitting out there for awhile.   The dry chili fries was a little disappointing as well. I actually don't like my fries too crunchy, I even like it a little soft, but just like the pork rinds, it was a little stale to our taste. I did enjoy their ranch dressing though!   The pretzels and cheese dip was good as well but you can't really mess that up.  I tried the smores drink and yes, I did it for the gram. Don't get me wrong though, it was definitely picture worthy but that's about it. It didn't taste as good as they described it, I barely drank half of it. Some of the drinks I enjoyed from my friends were the fig mule and the camp sangria!   I still enjoyed my time here even though the food wasn't amazing. I think it's good for big groups. Even though there were about 30 of us, it didn't feel like we were too loud or overwhelming to other customers. Maybe I'll try to come back for happy hour, just for the tire swings, and the drinks."}
{"text":"The restaurant was great. Cool ambience. We had the Lazy Sunday drink served in a thermos which was fun. Food was great. I had fried chicken from the appetizers menu, which was juicy and plenty big enough as an entree, served with fries. Burger had a delicious grilled flavor with a bun that didn't fall apart. I'd say the only con was walking out the front door to the parking lot/valet. I'm sure this isn't an issue at all if you don't go on a busy weekend night and when there isn't as much traffic. Just have to watch your toes. Haha"}
{"text":"Brought my three younger nieces to Camp Social and Chris was our server! Not only was he accommodating, and patient with us, but he was also very attentive to our large group!! The vibe of the restaurants IS amazing, but servers like Chris make this place even better!! THANK YOU CHRIS!!"}
{"text":"The theme and decor was a really cute idea! Something different for Phoenix. When we walked in we had difficulties finding the host, we had made reservations on opentable. There was absolutely no personality from any of the crew members, which is always a let down if you ask me. The food was nothing great, no flavor and the menu was scattered."}
{"text":"Entree Food was a little so-so, but the environment and service were excellent. The marshmallow dessert is however very unique and a huge hit with the kids. Not at all displeased."}
{"text":"Amazing food! A bit pricey but so delicious and with it! I got the Poutine and the pork shanks and mixed them together. Love the atmosphere. Will come here again!"}
{"text":"Pretty cool concept for a bar. Went for drinks with friends so we didn't sit on the tire swings because there were too many of us. Many of the ladies in the group had the meatballs which were good size. I can't wait to go back and try the deep fried walleye sandwich. Server was a little slow on checking with our group."}
{"text":"Our friends snagged a spot outside with relative ease after the hostess said it would take an hour for a table. We were a party of 5. I'm not sure if the outside seating isn't on the servers normal rotation but it took forever to get drinks/order food. Once our apps finally arrived I had to get up and walk to a table inside for plates and silverware. One of the managers came over but at that point I was already pretty annoyed. Food was ok and the two stars is for the ambience. Will definitely not be back."}
{"text":"I love a good theme and Camp Social does it so well. I met a girlfriend here for lunch and we sat at the bar swinging on the tire swings the whole time. The two bartenders were nice, sociable, and very helpful with suggestions on drink and food choices. We started off with the Lazy Sunday cocktail which was served in a thermos and mason jar glasses, the drink was so refreshing and delicious with fresh peaches. We shared the avocado toast and elk poutine. They changed it up a bit with the toast by adding crunchy peanuts and jalapeño dressing that had a nice bite. The elk poutine was awesome, with crispy fries and had fried pickles on top! We were enjoying our time there so much we ordered another round drinks, my friend had the paloma and I had the figgy mule, both were just as good as the Lazy Sunday. There's lots of cool stuff going on here, they have a whole game room, a booth in a trailer and the tire swings were super fun. I will definitely return!"}
{"text":"I came here with a group of girlfriends before the Sam Hunt concert this past weekend. It was the perfect spot to pregame before a country concert! We had a reservation since we were a larger party and despite seeing quite a few empty tables, it still took about 10 minutes to get seated. After speaking up, management stepped in and we were all taken care of soon after that! :)   We indulged in some of their cocktails and they were all very tasty!! I had the fig mule {a little on the sweet side for my liking but tasty if you like mules!}, the Jumping Juniper which was SO refreshing {it didn't taste much like gin so don't let that scare you!}, and the firefly which was my absolute favorite. I LOVED the green chili flavor paired with berry in the firefly.   For food, we shared the pretzel, the sausage pizza, pepperoni pizza, and the beet salad. Everything was yummy! The pizza was different but definitely delicious. My favorite was the sausage pizza! The beet salad was heavy on the beets which is a plus but the goat cheese foam was not my thing. It basically tasted like watered down, foamy goat cheese. No thanks! If they just sprinkled regular goat cheese on top, this salad would be a major winner!   For ambiance and concept, they get 5 stars! It is such a cool spot with cute little trailers that can be reserved for special occasions, tire swing chairs at the bar, cooler coffee tables, outside, s'more dessert with a mini fire, and more. It was super cool! Great for all ages.   I'll definitely be back because of their unique concept and good vibes! :)"}
{"text":"Lot's of show; not a lot of substance. Went for lunch, given the blaring hip hop I believe they were trying to portray themselves as a night club in Scottsdale on a Friday night.  The food is pricey for what you get...I went with the standard burger..$12..nothing special...however it was served with enough grease to make the bun soggy.    This is a good place to take a date when you have run out of being original.   I will never EVER understand a new food service restaurant that does not train it's staff to ask, \"Is this your first time here?\"     This is the new area for foodies..this place is in tough competition and needs to up it's game."}
{"text":"I'm a Camp Social survivor and this is my story.   A group of us, eight in all, gathered on the patio to celebrate a friend's descent into her 30's. Little did we know how far we'd fall that evening.   Shorty after sitting down, we were informed that service had been discontinued on the patio--because they were busy and understaffed. Not to worry, though, we could just go inside and order straight from the bartender.   I promptly went to the bar. I promptly was ignored at the bar.    When someone finally looked at me, I filled with hope ... that was quickly crushed. I was told I could not place my drink order at the bar. I do not know why, this seemed to be a mystery to all involved. As I explained the server's instructions, I was met with a blank look of confusion, followed by some hushed back and forth between the bartender and a young man.  Things were getting exciting.   \"I'll be right back. I need to check with management.\" The boy-ish figure walked away.  I waited. Again, no one made eye contact. After a while, I scanned the room for a sign of life. The young man was gone. Maybe he'd find me on the patio? Maybe I should just go back outside?  I watched everyone seated at the bar order a drink. My mouth suddenly felt as dry as the desert. Jealousy simmering below the surface, I gave up and went back outside. Spirit crushed and without literal spirits to soothe myself.   The boy never returned.   I shared my mysterious tale with the group. None of us had been successful at getting even a water.   The suspense was building. Should we wait for the boy to discover the truth about how to get food and drink in a restaurant? Should we just leave now? Should we send in a recovery team? The excitement slowly morphing into frustration the longer we discussed what to do next.  Finally, a sign of life, a waitress delivered food to a nearby table.   I flag her down and ask how we go about ordering. I explain that no one inside will serve us, and no one outside will serve us, and this one boy straight up disappeared. Is he ok? Should someone alert the authorities? Maybe call his parents? Just tell us what to do, woman!   She goes back inside to check with management.   It's not excitement I am feeling this time. It's fear bubbling up from deep inside of me ... fear or acid from an empty stomach.  My eyes follow her retreat to The Inside and I spot the first guy who told me he was going to check with management wandering around aimlessly. The sight of him quickly turned from relief to alarm, as he seemed to have had his memory of my existence erased. I felt sad for him and then for myself.   A brief glimmer of hope, the server eventually came back with good news and an apology for the confusion--she will take our drink order!   Cheers can be heard around the table. Drink orders are placed and smiles materialize on my comrades' faces. Not all is lost.   Time passes. Smiles fade. Runners bring out plates of food for the tables around us. We continue to exist on air. I start to wonder if we are going to die here.   The abstract thoughts of death turn to reality--sustenance is not coming. All signs of the waitress have disappeared. Did she even exist at all? I start to wonder what kind of soul crushing monster lives inside Camp Social, destroying all who seek it's advice.    Then someone new appears. I inquire as to the whereabouts of our ill-fated waitress and am met with more confusion.  Frustration has now been replaced by pure, unadulterated fear.   Am I in an episode of Black Mirror? Is this a 21st Century Twilight Zone moment? Who are we? Where are we? Do we even exist? Is this a dream?   I have no memories beyond this point. All I know is this, we found ourselves across the street, wine glasses in hand, and food on the table. I felt the warmth of wine filling me up with pure joy. I made it. We made it ... somewhere else. We escaped the never ending loop of confusion. Whatever that thing was inside Camp Social, sucking the life force from it's people, didn't get us that day. We were alive."}
{"text":"The places brings the atmosphere hard. Love the camping/cute camper theme going on. Lots of exposed wood, swinging chairs, and a sparkly ceiling to compliment the open air venue. Really fun cocktails...we got one that came in an adorable thermos. Great music and really relaxed crowd."}
{"text":"Pros: Decor (10 Stars +)  (They thought of everything!  From tire swing chairs at the bar to red & white cotton dish towels for the napkins to Igloo ice chests for coffee tables by the outdoor couches to the s'mores dessert that you roast over a hibachi type grill at your table!) Hard working, over extended waitress Hamburgers Fries Fried pickles  Trout  Cons: Ratio of ranch dressing to fried pickles  Charge of 50 cents for another tiny ramekin of ranch dressing. Waitress explained it was homemade. Wow. Seriously?! Absent manager  Low staff to customer ratio   This was our second visit. Last time hubby had the trout and gave it a 10. I had the Short Ribs and give it a 5. Too much fatty inedible beef. The beef that was edible was great, but after cutting away the fatty parts there wasn't all that much left.   This time we both had burgers. The waitress checked with the cooks in regard to the pulled pork to see if it was lean. No, they said. Glad they were honest anyway.  Their burgers are not cheap, but they are the most authentically tasting grilled burgers I've ever had at a restaurant!  You'd swear your Uncle Bob was in the back at a charcoal grill.  Toasted bun was a great addition.   Too bad the up-charge for an appropriate amount of ranch dressing to dip fried pickles in was such a buzz kill. And ..... too bad the manager was no where to be found for the verbal feedback.   It was a Sunday night. We arrived at 9pm."}
{"text":"This was my last night in Phoenix, and my friends and family brought me here. For starters, be prepared to feel like you've traveled onto a campground in the woods. The atmosphere and decor says it all. The first thing I noticed was the DJ booth, which was a mini trailer. They also had one you could sit in and eat. The outside decor was even better. The lounge chairs had ice chests as tables which was neat. There was also a big fireplace area which also had some fun games to play with friends. Overall, great atmosphere to hang with friends and family. The food was also a plus! We ordered a few appetizers and the s'mores for dessert. I highly recommend the pretzel with cheese and the roasted vegetables. This place is definitely an establishment I plan to return to."}
{"text":"Atmosphere is fun, food is pretty substandard.  I have been there four times and have yet to have a good meal.  Usually sit at the bar.  Tons of employees dancing around and talking around the bar but surprisingly hard to get a drink when you are finished with the last one.  They need to play less and pay more attention to their paying customers.  The fig mule is really good.   Probably wont go back to eat but maybe for a drink."}
{"text":"Camp Social is a GREAT place for cocktails. I feel like their menu is a little lacking. I attempted to order a couple of different things and was told they were \"out\" of those items. I do feel like the concept and ambience is awesome!"}
{"text":"My friend and I were first timers at Camp Social and the happy hour is amazing! I don't drink (which usually gets a snarky comment from the waitress/waiter) but our server Esya (Sia) made me a great mock tail! She was really excited and said that the bar would make something great for me which they did! All appetizers are $3 off and all pizzas are $5 off plus a lot of great drink specials.   Not sure why there's bad reviews everything was amazing. Food -delicious. Service -fantastic. Atmosphere -SOCIAL!   Will definitely come back :)"}
{"text":"The atmosphere is fun and different. The servers are very friendly but on the night we were there, not really on top of the pacing. No one at the reception trailer; we had to hunt down a hostess. Once we were seated, there were long stretches between checking in; 3 servers dropping off food but failing to \"accept\" a drink order (\"I'll  send your server over.\" What? Didn't you just serve my food?). I would have ordered another glass of wine but I was afraid it would arrive after I was done eating. Their loss. Then about a nano-second after we ordered dessert, he drops off our bill. We weren't anywhere near finished; heck we hadn't even received bed our dessert yet! I find that rude. It was not late either.   The food is ok. We started with the pretzel and beer cheese, which was large enough for 3 of us to share. Came out very hot and was a good soft pretzel. For dinner, I ordered the meatball and polenta appetizer with a side of roasted vegetables. The meatballs tasted really good but the presentation was so sloppy. I couldn't believe the kitchen would send it out like that. My dinner mates had burgers and both though they were \"pretty good.\" At $12, we expected more. Ordered the s'mores for dessert. Homemade grahams and marshmallows make this delicious but toasting the marshmallows at the table is the real fun.  So, this would be fun for drinks with friends but for a dinner out, you can do much better for the money."}
{"text":"It's a lively, loud place. We ate at the bar area which may have been a mistake. The sun came through the front of the building so strong we needed sun glasses. Our first waitress, a blonde with no stereotype intended here, was indifferent or just not interested in us. The appetizer we ordered came quickly and their homemade pesto with grilled tomatoes and burrata was very good. I ordered the wedge salad which was difficult to cut, the bacon seemed old, and the tomatoes sort of tasteless. I think this may be more of burgers and fries place except for some of the appetizers. I would recommend the beers on tap as my red wine was just so-so and my husband's manhattan not very good. This is a beer and burger place.  Overall, we are not the target audience--this is a place for fun, it's loud and for the younger set.   I love the energy and I'm sure many 20 or 30 somethings do too."}
{"text":"I've been here 6-7 times now; they have such a fun vibe/concept, that I want to love it. But Even what I consider to be their signature just, table made Smore's, has now morphed into something less delicious. Their food otherwise is consistently bad, and I have tried multiple dishes at this point. Their drinks however, are excellent. Their service is patchy, though always nice. I don't think I'll be going back because their food is just so bad, that I can't justify continue to work my way through a menu that I regret eating every time."}
{"text":"Welcome to Camp Social, where you and your marshmallows can get toasted at the same time. For real though, you can go camping inside the city when you step foot into Camp Social. The moment you walk in, you feel like you've just teleported to a cozy camp-sight, full of fun. You are greeted by happy campers (hehe, see what I did there?) and beautiful decor, complete with amazing carved wooden bear statues. It's easy to get lost at this camp-sight though, it comes complete with drinks, a game room, tire swings, and s'mores.   We celebrated a birthday last night, and had fun being touristy -- my girl and I were immediately asked \"first time here, huh?\" Wonder what gave it away, lol (ok, not really). We roamed the grounds, taking pictures and taking everything in while we waited for the birthday girl to arrive. We finally made our way to the bar, where we squealed with joy acted like 5-year-olds because of the tire-swings. (Yes, we totally did.) When we remembered how old we were, we adulted and ordered some drinks from the bar. I ordered the Arizona Summer, delicious and refreshing, not too sweet, which was perfect. My friend ordered the Babe Bubbles -- rose all day; can't go wrong.   Once our entire party arrived, we were sat at a cozy table and ordered some appetizers. They presentation of the food was absolutely superb! The food though... it was okay. We ordered the Campground Vegetables (assorted grilled veggies), Yogi Bear's Picnic (meat & cheese board), and The Twist (soft pretzel & cheese dip). For our main meal, my friend and I split an order of The Chickpea (hummus, served with bread and veggies),  Phoenix Rising, and House Fries. Here is my reason for the 3-stars. The Chickpea, I was not a fan of -- the hummus was a bit too smokey for my liking. I felt like I was eating hummus next to a camp fire and took a big gulp of smoke with each bite; not my thing. The Phoenix Rising was too crispy and fairly dry, even for chicken. My favorite thing that we had ordered was the House Fries -- they were delish!   For desert, the birthday girl got s'mores and of course she shared! Absolutely fabulous s'mores presentation and taste. They definitely put a spin on s'mores as I bit into it and instantly got a yummy mouthful of ooey gooey marshmallow, melted chocolate, on a graham cracker that had a hint of gingerbread -- which I love!  Overall it was a great experience, good fun in a laid back atmosphere. My friend and I are planning on bringing our guys here soon -- hopefully we get the table in the camper (so cool if you haven't seen it) -- and then play some ping pong, jenga, or oversized connect 4 afterwards."}
{"text":"Camp Social is a trendy eatery in the theme of outdoorsy camping.  Interior decoration is whimsical with campers used as a family booth area and reception area.  The music is loud but it is a kid friendly family welcoming venue.  Children can feel welcomed and comfortable.   The menu has many delicious options of appetizers, salads, sandwiches, burgers and pizza.  Gluten options for an additional price. We had the autumn salad with butternut squash and cauliflower and a gluten free Smokey Mountain pizza.  The food was delicious, however, the portions were small for the price. Because we arrived during happy hour  w e enjoyed mules for  $6 each.  They were refreshing but we could not taste the liquor.   After our meal we played shuffle board and ping pong in the game room.   We heard the desserts are yummy but we didn't indulge."}
{"text":"Another fun new bar and restaurant in Phoenix and 7th street. I like this place because they try to take your mind out of he city with not only their campy vibe and décor but their gamey food choices as well. One that I really enjoyed was their Fried Pickle, French Fry Poutine, with Elk Gravy. The Elk Gravy had just the tiniest gamey taste that was surprisingly complimented by the fried pickles. But if different scares you, don't worry, they have your good old American staples too. One that I tried was their Chicken, Pear, Bleu Cheese, with Jalapeño, on a roll. And if that is not good enough for you, it states on their menu that you can pretty much request anything and their kitchen will be happy to make it for you. They have a pretty big selection of interesting Pizza's as well. I had their Acadia - Maine Lobster, Parsley, Lemon, Pesto, topped with parmesans. The Lobster was cooked perfectly, but the amount of dry parmesan on this thing almost killed it. The parmesan would coat your mouth and dry it out. I would recommend getting the parmesan on the side.   Now to the fun stuff! Cocktails, Games, Fun seating, and social atmosphere. I have been here once with the husband, and twice with friends. This place is great with a group of people. They even have Larger sized cocktails to share, a mystery bagged beer and shot special, a good happy hour, and games in the back room. The Kraken Kolada is my favorite. Super summery and refreshing with Kraken Rum, coconut, lime, pineapple, and mint. The staff is super friendly and helpful. The manager's and sometimes owners walk around to see how everything is going. Even gave us a coupon for a free drink on them the next time we were to come in. I am excited to come back when it cools off to enjoy their large and cute patio."}
{"text":"Chris was helpful, food was good. Atmosphere fun and a great place to take kids. Music fun, I like the vibe!"}
{"text":"I'm giving 4 stars because the ambiance is adorable and fun, and the music was awesome...60's/70's on a Saturday afternoon. Brian was my server, and he's very nice and attentive. The campfire burger was juicy and delicious with a little kick, and the AZ Margarita was not too sweet, and had a nice tangy flavor. I would not recommend the capers app...the pesto was good, but I've had better bread...it was just a so-so dish."}
{"text":"This is a fun place to hang out, fun camping decor, unique drinks and camp food and the s'mores roasting at your table is fun!"}
{"text":"We went last night, no reservations with 8 other people. The hostess was so sweet about no reservations and had us seated in 28 min. The place is fun, exciting and something new. Food was just ok but am willing to try again because of the atmosphere."}
{"text":"Do you want to wait 5 minutes for a drink, how about 10 or 15 come to Camp Social we will take care of you! We won't even say hi!!"}
{"text":"It's got a fun set up, but all the games were in the back and not where we were sitting.  There's a couple really big tv's so it might be more fun when football's on.    The pretzel was one of the best I've ever tasted.  Unfortunately the cheese sauce it comes with is thin, gritty and tastes like flour.  The flavor of the mussels were very good and the portion is huge.  It was not completely cooked though so I had to toss like 6 that didn't open and half of them tasted like oysters because they were pretty much raw.  Thankfully though, I did not get food poisoning so must be fresh?  The smores are fun to get and you can't really mess that up since everyone makes their own."}
{"text":"Loved this place! Came in for the first time after searching online for restaurants that are kid friendly. When we got there we were immediately greeted by friendly hosts and promptly seated. Our server was Josh and he was awesome! He helped guide us through the menu and recommended some great items. Everything we got was perfect! My daughter actually ate her dinner, which never happens! To finish an already awesome dinner, we got the s'mores for dessert and they were AMAZING! Everything was homemade (except the Hershey's chocolate because that's a classic), and it was served with a mini camp fire to toast the marshmallows! My daughter was SO excited! Everything from start to finish was great and we will definitely be back again!"}
{"text":"If happiness is the goal - and it should be, then adventure should be a priority. If you can't get yourself out of the city, let Camp Social transport you the trendy outdoors to feed your need of camping without the mess of toting everything for a camp site. Inside, you'll find a hostess stand stationed inside a whimsical camper. The decor is all about the outside being your playground from canoes to beach cruisers to cooler coffee tables.   Camp Social lets you be wild and free with the tire swings around the bar, tons of games in the back room, as well as toasting your own s'mores. Great spot to brunch, dinner, birthday parties, or just to hang out. I am a huge fan of their bottomless mimosas and breakfast pizza. Service can get spotty during their peak hours since everyone wants to be there. Love the variety of beers avail to quench your thirst as you chow on the pig ribs. Camp Social figured out you don't have to travel far to meet your happy self. Almost everything will work again if you unplug it for a few, including you!"}
{"text":"I don't get it. The whole place is just confusing to me. I was told this was a new, trending bar., but when I walked in it looked like a daycare center. The service was that of watching paint dry. My bartender kept taking selfies of himself instead of checking on me. He wasn't even that cute to be documenting his night at work, like anyone cares. I'm from L.A., so I know over priced, believe me! Camp Social was just highway robbery. $6 Trail mix? Really? They can't be serious. The tire swing was slightly amusing and the patio was pleasant. I won't be putting on my Boy Scout uniform anytime soon to relive my youth!!"}
{"text":"We stopped in yesterday for drinks and a snack and absolutely loved it!  They truly took the camping theme and ran with it throughout the entire restaurant...every detail was thought of. We got there early enough and snagged two of the tire swing seats - so fun!  I love that they have 2 campers in the restaurant - one as the hostess booth and the other as a table that can be reserved (you know I'll be back with some friends!).  Super friendly staff (everyone), lively vibe and a great place to grab drinks.  I really enjoyed my strawberry lime cider and a pretzel with beer cheese fondue (yummy!).  Such a great addition to the 7th Street restaurant corridor!"}
{"text":"Loved this place! Awesome atmosphere and reasonably priced menu. I'll definitely be back for the tire swings ha."}
{"text":"Perfect spot for chill nights and even for company night out. Love the concept. The staff were so nice and very approachable"}
{"text":"Wife and I dined there last night and had a great time and a great meal. All the staff were extremely friendly and our servers made great food and drink suggestions. We enjoyed the hobo stew, and the chicken sandwich, and of our course the already famous cook at your table the smores."}
{"text":"I live over in the area around here and have driven by this place multiple times and finally had time to stop in about three weeks ago. Let's just say that I am VERY HAPPY that I did. I have been back here two more times and each time has been a fantastic experience. This place has an amazing vibe that is fun and sets that out doorsy mood. They have delicious food. I have tried the twist, the Phoenix rising, the dads burger. Even had some of their alcoholic drinks. They make a great Paloma and mojito. This is a MUST try!   Also want to shout out one of the servers named Chris. Great service and amazing attitude. Great guy!"}
{"text":"drinks are legit!  pizza super amazing!  love this place! oh and the staff super amazing!  a must for your foodie journey!"}
{"text":"Really love this place! Great camp look and feel from the tire swings to the Coleman coolers as tables on the temp cooled patio. Food came as a big surprise. As it arrived the presentations and flavors blew us away! For the drinks we found too many favorites. Personally I'll stick to the firefly but it looks like they have something for everyone! Can't wait to see what they have in store for brunch!"}
{"text":"My family and I went to camp social after hearing great reviews from family and friends. While we put our name on the waiting list and was told it was only going to be about 15 minutes, 30 minutes later had to go back to the hostess stand to find out they accidently skipped over our name on the waiting list! After finally getting seated and ordered quickly the wait time for our food or even to get napkins was almost a hassle for the waiters. We went to enjoy a nice dinner in a fun atmosphere and ended up not leaving for a total of 3 hours later feeling like we were constantly waiting. While I personally talked to the manager Anthony about the issues we had plus other issues with valet, I was informed I would be receiving a gift card for our bad experience.  After I week later, there is still no gift card. The customer service needs improvement."}
{"text":"My two cents .. yes the place has an original theme. It looks different from other places when you walk in, for sure. The music was too loud for me but I am one of those who does not like to raise my voice when I am talking to other ppl at my table and I had to do that here. Everyone was happy with their food. We had 4 main entrees plus an appetizer or two and the cheese and charcuterie board which was very good. The drinks seemed to keep everyone pleased too but if I order a drink that is supposed to be cold, I don't like it arriving room temp in a glass that feels even warmer than the drink. I was really looking forward to the swing I had read about in some of the reviews. I was disappointed to see that was just a ploy. There is no room to swing. That is not what it's there for. The only other thing I saw to do was ping pong but there were ppl on the table already and they played for a good 45 mins. I finally gave up on that too. We shuffled a little on the shuffle board but that's not really my thing. The bottom line is I thought there would be more to \"do\" but it's really just a place to eat and drink. It was cute though. Worth the trip. Once."}
{"text":"Fantastic first experience here! Our server Andrew was quick and attentive - kept the waters refilled and bottomless mimosas coming. Food was delicious - I had the Phoenix Rising chicken sandwich I've been checking out on instagram for weeks. The chicken was cooked perfectly with a good spice to it and was much bigger than the bun (very important). I also had the \"Morning Missile\" drink made with coffee and vodka - also delicious.   Looking forward to coming back and trying a lot more here, especially the s'mores!"}
{"text":"The atmosphere is fun and cozy. Definitely woodsy, they follow that open feel throughout.  We originally wandered in for snacks and drinks, wound up staying for a three course brunch.  Amazingly they serve brunch till 3 on Saturday and Sunday, which is perfect because I'm not a morning person.  The drinks were very light and palatable, Grandpas Thermos is my favorite. I love a drink meant for sharing. Plus the cocktail was peachy and very easy to drink.  Our Waitress was attentive and very courteous. She was very knowledgeable of the menu.  The food was beautiful, the drinks delicious, the atmosphere was cozy(amazing music) I'll definitely be back soon!"}
{"text":"I am writing this right now as I am sitting down on one of the cushy couches. The service at the is place sucks. Me and my girlfriends went to the bar area and requested water as we reviewed the menu. Literally several bartenders saw me and not one addressed me to ask me if I wanted anything after that. My patience started to run thin and then a guy across the way walks up and the female bartender acknowledges him and he orders his drink. Seriously? So I won't be spending my money or time here.. waiting for a friend but I'll be out of here in less than 10 mins. Service sucks or maybe it was just for me."}
{"text":"First time in and I was very pleased, very friendly atmosphere we had Andrew as our server. I do  Recommend  Common a"}
{"text":"Amazing place.  We were up the street at CBCB watching games and was so cold couldn't enjoy game left at half time to come here to warm up and try a new place.  They had told us the lions game was on but we're having trouble with feed.  Felt bad for telling us that on the phone so they bought our first round even though was a direct tv fault.  Garret is amazing! He opened up the outside bar just so we could sit out side and enjoy the weather.  Super attentive and knowledgeable about the items on the menu.  Try the fig mule.  You won't be disappointed!"}
{"text":"Interesting atmostphere and excellent tasting food. Assertively priced on food and beverage. Womans restroom door is so heavy it feels like you are pushing three women out of the way to open it... but nope its just that heavy. Fast high energy dance music was playing and it felt stressful and detracted from the atmosphere. Its a camp social setting-- do assorted folk, singer songwriter, and pop rock and pop country with singalong feel from late 50s onward to add to atmosphere instead. Smores as dessert should definitely be tried, because lighting marshmallows on fire as a grown up after a great dinner is definitely fun and yummy."}
{"text":"This was my second visit to Camp Social and given all of the less than positive reviews that I have read for this place - I think they deserve better!  My initial visit was Happy Hour a couple weeks ago with girlfriends and we all had a lovely time with an attentive and delightful server who kept the cocktails flowing and appetizers plentiful.  Yesterday we were a party of 7 celebrating  family Birthdays.  Every one of us enjoyed our meal, recommendations were on point, and service was attentive and upbeat.   The fried pickle French fry poutine and Hobo stew appetizers were quickly scarfed down by all.  My sweetie enjoyed the smoked steak tartar and those brave enough to try it for the first time also complimented on the smokey host of  flavors. The trout dinner was truly amazing - with SPECIAL  thanks to our server for letting me choose between head on versus headless...I went with the latter. Of course My favorite was the S'mores.  Having grown up camping with my family for two weeks every summer in the Adirondack Mountains at a place called Fish Creek, S'mores were always a big hit around the campfire -no matter how messy, gooey and sticky,  roasting your own marshmallow was always the most fun - I love that Camp Social brings the campfire to your table making this a truly interactive and delicious fun treat.  Camp Social holds a special place in my heart;  the trailer booth was  a trip down memory lane - as were the canoes and other kitschy but comforting décor!  It may not be everyone's thing but I for one enjoy this not too full of themselves kind of atmosphere and hope people will give them a chance!"}
{"text":"We went there for a work meeting and this place is absolutely adorable. They successfully pulled off their camp theme.   The waitress was prompt, but we were waiting for people so we told her that. She kept returning to the table every five minutes and kind of felt like she was trying to rush our visit.  The food was pretty good and their was a good variety in their menu. I loved the Brussels Sprouts App, but did not like their hummus or wings. The wings were dry and the hummus was bland.   I'd go there for beers and the atmosphere, but not so much the food."}
{"text":"Even when your sitting inside your chilling outdoors.   Camp Social has really gone the extra mile to create a fun, cozy glamping experience. You walk in through huge roll up, glass garage doors into the outdoors. Stay with me. The reception desk is a 1950's camping trailer, giant tire swings hang on the outside of the bar and thick wood beams on the ceiling create a cabin vibe.   We were seated and greeted promptly and our waiter, Marco (?) was very friendly and above and beyond patient and helpful with our family of 5 trying to decide what to get for lunch.  I wasn't very hungry and ordered the grilled vegetables w a Pesto & a Red dipping sauce. DELICIOUS!!! Perfect al dente cooked gourmet veggies; petite baby carrots, broccoli rabe, Brussels and cauliflower w fresh grated Parmesan. I washed it down w a Cabin Sangria.   Mamma's Happy!!  Husband ordered the breakfast pizza and it was a huge hit! Wood fired crust, White 'gravy' sauce, thinly sliced golden potatoes, sausage, white cheddar & two poached eggs in the middle.   The Bloody Mary was on point!!! Happy Daddy!!  Boys ordered the \"Dad Burger\" and fries. It was a $14 burger that did not disappoint on any level!!! The giant patty was cooked to perfection and on a buttered & toasted gourmet bun.   While we waited for our meals we headed to the Game Room in the back of the restaurant. Old school video games, shuffle board, ping pong (bring your own paddles if your at all serious, theirs were really beat up) and a cozy leather tufted couch and giant stone fireplace.   We can't wait to go again, next time for the Giant Marshmallows roasted at your very own table!"}
{"text":"I have been to Camp for a couple happy hours and always thought the vibe was upbeat and relaxed.  Great surroundings, atmosphere and service.  Recently I went back for a dinner with friends and it was quite an eye opening culinary experience.  I always temper my expectation for seafood related items and frankly any \"theme\" restaurant food.  I was wrong.  The mussels and trout were some of the best I've ever had.  Love the hobo stew and pretzel with crab meat (those lamb sticks are dangerously good).  Too many cool items to list.  This restaurant is one of the most unique, fun experiences here in the valley.  Big fan and will be back soon."}
{"text":"This place has a fun upbeat atmosphere. We sat by the fire and played 4 square. The Grand Canyon pizza was awesome! The staff is great to!  Our server Tim was very nice and attentive. We meet one of the managers Tony who was great as well!"}
{"text":"Slow service but when she did come around the server was way too involved in our dinner.  I live in the neighbourhood so twice I have met a date there for a drink after work. Different dates.   Our server recognized me and went on and on about how she had served us the week prior. Even after I dismissed it and tried to laugh it off, she insisted she had served the two of us the week before. I'm sure you can imagine my date wasn't too impressed."}
{"text":"Holy smokes where do i begin!? I thought i was on the show Mystery Diners. The workers were literally drinking on the job..making themselves cocktails if you want owner (go ahead and verify girl wearing Dallas cowboys jersey numbered 24 at 11:11 pm 9/25/17 who was basically pouring drinks for her co-worker friends...the whole entire time my group of friends were wondering when was the owner going to run out and stop this fiasco. The food and drinks were good besid3s the fact all the unprofessionalism.   Weird......"}
{"text":"This place is AWESOME! Definitely a hidden gem!! I say hidden because it's not necessarily new but I've still never heard of it until recently which astounds me. Walking in.. the hostesses are inside of a trailer, the bar stools are actually tire swings, and there are tables with mini s'mores stations at their tables. Our server was friendly and attentive and had some good recommendations. We ordered the classic s'mores martini which was good but VERY strong so we switched to wine. I was kind of underwhelmed with the menu options.. I wish there was a little more variety. Needless to say if I'm in the mood for some good drinks, fun ambience and a flatbread I'll definitely be back.  **in my opinion, I think the valet in the parking lot is a little unnecessary... it took them forever to get everyone's cars and I could have been on the freeway by the time they got my keys if I had just parked my car myself"}
{"text":"I'm giving Camp Social a 5 star not because it's a Michelin dining experience, but because it FAR exceed my expectations. Managed to make it in during a weeknight happy hour. Despite wanting to get a tire swing spot my stomach and I overruled that notion and headed to the bar. My dining companion and I were very pleased by this choice buy the end of the night because we had super attentive service from the bartender there. She set us up with drinks, informed us of the specials, and was very friendly and attentive.   We shared the hobo stew and mussels. I was expecting good food, but was instead treated to a dance party in my mouth. Despite it being August in Phoenix the hobo stew was so delicious I used my bread like a scouring pad to get the last bits of gravy. The mussels were a hybrid breed. They're nice and plump, served with a crusty bread you can soak up the spicy broth with.   We decided on the chocolate torte for dessert. We were so stuffed from dinner we could barely finished half of it. Which was just fine because that means I got to have it with my morning coffee. Just after we got our dessert the owner came around and introduced himself, asked if we were enjoying ourselves, and praised his employees. Very nice touch.   It gets busy but had enough space that you don't feel cramped, staff is friendly, happy hour prices are a steal, food is on point."}
{"text":"Some of the best service I've ever received. I ordered the Arizona Summer drink which has tequila, ancho Reyes, and watermelon. It sounded really good but when I tasted it, it was soooooooo gross lol. Like it tasted completely like ancho Reyes (chili liqueur) and nothing else. So I sent it back and got a Modelo instead that I was happy to drink. After I was happily enjoying my beer, the manager came over to the table with a brand new Arizona Summer ! He said he remade it with more watermelon and hoped I liked it.  it was so sweet ! And a lady who I thought was maybe a bartender came and asked me if I liked it too. I felt really special. I didn't ask for any of that but I was so appreciative I couldn't believe how sweet they were. And they didn't charge me for either drinks ! On top of that the food was really good and I live close so I'll be back. Thanks guys !!!"}
{"text":"I absolutely loved this place!! The atmosphere was amazing, they have freaking tire swings as seats at the bar!! Like come on so cool! The pizza was also amazing and the beer was ice cold! will definitely becoming back. It's truthfully not like any other place I've ever been too"}
{"text":"We recently held a baby shower at Camp Social and it was THE BEST! Camp Social is a such a unique and creative concept that carries throughout the entire experience from the décor to the menu and drinks. The staff were very accommodating and even helped us hang a few decorations. Even though it was a last minute event, there was absolutely no pressure or worries because Allison (the manager I worked with) made sure everything was ready and perfect! I will definitely consider Camp Social for my next event and will be back for drinks and dining on a regular basis. The food is excellent and the vibe all around was welcoming and perfection! Thanks for such a delightful and memorable experience! \"Camping\" has never been so much fun!"}
{"text":"Really unique restaurant off 7th street. There are so many great ones around here and this adds another to the list. Interesting theme to their restaurant should work even better in the winter with roasting marshmellos. Rib eye sandwich was really good"}
{"text":"Really cute place , good food but you don't get a lot for your money. Great atmosphere the waitress was none engaging the manager seemed very very nice but it took about 30 minutes to get our food which to me seems a long time it wasn't even that busy I'm not sure if we'll go back but maybe for happy hour? We only drank water and we both had a salad. The bill was almost $50.00 I posted this 3 days ago w no reply from this restaurant!! Interesting"}
{"text":"Complimentary Valet: Speedy and friendly but VERY DANGEROUS walking to the restaurant entrance i..e. no sidewalk; its a very narrow driveway from the street to back parking lot. Atmosphere: Garage doors and a small camper as the hostess stand left me underwhelmed but I understand the evening star-field across the ceiling is suppose to be cool. The lighting change when the sun screen was rolled up was overbearingly INTENSE. Its a sports bar with A LOT, and I mean A LOT, of TV screens playing sports events - which is contrary to camping in the great outdoors. There isn't much of a difference between Cold Beer & Cheeseburger down the street. Sound Level: VERY LOUD! Like, VERY VERY LOUD! Food: Unimaginative; Crispy Chicken Sandwich was difficult to eat as a sandwich; the greens were very wilted and literally compressed into an uneatable ball; the bun was dry and fell apart. The fries portion was meager and over-double fried leaving many hollow shells. The flaming smores dessert look impressive. Staff: friendly but a bit over attentive - from the minute we sat down throughout the meal felt pressured to hurry up and turn the table. Summary: I was looking to have a unique fun upbeat experience with out-of-town family but didn't happen. Boring menu; same old OVERYLY LOUD atmosphere with OVERLY done TV screens showing sports and overpriced for the value as most of the new restaurants in the Phoenix area. New eateries always need to work out the kinks but the lack of menu & atmosphere imagination left me disappointed. My fellow dinner companions enjoyed their food."}
{"text":"The theming is so fun and especially endearing to those of us who camp and love the outdoors. Be sure to check out the bathroom sinks. We were delighted to learn they serve Green River. Our food was good. Our server was attentive and friendly, trading camping stories with us. Our daughter loved the game room with real games, not arcade. The atmosphere is great for a fun family afternoon as well as hip nightlife, something for all."}
{"text":"Went for happy hour which had some amazing deals. LOVE the atmosphere there. Feels so open and bright, I love it. Wasn't impressed with their trail mix but there other appetizers were good!"}
{"text":"Great experience and atmosphere. Great food, Good music and the service from Chris was amazing. Ordered the Brussels sprouts which were delicious and the fried pickles were to die for!! The Adirondack pizza was fabulous as well. Overall a great experience!"}
{"text":"So excited to try this place even though the previous reviews were a bit \"scary\".  We went Sunday at 5 and restaurant wasn't crowded at all. The hostess was friendly and first impression of camp decor was cute.  That's where the fun ended.  Our waiter was snarky taking our order as if he didn't have time for us. His comments were curt and rushed. We ordered a burger, the short ribs, the chicken sandwich, the pasta with salmon and the fried pickles.  None of us were expecting amazing food, just a decent dinner.  None of the dishes had any flavor! Seriously we all tried adding a ton of salt and pepper but gave up.  Not good!!! We ordered the s'more bar figuring it would be a nice way to end this experience but no.. it was served with lime green marshmallows (?) that were so big you couldn't melt them.  The little fire pit was tiny so only one person could attempt at a time.  The graham cracker was homemade (maybe) and was gross.  We all gave up. I gave 2 stars..1 for the cocktails... the fig mule was good and 1 for the decor.  So disappointed  Update... I was contacted by the  Manager Tawnie who was genuinely concerned about our experience and invited us back in to try again, even offered us gift cards for our dinner.  The follow up was outstanding and much appreciated!  We'll give them another try. Updating review to 3 stars for the customer service!"}
{"text":"Stopped in yesterday for some afternoon day drinking. What a blast! Met some fun drinking buddies at the paddle bar. The bartender Tooley was a lot of fun, had lots of good positive energy and vibes. We ordered chicken strips and the caprese salad both were good."}
{"text":"My experience all started with me going into Camp Social to check the place out for my wife's 30th birthday (it is in June so was looking for something inside).  I talked to one of the guys at the bar who gave me the number for Alyssa as she was the person who could get me setup with a private event.  I called Alyssa a day later and left a voice mail asking for a call back and stated some of the details of the event.  One week later I still had not received a call back so I called again, and again left a voice mail.  Now Alyssa did call me back about 10 minutes after that at which time she informed me that she was on maternity leave and was not working (funny part is her fiance is the one who gave me her number to set the event up).  So Alyssa gave me the \"proper\" contact information to setup a private event at Camp Social.  I called the number Alyssa had given me for Anthony and had to leave a voice mail.  Again I asked for a call back and stated some of the details of the event.  One week later and still no call back from Anthony, I called again and had to leave another voice mail.  After another week goes by of no return call from Anthony I finally gave up on having my wife's birthday party at Camp Social.  Simply put they do not care about their customers and have no organization with in the company!"}
{"text":"AMAZING FOOD!!! First, the atmosphere is so fun. Great decor, even better staff, and the music set a relaxing but rocking mood. The staff was friendly, responsive, and when I had an issue with my crispy pork scramble (barely any pork) and our server gladly took it back to the kitchen to add more. I had bottomless mimosas and my boyfriend had the coffee & vanilla vodka drink which he loved. The food - PHENOMENAL. Brunch was delicious and my boyfriend ordered the Phoenix Rising sandwich and was super excited and satisfied with the flavor and portion. Everything was great and we will definitely be back soon!!"}
{"text":"This is a really FUN new restaurant. You can't help but smile when you see all the fun whimsy inside.  You see tire swings at the bar. Old fashioned bicycles on the walls. THE CAMPERS. The hostess comes out of a camper to greet you and you just have to smile. They also have another camper in the dining room that one lucky table gets to sit in.   They also have lots of bar seating (a few tire swings too) and fun sounding cocktails. The table next to me had a flaming smore kind of drink.  The menu is different. It's American Fun Food and unique Fun Sounding Pizzas. There is a lot of variety on the menu so it seems that they offer something for everyone.  We tried the Fried Walleye Sandwich on a Tin Can Roll Sandwich and The House Made Sausage and Potato Salad.   The Walleye was meaty, moist, mild, fresh tasting white fish that was fried very light and crispy. It seemed oil free. The Tin Can Roll was very light but strong enough to hold the generous size portion of Fish. I thought the tin can roll was a really nice touch. The sauce could have had more of a kick for me but it's a crowd pleaser as it is so it's better the way it is. Fries are average but are crinkle cut and look like the kind that you camp with.  My husband's salad had house made tasty sausage and potatoes in it. It was so different...and tastyI don't think you will find anything like this anywhere.  Our server seemed very sweet and the manager checked on us to make sure everything was ok.  This place has a fun vibe to it. You can't help smiling just because of the atmosphere.  I think it would be nice to enjoy with friends, relatives or co-workers.  They say everyone leaves as a happy camper and I figure they do."}
{"text":"The concept is fun but I'm not convinced that it really deliveries in any other areas. The food is just ok and the parking is a nightmare. I know they have limited space but when the valet asks us to park our own car it was pretty annoying. We will try again but probably for just drinks."}
{"text":"Food was excellent and loved the atmosphere! We had the Saguaro pizza and Autumn Leaves salad this time. Last time we had the Adirondack pizza and the Pig Ribs last time. Yum! Plus our waitress was so nice!"}
{"text":"We waited about 45 mins and decided to just eat at the bar. We got the Camp Burger, Walleye Sandwich and meatballs. The meatballs were pretty yummy. We missed HH by 5 mins. It's from 3-6:15PM. My bf had the happy camper IPA. He liked it. I wasn't a fan. We would Come back, the staff was friendly and so was the crowd."}
{"text":"Eager. Stopped here on a whim to try out a new place. It turned out to be a wonderful experience. Sat at the bar and tried a few different menu items including the pretzel , mussels, fried pickles, and a couple of drinks. We are eager to go back and try the s'mores when we have more room."}
{"text":"Camp social. Its definitely that. Brought my son and my lady here for a nice night out and we liked what we experienced. Our server Andrew was top notch. Always coming and making sure we were ok. My son fell out his chair and Andrew gave him a smore which my son enjoyed very much. The food was good. I had the salmon hayak and my lady had the carne asada fries. The beer is nice and cold and the tunes they play are your usual top 40 from present and years past. They even got ping pong tables and old arcade games. I do wish the menu had more stuff on it. But that's nitpicky. If you have a bunch of friends and you want to try a spot that's cool. You can't go wrong here."}
{"text":"This is the best place for brunch. Our server Chris was amazing. We had a large group of 17 and he went above and beyond to accommodate us. I would definitely recommend this place and will be back again soon."}
{"text":"Had a brunch with a pizza. The waiter was great at filling my bottomless mamosas. Fun atmosphere. Comfortable airflow through out, that  \"openness\" that's comfortable in the fall. I will be going back. The red head gentleman waiter I had was tentative and amazing. I will be back. It's a bit pricey. The trendy spot.  But worth it. I'm very satisfied for what I paid."}
{"text":"We were so excited about trying Camp Social, but ended up being disappointed.  That being said, the decor is WAY cute.  There are canoes hanging from the ceiling as light fixtures, old camp trailers used as booths - it's a really cool concept.  I only wish that the food had been better.  The elk poutine had canned diced carrots and celery poured over it.  It was almost like that canned Veg-all stuff.  The french fries are also frozen Oreida fries.  The gravy and elk were good, but that wasn't enough to carry the dish.  We also shared two pizzas . . . I can't remember the names, but one had pepperoni and spicy salami and the other was the pizza with lobster on it.  There were a couple of chunks of lobster that were severely undercooked, which is just gross.  And the crusts on both pizzas were like cardboard . . . we both agreed that they tasted like frozen roller-rink pizzas.  It's possible that they do this on purpose, to go along with their camping theme, but regardless, it wasn't very appetizing at all.  Maybe the sandwiches are better, but I don't think that we'll waste our time checking this place out again when there are so many other great restaurants in this area.  Camp Social is pretty new, so hopefully their management will pay attention and improve the food soon."}
{"text":"I made a reservation for 12:30pm on Mother's Day. The good: The food was good and the setting is great. It is a really fun place. It was a little busy but all the tables were not taken. The bad: It took them 30 minutes to seat us and that was only because I reminded them we were there twice. The waiter got one of the orders wrong. Looked at it by picking up the sandwich with his hands and then brought some but not all the items that were supposed to come with the meal. We dropped $120 for four meals and some alcohol. Too much money for what we got. In sum: Bad experience but I'll give them another shot."}
{"text":"Super fun vibe, good customer service starting at the front door. A restaurant for everyone it seems.  Still working out a few kinks with their food-which is totally expected for a new restaurant.  Would defiantly go back again."}
{"text":"Definitely try this place out- here's why: Super cool decor You can dress up or down REALLY good beers on draft Decent wine list. They had my fave sauv blanc, so that was a win I don't date women, but there were a lot of cute girls here. Mostly in groups, so that's fun for those interested in girls! Good TV placement- the right events were on. Preseason football then a quick change to baseball once football was over.   Here's what you shouldn't expect: Consistently good food. I ordered hummus, which was probably the worst hummus I've ever had. I'd rather have sabra hummus out of a plastic container. My friend had mussels and he really like them! Quick service. While I was waiting for my friend to arrive, I stood at the bar for easily 5 minutes without being acknowledged. They have a hard time looking past the people actually sitting at the bar.  Smiling, friendly hosts. They were the opposite of smiling and friendly.    Also, a lot of reviews said this place was over priced. I thought it was super normal and comparable to places like culinary dropout."}
{"text":"Had a great experience with a large group. Such great atmosphere for a family get together. Staff was amazing and very helpful when we made changes to our reservation. Wait staff was very friendly and accommodating. Highly recommend!"}
{"text":"I've been to Camp Social 5 times since they opened 3 weeks ago and it's my favorite new place. Josh the bartender made great suggestions for drinks, the fig mule and s'mores martini are my favorites. My food runner, Cole, suggested the brisket sandwich and it did not disappoint. I also love the camp burger and of course the s'mores desert that you get to cook yourself over your own little camp fire. Awesome people and great vibe.  I can't wait for football season when it's cool enough outside to open up the sliding garage doors."}
{"text":"I was thrilled to hear that we were going to the restaurant with swings as bar seats, but little did I know it would come at a price. I was enamored by the atmosphere of the restaurant because it was usual and cool at the same time. Then, we sat down and ordered over priced craft cocktails and over priced food. I could totally understand the over priced drinks, but really $13-$30 entree items makes me want to rip my eyeballs out. All in all, the service was prompt and delightful, but I will not be going back anytime soon, eeek!  I went on a Thursday night, and my bill was about $50 (not including tip)."}
{"text":"I have been so excited about this place.  And have been watching the building in anticipation of the opening.    We were all set to go then I looked at the menu...   $14 burger??????????  So we are going for a drink, then will be eating elsewhere.     Dear management: please reconsider your menu.    It a little out of line.  Hi"}
{"text":"Such a fun place. We took a large party here last night. The staff was amazing. Our waiter, the manager, even the hostess went the extra mile. And the patio is a perfect spot for groups to hang out."}
{"text":"Food was eh...drinks were eh...enviro was pretty cool.  Better for a group night out then a night with a friend you needed to catch up with."}
{"text":"I was here on the 4th of July and had a great time! My boyfriend and I shared the meat and pickle board and the mussels, both were awesome. The drink menu is super creative and tasty. Our favorite thing was the mystery bags, which contain a beer and a shot. Staff was amazing and totally made our night."}
{"text":"Great bar except they refuse to play the sound for the big games even though EVERYONE is watching the game.  Weird.  I'll update my review if the management starts being reasonable."}
{"text":"Had a great night at Camp Social this weekend! The food didn't disappoint. We had the Lamb scrumpets for an appetizer...so good! My wife ordered the summer salad which she loved and I had the smoked beef brisket which is made with homemade bread right at Camp social and the brisket was perfect. The staff was wonderful and excited Would go back again!"}
{"text":"Visiting family and went to dinner on a Sunday evening. The atmosphere is great! The restaurant is designed and laid out in such a cool way. The patio will be great come fall when the temperatures drop a bit. They told us our wait would be about 35 minutes, though it was more around 20. We had a 1 year old with us, but they have a game room in the back (adult games) and we were able to let the baby run around a bit. Got a beer from the bar while we waited. Decent selection of beers. Some local breweries which is a plus. The service was great. Everyone was really friendly and attentive. The food was average, but came out quickly.   I was told Camp Social is very new and it shows, but not in a way that would deter me from coming back. Over time the staff will hopefully become more knowledgable about things (our server definitely checked when I asked if something had nuts for example, but the bartender was unable to make a beer recommendation). The menu looks great with a lot of cool dishes, but what we ordered wasn't as flavorful as we would have expected. I think this will come with time though as it usually does with new restaurants.   This would be a great place to come watch football or other big sporting events (3 large TVs in the dining area plus more in the bar) or drink with friends (especially on the patio). The prices were reasonable and everyone was super friendly. I'll definitely come back, but probably in a few months (partly because I live out of state) when they are not so new. Hopefully they'll add a s'more desert to their menu because not having one seems like a missed opportunity."}
{"text":"We all enjoyed Camp Social. It is among the growing scene that has begun to blossom on the 7th Street strip of new builds. I love the location of the restaurant and the many things to do around it.  I opted for the Brunch Menu as it had offerings in the price range that I wanted to spend at that point. I will say that most of their offerings start in the $13 and up price range. I'm just not feeling that when I'm at a bar and want just some simple.  All of our food selections were good and came out right. The portions were so big that both Twyla and I had breakfast for the following day too; I can't say that it applies to all of their dishes.   There was live entertainment in the lounge (patio) area when we arrived. It does not seem like a great place for kids and you could rack up a good bill very easily. Our waiter was great and very interactive. He explained the how and who owns the establishment. We enjoy different and the decor in here was just that. Somewhat like Twin Peaks but with a camping theme. You can even make your own Smores here. Yum!  Overall it is a pretty cool joint. I would not frequent it because the menu prices are a little bit high. Value versus price. We will however be back infrequently for a stop over.  #vino2 #Vinosquared #vino2ultimate #IrishcatV2"}
{"text":"At the bar.  The water tastes like dirt. We order an appetizer at the bar. She brought one plate for three people.  common sense bring three plates for three people. We asked for ketchup. They brought a bottle. It was empty.  when you pick up a bottle and notice it empty I think the logical thing to do is fill it up.  Then we ask for a new one. Never came. Asked another person never came. The manager came over asked if my we needed a refill on wine. no but I'll take some ketchup. She brought it right over. The guy managers were bussing tables. Hostess Station ladies were rude. From start to finish we were there for 2 1/2 hours. Slow service."}
{"text":"Cool concept, bar and space itself is awesome, love the tire swings. However, the service is TERRIBLE. First time I thought maybe a fluke so went back a second time and had the same experience. You'll sit at the bar for 15 minutes without being acknowledged. When I was there Friday a bartender finally came over, I asked about specials, she seemed annoyed while reading the board behind her and then walked away without taking our order. We immediately got up and left, went to Joes next door and had an awesome experience. Won't be back"}
{"text":"This place is so unique and cool! When you walk in, there is a camper parked inside with the wait staff hanging inside! The smell of campfire is in the air and there's a big bear by the door! The food was great - I'd recommend the cauliflower with jack cheese gratin, house made sausage salad (not what you'd think - summer sausage in a pan with sautéed onions and crispy potatoes), fried pickles and s'mores for dessert (comes with a campfire and homemade graham crackers/marshmallows!!! Great vibe - the drinks were amazing - try the fig mule for a twist on an old favorite and the firefly to add a little spice to your life!"}
{"text":"First time back since the menu changes.  Sad to see the hobo stew gone, but exited for the rest of the great selection.   Same great fun with new snacks."}
{"text":"Came here with a party of about 12 people for lunch. First off, the prices are pretty ridiculous. For those kind of prices on pizzas and burgers, it should be some of the best pizza and burgers you have tasted. That is not the case here. The service wasn't bad up until the food came out. After all of the people in my party received their food, I was the only one who didn't end up getting my food. I would completely understand if it came out 5 minutes or so after everyone got their food but I kid you not, it literally took almost 15-20 minutes for my food to come out. People were done with their meals before my food came out. They were very generous by taking my burger off of the bill, which I really did appreciate. Last but not least, the s'mores were absolutely incredible! I loved these so much. The graham cracker was homemade and the marshmallow was so good. Eventually I will come back for some more s'mores!"}
{"text":"Went here last night for a friends birthday with high expectations, as I had been wanting to come here since they opened. The restaurant itself is cute and really embraced the outdoorsy theme. But other than that, everything else was pretty disappointing...   I had called on Thursday to try and make a reservation for Saturday at 7 and was told they were booked on Saturday from 4-9pm. We came early around 630 and there was no wait and plenty of empty tables... so they could've taken a reservation or two?   Our server was either new or hard of hearing because we had to repeat ourselves several times and she forgot to bring things we had ordered.   The food was overpriced and average tasting. I ordered the Adirondack Pizza (essentially a pepperoni pizza) and added mushrooms and the taste was pretty bland and crust was so hard, I almost could not bite into the crust.  And this cost me $17  Drinks were okay, nothing memorable.   We could not even maneuver our way to the game area because there were a bunch of tables in the way, so not a great set-up.   And to end things, our server started boxing our food up without even asking if we were done and we felt like we were being rushed out of the restaurant...keep in mind that there was no one waiting for a table, so it's not like they needed it. And there were no Otter Pops! Don't list on your menu that customers get a free otter pop on your way out if you don't actually have them.   I think Camp Social could have been really awesome, because their theme is great and there's nothing like it in the Valley, but so many things would need to be improved. You won't see me here again."}
{"text":"Came here to watch the ASU v UofA game. Food was great but they refused to put the sound of the game on because they are not a \"sports bar\".  Mind you, they have flat screen TVs everywhere and 95% of the customers are here to watch the game, but for some reason they are too concerned about being a douchey hipster hang out to put the sound of the game on."}
{"text":"This was a fun and tasty experience. Kids eat free every day until Labor Day (up to two free kid's meals per table). The ribs were some of the best we've had and the chili dogs were fantastic. The dessert was amazing! Our server, Chris, was so friendly and always on top of taking care of our needs. Great experience all around."}
{"text":"What a cute place.  Brought people from out of town and they loved it.  Robert was such a great bartender.  Very friendlyand knew what to suggest to eat and it was so good."}
{"text":"Horrible place for kids with long waits. Food is average at best with host completely confused on wait times."}
{"text":"Brought our daughter and friends here tonight to celebrate the end of their 8th grade school year, going into high school and her 14th birthday. We were seated towards the front of the restaurant which had the sun blaring in and it was really  warm and just genuinely not a positive experience sitting there with the sun blaring in our faces so we did ask to be moved and moved to the very back of the restaurant where the ping pong tables were Jenga and some video games. The happy hour crew that had been sitting outside under the misters decided to make their way into the area where we were and began playing games and being so obnoxiously loud it ruined our dinner with the girls and the birthday celebration. We had such high hopes for this place and we were really looking forward to enjoying the s'mores for dessert but because of the rude drunk adults that could not show respect or consideration for the other patrons enjoying the back game room area, we chased down our waiter and could not get out of there fast enough. I literally walked out the door with the second half of my burger in my hand and ate it on the drive home that's how unpleasant our experience was. Overall the place was cute but for a salad,  burger, pizza place I found the menu items to be rather overpriced and our burgers were nothing to write home about certainly not for $15 and the salads were basic at best. I prefer The Culinary Dropout hands down over this place. Due to the fact our waiter came over and apologized to us no less than three times about the noise level and how rude the other patrons were being, I felt as though the manager should have at least come over and offered to move us to another table away from the obnoxious drunk people and comp our dessert but that didn't take place so I will never return here again and will definitely sway people away from coming to this establishment."}
{"text":"I really wanted to love this place but I'm not sure that I will go back.  Pros- Ambiance, outdoor patio, otter pop farewell, tire swings, game room  Cons- Not a single trashcan other than inside restroom or behind bar, couldn't order food at the bar, ordered the thermal drink but there is no need to have ice both in the shaker and inside the mason jars cause it makes it hard to pour, my smores martini was a let down...it didn't even set on fire, the marshmallow got sprayed with some absinthe and then they used a grill lighter to basically wave around it, it made my marshmallow gray and it was soggy once dropped into my drink.  Lastly the Happy Hour prices were what I would expect the regular prices to be, the pizza's were all still around 10.00 or more on happy hour and they are very small for the price."}
{"text":"What a fun concept! The staff was friendly, the food was delicious and I really enjoyed the atmosphere ! Highly recommend!"}
{"text":"What a fun place! Met a friend around 12:30p on a Saturday and it was a little busy but we got seated right away. Loved that the hostess stand is in a little trailer! We had the option of the tire swings at the bar but opted for a table instead (tire swings!- horizontally of course with a cushioned center, but looked fun). Our server Josh was really attentive, and the food was good--the fried pickle french fry poutine was full of cheddar cheese curd and elk gravy yumminess. The Yosemite pizza had fresh veggies on top and was enough for two with half a pie left to take home.  But the highlight of the meal was when Josh really made it like a camping experience by roasting a marshmallow on top of our ice cream sandwiches! I loved it!!! They are still working out the details of bringing S'mores to their menu, but I loved that Josh took the initiative to give us the next best thing (although they do have a delicious sounding S'mores drink, too). Seems like it would be a great place to go with a group- they have a video game, giant Jenga, giant Connect Four, ping pong... but also a fun place for smaller groups to meet up as well. Check it out, sounds like they have good things in store as well... like those S'mores! But in the meantime, don't forget to ask Josh for a roasted-marshmallow on your ice cream sandwich!"}
{"text":"Didnt like anything about this place EXECPT music     the food was horrible  fries were cold  Phoenix Rising Crispy spiced chicken breast, house spicy pickle, tomato, brioche bun.  was greasy  bun was  very hard and their lettus  was  terrible choice and wilted  this was my first time here and my last"}
{"text":"Service was poor (asked for water 3 times), food was average and overpriced, but the only real positive was the atmosphere.  Was looking forward to going here. It what a disappointment.  Bartender was more interested in talking with her friend that was sitting there to then helping. Hardly ever write a negative review but I got warned before going and thought no way.  Sad had potential."}
{"text":"I really wanted to love this place due to pictures/friends reviews... however, it was AWFUL.   Fist off, let me just say that I am a server so I understand when places are understaffed or the food comes out not to your liking.  First off we sat down at the bar because the wait was pretty long (expected that because it's a Friday night). When we got up there, the bartender seemed extremely frazzled.  I asked for the campfire drink and asked if it had gluten and responded no. Got the drink and it had graham cracker all over the rim! I have the celiac disease and they should know what gluten is!!!!  He seemed really annoyed that he had to make the drink in the first place but then I told him I couldn't have it and seemed extremely irritated.   Took our food order and the food was DISGUSTING! Especially for how much it costs. While we sat there, we heard three other people send back their food.   While we were eating nobody asked us how it was. There were three bartenders and nobody could keep track of who paid or ordered.   Closed out and they didn't even take my drink off!  Horrible and extremely disappointed"}
{"text":"Great staff, great vibe, lots of unique choices on the menu. Definitely plan on coming back."}
{"text":"This place is definitely lively which is great, but  delays service a bit. Overall, no complaints on the food.  The grand canyon pizza and the waldorf salad were both very good, and being able to make s'mores as a dessert was really cool."}
{"text":"We recently came here for my daughters birthday dinner. We had reservations for 6pm, our table was not ready until 6:30, what is the purpose of a reservation again? Our drinks took over 15 minutes to arrive at the table, then to top things off, I was served a raw salmon. When I finally tracked down a waiter he said it cold cooked.  I am a avid salmon eater and cook, I never heard of cold cooking salmon and serving it raw. I even searched the Internet for this mystery recipe, nothing came up."}
{"text":"I love the concept. The food choices are rather diverse. The staff is new but attentive. The management is on top of it. We had two dishes a chicken sandwich with blue cheese and pear and the Fish Fry.  The fish was some of the best I've had in a long time. The tartar sauce is amazing. The fries are good. There was plenty of food for the price it still seemed a bit expensive at $18. ( this is why the 4 stars not 5)  The chicken sandwich was brought to us still raw. Management took care of it and brought out another one. The flavors and ingredients all mix well together and is amazing.  Management took the chicken sandwich off the bill which we appreciated.  We did not order any alcoholic beverages but I saw someone pouring something out of a metal thermos which looked intriguing.  We will definitely go back again."}
{"text":"Camp Social was a fun experience. We enjoyed the atmosphere and the food. It might not be what some imagine it to be, but people are friendly and you can relax while eating very well prepared food and an attentive staff."}
{"text":"The food's simply not good.  The place looks cool and the menu sounds awesome, but what they deliver is basic, food service-grade gimmicky food that lacks flavor.  The pizza had the texture of a DiGiorno and was bland.  In a town with great pizza everywhere, they should be embarrassed.  The \"Korean\" wings seemed like Tyson frozen ones and the sauce lacked flavor as well.  The worst offense, Ore Ida frozen crinkle fries!  If you're charging these prices, you can't manage to make a great, homemade french fry?!  We should have left the second we saw those.  There must not be an actual chef involved in this place.  Just a real disappointment, especially given the prices.  Props to them for staffing the hell out of the place though.  Employees were everywhere, although a smile or two would have been welcomed, especially from the bartenders.  They should at least pretend like they're happy to be there.  In the end, bad chain restaurant food in a cool setting.  I don't think Phoenicians will fall for this once the newness wears off."}
{"text":"(Spongebob Squarepants - The Campfire Song Song)  Let's gather 'round at Camp Social, and sing our Camp Social song. At C-A-M-P-S-O-C-I-A-L-s-o-n-g song And if you think that I should Yelp it in a song than you're right on, but it'll  help if you just sing alooong  Bum, bum, buuum...  C-A-M-P-S-O-C-I-A-L-s-o-n-g song C-A-M-P-S-O-C-I-A-L-s-o-n-g song And if you think that I should Yelp it in a song than you're right on, but it'll  help if you just sing alooong C-A-M-P-S-O-C-I-A-L-s-o-n-g song   Camp Social is a popping place and apparently for birthday parties cause that's what was going on upon our arrival.    My friend and I sat at the bar where the tire swinging chairs was a cool draw and everyone wanted to sit and try it out.  We didn't get a chance but all is well.  The place itself seems very playful with a game room and a \"camper\" room where you literally sat in a camper.    For our food we ordered the Pretzels, The Camp Fire burger and topping it off with some s'mores.  The pretzel came with a beer cheese, which was much needed since the pretzel was not a pretzel bread which I'd expected to be.  Instead it tasted like bread in a pretzel shape and was very dry.  As for our burger it was cooked to the right temperature and the bun to patty ratio was spot on.  The burger was topped with mozzarella, bacon, Fresno chilies, and a peppered aioli; lettuce, pickles, and tomatoes on the side.  The burger didn't do much for me since I think the bun was a tad bit dry, the bacon was overcooked and if anything the Fresno chilies were the stars.  I did have to add my own ketchup to add moisture.  Finally, the s'mores came a blazing with a fire top as you cook your own marshmallows and create your own sandwich; which was totally fun.  It came with 5 servings and since there was only 2 of us; we decided to share with everyone at the bar; camp socially indeed we did!  In the end, Camp Social is a cool spot for some fun flares and drinks.  Though the food was okay I don't think I would come back to take a bite anytime soon. - Enjoy!"}
{"text":"Visited the establishment for the first time over the weekend.  The atmosphere was great and the food tasted like as if you cooked it over a campfire (picked up some charcoal flavoring in my burger).  For those of you wondering why you have to wait 10-15 minutes or more for a table and you see several tables empty, it's most likely those tables are reserved for those who used opentable.com :)  While the atmosphere, food and service was great this establishment charges extra for condiments (i.e. mayo), so you may want to ask before requesting them (for a $19 sandwich I think the establishment can afford to not charge you .50 cents for mayo.. If not then such extra charges should be stated on the menu or advised by wait staff prior to serving condiment items)."}
{"text":"Been going to Joe's for the last six months and have watched Camp Social build up and get opened.  Finally got there and it was great.  Very cool theme inside with a great comfortable patio even though it was a hot day.  Garrett our server was one of the most personable servers I have had in a long time.  Did everything he could to make our experience enjoyable.  Food was very good and fresh and the menu is unique.  Will definitely go back.  My better half says \"its now her favorite patio\" so its clearly made our normal rotation."}
{"text":"Wanted to try and new restaurant and needed hungover breakfast :) drove past Camp Social and popped in and was not disappointed. I had the pear Bellini which was amazing and got the breakfast pizza. My husband ordered the pulled pork scramble and both were delicious! He also got their Bloody Mary and it was impressive. The atmosphere was very cool and I would like to come back for an evening and try stuff on their other menu. All in all I think this place is pretty cool...plus it doesn't hurt that the owner is from my home away from home...Chicago."}
{"text":"Honestly,  I didn't  know what to expect, but this girl's lunch was amazing here and Crystal our waitress was absolutely  fantastic and so were the smores!!"}
{"text":"This place has the worst food in Phoenix you guys should be ashamed of yourselves for sending me that crap"}
{"text":"The place is cute and \"trendy\" . The food...not so much. The meat board ...For 22 bucks I thought it would be spactacular...NOOOT    very poor quality of  meats, 3 small pieces of bread. tinky tiny nasty tasting veggies..They added cheese...why? the whole point of getting this was  to avoid dairy products.. The brisket sandwich...very poor quality of beef and the fries were greazzzzy....so we tried the smores....if you are going to make your own marshmallows..at least give them some flavor. home made graham crackers?  way to thick...no flavor...sorry these items were a dud. I wrote to the restaurant and no one had the courtesy to bother answering or commenting.   Bad food..high price."}
{"text":"Unique and more ! So great when dining can be both a gastronomic adventure and fun too! We were fortunate enough to head to \"CAMP\" tonight .... casual twist to their signature cocktails and something on the menu for everyone! (Even you picky people) Sampled the mussels(with zip I might add) and pizza. Yes- the crust is a keeper...  I wish I could have tried the salads, burgers and definitely the dessert but was just too full this time. Next time for sure ! Highly recommend, oh almost forgot ! The staff - they act as if they truly WANT to be there . Great time and will be back!"}
{"text":"Loved the environment, the server was great. Didn't like either item I bought. I had the pulled pork, and Smokey mountain pizza. Both very bland. But I'll be back it was too fun not to try again"}
{"text":"I've been here four times since they've opened, twice for lunch and twice for happy hour. The inside looks cool. Decent tasting food, but very over priced. For some reason Coors is their only domestic beer on happy hour. They should sale that crap for $.99, but they have that over priced too."}
{"text":"Came back for that Kraken Kolada and the pork rinds before we went somewhere else for dinner. The rinds never came, asked about them & they went and got them, they tasted like they were sitting out waiting to be served for the 20 min we were waiting. Not hot and crispy, room temp and hard. Totally not worth coming back. The plus was the super sweet valet's. They were really nice with great attitudes. Tip: make sure you have cash to tip, the atm fee in Camp Social is $5."}
{"text":"I wanted to love this place.  We came here for my birthday on a Saturday night around 7. It wasn't crazy busy yet. We were a party of 8. One person got their food and then 10 minutes later, half of the table got their food and another 10-15 minutes later the rest of the food came out. The first plate that came out was now cold, because he wanted to wait for others to get their food. I ordered the burger well done. It came out rare to medium rare. I sent it back and when my new burger came out it was black on one side and half was still pink in the middle. I just ate the half that wasn't pink because I was starving and didn't want to send it back a second time. I usually don't send things back. We ordered the smores martini and the server was standing behind us saying how much she hated doing these drinks and scared she was to light the marshmallow with the torch. Not very professional. Especially when this is a signature cocktail. **sigh** We asked for seperate checks in the very beginning and was told that was no problem. When we got our checks, they were all messed up. The server was so flustered and was trying her best to figure it out, but it took her forever.  We will probably give it another try in a few months once they iron out all the kinks of being a new restaurant.  Our first impression was not as we had hoped. We left hungry and a bit disappointed."}
{"text":"Loved this spot....we were in town for Spring Training and was looking for a cool place to have a late dinner and drinks on a Friday night. It was perfect. The manager came over and greeted us and continued to check on us while we were there. I wish I had taken photos but I say it's a must if your in town."}
{"text":"We came for the first time as part of a woman's group who had booked a gathering here.  What a charming place!  First, we are campers so we totally appreciated the camping theme throughout the restaurant.  We loved the little table area tucked into a camper shell and plan to reserve that space soon for dinner with friends.    There were a couple of appetizers set out for the event, the Chickpea and the Short Stuff.  Both were great and the short ribs shined!  Tender, juicy, and the polenta was so creamy and yummy!  We also ordered some of the s'mores, which we weren't so enamored with, and only because of the way they choose to do the fire piece of the process.  It's in a little metal can and lit with rolled up paper so it doesn't really get hot enough to actually cook/melt the marshmallows.  But the marshmallows themselves were homemade and so good.  They are so different from the ones you purchase in the bag at the grocery store.  Also the graham crackers are homemade and again, the best! and nothing like the ones from the box.  They are a bit thicker and just the right amount of sweetness to balance out the chocolate and that fantastic marshmallow.    Drink wise, I ordered a virgin bloody Mary and it was really good.  A tad spicy but served with martini olives (which I actually went back up to bar for a few extra ones).  Overall a great experience and we will be back!"}
{"text":"Love this place! By far my favorite happy hour in the valley. I just moved here and don't know anyone. Bartenders and staff are very friendly and welcoming! Inside has very unique setup. Very wide variety of ages here. Seems like younger crowd uses it for a pregame before late nights."}
{"text":"Camp social was adorable!!! Such a cute concept. I love the RV booths and the tire swings. The drinks were delicious. Perfect place to take a tourist or someone visiting. Never been to a camping inspired bar before so it was great. I love the free Popsicles when you head out. The menu was way fancier than necessary for this type of place. I would like to see more burgers, hot dogs and easy and simple selections- the simpler the better for this atmosphere. Would be cute to add a postcards trading section! I think sipping drinks in those old school mugs and thermoses is great and would like to see all the drinks come in those types of cups. I generally eat salads but the ones listed were a little too fancy for me. The menu is awesome if you are a big foodie because there are a ton of different sauces and stuff you've probably never tried. The game section is awesome! I would definitely go there again for a beer and the popcorn appetizer but would never go there for dinner as all the food we ordered was pretty expensive and lacked any type of flavor. Cute spot for drinks, not food."}
{"text":"My coworkers and I came in the other night and had a great time at Camp Social. Such a fun environment, great service, and delicious food. I have to give Connor and Shelby a shoutout because they were awesome! So fun, friendly, and full of helpful hints (try the ranch here!)  My favorite drink was the fig mule. I'm definitely going to try to recreate these at home. The food was also outstanding.. you've got to try the pretzel with beer cheese! We ended up ordering two because they were just so good. The charcuterie board was also a highlight.  Definitely a fun place to try with out of towners or just friends with lots of cool talking points. Food and drinks also stand up!"}
{"text":"always my favorite super cute restaurant i'm very grateful to have it near me. always a go to!"}
{"text":"Camp Social Rocks!!! This is our first time here and Chris, our server, was so sweet and friendly and gave us wonderful service! The Brussels Crow was freaking delicious and the Fried Pickles was so good! The Adirondack Pizza was ridiculously delightful. Super fun and chill vibe. I love the tire swings!!"}
{"text":"Great concept, really good food and attentive staff.  Loved the \"stew\" app.  Don't pass it by.."}
{"text":"Service was horrible, which is sad because the restaurant is so cool looking. The food was good. I had a Saguaro Pizza, my husband had a burger, and my son had the pasta and meatball, all was great! I took my husband there for lunch to celebrate his 29th birthday and thought it would be fun. We'd never been there before and I wanted to surprise him. He was initially impressed since we got to sit in the camper. We were the 1st customers to arrive at 11:15. We didn't get our food until 12:00! Other customers arrived about 15 - 20 mins after us and they had gotten their food shortly after, while we were still waiting. At this time my 1 year old son started getting fussy, not sure why the pasta took so long! There was about 3 other tables, so it wasn't busy at all, plus everyone else had their food even though we had submitted our order way before them. The waitress never apologized nor mentioned why it took so long. She wasn't rude, she just wasn't attentive. I really wanted to try the s'mores but by the time we were finished it was my sons nap time and we were just in a bad mood. Even though the food was good, it did not compensate for the lack of service. :("}
{"text":"Amazing decor! Friendly staff and great conversations. Make sure you sit at the bar on the tire swings and look up at the stars on the ceiling.  Food options felt limited. I ordered a pasta which was good.  I'd probably only come back for the atmosphere and drinks though."}
{"text":"Holy cow. This place was INCREDIBLE.  1. BBQ chicken wings, so good and moist and the sauce was delicious. 2. Drinks, you HAVE to have the Fig Mule. It almost goes down tooooo easy.   3. Pizzas, I had the Saguaro and it was by far, the most delicious pizza I've ever had. So unique and so perfectly put together. I'm glad I have leftovers to eat in a bit!!! The Grand Canyon was also a great pizza if you're looking for something more normal.  I cannot wait to come back and have their s'mores and try some of their other foods. The aesthetic is awesome and is in every little detail of the restaurant. Such a cool vibe. Can't wait to go back!!"}
{"text":"JUST DONT.   Sat with 3 children 3 adults for 30 min. Received all alcoholic beverages order through the server and with kids still not receiving their sodas so we asked for a manager or the server and unfortunately they were both too busy to try to stop by the table so we left.   The poor hostess have to deal with unhappy people all day everyday due to lack of training in the service staff."}
{"text":"The s'mores are worth going for, but I wouldn't normally consider the food worth the price. I would go back, mostly for the atmosphere and the dessert! Also, we were not the greatest guests but our waiter was still very friendly and helpful! The whole restaurant was at such a comfortable temperature, and they opened the screen so it felt like we were eating outside during the sunset. Overall great night, and really, those s'mores are worth it!"}
{"text":"I'm somewhat of a pretzel aficionado, and I've gotta say their pretzel/cheese combo is exceptional. The pretzel is actually perfect and they give you soooo much cheese. Usually the cheese/pretzel ratio is way off, but here you actually get enough cheese for each bite!  Additionally all of the other food I've tried here is very good. I love the menu theme, and the atmosphere here. Came on a Wednesday and a Sunday and both experiences were fantastic.   The happy hour is great value.   The staff is amicable, knowledgable, and relatable!"}
{"text":"Great atmosphere, horrible bartenders. They have a bunch of children running the bar."}
{"text":"Atmosphere is clever and the family friendly game room was a hit for all ages. I was skeptical about the food based on reviews, but it was really good. We ordered several items and shared family style. Hobo stew was the table favorite as were the breakfast potatoes. Lamb scrumpets, mussels, burger, and pizza were also good. I would return, if only for the stew and s'mores."}
{"text":"I visited Camp Social just after it opened, and I did not leave with the best impression. My burger was undercooked, and the lamb was cold. I stayed away for a few months but came out again for a friend's birthday dinner a few days ago.   When I first walked in I admitted to the host that I was torn between getting a pasta, or a chicken sandwich. She recommended the Jimmi Pesto (pasta, almonds, and cherry tomatoes) She showed me what the dish looked like before I ordered it and I was sold. The food, and the service were LIGHTYEARS away from my first visit. Our server recommended the caprese board, and made great suggestions for drinks. My only critique was that the music was a touch loud at times. Other than that- I will be back to try out everything else on their menu"}
{"text":"Wow this place is expensive.  The food is merely ok.  We had the meatballs (for $9 you only get 3 and they are about the size of golf balls), a pizza (it was lacking flavor and the dough was odd - maybe undercooked?) and the brussels sprouts (they appeared overcooked - crispy on the outside - they tasted fairly good, although a little charred - not sure if that's on purpose)  They ran out of the ingredients for their \"signature drink of the day\" and we saw a waitress outside that was being sent off to buy beer because they ran out of that too.    The staff seemed a little incompetent (the waiter didn't even know what a flight of beer was) but they were very nice.  They REALLY need to get a sun shade for the huge window wall.  If you are facing it, or turn to talk to someone in the direction of it, you'll go blind from the sun.  The camping theme is a nice concept, but this place is too Scottsdale-y to pull it off.  Nothing seemed authentically outdoorsy.  We were hoping for a more rustic feel.  Overall, there are MUCH better choices out there. Nothing was impressive enough for us to want to return.  Did I mention how EXPENSIVE this place is?"}
{"text":"I'm puzzled by the reviews saying the food is bad - because when I was there, everything was amazing! We ordered a bunch of appetizers ranging from the stew to the chicken wings, and everything was tasty. The Happy Hour prices could be a little better, but I thought the value was there. Our hostess was constantly checking on us and our drinks were always filled. The parking is kind of annoying (valet only during busier times), which is the one drawback."}
{"text":"What is camp social? One might think it's an indoor kids camp or a trampoline company. We wondered too so we had to check it out. It's a restaurant mostly geared to adults with a large bar in the middle. There is outdoor seating and some cute campers on the inside. The restroom feels like a summer camp bathroom but a lot cleaner. There is a small game room in the back with a ping pong table and couch and tv. I would love them to have the movie Meatballs on the many tv screens but for the sports fan it works. Baskets on table with squeeze bottles like when you are at a picnic. Food was good but not impressive. I enjoyed my breakfast pizza which is great for two but too big for one. Had the leftovers the next day! Hubby liked his pork sandwich but said average in taste.  Still worth a visit to try for yourself and they even have weekend breakfast."}
{"text":"Dude! They have tire swings at the bar (yes, real life tire swings)! However, other than that, I wasn't very impressed with Camp Social. While the pseudo outdoor area is roomy, the inside seating area is cramped. Our waitress was polite and friendly, and our food came out quickly. I had the Campfire burger and while it was tasty, it was over priced."}
{"text":"I read the reviews before going but still wanted to give this place a shot. The atmosphere is cool and unique and I think the place has potential. However, my visit wasn't anything to write home about. We made it for happy hour, thankfully, so we didn't spend a ton. We ordered the s'mores martini and a Bloody Mary. The Bloody Mary was average and the s'mores was delicious but $12. Food was NOT good. They need to just take the meatballs and boneless chicken off their appetizer menu. Both were not good.. at all. The pizza we ordered was pretty good. If I was forced to go back I would probably order that to play it safe. I had a group of 4 of us and we tried all the desserts on the menu (bread pudding, icecream cake, s'mores, and the chocolate cake). Save your money. The only one I would even SLIGHTLY recommend is the s'mores (because it's fun and it comes with a flame to cook them yourself). The marshmallows are way too big and although it was decent it was a major mess. I think Camp Social needs to really redo their menu or else I can't see people coming back."}
{"text":"This place is relatively new. The atmosphere is amazing. I love the camping theme and the menu fits it perfectly! Our server was really sweet and she made the experience better."}
{"text":"Friendly employees, good food and live music! Had a wonderful Sunday Lunch with my girlfriend here & it met our expectations. We had the Phoenix Rising and Dads Burger & both were delicious! Definitely bringing my friends here next time I come, they had a ping pong table, a few extra games in a game space and cozy outdoor seating OR tire swings AT THE BAR. Awesome place!"}
{"text":"Such an upbeat, fun atmosphere! The staff are so welcoming; felt like family. After an awesome brunch, we roasted marshmallows to make smores at the bar; delicious! Love the camping theme; brought back great memories. Thank you."}
{"text":"Beautiful new atmosphere! Sure as with any NEW restaurant there is a time in which the kinks are being worked out! Ordered a pizza and salad. The pizza was a tad on the salty side, spicy pizza. The salad, a berry salad, was decent. I would totally come again, and rotate through the menu and see what else there is. Perfect adult play pretend camp site!"}
{"text":"This new spot is a must try! Great food!! The atmosphere is great, and the Camping theme is spot on!! Staff were really friendly and attentive. The tire swings are so fun!"}
{"text":"Fun atmosphere, great cocktails, and yummy appetizers. Its a bit pricy, so make sure you hit happy hour! Otherwise its a $10 per drink place. I had the jumping juniper (gin, elderflower, basil, kiwi & mint) which was surprisingly delicious because I'm not usually a gin fan. The game room is small and gets crowded quickly. There are tire swing seats at the bar, but only 4 of them. The place next door has a meat smoker so you get the smell of campfire which is kind of cool as you sitting there surrounded by a campy theme."}
{"text":"DO NOT COME HERE. Not only is the food overpriced and low quality, the customer service is far below expected for the name \"Camp SOCIAL\". I personally know former employees, who have first hand experienced checks bouncing and a lack of respect and consideration towards them. I have heard many stories and accusations that simply cannot be made up. There are many other local, \"foodie\", and well run businesses that deserve your time and money more than this poor establishment"}
{"text":"We made reservations for Fathers Day for a late lunch.  Service at the bar was awesome.  The kids loved the tire swing seats at the bar.  Ambience was cute.  Food overall was good.  By the time we had lunch, they were out of pasta and fried pickles.  It took 45 mins from the time we were seated to get our appetizers despite not being super busy at 2 PM.  We would probably come back, but the wait time to eat was ridiculous."}
{"text":"1st time here and the place is really great. We had the pretzel and pizza and the s'mores for desert. Food was good and Jon was awesome. Will definitely be going back!"}
{"text":"The prices were a little steep, but way worth it for such a fun and creative atmosphere! The food was awesome! Would love for this place to donate a dollar to the national parks for every \"National Park\"  pizza they sell!"}
{"text":"On point service. I spent 15 years in the restaurant industry and Andrew exceeded expectations and was able to get a smile out of me by jesterly calling me a weirdo for requesting Ginger Beer on the Rocks. You've gotta try the s'mores!! But need just a bit more fire!!"}
{"text":"I imagine most people are like me: they use Yelp daily for years, but never bother to get an account or post reviews; that is, until they enjoy a restaurant so much that they feel compelled to participate.  For me, that restaurant was Camp Social.  I hope you enjoy my first review.  As a North Central Phoenix resident, I have enjoyed the influx of numerous fantastic restaurants and bars over the past few years.  IMO, Camp Social is the culmination of the foodie movement in NCP and is among the best the area has to offer.  Given that the place has been open only a week, I expected kinks.  There were none--the service and the experience were fantastic--so they must have already ironed out any initial issues.  First, the atmosphere: tire swings at the bar, tables made out of campers, plenty of TVs for sports, air-conditioned patio, and a separate rec room with ping pong, shuffle puck, monster jenga, etc.  A bit of everything for everyone, which is probably the point.  The adults loved it, the kids loved it.  Second, the drinks: I'm the type to work my way through the custom cocktails.  I didn't try the signature s'mores cocktail.  The four I did try--fig mule, arizona summer, firefly, and kraken kolada--were all excellent, but the last one merits further discussion.  If you enjoy non-creamy pina coladas, the kraken kolada is nirvana, the pinnacle.  The first taste and you know you've come upon something special.  In future visits, I will struggle to sample the other drinks on the menu while the kraken kolada is calling me like a siren.  Third, the food:  I would describe the menu as an eclectic gastropub with an underlying camping theme.  Everything we ordered was delicious and cooked perfectly.  The hobo stew is both unique and spectacular; the balance of flavors was perfect.  The brussels sprouts were the best I've had anywhere.  When eating brussels sprouts, I always hunt for and savor the ones that have the most char.  The chef must share my palate in this regard, because every millimeter of every brussels sprout was utterly charred--genius.  The biscuits were very tasty; not the light and fluffy variety, rather, very dense and savory.  I had no intention of eating the accompanying gravy, until I tried it, and then I couldn't stop.  Camp Social is a welcome addition to the NCP food scene.  Unless you plan on just hitting the bar, I recommend making a reservation because the place is booming."}
{"text":"I came here with a group of friends on a Friday night. This place is so cute! I love the camping theme. The atmosphere is on point. I had the hummus it was delicious. The bartenders are so friendly and attentive. I will definitely come back!"}
{"text":"went late midweek so not packed it was just me & my date but after I mentioned about them having a camper booth the hostess sat us there which was pretty cool cute cute booth the service was great but the food just ok we got the drink to share that came in a thermos nothing wow also the gator pizza was very lack luster Did taste the fish which was oddly good it had grapes randomly"}
{"text":"Bartenders were rude. Got there at 6:05, and asked about happy hour. Was happy to see that they had happy hour until 6:15 during the week. They responded with, \"oh, we don't do that anymore.\" And I replied, \"but it says it right here on the menu?\" Again, as they rudely replied, sorry we don't do that anymore. I've never been to a place that didn't honor a price that they advertised. That really rubbed me the wrong way. We would've left had we not been there for a work party."}
{"text":"Everything can be described simply as, OK. The server had knowledge of the menu, but was never present and seemed to take extended periods of time to bring drinks despite a moderately slow restaurant. He also missed requests for alterations in our meal after acknowledging they were heard.  Had the brussel sprouts, wings, and carne asada fries. They were all pretty bland. The Brussels were very oily and soaked with the vinegarrette, the fries were just fries with a pile of meat on one side and a pile of guac on the other and without that, bone dry. The wings were the worst with sauce that we all agreed tasted close to tomato bisque and had no seasoning otherwise, leaving them tasting like just plain meat.  Great happy hour for drinks which explains why everyone else there was only drinking."}
{"text":"This place is hip, and fun. Good food, bar kind of food, but what's exciting is that they have options for low carb diets (my friend got the tilapia fish) and vegetarian options (my other friend got the roasted beer salad). There was a DJ, so it was loud a bit.   I ordered the burger, it was tasty, bun was a tad small, it was made as I ordered it. Very traditional nothing out of the ordinary, the only disappointment there was the lettuce, they used iceberg lettuce, I would have loved it if it was romaine. Regardless, it was a good burger.   I also ordered the cauliflower gratin,  that was a disappointment, the cheese was not meant to make gratin dishes with it. It was very oily and lumped up.   For my drink, I ordered the Kraken Colada, that drink was delicious, I definitely recommend it.   The server was nice, she did check on us a couple of times and the buss staff made sure our waters were filled up. I liked them :)  Would give this place another try, may be on a ween day so the DJ is not there."}
{"text":"So I drive by this place everyday and finally got to try it. It is super cool Inside ,  nice outdoor seating , and nicely decorated .  However the service could be better. My friend and I ordered a salad and it took about 35 minutes to get it. It was very good but way too overpriced. $12 for salad and $5 extra for chicken for $17 is a bit to Much for me.  I think the servers need to engage more in the customers. Don't plan on going back unless for happy hour."}
{"text":"Camp social is a great atmosphere come for drinks at the bar, Tooley is the best bartender!"}
{"text":"This restaurant made my day! Great fun, cool vibes, excellent food. Service was great and Marko is the best server ever!"}
{"text":"Great atmosphere, good food. Andrew our server was amazing. Fun place to go to hang out with friends."}
{"text":"Concept and theme are great. Fun environment with great friendly staff. We were there on a Monday afternoon passed Happy hour and service was slow. Again staff nice but took about 15 minutes to even get attention to place our drink orders. Food also took a while to come out. Once food was out we were so disappointed. Avocado salad had black/brown avocado. My friend did not like the spicy pork notified the waiter and ordered a salad instead. Was really looking forward to trying this place but will definitely will eat before we go again."}
{"text":"Don't go to the bar. It's employed by a half dozen 20yr olds who are on their cell phones.  I can't believe the owner would allow this. I would send all of them home to their mommies home."}
{"text":"This place has a really cool concept and some pretty good food to back it up. Beer selection is on point! My favorite time to go is during brunch, but have been there for dinner and lunch as well. Have tried the burgers, wings and pizzas and they do not disappoint. Sometimes the service can be a little spotty and the hostess station has made us wait for a seat when the restaurant did not appear to be that busy. Another little gripe is having to valet your vehicle, which seems to be common in the area even when there is plenty of parking. I understand the concept of it, especially during busier times but a few times we have been there it seems totally unnecessary."}
{"text":"LOVED THIS PLACE. Upscale indoor campground? How can you miss? Brunch menu is quite unique. Beer is cold. Fast service from friendly bartenders. Sat with a staff member at the bar and t hey went through the menu and helped us pick something good (see pics). We will definitely be back, I want to work on that menu some more. Interesting overall experience. Prices are reflective of the area, is all I will say. See my Taco Bell review if this place is too pricey."}
{"text":"This place was awesome. Me and my boyfriend went on a Saturday late afternoon. The interior is super cute and camping inspired, obviously. Our server was one of the best servers I've ever had. Shout out to Jason! Very attentive, informative, and super friendly. We ordered the hobo stew which was delicious and unique. I'm not a big salt person (a pick salt off my pretzels) so it did get a little too salty for me, but my boyfriend loved it. We split their ravioli entree and holy guacamole! It was so flippin' good! Just writing about it is making me crave it. For dessert, we had the bread pudding which was awesome!  We also had some beers and cocktails. Awesome experience!"}
{"text":"This place is not standing up to it's potential. Our service was bad, the food is mediocre and it doesn't seem very \"camp like\" being set in a warehouse type building."}
{"text":"The theme is so cute and flows throughout the restaurant! From the hostess through checkout, everything was intimate. Our server was Andrew and he had an amazing personality and conversation. He made the experience so fun."}
{"text":"Either they don't care about their food or they don't read Yelp. Seriously. All of the mentions about the food being \"not so great\" are spot on. My fries were cold, the chicken super greasy (and not in a good way) and my soft pretzel was made of soft/fluffy bread. Everything I had pretty much sucked.  Plus the staff seemed to be about the age of kids actually going to camp and there were flies inside the place. So I guess they nailed the whole \"camping\" theme, but not in a good way."}
{"text":"Camp social is a hot spot! Be sure to make reservations. They have unique menu items. This place is very trendy and gives a camping vibe. The service was great and friendly! The have valet parking and a great patio."}
{"text":"Camp Social is such an adorable restaurant!  We were there on the first Friday they open so they weren't taking reservations.  We sat at the bar for about 45 minutes and enjoyed a few delicious drinks before heading to our table. Service was quick and the burgers and crinkle fries we had were so amazing!  There wasn't a crumb left on our plate. I am so happy Camp Social came to Phx.  Oh and don't forget to sit in the tire swing while you're having a drink at the bar."}
{"text":"Cool, vibe, family and date night friendly. Went for HH cool tasty cocktails. Food was really good. No complaints. The staff was very friendly and cute lol. I'll def be back"}
{"text":"Love, love, love the theme! It's definitely unique and super fun, down to even the little details.  The menu is unique too! We had the Acadia pizza (pesto and lobster on gluten free crust) and my fiancé had the brisket and kimchee sandwich. Both were amazing.  The drink menu is equally unique, I opted for the firefly, which was a green-chili vodka, ginger, and blueberry. It was different, but good.  The price is high, even for this neighborhood and the portions were fairly small. Also, our sever disappeared for 20 minutes and we had to have someone else go find him, which delayed our friends from ordering with us."}
{"text":"This place has potential. But it needs new pizza crust, and better food in general. The pizza crust is really awful though. Also, please add mountain (aka pudgy) pies to the dessert menu. With mediocre food & no real entertainment, this place sadly has nothing to bring us back (yet)."}
{"text":"Tried this place out early on a Sunday. I called ahead of time to put our name down and we were seated right away when we arrived. The patio was well shaded and cooled, great atmosphere and all the staff were friendly and helpful. We enjoyed their cocktails and beer... but the food needs some help. I'm not sure what type of oil they use to fry, but no one liked the flavor of the fries -something was off about them. I ordered my child the Mac and cheese off the kids menu and although it was house made, there was zero flavor. Seemed like they made a roux and forgot to add the cheese. It was strange, sticky and flavorless. They didn't charge us for it, thankfully. We shared the s'mores burger, it was tasty but a bit over cooked.  Cute concept, great service, poor food, probably won't visit again. I think they're a bit over priced compared to similar restaurants."}
{"text":"Wow this stop is different and so unique. They have definitely captured a \"place\" and succeeded a \"place-making\". If you are with your significant other, and the swings are available, grab one. There are a pair of tire swings in each end of the bar. The Poutine (duck stew?) with biscuits is good as well as the Adirondack. My wife loves fried pickles but was not doing cartwheels over theirs. As for drinks, they do not brew their own beers but have a decent variety in tap and in bottles. I saw a few couples enjoying a drink that was shared and came in a thermos. \"The Lazy Sunday\". How cool!  Its close. I will return from time to time."}
{"text":"Well Done Guys!!!! Great first time experience and we will definitely be back. Get the meatballs... They are fantastic! Service was great and the atmosphere is awesome. Brisket sandwich was great as well.   Enjoy and cheers!"}
{"text":"I've been wanting to try Camp Social for a while.  I love the concept and the atmosphere but disappointed with the food.  Although not expecting white table cloth quality, it really was just ok.  The appetizers were actually better than the entrees.  Brussel sprouts was very tasty and the spin on the caprice was really good.  Half roasted tomatoes with Bufala mozz.  The pretzel was just another pretzel, nothing special.  The real disappointment were the pizzas. We had one sausage and one margarita style.  Didn't like the sausage at all and the sauce was very bland.  The burger was not good at all. We did like the salad.    Great atmosphere and I'm sure a fun place for happy hour but won't be going back for the food."}
{"text":"I've been meaning to come here for quite some time and was so happy I finally made it out tonight! Came here to hang out for some after dinner drinks and was thoroughly impressed with the interior design. Walking in, there is an inviting feeling with the colors and open feel.   We were greeted when we walked in, but off the bat there were some hiccups in regards to the service. We were going to be sat and were following the hostess but then the tables were all not clean. A different member of the staff then came to help clean the tables. Everyone was very nice, but the restaurant was not busy and there seemed to be a good amount of staff.  We were sitting for a little bit and ordered some drinks and they were brought in a reasonable amount of time. Then we ordered s'mores and DANG they were so good. The marshmallows are their own and they come on a stick already with a mini fire to roast on your table. They were so good, definitely better than an average s'more.   Another employee came by and asked us how we wanted the check split and we told him. He never came back. About 15 minutes went by before our server came by and dropped the check. We were ready to go at that point so we didn't bother correcting the miscommunication so we paid and left.  This place definitely has the inner workings and potential to be an amazing restaurant. The design and concept are truly unique and done so well. There are a few good aspects in regards to the food, but still missing the mark when it comes to the service."}
{"text":"I love Camp Social! I have only been once but it was such a fun and cool experience I cannot help but give it a great rating. They have a pretty wide range of food including alligator sausage...it was delicious. They also have amazing cocktails. I had their fig mule and it was not overpowering at all. It was made just right. The bartender Josh H is awesome. He showed me great service and took care of every need I had. If you have not been to Camp Social, get over there and try it. They have canoes hanging from the ceiling. Beat that."}
{"text":"I agree with others...great concept, ambiance and decor. Very, very average food. Our server was extremely inexperienced, which did not help either. The brisket sandwich and chicken sandwich were over-the-top boring. Chicken was tough. The substituted Mozzarella (for feta) must have been in short supply because there was no more than one small dollop. The fries were described as \"amazing\" but they were certainly not. I have had better fries and any number of large chains. So, bottom line is that Camp Social needs to step it up or the reputation for serving \"average\" will follow them forward. No one wants \"average\"."}
{"text":"Went once with my boyfriend. I got the ravioli, it was cold, they re-fired it and took it off the bill. Open, wide space, and fun environment."}
{"text":"Finally stopped in for a late lunch at this new place in our neighborhood. First, we noticed how well done the camping theme is done...comfortable and charming. Two vintage-style trailers tricked out, one as the hostess station, one as a big banquette. Tire-swing seats at the bar, ice chests as cocktail tables on the patio, wooden canoe light fixture...fun! We like to sit at a bar to drink and we really liked this big U-shaped bar. The bartender, Josh, came right over, leaned in with friendly eye contact and talked to us about the drink offerings and the menu. The food options are interesting and well-priced. We both ordered burgers. I'm a big fan of a good burger and this was among the best I've had in some time. My partner agreed. Nice soft, fresh bun and juicy, beefy meat with great flavor. AND great fries! Very nice portion. A great place to take a seat in, great service and good food! We'll be back!"}
{"text":"This a drinking place. The apps are \"b\" level and the entrees are \"c\" level.  The pizza is \"d\" level. We made reservations for 14 people a week in advance. Their reservation system is....they don't have a reservation system.  The manager explained to us that large groups of 12-14 people think they can come in without a reservation and it messes up the people with actual reservations.  He basically just told us that he is going to give a big table away to people without reservations regardless of anticipated reservations, essentially making the entire reservation system pointless. Don't order the pizza.  The dough is almost \"e-z bake oven\" quality and toppings slide right off.  Don't waste your money.   The place is always left dirty.  Tables sitting with dirty plates and trash for hours after the customer has left.   There are 2-3 older men wearing Camp Social shirts. They appear to be the owners.  Half the time they stand around.  The other half of the time they just seem to walk around unwilling to jump in the trenches to improve customer service. Bottom line, this restaurant/drinking hole needs to make some big changes.  The food doesn't match up to the quality demand of 7th street.  This restaurant is trying to survive off of a somewhat hokey theme with \"meh\" food. The Yard remains the king of 7th street."}
{"text":"I love the food & the atmosphere.  However if it weren't for one attentive bartender, I don't think we would have returned.  The Bartenders are more concerned with getting a credit card to start a tab than they are to get your drink! We were disappointed at the Bar service until Jake the bartender arrived and saved the day! He was funny & attentive but most importantly we did not have to to hunt him down when our drinks were empty!  We have been back a few times & luckily Jake was bartending those days and took care of us as well!"}
{"text":"Our family of 20+ came for Easter and had an amazing time! Our waiter was (I think) Jason and he took care of all of us and did awesome (which is hard with our family). We're definitely coming again. Such a fun place and cool vibes to have food and drinks."}
{"text":"NomNomz: 3/5 Cocktails: 5/5 Service: 3/5 Ambiance: fun & casual, rustic, nostalgic camp-vibe!  A summer camp bar/restaurant for adults?! SIGN ME UP. As soon as I got an invite from a friend and heard the term \"camp\" I immediately checked out the website/menu then proceeded to get lost with nostalgic memories of childhood summers away at camp. And s'mores martini? I'm in love.  First stop - libations!  One glance at the menu, and you'll want to try everything. I had my heart set on their famous s'mores martini, and boy was it a treat. We went for happy hour on a Friday, and swooped on the half-off (score!) and paid $6 (regular price $12). The \"S'more Lovin\" is impressive, ladies & gents. It comes out looking absolutely mouth watering, but then they fire up mini torch and toast up the giant marshmallow on top. I'm not a huge sweet fan, but this was totally worth it. I later switched it up and tried the \"Firelfy\" ($11) infused with green chili vodka, ginger, lime, & blueberry. It was totally refreshing, and the combo of ginger and chili definitely had my taste buds singing.  Nomz: The entire menu looks good and everyone's plates looked delish - You'll want to try all of their fun camp-themed menu items. I indulged with the \"Camp Fire Burger\" ($14) since I tend to gravitate to anything that's spicy (burger lover, too). A little pricey for a more casual bar, but it was great. Their menu has just about everything, and I've heard their pizzas are the most popular. Za's range from $12-$17 and all have unique combos. Their sandwich/burger section is on point ($10-$15), a few yummy looking salads ($12-$14), entree selections ($18-$24) and some yummy looking apps ($8-$23). My friend ordered the \"Lil Cabin Fever\" ($12) with house-made pork & beef meatballs with creamy polenta, DAMN that was good. We also tried the \"Brussels Crow\" ($11 app) and it's lemon vinaigrette complimented the dish perfectly. My recco is to order a bunch of items and split family style, there's too many fun/good options! Enjoy.  Dessert: You don't want to miss out on this here. They've got some sweet selections, but you really have to try their \"Let's Get Toasted\" ($12) where you actually get to roast your own mallows over a small open fire at your table. SO FUN!  Overall experience: So fun! From the giant wooden bear that greets you at the front entrance, to the tire-swings up at bar (bar is in the shape of a wooden cabin might I add)... this place is awesome! The whole place is camp-themed, and it's perfect for a happy hour out with friends or coworkers, or even family dinner! Oh, and the s'mores at the end over an open fire. It doesn't get much better than that. It's cozy, clean, and an overall really fun experience. Highly recommended.   Happy Hour: Sunday-Friday 3-6pm. They have $3 Modelo and Coors Light drafts, $4 well cocktails, $5 select house wines, and 1/2 cocktail of the day. They'll even give you a 15 minute grace period if work is keeping you too long. Enjoy!"}
{"text":"So, everything here was amazing!!! The hostess was gorgeous, friendly and laughed at all my jokes. The server was knowledgeable and provided a perfect beer recommendation... however the absolutely best thing about this place is their homemade COCKTAIL sauce!!! This place has the best cocktail sauce I have ever tasted!!!"}
{"text":"The atmosphere is 10/10! But the food is mediocre, unfortunately.  Except for the s'mores which are made with homemade graham crackers and homemade marshmallows!"}
{"text":"My brother brought me for a birthday lunch.  A small fortune was spent building out this kitschy structure and, admittedly, it was done very well.  You can sit at the bar on a tire swing or grab drinks from a small travel trailer situated front and center in the restaurant, ponder canoes hanging upside down from the rafters or watch the game on any of the many HDTVs situated throughout the \"campground\".  Where they fall down is on the food. We ordered buffalo wings for an appetizer- they were fatty and soft, drowning in some kind of sweet and sour \"Korean sauce\".  Our server highly recommended the ribeye sandwich which is served with blue cheese crumbles, arugula and sautéed onions, so we both ordered it.  It looked good and tasted fine until the third bite which rendered a mouthful of greasy fat.  I opened it up and realized it was a full 12 oz ribeye on a roll, MASSIVE layers of lard and all.  I understand that ribeye steaks are fatty - that's what makes them tasty.  However, if I'm eating one as a steak, I trim the big fat off.  Otherwise a forkful of it is just gross.  It's no different in a sandwich, and was thus surprised that more effort wasn't made on this $19 meal.  See photo for visceral details.  They did redeem themselves with an interesting s'more desert, complete with homemade marshmallows and graham crackers, served with a small personal campfire to roast them over."}
{"text":"Fun, urban camping-themed restaurant /bar with a lively, hip and fun vibe that just opened a month and a half ago in North-Central Phoenix .  Fun decor, very unique.  Met friends here for happy hour for the first time tonight, we tried at least half of the 'camp bites' appetizers and they were delicious. Very interesting and different menu. Happy hour $4 premium well drinks, I was loving the rum they use, and our friends enjoyed the $4 martinis and $3 draft pacificos.  Our server was a blast and took wonderful care of us, very attentive and fun.  Great new place!"}
{"text":"Ok-- I have loved this bar since it opened. Hence I'm still giving 4 stars and taking 1 off for this 1 rude encounter.  I have brought my friends, my coworkers and recommended it to anyone I know in the area. Because I was planning it, we even held our company holiday party here on the patio last December.  My friends and I are here at least two times MINIMUM every week. I live down the street and work with many people in the area.  Today, when we arrived, our sever let us know the fig mule cocktail was the happy hour special of the day.  A little while later he came by to inform us the manager on duty had decided she didn't want that to be the HH drink of the day anymore. Which was awkward as he admitted, since he had other tables open with that as their drink special they had ordered as well.  I personally did not even order the drink. But if you have already served that as the hh special it seems the right thing to do to keep it for the rest of time only on that specific tab for that price. Until all of 6:15pm!! Don't get me started on that.....lol. Jeez.  My friend asked to speak to the manager. The manager, who's name was \"Tanya\" or something similar (because she certainly didn't introduce herself) came over and discussed the situation w/my friend. I stated the obvious of why it should remain the same special price for just those tables who had started already, and she conceded. The 2 minutes she was at the table was literally the rudest, most uncomfortable I have ever felt in Camp Social. It was so unnecessary, and I got the feeling she recognized us and felt we just thought we deserved special treatment. Who knows?  For the record, even being regulars and after getting to know the staff, we never get \"special treatment\" on prices etc. maybe once I can think of by someone who is no longer a server. So this review is not about whining we didn't get some \"special treatment\" discount.  No; there is a right and wrong in the situation. You don't change the price mid tab on a drink. And frankly- yes. The business doesn't need to lose quality frequent guests like us.  The main reason we visit Camp Social, is for the staff we love to see and joke with. Managers Tom and Tim are amazing- Bartenders Robert, Paul, Alex, Mackenzie, the servers Anna, Jason, Bryan and the best hostess ever, Morgan make us smile and feel like home.  For one super snotty encounter to make us rethink ever visiting all those people again is just sad in my opinion. And then I heard she was the GM?? Interesting......  I worked in the restaurant industry for years. Maybe things have changed in the last 10 yrs, but that's not how you treat your customers.  This was such a nothing issue in my opinion to let those that had ordered already keep that price til hh ended..... so for her to be so, excuse my language, Bi*chy about it - was ridiculous.  Obviously it fired me up enough to write this review; and I certainly hope the right people see it. As you can see on my profile I've lived in major cities and don't just write scathing reviews, nor am I some snobby restaurant reviewer.  Honestly I'd like to see Camp Social do well and succeed in uptown - but with people like that in charge it could be challenging. Especially with better HH and weekend specials at friendly establishments surrounding them.   ?disappointing situation for no reason --that's all!  Why can't people just be nice?....Seriously."}
{"text":"Last night myself my friend and his daughter came in and we decided to sit at the bar because the place was pretty packed. We got our first round just a fine but after that we couldn't flag a bartender down at all! Which was weird because there were about 5 people behind the bar and not one of the them would stop and ask if we needed anything - which we did! We finally said enough was enough and moved to the high tops at this point we were pretty angry and just wanted to get out of there. And then we met our waitress, Sia! All of her tables were full yet every time she came by she took the time to have a chat with us and really make our experience an enjoyable one. We went from wanting to leave asap to wanting to stay and hang out longer which we did!"}
{"text":"Man, it's been awhile since I've had a 1 star review but this place is a super big let down. Tab was $200 for a bottle of wine, a few beers, the charcuterie and 3 entrees which at a a decent restaurant is right on par.   The food was really bad. The ravioli was incredibly bland and was a really small portion. The steak was fatty and overpriced with two mounds of butter on top.    The servers wear tshirts and khakis which definitely fits in with the vibe of the \"Camp\" restaurant idea but the price point and the theme just don't add up. I know Phoenix is opening a ton of new restaurants but a little more thought and analysis needs to go in to the concept and the value to the customer.   End of the day this place would be cool for a beer and that's about it."}
{"text":"I would just like to say our server Daphne was fantastic. She made us feel very welcome and had a great energy. She recommended the Korean style wings and they were delicious! Thanks to her and Irene, we had a wonderful evening. On top of that, the atmosphere of the whole place was great. I would definitely recommend stopping in."}
{"text":"I've given Camp Social about 7 chances now. The one time I had no complaints was for brunch. However I've been Disappointed every time, overpriced food & drinks. Inferior quality/taste of food...inattentive and misinformed wait staff. I was at one point contacted via email by the manager to make things right since my last visit was subpar and then never heard a word since our email correspondence giving her my contact info. Unfortunately I won't be going back. Cool atmosphere but that's where it ends for me."}
{"text":"The food is great. The hobo stew is amazing!!!! Love the drink served in grandpa's thermos. Hope to see more camping related tv stuff in the future."}
{"text":"I really really wanted to like this place. The theme is cool, they offer otter-pops, and you can roast marshmallows for s'mores!   Our wait was over an hour (it was Friday night so no worries there.) During our wait we went to the bar where we didn't talk to a bartender for over 15 minutes. Come on man.   Once we got sat, the server got to us pretty quickly. I ordered pork rinds and a pretzel for an appetizer. Some friends ordered the wings. The pretzel was ok, but the pork rinds were super stale. My friends wings were pretty cold. Wanted to let the server know, but I think he knew that a storm was brewing and avoided us for a another good ten minutes.    When it came time to order the entrees, I wanted the pizza with the alligator sausage.   The server said they were out of the sausage. I asked to substitute Italian sausage and the server said the chef wouldn't do that.   Overall the drinks were good, food not great and the service was pretty bad. They would have gotten two stars but being out of otter pops was the last straw. ONE STAR!"}
{"text":"After reading a lot of negative reviews about the food, I played it safe and got the pretzel and a burger. The pretzel/cheese was awesome! The burger was pretty good. The staff was extremely friendly and prompt. The decor is excellent. Will be back!"}
{"text":"I've been to this place three times now. I wanted to give it a chance because the theme is so cool but it fails to meet high expectations. The biggest thing that turned me off of this place was when one of the bartenders pretty much scammed us out of happy hour. We ordered a few vodka sodas during happy hour (which would've been about $4 each) and the bartender Allysa asked if Titos was okay. I assumed that was the well vodka (well vodka is relative to each place-Titos is considered well at the Vig and other restaurants) but later when another bartender asked to refill our drinks and wanted to make sure three olives was okay we realized we'd been charged $9 a drink for tito's versus the $4 happy hour three olives. This communication issue really pissed me off. She knew we were there for happy hour and if she had been upfront with the price of the Tito's we would have gladly taken three olives...   Another thing here is their food. So far we've tried the pretzel with cheese, the Walleye sandwich, the Acadia, mount rainier, and great smoky mountain pizza. The pretzel itself was good and fluffy but the cheese was super watery. The Acadia with lobster on it had about 1/10 of an ounce of lobster on each slice. It was a huge disappointment for something that cost almost $20. The other pizzas were nothing special and definitely overpriced. Furthermore, the walleye was actually really good. It was probably the best thing we had so far but it is also over priced.   About the games.....the game room is cool but tiny. There are about 5 games you can play in a small room. Also, the checker game was broken when we went in one day and was still broken by the next time we came in. You would think that a new place would want to keep their business well maintained and professional.   Lastly, the photographic portrayal of the tire swings is misleading. The photos make it look like there are tire swings all along the bar but there are only 4 total swings in the entire place.   Overall, this establishment has potential with the cute theme they have going on. However, they are lacking in delivery and keeping up with a high expectation. They say you leave with an otter pop (as stated on the menu) but I've never been offered an otter pop upon exiting this place. This place would benefit by taking notes on the old saying, \"If you talk the talk, walk the walk.\"  That is all..."}
{"text":"Driving up to Camp Social it is a big tin building looking a little out of place. As we enter we are greeted by a great smile from a gal inside a retro camping trailer. The place is cool with canoes for lights, tire swings and campground hosts as wait staff. The chicken wings, and pizza above average and the beer nice and cold. The DIY s'mores was a bonus. Our waitress was absolutely awesome by the way. Definitely a unique find in central Phoenix."}
{"text":"They put sunshades over the windows. Now it is nice and cool!  This is a great spot for happy hour. Now I just need to try the food."}
{"text":"Camp Social is in a great part of town, and the decor is fun and inviting. Having the windows open this time of year gives a pleasant, outdoors vibe. The menu has some unfamiliar items, but we have really liked everything we've ordered. The bartender was friendly and gave us lots of info on the menu. As with others in the area, though, the prices are higher than they should be for many things. If they charged less, they would make more, since we would come more often. (:"}
{"text":"Nice and fun looking i can't say too much about the staff other than a polite hostess.  I'd say for a dollar margarita Great!  For a meal averaging at least 25.00 person minimum I may have to pass.  As I did.  Unfortunately my experience had too many tough okay looking dudes with zero personality the rest of the staff was on the phone texting or talking to one another. And I'm not sure but I think he was the manager was sneezing into his hands and then Not washing them but instead wiping them off of one of the servers wIpe rags yuck,  I'm sorry it was a very bad experience except for Amber who I met at the bar she was a customer beautiful beautiful amber with amber colored hair, oh she was a very sexy and classy young lady. And honestly do a staff switch out I may go back and try it again.  Awesome interior but with all the service oriented restaurants in town why sit through an uneventful or not even pleasant meal.  I gave them two stars for the great decor and interior ambiance and placing of bars but that's it."}
{"text":"I love the concept and was really hoping to see price pints according, but yikes, bill was high for a few drinks and snacks. During happy hour no less. The trail mix is just overpriced popcorn with cheddar powder (very Gardetto's) and the portion (for $9) was embarrassing. Tartare is served in a mason jar. Love the idea but execution and type of dish really don't go. Tire swings as bar stools are RAD but there are only 4 in the whole place and people camp out in them (pun intended). Also, some really heavy food for summer. Would like to see lighter dishes for way less money. Oh and nice patio but not dog friendly. Boo!"}
{"text":"I'm a little disappointed and upset; the food and drinks were great, our bartender was great, but when it came time to split the check my friend and I asked that the food and beverage be separate from one another. Not only did it take three people to do this (it isn't rocket science, I'm a server myself) but 20 minutes later we finally received the checks. The guy who separated the checks told us they accidentally charged us for each check (food and bev) and that the charge would subsequently fall off in about 3-5 days. Well, the charge settled on the 30th, I called back on the 5th and FINALLY spoke to someone about the matter (you're better off going in, they never answer the phone) and she mentioned the manager stepped out. She took down my information and both charge amounts, and said she would pass the information on. I'm guessing she probably crumpled up the paper and tossed into the trash or the manager waved it off because I still haven't heard back from them and it's now July 13, and my account is still missing $60. Camp Social, shape up and call me. I'm hoping I'm wrong and you didn't throw away my phone number."}
{"text":"This place is very unique but our server Andrew really brought it all together.  He was very attentive and his personality was absolutely perfect for our party."}
{"text":"This place was pretty cool! It's tough to get a new concept in Phoenix because we are the king of concepts!!! So many restaurants have their own unique vibe. This place is no different. The staff was friendly and timely. We had great fried pickles and a cute s'mores martini! They even came out and roasted a marshmallow!"}
{"text":"It was our first time into camp Social and we loved it from the moment we walked in. The place is beautiful and has great decor with a camping theme. The hostess sat us almost immediately and was very friendly. Our server Michael, was very pleasant and knowledgeable. He asked if it was our first time in, which it was. Then went over the menu and drinks with us. I must say his recommendations were spot on. We started with a couple appetizers, ( the redwood caprese and delicious meatballs on top of polenta.) then for our entrees, I had a braised short rib and my husband had the pig ribs. Both were absolutely delicious. Then we finished off our meal with smore's that you actually make right at your table! How cool is that!? We were stuffed but still ordered them because Michael did such a great job at describing them that we couldn't resist. And quite frankly, who goes to a camping themed restaurant and doesn't try the smores!? So overall we were very pleased with such a pleasant experience and we will be back, and recommend this place to all of our friends. We highly recommend that you try Camp Social if you haven't already! Way to go guys!"}
{"text":"One of the worst restaurant experiences I've ever had. Was looking forward to this place for awhile and it was a total let down. Service was terrible, over priced flavor-less food and no Otter Pops on the way out. Bummer"}
{"text":"Good service, nice ambiance, decent food. We sat outside and they had nice misters but it got pretty warm. Went for dinner with a few friends and got the ribs and a whisky and coke. They seemed to be out of a lot of liqueurs so we had to settle. The ribs were very moist and falling off the bone but the sauce was just okay. I'd like to go again to explore more of the menu and sit in a different area."}
{"text":"Allow though the atmosphere is fun, it's not elevated camp food...it's just camp food. Tried the restaurant with friends, made a reservation a week in advance, got smashed into a small corner. After asking three people can we please move outside finally we moved.  The server was nice as was the manager however 1/2 if our party received their food the other 1/2 got theirs 30 minutes later. The restaurant kitchen was having significant issues and although they comped all the food and continuously apologized.  I'm still not returning"}
{"text":"Finally tried this place out and loved it! My husband and I came for a quick date night. We sat at the bar and shared a beer and the Dry Chili Fries with Shrimp. It was SO good! Not to mention the bartenders were super friendly, attentive and gave us samples of drinks and appetizers. It has a fun, relaxing vibe. We will definitely be returning!"}
{"text":"The first time I came there, the service and food was amazing. We had a pizza, burger, and veggies for appetizer. The second time, the server spoke to us twice after I food was placed on the table. She didn't seem happy to be here. We got the Jimmi Pesto and the Duck Season pasta dishes. They weren't terrible but the flavor was lacking. Super bland considering the ingredients and price of each dish. I would've gave 5 stars for my first visit, only 2 for this visit. That's why 3 ... ambience is fun, music is AWESOME! (First visit was a Friday night and this visit is Tuesday night.)"}
{"text":"I had the poke of the day and my husband had the burger both were really good we shared the pretzel which was delicious!!! A must go place in phoenix. Our server was Jason and he did a great job introducing us to the menu and made some good suggestions."}
{"text":"This spot is fun and different, we stopped by and sat at the bar. The bartender was super attentive and the cocktails were really good. I had the Jumping Juniper, yum! We have to go back and try their food, it wasn't on the agenda this time around."}
{"text":"Lots of fun after a day hiking. Homemade marshmallows are a must. Recommend reservations ahead of time, at least you can play some games while waiting."}
{"text":"The concept of Camp Social is cool--it's supposed to feel like a remote cabin in the middle of summer. With trailers, tire swing seating, and country music. I like the idea of what it's supposed to be. Like a throwback to my teenage retreats in the woods, it ventures to be relaxing, fun, and best of all a great place to socialize!   But no one looks back at camping and reminisces about the food. And I know that after one visit, I sure didn't long for more grub from here.   The menu itself is a regular American selection that highlights meats one may encounter in the wild more often than the grocery. For example, poutine, but with *elk* gravy. Pizza, with *trout*. I began my night with a low-risk choice, the sweet korean buffalo wings. They were just OK, with not enough soy/kimchi flavor to taste even vaguely Korean, and way too mild to resemble the American favorite. This was the best part of my meal.   The pizzas came next. I ordered the Everglade with garlic, alligator sausage, chili, parmesan. My date had the Big Bend, with trout, egg, and brussels sprouts. She said it's the worst pizza she has ever tried in her life. I understand why, considering it was incredibly salty, and the runny eggs in the center were the only semblance of sauce holding this thing together. The crust itself was incredibly crunchy and tasteless on the edges, and rubbery toward the center. And while I hated hers almost as much as she did, I was at least able to barely tolerate mine. The alligator sausage was the worst I have ever had anywhere, ever. IDK what brand they use, but it could have passed for a plain ol' hot dog. GROSS.   I might seem like I'm being harsh, but we've got standards in uptown. You will not find a worse pizza for $15 anywhere. It's one thing to dislike the food, it's another to walk away with a feeling they're coasting on atmosphere and great servers. Every restaurant within walking distance has better food.   Will I give them another chance, however? Yeah probably, but cocktails, smores, and \"tin can rolls\" will only take them so far. Wishing them well and acknowledging it's going to be a cool spot to drink, but I just can't endorse any of the food. Sorry."}
{"text":"PATRONS NOT WELCOMED.   Caught up with some friends around 1030p as they were finishing their meal. Waitress acknowledge I had just sat down and she made a b-line over to our table to place the check on the table. [Usually waitresses ask, \"any room for dessert,\" but I guess this restaurant doesn't have any.] But no, offered nothing to a paying customer.  Waitress picked up check, cashed out, brought back check, once we left tip she asked, \"can I take it [check]?\"  Waitress made it clear, it was late at night... her shift was about to end... so that means everyone else's night has to end too, right?  Unfortunately this was my first and last time visiting the restaurant.   Completely understand you don't want to stay any longer at work, but that's when you tell management you want the day shift and NOT the night shift."}
{"text":"We did not have a good experience here. We were super excited to check this place out but it was not good at all. We started with the pretzel. The pretzel itself was good but the cheese was not very good at all. We've had better many other places. The cocktails look great on the menu but they are more overpriced than good.  We ordered a pepperoni type pizza on the menu and the BBQ beef brisket sandwich. I asked if they had other sides besides the fries but was told it would probably be an upcharge for a sub. The brisket was awful. The pizza was all sauce, hardly any cheese and about 1 pepperoni per slice and 12\" total for 16.00. We asked for ranch to see if that would help the pizza and we were told that would be .50 more????  This is about the time I had to say something. We did talk to the manager and let him know that we weren't happy. He said the food had been really well received so far? Really?? I just told you we didn't care for it. Hmm.  They did take the pizza off our bill and a few drinks as well which was nice but I didn't eat my sandwich at all and they didn't seem to care. We still paid 40.00 to leave. Picked up a pizza on the way home. :(  Sad part was one of the owners (or seemed to be) came and talked to us and I told him how we felt as well. There is this thing called actually listening to what people say...we did not like it and he seemed to make more excuses than take to heart what I had to say.   You all have some work to do and figure out what good customer service is about. How did you not notice we didn't eat any of our dinner? I would've been better with taking all of our food off the bill and paying for our drinks. We didn't want anything free.... we left our entire meal on the table. We won't be back."}
{"text":"They are lucky that they chose a central location to place this restaurant. The BBQ wings are fair. Their Dad's Classic Burger is a 6 out of 10. I give them 3 stars because the atmosphere is fun and the service is friendly."}
{"text":"Went here for the first time with a friend. I ordered a $15 salad. When I got it it literally had lettuce and 4 sliced grapes, no dressing. I sent it back because it was missing the apples, blue cheese, pecans, and dressing. I told the waitress I didn't want a new one made. She was very nice and apologetic and brought me a new salad for free. Unfortunately this salad had one half slice of bacon 3 slivers, and I mean shreds of apple a few grapes and maybe 3 pecans diced up with a teaspoon of salad dressing. My bill was $40 for two drinks and 6 wings(which they never brought me blue cheese for) the next day my credit card statement said camp social charged me $95 and it took them days and multiple phone calls for hem to refund me the $55."}
{"text":"Prices high, Mandatory valet, super dangerous blind corner to parking lot. Its pretty obvious the owners have never actually been camping before."}
{"text":"First, I wanted to love this place.. The theme is great and the staff is awesome..   We stopped by once for a quick drink and the service was great at the bar. We came back with the family for a second try..    Again the service was great but bring your suntan lotion if you get seated anywhere near the large garage door...  We were roasting/burning the entire time. How can you not address this prior to opening? I was seated by the thermostat that was set to 77 but it was actually 87 due to the amount of heat pumping-in.. Come on we live in Arizona... you didn't know this was going to happen?? Clearly a shade is needed for space.. Or the owners should hand out personal fans to all their customers until they get this issues resolved.. Most of the customers was fanning themselves with the menus. How can you not notice this??  The Food:  Cheese board was good, not sure why they felt the need to drizzle honey on the fruit but okay. The family ordered chicken fingers, fish-fry and another sandwich which all seemed okay..   Me and the little one decided to share a burger.. BAD call. Needless to say we sent it back twice .. AND we did not reorder again..  I saw the manager walking the floor - he hit every table there but ours... Coincidence.. I think not.. He knew what was going down and didn't seem to care.. Left it up the waitress to handle and she did a great job but he should have come over and acknowledged as well.. Again, BAD form..   Again, I wanted to like this place... The prices are high and the food is mediocre at best... If they want to stay in business they need to step it up considerably.."}
{"text":"This place had a great atmosphere. Took my camping enthusiast husband there for his birthday. Friendly staff and decent service.  While I had a little shock at the prices I must say the food was worth it. We ordered the Phoenix Rising sandwich a campfire burger and the grand canyon pizza. All three were very good. Wanted to try the Smores desert but we were too full. Maybe next time. We plan on going back for brunch soon."}
{"text":"Such a great spot. My fiancé gathered my friends and family to celebrate my 29th birthday. The ambiance of this place is great! The decor is fun with the tire swings by the bar and campers around the building. The staff was great and very attentive throughout our visit. I was very pleased with the fish fry I ordered. Everyone at our table enjoy themselves. Two thumbs up for camp social!"}
{"text":"The theme, decor and fun factor was five stars! The uniqueness of the menu and the food quality, four stars. The price for what you get, three stars.  As sweet as our server was, she and the vast majority of the wait staff on that day functioned like inexperienced high school kids.  Big smiles with little efficiency or multitasking skills.  We were there in the late afternoon so, once the sun started going down we were like ants under a magnifying glass in the dining room. I love the big glass wall, but not in the summer. I know they are just getting started so I wish the best for them. Hopefully they can work out all the kinks and this will be a fun place to add to our rotation."}
{"text":"Yummy food with different menu options. The service from Chris was excellent! Camp Social has an atmosphere unlike any place around PHX. If you haven't checked out this spot yet I definitely recommend that you do.   P.S. try the mojito"}
{"text":"Lots of potential, lacked execution. Decor is amazing, great location, really fun theme. Not the greatest service, had to ask for refills, had to ask for dressing on my side salad and ketchup for my meal, almost felt like we were in the way. Burger was just OK, pizza was OK. Smore graham crackers were great, but the cooking the mellows was awkward and sort of tedious. One of our mallows dripped and put out the flame, luckily that was our last one. Felt like the whole thing could have been magical with just a bit more polish. Plan on going back in a year, maybe it will get better with time."}
{"text":"Good place to watch a game...cute & great ambiance! I thought the food was good.  It wasn't a knock your socks off meal.   We got the yogi bears picnic appetizer... I thought it was just ok.  A few different kinds of cheese, some fruit, duck fat nuts, veggies, couple small slices of prosciutto, ham, salami.   I can't say I'd order it again. Tackle box-salmon was very good cooked perfectly but I didn't care for the broccolini.  The wild rice was just wild rice nothing special.  Overall it was good. Campfire burger-great taste to the bacon  nice and smoky.   Phoenix rising-chicken was yummy...cooked perfectly w roasted veggies...so yummy. We ended w the carrot cake which was very good...super small though for $12.  I am shocked at the price considering the small size.  Most places I've gone to serve extremely generous sizes of the carrot cake since most deserts are shared.   The service was just ok. It was slow there so I expected AMAZING service.  Our server wasn't horrible, but I can't say she really cared about the experience.  The hostess didn't seem to excited either...she was nice. Your first impression is the hostess...typically it sets the tone.   Overall it's cute.  This restaurant definitely has potential."}
{"text":"What a fantastically interesting experience at Camp Social. The decor and menu is in line with the Camp theme. We were seated at the Camper table inside and it was quirky yet nostalgic all at the same time. The drinks are served in mason jars, very typical and an outgoing current trend. The menu reads extremely well however the food doesn't live up too the description of the menu. We orders a variety of items for the table. Pork rinds, trail mix, poutine, meatballs, Asian buffalo wings. The pork rinds as well as the trail mix had great flavor but tasted stale. The buffalo wings were crispy but had a bit to much sesame oil in the sauce. The elk poutine had a great combination of ingredients...cheese curds and fried pickles. But the elk was overcooked and it was unfortunately missing said cheese curls. Overall, it's a great effort for a brand new restaurant. If you're looking for a cheeky, urban restaurant that caters to the 21-35 age group thus is the place for you."}
{"text":"Terrible service - terrible food! I would highly recommend spending your money somewhere else."}
{"text":"I had never been to Camp Social but got suggested by several friends to visit. I had a friend come into town and figured it would be a fun place to go. On a Monday night I made a reservation just in case they were busy I wanted to cover my base. We got there earlier and there was NO host to be found. We waited at least 2-3min when finally a young girl in plain clothes approached us. She was not friendly, she was not helpful, just plain how many , where do you want to sit, etc. They were not busy and I am pretty sure you are the host, you should seat us where you see fit, especially with a chilly night. Our server came,wasn't friendly at all, I  was even more dissapointed in this. I really was looking for a fun and friendly place to eat and I didn't get that. The food honestly was the only thing that was decent. Our server never came to check on us. I asked for ranch and took almost 10min to get when we were her only table. When we left after I paid cash for my tab, thank God I didn't need change because I couldnt find our server. We were leaving and she was in the back smoking. That is what pissed me off the most. They need to hire better staff there. More friendly and attentive to their guest needs. I won't be going back. The 45min drive was not worth it."}
{"text":"The burger was delicious but the fries were soggy and greasy. They did remake them they were much better but still had a weird \"old grease\" kind of flavor. Josh our server was great, very friendly very attentive. I'd come back."}
{"text":"Great Atomsphere and Theme !!! Great Cocktails ...  Pricey burgers that lacked the wow factor ... Good fries tho ..  poor service from start to finish ... On the fence if we would go back"}
{"text":"Love this place!!! The ambiance is awesome, very laid back. The food is also very delicious. I've tried several menu items and nothing has ever disappointed. It's a great place for all occasions, groups big and small. The staff is always friendly, you can tell they love their job."}
{"text":"I have mixed feelings about this place.    What I love...  the atmosphere, all the camping outdoor specific details.  Vintage trailers, canoes, tire swings, cooler coffee tables.  It's all very fun.  There is a back room with ping pong and a very small arcade, that also looks fun.  Appetizers that we ordered were very good.  The pretzel and cheese, soft, chewy and not as dense as traditional pretzels, i would order this as a meal next time.  Brussels Sprouts with bacon and candied walnuts... 3rd best Brussels I've had since Mastro's and Buck & Rider.  What I didn't care for, service was kind of slow being that there wasn't too many people lunching.  Entrees were mediocre, nothing stood out especially for the prices they garner.  Mushroom pasta, carve asada frites, the berry salad, all kind of fell really flat.    Would I come here again?  For sure, but I'd stick to appetizers, drinks, and playing games or hanging out on the patio.  I wouldn't come here just for a meal."}
{"text":"So this is a really cool concept with a subpar menu and kitchen staff. There are too many repeats and not enough choices.  I had the dad's traditional burger or whatever. It was under cooked. I don't need my burger to be medium rare. They seemed packed. Which goes to show you don't need good food to run a restaurant. Anyways, the 6 foot brunette waitress was right up my alley."}
{"text":"Good food - great service - helpful staff!! Only reason for the two stars was because kids were allowed to play on the swinging bar stools at the bar!! Their adults were hanging out in the camper - curious as to whether or not this is a liquor license violation.... $50+ w/o tip for lunch and a beer warrants better child supervision.  Also - please use sea salt not iodized salt - much tastier!!"}
{"text":"We been here a few times and usually get drinks. While I was out of town, my partner ordered a meaty pizza and love it. I came back and I had to check it out. They didn't have the meaty so we ordered the Everglade where it's alligator sausage. It was so good. The pizza what between medium to thin with a crispy crust. The sausage was slightly sweet so it was perfect so I would get it again."}
{"text":"Way overpriced and food is subpar. Cute decor!  Have no desire to return for another try."}
{"text":"This place has a really fun concept, but they have major kinks to work out. We took our 3 kids - and it took 2 hours (not including the 25 min wait time). The service was extremely slow. The food was bland. I sent my salad back because the lettuce was dripping wet (like it had just been washed). The trout had no flavor and it was $25. The baked beans weren't baked. The fried pickles were over cooked and -again bland. My advice: skip the dinner, just bring the kids for smores."}
{"text":"My husband and I ordered the PHX rising chicken sandwich from Uber eats. We had it before and it was tasty but this time something was off. Fast forward a few hours later, we both had terrible stomach issues (I'll avoid the details). This was the only meal we had together that day so I know it was from the food. Clearly food poisoning of some sort. Won't be ordering from them again!"}
{"text":"Today was our first time trying out Camp Social.  We sat at the bar with Katherine, she was so engaging and sweet and made excellent recommendations. The Acadia Pizza was to die for, and both my cocktails were absolutely perfect for my taste buds. Really awesome menu, great service and cozy atmosphere. Don't drive passed this  one!"}
{"text":"Love this place! Good food! Great drinks! It was a little tight but I would rack that up with it being summertime and them having to keep it closed up! Would definitely go back!"}
{"text":"My husband and I visited Camp Social tonight and it was really a delight!  We were warmly greeted both at the valet station and at the front entrance and even as we try to sneak in the patio with a delightful crew of employees.  There was no shortage of staff members offering to assist us at all times. I tactually think they might be kind of over staffed to accommodate the opening because everywhere I turned someone offered to help. Actually I kind of felt like I was at a soft opening because they were always asking about the food and drinks and the various and sundry things that we were experiencing with the games and the atmosphere.   We tried the wings the cauliflower and the avocado toast. Those were all delicious but my favorite thing on the menu thus far was the smoked steak tartare. That dish is amazing! In fact I give it 10 stars out of 5! It's not just Jami but it's like a chemistry experiment you have to try it!  Overall the atmosphere was warm and kitschy. The barstools were super comfy and the TVs were very big and perfect for sports.   Special thanks to our bartender Robert for an amazing first experience we look forward to coming back again!"}
{"text":"Over priced, no real service and food was mediocre at best. Stopped in for lunch. Never again."}
{"text":"SO COOL! Love the camping vibe, food was good, service great. Games and lots of TVs for sports. Will DEFINITELY be back."}
{"text":"Food is overpriced and not good, at all - both times we went! Drinks and atmosphere is fun, but not a place to eat."}
{"text":"I've been here a few times before and had a great time. The wait staff and bartenders were very courteous and personable. This time, not so much. We were pretty much ignored each time we needed food or a drink refreshment. It continued this way until we were able to wave down someone for assistance. All while the bartender played with his phone in front of us all night. Really disappointed as this has never been my past experience here. Not sure that I'll be back."}
{"text":"Good service, a pretty unique setting. The food is decent but nothing out of the ordinary. The kids enjoyed it, but most for the look and feel. Worth a visit when if you are in the area."}
{"text":"Came here for lunch with friends and we had a great time! Such a fun concept and great ambiance! We loved our food and our sever Chris was great ( 5 star customer service). We got a large fruity drink that we shared between the 4 of us! We go We got the campfire burger and it was great! In the back they have games like ping pong, shuffle board and jinga! We will be back again and highly recommend."}
{"text":"First time visit last night, the service was poor the bottle beer was not very cold and the food was marginal at best.  3 of us at the table we all ordered the camp burger and all 3 said the same about the burger.  Ordered a pretzel for an appetizer and out came 2 small pretzels and were hard to chew and the dipping sauce was odd.  Not the place for me I think my friends would say the same. The bill for 3 burgers 2 domestic beers an ice tea and a coke was 64.00 without tip.   I won't be going back."}
{"text":"I really want to like this place. I'm hoping the food gets better over time. It's new so sometimes it takes a little time to get it right. Super cute inside! Very cool atmosphere. I suggest the Mule cocktail and the pretzel. Both are really good! I think everything else is a little pricey for being just okay food. I've tried most things on the menu and those two things are really all I liked and I'm not a picky eater."}
{"text":"Had the Arizona salad. It was beautiful and tasty, with crisp greens. Awesome with the wheat beer. So cool outside with misters"}
{"text":"I really wanted this place to be great, let me tell you objectively why I give it a 3 star.  Ambiance 5 stars: The build out is phenomenal   Service 5 stars: They were almost too thorough   The access to TVs to watch games 5 stars: go to place for sports   Menu options 2 stars: the options were very bland and typical, didn't match the hype and brand  Prices, this is where I was truly baffled 0 stars: you can't offer me FISH AND CHIPS for $18 and give me and my guest DRIVE THROUGH KRINKLE FRIES, seriously, thats price gouging. Joe's easily is better right now."}
{"text":"Gimmick bar that doesn't even know how to pull off the gimmicks. Feels like a chain think Twin Peaks without the girls half dressed.  Can't wait to see what this place turns into next year."}
{"text":"I was so excited to come and visit here because I love the concept of the theme, a camping themed restaurant. Upon first coming in, the restaurant looked huge. There were tire swing seats at the bar, canoe themed lights, and even a mini trailer you could be seated in.  The menu itself is a hodgepodge of items, but we ordered the grilled brussel sprouts, the poutine, the pretzel and I had the little s'more's drink.  I'm a sucker for chocolatey drinks, but chocolately drinks on fire? I'm a fan. As for the food, the grilled brussel sprouts were cooked well, but they could've used more seasoning. The poutine was enjoyable, it came with fried pickles and cheese curds, but the curds were partially melted, and I prefer them more solid, for lack of better words. We learned the pretzel was baked fresh and the cheese it was paired with was good as well. Overall, the ambience is really cool, but I think their menu could use some work. If they had some specialties and less items, I think they could benefit. My friend I was dining with, could barely decide on her order because the menu was so overwhelming and diverse. However, the customer service was great. Shout out to our sweet waitress with glasses and dark hair who was very kind to us. Either way, I look forward to seeing what they have next for their seasonal menus because at least they are the type of restaurant to experiment with a lot items and ingredients!"}
{"text":"Great service, delicious food and tasty drinks! The staff is so nice and friendly, even the owner stopped by to say hello and comment on my girlfriend and my ugly Xmas sweaters with Xmas lights we were wearing lol. We will be back again and wish them luck on their future openings!"}
{"text":"We have been wanting to come to Camp Social since the day it opened but on several occasions the wait time was just too long.  We finally went on a Sunday night which was busy, but not crazy busy.  The hostess was very friendly and the concept is very fun.  We also came during happy hour so that was a bonus.  Drinks were good and pretzel with cheese was good as well.  Our waitress seemed like she was in a rush the entire time.  Took our order and was walking away before we finished.  My husband ordered the steak sandwich with NO blue cheese.  I ordered the raviolis.  Fifteen minutes later, she informed us that half of our order was \" lost\" and so we needed to remind her of our second item.  Once we received our food, the sandwich of course had blue cheese.  No biggie I guess, my husband just scraped it off.  Raviolis we just OK, but for the price, ridiculous!  My daughter wanted the s'mores, so of course we had to try them.  Presentation was great, but for $10, again just OK.  Nothing special, and very overpriced. Service was disappointing.  If there is a mistake made with the order, or it is lost and has to be renentered, there should be some recognition and compensation for that!  Free app, or drink maybe? Not to mention the order came out wrong which not once did our waitress ask how our food was. We will give it one more chance, but will order different food.  Overall fun concept, but way overpriced food for quality and taste, and not good service.  We eat out about 5 times a week, so we are always wanting to find a new place to go.  This probably wont be one of our first choices unless our second visit is significantly better..."}
{"text":"My husband and I recently visited Camp Social after getting a bit too excited about their menu and hearing recommendations from colleagues, but unfortunately we didn't read enough reviews beforehand because the food is definitely not worth what it cost and the overall experience was very mediocre.  The atmosphere seemed fun if you're in a large group wanting some cool photos and have no interest in having a tasty meal.  The place is over the top decorated with \"camping\" equipment (and ginormous TVs everywhere, because football is outdoorsy..?) but it is not where I could imagine anyone who actually enjoys camping or the outdoors going.  More Housewives of Scottsdale (sorry, Scottsdale) than Bear Grylls.  The most fun part was people-watching as distracted marshmallow-toasting patrons accidentally caught things on fire and made total messes with their s'mores.  My fish fry, made with some mysterious \"ocean fish\" had zero seasoning or flavor whatsoever, and my husband described his pasta as \"interesting\" and not in a good way.  The service was fine, the place seemed clean and cared-for, but they need to overhaul their kitchen if they're going to make it, based on our experience and the reviews I'm seeing."}
{"text":"Love the theme but the service and food are not that good anymore.  A few new items on the menu that were blah. Out waitress was having a bad evening.  Never smiled."}
{"text":"I've been here for jam packed happy hour, but the place was dead during lunch.  The fact there were only about 15 people in the whole place didn't stop it from taking 1.5 hours.  We were never offered drink refills, the kitchen runner didn't know what he had on his plates, and one of the salads was missing two of its key ingredients.  They're phoning it in."}
{"text":"Camp Social is on 7th street just north of Bethany Home road - the place has to be the cutest place with inside and outside seating - the bar area is  a transformed travel trailer into a unique bar.  Food; This trip we were only checking out the establishment and decided to just grab an appetizer - which we got the pretzel with cheese app - I can say it was good not great we've definetly had better.   Service; Our server was nice but it seemed she was a bit busy."}
{"text":"Atmosphere is cool, food is decent (the yard down the street has better), but the worst part for us was the excess heat... yes it's summer in PHX however that is not an excuse for thermostats being set at 70+ degrees in a restaurant that size and their fans we on slow.  We complained to a male manager only to be told \"it's an open air building, what do you want me to do?\" While I can see his prospective that is the furthest from an answer that management should give.  This is our second experience where the AC was not up to par for a PHX restaurant.  To echo some of the other reviews the service was just ok...  With so many great places in Phx this is just ok..."}
{"text":"This place is so cute. It's perfect for me cause this will be the closest I'd ever get to camping. Haha. My fiancé is obsessed with this place. We actually sat in the camper because my fiancé wanted to. *rolled eyes* totally has the camper feel and look.   He's totally obsessed with this place. He loved everything about it. And this is our second time here.   The workers here are very nice. Very attentive and accommodating.   We'll be back of course."}
{"text":"This place is awesome. I was a little bit apprehensive to come here based upon my friend's opinion? I mean seriously based on a campsite? But wow, our was great! Service is fantastic and the food is good. What sets this place apart is the social aspect. It's all people having fun. Playing games, sitting on the patio, dropping a quarter in a video game, etc. Highly recommended."}
{"text":"Very nice decor, but the drinks are WAY overpriced for what you get. We ordered the Lazy Sunday ($18) because we were told by our server that it was huge and potent. It arrived in an averagely sized jar and when we took a sip we were highly disappointed. Our server from minute 1 was pretty condescending and treating us like we were possibly bothering her, so I didn't want to send the drink back and have her think we might have been cheaping out on it. But to be honest, it just wasn't worth it. We ordered other drinks because that was lacking and also placed an order for food. The server kept reminding us that she could only bring so many drinks to the table at once (meaning we could only have one apiece) even though we were clearly nearing the end of our drinks and just wanted to not have a lull in between waiting on service. When she bought the next round of drinks she was clearly annoyed by the questions we had about other cocktails that were on their menu. At that point (it was my nieces birthday by the way) we all decided this wasn't the way we wanted to spend her birthday evening. We quickly grabbed the first waitress we could find and canceled our food and drink order. This place seemed like it could have had potential, the owner came by while we were there and he seemed very nice and was from our home state (WI). But, unfortunately, we won't be going back. There is too much variety in the area to be overcharged for weak drinks and to deal with bad attitudes."}
{"text":"Really great vibe. Love the decor and overall atmosphere. Went with a large group and most everyone enjoyed their meal."}
{"text":"Very fun atmosphere with great bites & drinks! I will definitely be coming back in the future for happy hour."}
{"text":"I had heard about Camp Social from my neighbor, and have been dying to come here. I had a lot of high hopes from the hype they created around the place, and for the most part I was not let down. The atmosphere and the theme that they've got going on is on point and unique to the Phoenix area. That alone is a big draw. The s'mores were basically a must, and we were certainly not let down by them. The decor was awesome and there was definitely a \"campy\" vibe.  That being said, there were a few things that didn't really do it for me. We got the brussels sprouts and short ribs as appetizers (both of which were pretty good), and some drinks. The fig mules were not particularly strong but they were tasty (slightest bit of a twist on a regular mule). I ordered the pasta with duck, which was just alright. Nothing spectacular, and it wasn't really flavorful. Apparently their version of fish and chips was really good. We also just HAD to have the s'mores for dessert, and it was maybe the best part of the actual culinary experience. Fun concept, and really left the place with a campfire smell.  A few other things that I noted: the whole camp theme is cool, but there's only one table that is in a camper...the rest are just free standing tables. From my research, I was sort of under the impression that there were a bunch of tire swings at the bar - there are only four in total. The game room in the back is kind of small. They say there's otter pops but I didn't see any as I was leaving.  Overall, the place has a really awesome concept. If they could build a little more on it, it would be a real gem. I would come back to try some other items down the line."}
{"text":"This place is literally EVERYTHING. The food is so good- they have my new favorite chicken sandwich (and fried pickles)! It has the perfect kick. And the s'mores are an obvious win if you want to feel campy while still beating the heat. Andrew was the best server, too!!! He was so prompt to put in our order and refill our drinks! I'll definitely be coming back!!"}
{"text":"The food was OK but service troubles abound. I ordered the pizza with pepperoni and fennel and the cook burned it twice. My hubby ordered pork sandwich and it was good but nothing fantastic. The manager did come apologize and comped our meals which was nice. Since we did wait almost an hour to be served after 2 burnt pizzas. Most disturbing was our waiter was dirty. Dirty hair, clothes and dirt under his nails. He was pointing out menu items with filthy fingers and nails. Big turn off."}
{"text":"Came back on Friday night and noticed significantly more staff.  Despite the greater amount of staff the service was even worse.  We were served very irregularly despite 4 employees sitting down at the table next to us rolling silverware and ignoring us and the other customers."}
{"text":"The decor and theme are adorable and I would definitely return for happy hour.  There are tire swings at the bar that looked very fun and the patio will certainly be a popular one once fall rolls around.  However, I felt like the theme sort of fell apart with the menu.  It's a little disjointed with pizzas, some seafood, some Asian sounding dishes, etc.  I think they could have simplified a bit.  That being said, most people in my party enjoyed their food well enough.  No one was raving about any one dish or gushing about how great the food was.  The snack mix that included popcorn and nuts was yummy but the hummus fell flat and we only finished about a third of it between 6 people.  I don't think I'll be back for dinner."}
{"text":"We went to Camp Social for the first time last night. The food was tasty but the service was not good. The waiter was slow and not attentive. It took a while to get our drinks but then when our appetizer came it was at the same time our dinner showed up and when I mentioned that we wanted the app first he said oh...sadly when I asked for a second drink it took me asking 2 requests and about 25 minutes to actually get it. The food was good yes however there are way too many options where I will receive good food AND good service :/"}
{"text":"They did a really great job of decorating camp social. It has a unique and fun feel to it, and I love the camp theme throughout! My husband and I went on Friday night and order a Lazy Sunday cocktail, which is meant for 2 or more people. Once we poured the drink out of the thermos, there was really only enough liquid for one person. We asked our waiter if this is how much it normally has in it. She said there should be more and she kindly brought us another one. The drink was actually pretty good! Nothing jumped out at us on the menu, but the appetizers we ordered weren't anything special. We had high hopes for this place, but left disappointed. If we ever do go back, it'll be to try a different drink and sit at the bar swings."}
{"text":"Here's the deal: this place is super cute....their decor is fabulous, their vibe is awesome..... Their food and drinks are just ok. They have a decent Happy hour, but it only has one 'specialty' cocktail special and then wells and beers... There are food specials as well which change periodically. My friend and I tried one of their pizzas (the smoky mountain) and their poutine. Both were decent, but not nearly as good as they were expensive. I had their cocktail of the day and I tried the s'mores cocktail. The s'mores cocktail was super fun and I enjoyed watching the bartender make it, but it tasted kind of so so. Anyway, I want to give camp social another shot, but for now, it's just ok."}
{"text":"I really wanted to love this place. Concept is cool but something felt off. The place lacked any sort of energy. Most of the staff hadn't tried the food and really had no knowledge of the menu. It felt over priced for such a casual environment. The tire swings at the bar are cool, but seem like a big liability, especially if someone has had a few too many. I'll give it another try after they've been open a little longer and settle in."}
{"text":"What a great fine !! Had my daughters 19th birthday party here this weekend.. Spoke with Alyssa 3 weeks before the party to make reservations for 23 guest ... She immediately responded to my emails and offered great suggestions.. Everything was ready when we arrived at that night .. This is a busy restaurant that makes it fun just being there.. Our waiter Brian was very helpful with all the girls and their food choice.. The restaurant is decorated so cute you feel like you are on an outdoor trip with all the luxuries!! We ordered a variety of appetizers , pretzels, hummus, chicken strips, roasted Brussels sprouts which seemed to be the favorite .. Our meals were then brought out, pasta, burgers , pizza , salads , ribs, etc... everything was delicious.. Although we were able to bring in a birthday cake , they also brought out yummy s'mores to the birthday girl!!! We loved Camp Social and will definitely return soon!!"}
{"text":"So tonight was my first night here at Camp Social, and honestly I could not have more satisfied! The food was fantastic, brought out to me all in a very timely manner, and my waiter her name is Daphne, was just about the sweetest and caring waiter I have ever met! She greeted me with a huge smile, and asked me how I was doing, and genuinely cared! I would give this place and 11 out of 10 from her service alone! Even when she wasn't serving me her joy and personality lit up the room! I am definitely coming back to this place more often! I LOVE CAMP SOCIAL"}
{"text":"REI with drinks. Great atmosphere that is open and airy. Fun bar with plenty of tv's. Plan on spending a few Sundays here when football season rolls around. Great drinks and super friendly staff. We shared the hummus platter that was garnished with colorful vegetables. Large menu selection with a lot of out of the ordinary options."}
{"text":"Atmosphere is amazing.  Sat at the bar in one of the super awesome tire swings.  Unfortunately, we got ignored by all three employees working behind the bar."}
{"text":"Great vibe, great atmosphere, horrible service. I know new restaurants go through transition when they open, but this was downright stupid the way they treated people....like we didn't even exist....you will learn though. Too much competition out there to put up with that billshit...go next door to Joe's Midnight Run...awesome place!!"}
{"text":"Great atmosphere but disappointed we were so hot the entire time. We asked the staff if they could turn down the AC. Never happened we literally had fan ourselves with our menus. We ordered Arcadia pizza which was dry and over cooked. Cesar salad was hot to the point our romaine lettuce was wilted. We were there for happy hour and they still charged us normal prices and even called the next day no call back. Probably not a place to celebrate birthdays or spend $100+ for bad food and service"}
{"text":"If I could give it a ZERO I would. Was really looking forward to late night pizza. Heard about this place. Went in. Watched waitresses dance with their friends, bartenders complain, and the manager sit on his ass. 15 minutes, later no one helped us after my husband asked. Just walked across street to Womack. Don't waste your time."}
{"text":"This place is awesome. Such a cool concept, amazing staff with an amazing and genuine owner. He clearly cares, as he is interacting with patrons and bussing (spelled wrong) tables throughout the night.  We've been here several times and our absolute favorite people here are Tiffany (the greatest ) and Garret (literally the best shot and drink advice ever). They are the reason above all that we will return.   We live in North Scottsdale and getting here is a trek- but for those two, it is worth it.   If you haven't been here, that's a mistake and you're missing out. Get it together and go check t out :) 10 out of 10."}
{"text":"We thought this might be a cool theme restaurant, so we drove across town to try it. While the decor was cool, the restaurant quickly lost its appeal. The menu was creative but also pretty expensive for what it was. We were disappointed to find that the food was mostly bland. We only really enjoyed the appetizer Korean buffalo wings...they were great. Service was ok, nothing great and a bit slow. Not sure we'll try it again..."}
{"text":"Loved this place as soon as I stepped in. The theme is well done and taken to the finest detail. We sat at the bar while we waited for our party and had a few drinks. The bartender was nice and quick and it was a comfortable spot to have drinks.  We had the pretzel and fried pickles for an appetizer - both were great! I became very disappointed, however, when the main meal came out. I ordered the rib eye sandwich which looked great, but was pretty fatty. It would have been a great piece of meat if it were a steak, but not as good in a sandwich. I ended up leaving a big piece at the end of un-chewable steak and bun. The fries were great, though!  While it's a cool concept, the s'mores were just okay...my marshmallow fell of the stick as I went to pick it up and I couldn't get it back on without it falling apart.  Food aside, this is a really cool place to hang out and everyone was super nice. We had two managers check on us while we were there and we were well taken care of. I look forward to coming back and trying something else to eat."}
{"text":"Been here twice for drinks and the bartenders have been amazing! Highly recommend this place for Happy Hour or even a Sunday afternoon brew."}
{"text":"Great décor, service is so so! I went there expecting great food and was disappointed. Bar tender took our order for drinks and left us sitting for 20 minutes. ordered the margarita pizza     and it had no flavor, terrible sauce and super small for $15.00.  Thank god it was happy hour and they took $5.00 off the bill.  Maybe they will figure it out if enough people write a yelp review and they read it!"}
{"text":"We went for drinks on Friday evening and it was a really cute place.  Didn't try the food this time, but I can tell you that the atmosphere and service were spectacular.  We sat at the bar and had a lot of attention and great service from the bar tenders.  The place is fun (espcially if you're into 80's summer camp movies) and the staff had a very fun and hip attitude.  I liked the drinks menu and checked out the food menu as well.  I suspect we will go back and try the food very soon!  Nice job on the service, atmosphere and drinks!"}
{"text":"Such a great concept, I love the campy atmosphere. The cocktails are so yummy I will be back to try them all! I recommend trying the firefly cocktail and the camp burger with jalapeños and bacon!"}
{"text":"We made a reservation and we were seated immediately.  That made the kids happy That's where the excitement ended .   The server finally showed up 10 min later and apologized . We said that's ok it's really busy in here , he said no not really.  We ordered our drinks and food at the same time .  Part of our drinks showed up, kids drinks did not .  Awhile later part of the showed up , part didn't .  He never came back.  He was very busy interacting with the band and a friend at the bar . The friend at the bar would order a drink from our server and he was busy serving him even though there was a bartender . We finally got all of our food which was very good .  We order s'mores and asks for the kids drinks again . Well .... you guessed it he didn't come back . We asked another waitress how long does it take to get s'mores . She said not long and she came right back with them while you guessed it he is still roaming around the bar . We told her sorry we flagged you down but he isn't coming back . She said something to him and floor manager. Manager came over and apologized.  We were there approx 1.5 hrs. Everything except service was perfect .  If you go sit at the bar and eat ."}
{"text":"Walking up to Camp Social, I was a little skeptical that it was a hype restaurant. But as I entered the dining area, a friendly hostess greeted me, along with the seemingly owner. They both seemed to genuinely care about making sure we felt comfortable. We were sat immediately, at a 6 o clock hour on a Sunday. Greeted by a friendly server who was personal and knowledgeable, we felt at home. The menu had a variety of camp type food: burgers, pizza, bites, appetizers, beers, fancy cocktails and more. the booths were large and comfortable for our family of 3. I was intrigued by the little camper turned booths that were in the amount of 2 waiting for special occasions and parties. I am very interested in coming back and sitting in these neat additions.   I was further impressed by all the small details; the faux grizzly bear  at the door, the great service, the glitter ceiling that emulated stars in the sky, the tire swings at the bar, the amazing canoe chandelier, and the list goes on.  The owner made the rounds to make sure his customers were happy and he proudly pointed out the special touches that made this dining room, an experience.  When a restaurant focuses on their customers happiness, the quality of the food and the small details that make a big impact on the overall experience, this is a place I want to give my business too and be a repeat customer.  One of the qualities that sealed the deal was the free otter pops in a small reach in freezer by the door. As we walked out, we were surrounded by families enjoying their otter pops on the the door stoop/ front sidewalk, like families simply enjoying their cabin in the woods.  I highly recommend the kitschy but tremendously thoughtful experience that is camp social."}
{"text":"Wonderful fun environment! Walked in from a Sunday afternoon into amazingly cool(i.w so cold) environment the air is got to be set on 50 it was so crisp and refreshing!!! Food is awesome! The burgers is something to write home about taste like fresh flame-broiled amazing flavored beef! The sauce on top of the Meatballs which are ginormous and delicious and juicy and flavorful is over the top with goodness! As if it came straight from Italy!!! Try this place you won't be disappointed the staff is so attentive to your needs the hostess morgan    is so pleasant when she greets you will be returning for sure!"}
{"text":"The place and concept is really cool but a restaurant is only as good as their food. I went for brunch with a friend and we were disappointed with the food. It needs salt and flavor. They really need to taste what they are putting out. I will go again for drinks and the ambiance.   ***Come on cooks get with the program!!!****"}
{"text":"Drinks good. Food, eh and greasy. Weird vibes. Staff helpful but robotic. Did not feel social"}
{"text":"Ripe swings at the bar....need I say more?! We had a blast at Camp Social. There wasn't a horrible wait, the bartender was super nice and made great strong drinks. The food was pretty good with good portion sizes. There are games in the back of the restaruant, ping pong, jenga, shuffleboard, and more."}
{"text":"Omg had SUCH a great 'girls night out' dinner here. The theme is super fun, the drinks were good, and the food was great! Absolutely recommend."}
{"text":"Atmosphere is great, hobo stew was really salty, the chicken stripes had a odd cinnamon batter with a sauce that just didn't work and the biscuits were really dense, over all not impressed because of the food."}
{"text":"Definitely a spot to go to at least once for the theme. It is hilarious, cool, and way fun. You are greeted by a host in a mini RV. Teehee! I am also happy to say the staff is reporting using all local talent on things that were built. Gotta love that. They have some cool benches and furniture in here.   So, by now you all know that the place has a camping, outdoors theme. The menu is very diverse, Alligator sausage, elk sauce, fish, pizza, outdoorsie, campfire types of things. The drinks are very good here according to my dining buddy. The Smores campfire drink was tasted. I can say really good. They light it on fire right at your table. That smell will trigger every childhood memory you have. Ha! I shudder to think of the calorie content on that one though.   The food was okay, not earth shattering but not bad either. I had the beet salad with whipped goat cheese. It was different. They use strands of greens so a little hard to eat but I liked it. I felt it could have used more beets though. My friend liked the brisket sandwich, again good but not outstanding. We also ordered the Brussle Sprouts which were not the best I have ever had, just okay.   They have a game room in the back which is an added plus. I want to come back here and swing on the tire bar seats. I think this place would be a really fun place to gather friends for  a birthday or happy hour. The drinks are a bit pricey though.   4 stars theme 3 stars food 4 stars cocktails  PS- our server was fantastic! Everyone here greeted and smiled when I came in contact with them, even the dishwasher who was out front for a few. The manager made two trips to our table to say hi. Impressed."}
{"text":"This place is so much fun! Big tire swing chairs at the bar, camper on the inside, games area in the back and great patio for groups. The margarita pizza was ok but not anything amazing. The s'mores was HOLY ISH good! The crackers reminded me of the Mexican pig shaped cookies!! I really recommend this! The bloody Mary's are delicious!!!"}
{"text":"Amazing atmosphere here! Came here for a friends birthday dinner and the people here are so welcoming. I had the the secret shot and beer and it was so good and cute. The shot and beer came in a paper bag. I will be back here again."}
{"text":"Our dinner here was terrific. The drinks were strong and delicious and the food was generously portioned and really tasty. We had the Mt Rainier pizza with chicken and the Winner chicken dinner - both were great. The friends we were with had the Autumn Leaves salad and the Campfire Burger and they were very happy with both.   The concept is great - I hope they bring one of these to LA! The tire swings and table inside the camper van and the campfire smores dessert all looked really cute and fun. If I lived here I would definitely come back, especially for happy hour and especially in the nice weather when I assume they roll up the front windows. This place was way cooler than I expected to find in a random part of Phoenix."}
{"text":"Bar has potential. Unique looking environment with lots of TVs. But don't go here to watch a game. I've been here twice now and they can't seem to figure out how to work them. They accidentally turn off prime time games, while leaving other TVs on empty channels."}
{"text":"Really fun venue but service was inattentive at best. Not super crowded and had to ask for my water to be refilled. Had to ask for ketchup for fries, wasn't offered. Potatoes with breakfast were very chunky. Food ok, but for the price was expecting more. We eat local frequently and nationally, so \"out to lunch\" on this one."}
