{"text":"Canvas Cafe has a much better menu than I expected the first time I walked in here. The salads and sandwiches are amazing and the fries are some of the best I've had. This place is great for lunch or food to go.  I highly recommend it to anyone in the Silverado Ranch  area as a regular place to eat at."}
{"text":"What an awesome place! I'm sad to see it go. The food is great, the staff is top notch, and the atmosphere is just plain fun. Good music, great food, fun artwork.  Come out and support Canvas Cafe in it's last days...closing Saturday 2/28."}
{"text":"Canvas Cafe is a neighborhood gem! The food is amazing...lots of great paninis and wraps...and the desserts are to die for! The owner is so welcoming and his staff is very nice. They sell art from local artist as well, and have started to have live music nights. I look forward to them having breakfast one of these days! Don't miss this place...it will become an addiction!"}
{"text":"Peppered pastrami on marbled rye!!   Garlic parsley fry sauce!!  Mom took us here on the way home from the airport. After my airline left my bag in Oakland and I had to wait in the airport 3 hours for it to come in on the next flight. Yeah, who knew it would take 80 minutes for a bag to get from the tarmack to the baggage claim?? Me either. Ugggh, rough day!!  But Canvas made it a little bit better. The pastrami sandwich I took to go was to die for and I could seriously eat the fry sauce with a SPOON! So so delicious. The woman at the counter also gave my mom a free soda while we waited for our to-go order. Very nice.   I don't really care for the artwork and, coming from Berzerkeley, it seems strange to have such a stylish cafe in a strip mall plaza but this place is MOS DEF worth checking out!! Will definitely like to come back when I'm in town."}
{"text":"Such a cool place. It isn't too big but the people inside have personalities that are larger than life. The owner is extremely cool and they have like a local night for bands. The bands are so good too and I loved all the artwork around. The food was absolutely amazing. They give you like healthy chips that taste better than those that aren't healthy. The only down side is that there is no alcohol... well unless you know the right person that is."}
