{"text":"The woman (owner?) is very rude and the service was, well lets just say there was no service. I even gave them the benefit of the doubt and returned a second time, but it was worse than the first. The pizza is okay, but I highly recommend people avoid this place, you work too hard for your money to give it away to people like this. Oh, and by the way, they don't tell you that they only take cash until after the bill arrives.  Not worth your time or money, 5 min away is Queen Margherita, enjoy!"}
{"text":"Capi's is a small restaurant ( I dont think a lot of people actually EAT here, it's more of a takeout place) so don't expect too much when you walk in. It's kinda dingy.  BUT....to redeem itself, it had a downhome italian woman running it who had no problem explaining her opinions to us. AND the pizza was good. Really really good. I can't remember what we had (I think the name had something to do with an autumn harvest, but it was in italian so I can't really be sure). Capers, olives, cheese, sausage.....very yummy.  So, if i lived closer I'd probably be doing their takeout, but too far to drive back to. Good pizza though."}
{"text":"I've had their pizza delivered a few times now, and it's been consistently great, I was looking for a better quality alternative to big chain pizza joints and have found it. :)"}
{"text":"I tried this place for the first time tonight. I thought this pizza was great! My boyfriend hates a lot of the generic pizza places(pizza pizza, Pizza Hut etc..) he barely eats more than a slice or two. Tonight he had a lot! I was happy he finally enjoyed pizza as much as me. The crust was super thin and crispy. It's definitely not a healthy pizza but it's a good greasy one! I found the owners friendly. Try it! You won't be disappointed"}
{"text":"Ordered delivery pizza from here, a large bacon, pepperoni with extra cheese.  It was incredibly greasy and soggy, so much so that the toppings were sliding off the crust.  I will not order from here ever again."}
{"text":"My boyfriend and I needed to try a new pizza joint so we took a chance on Capi's. was pleasantly surprised, extremely tasty and fast delivery.   My favorite pizza on the menu is from their specialty list - QUATTRO FORMAGGIO"}
{"text":"Very rude service.  I was informed in a rather grumpy tone that they accept cash only, and to go to the bank and come back.  Of course my pizza was cold after.  The place was also very dirty, the stove was covered in filth.  I won't be back."}
{"text":"The pizza is decent enough and their wonton soup is great. What type of restaurant is this? Who really knows, they don't really have an official menu, but the owners are very friendly and will gladly tell you what they have."}
{"text":"Change in ownership , now Vietnamese , is reflected in the product . A salty ,not tasteless mess topping with a soggy unattachable crust .Friendly people.An overall definite deterioration  . Try Vesuvio's"}
{"text":"This place has been my favourite since I was a kid. Even though the owners have changed, the quality of food is absolutely outstanding for an Italian take out ristorante. Crispy, thin pizza!  Ps. The current owners are very friendly and welcoming, makes you feel at home. They make outstanding PHO soup, secrete family recipe, as well as delicious wonton soup.  I here they are implementing a Vietnamese&Italian fusion in the near future."}
