{"text":"This is a great little seafood place. Usually doesn't have a wait and very family friendly. I order the broiled Tilapia. Pretty tasty!!"}
{"text":"Life Lesson Learned: Don't trust free chowder. 
So I'm sitting here with a rock in my stomach, having just returned from the Captain's Galley. I'm writing this review so that in six-months time, when I have a craving again for some hush puppies and fried seafood, I won't make the mistake of going here again. My first visit, approx 6 months ago (to fulfill my bi-annual craving), was equally underwhelming but I thought I'd give them another shot. Food was mediocre at best. They were offering complimentary soup, which would have been great if it was actually good soup. The \"hostess\" or whomever she was (not wearing the wait staff attire and taking money at the register) sat across from me for at least 20 minutes gossiping and gabbing to another co-worker at the front of the restaurant. There was a \"booth barrier\" between us, but she was still annoying. Also - my waitress, one of only two who were working, (she was good otherwise, however, all things considered) must have gotten sidetracked because I sat there for at least 15 minutes with my plate pushed back and a napkin over it (signaling I was done, since the typical 10/4 o'clock position of the flatware wasn't working). Hostess was still sitting there, running her jaw, while I was clearly waiting on my check. 

So hopefully some of you will find this review helpful, but I must say I am selfishly writing it for myself as a reminder that I don't like this place. Cheers!"}
{"text":"This place is no more. I went there and now it is called Huntersville Family Restaurant with \"Captain's Galley\" as a subtitle on the to-go menu... Worse food I have had in a long time. No broiled seafood like I wanted. They took order for it and came back we don't broil that... goodness, don't you know what you sell?  Food I got the fries mixed in with popcorn shrimp. Looked like a lot when I opened tray but then quickly realized there were ten fries for every shrimp... really? Stay away."}
{"text":"Simple A-OK seafood. Generally speaking, most of the fried things here are better than most of the broiled things. The fantail shrimp are better than the popcorn shrimp. The service is friendly and efficient and there is a small attached building out back that does a booming takeout business on Friday and Saturday nights.  Good for satisfying a fried seafood craving but, only about twice a year.  Prefer Captain's Cap in Denver."}
