{"text":"Very misleading. Big sign says any chicken lunch is 5.99 but upon purchasing it was 8.00 bucks.  Apparently chicken breast cost more and was not stated clearly.  False advertisement.

Also, expect small portions in a big box.  You won't be full.
They tend to favor their regulars with more rice and chicken in a box.  Also to note, they use fillers in their coleslaw.  No real carribean restaurant would include loads of sugar and pasta noodles in their coleslaw!"}
{"text":"I noticed that my review was no longer on the this page so I tried updating by copying and pasting to see what would happen only to realize that my review was filtered. I have been a customer of the restaurant since 2011. I was asked by the owner to make a complaint about review that he said might have been written maliciously so I flagged the review and wrote a general idea of what the owner said happened and what he believes to have happened after the fact. I was wrongfully filtered. My review has been posted since 2011 now my review after all this time past is not legitimate? I am a regular customer of Caribbean Taste because the food is good. It's as simple as that! My review is genuine. This is insulting."}
{"text":"My wife and I couldn't decide what to have so we decided to try something we haven't had dozens of times. I'm not very knowledgable about Caribbean but my wife and I really enjoyed this place and would definitely come back. She had the jerk chicken dinner and I had the rotti jerk chicken. I also tried a pineapple island soda - it was really nice... somewhere between a Pop Shop and a Jarittos."}
{"text":"Food was cold and portions was average, however the lunch special was decent. I would definitely recommend going to Ritz if you are in the area. Its only 3 blocks west from Sherbourne"}
{"text":"My husband got take out from here yesterday and I thought it was gross.  I ended up just eating the rice.  I just threw out the chicken."}
{"text":"The jerk chicken dinner is the best value - good size portion of chicken. The oxtail is delicious but is one of the pricier menu items at about $15 vs $10 for the jerk chicken IIRC. I'm happy this joint is in the neighborhood!"}
{"text":"As previous reviews mentioned, this is definitely a hidden hole in the wall. I work very nearby and when I need a quick and filling bite to eat for lunch I go to Caribbean Taste. Their lunch special is only $6 and consists of a protein (curry or jerk chicken), coleslaw, gravy and rice. 

Every piece was the meal was good. The only aspect that could use a bit of improvement is that their curry chicken needs a little more flavour.

I have come here a few times and am rarely disappointed. The employees are very friendly and lunch line moves quite quickly.

For $6, nothing really beats it around the area for the food quality and portion size"}
{"text":"A buddy of mine found this caribbean gem and I have visited this place numerous times now!

The food here is quite delicious and the portions are large. You can't go wrong with the lunch special Jerk chicken or curry chicken rotis for $7 a pop (till 2pm I think)! They taste great and are filling. Even their dinners are tasty and come with a side of black beans and rice and macaroni salad. If you get their dinners, ask them to put some ox tail gravy on the rice, just rich and delicious. If you feel like eating \"healthier\", they substitute the side carbs with salad as well. Their scotch bonnet hot pepper sauce is money too.

The ambiance is not the greatest, so I recommend getting takeout. But kudos to the food and the place is definitely great value for money."}
{"text":"I had the jerk chicken lunch special, and it was just ok. Flavour was decent, but didn't quite taste like \"jerk\" to me. The gravy was fairly bland, and the portions were disappointing: LOTS of rice & peas, but just a leg and a small chunk of chicken (1 and a quarter pieces of chicken total). So if you want a good helping of chicken, maybe order the regular size instead of the lunch special. 

All that said, the service was great and both people working there at the time were very nice & friendly. Not sure it's enough to bring me back though."}
{"text":"Portion sizes are big.   I typically order the curry chicken lunch special.   It comes with curry chicken/potatoes, beans/rice, and pasta cole slaw.    You probably won't walk away hungry after that much food.

Some other yelpers have commented on bad ambience, but I think there is something great about the owner who works at his own restaurant and clearly has a passion to bring good food from his heritage to this part of T.O.

This place is in my regular rotation."}
{"text":"There's a reason this place is empty.  Caribbean WASTE:

At first, the cheesy lizard green paint job and subway fluorescence might seem charming. 

And even when the waiter repeats your order back wrong 5 times (uh, jerk chicken and a side at a place called CARIBBEAN TASTE ... ), your generosity toward humanity is still in tact.

But then when you're served some rubbery boneless nuked filet smothered in airplane sauce, all your years eating delicious juicy jerk chicken off the grill, off the bone from the Caribbean community in Toronto inflame your belly with outrage!  Because it's still hungry :(

Then you're strangely served extra sides you didn't order!  And yep, sure enough that  bumbling order mix up at the beginning was meant to fill up your plate with stuff you didn't want and to CHARGE YOU FOR IT:

- coleslaw in watery, sugary leakings
- 2 sad potatoes wanting to roll off the plate for being complicit in this meal crime
- dry, flavourless rice and beans cooked by a negligent mama

Oh you didn't specify WHICH jerk chicken you wanted?  Well, the default filets were premium priced white meat, fyi.

$30 for two simple take-out quality entrees with sides, even though the menu price lists them at $10 a piece.  You just give up.  People don't come back.  Emptiness mystery solved.

Even if you're drunk down here, spend the money to cab it to Eglinton Ave W. and Oakwood for Raps; or St. Clair and Bathurst for Alberts for real Carribean food.  If not, you'll get scammed the same cab fare by these owners at CW who clearly don't give a ****, except if they're serving it.

One star, because ratings can't go any lower!"}
{"text":"The jerk chicken was good.  It was oven done, but the spices were just right so it replicated the the grilling in a barrel taste.  However, that's all I can say about this place.  We ordered their food from \"JustEat' and everything but the jerk chicken was a disappointment.  The oxtail was not tender enough, or flavourful enough.  The festivals tasted like they had been stored near a smelly old sock, and the unripe yellow plantain was boiled and then fried, or something weird.  The oxtail and jerk chicken came in containers with rice and peas, and it really was filled more with rice and less with meat and sauce.  The rice and peas tasted like they had been taken from a pot cooked the day before.  A disappointment overall."}
{"text":"I have ordered the lunch special a few times it's $6 for rice and peas and chicken and cole slaw.

The curry chicken is rather bland and is hacked up so badly it's laced with chards of bone.

The jerk is just okay but also lacks flavour.

The cole slaw is mayo-based but very sweet as if sugar is added.

Okay deal for $6 but not very good Caribbean food."}
{"text":"Super friendly staff, lowkey the best jerk you can get downtown"}
{"text":"As the only West Indian restaurant located on Bloor Street East, this new Caribbean Taste location (the original one is located at  224 Adelaide Street West) is a much welcomed restaurant at the Greenwin Square Shopping Center where McDonalds has held a monopoly for years. The food is great and I prefer the jerk chicken from this location over the jerk cooked at Mr. Jerk on Wellesley. When it first opened, prices were ridiculously high, however owner has listened to advice of patrons and now offers two lunch specials, one at $5, the other at $8.  Unlike other West Indian restaurants in the city, this location offers alternatives to rice such as stir fry Vietnamese vermicelli, which I do like as rice tends to bloat me at times. With a wide variety of menu deals (have to try the \"Jerk Poutine,\" and \"Jerk Wrap,\") I just love the fact that I now have a choice for a quick bite to eat instead of McDonalds, Swiss Chalet or Subway."}
{"text":"Once you go east of Church on Bloor, there are very limited options for food, but I am glad this place opened up near the McDonald's (same mall).  They have $5 lunch specials for all their chicken dishes and includes rice and salad.  

Everything was quite tasty, however compared to other Caribbean places in the area, I found the portion slightly smaller than other places, even compared to other specials.

Regardless,  if you work in the area and don't want to deal with the hustle and bustle of Yong street, this place is solid."}
{"text":"As I venture out in the frigid cold in search of the little mom and pop (plus kids) food joints in the area,  several coworkers mentioned this spot

$5 gets you a chicken lunch (choose your chicken style) with coleslaw,  peas and rice and big smiles

At these prices happy diners stumble in for warmth and fine island tunes on the stereo and it is warm in here

Yes the family cooks here.....

They offer patties,  roti and a daily soup but most lune up politely for the lunch special

They make a delicious plantain side so squirting on some hot sauce will delight your lips and tongue

Enjoy the sunny island lifestyle during lunch and that mound of paperwork at the office will be forgotten as you tuck in

Oh easy on the hot sauce....they laugh when you ask how many scotch bonnet peppers are used?  Is a secret Mon! !!"}
{"text":"This place is a hidden gem! The Jerk chicken and Fried chicken are the best. They come with coleslaw and rice or noodles ($6 during lunch!) I always also get the fried plantain. The people running the place are very nice."}
{"text":"recently added LUNCH SPECIALS (almost 6 bucks w tax), which is good, except...  portions are small, rice is still not 'decent' compared to almost all other Carribean spots..  Not a friendly or nice vibe at all.  Tried it twice, think i've officially given up..."}
{"text":"It's big, clean, and large enough for big groups. Menu items are average prices to other fast food Jamaican restaurants in the area. Wished the curry goat gravy had a little more thickness, overall not bad once I added the pepper sauce. Tender and not chewy, and happy the owners are Jamaican. Fun reggae jams for a quick dinner. Rice and peas were undercooked though."}
{"text":"Food is ok. I would not rush out to this place. Lots of empty seats at lunch, not a good sign. Woman at counter talked on phone entire time she took my order, while I ate, and while she served three other customers. Doesn't exactly make you want to come back."}
{"text":"I work at Postmedia and come here at least twice a week!  The jerk chicken is always really flavourful and you can't go wrong with the lunch special ($5.00 gets you 2-3 pieces of chicken, loads of rice, and a salad or coleslaw - of if you're going low carb like me, you can request the chicken with only salad).  I would recommend giving this place a try before going to one of the chains nearby (McD's, Druxy's, Subway...).  

This place is in Greenwin Mall right next to Druxy's (*there's no sign on the restaurant at this time).  Just follow your nose, you'll find it!"}
{"text":"Short Version: Huge portions for the price; food was a little bland but was pretty good overall. Seems like a small, family owned place, so the service definitely needed a little work, but it wasn't bad enough to be unforgivable. Three stars - the general theme of this review is that this place is pretty OK - nothing more, nothing less. 

Long Version: Dropped by here for a weekday lunch. It's absolutely got a cool vibe to it - tacky paint and lots of Bob Marley posters on the wall. It seems like a family owned establishment. This place has pretty cheap beer - gold star A+!

Portions are huge - the rotis are massive squares, and the meats come with huge plates of rice and meats. The rice isn't very flavorful, but if you ask for some gravy over the rice it definitely goes a long way.

I ordered the oxtail which was ok - it was surprisingly tender and tasted like it had been slow cooked for a very long time. So did the rest of the meats - all very tender and moist, falling off the bone. The oxtail might have been tender but it wasn't very flavourful. I would say it was pretty meh.

The place filled up pretty quickly for lunch break, and people seemed in and out. 

The service was friendly. The one waitress couldn't seem to remember people's orders, and came up to our table twice to ask us to remind her of what we ordered. 

Also, this wasn't something that annoyed us, but the owner's 5ish year old daughter was kind of just wandering around the restaurant. She would walk up to random tables and just fixated on them, or ask questions and just generally be a little kid. She was really cute, but you could tell that some of the other tables were getting annoyed that she was constantly bothering the customers."}
{"text":"Food quality and service vary greatly.  Undependable.

I ordered a curry beef roti (not cheap).  It was so over-salted I couldn't finish half of it and threw the rest away.

I had usually had the lunch special (curry chicken, rice & peas and coleslaw) but when I went recently, they were charging $1 more for the chicken for to be boneless--it had always been boneless before.  Also, there is a 25-cent debit card use charge.

Why I will will never go back:

I ordered my regular lunch dish choice -- should be two scoops of rice/peas, 1 scoop of meat, 1 scoop of coleslaw.

The styrofoam box had almost all rice/peas in it.  Not much chicken which I spent a dollar more for and there was almost NO coleslaw -- maybe one tablespoon.  That's it.

The server was so careless about preparing my order.

That was the final straw -- the food is only okay but when you get cheated out of it and they have raised their prices?!

Never again will I gamble on their dodgy meals and service."}
{"text":"would not return.  just not fond of the atmosphere/interior. food was okie though. some would say too bland. i thought it meh, not so bad, but definitely for it's price at 8$ lunch would not return just b/c the area offers so much other better stuff.  guess it's more homemade feel. shrug. guess nothing got my attention to ever come back.  plus there's gourmet burger, poutinerie and burrito boys right there too. those are just way better options."}
{"text":"The food, service and value of this place is amazing!! Real food, that's incredibly reasonable. Thank you!"}
{"text":"I usually find Jamaican food expensive and bland. But this place is gooood. Jerk chicken is AMAZING. Customer service had been kinda lacking ...but got much better the last couple times I went."}
{"text":"This small Caribbean place offers up lunch combo specials for $6 taxes in.

I got a nice sized portion of rice and peas, coleslaw (a little too runny for my tastes) and 4 pieces of BBQ chicken.

Not as good as the chicken from Ritz on Yonge St but a decent affordable option for the days you don't want to eat Swiss Chalet or McDonalds."}
{"text":"I came across this place when exploring the area for good lunch eats. The lady at the desk was quite kind and gave us her recommendation.

I found the food a little bland. I ordered the chicken curry roti."}
{"text":"** 3.5

I come pretty often when I'm at work.  The food here is definitely not bad.  And a bigg difference when you dine in than take out, the portions are much more generous for dine in.  However, you will be full even for take out.

I get the Jerk Chicken Lunch Special 98% of the time, and can only really review that.  I always ask for gravy on the rice which gives it a little extra kick to the rice.  The jerk chicken is most of the time pretty tender and juicy.  Yeah there are times when it's drier than usual.  And the coleslaw, seriouslyy.. don't knwo what it is, but it's good.  It's refreshing and has a nice sweetness to it.  Perfect to compliment the meal.

Overall, I would say for 6.33 (after tax it's like. 7.15 or something) it's not a bad choice.  Even the food court will cost you the same amount or more.  I come here for my jerk chicken cravings and been here well over a dozen times.  I come here weekly.  Despite some bad reviews, I'll be back for more.  Remember, this review is 98% based just on jerk chicken... 2% on weather. =P"}
