{"text":"Overall experience: 4.5 stars

Service 5/5: . Sheila (the owner) is such a sweetheart. She made sure we were taken care of. 

Atmosphere 5/5: Small, yet cozy. The chairs were very comfy and inside the resto had pretty decent decor.  

FOOD: 
Appetizer: Doubles- 4/5 pretty much loved it....didn't have as much stuffing as i would like, but it was pretty good..

Mains: Shrimp Roti 4.5/5...it came with a small side salad. It ahd a different taste to it compared to all the roti's i tasted in the past (and trust me, i had my share of shrimp rotis)..but it wasn't bad...different, but not bad. This was actually the first restaurant where they stuffed my roti with shrimps (YUMMMMMMMMMM)...very delish and extremely filling!!!

Callaloo and Chicken 4/5 - My friend loved it, however she said that she didn't love the presentation. Everything was touching eachother, so she wasn't really liking that idea. Other then that, the flavor of the food was pretty spot on.


NOTE: Me and my friend asked our dishes to be spicy, but when we got it, we couldn't taste any spicyness what-so-ever( I don't know if it's because she thought we couldn't really handle the spice). Thankfully Sheila told us that we could use the pepper sauce on the table (the pepper sauce is DROOLworthy).

Final thought: LOVED EVERYTHING! I'll go back for sure if i'm in that area. However, if I had to choose between Mona's Roti (in Scarborough) and this resto, I would still pick Mona's."}
{"text":"Yonge and Eg is littered with overpriced mediocre food, right down to the burger joints and supposedly \"high-end\" italian restaurants. BUT --- this place is the real deal with amazing food. Beats rotis from Island Foods, Alberts, etc. hands-down. Their hot sauce is fantastic, but even without it, the roti has a ton of spicy flavour without being hot. Don't know how she does it, but the food is so flavorful without much heat (unless you add hot sauce). The ownere is friendly and service is good. Rotis always taste fresh. She even apologized one day when I was ordering lunch becuase the roti's were made that morning, rather than just before lunch! Food doesn't sit on you like some greasy rotis in the city, which is a nice bonus. Yonge and Eg for roti, who would have guessed???"}
{"text":"This restaurant used to be at Yonge and Eglinton, and I'm really glad that it moved to my neighbourhood. I went in yesterday for the first time and had a goat roti. The goat was so tender and flavourful, and the spices were just perfect. You could tell a lot of care went into getting it just right. The roti skin was fresh and warm, and it was served with fresh salad, which is uncommon and a nice touch. I can't wait to go back and try everything else -- it all looked and smelled so good. There are a lot of Caribbean restaurants to choose from in this area, but in my experience, Caribbean Bistro is the best in terms of flavour, quality of ingredients and friendliness of service."}
{"text":"This is is the best Caribbean fare I have had in TO. I had the chicken roti to go which was excellent. Worth the money for the excellent quality. I will def be going back !"}
{"text":"I was torn with the rating for this place.  It is a small Mom and Pop place and the food is out of this world.  Just the right amount of heat and spices - the Jerk Chicken Roti in incredible and the portions are more than ample.  The food is cooked by someone who takes pride in the quality of their recipes.  I can handle heat pretty good, I'd say however, some may not find it hot enough.  No problem. Ask for their home-made hot sauce.  Awesome.  The flavour is there and while the heat isn't immediately apparent, it builds up and sets in afterwards.  Again, amazing.  

so why only a \"3\"?  They don't always have everything on the menu - I understand that's the way it is sometimes with a family-run place but that's not the way to grow your business if you want to compete.  I don't particularly mind though because I know what I like and that's all I have but if I wanted to try something new it's a little disappointing to be told that they don't have it that day, for whatever reason.  

The one last item I want to cover is their jerk pork.  With all the gushing I did at the onset of this review, I find that their jerk pork is a little hit and miss, with the pork being dry at times, which is too bad because sometimes you just want a succulent piece of spicy savoury pork!  

Otherwise, I wholly recommend this place for its flavour alone and no one that I've ever recommended to have ever told me I was wrong in that respect!"}
{"text":"I have been here a few times, each time hoping that the miss in food quality would be different. But each time I have been sadly disappointed. The doubles have to be by far the worst doubles I've ever eaten. Lack in flavor, and often times very stale, and served cold. In addition, this has to be the yellowest Bara I've ever seen!

The roti is the only thing keeping the rating about a one star. No complaints about the roti, however average at best."}
{"text":"I wandered in to this place for lunch while I was working at the public library across the street. I expected Jamaican fast food, but what I found was hot, fresh, home-cooked soups, curry, Trinidadian doubles, and the best roti I have ever had (channa is my fav, but I'll do the goat with pleasure, too). Now, I'm a regular. 

Every time I go in, I talk to Sheila. Sheila cooks everything and runs the place alone. She's amazing. This Dufferin-Eglinton neighbourhood is going to be great, and it's because of places like the Caribbean Bistro. And did I mention the doubles? OMG. Just talking about it is making me want to go back to get some today. Best $2.50 I'll ever spend. I don't know why this place isn't packed to the gills all the time."}
{"text":"Quite a few yelpers have stated that this is the best Caribbean food in the city and at this point and time I can't disagree with this for more than a few reasons. 
Firstly, the lady who owns this quaint little bistro really knows how to utilize the spices necessarily to make a very tasty Caribbean dish and perhaps even more importantly knows how much food is required to satisfy the appetite of a hungry customer (me). 
The curry dishes here have a home cooked quality to them and really feel good in your stomach after completing one of her many savory dishes. The roti bread she uses is also quite good, but I would recommend getting a full plate with rice when coming here because it really is a well balanced meal and the perfect amount of food for a nice lunch or dinner.
Behind the quality food lies one of Toronto's most genuine and friendly restaurant owners who is always happy to chat about reggae and other enjoyable compliments 
to the fine food she cooks.
She is a really sweet lady who likes nothing more than to cook amazing food and throw on some old school Marley tunes; now that's my kind of girl.
Caribbean bistro is a nice little getaway in an area that needs as many getaways as possible. The restaurant is small and quiet and you can always count on a pleasant ambiance accompanying you on your flavourful journey."}
{"text":"Very flavourful. Split Jerk Chicken & Curry Chicken rotis with my sister. Indigestion all day, but totally worth it. Hangups: Wish roti was more saucy. Was kinda dry. Jerk chicken roti's chicken pieces were tough & stale. Had to chew very thoroughly. I guess take-out isn't your friend when it comes to roti (perhaps the roti wrapper absorbed all the sauce?). Their debit machine was broken on the Saturday I went (Sept 15, 2012), so BRING CASH, JUST IN CASE! I had to go to C. Bistro, walk to CIBC to withdraw $40 (I paid $22-something for two rotis so a bit overpriced even if portions were pretty hefty), back to C. Bistro to pick up & pay for my rotis, then back to my sister's place. I still dream about all the Channa Rotis from Island Foods I scarfed down during my days at OCAD. Felt like crying when I revisited my alma mater many years later & found out Island Foods was no more. I know they have other locations but I'm a bit paranoid since the OCAD location Island Foods was so amazing."}
{"text":"Great, tasty Caribbean food. The hot sauce is really the star here--made in-house and you can buy jars of it to take home, which I do. It's very fiery and you only need a tiny amount--it goes a long way.

Everything I've tried here is delicious. You have to get the homemade sorrel if it's available. Sheila, the owner, is pleasant and friendly. It's a very homey atmosphere, comfortable but not fancy. The only way it could improve is to have more seating."}
{"text":"Heartfelt thanks to the cook who when recently I was diagnosed with pneumonia went out of their way to make me up my usual order. It took a little longer but that's because it was cooked from scratch!
Authentic Caribbean fare. Lovely homely atmosphere whether you are eating in or having take out.
The portion size is great too,,,,,and I always have leftovers for lunch the next day.
The stewed beef is awesome. Also roti very good aswell."}
{"text":"Awesome north Toronto spot for Caribbean. 
Straight forward, home cooked and delicious. Definitely worth stopping in."}
{"text":"I've had some great food at this place.  Seriously great food. I think this is probably the best Caribbean food you'll find in Midtown.  I sorely miss this place now that I no longer live in the area.

Seriously though, how often can you get a duck roti? Mmmm"}
{"text":"I live in the neighbourhood and this place hits the spot whenever I am in the mood for well cooked homey meals with some kick to them.  

One of my favourite dishes is the chicken roti which is of a very generous helping and unlike other places, doesn't skimp on the filling.  The other dish that I adore is the ox tail dinner dish.  Succuluent ox tail with with rice and beans take me back to the Carribbean.  The portions are generous and the food authentic and delicious.  A must visit."}
{"text":"Love, love, love this place. Good, old fashioned West Indian deliciousness served up with pride. Sheila, the owner, is as friendly as it gets and you can tell she genuinely appreciates your business. And she's one hell of a cook to boot. 

All the standards are there, from roti to jerk chicken. But what I really like is the wide array of sides you can mix and match with your main.

And you're a hot sauce junkie like myself, Sheila's homemade hot sauce will knock you on your ass. Incredible. And she sells it. 

if you're looking for an oasis hidden amongst the never-ending onslaught of average Italian restos near Yonge and Eg, check this spot out. You will not regret it."}
{"text":"Food & Service:4/5

Ambience & Value: 3.5/5

Friendly staff, yummy food. Sad to see them leave. One of my favourite restos in the area. 

They do have a new outpost at Dufferin  & Eglinton.

Repeat: Already have."}
{"text":"Had the chance to try Sheila's signature jerk chicken and didn't regret it at all, the chicken seamlessly pealed off the bone and seasoned perfectly. Her in-house hot sauce for anyone who loves hot sauce is to die for, will be definitely coming back here."}
{"text":"I needed something to warm me up on a cold gloomy day and decided to try Caribbean Bistro. It was amazing! My husband and I spit the curry chicken roti and and some of their fried dough balls. We had more than enough for the both of us. The food and the service was great. I would definitely recommend this place. Next I will try the jerk chicken roti."}
{"text":"EXCELLENT.  Had a desire for roti and found out they delivered. YESSSSSSSSSSS  Had the jerk wings which were delish and the chicken roti, which was great.  Their hot sauce is amazing and have to say I have ordered 3x in two weeks.  Think I am addicted."}
{"text":"Had the jerk chicken and curry plate, lots of food.  Jerk chicken  and rice and  peas was delicious. Good find!"}
{"text":"I think I get high expectations whenever I see a restaurant with the \"yelp loves us\" sticker on the door.

I had the chicken roti.  It was good, but not standout good.  Chicken was extremely tender but I found some bones in mine (not a big deal).  The spice was just about right and the hot sauce they give you definitely has some kick to it.  The roti itself was grainy and soft, not overly bready.  I wanted some doubles, but they either ran out or weren't serving them.  Service is slow as molasses.  I suggest you take your own initiative if you want to get the waiters attention.

For the location, it's not bad if you're having a jerk/roti."}
{"text":"her appetizers specifically her pholourie and doubles are always stale. you are better buying food at Ritz"}
{"text":"Love this place! Sheila's hand is sweet too bad!!! There once a week at least for her delicious food."}
{"text":"After meetings all day, I wanted to sit down and eat some comfort food. 

I came in here 45 mins before closing. It was empty. Service was good. Ordered two Saheenas because I haven't had them in ages - they were pretty good but very expensive! $2.50 each?! 

My main entree as recommended by the waitress was the jerk chicken. The dish came with jerk chicken, rice & peas, salad, and a cooked vegetable side. 

Jerk chicken - not the best I've had. The meat did melt off the bone which was good. Chicken was juicy but extremely salty... The rice was also salty. The salad - don't think you can mess that up. The cooked vege side came with curried cabbage, corn and some carrots I believe. It was weird. I don't think it went well with the dish. It seem as though they just threw scraps into a pot, added curry powder and called it Caribbean food... Coleslaw would have been a much better pairing with the dish. This cost $13.75. 

The bill came up to $20.75 which was a lot of a small Caribbean restaurant in my opinion. Not a huge selection of entrees or Caribbean dishes. Just the basics. This place is very expensive and I'm not too sure if I would be back or would recommend to any friends."}
{"text":"Last night I wandered into this beautiful restaurant. I was there to inquire about catering. I remembered this place because not too long ago I was at a meeting and they catered carribean food. My mouth drooled as I remembered the authentic Trinidadian roti and well spiced jerk chicken I had had previously. I sat down and spoke with the owner and operator Sheila. I ended up eating dinner there with Sheila and had the most delicious dinner and was astounded by her story of pererverance. Her food was fresh and of great quality. You could taste her passion and love she has for cooking in her food. This spot is a gem for those who enjoy authentic and traditional home cooking made with love!"}
{"text":"This was a beautiful find! I had the Jerk Chicken Roti which was perfectly spiced and delicious. The staff here are so lovely and friendly, the food is delicious and the portions are very generous."}
{"text":"This place is horrible. The service is non existant. Food is mediocre and overpriced. I have been there a few times because I work in the area and everytime I am dissapointed. It came to the point that one time I called before I showed up, Then when i went to order the owner plainly told me that she was too busy to make my food- to come back later. WHAT THE F@#*"}
{"text":"Caribbean food is so good.  I had the jerk chicken roti and was a happy camper.  It is a little healthier than the goat (which I would probably have next time), but still very satisfying.  It definitely has a kick to it, which I am all for.  You can even use this place as a launching point for a good old fashioned bar crawl."}
{"text":"I've been here twice and both times it was crowded (this place is a hole in the wall) and the service slow. This is obviously a small family-run restaurant and it seems to working off island time because it's pretty laid back. They don't serve or clear quickly but the service is friendly. 

The food is good and the jerk chicken has the right amount of spice. The doubles seem to be a staple so order those, we enjoyed them."}
{"text":"everything i ate was delish! 
had jerk chicken and ox tail, jerk chicken was so good..
only thing for me was that it wasn't spicy enough,
perfect lil spot for nice tender jerk chicken"}
{"text":"Calling all people who enjoy homey atmospheres and tasty hearty food...GO TO Caribbean Bistro! I love this little Yonge & Eg spot and the lady that runs it is the sweetest restaurant owner I've ever come across...As Torontonians we have the responsibility of ensuring places like this stick around and don't disappear.

Don't misinterpret my review. This is not a the best food I've ever had, the best service, nor the best atmosphere...but it is the most real and truly family run spot I've been too in a while. I love that Toronto as a whole supports these kind of businesses and I'd love to see the one of the few (and super tasty) in Yonge and Eg to survive and show Toronto what it has to offer.

Go be humanitarians and get some Jerk Chicken!"}
{"text":"I was so excited to try this place for authentic Trinidadian food, but was unfortunately very disappointed.  The dahlpuri roti was very oily and so was the food.  Not much flavor.  My Trinidadian husband only had one bite.  He wasn't impressed with the jerk chicken either."}
{"text":"Wow, its been 2 years since I first visited.  My standard was set by Chinese Jamaican relatives.

I was there last week with old friends and new friends from Toronto and Indonesia.  The ox tail was perfect like I remembered.  The jerk chicken had the right amount of spice and flavor.  I opted out of the rice and was pleasantly surprised by the cabbage side dish.  The spicy Indonesians liked the hot sauce provided on the side.

I'm still waiting for them to carry stronger ginger beer.

Things sometimes take a bit of time here because they are cooked fresh.  It may look like fast-casual, but it isn't.  Its quality food and that takes time."}
{"text":"I have been by this establishment a  few times , on Yonge St, and tonite, I finally went in. Small joint, only about 6 tables,  but I managed to squeeze in and find a spot. Lots of  choices on the menu, and I had a hankering for Roti, so I ordered
the curry goat roti with Potato, just for something a little different.
Boy, was it every tasty. Nicely presented, a good portion, with a small size carribean style sald. Owner was very friendly,,and  said I looked familiar.
I  asked her if she had watched  \"America's  Most wanted\"  as of late.....:), she
chuckled.
No ginger beer in stock, so I settled for Ginger ale (not licensed sadly.....).

Will go back, based on reviews read here about the jerk chicken.

Oh yeah, try the Secret Hot Sauce on the table, to awaken your taste buds,
but take it easy.

Enjoy!!!"}
{"text":"Coming from a West Indian background I was thrilled to try out and support Carribbean Bistro.
The food was a huge disappointment. I ordered the jerk chicken/curry chicken combo and both meats tasted similar as in overly spicy with no flavor to back it up. 
The portion size was very small and mainly filled with rice and a few pieces of lettuce. The typical entree at a Carribbean restaurant is always served with veggies and plantain. 
Although the service is pleasant I will not be returning nor will I recommend."}
{"text":"I've been going to this place for about 3 years now, on average once every couple of weeks. There food is usually decent but the service was always subpar. However my most recent experience has completely ruined this place for me. 

It was around 8pm on a Tuesday, I called and ordered one dish from work, and asked how long it would take as I was on a time crunch. The guy told me 10 mins. I got there in 15 mins, and the girl behind the counter asked what I had ordered. Turns out they hadn't even started making it. I told the girl I'm in a rush and she assured me it would take 5 minutes at most. 

I waited another 15 mins as the staff avoided me and finally the guy I spoke with on the phone came to ask AGAIN what I had ordered. By this point I didn't even have much time left to eat. I told him my order once again and he told me it's not going to be ready for another 10 mins because they are very busy. There was one table sitting in there. I could hear them microwaving the food in the back and dropping utensils on the floor, so I just told him not to worry about it, since they clearly haven't even started preparing my dish, and left the place very dissatisfied. 

Suffice to say I won't be back ever again and they have lost a loyal customer who had always recommended the place to others previously. Even though their food is pretty good, I doubt this place will be able to survive for much longer in a neighborhood where the nearby restaurants hold customer service to a much higher level."}
{"text":"Extremely slow service (took us almost 1.5 hour after we got seated to be served and get our food). Food was mediocre and not worth the wait. Portions were not that big as I thought it would be from previous reviews. We were actually still hungry after a jerk chicken roti and a braised oxtail rice dish."}
{"text":"By far the best Caribbean food I have had in the city! Portions are on the large size, dishes were cooked fresh, price is very fair, and our server was happy and polite. I can't wait to come back for more. If you are in the Yonge and Eglington area and want something to eat, go check it out. I recommend the jerk chicken roti!"}
{"text":"saw the lady taking the order using her hands to prepare the lunch special salad, without washing her hands. I got the jerk chicken lunch special but only ate the rice and pieces of chicken. rice tasted ok, but the chicken was very salty. portion is very small for the price you pay - you can get the exact same lunch special for $4.99 just blocks down at yonge/eglinton. 

I'll not be returning to place for hygienic reasons, and I do not recommend this place to other people."}
{"text":"I had a lovely business lunch here on a lazy Friday. The oxtail stew was absolutely delicious. I liked the cabbage it came with a lot. Rice and peas were good. Enjoyed a tasty ginger beer brewed up in the kitchen.  Portion sizes are not overly large, but that ensures you eat every delicious bit of food on your plate. I bet most of the plates go back to the kitchen empty. Which is a good thing. Kind and friendly service, combined with the excellent cuisine ensures I will be back to try more of the menu."}
{"text":"What's with the great reviews? I've eaten here a few times, trying different things and hoping it will get better. It only gets worse. As the only Jamaican place in the hood (a new one is opening soon on Eglinton, though), I think people like it because they have no basis for comparison. Anything deep fried here is DISGUSTING. They use old oil, at a low temperature so it totally soaks through everything and makes it soggy and nasty - instead of light and crispy. Ate the jerk chicken here with my Jamaican friend. His words were: \"This is not very very good jerk chicken. Yery dry and the spices aren't right. I won't go back there.\" I've been to Jamaica and loved the food. This just doesn't do it justice. I want to like this place, but they have to start using some fresh oil, fresher ingredients and putting a  little love into the food."}
{"text":"I've been here a few times and had the jerk chicken, which is good.  Today though I had a jerk chicken roti, and my friend had the callaloo and chicken.  Both meals were delicious, and my roti was actually a little too big for me (and I have a very healthy appetite).

The atmosphere is VERY basic, and the service is very casual, but friendly.  You can tell that Carribean Bistro is totally family run.  I asked if they had any summery drinks, and the server offered me something (sorry I didn't catch the name) which was fruity but had a hint of ginger in it.  Very good.  We were never given a bill, and our dishes were never cleared from our table, but we didn't mind, because you just know going in that everything is going to be very casual.  Plus we were so satisfied from the food that it was hard to be unhappy.

Our meals, with a drink each (no alcohol) came to $30 + tip."}
{"text":"I was really looking forward to coming here based on past reviews.  sadly, I was disappointed to say the least.

Pros:
Nice, friendly, staff

Cons:
Jerk was way too salty
Prices are much higher compared to other places

Came by on a Friday evening because I was craving oxtail.  My GF wanted some jerk chicken so it seemed like a good opportunity to finally giving it a try.  As I said before, based on previous reviews I was definitely excited.  

When I came in, the place is much tinier than I would of expected.  There was no staff around when I came in.  Everybody was in the kitchen.  It took about 5 minutes before someone actually spoke to me.  When she came out, she was very nice and apologetic about the wait.  This girl was the highlight of my visit by far.  She was friendly, patient and everything you could ask for.  She's the reason why this review rating isn't any lower.

First thing, they were out of oxtail at 6pm.  For a place that closes at 10:30pm, that's not cool.  I has to settle for a jerk chicken order for my GF and a jerk chicken and ribs for myself.  Now that there was no oxtail, we took our order to go.  There was only one table seated at the time, but it still took a while for the food to come out.  I'm guessing they may have been short on staff that day.

When we get home and open up our food, right away I'm a little disappointed.  Basically I got a few slices of lettuce and 4 or 5 pieces of cucumber.  I'm used to coleslaw, plantains and even a nice garden salad.  I get basically what you would give a rabbit. The jerk was not up to par as well. I think I have a good idea on what jerk should taste like. I have co-workers born and raised in Jamaica whoa re now in their 40's and 50's who bring in jerk and oxtail for all potlucks.  If anybody knows authentic jerk, it's them. This tasted nothing like what they make from home. The jerk chicken was way too salty, It was spicy which was nice, but just way too salty to taste anything else.  It could of used a little gravy as well.  The \"ribs\" were just a slab of pork that was kinda tough to bite through.  Very disappointing.

The prices are also much higher than any jerk place I've gone too.  $13.95 for jerk chicken is by far the highest I've ever paid. Getting a few slices for lettuce as veggies just made it worse.  I could of gotten a jerk chicken dinner with way more portions for about $8 at Ritz down the street.  

I was very disappointed but I will be back.  I honestly think they were having a bad day.  Based on the reviews in the past, it should of been better.  I also took note of the roti the other people were having and that looked pretty good.  I will be back, not anytime soon, but I will.  For now though, this is where I stand on this place."}
{"text":"Had a craving for jerk chicken and Caribbean bistro did not disappoint. Surpassed my expectations and satisfied my hunger, so much that I brought more home for dinner. So happy that my experience was a good one. Felt the love on the plate. The right heat and you're taken care of and given your space to enjoy your meal. I'll be back again next week."}
{"text":"Shhhh! I steal the fragrantly curried shrimp and chicken inside my friend's roti while she's grabbing hot sauce from another table.  I don't think she'll notice because the roti is stuffed so generously.  The jerk chicken is so good it brings a tear to my eye, and it comes with delicious cooked cabbage plus rice & beans on the side. The hot sauce is necessary masochism-- I pour it on the already succulent bites, and I think it doubles as a lip plumper for hours afterwards.

The real charm is Sheila, the owner, whose hands tell a story. Every dish is served up with a side of Trinidadian humour.

This is a great option in the Yonge & Eg area if you want to do takeout after work or have a casual dine in. Dinner for two on a $20, and a glimpse of the islands."}
{"text":"Auntie Sheila warms the soul. And it's not just her homemade hot sauce doing that. 

Home cooked style Carribean food. Prices are $1- $2 more than other places, but her portions are much better and worth it.

The roti's are huge, the portion on the curries is great, the doubles are bigger than what i'm used to. 

As a must, get your normal stuff, but make sure to also try her fried plantains. She also has good selection on drinks.


Things to keep in mind though:
It's a relatively small place and it's not very fancy
Expect slow service, but sheila more than makes up for it with a smile."}
{"text":"I am for sure a fan! I like this place because it is one of a kind in this neighbourhood.

A simple restaurant, with a simple menu and simply good food. The prices are a little higher than what I'm used to for this type of food, but the food is not bad. The portion sizes are decent and they have a few vegetarian options.

I live in the hood, so I never eat in, I just take my food to go.  They do deliver now, but I live so close it seems wrong to do it!"}
{"text":"This is another restaurant rated way too generously on Yelp. The food is mediocre, and the service is slow (you can even say absent). The beef and chicken are quite tender and fragrant but come in small portions (about a ladle per side). 

Callaloo is essentially a spinach puree with coconut milk. It was runnier and more bland than the Jamaican variety I recall having many years ago. 

I didn't find the food spicy at all. I could have used the hot sauce that everyone is raving about but I literally could not get hold of anyone during the entire time we were eating."}
{"text":"I've picked up chicken rotis to go at this bistro but never realized they delivered! 

Until today! Happiness.

Placed an order for jerk chicken and peas and a side of plantains. Almost ordered more, the menu looked so right, but whatever little willpower I possess kicked in. 

Jerk chicken- was a but spicy and could have used some gravy, but pretty authentic

Rice n' Peas- Delish! The best part and I never think so. Huge portion, didn't finish it in one sitting.

Plantains- I specified sweet and ripe in my order... Got ripe but not sweet. That's nature's fault haha, not the restaurant. Well made but wish they were caramelized. 

Cod Fish Cake- These arrived at room temp but were still so good. Pleasant surprise and perfect snack size. 

Everything also came with a generous side of salad (cucumber, radish, etc, sans dressing) as well as curry potatoes (the kind that go inside rotis). Only thing missing was a coleslaw to counter all the spices.

Overall, for about $25, it was such a bargain and such a treat! This will be a new favourite as long as I'm in their delivery or pickup area. 

I Recommend- Trying the roti mild before you go hot. Cause the hot is not a joke and it's well seasoned either way.

Extra Tip- You can order on justeat.ca. Min order is only $15 and no delivery fee!"}
{"text":"My first taste of Caribbean food in Toronto and still one of my two favourites.  Jerk chicken is moist and flavourful. Curry chicken is hot but not overwhelming.  Service is always courteous and fast.    The only warning is that even their \"mild\" dishes can be a bit spicy.  A bit pricier than some of the chains but the food is so much better here."}
