{"text":"Grabbed it to go. Had the beaf and chicken burrito....Not very tasty to say it mildly. The salad was also soggy."}
{"text":"I've been to the downtown Montreal location a few times and this one just doesn't compare. First of all, most of the tables seat just 4 people, and yet they refuse to take reservations for groups of under 5 people. There was a larger group beside us and they had to separate them in two. So basically if you're a group of 6, two people have to sit alone. I found that to be ridiculous. Not only that but there are very few booths, and they only seat 2, the rest are tables but the seats are bar stools with no back. It's the middle of winter and we had no place to put our coats, there is one coat rack but it doesn't hold enough jackets, The whole layout of the place is ridiculous. We also waited almost thirty minutes for a waitress to come by. My plate was missing a salad side and tasted nothing like the same thing I had at the downtown location, it wasn't even spicy, this is a Mexican restaurant and the enchiladas aren't spicy?? We left after  eating as we were uncomfortable on those stupid bar stools and didn't want to keep our jackets on the whole night. The decor and theme of the place is really cool, but it's disorganized with a bad layout and ridiculous seating arrangements. Maybe it works better during the summer time when people don't have jackets and scarves. And refusing to take reservations for a group of fewer than 5 is just stupid, especially when most tables seat less than that, what the hell guys. It's as if it's run by people who have never been to a restaurant. Not going back."}
{"text":"Be aware , do not go here !! This restaurant have bad services ! I ask for a lime and it took 45 mins to come . Food is not that great  , very simple ..
If you want Mexican food , go somewhere else .. you will be disappointed. My food was burnt and chicken was very dry !"}
{"text":"Went on a calm (not too busy) weeknight for dinner. The drinks took 25 minutes to get to our table from the time we ordered them in the 4-7 (tap beer...nothing much to it except pour in glass and serve) and the waiter was insisting on charging us full price on the bill instead of the 4-7 price!!! Food tasted fine and we wanted to try many things in the menu, except we only got entrées and we changed our minds on dinner. Decided to go next door at 3Brasseurs for the rest of our evening, at least we didn't \"wait on the waiter\" at this venue even though it was packed with clients. First and absolutely the last time we go to C&P, the service was the worst I've had in years at any resto-bar. Staff doesn't seem friendly or interested in working to keep clients."}
{"text":"Décor 5 stars . Services 5 stars. Food 4 stars. Drinks 4 stars. Did not have high expectations.  I guess I was surprised.  Ordered only apatizers and I was full. My wife had the fajitas."}
{"text":"Bouffe tres ordinaire,service correct et facture très salé .La viande des tortillas étaient dure.Il y a de meilleurs resto mexicain que ce resto."}
{"text":"I decided to try out this place because the 3 amigos closed down.  And I was pleasantly surprised !  There was a line but when the waitress asked if we wanted to sit at the bar instead of wait for a dining room place we agreed. I ordered a mojito.  BEST MOJITO OF MY LIFE.  it was delicious,  and so was the food.  5 stars for the food. By far the best Mexican I've had in my life.  The only down point was those stools we were seating on.  It hurt all our bums. And the music is so loud everyone has to yell to understand each other.  But overall I will be coming back soon.  It might just be a weekly outing."}
{"text":"Amazing shrimp taco! Jalepeno poppers amazing! ! Service was fast. Monday 3.50$ tacos!!"}
{"text":"Huge line-up, wait was 25 minutes (but we were warned on the phone about it, so no complaints). They only take reservations for groups of 6+
Decor was definitely a 5, great vibe.
Drinks were a solid 4.
Food menu was extensive, lots of options for everyone. My fiance and I had the tacos and ranchero burrito. Both tasted pretty much exactly alike and were fairly bland. Required a great deal of hot sauce to get the flavour going. Price was good as well.
Service was attentive.
Overall, would still like to try it at least once more, and perhaps order the a specialty hot sauce that they have."}
{"text":"C'est un vrai racket ici. Tout est en sus. Faut même payer l'eau, les chips, 50 cents pour une tortilla, 3,50$ pour une crevette de plus. Sortez votre cash!
Et qualité discutable. 
À éviter"}
{"text":"I've been to this place many times and food was always good and warm. But this time I wanted to try their steak fajitas... my friend ordered the same too. The steak pieces were over cooked and hard to chew, I mean... HARD! I never return food to the kitchen as I am a bit concerned what will happen to it while inside the kitchen before coming back to my table... (we all saw the movie waiter right?!) you should have seen us chewing on the steak!!! Anyways, i do not recommend the steak fajitas, but everything else I had so far was good. ;)"}
{"text":"Le restaurant en soi est fort joli et bien décoré. Le service est très bien aussi. La bouffe y est bonne. Commencez avec une trempette de guacamole ou des nachos, les deux sont très bons. Évitez les chips et la salsa, même pas cher ça n'en vaut pas la peine. Pour le repas principale, y aller avec le tacos el sexo mou (un peu pour le nom lol) ou les enchiladas. Pour le dessert, aucun n'est vraiment excellent. Puisque vous êtes au centropolis, allez plutôt chez juliette et chocolat! Pour terminer, l'alcool est assez cher là-bas... d'où mon étoile en moins. N'y allez pas pour le 5 à 7, mais pendant votre souper, vous devez essayer le margarita scorpion! Cet endroit est aussi bien adapté pour recevoir des groupes et fêter un anniversaire (tout le monde veut un sombrero sur la tête pour célébrer :P)."}
{"text":"I was so excited to come to this place since I found out they were coming to Laval. The first time I tried to go the line was so long outside that we turn around. This time I came during an off night during the week and it was a good choice because the place was not really busy.

The decor is amazing and the place was pretty clean. The music was very loud actually it was a little too loud because I couldn't hear what my boyfriend was telling or even hear the waitress. The service was pretty slow and it also took a while for us to get an English menu.

Huge drink menu and my man had a beer and I took some kind of pina colada and it was very good. It was cheap fajitas night so my boyfriend tried that and we both loved it. I had a spicy fish taco with a mango slaw and that was amazing as well the only thing I didn't enjoy was that awful rice it was mushy and tasted like tomato. Also love the fact that they have so many hot sauce to choose from right at the table.

I will go back again for drinks and food for sure"}
{"text":"The decor gets 5 stars. As I write this, however, I've just  been waiting for my appetizer for over 40 minutes. The service here is pretty deplorable. 

So, just like a pretty girl with no substance, this place is a bit of a one-hit wonder. 

Oh, look! My tortilla soup came!  It's delicious. ..and lukewarm. So is my queso fundido. After the server argued with my table, claiming it was not cold, he acquiesced and reheated it.  

My food arrived about 1 hr 45 minutes after I ordered....and though it was delicious, I think that was too long to wait. 

If the staff here can work on timing, this place will be great. The environment seems fun, but just not service oriented."}
{"text":"En recherche d'un restaurant mexicain nous avons testé celui-là. Plus tex-mex qu'authentique mexicain et clairement une chaîne de resto. J'ai été déçue.
Finalement ok pour y manger si on a vraiment faim ou peut-être avec un groupe si on veut focaliser sur l'ambiance plutôt."}
{"text":"Les plats principaux étaient corrects mais le service était, lent, mal organisé et il y a eu plein d'erreurs. De plus les desserts n'étaient pas bon, la crème glacée frite était liquide. Si je pouvais donner 0 étoiles je le ferais."}
{"text":"Service: 3 stars
Décor: 4.5 stars
Food: 1 star

Had the Cochinita pibil and it was not at all good. The meat was very bland, and was served with a basic coldslaw that  makes supermarket coldslaw seem like 5 stars. No chips were served at the beginning of the night like is usual for Carlos & Pepe restaurants. 

 We were a group of 3 people and our food arrived cold, which was really uncool.

I'd say, this place is a great place to get a drink in the Centropolis but I won't be eating here ever again."}
{"text":"Donc, cela fait 3 fois que j'y vais depuis que c'est ouvert. Des supers cocktails pas cher les soirs de semaines entre 4@7, incluant la bière! 

L'ambiance est quand même bonne. 

La nourriture est passable, mais rien d'extra selon moi.

Par contre, les serveurs sont super sympa et c'est un bel endroit au centropolis. J'ai beaucoup aimé la déco.

N'oubliez pas de réserver, car les line up pour une table sont inévitables 

Je mets 3*, car ils n'ont pas de permis d'alcool pour leur granfe terasse. Ce qui enlève beaucoup de point à ce nouvel endroit. Esperons que l'été prochain ça ne sera pas le cas!"}
{"text":"Terrible experience. 
Waiters simply do not care, maybe a bunch of students that were hired for summer jobs. 
Service was very slow. 
Someone forgot my order! So my family received their meals, that took 30 minutes, but when food was served my order was not there. After asking the waitress my order took 25 minutes to arrive, so waited almost 1 hour for food.
I ordered shrimp tacos, one was not completely peeled, have you ever had that experience?
At least we were not charged for the chips and salsa ($3.00)."}
{"text":"La Tête de Scorpion est un incontournable! Il FAUT en prendre une si l'on va chez Carlos & Pepe!

Pour le reste, j'ai très bien mangé et le service au bar était très rapide. J'insiste sur les mots ''au bar'' car la raison pour laquelle nous nous y sommes installées était que le service à notre table  était beaucoup trop lent. À voir les autres commentaires, cela semble être chose courante. Je recommande sans hésiter pour une soirée à 2 au bar, mais pour un groupe je serais sceptique. 

Ah et la déco, WOW très belle place!"}
{"text":"Really awful service followed by lukewarm, tasteless food. 

The decor is nice but there is nothing else good about this place. 

I would never go back or recommend to anyone."}
{"text":"First time here. We were four on a friday. We were lucky to arrive early. Quite popular. We had the fajitas and burritos. I find the menu limited. I usually go to the other mexican chain. The rice was tasty but the burrito seemed small. The fajitas were appreciated but those who ordered them. It was fine . The terrace is well located."}
{"text":"We were a table of 8. Host didn't want to seat us outdoors even though there was room. Apparently, they prefer to have several smaller tables."}
{"text":"We went to satisfy our taco craving. They stated its 1$ on sunday so we we went crazy. Turned out to be 3$ for the beef. We paid $50 for our night. We could have had a much better dinner elsewhere for that price. Manager said that the waitress should have told us the 'fine print'. He was too busy on the phone to address us. Needless to say, we'll never step foot in this chain again."}
{"text":"Cuisine americano-mexicaine. Contente qu'il y ait enfin du mexicain à Laval. Rien de gastronomique mais agréable une fois de temps en temps. Les daiquiris virgin... Ou ......double... YUMMY!!!"}
{"text":"Waiter was nice but the food itself was unbelievably gross. The only thing we enjoyed was the order of the calamari. Disappointment."}
{"text":"Very mediocre food and worse drinks. The flavour is just not there. I went on a night of Grand Opening and it really was not a good experience with lousy annoying French DJ music. Seated next to a rowdy group of teenagers in the corner doing tequila shots and just plain obnoxious. Margaritas are bland and weak and fajitas were flavourless and very generic. I don't think it is possible to have good Mexican food in Quebec."}
{"text":"One of the best Mexican food places in Laval (Center-O-Polis) with excellent ambiance and friendly staff.  Check their daily specials.  It just so happened that I went twice on Wednesdays.   Fajita's were less that $10 and they were delicious.  Highly recommended place."}
{"text":"I was surprised about that place, from some of the reviews i did not have high expectation. However Thats a very good Mexican restaurant. My first visit , it was really busy but we had a table in 5 min. The waiter was very efficient and professional .  Had several drink , some to my taste some not. I took the mixed fajita, huge portion, very tasty and very well presented. My second time was with my kids, our waiter was very helpful, efficient and  explained the dishes as accurate as it could be. I had the steak tacos . The soft ones were simply delicious, spicy as i liked it , i did not like the hard tacos (usually not my favorite). My wife took the steak sandwich , she enjoyed every bit. Kids meal were huge (as an adult portion) we took calamari to share but was spicy for the kids , no complain from my part nor my wife.  I love the decor, very nice  murals. Dishes are fairly priced for the quantity and we did not pay for any extras . I would definitely come back and i highly recommend this place"}
{"text":"I don't understand why they would change their chip salsa (which was a sweet salsa) to a extremely spicy salsa. As well they changed their great rice to a very salty one. And they no longer accompany their meals with the tiny salad. I don't understand why ruin something that was working so well."}
{"text":"2 stars for service, 3 for the food and for 4 for decor.

This Carlos and Pepes is brand new, decorated with beautiful colors and ecletic knick knacks. I loved the old wooden doors framed on the wall, the surf board type counter, barber chair, and flip flops hanging from the bar.

However, I was not impressed with this new opening, the entire staff needs to get their act together. Service was extremely slow. We had lunch around 12:30 on Friday August 7, place was only half full, we waited 40 mins before being served water and chips/salsa, which we had to ask for.
Once the food came along, the portion looked tiny and not what we had in mind. Apparently, their \"enchiladas\" are just small, soft tacos folded in half. They are not the generous rolls you're supposed to get like EVERY SINGLE picture on Google shows what a true enchilada is.
Also I found a piece of bone that was an inch wide in my beef. After complaining to the manager, he had to give us a discount on our meal.

Half the stuff was missing on our plate, we were supposed to get salad, beans and sour cream, it all came separately and despite ordering the exact same thing, my bf's dish had an extra touch of garnish, mine didn't. That just goes to show how there's lacking attention to detail in the kitchen.

Food was good, although if I compare it to their biggest competitor, I've been to all the 3 Amigos locations many times, service is always fast, they turn tables around quickly, food is cheaper and tastier. Plus, they are also opening up in Laval soon!

Won't be going back to Carlos anytime soon - give them time to establish themselves."}
{"text":"Surprisingly, we stumbled on this popular Ste Catherine restaurant un Centropolis in Laval. The deco was cool. Choices a plenty with respect of meals. We ended up getting hot plate to make your own Taco and spicy honey garlic chicken wings. Ordered red wine of course while I drank a Corona; We ended the evening with ice creams with caramel syrup and fried cheese cake in a casadilla. The Good: again choices for the whole family. A great affordable choice from the many restaurants in Centropolis. The Bad: though the deco was nice it looked more like your typical sports bar. It also played modern music. The Ugly: well we found this place by accident because of the snow storm. So there is a silver lining. Tip: Get their best sellers like we do to get the best bang for your buck. Affordable prices$$-$$$"}
{"text":"Pretty good tacos, friendly staff, service is fairly quick too (~5 mins) if not busy.
Carlos & Pepes Sunday $1 taco restrictions as of 2016 Summer: - it is eat in only, have to order a drink ($2 cheapest are coffee/tea), and you have to order 3 min tacos. That exceeds $5 with tax, but at least they don't care if you bring your own takeout boxes ;)"}
{"text":"This was the worst food and service I received in my life. Took over an hour to get our drinks out and another hour and a half for our meals. Seems like the servers were out hanging with their friends at the bar other than waiting on their tables. 

The worst Mexican in Quebec. Stay away"}
{"text":"I was not sure if I should give it 2 or 3 stars. I ordered the fajitas which were OK but everyone else's were bad. They had no rice so they gave french fries??? Mexican with fries??? WTF??? My wifes food was horrid. Service was just OK and I did not pick this place to eat and will not be back.  Just go down the road at Quesada Burritos & Tacos for a fraction of the price and you won't go wrong."}
{"text":"My family is vegetarian and the food was amazing! We found our new fav Mexican food place in Laval! The music was loud and the place was happening. But there are booths available where a family can sit and have an amazing meal away from the speakers. Was disappointed with the spiceness level of their table sauces (4 kinda) and had to pay $1.50 extra for the hotter sauce. However the spicy(on request) vege burrito was delicious! My soft taco with cactus and avocado was savory and the spinach and cheese enchiladas was zesty! Will definitely come back."}
{"text":"Bel endroit et belle ambiance. Service très sympa. Première fois que je mange à l'extérieur. C'est calme et agréable : la nourriture est savoureuse et les assiettes sont généreuses. Je n'arrive jamais à tout manger ici, alors je passe les desserts chaque fois. :-)"}
{"text":"petite découverte mexicaine. tres bien et bien mieux que la majorite des restaurants mexicain que j'ai essayé. beaucoup de choix, tout est succulent.

J'ai essayé le burritos grande. Bien garnis, assaisonnement à point, Bien cuit et bien monté.

Mes amis ont pris les tacos avec tortillas dur. Ils ont vraiment aimé et ça avait l'air succulent.

En entrée des jalapenos garni de fromage gratiné et pané. Cela ressemble au bâtonnet de fromage mais avec un jalapeno au lieu d'une pâte. C'était Bob.

Bref, Rien de comparable aux 3 amigos ou tout semble avoir été fait très rapidement dans la cuisine, les repas sont bien préparer et ce n'est pas écraser sous une tonne sauce ou de fromage qui goûte rien."}
