{"text":"One of the better Mexican restaurants in town but service was a little slow. Reasonably priced and server was knowledgeable about the menu."}
{"text":"Great customer service and the food is even better! Very authentic experience. I eat here every week. Friday night they have bands and Karaoke. It's a really phenomenal. The only issue I have is that before I became a regular some of the servers would shy away because of the language barrier but as I've said before this place is fantastic and no matter if you speak Spanish or not they will take care of you like a member of the family. Also I'm fluent in Spanish but they will bare with you if you want to practice. I love this place!"}
{"text":"Worst food ever. Asked to talk to manager and the waiter said \"he's busy\"  how do you mess up cheese enchiladas?"}
{"text":"This is my FAVORITE Mexican restaurant. It's authentic Mexican, people! The service is always wonderful. I typically eat here twice a month and have yet to be disappointed in the past 2 years. I LOVE the carne asada tacos (wonderfully flavored steak). The salsa is fresh and yummy to go along with the chips while you wait for your food. It is an older building and is usually quiet when I go at lunch. The Mexicans eat there, so you know it's good!"}
{"text":"Fantastic Mexican food.  Great value, awesome salsa, and friendly staff.  Highly recommend."}
{"text":"Authentic Mexican dishes, and very reasonable prices. My best friend took me here for the 1st time and I am hooked. The manager even came and introduced himself (Daniel) and a nice demaeanor. We ordered the Steak Fajitas and a few beers. We also ordered a mixed drink and the bill was very reasonable. Full generous portions, and they brought chips and 6 or 7 different salsas to start off with. I was too full. A new fan!"}
{"text":"Yummy. I really enjoyed my shrimp fajitas for two days, and my husband really liked my cocktail with his food. We live nearby so we will be back again and again."}
{"text":"We were heading home from Ikea, and starving for Mexican food.  Looked this up on Yelp, stopped for lunch, and we will go back again and again.  Chicken enchiladas mole, two different kinds of tacos, and perfect guacamole.  Oh, and the folks working there are super friendly.  Highly recommend this place."}
{"text":"Pretty legit Mexican food, the servers are nice even though a lot of them aren't good with speaking English. I found this place through my DT Local function in my DT app where I can dine my way to vacation with participating restaurants. I was super excited once I pulled it up on Yelp and saw that the star rating and reviews were great which I didn't question as my DT membership is Top Notch. 
\"message me for details\"

Back to my review, I first visited his place in the a.m like 10:30am for a meeting to share DT with someone. They had just opened and boy was it freezing cold inside and no sign of heat anywhere. I was wrapped in my sweater and snugged in a booth awaiting my appointment to arrive. I figured since I had another appointment at noon it would warm up by then BUT NO. I almost ignored the amazing Salsa, warm chips, various dips, etc.. due to the cold and was planning not to return until my appontements ordered food and ended up licking their fingers as they signed their apps. I ended up scheduling my next meeting here again the following week at the same time and this time I ordered food and guess what ? It was warm inside , the food was so yummy and fresh and again the service was great. I'll be back, let me know if you want to meet me there"}
{"text":"This one didn't really impress me all that much. It was nice that when they brought out the chips as a appetizer they bring about 4 different sauces for your dipping enjoyment but it just seemed like none of them had much flavour to them. I also had the lamb barbacoa and shredded chicken but the lamb tasted a little too gamey for me and the chicken was pretty par for the course. The re-fried beans were ok as well as the rice. There again. All of the food just seemed kinda bland to me without much flavour with the exception of the lamb which was gamey (wrong side of good flavor). 

The service was adequate and the bill was reasonable. The inside of the place was pretty run down though so it doesn't give off a sparkling clean aura. I'd recommend skipping this one and just hitting azteca or something else similar."}
{"text":"One of our normal take out joints. We will occasionally eat in. Love all the different salsas you get when you eat in. The authentic carne asada tacos are the best here. I also love their tortas. Food is always tasty and fast. Venture out from your regular \"American\" Mexican foods you would normally order. Their authentic foods are great!"}
{"text":"Carnitas Guanajuato is a very authentic Mexican restaurant. I decided to try them after driving by them so many times. We ordered the barbacoa, cheese enchiladas, and pork skin taco's. The food did take a long time to arrive even though it was not busy. It was actually comforting because it meant the food was made to order and not pre made and microwaved like most Mexican restaurants. The barbocoa was made with lamb and was super amazing. The flavors were truly divine. My wife had the cheese enchilada, not really my type of Mexican food but it definitely was loaded with cheese and she loved it. The pork skin tacos were good but not what I expected. I was thinking the pork skin would have some crisp to it but it was soft. It was definitely lacking in texture and appearance but not in taste. I probably would not order it again, but definitely something I am glad I tried. I would rate the food at four stars but the service was between a one and a two. The servers were not friendly and welcoming. They were also extremely slow even though it was not busy while we were there. Everyone has bad days though and I am excited to go there a second time."}
{"text":"We were looking for a Mexican restaurant and we found a gem! 6 salsas and chips it was AMAZING! Great service and good prices! Totally recommended"}
{"text":"I have eaten here twice.  This is a great place for \"authentic\" Mexican food.  Their menu boasts the well known dishes, but also gets into some of the more \"specialized\" items...many of which I'm a little scared to try.  I think another good sign of the authenticity is that every time I've eaten here, I have been the only non-Hispanic.  The chorizo is great!  The service is a little slow, but very nice!  I would recommend."}
{"text":"Great food and portions. As many others have said,  you get five salsas of varying heat. I had the chicken mole enchiladas--my first time. They were so, so good. The mole sauce was rich and tasty, the chicken very yummy too. 

My vegetarian husband had veggie fajitas and they were really savory. We're used to him getting just peppers and onions. This mix had onions, peppers, potato, carrots and mushrooms. Very filling. 

Our waitress was so kind to explain the salsas and the veggie options to us. She told me her English wasn't great but she was terrific and she spoke perfectly. 

We'll definitely go back!!"}
{"text":"This place is great! Super authentic, amazing food, great staff and some bomb horchata!! Will definitely return!!!!"}
{"text":"Decent mexican restaurant, pretty much typical dishes you see at any other one. You do get a nice variety of salsas and chips when you come in at no cost and the food was pretty good for the price. The server could have been little more attentive, but overall it was a positive experience."}
{"text":"The name says it all CARNITAS (fried pork)! Yum!!

Long version: 
I probably wouldn't come here for anything other than carnitas. They're Carnitas are great and very authentic! Carnitas tacos, carnita tortas, or carnitas by the pound - you can't go wrong! Can you tell I like they're carnitas? 

On busy days when we don't have time to cook or when we have unexpected company we order carnitas by the pound! It's great for around $8 you get a lb of meat, tortillas, salsa, cilantro and onion! Plus you can pick it up right away, without any wait! 

Short version: 
Try the carnitas they won't disappoint!"}
{"text":"I want to like this place for the FIVE count 'em FIVE bowls of delicious salsas they bring out with the chips. But the food is just OK, service hit or miss (have visited several times) plus the margaritas are some strange nuclear green pre-mix. There's better out there, unless you just want a shot of tequila and to nosh on chips, then you're in the right spot."}
{"text":"Guys if I could give ZERO stars I would. This was my first time here and it will be my last. I brought my mother and nephew for a late lunch and it was clearly not busy. We ordered sopes. I small round tortilla with multiple toppings. You would think it would be fast service since it was clearly empty and we chose a rather simple easy dish. Yet it was not. It took over an hour to get our food. The server didn't even place the entire order so when our food came we were missing my nephews dish and she had the nerve to ask, \"does he still want it\". Obviously he does since he ordered it and otherwise would have nothing else to eat. She came back 30min later and still had not put in the order. It was ridiculous. She apologized and gave him a lollipop. So I guess he would eat a lollipop instead of the food he ordered? Definitely not okay. To recap: The food was cold and the service was horrible."}
{"text":"I absolutely love this place!!! The food is authentic not to mention it taste outstanding!!!

The staff is somewhat bilingual but speak enough English to get your order, lol which I love practicing Spanish with them. 

Sometimes the service is slow but it's well worth it because the prices are more than reasonable for the amount of food that you receive and the margaritas are very good."}
{"text":"This is hands down authentic! We came here more accidentally but what a great surprise. Firstly, they serve you 5 salsas with your chips, all beautiful and fresh. We ordered the mole and my husband swears hands down best ever... then we found out the owners mom comes from Mexico a few times a year to make it in batches!! You can also buy it by the pound! Fresh corn tortillas and deveined shrimp round out what makes them a solid 5 Star. Everything was fantastic with wonderful helpful service, and incredibly competitive prices... chicken mole enchilada $9.50 ! Love these guys!"}
{"text":"I am from Arizona and have found it hard to find authentic Mexican food in Charlotte. This place though is the real deal. You have to get the Tacos or carnitas.  The selection of salsa is also a nice touch."}
{"text":"One of the best hidden Mexican restaurants in town.  Great friendly service...and food is always hot and delicious.   Can't beat the variety of salsas they bring out as soon as you get there!"}
{"text":"Worst carnitas that I ever tried in my entire life, worst menudo.. so disgusting. The attention of the waiters were sow slow and inefficient. I'd Never come back again."}
{"text":"Authentic taste.  Great service.  Opens late on Sunday.  Well definitely make it my regular spot for Mexican food."}
{"text":"Excellent food!  5 salsas to start your meal and wonderful carnitas.  Get the carnitas if it's your first time!  

Also excellent micheladas and the margaritas are stronger than they appear. Can't wait to go back again soon!"}
{"text":"The best thing about this joint is definitely the amount of salsa they bring out when you sit down. They give you chips, of course, but then you get four, five six - I lost count - salsas to go with them. It's a veritable buffet of salsa. As has been mentioned, none are earth-shattering, but it's nice to have something other than a simple watered-down salsa to go with your chips.

After that, you get fairly standard mexican fare, delivered by generally helpful staff at a very, very slow pace. In fact, were it not for the chips and the extraordinary amount of salsa, it might be far too slow. Though I like mexican food, and don't mind it taking a while to prepare, because it means they are generally working on something tasty, in this case it was like they forgot we were there and had to remember what we ordered.

By the time they delivered it, we had eaten so much of the chips and salsa, we were hardly hungry for the food, but we did eat it, and it wasn't bad - just not decent enough to make us want to go back. In the end, eat we did, and if nothing else, I can say without a doubt that...

I ate it and I didn't die."}
{"text":"Let's be honest: any place that brings you three different salsas with your chips is a winner. 

This place is huge. My latest adventure here was on Saturday. There were guys drinking at the bar, glued to a soccer game. Families enjoying lunch together in the dining room. Spanish songs invading the entire restaurant from the Touchtunes jukebox. 

As Bianka M said, this is some pretty legit Mexican food. Your meal starts off with chips, a bowl of limes, red salsa, a spicier & thicker almost charred like salsa, and pico. We started with both guac and cheese dip and then got way over ambitious and each ordered a you pick three meal. I say over ambitious because after we ate all the chips and #allthedips, neither of us were that hungry when our meals came. Don't worry, we ate through the pain. 

This place has great drink specials every day, both beer and cocktails. Mondays, Thursdays, and Sundays house margaritas are $5. There's a $2 beer special of some sort every day except Wednesdays (mugs are the special that day)."}
{"text":"The only thing I would go back for is the chips and 5 salsas other than that everything sucked!

Let's start with the service. The young lady who served my food was.... No words can explain. It seemed like she was trying to get me out of the restaurant as fast as she could. She had no knowledge of the menu. Was very rude when I try to ask questions about my order. When I asked for my bill she said \"wow you ate fast\" and I replied \"yes I only have 10 minutes of my lunch break left\" I felt like asking her for my tip back! Does it matter if I ate fast or slow? 

Food: the food came out super fast, but it made me wonder how they could bring out the food so fast, was it already made and they just popped it in the microwave? Anyways it was bland, it lacked flavor."}
{"text":"I eat here on my lunch break every once in a while. For the price of the tacos which are 1.50 each it is a great lunch if your in the mood for it. It does take a while to get your food and i have had the enchildas from here and did not like them at all."}
{"text":"Went there for the first time tonight with my wife.  She was sure that 10:30 was not too late for a restaurant and demanded that we just walk in.  We did and the folks here said nothing about being closed and prepared excellent Carnitas with mole and rice.  It wasn't until getting into Yelp that I realized that we went in after they were closed, or in process of closing. I can't express how amazing it was that they didn't mention anything and were gracious, friendly and fast.  The food was great and we will definitely be back.  :)"}
{"text":"Authentic Mexican food, great menu, drinks, and great service. We will come again and especially bring friends and guests to try it out."}
{"text":"This is the best and most authentic Mexican food restaurant in Charlotte! The food is awesome, the service is good! We have been coming here since it opened and have never been disappointed! If you want REAL Mexican cuisine not the crap that the yuppies are eating elsewhere, come here for a no frills, honest to goodness authentic Mexican dinner!"}
{"text":"Terrible food. Terrible service. Clean your entrance door windows. No one in the building shoulda been the first red flag. Our waiter didn't get orders right... bad."}
{"text":"Great friendly service! And the food was awesome! The waiters and staff we're very helpful with the menu items and the food came out and a fast manner!"}
{"text":"the mixed fajitas are a smash hit!! service was fast and sizzling arriving to the table! will definitely come back here!!"}
