{"text":"The owners are very welcoming and friendly. The servings were plentiful. The food was traditional and super tasty with less salt and sugar and most important, it's fresh. We were informed of other services they provide such money remittance, catering, place for parties and dance classes.  We would definitely recommend this restaurant to everyone.  Try their halo-halo, it's the best! The traditional halo-halo of Filipino!"}
{"text":"I drive by this place often but never went in until today.  The food tasted great, especially the lechon kiwali.  They have great variety and everything is fresh.  Must give this place a try when you're in the area!"}
{"text":"It's a mom & pop run restaurant.  All classic Philippine  dishes which change daily. The owner is friendly & aimed to please"}
{"text":"TRY THEIR HALO-HALO! It was superb.  I go here a lot of times with my mom since we just live nearby. A very good place to go if there's no filipino ulam in the house  The owner and her husband are very friendly. What I like most about the place aside from their variety of dishes is their mini grocery. There are some filipino chips (CLOVER!!!) and products. I always ask my mom to get me the calamansi soy sauce. Sorry I forgot the name of the brand.  All in all, this place is one of my favs."}
{"text":"Was working in the area and had pork sisig and chicken afritada ..  sisig was good although a little oily .. afritada was also good even though the chicken was dry cause they were running low on sauce .. gonna come back when in the area"}
{"text":"Looked this place up today while in a course nearby.  Surprisingly good!  Excellent service.  Very Clean!  Portions are good for a reasonable price.  My beef sinigang was lean yet tender and my pinakbet was quite tasty.  The owners came by to check on me and had a great conversation.  They mentioned that they also deliver in GTA west.  Definitely worth a try!"}
{"text":"I had been driving past this place for a few months when I finally made in today to check it out.  My parents are Filipino, and while I was born and raised in Canada, every once in a while, a girl wants a taste of \"home.\"   The husband and wife owners were lovely - the lady (who I assume is Carolina) was cheerful and smiley and reminded me of one of my Aunts and I was quite impressed with her husband, who, despite, not being Filipino, pronounced food titles in (obviously not his first language) almost perfectly.  They knew I was a first-timer into their shop and were very attentive. I picked up a bangus (marinated milk fish), appritada (chicken) and a crispy pata, and it came in a combo with either rice or pancit (noodles). I also ordered an extra fried fish on the side and the whole thing cost me $13.00, which fed both of my parents nicely. They approved and have already studied the menu for the next time I plan on going.   They also have a decent-sized seating area, plus a small Filipino grocery aisle. Nice place. I bet it does well on the weekends, as it is right across the street from a Christian Church.   I'll certainly go back - the couple was sweet and very welcoming and hey, the food tasted like home."}
{"text":"It's been a month since we ordered lumpia from them. The service was wonderful! They even gave us tips on how to keep the food crispy. We also ordered on a holiday (Canada Day) and they were still open!! The food itself was delicious! We served it at a multicultural BBQ and all of friends enjoyed it. Great place to order from and will be visiting again to dine in!"}
{"text":"Delicious food! Generous portions! Friendly staff! My go-to place for Lumpia Shanghai (Spring Rolls) for party trays! :)"}
{"text":"After hearing all of the positive reviews, my partner and I, who just moved to the neighbourhood, were looking forward to trying the Halo Halo at Carolina's Cuisina. This evening we took our first walk with the dog, and made sure to leave in time to stop at Carolina's Cuisina - something I thought might have been a nice new routine.   The \"Open\" sign was on the door and a lit-up red \"open\" sign was also in the window. The gentleman at the counter was very welcoming. I asked him if it was too late to order a halo halo, he confirmed that was what I wanted, that it was okay, and went to begin making it.   Suddenly an older woman, who I am presuming was an owner or manager, came out and brusquely stated \"it's 9 o'clock\".   The store had two open signs at the storefront, all lights were on, the gentleman had confirmed they were open, and my phone clearly stated it was 8:51. At that point he told me there was not enough time to make one and to come back tomorrow - and the woman went back to watching the Olympics on the mounted television.  There was lots of fried food at the front counter, which I now presume was the only reason she was keeping both \"open\" signs up - she could sell a halo halo the next day, but not fried food. Treating your customers as valuable and gaining recurring local customers would have been a much more profitable strategy long term. I will not be back."}
