{"text":"My family were great fans of Negroni, we went on a monthly basis, so we went back to try the new version Carpano and will not ever go back the excellent paninis are gone from the dinner menu leaving a fairly pedestrian bistro menu.The appetizers were very good but the pasta courses were tasteless and table service was terrible. We will never go back again...too bad they changed chefs and wait staff....Negroni used to be my favorite spot on college street."}
{"text":"Place is stupid good for the price. Cheap house wines. Nice cocktails. Great Panna Cotta. Have tried three pastas (carbonara, spag and meatballs, and a rigatoni with lamb and chilis) and would gladly order all of them again. Get in here quick! Give this place the love it deserves."}
{"text":"The name may have changed from Negroni, but the food is still fantastic; however, I don't think paninis are offered for dinner anymore (I didn't ask, so can't confirm this).   Instead of paninis, Carpano now offers a more extensive Secondi, and it looks like they've changed up their appetizers as well. I had the rigatoni with beef cheeks, and a bit of gnocchi. The gnocchi isn't listed on their website, so it may have been a daily special.   Both dishes were very tasty. The gnocchi was freshly made, and topped with a delicious tomato sauce and olive oil. The gnocchi was light and fluffy, not starchy. The only downside was that it wasn't very filling. On the other hand, the rigatone plate was a hearty dish of tender beef cheek and al dente cooked rigatone. The pasta is topped with a bit of fontina and served with what I think is the braising liquid from the beef cheek . The beef cheek is so tender, you can easily pull it apart with your fork.   Fortunately, Capapno still offers their wonderful homemade ice cream for dessert. We had half chocolate, half peanut butter ice cream, and it was fantastic.   Definitely check out this place and their new menu. They still serve a ton of paninis for lunch according to the website (http://carpano.ca/dinn...), and their new secondis look mighty fine. Also, the prices here are still very affordable."}
{"text":"I'd never been to the excellent Sidecar's sister restaurant, Negroni, but figured that its having gone through a recent reworking to emerge as Carpano gave me an excuse to check it out - an open, clean space right on College with a small patio. The lunch panini that many Yelpers have talked about remain on the menu, but they are absent from the dinner selection, which now offers pastas, risottos, grilled meats and crudo (raw plates.)  Having been very impressed with the drinks at Sidecar, I made sure to order a cocktail (a mojito) to start dinner off with. And much like Sidecar's, the cocktails here are very well made (though there's not as wide a selection.) The mix of bite, freshness and sweetness was just right for a hot summer evening.  I ordered the tuna crudo for dinner, while my girlfriend had the lobster risotto. The crudo comes in a small portion of five or six sashimi-like slices of fish brushed with a bit of oil and lightly salted, served with little cloudlike puffs of pureed white bean and a caper/pepper relish which was quite good. It was pretty light as far as dinner dishes go, but there was a delicate, elegant balance between its flavours.  Having tried a bit of the risotto, my assessment was that while the lobster part was excellent - firm, meaty, buttery and without the usual shellfish hassle - the rice and sauce were not as good. The rice was overcooked for my taste and there was too much sauce. My girlfriend agreed.  Let me be clear about something - you absolutely must try the ice cream at Carpano (though the other desserts sound nice too.) It's so good that the next place they open should open a gelateria. They're currently offering three flavours - a raspberry sorbet that would do a Prince song proud, a chocolate flavour that's semi-creamy and dark, and a velvety smooth, rich, absurdly awesome peanut butter flavour. You can mix and match 2 (generous) scoops of the three, and there's no wrong way to go about it - either you get the experience of a sweet/tart tartufo, a melt-in-your-mouth Reese's cup or, perhaps most impressively, a frozen PB&J with amazing texture contrasts.   Much like its sister restaurant, Carpano delivers well-made modern Italian food at a reasonable price in a nice location. The drinks are a bit pricey, but worth it, and the dessert is wonderful. I'll have to come back for panini, though."}
{"text":"Having gone to Sidecar for dinner on Tuesday, I knew I eventually had to try out Carpano's dinner menu. I went this Friday night, and once again, I had a great time. You  just can't go wrong with how homey and cozy this place feels, not to mention it's never busy. Loved the Fellini movie playing on TV.   The drinks were great, my winter mojito was super strong-- I felt it almost instantly. Their wine prices were also very reasonable. I was sad that they didn't have the beef carpaccio app, so we tried the bruschetta and the albacore tuna. The bruscheta was not your typical, but it was so good! Loved the added touch of zucchini on top. The albacore tuna was delicious, and so were the pieces of potato on the side. I couldn't help but order a panini because I love them that much. We tried the blueberry pannacotta for dessert and it was light and creamy. Can't wait to come back again."}
{"text":"Carpano used to be Negroni is closed!  http://www.postcity.com/Eat-Shop-Do/Eat/November-2011/Carpano-better-known-as-Negroni-has-closed-sold-to-new-restaurateurs/"}
{"text":"Carpano is the kid sister of the popular Italian resto Sidecar which only a stone's throw away down College street. Carpano used to be known as Negroni but with a new chef and expanded menu comes a new name, and another allusion to the owners' enthusiasm for cocktail culture.  Like Negroni this place is never too busy, even on a Friday night. It seats about 30 and is softly lit though usually buzzing with voices and atmosphere.  We popped in and were easily able to snag a table for four. We started off with some fine cocktails. My raspberry mojito was excellent. I took a sip of my date's grapefruit juice and prosecco combination, and was definitely an inferior choice to mine. I felt validated. Superior even. They have an excellent selection of beer and wines also.  They have pastas, risotto, and panini on the menu as well as some enticing appetizers. Their paninis are the real star here; at lunchtime it's pretty much the thing to get. And dinner they have fewer sandwich choices, but their salads and pastas are nothing to sneeze at. I was the only person at my table that didn't order a panini that night, but I think I did pretty well with my duck liver pate (served in a jar!), pear jam and crostini. Yum.  Carpano is an excellent place for a late night snack, a date, or drinks with friends. I highly recommend.  Obligatory Title Pun: Cut the CARP.  Menu Readability: A long and elegant card.  Need to mention: Home made ice cream for dessert.  What this place teaches me about myself: I'm a sucker for duck liver."}
