{"text":"Let me begin by saying that this review is based on the summation of 6 visits to the restaurant randomly over the last 2 years. As such, it is not a review based on a single expereince, but more a review of the \"average\" Walima experience.  Pros: The atmosphere in the restaurant is amazing. I love it. The food tastes fantastic. I love it. The prices and servings are reasonable - some might say the servings are too small//overpriced - but I think they are fine, and for the atmosphere and taste - TOtally worth it.  Cons: THIS IS WHERE IT ALL GOES DOWNHILL. :(  - Even on a busy night there are, at most, two people working the restaurant floor - service is quite slow... but you don't mind it so much because you are enjoying the ambience of the restaurant.  - The staff are INCREDIBLY RUDE!!! They are always the same staff and like I said, I have been there six times, so this was not an unfortunate fluke of bad luck. IT HAS ALWAYS HAPPENED. I understand that they may be understaffed and that financial viability for a small, independent restaurant in these economic times is difficult. HOWEVER, that does not validate what has happened (ESPECIALLY THE LAST TWO TIMES I HAVE BEEN THERE): Asking people to make sure they order at least one entree per person to keep this beautiful restaurant afloat is understandable. I have taken people there in groups because I love the restaurant so much, but my guests (to my utter shame and embarassment) were nothing-short-of THREATENED to order entrees because if we did not, we were \"COULDN'T EXPECT TO JUST SIT THERE IN THE NICE PLACE AND NOT ORDER AN ENTREE; IT IS AN INSULT TO THE OWNER\" ( paraphrased the words of the Moroccan gentleman there) He went off on a tangent rant, even after we had expressed our understanding and had already decided on the main dishes to order. - When we ordered our meals in groups, orders were frequently made wrong, and they ran out of things such as rice, or pita, or couscous and simply replaced those in individual orders as they pleased. We did not see it fit to try and fix that from our shock and fear from the tongue-lashing we had received earlier.  My last visit there was in mid-May 2011. Finally having been fed up with their service, I took a vow to never go back, and even tried to express my concerns with the manager, who simply brushed them off casually and chalked up the rudeness to the fact that the gentleman that was consistently rude to us was Moroccan. How do you like that??? I was in awe. Never have I ever seen such a fine restaurant stink in terms of rudeness.  Used to go in groups of at least 5 to 15 people. I consistently brought them good business, and planned to continue, until then. I am never going back and am now actively discouraging anyone else to, as well."}
{"text":"Nice place, pretty good atmosphere, pretty good service, if you're going there on a week night not too many people, pretty good if you wanna have a romantic exotic dinner, the menu doesn't really have too many things so i am sure you won't spend too much time looking through it, if you like sweeter stuff order their Sahara Chicken Bastilla, and if you like savoury stuff you may wanna order Lamb Tagine it's the best they have. Whatever entree you order you may wanna order mint tea and harira soup, they're pretty good. I give it three stars, if you have to have better and more expensive experience you should go to Sultan's tent, and they do have the belly dancing too."}
{"text":"This place is absolutely delicious.  The service is lovely, chicken tagines are well priced at $15, hearty and well cooked.  The chicken was juicy and had been simmering with the other ingredients for some time.  The appetizers are meals on their own - the Moroccan salad, sautéed spinach in lemon and hummus are all yummy! Don't forget to have a mint tea and a sweet dessert!"}
{"text":"Insanely delicious! I am so glad this little Moroccan cafe moved into my neighbourhood. Sorry Danforth folks, you lost a fantastic restaurant. I finally had a chance to try them for the first time and ordered the Lamb Apple tagine and the Tfya Couscous. It was mind-blowing tasty. The lamb was fall-off-the-bone tender. I was hesitant to order the lamb at first since I've had unsatisfactory lamb in the past. I'm so glad I tried it. The combination of fruit, spice and savory of each dish was superb. I loved how the fruit was arranged on the couscous. I'm talking whole figs, prunes, nuts artfully composed on a base of caramelized onions. I tend to prefer the fruit/nut dishes over the savory/veg...   The guy who runs it is super friendly, the atmosphere is nice, the decor is colourful and cafe-simplistic with Moroccan accents. They start opening for lunch this week and are closed on Mondays. No liquor license at the moment, but having mint tea is all part of the experience...  Since I am lucky enough to live across the street from this gem of a cafe I don't have any issues with parking, however I know that it's very limited in this area. There is a GreenP off of Brooke St, a very short walk to the cafe. Accessible by TTC bus from Eglinton or York Mills stations."}
{"text":"We spent 3 weeks touring Morocco last year so when we read previous - mostly positive - reviews about this place we decided to give it a try to see if it would bring back all those good memories. We were not disappointed.  Its small and cosy, and like at least one review noted, it seems that there are only two people serving front of house. However, unlike that review, which I think was for the old location on the Danforth, we found the servers to be pleasant, friendly and knowledgeable and even though the restaurant was full, I would not say they were slow ... they seemed to work at a steady pace and we didnt have to wait overly long for anything.  The food itself was obviously not exactly the same as we experienced in Morocco, but it was pretty damn close ! We started with a mosaic platter of dips which were very nice, then for mains I had Berber Lamb Tagine with Couscous while my wife had Sultan Lamb Tagine with rice.  The lamb was very nice and falling off the bone the way it should be and the couscous was decent enough. My wife also enjoyed her lamb and rice. I rounded off with a Moroccan coffee which was also very nice. all in all, an authentic experience and I will be back sometime soon to try the Pastilla :)"}
{"text":"I've been here 3 times. Not a lot of competition, so this is possibly the best Moroccan restaurant in the city.  The service has always been friendly and the food always tasty. I would have to suggest that the chicken in the bastille be less dry. Also, last time one of the dishes I ordered was supposed to contain butternut squash but unexpectedly there wasn't any- it would have made the dish that much better. I would still go here whenever I want tasty Moroccan. 3.5/5 stars"}
{"text":"Came here for the first time and it was wonderful for the following reasons:   1. The food was excellent. I had the tagine with root vegetables. It was so delicious and healthy. The portion size was very decent. I love how its served in the actual tagine dish. Very nice presentation and very authentic. Don't  forget to have the Moroccan mint tea. Prices are very reasonable too.   2. I love the decor of the restaurant. Beautiful Morrocan lanterns and furniture. I couldn't stop admiring.   3.  The service was excellent. The server was friendly and attentive.   Will I go back? Absolutely! It is now on my list of favorites. This is also a nice place to bring a date. I think its romantic. If you have not tried this place, you are missing out. I can't  wait to go back. Plus I want to try the Fez couscous."}
{"text":"Food was piping hot and delicious. The mint tea was quite a surprise. The creme brûlée was awesome - definitely worth the calories. The staff was very pleasant and attentive. Will go here again."}
{"text":"Delicious food, friendly service, lighting is the only obvious improvement I can think of. Can't wait to try the other dishes like the tagine."}
{"text":"Great Moroccan food, best I've had in Toronto for sure. Service can be slow but certainly worth it. The decor is nice, nothing over the too but adds a nice touch. Place is on the small side so reservations are not a bad idea.   I absolutely love the zaalouk appetizer (eggplant) and the tfaya lamb as a main dish is out of this world!"}
{"text":"Great food, great service. Had the spinach dip to start, was excellent. The sausages were a little too smokey for my taste, but truly enjoyed the veggies and salad. Would go again."}
{"text":"Had high hopes for this place and maybe it was just not my moment. Walked in around 9-pm and the first thing I heard from waitress was that we are closing in about 45 minutes. Nice to know. She was friendly and informative after- so nothing to cry about! - Place looked really nice and had very interesting music. Atmosphere was definitely cozy  So we ordered the Chicken Briwat as an app- which on the menu sounded very fancy! However when we received it seemed like pre-cooked samosa's that you can find at any Indian groceries. Paying $6 for 4 of these somasa's which I can get for 3 for $1 in any cheap Indian dive in in Brampton or Scarborough was an indication of how my night was going to go.   So now time for the entrees- Chicken Bestillas and the Grilled Lamb. To be honest- The grilled Lamb was totally worth it; Charred perfectly and also had a garlic marinate. Dipping the tender meat into the perfectly textured Aioli was amazing.   NOW- Chicken Bestillas. The idea seemed fun. Seemed appetizing. Looked great. Ideal for looking cool on social media. However, this is what the dish is if i could explain. Imagina a tortilla shell with baklava syrup and cinnamon on top- inside a burrito of dry bland ground meat, with some shredded chicken inside it. I had to force myself to eat it and the cashews didnt help. It honestly tasted like someone accidentally put meat in my baklava.   Verdict- So 1 out of 3 Items on the menu felt like it was worth my dollars; which i spend $70 for 2 entree's, 2 beers and an app. Not bad- but could have got a lot more elsewhere. I dont believe i will be returning. Sad because I did have my eyes on the Tegine."}
{"text":"Walima Cafe has wonderful atmosphere for impressing someone that has little-to-no experience with Moroccan theme decor.  It might not show the same out in the street with it's sketchy unknown neighbouring establishments but you can easily walk pass those even at the expense that those could be more authentic locals-in-the-know only but then you'll look out-of-place suspicious.  Walima Cafe on the other hand was my hope as a replacement Tagine spot in Scarborough I used to favor.  Obviously hard to match the prices in Scarborough so I will hold that judgement for you to decide.  Let's talk about exotic flavours and serving utensils, shall we?  Grilled Merguez($6.25) Moroccan-style Sausages w/Harissa  - Not my favourite textural Sausage variation in the world - HARISSA did make everything taste more flavourful.     We couldn't stop dipping Harissa on everything we saw.  Marrakesh Chicken Tagine($13.25) Chicken with Saffron Potatoes and Preserved Lemons, Olives  - White Meat Chicken really turned me off this dish. - Flavours from Sauces not intense enough.  Kofta Tagine ($11.95)  - Morrocan Meatball.  Sauce not spicy enough.  Sahara Chicken Bastilla ($13.75)  - Served as a complete Pastry Round, cool. - Pastry nicely baked crispiness outershell. - Chicken dry affecting other ingredient elements. - Lack sweetness savouriness, I've had better elsewhere.  Mint Tea ($5)  - My Friend always likes to play with the handle-decoration. Weird, eh?"}
{"text":"I think this is a great restaurant. Very reasoably priced for a nice Moroccan meal. Good atmosphere too.   The starters were nothing special, but the entrees we all great. Each was priced at $14ish.   I had the Seafood Tagine ($13.95) which was a shrimp dish served with olives and stewed in charmoula sauce. Tangy and very tasty. I had it with cous cous but there was also a choice of rice or bread.   My sister and mother both LOVED the Lamb Sultan's Tagine (also $13.95) with sweetened figs and apricots topped with almonds, also with cous cous. I think that if you're a meat eater, this is the star of the tagine options.   My aunt had the Casablanca Couscous, and my husband and grandfather each had the Marrakesh Chicken, chicken with saffron potatoes and preserved lemons, olives. They were all very happy with the entrees.   For dessert, they only had Crème Brule and Crème Caramel yesterday. I know that Moroccon and French culture do overlap but I thought it disappointing that they didn't have any stricktly Moroccon sweets available when we were there. I didn't have dessert but among those who did the vote was that the Crème Brule was a pass but the Crème Caramel was good.   I would definitely go back and just enjoy a nice entree. Great date spot too, very cozy."}
{"text":"Went to Walima Cafe with the expectation to find a true authentic and delicious Moroccan restaurant. The place was indeed authentic (at least the menu was representing) as it had Tagine style dishes, the infamous  starter dips as well as a Moroccan decor to it. I was however disappointed with the quality of food. I had the Lamb Tagine and I am sorry to report the only good part about it was the seasoning/broth. The almonds and fruity flavours were quite good and yummy, but the meat in itself was hard to cut and eat, not braised at all, not fresh at all.  Same for the dips, nothing special here. The place atmosphere did not live up to my expectations either, I heard Latin beats in the background for sure...I can recognize my music from miles away, who knows, maybe the manager/owner was in that mood that day; either way not a good overall experience. One last note - rice was just as disappointing.   Sorry Walima to give you such rating; however I think when it comes to a restaurant delivering on well prepared and fresh food, customers should be aware. Service was excellent, but unfortunately I don't think I will come back here again.  Viviana."}
{"text":"We had dinner at Casa Maroc yesterday. This place used to be called Walima Cafe.   The good: - Fantastic tagine and couscous. - great Merguez sausage - great dips plate with pita - reasonable wine list.   We loved the food experience and said in a booth in the back.  The restaurant a not big having maybe 8-10 tables of 4. We love the small local places so this was great for us.   Service was good but a bit slow.  Count on about 2 hours for dinner. However, the food comes to the table nice and hot and freshly prepared. We felt the wait was worth it and we were with friends, so it gave us time to catch up.   We would come here again in a heartbeat.  They are on JustEat also.  Street parking."}
{"text":"Wilima wasn't up to par.  As a downtown eater, perhaps I have been overly fortunate to be surrounded by amazing options everywhere and hence have become left with very high expectations of every 'unique' place I go to.   When you enter this relatively small place you get a sense that while it's decorated inside, it may have been just a quick overly of the previous interior. Right away it didn't feel overly authentic.  We had a cozy table in the back. Filled with somewhat mediocre music, the atmosphere seemed a little 2005, something that might sufficiently appeal to the uptown crowd.  Food wise this place was pretty good. Probably a 3 star, maybe 3+.  I had the spicy beef and lamb sausages. The meal was delivered in a traditional ceramic hot plate and was filling enough and flavorful. I was happy with what I got.  My dinner mates had chicken and lamb dishes. I had some of the chicken and it was also decent, although I can't rave about it. The lamb apparently was very good, so much so I couldn't snag a piece.  The staff was not good. There was a head waitress, who seemed friendly enough at first glance but she was clearly not genuinely like that. She regularly snappedat the more junior waitress which we could clearly hear in the back, and then turned off the snark coming over to us supposedly cheery again. My dinner mates found it mildly amusing but it was annoying to me.  All in all there are better options, I'd summarize this one as average priced, decent food in an underwhelming dinning experience."}
{"text":"After going back to this place tonight for father's day, i'm upping my review to 5 stars. It has proven to be consistently excellent.  The food there is great, and at absurdly reasonable prices. I don't think they have a dish over $14. I had the chicken bastilla this time. It was great. And all the salads were better this time. more zippy.   My only concern is that whenever I go, there are never too many people, and I want to make sure this place doesn't go anywhere. Its my goto moroccan restaurant in Toronto."}
{"text":"While on the Danforth, Walima Cafe remains tucked away from the usual hustle and bustle that you normally encounter on the Danforth.  This cozy Morrocan restaurant offers a unique and flavourful experience to those wanting to try something different.    As you walk into this restaurant, you can truly appreciate their efforts in creating a very nice and homely place to enjoy good food and great company.  I absolutely love the decour here with dim lighting, beautiful art work on the walls and cushy seating arrangements all around for your butt to enjoy.  Equipped with a fairly large tea room groups, this place does a wonderful job at creating the arabesque ambience to enhance your dining experience.  Between the four of us, we ordered a plate of hummus and shrimp sharmoula as our appetizers...both were good but neither was exceptional.  For our entrees, we each ordered something to satisfy our individual cravings whereas i went with the most exotic item on the menu: the sahara chicken bastilla OR as i like to call it, the chicken baklava!  Their description of the dish is as follows:  A savoury mix of chicken and almonds, marinated in sweet spices, wrapped in thin layers of Phyllo pastry, topped with cinnamon and powdered sugar.  Its almost impossible to describe the sensation that went on in my mouth as i chowed down this dish.  I mean spicey chicken mixed with almonds and then wrapped in a hard pastry shell and then topped with honey, cinnamon and powdered sugar...are you kidding me?!?!  It wasn't even good...it was F*ing great!  Never before have i experienced such a medley of sweet and spicey working oh so well together.  If you dont believe me, check it out for yourself!    I nibbled away at everyones plates and this was by far my favorate dish on their menu.  The other dishes all reminded me of a less spicey version of pakistani food.  The house green tea is a must have before concluding this meal.  I had a wonderful experience at Walima and i look forward to going back for yet another round of chicken baklava!    Please note, all dishes prepared at this restaurant are said to be halal.    Thanks and enjoy!"}
{"text":"Walima Cafe is decent Moroccan joint with a nice atmosphere, reasonable prices, and pretty good food. The front of the restaurant a handful of small couches and tables that might be cool if you're there on a date and want something more intimate. In the back things are more standard with tables and chairs. The place is well decorated and I liked the atmosphere.  Our starters were alright but nothing memorable. The Zaalook ($4.75z) is similar to baba ganoush and is served warm.  The dip itself was good but the pita it was served with wasn't very good. The Beet Salad ($3.75) consisted of cubed beets, diced red onions, and cilantro; I felt it was boring and wouldn't order it again.  Be warned that the mint tea ($5.00 for a pot)  is made with tons of sugar. It's nice at first but quickly gets overwhelming. Maybe this is how it's traditionally prepared in Morocco but I would prefer less sugar so I could taste the fresh mint.  The Berber Lamb Tagine ($13.25) was the only standout dish. A tender, juicy, and flavourful lamb shank is cooked with potatoes, carrots, peas, and spices in a clay tagine dish. My friend had the Lamb Tagine ($13.25) which was the same idea but replaced the vegetables with caramelized onions and raisins; it's has less spices and sweeter due to the raisins. Both were delicious.  Mains are served with saffron rice or pita. Neither are anything special but will serve you well when mopping up the delicious sauce from the lamb.  A 3.5 star place that could be 4 stars if they upped their game a little bit."}
{"text":"We loved this place! Small, cozy, fresh & delicious. A real paradise for spice lovers and Morrocan food.  A must try!"}
{"text":"We had tagine, kebobs and chicken bastilla. The food was authentic. The setting was nice.  i recommend it.  See my pics"}
{"text":"Walima Cafe was such a disappointment.... The website, menu and even the decoration show a lot of promise... for some yummy Moroccan food....   The only good part of the meal aside from the deco... yes I just love those cushion sofa type seatings... was the Harissa (hot sauce)!! My yelp dinner mates just drowned everything in the Harissa to give some kick and spice to the food.   Grilled Merguez - Moroccan style sausages served with Harissa ($6.25) was the best dish of the night... the sausages was tasty and has great flavour   Marrakesh Chicken Tagine, chicken with saffron potatoes and preserved lemons, olives ($13.25)  - I would not have consider this as a tagine as the chicken was definitely not cooked in low heat over a period of time... a fast food version maybe?  - white meat was used and the chicken was dried and not tender at all  - the broth is interesting though really light   Kofta Tagine ($11.95)  - ground meat balls cooked in tomato sauce with an fried egg on top?  - Maybe it is our fault to pick this dish as it tasted like Italian meatballs??   Sahara Chicken Bastilla ($13.75)  - The outer layer of the pastry was nicely done..but the chicken was overcooked and the whole bastilla was really dry  - lack the complexity contrast of sweet and saltiness of the other bastilla I had before   Mint Tea ($5)  - A-OK... and love the standard Moroccan presentation...   I don't think I would be coming back to Walima Cafe again... it was just a totally disappointing experience."}
{"text":"After having great Moroccan food at another restaurant in Scarborough, I was excited to discover Walima Cafe was just a few blocks down from my house (yay, weekly Moroccan deliciousness!)   The experience we had at Walima Cafe was disappointing to say the least. The menu showed such promise, offering traditional Moroccan dishes similar to the Moroccan meal we had previously. We excitedly ordered the chicken and lamb shank tagine with cous cous and prepared for a culinary delight. What we were not prepared for however was a forty-five minute wait, overly salty food--everything was drenched in salt (I can maybe understand the meat being a tad bit on the salty side but even the couscous was laden in salt), small portions, and meat that was tough and not fresh at all.  We were thoroughly disappointed with our meal and overall experience. The prices were on the higher side for the quality and portion size of the food and the wait time was ridiculous for food that wasn't even made fresh. Seriously, everything tasted microwaved.   The service was OK--it would have been nice for them to at least come by and say, \"Hey, your food should be about ___ minutes more\" so we could have at least ordered an appetizer to tide ourselves over since we were starving and one of only two tables occupied at the time.   Overall, bad experience and definitely will not return."}
