{"text":"Cozy comfortable atmosphere with competent and sincere service. The scallops with hollandaise sauce was delicious and the spinach beside was unexpected and a great match. The texture of the scallops was perfect though the outside could have a bit more sear. Had pickerel for the main and it was delicious. The accompanying vegetables are not an after thought and in my mind retained just right crispness. For my tastes they could cut back a bit with adding heat. Staff appropriately let you know which desserts are made in house. Had the tiramisu which while not a traditional presentation was also delicious. Half Litre of house red was a good value. If you are looking for a fine dining experience in Ajax in a relaxed less formal setting try Casa Verde."}
{"text":"I don't like leaving bad reviews, especially for those who are so obviously working hard on a small business. We were served by a woman who we suspected might be the owner. My Mom wanted a nice place to celebrate her daughter-in-law's birthday.  The daughter-in-law ordered mussels. My niece ordered the antipasta plate for one. The antipasta plate was unattractive and sort of looked like a child's plate made by a frugal mother. Extremely thin slices of meat and cheese slapped on a bare small plate with tiny little sides of black olives and another of artichokes.  Blah and pricey at maybe $14? The mussels served to my sister-in-law were small and not generously proportioned, perhaps about 16 mussels, perhaps costing about $15.  She ate one or two and my Mom ate one. Both of them agreed they weren't very good, in fact, maybe bad?  I tasted one as did my niece, we all agreed they tasted fishy, were more rubbery than usual and seemed cooked poorly too. None of us were comfortable eating them safely. (Oh and there was very little sauce/broth). No problem, we thought. Mistakes happen.  My Mom flagged down the woman who was serving us and told her. We said we all tried it and we all agreed it was fishy. The server argued with us, telling us, like we were born yesterday \"They are mussels, they are supposed to taste fishy\" My mother replied she'd \"eaten mussels all over the world and mussels don't usually taste fishy\" The server, lips very tight told us haughtily, the mussels are fresh. She took them away in anger and tossed them.  She had a very polite busboy and another server serve us for the rest of the meal, which was a relief for us.  My niece and I had already ordered the linguini alla pescatore so it was too late to change our mind away from seafood.  My niece called hers bland, mine was bland but salty. I ate half of mine because I was hungry but it was perhaps the worst linguini plate I can recall eating at a nice restaurant.  On a good note, My mother ordered veal picatta and it was excellent (although my Mom got some attitude when she asked if they had gluten free pasta). My sister-in-law ordered the special stuffed chicken with goat cheese and also loved hers. My Mom told the new younger red-headed server it was my sister-in-laws birthday and she got a little whipped cream with a candle in it. The birthday girl ordered a dessert for two, Zabaglioni perhaps and I am the only one who could eat it, my sisiter-in-law didn't see it had alcohol in it, my neice tried it and didn't like it, I thought it was lovely.  The woman was frosty as we left.  It cost my Mom about  $188.00 with tip ($28 tip) but no alcohol and a couple coffees. All four of us not only wouldn't recommend it but would warn people against it."}
{"text":"Authentic Italian restaurant. Our party enjoyed the bruschetta- crispy toast with fresh tomato and garlic toppings. We also had wonderfully thin slices of beef carpaccio topped with thin shavings of Parmesan, and and antipasto platter. Veal Marsala was the best looking of the the four dinners, but the veal saltimbocca, cannelloni casalinga, and spaghetti carbonnara were also good. Tartuffo, espresso, creme caramel and cafe americano, all good to finish off with."}
{"text":"very quiet atmosphere, great for a nice romantic evening, I loved it! pasta was quite good.  We have seen this place forever and finally decided to go in.  we will go back again!!!"}
{"text":"Wow. Such amazing food. Flavours just pop. Everything was superb. Such a quaint place. Thank you to Rob and Jo for an awesome evening. Will be back for more"}
{"text":"Garlic bread with cheese, gnocchi, two orders of lasagna and chocolate mousse cake and of course a couple glasses of red wine.   It was all very very very tasty!!!   Will be back because everything on the menu looks delish!"}
{"text":"Our first time at Case Verde in Pickering Village was pretty darn good. My husband had the special Osso Bucco with Saffron Risotto and I had the Cajun Sea Bass with fresh grilled veggies and potato. We started with a bottle of Santa Carolina Cabernet Sauvignon 2006 and the Fried Brie with Berry Coulee. For dessert, we had the Zabaglione for two. An excellent meal. The service was not quite on top of things, but otherwise a very good experience. I got the feeling that they were short on regular help and had filled in with people that weren't quite familiar with things. I'll definitely go there again though."}
{"text":"This is a very quaint setting in a a converted old house. It is a very enjoyable environment for a bottle of wine with ambience and candlelight. Unfortunately,  that is the end of the positive remarks. They are employing very young and pleasant servers who unfortunately lack any serving polish. They were polite but green. What's more is that the culinary talent in this kitchen is seriously underwhelming. Do not order any soup. It is laughably bad. Think instant pack with hot water added for $9. Neither soup was even edible without the (lengthy effort for a) request for salt.   The entrees were lackluster and would not bring us back anytime soon. We do have a depth of Italian dining experience and to say this is worthy of a return would be most disingenuous.   Nice setting but most disappointing. Unfortunately the kitchen needs to try much harder."}
{"text":"First time going here. Wife and I loved it. Staff was attentive without bugging us. Food was delicious with very generous portions. Would surely go back."}
{"text":"With a pleasant atmosphere tucked away in Pickering Village, this is an excellent spot for Italian food inside the quaint house or outside on the patio."}
{"text":"This one of my favourite nice unpretentious restaurants in the Durham region. Everything is fresh and made with care and attention to detail."}
