{"text":"Had the steak sandwich...juicy and extremely flavorful.  Great atmosphere, great value, great service and decent menu choices.  Patio is amazing.  Highly recommend.  Look forward to seeing the banquet room!"}
{"text":"Very good. Fair price. Lots of good food. Angela our bartender/server was spectacular . Chicken Marsala, potatoes and veggies were superb"}
{"text":"Excellent food, very friendly owners and staff.  Attentive waitresses and the food is reasonably priced and very tasty.  I've had several appetizers and entrees...all of which were excellent.  Very nice wine selection and the patio is one of a kind..."}
{"text":"Enjoyed a really good shrimp risotto.  Friendly staff.   Ate our meal on large peaceful patio."}
{"text":"Food was delicious and the atmosphere was great. 
This restaurant is family owned which was apparent when it came to service and food preparation. 
Inside seating had a great appearance while the outside patio and bar were also well kept. 
Food was properly priced. You are not going to walk out of there disappointed with the value. 
I would highly recommend checking this new restaurant if you are in the area."}
{"text":"This is my new favorite restaurant!  I have dined here a few times and was extremely pleased with the food, service and atmosphere. Other than the food being delicious, it's consistent. I've been to many restaurants that were good only to return and be disappointed by having the same food and it didn't taste as good as the first time.  I would highly recommend any of their special events (lots of fun) and there is an amazing outdoor patio and bar."}
{"text":"A local restaurant with loads of choices. Personable staff and a nice wine selection. The shrimp risotto was creamy, full of flavor with bits of zucchini and yellow squash... delicious. The egg plant parmigiana was crisp  on the outside and tender inside with a spaghetti side. Portions are generous.
Our server Heather was attentive. 
The weather didn't permit sitting outdoors but the area is welcoming for summer evenings.
We will be return clients!"}
