{"text":"I've only ever tried their fries, and I have to say not the best. Too soft. A fry should not flop down, it should stand to attention, like an erect penis!"}
{"text":"After reading the last two reviews, I thought \"well, one of them has got to be wrong\". So I tried it. 

 I pride myself as someone that can spot the real deal, homemade stuff. The sauce IS NOT from a packet, and the fries ARE NOT \"frozen hand cut fries\". You can actually see the cooks cut the potatoes while you wait if you order at the take out counter... The fries are VERY good, the real, right way: blanched and fried; and the sauce is very tasty, real: made from beef stock, not chicken base or barbecue sauce; and the spices and herbs in it are spot on. Not too salty, not too thick, just right. As for the cheese curds, true, they are coming out of the refrigerator, which WOULD be a real dissapointment if one were to eat them as is... But since they are added to a hot dish, with hot fresh fries and hot gravy which makes them melt anyway, there is no crime here. All in all, as a Montrealer that has eaten a lot of poutine, I'm saying this is a REALLY good one, the best you can get in Verdun. I'm not saying you should cross the whole city to come to the place cause there are a lot of good poutine places in Montreal, but if you are in Verdun, that's where you want to get your fix from.

I also ordered the \"Normand Special\" cheeseburger, and it was a very good burger. The meat was fresh, and the combination of ingredients is just well thought of. I enjoyed the home made mayo and the mix of pickles, hot peppers and bacon. 
All and all, if you feel like a greasy spoon in Verdun, this is a vary good spot. Only downside is their business hours since they close at 9pm."}
{"text":"The staff is so sweet. Not that expensive for such a good poutine! Their hot dogs are amazing too. Best poutine in Verdun!"}
{"text":"Staff is awesome and always friendly! one of my top favorite places to get poutine! ! The fries ..the gravy.. honestly just perfect! Highly recommend"}
{"text":"Probably the BEST poutine I have ever had. Reason for me not giving a 5 star is because the staff is really, REALLY slow. I mean, its hot dogs and french fries. They aren't making rockets or anything, so why does it take 15min to get a simple hotdog? Plus, this wasn't during the \"rush time\" either."}
{"text":"Un bon petit casse-croûte de quartier!

Le restaurant fait de l'excellente poutine, les frites sont très bonnes! On nous accueille avec un grand sourire, vraiment tous les employés sont hyper gentils. C'est l'endroit à aller à Verdun (lorsqu'on y habite) si l'envie de hot-dogs vapeur et de frites nous prend! Il offre également la livraison ou il est possible de prendre la nourriture pour apporter; parfait si l'on habite pas trop loin ou si l'on a envie de déguster son lunch dans un parc!"}
{"text":"We go to this place exclusively for their poutine. They have real cheese curds, and i must say their cheese is delicious. I'm only giving it a 3.5/5 because the fries are too soggy for me. My boyfriend feels more like this place is a 4/5. The delivery is very fast. Perfect after a ski day when you're too tired to do /go anywhere."}
{"text":"I had high expectations, but ended up disappointed. It's not a bad poutine, but nothing fantastic. 

Fries: frozen hand cut fries (there is such a thing). Not quite homemade.

Gravy: powder based sauce (not an actual gravy). Like Dave I like the consistency, but it majorly lacked flavor.

Cheese: cheddar cheese curds. Definitely at least a day old, and I could tell they were coming right out of their fridge (the curds were cold and were mostly crumbles). 

Don't go out of your way from downtown or anything. But if you're in the area, it still beats the terrible La Belle Province by a mile."}
{"text":"FINALLY I have found good poutine in Verdun. Every place I chose it was always something. Frozen fries, grated cheese or sauce so thick you couldn't swallow or the greatest insult to poutine, it was gratiné. Finally found the kind of poutine I can enjoy. The fries are hand cut greasers the way they should be, the sauce is tasty and far from heavy and overwhelming and the cheese, the cheese is warm and squeaky just like delicious cheese curds should be, it reminded me of my childhood when I would get curds from the local general store and the cheese was so fresh it was still warm and leaking whey. Awesome. 

The cheeseburger I ordered just to sample, well I ended up sucking it down like a Hoover sucks in dust bunnies. Fresh meat that tasted like the guy pounded the chuck into the grinder right before cooking it and all the trimmins are farm fresh goodness with a homemade mayo. SOLD! 

I will definitely partake of their grub in the future."}
{"text":"I had heard a lot of good about this place and I wanted to try a poutine close to home, but I am very difficult when it comes to our national dish.

It was fine, the type of poutine you get at \"Generic Pataterie\". The bacon one has like a whole pack of bacon in it, but it's pricey for the size. I asked for extra sauce and still found it dry, lots of tasty gooey cheese though!"}
{"text":"Très bon fast food avec des ingrédients frais!! Cependant la poutine manque de fromage."}
{"text":"A perfectly executed traditional poutine. Very warm and friendly service. Very clean, very well decorated. Great experience."}
{"text":"Il n'y a vraiment pas de quoi s'empiffrer de bonheur avec les repas légers très régulier servis ici.  Être là depuis 50 ans ne fait pas nécessairement la qualité.

Le \"steamé\" est plus qu'ordinaire et entre à peine dans mon top 50... Montréalais.  Un hot dog est un hot dog et il y a mieux même dans Verdun.

La poutine à Normand que beaucoup me ventaient...  Très ordinaire encore: tu cherches le fromage et la sauce est trop salé. Quand j'initie nos cousins français à la poutine sur Montréal c'est pas ici que je vais les emmener, je vais continuer de leur faire découvrir ce fast food québécois Chez Paul Patate ou au Green Stop St Henri si on est dans le Sud ouest et Verdun.

Terminons tout de même sur les plus de Normand: un service courtois et sociable par les serveuses; endroit très propre et décontracté.  J'y ai été pour le petit déjeuner et là c'était délicieux et leurs patates à déjeuner sont uniques, délicieuses et juteuses.

Alors cher Normand: sorry, mais moi je ne t'aime pas pour tes hot dogs et poutines très ordinaires, mais pour ta vie de quartier Oui!"}
{"text":". This place has been rated by my friend, as the best poutine place in Montreal. I took her to every well known poutine place in Montreal and this was her favorite. A bonus is the friendly bilingual  service, friendly and the kitchen appears clean and clearly visible."}
