{"text":"First off they don't accept debit or credit cards.  Luckily there is an atm near the register.  Went for the Sunday buffet and it was \"grab and growl.\"  Layout is poor and everyone is bunched up waiting to get food.  Tables are white textured folding plastic tables.  Chairs on the flimsy side.  Food was acceptable.  Kind of odd to have a placed called Catfish Cove and not offer any seafood at all on the buffet.  Had meatloaf, fried chicken and chicken in a cream type sauce.  The broccoli casserole was  good and the mac and cheese was close to what grandma makes but not exactly.  Nothing fancy at all.  If you want to impress someone stay away.  If you want to get a full, you will be good to go."}
{"text":"Great \"FISH CAMP\"!  Nothing glamorous just great fish.  Try the watermelon rind pickles on salad bar-really good.  They also have all you can eat specials including crab legs"}
{"text":"Just down the street from our house but we only go there once a year. Last night I realized why. We have two kids and they are too old for the kids menu, yet can't eat an adults meal. There is nothing for them on the menu under $9.00. I find it difficult to pay $9.00 for a kids entree. The food was greasy and the salad bowls were tiny at the salad bar. Once you put lettuce in there wasn't room for toppings or dressing."}
{"text":"This is a great traditional, family \"fish camp\"!  Been coming for years and the food is always hot and delicious and the service is great.  The Sunday buffet offers home style cooking like Grandma makes!"}
{"text":"Good for any southern person who loves deep fried dry chicken and potato water(mashed potatoes so watery that it's like a soup) the last time I ate food like this it was the high school lunch menu. The coconut pie was ok and the sweet tea was just brown water. Thank you catfish cove for officially making me hate southern food."}
{"text":"Good food. Catfish was a bit little and hard to eat. Good place for families. Will return if back in the area. Salad bar was good."}
{"text":"Make no mistake about it...Catfish Cove is a total grease pit.  But it's GOOD grease.  It's a no frills fish camp setting near the river.  The service has always been good when I've been there but the real standout is the Sunday buffet.  Don't be discouraged by the long long line out the door...they really move people in and out.  There's usually fried chicken, mashed potatoes, steak and gravy, meatloaf and a bunch of pretty decent vegetables to choose from.  The real standout is the fried squash.  Even if you don't like squash, give it a try; it's wafer thin and fried super crispy...like Lay's chips, I betcha can't eat just one.  Dessert and a drink is included....the Tums/Rolaids you'll need afterwards is not.  =)"}
{"text":"At first I felt a little uneasy, but once my party and I sat down we were warmly greeted by our waitress. The menu was to the point seafood, nothing fancy and that's not necessarily a bad thing. You get way more food than what you pay for, portion wise. I dare you to go home without a doggy bag! The food is grade A good! I would definitely go back to eat there again."}
{"text":"Best Fishcamp in Belmont area"}
{"text":"This is a good family restaurant. Good fish and seafood. Sunday's is the country buffet. It is so very good if you're like most folks on this area it's just good country cooking, all you can eat and they bring around different desserts that you can choose from and as many as you like with dessert also. Oh yea the price is very reasonable. If you go to church you'll have a little wait always a line but it's worth the short wait. If you don't go to church get there around 11:30 and you'll get a seat sooner. Or if your church lets out at 11:30 you've got it made. Give them a try for your seafood and country cravings. I believe that you will be satisfied."}
{"text":"Great meal great price great portions. No frills just good down home eats when it comes to fish camps this is the place to go."}
