{"text":"Stay away. This place is a scam (honestly every \"psychic\" shop is a scam in my opinion), i dont know why i let my friend convince me to come here. As soon as it was my turn to go in, i sat down, shuffled some cards and laid them down on the table for her to \"read\" (total bs). I was then told my life will be perfectly amazing, my relationship will be great, my job will be great, just everything in my future is just wonderful. The questions i asked got answers like \"uh huh that looks to be right\" or \"yes your future looks great\". It felt like i was being pushed out the door. There are creepy men behind the door in the little room they have you sit in that makes you feel like youre their next scam victim. 

Two days later and im beyond frustrated with how i basically threw my money away that i went back to this place to ask for my money back and no one came to the door, no one answered the phone number they have posted on the door (this was during the posted normal business hours mind you) i knew someone was there because the same young lady who gave me my \"reading\" was in the back smoking a cigarette. Very classy. After being ignored for 20 minutes i decided to cut my losses and avoid places like these and spread the word. I repeat, Avoid. This. Place. Avoid ALL psychic shops!!"}
{"text":"I trust April to give me my readings every now and then. She's honest and thorough from the start. Her purpose is to help those get their readings without taking advantage of them."}
{"text":"I was very upset with my reading with Jewles, I feel as though I was scammed. When I first got there we instantly sat down and she asked me a few questions. It was in a loud open area where I could hear people talking outside. She asked me the a bunch of questions to finally answer one of mine and be completely wrong. She charged me $75 and only spoke to me for 40 min, 10 of which were spent telling me how much it would cost for her other services. I tried to ask another question but was practically pushed out as if she was annoyed. I later wrote her an email because it upset me so bad and still have not heard back yet two weeks later. Be careful"}
