{"text":"Slow. Very slow. I waited an extra 20 minutes after they told me it would be 30 minutes for pickup. Pizza is chewy dough. Yuck. I will say the sausage was very good other than that I can't say much. I thought they would bring something new to the game but not really. Maybe their sandwiches are better. In the meantime I'll stick with Veltris"}
{"text":"Very good pizza, this is coming from someone who has high standards. Still some growing pains they have to over come but that's a good thing it means they are busier than expected.   Give it a try, if you like good pizza you won't be disappointed."}
{"text":"Already heard great things about this place so I had to give it a try. The food is great!! Had the eggplant meatballs... AMAZING! The meatball hoagie was great and pizza was delicious.  You can dine in and bring your own wine, or take out. You must give Cecelia's a try,  I will definitely be back!!!"}
{"text":"First time at new local place. Got mozzarella appitzer, not impressed. So much breading, not much cheese. Only 4 pieces for $5.29 about 1 1/2 inches by 1 1/2 square. So not worth it. Seems like cheese cooked out in frier. Told as a pick up would take 35 to 45 minutes. Went in at 25 minutes, everything cold. Got a margarita pizza, good flavor but cut are so miss sized. Have patience. Take ur time. Gonna give this local place another try  but that will be it for me. They better get better."}
{"text":"Awesome restaurant, menu, and spectacular service! Best pizza and wings I have had in a long time. Tried the Mushroom Lover's pizza and it was delicious. Perfectly cheesy and everything. Would 100% recommend it to a friend or anyone who likes pizza, wings, or subs. While the restaurant itself is very casual, the food is gourmet and the prices are awesome. Also they proudly serve Turner's Tea, so it can't get much better than that!"}
{"text":"The first experience of Cecelia's Pizza Kitchen was in June. I ordered the New World Italian Hoagie, Chicken Parmesan dinner, and BBQ chicken wings, and potatoes. It was GREAT! The NW Hoagie was so good, my husband enjoyed his chicken parm dinner, and our son loved the wings (he's 6, but he knows what he likes). The second experience in July was not as good as the first. I decided against my better judgment to try something different. I ordered the Philly cheese chicken hoagie, BBQ wings and fries. The Philly cheese chicken did not have any cheese on it and if it did it was very little. The chicken was very good, but it was a dry sandwich I did not enjoy at all. The wings again were good and the fresh cut fries very good. I'll give them another try."}
{"text":"I'm a pizza snob. Really . . . I'm bad.   I'm excited to see a pizza shop like this in Verona. That building it's in is cursed in that town. Nothing seems to survive in there. It's what Seinfeld calls the Bermuda Triangle of commerce. BUT I hope Cecilia can hang because I like them.   My wife and I stopped here to grab a slice of pizza. They do sell pizza by the slice, but I regret ordering 1 slice. The price was astronomical. We should of just ordered a full pizza.   The pizza itself was okay. When I find great pizza I am willing to travel a long distance to get it. This shop is on my way to work and I don't think I'll be back. It was good but very normal. It's better than Pizza Hut or any of the equivalent chains, comparable to a Veltris (another local spot), and not as good as Aiellos (my pizza heaven).   BUT I think you should try Cecilia's because it reminds me of pizza from Jersey, and I truly think it could steal your heart if Veltris is your #1 shop.   There is plenty of seating inside and they have a patio!   Try them out! I only tried pizza but they also have a full menu of food. You come in order and sit and eat or take it to go. It's not a restaurant where you tip. Plenty of parking. Wide-eyed and helpful employees."}
{"text":"We ordered 2 - 12 inch pizzas pepperoni and sausage and we also wanted to try something  different and got the fried chicken pizza. Crust was good on both. However chopped chicken strips on pizza not so good. In addition me and daughter ( who only ate the chicken pizza ) got very sick after and so it turned into a VERY unpleasant night."}
{"text":"Gave Cecilia's a try and was very pleased. We ordered the roasted veggie pizza and the new world Italian hoagie.  Pizza was very good in particular the veggie topping.  The hoagie was excellent- good quality meat and roll.  We will be back. Nice addition to the dining choices in our area."}
{"text":"What a great place! Pizza was so yummy! You must try the eggplant meatballs! Great place to take your own bottle of wine and eat some great pizza!!!"}
