{"text":"We had high hopes for the Celtic Tap as a great local Irish pub. It is Newley opened in south Calgary opening in May of this year after a long, long wait. 

I was quite confused about what they were trying to achieve inside. There is a hostess stand just inside the door where they take you to a seat instead of seating yourself but they did not give us an option of where to seat although there were tables available in all areas. Although they are called an Irish pub the interior feels much more like a sports bar with an over abundance of TVs playing a myriad of sports and a heavy smattering of video games and pin ball machines. One side of the pub is almost closed off and filled with low tables like a dining room while the rest of the place is filled with high tables and stools with a large bar in the centre. Overall it felt a bit lost in its design. 

Following along, the menu also felt a bit underwhelming and confused. It contained everything from butter chicken to fish n chips. I had a bit of trouble finding anything on the menu that peaked my interest but finally landed on the fish n chips. The two pieces of fish were very nice battered in a light crusty batter, moist inside and flavourful. The chips were underwhelming over cooked french fries and the sides (which I had to reminded the server for because they did not come out with the food) were a very vinnigar heavy coleslaw (about two fork fulls) and a house made dill tartar sauce that tasted like bland mayo. My husband ordered the lamb melt and although the menu offered a choice of sides the waitress ran off with the order without offering the options and his meal came with the same fries as mine. It tasted pretty good but the thinly sliced meat on the openfaced sandwich was a bit of a mystery and neither of us could decide if it was lamb or just thinly sliced beef. One of the strangest things was the two sauces that came with the dish. One was a small dish of sour cream and some sort of berry jam (yes jam not a berry compote or sauce) and the other was some sort of herbed vinnigar. Neither of the sauces were described to us and we had no idea what they were for nor could we find what they enhanced on the dish. Our end bill was over $35 for two meals and a pop. 

Overall I found the place confusing, a little lacking in service and the menu and food were both very underwhelming. Thus is not somewhere that we would put on our list of places to revisit."}
{"text":"Great place, absolutely Amazin' food!

The beef dip is the bomb

It is a great location for fun in this end of cowtown"}
{"text":"We decided to try this place out for a simple family Thanksgiving brunch which turned out to be a big mistake. Their website advertises that they have a Sunday brunch buffet for $22. We phoned a week ahead of time, confirmed on the phone that they are still doing the Sunday brunch and booked for 13 people. Once we got there (after waiting for them to get ready and prepare the tables for us) we were told that they no longer do the buffet. 

The waitress was really nice and accommodating but did not write any of the food orders down and had to come back a couple of times to re-check what everyone wanted (this is a big pet peeve of mine). Then she came back again to say that a menu item was actually not available and something else would have to be chosen. 

It took almost an hour between the first and last person at our table getting their food (for no apparent reason other than not being able to handle food orders for a larger group) which was super awkward. The waitress was constantly running back and forth with drinks and food for our table with no help from the other staff member who just sat behind the bar looking at his phone.

The food was terrible. The sausage tasted like salt wrapped in more salt and the bacon was undercooked.

We definitely won't be back."}
{"text":"Opened May 2016. 

This is a terrific new pub in SE Calgary.  Everything is first rate. The menu is exciting, the staff are friendly and knowledgable, and the atmosphere is terrific.  

I will be back and will add details as I go.  I have no doubt that over the next few visits a fifth star is added.  Come try it out."}
{"text":"Pleasantly surprised!

After being somewhat frequent visitors of the previous pub at this location, we were anxious/excited to try the new pub. 

Food menu - pretty good pub fare, and from what I've heard the Beef Dip is delicious, we had the chicken nachos, fried pickles (delicious!) and potato skins (also delicious). 

Service was delightful, Shelby was our waitress and she was super friendly and personable.  She mentioned \"open mic\" night and we asked about/suggested a karaoke night, so we would LOVE to see a karaoke night happen!!!! Not enough fun karaoke nights in the Deep South, and we even have an idea of a fun parents night out/karaoke night.......because not enough places cater to us poor parents that are just desperate for a fun night out!!!!!!!!

Will we be back? Absolutely."}
{"text":"Ordered here from Skip the Dishes. I ordered Fish and Chips and the \"Wings\" . The chips where layered in grease but the wings where revolting . You get about 8 \"nuggets \" for $14. There is no bones in them and it doesnt even look like chicken. Yuck.

Pic of the \"wings\" 
http://imgur.com/a/3xki6"}
{"text":"Terrible pub. Our appetizer was moldy, the sangria was basically juice, our waitress was nonexistent and she only discounted our bill after she gave us the full price bill. The restaurant was full of fruit flies which was annoying, the cook in the back was wearing dirty ratty clothes and nothing looked sanitary. There was also a slide up door in the back behind the kitchen that was wide open which would explain all the bugs. 
All in all, bad food and not much better service. Hoping we don't have food poisoning. Save your money and go to cattle baron across the street."}
{"text":"A pleasant surprise. Went in because it was close and I was hungry. Found very good food, a reasonable wine list and great service. Plus the prices were reasonable. Worth trying"}
