{"text":"Dined at Ceno recently-  Attentive, friendly service.  Great food, although the truffled potatoes have an odd flavour.  The fish and risotto we had were delicious.  The live piano was lovely.

Would I return?  Perhaps. The chocolate cake was outstanding."}
{"text":"I went there yesterday with a friend to celebrate various good news, and catch up, and also use a recent groupon. It's a nice place, and yes, they bring a glass of prosecco on the house. The service was attentive, a bit too close for my taste (too much of a personality in a waiter). I ordered a medium rare steak, on the bloody side, and they brought a really well done one. I looked upset and they made me a new one, this time more bloody. In any case, if you like your steaks rare, you really have to tell them and better order bloodier than you like.
They ran out of the chocolate cake, so we got the panna cota, which was made with a lot of gelatine and even some flour, so it was really more puddingy.
Large wine selection, good, now very hungover. (and we didn't drink that much)
Altogether: it's fun, but too expensive for what you get, or not good enough for your money's worth."}
{"text":"Some thought had to go in for this to turn to 5 stars from the original 4 I had in mind. Off the bat the biggest reason I thought of this as a 4 star place was that it might be overpriced but on second thought, one can dine here for less than $50 pretty easily if they choose just a main course and I did enter with a \"dealicious\" coupon in hand which helped a little on the finances side.

But fantastic service, a free welcome glass of champagne! and good food and presentation outweighs the effect Ceno has on one's wallet I feel. So do come in expecting to dish out some good money here!

Back to the free champagne glass. How awesome is that? They didn't open too long ago, so maybe this practice won't last, but even still, that is certainly a great way to start a meal is it not? The staff were just so incredibly friendly and so helpful and were never gone for too long from our table be it coming back with food or to check on how our evening was holding up. I think they are the friendliest bunch I've seen in any place where you could easily hit a $100 per meal. They just give off a great Italian vibe!

The actual restaurant is very nice inside and has a romantic feel, there was a live performance and the musician was all the way at the front window so as not to be too loud or in the way of diners. The menu has a great selection although you won't find me diving in to their equine tartar or equine fillet mignon anytime soon almost everything else seemed fantastic, prices are steep but it was to be expected with Ceno being a \"Yorkville\" restaurant.

My one complaint about the food was that I did find my carpaccio overly salty (now I'm not sure if that was done intentionally) and even our three fishes appetizer did contain a bit of salt in one of the three fishes.
But take a look at their breadsticks, no way can I stay too disappointed with too much salt!

I'm not a massive seafood person, but I took this opportunity to try their lobster tail, it tasted fantastic and I'm glad I tried it, but there seemed to be other options that I feel like I personally could have enjoyed more. But if you're a lobster fan, you will love that dish, if not go for the lobster gnocchi, fantastic! They make quit  a few things homemade here like spicy mayo, gnocchi and it does come out when you try it. 

Their dessert menu was again very interesting, we ordered panna cotta and ricotta almond cake. The \"cake\" did not look like cake at all and looked identical to my panna cotta (see the pictures if you don't believe me!) but they both hit the right spot! Had an espresso which apart from smelling heavenly was stronger than I expected. 

I've not been to many \"Italian\" restaurants in the Yorkville area but if more of them are like this I certainly have been missing out! Just to stress the point, the staff make this dining experience stand out from most other similar restaurants I've been to!"}
{"text":"Ahh Ceno. While part of me wanted to make this a 5 star review, there was just one little issue that held it back... 

My first time at Ceno was almost perfect! Besides a little too much salt on the salmon carpaccio appetizer, everything was great. They offer you a class of prosecco when you come in, there was great live music, and all the food was delicious, including my other appetizer, the trio of fish crudites was absolutely delicious, especially the scallop sashimi with the spicy mayo, and my entree, the lobster gnocchi.

On my second visit, all the food was absolutely perfect - I couldn't resist the trio of fish appetizer, and also tried the smoked duck breast (mmmm) and had the grilled spicy Ontario quail as my entree. There was still a great atmosphere, with live music (a different musician this time, perhaps not quite as good as the first), and we even still had the complementary prosecco... however, something happened during this trip that knocked star off this review. 

We had been there for about an hour already... the service had been great the whole night. But about the time our dessert came some of the servers, who then called over the kitchen staff, started watching YouTube videos REALLY loud on the computer, about two tables from our seats. Another server from across the room came over and told them to turn it down... but they didn't. And then even the owners walked over and started watching. At that point every staff member except the server who told them to turn it down was engrossed by YouTube videos... to the point where we ended up waiting about 10 minutes for our bill, because we couldn't get anyone's attention.... Seriously? If I pay $100 for a meal, it's definitely not to listen to YouTube videos. 

This review is still a 4 star review though, because the food was delicious and the service was great besides that one, very weird YouTube slip-up. I haven't been back since, but I definitely would (if another Groupon-type thing pops up!)"}
