{"text":"The food is amazing. The service is top notch. Overall good vibes and a great atmosphere!"}
{"text":"I love this place for a few reasons: the location on Yonge, the elegant sexy atmosphere, and the food. The gnudi is my favourite dish on the menu! This place is perfect for a romantic evening, a special occasion or even a regular night out (if you stick to the less expensive appetizers which are affordable and filling).

The street view of this restaurant may feel intimidating because it looks so elegant, but it's not snotty as you think. Really warm and friendly atmosphere."}
{"text":"You can get way better steak in Keg! Stay away. Took my girl friend here for v-day and it was a complete fail ! Nothing special and they charge extra for sides! The place does not have any interesting deco and just lacks character. Call me crazy but when you pay a premium for a steak dinner should it not be better then ur average keg?? The service was deff not better so i dont know why im paying more! Its just a place for people who think they hot shots to impress other people who think they are hot shots"}
{"text":"I was lucky enough to go to a pharmaceutical dinner (read: free wine, free booze, free lecture!) at Centro this week. They have a pretty good little set up for presentations, with long banquet style tables surrounded by deep, soft chairs and a few screens so that everyone can see the presentation. The staff clearly know the drill; they got the orders in pre-presentation, kept the wine coming, and set and served all the tables smoothly and silently. 

The food was really good! I had a buffalo mozzarella salad with persimmons, tomatoes and a spicy chili relish that was out of this world. Not sure who supplies their cheese, but the little individual mozzarella rounds were smooth and tangy and a perfect match for the relish and persimmon. The tomatoes were less than brilliant, but it's January in Toronto, so no surprise there. My beef tenderloin was perfectly cooked (bright pink in the middle. Mmm) and my dessert of seasonal sorbets (one of which was pear and cactus - is cactus ever seasonal in Ontario?) was yummy.

They were also very happy to accommodate both my gluten-free needs and those of my vegan colleague. No fuss, no screw ups."}
{"text":"I was given the task of making a reservation for dinner for my Mom's birthday not so long ago. Centro had been on my list to try for a while now, but I had been dreading footing the bill. So this seemed like a perfect occasion to give it a try...when someone else is paying.

Overall, we had a very lovely evening, the service was spot on and the food was outstanding. 

I had the tuna crudo for an entree. The flavours in this dish were very delicate. This highlighted the wonderful freshness of the tuna. However, (this is more my fault then theirs) this would have been a much more appropriate starter on a hot summers day rather than a cool fall evening. Everyone one else in my family had the soup of the day which was a butternut squash. I have to admit I was envious. The flavour profile of the soup was exactly what you expect from a butternut squash: sweet and rich. What really made this soup envy worthy however, was the texture. The soup was a smooth as silk.

I made a much more appropriate choice for my main course, the roasted lamb rake. This was absolutely outstanding. They cook the lamb without trimming any fat and leave it on the bone. This result is a heavenly piece of meat rich in flavour and perfectly tender. The sides of zuchini and mushrooms were equally good and lend their earthy flavours to the meat making a very lovely combination. 

I also tried some of my fiancees scallops. These were also cooked to perfection. The sauce that accompanied the scallops was so good that it got my fiancee to eat brussels sprouts, which is a feat. However, the potatoes seemed more like a second thought rather than a integral part of the meal. 

Finally, I shared the cheese cake with the table along with a bowl of barries for dessert. Again both dishes were lovely. 

Now that I have been and had such a good experience I would definitely return again and foot my own bill and not think twice about it."}
{"text":"Took my wife for Valentine's Day as she's always wanted to go. I had been once years ago for a work function in the private space upstairs. It was a preset menu but I remember it being excellent.

The high-ceilinged room with the huge mirrors create an amazing space to have a meal. The room was packed and the noise level high but not so high that we couldn't hear each other. We had a cozy booth in the corner that was perfect for the occasion - it also gave us a peek into the very busy kitchen, which was interesting.

We started with some malpeque oysters which were a perfect bite size and nice and salty. My wife had the deconstructed caesar salad and I had the smoked salmon appetizer. Deconstructed appetizers and desserts are all the rage but I think it actually makes it easier on the kitchen not to combine the ingredients, no? The salmon covered the medium-sized plate and was topped with cream cheese, chopped egg, capers, diced green onion and dill. Very tasty and a unique presentation - I would describe it like a pancake.

For mains my wife had the scallops and I had the lamb. Both were excellent. The scallops were big and juicy and perfectly cooked. The lamb was also cooked as ordered and was very tasty. Sharing a creme brulee capped things off nicely.

Service was professional but not particularly friendly - kinda what you would expect for a restaurant with this reputation. Our waiter must have noticed my face turn sour after tasting my espresso because he brought a new one before I could request it.

Overall I recommend for a special occasion, or more often if you're so inclined!"}
{"text":"The grilled striploin steak was so tender - perfection!!  For appetizers, I had the grilled calamari stuffed with chorizo.  It was alright.  For dessert, I had the Pistachio and Passion Fruit tart.  The passion fruit served as a great tart base - not too sweet, and quite refreshing.  The pairing with crispy pistachio bits was lovely.

I really enjoyed the loud music and open kitchen concept.  It made the restaurant relaxing and lively, rather than fancy and prestigious.  The table arrangement is quite crowded, as they often have to move the tables for the person to get through to sit on the sofas.  The high ceiling mirrors on ends of the room is pretty cool - it was fun to see the never-ending reflections!

All-in-all, a memorable experience with quality food!"}
{"text":"The service never disappoints, while the food is always top-shelf. For me, the preparations are always approachable and based on the highest quality meat, fish and produce. Centro is also one of the best restaurants in the city for a special celebration. I've been here for weddings, birthdays, anniversaries, etc.  When the room is buzzing, the kitchen and wait staff deliver a superb experience for patrons. However, where I think the restaurant hits its stride is when you walk in on a random Tuesday when there are 12 people in the dining room. All I can say is that at that point you've made a wise choice leaving the cooking to the professionals for an evening."}
{"text":"Great ambiance and service. The food was of great quality yet shockingly bland."}
{"text":"Went here for my birthday. It was new years and they had a set menu. The food was great. The waiter seemed a bit pretentious however service was good over all."}
{"text":"We had a dreadful time here on December 14. The service was so slow, we had to ask what was wrong. Turns out, there was a party in the basement and they were under-staffed. Still, It took the waiter about 45 minutes to find out and tell us the wine we ordered was not available. The appetizers took another 45 minutes to arrive, and by then we needed another bottle of wine.  Do you think we could get a second bottle of the wine the waiter suggested for a replacement? Not likely. 

Dinner arrived eventually. We were told it took so long because one of our party ordered the \"Special\" well done. It came cold. We had to wait almost an hour to over cook a cold meal?

When we complained, the waiter was very indignant. When we asked to speak to the manager, it took 3 tries to get him to come. Eventually, he offered to cover the cost of the wine. When the bill came, the 2 bottles of wine were still on the bill. When we asked to speak to the manager again, he would not come out. We found him and pointed out the errors on the bill. His comments were that the waiter was instructed to remove the cost of the wine and that it was the waiter's fault for not doing so. 

I am so terribly disappointed with this experience."}
{"text":"Came here with my wife for a nice evening out just before Valentines day.  I ordered the steak and asked for it well done.  When I received it, I cut it in half and saw that they had cooked it medium rare.  I let the waiter know and he took it back.  They re-cooked the same steak.  When he brought back my 2-piece steak, I cut it into several pieces and notices that they cooked it to medium - it was still very pink inside.  I let the waiter know and he took it back.  What kills me is that they re-cooked the same steak which I cut into several pieces and brought it back. You would think that if 2 people are spending over $200 on dinner, they would at least re-fire a new steak.  How money hungry and greedy can you get??

The next day, I sent them an email explaining what happened and how dissatisfied I was.  Until this day they have never even bothered to respond."}
{"text":"Mmm

The charcuterie board was excellent. I especially enjoyed the duck, but the entire plate was quite good with nice variety. The lobster was just a teensyy tad overcooked for my taste. It did however come with a lovely sauce with spinach, mushrooms, onions, and a little scallop. The sirloin was also very tasty. It was well-seasoned and extremely well-prepared. It wasn't the best I've had, but that's just an unfair standard.

However, dessert really made the meal for us. We had the pistachio and passionfruit tart, which was very good. But the pomegranate gelato it was paired with? Ommmm. I don't think two entities were ever so well-matched (I'm talking Simba and Nala here).  The tart and crunch and cold and sweet also complemented our savoury meal perfectly, which may have augmented my impression of it.

Overall, it was one of the best meals I've ever had. However, the service was a bit lacking - the server forgot our bread, and was hard to catch. We did have a groupon, but I'm not a fan of servers that discriminate about such things.

Food vs price: 4.5/5
Service&ambience: 3/5

I will be back when my wallet is getting too fat and I feel like celebrating with a delicious meal."}
{"text":"It's 11:55pm when my companion calls Centro to ask if it's not too late to come in for a quick glass of champagne, and the answer is \"of course not, come in!!\" 
I'm surprised, since the website says they close at midnight on Wednesday. To which my companion says, \"closing hours depend on who you are\".
I'm not one of those people, but this review could reflect who apparently my companion is... but judging from previous reviews, it seems they treat everyone well at Centro.
When I arrive at 12:20am (b/c I was looking on the wrong side of the street), the restaurant is empty and quiet. It's glorious. The open space on the main floor is vast, yet intimately lit and feels warm and comfortable despite starched and stark-white table cloths. In plain, view bottles and bottles and bottles are displayed against the far wall in a gigantic, clear-glass faced, wine \"rack\". In the front, on display (literally) are the private-yet-public displays of personal wine collections kept in dark wood cabinets complete with plaques engraved with names of Toronto IT listers. They remind me of the drawers at morgues.
The sommelier is no joke here. No rookie, off-the-back of the bottle synopsis. No sommelier snobbery either. He knows his stuff and has mastered the art of telling the stories of wines that keep you interested (re: won't put you to sleep, even nearing 1am on a weekday).
The downstairs is a bit gaudy in my opinion (though my companion raved about the artwork). It's reminiscent of a small hotel's bar/piano room. You should check it out - you sort of have to since the bathrooms are downstairs too. 
I'd like to go back for a meal, during regular business hours. But I'll be sure not to be seated downstairs. I recommend the same."}
{"text":"I think of Centro as an always-reliable choice for a nice dinner; predictably good services and dependable food quality (even though it may not blow you away in innovation / creativity department). 

Went to a large birthday party/dinner recently. The menu has just been revised so it was interesting to try something new. 

Apps: Oysters on the shell are wonderfully fresh. Malpeque, the best variety this side of Atlantic IMO. I had a taste of Olive Oil poached tuna, not bad flavour wise but the cut of tuna had white connective tissues running through so it destroyed the melt-in-your-mouth texture it is supposed to have. Parents liked their chicken liver pate and seared scallop apps. Too bad they did not have beef tartare on the menu this time, was my favourite. 

Main: Wild striped bass with leeks was nicely executed. Liked it but was not blown away. I heard from other members in the party that Grouper stuffed with artichoke was the better fish of the night. Veal chop in pancetta cream was a gigantic piece, tender and full-flavour, really liked the rapini and polenta sides. 

Excellent services, there when you need them but not too intrusive."}
{"text":"Ok, so this is the kind of place where you gotta put on your Sunday best, kids. It's very fancy shmancy and a place I don't usually find myself in. Let's face it, I'm happy with a burrito from my local diner any day. However, I must say that my experience here was very pleasant and if you have the dough and want to really wine and dine someone, it's a very smart choice. 

  The service was exceptional, classy and ultra professional. The server was very nice and reminded me of a Parisian garcon; very polite and charming. The food was pure divinity. I ordered a squash soup as an appetizer and steak for my entree, and hands down, it was one of the best meals I've had in a Toronto restaurant. 

 Centro is an ultra classy dining experience!"}
{"text":"Winterlicious 2010:  Jan 29th, 2010.

Their menu was simple and good enough for Winterlicious.  The Black Cod was a winner, grilled, flaky, delicious, moist, and very tasty.  The beef dish tasted like English beef brisket in a dark sauce.  The appetizers of yam puree and chickpea soup was boring, and so was the single scallop with the standard bacon strip.  A dessert winner was the apple tart with cinnamon ice cream.  The other dessert of chocolate with raspberry sorbet was not a successful pairing."}
{"text":"The good:  Good looking restaurant!  Food was excellent. The wine fantastic.  The Bad:  This night Service was mediocre.  It took way too long to get service at every point. Noise was deafening during dinning hours on Sat night.  Menu was too small in selection.  Atmosphere is great for lovers in a corner but forget hearing the people across from you.  Overall, I would say we were disappointed and would not go back unless during the week when less crowded.  Not enough attention is the problem.  Maybe this was an off nite as this is an extremely popular dinner house.  One more thing:  most classy restaurants ope the door for you when you leave, and have parking attendants that do the same.  We did not experience either.  This was the general consensus of 9 that went there that are experienced restaurant people.  I hope they do better next time.  We will try them again, maybe."}
{"text":"Since moving to Toronto a few months ago, this place has been popping up on our radar as THE place to eat. It was hard to go in without expectations because of the rave reviews written everywhere, and I must say - don't worry about that at all! This place is great. From the very friendly hosts, to the server in the lounge who took the time to recommend a cocktail, to the lovely touch of a complimentary glass of ice wine from their social media manager, this place takes care of the details.
We took advantage of the Summerlicious menu and were so happy with the choices we made. We started with PEI oysters with a very nice mignonette, scallop cerviche (delicious!) and King Oyster mushroom gnocchi (which made its way to the top 5 best dishes I have ever eaten.) The entrée of beef striploin was cooked perfectly and was accompanied by a potato gratin with boar bacon... need I say more? We had a wonderful time in a beautiful room with top shelf food and service. 
Don't check your expectations at the door - they will be far exceeded. You must eat here!"}
{"text":"Stop number two on my WInterlicious road and equally as lovely as the last! I've been waiting for a while to go to Centro and I was lucky enough to be taken here on a surprise date! I was blown away by the quality of the food at these prices! Outside of Winterlicious the menu is fairly expensive, but the deals are great for this event.

In addition to the great food, the atmosphere here just screams class. The restaurant has super high ceilings and makes the place feel spacious even if its packed. Also, apparently on Thursdays, Fridays, and Saturdays they have live music in the downstairs lounge...definitely something to check out!"}
{"text":"I was surprised they still had their Winterlicious menu on. So opted for that. Hd the scallop appetizer, the black cod, but changed up on the dessert end. 

The scallop appetizer came with a few hunks of lobster in a cream sauce and some caramelized bacon on top. My lobster still had some shell on. The bacon was a little dry, too caramelized. My (name dropping) good friend Michael Goudeau noted once on the Penn Jillette Radio show that in some ways adding bacon to a dish is a kind of tacit apology.

The black cod main however more than made up for the 6/10 I'd give the appetizer. It was soft and buttery and just mmmm. 

 I had the chocolate cake that came with a side of ice cream and a wafer. Both were quite good

Attentive, personable, the waiters take time to explain the intricacies of the dish. 

Centro has been a long serving war horse in Toronto for upscale, romantic dining and I think it still hits those marks."}
{"text":"Centro was amazing. Everything about the place was excellent. The lobster spaghetti which I had was top-notch. My friends enjoyed their food as well. The deserts came in sets of 3 for $12, and the three we picked were particularly good. The ambiance of the place was great. We were seated downstairs in the lounge, which was a nice venue in its own right. The upstairs looked great, but were told we would have had to make reservations earlier than we did -- 15 minutes before we showed up. Finally the service was amazing. I don't recall going to a place where they pamper you as much as they do at Centro."}
{"text":"Came here for Summerlicious. The interior was elegant and spacious with super high ceilings. In addition, large mirrors line the walls, making the dining room seem a lot bigger than it is. 

To start, my bf had braised pork belly with sweet apple jam, fried pickle and sprout salad. The pork belly itself reminded me a lot of Chinese roast pork, with a crispy skin and a thick layer of fat. The pork belly wasn't particularly tender, but I really enjoyed the pairing of a rich, fatty piece of meat with the fruity jam. 

I could never resist a good gnocchi, so I went with smoked eggplant gnocchi as my appetizer. I was a little disappointed that I couldn't taste the eggplant itself, as it was incorporated into either the gnocchi or the sauce (I couldn't tell). However, the accompanying mushrooms, ricotta, grilled corn and wilted pea shoots were quite lovely. As with the pork belly, the portions were appropriately small for a starter. 

My bf's main was a beautiful roasted striploin, accompanied by double smoked bacon potato gratin, sauteed spinach and fried leeks. I was totally in love with the striploin, which was achingly tender and extremely flavourful. On the side, the potato gratin was pure buttery goodness, and the bacon added an addictive savoury kick. I only wished that there was more of everything since it was all delicious!

To my own surprise, I went with a vegetarian option- polenta cake with herb breaded artichokes, roasted king oyster mushrooms, chard, vine tomato and onion soubise. I was also very content with my plate of food, despite the lack of meat. The polenta cake was delightfully rich and creamy, and the crispy crust added a great textural contrast to the softness of the polenta. The other standout element was the incredible onion soubise, which I just wanted to lick off the plate. My only problem was the fried artichoke. While it was very tasty, certain parts of the artichoke were so fibrous that I couldn't chew it down, and I had no choice but to spit it back out. 

For dessert, my bf opted for yoghurt panna cotta with peach mousse and white chocolate feuillitine. The panna cotta was perfectly creamy and not overly sweet, and the peach mousse was quite refreshing. My favourite part was undoubtedly the crunchy clusters of white chocolate feuillitine, which reminded me of Clodhopper (which I love!). 

I picked the black forest macaron sandwich with cherry sorbet. I loved the idea of a macaron sandwich, but this certainly wasn't the best macaron that I've had. The texture was on the denser side. However, any shortfall of the macaron was made up by the bright cherry sorbet. It was a bold and refreshing punch to the palate. 

Compared to the other Summerlicious meals I've had this year, Centro's portions were definitely on the smaller side, even compared to other fine-dining restaurants like Canoe and Auberge du Pommier. That said, I didn't mind the smaller portions at all as my stomach capacity is quite limited anyway. The food, especially the mains, was very impressive, and I also loved the panna cotta. All in all, Centro was a very good end to my Summerlicious adventures."}
