{"text":"food is good i eat the bi bam bop which is tasty and fresh."}
{"text":"Food deserves 3 stars, staffs 5. Having said that this is still the best Korean food I've had on the west side of Toronto to all the way in Mississauga. I really want this place to do well so I don't have to drive all the way to Willowdale from Oakville for good Korean food and that's why I'm giving 4 stars.  Service: Top notch. Very attentive but not smothering.  Nuff said.   Food: Osamboolgogi. Surprised by and liked \"bool mot\" or charred flavour, but bit too salty so couldn't really taste the ingredients.  Short rib stew. Decent broth ruined by too much \"mot so geum.\" Meat was not too fatty and tender though.  When I went I was expecting a kitchen run by young kids with very clean palate. Instead I get food that is very reminiscent of old school immigrant style cooking that's very heavy on salt.  I really liked the atmosphere, cleanliness, and the staffs. Just ease off on salts and mot-so-geum and you'll be the best home style K-kitchen in GTA. Still worth the drive from Oakville regardless.  Update:  Food are less salty and better seasoned. So food now deserves 4 stars."}
{"text":"I'm so happy my boyfriend and I went to this restaurant. We ordered the chilli spare ribs and the bone soup on a recommendation from the waiter. This might not be first date food since there are bones in each but the flavors were authentic. The staff were also very attentive and helpful. We can't wait to return."}
{"text":"BEST! I've been twice, both times were so nice! If you can overlook the decor and the intense brightness of the lighting, the food is unbelievably good. My favorite Korean restaurant ever is Chaban!"}
{"text":"Awesome fresh food and family atmosphere. We've been here on some of the coldest days this winter and enjoyed the hot pot and bibimbap. The food is somehow more exciting and refreshing than other Korean restaurants we have tried. The staff is warm and friendly!"}
{"text":"I ordered the Cold Buckwheat Noodle with Spicy Skate, which is part of their Summer menu.  Since I never had them before, I asked one of the staff to explain and teach me how to eat it the Korean way.  There were mustard, vinegar and cold broth on the side.  As the staff was explaining the use for the mustard and vinegar, the gracious lady chef herself approached us and taught me how to blend the cold broth and layered the cooked ingredients...it was one of the most amazing food experience!  Excellent customer service!  I felt honoured when the lady chef came to my table and made sure that I will enjoy eating her dish."}
{"text":"Love the place! I had my doubts when it first opened, but since I have become a regular.  It is a mom and pops type of place where you feel like your grandma just cooked the stuff.  The folks are sweet and I get this just homey feel whenever I go and need that Korean mommy food craving fixed."}
{"text":"Udon noodle with beef on a sizzling plate was tasty and saucy.  The sauce could use a bit of work.  A bit pricey for what it was.  ($12.99) We also ordered bibimbap and though very tasty we could use a bigger portion for the price ($10-$14 depending on the ingredients). Overall pleasant service, quick and easy."}
{"text":"This is a great korean spot on the Queensway in Etobicoke. Authentic food, good service. Bright and clean dining room. The pork bone soup is very popular as are the variety of bibimbaps. I like the Kimchi-jjigae and the seafood pancake. The galbi is good and the kimchi is housemade. Check it out for a fast delicious meal."}
{"text":"Amazing food! I would definitely go back. Had the pan seared chicken and it had a lot of flavour. The place is cozy but the food is nice."}
{"text":"Food was ok but they brought out my companion's food literally 20 minutes after mine, so I was totally finished eating and she hadn't even gotten her food yet. :("}
{"text":"Fantastic addition to the Queensway.   We drove past this place a few times, looked up the reviews on Yelp and decided to give it a try on Friday evening.  First off, the service was incredible! Our server was Hia and she was fantastic. Very informative and friendly. Within a couple minutes, we had drinks and she was helping us with the menu. Two other servers interacted with us during our visit and everyone was super friendly, attentive and excruciatingly polite! Refreshing.  We quickly decided upon bibimbap. Partly due to reviews but also as a way to easily gauge the basics of Korean food. We had our food in about 5 minutes! On top of that, it was possibly the best bibimbap we've had! Purple Korean rice is a must and they didn't disappoint. Toppings were fantastic and varied. The condiments were fresh and homemade.   Hia suggested a sweet Korean rice wine, something we had never tried. Delicious! A revelation we will certainly try again.   We saw a half dozen other menus items we want to try and we will most definitely return!"}
{"text":"This is a perfect Korean restaurant to dine with friends and family. Food is amazing at an affordable price. I certainly feel like home. We ordered 3 dishes: stir fried beef w/ veggie, dumpling soup, and dolsot bibimbap. Will definitely visit again!!"}
{"text":"I'm Korean and this is a place appreciated by non Koreans. Cute place and great to have a Korean restaurant in south Etobicoke, but I would go for Korean food at better prices in K-town Christie/Bloor or north York."}
{"text":"Staffs are very friendly and excellent service....but, foods are just okay.....well, actually some were good but some were..meh.   Beef Salad: tender beef slices well presented with the fresh spring mix. Their house dressing was very delicious.  Bulgogi : meat was a bit tough and dry. The portion is kinda small compare to other korean places  Bossam: not the best one you can have in this city, the meat wasn't as tender as I would've liked and other complimentary salads were too salty.    Dumpling Jungol: Tasted like something is missing...not very flavourful. Dumplings are good tho."}
{"text":"Went with my fiance earlier this evening for dinner. We knew about it since we had walked by it coincidentally about a month or two ago before it had opened and spoke to one of the owners or workers to ask when it was opening. As she is Korean and from North York where Korean Restaurants are everywhere, we had a tough time finding one we enjoyed in our neighborhood since moving here last year. I Really enjoyed the Bibimbap and my fiance enjoyed the pork bone soup. The service was very good too. Everyone was smiling and very helpful and polite.  The prices as with most Korean places were very reasonable. It's by far the best Korean place we've found in Etobicoke. Both of us will go back there, probably soon."}
{"text":"I had the best Korean meal at a wonderful restaurant named CHABAN.  I have travelled to Korea several times on business and I must say that CHABAN had served me  the best Korean food I have had in Toronto. The food was perfectly prepared, flavourful, abundant and authentic!  We were a group of 4 and the owner Hansoo had suggested we share several dishes, the Korean way. Each dish was fantastic! Hansoo had prepared for us dishes ranging from Pork, Beef, Short Ribs, Seafood and more. Each dish was exquisite.  Speaking to the owner, Hansoo I learned that CHABAN  is a family business. His mother works in the kitchen and his lovely wife works in the dining room along side him. This explains the warm atmosphere and the authenticity of the Korean food and the overall Korean experience.  CHABAN is a real gem and I am so pleased that we have such a wonderful Korean restaurant in our neighbourhood and you don't have to travel 20+ hours by plane to experience the amazing Korean cuisine or its warm and friendly people.  A great restaurant and I would suggest that if anyone wants a taste of Korea in Toronto, visit CHABAN."}
{"text":"I enjoyed this korean joint. There was nothing in particular that blew me away, it was just plain ol' good korean :)  The food (4/5): Bulgogi - super thin cuts of succulent marinated beef that is bathing in its own sauce... Could not ask for more. However definitely not a dish for 1, at least 2 should have a go at it. I ended up pairing the bulgogi with the kimchi fried rice which I was slightly disappointed as it was labeled as spicy, but was sadly not spicy at all. However I enjoyed the all around flavor of the pickled cabbage fused with rice and the slight crispiness of the fried kimchi that I had with each bite. The seafood pancake wasn't really what i was expecting but it was still good! Can definitely get the seafood flavors from the calamari and a bunch of whatever they put it in it haha. I thought the batter may have been a bit much, but who doesn't love a little more fried batter than they bargained for?  Cost (3.5/5): $10ish per dish. It's not cheap, not expensive. Standard.  Service (3.5/5): There were 2 waiters who were both friendly and accommodating. They spoke English well which is a plus, however I would have rather them left a jug of water for my party of 2, because they weren't too attentive in coming around with water frequently.  Ambiance (4/5): The place is new I believe so its very clean and modern-esque. Very well lit from the outside and the inside. I liked this place :)  Overall, a solid 4/5, would come back!"}
{"text":"I really wanted to love this place, especially since it's within walking distance from my condo and good, authentic Asian restaurants are so rare to come by in the West end.   However, it's the 2nd time i've come here and the food has been average. I ordered the Pork Bone Soup and although it was loaded with pork bone, the meat was tough to the point where I had to gnaw the meat off with my teeth ( not my most ladylike moment). Ideally, the pork should fall off the bone easily with chopsticks.   Also, my rice was soggy ( must have cooked it with too much water) so I barely ate it.   The Mister is Korean and thought his dish ( Spicy Beef Soup) was average as well.   However, the staff were really friendly and the service was top notch ( one of the waitresses even offered me finger gloves so that my hands wouldn't get dirty from handling the pork bone like a neanderthal)"}
{"text":"The place was very busy on Friday night during their first week in business.  We had the pork cutlet and pork bone soup.  Both were very good as were the usual little appetizers that accompany Korean meals.  The service is prompt, friendly and helpful.  The restaurant is bright and clean.  Probably not suitable for a quiet, intimate dinner but despite the full house, it was still easy to have a conversation."}
{"text":"Loved this place, very well-trained servers and the food was great! They provided everything I asked for kids, still smiled!"}
{"text":"I've eaten here about 5 times and had take out roughly the same amount.  I typically get the pork bone soup, but I've also had the bibimbap and a few appetizers.  The pork bone soup is good. Definitely not great. The meat on the bone that I'm use to from \"Thumb's Up\" on Bloor/Bathurst, literally fall off the bone and is extremely tender.  Not so the case at Chaban, the 8 times I've had it. This is the ONLY semi Korean place in our area - hence it does fill the craving.  Would I come back here again - of course - it's the only place around.  Would I recommend it to a friend - probably not. Unless they are REALLY craving some Korean eats and is driving along the Queensway."}
{"text":"Great korean food in this area! We don't need to drive to Bloor or Yonge & Finch anymore for a good gamjatang or soon dobu. I also like their seafood pancake here."}
{"text":"Amazing service with a nice family atmosphere. Have been ordering takeout recently as well and the quality is just as good. The beef short ribs and the dumpling casserole are incredible!"}
{"text":"Good Korean home style food at a fair price.   The foods are not bad but not so good.   I am Korean so it was not tasty enough for me.  In terms of taste, the Insadong restaurant would be much better for me in etobicoke area.  Service was also slow but I think it was within reasonable speed.  They are located royalyork and queensway in etobicoke. And I love their concept and effort for korean food.  The restaurant is nicely decorated and they have open kitchen.   Free side dishes provided are good and looked clean."}
{"text":"This used to be a five star but since getting popular, they are really understaffed so service has suffered.  They also try to cram as many tables in a tiny restaurant as possible so it gets stuffy in there.  The food is still decent but not worth the long service wait times anymore.  There are other Korean joints with similar quality if food but better seating."}
{"text":"Discovered this hidden gem, which is now my new favorite Korean spot. Great variety, good portions, reasonably priced. Menu is condensed enough that it listed out on 1 page that serves as a placemat. It has the typical Korean restaurant fare, but I liked some of the few extra things they add just to make it a bit different.  If you are looking for a starter, I recommend the kimchi pancake. The crunchy texture was really addictive and had me craving more even when I was full. Some places tend to over-do the starchiness of the pancake, but not here!  I ordered the Mushroom Dolsot Bibimbap as my main, which I would reorder again if I was craving a vegetarian option. The rice was perfectly crunchy, had a large portion of vegetables than I expected to rice, and the sauce is flavorful but not overwhelming.   Gamjatang (pork bone soup) here hits the spot on the cold day. Compared to other Korean restaurants, the pork bones were rather generous and meaty as well as not being too greasy.   Ordered the pan-fried noodles with beef (essentially bulgogi with vegetables on stir fried udon) and I liked the flavor. Overall, I'm inclined to think there aren't any \"bad\" dishes on the menu.   The restaurant is quite small, so it can get quite busy depending on the time you go and parking is very, very limited (better off parking across the street if you had there for dinner)."}
{"text":"Was a bit disappointed.  Came here for dinner for the first time, and was quite eager to try this place since it was busy and seemed very authentic.  Ordered the seafood soft tofu stew and pork bone stew.  Food took FOREVER to arrive (we waited more than 30 min), and they forgot my drink.  And they don't serve the little dishes until your main dish arrives (which isn't the case in other Korean restaurants?), so I couldn't even nibble on snacks while I was waiting.  They were clearly understaffed, because the 3 servers that were working were running around like crazy, trying to deal with kitchen orders, a million take out orders and dine ins.  They were very friendly however and apologized for the wait.  Food was okay - my tofu stew was very bland, and barely had any seafood in it.  I would give this place another try, but can't say I was impressed on the first go."}
{"text":"Hubby and I came here on a Thursday right at their open time (11:30am). I chose this place because its close by and had great reviews from fellow yelpers. We were not disappointed. Upon entrance we were promptly seated. The restaurant itself is nice and clean and quiet. The staff, I'm guessing family owned are super courteous and nice, as expected from most Korean places.  We ordered: Dolsot Bibimbap Spicy Beef Soup Steamed Dumplings  Both were delicious! My husband loved his bibimbap, it was nice and filling and the sauce was on point. The Spicy Beef Soup was Spicy and delicious, paired with the purple rice that I love. Appetizers were also given, and t hey were not skimpy with it either. They actually offered to give us more, where other places wait for us to ask.   The menu varied from different types of stews include: tofu, beef, pork bone. To different types of bibimbap. To small appetizers, or large shareable hot pots. They also had a section of main entrees.   Overall, great experience. We will be returning to try all the other good stuff, especially since its nice and close by!   For parking, park on the smaller side street. Allowed up to 1 hr :)."}
{"text":"Authentic Korean food in Etobicoke. It is a hidden gem in a community that lacks good quality Asian cuisine, this is a place I will always return to. Their pork bone soup is not like many quick Korean \"fast foods\" that throws kimchi to flavour their broth, once the soup hits your palettes you can be sure that they used soy paste, red chilli paste and many various Korean ingredients for the soup. Their portions are generous and prices are fair, not upmarked because theyre one of the few asian restaurants around."}
{"text":"This place is very good! Service quick flavours amazing. Korean food great introduction and price very reasonable."}
{"text":"Best Korean food I've ever tried in the GTA. I've been here multiple times and the food is always on top of the game. I ordered soft tofu kimchi stew and it's made to perfection. Their good quality and flavourful dishes brings me back every time. If you like spicy and flavourful Korean dishes with fresh ingredients, this is the place for you. They're super generous on their portions too!  Highly recommend.   5 star for food and 5 star for service. Every time I dine in or get take out, the service is very friendly and attentive.  Can't wait to come back again. Yummy!"}
{"text":"I'd been eyeing this place since it opened and never had the opportunity to go in, or when I was looking for something to eat I forgot all about it - that won't happen anymore, I can guarantee that.  Looking for a lunch that satisfies both the omnivore and a vegetarian/vegan taste, look no further as Chaban has made many parts of their menu fresh and totally flexible to suit all needs and tastes. As others mentioned, this place is well lit, clean and extremely authentically Korean. The one issue can be parking as the lot around back is small, so you may need to resort to street parking.  If you're unfamiliar with Korean cuisine and this is your first time, you really cannot go wrong with a few staple items, Kalbi (galbi), bibimbap (rice topped with fresh veggies and meats or tofu served in a blazing hot stone bowl), Chicken Katsu and Gamjatang (pork bone soup).  On this first visit, a lunch, I should have just gone for one of the above but it had been so long since I had had good Korean food that I ended up ordering far too much. I went with a Pork Bone Soup to start - which was sizeable (a meal in and of itself), followed by the Mushroom Bibimbap bowl.  Food came out basically all at once so I looked like a bit of a glutton, but I'm fine with that. To begin, the pork bone soup was outstanding! The pork was incredibly fall off the bone tender and had a great taste to it and not super fatty either, while the broth was extremely clean, jam packed with flavour (and even more jam packed with spice - I choked on the spice more than once).  Following the PBS I worked on my Bibimpab. It wasn't the hottest bowl I've ever had as it really wasn't sizzling all that much as I've come to expect, so the rice didn't crisp as it should. That aside it was still crazy hot and did the trick enough to be more than enjoyable. All the ingredients were incredibly fresh, so much so you could smell the freshness. The meat was equally delicious and all together the dish was just fantastic.  My one observation about stuffing yourself at a place like this is, yes, you feel full, but it's not a gross full feeling like when you eat greasy or unhealthy foods. It's an extremely content full that you're body is able to deal with easily and quickly.  I'm glad a high quality + healthy place like this opened close to home for me as I can safely say this winter it will be my go to for healthy and tasty lunches.  Eatcrest Out"}
{"text":"I've had takeout from Chaban twice now.  It is solid, tasty homecooked-style Korean food.  The pork bone soup is not only delicious, but very reasonably priced.  I did find a couple of things on the menu a bit puzzling, price-wise, though.  Bulgogi is a bit steep at 13.99, and doesn't come with any sides/veggies - it's just a portion of meat and onions.  Most things on the menu are a good value, and very tasty."}
{"text":"Authentic Korean food, very delicious! It was packed when we went, and full of Koreans (which means it's authentic and good!) highly recommended. Prices are reasonable."}
{"text":"Fab addition to Etobicoke!  Terrific staff, excellent food, compelling value!! Glad to have them here!"}
{"text":"Not good. I like Korean food and have been to many Korean restaurants. The food at Chaban is bland and lacks of seasonings. The pork bone soup lacks flavour and it needs to be cooked longer. For well cooked pork bone soup, the meat should come off the bones easily. The service is not very good either. My friend ordered the bean curd stew but didn't like the taste so he ordered another dish, they charged him for the bean curd stew anyhow."}
{"text":"This restaurant has gone down hill since I was here last.  My friend ordered the bean curd stew and had to return it because it was too dry - there wasn't enough water mixed in with it.  They took it back, and then it was over cooked.  I ordered the chicken katsu, and found a hair in my potato salad.  No apology or no offer to take it off the bill. This will be the last time I ever come here."}
{"text":"I ordered the mushroom and tofu bibimbap with no meat. It was absolutely delicious. The best one I've had. The appetizers included kimchi cabbage, cucumbers in a chilli sauce, pickled radishes and pickles seaweed. Everything was very tasty. I appreciated how clean and organized the place was and how friendly and polite the staff were. Very cultured. The washrooms were clean as well. It might not be on the top of everyone's list but it's important to me. I have nothing negative to say about this place. I'll be going back for sure."}
{"text":"I grew up beside a Korean family and the feeling when I first stepped inside Cha ban was very familiar. The smell and sounds of a family kitchen with conversations spilling  out into the room. Warm and welcoming with a big side of sizzle and spice. I ordered the mushroom dolsot bibimbap,  which if you exclude the yummy pork and egg would be a vegetarians best friend. The ample Banchan  and soup that accompanied my sizzling hot stone bowl was just what I needed and the house made gochujang had flavour that balanced out the spice. A great addition to the Queensway strip.  No longer do you have to head to Bloor street to get your fix.   I'll be returning as the kimchi soon dubu stew is calling."}
{"text":"LA kalbi was the best and kimchi pancakes were delicious. Quick friendly service from staff."}
{"text":"Much like the other reviews, the overall food and atmosphere had a very \"home-ly\" and family vibe. Kinda like eating at my korean friends home lol. I've had some amazing food in Korea and this is remarkably close to it. Service was great, even had the mother cook come out to serve us.  Amazing food and quality service, hard to find these days. Will return soon!"}
{"text":"I haven't had good Korean food in a while and I'm not including the Korean fried chicken/beer kind of place.  This restaurant is NOT one of those as it's a real sit down, well lit, not everything is deep fried, family style Korean place.  Sure they have those common water decanters and yes they also happen to serve beer to but it's not a bar, it's not a pub it's a legitimate non fried chicken type of place.    The closest thing they have to fried chicken on the menu is probably chicken katsu which I also like but there's so much more to offer and on the menu here not to mention the place upon entering smells absolutely divine.  Whatever else everybody else is already eating... take a peek.  Don't gawk too long because that's rude but yes, have a look and you'll probably say to yourself, \"dang I like that and wow does it ever look and smell great!\".  Mouth water dishes... the sound of sizzling plates brought to your table... portable burners brought to the tables and being lit!  Hey we're still in Etobicoke right? I can see how this place can make you forget.  I have to admit I was hungry.  I had food on my mind REALLY badly before coming here.  I ended up parking in the parking lot in the back where there seems to be a BMW with a destroyed front driver side covered with a tarp.  I didn't park beside that car... still I parked and I was so hungry I left my phone in the car... oh and I didn't even turn off the engine before I got out.  I forgot!  Yes, I shut the car off after the car was beeping as the key got too far away.  The restaurant was more than half full upon entering and yes there was that wonderful smell of great food and that sound of sizzling steaming hot plates.  I love this cuisine.  I ended up ordering the Chaban bibimbap stone bowl and it was exactly what I wanted.  That rice getting slightly crunchy on the hot bowl... mushrooms and beef, veggies made a really nice mix and then the egg on top is like a cherry on top of a sundae... you complete me (said the bowl of food to the egg).  A side of chili paste and a bunch of other sides you know the usual pickles, sprouts, kimchi, etc.  Korean always has side plates for other stuff.  I like that.  I had ordered a starter of galbi which had about 5 or 6 pieces.  It was served sizzling on top of onions and hey that smell of sizzling beef with onions... ya that's a winner.  Besides the meat and stone bowl we also started off with some Max Korean malt beers because we wanted the experience to be complete.  I am sometimes asked in all the places I go for to have Korean fried chicken if they serve Max... well this place does serve Max so there's your answer.    My friend had the bbq pork ribs and that too came sizzling to our table.  The food here is really good and I can safely say because of that I really want to return.  There's so many dishes to be had here I want to try everything because there's so many things I saw others have as well where I was actually jelly of their dishes while I was eating mine.  Sure I'm greedy but hey the food here looks, smells, sounds and tastes great!  How can I help it?  They also happen to sell their kimchi for take home.  They have two examples of the contains they have where one is a small reasonable sized container for 5 bucks and the other is almost 4 liters and is over 30 bucks!  Their kimchi is so good I can see myself taking some home one day."}
{"text":"SO TASTY! They were closing up soon but accommodated me nonetheless. The seafood udon was fresh, flavourful, spicy and perfect. The service was attentive but non-intrusive. The decor a little cafeteria-like the way a lot of Korean restaurants are. I respect this place for doing straight up Korean. The little side dishes of pickled/spicy/fermented goodness were great. I wish I could have eaten 2 of those seafood udons though. So good."}
{"text":"So happy to have a good korean restaurant on the queensway! Every time we drive by the queensway you see the windows at this restaurant fogged up and filled with lots of people. Came in on a week night and still had to wait about 10 minutes for an open seat. The restaurant has a very homey feel, A mom and dad is in the kitchen and their kids (I'm assuming) are out front serving and at the cash. They have a pretty extensive menu with the classic korean items.  We tried the bulgogi sizzling plate, the fried chicken katsu and also the classic pork bone stew. The pork bone stew was flavourful, spicy and homey tasting. The bulgogi portion was bigger than i imagined it to be, it also came with alot of different veggies (Zucchini, onions and carrots) it was also very flavourful and hubby quite enjoyed how piping hot it came out. The chicken katsu was crispy and tasty as well but it's not a must get from here. Side dishes at korean restaurants are also my fav and the ones here did not disappoint. The kim chi here has the right amount of spice and saltiness and leaves you wanting more and more refills!  A bonus is that justeat actually delivers chaban if you're within the area but we never tried... contemplating how that will taste especially if you were to order a stew. Nevertheless, will be returning again, especially on a cold day for some homey korean food!"}
{"text":"The Gardiner was busy so detoured to this little korean restaurant to kill some time.  The side dishes was just okay...home made kimchi.  The oxtail was good so was the other food...  decently priced...will come back if stuck again in traffic."}
{"text":"It must have been what I ordered but I got an immediate migraine after eating my soup. It's either the amount of sodium or they add MSG to the food. We ordered a Korean Pancake to start and that was yummy. I would try this place again but perhaps order a different item. Overall, food is tasty, service is great and price is on point."}
{"text":"Chaban prepares great food consistently. Awesome Korean food, pleasant wait-staff and take-out Kimchi in Etobicoke.  My family and I come here on a regular basis and we have not been disappointed. Once you have dealt with the parking chaos to get to the restaurant (NOT Chaban's fault! - there is plenty of space on side-streets) then you can relax in their basic but very tidy ambiance, look at the nicely-drawn blackboard of Bibimbap selections, and then your appetizer dishes will appear shortly.  The Banchan (appetizers) are always fresh-tasting and vary according to the season. Excellent! We also ordered the Kimchi Pancake, which was both crispy and moist - just what a savory pancake should be. It is even good cold the next day, and I really do recommend it.  Our main courses were also very well prepared. My daughter's Pork Katsu was crisp but juicy, my son's Spicy Chicken lived up to its promise, with white meat that was juicy and not dry, and my Mother's Chaban Bibimbap was as brilliant as it always is. Bibimbap is my go-to order here, so I decided to try something new: the Bean Curd Dregs Stew.  Sounds appetizing?  Well, it was great! Almost soufflé-like in texture, but so full flavoured. It came bubbly and hot at the table (it was quite spectacular, actually), and kudos to the staff for pulling off this great soufflé-like soup. A savory and unique soup, with its special texture: a true treat. Bibimbap, move over: there's a new contender! However, my Mother will always order the Chaban Bibimbap.   Chaban serves up some great food, albeit a bit pricey. However, if you love great Korean cooking, then Chaban is a good place to go"}
{"text":"Been going here since it opened. Food is high-quality and tasty. I like Korean food and I have my regular haunts which include song cook and Chodang. I come here for the mushroom bibimbap which is in my opinion, more refined than other places and the short ribs are good and the seafood pancake is really good. It's getting a lot busier as it gets more popular and is no longer a secret. Great food at reasonable prices, I will keep going back even if I have to wait in line at peak hours!"}
{"text":"Came here on a Tuesday night. Restaurant was slammed with a full house and apparently a bunch of takeout orders. So unfortunately we had to wait 40 mins for our food. Even the appetizers took that long to come...which should not be the case since they are premade and cold. The portions of these apps are also tiny compared to some of the other Korean restaurants I have been to.   For the mains, I ordered the bean curd stew and my husband ordered the summer cold noodles. I didn't like my bean curd dish... It's an acquired taste in my opinion and it's not my cup of tea. My husband liked his dish.  Overall, I would not be returning, the service was so-so, the wait was long, and the food was average at best."}
{"text":"Best Korean food in Toronto, much better than those at Yonge/finch.  Service's even better, love this place, and will definitely come here often."}
{"text":"Impressive! Definitely one of the better (if not best) Korean restaurants in the west end. Modern yet quaint, very clean, extremely attentive and friendly servers, and most importantly, delicious food with decent portion size.   First, the parking situation. This place is located just east of Queensway & Islington Ave, and it can be a bit difficult to find street parking along the Queensway at certain times of day (if any). We ended up finding free parking on one of the residential streets just north of the restaurant (a minute walk away).  Second, the ambiance. Decent amount of tables (there's even a private party room at the back). It isn't a big restaurant, but it's a decent size. It's very, very clean and well-maintained - tables are spic and span. Servers greet you right away with a smile and have no qualms going through the menu with you.  Third, the food. A pretty extensive menu and various specials listed on the board by the entrance. After glancing at the different types of Bibimbap available (Dolsot, Chaban, etc), my first noob-ish question was \"excuse me, what's *Chaban* Bibimbap?!\" Apparently, \"Chaban\" isn't a \"thing\" per se, it's the style of cooking. The Chaban Bibimbap at this place has a couple of special ingredients that the classic Dolsot doesn't have: bellflower and \"bracken\" (another type of plant). So we ended up ordering a) the Chaban Bibimbap, and b) the Beef Bulgogi with rice. Everything was DELICIOUS - and, the best part, they don't skimp on the meat! They were very generous on the portions of beef in both dishes. Everything was flavourful, comforting, and of very good quality.  Overall, a great experience. Casual yet clean. Flavourful, homestyle dishes. Great music and bright atmosphere. It's a bit pricier than your usual Korean restaurant, but the apparent quality makes up for it. I didn't come in here expecting much, but left very satisfied.  For two people, with tax, and tip (no drinks), we paid around $35.00."}
{"text":"A true hidden gem. Came here after a long day of work outside in the cold. The restaurant is located on the Queensway with a parking behind the restaurant. Came her on a Thursday night at 6 pm and there was no one in the restaurant. The waiter was friendly and but didn't seem to speak much English.  I ordered the kimchi fried rice with an egg on top ($10.99) and the dumpling soup ($9.99). The fried rice was okay. It wasn't spicy at all and didn't have a strong kimchi flavour to it. BUT the dumpling soup was amazing; it hit the spot for a cold day. The broth was light and the mandu was so good! Best mandu soup I've ever had. Definitely will be coming back."}
{"text":"A small restaurant on the side of Queensway. If you are arriving by car, you will have to find side street parking. I ordered the mushroom bibimbap. I got exactly what I expected from the bibimbap. The egg was nicely fried with enoki and shiitake mushrooms topped on the rice. The shredded seaweed added a pleasant salty taste. Overall the meal was satisfying. The service was bad. My food took over 25mins to arrive. During my wait, there was no communication of a delay. I did not get any side dishes until I got my food. Even when I received my food, I had to ask for side dishes. I always thought it was automatic for Korean restaurants to provide side dishes while waiting for your food. You get these tiny cups for water so you always had to flag waitress for more water. My water was never refilled without asking. It got so tedious, I eventually asked them to just leave the jug of water at my table."}
{"text":"HOLY GOODNESS! This etobicoke gem is as good as it gets for korean food! Trust me when I tell you, I've had good korean food. I'm a k-food fanatic. I'm everywhere, markham, richmond hill, koreatown north york, koreatown downtown.. I'VE HAD IT ALL. This place changed my foodie life, okay.  Chaban is pretty big and service is quick as well; they were pretty friendly compared to other korean places. I was pleased to see they had many vegan options - including the option to sub in tofu instead of meat in your bibambap. It wasn't shitty tofu either, it was a bit crispy and it came in strips. So damn good! With all the sriracha I added, the rice and everything in it crisped to perfection in the stone bowl. Every bite meant a new level of happiness for me.   The menu offers a lot of delicious and traditional korean food with many customizable options.  Such a big fan of this place! Must come back for it."}
{"text":"A much needed addition to the neighbourhood. Good and service both fantastic. It's not fancy but it has more personality than most."}
{"text":"The staff is friendly and the restaurant is neat and tidy. The food is fresh and doesn't taste like it's full of MSG which I liked. But, with that, the flavour is underwhelming and not properly seasoned for the most part."}
{"text":"As a Korean foodie, I do an extra thorough research before I choose the place to eat Korean food. My boyfriend and I came here with high expectation based on great reviews and pictures from instagram and yelp, and we left with satisfaction. Hands down one of the best Korean restaurants I have been to in GTA (yes, I still have many places to do reviews on :P). What makes this place so special among many Korean restaurants is that their service. Very attentive and friendly.   Since it was our first visit, we went with the safe dish. We ordered small shareable pork bone soup which comes in a huge pot with a portable gas stove. So much food!! We took 1/3 of it home. Small size can easily feed three people. There was a lot of meat, two big chunks of potatoes, and glass noodles. This dish can be a bit too spicy for those who do not have a high tolerance for spicy food.I wasn't a huge fan of their kimchi, was a bit too sour, but other than that their side dishes were good and healthy.   Overall, great service and food! They just opened, like 6 months ago, so the place is very clean. We will be back here soon since they have other dishes I really want to try."}
{"text":"Went here because it was close to where we was and the reviews were good and we were craving Korean food.   I mistaken ordered the pork rib in chilli sauce thinking it was just pork. My mistake. The pork rib was lacking flavor and was not traditional Korean food, so I was disappointed.   I will have to go back again and get something else and then I'm sure to up the rating to 4 or5.  But until then, I'll give it a 3 and not going to recommend the pork ribs."}
{"text":"I was told by another Korean that Chaban is a let down, but I did not listen to her and wanted to try it out for myself especially given such high ratings on yelp. I think this place is decent if you don't know how to make korean food at home, but seriously.. my mom can make better korean food than this. It's not bad but it's not great! I recall there is another korean restaurant in Etobicoke (near Islington station?) and I remember liking the food more there. We went to chaban on a weekday evening and it was pretty busy, so clearly this place is loved by enough people (one observation: we were the only Koreans eating there)."}
{"text":"Good example of how you can have a 'relatively' bad location and still very much make it work.  Queensway is an ugly mix of mostly car traffic, not much reason to walk these stretches.  Plus parking is not good for Chaban (side street or across the street best options; back lot often full).  Oh yeah, this is a 5 star rating (get to good stuff!); I read about the friendly staff, it's not exaggerated, really accommodating and helpful (Edward! :) I've had food in Korea town (Bloor St), it often leaves me feeling a bit 'gross/greasy', this felt home made and cleaner, certainly much better than what I've eaten in Korea town. Probably looking around 15-20 for most meals, so not a cheap option.  I enjoyed it, would return."}
{"text":"Came to Toronto on a last minute decision trip from New York. Tired and hungry we found this gem in Etobicoke! Raised on Korean food all my life I'm not too easily impressed. Boy was I wonderfully surprised at Chaban! I lucked out and was able to enjoy their cold buckwheat noodle dish, which is served in the summer only, with an order of LA Galbi (BBQ short ribs).   Will definitely return to Toronto to eat here!"}
{"text":"Consistently great Korean food!  Always try to stop by when I'm in the area. Perhaps a bit pricier than the average Korean place, but worth the splurge.  Service is friendly, food comes out quickly, painless experience all-around."}
{"text":"Great little spot! One of new \"go to\" favourites! This was our second visit, we popped in for lunch last week and we're pleaseantly surprised. Delicious food, fast service and sweet servers. Easily one of the best Korean resturants in Etobicoke.  It has seating for about 20, and is closed on Monday.  Some parking in the rear, or 1 hour street parking right beside."}
{"text":"The food is actually pretty good. The service was great except for the one female server who came running at us and yelling at us for her technical mistake. The place is pretty small and the \"today's special\" is actually their everyday price, it's the exact same as their menu. Marketing scam really."}
{"text":"Who doesn't love a good bibimbap? I've eaten this classic Korean dish many times over the years and always enjoyed it, although I've never been able to say that I've had what seems to be the definitive version of the dish. Until now.  We arrived at Chaban at around noon on a Saturday and the place was empty. I already knew what I was going to order before we even got there, so I quickly told the waitress that I wanted the Chaban Dolsot Bibimbap.  The tiny appetizers that always accompany a Korean meal arrived shortly after, and they were good (if not spectacular). The spicy kimchi was the highlight to be sure, as the other three were edible but forgettable.  The main course showed up soon after and it was accompanied by a mug of miso soup and a small bowl of red chili paste sauce. I poured the sauce in the hot stone bowl and began mixing. The first bite was heavenly and so were all the bites that followed. The meat was cooked perfectly and the various veggies provided an excellent accompaniment. Really, I have no complaints. If all bibimbaps were this good, I'm sure I'd make it a point to eat this dish on a weekly basis."}
{"text":"It was our last day in Toronto, and we stopped by Chaban for a late lunch before heading to the airport to fly home. There is some parking in the back of the restaurant, but since it was full, we parked along the residential street a couple of blocks away. We ended up ordering:  Bibimbap: this was good (served in a stone pot, with soup on the side)  Seafood tofu soup: spicy seafood soup with tofu is always satisfying  Kalbi short ribs: I got the appetizer portion, and it was nice and juicy  Overall, we liked the food. It was quick and no nonsense, which is what you want to have for lunch."}
{"text":"I've been a couple of times and the food is super tasty! The dishes are traditional Korean. I love the kimchi with pork and the bulgogi! The prices are fair too. Make sure you flag down the waiters for water though because they don't come around often."}
{"text":"Mmm mmmm mushroom bibimbap!!! :) Whenever we drive by Queensway .. my fiance and I always notice a line-up or a packed house at Cha Ban. Finally got to try it this evening and they did not disappoint! Arrived at a full house, thankfully saw a table free. Delicious food, wonderfully priced for the portion, and did I already say delicious?! Will be returning here many many many many many times! :) Thanks Cha Ban!"}
{"text":"Chaban serves delicious homemade Korean staples in a casual friendly setting. They just opened a couple of weeks ago, so I tried lunch on a Friday afternoon. The soft tofu stew was delicious...all accompaniments were very good too. Servers and owners were very friendly and service was prompt... Another hidden gem has arrived on the Queensway!"}
{"text":"I love Korean food... but, have chosen to go to this place only once or twice.  This place seems to be targeting the mainstream crowd and their tastebuds.    Unfortunately didn't make my list of go-to korean joints."}
{"text":"Propably \"the\" most authentic Korean restaurant you would find in Ontario (at least these days now).   Mandoo (Dumplings) made on the premise. Kimchi made on the premise. (Have seen the owner lady makes them in a room all the time) I say almost all food is prepared as a full-time Korean mom would cook at her home.   I see Koreans, Asians, Caucasians, workers, students, families, grandmas and grandpas, all kinds of people come in and eat here. This tells a lot about this restaurant.   Come. Choose any dish and you will like it. The most comfort, delicious, accommodating, and authentic place you'd find for Korean food.   Did i mention? The price is unbeatable, too. Service? True Korea-degree level of service. Smile and kindness."}
{"text":"This place has the best Korean Food in the entire city ! The staff is super nice and I the food was ready within 7 mins of us ordering it !"}
{"text":"Everything was perfect. The best spicy beef short ribs! Highly recommend this place. The service was fast and the staff are super friendly :)"}
{"text":"Love this place. It's small but everything is delicious. The kimchi pancake is a hit or miss depending on who' making it...but when it's a hit it's so good!!! And the beef short ribs are easily the best in the GTA. I'm also a big fan of their soups."}
{"text":"Food 3.5*, Service/Atmosphere 4*  This place was busy on a Friday night for dinner.  Most patrons were Korean, so that's a good sign to me that it's authentic &/or Chaban doesn't have much competition in the area.  Most Korean joints are a bit more North on Bloor/Dundas area.  Chaban is located a coupla doors down from Kaji.  What immediately stood out for me is that the restaurant was a newly reno'd spot which was nicely lit.  We were greeted by a friendly male server and didn't have to wait long before being seated.  I ordered the Pork Bone Soup ($8.99 or $9.99), this is my standard dish that I'll have when I'm trying out a new spot.  All the ingredients tasted very fresh to me, including meat which seemed to be of a better quality.  However, I must say that it was a tad on the salty side for my liking.  Rice was slightly smaller portion, but I didn't mind since it was more than enough for me.  Again, service was more engaging and definitely more friendlier than other Korean restaurants, so that was a definite bonus!"}
{"text":"My family and I were craving Korean food and this was one of the few places that was opened on Easter Sunday. The place is a good size for a family-run restaurant. The decoration was okay, modern and clean. We were seated immediately when we got there.   We ordered a bunch of stuff to share amongst the 4 of us: Chaban Dolsot Bibimbap ($11.99), Seafood pancake ($14.99), Pork Bone Soup ($8.99), Bean Curd Dreg Stew ($10.99), LA Kalbi ($18.99).   The chaban Dolsot bibimbap was highly recommended by yelpers and it sure was the best dish of the night! There was quite alot of \"filling\" or meats/veggies and an egg in the dish. The rice at the bottom was crispy, which is my favourite part of the dish.   The Pork Bone Soup was very disappointing. This is my dad's favourite dish and he was quite excited to eat it when it was served to him boiling. However, as he took a few bites, he complained that it was COLD on the INSIDE. We all took a few bites and we thought the same. The soup might look boiling on the outside, but it is obvious they just reheated the meat and didn't boil it long enough. We called one of the waiters over and told him our concern, but he didn't really know how to deal with it. In fact, he looked scared that he might need to give this dish for us for free. He just stood there for a few seconds didn't know what to do or say (no, there wasn't a language barrier as he could speak English very fluently). So we suggested that he reboils the PBS. He gladly agreed to do so.   The seafood pancake was also very good! It was eggy and fluffy, just the way my family likes it. There was a good amount of seafood in it. I liked how it wasn't oily at all.   This restaurant was one of the few restaurants that served my favourite Bean Curd Dreg Stew. It is basically grounded up tofu stew with meat and kimchi. As expected, it came boiling (literally bubbling everywhere). I've had this stew many times in Korea, but this one tasted very weird to me. I am not sure what it was, perhaps the tofu? The taste was off.   My mom ordered the LA kalbi because she saw another table order it and it looked delicious. It wasn't anything special; it was pricey and it was quite salty to me.   THE PROBLEM:   Several hours after the meal, my dad started having abdominal pain, diarrhea, and all sorts of food poisoning symptoms. Then, a little while later, both my mom and brother experienced the same thing as well. We were trying to figure out which dish had the problem and we concluded that the PBS might be problem because they all had the most and I only had a spoonful. Not sure if it was because they didn't boil it enough in the first run or it was just NOT MADE FROM SCRATCH and JUST REHEATED IT, but it scared us a lot.   Because of our food poisoning experience, we will definitely NOT return. Also, Overall, everything here was $1-2 more than other Korean restaurants and other places had better quality of food and service."}
{"text":"Clean, bright, modern interior, a little crammed.  Food is fresh, simple, lots of bright colored vegetables and stir-fried meats,  Even though we had gone on a Friday night, service was reasonably quick and friendly.  Great value proposition, especially if you like Korean vegetables as 4 side dishes arrived with our dual order of traditional rice bowls (Bibimbap).  It is not a grill house but it has potential to become one of our favorite food places in the neighborhood!"}
{"text":"This review should be 3.5 stars. Second time here, the portion sizes feel smaller than first time. they are a bit stingier with the size of side dishes now, although you can still ask for seconds. Taste is not bad."}
{"text":"Won't be coming back. Service was rushed and poor. Food was pretty bad. Way too pricey as well.   Had their Friday special of the short rib soup, wife had the bibimbap, and we ordered the mungbean pancake.   Short rib soup was bland. Barely any flavour. You would have better flavour using packaged broth.   The mungbean cake was pretty terrible too. It was soft and the texture came out way too brittle. It ended up tasting like Korean pancake with filler. The mungbean didn't give it a better taste but definitely a weird texture. It was 15.99 or something like that which is way too much for essentially a thick Korean pancake.   The bibimbap was decent, but it's hard to mess this staple up.   Wouldn't recommend this place. An entire meal and my tea wasn't refilled. Meh."}
{"text":"Really impressed with our take-out from here. Maybe the closest to Korean food since I've  had since living in Korea. The takeout order (bibimbap and Donkatsu) were both delicious and came with rice (korean purple rice!) and 4 side dishes including home-made kimchi. Service was super friendly and well organized. The interior looked clean and inviting as well."}
{"text":"Hands down the best Korean food I've had in the GTA / Toronto area. Overall, the prices are very fair and the service is great.   The seafood pancakes here are fluffy and a must get every time I go, especially to share. The kalbi is also a good option to share amongst friends.  Chaban's bibimbap and pork bone soup, despite being classic Korean meals, are comparably somehow just way better than all the others that I've tried in the province. For a more broth like soup that's not too heavy but still flavourful, try the oxtail bone soup. It's perfect for a chilly day.  No matter what you pick though, it's probably going to be delicious.   Also available for delivery for anyone who lives near the Etobicoke region. They even take AMEX which is a bonus."}
{"text":"I was really satisfied with the food and the service at chaban. Our order was Pork bone Casserole and Beer Short Ribs. And they were so wonderful and delicious. Especially, I love Casserole. If you want really special menu, I really recommend casserole. It was the best food in this winter!"}
{"text":"It's been ages since I've had home style Korean food. Chaban maybe a little place but it comes with big flavours.  I loved how there seemed to be an entire family running the place and making you feel right at home at their kitchen table.  This is not some modern vibe or hip place on Ossington.  It's an honest spot with handcrafted dishes.  The place is sparse but clean.  There's two rooms ... one in the back is smaller and more private and the larger front space with a number of big tables and tables for 4.  It's well spaced out so you're never feeling claustrophobic.  There's no noticeable loud music so it's a pretty calming place.  If there is a loud table, you're going to hear them... you're never really far from them.  I wouldn't necessarily call this place as much as spartan.  There's no discernible decorations but a clean bright space is always appreciated.  I did like how when I first walked in, you smelled the beef cooking and the smells of the Korean pork dumplings.  It's such a great smell.  I also saw at least 3 'Aunties' sitting at the table and just folding the dumplings.  If this isn't a sign of great food to come, I dont know what it would be.    Service here is quick, attentive, and considerate.  Within minutes after seating, we had someone check our table and whenever we need them, all it took was an eye glance and they walked over.  I wish this was normal in all restaurants.    Also, there is free parking behind the restaurant but WARNING, it is an utter fustercluck.  I was waiting for 2 moving vans who slowly snailed their way backwards into the street traffic and block both ways.  More than once.  It was terrible as it was hilarious.   Ban Chan - with most Korean dinners, you are given several side plates to enjoy.  We were given 4 in total .. spicy savage kimchi, matchsticks potato, sesame bean sprouts, and a daikon seas weed salad.  The Kimchi was the most vibrant and flavourful ... 4/5 for that. Everytjing else is 3.5/5  Seafood Pancake - A generous 'pancake' with lots of flavour green onion, calamari, shrimp, and some clams.  There is a lot of crisp edges to enjoy and a spicy dipping sauce for you to burn your tongue on 4/5  Bulgogi on a sizzling plate - Enjoyable thinly cut beef arrived popping and sizzling on the hot plate.  It had a decent flavour and was tender.  4:5  Soon Tofu soup with seafood - It came in the heated bowl and it was just bubbling away for a while as it cooked in front of me.  The freshly cracked egg made it a richer stew and there was a lot of soft tofu and calamari.  This definitely was medium spiced.  I loved it but I wouldn't recommend it to a new person trying! 4/5  Bibimbap with seafood - comfort food at its finest with a lot of finely diced vegetables to mix in with the rice, seafood, and hot sauce.  I think there could have been a bit more seafood but it was a nice dish 3.5/5  I do understand it's more expensive than the ones on Bloor but for those who live far from Toronto, Chaban is a great alternative."}
{"text":"On one end, my partner loves Korean food and thought this was the best Korean he's ever had.   On the other, I've never had Korean food and am now in love!  A fresh, tasty and exciting meal served with the most delicious side dishes (pear in a potato salad anyone?!).   The restaurant itself is nice and homey! Definitely something to visit (we saw the cute logo and decided to pull over and clearly was a great idea!)."}
{"text":"This restaurant appears to be family owned and was quite busy on a Saturday night. The menu has a fairly wide variety of stews, and my seafood soft tofu stew was pretty good, although it could have used a little more seafood. Service and atmosphere was pleasant - I would come back to try their other dishes."}
{"text":"5* is for the bibimbap. It's REALLY good! Tofu and pork bone soup isn't bad either but they are known for their dolsot. Usually come at lunch or late lunch and service is good. But once came on a Sunday evening and tables were full and servers seemed overwhelmed and slow."}
{"text":"We recently came across this little family run place on yelp and went by for dinner.   Not much to be said other that it was quite delicious and the service was excellent. They don't serve the rice in the stone bowls and pour the water in after however it's a good place for a quick meal.  The kimchi wasn't fermented much and tasted a little fresher than I like."}
{"text":"Been here a couple times now and this place seems to be getting better!  Simple space wjich offers authentic flavours and experience without having to trek all the way to Koreatown.  Have not tried there hot stone rice bowl dishes yet and have opted for the seafood pancake..Very fluffy, and meat and tofu soup, my favourite, or pork bone soup, yummy but Spicy!!!!  Glad this place is around giving us an option for Korean closer to home."}
{"text":"Great service even very late. Food was authentic, well seasoned, and good. We got the bulgolgi soup and chaban bimbap, loved both."}
{"text":"From the outside, I was unsure of the place as my partner brought me here to try it out since I love Korean food.   Once we entered the place, it was welcoming. The tables and chairs don't look so old as the outside. The waitress was attentive and nice.   It came with four appetizers which I love 3 of them. I'm not a kimchi fan. I ordered soft tofu with oysters. I got three small oysters, definitely frozen. I was hoping it would be fresh. It came with purple rice which was nice, but not hot enough.   My partner had the chicken cutlet. It was crispy and tender. I would have like to see it with some steam veggies to compliment the dish. It's all deep fried then!   Verdict:  it was just like any other Korean restos that I go to. Nothing special. It was a drive since I don't like in Etobicoke. If I'm in the area, I don't mind going there to try their other main dishes."}
{"text":"Authentic Korean. Great pork bone soup. I went off menu and asked if they could make some kimchi bokum bap and they really came through. Tasted just like I was back in hayang South Korea getting a snack in an alleyway cafe cooked by an ajuma.   I would rate this place on par and possibly ahead of cho sun ok. Real side dishes made with love and care.   Clean, bright ambience. Friendly, efficient and accommodating staff. I have been twice and will be back. Highly recommended for Korean food lovers and better than most restaurants in bloor/Christie or young/finch neighbourhoods   Was back again yesterday with The Lade (lady). This place has found a way to get even better! Kimchi jigae was delicious and hot on a cold day. The lade ordered yukgaejang and loved those beef and noodle-full-spoonfuls oh yeah. The seafood Korean pancake is now a must order for us on every visit. Phenomenal!!"}
{"text":"This place is a really good Korean restaurant. The bibimbap was great and so were the complimentary side dishes, Prices were fair as well. Similar to Korean restaurants in downtown Chinatown. On the downside, the portions were on the smaller side so you may need an appetizer to be full.  I was still kind of hungry after my meal and I usually don't eat a lot compared to other people. Lastly, the service was really, really overworked and it can take a long time to get the bill. If it weren't for those two issues, this place would be an easy 5/5."}
{"text":"I am new in the area and was looking for some good authentic Korean food on the weekend. I read the reviews on yelp and decided to give this place a try with my fiancee who is also Korean.  As per reviews there is minimal parking out back behind the restaurant, be prepared to park further down the residential side streets within walking distance. There was a short line when we got in which was a good sign indicating the place was popular.  When we sat down we were greeted with friendly service. Being insanely cold that day we ended up ordering a serving of pork bone soup each and kimchi pancakes for sharing. Before the food came, we were given hot korean tea. When the food came they were accompanied with the regular Banchan (shared side dishes) which were clean and tasty. The pork bone soup that also came with rice was very delicious and not greasy at all. Some of the best soup I've had in the GTA. It had the perfect amount of spice for me where I could still taste my food. The portions of pork was very generous and pancakes were a hit.  Overall we both agreed this place was a new favourite hotspot to add to our list in the neighbourhood as we want to try more dishes. The place could use a little bit of face-lift but asides from the that, no real complaints for affordable clean, delectable, authentic Korean food.  Edit: Came back yesterday after work to try their dolsot bibimbap that I saw on their menu that peeked my interest. It came in a hot stone bowl with perfect amount of balanced ingredients and did not disappoint again. 5/5."}
{"text":"Great place to eat Korean food! I love everything in the menu especially the Bibimbap, super yummy!"}
