{"text":"Was in the neighborhood today and needed to eat. What a find! Had a fantastic smoked meat sandwich accompanied by half a dill and an equally fresh and oh-so-delicious garden greens and mandarin salad with almond crisps. Everything was spot on as and where needed: fresh, tender, juicy, crispy. Nice ambiance and very nice service too. I highly recommend will definitely return. Sits right next door to an equally fantastic French artisan bakery."}
{"text":"Everything is great at Chainsmoker! I had wings, fries, mandarin salad, Brussel sprouts, and beans. I will definitely visit this place on a regular basis!"}
{"text":"What can I say? The best smokehouse out there in the ether. This place just opened up quietly and no one knows it's there. In a shabby plaza on Bathurst Street where parking is impossible. But don't worry. The food is amazing. Tender short ribs, unequal brisket and smoked meat that would put Montreal's best to shame. Highly recommended."}
{"text":"Definitely the best smoked meat in Toronto! I recommend any meat lover to visit here as they serve some of the most amazing meat dishes with a great price. The store interiors are also really good. Check this out. Definitely recommend the smoked meat with mustard. Perfect!"}
{"text":"Wow!  Having received a flyer we wandered in for lunch and we were blown away. Being gluten free I had to avoid the meat (though I couldn't resist venturing a bite of my husband's hand cut smoked meat - beyond delicious) and he loved his fries which he said were spiced with something unusual. The mandarin salad had sweet nut clusters thrown in and the coleslaw was hot and spicy and again, a new experience.  Nothing is ordinary deli fare - everything seemed to have it's own unusual culinary spin to it.  A breath of fresh (and aromatic) air in a neighbourhood that desperately needed a place like this. I should also mention the interior, which is warm and wonderful with its exposed brick wall and wood tables.  We'll be going back soon and I'm hoping that by then a GF meat option will be available."}
