{"text":"Surprise to find fresh yam paste milk tea here, nice and delicious , was here for a quick drink but attracted by nutella egg waffle too. Both are pretty good"}
{"text":"3.5 stars   A new Chaplus has just been opened last Friday on May 18 at the new Midland and Finch plaza, right next door to Cheese Garden. This looks to be their 4th location. I had wanted to check them out earlier when they first opened their two locations but was not able to do so.  I asked the girl at the counter what she suggested and she recommended drinks such Cha +Taro Milk Tea, made with real taro and also the Passion Fruit Rocket. Most of their drinks seemed to made with real ingredients and not powder. We can see the actual bits of fruits or taro in the drink. Cha Taro Milk Tea was ok but it wasn't as good as I would have enjoyed. However I still like the taro. The passion Fruit Rocket was lovely.  I also saw them at the back squeezing orange juice to make oj.   I also gave a try on their waffles and they tasted artificial. Even the waffles looked plasticky.  I opted for the strawberry and the sesame waffle. It was not worth the prices. the drinks are the main attraction.   Chaplus currently has a new opening promotion that runs until May 27 for drinks or waffles. Buy one Get one Free on any waffles or drinks. Definitely a steal.  There is a lot of free parking in the plaza but the plaza gets so busy that may need to park further at the back and walk back.  There is about 16 seats and four tables.   decor looked to be average but the music at the bbt was really nice. good mixture of cantonese, english and mandarin songs."}
{"text":"Had a chance to try this place at its grand opening, and it was odly empty. Although there weren't many people waiting, the service was extremely slow. I waited over 20 mins to order and get my drink being the first in line. I gave them the benefit of the doubt, because it was their first day after all. However, the drinks I got we're disappointing, it was a buy one get one free deal but even at that price it was not worth. Their mango drink was watered down and sour, and the frosted jackfruit drink I had was a disaster (they made the drink with a hand mixer ). After this experience I was pretty set that either they had a bad first day or that their drinks were actually mediocre. Unfortunately, I did get another chance to try a different drink and after tasting the extremely sour and pungent \"winter melon\" drink with lemon, I can confirm that chaplus should be your LAST option, when coming to Midland and Finch. There are literally a handful of better dessert, bubble tea and cafe shops in the area. Just be safe and pick chatime/coco as the prices are relatively the same and you'll actually end up finishing your drink."}
{"text":"Nice new bubble tea and waffle place in the midland and finch plaza. I ordered the matcha milk green tea which tasted uniquely different (in a good way) from the way other bubble tea places make it. You could taste a hint of green tea in it which I enjoyed. The environment here is also really nice, they have some seating and a few classic board games that add to the experience (battleship, jenga, uno, monopoly, connect 4). The service was great, as the worker tried to make recommendations and inform us of their menu items and ingredients. Seems like most of their ingredients are real as opposed to the artificial powder base. I'd recommend giving this place a try, I think it is a good alternative to the other competing busy bbt places in the plaza."}
