{"text":"Who would have thought. Semi-visible behind a pizza shop on South Park Road in Bethel Park is a new addition to the South Hills dining world. And it is a Russian nesting doll of pleasurable surprises. On entry, you're greeted with a simple decor with enjoyable background music pegged at a level that promotes discussion. The owners are at the ready to welcome you.  The dining room is airy with tables placed so as to allow a welcomed degree of privacy. There is a sense that it a space in a remodeling transition, but the current room is attractively treated to mixed tan and black chairs with white tablecloths. As for the food, you will find a menu that is ambitious in its number of offerings.  It's posted on one of the interior walls. The variety extends through familiar beef, seafood, and Italian dishes, with a few Mediterranean selections. What is welcomed is the freshness of the ingredients and preparation. The red sauce for my egg plant caprese was savory with just the  right balance of sweetness and spices...definitely made fresh. The accompanying penne pasta was perfectly al dente. My Caesar salad was not the result of bottled dressing. It was freshly prepared topped with loads of anchovies ( but without the inclusion of a raw egg...an understandable omission). For dessert lovers, sweets are supplied by the popular Signatures Desserts. I enjoyed a powerhouse slice of chocolate mousse cake. The owners and the lone server provided flawless and attentive service... they're committed to a friendly experience. They are eager to establish a clientele of happy, repeat customers. They have easily earned my future business. If you're lucky, you can thank the chef personally, as I did. I left with a satisfied feeling. I had finished a tasty meal (complimented with a glass of wine from my BYOB bottle) priced reasonably. And, with a loaf of the in-house Italian bread under my arm, I plunged into the cool Fall air as a happy man."}
{"text":"Not easy to find - hidden behind some other building.  They had a curry special which we shared as a starter. Very tasty and not overly spicy.  I had the rack of lamb, was one of the best I have had in a long time. My wife had the Salmon and enjoyed it also.  The place is BYOB.They brought out some home made bread that was extremely good.   Hope this place makes it, as the food is very good."}
{"text":"We just ate there with our family and everything was excellent!! We will be going back soon. The peanut butter pie was a big hit at the table."}
{"text":"The other reviews for this restaurant must be talking about a different place than I am about to review because my recent experience here was fairly bad.  I've lived in the area for about 30 years, ordered from the Panda Garden that was here, worked at the next door Pizza shop for a few summers as a kid.  First things first: the parking lot needs work done. It looks like they had a \"discount asphalt paver\" come in and do it, it's clearly messed up. The building is old, and the outside definitely needs some TLC and it's very nondescript.  Next, you walk in to the small room, with not many tables, and there's absolutely nothing to absorb sound. No carpet, nothing on the walls, no background music, just echos. You can hear every word being spoken at every table. Imagine a 25ft x 25ft concrete room.  If everyone was having quiet conversations, it would probably be tolerable, but the owner was going around interrupting everyone to tell them about the place, and contributed to about half of the noise. I came to eat, not to listen.  The fresh brewed iced tea was clearly made with unfiltered tap water, and tastes like it.  The mixed seafood bowl I had was bland and tasteless. All of the seafood was overcooked. There wasn't so much as surface-level seasoning on anything.  My dining partner had some type of pasta with meat sauce. There wasn't any visible meat in the sauce.  Service was on par with the \"How ya' doin'?\"-side and most of the drinks were bottles from their cooler. I felt like I was in a deli or something. Everyone we ran into tried to oversell their food, including telling us that \"the chef made that fresh YESTERDAY.\" Well, it probably isn't FRESH today, then, right?"}
{"text":"Went there with friends for the first time. We ordered pizza and one Indian dish. The pizza we ordered was with the chicken tikka masala topping and it was done to perfection! My personal way to gauge the quality of a pizza is through the taste of the crust and the crust on our pizza was awesome - perfectly fermented dough with amazing taste.   The Indian dish we ordered was Chicken saagwaala and this dish tasted great. The gravy was perfectly cooked and had just the right amount of spice. The rice that came with the gravy was also well seasoned instead of just plain white.   On both the pizza and chicken saagwala, we were particularly impressed that the chicken was perfectly tender.   Overall - a hidden find off of South Park road that will see many repeat visits!"}
{"text":"Great new place to have dinner. Tempted to have an Indian dish but went with the zucchini  parmesian.   A huge serving! OK so I have lunch tomorrow as well. Very tasty.  Rack of lamb looks great too. Definitely will return."}
{"text":"I'd go with 4.5 stars on this establishment. The place is small but cozy and tonight in particular it was very warm inside.  The food from NY Strip to chicken marsala or satimbocca was very good. The salad dressing was fresh and seemed homemade. The bread was homemade out of the kitchen and the infused oil was very tasty.  The pasta has a hint of green pepper which I don't particularly care for but ate it anyway bc it was good.  The table next to us had what looked like leg of lamb and looked delicious.  To finish of the meal we picked chocolate cake which had a smooth creamy icing that was fabulous and this coming from a non icing person. I enjoyed my Father's day..."}
{"text":"Food was just ok, filet ordered medium rare and came close to medium well. Service was way too casual, kept saying how tired she was, walked away without even asking how I wanted my steak. Water tasted weird. Wouldn't go back again or recommend it to anyone. Better options in the south hills for sure."}
{"text":"The rack of lamb was excellent! It came with a pasta dish that was incredible. The owner came to our table several times, and he was so welcoming.   We tried the wasabi tuna, but nothing comparable to the lamb....was perfect with the Malbec we were able to bring in."}
{"text":"This place was not at all worth the price. Food came cold, wrap was soggy, ranch for the salad was runny. The potato salad was hot (and had way too much mustard in it) yet the wrap was cold. The delivery driver forgot the gouda Mac and cheese and when it came it was chilly and gritty. Probably not gonna eat here again."}
{"text":"We went for a friend's birthday party last night and the experience was fantastic.  Byron greeted us and was extremely accommodating.  Our server knew the menu inside and out and checked on us to make sure that we were all taken care of from start to finish, with no rush to leave.  Everything is made fresh, in house, including the meatballs, pasta sauce, and dressings.  My filet was cooked beautifully (medium rare, and that's usually how I judge my restaurants by their ability to cook a steak) and everyone's food arrived hot and at the same time.  This is a great value for portion and taste, and the owners are extremely helpful and friendly.  Can't wait to go back - and BYOB made it even more fun.  Do yourselves a favor and check it out!"}
{"text":"This place is a gem! From the warm greeting upon arrival it was clear that the owners were eager to make a pleasurable experience for all. Home made bread, delicious imaginative dishes made from scratch with fresh ingredients and friendly attentive staff... I have nothing negative to say.  Crab stuffed salmon and gouda mac and cheese were great. Pina colada shrimp with angel hair may have been better. If the rest of the varied menu is half as good, you can't lose. Charya's is a BYOB establishment with a 5 dollar corking fee. Grab a delicious beverage and go check it out. They deserve it and so do you."}
{"text":"This place is a hidden gem. We sat right down at 7:30pm on a Saturday night. Quick service. The staff was very friendly and knowledgable. They start with fresh, warm bread and oil. We ordered the chicken saltimbocco with a side of Gouda Mac and cheese and the korma dish. Both were served with a house salad to start. The salads were great and the entrees were beyond delicious! All of the food came out quickly and was fresh and hot. We will definitely be going back and recommending this place to friends and family. I highly suggest you try this place!"}
{"text":"Well, it's strike 3 for you, Charya's! We have ordered via GrubHub a few times, and although the zucchini parm is awesome, everything else has ranged from \"meh\" (mac n cheese, mashed potatoes, pizza) to inedible (the spinach artichoke dip, the hummus! WHY is it that texture? WHY is it so bad?) We decided to give their Indian offerings a try for dinner tonight since Indian delivery does not exist around here, only to get a call from GrubHub 20 minutes later telling us that they can't make contact with Charya's and have to cancel the order. What a disappointment/waste of time... but maybe it was for the best anyway."}
{"text":"Drove past today, and noticed this business has closed.  There are \"FOR LEASE\" signs in the window.  I never got to try this place unfortunately, because the menu looked pretty unique, but the outdated building was always a turn-off to me."}
{"text":"Since the Thai place I liked stopped delivering in my area out of nowhere (ugh), this has become the ONLY good restaurant to order from. I've never been to the actual location, so I cannot comment on their services, but their food has always been superb, and their delivery has always been prompt. The entrees come with a salad AND 2 side dishes of your choice, and I usually have leftover for the next day. They aren't skimping! After trying a few menus, both my husband and I pretty much settled on Chicken Saltimbocca. It's too delicious to pass. Highly recommended."}
{"text":"A group of 8 dined at Charya's Saturday evening in Bethel Park.  This is a small intimate place and the tables are spaced nicely and not crammed.  The staff was very friendly and attentive.  The salads were served on chilled plates.  I had the rack of lamb and it was probably the best I ever had and my husband had the filet and both were cooked to perfection.  A house salad and two sides are included with the meal which is a plus (don't see that often).  Do not miss this little \"diamond in the rough\".  A nice perk... it is a BYOB.  I will definitely return."}
{"text":"My family (as a party of 10) celebrated my mother's birthday here last night. Let me start by saying that everything about this restaurant made for a wonderful evening!  Its cozy and intimate dining room and extremely knowledgeable and attentive waitstaff provided an excellent atmosphere for enjoying the presence of our family.  Our server was also an owner of the business, and it was truly inspiring to see how enthusiastic and proud she was of not only the dishes on her menu but also the business as a whole.  The restaurant is BYOB (which is always an attractive option to me), and the corkage fee is $5 per bottle (not per person, which is extra attractive).  Although the service and atmosphere were certainly spot on, I feel that it is the menu that earns Charya's its 5 stars.  The options on the menu were very diverse.  There was a mix of seafood, poultry, steak, and pasta in mostly an Italian style; however, there were also specials for the night that included Indian dishes as well as a pumpkin gnocchi.  My family tried a variety of the dishes and everyone seriously enjoyed their dinner.  I ordered the pumpkin gnocchi as well as the stuffed salmon with Gouda Mac and cheese.  I was expecting the gnocchi to be too sweet, but because of its sage sauce, it was perfect! The salmon was also excellent, but it was the Gouda Mac and cheese that really stood out.  I tasted my boyfriend's chicken saltimbocca, and it was one of the most flavorful and delicious dishes I've ever tried!  I was ridiculously stuffed by the end of the evening from having eaten every last bite of my food as well as tons of fresh bread in dipping oil and salad before my meal even came.  In addition, the prices were reasonable considering the quality and freshness of the ingredients.  I would highly recommend Charya's to anyone and I will certainly be returning!"}
