{"text":"I have eaten here quite a few times and the food is good. The 2 stars is because they no longer have limes!(trying to get a response) I ordered a margarita (ultimate which was very good) and when I asked for a lime the bartender said they had stopped ordering them because they were too expensive! Now granted this didn't make or break my meal but that was one of the strangest things I have heard. It wasn't like it was $2 margarita night ($9 to be exact) Hopefully someone in management will see this and respond. If you like a lime with your margarita or your Mexican beer you may want to pass until they they make a better business decision"}
{"text":"I've gone a few times for lunch and I've had a good experience every time. They have fast service and the food is yummy. I really like their complementary salsa and chips and the chimichungas are delish!"}
{"text":"No bueno!!!  Not only was the food not good and served lukewarm, the waiter needs to learn some manners. You don't respond to a customer's inquiry with \"what\" or \"huh\"!!! My feet will never ever enter this establishment again."}
{"text":"I love this place! Great service, prices, and food! Even when they are packed, those servers run around like crazy to make sure you are taken care of. The food is so so so good. Get the queso to start/ best decision you'll ever make. 5 stars!!"}
{"text":"I've eaten at the restaurant off of Dave Lyle and the one off of Hwy 160. I just wasn't impressed with their food."}
{"text":"I have been to this restaurant several times and each time the service has been great and the food as well.  My last visit was just as expected.  The free chips and salsa came quickly and it was really good.  I had the combo burrito and enchilada. I spoke a little spanish and the waiter indulged my girlfriend and I by speaking spanish to us while not making fun of our broken spanish.  The whole experience was great and we will be back."}
{"text":"Great food and great service! Of course some things like tortillas and chips are not homemade but everything else is great. Good portions and kid friendly. Decent beer prices as well and the pitcher for margaritas is really a full size!"}
{"text":"Excellent food and service!!! The made to order guacamole is absolutely incredible! The carnitas are some of the best I have ever had...perfectly cooked with moist inside and crispy outside. Great salsa with two varieties (mild and hot). Recommend without reservation and I will be returning (and soon)."}
{"text":"would not recommend.my friend ordered a beef burrito and got chicken enchiladas. I ordered fish taco and it was not as described on the menu. poor quality food the rice was also nasty very sticky and soft"}
{"text":"Food was ok service sucked 


I'm not recommending this establishment as there are 1,000 other Mexican places close by."}
{"text":"We stopped by last night for appetizers & drinks, hopefully outside at one of the tables with umbrellas. I dropped the wife off at the door to secure a table while I parked the car. Unfortunately, she came to the car stating there was an hour wait even though several tables were empty on the patio. She stated the hostess told her they did not have enough servers and were unable to seat people in those empty tables. We let without eating or waiting. We also noticed several other parties leaving without waiting."}
{"text":"Kids do NOT eat 'free'...They have a sign out front that says, \"Kids eat FREE on Sundays\"  This past Sunday we arrive to the sign we've seen for several weeks now and start to order our drinks.  I always order water because the price for drinks in a restaurant in my opinion is rediculous.  My husband orders sweet tea because he definitely gets his money worth.  We always order water for our boys ages 7 and 3 unless the drinks are included in kids meals that are reasonably priced.  The server then says, \"to get the free kids meals everyone has to order a drink\"..ok, #1, that is NOT on the sign or anywhere to be seen by a customer and #2, let me think about that for 2.5 seconds..drinks are $2.25, 4 of them would be $9 plus tax, it's cheaper to buy a single taco than to get a 'free' kids meal because you have to buy a drink! No, we will NOT be buying 4 drinks and we did not get 'free' kids meals.  How crazy is that?  The food is good and the service is ok but that false advertising makes me leave with a bad taste!!"}
{"text":"We eat Sunday lunch here several times a quarter. 

As many of the other reviews note, sometimes the service isn't the best in the world. 

Food okay, I especially like the Arroz con Camarones. Plenty of good, fresh tasting shrimp.

One thing I have noted in all of our visits there:
        If one is cold natured, make sure to dress suitably. There's always a cool, drafty feel to the restaurant. 

Not the greatest Mexican food in the world, but certainly nothing here has to be negative as some of these reviews are."}
{"text":"I'm very surprised by all the negative comments. I've always had friendly and fast service. Their fish tacos are so yummy and the soups are delicious!"}
{"text":"The food was alright, but the service was terrible.  Our first table that we were seated at had ants all over one side, and then we traced the line of ants to the floor where there were a lot more.  We decided to stay since we had already ordered so they moved us to another table.  45 min later our food arrived.  We received refills on our drinks only once after asking a different server who happened to be walking by.  

We won't be back.  Seriously the worst restaurant I've been to in a long time."}
{"text":"Went there around 8pm last Saturday night. We should have taken the hint it wasn't going to be very good given the fact the place was almost empty. Service was extremely slow. My husband and I each ordered a margarita. I got hibiscus & he got an original. After waiting forever for the drinks to arrive, the waiter proceeds to tell us they did not have a bartender. My drink was fine but my husbands had a foul taste to it. He told a waitress and she stated that he shouldn't have ordered it if he didn't like it. After asking to speak to a manager, he then tells my husband it's his problem and maybe he just isn't in the mood for a margarita. They never offered to remake the drink or anything, just said it was my husband. They were very rude. We cancelled our food order. We ended up paying for my margarita which was left sitting on the table. Should have been complimentary. The only food we tried were the chips & salsa. The chips tasted old & the salsa was overpowered with cilantro. Will never waste our time here again."}
{"text":"The food was delicious, everything tasted very fresh. The service was a bit choppy at times, but I think that's because they were very busy indoors and we were the only table that opted to eat outdoors. Would definitely go back."}
{"text":"Service was questionable at best. One our meals was not correct when brought to the table. One of the waiters wanted argue vs fix the order.  Our other meal (fajitas) was brought with out the tortillas...took 10 mins for them to be brought to the table while the food became cool.  They comp a meal but even the manager did not apologize. It's been a long time since I've experienced anything like it."}
{"text":"My wife and I have always enjoyed the food here, service has been a little hit or miss.  However, last visit there was a discrepancy on our check and we asked to speak to the manager.  He came over said there was nothing he could do and then asked \"if it was because they were Mexican\" and that \"we would have complained at an Olive Garden\" implying that we were racist for complaining.  Asked for the owners information only to find out the person calling us racist was the owner. We will not be returning."}
{"text":"Great chips but the salsa is a little watery. Try the Fluotas sp?"}
{"text":"I ate here a few weeks ago with my boyfriend's family. I never met a Mexican restaurant I didn't like until I tried On the Border awhile back. But, frankly, Charanda isn't much better. It seems the public agrees. There were literally three other families in the whole place.

The atmosphere and service were okay. But the food's where it gets iffy. The chips and salsa were pretty good. I got a chile poblano with beef. The poblano was mediocre. The beef was really gross for some reason. I ended up trying to eat around it, which proved to be impossible. Oh, and apparently you just get one round of chips and salsa. After that, you're SOL. I ate so little I stopped at Cook Out to get a milkshake on the way home.

My boyfriend and his brood agreed that the food wasn't very good. However, Charanda did get a compliment on how cold their beer and mugs were.

The singer was a nice touch. Although you might want to sit a few booths back if you're with a group- it can be hard to maintain a conversation at that noise level. He did some strange '80s renditions in a thick Hispanic accent, as well as some songs native to Mexico. It was a little bizarre."}
{"text":"I ordered a beef taco, chicken enchilada, and a beef tostada. Everyone understands there is sauce on the enchilada, so it seems like they might have separated that from the other two items, especially the hand-held taco. Instead, it arrived all on one plate, with the saucy enchilada in the middle. Picking up the taco without getting enchilada sauce all over my hands would have been impossible. They were nice to bring me another taco and take the sauced one away. 

Also, it was my first time here and no one explained the fresh guacamole cart upfront. When it hit my table, I wasn't sure if it was complimentary or if I would be charged for it, so I passed.  The tip container on the container was right at eye level. Couldn't miss that. 

The enchilada was nicely seasoned, but the chicken was a bit on the dry side. The ground beef on the taco and tostada was decent, if a little greasy, and it needed salt IMO. Chips were good, as was the salsa. 

I might try this place again when I am in town."}
{"text":"Very poor. 
     Starting with the host... He would have been just as welcoming if he just pointed at the table that he assigned us to. I can not say that he seated us. He merely assigned us a seat and walked away. 
     Our server greeted us by setting a basket of nacho chip crumbs on the table, stood in front of us and waited for us to tell him what we wanted to drink. After a ten minute wait for our waters the man proceeded to take our food order in the same fashion, by just standing there... Literally, not a single word was spoken. 
     The food got to the table on scalding hot plates that were obviously microwaved. My burritos were floating in water and melted cheese. Absolutely disgusting.
     I can't justify wasting anymore time on a review for this place. This establishment was given a star from me only because it is the minimum."}
{"text":"It is kind of funny how people rate restaurants. First of all, who told you that you needed to have several baskets of chips or salsa before your meal? Even tho Chips and salsa are free, must understand, it is not your meal...so why do you demand refill after refill? I am sure that if you had to pay for them you would not demand as much....Same thing with soft drinks...one after another and another after another...please people.  How about comments like \"I come from southern Ca. and I know what authentic food should taste like\".  For your knowledge, a burrito will taste different within Mexico, it depends what little town you go to...So, there is not such of thing as authentic defining Mexico per say. If you have been to Mexico you would know better so say such of things. My comment it is not to defend this specific restaurant for any short comings but my comments are for all ethnic restaurants out there. Some People need to have a crash curse in etiquette while eating out. Remember, you can always stay home and cook your own meal."}
{"text":"One of our local favorites - good food, good portions and good price. Look for the specials like $1 tacos, fajita specials. We usually sit in the bar area!!!"}
{"text":"Concord Mills location is Worst place ever....small portions for the $8.99 combination.
Owner would not accept Double Take Deal voucher they put out-arguing that is was just a promotion they put out.  
Funny thing is by the time I got home he had redeemed voucher through Double Take!
SCAMMERS"}
{"text":"I m always big fond of mexican food  this place dissapointed me, food was not good at all. I will never be back"}
{"text":"Chicken tasted like rubber bands....DISGUSTING!!!!Second time here and previous was a little better.  Not coming back!  Even our 9 year old - gave it a 1...."}
{"text":"Even though i would mostly agree with most of the other reviews, we have still been there several different times mainly on Friday nights.  Sometimes with small groups other times with just the family.  This place is so up and down when it comes to service, you never know what your going to get, but i can say that we have never had anything bad off of the menu but just be prepared to remind them that you still need something and you should be ok."}
{"text":"I don't know how this place is still open. Although the prices are good and the location is pretty good, its not even worth the effort. The food is decent, nothing spectacular. I love Mexican food and I had a really hard time finding something that sounded appetizing. The worst part about this place is the service. The service is not only slow but I believe all of us got our orders wrong. The waiter was 0 for 5. I would not recommend this place to anyone but if you enjoy wasting money, give it a shot."}
{"text":"I bet a million bucks that the guacamole was  out of a giant plastic tub they bought at Costco. Too bad ... This place has really declined in quality!"}
{"text":"Terrible! Guacamole was like green jello. Nothing was fresh. This wasn't even really Mexican food. I asked for a side of refried beans and was served a side of pinto beans with bacon and pickled peppers in it. Disgusting. My friend and I sat and talked for awhile and they cleared our table but left the jello and salsa - never refilled
Our chips. I LOVE Mexican and am really not hard to please-in fact I've never been to a Mexican restaurant that I didn't like. This was a first. I will definitely never go back. The service was ok..... I would go somewhere else if I were you. There's an On The Boarder nearby that I'd opt for."}
{"text":"Best authentic mexican food I ever had.
I tried torta de milanesa, and my friends had street tacos, barbacoa, lengua, tripa and much more authentic food in the menu.
Very good service."}
{"text":"Went there early on a Saturday afternoon with two of my kids. The place wasn't very busy and we were seated right away.  We ordered chicken fingers & fries for the kids and a lunch special for myself. The food was delicious and cheap, but the timing was weird. They brought my dish before the kids plates. What?!!? I was annoyed by that, considering my kids had to wait another 5 mins before they could start eating. 

As I mentioned though, the food was great. I had a lunch special, which consisted of a chicken sope (Beef or chicken. Two round and flat pieces of corn dough topped with refried beans, meat, lettuce, pico de gallo, sour cream), taco and rice and beans on the side **plenty of food for lunch, even for a big guy like myself** The chicken was shredded and hot, topped with fresh, cold toppings and the corn tortilla was right out of the deep fryer. The kids food was hot and the crispy chicken fingers were tasty. 

We didn't have any special drinks or dessert, but would like to try some churro next time. 

The decor could be updated (fresh paint anyone?) and the service could be a LITTLE better (waiting on drinks for too long and the food timing was odd), but overall, a good value for a decent amount of food. 

I don't need to be wowed every time I go out to eat. This place won't wow you, but it serves it's purpose: cheap, quick, tasty Mexican food. We will return."}
{"text":"I was very excited to have a Mexican restaurant so close to where I work. Sadly, this is not the place for me. The best thing about the place is the bartender. He is friendly and attentive. Maybe if he ran the place, it would be better? As for the rest, the service is slow, the staff rude and the food bland and flavorless with weird tasting cheese sauce. Sorry Charanda's. I will continue my search for good Mexican food in the South elsewhere."}
{"text":"With all of the stellar Mexican restaurants in Pineville and Charlotte, Charanda just doesn't measure up. I'd much rather drive a little farther to get better service and food.

In my opinion, prices are high compared to other places I frequent. My biggest complaint, though, is about the service. I seem to always get the same waitress every time I go there: a young blonde girl. She does not need to be a server. She always seems frazzled, does not regularly refill drinks or salsa, and generally neglects her tables all while seeming like she cannot handle the stress. 

Their salsa is awesome, though!"}
{"text":"Mediocre service was the highlight.  Seriously.

Let's start at the beginning.  We were seated in a booth, and given menus.  This wouldn't be at all odd, but my preschool aged kids were also given menus, and not the kind you can color on--adult menus.  Odd, but you don't lose any points for that.

After sitting for what seemed like a really long time, we had the opportunity to order beverages--the kids had chocolate milk which arrived in a styro-cup with a lid intact, but no straws.  We had to actually ask for straws, and then watched as our confused waitress visited every table in our section straws in hand, trying to figure out who needed them before solving the puzzle.

The food came and it was atrocious to put it mildly.  I burned my elbow against my plate, which would have been somewhat my fault, if I didn't have a taco salad.  The lettuce was hot, the tomatoes were hot, the cheese was hot.  I suspect they cooked the whole thing, plate and all in an oven.  I might have gotten past it, if the beef weren't swimming in soup at the bottom of the soggy taco shell.  

I also ordered chicken tacos, which had dry flavorless meat, cheese which tasted like processed mozzarella string cheese, and nothing else.  Bleh.  I didn't finish either dish.

My wife ordered steak ranchero tacos, which came with a decent presentation, but my wife said they were also flavorless.  She offered me her last taco, but I'll take her word for it, that it was bland.

After trying to coax my kids into eating their quesadillas, I decided to take a bite myself, and wanted to cry.  Picture melted string cheese encasing a frozen chicken strip.

Next time we are craving decent Mexican, (which is almost always, since we are California transplants), we are driving the extra 10 minutes to Tequila in Rock Hill.  The place looks like a dive inside and out, but the food and service has never disappointed."}
{"text":"I recently visited this place for the first time and came back a second the following week. You can judge a Mexican place by their rice and beans (just as you can judge a Chinese place by their fried rice - if they put peas in their fried rice, get outta there). The rice and beans are on point. 

I ordered some sort of cheesy burrito (melted nacho cheese on the top and sides). It was really good. When you sit down they bring you chips and salsa. The first time the salsas we're pretty bland, but the second time one had a deep flavor which was great. Rather than the two red salsas, they should drop the mild (as their hot is mild) and add a tomatillo. Anyways, the chips are thin and crunchy and went well with the cheese from the burrito. 

The second time I went I had a beef stew burrito topped with cheese (again) and green salsa. It was great again. I wanted to try their horchata but they were out. I'm working my way up to carnitas. 

The environment looks like a typical Mexican restaurant (pretty unimaginative), but it seemed clean, so that's good. I only liked when they played traditional mariachi music versus some contemporary noise. The service is pretty good. Mario was our server the first time and he was incredibly nice so I'll be asking for him again. 

It's the best Mexican/Latin food in the area. Sabor might seem hip but lacks authenticity and honestly it's bland and inconsistent and I haven't gone to La Azteca to be honest, but with Charanda, I don't need to venture elsewhere. They have a return customer in me. Fair pricing (except the dessert menu didn't have pricing which peeves me, but I was told the churros were $6 which seems super high). 

I'll be going back and do recommend it."}
{"text":"First visit to this one and will be our last. Took forever for our waitress to come take our drink order so we went ahead and gave our food order. I ordered extra red sauce with my meal but got none. My husband had to ask for the shells that were suppose to come with his meal. Our waitress never came by after we got our meal to check on us. I asked for a box to take my leftovers home and asked again for the extra red sauce, we were charged extra for it. I have eaten at the Newport one and it is way better. By the way they were not busy. on"}
{"text":"This place is vastly improved and is probably the best Mexican in the area now. Try the Burrito Taxano. It has BACON. EVERYTHING is good with bacon."}
{"text":"Wouldn't even feed this food to my dogs. So many better options for Mexican food. Staff was friendly but that alone does not make this place worth eating at."}
{"text":"Mmmmm....so many different options of restaurants in the Concord Mills area!  We chose Charanda Mex. Grill & Cantina today, and it was a good choice.   Their chips and salsa were good, though I would like the chips better if Mexican restaurants would follow Chili's lead and serve the thin chips.   I had Baja fish tacos, which contain tilapia and slaw, along with  \"special sauce\" which amounts to a Mexican style mayo-tarter sauce.  I'm typically not a fan of tilapia, but these fish tacos were very good.  Also, I had a few bites of my husband's Steak Relleno \"Doña Juve and it too was very good.  The waitress and the hostess were very attentive and we will definately be back.  A huge plus is the fact that they have a restaurant health inspection grade of 99!"}
{"text":"Took a few out of town guests here and it was awful. My husband and I have been here a handful of times before, but this visit was the worst! There was a hair in our pins colada AND floating in our water! We never had chips and salsa at the same time, my husband asked for ground beef and received chopped beef, my taco salad she'll was burnt and our pitcher of margaritas were watered down! Will not be back! EVER!"}
{"text":"This place was just OK. There are much better Mexican food restaurants in Charlotte. The service was on point and everyone was very friendly. Ordered the cheese dip with the chips and salsa, the cheese dip came out cold and sent it back for them to put it in the microwave and it still wasn't warm enough. For dinner me and my companion split the large mushroom quesadilla. It was tasty but once again it was also cold. If the food came out hot and fresh i would have given them 4 stars."}
{"text":"I found this article in the Charlotte Business Journal - 
http://www.bizjournals.com/charlotte/news/2015/09/02/local-mexican-eatery-ordered-to-pay-104k-for-wage.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+bizj_charlotte+%28Charlotte+Business+Journal%29 

- Local Mexican eatery ordered to pay $104K for wage violations... Charanda Mexican Grill & Cantina has paid more than $104,000 in back pay to workers in the Charlotte region.

A U.S. Department of Labor investigation found that the eatery violated provisions of the Fair Labor Standards Act.

The department says the employer has paid $104,394 in minimum wage and overtime back wages to 13 employees at its Concord and Statesville restaurants..."}
{"text":"Delicious margaritas & food! The bartender isn't the friendliest but he makes a mean margarita (order the top shelf- totally worth it!). The servers are excellent and very nice. Yummy enchiladas, cheese dip, & the spicy salsa is the best!"}
{"text":"Not the best Tex-Mex I've had but also not the worse.  Our waitress was a bit too attentive.  She seemed to be looking for something to do since we were only one of four tables being occupied that night.  It wouldn't be our first choice of places to eat but would do in a pinch."}
{"text":"Went in and sat in the bar area. The bartender was also our waitress. She immediately took our drink orders and brought us chips and salsa. We ordered a couple margaritas and some queso.  The house margarita needs work, tastes like OJ with tequila.  However, the frozen Mango margarita was delicious!  We ordered a combination plate and carnitas. The enchilada and burrito were not very good, the enchilada sauce was very runny with virtually no flavor.  The poblano was really good with chicken.  The carnitas were not pulled apart, the meat came in large chunks, no biggie, had great flavor.  The food overall was ok, satisfied the craving for Mexican food, but not great for a $40 dinner.  However, the service was great! The bartender and staff were on top of taking orders, delivering and picking up plates! Great job on service!"}
{"text":"Ate out on the patio tonight, beautiful night but the service SUCKS out here!! 
Thought for sure wouldn't be forgotten with the other tables but YEP slow to bring things.
Asked for queso dip but didn't get till the meal arrived.
Ordered a build your own combo dish with tostada....was tasty but soggy! What's the point of a tostada if you have to eat it with a knife & fork?! 
Next time will go back to sitting at the bar!"}
{"text":"Food was so yummy. We were in the hunt for some good Mexican but that can be scary.. The atmosphere was clean, especially the restroom and the service was great. Our server, Isaiah was kind and attentive. When I asked about the drinks he was seemingly honest and that's very appreciated. Didn't try to up sell just for his ticket price. Very reasonably priced. Definitely recommend and we'll be back."}
{"text":"Went here with family and they were far from closed (8:00 pm)... We were brought chips but we were not greeted again for another 15 minutes...not even a drink order! All the young servers were playing around in the kitchen and ignoring the guests.  After not having drinks after almost 20 minutes and multiple servers walking past us laughing, we left without service. Terrible experience."}
{"text":"I am a regular patron in this restaurant. I enjoy the food, the drink specials, and the interesting people that work there. I come here for the big portions of reasonably priced decent Americanized Mexican fare and the people watching. The manager Chemin is a friend. He is one if the nicest people I have met in Rock Hill and he always has a smile and a kind word order the table side guacamole, you won't be disappointed."}
{"text":"This place is fantastic! The service was quick and very friendly, and the food was awesome. The menu goes beyond typical Mexican fare, and includes some unique twists. The Steak Tampiquena was incredible, and I would recommend any one of their dishes that has the poblano pepper cream sauce."}
{"text":"We love this place! Has excellent authentic Mexican food and a great staff. Don't go anywhere else in this area for this type of cuisine!"}
{"text":"Good food. Mild and regular salsa served w chips. Large variety of margaritas. Standard (Americanized) Mexican dishes."}
{"text":"We enjoy both RH locations and were in this area, so decided to try the Fort Mill location. It was jumping for a Sunday early dinner, but were quickly seated. Unfortunately for us, it was in the bar area. Normally, I am fine with this is there are a bevy of servers; however, that was not the case here. One server was pretty much running around making margaritas and serving tables, so service was so-so. Music was very questionable, like Latin Hip-hop unedited versions. Strange. Another thing we noticed was the flavor and portions were smaller. Oh well, lesson learned- stick to parts you know sometimes. :)"}
{"text":"Service wasn't the best. Food was a little below average. Portions were a little small for the price. Way to much compatition in the area to settle for mediocre"}
{"text":"Really great Lunch we just had!
Enchiladas quite tasty (ground beef), salsa was good as well as Chips. Solid place with excellent value too."}
{"text":"Bad food. Really really slow service. It was dead when we were in there on a Saturday night. The only reason we went to the restaurant was because my sister said it was good. She was wrong...as usual. I nomally check Yelp first. They didn't care because the tip was included in the bill."}
{"text":"Below Average at best food the steak burrito was pathetic. A five person meal took over 45 min to receive our food two orders were incorrect.  Took three request to get out check and then actually had to walk to another server to get it cleared out. 
One of the worst service experiences I've ever had.  Having spent 7 years as a server I have only not tipped one other waiter in over 30 years. The manager's was apathetic at best. 

Long story short better food and service at Taco Bell at 1/4 the price."}
{"text":"Let me start by saying service here was pretty impeccable. Not MIA and not over-bearing, a good mix. Refills on the waters/ soft-drinks and, my favorite, the salsa. Very friendly servers. 

The food is pretty decent (from what I can tell). You won't be disappointed with the Fajitas or a Taco Salad. However, think twice about the Quesadillas. Unless your into a Quesadilla SOUP you may not be thrilled with this dish. The runny, \"cheese dip\" cheese is like a pure swimming pool on your plate. I had to eat the entire Quesadilla with a fork and knife. 

But yeah, other dishes look good. I'd be back."}
{"text":"I'm surprised by the low ratings here, I enjoy the food here and the service is pretty good. No complaints. We are regulars."}
{"text":"Looking for a Mexican restaurant in the area, couldn't find it so we stopped here. Was greeted and seated right away. Informed of specials, drinks good. Food good. Service fast and good. I will definitely stop by in near future."}
{"text":"The chicken fajita nachos here are so good! Ill be back to get them for sure. The service was a bit slow and there was an issue with one of the orders but they resolved it fairly quickly."}
{"text":"I have been here many times for lunch and have gotten the chicken fajitas every time. I normally like variety, but these are just too good. The only negative is I wish they provided more spicy options. I have had them make dishes spicer and it was fantastic, but they charge extra. Otherwise, this has become my favorite place to eat in the area."}
{"text":"Awesome authentic Mexican food!!  Staff is great and very friendly!  If you are in the area and are craving good Mexican food, come here!!"}
{"text":"The food here is far better than your run of the mill Mexican restaurant and the portions are generous. Everything I've tried has been excellent, including the drinks. In my three visits the service has been prompt and courteous."}
{"text":"Great location, terrible food. The 10$ special maragirta was friggin nasty, wife wouldn't drink it. Chi I was almost ok, but very dry and overcooked. My burrito had marinara sauce on it, I swear.. It was marinara tomato sauce. Waiters were all tools.. Totally will drive to Monroe or huntersville for Azteca.. Avoid this place!!"}
{"text":"Worst Mexican restaurant in Concord, possibly Charlotte. On the Border chain Mexican would be a much much better option. I'd avoid."}
{"text":"Been here a few times now. It's the epitome of a 3 star place. It's good, not great. Starting with the atmosphere, it's your typical Mexican restaurant decor but maybe a little better with granite counter tops and nicer bathrooms. The service is friendly and lightning fast. The salsas (regular and hot) are water thin. I prefer thicker salsas but I occasionally like the thin kind too. These ones are average at best. Same with the chips. My wife and I both ordered the chicken enchiladas verde and they are good.  They also have a good children's menu for the little ones.  If you're looking for quick, tasty Mexican food and you're near one of their many locations, it's worth trying out. I just wouldn't go out of my way to get there."}
{"text":"We have been to Charanda Mexican Grill and Cantina on many occasions and we've always had a good experience. When you come in, you're greeted by a smiling face and seated quickly. While waiting for the waiter or waitress, you'll notice the nice Mexican decor with the authentic colors and memorabilia and before you know it, a big bowl of hot salsa chips and your choice of salsa dip. Obviously, the chips are so good that you keep eating and eating them and by the time your food comes, your practically full. You know what I'm talking about.

The wait staff has always been friendly, polite and helpful considering the many times we were indecisive on what we wanted to have. The menu selection is filled with many Authentic Mexican dishes of course and yes if you have a picky eater on your hands then there are alternatives. We've always been pleased with the food, but sometimes there are inconsistencies with the dishes, I assume because there is a different cook. And there have been times we had to send food back several times but it was resolved. 

Overall, a decent spot if you're wanting some Mexican food in a hurry, but don't expect to be blown away by the flavor, atmosphere or overall experience. There also is a bar and tvs to keep you occupied while waiting on food."}
{"text":"Not bad just not good. If you grew up here you think it's great. If you ever lived in Texas this couldn't make it to a one star. What the hell pulled pork sucks in Texas. Just have to set realistic expectations."}
{"text":"Mediocre food and drink plus pricey for a strip mall Mexican place. Waiter had the personality of a piece of wood and I noticed this with others too. Not rude just not there."}
{"text":"Drink specials,  good sauces, big drinks,  and superb service make this a great restaurant. Everything we ordered was delicioso. Tacos de Asada come with a spicy green salsa that I want multiple bottles of for Christmas presents!!! Super Yum!"}
{"text":"Me and my boyfriend have been coming here for months. Especially since we moved down the street. Every time we come sit at the bar so Noah can tend to us. He's very nice. Attentive. And knows how to make some drinks!!! The food here is always amazing. The queso is what we always start with, it's so tasty. I've tried several items on the menu and they all have been amazing. And the margaritas are amazing. (One of the main reasons we come) BTW....Thursday is $4 small $7 medium $10 large margaritas! We haven't had a disappointing experience since we've been coming here."}
{"text":"We were looking for authentic Mexican. This place was a bit of a let down. The atmosphere is great and the service was good."}
{"text":"Charanda was a little better the second time around.  We won a gift card as part of a silent auction package, so we went back to use it.The service was much better this time.  They got our orders right and it was relatively quick.  The food was still average at best, and the guac is definitely from a bag.  It is very runny and tastes like Wholly Guacamole from the store.  I am glad there are more authentic options in Fort Mill (La Poblanita).

This also seems to be a place for the families of Baxter Village to bring their hyper kids.  One kept jumping up and down and kicking my chair in the booth behind me.  Several others were being way too loud.  I'll probably still only go back if I had a gift card but wouldn't set out to go here on my own accord."}
{"text":"I'm surprised at the negative reviews of this place. We have been 3x at different times during the day and have NEVER had a bad dinning experience or bad service. The service is always prompt and accurate. The food is good and the guacamole is fresh and not even close to being runny or \"from the store.\" Chunky and fresh just like it should be. For a small restaurant still working out the details of being relatively new, I hope the reviews will continue to improve as does the restaurant itself."}
{"text":"Food was ok. I know it was getting busy but servers were rude. They changed our server and I received my food before I got my drink. I had to go to bar and ask for it."}
{"text":"What the heck is up with the guy who makes fresh guac at the tables ringing a bicycle bell attached to the his push cart as he walks around the restaurant? I'm not kidding. Tacky and annoying. 

My family and I ate here a few days ago and will not be returning. We've been several times and sometimes is very good, sometimes it's average. The salsas (mild, hot and extra hot) are good sometimes but just plain boring other times. I'm completely baffled by the comments saying the salsa is awesome. The only reason we have returned is because our kids ask to go there. I guess they are easily impressed. ;-) We won't go back, though. Our food was boring. I can make food of the same quality at home and I'm not even a very good cook. It was bland and they do not put any garnish on the dinners we've ordered.

American Mexican food almost always has at least a small amount of lettuce, tomato and possibly sour cream and guac. One of the items in my dinner was a tostada. It consisted of the shell, beans and cheese; that's it. Umm, no. Can you say cheap-o restaurant? Plus, my tostada was completely soggy. I sent it back along with the rest of my dinner. I'm from Arizona, Mexican food is my favorite and I've eaten in hundreds of times. I've never been served a tostada like that. Gross. 

I had an issue with my meal as mentioned above and when the server, who was very polite, could not resolve it we asked to speak to the manager. This manager is just not customer service centered at all and proceeded to argue with me over something that she was clearly in the wrong about. I've had a bad experience with this same manager in the past as well. She should not be working in a restaurant. I was nice to her. She was a jerk to me both times. 

Do yourself a favor and eat elsewhere."}
{"text":"The manager here is a rude ignorant woman who should NOT be working in costumer service. I will not be going back for that reason alone. Also I seen a bug crawl across the floor. YUCK!!!!! I would not recommend ANYONE to eat here!!!"}
{"text":"I've ordered take out from here twice in the last week and the food is fresh and tasty!"}
{"text":"I don't know what all the bad reviews are about, I have ordered take-out from this place twice in the last week and the food is fresh and tasty and lots of food for the $$$."}
{"text":"First off, there was a strange smell as we entered the restaurant and that should have been our first clue. Service, once it arrived, was just ok. Food was way too crispy even for Mexican food. Drinks tasted watered down.  No one seemed to care at all about experience. ..this is my 1st and last visit."}
{"text":"This is definitely a \"one and done\" for us. We were excited to have a Mexican restaurant move in to the shopping center by Lowe's Home Improvement. 
The hostesses were not friendly, did not ask if we wanted to sit indoors or out, and although the restaurant was mostly empty, took us to a booth next to the kitchen door in the bar (what I would consider one of the worst tables in the house). When I ask for a different table, she wasn't very happy about it.

We were seated and given menus, our server (who was nice but poorly trained) took our drink orders. He brought our waters, chips and salsa (and he mixed up which was the mild and which was the spicy salsa) but it was a good 10 minutes before our drinks from the bar arrived. We requested napkins (at this point we didn't have any napkins or silverware). We had to ask for napkins 2-3 times before we got some.

Our food was delivered on screaming hot plates (definitely had been sitting under the warmer for a while. My Chili Pablanos were soggy because they had been sitting around for a while. We still had no silverware at this point. Again we asked for it and finally received the pre-rolled cheap silverware in a napkin.

Our server was fairly attentive but not great. As we were leaving the restaurant, there was a large group of folks at the hostess stand waiting to be seated and the three hostesses who had been working earlier in the evening were no where to be found.

Definitely will not be going there again!!!!

As we drove by Taco Bell on the way home, I commented to my husband that we could have gotten an equal quality meal there for much less money."}
{"text":"I would say that this is standard to sub-standard Mexican food that you would find in a standard Mexican restaurant, but it was not great or even good by any means.  I definitely would not eat here again."}
{"text":"Wow!  Made to order guacamole at your table?!! Fresh, delicious dishes...chips and salsa were so-so.  Great atmosphere."}
{"text":"Finally tried this place! Not too shabby. My meal was delish. The prices are great too. The service was a bit slow but very courteous. I will be back for sure!"}
{"text":"Service is always fast and accurate. Food is good and reasonably priced. I love coming to Charandas. They also have great drink specials/ certain days when kids eat free."}
{"text":"Good food if you are looking for Mexican that is Americanized. Easy to get in, never a wait, but the service can be a bit slow and not the most attentive servers."}
{"text":"I'm usually pretty long-winded with my reviews, but this place can be summed up as average. 

It's your standard Mexican restaurant with colorful decor and Mexican mariache music playing. We went for an early dinner on a Sunday, and the place was just a little under halfway full with a few outside tables taken, too.

The margaritas are huge (even the medium), and the chips and salsa are free... and fine. The fella got a taco/burrito combo, and he said it was good. I got the fajitas carnitas, and they were fine. Our waitress was young and sweet but maybe just a little forgetful.

Charanda isn't going to wow you, but it isn't going to disappoint you either."}
{"text":"The reason I gave this two stars is because  we were seated close to the bar and bugs ran across the table. Also it wouldn't kill the bartender to use his smile muscles. Other than that the food was good."}
{"text":"This place is a tourist trap.  I ordered pollo fajitas and my friend ordered carne asada.  The chips brought to the table with salsa were cold.  When our food arrived, the plates were burning hot but my fajitas were just room temperature and the same with the carne asada.  It was very clear nothing was fresh and both plates had just been microwaved.  The chicken fajitas were very disappointing with small pieces of chicken and large ungrilled green peppers.  The carne asada was the same.  There was nothing fresh about our meal.  It was stale and seemed to be microwaved using old ingredients.  The check total was very expensive at $36.01 just for the two paltry meals!  Nothing in this restaurant was authentic, and the food and service were both poor for that amount!  Do yourself a favor and avoid this restaurant at all cost!"}
{"text":"Terrible service. I arrived for lunch and no one came to greet even though a loud chime sounded. I waited for 8mins and when I asked a waitress for assistance she looked as if I had just asked her to say the alphabet backwards in under 4seconds. If there is an understaffing issue, people need to be prepared to be more attentive to multiple zones."}
{"text":"It's your normal American-Mexican fare but it was delicious. The service was great and the food did not disappoint. I went for lunch on a Saturday before going to Concord Mills so it wasn't crowded. I actually plan to go back! I'm not sure why this place has such mixed reviews - I had a great experience!"}
{"text":"food is fantastic...I have eaten here at least 5 times.  Service is pretty much always less than fantastic but the food makes up for it!"}
{"text":"Great place ...next time I will request  patio table. I had Arroz.con Camarones.  (SHRIMP W/RICE)... good flavor. The right size.  Very tasty and also we ordered  fish tacos  perfect. The only problem was no more space.for desserts."}
{"text":"Food was fine but didn't get what I ordered,the waiter then told me that I didn't order what I know I did.never apologized or said sorry I didn't hear you correctly. Then told us we didn't have to tip him,Very rude, won't be back"}
{"text":"I have been here couple of times and all I can say is they suck big time. Their service was horrible, food was taste less. The last time I was here, we were waiting for a couple of friends so we ordered our drinks and they brought chips and salsa as you would expect from any Mexican restaurant. We were talking so we didn't realize that we empty out the chips with in fifteen minutes between the four of us. Now, we were still waiting so I was the waiter to re-fill the chips and that's when the waiter freaked out for some reason and said you can't give you another basket of chips until you order the food. I was like WTF!

So, my friend was like alright, let's order our food and the other folks will be here soon. We started to order our food and the waiter couldn't make out what we wanted. He could hardly speak in English. Now, I am not one of the lucky once who can speak Spanish but the last time I checked, English is still the first language in America. 

The other waiter came to help him understand what we wanted for our entree. Once our friends arrived, it took him thirty minutes to come back to get their drink order. The order came out wrong so we had to send it back. The food tasted OK as well so all in all it's one place to visit if you want to waste your money for nothing."}
{"text":"My boyfriend and I love coming to this place and grabbing food. I really like to get the tostada or vegetable fajitas and my boyfriend loves the pollo chipotle dish. Do not go here if you're in a rush or need to get to a movie.  They allow you to take your time and enjoy your meal."}
{"text":"We really enjoyed the fresh food here, very good service as well.  Love the fresh guacamole made at your table.  Everything here is amazing,  which explains the crowd every weekend.   We went on an off night during the week and sat right down.  I had a Mexican shrimp dish that was spicy, unexpected but delicious.   The chips and salsa were also very good, we ate through them and needed a refill.  Chicken dishes are also very good, a must try if your looking for great authentic Mexican cuisine."}
{"text":"This is my favorite Mexican place in Fort Mill. I love that they bring spicy and mild salsa to the table. Tasty food, good portions, great lunch prices, and friendly staff, what more could you want!"}
{"text":"I love this place. They have the largest menu and the greatest bartenders who make kills margaritas. My guy and I love to go and sit at the bar and just drink and eat and laugh for hours. Only downfall ( not for them) is that they are always super busy and we love to sit at the bar so sometimes we have to head to Don Pedro's but we ALWAYS go here first .."}
{"text":"Not impressed. Have it a shot twice just to see if it was just a one-time deal.   It wasn't. Slow service and food is subpar. 

There are better options in the area."}
{"text":"If I wanted to pay for below average Mexican food and terrible service then I might come back."}
{"text":"Do yourself a favor and turn around and leave! This place SUUUUCKS! I tried to be objective after reading all the negative feedback, but every negative review was right on. It's too Bad because It's close to home and in a really good location. I got a manager to come to our table and told her that we just wanted to leave. My wife's order was wrong (no chicken inside a wrap) and my chicken enchiladas were acidic, runny green sauce that looked like it was poured on top right out of a can and I had to douse the rice with salt and pepper. The waiter had a look of frustration like he was used to unhappy customers. The staff and the manager were friendly enough and the manager was very apologetic and didn't argue with me about my dislike of the quality of the food and my refusal to pay. We got up and left and will not return."}
{"text":"We checked this place out without seeing the reviews, unfortunately. We are from Texas, so we have high standards. The food was okay. Nothing excellent but they do have good queso (called \"cheese dip\" there - is that a NC thing?) and the guacamole was decent. The chips were not homemade though, nor were the tortillas. The refried beans were okay though, as was the salsa. The fajitas - eh, okay, the other items we ordered were passable. 

The service was awful. They took forever to get to the table throughout the meal, they didn't bring napkins until the end, they acted like it was a huge inconvenience for us to be there, even though we were polite and ordinary customers without special requests."}
{"text":"Very poor service.  I do not recommend this restaurant for Mexican.  Sat down and no server showed up at our table for twenty minutes.  Drinks came after our food.  Server didn't offer any adjustments on our bill to compensate for the poor service.  To compete they need to get their act together."}
{"text":"Really great food, good service, extremely affordable prices.
Went there for lunch and had a very good experience. I will definitely go back again."}
{"text":"Ok...I have been here before for take out and usually the people are very friendly.  I called for take out and when I got there, the door was locked.  When I called to explain that the door was locked, I got no response. After that call finally the door was opened by someone who definitely didn't apologize or even explain.  Then asked how many not even looking at me.  I stated I was picking up an order, then she said go over to the bar -and literally walked away.  Wow....bad enough I wasn't feeling well and picking up some soup for myself, but to be treated like I was \"bothering\" them is another thing. Was I really going to give them my $?  

When I ordered, I specifically asked if the soup was a good portion. Said yes, yes. good.  Uh ok....the container wasn't even all the way full & the chips taste a bit stale.  The mild salsa that was given, not even half full in this small container.  They weren't very friendly-the only one who smiled was the man behind the bar.  

The soup is good and ordered a side as well.  The portions are not what I would call standard or even decent.  I wish El Cancun was still open, sad they closed, because when you ordered any food, you got what you paid for!  Looks like I will be searching for another Mexican restaurant."}
{"text":"Me and my friend decided to eat here since it was so convenient for us. I can't even think of a time where I have ever had horrible Mexican food. Its pretty hard to screw up. Same ingredients different presentation. This restaurant however is the only place that can mess it up. The only item that I did enjoy was the $3 margaritas that seemed a fair amount for a decent size glass.  If what you are craving is Mexican do not head here."}
{"text":"I am from Birmingham, AL and come here from time to time for business. I happened to come by this place on my 2nd visit and ALWAYS come back every time! The whole menu has much to offer and they are good about making adjustments if desired. The margaritas as great, too. I wish I could move this Mexican restaurant to Birmingham, so it could put out the 100 there out of business."}
{"text":"I love this mexican restaurant. It's kid friendly, we've always received our food and drinks in a timely manner, the staff has always been kind and welcoming. I love the steak fajitas, but have been eyeballing the baja fish tacos and think I will try that next time, as I see other reviews saying they are good. The salsa is very good and the chips hold the kids over until we receive our food. The manager even came out to us and explained one of the dishes to us, my husband was unable to pronounce the meal. He was very knowledgeable, and you could tell he was passionate about the food. We will be back again!"}
{"text":"It isn't my favorite Mexican place, but it is the best in the Fort Mill area.  Margarita's were so sweet two of the four of us started feeling it in our stomach's.  Atmosphere is above average, food is alright and service was good."}
{"text":"Love this place , great service, love Baja fish tacos 
Love the margaritas!!! I will come back"}
{"text":"The service was slow. They didn't have enough people working. The food was bland and luke warm. I used to love this place, but it was just awful."}
{"text":"We just discovered this place...  it's the best Mexican food around!!  Fresh, tasty ingredients, friendly service (thanks Mario!), reasonable prices, generous portions...  this place is what you're looking for, I'm telling you  :-)"}
{"text":"Went with co-workers last week and overall it was a positive experience (3.5).

It was a co-workers birthday and they gave us a little dessert (enough for all but one of us...but hey, it's free), and they put a big sombrero on him while singing, a nice touch! 

I ordered the shrimp fajitas. There was only really 5-6 shrimp on a huge bed of onions (and some red bell pepper sprinkled in). On the plus side the shrimp tasted great and were cooked nicely. I also really liked the rice it was served with. 

 I  thought it was weird that my co-worker and I ordered the same thing but they only brought one container of tortillas. I would rather have had my own as it's kind of gross to put your hands on something someone else is eating. 

The atmosphere is nice, it is clean (smelled-strongly of cleaner)..but I am okay with that. 

I would return if I were in the area."}
{"text":"Like most American \"Mexican\" restaurants, Charanda is American-Mexican, not truly Mexican.  In other words, it has food that you are quite unlikely to find anywhere in Mexico.  That doesn't mean that it isn't good, it just means that it isn't truly authentic.

Charanda has a good variety of flavors on their regular menu, and the ingredients taste fresh, if a bit heavy on those American ingredients - cheese, sauces, sour cream and such.  They would do well to cut back and let the pieces of the dishes speak for themselves rather than dousing them so heavily.

You also might want to try and get a glimpse of the large margarita before you order one for yourself - they are pretty large, indeed.  Even the regular is a nice size.  Consider yourself warned."}
{"text":"Came here for lunch and got sat right away. I like how they serve hot salsa and mild salsa. The hot salsa is good. I ordered off the lunch menu and got the burrito, taco and rice. My food was pretty good and it seemed like it was a large portion. My friend got the chicken fajitas with corn tortillas. She liked everything about it. The service was not good though. Our server checked on us maybe 1x. We asked for more salsa and no one ever came back. We had to ask for it again and by the time we were done with our food, they brought it out. There wasn't even anyone around for us to ask after we asked the first time. 

I will probably check this place out again. Hopefully the service is better."}
{"text":"Awful experience. My wife ordered a dish with spinach it came without the spinach. She asked where the spinach was and the waiter told her its in there somewhere. We asked him to show us where the spinach was and he told us its in the sauce somewhere. I had to wait another 20 mins to get my food. When it finally came we asked to speak to a manager. The waiter disappeared and came back 15 mins later and told us there was no manager and that he was probably hungover from cinco de mayo. Made me wonder if the manager was scared to talk to us or if there really was a manager there at all?? What if there was a fire or some kind of emergency? We will never go there again and give this place our hard earned money."}
{"text":"My wife and I stopped into Charanda when they first opened some time ago and the Mexican chicken soup I had was not that great.  I decided to give them another try and noticed they had bean soup on the menu, which is another Mexican soup favorite of mine besides chicken soup.  I was very surprised on how good the bean soup was, probably the best I ever had.  Tres Peso's use to offer bean soup, but no longer do and it was the only thing I ever ordered there.  I haven't been back since.  

Anyway, the service was outstanding and has a comfortable setting.  I'm a little surprised by the reviews.  I did mention to the waiter that I was there before and I didn't care too much for their chicken soup. He told me they had changed it for the better.  He also told me they have a sirloin or beef soup now. something I plan to try the next time I'm there.  

I definitely plan to return."}
{"text":"I have been going to this restaurant since it opened. I would estimate 20 or more times.  We made the mistake of going on Cinco De Mayo and it was very unpleasant.  We had to put our name in and wait for a table.  I guess they forgot about us even though one of us stayed seated in the entryway the entire time. We took turns at the bar where we stood for at least 30 minutes waiting to get a drink and were ignored the entire time.  We only got seated at a table when the restaurant started to empty out and I went to the hostess and asked if we could get a table then. The food was good as usual but since it had taken at least 30 minutes to get a drink we didn't tip on the drink payment.  When we got the credit card bill, the restaurant had tipped themselves $3.00 for two drinks.  We did tip after our meal but not the drinks.  We called the restaurant and told them about it and that they had lost a very loyal group of customers including my family and friends.  I don't think anyone should add a tip to any bill and I really felt like we were discriminated against that night."}
{"text":"Absolutely HORRIBLE!!!!  The bad experience started with a rude hostess followed up with an inpolite waitress who did not know the menu and topped off with a horrible meal.  Within ten minutes of leaving I was vomiting and I was sick for another 6-8 hours after that.  I would have to say this was in my top five of Horrible eating experiences.  Taco bell would have been an upgrade to my experience here.  I will never return and would not recommend it to anyone unless they were my enemy nah not even them! :( :( :( :( :(  Thats 5 frownies!"}
{"text":"The worst Mexican Food we've ever eaten!  I have no idea what \"beef\" was in my tacos, but I could still taste it three hours later. Save yourself time, energy and money, the food is gross!!!"}
{"text":"Not horrible but not the best. My service here has never been what id like it to be and honestly ive converted tons of people to fiesta maya which in my opinion is a lot better. Its more expensive and less tasty. My parents used to eat here all the time until they tried fiesta and they haven't been back."}
{"text":"I love this charandas! Always great service  and great food! Very friendly staff as well"}
{"text":"I have mixed feelings about this place.  The food is average but the menu has unique burritos that other Mexican restaurants don't have, like a burrito stuffed with French fries.  The chips and salsa are good, but the \"hot\" salsa isn't very hot.

I came in on $2 taco night and I was charged full price for the taco.  Makes me wonder how much extra money is coming in on that night due to people not thoroughly checking their check.

Service was rather slow and was pretty much \"fend for yourself.\"  I ordered chicken fajitas and I never received them at the table and had to flag a different staff member to grab them for me."}
{"text":"Got seated at lunch time quickly, then received chips and salsa promptly. Wait staff was great, refilling water and salsa without asking. I got sopas spouse got cheese steak burrito.  I liked the chicken in the sopa, generous portion and smooth sauce, great guacamole sslad. Spouse loved flavors of the cheese steak so much he forgot to give me a taste!"}
{"text":"Solid 4 star spot.  Food was very good, margaritas were fantastic and service was always there.  All for a good price.  Recommend the burritos."}
{"text":"We ate here on Thursday and experienced the worst service I have ever had.  When we arrived we were the only table in the restaurant.  It took over 20 mins for someone to take our order.  When food came out over 40 mins later it came out separate.  By the time one of the meals came two others were already done and this dish was a bean and cheese burrito.   Then when it was time for our bill I had to search for our server only to find two servers hanging out at a table in the back room watching tv.  Awful experience and will never go back."}
{"text":"Very disappointing they do not offer single steak  tacos, you have to buy an entire platter that's just way more than anyone can eat for dinner. Also a little pricy and service is mediocre at best."}
{"text":"Never a bad experience. The food is average and the drinks are as well but definitely always a great go-to spot if you're in the mood!"}
{"text":"The Mexican specialties in the homemade food is amazing here.

Staff is attentive and works with a smile. The liquor in the bar other than tequila leaves a little something to be desired but they have a great selection of Mexican and domestic beers."}
{"text":"DELICIOUS!!! We've been here two times and the food was quick, hot, fresh, and delicious!! Our server the first time was a jerk, but our guy yesterday was friendly and attentive. The chips were hot, crisp and fresh. They came with two salsas, mild and spicy.  The only complaint I have is they give it to you in such little dishes, but they do refill. We had the lunch specials. Baldie had the beef burrito and taco combo with rice. I ordered steak and cheese with onions in a flour tortilla.
Omg, this bitch has the most tender, juicy beef, grilled onions and cheese all melted, oozing and melding together with all the juices from the steak. I'm droolin ova here now!! That came with rice and pico de gallo on lettuce.  I needed some refried beans, man!! All that, plus 2 sweet teas and it cost it's 20 bucks!' Ole, bitches!!"}
{"text":"I have been a very loyal customer of Charanda's for many years, of course starting at the Rock Hill location. I won't be returning to the Fort Mill location again. The last three times service has just been horrible. Don't get me wrong the food was good but the service is frustrating at best. Our bean and cheese dip never came until I reminded the waiter. This was after we were almost done with our meal. No drink refills. Not one until he asked me if I wanted my check. I said yes and I asked him if we could have refills on our drinks. The refills came and I was brought unsweetened tea. I was drinking sweet tea. Sorry but this location has lost a very loyal and repeat customer. If your going to go to Charanda's you might want to take the time and go to the Rock Hill location."}
{"text":"4/12/13-Great food, good service & great prices. We eat here twice a month. Free chips & fresh salsa when you sit down to hold you over until you order...~nice                8/10/13 The 1st few times was great but the last few was not all that great. Hope it gets better soon"}
{"text":"Horrible! Food is definitely not fresh! Everything had the same flavor! Guacamole needed seasoning. The Chile Releno was so mushy."}
{"text":"Well the chips and dip are pretty good. Service sucks though. I asked for sour cream literally like the minute we walked and and they brought the chips and dip. It took roughly 10mins and 3 people later to bring out some F*#king sour cream.
Not impressed. Staff sucked, food was OK. The only thing I give them 5 stars on is the atmosphere, You walk in and you know your in Mexico, you just know it. It's very festive. Why would you close at 9 o'clock? The food let me talk about that, O yea I can't because I don't remember it, I just know it took 30 minutes to get some sour cream...CRAZY!?!. I tried to look at the drink menu that was on the table but it was just so sticky and dirty. I won't be back EVER!"}
{"text":"Very good wait staff. Friendly & quick. 
I had fajitas - sizzled when brought to table . Son had enchiladas verde - he wolfed it down. Husband had pollo pablano - he loved it. Salsa is tasty - either mild or spicy"}
{"text":"This is probably the worst Mexican food I have ever had. When ordered queso first and it was watery and strangely solid white...no chilis, etc. Once the entrees were served they smell coming from them was strange and off putting. My daughter and I couldn't eat more than a bite to try and see if we could push past the smell. Mexican is our favorite and we have been to more Mexican restaurants than any other type of restaurant. This place really disappointed."}
{"text":"I am not from the area so probably won't be eating here again anytime soon. I would love to give a 3.5 but swung more towards a 4 because I felt some previous ratings of a 1 was unfair. 

Food: the chip salsa was a bit runny and the chips were assorted with a few that were stale. As for the entrees and dinner as a whole. It was great! The food was of decent portion, cooked as ordered, came out hot and delicious.

Service: our server was very friendly and did a good job understanding our questions and request. He returned promptly with refills and asked if everything was good several times. I give him .

Pricing: average for an eat-in Mexican restaurant 

If we are ever in the area again looking for Mexican, we wouldn't hesitate to eat here again."}
{"text":"Wow. I went with a friend and margarita pitchers were on special. Ours came out and we looked at each other and said this is straight margarita mix. We told our waiter it didn't t taste like there was actually tequila in it. He said he would be back and 5 minutes later the bartender came to our table with a shot glass of margarita. He slammed it on the table and insisted we try it, and he said that's what he served on the other side of the bar. We were shocked. He was such a jerk. Just another instance of a Mexican restaurant trying to screw you over on margaritas."}
{"text":"Four stars for lunch specials that extend from weekdays to include Saturday as well as a $2 special on Corona and Corona Light. That's a great place right there.

And the food? I'm a fan. I chose from the lunch menu, the Burrito Texicano. Americanized and with a Tex-Mex sort of vibe to it, the burrito was filled with ground beef and beans, then topped with white queso and crumbled bacon. A nice pile of rice on the side, this was a rather tasty meal and as a lunch portion, pretty good.

Chips were fresh and hot, served with a hot salsa and a more mild version. Both were good.

Good Mexican food, beer specials, I'm definitely a fan!"}
{"text":"Had a nice Fajita lunch here recently. The restaurant is clean and well run.  Food is served hot and prompt. Staff is very pleasant.  The food is good, but not above average. They have a large bar area and seem to be a local favorite.  Very convenient to I-77.  I would stop here again."}
{"text":"I will never eat at this location again. I've eaten there a few times and every single time the food has been OK but not great and the service has been nothing short of deplorable. The waitstaff is grossly inattentive and rude. They treat elderly people like crap."}
{"text":"Horrible restaurant.
Service is bad, food is horrible and pricey, server took my plate and I was not finish and I can keep on and on. save your time and money not worth it."}
{"text":"We came here today for a lunch service and sadly, won't be returning. My favorite part of the meal was the chips and hot salsa. 

I ordered the chicken tortilla soup with a chicken taco side for a dollar extra while the bf ordered the lunch quesadilla. I have to admit, I could not get through the chicken tortilla soup. My first issue, was the enormous glob of sour cream that was thrown on to my soup making it somewhat inedible. I scooped it out and attempted to eat again. I was sad to find that there were no veggies or beans in my soup, it only consisted of chicken broth, rice, bland shredded chicken, and soggy tortilla strips. 5 minutes in, I gave up, couldn't get past the soggy tortilla chips which was similar in consistency to soggy cereal. Bleh. The taco was also not appetizing. 

The server was nice but she wasn't as attentive as she should have been. It took forever to get a water refill. I will not be returning to Charanda in Fort Mill."}
{"text":"Tablemade guacamole was delicious! I had a vegetarian combo that was also very good. Location was a bit dark and could have been cleaner, but the service and food was very good."}
{"text":"Not a bad Mexican place in Fort Mill. My goto spot is Don Pedro in Rivergate, but we decided to try something new. I thought this was on par with the Don. Its a typical menu, but slightly different. The sauces especially were different. I had a Mexican beer, enchilada's with the unique sauce. We had cheese dip which was good. Overall, a solid place. Staff was nice. I would definitely come back if in the area."}
{"text":"Went here for drinks and chips. They charge $1 extra per flavor of your margarita. So if you want a mango margarita, they charge you more. What else? The drinks were decent, the server was nice (Paulina) and other than than, no complaints. We left nice and sauced, but the drinks were just eeeh nothing great. 

Casual and loud place, and the name of it is CHARANDA ! lmbo"}
{"text":"Worst experience in a long time.  Went in for to-go chips and salsa and waited 15 minutes before I was ready to leave.  The bartender could have cared less and was more concerned about singing along to the radio while organizing her receipts to actually care about the customers.  When I asked why chips and salsa were taking so long she said \"oh someone is in a bad mood\".  I got up and immediately left. Worst service ever!  1 star is higher than they deserve."}
{"text":"In town to visit family and somebody suggested take out from this place.

I shared an order of chicken fajitas con mi hijo. Really not very good, small portion and the didn't include the flour tortillas. The salsa was a notch below Pace."}
