{"text":"Not the best customer service. Every time I come here the cashiers have an attitude and seem miserable."}
{"text":"This is my favourite chatime location! There is rarely a line up, the service is great, and for some reason, the flavours of the teas are so much better in comparison to the locations at hillcrest mall, or commerce gate!   Pearl milk tea or roasted tea with bubbles is the way to go! I've tried other flavours, and they are good, but I always revert back to the original flavours!"}
{"text":"I've been here a handful of times and it is still the worst Chatime I've ever been to of all the ones in the city. Although there is not a long line up compared to the other locations, it is by far the slowest. Slow un-attentive cashiers and slow at making drinks. AND the drinks don't even taste the same as the others locations."}
{"text":"I came home to Vaughan and found out that they opened a Chatime at the plaza across from Vaughan Mills and I was so happy. I dropped by here with some of my cousins and we all ordered drinks to go. One of them never tried bubble tea priced so high, so he was pretty hesitant to order.  We got him hooked on that Hazelnut milk tea. One of the favourites. The servers here are also extremely nice; one of them working the counter recommended a drink to me and it was very refreshing for that day. Will visit again."}
{"text":"Dropped in to try the 'Order the Yelp' special.  The service was great - super friend staff! They were so quick with preparing my order and it was absolutely delish! I believe it was called Mango Twist. I got the aloe topping as well - it was different but I definitely enjoyed it and will be back for more."}
{"text":"Had no idea they opened a store here right across from Vaughan Mills. A couple friends and I came here at around 10pm and thank goodness we got in just before the crowded so we didn't have to wait in the massive line. This location in general is less crowded as it is still relatively new.   As always I order No. 2 regular roasted milk tea with no ice and sugar. I order this every time I go to Chatime  and even though I am not a frequent Chatime drinker, I have tried it in couple of downtown and uptown locations. This one unfortunately does not match up with the quality of its other locations as the tea really lacked flavour. Hopefully they make some improvements to keep the consistency."}
{"text":"Service was terrible. Drink was okay, I ordered pearl milk tea but didn't receive any tapioca, she insisted that it didn't come with it even though I've got it many times before."}
{"text":"Went: Sat, April 25, 5 p.m. (73/100)  What others have said about the lines is true. It is never that busy. We went during the day twice and did not find the music too loud or that the staff talked to each other too much or too loudly. Maybe we were just lucky that day.  I board game at a lot of bubble tea places so I don't think I really appreciate them much. I think i have had bubble teas, but never really excellent bubble tea, and the tea here is good.  3.5 stars, rounded to 4.0.  Went: Sat, May 30, 2:30 p.m.  The bubble tea was fine on this day as well.  3.5 stars, rounded to 4.0."}
{"text":"Love their selection and their unique tasting taro milk tea! Great atmosphere and customer service."}
{"text":"No line up! Right across from toys r us at vaughan mills. Purple sign, hard to miss!   Ordered a large roasted oolong milk tea ($4.70) with grass jelly ($0.50) which was soooo aromatic and rich! It's a spring seasonal drink so order it while you still can!  The place looked very clean and all the staff were super nice. The drinks were made correctly and efficiently; tapioca was very chewy and not at all over or undercooked. My favourite topping of all time from chatime is their grass jelly! It was so smooth and complemented the drink so well!! Highly recommend it.   Definitely give the roasted milk teas a try if you're into the original flavour. It has a much richer and bolder taste.   Overall, I was expecting this location to be busier much like the downtown Toronto ones, but I'm so glad the quality was consistent and I didn't have to wait in line!"}
{"text":"You can never go wrong with Cha Time. Rewards points allows you to get Large drinks for $0.55 - taro slush with tapioca will always be my go-to (even in winter)"}
{"text":"Im so happy that there is a Chatime in Vaughan because it is so close to my home. The Jasmine milk green tea with grass jelly is the best, I will be coming here more often & the staff here are so friendly!"}
{"text":"I've been at this location once or twice, I love the bubble tea. Quite exceptional than other bubble teas I've tried. However, the service can be good or bad. The last time I went, the server Kerri was too busy focusing on the basketball game to focus on our order and was rude and not at all welcoming."}
{"text":"One of the better and more generous Chatime locations. You won't find crazy lineups (like at the Willowdale location) and will be in and out within minutes. They always give a generous serving of tapioca, which I appreciate. There may be better bubble tea places in the GTA, but since this is the only location in Vaughan, it deserves some recognition."}
{"text":"I really enjoyed this location. I was being indecisive and wasn't sure about what to get. The cashier was very helpful and was able to help me with that. I got the new season drink with the snow pear. The green tea was a lot strong than I expected but I was also warned about it. Maybe if I added some aloe it would have helped."}
{"text":"I'll start by saying I was an avid fan of chatime way back when it was the \"it\" place for bbt. To me, it has lost some of its former glory.   Religiously went to this location when it first opened and through my experiences, everything is so hit and miss here. The drinks would be great one day and bleh the next. Same goes for their customer service, although it leans more towards the not great side, but I guess ppl just come here for the drinks..   You'd prob be better off going somewhere else for bbt or even another location, unless you live around the area and don't wanna go far lol what can you do.   3.5/5"}
{"text":"Drinks are the worse of all locations and service is slow and bad. I'd go somewhere else next time."}
{"text":"I really enjoy coming to the Vaughan location. All the staff are so friendly makes me feel like home every time I buy a drink here. Sometime the line can be long but the service is quick so you'll get you drink in no time.   Top drinks for me is coconut taro smoothies and original milk tea.  I usually get it with less ice and sometime 50% sugar."}
{"text":"I must come here every weekend.  Their drinks are really good and the staff is usually very friendly.  I recommend not coming on the weekdays unless it's right after they open because I came at 1:00 pm on a Tuesday once and the tapioca was very hard and not very fresh.  I guess the tapioca was old because not many people came in and they didn't have a new batch.  But other than that, I definitely recommend coming here."}
{"text":"Great location with lovely staff! Service is always very quick and staff are always very nice. Even with the Wonderland after-hours rush, staff were able to pump out orders very efficiently.   We tried using SPC here by just showing the barcode, but there are specific rules that all Chatime locations are subject to when it comes to accepting SPC, and this was not allowed. The cashier was very understanding though and let us use SPC anyways! Make sure to bring your physical card or use the SPC app, as these are the only forms they can accepte"}
{"text":"Hot sunday afternoon = mandatory chatime run. Matcha red bean with tapioca smoothie was delicious!"}
{"text":"Im a regular Chatime drinker, im quite the fanatic and although I am open to trying different bbt establishments I still think Chatime is number 1 in my heart. The drinks are consistent and the selection of toppings are amazing. This location is one of the fastest locations ive ever been to, they have a great system going and everyone is on their A game!"}
{"text":"So happy they opened a chatime 5 mins away from where I live! To be honest, I've always heard of the hype about the other chatimes,  but I actually never tried their bubble  teas because the other locations were too far...i finally tried them when they opened one in Vaughan. I've only tried their passion fruit green tea with tapioca and hazelnut chocolate milk tea with tapioca..and i love them both! The passion fruit is pretty sweet, but you can always ask them to adjust the amount of sugar as well as the ice. The hazelnut  chocolate is soo good, it's like a melted liquid milk shake! Their tapioca is always perfect, sweet and the perfect texture.   Service is always great  when I go there. There's a couple of girls there who are really friendly!   I'm no bubble tea expert, but i have tried many places since i was a kid (in pacific mall, ten ren, some in chinatown, other malls etc) but i give this place 5 stars...probably because its the best bubble tea in vaughan, location is convenient for me, the prices are very fair, and the drinks I've tried have always been tasty and consistent."}
{"text":"Location: 3175 Rutherford Road Unit 31 Vaughan, ON L4K 5Y6 (same plaza block as the Starbucks) Price: $$ Serviec: Good  I find that Chatime has a really confusing option with the percentage of ice and sugar. So I usually just opt for regular ice and sugar (makes my life easier), and every time I alter the percentage it always taste funky. This location is not as busy as the others, I find. It awfully cold in there, maybe it's just the location of the door- dunno what's going on there.... On a good note, their halzenut chocolate milk tea is bomb.  Verdict: ehh"}
{"text":"Kinda of a late review, however....   Food/Drink: I tried the Taro Coconut Smoothie!!! YES!!! Soo soo good :)   Decor: No problems. Nice and inviting.   Service: Fast. Didn't have any problems.   Yes! I will visit you again Taro Coconut Smoothie :)"}
{"text":"Just dropped by right now as boxing day can be super tiring and I needed a break lol. I ordered my usual grass jelly roasted milk tea, 30% sugar less ice. The drink is consistent to other chatime locations I go to, so that's good. Very convienient as it's right across from Vaughan mills."}
{"text":"If you are ever craving Chatime before or after shopping, come here. This is probably the biggest location that I have been to which makes sense since it's beside the mall. Great service here and they make their drinks right comparable to the Yonge and Finch location. Finally tried the new flavour Almond Roasted Milk Tea. It was delicious just that next time I will get it without sugar because it was just a bit too sweet."}
{"text":"This is the go-to place where I'd stop by with my friends whenever I'm in the Vaughan Mills area for refreshments!  I've been to several Chatime locations and looking at other reviews, I must agree that its a huge plus that this place is seemingly never too crowded (especially considering its right in front of Vaughan Mills).   I am very simplistic as I usually call the original Chatime Pearl Milk Tea with tapioca bubbles.  As expected from any Chatime I've been to, their bubble tea is always the best because their milk teas are always so much creamier and richer tasting in my opinion.   Staff here are all smiles and friendly and the service is fairly quick compared to many other Chatimes I've visited (especially because it's also much less crowded in comparison).   Great place. Would recommend!"}
{"text":"One of the better locations. The lines can be long but the service is pretty fast.   The drinks are a little inconsistent sometimes but in general they're not bad. I mostly like this location because it doesn't take me 20-30 minutes just to get a drink.   Would recommend if you're shopping around Vaughn Mills and need your bubble tea fix."}
{"text":"This place is great. Open late! No matter how busy, the service is always fast and always right. Surprisingly have not messed up our orders even with all the personalizing that we do. The drinks are fresh and well priced! Large selection in flavours.  Everyone speaks good English and is good at what they do. Recently became a regular and will be back for more very soon. Only downfall is that it's small, and it can get very very crowded even late at night."}
{"text":"I come here very often, probably once a week. Depending on who's working, the service can pretty good or needs improvement.  I always order grass jelly milk tea with less ice and sugar and 40% of the time the cashier would punch in roasted milk tea while the other 60% of the time, the cashier would clarify if I wanted regular milk tea or roasted milk tea. While I don't mind the taste of roasted milk tea, I would much prefer the regular milk tea instead.  Lineups vary depending on the time. It tends to get busy later in the day but once your order is placed, the drinks are made pretty quick."}
{"text":"Chatime is a nice place to go when you want a quick bubble tea, although I prefer bubble tea places with more variety, this place gets the job done!   Their milk tea is great as well as their mango smoothie! I love the tapioca   The only reason it's not 5/5 stars is that the top of the line bubble tea places are much tastier"}
{"text":"Okay, this place is in a strip mall right across from vaughn mills..their selection of drinks is pretty substantial compared to some of its competitors and dare I say there are at least two other stores in the same Plaza offering bubble tea as well. I got Red bean tea with reduced sugar and ice and I enjoyed it very much. It did wait for about 15 minutes to get to the register to place my order and then another 5 to receive my tea.   I took one Star away because I think it's rather too busy and the lineup was quite long and this particular location doesn't have a lot of room to stand comfortably either unless you're fine with lining up next to the bathroom, in a corner, almost smooshed against the wall.   I could literally feel the breath of the person lined up behind me Although  they seem to have a few tables, with the lineup the place seems a bit congested."}
{"text":"I love this place and visit it whenever in the area which is alot for work. The staff are super friendly and fast  I get the same milk tea ( number 1 on the menu )  This place is almost the high light of my visits to Vaughan"}
{"text":"This is the Chatime location I visit more than any other because it's the closet. The customer service is always very good and efficient with taking orders and answering any questions about their drinks. Their drinks are made very well, more often than not. But sometimes, their bartenders who make the drinks miss the mark on the drink ordered.   Specifically for this review, I just want to say that once in a while I find that my drinks are very bland, like they forgot to put syrup or the sugar in it to make it sweet. Last night, I dropped by to pick up 3 drinks (#1 pearl milk tea, #5 qq mango juice, and #2 roasted milk tea w/ grass jelly). The #5 qq mango juice was extremely bland...like it was either very watered down or they forgot to put sugar or flavouring in it. I have had the #5 qq mango juice drink before many times and it has always been delicious with a distinct sweet mango flavour. But last night, the taste of my drink did not even resemble mango...at all. It can be described as a very lightly flavoured large size cup of water with barely a single pump of mango syrup. The #1 pearl milk tea was for my sister, who relayed that it was very good, as usual. On the other hand, I was very disappointed with my drink.   If I had the time to go back and let them know about the subpar quality of my drink in person, I would have done so...because bubble tea drinks these days are quite pricey at about $5-6 each for a large size drink and honestly...they should be made to perfection and the taste should at least resemble the flavour of the drink name. To sum it all up, Chatime is great when they get your drinks made the right way. Otherwise, it's a disappointment when you take a sip of your drink only to find the bartender completely bungled it."}
{"text":"This is one of the best bubble tea shops around.  And around they are--this chain has grown worldwide like a virus.  Why?  First, the drinks are made with mostly syrups rather than powders.  They must have their own custom syrups because the flavours are unusually bright and refreshing.  Second, you can select the amount of sugar from modest to \"make your teeth ache\"  You can also choose the amount of ice.  This particular store is staffed by very friendly workers, and compared to Richmond Hill, the lineup is non-existent.  I make it a point to stop in anytime I pass Rutherford Road and the 400, since it is a quick detour. And worth the stop!"}
{"text":"Pretty much any regular weekend begins and ends with a cup of bubble tea. I decided to be adventurous today and try one of their new promotional drinks \"blueberry Roasted milk tea \" very strong and sweet. Great place to hang and catch up with some friends, will usually be able to find a table even on the busy weekends due to their relative quick service."}
{"text":"The beverage quality at this location is really poor. I've given this location two tries. My drink came out too milky, with not enough tea the first time and too watery the next. I've ordered the same drink from multiple locations in the GTA and they all come out relatively the same every time.  I understand that this location is new but their staff needs to be retrained on how to make the drinks to standard. They couldn't even get my ice level right. I asked for regular ice and got so little ice that it became no ice within a few minutes--and that was after I had asked them to add more ice already.  I love Chatime, but as far as the Vaughan location is concerned, I wouldn't come back. It's a shame to the brand."}
{"text":"Not really what I expected!  I got the most basic thing -Oolong Milktea with grass jelly and it disappointed me! The milk-tea taste more like watery milk mix with tons sugar ( even I asked for less sugar). Jelly is not thick enough. IF it's easier for you, I will compare the grass jelly I had as tofu! it doesn't taste like it. So upset that even it's just 5mins away from my home, but I rather go somewhere else to have better bubble tea!"}
{"text":"I LIVE FOR THIS SHIT! Drinks are addictive. And im talking about this location specifically. I have been to a few other locations around Toronto but this one is my favorite. Drinks ALWAYS made right, they give you a hell of an amount of pearls (or other toppings) and price is decent for bubble tea. If you are looking for a healthy alternative to the typical sugary drinks from local coffee shops (yes, Starbucks) then i would recommend this. 30% sugar is just enough sweetness for most of the drinks! Yum :)   Did i mention how fast they work? I came in when they had just started 1 order of 25 drinks and they finished it in less than 10 minutes! Wow!"}
{"text":"Always a pleasure to come to this location. Staff is friendly and drink selection is always stocked. My fiancé and I love Chatime Vaughan."}
{"text":"Amongst other Chatime locations, this one has faster service. I was able to grab my delicious drink and go on my way in a jiffy. The drink was delicious as per usual."}
{"text":"This location is quite busy and the staffs are like robots. No personality, and not very \"smart\". They can't seem to remember the orders and were all confused when they hand out the drinks."}
{"text":"Great little bubble tea place. Lots of flavours and quick service. I like the coconut milk tea, honey dew and the vanilla"}
{"text":"Place is pretty cool but the hazelnut milk tea with pudding was a tad too sweet. Next time, I'll lower the sugar percentage. Overall, not impressed with the drink. I'd stick with the popular drinks."}
{"text":"The mango slush is really good, but every time I order anything taro it tastes like powder. The service is quick, but it does get packed."}
{"text":"My only problem with Chatime was the lack of edibles.  The tea itself was ok."}
{"text":"So good to have a cha time in Vaughan. Makes it easier as we don't have to drive all the way to Richmond hill. The cha time quality is just as great as all the others. The drinks are consistent and delicious, made to order. They also sell desserts such as cakes and donuts and other baked goods in their glass window at the cashier."}
{"text":"Wow. Their customer service has seriously gone down. And this is because of the co-owner? Or at least that's who it appeared to be. A woman cashing me out wearing jeans with her hair tied up. I went in with one person ahead of me in line and when it was my turn, I asked for a #1 no ice, and then asked that for my point redemption, if it would be regular or large. She said regular and that I would have to pay an upgrade fee. She then said it would be $1.20? At least that's what I heard, and I asked why, since I was only upgrading to a large. She said \"you want tapioca don't you?\" UM #1 comes with tapioca already??? So I said this and then she charged me appropriately the 55 cent upgrade fee. She didn't update on the computer that it was a large though, so I asked and she said it was fine. I then waited for my drink, and as there was only one person making the bbt, I understood the wait time (which was about 5 minutes). I was watching the woman cash the customer after me too and she was very antsy, as if she just wanted us all to get out of the establishment already. The customer asked for a red pocket because they ordered two drinks and there is an annual red pocket promotion if you purchase two drinks. The woman then sternly said \"no because you got one drink half off\". Maybe \"not to be combined with other promotions\" should be mentioned on their main Chatime site so customers don't go wasting money on a second drink for the chinese new year promo then. When I was driving out of the plaza, that's also when I noticed there was ice in my drink when I said NO ICE. Maybe slow down and relax so you can get your orders right?"}
{"text":"Meh. I came here as it was open late and we wanted to go to a place to sit down and chat ... Hahaha get it \"chat time\" -_-  Anyways... Ordered the macha red bean milk tea. It wasn't anything spectacular but it was good. It didn't taste watered down or powdery like other bubble tea chains. The place had plenty of seating and the service was fast and friendly.  They also had free wifi."}
{"text":"This place is making mad money. Still busy on a Sunday night at 9pm!!!! People craving bbt."}
{"text":"Came here as everything else was closed around the holidays. I've been here twice now. It is located very close to Vaughan Mills.   As always, I order the #2 regular, no ice, no sugar. However, it just seemed a bit off for me. I told my friends \"This tastes like cardboard\". I have no idea what cardboard tastes like but it was just different from the other locations I've been to. Bland. I don't remember it being like that the first time I was here.   Service was fast... I will try it out again another time. Lots of seats inside to catch up with good friends. Lots of parking available at the plaza."}
{"text":"This Chatime may be one of the Chatime stores that doesn't have a long line up. It's near my house so I always come here for bubble tea.  The menu is the same with other Chatime but the taste isn't consistent. Sometimes it's too sweet, sometimes just way too bland. Some with too much ice, some just wishy washy...(even tho I always order mine with regular ice).  The staffs in the morning are nice and friendly and quick. But those work during night shifts are just inattentive and they always talk too each other. Plus, they have the music on extremely loud.  Even tho the line isn't long, you may experience some impolite people who love to cut line and don't care much about your feeling.   You may also have to experience some eye-staring from other customers if you're asian and you walk in with a white friend/boyfriend/group of friends. Just ignore it and enjoy the drink.  The decoration is the same with other chatime: purple wall, and purple straws (which I love).  I love to come to this place in the morning since the staffs are friendlier and it's not very busy. I can have my drink in less than 5 minutes, and the staffs know what I want and how I like my drink.  You should try their Taiwan Plum Lemon Iced Tea (it's pretty good, take my word for it!). But just don't try their new Thai Iced Milk Tea. It tastes like Vitamin C supplement drink (eww!)  But since it's near my house, and good thing is they open late and during holiday, so I always stop by to satisfy my bubble tea craving lol  Not the best place for bubble tea, but definitely the best around Vaughan Mill mall."}
{"text":"3.5 stars... a step up above an average BBT place  I can get the hate/love for Chatime ...  I've only been to most Chatimes during the slow times and I've never had too much issue with service.  This spot has better parking than others but I can see this spot being overwhelmed easily.    Consistency is what brings me to Chatime over others.  Their drinks are not the best but I know I will get a good Black Pearl milk tea each and every time.  The stores itself are hit and miss... this one is medium sized with about 10 tables available.  The cleanliness is not the best but it's certainly not the worst like the one at UofT where it's just like student housing.  The menu provides a lot of options... I do appreciate how they show you their top 10 so if you're ever stuck, you can't go too wrong with any of those choices.  So you like slushies... lots of options.  Milk teas... have them all and they're actually tea based.  Juices... they're good but they're really not juice.  And they have many others.   Service today was quick as there was only 1 person before me.  To get the drink wasn't so bad... only maybe 5 minutes which is reasonable.    Black Pearl Milk Tea - Good tea flavour and the usual that Chatime is known for.  I like how this place uses real tea.  At half sweet, this was enough to give you that nostalgic Bubble Tea memory without the sugar crash.  The pearls was soft but not overcooked.  I think Chatime is quite consistent in good pearls. 3.5/5"}
{"text":"Tried their new blueberry muffin roasted milk tea mousse today and tasted awful. The service was not good either. They have exceptional service for frequent customers (the two ladies standing in front of me were frequent customers as they know the cashier). However, I did not receive the same service as them. Would recommend the chatime at Warden and Steeles ave as they have better service and better drinks."}
{"text":"Chattime has really become an established brand for bubble tea. It is super good with extremely friendly staffs! This is one of the better locations where the drinks taste amazing (St. George Chattime sucks because terrible staffs, terrible mixing of drinks). Anyways, 4/5 for great drinks and great staffs, I'll always come back!! Really wish they could turn this place into a board game cafe because that would be super cool."}
{"text":"Garbage drink, worst service. Came in on a weekdays and the house was empty but the lady just seemed pissed and didn't wanna serve at all. Even if they offer free drinks, I would absolutely never go back. I hope Chatime close down this location or at least improve quality and services.   Save your money and time and go to other locations."}
{"text":"It was a rocky start when this Chatime first opened, but now that they have everything down to the T, it's my preferred location. There's usually some empty seats and the wait time is never long. Staff are also super nice and friendly. Sometimes I'll come here to study on a weeknight - thank goodness for free wifi!  The only bad part is the crazy Vaughan Mills traffic/parking mess that happens on the weekend, but it's not their fault."}
{"text":"Chatime with no line up.  Conveniently located right across from Vaughan Mills.  Drink is consistent with other locations. Service is fast and quick.  Negative:   The interior can be really cold especially in the front. Background music extremely loud, I cannot even hear myself think Owner and staff testing alarms which I understand but why they have to talk to each other at top of their voice?  Good place for takeout......."}
{"text":"sometimes we will come here for a drink. Bunbble tea was yummy especially you want it at midnight."}
{"text":"Love the bubble tea milk tea with 1/2 honey. Best bubble tea as far as I'm concerned."}
{"text":"Dinner in the area? Check. Chatime after dinner? Double-check!  This Chatime is conveniently located near Vaughan Mills mall, and even conveniently closer to many dining options. Each time I'm here, there's at least one other patron, but the wait is usually short. There are always empty tables if you want to stick around, but there's always music playing. There is free wifi."}
{"text":"Hot weather conditions like this is better fight with cold drink so I chose chatime. It so refreshing"}
{"text":"Nice treat after shopping at Vaughan Mills.  Service was fast and efficient. Exact same menu as any other Chatime locations. I tried the drink of the month (for September its Wintermelon mousse). I like the mousse they offered at Chatime, creamy and delish. Previously I tried Matcha mousse and liked it; it has the bitterness of green tea but in a good way.  Wintermelon mousse was good but I would prefer the matcha as I love green tea. My hubby had our all time favorite drink #3 (taro milk tea), its good as always"}
