{"text":"Came here for lunch the first time a couple days ago and we were seated by a friendly waiter. We were served complimentary chips, a bean dip and salsa right away. and the chips and beans were good and I have to say, the salsa was impressive. My friend and I shared the Steak fajitas for 2 which was plenty and delicious. Loved that the peppers and onions were well cooked and took on the flavors. The corn tortillas served with the fajitas were excellent- they were nice and thin which is the way they should be! We will definitely be back!  ******** Ok, came back only 2 days later- March 31, about 5:30pm for dinner after recommending to a friend, and the service was TERRIBLE! So disappointing! They were very busy and we had the bartender for a waiter and everyone seemed to really have too much to cover! The food took almost 45 minutes to get there. Drinks were not refilled. Asked for more tortillas for fajitas and never got them. My friend and I got the steak fajitas for 2, and we only got one side plate of rice/beans sour cream and guacamole. That makes so sense at ALL! We also had to wait over 20 minutes to finally get our check. What a difference from my first experience! If I do come back, it will not be at dinner time. I spent $50 on fajitas for 2 and a couple margaritas and was very disappointed. Food tasted great- one plus for the night!"}
{"text":"Start witj the free bean dip and salsa, very good, but be careful not to spoil your dinner!  Big portions and very delicious.  I had a chicken taco and tamale that were excellent, my friends had chimichangas and the were good but recommend no sauce because it takes away the crunch, other than that mmmmm. No room for dessert, but they generously brought us a yummy treat to finish off the meal. A great experience, we'll be back, and tell our friends!"}
{"text":"I am a snob when it comes to Chile relleno's  and I was very munched impressed. Staff was super friendly and very accommodating. We will definitely be going back! Next time I'm trying to spicy margarita."}
{"text":"I have eaten at Chavelos twice and I think is is the best Mexican restaurant here in Henderson.  First time I had the queso con chorizo and it was great.  Most restaurants skimp on the chorizo but here it was just he right amount with great flavor.  On second visit I had a standard chicken quesadilla.  Excellent flavor and very large portion size (had to take most of it home).  Friendly staff, excellent service, I highly recommend Chavelos!"}
{"text":"Seriously my husband and I have been looking for good mexican food in Henderson for what seems like forever and I can honestly say we finally found it , this place is so amazing ! The food was delicious, I had the chili Verde omg ... yum ! The service was really good and everyone there was very friendly :) We are definitely going back !"}
{"text":"amazing guest service and the food was impeccable! Louis and Sergio made my first visit a great one! Check this place out if you guys are looking for an authentic Mexican restaurant in Henderson, Nevada"}
{"text":"This a new spot by my house, I ordered the huevos rancheros. They where great. The people are very friendly. I do recommend this Mexican restaurant."}
{"text":"This place is pretty basic and the prices are about the same as lindo michoacan. The menus someone posted on here are older the prices have been raised. The food was ok, and the staff was very friendly."}
{"text":"Wow!  Nothing we expected. My guy and I pulled up to what looked like a take out, hole in the wall dive, and soon realized it was much more. Great service, friendly staff. The owner came out and greeted us with a warm smile and handshake. Prices are great, food is amazing, atmosphere is even better. Truly enjoyed this place!  Please visit and try it out so we can continue to come here."}
{"text":"Asked for a burrito with steak, cheese, and lettuce. Repeated it ar least 3 times. Got a overpriced burrito with onions, peppers and tomatoes. Lunch ruined, will never be back."}
{"text":"If you think of Margaritas and Mexican food go together, then you will be disappointed. The Margaritas from $9 to $12 are the weakest I've ever encountered in the Valley. It's disappointing to visit a Mexican Bar only to find such bland cocktails. Other than that the prices are very reasonable."}
{"text":"Nice sit down environment, decorated as authentic Mexican. Great food and service. And the owner takes a personal interest in your experience. Don't forget the guacamole!"}
{"text":"Great food and our server was so nice. A really cool vibe and authentic cuisine. So glad this place opened up and seems to be doing really well. I got the chicken enchiladas and they were bomb! They even hooked it up with a dessert for our first visit. Can't wait to go back!"}
{"text":"Staff was very friendly on arrival. Chips with beans and salsa right away. Food arrived in about maybe 10 minutes. Very good presentation and generous portions. Had a green chilli pork burrito that was excellent.  Will definitely be back for more."}
{"text":"The food was really delicious, they had a nice variety of choices without being overwhelming. I really liked that the waiter spoke in both Spanish and English to us. Our food came out insanely quick."}
{"text":"So good!! Give this place a try it will be worth it! Everything was delicious from the chips and salsa to our actual entree I will definitely be back soon."}
{"text":"First time visiting. I am Mexican and know what Mexican food should taste like. This was very disappointing. I could not eat it. I took it home for my dogs who have a less critical palate . And it was too expensive for the lack of quality and service. I give this place six months to close unless they can make the food taste better . 10 dollar shots of tequila is a rip off. You can buy a bottle at Costco for 49 bucks. Sorry but no good."}
{"text":"Best Mexican food I had there beef tacos are my specialty try them out and there margaritas!!!   Great customer service did not have no issues highly recommended!!"}
{"text":"My wife and I recently had dinner here. This was our second visit. The food was absolutely delicious. The cup of fideo was perfect. The margaritas I highly recommend. It is nice to have a good quality and authentic Mexican restaurant here. You won't be disappointed."}
{"text":"Amazing spot! My wife and I have been here a couple times now and it's amazing how consistent and flavorful our dishes were. Each dish packs a punch and really stands out. The chef and staff are fantastic. Great location, and amazing ingredients. Will for sure be back."}
{"text":"We came in with a big group shortly before closing time. The staff was very gracious, and made sure that everything that we needed was taken care of. The food was absolutely fantastic and the atmosphere was good. The size of the entrées was such that I don't think anyone at the table finished. Everybody left smiling. Excellent!"}
{"text":"We were very impressed with the service and food. This is the best Mexican food I've had in this area. It starts with a cup of Fideo, which was delicious, and ends with a fried tortilla drizzled with caramel and chocolate with whipped cream. It was delicious also. The service was prompt and friendly. We will be returning to this restaurant in hopes that it will be as good next time."}
{"text":"First time coming here all the staff is friendly. They have the best preparada especially for a hang over. Pretty good for chips and salads is good as well."}
{"text":"The spot is great, the location itself and The food was fine, we ordered combo platters with enchiladas, tamales, flautas, and tacos. The flautas were not fried though it was more like an enchilada. The service was super slow though. For a small place I didn't think our wait times for drinks, and food"}
{"text":"A good sit down Mexican place is hard to find, but this hits the spot. Family friendly, Delicious food (kid and adult approved) and excellent service!"}
{"text":"The food was delicious, and quickly served. Margaritas were a little weak however still good. We got the free dessert for checking in on yelp which was also really good, and lite so perfect after meal sweet! Prices are a little high for the type of restaurant. Overall this was a great experience and I would come back."}
{"text":"I love this place!! Service was excellent,  food is fabulous, salsa is outstanding. This is the only Mexican restaurant I will go to in Vegas. Prices are good, you get alot of food for the price."}
{"text":"Great happy hour, good service, we will be back. We are new toVegas, this is a great neighborhood spot"}
{"text":"We stopped in for the first time and loved it. Service was great. Chips n Salsa very good and fresh.  My tacos where very good. Will go back and ant to try more of the menu. Great spot."}
{"text":"Everything we ordered was great Chile Colorado the carne asada cheese plate amazing starter chips and salsa was great Service good as well"}
{"text":"Just tried this place recently, and enjoyed it very much! Seemed very authentic. Food was delicious and I always enjoy when a manager or cook comes to see how everything was, makes you feel like they truly do care about their work/craft.  We also received a free dessert!! My fat as was so excited for that!! Awesome place will be back"}
{"text":"Great food! Steak is not a steak, very small and thin. I ordered Tierra y mar and my husband ordered el jeffe steak. Margaritas were good."}
{"text":"Tried for the first time today and we're pleasantly surprised. Amazing fresh hot food!!!! The service was amazing as well. Very friendly crew. Definitely WILL be back!! Thanks for being so wonderful, our go to Mexican restaurant was Juan's but you have surpassed them, yay!!!"}
{"text":"1st time here. The food was really good, you could tell it was all homemade.  E vhf everything had great flavor and it was all fresh.  That's the upside.  Downside, the place needs more help. Our waiter was also the bartender so our service was a bit sporadic.  They had one busser who seemed pretty new but you could tell he was making an effort.  Cute little spot on the hill off Sunset, hope this little place sticks."}
{"text":"Wandered in here due to high yelp ratings. I'm pleased to report that service was excellent and food was great! The margaritas were decent. The beans tasted fresh as well as the rice. The texture was on point as well. The only reason I didn't give 5 stars is because the tamales weren't perfect, but I am rather picky about tamales. I will definitely be coming back."}
{"text":"Omg service here is superior to every other place in town!!!! I am so glad we came here!!! I plan to be back several times over!   Food tasted great, too!"}
{"text":"This place is a wonderful little gem. I tried the Chile Verde and Chile Colorado as enchiladas and both were excellent. I'll definitely be ordering the Chile Verde in my entree on my next visit.  The atmosphere is a lot of fun, too. Live music, friendly service, and colorful decor all add to the experience.  The only negative part of my experience was finding my server at the end of my meal to redeem a coupon. But I'll definitely be back, and I'll be bringing friends!"}
{"text":"Fantastic Mexican food! Sincere and friendly service. Delicious magaritas, salsa, guacamole, dessert...everything. Highly recommend!"}
{"text":"We were looking for a place for lunch after golf. We just happened to come across Chavelos and what a find it was! The service was excellent, I think the young man's name was Lou but not positive. He made some great recommendations and everyone was happy with their selection. I had the chicken fajitas and was skeptical as I rarely find fajitas I like but decided to give them a shot. Wow!!! Excellent!! This is real down home Mexican food like what I grew up on. And talk about home cooking, they serve you a small bowl of Fideo soup with your meal. It's a simple pasta and tomato broth soup and it was just like mom made when I was a kid. We were told they had only been open for 6 weeks but they seemed to have everything dialed in. I hope local people support this place. I will be back next time I'm in town."}
{"text":"This was our second time visiting Chavelos. The first time we had a shrimp dish, that I believe is called Parrillada, was very flavorful. This time we shared chicken fajitas and guacamole.  The chicken fajitas were not bland like other places. They were cooked with a tomato and cilantro based sauce.  The guacamole was fresh and perfectly seasoned. After our meal we shared some buñuelos which were thin and crispy and drizzled with caramel and chocolate sauce with a scoop of whipped cream. It was  soooo delicious.  The staff was great and didn't wait long for our meal."}
{"text":"The service was awesome . We ordered vegetarian flautas(fried rolled flour/corn tortillas) that weren't on the menu, which the server checked with the chef. The server came back and said the chef would be happy to make them. The flautas came out and they were delicious. The server was very attentive every moment. The food was great."}
{"text":"The food was excellent. The service was fantastic! The pozole was authentic and delicious!! The owner Jose and (awesome) server Miguel were positive, knowledgeable, and knew the steps of service!!  I have a gluten allergy and they went above and beyond to assist! Did I mention, the MAJORITY of the items on the menu are gluten free!?!  Going back for a second visit tonight!"}
{"text":"Very tasty. The combos all have fideo soup with them and they serve you chips and salsa & bean dip. Will have to go back."}
{"text":"Yum! Ordered the Chicken Taco Salad and Carnitas Tacos to be delivered. Requested no beans or rice on the taco salad as we're trying to keep it keto. The salad came as requested and was really tasty! The Carnitas Tacos were great too! For the review (yeah right, lol) I HAD to taste the rice and beans that came with the tacos. They were really good too! Will definitely order again and visit in person as well!"}
{"text":"Great food and even better customer service!! Staff was amazing and very accommodating. Definitely will visit again. Carne Adams burrito was on point!!"}
{"text":"Food is so amazing here.  We have been here several times.  The only problem we once had was I ordered two burritos and got two small enchiladas for our to go order.  Not sure what happened that time?"}
{"text":"I ordered the carne azada chimichanga it was pretty good beans wear good rice was good everything was fresh and the meat or whatever was in the chimichanga had nice tangy flavor too it I also got the fried ice cream which was excellent better than most places I was with the family and everyone enjoyed their dishes excellent place to get Mexican food I recommend this place to anyone looking for something good to eat"}
{"text":"Awesome AND authentic Mexican food!! Staff super attentive!! All homemade food,  from the salsa and bean dip to the silverware,  a must go place"}
{"text":"The best margaritas ever. Everything is super fresh. I have been here several times. Every time is just as wonderful."}
{"text":"Amazing!! I have been to this place 3 times in the last two weeks because the food and service are wonderful. The service is outstanding everyone is so nice and helpful you never have to wait for anything. The food is fresh and delicious. So far I have tried the fideo, taquitos, steak quesadilla and the shrimp fajitas and all of them have been super tasty. My 6 year old loves this place because they give you chips, salsa and beans at the table and they will always make him a Sheryl temple. They are very well priced too, which is definitely a bonus. I live going to La Bonita but this place has jut as good of food, better service and is better priced. They have a great drink menu too, that I am excited to try next time I go. I am slowly becoming a regular at this spot."}
{"text":"First time to this restaurant and I ordered a burrito, posole and a side of guacamole after getting home I realized I paid 17 bucks for a burrito thru this app there are menus I went with those prices the posole was $4.95 and $7.95 for the burrito the reason for the 2 stars is because the food was ok it was the prices I would not be coming back, best posole I had is down the street to Rivas they serve more for less $."}
{"text":"Just tried this place and we enjoyed it. Its hard to find a good authentic mexican restaurant. The food was really good and came out fast. Customer service was awesome. They give you salsa and bean dip with chips and fideo before meal. Cool little atmosphere with a bar. Definitely coming back. I don't see how there could be negative comments...."}
{"text":"Such amazing food and very fresh. Excellent service and let us try some stuff that we didnt order also."}
{"text":"All around wonderful. Really great menu selection and prices are fair. I judge Mexican food based initially on the rice and beans; bomb! The salsa was delicious and tasted fresh. The service was outstanding! Smiles on the faces and checking in but not too much to where it's annoying...there's a fine balance to that ladies and gentleman! We had tamales...so good. Our server also brought us this beautiful little complimentary dessert since  I told him we hadn't been before. We will be returning for sure!"}
{"text":"Fantastic food, great new restaurant! Great service! Only downside is limited parking."}
{"text":"Love the decor and atmosphere along with the delicious food. We will definitely be back!"}
{"text":"Great food and service. So glad to have a good place in the neighborhood!!! We will be back. Photos during eating"}
{"text":"The food and service was great! There was a sewage smell as soon as you walk in, which was gross. After we sat for about 5 min, the smell subsided. But when we were walking out after eating you started to smell it again near the front door. I hope they get that fixed."}
{"text":"I was here for a weekend getaway and found this place on Yelp. The restaurant is located in downtown SD with street parking but it wasn't too hard finding a spot nearby. The food at Mission has a Latin-themed as the menu has both traditional breakfast items as well as Latin-inspired breakfast items.   We ordered a breakfast croissant and blueberry pancakes. They were both very good but the highlights of the meal were the side fruit accompanying the entrees.   The restaurant was packed inside with a 15-m wait at around 10 am. However we chose to sit outside and there was no wait.   Highly recommend the place. Great food."}
{"text":"This place was so good and the staff was prompt and friendly. We even were given dessert on the house just to be friendly."}
{"text":"Loved the Coctel de Mariscos. The sauce was the best I've ever had. Shrimp cooked perfect. The shrimp in the enchiladas were grilled and seasoned to perfection. We will be back."}
{"text":"Looking for an authentic Mexican restaurant? Go to Chavelos Mexican Bar and Grill. The family owned restaurant is fabulous. Great family, great atmosphere and the best mexican food in the valley! We had my husbands 60th Birthday Party here this weekend. All of our guest couldn't stop raving over the wonderful food and service."}
{"text":"Very good place, little loud because the restaurant was full.  Good food, good prices.  Very friendly and attentive waiter.  No draft beer ,  but food makes up for it.  Had fajitas- very good."}
{"text":"Our first visit here and we were quite pleased with our choices for lunch. My friend & I were both happy with the quality of service we received from Tony, our server and the chef/owner stopped by the table to say a hello to us as well. My friend ordered a chicken burrito with items of her own choosing, no problem with her special request & it was enough food that she was able to take half home for a later meal. I ordered Vampiros with pollo and received two with beans & rice which was also enough to take half home with me. They were good, not the best I've ever had, I prefer mine very crispy like the street taco ones but delicious none the less. Table salsa is the red tomato sauce one which so many places serve with a little onion and spices with a Mexican oregano flavor, not my favorite salsa. However, the chef brought a delicious green salsa which was hotter and had a wonderful tartness for my Vampiros. So if you prefer green and spicier heat, just ask. I recommend this place to anyone looking for tasty Mexican food, excellent service and we loved the authentic Mexican music."}
{"text":"If you live in Henderon it's a struggle to find an authentic, nice, Mexican restaurant that isn't loud and annoying. Well look no further!  Excellent drinks, service, yummy beans and salsa. The pork fajitas were phenomenal and the enchilada and tamale were delicious. Finished it off with a yummy sopapillo... it was amazing. Loved the atmosphere and the service. We will definitely be back."}
{"text":"Will definitely come back again for the salsa and bean dip!  Customer service was prompt and hospitable.  Chicken Enchilladas were Delicious! I wasn't impressed with the chilli relleno or the steak ranchero. Complimentary Soup was flavorful!"}
{"text":"My husband and I have been looking for a new Mexican place to try because it seems like it's usually just about Lindo Michoacán and Mecayos hasn't been good in a very long time, so after reading reviews and seeing photos we decided to try Chavelos.   Chips and salsa are my favorite part of any Mexican meal, so I was very eager to see how theirs were as I'd seen one review say they were bland. Well, whoever wrote that clearly doesn't have taste buds because their salsa and bean dip are AMAZING! The salsa has great depth of flavor and the bean dip also is seasoned well and actually differs from the beans they put on your plate with your meal. I was thoroughly impressed and could not stop eating the chips and salsa. My only complaint is that our food came out so fast I didn't get to keep eating more chips and salsa .   I forget the name of what I ordered, but I believe it's the first or second of the entrees under beef and oh my goodness it was so incredibly flavorful! It's hard to make green peppers into anything special, but even those I couldn't stop eating. The steak was a but over cooked for the temperature I requested BUT it was still very juicy, tender, and so delicious. My husband got the carne Asada burrito and he didn't realize they came wet by default (which he's crazy and doesn't enjoy) so that was his only complaint.  Our server and the entire waitstaff were very courteous and attentive, our drinks never went unfilled, and they checked in regularly but not too much. I don't remember our waiters name (I'm horrible with names) but he was very kind and had good suggestions when I asked. At the end of our meal they were even kind enough to bring a complimentary dessert, pictured with my review, which I thought was a nice gesture.   Overall our experience was very good, the restaurant was clean, and the food was delicious. My only complaint may be the price of some items, my steak entree was reasonably priced, however my husband's burrito was a bit pricey compared to other Mexican restaurants where it would be the same price but much larger. Even so, we will definitely be back as this is a great hidden gem in the Henderson area!"}
{"text":"The restaurant is supposed to close at 10pm, I placed an order at 825pm on yelp, I got a call back saying they weren't taking orders at this time because the kitchen closes in 5 minutes... it's 8:30 pm. So they close at 8:35? The lady who answered the phone was rude and hung up on me. Was looking forward to trying it, but I don't even care to try it now."}
{"text":"Just coming here for first time.  I'm in town for a soccer tournament.  Great for families. Great food,  great presentation.  Great service.  Clean place a maybe even good for a soccer team.  I'm having chilaquiles, my sister menudo and brother-in-law chorizo. All is delicious and authentic tasting.  Enjoy.   Thanks to Jose for his great service and flexibility with my sister's finikiness with menudo. ;)  Plenty of parking too. Oh and good micheladas, music, and margaritas!"}
{"text":"Authentic Mexican food! Great ambience and very friendly staff. The whole family enjoyed the meal of fajita & enchiladas. Clean place. Great service!"}
{"text":"Was really surprised by this place. Walked in not expecting much, but when the chips and beans came out, they were delicious. I was hoping for the rest of our order to come out with the same surprise.   The atmosphere was rocking, so many people were walking in and seated, inside and outside. The waiter was hustling, busy with sweat on his brow. I think they need more staff if they continue to get busy, it will allow the guest to have more service than a stretch of service and one person rushing around to make customers happy.   The food showed up, dove in, and it was absolutely delicious! I think this is my new favorite for mexican dining."}
{"text":"BEST MEXICAN FOOD IN TOWN! In my opinion of course....  Everything is so fresh and authentic. Ceviche here is the best i've had ever!   Happy hour is 4-7 Mon-Thurs with amazing deals/options.  Lou is the best sangria maker ever and is also so good at his damn job! He's a natural when it comes to customer service; literally makes you feel comfortable as hell.  I wish i could give more stars, but 5 will do."}
{"text":"A fantastic find! Food was served fresh and hot, the deep fried ice cream was awesome..."}
{"text":"The food was good, but not the best Mexican food. They serve chips and salsa and offer soup with your meal which is always awesome. I had the chicken tacos and it was really good. I recommend going for a nice dinner, as the prices are a little high."}
{"text":"We recently discovered Chavelo's Mexican Bar and Grill.  Their chips, salsa, and bean dip are delicious!  Our dinner was excellent and we even had leftovers for lunch the next day.  We went back again we loved it so much.  The service was great both times!  I would highly recommend eating at Chavelo's!!!"}
{"text":"Wow my husband went to pick up Togo food here to try it out we ordered a $15 burrito and they give us what looks like an enchilada lmao i thought this was a joke. Cold ass tacos. Run do not go here!! Oh now i opened my tacos and those are all wrong too!! Gross bland food! Guam sucks too."}
{"text":"Absolutely amazing. The food was terrific and the service was exemplary. Thank you so much for having us as your guests"}
{"text":"They go way overboard with cilantro. They put it in everything. I I ordered a taco salad the menu had a list of the items that was in it. I asked for some items not to be in it. He brings me a taco shell bowl with lettuce and things that was not on the menu. He got it all wrong did nothing to correct it. And made me pay for it. Won't be back."}
{"text":"Huge menu and great service. Location seems cursed but hopefully they are successful. Bummed about $10 margarita, no happy hour, and free salsa. But the rest of the food was great!"}
{"text":"We came on taco Tuesday and we were very happy. I had the fish tacos. Mine were grilled and very tasty! The guys had the shredded beef, chicken and carne asada and really enjoyed theirs as well. Their chips and salsa are a yummy starter to the meal. We'll be back for sure!"}
{"text":"We tried a new restaurant this evening. The food was very good. Service also was excellent.  Jorge and Vinney was our servers. Even thought they had a party of 50 this evening that wait was good."}
{"text":"Local Mexican spot on Sunset.  I just have to start this review by saying the staff had to be the friendliest staff at a restaurant let alone any business I have been to. The customer service was top notch.  We wanted jalapeño margaritas to start and I did not see it on the menu. The bartender actually made some for us.  The menu had a lot of choices and the food was delicious.  They even brought out my boyfriend a free dessert for his birthday.  We will be back."}
{"text":"Great Service and it's always number one for me. Very friendly staff. Food is excellent. Never like mexican rice but theirs is so good. Very flavorful. Good luck"}
{"text":"Great place to have a drink and good tacos and seafood especially the ceviche and guacamole"}
{"text":"Another great lunch with friends this afternoon. But boy, I think they will  soon need to get some extra help. Especially when the warmer weather arrives( like now) and people fill up the patio. The place was jumping and at times service was slow. When we left I said goodbye to the hostess at the front and she kind of blew me off. Not nice.  Too many customers, not enough employees. But the food they serve is  authentic and tastes great. Anybody can have an off day."}
{"text":"This place is awful. My husband and I went here with the kids and the place took forever to refill our drinks as well as we ordered and took so long to get our food and it was cold not great at all. The food was very bland cold and nasty. We barley ate the dinner and just paid and left. Very slow your looking for a good 2 hours there if you go. There are a lot better places to go to. We have been to better places. I would not recommend this place at all."}
{"text":"We chose Chavelos based on positive Yelp reviews, and we were not disappointed!  The service was excellent - everyone was friendly and very attentive.  You could tell the staff was trying hard to make us feel welcome.  The food was delicious, and we will certainly go back.  We didn't take our children, but the place seemed family friendly."}
{"text":"This is a great new restaurant. We've been to several others who've tried to make a go at this location. This one is certainly the most impressive. The service is top notched. It's some of the most friendly and attentive staff we've experienced in the entire valley. They are working really hard to tend to everyone promptly. Three different staff ensured we had everything we could want. The kitchen is putting out delicious and freshly made foods. My shrimp fajitas were tender and packed with flavor. My queso fundido was a perfect blend of deliciousness. My husband had a combo plate which was really fresh and packed with flavors.  Be patient with this new kitchen. The meats were switched to different items in my husband's order. My request for jalepenos in the queso fundido was actually bell pepper. We didn't complain because it was all still really tasty. Overall, we will be back soon."}
{"text":"I think they forgot about us today ... I went in with a party of 9 at Around 2. It was pretty busy around that time.   Getting seated was quick , but we didn't get drinks for about 10 minutes or so . The table next to us (5 table top I think) came in a few minutes before us, got their drinks, while we were chilling with nothing. I did notice a bunch of other tables with menus on their table and drinks being empty. It looked like there was one server ? We ordered our drinks and that took awhile.we had to grab someone and asked if they can take our order . Our food came out really late, a table top of 2 came in and they got their food way before us. I guess it's because they wanted our food to come out together, understandable. Someone at our table asked for another alcoholic drink and that came out late, he basically finished his dish and the second drink came out . No one refilled our tables water/soda.   Everything just took a long time. I was getting full from eating the chips and salsa/beans   The food was delicious! We had enchiladas, tamales, and burritos etc. I hope you guys get more people to help out! Loved the food. The server was nice, but everything was slow .   I know everyone was frantic, my cousin was trying to get someone to take our order and the lady she grabbed looked back at my cousin in disgust, like a \"what do you want !?\" Face . That's unacceptable. I know you're busy, I've been there, but never show your pissed off face to anyone. That's something that we will remember forever."}
{"text":"Thought today was a good a day as any to try out this new restaurant that we keep seeing in route to just about anywhere here in Vegas. The place was already packed for today was Cinco de Mayo. We waited but one minute before we are seated at a booth. The full bar on the way in had drink specials, like tequila shots for $5. Tempting but we passed. We had our drink order quickly taken and then were presented with tri-colored tortilla chips, creamy refried beans and a mellow red sauce. We then decided on beef fajitas for two. We were pleasantly surprised as it came out sizzling and accompanied with flour & corn tortillas (our choice) and we each had plate of with refried beans, Spanish rice, sour cream and guacamole. The meat was so tender! We put a good dent in our meal and were waiting for the check when we were surprised with a plate of 2 deep fried tortillas triangles drizzled with chocolate and caramel and a dollop of whipped cream. I thought \"no, I can eat another bite\" but I did and I loved it! The staff was very attentive, our waiter was charming and we left with a smile on our faces! We will be back!"}
{"text":"This place would have received 5 stars if the bartender would have mentioned an item was missing from my drink because they had ran out. I was looking for a particular type of margarita that unusually order from Cabo Wabi, and came across this place that had it. Super excited we head to this place and show bartender the drink and he proceeded to make it. Let's just say that when I got it, it didnt have the tamarind that I really wanted and it didn't have the garnish as other pics of that drink posted on Yelp, totally disappointed but what was worse was that the drink looked nothing like what I had showed him. At least he did offer me another drink and took the offer but it was just not what I wanted. I didn't try the food so I can't vouch for that but the beans and salsa where good."}
{"text":"We decided to stop by as we drive past this all the time and live around the corner. We arrived around 7pm on a Tuesday and the place was empty. We ordered 2 margaritas, and my boyfriend got the 3 entree deal with a beef tamale, chicken enchilada, and Chile rellano. It was a lot of food for only $13.95! I had a bowl of posolex which was very tasty. The margaritas seemed a tad expensive at $10, but they were tasty and large once they arrived. The chips weren't anything to write home about, but they served their purpose! Honestly, what stood out the most was the staff. It seemed like every person in the restaurant was stopping to see how things were going, bartender, server, busser... that was refreshing! They also brought us a free dessert, I think they were buñuelos, but they were so good and the perfect ending to our meal!"}
{"text":"Ok, I've never been here, so I won't do the the disservice of giving anything less than 5 stars. I only have ONE question: WHY DO YOU CLOSE SO EARLY??? How many times have my wife and I wanted to come and enjoy some nachos and margaritas on the patio, but that's normally at night, and you close at 9:00! Why even have lights around the patio?  REALLY wish I could try and have a favorite neighborhood Mex restaurant, but the hours don't work with our schedules."}
{"text":"Super fresh guacamole, stopped before our flight, glad we did!  Great atmosphere and free soup"}
{"text":"Great authentic food! The portion sizes are pretty big too! We went for Mother's Day and had great service, we'll definitely be back!"}
{"text":"Outstanding food !!!! Finally real Mexican sausage , cheese and everything is home made. Very clean restaurant and I will only come here just like home in Chicago"}
{"text":"Wow! I just ate at this Mexican place and it was delicious. The food was very fresh and made with quality ingredients. The chef has really perfected his food. They have a very large menu with tons of things to choose from. The chile relleno was outstanding and the rice and beans were amazing. The soup was also very good. Chips were crispy and not at all greasy. The staff is very nice and friendly. If you want outstanding Mexican food, eat here! It is the best I have had in the Las Vegas area."}
{"text":"Growing up eating authentic Mexican food, I was pleasantly surprised to get introduced to this new restaurant. Lou at the bar made amazing margaritas and his service was top notch!"}
{"text":"Bland, overcooked fajitas. Salsa and bean dip had the flavor of notebook paper. Soda and Service was good though."}
{"text":"Checked out this new restaurant. Food was delicious & my server/bartender Lou was awesome & knowledgeable. Awesome hospitality. Will be back, thank you !"}
{"text":"Food was tasty,service friendly, it wasn't busy despite been a Saturday evening, they have tables outside so you can enjoy weather when possible, I had steak tacos (yummy), most likely I'll be back"}
{"text":"Everything was great! I was in the mood for fajitas and they did not disappoint. The food was fresh and fast. We will definitely be back."}
{"text":"We usually go to another Mexican restaurant in town but it is always crowded so we've been on a lookout for a new favorite place. I'm so happy Chavelos came along! Customer services was fantastic! So friendly and polite. My husband got a chimichanga and I got a taco salad. Both were delicious. We loved the chips and salsa and the soup, too. My husband got a margarita and said it was the best he has had. We are so happy there is a (good) Mexican restaurant close to us and we will definitely be regulars!"}
{"text":"Just went here for the first time.  Nice place; nice atmosphere; music not too loud.  Food was good and the staff super-friendly and efficient."}
{"text":"Passed by a few times and figured we would stop in since we are always looking for a good Mexican place. Went for lunch and got seated immediately in a fairly empty dining room (we arrived at 11am so a bit before regular lunch rush). Service was quick and friendly, got our drinks right away and browsed the menu. My wife went with the shrimp chimichangas and I had the chili verde. Both dishes were good but I preferred my wife's choice over mine. The chili verde is a bit more traditional then I am used to but was cooked well and had a good flavor.  Pricing - very reasonable, dishes ranging from $9 - $25 depending on what you are in he mood for. We had our food, a couple cocktails and everything was about $50 with tip.  Everything about our experience deserved the 5 stars. Manager came by and chatted and offered us some complimentary cinnamon chips for desert. The only thing I would say is that the restaurant is a bit small and I could see it easily filling up on a busy night which could cause some delays."}
{"text":"With so many Mexican restaurants in this town there are better than this place. I miss Jalisco that used to be down the street on Sunset and Pecos. Casa Don Juan is way over priced and just want to rush you in and out."}
{"text":"Excellent Mexican restaurant.  Great food and great drinks.  The bartender (Louis) really is a Happy person.  We enjoyed it.  The wife had street tacos.  I loved my vampiros.  Fun place!"}
{"text":"On vacation, we were headed to the Green Valley and felt like Mexican. While driving we came eacross Chavelo's and checked the review. Only 40, but all good, looks like a new place. We had the BEST lunch. Our waiter Tony was attentive and knowledgable with suggestions. The chips and salsa were great. My husband had an enchilada that tasted great. I had the chili verde which was amazing. We are just glad we have 4 more days so that we can return for another visit to Chavelo's, a great find!!!"}
{"text":"This place is the Mexican bomb!!!! I had the Enchiladas Suizas by recommendation and it was so tasty!! It hit the spot just as the waiter said it was, \"the best!\"  Their service was excellent as well! I showed up 5 minutes before closing and they made me hot chips and fresh salsa!! So good, so delicious and super service!!! Muy bien mi amigos!"}
{"text":"Amazing service along with amazing food!  We will definitely be regulars here. Food was fresh.  Try their Michelada's, you can't go wrong.  Friendliest staff in town!"}
{"text":"Not a fan. First time visiting and when I first walked in, it had a strange smell. Not like a food smell, like a dirty chemical smell. I finally became acclimated to the smell about 20 minutes in.  Service was fine, food was so-so. Prices were average but I'd rather have a better experience elsewhere."}
{"text":"The Cheese crips is delish! The soup is yummy! Fajitas is relish too... thumbs up for this restaurant!!"}
{"text":"This is my new favorite Mexican restaurant in Henderson. Chips and salsa were great. Generous portions of fresh and perfectly cooked food. Staff was very friendly and attentive. We will be back!"}
{"text":"This is a really good Mexican American place , food was great, all the food came out perfect. Just not authentic. We will be coming back again'"}
{"text":"This place was great! We always go have Mexican food and wanted to try someplace new. The service was amazing and the place looked very clean. From beginning to end we have no complaints and the food was exceptional. The portions were just right and our server ensured we got our refills and food promptly. Would definitely recommend this place to anyone."}
{"text":"Found this great local Mexican restaurant  Super fun  Clean  Great music and atmosphere  Friendly staff And food was incredible and of course we couldn't finish the portions were so big  Enjoy"}
{"text":"This was an awesome place - the food was delicious starting with the bean dip and chips, the staff was incredibly friendly and this will be a definite regular hangout."}
{"text":"Great place to relax and enjoy a wonderful dinner. Try the Chili Verde or Chili Colorado!"}
{"text":"Great authentic restaurant!  We recently moved to Henderson from Tucson and are very picky about the Mexican food here! Heard about this place from some neighbors and went there tonight. It was fantastic! The food was as good, if not better, than any of our hometown favorites. I had a shredded beef taco that was loaded with meat, cheese, lettuce, etc. Perfectly fried taco shell. And I had a cheese enchilada that was perfect. There were 4 of us and everyone was thrilled with the food. We also ordered a cheese crisp appetizer (we had way too much food) and it was loaded with beans, meat & cheese. Cheese crisps are at all the Mexican restaurants in Tucson but had not found them on a single menu yet here until now. Service was also phenomenal. Very attentive and caring. So glad we found this place and it's so close to where we live. Prices are reasonable We will be back!"}
{"text":"Excellent food with excellent customer service. Raul, the manager, is very friendly and professional. This was our first time dining here. My dish, camarones a la diabla was perfect. My husband's dish, combination plate with beef burrito and chile relleno was also on point. We will definitely come back. Try this restaurant and you will not be disappointed, we guaranteed it."}
{"text":"Great Experience! Came in with a softball team. We had 18 people, they got us a table right away. The staff was awesome! Super Friendly and helpful. The food was amazing as well! Thank you!"}
{"text":"I don't think the chips were homemade ~ generic. The bean dip and salsa were good. The steak was disappointing ~ like a flank steak and a little tough. There was such a small amount of guacamole on my plate I didn't get a real good taste of it. The wait staff was very attentive."}
{"text":"I really, really wanted to like this place, as it is under new ownership from the last time I visited this location and is close to my house.  The positives:  everyone was friendly and took no issue with this solo diner occupying a booth. (I was early in the dinner hour, so I knew I would be gone by the time they got busy.)  The classic margarita was decent, but not memorable. The prices are reasonable.  Chips and salsa and bean dip were all fine, and provided in ample portions.  I ordered the chile relleno plate with rice and beans, which comes with a tomato based soup of some type.  The soup was hot but on the lighter side in terms of flavor. The chile relleno was okay.  Not greasy, which was a plus, but was skimpy on the cheese.  The rice and beans had clearly been microwaved - the beans were almost caramelized. The rice was all right.  But in a town this competitive in the Mexican food arena, they will need to step it up with their flavor profiles and reduce their use of microwaved food if they are to survive."}
{"text":"Excellent service! We were greeted right away and seated promptly. We received some grilled jalapeños and onions as an appetizer on the house. The fideo soup was delicious. My son had the ceviche, my husband enjoyed the combo plate and I had the vampiros. All delicious. We will definitely be back again. Cozy mom and pop restaurant!!"}
