{"text":"Great local place for burgers, wings, etc.  Friendly, family atmosphere, great staff.

Also do takeout :)"}
{"text":"Came in for burger and I was not disappointed. Had the JP Burger and my taste buds are ringing. Partnered with a cold beer on tap. Man... it's a good Wednesday."}
{"text":"Had the burger.  It was very good like the other reviews.  I would have given it 5 stars but it only serves 1 size.  Service and cleanliness was 5 stars.  Will try other menu items next time I'm in Bolton."}
{"text":"If you live in Bolton, are visiting Bolton, or just passing through on your way to somewhere else and you're thinking of how much you'd love a burger, you have to stop at Cheeks! Simple, homemade, delicious! 

The wings are also tasty and an amazing deal on wing night. 

The fries are the perfect combo of crisp and salty. 

There are other items on the menu and daily specials, but we return again and again for the burgers and fries. Oh, and how could I forget about the milkshakes!"}
{"text":"Great burger and fries, always enjoy their wings, generous portions, reasonably priced and have always had great, friendly service! I even order to-go sometimes. Delicious!"}
{"text":"Another classic in Bolton, and perhaps the last of the original Courtyards establishments still running?  Cheeks is burgers, it's what they do best.  Although the menu is full of everything from sandwiches to pastas and meats, it's the burger you want when you come here.  Hand made and high quality they've been doing it the same way since I was a kid.  Bruno and the team are personable and make you feel welcome, and extra credit from me for having the Wellington on tap."}
{"text":"TL;DR - one of the best burgers I have ever had. The burgers taste so fresh - the have a char on the burger that amplifies the taste. You definitely don't feel tired or gross after eating the burgers here. They use high quality ingredients that they get at a local grocery store - local businesses helping other local businesses. I would go here over any large chain any day!"}
{"text":"Upon entering this restaurant, you might think it's a little old looking.. But fret not!

The food is fantastic, with excellent portions and even more excellent prices. The staff are friendly, helpful and are always happy to have you there. 

I highly recommend this spot and have been here several times with no complaints!"}
{"text":"My boyfriend and I just came here for the first time the other day based on online reviews. We were not disappointed!

There were just a few other groups in the restaurant, which is probably typical for a Monday night. Our server was one of the owners (we didn't catch his name), but he was very pleasant, attentive, and welcoming. A really nice guy.

I ordered the veggie burger and salad, and my boyfriend got the Texas burger and a salad. Prices are fair for the amount of food you get. Quality was great! Nothing extraordinary, but I can definitely see how this small restaurant has survived 25 years!

There are other things on the menu aside from burgers. They have sandwiches, pasta, soup, root beer floats, milkshakes, and that night their special was a chicken parmesan. 

Our food came out surprisingly quickly (\"just enough time to cook the burger\", as the server said).

Nothing to complain about!"}
{"text":"I worked in Bolton.  This review is rated relative to other places in Bolton.  It's not intended to compare it with the big city.

Speed Read.
1) Best Fries, always fresh made, taste great with gravy
2) Best Burger in town.  Look for their specialty burger.
3) Hit and miss some time.  I wish their quality is more stable.
4) My friend love their grill chicken sandwich (i never tried it)
5) Patio in the summer

5 Stars as as I think it's one of the best place to have lunch in Bolton.
On a good day, the burger is very juicy, and complement well with the rest of the condiment.
We also like the chili oil
I recommend the specialty burger when they are available on the menu.  The specialty change all the time.

The fries and gravy on the side is the best in town.  I choose fries over salad any days here.

In the summer time, they have a patio that is far away from the road (a rarity in Bolton).  We can enjoy the sun, but away from all the noise and dirt from the road.  Nice way to enjoy a pint during lunch time and relax on a Friday."}
{"text":"I like the burger, restaurant and  staff. I would defiantly go back if I go to Bolton Hills again. Home made burger was truly delicious and fries was amazing. The only reason I gave them 4 is that There were not enough light in the restaurant, however I must admit the food was 5 stars."}
{"text":"DELICIOUSLY Authentic homemade burgers and fries! A must when passing through Bolton. We will be back!"}
{"text":"Cheeks..... Interesting place. 

So this is actually the longest standing resto in Bolton. 29 years in business. 
Its not fancy... Its not updated... But is such a cozy little spot. 

Casual little bar area to grab a beer accompanied by an area that seats between 30-50 or so. 
They also have an outdoor patio.  

I had the burger and fries. Its a very very old school burger made on a grill (Not flat top). This is not a pretentious fancy burger place.  Old school. Period. 
A long time customer had a long chat with me. Nice crowd in there. So friendly. Owner is a friendly guy too. Shook my hand and welcomed me to bolton. Gave me advice on the area. 

This will probably be my go to \"quick beer\" spot, and maybe a little snack with the wife. 

I havent tried enough of the food to give a five star review but I will next time I go!"}
{"text":"Great Burgers! Best in the area hands down! I think the owner was servicing us and felt us feel very welcomed! 
Will definitely visit again when in the area!"}
{"text":"Nice daily menu! I have a wonderful Canadian hamburger !!! Waitress' Attention was so helpful and nice!!  Anytime I will come back again!"}
{"text":"Love this place & service is awesome! Their menus is basic bar food, but worth every bite! Small family friendly environment!"}
{"text":"A must try when you're in Bolton. I've been coming to this restaurant since I was days old with my parents. The owners are FANTASTIC - Bruno, Louis, and Rob, you guys rock. Food has been consistent for 25 years and AMAZING. Every soup I've had was to die for, burgers are delicious, pastas and salads are great too. You won't be disappointed."}
