{"text":"I give it a 4, but BF gives it a 3. So about 3.5.  Came here yesterday just after 11am when they open. The menu was extensive in that there were so many different possibilities of combination. I found myself staring at it for quite a while as I'm quite an indecisive person. I liked that the menu you order from was laminated, therefore reusable. Its a good idea, but I wish those dry markers came with a eraser brush on top, as BF had to use his napkin with some water when he wanted to change his mind after marking it.          We both created our own noodle bowl. BF got the Coriander & Preserved Egg Fish Soup with Yellow Thick Noodle, and Japanese Style Chashu & Sliced Lamb as topping. ($9.50) The Fish Soup comes with bean curd roll, prince mushroom, and nappa cabbage. The sliced lamb was thin and the kind you buy for hot pot. The fish soup was good, it had a strong fish flavour, but was not fishy tasting (if that makes sense haha). BF originally marked udon as his noddle choice. We sat for over 15 mins before someone came out to let us know they were out of udon. So BF changed to yellow thick noodles, then the noodle came out less than 2 mins later. I guess they don't know what ingredients they have on hand until they are making it...      I ordered the Shio Hokkaido Hi White Pork Bone Ramen (Sea Salt Original), and Japanese Style Chashu & Tender Beef Tendon as topping ($10.50). The Pork Bone Ramen comes with Egg, Corn w/ Butter Sauce, and Agaric. My noodle came out a good 10 mins after BF's and he was half done by the time I started eating. The soup was good, flavourful but not overly salty. I got 2 big pieces of chashu, I didn't like their style of chashu, which is with a pork belly cut. They roasted it well and it wasn't dry, but the fat to meat ratio was overwhelming for me and I felt like I was eating mostly fat. Some people might like this, but not me. They give you a lot of tendon as well, I'm sure I ate over 6 pieces of it.   Both noodles came with drinks. I opted to pay the extra $2.50 to upgrade my drink to a Regular sized Presotea Royal Earl Grey Milk Tea Family Drink, while the BF stuck with the Hot Milk Tea. The Hot Milk Tea was not that good, it tasted like they used regular Lipton tea and added condensed milk to it. The regular Prestoea drink is equivalent to the size of a large Chatime drink, so $2.50 is definitely worth it.  Service was average, slightly slow when the place got packed during lunch. The portion sizes were ok. Noodle portion was about the same as Deer Garden, but Deer Garden gives you more soup. The included toppings like cabbage is a lot less than Deer Garden, but I think Chef Papa gives you more of the actually toppings you choose. Overall I liked my food, but I might have made some bad choices in the combination choice of my noodle. The rich soup, the fatty chashu, and the gelatinous tendon, made me feel very heavy after only half a bowl, and I struggled to finish the rest.   BF thought the food was ok, but found all the add-ons and different pricing too confusing and he prefers Deer Garden over Chef Papa in that area. For example, choosing ramen as your noodle is an extra $0.75, unless you are getting the pork bone soup base ramen in which case the $10.50 for the pork bone soup ramen already comes with the ramen so you don't have to pay an extra $0.75.   Anyways I'll be back, especially if I'm feeling like both noodles and bubble tea. Free wifi too, Score!"}
{"text":"We came here not expecting much given some of the negative reviews. We were pleasantly surprised. The chasui ramen and fish soup were very good. We'll be back soon."}
{"text":"3.5 stars  Chef Papa is a noodle restaurant where you can customize your meal by choosing a soup base, type of noodle, two toppings, a drink and a snack (for an additional charge).   The Singapore laksa soup base was creamy and flavourful, but didn't taste overly salty at the same time. Pairing this with the white fish balls and tofu puffs was perfect!   Szechuan dan dan sesame ramen was just as delicious but the sesame taste could have been stronger.   Took off 0.5 stars for the $1.00 surcharge for the Chef Papa cold milk tea and for not having a hot option. Milk tea was good but I felt like I was forced to pay an extra $1 because they didn't even have a hot option for me to choose from.  Would come back to try other soup bases!"}
{"text":"I want to boost their ratings so I'll give them 4 for food and 3 stars for customer service. They need more servers though. it's an Asian place so don't expect 5 star service. The menu was really confusing at first. Too much wording and too many choices. Especially since they also give you another menu to look at but they say it's the same thing with pictures. Confused yet? The food comes fairly quickly and tastes really good.  Broth and noodles are cooked well. You get a special drink with your meal- great deal!  I do recommend this place to noodle and ramen lovers. One of the best in Markham and price isn't so bad either.  We've been here 2-3 times and haven't been disappointed with their food. Yum! I look forward to coming here again!"}
{"text":"Recently saw this open up at Peach Tree plaza so I thought I would give it a try. It used to be a congee restaurant but now it's a noodle+presotea mix of a restaurant. The restaurant is completely renovated so it looks completely different. It's really modern and a really nice place to just sit with your friends and have a chat while having a meal, or maybe just a drink.  The menu is small and simple. You build your own noodles, pick your own base and choose 2 toppings. Your order comes with a drink and if you would like to upgrade to a bubble tea it would cost an extra $2.50 (at least mine was). There are also other side dishes.and a small choice of other foods. The food was average, no a big portion for the price it was listed at but it wasn't something I wouldn't eat again. Presotea has many locations outside of this restaurant so perhaps you may have tried it at another location."}
{"text":"This is the new ramen place that got my ramen-lover friend visiting it many times a week! I think he just loves making as many different types of noodle bowls as he can! This restaurant lets you customize your bowl of noodles by choosing the broth, noodles, toppings and extras. They have a wide selection of broth including Singapore Laksa! The customized order is a combo that comes with a drink. For $2.50 more, you can choose from a limited range of Presotea drinks. The drinks can be customized too - no milk, less sugar, less ice etc!  If you're not in the mood for making decisions, opt for one of the Chef's Recommendations. There's rice and noodle dishes. We had the Hokkaido Chasu Ramen, Vietnamese Lemongrass Chicken Steak Rice and Royal Earl Grey tea with tapioca, jelly and no milk. The ramen was quite good with springy noodles, an egg and 3 pieces of Chasu that's not too dry. The best part was the egg - it was a marinated egg and had a creamy yolk, yum! The Lemongrass chicken wasn't that tasty. If you really want to Vietnamese lemongrass pork or chicken, it's better to go to a pho shop. The Earl Grey was bitter from over-steeping or too much tea leaves. Ten Ren makes a good Earl Grey bubble tea with no milk so I know it's possible!   Finally, the washroom. What a big change from the former Congee Wong washroom! I wasn't sure what I would find and was relieved to find it new and clean :)   P.S. They do not accept credit cards."}
{"text":"The noodle and everything was kinda alright including the food, service and atmosphere.  We ordered fish noodles with different toppings and I would rate it below that of Deer Gardens which seem to be tastier. Also ordered extra noodles and you can barely tell if you got extra. One last thing is that the XO sauce that makes Deer Garden stand out is a bit bland here.  The location is great though which is why this place is packed"}
{"text":"I went here yesterday, it was my first experience and I enjoyed it quite a bit. It's a great place to get that ramen/noodle & bubble tea fix together. The concept is not new but I did enjoy building my own noodle bowl.  I got the Thai Tom Yum w/ Coconut soup with Japanese ramen noodles and you get to choose two toppings. I got the beef brisket and Japanese style chashu (pork belly). My boyfriend ordered the Singapore Laksa base with udon noodles and topped with chashu and jumbo wanton (additional $1)    I really liked the Tom Yum base it was delicious and thicker than the laksa base due to the coconut. It was savory while the laksa was more soup like and spicier.   If you order noodles you get bubble tea for a cheaper price than on its own. I really enjoyed the matcha with tapioca and red bean. Overall, the service was fast and great, the noodles were tasty and the bubble tea was average. I would definitely come back here again"}
{"text":"This is the second time that they have messed up my order. The first time, they gave me the wrong noodle, and messed up toppings. There is an option for choosing which toppings you want. For example, I wanted cilantro and green onion but not sesame and garlic. They forgot about my cilantro and onion but gave the me the sesame and garlic instead. This time they once again messed up my toppings, forgot my lemon water, and forgot my side order of chicken. I plan on never coming here again."}
{"text":"Got ramen here today for the first time. Soup was very bland in my opinion and noodle were definitely overcooked. The meat was tasty tho and bubble tea is a good bonus. Would not come again though."}
{"text":"Facility: Coming southbound on Kennedy, make the right into the plaza the driveway before the lights. It will be on your immediate right. Chef Papa's is a clean a spacious establishment, lots of natural light and clean.   Food Quality & Price: Depending on which soup base you get, the cost will vary. You're looking at spending around $10 a bowl. The usual option people go for is the combo.  Pick your soup base. Pick your noodle. Pick 2 toppings. Side dishes optional at extra costs. Pick a drink (included but you can upgrade to BBT for an additional cost)  What we ordered: 1) Fish soup base with preserved egg, prince mushroom, bok choy, and cilantro + yellow noodles + sliced lamb and deep fried fish cake. Absolutely delicious and a great change from ramen and pho. I loved the soup base and there were plenty of ingredients. They were no stingy and the variety was the highlight of the bowl. The portion of noodles were huge though. I was unable to finish.  Drink: Royal Earl Grey Jelly Family - was fine. Tasted like cold regular \"earl grey\" with milk and sugar and some assorted jelly at the bottom. Will probably order something else next time.  2) Shoyu (soy sauce) soup base with corn, soft-boiled egg, and black fungus + Japanese ramen noodle (extra charge) + chashu and deep fried fish cake. It was okay, egg was too soft and runny, falling apart which was probably the worst part. Soup was okay (we were unable to tell or confirm if MSG was present, but soup was fine). The japanese noodles were the highlight of this dish - well executed. Portion size was perfect. But on the grand scheme of things, doesn't hold a candle to any of the ramen masters (Kinton, Jyuban etc).  Drink: Water with lemon. Exactly what you'd expect. Small cup of warm water with a slice of lemon.  Service: Passable. The waiter did his and her jobs. When we asked a question about a specific type of noodle depicted on the menu, the waiter seemed unsure. Staff should know their noodles working at a noodle house. Seems like a no-brainer to me.  Overall: The attraction of Chef Papa's is the incredible variety on the menu and in your bowl. They don't do any dish AMAZINGLY well, but they do variety really well. Chef Papa is a Jack of all noodles soups but master of none. It's a great place to go when you can't agree on what to eat, or if you want something other than ramen or pho. While ramen and pho ARE offered, there is also Singaporean laksa, Tom Yum, Chinese style noodle soups, and rice dishes available. Working in partnership with Preso tea, they have a decent BBT menu to add together as a food combo with the soups.  Don't know what to order? - order from the \"chef recommended\" section y - flip through photos on Yelp and see if something looks good.  Will definitely return in the future and looking forward to seeing the staff brush up on their customer service skills!"}
{"text":"Came to Chef Papa for lunch in early August when this restaurant was newly opened for a couple of weeks.  I ordered the Coriander & Preserved Egg Fish Soup with Japanese Style Ramen and the Hokkaido Pork Bone Ramen.  Both the soups and noodles are very tasty with generous amount of ingredients.  The menu style was very similar to Deer Garden and I was having a hard time to decide what to order.  I like the option for upgrading standard drink to Presto tea.  Definitely there are rooms to improve on services but will sure come back for more."}
{"text":"Overview: An enjoyable noodle place with (too) many options.  My wife and I have been here a couple of times. I love Ramen and my wife loves all noodles except Ramen so we decided to try this place because it allows both of us to have our pick. The first visit the menu was confusing because you have to your soup base, noodle, toppings, side dishes and drink. There are also items you can order off the menu so it can seem overwhelming. I had the ramen combo which is very tasty when compared to other ramen places in Markham. My wife had vermicelli in soup with fried pork cutlet which is also good. The food here is flavourful and bb tea is really good too. The only complains that we have is that the place is very crowded during the weekend and the seating area is tight. The servers are nice in general but they are very busy so may not be attentive. We do plan on returning as we still have many other types of noodles to try!"}
{"text":"Awful, soft boiled egg became salty hard boiled egg, Japanese style cha chu became Chinese style pork belly, bubble tea already asked for light sugar but still very sweet, pork bone soup very salty, highly \"Not\" recommend, and pricey too."}
{"text":"Fair warning, this could turn a little rant-ish when I whip out my soapbox and hop on ;)  To start with, the food was merely OK.  I ordered the ramen with shio pork bone broth.  The noodles had a nice chew to them.  The egg was properly \"half-boiled\", as promised.  I added cha shu and beef brisket as my toppings, which were both sub-par.  The brisket was near flavourless, and the cha shu was over-charred and slightly tougher, almost a bit dried out.  Tough trick to pull (in a bad way) with something like pork belly!  The broth was a bit underseasoned to my taste, but maybe it's just me - I'm used to some saltier broths.    I also ordered some honey garlic chicken wings (good), and gyoza (again, lacking in flavour, even with the dipping sauce).  Like the various components of the noodle bowl, the snacks were hit and miss.  One thing I will say is that this place has a lot of different options and combinations.  The menu is customizable in that you pick each element of your bowl - the type of broth, noodle, toppings, etc.  The menu can be unwieldy for a first timer, but customization is a plus for the consumer.  Some noodles already come pre-packed with certain toppings.  I wish they'd make it clearer on the menu so you don't choose a topping that already comes with the bowl!  My biggest gripe is with the service.  To set the scene, I was here with five friends.  Two of them had yet to arrive, so I was sitting there with three others and menus scattered on the table before us.  The waitress brought us a couple of small dishes of sliced red sausage which we nibbled on while waiting and deciding on the menu.    Later on, partway through dinner, a different waiter comes to the table to tell us that they had made a mistake - that sausage was for a different table.  OK, mistakes happen.  Then, the bombshell: they're going to add it to our bill because we ate it.  At the time, I hadn't though anything of it.  Western restaurants have bread service.  Korean restaurants have a smorgasbord of little snacks.  Not to mention that our table was littered with menus at the time, so we clearly had not ordered anything.  And now they're going to charge us for their mistake?    Obviously, we did not agree, but they would not be convinced otherwise despite our protests.  Put some random snack in front of the customer that they did not order, and if they take the bait, charge them.  \"Interesting business practice\", as my friend commented.  The amount charged was a very small, immaterial amount.  But you should not treat customers this way.  I hope those extra dimes you profited were worth the six of us never coming back.  All right, time to step off the soapbox.  Three stars for the food, minus one for the service."}
{"text":"Mmmmm.   Came here for dinner last night and ordered the hokkaido chashu ramen. This place is similar to deer garden, where you get to choose your broth, noodle, and toppings. I wasnt in the mood to pick and choose, plus I was starving, so I just went for the chefs recommendation.   The chashu was really tender and tasty. The broth was milky and delicious and the ramen texture was just perfect. I ordered the 5 spice wings on the side as well and they were quite yummy as well. The meal comes with a drink or you can upgrade it to a presotea for 2.50. The drink was alright, and didn't come until we were finished our noodles and I had to flag a waitress down to check on our bubble tea order.   I enjoyed the fact that the order menus were reusable. Laminated menus and you can order with dry erase markers. Yay for saving the earth one step at a time. Haha."}
{"text":"I love this place! Lots of selection for soup, noodles, and the toppings! The portions are huge!  Always very busy for lunch and dinner.   Basically, you pick the soup base, the noodles, 2 toppings, and 1 hot drink (ex. coffee, tea, ovaltine) are included in the soup price. You can sub. the hot drink for bubble tea for an additional $2. Not a huge selection for the bubble tea.   The staff aren't very friendly, but the service is always very fast."}
{"text":"It's a busy plaza during the weekend. I like to come here because of the variety of noodles they have. My dad hates ramen but I love it and he prefers like Chinese noodles ? Lol so here we both get what we want !   I always get the Japanese ramen. It's okay I mean not as good as sensotei or kinton ramen. The spring eggs are tasty here and the roasted cha Sui is good. The portions are decent in size and you can also add some snacks for $1.99-$3. The ramen broth is a little watery this time I went.   They also serve presto bubble tea here. You add $2.50 to the combo price and you can upgrade it from a free drink. $1 for cold drinks. So it's about $15-$18 per person with upgrades and snacks, which is okay. With no extras you can get it for $9.99"}
{"text":"A place where you can make build your own noodle bowl is a nice concept. You get to choose your own soup base then noodles (Japanese ramen is I think 75 cents more) and finally 2 free toppings. I chose the char Sui and beef tendon and found that was enough. If you aren't full you have the option of choosing additional snacks for a couple of bucks. Bubble tea can also be included for an extra $2 and a bit which I found was well worth it. Nice place, would come again"}
{"text":"More like 3.75*.  Ramen was so - so,  nothing special.   You customize soup base, type of noodle and 2 topping.   Add $2 for bubble tea.   Not usually a big fan of bubble tea,  but this place is VERY good.   They actually used real passion fruit and I like that you can specify that you want less sugar.   Service was excellent as the waitress was very patient in explaining the menu and their ordering system."}
{"text":"Probably my personal favourite restaurant in the area.  I come here at least once a month, and usually order the Pork Bone Soup w/ Red Miso ramen. I absolutely love their Taiwanese Fried Chicken Nuggets, and the fact that they have Presotea! All time favourite bubble tea: Royal Earl Gray Milk Tea Family.  Can be very crowded at times, such as weekend lunch. Seats are usually immediately available at other times.  Service is alright, noodles usually do not take too long. The chicken nuggets come pretty quick and keep us happy while we wait. Waitstaff can be a tad bit rude at times, but it usually does not affect the experience.   Overall, amazing place!"}
{"text":"Food taste ok. But they served food in a very strange order. We ordered a kid's meal, dessert (jello cup) came before everything else, then the drink came, which is just a Minute Maid juice box. The rice came last.  The servers were all rude. It was our first time there and wasn't sure how to order. When the server came and looked at our order sheet, she noticed that we didn't pick the drink that came free with the meal. She said \"you are not ready\" in a very cold tone, then she gave us instruction on how to pick the drink. But she spoke so fast and unclear that we couldn't hear a single word. And then she said \"I will come back when you guys are ready\", and then walked away. kids said we picked a wrong place and they don't want to come back again."}
{"text":"This restaurant isn't very trust worthy. I went here once and suffered from food poisoning. Their food will seem to taste decent, but after you may also suffer from food poisoning. I recommend you go across the plaza to big beef bowl if you would like to eat in this plaza. Please do not risk it!!!"}
{"text":"Yet another choose your own noodle/soup/topping place - this time made much better because it serves Prestotea. In terms of options, there are quite a few variety of soup and noodle both, offering non-traditional noodle options like pho noodles.  The noodles do not, by default, come with cabbage or other veggies, so I end up having to include some kind of veggies in my 2 topping options.  Do not order wontons as your topping - ordered it one time and it was not fully cooked.  Otherwise, order away!    For those who prefer not having to fill out an entire form to order your noodles, there are preset rice or noodle options too."}
{"text":"Very similar to deer garden (pick and choose 1. Soup base 2. Type of noodles 3. Toppings 4. Snacks 5. Drinks  First time here, so glad we made a reservation! When we arrived the front door was packed! Came at 6:50pm for my reservation for 8 for 7pm and they seated me quickly at our reserved table.  I opted for their laksa udon with pork intestines and beef tendon. It was $8.99 included a drink like a hot milk tea, I opted to add $2.5 extra to make it into a presotea bubble tea. Got the matcha with white pearls.   The food arrived quite fast, they arrived at different times whenever it was ready (unlike western restaurant where all entrees would arrive together).  Luckily some of us had snacks and it was with family so I dug in first.  The laksa was so red, it stained my white pants since I am a messy eater! Lol  It was VERY flavourful, so much that I think it was too rich for me. It was so filling. I was forcing myself to finish. Also I think it was extra filling because of my drink, it's quite big and filling with the pearls! Luckily the drink they give you in a takeout up so you do not have to finish if you didn't have to. The pork intestines was yummy! Not a lot of places have this, and i like how you get to pick and choose your toppings.   My hubby had a curry pork cutlet don, he said it was good and it sure was filling for him! I believe it was around $10.95."}
{"text":"Every time I come here I always get the laksa soup base with lamb and fish ball, love it! Also a bonus when am craving for bbt, I can just order from here with an extra $2.50 for a large size presto bubble tea."}
{"text":"The four of us came by Saturday night and boy was it packed. We waited 15-20 minutes for a table but I honestly didn't really mind it despite the space being cramped.  We ordered two Laksa and two other noodles with a side of chicken wings and popcorn chicken. The noodles were all delicious and great that everything is customizable especially for me since I am crazy picky. The sides were... meh. If you add $2.50 (I think) you can get a bubble tea from Presto.  Price point is decent - you get what you pay for. Staff is quick although not the friendliest but it's understandable considering the amount of traffic they receive. Oh! If you like Presto tea on Facebook, you get this cool swivel key ring thing that you can stick on your phone."}
{"text":"Overall, it is a good restaurant with great food and excellent service. The ramen broth was amazing and you can customize your order by adding different items. Wife ordered the Pho Beef Soup but this fell short compared to the Ramen. Price is average and fair. But I am still on the quest to find the ultimate ramen spot."}
{"text":"I like it better than deer cuisine as there are more options and presto tea ! I'll stop here as I'm getting sleepy. But overall great service and food. Will definitely come back!"}
{"text":"Being a fan of affordable noodle soup, this place is a little more reasonable than Deer Garden now. Although I miss their milk tea.... The selection of Presto tea at Chef Papa is nice. Soup noodles isn't as heavy and side dishes are good too. Selection of different types soup noodles along with rice dishes are pretty impressive. I do recommend trying it"}
{"text":"I had a really nice lunch here with my parents. We ordered from their lunch menu, which had a variety of things (noodles, rice dishes), and they all came with your choice of a Presotea drink! There are a few different drinks to choose from as well. I got the chicken cutlet with curry, with a roasted oolong milk tea. The food was tasty and the portion size was reasonable. The drink was delicious, as Presotea makes fairly good bubbletea.   It was a really good deal, as the meal was $11 and it came with the drink, which is usually around $5 at Presotea. I would definitely come back here again and order from their lunch special menu. The service was quick and they give you the drink in a takeaway cup so you can take it with you after lunch as well. It was also the large sized drink, not a small one, which made it that much better."}
{"text":"Came here on a Tuesday night. We originally wanted to eat at Big Beef Noodle at the plaza next door but they were closed so came here. I like how you get to choose your own noodles and ingredients to add in, however in this occurrence, they ran out of udon noodles so I opted for the pho noodles instead. It was an interesting tasting bowl of noodles. My partner enjoyed their katsu."}
{"text":"I went here with my family today. Its a similar concept with Deer Garden but the food quality is not comparable to Deer Garden. I think the food is overpriced as well. We ordered a katsu don, a laksa ramen, a coriander & preserved egg fish soup ramen, and an original fish soup rice vermicelli. The laksa soup base was really salty. As for the katsu don, it tasted good but I guess they use a lot of MSG, I got super thirsty after.  We tried the fish puff and japanese style chasu. The fish puff was bland (just like the other review wrote) and the chasu was not japanese style at all! It was like chinese style pork belly! Total $50 for four of us.  I think the food doesn't worth it. Next time I would go to Deer Garden if i want fish soup base noodle. Maybe I would come again for bubble tea takeout (its now buy 1 get 1 free!)"}
{"text":"Great place! I've been a few times and always get a different variation of the noodle soups. Every one I've had has been great! I recommend the tom yum soup base, it's a slightly sweeter variation with coconut milk for a smooth, creamy texture. I love how Chef Papa is partnered with Presotea for some nice bubble tea options too. Noodle soups and bubble tea are my two favorite things, this place combines them both!"}
{"text":"Had their Tom Yum soup with rice noodles. It tastes more like a Thai coconut curry based soup. It did't taste bad just not what Tom Yum is. Friend ordered tomamto and egg soup with ramen noodles sand I was shocked how bad it was. I thought this is like Deer Garden but such a dispointment. My friend asked for no onion twice and they forgot about it. Also messed up our drinks.  For any one that thinks this is like Deer Garden, don't bother."}
{"text":"Pretty cool place, similar to most other noodle bars, but they have some interesting drink options available.   In PeachTree Centre, on the side closer to Highway 7, this place is well light, with a good amount of seating. Service was pretty good, with quick servers and good attitude.   As this is a noodle bar, you essentially get to pick your soup base, type of noodle, 2 ingredients, and a beverage. Other combo options are available, but make sure you are reading everything carefully, as there are many different prices and additions when certain choices are made.  I got the Vietnamese Beef Soup Base with Japanese Ramen noodles, and Beef Balls and Pork. Very tasty, a good size portion, and a nice overall meal. With the inclusion of a drink, I had the Presotea Passionfruit Lime with Aloe Vera. A drink that was more unique and something very different. A nice refreshing beverage to pair with my noodles.   Overall a nice addition to the plaza and a great place to get some great noodles. With many different options available, you can get something new every time. Definitely worth another visit, but may not get something as pricey next time."}
{"text":"Food: 2.5/5 (food was hit or miss)  Service:3/5 (quick)  Note: cost extra $2.5 if you want to add BBT to your meal.   We went here a few times, however our recent visit was a big disappointment. Their food and drink went downhill, we ordered Taiwanese diced stew pork with rice ($9.75 + $2.5 bbt), it was really salty, rice tasted like leftovers that spent a few nights in the fridge, and was really dry.  Japanese style rib eye sliced beef w/ teriyaki sauce in hot sizzling mini pot ($10.95 +$2.5 bbt) tasted like cheap beef from a hot pot beef tray you can find in any Asian grocery. Bubble tea had no tea flavor and was fairly bland.  Overall, we will return for afternoon tea set, because they are reasonably priced; otherwise lunch menu is not worth it."}
{"text":"Came here a couple times. I enjoyed it the first time, but when I went today, it seemed like they couldn't handle the lunch rush. I ordered the Hokkaido ramen and it wasn't as creamy as I had remembered. A friend of mine ordered the dan dan broth but they had given her the pork bone broth. When she brought this to their attention, they told her that what she had in her bowl was the dan dan broth. Her broth was white not an orangey red as you should expect. When we got the bill they had put down pork bone broth which confirmed that they screwed up. We also tried the popcorn chicken and the honey garlic chicken wings. They were delicious except our chicken wings weren't fully cooked and bloody on the inside. They quickly took the wings back and brought us a new order, but this was without any apology and seemed more of an inconvenience to them. I would come back to try some other options, but will avoid the lunch/dinner rush."}
{"text":"My parents and I went here for lunch recently and we really liked it.  It's a build your own soup place where you select the broth, type of noodles and toppings.  They also have some side dishes, like popcorn chicken and chicken wings that you add on for a discount when you buy a noodle soup (as opposed to when you buy them alone), but you can only get a maximum of 2 at the discounted price.  They also have a partnership with Presotea, so you can either get the free drink that comes with your meal (coffee, tea, lemon water, etc.) or pay an extra $2.50 to upgrade to a Presotea bubble tea!  So I chose the Fish Broth Chiu Chow Style ($9.50).  All fish broths automatically come with free napa cabbage, prince mushrooms and bean curd roll (so it's like getting 3 free toppings!).  For my noodle, I chose the Korean clear noodles (they are the ones made out of sweet potato that are used in Japchae).  You get 2 free toppings with each soup (each additional topping is $1.75).  I chose sliced beef and fried fish slices.  The Chiu Chow style broth also comes with ground pork, so I felt like I got 6 free toppings in total, woo hoo!  The broth was really fishy, not a bad smelly fish way, but in a you know the broth is made of real fish kind of way.  It was also really rich.  I loved the ground pork as it added an interesting texture to the soup.  The napa cabbage I received were mostly stalks and not the yummy leaves that I prefer :(  The prince mushrooms were umami-licious, lol.  The bean curd roll was delicious too.  The sliced beef was on the fatty and sinewy side though.  The fish cake slices were nice and chewy, but didn't have too much flavour.  They gave me so many noodles!!  Fortunately, they were tasty.  Overall, I did enjoy my soup.  I chose 1 side dish: Taiwanese popcorn chicken ($1.99 - discounted price).  It was delicious.  So crispy and with a distinct salt and pepper taste.  There were no basil leaves with it though.  Nonetheless it was great and a real bargain for $1.99.   I upgraded my drink to a Panda Milk Bubble Tea ($2.50).  It's called Panda because it comes with black and white tapioca pearls.  The tea was rich and creamy and not too sweet.  (You can customize the amount of sugar and ice in your tea, and I was going to ask for half sugar, but I forgot to, and fortunately full-strength sugar wasn't that sweet).  The tapioca pearls were nice and chewy and you get a good amount of pearls.  The drink is large.  It's definitely worth doing the upgrade.  Besides, they give it to you in a takeout cup (not in a real glass), so if you don't finish it, just take it with you when you leave :)  My mom had the Pork bone soup with red miso broth ($10.50).  This broth comes with free corn, a marinated soft boiled egg, and 2 types of seaweed.  You can also chose the Japanese ramen as your noodle with no extra charge (if you chose any other type of broth, you must pay an additional $0.75 if you want the Japanese ramen).  Obviously, my mom chose the Japanese ramen.  For her toppings she got the Japanese Char Siu and the beef brisket.  She really enjoyed her meal.  I had a taste, and the noodles were nice and springy/chewy the way Japanese ramen should be.  The broth was creamy and rich.  The meats were too fatty for my liking, but that is the nature of those types of meats.  The egg was heavenly.  The yolk was so gooey and melted in my mouth.  I think I could eat a dozen of those, haha.   She got the Lemongrass chicken cutlet as her side ($2.75).  It was super greasy and was sitting on top of a puddle of oil.  The meat was fatty and I wasn't a big fan.  She also upgraded to a bubble tea and got the Matcha Milk Bubble Tea with Red Bean and White Tapioca Pearls.  She said the green tea was too bitter for her liking, but she enjoyed the red beans and tapioca pearls.  My dad got the original fish soup broth ($9.50) and chose beef tendon and lamb slices as his toppings and udon as his noodles.  He liked his meal but commented that the lamb was really gamey.  He just got a coffee as his drink (free).  The coffee comes already creamed, but no sugar.  He had no comments on the coffee but I noticed that he did not finish it.  They give you a laminated piece of paper and a grease pencil to tick off your choices on the order form (points for being environmentally friendly as they reuse the order forms).  There's a place to tick off if you don't want any items that routinely come with all soups (i.e. bean sprouts, cilantro, sesame seeds, etc.)  The form is pretty straight-forward.  They also give you a menu with pictures.   Our server was really nice and pleasant.  She just didn't really speak English all that well.  One time she had to ask her co-worker to translate.  Nonetheless, she was competent because our orders all came out correctly and timely.    The restaurant is clean, including the washrooms.  It's in a strip mall, so there is free parking.  I love build your own noodle soups places and this one did not disappoint."}
{"text":"Poor customer! First time came, I didn't know the build your own menu also for self order. So I asked the waitress to order,  and she said order your self\" and pointed at the menu. She could be more polite when she gave me instruction. I gave 2 starts to the new concept of presotea and cafe. However the most important is customer service. Poor customer service! I am here at 2:30 pm, kind of quiet here compared to other restaurant. This is the first time and it is also my last time here."}
{"text":"Enjoyable big bowl of noodle for hungry man here !!!! Soup base and food are well cooked and always hot. This is A must and my favorite criteria for noodle eaters. Taste perfectly flavorful.  If you are a fan of Presotea , here is the place with your noodle dining. Down side is they don't collect the presotea reward.. ;(   Thumbs up to their noodles and many choices to noodle lovers!!!!! Esp, fish base and laksha base these two are the best:)"}
{"text":"\"Sometimes when you are lost...is when you are truly discovering yourself\" - random philosopher ..joking...i made it up  However the quote above is not totally out of context, as me and my co-workers did discover this place by accident - and was the greatest mistake of my day.  Place is a little confusing as when you walk in- it seems like a bubble tea spot but they have a kitchen as well. They give you magic pencils and a menu where you choose what soup base + choice of noodle +choice of  meats (pick 2) + which drink and whatever add-on's you need. Was easy to order using their do it yourself menu- and not necessary to even communicate with the staff. However - the language barrier is not terrible and they did communicate effectively.  I ordered the singapore laksa- was amazing. spicy and large portion. Totally worth the value. This place is good stuff. I will be back."}
{"text":"I've been here a few times to know the place well enough to write a review. I've tried a handful of combinations already and the broth and noodles actually taste pretty good! My portion sizes have always been great, but it seems inconsistent because some of my friends' portions looked a tad smaller. The ramen bowls are smaller than the regular ones BUT they are packed with noodles and ingredients.  I love the concept of building your own noodle bowls and have visited this place a few times already. It seems like a great deal because all of the combos come with a drink (by Presotea), but they could charge $1 to $2 less, in my opinion.  The staff are a bit slow (or unattentive), but overall not too many complaints about them. I wouldn't drink the cup of water they provide though... the cups look pretty dirty and the water isn't cold.  By the way, they only take debit or cash."}
{"text":"Came here a few times. Lots of options to customize.   I've tried the Singapore laksa which was good but not creamy enough and the fish broth tomato and egg (OK broth, I added chili oil for more flavour).   The fish puff is good here which is house made.   Reasonable price and good portion size. Decent service. Food comes out quickly. Overall a decent place to grab a quick bite if you're craving noodles. You can get Presotea here!"}
{"text":"It's ok.  They kept forgetting our order and we had to keep ordering twice or reminding them we are still waiting for our food.   The noodles were ok nothing special about them and their bubble tea was crap. It was soooooooo sweeet!!!!  I felt like I was drinking sugar. So I just left the drink there.   I wouldn't come back here again there are better places out there that serves better noodles and bubble tea the same time."}
{"text":"Service was bad, they cheap out on toppings. They have a large variety, but depending on what you want it's probably better to just go to a store that specializes in it (eg ramen, cutlet rice, etc)."}
{"text":"October update: officially have to update my review to 5 stars as it being my favourite restaurant for laksa noodle soup.   I would have given the review 4 stars but as of yesterday's visit it has lowered 1 star because we noticed they started to reduce their portion of soup.  Since its opening my family and I have been here about 13 times because it tasted very good.  Markham needed another different noodle customization restaurant aside from Deer Garden.  I loved this restaurant and have been eating their Laksa noodle soup every time that I've visited.  The staff is friendly but this restaurant can get quite busy especially on Fridays and weekends.  I really like the fried cuttlefish balls (side dish) and five spice chicken wings.  I will be visiting again and hope that they don't continue to reduce their soup portions because sometimes a little goes a long way.  The owner is nice and takes the time to explain if he sees you're new to the restaurant and need a little guiding when ordering."}
{"text":"Yes this is a build your own noodle restaurant (which i love). Noodles and snacks I believe have gotten better over the months/ year.   Food and drink (4/5)  Noodles: like them! My favorite ones are the Japanese ramen, garlic pepper, fish soups. Laksa soup is quite heavy / salty  Snacks: the Taiwanese popcorn chicken is a good choice in terms of taste and quantity.  Drinks: I would opt in for their specialty bubble teas. The coffee / lemon tea: yuk.. not recommended   Service: (3.5/5)  They are generally pretty helpful and efficient.. but don't expect the royal treatment  Ambiance (4/5) Nice renos, little booths, busy busy, usually have to wait for a table"}
{"text":"So this place is Deer Garden knock off. It's exactly the same in terms of how you order the food. You get different choices for the soup base, the ingredients and the noodles. Unlike Deer Garden though, the selection for everything is huge! There is no extra charge for \"premium\" soup base or noodles. Only gripe I have with this kind of method is choosing two ingredients. You can choose two or add more at a cost. The worst part is they don't pack those ingredients. I ordered beef brisket and crab meat and it came with 3 crab meats (acceptable) and couple slices of brisket that were thin as paper. This dinner was in no way filling, but did the trick in terms of getting a healthy sized snack. Perhaps I eat too much, but the thin slices of beef was unacceptable. I was not expecting the price for that kind of beef. In some ways they hit home, such as the taste of the soup and the portion of the noodles. But others were strikes, like the beef being too thin and service being rather slow. They weren't that slow, but I'd like them to pay attention to us more."}
{"text":"Came for lunch today.  Wasn't too busy at 12 but then it started to fill up.  I ordered the coriander and preserved egg fish soup base with korean glass noodles.  Toppings were fried fish slices and home made fish tofu.  The bowl of noodles came out quite fast but the soup wasn't hot, just warm.  I looked at other people's bowls and they were all steaming hot.    Soup base was a bit salty for my liking.  The 4 fish slices were regular store bought ones. The home made fish tofu weren't  that nice, they were kind of spongy.  I wouldn't get them again and you only get 3.  My friend ordered the chiu chow fish soup base with ramen.  His bowl wasn't hot either.  He commented on the saltiness too.  We upgraded $2.50 for the premium presotea drinks too.  We added a side order of the chicken wings, but they hadn't come by the time we finished our noodles.  We asked the waitress and she said that they weren't ordered.  I think that they need some type of hot sauce on the tables, the bland fish tofu could have done with some. I personally wouldn't come here again.  It cost $30 plus tips for 2 bowls of ok noodles and 2 drinks.  For that price, there's plenty of places to go for a decent lunch.  Not worth the price for the quality and quantity of the food that you get."}
{"text":"One star for ambience, one star for the Presotea drink.  One star was taken off before we even sat down for our meal. When we walked in there was a little bit of a wait. As we waited, a second waitress came to ask how many people, then she looked around the restaurant and walked to an empty table with menus in her hand and started wiping the table down. There was only one group of people in front of us, and they were just standing there, so we thought they were waiting for a larger table or something. So we walked down to the table where the waitress was at, as soon as I got there, the waitress literally yelled in my ear \"this table isn't for you, get back to the entrance and wait\". She was loud and rude! I mean she could have asked nicely since she is the one who didn't communicate in the first place!!!   As I sat down and looked at the menu, it looked like Deer Garden but with more options. We were a party of three, ordered a laksa rice noodle, fish soup rice noodle, pork tonkatsu don, and on the side Taiwanese Popcorn Chicken, Fried squid balls, fried fish fillet, fried pork ribs, and some drinks. All dishes came out picture worthy, however: laksa was tasteless, the sliced lamb topping was all bunched together and had no flavour. The other rice noodle dish was over cooked to the point where the noodles were almost melting. Pork Tonkasu don was like rice porridge at the bottom of the bowl. Fried squid balls was also tasteless, fried fish had a weird chemical/unfresh taste. In the end, only the fried pork ribs and popcorn chicken was okay. My drink was pretty good because it's from Presotea.   The food was still edible, just not very good food. It's the type of food that makes me regret not having a home cooked meal instead."}
{"text":"This place is similar to Deer Garden but they seem to have more variety. I got the Japanese ramen and it was surprisingly good, dare I say even better than Sansotei! The egg was done perfectly and broth was creamy. I also highly recommend getting their iced milk tea, it's very creamy and smooth with good amount of sweetness."}
{"text":"A solid place to go if you're looking for a hot bowl of noodle soup. The ramen, laksa and tom yum soup bases, and curry udon are my staples. The wait is never too long and the service is quick. Sometimes the kitchen doesn't pay enough attention to garnishes you don't want in your soup though (like green onion or cilantro) so make sure you tell them again when you hand in your order. This happened a couple times."}
{"text":"Overpriced for the quality of ramen compared to other places. Popcorn chicken was disappointing as well. Overall, would have expected more for the price I paid."}
{"text":"I've been coming here every so often to get my noodle fix ever since they've opened. Inevitably, this place gets compared to Deer Garden a lot because of the similar way of ordering noodles. One difference about Chef Papa is that they offer the Japanese-style soup bases that Deer Garden does not have. I've always found that service satisfactory here. As a customer, as long as you're quick and to-the-point, the service will be too in return.   Upon exploring the noodle menu, you have to understand that there are 3 tiers of soup bases, higher tiers will offer more base ingredients - which is totally worth it because the included half-boiled egg is made to perfection each time. I'm impressed each time because both their soup base and ingredients (even though I think they're ready-made?) are presented at a consistent good quality. My soup noodles never fail to steam, and the chashu is always soft, tender and juicy. My special mentions are their signature Chef Papa Fish Puffs, the Japanese Chashu, and their Half-Boiled \"onsen\" egg.   I have to appreciate the variety they offer here because it's not all about noodles, they also offer rice, sizzling plates, pho and many small snack items such as Taiwanese popcorn chicken. During the afternoon tea time period, you can get a decent sized snack here for an affordable price. If you've got a friend who's not really in the mood for noodles, well they've got options here.   One huge yes factor for me here is that all items comes with a drink. My fave HK style milk tea, is a solid 5/5, to pair with my noodles or to take-out. Mmm! PresoTea is a partner here so you also have that option. I never hesitate to suggest Chef Papa as a place to eat and chat with my friends. They've got a lot of options and I've enjoyed every visit here."}
{"text":"Finally got to come here after hearing so much about it.   Chef Papa is a pretty cool concept, where you get to choose your soup base, noodle, and toppings. All meals come with a basic drink with the option to upgrade for an additional cost ($1.00 for cold drinks and $2.50 for their specialty teas). My fiancé chose the tom yum and coconut soup base and we flagged someone down to ask which noodles are the pho noodles. The guy we asked had no idea. It's the dried rice vermicelli, FYI. I got their ramen combo with cha siu and a basic soup base. We also ordered their Taiwanese chicken nuggets, honey garlic chicken wings, and lemon grass chicken as additions.   My fiancé's meal came almost instantly with our side orders trailing behind. His dish was super delicious. The tom yum soup was the perfect amount of spicy, sour, and thickness. Noodles were your standard pho noodles. He ordered beef and egg as his two toppings, but his meal only came with the beef. He flagged someone down to ask about the missing egg and she said she would check to see if his dish was wrong. We watched as she walked away, did a circle around the restaurant, and then stood by the tea bar. She avoided us for the remainder of our meal.   My fiancé's meal came 20 minutes before mine and we were still waiting on the lemon grass chicken. He was almost done his meal when we asked someone about my meal. They apologized, ran off to the kitchen, and returned with my dish and the lemon grass chicken. My dish was good,  but nothing to write home about. Noodles were tastier than your average ramen noodle and the pork was tender and fatty, but the soup base was underwhelming. All the side dishes were really good and you can't go wrong with the price tag.   Our drinks came as we were finishing our meal. Thankfully, our bubble tea came in a take out cup, so we could just bring it with us on our way out.   This place would be a 4 star to me, but I took away one star because their service sits somewhere between nonexistent and incompetent."}
{"text":"When a restaurant's menu reads like a choose your own adventure series, I'm in a good place. When the adventure ends in a bowl of delicious, affordable noodles, then I'm in a great place. After all, having a lot of choices can be exciting. Kinda like character customization in an RPG, an ordeal that can take hours to create your perfect online self.  1) Choose a server: Ultimately, it probably doesn't matter what you pick, but maybe you like the feel of one over the other. Maybe your friends all want some ramen noodles, or udon, and yeah, you heard pretty good things about those two.   2) Choose your class: Rich shio broth, tom yum, garlic white pepper, home-style tomato and egg. Your soup base is the foundation for all your choices. Whatever you pick will determine your stats in-game, what gear you should go for, or what your dinner will ultimately taste like.   3) Customize your looks: Blue eyes, green eyes, beef brisket, bok choy. Choices, so many topping choices. Hard to go wrong with any of them and you get two free selections. For once, feel free to click the randomize button.   4) Choose your gear: Sure you can run out into the RPG world butt naked, but do you really want to? Similarly, why not get a drink, when it's absolutely free? Cold drinks are a dollar extra. The bubble tea upgrade is $2.50.   5) DLC/Add-ons: So you're good to go, your noodle selection is optimal. But then again...what about some Taiwanese fried chicken for $3 or some fresh crisp wings. Oh man, it's not that expensive and it'll make you look pretty cool...I mean, it'll taste pretty good.  And there you are! You are left with a generous bowl of soupy comfort that you can take pride in and call your own. The beauty with Chef Papa is that everything I tried tasted fresh and delicious and your bill usually stays under the $20 mark unless you really go ham. Be as generic or as adventurous as you want! If you're really committed to this metaphor, feel free to name your bowl of noodles as well.   Yours truly, XxNoodzkiller00  (102/100) - 2016"}
{"text":"the food at first looked pretty good, but the taste is horrible we could not finish our noodles or rice (even tho we were starving)  the chicken wings should be called deformed chicken bones with a bit of meat?   the drinks even with the presotea name did not taste very good and presotea is usually pretty good (the ones from pmall at least)   lacking in many ways. don't judge food by the pictures.  prices are very fair but not worth it for this kind of taste."}
{"text":"We've been here multiple times. It is one of our go to places for noodles as the food never disappoints. Service is a hit and miss but staff is usually fast but not always friendly. We've ordered the tom yum soup base before. Very sour and flavourful. Better than most places. We've also had the fish soup base which is nice and light , pairs well with the Korean clear noodles. But our current favourite is the pork bone soup base with ramen and half boiled eggs. Their eggs are always done to that gooey perfection. Unlike uptown kinton which has been over cooking the ramen eggs for the past five visits. I would also recommend getting the red sausage for the side! Also for $2 you can get 3 delicious honey garlic or salt and pepper fried chicken which is delicious. I love that the food is served quickly and everything is still hot when you eat it. The takoyaki is good too. Only $1 per piece. For drinks, I usually just pay $1 for the cold milk tea as I think they make it quite well."}
{"text":"the food here was OK. Nothing to really complain or compliment about.  I'd prefer deer garden signature, it's about the same price but i find that Chef papa stinge out on the toppings and have less variety."}
{"text":"Great for a fast lunch/dinner. They have a great variety of soup bases ie. Fish base, tomato base, curry, beef and pork soup base. You can choose up to 2 toppings , your choice of noodles. I would highly recommend the taiwanese cuttle fish ball as one of the toppings. You can also choose an extra side or bubble tea for a bit extra. The sides consist of chicken wings, spam, teriyaki chicken etc. I love how the drinks you can upgrade to presto tea flavours. I found the flavour of the soup lacking, a bit bland. I prefer deer garden rather than this restaurant. The restaurant is a fast pace restaurant, you would not be able to socialize as many customers are waiting."}
{"text":"Came here with my boyfriend for lunch.. This is my second time here, as I came here during opening week. I can see that they made some changes, as the menu used to be on paper like deer garden, but it looks as if they went the environmental way with dry eraser marker menus!   There's so many choices on the menu, the soup base, the type of noodles, the toppings, side dishes, and drinks.  I like the fact that they paired up with presotea.    Arrived here at 1pm, there was a short wait ahead of us, but was seated within 5 minutes.  The tables are a little close as I was practically sitting beside the person from the next table.    I got the tomato and egg soup base with Japanese udon with Japanese char siu ans Taiwanese cuttlefish ball, and Taiwanese popcorn chicken as a side.  My boyfriend got the Taiwanese minced meat rice.    The side was pretty good considering it was only 1.99. They were fresh and hot, not too much spices, but at least like 8 pieces!   The noodles were nice and chewy! Soup base had a nice tomato flavour and both toppings were really good and flavourful.  The Japanese char siu was soft and had a good split of fat and meat.    My boyfriend said the rice really hit the spot.  I tried the egg, and it was really good, nice and oozy in the middle, and the meat had a lot of flavour.   The service was okay, although the table next to us, 2 of the orders had toppings missing in their noodles and had to be sent back.  They were complaining about the service.    Overall I enjoy this place more than deer garden, although it was packed with people, I didn't find the atmosphere as noisy as Scarborough deer garden.  Would come back, especially for the happy hour 3-6pm presotea buy one get one free!!"}
{"text":"Summary: make-your-own-noodle-bowl spot offers \"meh\" broth and noodles, but has solid side dishes, good drink selection, and a comfortable experience for a higher price than competitors  Top Must-Get: seared porkchops side dish Top Regret: shio pork bone ramen What I'll Try Next: rice combos  I've come here a few times for lunch. It's a bright and comfortable restaurant, and their preso tea offerings are a big draw in conjunction with their noodle selection.  Service: Exactly what we expect: seated right away, orders quick to come (they've got this pretty cool laminated order sheet which is actually very eco-friendly compared to competitors), and it's generally no-nonsense. The water took a while to get here on one particular occasion, but it was otherwise okay.  Food: So many noodle options! Unfortunately, it seems like it does fall to the stereotype of being the jack of all trades, master of none. They've got ramen, pho, instant noodles, vermicelli, egg noodles, Korean clear noodles...***  MINI VENT: BUT do you know what they DON'T have? The WIDE, FLAT kind of \"HO FAN\"/\"HO FUN\" noodles. A customize-your-own-noodle place that doesn't have your favourite kind of noodles... the world can mock you sometimes.  ...and they've got three types of soup bases to pick from (fish soup, ramen, or pho), and within each type, they've got even MORE options.   Despite these choices, the noodles themselves aren't brilliant. Part of the issue seems to be the broth, which is not spectacular.  The ramen (highest price point)? It's okay. The pho? Really bland. Fish soup? Meh.  BUT, you get to pick your own toppings, your own side dishes, and your own drink... and that makes it seem more fun. Upsize your noodles for $2!  The side dishes in particular are the champions. The seared porkchop is juicy, tasty, and a great complementary aspect ($1.99 extra). It's better than the seared chicken, which is also pretty good.   The preso tea is also a very big draw, and gives it more 'credibility' in its drink offerings, although I usually stay with my regular honey lemon tea.  All in all, a comfortable dining experience that is fun, but just a little lacking in quality broth on the mains."}
{"text":"We went there excited to see a noodle place with ratings comparing it to the downtown ramen houses. Big let down.  I guess we should've predicted judging from the menu that they weren't \"specialists\" in any type of noodle. There were \"Japanese\" ramen, \"Vietnamese\" pho-style noodles, \"Laksa\" noodles, \"Dan Dan\" and \"Tom Yum Gong\" noodles.  Like some of the other reviews, we noted that the menu style and ordering format was much like Deer Garden. One good thing was that they have the option of paying a little more to upgrade to a Presotea bubble tea. It's sad to say that the Presotea (franchised bubble tea) was the best part of the dinner.  We tried the laksa soup with flat rice noodles, chasiu and tofu puffs. The soup was just OK. Deer Garden's soup is much tastier and the noodles come with much more veggies in it.  Another noodle bowl was the shoyu soup with house made fish tofu and pho beef. The beef was good but the fish tofu was a mushy mess, also way better at Deer Garden. The soup base DOES NOT compare to the downtown ramen places at all. The noodles were subpar as well. Definitely a disappointment when the review were saying this place was as good as downtown. I am still going to make the drive until Sansotei opens in Markham.  We also decided to try a few side dishes. DO NOT WASTE the extra money. Chicken wings were skimpy in size and taste. (Both the honey garlic and 5 spice - even our little guy wouldn't touch them). The Taiwanese popcorn chicken was not good. The lemongrass chicken is better across the street at Xuela as is the dense and not crispy spring roll.  We may return if we are desperate and don't feel like driving downtown but for dinner Keung's and many other restaurants nearby would be our first choice."}
{"text":"We had an early lunch here today. Nice and quiet. Service was not bad.   Had the Japanese curry pork cutlet with rice lunch special + panda milk tea ($10.95?). Didn't know it came on a sizzling plate. That was nice. Decent portion. Food was alright. For a supposedly Japanese curry, it wasn't very sweet, but I can't say I'm surprised.  Three hours later, I'm still working on finishing my bubble tea. Large size? Iunno, but it's quite a big cup. It's a milk tea with both black and white tapioca pearls. I can't figure out what the flavor difference is. They both taste like tapioca to me. Tapioca's not bad, but it's taking a while to make sure I chew through all the bubbles so I don't choke and die. Fun times. Nice that they asked how I wanted my ice and sugar (less ice and 50% sugar worked for me).  Restaurant got busy around lunch. Oh. Free Wi Fi. No password. Nice."}
{"text":"Omg I love this place the best mince pork rice I ever had in markham so far! Amazing fried squid balls and popcorn chicken. It all fresh made."}
{"text":"J'adore!!! Been meaning to come here since it opened and here I am, finally eating my noodles, and can't wait to go on a computer to write this review.   The seating is renovated and looks modern, unlike the old and rotting congee place that used to be here. The service is impeccable, with \"thank you's\" and \"you're welcome's\" that you rarely hear in a Chinese establishment. As said in other reviews, it's very similar to deer garden. I actually prefer ordering on paper like this for detailed menus, because it makes it a lot less confusing for both the waiters and I. The food was actually a good portion. Lots of soup (laksa base was delicious by the way) and a good amount of noodles (don't wanna overload on carbs, right?) and the price was not had. The Japanese ramen noodles were actually very good and tasted authentic, which makes me feel like the price was worth it.  $8.99 (includes 2 toppings and a drink). I'm satisfied, because now my stomach is happy and feels like it's going to burst. I agree that the side dishes are very small. The chicken wings are tiny but I enjoyed them- they're like the typical HK style wings. The Japanese dumpling side dish is amazing! Pan fried to perfection, it makes me crave more and more with each bite.   For Markham food, I am VERY impressed and I don't think it's pricey at all.. it's cheaper than most meals I eat... AND NOW I'M TOO FULL, SEND HELP! Chef papa, I'll be back for you."}
{"text":"Good place for a quick bite. Reasonably priced. Return customers. More parking space at the back corner of the plaza near HSBC."}
{"text":"All-time favourite noodle house! I get the same thing every single time, fish soup (preserved egg + coriander) with yellow thick noodles, topped with beef tendon and Taiwanese cuttlefish balls. I've never been able to finish the entire bowl, which is bomb because I can enjoy the rest later at home again! I love the dry-erase menus and layout of the restaurant. They really revamped the old congee wong design and modernized the place.  Some advice: the laksa soup and fish soup are probably the best options if you want your money's worth, because there's toppings already in the soup! And the laksa u get the soft boiled egg as well. The yellow thick noodles also make you full faster and absorb the soup very well, making it a great option to bank it.  I personally enjoy Chef Papas over Deer Garden solely based on taste. I find Deer Garden very bland  tasting. The toppings seem like they were over boiled in unsalted water then thrown on top of the noodle bowl. Not like the flavour unity you get at Chef Papas."}
{"text":"I was with my grandma and she recommended we go here for lunch since she's been here a bunch of times with my sister. We were immediately seated upon entering and service was pretty quick.  I made my own bowl and ordered the matcha milk tea. It was great that they let me substitute the red bean for coconut jelly. I don't really remember what I ordered but it was a little spicy and delicious! There were quite a lot of noodles in my bowl; it definitely filled me up. While the side dishes were quite small, I was so full from the noodles that I couldn't finish them. I also take a long time to eat but they didn't rush us out or anything. Oh, and the bathrooms are clean. I would definitely come back again!"}
{"text":"Best chicken cutlet I've ever had. It tasted fresh, the frying of it was crispy and placing it, the rice, and the corn in the yummy curry sauce on a hot plate is genius. It was so hot during my session of devouring it!  Wifey had the Japanese Chashu with ramen and found it a bit on the salty side but wasn't bad.   Fairly well priced with decent service. Even though I miss that congee place which was there years ago, this replacement is not too shabby in my books! We'll be back if ever in the same region.  Oh yes...I loved my passionfruit/lime drink with jelly and tapioca. It was so delightful. My recommendation when you're there!  Cheers!"}
{"text":"Originally, I wanted to go to my FAV ramen place (raku ramen and izakaya). Little did I know, THEY'RE FOCKING CLOSED. GONE. IM SO UPSET LIKE WHY MUST ALL NY FAV RESTAUrANTS LEAVE ME WHYYY. COme back Come back!!!!!!! !   Anyways, enough of that. I went here instead to satisfy my ramen craving. For the most part, it was a relatively good experience eating here. I liked the fact that you can choose from 3 different soup bases (fish soup, hokkaido pork bone soup, and vietnamese style beef soup), whatever type of noodle you want, and whatever toppings you want. It's fun to customize food AYYYYY So yeah. I decided to get:  1. Pork Bone Soup with Red Miso Ramen 2. Japanese ramen noodle  3. Japanese Style Chashu and their Chef Papa Fresh made Fish Puff  Pretty good. Soup was flavourful. Not too salty and not too bland. Ramen noodles were pretty good (a little hard though). Chashu could have been a lil better though. And the fish puffs, meh I didn't really like it. It was too squishy? Mushy?   I came here with my mom and she chose to get some pho noodles. LEMME TELL YALL . THEY WERE VERY GENEROUS WITH DEM NOODLES. HER BOWL WAS EVEN BIGGER THAN MINE. I WISH THEY WERE JUST AS GENEROUS WITH THE RAMEN NOODLES D;  OH YEAH you can get a drink from Preso-tea for just an extra $2.5 with your meal which is pretty cool although I must admit I'm not a huge fan of Preso-tea. I am still very much in love with Coco and NOTHING WILL MAKE MY LOVE FOR COCO GO AWAY NOTHINNGGDJSIANS   BUT YEAH! Overall good place and it's definitely worth a try. Gotta mention though, I'm not too happy with their service. The workers were all so quiet and indifferent when they were with me and then when they were away from me (and other customers ofc) they were talking up a storm. So loud too like dang. Not that I want them to do small talk with me or anything, but I kinda wished they would've spoke up a lil more (go from volume 3 to at least volume 6 mate) YALL FEEL ME ?!"}
{"text":"The portions for noodles are small. If you are not a small eater, get the rice dish instead so u may feel fuller.  Had wanted to go to Big Beef Bowl that evening but to my surprise, it was closed :( so quickly made a decision to see where else nearby should I eat. Wanted moji but my friend literally didn't want it. Would have went to Taste Casserole but knew the wait time would be long for the hot pot rice and I didn't feel like going to the opposite plaza knowing parking would be hard during that dinner period. Since I was extremely hangry, I decided to give a try at Chef Papa knowing the food would be quick. I had wanted to try this place for the longest time but seeing the not so great reviews, I was in no hurry to go.  Quickly selected some items and put in the order. Place was 3/4 full by the time I arrived. The noodles quicky came out first and what a joke it was. The bowl was filled with soup but it wasn't filled to the max. The toppings and the fresh noodles were so minimal. It was like..That's it? Where is the rest? The soup base though was good. That I have to give it to them. So glad I sticked to my guts and ordered a rice dish too because no way the noodles will fill us up.   Also, took advantage of the $2+ to upgrade to presotea drinks and ordered two side dishes.  My rice dish was decent and I think the saving grace of the evening that comes with three medium sized pork chops  In the end, one bowl noodle, one rice dish, two sides dishes , two upgraded presotea drinks with taxes / tips ended up with a grand total of $37.    The good  *Presotea $2 upgraded drinks  *Decent size rice dishes  *Big sitting area, which means less wait time for a sest  *Service was ok.   The not so good  *Small portions of noodles and toppings  *With all the options available , it may get pricey as u end up ordering a lot of items or do the upgraded drinks.  *Cash and debit only.  Overall verdict? I wouldn't go back. And even if I did, I am not ordering any noodles lol"}
{"text":"Whenever I'm sick, I love a good bowl of soup noodle. I love that this place offers not only soup noodles but also presto tea drinks.   I ordered from their lunch special menu and got their fish noodle soup along with their black sugar ginger tea. The fish noodle was okay. Even though the lunch size is slightly smaller than the dinner size, I was pretty full after eating it. However, I felt that the fish flavour could have been more developed and deep but I'm glad there's no MSG in the soup. The black sugar ginger tea was hitting all the right spots... I got it because I'm sick and it's good for my stomach but for all my ladies out there, this drink is also perfect during that once a month. ;)  Service wise, the waitresses could have been more attentive. I didn't get a glass of water until 5 mins after I was seated. Also, it took a couple waves until the waitress saw that I wanted to place an order as well as when I wanted to get the bill.  Overall, it's a decent place for soup noodle. I will return!"}
{"text":"Went here with a friend and tried their noodle soup. Their noodle options are a cool concept - you choose a base and add on your toppings and whatnot. I went for a fixed menu item though - katsu curry udon soup. They give you a few menu sheets, some of which have pictures of the most popular items. Spoiler alert: the pictures don't match the food you get lol! All good though. The soup was pretty good although I've had Japanese curry before and the flavor of this soup didn't exactly live up to par, it leaned towards a more Indian flavor. It was still delicious though! My friend had ordered beef to go with her ramen but they gave her pork instead - error on the servers side but we didn't bother to correct it. The Taiwanese chicken nuggets are actually more like popcorn chicken. They were nicely crispy without being greasy and had a mild five spice flavor to them.  You also get the option of adding a Presotea drink to your order for $2.50 and it's a nice size as the pictures show!  Would definitely come back and try more items on the menu.  I would give it more of 3.5ish if I could!"}
{"text":"I find alot of these noodle bars are opening up ever since the Japanese Ramen rave slowed down, where you basically choose everything you want, soup base, ingredients, noodle type...I do like that idea and for approximately $10-12, you can't really go wrong in my personal opinion...it's pretty straightforward...  I came here on a random day for lunch and saw the deal with presto tea so decided to give it a shot... like I said, you just choose as you go and you'll receive your noodles...the portion is average, they kinda cheap out on ingredients as I could count how many \"1/2\" size beef balls were in it...thats kinda cheating...not like I'm paying half price so why give me half size ingredients...   Anyways, the noodles were an A-Ok, nothing spectacular, soup base needs improvement not bold enough..when I say bold, that doesn't mean add more sodium..ok peeps?  All in all, I will be back but not in a hurry...=)"}
{"text":"I arrived at Chef Papa's on a Tuesday night at around 7pm. It was surprisingly full but my friend and I didn't have to wait long before we were seated. The restaurant itself was quite cramped and sitting in the aisle seat was a huge struggle - waiters and customers kept knocking off my coat on the floor as they walked behind me.  I ordered the $9.99 Hokkaido Chashu Ramen combo which include a drink. The ramen came with an soft-boiled egg, a handful of corn, black fungus, and three pieces of chashu. The soup was so flavourful and delicious! I didn't feel thirsty after the meal, which usually means that they didn't add a lot of MSG in it.  Service wise was mediocre. The staffs were quick to take your orders and the food came fast.  Overall, I think this place is a great place for a quick meal. The free drink was a bonus and I would definitely come for a round 2!"}
{"text":"I'm going to have to give an honest opinion about this place.  It's very much like Deer Garden. I've gone to Deer Garden a couple years ago before it even came to Toronto and Chef Papa basically caught the idea from them and duplicated it. It's quite expensive still and the service wasn't great.   A lot of yelpers here base their reviews on service and secondly on the food. The food wasn't bad. I just had a few challenges getting what I need: water, service, and seasoning. I asked for the seasoning twice and no one got it to me. By the time I finished my food, I just wanted to leave.  I got the Laksa soup base with thin noodles and it was kind of salty for my liking. However, again, it was very similar to Deer Garden.  I'm not sure if I'd come back simply because of their service. I'd recommend people to try it once though because truly, the food wasn't bad at all."}
{"text":"Normally I take photos of the food I ordered, but this time I didnt. Because the noodle here barely has any contents. All you see from the bowl is a flat white surface. On the top of that, the service was also quite bad. I understand that you might be tired after a long shift, but try to not make that unpleased face to customers."}
{"text":"I ordered the original fish soup with Japanese ramen + red sausage & Japanese pork slices. When the food came, comparing to what my friends ordered, it looked like there was barely anything in the bowl. When we asked the server why it looks so empty, the server didn't answer, turned around and went back towards their kitchen area, then she came back with a small take out sauce container of roasted minced garlic. I don't really understand what happened here but I feel that this is not very good service.   Additionally, the description for the soup base says it's comes with cabbage, mushroom, beancurd etc. It did, just that it was like 1 piece each - it really doesn't make a difference whether it was included or not. This is a serious big contrast to deer garden where it looks really loaded eventhough price wise there isn't much difference."}
{"text":"I am hesitant to give this place 4 stars because I think they really deserve 5. The reason for my dilemma is the fact while the food is very delicious there are a few challenges.   Let's start with the good!  Fans of Deer Garden will instantly recognize this food. Noodles, noodles and more noodles with toppings that you like. The selection of toppings is limited compared to the former but still decent nonetheless. As for quality of the food; it's head and shoulders above Deer Garden. The broth here is rich and tasty, the toppings are equally delicious. The sides don't fail either, they too are very good.  I was hesitant to try their ramen at first but I am glad I eventually did during my return visit. The broth is again is great, the egg is done pretty good (not exactly to Japanese standards but the yolk is still somewhat runny). The only knock would be the chasu, which is a bit tough and not quite melt-in-your-mouth.  The service is lackluster even for Chinese restaurant standards. I am hoping this is just opening jitters and with time the service will be smoother. Oh yeah, the menu system...not exactly great but kudos for keeping it green!  All in all, a place worthy of many visits."}
{"text":"Pretty good ramen. Bubble tea drinks from Presotea was a nice bonus.  It gets pretty busy during dinner time.  Atmosphere is a busy bubble tea shop."}
{"text":"Tried their noodle combo here. I was recommended the fish tofu as part of the noodle combo. At first it tasted really good - similar to soft boiled eggs but then it got bland really quickly.  I should've ordered imitation crab instead hahaa.. Would come back to try their dinner combo + bbt.  The drink menu looked pretty good! (Didn't get a chance to try it yet!)"}
{"text":"Wanted a quick bite and was im the area. Tried their Hokkaido Chashu Ramen Noodles. My husband tried the Chicken Tonkatsu with Rice. We also ordered drinks as well.  Hokkaido Chashu Ramen was $9.99 It was a small bowl. Flavour of the broth was flavorful and quite rich. There was some parts that I found a bit salty..maybe because it was mixed properly. There was quite a few pieces of thin sliced chashu. The soft boiled soy sauce egg was done well and taste yum. They added a bit of fried garlic on top which gave it more texture and flavour together. There wasn't much noodles though. But after my meal and drink I was quite content.  My drink was the Hokkaido Milk Tea with Panda Pearls. It waa refreshing and wasn't too rich, was subtle and the right sweetest. Bubbles were a little bland but overall it was a pretty good drink.  Chicken Tonkatsu With Rice was really good! It came on a hot place and the chicken was just freshly deep fried. It was so crispy outside and moist in the inside. The curry sauce that came with the rice was also very flavourful and delicious.   He also ordered a side dish of chashu. It came on a plate of soy sauce. It was ok but tasted better in the ramen.  Drink my husband had Passionfruit Lime (Aloe Vera & Basil Seeds) with Added Panda Pearls. The drink was also really refreshing and a lot of interesting textures!  Overall the food was not bad. I would come back to try other items."}
{"text":"Been here quite a few times so figured I would have reviewed it by now. Surprised I hadn't!   It's a pretty solid spot for a quick noodle dinner. You can order straight off the menu or customize what soup base, noodle type, and toppings you would like.  I usually go for the singapore laska which for some reason comes in a way bigger bowl than many of the other noodles my boyfriend orders. yumyum more for me! :) The soup base itself is alright. It's got a tiny bit of spice, but i find that it's not quite as creamy as laska's I've had before and it's a bit salty sometimes. I pair it with the dry vermicelli noodles because I like the texture of those noodles. They never get soggy and they're thin and flat. And to top it off, I always get cuttlefish balls and either beef tendons or tripe.   I think it's an okay value for what you get. The customized noodles come with a limited selection of hot drinks (I usually upgrade to cold for $1.00 because the noodles are hot enough already).   Service is usually quite quick, albiet rude for the most part, but this is more of an asian quick noodle meal type of spot. Just go in, eat, chill for a bit to let all that food digest, and head on out! :)"}
{"text":"At around $12 you can get a decent bowl of bespoke soup noodles with a free hot coffee, tea, ying yang, lemon tea, etc.. or add $2.5 for bubble tea from presotea.  I've been here once before and was disappointed with their food and drinks. But giving this place another try was worth it.  I've actually come back not once, not twice but thrice! and they're consistent with their quality and quantity.   First time back I had red miso ramen soup base with ramen noodles (surprise.) The one thing I love about ramen is how they soft boil their eggs and Chef Papa does it right. The noodles were al dente, the soup wasn't overly salty, the beef brisket was tender and a generous portion. Also included is BLACK FUNGUS! I like the crunchy/bursting texture black fungus offers. Also corn and sesame seeds.  The first time before I came back their presotea was sugar water at best. The bubbles were hard and doughy and found it's way to the trash pretty quickly. This time around their tea is average, good even. The milk tea had.. tea flavour and the bubbles were soft and chewy. Good stuff and great deal with the noodles.  Try it one afternoon."}
{"text":"I've been joking to my family that I will probably end up trying every restaurant in Peachtree Plaza/New Kennedy Square... that might end up being true at the rate I'm heading over there!  Stopped by Chef Papa Tea & Noodle Bar because my aunt had sent some photos of food and it looked pretty interesting.  I went with my mom -- I got the Curry Pork Cutlet with Rice and she got the Katsu Don (Japanese Pork Chop Cutlet Egg Rice), with both drinks being their English Milk Tea.  There was a bit of confusion between us because it's mostly a Japanese-inspired-but-actually-Chinese establishment -- most places just say \"HK Milk Tea\", not \"English Milk Tea\" but we were pretty certain they meant HK Milk Tea... English Milk Tea is not as strongly flavoured...  Anyway, I digress..  The Curry Pork Cutlet with Rice was pretty good -- the curry sauce was spicy enough, but a word of caution: it's fairly salty as well.  A good portion of rice was served with it and the cutlet was pretty big (albeit, there were a few pieces that were way too fatty to be consumed).  I was sitting in the booth and also noticed their afternoon tea menu (2:30pm to 5:00pm), which seemed to have a few snacks served with Presotea bubble tea.  I find it really interesting how this restaurant has a bubble tea chain attached to it -- I guess it makes things easier when you want a variety of drinks.  Definitely will come back to try the rest of the menu, especially the build-your-own-combo for the soup noodles."}
{"text":"The restaurant was full on a Tuesday night -  not a big surprise given the menu and the prices.   I opted for the Japanese curry and fish katsu. The curry had a medium spice to it and the spices were different from the boxed Japanese curry. The fish was basa and it was perfectly cooked. I wasn't a big fan of the texture of the breading.   For 2.50$ extra, you can change your drink to a bubble tea from Presto. I got the Okinawa milk tea which was way too sweet but still delicious.   The restaurant itself is like a typical Chinese diner and not the cleanest. The table wasn't wiped down properly. Also, the server wasn't that attentive as she was the only one of the floor. Overall, still a good option for an affordable meal!"}
{"text":"I have been here twice now with my fiance. The first time, wasn't as good. The service was just OK and they forgot a few things that we ordered. The concept is fun though. You basically build your own meal by selecitng a soup base, then your noodles, and proteins. Which they seemed to have forgotten my half boiled eggs. And when I asked them about it, they never arrived. Lol.  This second experience was much better. I got the tom yum soup base with ramen noodles, eggs, and beef, which is absolutely delicious! This time around i recieved all of the ingresients that i had orderd. I highly recommend getting the tom yum. We also ordered some sides of spring rolls and little fried chicken balls (no idea what they are actually called, lol). The second time was a much better experience and that's why they are getting 4 stars instead of 3. Since its a new place I would recommend going early if you can, otherwise you will be waiting to get seated."}
{"text":"Honestly the food is not great here. I liked how adding $2.50 gives you a large size prestotea and service is quick. That's all.   We ordered the Vietnamese beef soup base noodles - soup base tastes like beef broth straight out of the carton, with lots of salt and msg. Very little beef, onion and sprouts in comparison to the noodles. If their soup broth is this mediocre, I can safely assume that their fish broth and ramen soup base are not made from hours of cooking fish or pork bones.   Also ordered the pork cutlet curry. The pork was relatively moist, but the breading was slightly burnt. I wish there was more corn in the curry.   Won't be coming back for msg and salt."}
{"text":"Came here on a Wednesday for dinner; seated right away.  It's a little bit difficult to wave at the waitstaff cuz the booth are so tall.   I ordered a laksa soup base with fresh ho fun and jap cha siu and Vietnamese meat. Plus a side order of Taiwanese style chicken nuggets. Bf ordered a chicken cutlet Don and added $2.5 for a panda bubble tea.  My laksa is very flavorful and the portion is huge. Though the cha Siu doesn't feel like those ramen style cha siu. Overall it's pretty good The chick nugget is fresh and piping hot. And then I tried a piece of chicken cutlet that was good too. Fresh off the fryer and tender and juicy on the inside. The panda milk tea uses I believe is sencha tea. So tastes quite different from regular bubble tea.   Overall pleasant experience  Though one con is no acceptance of credit card"}
{"text":"The food here is priced very well.  I liked their ramen.  Their ramen was chewy and had enough ingredients (meat, egg, veggie).  The portion is good. The service was pretty fast.  The staff was pretty friendly.  The reason why it's missing a star is because my friend ordered their hor fun thick flat noodle special and the noodle was definitely WAY over cooked and it was pretty disgusting but it was cheap.  I ordered the fish puffs for mine as one of the toppings but it wasn't my cup of tea...don't know about others because it really is up to each person's taste buds, likes & dislikes, but my friend and I thought it was pretty gross so we ended up wasting it.  Because the ramen was pretty good & the pricing here is very good I would come back but would stay away from the hor fun thick flat noodle special and fish puffs.  They have a lot of specials with good portions & good pricing so I would come back since my experience was ok, but my friend will have a very differing opinion."}
{"text":"More like a 3.5...damn. Chef Papa you done good. The concept of building your own noodle bowl is blessed. Are they stingy on the toppings...a little. Do they dump 2 pounds of MSG in the broth...yeah. But it delivers on taste, and versatility.   The broths are not only saltier than your ex, but also have a good rich flavour. The Vietnamese base is not the best choice, but it's dirt cheap. The fish broth has a very distinct flavour that can be customized eg...garlic broth.   The noodle selection is great. Ramen, Korean glass noodle, Udon and even instant noodles lmao.   Where this place falls short are the toppings. Only two special toppings are \"free\" with an extra 1.75 for additional. However while it's worth it to get another meat topping, 1.75 for mushrooms or an soft boiled egg is a turn off  Honestly this a great noodle place that's worth a try."}
{"text":"Chef Papa has everything thing you may possibly want from an Asian-inspired menu. They have different types of soupy noodles (laksa, pho, ramen), Katsu on rice (with or without curry), and plenty of snack options. The menu is easy to navigate so the hardest part is making a choice (my friends took a long while since there were so many combinations). The portion sizes for each meal is generous and will definitely fill you up. I had the ramen and it was well flavored and filling.   Chef Papa gets an extra star for providing a large variety of menu items with the all important upgrade of a bubble tea to your meal for a couple bucks. Considering the price of things these days, it's a pretty good deal.   The service is the typical brisk efficiency that you can expect from a Cantonese cafe. We arrived on a Wednesday with a group of 10, and they were accommodating even though they had to rearrange some tables for us. The ordering system allows for easy splitting of checks!"}
{"text":"I saw their advertisement on Markham food Instagram and thought it looked interesting. My friends and I went there on a thursday night, good location and easy to find parking.   However, the dinning experience could have bee a lot better if it weren't for the bad service. This girl sat us down quickly without giving us any sort of acknowledgment. One of my friends had to wave her down 3 times just to get a cup of water, not to mention, she seemed pretty annoyed when we asked about the pricing of the food, as the menu did not list the price for certain food selections. Also, throughout whole time we're dinning, non of them came to check up on us despite it wasn't a busy night at all.   Service itself was already a downer.   I ordered the curry ramen with pork cutlet, portions were generous, but honestly the quality of the meat wasn't the greatest. If you're looking for super cheap ramen and you don't care about the service, I say its okay to try it out, but my friends and I will not return."}
{"text":"I brought my baby to try out this place on one rainy weekday afternoon. Not returning for the following reasons: 1) Terrible design of the restaurant: not at all friendly to mother with baby in bucket. I was told to take the booth seat by the window.  With mommy bag and a bucket which weighs 30 lbs with baby inside, I struggled to the booth only to find my bucket was too big to fit in.  Fine.  I then moved myself to the table seats next to the booth.  Table and seats were too close together and so I again had to struggle to get in.  By this time I was already sweating mad in my jacket. 2) Poor customer service: you would think on a non-busy weekday afternoon some staff at the restaurant would offer some help to a customer with her baby.  Nope! The staff were too busy talking with one another or with another customer.  I was totally ignored.  Then the menu and order sheet came.  It was my first time being there so I asked for some clarification from a staff.  She was not at all helpful.  I felt like I was being treated like a retard for not knowing how to order! She literally went 'here, you order just like how you would normally order with the choices you want!' and she left. Wtf?! And that tone of voice! I'm here to pay for food not beg for food! 3) Duration of time to wait for food.  It did not take long. But how come someone who came after me got their food first? Is it because they are regular customers and offered red packets to each lady staff? Am I in China where you give money and you get priority treatment? I don't know.  To be fair, noodles was good and the drink was ok. But I would not recommend mothers with baby like me to go back. I much rather go to Deer Garden that serves the same quality of food but have much better customer service."}
{"text":"I'm happy to see a new noodle place in New Kennedy plaza.  This place and Deer Garden look so much alike; pick the soup base, noodle, toppings and drink.  Even chili sauce comes in a small container and you have to ask for it; which is the same as Deer Garden.  There are more than ten soup base and over twenty toppings; so have fun in doing mix and match!  I have the fish soup with ramen, beef tendon and beancurd roll.  The fish soup is delicious and beef tendon is tender.  The beancurd roll has absorb the soup and it's soft and tasty.  Their Japanese style chashu is tasty and succulent as well.  Fast service!"}
{"text":"Food is decent but portion is small compare to Deer Garden.  Service is extremely slow even when the restaurant is not pack.  Drinks are quite sweet so ask for half sugar is a must.  Prob won't come back for awhile :("}
{"text":"Usually I would come here for their cheap afternoon tea combo which is the popcorn chicken plus a large panda milk tea for $5.99 i believe (don't quite remember the actual price). Although food is mediocre, The portion of the popcorn chicken is not bad. The biggest problem though is the service. I understand that it's a Chinese place, so we shouldn't expect too much for their service, but it always gives me a headache trying to flag down someone. That happened twice so far... If not, I would have gave them a 4 stars."}
{"text":"Nice lunch spot.    The menu looks complicated to me at first sight, yet I like having choices from Viet to Chinese to Japanese to South East Asian.  I like I can create unusual combination of noodle and soup broth. This was exactly what I ordered: laksa broth with Korean transparent noodle.  Laksa broth tasted rich and sufficiently spicy to me.  It was very creamy.  I liked how it overwhelmed the transparent noodle.  The portion of noodle was very generous.  For toppings, I selected pork and wontons ($1 extra).  Pork was good and fresh.  Wontons weren't so great.  I didn't think they were worthy of paying extra, so I wouldn't order it again.  Decoration is nice and clean.  I like that there are bar seats for solo diners.  Services is efficient and effective.    My co-workers like the selections and the bubble tea.  We will return for lunch."}
{"text":"The food itself was good and I liked that it came with a variety of options so you could build your own ramen. I had ordered a cold milk tea with my food and I realized it tasted a little weird and sour. I asked my friends to try it too and they agreed the taste was off. I waved an employee over and explained to them the situation and not only did he doubt me but he practically screamed \"Sour?! NO WAY\" into my ears. He brought it to the back where I am assuming him and the worker that made the drink tasted it because then he returned and claimed \"all the milk teas taste like this\". I found his response to be very unprofessional and rude."}
{"text":"If you are looking for noodles and bubble tea for a fair price, this is the place for you. At $10+ you can enjoy an asian experience.  The menu at this place is pretty unique since you get to completely customize your noodle experience. You select the soup base, type of noodles, and type of meats/vegetables. You have a variety of drinks to choose from and need to pay extra for the bubble tea. Theres also the option of sides which I would recommend the grilled pork or the chicken. (not the chicken nuggets tho)   The quality of food here is pretty good but your experience will really vary based on your choices. I had the shoyu poke bone ramen with the japanese cha su for meat and it was delicious.   The service here was decent and I personally don't think their bubble tea is that great. I would just go for the free drink that is included.   If you have problems making decisions like me, this place won't excite you. However, you might just fluke it and create a noodle combination you can't have anywhere else."}
{"text":"We came here for a quick dinner and decide to order a beef brisket noodle soup.  The place is small similar to to the Markham location.  The soup flavour is good and have similar taste compare to the old location on in Markham.  The beef is tender and noodle is chewy and portion is generous.  We then also had 2 mince pork rice for takeout.  When we open the take out we notice the portion is very very small.  If we had known, we would not order this dish for take out.  Overall is good if you go there for noodle, but I would skip the mince pork rice."}
{"text":"Newly opened so everything is nice and new. I was too lazy to look over the build it yourself noodle section so ordered from the chef recommendation section.   Hokkido chashu ramen $9.99 - noodles had great chew, soup was flavourful and not overly salty. Pork was soft and tasted great. Came with a runny egg just the way I like it. Added $1 for an iced milk tea.   Curry chicken cutlet udon $9.50 - the chicken flavourful with the curry sauce and had nice crunch to it even though it was sitting in the soup. Even though the curry sauce was put in the soup I liked how they put it on the one side of the bowl. So it was still a fish based soup with a curry dip for the chicken. Another great bowl of noodle.  Service was pretty good but I think they should try to serve the noodles for each table at the same time. I had finished half my bowl and my mom didn't even get her bowl yet. Other than that I think they have a good thing going here."}
{"text":"Love coming to this place with the variety of option of types of noodles and toppings.  Pricing is good and quality is good.  Love that you can pay a little extra for bbt.  Enjoy coming here for noodles and my bbt fix.  Also great to get little side dishes for inexpensive price.  The fried chicken nuggets remind me of Taiwan and the fried fish is good as well.  Definitely recommend coming here!"}
{"text":"3.5/5, +.5 for service  Chef Papa is owned by the same management as Blue Ocean Cafe, as the owner wanted to focus more on noodles and less on...\"everything else\". They don't do breakfast specials, so don't expect a decrease in business for New City. It was previously Congee Wong before it closed down a couple of months ago.  The menu setup is similar to Deer Garden, as many reviewers have already mentioned. However, I find the prices to be a bit on the high side, and honestly for the prices I expect excellent food quality. My shoyu ramen was $10.50, which is running awfully close to the standards I expect in Kinton/Sansotei/Santouka downtown.  I added chashu and cuttlefish balls to my shoyu ramen. Overall I was very impressed with the broth and chashu, as it was quite close to the standards you'd expect downtown. The cuttlefish balls and the ramen are the exact same as the ones in Blue Ocean, so if you've eaten either of the two across the plaza...don't expect much.  Service was excellent, and not surprisingly some of the Blue Ocean staff is manning this restaurant as well.  The high prices will prevent me from going as often, but overall I was very satisfied with my meal, and am especially glad a legit noodle place is now open at New Kennedy Square."}
{"text":"The reason I love this store is because you can build your own noodles! Create your own noodle bowl :) step 1 pick your soup base step 2 noodles step 3 toppings step 4 snacks step 5 drink from Presotea Chef Papa Tea & Noodle Bar ??? ?.?.?. High tea time starting $4.5up"}
{"text":"??????????????????????????????????????????????????????????????????????????????????????????????????  ??+$2.5 side order ?????????????????????????  ??+$1.99 side order?????????????????????$6-$6.5??????$1.99?????????  ?????$2.5?????????????????????bubble tea???????????????$2??  ???????$10.5?????????????????????????????????????????????????????????  ???overall ????????????????????????sides?????????."}
{"text":"This place is WAY over hyped... Had to make an account just for this  1.  portion sizes that are almost a mockery. The ramen and fish noodles we got had the smallest noodle base I have ever eaten... On Markham and downtown. For 10.50  It's half the portion size of deer garden and other competitions. Ordered Viet spring rolls (advertised 2 pieces) as side dish. For 1.50 or 2 dollars.. Guess what we got. ONE measly spring roll CUT IN HALF. are you kidding me? What do you take your  customers for? Absolutely ridiculous. These can maybe be overlooked if quality was good... But no chance  2. , quality is subpar. The broths tasted diluted when I was there. We couldn't even differentiate between fish noodle broth and Hokkaido broth... Broths were also lukewarm.... That's  kicking the coffin more. The chasu was not the one I was expecting and seems to be a different cut from the belly  3. Service at these noodle places are always non  existent since it's busy so I won't go too much into this... But service is def not a redeeming factor at all   This place cheaps out on ingredients and quality yet has the audacity to charge prices on par with the top ramen places in gta... Save your time (cause there's still a line!) and money."}
{"text":"This place has been my go to place if I'm craving noodles. The concept is the same as deer garden but I've had several disappointments there but not here. The food has been very consistent and I think that's important for a restaurant. I love the options available; my husband loves ramen and I love pho. So we come to this place to get both. I'm not a foodie so I'm not exceptionally particular with my food. But if you're looking for a decent place with a good meal, this is a place you should try."}
{"text":"If you like places like Deer Garden, you will love Chef Papa as well.  Pros: Unique set of soups for noodles You pick what goes into your noodles Presotea partnership  Cons: Service gets a little slow when busy  I personally like Deer Garden so I had to come here and give this place a try.  It's the same set up where you pick your broth, noodles, toppings etc.  Chef Papa though, has your traditional soups as well as two other sub categories.  They also have a Hokkaido pork bone base and Vietnamese soup base.  Each base also has several variations to choose from as well.  The toppings are pretty much the same with a few differences and you can choose side dishes and a drink as well with your meal.  I got the Hokkaido pork bone base with yellow think noodles and my GF got the original fish soup with udon noodles.  We got a side order of lemongrass chicken steak for our little one as well.  We came on a Saturday for lunch so it was pretty busy.  The food definitely came out a lot slower than Deer Garden.  The noodles were both pretty good.  I love having even more soup bases to choose from and I'm already thinking about coming back to try the laksa soup base.  The chicken steak was great, my little one gobbled it all up on her own.    For all you tea lovers our there, Presotea is also located here in a partnership.  I like the idea of these tea places teaming up with restaurants, I hope to see more of it in the future.  When it came time to paying the bill, I had to ask 3 different servers before we eventually got our bill.  It was very busy at the time so be prepared to for this if you come at a time it's busy as well.  I'm definitely a fan of this place.  This offer up even more selection than Deer Garden.  If you are as well, give this a try!!"}
{"text":"This place is new, so I'll forgive the mistakes. I came here with 3 other friends and it took forever for the food to come. My Laksa soup noodle with beef brisket and fish balls came first and it was delicious. The base had good combination of spice and coconut. My friend ordered almost the exact same thing - Laksa with beef brisket and beef tendon. I finished my whole bowl of noodles and his didn't even show up. I'm not sure why it took that much longer? My other two friends ordered a cutlet with curry on rice. Man, it took them another 20 minutes to get their orders. I was joking how the cutlet would be fresh and delicious instead of refried, besides its my turn to stare at them eat. Uhm, it came dry and dark in color. We had ordered a few sides and they all came at once after my friend and I both finished our noodles.All in all it was weird for everyone,because we took turns staring at each other eat instead of eating together. Our 4 drinks came at random times during our meal instead of all at once? I ordered less sugar with less ice, but it was still too sweet.   I'll probably come back in a few weeks when they've worked out the kinks and the hype has died down a little."}
{"text":"Mediocre food, cares too much about variety.  Of 4 orders gets 3 wrong, the servers are super rude when you tell them about it. Slaps down side dishes you didn't order and is super rude when you tell them you never ordered this in the first place."}
{"text":"I had to come here a second time to try other soup bases as they all sounded delicious...no bueno.  We ordered both the tom yum and the laksa soup base and neither of them were that great...stick to the hokkaido pork bone or classic fish broths!!  The tom yum flavour was there but it was too sweet...additionally, it comes with no toppings! Only a few slices of mushrooms and limes.  One word for the laksa soup...salty. Way too salty. There was no flavour other than saltiness...with a huge glob of chili oil over the top. One plus is that this soup base does come with an entire runny egg and some tofu puffs (ontop of your choice of two toppings).  The $1.99 popcorn chicken is a delicious snack as well as the roasted oolong milk tea. I will be sticking to what I know is good rather than trying other options next time!"}
{"text":"The service was almost non-existent when we came at dinner time. I tried their soup noodles(tomatoes with egg with Korean crystal noodles), and like many other reviews it's incredibly full of msg. It's a noodle bar style where you pick your own noodle, soup, and food that comes with it. The price to food ratio isn't very fair, I wouldn't suggest eating here, try lucky noodle or deer garden."}
{"text":"This new busy noodle and tea bar has great variety. Customers have the choice of picking a restaurant specialty noodle or rice, or customize your own.  If you're customizing your own noodle, you first pick your soup base, which determines the price of your noodle. Three main categories: fish soup, Japanese pork bone soup, or spicy soups (Singapore laksa, Sichuan spicy, etc) ranging from about $9 to $10.50.  Then you have the option of choosing your noodle, and 2 meat or vegetable topping to go on your noodle. It's a bit like the Hong Kong style \"little cart noodle\" but with a bit more variety.   The noodle portions are quite large. I was unable to finish it and neither did the person I went with. The restaurant is quite busy but it may be because it's still fairly new and people are looking to try it out. However, the wait to get in did not take too long.   Each noodle comes with a free drink, and you have the option of adding $2.50 to make it a specialty bubble tea drink. I highly recommend this as their tea is quite good and most already comes with tapioca, or pudding, or jello without having you add money for it. The fruit teas, we noticed real fruit was in it so that was quite a nice surprise. The great thing about their drinks is that it comes in a disposable cup already! So after this crazy filling meal, you don't have the pressure that you must finish your drink in the restaurant. You can just take it home! (And believe me, you will because you'll be stuffed already)  You also have the option to add snacks for a couple of bucks each. You can add popcorn chicken or deep fried squid balls for $1.99, dumplings or fried chicken wings for $2.49. It's a nice little option since usually appetizers at tea restaurants cost way more than this. This option is only available if you get a noodle though. If you're just going for drinks, there are snacks available that cost around $5-7, which is still not too bad.   All in all, food is decent...I won't say exceedingly great. However the options available to you definitely is a huge plus. The bubble tea drinks are excellent and I see myself going back just for the teas in the near future!   Because the restaurant is so busy, this is more of a eat and leave place. If you're looking for a quiet place to chat with friends over bubble tea, you're better off going to the nearby tea shops."}
{"text":"Really nice noodle house ... you get to pick the soup base followed by noodle type and what toppings you want. We got the laksa base With sliced beef and cuttlefish balls ... and the pork Katsu rice bowl ... plus the chicken wings side /Vietnamese fried roll and pork dumplings.  It was all good but we ended up taking home the wings since we couldn't finish it. The soup and rice dish comes with a drink as well .. we didn't upgrade our drink I went with the lemon and honey and my guy got the ovaltine! Really nice place will definitely go back !"}
{"text":"Decent ramen at a Chinese joint. Hope they make it long. Had the pork bone ramen, with. Cha shu and tripe delicious broth better than touhenb--- hands down. Enjoyed every drop of it! Noodles could be a bit better but all in all good addition!"}
{"text":"Came here on March 7th for my 18th birthday dinner with my family. I wanted to try this place out because 1. I love noodles and 2. I love the customization aspect of it. And I actually like ordering off a piece of paper. I actually walked in with the expectations that this place was going to be mediocre and it was. I think this place is quite overpriced compared to Deer Garden and there portions are so small. I made the mistake of ordering ramen noodles because you get so little compared to the Korean noodles. Anyways, I wouldn't come back so just save your time and money and go somewhere else."}
{"text":"I really want to give them 5 stars because the menu deserves it. There is no craving the Chef Papa menu can't fix. EVERYTHING is above average and they serve Preso tea!  Small, bustling restaurant. Tons of movement - large groups, pairs, servers swerving to take or deliver orders. Not only is the restaurant packed but the plaza itself is loaded with places to eat, meaning parking can prove challenging during dinner service.  Ordered Japanese Shinjuku Station curry rice with fried chicken cutlet ($9.99) and Hokkaido pork chashu ramen ($9.99). Their curry was especially tasty and on the salty side, served on a hot place. I enjoyed it more than the ramen.  Ordered side dishes seared pork-chop with Chef Papa special sauce ($1.99) and 3 pc fried five spice chicken wing ($2.50). The pork-chop was amazing!!! The sauce is savory and sweet. Now, the reason why I rate them a 4 instead of 5 is because when I bit into a five spice chicken wing that was absolutely cooked outside, but on the inside... when the bone was revealed the chicken was completely red and bleeding. Sent it back to kitchen and about 14 minutes later it came back out without spice. Our plates were done so we didn't bother to have them correct it.  Upgraded our combo drinks for an additional $2.50 each. Hokkaido milk tea was on point while the roasted oolong milk tea was understeeped and undersweetened despite no modifications.  All in all, love Chef Papa. Server rectified issue right away. I could have easily asked them to spice it but chose not to. Will be back!"}
{"text":"First time trying this place out today and it was AMAZING! The restaurant isn't huge but it has enough space.  The menu has so much variety! I've always been a fan of Deer Garden because I love noodles and fish soup, but this place definitely beats them in variety, and I absolutely love the tastiness of their soup base, tastes like home made soup! I love it.  The service is great and the food arrived quickly. It was served in excellent portions, and all of our orders with a table of 7 was served correctly.   I also LOVE their drinks here, will be back for bbt too!  I am one impressed customer! I will definitely be coming back here over and over again. They won my heart!!"}
{"text":"We saw the grand opening sign so we were excited to try!  It was a Sunday afternoon and we didn't know what to eat.  We got our table fairly quickly. The table was too small and the chairs weren't that comfortable.  Since it was our first visit, we were browsing the menu from top to bottom and we still didn't know what to order. We found it quite expensive compared to other fish soup restaurants although you just need to add little $ for the bbt. It is a better deal instead of buying a bbt on its own.  Do NOT order the special pho. It was nothing special at all and it cost me $9 whereas other pho places charge less.  There are too many fish soup restaurants nowadays.  It just reminds me of another Deer Garden.  Honestly, Deer Garden is much better."}
{"text":"This is what we like about Chef Papa: 1. It gives an option to upgrade the drink to Presotea for $2.5  2. Katsudon is delicious; the deep fried pork cutlet is suprisingly crispy and cooked nicely.   3. Original fish broth is tasty and is comparable to Deer Garden  4. you can pay a little extra to order two snacks with the noodles combo. We enjoyed the Honey chicken wings. Popcorn chicken is just okay.  What we would think they should improve: 1. Noodles portion is very small given we already paid almost $10 for a bowl of noodles.   3. Japanese Chasu is too thick and dry.  4. Black pepper fish broth is too salty.  Would I go back? Maybe... if I want to have noodles and bubble tea, I may consider going back. Yet, I will only stick with deep fried pork cutlet dishes and original fish broth."}
{"text":"[LOCATION] - 4/5 One of the many restaurants at New Kennedy Square. Just look out for the sign with a moustache logo, and the Prestotea banner.   [SERVICE] - 2/5 Average. We noted down our preferences on an order sheet and the server only had to bring the sheet to their kitchen.   [DÉCOR] - 4/5 Good lighting during the day, cozy at night, and booths are comfortable.  [FOOD QUALITY] - 2/5 Below average. We ordered two \"Create Your Own Noodle Bowls.\" Price varies depending on the soup bases.  [ORDER] - Create Your Own Noodle Bowl #1 had (1) Original Fish Soup Base (2) Yellow Tick Noodle (3) Vietnamese Sliced Pork Sausage & Preserved Egg - $9.50: soup tasted like water with MSG, noodles were nice and firm, pork sausage was standard, and preserved egg was just a poorly-cooked hard-boiled egg with a slightly runny yolk  - Create Your Own Noodle Bowl #2 had (1) Singapore Laksa Soup Base (2) Fresh Rice Noodle Ho Fun (3) Chef Papa Fresh Made Fish Puff & Beef Tripes - $8.99: soup was not creamy enough, noodles were soggy, fish puff was pleasantly spongey, beef tripe was standard and a little chewy.  [OVERALL] - 2/5 I would not recommend this place because the soup bases, a key component to soup noodle bowls, lacked their authentic flavours. Unfortunately, the menu also tried to incorporate too many cuisines (Chinese, Vietnamese, Singapore, Japanese, etc.) and resulted in very mediocre food as a whole."}
{"text":"A Taiwanese and I guess Japanese-fusion attempted restaurant. The menu is a decent price for the quality and quantity you get. They are partnered with Presotea so you get your dose of bubble tea here too. People big on meat might wanna try their Taiwanese meat rice - it is literally covered in meat and portion is pretty big. The meat is not overly dry - theres enough sauce and a bit of fat in the meat. You might be a bit full to finish your bubble tea so its a good idea they put it in a take out cup. Cant guarantee I'll be back soon but its convenient and a clean place to eat at, service is also courteous too."}
{"text":"Have had both the rice combos and the ramen, both quite good. Food usually comes out pretty fast.  Only downside is the bubble tea usually isn't good.."}
{"text":"I mean there's nothing really extraordinary about this place.  Food: There's 3 main kinds of noodles: japanese, chinese, and viet pho. You get to choose the soup base, noodle type, and 2 toppings. I think it also comes with a free drink (aside from presotea which is like $2 extra) but I got charged an extra dollar cause I think I ordered it iced instead of hot. I guess with so many combinations available, I didnt know which topping or noodle suited the soup base more so I was trying to go by the pictures they had. It's kinda expensive ($10) for some pretty average noodles.. The bowl was pretty filling.   Service: What is a little different about this place is that you can write on the menu with a whiteboard marker. The menu is a little confusing to read (kind of like a scantron lol) since there are so many sections to need to mark down. It was my first time here but the lady was a lil sassy when I forgot to checkmark one section of the menu.. And I could have gotten a heads up that iced coffee is extra.... :c  Decor: area is typical for a Chinese HK Cafe. I don't really like how it shares the same space as Presotea though."}
{"text":"Been here a few times for lunch and dinner!  I like the food here and the service is not bad. I come here usually because it's a convenient location but if I really wanted to go eat vermicelli then Phoenix is still the best!  I love how you get to customize your own noodles and also how you get Presto Tea! Bubble tea ftw~^^  I also really like their soup bases~ my personal favourite is the tomato and egg super yum~^^  The service is ok, nothing special but some staff only speak mandarin so I had a little trouble communicating :$  Their prices are actually quite high compared to other restaurants, it was over $30 plus tips for 2 which is expensive for just two bowls of noodles :(  Anyways, this place has 3.5 stars from me and its not bad so give it a try! Will probably only come when I'm too lazy to go anywhere far :P"}
{"text":"I cannot believe I have this 180 opinion of Chef Papa after 2 weeks.   I have came here 5 times in the last 9 days.  Each time gave me a variety of experiences that led me to give CP 2 stars.  First off, there is about a 10% consistency with the food here.  They tend to forget toppings or side dishes.  & sometimes they don't make any sense.  Yesterday I went with my mom and she ordered a milk tea with no sugar.  They gave her an XL and said that the polycups cost $.50 more & even though they were going to give it to her for free this time ... they might charge more next time.  My mom never expressed that she wanted a polycup or an XL & they did add it to the bill?  The miso soup here is 50% of the reason why I downgraded.  My sister got a bowl about 5 days ago and the flavour was perfect.  My boyfriend got one yesterday and it seemed like they dumped 10 pounds of flavouring in there?!    The food also makes me feel nauseous after I eat.  The first time I thought I was just overfilled but whenever I eat here my stomach has this queasy feeling that I get after eating something that's about to expire.    I'm going to give this place a rest and try Deer Garden soon!"}
{"text":"We come here for the Singapore Laksa! The portion is huge and extremely flavourful. There's different soup bases, noodles and toppings you can choose from (2 toppings free then additional charge if you want more). You can also get bubble tea (Presotea) when you order a main for cheap and small sides for cheap too ($1.99-$2.75). Whenever we come for dinner it's always a full house.   Service is quick- food comes out almost right away. Servers are attentive and quick to your requests, however they speak limited English, mostly Mandarin or Cantonese only. Not really a problem as you order from writing down on the menu and checking what you want.   I would recommend trying the small sides with your meal! The Vietnamese lemongrass chicken and Taiwanese chicken nuggets are delicious."}
{"text":"I've been here a couple times now and tried a few of their dishes. My two favourite things about this place is 1. The menu is easy to order from 2. You get to order Presotea with your meal!   Curry Pork Cutlet w/Rice - Delicious! The portion was good, the pork cutlet was crispy and fresh, and the curry was extremely flavorful. This is my favourite dish here.  Tom Yum w/ pho noodles - I'm a big fan of Tom Yum but this dish was a huge disappointment. The toppings were...Wait toppings? What toppings? The 3 pieces of tiny mushrooms and a few slices of lime?! The soup base was too sweet and there was not enough soup.   Fish Soup Base - Their \"MSG free\" fish soup was very comforting and delicious. We had ramen noodles with it which was a weird mix. I'm thinking vermicelli would have been a better choice.   Curry Pork Cutlet Udon - The curry in the soup was not as flavorful as I'd expected it to be. It was mostly water with a light curry taste. The pork cutlet should've been served on a separate plate because within a few minutes the pork cutlet got too soggy.   Service here can be quite slow sometimes, especially since they rarely come by to ask if you need anything. Overall, it's a decent place to go eat if you're looking for something cheap and satisfying."}
{"text":"As others have mentioned, the concept is similar to Deer Garden but I find in general there are alot of noodle bars popping up around in Markham now.  Decor and service: -Modern looking interior with booths, tables and a long bar (which you can sit as well facing out to the north). The booths are nice but they probably max out at 4 people. -We went on a Friday night around 730 and got in with a 5 min wait for 2 people but afterwards the lineup really filled up. -I liked the marker idea for the menu - as you use a washable marker to pick your soup, noodle, toppings and etc. Makes it easy for changes ;)  Food -They have quite a variety of soup, noodle, topping and snack choices. It is almost a bit overwhelming at the first! -We ordered 2 noodle combos: fish soup with rice noodles, mushroom and wonton; laksa soup with yellow noodles, chasu and taiwanese fish balls. For snacks, we got the pork chop special and taiwan chicken nuggets. -Noodles and soups were great. I loved the Laksa flavour - a bit of spice but most coconut curry. Yellow noodles were the perfect combo. The chasu and fishballs tasted good as well. For other one, fish soup and rice noodles were a more mild flavour but still good. However, we found the portions of the mushrooms and wonton was a bit small. For the extra charge, it didn't seem like the wontons were worth it? -Snacks - when they served it, they kinda looked a unimpressive. A small pork chop cut in to slices and a small box of chicken nuggets. However, don't let the looks deceive you - the pork chop tasted awesome! And the nuggets were a hit as well! Perhaps if they change give you a bit more that would be good but otherwise I would recommend both snacks! -Drinks - we ordered the cold milk tea which came very fast.  In general, we liked the place and I will return to try other combos as well. If I were comparing it to Deer Garden, I may lean a little towards Deer Garden as they have more \"free\" toppings in their soup. But Chef Papa has a shio soup with ramen which I don't think Deer garden does."}
{"text":"Came with a friend at 12pm to lunch, I ordered Taiwanese pork rice bowl, she ordered instant noodles bowl with beef and pork.  The meat tasted fatty and flavorful, but the rice was average and I think I make better rice at home. My 3 complaints are 1)the draft over our booth was so cold the food got cold quickly, 2) the cups for warm drinks is really small and child-size and 3) our food did not come to the table around the same time (i.e. within a minute of each other or the same time is acceptable to me) -- I dislike going out with friends and having one of us \"start eating first\" while the other is still waiting for food because it feels impolite, awkward, and throws the balances of equal enjoyment and conversation."}
{"text":"Ordered the ramen noodles (+$0.75) with fish noodle soup base.  I'm going to compare this to Deer Garden as that is my go-to noodle place. I like how Chef Papa allows for the choice of ramen, and the texture was good and didn't get soggy (as with some other noodle choices), but I didn't like that they charge extra for this. The soup base was really flavorful and rich, but I ordered fish soup to be somewhat \"healthy\". They say no MSG in the fish soup base, but I'm a little skeptical as it did taste much richer than the one at Deer Garden. I like the option to upgrade to a Presotea  as I do enjoy their drinks, however I was already so full from the noodles, I barely had any room left for the BBT, good thing it comes in a takeaway cup.   All in all, this is probably a toss up b/w Chef Papa and Deer Garden. Chef Papa has more menu options, but I still prefer the fish noodle soup at Deer Garden.   The place was also clean and service was ok (nothing special, but nothing bad)"}
{"text":"First time eating here, but it's a similar experience to Deer Garden Signatures over at Silver Star Blvd. No need to repeat how the menu works since I'm sure others have covered that. I walked in for lunch around 1 pm on a Monday and we were seated immediately. I'd estimate it was about 80% full at this hour. We took some time putting together our noodle bowls and only had to wait about ~10 minutes for the food to be served. The food was good - no complaints there."}
{"text":"This place reminds me of Deer Garden but a cheaper version. They have a variety of noodle options and bubble tea type drinks as a combo meal. I thought the food was mediocre and I prefer the broths at Deer Garden. The drinks were also not that great, and half the drinks on the menu were not available for some reason. Probably wouldn't come back again as there are a lot of better alternatives for noodles."}
{"text":"3.5 Star + 0.5 Star for able to upgrade to Presotea Drinks for $2.50  Self Choice Combination Noodle Combo sounds familiar? With the success of Deer Garden, a lot of restaurants with the similar concept has been popping up all around Markham. And Chef Papa Tea & Noodle Bar is another new comer to this concept.  I do like how there is more than just noodle or fish noodle based option. Aside from fish broth, there are also Hakkaido style pork bone, Szechuan Dan Dan, Tom Yum, Laksa, Szechuan Spicy and even Vietnamese.  And if you rather has a rice dish:  Vietnamese Lemongrass Pork Chop/Chicken, Taiwanese Stewed Pork, Japanese Curry Pork Chop and more.  I think the selling point is really the option of upgrading the free hot drink that comes with any meal to Presotea drinks for $2.50 if you like drinking Taiwanese tea. There are 10 different options to choose from.  Hakkaido Cha Siu Ramen ($9.99) + Passion Green Tea (w/ Pearl and Coconut Jelly) $2.50 - Cha Siu was a little bit dry but the ramen was well cooked with a little chewiness. The Pork Bone Soup was quite flavoured and rich without being overly salty  Japanese Curry Cutlet with Rice ($9.99) + Royal Earl Grey Milk Tea Family (w/Tapioca, Grass Jelly & Pudding)  $2.50 - Nice crispy crunchy batter for the pork cutlet. Curry sauce was really rich too  Of course we were such a happy camper taking our drinks to go and enjoying that as dessert later. I love pearl, grass jelly, tapioca.... and more.  I will come back and try their fish soup based option next time but Chef Papa seems to be off to a good start.  Pro Tip: request your Presotea Drink less sweet or less ice when putting in your order.  Cash Only!"}
{"text":"This is my favourite noodle place in Markham! My go-to's are the laksa and ramens, and their fish puffs are simply to die for! The presotea is also a nice touch. My favourite there is the passion fruit lime with aloe drink. This place never fails."}
{"text":"i think this place needs some work, im talking about everything.  including the wallpaper that is peeling off the corner of this place....also the urinal that is awkwardly positioned so when you open the door you are standing uncomfortably and awkwardly close to the person pissing.. (rubbing shoulders)  let me start with the service... i came with a table of 6.     after we ordered, the food came in the wierdest order and sooo spaced apart.  I was completely finished my noodles and drink by the time the 4th person got their noodles.  luncheon meat and red sausage were first to come out... about 25 mins before the noodles came.  so they were cold and dry by the time the noodles came with that order.      We ordered 4 extra side dishes.   which the waitress double confirmed with us because we marked it on one sheet and she said we can only select 2 items per order.. we told them we have 6 people and only 4 side dishes.  she then said okay that makes sense.    at the end of the meal, only 1 side dish came.  Nothing else.  the whole time we were waiting.  at the end of the meal we got the bill and told her nothing came out.  she said oh i forgot to put in the order.     How is that even possible?  its really dissapointing.  btw the menu says chefpapa tea - cold milk tea as an option.  I thought this option was free and would not cost more.  as it was not in the additional cost menu and only comes cold.   just a heads up.. it cost 1 dollar extra.  very misleading in the menu.  (also its about 85%-90% ice).  that being said, i ordered the tom yum flavored soup noodle and it was not bad tasting and mine came out first.  so i cant complain about the speed too much."}
{"text":"I love how this ramen restaurant provides many options for how you want to customize your dish. The dish I customized tasted amazing. The variety of flavours bursted in my mouth and it was pretty satisfying. Although the meal was great, the atmosphere wasn't as great. The staff working there were talking way too loud as if no one was there when there were like about 15 customers trying to enjoy their food. If they didn't talk as loud, the food would've been even more enjoyable."}
{"text":"Great service. I love the idea of building your own bowl, I got udon noodles that tasted fresh and a very tasty bubble tea that went along with it. I plan on coming back for more :)"}
{"text":"I've been to Chef Papa Tea and Noodle Bar twice now and the food I've had has been pretty decent both times if you manage to make it past the overwhelming menu. From the small font to the amount of options on the sheet, the menu makes the ordering process frustrating and makes me only hangrier. However that is probably the only thing bad thing I can say about this place. Everything else (service, ambience, etc.) was average  TL:DR - Relatively decent food for the price, a hassle to order, average service."}
{"text":"A great option for ramen! I particularly liked that u can customize it... Broth, noodle & toppings. I had chose the ramen noodle with tom yum broth with bak choy,egg and shrimp wonton toppings. We also got a side of chicken karrage... Which is essentially popcorn chicken... That was great too! Husband got the pho... It was ok. We have definitely had way better... But their ramen was on point which was what we came there for anyway. Price was fair and would return."}
