{"text":"What a dump.

This place was already fighting for an \"average\" rating - poutine with cold cheese and soggy fries, cardboard pizza, miserable depressing Cold-war era ambience, creepy stares from the people who work there, and then this happens:

I stroll in at 2 AM looking for a poutine and smoked meat sandwich. If you buy them separately, it's $20, but they have a Couche-tard menu that features a poutine and smoked meat sandwich as a combination for $9.95. So I order that, and so does a buddy who's with me. 

When the bill comes, it's over $20 a person. I mention this to the waitress: \"Isn't it $9.95 for the smoked meat sandwich/poutine combination?\" To which she replies \"Well, you ordered the smoked meat sandwich and poutine. To get the special, you had to order the smoked meat sandwich AND poutine.\" Obviously I tried to point out the idiocy of her argument and suggested it was in bad faith to navigate the customer to the same dishes at the higher price.

So at this point, I'm realizing that arguing with a girl who accepted $4 an hour to wait tables at this asshole-of-despair shithole in the middle of the night is like engaging in a philosophical discussion with my dog, so I tell her to forget it, and bill me whatever she wants. 

In a stroke of genius, she decides to go ahead and bill us both $9.95 as opposed to $20. Too late, Chenoys! Damage done. Good riddance desperate shithole, enjoy obscurity."}
{"text":"Normally I would never give a dump like this 2 starts. 

I wouldn't be caught dead in here during the day or for dinner. It's absolutely gross. The haven't renovate or cleaned anything since I was 5 years old and there was only one lachapelle bridge (Christ I'm showing my age now). The place sucks, the food sucks, the service... Omg the service. Same old German waiter since 1963. 

BUT... When I'm hammered and I'm hanging with friends in my old stomping grounds of Chomedey, I suddenly need to go there for that 3am smoked meat poutine. I'm sure it's horrible, but it's more of a nostalgic thing. And who cares, I won't remember the taste, I won't even remember how I got home!"}
{"text":"I haven't been to Chenoy's in well over a decade and I couldn't recall why! Perhaps it was because I listened to the masses of the mundane and started frequenting popular smoked meat places I've been told to visit in Montreal, many of which have fallen far short of their reputation. Ultimately, despite this place's poor reviews, I begrudgingly visited this original Chenoy location twice in the past month and it'll probably end up being on my personal list of regular lunch spots going forth.

The lunch menu is solid with many decent choices to go with. I went with the deli's smoked meat on both occasions. I prefer my smoked meat lean and the quality of smoked meat I got was exceptional. No traces of fat, it was silky smooth, tender and flavorful... the smoked meat was thoroughly enjoyed! The only difference to my meal on both occasions was the side order. The first time it was a poutine the second time it was fries and while the poutine is nothing to phone home about, it was still pretty decent. The fries though are perfect deli fries.

The price-tag is exceptional. Both times my meals cost me significantly less than I'd probably pay for going to other smoked meat establishments in Laval such as George's and Dunn's. I won't even both talking about options in Montreal. The service was friendly and quick with no issues whatsoever.

Previous reviewers were very harsh and called this place a dump. What smoked meat place that's been in operation over a few decades do you go to is an esthetic masterpiece? Is the place well worn over the decades, absolutely! However, the tables are clean, the food has no issues and quite frankly the term \"dump\" should be reserved to specific places that should cause issue to your health not because you don't find it pretty. The term I'd use is that the place is \"well-worn\" or \"vintage\" with a feel that makes it feel more like a cabin up north than an actual restoraunt. I actually prefer it like this. 

I once ate inside and the other time on their terrace, called 'tiki bar' and both times, it wasn't dirty or sad... perhaps they saw something I didn't after a drinking binge at 3 AM? Who knows but either way, quite the exaggeration and the only dump I see is what I previously read on this place.

I'll definitely be back, the smoked meat and price-tag that comes with it are great."}
