{"text":"Great food. This place has many choices and the food is delicious. I enjoyed the experience of dining in twice. Very clean restaurant and I appreciated the live piano playing. It's a simple decor but I like that. It's tastefully done. I'm so glad they opened. Just wish they would deliver to Gilbert :). If you like spicy flavorful Chinese food you must try this place. You won't be disappointed."}
{"text":"Amazing! Food is authentic and inexpensive, the staff is wonderful, and the interior is well decorated. I enjoyed every aspect of my experience here and will come again!"}
{"text":"This is the first time that we ate at this place and I must say that it's a must try food if your looking for a delicious Chinese sit down restaurant, Yen was our server and she is very friendly and accomodating with fast and good service. We ordered Seafood Soup, that hit the spot, Spicy Kung Pao Chicken was so delightful and Pork Belly with Mushroom was excellent as well. The prices is affordable, the place is nice, neat and very clean with great atmosphere. I will be coming back to try some other foods that they offer at their menu."}
{"text":"Good food.  It is always hard to find new places when you are new to an area. Authentic Chinese food!"}
{"text":"I believe this is the most authentic Chinese restaurant in AZ area. Large portion of the dish. Reasonable price. Good serves and clean environment. I would highly recommend my Chinese friends come to this place."}
{"text":"Very Nice! Recommended by a friend, today I called a get-together lunch for 12 friends. I appreciated the owner and chef's warm interactives. Very nice family style menus, no matter you choose spicy or mild."}
{"text":"Great place, servers are very friendly and helpful, food is wonderful! We're not Asian but we've been to China a few times and we love Chinese food, not Americanized food, although it's not bad once in awhile. If you like hot and spicy food, you'll love this place, better than the other Sichuan restaurants in the area. Best West Lake soup we've ever had!"}
{"text":"This place is awesome.  The best Chinese food we've had in the area, bar none.  My wife and daughter are from China, my wife is a great cook, and she raves about this food.  We drive from North Phoenix to eat here, it's that good.  Don't believe the one star reviews about bad service, I believe it's contrived.  We've been served promptly every time, and the owner is very friendly, visiting every table personally."}
{"text":"After seeing this place pop up under the hot and new section I figured I would give it a shot! A good Chinese meal will always hit the spot but unfortunately this place completely missed that spot. Service was bad and the food was unseasoned and mediocre at best. The pork belly and pickled vegetables were basically soggy thin slices of bacon with tasteless water logged vegetables. The steamed white rice that accompanied it was cold. The hot pot looked great but was a huge let down. The pot was bond and lacked any seasoning. Servers could care less about checking up on us and I ended up moving my water glasses next to the flame of the hot pot in hopes it would melt the ice so I could have some water to drink. Seemed chop sticks were handed out based on the tone of your skin and I can only wonder if the service and food was also handled that way. Will not return."}
{"text":"The worst food I have ever tasted at a Chinese restraint. It was hot as hell in there. If you want a good Chinese restraint go to chef cheing.  This is place in zero stars"}
{"text":"The food is good , the waitress are very friendly , even they forgot my drink, it's ok they are busy, they keep saying I'm sorry in Chinese , I say don't run take it easy ,I feel comfortable inside , I will be back with more friends."}
{"text":"I recently had a destination wedding and needed a place to have a home wedding banquet for those who couldn't travel.  Chengdu Delight was able to serve 140 for my private event with some alterations to the menu.  Some of my guests are sensitive to spicy food and I requested that some dishes have little to no spice.  The owners were very accommodating and the dishes they served were phenomenal!  We had ten dishes with 10 people at each table.  After everyone finished eating there was still lots of leftover food!  Service was quick and fantastic.  The waiters were attentive and friendly.  My mother raved how clean the restaurant looked!  Before my wedding banquet, I dined at Chengdu several times and love their menu!  Some of my favorite dishes include special mushroom, yu xiang eggplant, spicy water boil fish and beef, crab with ginger and onion, and braised pork belly.  Chengdu exceeding my expectations making sure me and my guests were well taken care of.  I highly recommend this place!"}
{"text":"Most authentic Chinese food I've ever had!  Everything we ordered was fresh and the service was great."}
{"text":"Best Sichuan food I have had in a very long time. As good as the best in San Francisco Bay area and San Gabriel Valley. The food was excellent, and the service and ambience were fine."}
{"text":"Awesome family restaurant with fresh tasty food! We had the Yangzhou style fried rice, spinach ingarlic sauce, beef with green onions, and shredded pork with green onions.  Everything was excellent and light.  No heavy oily, greasy food here!"}
{"text":"I always come back to Chengdu Delight for the Cumin Lamb.  I have not had a lamb dish this good anywhere else, and every friend I've taken here to try it has loved it also.

Service can be a bit on the slow side and maybe a bit of a language barrier, but the food is so delicious that it's hard to care especially when there's been no time issues between seating, ordering, and food delivery (only had to flag someone when it came time to pay)."}
{"text":"Clean and beautiful restaurant, welcoming staff, fresh and very spicy (Szechuan) food. 

We ordered watermelon drink (sooo refreshing in the summer heat), garlic cucumbers (delicious and especially cooling with all of the spicy food), lamb with cumin (delicious, and the cumin came through despite the abundance of chili seeds), pork belly with dried mushroom (floating in red chilies... ouch!), beef with jalapeno (expected this to be spicy), and orange chicken (really fresh-tasting orange sauce and the only non-spicy item).  Everything was very fresh tasting, and the portions were generous, but boy was it spicy, even with a request to tone it down to \"medium\".  The servers were all so polite and helpful.  I would definitely return but I will choose a better balance of dishes so that my tongue doesn't catch fire."}
{"text":"Great food. This is the second time we've been and the food was just as good as the first time. If you are looking for a some authentic Schezuan cooking this the place to go. Nicely priced, too!"}
{"text":"The food was fresh and service is Wonderful!!!They even sang the birthday song to my mom!!  Thank u guys!!"}
{"text":"The worst Chinese restaurant I have eaten in town. Rude server, bad food which made me sick. It took me about two hours to get the food. I have ordered the spicy crab which is soggy and soup is cold. The dumplings are directly from the Chinese supermarket. All in all, forget about this place. Never come back"}
{"text":"My husband and I were out and about and found you guys! Truly friendly staff, who were the nicest people we have encountered in awhile! The food was AMAZING, and a really good portion! Enough for leftovers! We will be back many times! Thank you for an AMAZING date night"}
{"text":"When in Chandler and craving awesome, authentic Chinese food, this is the place. Tofu in soy sauce, green beans, sweet and sour seaweed, garlic cucumber, moo shu pork, orange chicken, sauteed special mushroom."}
{"text":"Literally the newest best Sichuan food in town."}
{"text":"I always chase a chinese restaurant that is authentic and offers high levels of spiciness.  So I made the trek and had the following:
1.  steamed pork dumplings:  Fresh, meat was tasty, dough could have been thinner.  Served in a bowl swimming in a broth/dumpling sauce.  That was a first for me.  I have always been served the dumplings with dumpling sauce on the side.  Unusual but still very good.
2.  Walnut shrimp:  Excellent dish with 14 nicely sized shrimp.  Really loved the dish. 
3  Pork (something dish):  We requested high spiciness and didn't get it.  Pork was fresh but I think it lacked something that would have made it saltier.  It was just OK.  The pork was sitting on a pool of orange colored oil.  They seem to use that oil to spice up their dishes. We had to drain the oil in order to eat it.  
4.  Lamb with Cumin:  The person who ordered it thought it was just OK.  I could smelled the delicious cumin and asked to taste it.  I am not a lamb eater but I thought the meat had a wonderful taste and the cumin made it taste exotic--almost like indian food.  
5.  Spinach with garlic:  Freshly made spinach with just the right amount of garlic.  
The service was super attentive with waters constantly being refilled.  They were also helpful with the selection of our dishes since it was our first time here and we had questions.  
I I gave it 4 stars because I found the pork dish much too oily.  I think that future customers should be aware that when they spice things up they use the \"hot oil\" to do so."}
{"text":"Love this place! Best Szechuan restaurant in AZ. They have authentic food and fake Asian. I personally only order things authentic, as does the Chinese BF. Everyone I go with is pretty much not vegan, but I personally have only ever eaten their vegan options. If you want vegan just ask for mapo without meat or any of the veggie dishes. They'll tell you what they fry stuff in, and you don't have to worry!"}
{"text":"BEST Chinese food in the Valley! We drive from N Scottsdale area to eat here...even on a weekday after a looong day at work, when you just want to relax and eat somewhere nearby....Nope, we drive a 1/2 hour for their delicious food! 
We've been coming here over a year now and their service is way better than most Asian restaurants, and their food is not as greasy as other Chinese restaurants! 
Boiling chicken is yummy...even for someone who doesn't like too much spice. Love the Garlic Spinach, Walnut Shrimp and their Shrimp fried rice. I can go on and on which dish is good... You just have to try it for yourself!"}
{"text":"I've been to the restaurant several times. At first, the food was OK. But it became worse and worse over time. They changed cook? Will not go there any more."}
{"text":"Wow other reviewers were not kidding when they said the portions were huge. You can get at least two meals, maybe more, out of their meat dishes. I ordered hot and sour soup, dumplings in chili oil, and chicken with jalapeño for carry out. I didn't have to drive very far but everything was temperature hot when I ate it like I had been served in the restaurant. I probably ordered the most Americanized items on the menu but everything was delicious and good quality. The only potential negative was that the chicken and jalapeño seemed a bit salty after a while. This is yet another great new restaurant in Chandler and I'm sure I'll be back often."}
{"text":"I went there last night with my wife and in-laws and found we were the only customers. I normally do not feel that it is necessary to write reviews... I am more the person that reads reviews; however, for selfish reason ( want them to stay in business) I am compelled to provide my feedback. I ordered the potstickers both regular and the ones soaked in chili oil... Excellent. Chicken fried rice... Very little seasoning ... Excellent; chicken chow mien ....above average....beef with green onions...excellent; orange chicken....very good. Fish with black beans....not sure if they mixed up the order...very spicy with an ton of tofu....phenomenal ! I hope more people try this restaurant out....price may seem slightly high; however, the portion were generous."}
{"text":"The food here is amazing! This is not the \"Panda Express\" Chinese food you find everywhere but rather authentic Chengdu cuisine. 100% recommend if you like real Chinese food"}
{"text":"Wow! So happy to have found this place today. Food was awesome, and the service was kind. Ordered the hot pot which was perfectly seasoned and spiced. The portions were extremely generous and the quality of meat was very good. Not usually a big fan of tofu, but the chunks of tofu mixed with the chicken, beef and shrimp was perfection. We got our little one some chicken chow mein and it was fantastic. Not too greasy, but had great flavor and texture. We also had a pitcher of watermelon juice, which was refreshing and cooling. I was really blown away. All three items were a 10/10! I'm not easily impressed when it comes to Chinese. It usually tastes like it was frozen and drowning in sauce and or msg. Not here, totally authentic and fabulous. I cannot wait to go back and try other menu items. It will be difficult not getting the same items as I did today. Absolutely delicious."}
{"text":"I have very mixed feelings about leaving this review. The reason: this is like my own, personal, amazing Chinese restaurant. And I don't want it to get too crowded! On the other hand, I have to give credit where credit is due. The food here is awesome. The jalapeño chicken is my absolute favorite, and I eat it three times a week probably. This is the kind of place where most of the guests if not all of them appear to be Chinese. That is usually a pretty good sign that you have an authentic Chinese restaurant. 

So at the risk of this place getting too crowded, I'll let you know that this place is amazing."}
{"text":"While they have a few basic dishes you'd find in any Americanized Chinese restaurant, they serve a great selection of Chengdu cuisine along with popular dishes found in many other provinces. After living in China it was surely a delight to see how many dishes I've missed right there on the menu. I'm definitely coming back to try more! And our waiter was superb and attentive."}
{"text":"From the outside it looks like your typical Chinese restaurant but don't mistake that as your typical average food. It is very clean and spacious. The staff are always on point making sure drinks are always filled. Food is quick to be served. Most importantly the food is absolutely delicious!!!"}
{"text":"Loved this place! Not generic American Chinese food. Loved the ma pow tofu (excuse my spelling ) and the fried bean curd was fantastic as well. There is ton to try here, and it's my new go to Chinese for now. My bf is a meat eater and loved the meat dishes. They accommodated my Vegan diet well."}
{"text":"This would have been five stars except for a bad experience with one of the younger waitresses on one occasion. She was obviously prejudiced against my Filipina wife, to the point of being rude. We asked a bout a spicy dish on the menu, and she told us told it could be made mild. When the dish arrived, it was inundated with red pequin peppers. We pulled out and counted 83 peppers. The meat was ruined and inedible. This had to be purposeful.
 When you are in the restaurant business, keep your prejudices at home. White customer's dollars, Filipino customer's dollars, etc are just as good as your Chinese customer's dollars."}
{"text":"Great Sichuan food. Very fast and great service. One of the best fu qi fei pian in the Phoenix area. Their cumin lamb is also great. Get their dan dan noodles spicy. Interior is very clean and with nice decor. Very spacious and not loud."}
{"text":"If you are into spicy funky food (a more traditional Chinese fare), or just like traditional American Chinese food, they have you covered. If you can tickle the ivory you may be able to double down. Hello, grand piano! 

Spicy pickled pig ear. Cold marinated beef tripe and tendon. Yes please. 

Bring your own bag of tea and they will happily brew it up for you. No charge. 

Go hungry and enjoy."}
{"text":"Closest thing to real Chongqing-style hotpot I can find in the Valley (it is served more like a stew over a flame, but the flavors are what I remember from China). My Sichuan friends love it. BYOB. Usually only one table in the whole place speaking English, so I must not be the only one who thinks it's authentic. Love the Ma Po Tofu as well."}
{"text":"This place is great the atmosphere is good the waiters/waitresses were attentive and nice. The food was delicious and came out at a good speed the price was fair for the portion sizes only thing that was bad and it was a small thing the staff seemed nervous but I believe it is due to the fact the restaurant just opened give them time and they will shine."}
{"text":"Wonderful Chinese food, a taste treat for the tongue. Possible the best Chinese food in the Phoenix area. Best dumpling ever, thin dough and tasty meat interior, absolutely delightful."}
{"text":"Warning: if you fear greasy food, this is not the place for you.  The food is very tasty and flavor-packed but all are sitting on or submerged in pools of excess oil which to some people is delicious - that person is me...most of the time.  The flavor is so strong that I suspect abundant MSG is a factor.  We ordered the traditional Hong xiao niu rou mien (a type of beef noodle soup) and it was probably the tastiest in Phoenix since none are very good here.  Chou's kitchen has a decent one as well. The fermented wine fish dish was much better than the description - doesn't actually taste fermented. The other stir fry dishes were all good and spicy Szechuan style.  The portions are big as well.  Good for a once in a while beef noodle craving but definitely can't drink oil on the regular."}
{"text":"Food is fantastic.    We ordered crab with ginger and scallions (cantonese style), orange chicken and kung pao beef.    They have an  \"A\" rating proudly displayed upon entering.   Staff was incredibly efficient and friendly.   hUGE portions.    This is no doubt our new chinese restaraunt."}
{"text":"We use to come here a long time ago before this resturant changed names and we loved it.  This is our first time back in years.  We move a distance away and because we are closer we thought we would try it again. Even though the pictures I took looks like this resturant  is empty.  We got here around 5pm, in fifteen minutes this resturant  was packed.  The food was outstanding! !!!! Just the way Chinese is suppose to tastr.  The waitstaff  is spot on. At our table right away, answering questions about the menu and  very polite.   Will we be back?  You bet!"}
{"text":"Unexpected great service.  Loved the authentic Chinese dishes.  Definitely recommended."}
{"text":"I am so happy to finally find an authentic szechuan place that's not too far from Mesa! We have tried the lamb and beef cumin, water boiled fish, green beans (with added \"ma\" numbing spice), ma po tofu, large intestines, dan dan noodles, and the pork belly/pickeled vegetable soup, ALL superb except the soup which was still good, but not mind blowing. They serve family style, so their prices are a great deal. Their atmosphere is classy and decorative if you're looking for ambiance to pair with a delicious meal. Their dishes are served quickly too. They also let you byo alcohol and tea! Super friendly staff, literally could not ask for more."}
{"text":"Looking at this building from the outside I was not convinced this was going to be a good experience.This place was recommended by a colleague, last minute, and I didn't really have time to research it at all. So I took a chance and I am very glad I did. 

No only is this place beautiful inside, the food was great. The lunch specials are so affordable it makes me question how this is at all possible. This place is really a hidden gem, but according to these yelp reviews everyone already agrees about that. 

Give this place a shot for lunch, it was a great unexpected experience."}
{"text":"Excellent food and service. Kung pao chicken was spicy delicious. The mu Shu pork was good, and my kids loved the sesame chicken and egg flower soup."}
{"text":"Really clean, large place. We were the only ones there (2). The staff was really friendly and the food came out fast. Everything looked great. The dumplings were good. Only thing I would change is less chili oil in everything, it makes everything too greasy. The portions were large and we took home leftovers. Would try again."}
{"text":"Note phone number is  480-963-1198 Yelp has their fax number listed. 
The pond in entry nice. Staff friendly.  Garlic cucumbers are the best.  I'm having hot pot tonight."}
{"text":"Sometime I'll come back to try the Szechuan stuff (lookin' at you, Spicy Frog Casserole), but for my first visit, I had potstickers, Walnut Shrimp, and Fish Fillet with Fermented Rice Sauce. The potstickers and walnut shrimp were just OK (though as another reviewer noted, the shrimp were large and plentiful in the walnut shrimp dish -- I just happen to like Hong Kong Kitchen 3's version more).  However, the fish in fermented rice sauce was my instant food crush.  Flavors were simple, fresh, and satisfying: delicate white fish lightly coated in a mild, almost-sweet rice-based sauce that resembled congee, with wood ear mushrooms providing a little bit of an earthy flavor note as well as textural and visual contrast.  I'd definitely order this again!

The restaurant isn't as large as some big Chinese banquet halls, but it has that same formal decor.  It was clean, and the staff were very prompt, attentive, and friendly."}
{"text":"This is my go-to spot in Phoenix area for Chinese...legit authentic szechuan flavor (hot and spicy) and they are not afraid to use the szechuan peppercorns-a flavor that is addictive.  And the fact that this place hits those flavors separates them from some of the pretend places. If you've never tried szechuan peppercorns, just try the sauteed cabbage and ask for light spice...delicious. also loved the dumplings in chili oil, the peking style mu shu pork and the jalapeno chicken. We will be back!"}
{"text":"Newly opened. Pretty authentic spicy food. Service was awesome. They weren't busy for lunch on a work day. Hope they become more popular and keep up the good work!"}
{"text":"Rotten chicken, and when told the waitress, she reached onto the plate and took a peice Ok, so if it's not rotten, I have to eat off the plate you touched? Horrible service, dirty food!!!!"}
{"text":"We ordered wonton soup, cumin lamb, yanzi chicken and a veggie. All were excellent. Especially loved the cumin lamb. The portions were big. The service was superb. There was live piano music. Lovely place. Will go there again."}
{"text":"This place probably has the best Chinese food in the East Valley hands down. Order the won ton soup, spicy boiled chicken and the spicy potatoes. I'm giving this place 3 stars because the service is not great. We walked in and had reservations but they were so understaffed that the servers were running around like they were chickens with their head cut off. We didn't get any attention for 15 minutes until we waved the server down. Then we were told not to order won ton soup because it would take 30-45 minutes to get. Several tables sat down and left because they weren't getting any service. Avoid this place during the holidays because it's going to be a long wait to get service and food. The restaurant owner needs to prepare and get more staff during holidays to solve this. Other than that, this place has the best Chinese food."}
{"text":"Yay for open restaurants on Christmas Day! This year I was determined NOT to cook on Christmas. Where to go, where to go? Chinese food it is. 

The location is on the southwest corner of Alma School and Elliot Road. The shopping center is large so easy access is closest to Alma School. 
We entered and my first impression was GREAT. Clean and very BIG inside. I think I was expecting a much smaller place.

We were seated immediately but it took our server a while to bring our menus. The place was not very crowded and had approximately 5 tables being served. There was a large group so I'm sure the servers had their hands full. This is a great place for large groups. They can surely accommodate you. 

We got our menus and made our selections. (Hint: they only serve Pepsi products, so if you're into Coke, you're out of luck.) 

It took a while for our meal to come out, but they trickled on to our table one by one. The pot stickers were to die for. I think I could have eaten two orders by myself. They were fresh and cooked perfectly. They were gone in a hot minute. 

Our large servings of entrees followed. We have orange chicken, broccoli beef, sauteed green beans, vegetable friend rice, and Kung Pao chicken. Definitely not low cal, but pretty darned good. I would have preferred the Kung Pao to be spicier and I enjoyed the green beans very much. Overall a good meal for the value. We even had leftovers to take home to enjoy the next day. Total cost excluding tip was $63. I'd definitely go again and try other menu options. 

It did take a while to get our check and the serve apologized. Again, it was a busy holiday. I liked that the patrons were patient and didn't get upset with servers."}
{"text":"Here I am again, writing about eating in yet another restaurant...

This Chinese food restaurant is, IMHO, the best Chinese restaurant in the easy valley. The prices are very good, all menu items have a color photograph to show you what you'll get, and the food is fantastic. Exotic flavors, very helpful and attentive wait staff. We CAN'T WAIT to go back again. I think we'll be eating there at least twice a month!"}
{"text":"Tasty Sichuan dishes; go for the ????water boiled fish. Maybe ask for less salt but I find this is an issue for most Chinese restaurants here. Great service and big open space with booths !  The dishes are large so do bring your hungry friends."}
{"text":"???????????????????????????????????????????????????????????????????????????????????????????????????????????????"}
{"text":"This restaurant was empty when I arrived so the food came out really quick! I grew up eating this style of food at home so it was great to find a restaurant like this. Some of the food didn't come hot, but were still delicious! I recommend getting these dishes if you've never tried them, they aren't nearly as spicy as they look and all the dishes are smaller in size but also cheaper than most sit down restaurants so you can try more dishes for the same price! Attached are some photos, but I apologize for the poor camera quality!!"}
{"text":"If I had to pick one cuisine to eat for the rest of my life, Sichuan would probably be it.  Unfortunately, many of the exceptional Sichuan places near me have bit the dust.  Szechuan Cuisine on Ray and Kyrene, gone.  Miu's Cuisine at Apache and 101, toast.  Szechuan Palace has been my go-to for a while now, but yesterday I ventured a little further north on Alma School to try Chengdu Delight.
I had actually tried to make a take-out order there last weekend but when I called, they told me they were way too busy to do a to-go order.  Thursdays are obviously much different.  We pulled up right around 6pm and pretty much had a good chunk of the huge space to ourselves.  Timing is everything.
We ordered the dumplings in chili oil, yu xiang eggplant, chunging chicken, and the spicy hot pot (I usually order water boiled fish to judge a new Sichuan place, but the hot pot looked great).  
The waitress reminded me the the Chunquing chicken has bones and I asked her if they could make it boneless which, while not the traditional way, I have found many places will do.  She said I could get it boneless but I guess we were having a communication problem because the dish came with bones, and upon asking another waitress, it turns out that bone-in is all they offer.  So be it.
Short and sweet ... everything was exactly as I expected it to be and it was great ... and huge.  The spicy hot pot ($15) could easily feed 3-4 on its own.  Developed nice little beads of sweat above my brow and went a little numb from the sichuan peppercorns; just as it should be.
Will definitely be returning, especially to try the water boiled fish, and I definitely see a possibility of this becoming my new go-to."}
{"text":"The joy of discovering a great place to enjoy your favorite cuisine is an experience to be savored. 
Chengdu Delight is a whole bunch of joy. On my first visit here earlier this evening I was absolutely transported to the Sichuan capital with wonderful memories of my dining experiences there. 
The fiery dishes prepared perfectly are not to be missed (some may need to wash them down with a large dose of Pepto Bismol). But isn't that why we love Sichuan cooking. 
My lamb with cumin was cooked to perfection. While my palate was being treated to heavenly taste, I was struggling to keep up in wiping my brow: the sweat was coming down like a monsoon. 
Complementing my meal was fresh watermelon juice which I had developed an affinity for during my numerous visits to China. 
In addition to great cooking, this restaurant has a very pleasing decor: not overloaded with all things Chinese. 
Service is friendly and prompt. 
BTW the majority of the customers were Chinese. Always a good sign when one is looking for authenticity. 
This place is going to be in section A of my restaurant Rolodex."}
{"text":"(Lyrics - Dexys Midnight Runners - Come On Eileen)

Order spicy pot
Tasted good with the chilies
It moved a million senses in style!
Oh Bobites cried
Sang along, who'd blame me

I ate
(You ate up)
So full
(So full up)
Now I must eat more than ever
(Chengdu Delight)

Toora loora toora loo rye ay
And we can sing just like Bo Bites does
Chengdu Delight, oh I Yelp what I mean
At this moment, you mean everything
With garlic spinach, my thoughts I confess
Mellow on Spicy!
Ah Chengdu Delight!


At first sight from outside this place didn't seem to uplifting....especially next to a Little Caesars Pizza joint; I'm not judging here cause I'll eat the hell out of a Little Caesars pizza!

Once I walked in things got a little different.  I totally dig the water fountain bridge upfront and the grand piano in the main room.  Decors on the wall are sparse and could improve while the red lanterns is a must.  I hope the keep this up and make sure they dust!  

My friends and I started with some Pork Pancakes and continued with ordering the Garlic Spinach, and Spicy Fish Filet.  I went for the Spicy Hot Pot.  The Pork Pancakes were okay; It reminded me of the soupy dumplings because the pork inside was like a soupy meat within a floury bun; but I still prefer soupy dumplings haha!  One of my favorites of the night was the Garlic Spinach, cooked to perfection with the right amount of sweet and saltiness to the crunch!  I only had one bite of the fish filet, but thought it well cooked again and loaded with some chilis made this dish a spicy pop; I think a tad too much.  My hot pot came with beef, chicken, shrimp and a load of bean sprouts.  Well presented and definitely could have served two people easily.  I think next time I would tone down the spice level since I ordered medium and my tongue was on fire!  The rice helped leveled it out.

Overall, service here was on top of things when I visited and was very helpful.  The place was aesthetically great to look at and in the end the food was cooked right to what you'd expect of Sichuan cuisine! - Enjoy!"}
{"text":"Great traditional chinese food. I liked the eggplant and the rice cakes the best. The server was really welcoming, patient, attentive  and knowledgeable. He was wearing glasses."}
{"text":"I would never recommend this restaurant to my friend. The service was awful, did we receive this kind of service because we are not chinese? The server was mean to me and my friends. They were having a really bad attitude on us. They didn't even take care of out table and let us sit waiting for a long time. We have to wait for a while if we need something and it was 4 tables only. I won't come back to this place again. If I could've rate 0 star, I would!!!"}
{"text":"This was my firsst time here & BF was here before. Very clean & neat and Family Style portions. We went on a Friday night & everything came out pretty quick. I got chicken chow mein & potstickers. Very good."}
{"text":"This is the real deal folks. We were the only non- Asian people there, which I didn't notice til long after we sat and I wondered why patrons stared at us. Pot stickers that night were so bland and dry. However the General Tso Chicken - OMG. Delicious. In fact my kid ordered orange chicken and completely abandoned it for my dish. And I don't blame him. 
The orange chicken was ok. Waitress was super nice and we had a nice time. 
Ok just order that one dish  we both will next time!"}
{"text":"This place was soooo good! We are visiting from out of town, read a few other reviews and glad we decided to try it. Had the dumplings in chili oil wonderful, and the moon shoo pork never had it and it was great. Our waiter had made a few recommendations that we will definitely try next time. He was so awesome too! Great restaurant, great service, great food!"}
{"text":"This is the first authentic/NY Chinatown style restaurant that I have found in AZ since 2004.  If you're eating in house, their soup is family style.  Hot and Sour was good.  And my leftovers were good too.  Other restaurants, the hot and sour can get gelatinous.  The wonton had a great broth, classic flavor.

Beef w jalapeño.  This was pretty tasty.  I would give it a solid 4.  If it was spicier w more garlic then a 5.  The meat was shredded just like Chinatown (not Mexican style-just thin strips style).

Kung Pao chicken 5.  Although I might order it with white meat next time.  Think they let you upgrade for $1-$2.  

Sizzling chicken-this was a 3.  The good thing is that it was spicy.  It's on the bone but can be upgraded.  Was missing some flavor but had potential.  I had thought this would be more of a dry chicken.  That is how I've had it in NY but it was in chili oil.  Chili oil is tasty but shouldn't be the only seasoning.

Appetizers were good.  They don't have your traditional egg rolls.  Most places in AZ (here too) just deep fry a spring roll.

I'm going to go back.  Place was like 12 miles away but I'm willing to drive for authentic Chinese."}
{"text":"Found this gem when I was picking up some pizza from next door and boy am I glad. The staff is very generous and attentive, I love the setting, a little bridge with a little bit of water running under when you first walk in. Then bam, a big piano and I just love it. We ordered the sautéed mushrooms (amazing!), dumplings, fried rice, orange chicken, lo mein, all great, no complaints here. The portions are also a pretty good size for what you pay for, so I definitely recommend this place"}
{"text":"My wife and I have eaten at Chengdu Delight about dozen times over the past year or so, and it's become one of our favorite restaurants for two reasons:

- The Sichuan food is delicious, the best we've had in town recently. Current favorites are water boiled fish, chung ging bone-in chicken, and sauteed special mushrooms. The noodles dishes here aren't my favorites, but most everything else is great.

- The service is always fantastic and genuinely friendly. No kidding, the servers treat us like we're visiting their family home. We go during off hours, which probably helps."}
{"text":"Really liked the chili oil fish ???, the flavors were pretty authentic and there was a good amount of fish for two! Also got the dumplings in chili oil but the skin was a bit too thick for my taste (although the dumplings were much larger than most other chili oil dumplings)! 

Service was a bit slow because it seemed to be a bit of a busy night but the waitresses were very friendly."}
{"text":"Service good.  Food Ok.   Kung Pao Chicken, needed more chicken.    Would be great to have brown rice as well.   Only white and stir fry.    Oh wel.."}
{"text":"One of the best Chinese restaurant that I've ever been to in America. Delicious food and great service!"}
{"text":"We ordered out for 12 very happy people in our wedding party. My best man ordered in mandarin, so not entirely sure what we ate. But it has all that ma flavor that is so unique to Sichuan food. Spicy, tingly, and and......so much ma! Mmmm Sichuan peppercorns. 
We had the boiled beef, cold beef tendons, pork with fish (so much ma in this dish), lots of pork dumplings, and the cumin lamb. Oh the cumin lamb, how I could sing on about this cumin lamb. It speaks to the importance of Sichuan province on the trade routes to Central Asia. Yes, these flavors of adding lamb and cumin are Uygher from Xinjiang, but man does it have a Sichuan peppercorns kick. 
Who would have know that the greater Phoenix area had good Sichuan food? I'm gonna make this place a staple each time I'm in town."}
{"text":"It is hard to find authentic Szechuan food around here in AZ.  This is the real deal. The family who owns this takes pride in their food and service. The menu is filled with hot pot options, chinese dishes that you have to travel overseas for, and lots of chili oil. If General Tso's at the mall is your thing, just skip this. If you like numbing spicy food and real Chinese flavors and aromatics, give this a spin. It is not fast food. The dumplings in chili oil are teh real deal, as are the vinegar potatoes. Real similar to NYC Chengdu food I have had. Go here! It is a trip to Chengdu. And speak to the owner, they are super hospitable and will help you out with questions so you order something you like!"}
{"text":"Food tasted mediocre and we ordered around 7 dishes. Many of the plates and bowls were dirty with old food stick to it so we had to ask for lots of new plates and bowls. Service was friendly though. Turns out I'm allergic to something in their food and I broke out in a plethora of canker sores after eating their food. If you are prone to canker sores, perhaps avoid this place. If you're a germaphobe, definitely stay away. I certainly won't be back but some of my family members liked it."}
{"text":"Four of us ate at Chendu Delight last night and it was more than a delight!  I had the best Chinese food since I was in China!  We ordered the frog casserole,  which you really need to eat with your fingers, because of the small bones, which they warned us about twice before we ordered.  The frog was tender and yes we used our fingers,  and it was perfectly spiced, not too hot and very flavorful.  Then  we ordered spicy cabbage and a serving of garlic spinach.  Both dishes were perfect. The last dish was a wonderful crunchy shrimp.  We also ordered a dish of Ma Po Tofu.  I ordered it medium spicy .  The freshness of the tofu was very obvious and there were wonderful tiny pieces of pork.  I brought the tofu home and had it for breakfast.  
I like spicy food but the medium was plenty hot without loosing it taste to hotness.
Without a doubt, I will return.  
They are planning to serve beer which will be nice.  Otherwise there are Pepsi products, tea and water.  
I just love be the place?"}
{"text":"Worst dining experience I have ever had. 

I've been in the service industry for over 12 years, so I'm very understanding and forgiving in pretty much any situation. I get what it's like to be busy, I've been there and I'm very patient in those situations, however the way we were treated was inexcusable.

So here's the story, we arrived around 5:20pm Christmas Day. Our server sat us in the main room, got us waters and let us look at the menu. So far perfect. At this point we were one of three tables in the room. 

Around 5-10 minutes later another table was sat. Another 5 minutes or so, another was sat, and so on. They were busy, obviously, it's Chinese on Christmas. Now around 5:45 or so, we still had not been able to place our order, however the two tables that arrived after us began getting there food. 

Another 15 minutes pass, still no server to come take our order, yet another table, a party of about 5, who arrived at least 20 minutes after us, began getting there food. 

We were completely forgotten about and ignored. Mind you, we were not in a back corner or anything, we were in a both in the middle of the back wall. Our server walked by us at least 15 times, completely avoiding our gaze in the forty minutes it took until I finally got up and asked for a waiter. 

Ten minutes later, she was finally there without so much as an apology, what did we get? \"Thank you for your patience...\" This was after being skipped by at least 4 other tables. 

Now again, I've been in the business for a long time. I've had many guests complain to me that there food has taken 30 minutes, when in reality it's only been 10, however we literally waited 50 minutes just to order. No on apology, nothing. 

We will never be returning to this place and are absolutely appalled by the lack of customer service we received."}
{"text":"We are so please that we stopped at Chengdu Delight on the way home from running errands this past Saturday. What an exceptional  find! The  food was delicious, the staff courteous, efficient, and helpful, and the prices remarkably  reasonable considering the amount of food that arrived at our table.
My husband ordered his usual favorite, Kung Po chicken. He uses this to gauge how good the food is from one restaurant to the next. I had the Dan Dan noodles from the dim sum menu and an order of spinach in garlic sauce from the vegetarian menu. Our daughter, who was born in China, chose number 29, spicy water boiled chicken. 
Everything was perfect! When I asked for something milder, they complied and it was delicious. My daughter and husband ordered spicy food -- equally delicious. Undoubtedly, we will be back many times  to eat at this delicious Szechuan restaurant. 
There is also a lunch menu with a variety of items from $6.25 to $7.25  which includes your  choice of white or fried rice and egg drop soup or hot and sour soup plus an eggroll!"}
{"text":"Finally! A Sichuan style restaurant to rival the food they used to serve at Miu's. It truly is a delight eating here in many aspects. The restaurant is spacious and sparkling clean. The atmosphere is elegant and they even have a baby grand piano in the dining area for live music. 

The menu is easy to navigate through as many of the dishes have accompanying photos with them. Each dish is numbered which also adds to the ease of ordering. 

We shared the pork belly with garlic sauce (#17), water boiled chicken (#25), spinach with garlic sauce (#66), and dumplings with chili oil (#76).

The pork belly was tender and was well seasoned. The sauce it was in complimented it well. The water boiled chicken was excellent, with a depth of flavor from the tongue numbing peppercorns and chiles. The spinach was a sizable portion, with more of a delicate flavor to contrast with all the bold, spicy dishes. The dumplings in chili oil had a meltingly soft dough with a good amount of filling and I loved the kick of spicy oil with them.

Service was good and the servers were very eager to please. There was a slight mix up in ordering but it was quickly remedied and our correct dish was brought out with no other problems.

This restaurant has only been open a few months; Here's hoping they stay here for a long time. It was truly a wonderful experience dining here and I can't wait to go back again."}
{"text":"??????????????????????????????deng'we????"}
{"text":"My new favorite place to go for spicy Chinese foods. I visited this place 4 times in a week and have tried total 12 dishes. They are all very good and tasty. 

Some of them are little salty for me, but they seems to be fine for our American friends. Very clean and not so busy at the launch time."}
{"text":"How did this little gem slip under my radar?!??!

They've been open for about five months now, and I was hugely impressed!!! The restaurant itself is BEAUTIFUL inside, with a lovely grand piano and very subtle decorations. I mean... this place is CLASSY, and not what I would have expected!

Anyways... on to the food! We sat, and took a look at our menus... and every item has a picture! That's great for people who might not be overly familiar with a different cuisine, and it's nice to be able to take a look at something before ordering it. So we ordered our food, and this is the only reason why I can't give this place a five-star rating:

-----

\"We'll try the Dan Dan noodles, the tripe in chili oil, the frog legs hotpot, and the pork with dried mushroom hotpot please.\"

\"Whaaaa?!?!? That's SO spicy! You want that?!?! That's so spicy for you!\"

\"No, it's okay. We like spicy food.\"

*skeptical eye narrow*

Then when receiving our food...

\"May we have some chopsticks please?\"

\"WHAAAA?!?!?! YOU USE CHOPSTICKS??!??!\"

*sigh*

-----

Seriously folks, it's 2016. White people (and Mexicans too!) know how to use chopsticks, and some things are just much easier to eat with chopsticks than with a fork. So please, quit it with the incredulity. And yes, we eat things other than General Tso's chicken and Pork Fried Rice. So again, cut it out with the \"are you sure you eat that\" just because I'm white. Anyways...

The food was ON POINT. If I come here a few more times and the food is this good again then I'll give them five stars even with the annoyingly patronizing concern for my palate. The Dan Dan noodles were delicious, really nice ground pork on top with sauteed spinach. The tripe was faaaaanTAStic, swimming in that nice Sichuan peppercorn chili oil that leaves a tingle on your tongue. The hotpots were also amazing, and the frog was especially noteworthy. Be careful, because there *ARE* bones in it, but if you're coming to an authentic Chinese restaurant then you need to be ready for bones. 

The prices are all extremely reasonable, the portion sizes are reasonable, everything here is great!!! Once I get over my annoyance at being pigeonholed I'm sure I'll end up giving this place five stars, but in the meantime I'm going to hold off."}
{"text":"?????????????????????????????????????????????????????????????????????????????????????????????????????????"}
{"text":"Best Chinese food in town! Love it! People who work there are very nice too. Nancy and Jun (the owners) apparently have many years experienced working for Chinese food industry. You can taste and tell!"}
{"text":"First of all let me start with this..if I could give more than five start I would. This place is amazing haven't been in a Chinese restaurant this good in a long time. Staff was very friendly and on top of our drinks never let them go less than half. Very good, the food was fresh,hot and fast service.Very good place love it!!!..."}
{"text":"The restaurant is very beautiful and welcoming, the service was very good and attentive and so kind. I ordered the dumplings and chicken and beef lo mein. The food was okay but I would definitely go back because I had a very enjoyable experience."}
{"text":"the food is good?just a little bit of expensive. the environment is ok. I would recommend no spicy food."}
{"text":"Orange Chicken and Kung Pao Chicken was fantastic.
Clean place
Large portions . One entree=two people"}
{"text":"This is becoming the #1 Chinese restaurant in the valley. Really great food!!  Little bit far away from home and work but we still visit here every week"}
{"text":"My wife and I were looking for a new Chinese restaurant to try. With all the choices out there, we took a chance with this one(Chengdu). And I'm afraid we definitely made the wrong choice. First and foremost, the service was average at best. The waiters all took too long to get back to us. They didn't even offer to refill our water. And more importantly, the food was awful. The Kung Pao chicken was the worst I've had in a long time. The chicken was entirely overcooked. It was difficult to find the chicken among the mountains of red chili on the plate. The chicken chow mein has maybe 3 pieces of chicken on the plate. The only dish that was halfway decent was the Hot and Sour soup. We wanted to leave asap after such an abysmal meal, but to add insult to injury, it took forever to get our check.  Overall, this is not a restaurant I would recommend to anyone."}
{"text":"Mapo tofu and sautéed mushroom were my favorites. The food came out very fast and sizzling hot which made them taste even better."}
{"text":"Authentic Chinese food :)
Foods are good and friendly staffs.
I recommend the pork and mushroom"}
{"text":"Excellent Chinest food just don't get the pepper bowl soup tat has the pepper that makes your mouth numb. It literally makes your mouth feel like you ate anbesol."}
{"text":"Gave this place a try, hoping its not the same Owners as Shangri La, 
Service was a little slow, place appeared clean. 

Selections were decent, pretty good variety of spicy dishes.
Food was decent, nothing over the top, spice level was just right, and Rice was cooked perfect (shock in some places)

Portion size was good, as sharing plates, u sample from a few plates as a family, since one plate would feed 2 normal people. 

When in the area, i may stop by for some spicy Chinese selection.. Not an out of the way stop for sure. 

Keep eye on Maricopa dot gov site for health inspections as Shangri La failed so many times.. 

http://www.maricopa.gov/EnvSvc/OnlineApplication/EnvironmentalHealth/FoodInspection?p=FD-48422&i=3892783"}
{"text":"I LOVE THIS PLACE! I recommend the Stir-Fried potatoes with jalapeño! It was unexpectedly delicious. The portions are large enough to eat family-style, so I also got to try the Yu Xiang Egg Plant - also delicious! I am a vegetarian, and this place has plenty of options - I highly recommend it!"}
{"text":"Really great Chinese food in Phoenix! Came here for dinner with my family, and it was fairly quick service, I think because most of their customers, international students, are out of town currently during summer break. It's a quiet atmosphere with really clean decor. 

We ordered quite a bit of food, and I'm not sure of the English translation names of some of the dishes, but I'll post pictures and do my best to describe them.

All of the dishes have extremely generous serving sizes compared to other Chinese restaurants, the prices are average, and the flavors are clean and tasty. My favorite was definitely the mushroom stir fried with greens and pork. The dish is meant to emulate a sort of crab-like flavor, and it's really amazing.

The fish and tofu dish was nice, with silky soft tofu and large meaty filets. The two chicken dishes were great, the potato stir fry dish was thinly sliced to perfection.. I really don't have anything but good things to say besides come try this place for some authentic Szechuan cuisine!"}
{"text":"I'm a bit annoyed. We ordered 6 entrees and they charged for white rice. The food is not bad but who does this?"}
{"text":"A great find!  My hubby and I had the Pork with green onion and the Kung Pao Chicken.  Both were excellent-and a large portion.  I love that they are generous with the protein-unlike many other Chinese Restaurants.  It was spotless and had a nice open ambiance.  The servers were wonderful.  We will definitely drive out of our way to return.  Looks like they have great lunch specials.  I wish this gem was closer to home-I would be there once a week.  So many choices to try-and the menu pix are reflective of the food you are served-another bonus."}
{"text":"The food was on the oily side, but the flavor was good. Stir fried cabbage is the one of the best I had in the US."}
{"text":"We came late in the night into this restaurant from yelp viewers while we were visiting a friend.  They never heard of it but we were delighted by the spicy dishes.  We had the chef tuned down the spice a tidy but for the kids  and everyone had a delicious meal. I think we left dishes unfill.  Would come back."}
{"text":"Don't know how we missed this spot. 
3 for leisurely lunch on Wednesday.
Ordered the spicy crab \" in casserole\".
No casserole, but a ton of delicious red peppers and crabs in chili oil. Messy and hard to eat, but worth it.
Shared Dan Dan noodles, orange chicken, all lovingly prepared. Great service by all, everyone was friendly, attentive and very helpful with the menu.
I truly believe this is the best Szechuan restaurant in the Phoenix area, maybe the State.
Coming back to try some shrimp dishes!!!!"}
{"text":"Service: nice and friendly, no complaints 
Restaurant: spacious and big, inside is very clean and bright
Ambiance: we were the only customers at the time because we went at an odd time around 2pm. It was very quiet and I wish they had some background music or something
Food: dumplings in chili oil was really good! Dumpling had good filling and was soft and flavorful. The chili oil broth wasn't overpowering and had a nice spice. Crispy walnut shrimp was crispy and really good. Shrimp was fresh and big and I liked that they don't use a ton of mayo. Pork moo shoo was flavorful and tasty. General tso was super generic and wasn't spicy or soy saucy, but more like a bland orange chicken. We barely touched the General tso chicken. 
Overall really good and good price. Will definitely be back to try more!"}
{"text":"I brought my family here tonight and we were all blown away by the service and cuisine..! 

It was Chinese New Year so the wait time was pretty long but the servers were very attentive and let us know the circumstances in a polite and professional manner. Everyone there was so sweet and interactive with our table so thats an A+ in service for me! 

Now on to the food... We were a bit scared for what was in store when we tried the wonton soup because the broth was surprisingly bland and needed soy sauce and chili oil to bring it to life. However, our impression quickly changed when the chicken fried rice, sesame chicken, green onion beef, kung pao shrimp and chicken chow mien followed shortly after. Each dish was INCREDIBLY tasty in their own individual ways. 

I won't go through each individual dish but I must say that the kung pao shrimp definitely stole the show for me. It was perfectly spicy and the shrimps were huge, meaty and took on the savory stir fry sauce very well. These entrees completely overshadowed the wonton soup and we left completely satisfied. 

I'm happy that we have finally found a great Chinese restaurant to put in our rotation! I can't wait to try the rest of the menu."}
{"text":"Stopped by for a late lunch for the first time today since I was famished from a long work day. I have to say that I was pleasantly surprised. 

The place was huge, clean and nicely furnished with a grand piano for entertainment. Albeit it was empty since it was after 2pm on a weekday, the hostess was very and offered me a free cold bottled soda while I waited for the to-go food to be prepared. The Mongolian beef with fried rice was tasty and if I lived closer, I would definitely have be back to try their varied different dishes."}
{"text":"I purchased a delicious meal to go, but wasn't able to enjoy it because the Styrofoam container melted from the heat. The dumplings in the chili sauce are huge. .I was able to eat them for a second meal the next day."}
{"text":"Hey, so far it was excellent. We had the Sauteed Special Mushrooms with pork and the Spicy Hot Pot...should've read the reviews on that one because it could easily feed 2 or 3, nonetheless it was 'bangin! Service was excellent and attentive, the interior was clean and they refilled the bowl of white rice for us, which was nice. A big ceramic pot of hot  Jasmine tea helped wash it all down. All in - definitely coming back here as there are more dishes I want to try. The Spicy Hot Pot came with its own mini-cooker that was flaming up like a house on fire, you not belief! And the crunchy greens we identified as cilantro in the Special Mushrooms (wink-wink)...hehe. Try this place - you'll like the food and the authenticity."}
{"text":"First, I am in shock to see how clean this restaurant is. It is sad but the reality is this: most Chinese restaurants are dirty. Not this one though! All tables are spotless clean and well organized. Service is great and attentive. Above all, it is located in Chandler!!!! My neck of the wood woooo hooooo!!!!

My friends and I ordered total of 4 dishes: pork Belly, boil chicken, spinach in garlic sauce and spicy dumpling. I don't think there is one dish I don't like here. Everything is mouth watering and spicy (except the spinach). The dumpling skin is so soft and fresh that it melts in my mouth. The spinach has the right amount of garlic sauce. I don't usually like veggies but I almost cleaned the whole dish! The pork belly is well seasoned and so tender that I hardly need to chew. 

I spoke with the waitress and apparently they opened up about a month ago. I am so glad that they are here in the valley since szechean palace down the street sucks. Not to mention someone associated with that restaurant wrote a yelp review on here giving them one star lying about waiting 2 hour for their food. Very tacky. Trust me us yelpers are pretty smart to figure it out. Ill definitely come back here again."}
