{"text":"Breakfast menu small but food a notch above."}
{"text":"Ordered a burger, the Classique. It was seriously underwhelming. Good quality beef patty but no flavour, needs seasoning and more toppings. Very friendly service."}
{"text":"Didn't like this place that much. They have a good menu and I love that it's all local products but something was just missing. 

I ordered the popcorn chicken poutine and it just tasted like something i could get at st-Hubert. 
My boyfriend got the burger and he said it was good but for 13$ he expected more than just the burger.   

The service was lackluster. It was also really
noisy because there was a family there at the same time as us that had like 6 kids and they were running and screaming the whole time. Not their fault, but it made me enjoy my time there even less. 

I am going to go back and try one of their adult milkshakes though! Yes you read that right, adult milkshakes."}
{"text":"Welcome to Bernard O Chez Leo.
Good to know there's a place to eat and imbibe around the corner 24 / 7!

I was headed to a nearby fave Thai eatery with the half notion that I'd, maybe, check out this new biz that had sprung up while I was out of town.

The retro eco fusion decor piqued my curiosity, wasn't certain what to make of the soundtrack, nor the all French menu, but I felt compelled to give it up, and have the very best experience of this fresh new biz. 

I was charmingly delighted with my decision.  

So new they're still finding their feet here, but the Le Migrator, Chips de Kale Poivre et Citron and Pied de Vent from Ille de la Madeleine was excellent! (And now I know the name of that sweet little, vulnerably shaped island I flew over on the way back from Newfoundland only a few days ago!_love how things connect.)

Ingredients for this omnivore fusion menu are all sourced in Quebec. The greens are grown right on the premises, the mayonnaise is made from scratch every morning. The duck in my burger came from the Southern Townships, the goat cheese from the southwestern shore of Montreal, the mushrooms are local, rehydrated, the onion bun was baked a couple blocks away. 

Jean-Rene, part owner and passionate in-province sourced foodie, really wanted to partner my meal up with a fabulous Quebec micro brewery beer, I had to pass for the now. But I will be back, and with the intention of trying a new Quebec brew, or two.

As said before, they're still getting their bearings.
Official opening 23 July.
Herbivore as well as carnivore menu items. 
Looking forward to trying breakfast, and at 4AM, at some point.
Wifi.
English menus coming.

=D
Cheers

btw, Chez Leo, I did enter your full biz name...looks like Yelp shortened it. =0"}
