{"text":"I was really impressed with my experience at Chez Boss & Fils! The staff were all really friendly and w/ an open concept kitchen this place had a really unique and welcoming vibe. My potato salad entree was so tasty and beautifully presented! The main was a seafood paella type dish covered in butter and was mouth watering. They actually played the game at the bar too. would recommend it!"}
{"text":"Découverte exquise! WOW, sortie en famille et tous ont vraiment aimé leur repas! Nous avons gouter carpacio, croquettes morues, coquille St-Jacques, calmars frits, agneau du québec, poulet, pétoncles, etc. TOUT était exquis."}
{"text":"Ce fut excellent,  Un vendredi, nous recherchions un endroit sympa où bien manger.  L'endroit est décontracté, l'ambiance chaleureuse, le service impeccable, le staff à son maximum.  Le service est rapide et les repas sont exceptionnels. De l'entrée au dessert, vous serez surpris, c'est sain, bon, bien agencé, raffiné et goûteux. Succulent.  Nous recommandons fortement ! Pensez à réserver Groupe !"}
{"text":"Had a fun night out with a girlfriend this past week at Chez Boss et fils. I ordered an old fashioned as an aperitif- the bartender claimed it was one of the best in town. Hmmm it was good but not great. But that probably boils down to my preference of Woodford bourbon vs. Makers Mark. For my appetizer I had a delicious tuna tataki. It was fresh, flavourful& amazing. For my main I had gnocchi w squash & pine nuts. It was as delicious. I cleaned both plates. The serving sizes were spot on and the food amazing. The only ding was service... it was slow. We had to wave down our waiter anytime we wanted anything. Not cool. Albeit our servers did apologize and note the poor service due to just getting back from 1 month holidays & adjusting to the speed of things. Hmm, I guess but a more professional restaurant would never need to make excuses. But hopefully that improves w time. I'm hopeful :)"}
{"text":"Holy guacamole is this place AMAZING! I wish I could give more stars because it's been a long while since I've been to a restaurant where everything has been on point.  I came here with three others last night on a whim when we couldn't find any other place open past 10pm in the area. We were quickly seated and welcomed by one of the Fils who was super friendly. A quick look at the cute small menus revealed a tendency towards seafood but I appreciated the several non-seafood options.  We ordered a variety of things from the Boss (endive salad, trout tartare, a cold soup, pork shoulder, and beef ribs) and everything was amazing. My endive salad was out of this world and perfectly balanced with green apple, baby shrimp, and a perfect dressing. The cold potato based soup was phenomenal. The trout tartare was excellently presented but was a little too fishy for me (although I love tartare. When I say fishy, I mean that the trout was a little too strong). The pork shoulder was extremely tender but the mashed potatoes on the side KILLED ME. I was literally transported to another planet and lived on that planet the entire time I had a bite of those potatoes in my mouth (I don't think hubby was too excited with me eating the majority of his potatoes haha). If the owners are reading this, next time I come by I am going to order a large plate of these potatoes..... Sooo good!!!!  Now that I am off my tangent, back to the plates. The beef ribs were good but a little too sweet for me.  After this amazing meal we desperately felt the need to order dessert and so we got two Chocolate Marquis and a Banana Bread Seared alongside some cream and fleur de Sel (although let's be honest, I just wanted to have some of those mashed potatoes for dessert...). The chcolate was good but too sweet for me. However, that banana bread........ It was EVERYTHING. Perfect taste, texture, and presentation. I can't even rave enough about it.. Just try it and you'll see but it's definitely not your typical run of the mill banana bread.  In conclusion (because I am rambling), TRY THIS PLACE! They have been open for 5 months, are amazing owners (we met Boss too), and cook with huge passion. I promise that you won't be disappointed!  Next time, I am ordering mashed potatoes and that banana bread. Mmmmm..."}
{"text":"Excellent bistrot avec une ambiance chaleureuse et relax.  Le service est impeccable et professionnel. Les plats de poissons étaient délicieux."}
{"text":"The quality, service and presentation was immaculate. Portions were more than reasonable, considering the price! All the ambiance of fine dining, without being pretentious in the least. Like dining at an old friend's, who happens to have a couple of rockstar chefs working in the kitchen. You will not regret eating here."}
{"text":"Fantastic food, helpful service. Looking forward to my next visit. The selection was great, the waiter made good recommendations and the special were right on the mark. I would highly recommend."}
{"text":"Great service by the Fils himself. The Boss was around to help as well. Food is great. The confit de canard (for two) is quite generous and damn good."}
{"text":"on m'avait dit que c'était l'un des meilleurs restaurants de Montréal... ILS AVAIENT RAISON !   avec la cuisine ouverte dans le restaurant, on peut voir les produits frais et toute la conception derrière chaque plat. pour une expérience optimale, je recomande de s'asseoir au bar si vous êtes 2 personnes !   la nourriture est incroyable. Lors de mon passage, j'ai gouté l'entrée de pieuvre grillé, la morue et le tartare de thon. Les plats étaient vraiment excellent, les produits  frais, la cuisson parfaite. mon seul bémol: le côté fruité du tartare, qui n'est pas dans ma palette plus salée et crémeuse en ce qui concerne les tartares.   les serveurs sont Boss et Fils, deux chefs et proprietaires du restaurant. On a donc un service très personnalisé, connaissant et agréable.   les prix sont très élevés, mais pour un des meilleurs restaurant de Montréal, ça va la peine d'économiser en vue de cette expérience."}
{"text":"J'adore chez Boss & Fils. La bouffe est toujours exceptionnelle, le service vraiment agréable, l'ambiance sympathique et pas prétentieuse.  L'équipe a toujours des bonnes suggestions d'accords vin-bouffe et j'y ai découvert un excellent pinot noir qui m'a vraiment surpris.  La petite équipe est soucieuse d'offrir une bonne expérience à sa clientèle, les prix sont raisonnables, vraiment ce restaurant à tout pour plaire."}
{"text":"From time to time one dish or two make a place a hit and a regular stop...here that would be the tomato and goat cheese salad special and the duck ramen noodle from the regular menu.  Duck ramen is for two. Would come back bi-weekly for it if i could. My kids even loved it. Wow.  The duck and ramen come with bok choy, amazing smoked scallops, fried flayed shrimps, and a wonderful sweet and sour miso.  Tomato salad was with tomatillos, peaches, goat cheese...goodness... just go for it!!  Thought fidua was just ok, until we added a bunch of pepper and it came alive...still not amazing...think the Spanish chef was out because our waiter said something about it when I told him it wasn't living up to the amazing duck and the tomato app.  Note: We didn't like the tuna appetizer much, also were not wild about the sun-dried tomato fried calamari app (too sweet), but the fantastic wine suggested (2015 Luberon - Rhone) and the warm crisp baguette made up for it.  Our waiter was super knowledgeable and lovely to boot. The room was cool...dark with wood, blue light , and silver tin...the boxing match was silently playing on the tv behind the bar/open kitchen which meant there was always something to look at.  Lastly, I love classic rock and thats what they played...great spot for me and my fam"}
{"text":"Belle découverte! Le \"Boss\" vous réserve un service chaleureux sans prétention. L'ambiance est amicale, on s'y plait. La carte des vins est courte mais offre d'excellents choix. Le menu est bien équilibré, il y en a pour les amateurs de viandes ainsi que pour ceux qui préfèrent les produits de la mer. Le tataki de thon est inoubliable. Je vais assurément faire découvrir ce petit bijou à mon entourage. J'adore cet endroit!"}
{"text":"Amazing food and great service. Try the fried squid if you can. A little pricey but well worth for a treat."}
