{"text":"Nice food ,  nourriture péruvienne. De haute qualité , endroit cachée sur la rive sud... Mais très bon, la madame qui sert est vraiment gentille, c'est une bonne place pour les personnes qui aiment la bouffe péruviens et qui n'ont pas envie D aller jusqu a montreal , c une place pour prendre pour apporter, car lendroit est petit"}
{"text":"I always love going to Chez César, while it is some sort of small, and hard to find on a map especially if you're on a car,  I can assure you, the food is worth the wait!

You have these two owners who are married, the husband, Cesar, makes the food and his wife, who while also cooks, she is mainly a server there. (There are also sometimes a few family members who come by to help, but it's mainly those two.) 

The price range is quite cheap compared to the extravagant prices you see in Montréal, the price in there, is a given. 

The atmosphere of the restaurant is delightful, there are pieces of art/history of their birth country in the restaurant, and while you eat, there is a nice TV set that shows either music videos from Peru or documentaries while you eat your food. It's as if you were stepping in another country, the moment you cross that door. 

While they can speak Spanish, they also speak good french and English (even though their website is in French, but I digress.) So, you can feel at ease whenever you're speaking with the wife. 

And if by any chance, if you eat out in that restaurant and announce it's your birthday, (while showing ID of course), they will silently switch their TV to a happy birthday song in spanish and will give you a complimentary no charge, delicious dessert to act as a 'cake' and on top of it, is a small, toy-like, fireworks to make it really special! And if there's people inside, they'll even start chanting and telling you a happy birthday around you! All to make you feeling good inside making your birthday day go even better.

When I typically go there on a fun day, I always order 3 things. As starters, I take an ''Aguadito'' which is a green chicken soup with rice instead of noodles placed on a ninja-like plate. Then, I pick Ceviche made just with Fish because it's my favorite plate and finally, for drinks, I usually take an Inca-Cola which is the yellow version of the known Coca-cola. A product well-known in Peru or order a jar of Chicha Morada, which is a purple juice made out of purple corn with cubic-like shapes apples inside it, which aside from Inca-cola, is another signature drink from Peru. Not too sweet, and not too strong, they really make it with love. 
And all of that comes to a total of 20-23$ excluding taxes and tips. Which is a really fair price compared to a 25$ plate you can find in Montréal and have less quantity as well as quality. 

Pros: Good price, good food, good customer service, good atmosphere

Cons: Very easy to miss, it doesn't stand out from the shops around it, very small parking space, it's not a triple A restaurant so food, may take a while to come out, especially if you've ordered many plates. They don't open on Monday. Their website could use a little bit of a programming. (Not many buttons work.) 

TL;DR (If you think my review is too big) : 
While they have a few cons, they are worth coming if you live in the South Shore area.
Fair prices, good menus and good customer service. I garantee you will have good time."}
{"text":"Ok, here is the deal, I don't understand why they have not came up in my search before, they have been around for more than three years now, all the yummy opportunities that I have missed by not eating here! This is making me start to doubt yelp for all food searches.

The food was amazing and you can tell the chef cares about his craft in the presentation. This is a person who is good at what they do and do it with love. And that love shines through the dishes! I will be coming back to make up for lost times."}
