{"text":"This is my favourite place in Montreal's Chinatown for authentic Chinese food. The servings are large and reasonably priced, and the food is well-seasoned. Their pork dishes are especially excellent."}
{"text":"I decided to try something different...  And while I generally want to try lots of new restaurants, it seems of late, it's more miss than hit.  It's a new place at the corner of la gauchetiere and clark, in chinatown, it's a basement place so you have to walk down. The decor is very modern chinese zen, with chinese cities written on the wall in caligraphy, a nice touch.  We ordered hot and sour soup, tofu family style and some stewed pork belly. I've been dying to order pork belly for a long while, and you don't often see it on the menu.   The taste overall is bland to too salty. The soup was a bit liquidy, so there was a problem with every dish, don't know if it's an off day with the chef but it was not spectacular.  The pork belly was a bit lukewarm, I would have preferred it more hot, and the taste was somewhat bland, I think it could have use more caramelization and more salt.  The sauce for the tofu was a bit too salty, even with rice it was hard to take. The soup had good taste and flavour, but needed to be thickened a bit...however the bowl was huge and cost only 8$, and it could easily feed 6-8 ppl.  Like the soup, bring the soup. :)"}
{"text":"Very nice place !!the service was fast,and I like the way they cook the eggplant,and the spicy fish !i'll be back for sure!"}
{"text":"ATTENTION!!! Don't go here, or you'll be highly disappointed as I was! First things first, we came here because a few days ago we had went to china town and went to some restaurant that was just delicious. A total gem. We figured we'd go walk around China town again to see if we can find another amazing restaurant. We ended up stopping here because it looked pretty good from outside, and it had a poster on the window that said \"Yelp users LOVE us!\" We said hey, why not, let's give this place a try. We got there and ordered our food (General tao chicken, sweet and sour fried pork, chow mein, and fried chicken rice.) When the food arrived we noticed that not only the noodles were super cold, but that it was super generic. I sincerely thought it was ramen noodles. The rice was okay, but I've had way better at fast food Chinese restaurants. The general Tao and fried pork were super greasy and had excessive fat that we didn't even finish it. Not to mention we were super hungry and could've easily finished it it was decent enough. We then finished and paid, and it was outrageously expensive! 60 something dollars for gross food that we couldn't even finish and that's we could've got elsewhere with better food and for half the price. The best part about this place was my drink solely for the fact that I was dehydrated and you can't mess up water. Don't go unless you really want to see the disappointment for your self. Thanks"}
{"text":"Spicy fish fillet was very delicious and flavorful.spicy chicken was good and spicy.shredded pork was not good..overall an authentic sichuan food."}
{"text":"Nice ambiance and food! It is more of an authentic mainland Chinese food compared to all the restaurant in Chinatown. Would definitely come back"}
{"text":"La nourriture est bien, mais rien en comparaison à ce qu'on m'avait vanté. Il a de meilleurs restos schezuan à mtl! Et les mets sont à peine épicés..?! Le décor est trés ordinaire. Le service, par contre, est sympa."}
{"text":"Great spot down below the main part of Chinatown...look for the giant chili for the door!  We were pleased to find we were the only tourists in there for lunch...always a good sign when everyone is a local.    Both our dishes were flavorful and huge!  Could have easily Split one but we decided to try both the spicy pork and eggplant with pork.  Both were cooked perfectly with tender eggplant and tender pork.  We ordered a medium rice to split and that was way too much.   Get a small if you have only 2 people.   There were lots of other choices on the menu and everything we saw coming out to tables around us also looked delicious.   Would recommend when in Chinatown or making a special trip over if you are elsewhere in the city and craving Chinese!"}
{"text":"We ordered the spicy fish Sichuan style. We asked for extra spicy but we were disappointed. It wasn't spicy and also bland in taste. We didn't finish it and the dish was about $20. I think there are tons of better options than this to choose from."}
{"text":"This place was a WONDERFUL find! The spicy Szechuan food was excellent. I had the Spicy Shrimp & Walnuts and my husband had the Salt & Pepper Chicken. The portions were large, the service was very prompt, and our server was quite pleasant. The large pot of hot Chinese tea helped cool down the spiciness of the dishes.  Definitely 5 Stars!!!"}
{"text":"If you're looking for something much better than a big chinese-american buffet this is the place to go. This place is clean (it's not always the case in chinatown!) and the food are well offered.   The way it works is everyone order a plate and everybody on the table take a piece of it. The crusty chicken was delicious and the fish and shrimpt were very good.   So if you're looking to real chinese food this is the place, i'll come back !   Si vous chercher quelque chose de différent que les buffets americano-chinois, c'est le resto ou il vous faut aller.  Le restaurant est propre (ce n'est pas toujours le cas au quartier chinois!) et les plats biens présentés.  Chaque personne commande un plat et toute la table en prend une portion. Le poulet croustillant était excellent, et le poisson et les crevettes très bon.    Donc si vous désirer de la vrai nourriture chinoise c'est l'endroit ou aller !  Je vais  revenir !"}
{"text":"Excellent???C'est vraiment très traditionnelle cuisine chinoise,j'aime le buf avec tomato! Et très bon service!"}
{"text":"amazing chinese food?I really love their spicy fish and the eggplant Dongbei?they have a good service that i have ever."}
{"text":"This place opened up recently.  I'm not sure the address I found for it is correct; in any case it's a basement facing De La Gauchetiere immediately west of Clark, smack in the center of Chinatown.  The restaurant is new and newly renovated, so a nicer décor than many of the older restaurants in Chinatown.  Ah yes, the food.  I had the spicy eggplant with chili sauce.  I was worried that this would be overwhelmingly spicy, as Szechuan food tends to be for me, but I was reassured it would be ok and it was.  Spicy and good!  Overall: the food was decent, the prices were good, the service was good.  Can't complain for a lunch under $10, and I will go back."}
{"text":"We had luncheon for 4. General speaking the food was good but not really spicy. That's why I only give 3 star."}
{"text":"The food at Chez Chili was authentic despite what their Coca-Cola style sign might suggest. I wouldn't say it's the best Chinese food I've had but then again it's hard to find something decent in Montreal.  The Ma Po Tofu was very spicy, though lacks \"Ma\" (the numbing effect). The Hunan lamb was well executed: tender thin slides of lamb, heavy on cumin as someone here mentioned (+1), and an appropriate amount of vegetables that enhanced the dish. I would return for the Sichuan lamb.  Order dishes to share as a group and you'll get an abundance of real food. Cards accepted, even AMEX."}
{"text":"My favourite restaurant in Chinatown by far. Been at least 10 times, tried many many dishes and I don't remember one that I did not like. All the food was very authentic, although they offer a great variety from Hunan, Sichuan, and all the way to Dongbei. The spicy dishes are definitely spicy, as they should be. My favorites are the Mapo tofu and the cumin lamb. The price is very reasonable, the service has never deceived me, and I never ever had to wait in line. Very hard to resist going there and to instead try other places every time I go to Chinatown. Highly recommended."}
{"text":"Located in a basement. The interior is not really cozy but place looks clean and service was very friendly. I tried a sweet and sour soup and spicy beef ragout. The soup was above average even though it could have been a bit warmer. Unfortunately the beef was very chewy (taste of the sauce was good). I asked the waiter if this is supposed to be like that and he was very nice, explained to me that Chinese like it like that and asked me if I wanted to try another dish. Tried the Sichuan prawns with different kinds of meat. This dish was very good. Portion was quite large."}
{"text":"My favourite Chinese restaurant in Montreal! Food is quite authentic, portions are large, and prices are very reasonable. The servers are very nice and the food comes quickly. Atmosphere is also quite nice.  They serve Hunan, Szechuan, and Dongbei cuisine (Dongbei food is less common in Canada, so it was super exciting to find a place that served it!)   Love the Lapi (I need to get it every time), and the paper wrapped chicken is also AMAZING. Honestly everything here is delicious, especially if you are looking for real, authentic Chinese food."}
{"text":"The service at this restaurant was very good and the food wasnt 100% authentic Chinese cuisine, but it was very good and definitely one of the closest you could get in Montreal."}
{"text":"Had lunch with my family today and all I can say is that not only are the portions very generous but the food is very tasty. Highly recommended if you like spicy food. We ordered the Chili fish, their specialty aubergine dish and Ma PO Tofu."}
{"text":"If the ambiance was better we may have gone for 5 stars but the place is a bit plain and over-lit for a date.  More suited to family or friends who will accept the austerity in favor of good, freshly prepared food. We ordered a hot and sour soup to share.  Fortunately it never came because we would never have had room for it but we were a bit surprised when the entrees started coming out just the same.  It's also a bit odd that there are no appetizers on the menu other than soup.  We would have liked to start with some. On the positive side, the Ma Po Tofu was the best we ever had, the fried rice was light, fluffy and flavorful while not greasy or loaded with soy sauce, and the green beans with minced pork were cooked to perfection.  We also tried the lamb with onions and cumin that other Yelpers raved about.  It was good and loaded with meat but for us a bit tough and heavy handed on the cumin.  Still we ate and enjoyed it... just not a top pick in our estimation.  The menu is full of unusual sounding things but it doesn't do much to describe them in much detail - especially if you don't speak French, but chances are that you'll find plenty of reason to return as long as you're willing to take some chances.  It's important to note that even though we arrived late the food was served fast and super-fresh... clearly nothing was reheated.  BTW... we were the only Caucasians in the place... a very good sign of authenticity."}
{"text":"A cute little spot with very eclectic dishware. Our food was served in 2 Pyrex dishes, on a square plate, and on a round flowery grandma-esque plate. Nothing wrong with that, but just worth noting.  As for the food:  -Hot and sour soup: nice and spicy, strong sour notes, and big enough for four or more. -Fish in chili oil: good ma-la character, lots of chili oil, and some surprise glass noodles in the bottom of the dish. Worth ordering for sure. -Family style tofu: a nice dish of tofu and wood ear fungus in a mildly spicy sauce. Tasty and abundant. -Spicy green beans: definitely some spicy kick, they were cooked just the way I like them. Very enjoyable.  The menu has some translation issues - I did see some white folks order \"beef stripes\" assuming they meant beef strips, when it was actually beef tripe. But I think you have to expect that when you're at any Chinese restaurant in Montreal."}
{"text":"Très bonne cuisine et servie très rapidement. J'ai pris de l'agneau braisé, c'était un délice !!"}
{"text":"They have a great menu which focuses mainly on spicy Sichuan or Northern Chinese cuisine. I come to this place quite often for the eggplant with pork and black beans.   Yes it's in a basement, but don't let that turn you off. It's fairly clean with a chill and relaxing atmosphere. The prices are reasonable. The staff are friendly, helpful and bilingual."}
{"text":"Authentic cuisine, very recommended. Probably one of the best Chinese restaurants you can find in Montreal."}
{"text":"Après notre soirée Élite, nous sommes allés manger au resto Chez Chili dans le quartier Chinatown de Montréal et nous nous sommes régalés. Nous nous attendions plus à de la cuisine cantonaise que l'on retrouve beaucoup dans les restos chinois, mais nous avons découverts des plats d'autres régions de Chine, du Hunan et Dongbei sans oublier les mets authentiques de la région du Séchouan. L'accueil y est chaleureux et un bonus, on y parle très bien le français. Nous avons pris l'assiette d'aubergines chinois fondantes et rehaussées de porc hâché, le poulet et les côtes levées épicées servis avec de l'ail séché, de la ciboulette et un mélange d'épices piquants faits maison et enfin le fameux plat d'agneau à la séchouanaise servi dans une sauce relevée au cumin, une épice rarement utilisée dans les restos plus classiques. Bref, un vrai régal!!! Si je recommande...à 100 %!!!"}
{"text":"very good Szechuan style restaurant. You will love it if you like spicy food."}
{"text":"Situated at the corner of Rue Clark & De la Gauchetière, Chez Chilli is almost tucked into a basement. They specialize in Hunan-Sichaun Cusine. The place seems to be clean, which is a plus for any Chinatown restaurant. Service is quick and friendly. Food is delicious & portions are huge. We ordered the spicy fish filet, Spicy chicken & spicy eggplant with pork. They use a lot of dried red chillies in most of their dishes. So when they say spicy, they MEAN spicy. The fish was really good. Tender & spicy. The spicy chicken was great too. Crispy fried with bone in. The eggplant with pork was good. Look out for the 2 hot green peppers in the eggplant dish. They are very spicy. So If you are feelin brave (or stupid) enough to try some super spicy but tasty food, Chez Chilli is for you.  P.S. - They do take Credit / Debit   Food -  Good Service - Friendly & Quick Ambiance - Clean (It matters in Chinatown) Worth the money - Yes"}
{"text":"This place was recommended to us by a friend. We never would have gone there without the recommendation. It doesn't look like it is in a great area and the inside has no atmosphere. But the food was really great. Service was good too. We had nothing left on our plates at the end of dinner."}
{"text":"The signature of this place is their spicy boiled fish which was actually really good and comes with generous portion.  We also tried their dry pot mushroom dish, surprised by how good it tasted. I'd definitely recommend these two for now. Will go back to try other dishes soon.  Location wise it is located in a basement. Generally quiet in the restaurant. If you are looking for somewhere romantic or scenic, this won't be the place for you.  Food: 4.5/5, service:4/5, ambient:2/5"}
{"text":"Chinese food in Montreal steps it up a notch! I'll welcome Chez Chili as a good new edition in Hunan Sichaun Dong Bei styles. My friend and I over ordered as per usual but there's nothing wrong with left overs. When they say it's spicy they mean it. Curious about the home style tofu and fish in chili and spicy green beans. I will have to say the fish was done well as was the tofu and green beans. If you're looking for something different in the Asian food world of Montreal Chinatown this is a good start.  As you can tell below, my food friend also reviewed it."}
{"text":"The food was good! The service was good! The guy was very polite! The tea was good! I enjoyed how spicy it all was! Def would go back !"}
{"text":"Looking for some warm Chinese on a chilly day! We walked around China Town looking at menus and came upon this place....mostly because the General Tso's was on special for $7.99. (Comes with rice and soup.)   You go down stairs to enter the restaurant. Nice little set up...fairly typical décor.   After asking about the lunch special (s), we went with the General Tso's (GT) and Pork with Spicy Garlic. I requested the General spicy, as it's strangely not regularly and the Pork was already noted as such.   The Pork was decent and the GT was ok. Neither was particularly spicy and 0 spice was detected in the GT. It did taste fresh/healthy, though, which to be honest, is not what I look for when ordering General Tso's.   Interesting side note: Pizza was delivered while we were eating, at which point the entire staff gathered around a table in the dining room to eat. It seemed as though service was on hold during that time.   In conclusion, the experience was kind of pricey for a bland meal. We also received no soup, but did not request it since we weren't impressed with the entrées. Probably better options within the block, but maybe our experience was unique."}
{"text":"There is no comparison since we just visit here and eat once. According to our experience. It's not even 50% good as toronto. The service was fine."}
{"text":"BEWARE!!! This place looks good in pictures, but the food is A disappointment .. We ordered a plate of lo Mien noodles (I mean how can you go wrong with pasta right??) it was horrible! The noodles were basically ramen noodles not  thick pasta like it should be. It was also cold and not very tasteful . We also ordered some sweet and sour fried pork and it was basically breaded pork grease. There was almost no meat in the pork strips just total disappointment .. I'm from Florida and Chinese fast food places over there would put this place to shame. On top of that it was very pricey. This was our second time eating in china town and had a better food experience with the same foods and paid half the price. Don't waste your money here and your time.. Worst chinese food I've ever had"}
{"text":"Clean, friendly, good prices, great flavor.  Loved my spicy eggplant with black beans.  Just the right balance of flavors.  Waitstaff was helpful and nice."}
{"text":"Awesome food!  Spicy cucumber appy was great, as was family style tofu.  We also had the eggplant in pork black bean, and special spicy beef.  Everything was great and the service was excellent.  The ambiance is VERY casual but clean."}
{"text":"Interesting. It was the most crowded restaurant on the street,  so I assume this is what Canadians like.  Flavors are quite muted. Overall pretty good, but I would describe it as minimalist. New York - NJ style chinese has much bigger flavors. Perhaps it's a Canadian thing."}
{"text":"This was probably one of the best meals we have had in Montreal. China Cafe, a Michelin starred is one of our favorites in NYC and this place is probably on par minus the presentation/decor/price tag. Service was a bit slow, but sufficient. I give the servers props for having such good attitudes when there was only 2 of them for the whole packed restaurant.   Per other Yelpers' recommendations, we ordered the following dishes: Sauerkraut fish- Milky spicy fish with Chinese pickled vegetables (fish fillets served in a casserole dish with milky soup) Mapo Tofu- no explanation needed Dongbei three treasures?-Essentially eggplant and peppers with minced meat  Everything was super delicious. We ordered it less spicy and it was still too much, but that's hard to gauge. Just know the spicy level is not for the light-hearted. Rice costs money, but tea is free.  Side note, the street is also kind of fun to walk through with tons of options for snacks!"}
{"text":"subterranean reddish-whitish szechuan-hunan haunt within montreal's chinatown.  the walls seem to map cities/towns/villages within the sichuan and hunan provinces.  tables are covered in white plastic.  our waiter was very friendly and accommodating of us.  our party of 11 ordered a number of dishes: sizzling lamb with onion, pork tripe and intestine (i think they forgot to put the tripe?), spicy fish filet, seafood fried rice, small fried pieces of chicken that had tons of small bones in it, mao's stir fried pork, and a garlicky eggplant dish.  portions were generous, and pricing is fair.  everything was distinct, spicy, and tasty, but also unfortunately overly salty and oily.  my favourites were the lamb and pork intestines.  i don't think the food is stellar enough to propel my rating to four stars, but i would still come back here to try their other items"}
{"text":"This is the best Chinese restaurant in town !! I'm especially in love with the Ma-Po Tofu and the Eggplant dish. Please give them a try you wouldn't regret it!"}
{"text":"Great Chinese food. Plus, they have Dongbei food, which is not common to find (in USA, at least). My sister and I got Szechuan string beans (always an excellent dish, and this restaurant is no exception), Szechuan salt and pepper chicken (first time trying this dish and it was good. Chicken was crispy and chewy), and Dongbei eggplant with pepper and pork (first Dongbei dish for me, and it was pretty good. Light and mildly-tasting. Apparently, Dongbei foods are lighter and sweeter than other types of Chinese food). We got a medium bowl of rice, which was huge, big enough to feed a family of 4. Probably should have ordered a small bowl, which would be sufficient for 2 people, but we were starving, so no complaining there :)   Cons:  - You have to pay separately for rice (really?) - Pretty pricey - our bill totaled $42 (in US dollars. It was over $50 in Canadian dollars) for 3 dishes. You can find cheaper and equally tasty dinner elsewhere. I come from D.C. in USA, and it's an expensive city, but Rockville (close to DC) has great and cheaper foods than this place."}
{"text":"The food here is fine and the service is reasonable. The purpose, reason be it, is for false advertising....it's not hot.  The entire menu says pepper hot and Hunan, Szechuan etc... But it's mild at best.  Wife and I ordered the spivey double pork and some other dish, nice flavor....NOT HOT.  If you want Chinese food the stop on in, but may be better in the street."}
{"text":"[Montreal Food Tour Stop #5] Delightful place for Sichuan and Hunan Chinese food in the basement of a building in Montreal Chinatown.  The menu is large and features spicy, delicious food.  It took me a while to figure out what to order and in the end, I decided to order two dinner entrees for myself.  The restaurant accepts credit card.  Dining area is medium sized.  Highlights: I ended up ordering dish D9, which is a platter of Asian eggplant, and S26, which is a platter of stir fried chicken with cumin.  I will emphasize that two dishes is way too much for one person - you will be full with a single entree.  By my foodie nature, I couldn't resist trying both even though I knew that I couldn't finish both.  The stir fried chicken was cooked well.  You could definitely taste the cumin, but it wasn't overwhelming.  Also, there was a decent amount of peppers, onions, and aromatic vegetables to provide flavor to the dish.   Certainly not a dish that's mostly onions.  I was very impressed with the Asian eggplant.  Excellent sauce, great amount of spice, and delicious ground pork with sauce.  One of the best dishes I've eaten that includes Asian eggplant.  As a note, rice needed to be purchased separately for both of these dishes.  The servers were polite and food was cooked in the promised time (around 10 minutes).  Wait times might be longer at peak hours - I went when the restaurant was empty.  Critiques: The food might be better in either Hunan or Sichuan province in China.  I haven't been there, so I can't say.  I was very happy with my food though.  No complaints.   Overall: I definitely recommend the eggplant dish here.  It was the server's recommendation and I agree that it's a dish that you should try."}
{"text":"Pretty authentic Szechuan/Hunan menu. Ordered the braised pork belly, Szechuan string beans, and spicy chicken and it was a very good meal. The spicy chicken was tasty, but tough to eat b/c they cut the chicken into really small pieces. I'm very use to eating chicken off the bone, but a small drummette shouldn't cut into 5 pieces, so I was spending too much time picking with bones. First time I've ever had to 'order' rice, so be prepared for that. Service was slow (food came out fast, but took too long to get water/tea refreshed), but would definitely come back."}
{"text":"This Chinese restaurant is great! We popped in simply because of the reviews on yelp. Although the restaurant is downstairs - the lighting was bright and clear and CLEAN. The prices were a little bit higher than we expected but it was worth it!  We ordered the corn soup to start - the waiter (who was alone!) poured each of us our bowls! The corn soup was like any corn soup you get from a Chinese restaurant. We then ordered the Spicy Fish Fillet, Sweet & Sour Pork (Which was the bomb.com) and Seafood Fried Rice.   Everything that we ordered were so good! The Spicy Fish Fillet was cooked to perfection that it wasn't rubbery but soft and can taste the spiciness of the chili. The sweet and sour pork was also very delicious! It is very different from the other version I have tasted(Toronto). This version was just so distinct that the sweet and sour pork from TO cannot compare! Lastly, the seafood fried rice was soooo good we ordered it twice!   I would recommend coming here for Chinese Food if you ever visit Montreal."}
{"text":"One of my favorite Chinese restaurant.  We reserved a big round table for 6 people. We had six dishes plus a big rice. Good portion. Finished all. Each person 18$. Great value. I recommend spicy fried chicken boneless, chili fish, cumin lamb on hot plate, Northeast 3 veggi, tomato beef stew and etc. Love most their dishes. Especially dishes number start with D and H, standing for Dongbei (northeast area) and Hunan province. The service was quick and attentive. This place is spacious than other restaurants near by.  Will come back."}
{"text":"Great spot to eat in Chinatown! I've been in Montreal for about a week, and this is among some of the best food I've eaten on the trip. I ordered the pork in the spicy garlic sauce and the fried rice, and both were delicious! I would definitely go back if I got the chance."}
{"text":"Nestled in Montreal's Chinatown, Chez Chili offers Hunan & Szechuan cuisines. We ordered hot and sour soup, which was neither hot/spicy, or too sour, but was loaded with tofu, mushrooms & egg. The Mao's pork with bok choy was savory. The pork and eggplant dish was by far the favorite. If you're looking for some authentic Chinese food, this is the place."}
{"text":"We had high hopes here. We often eat Szechuan and thought we'd try this place out. We ordered the following dishes in Mandarin. The waitress spoke mostly Mandarin.   Spicy fish in Szechuan sauce: This is usually one of my favorite dishes when I go to Szechuan restaurants so I am quite familiar with this dish. The dish came out suspiciously quickly. It was served in a Pyrex-like Tupperware container often seen and used in baking. The flavor was bland. Not enough chili. Barely any flavor. The quantity was decent for the price. I would not recommend this dish.  Spicy chicken: This is usually my second favorite Szechuan dish. This chicken must have been lost in meat tenderizer for the past week. I literally double checked at least 5 times to see that this was chicken. It had no texture at all. Almost like eating firm tofu. It had very little flavor. They didn't use dried chilis like the dish typically calls for. They added carrots, which is not traditionally added to this dish. It was so bad, we couldn't eat more then 15% of it. My daughter who's 8 months old could eat the chicken. To me this means the chicken had the texture of baby food and was about as spicy.  Tea tree mushrooms in casserole: This was decent. Pretty unique and if I'm ever feeling self-harmish and want to go back to this restaurant, this is likely what I'd order.   The service: The restaurant was full. There was only a single waitress to seat people, serve people, take orders, and clean tables. We waited forever. It's not her fault. It's the restaurants fault.   The tea: The tea was laughable. I included a photo of our tea. It had like 4 tea leaves in the entire teapot. Even after I let it soak for 30 minutes it tasted too dilute. It tasted like warm tap water with a hint of tea. The photo will explain.   The rice: Good rice. Not over cooked. They charged over $4 for a bowl.   Overall a terrible experience. Skip this restaurant at all costs."}
{"text":"went here, the other day for a quick bite. food was delicious with generous portions, and you like spicy, you'll love this place. Simple, good, decent food at a fair price. Nothing fancy, but very satisfying. A real find."}
{"text":"I had eggplant braised in soy sauce, vegetables with glass noodles, veg fried rice and tofu with peppers. I liked both the eggplant and tofu dish. The glass noodles was missing taste and flavour. Even veg fried rice was not the best. Sure a no for a vegetarian."}
{"text":"Came here at 3pm on a Saturday, very quiet and peaceful. Ordered the eggplant and fish, it was great:) Service was quick, very friendly waiter and decent prices."}
{"text":"First off:  Chez Chili does not (I repeat: does not) have skillet queso or chicken club tacos on offer.  If you're looking for Chili's, you'll have to look elsewhere.  Secondly:  Chez Chili is not easy to find.  If you're looking for the entrance on Clark, you'll be out of luck--you're going to have to swing around to de la Gauchetière to find a way in.  And it's tucked away in a basement, so the address is actually \"1050-B.\"  Thirdly:  Chez Chili's decor ranges from the Sinological to the surreal.  The walls are adorned with boldly graphic cultural lessons.  Off in one corner, however, stood a lonely half-size traffic sign (\"SLOW\") that appeared to have been transformed into a clock.  A broken clock.  Eat your heart out, Salvador Dali.  Now that we've dealt with those pressing issues...  Chez Chili features a menu that represents three distinct regions of China with three distinct cuisines:  Hunan, Sichuan, and Dongbei (a.k.a., Manchuria).  Montreal's Chinese New Wave has been spearheaded by Sichuan cuisine and, to some extent, Hunan cuisine.  If you're looking for a Manchurian candidate, Chez Chili just might do the trick.  In typical Chinese fashion, the menu at Chez Chili is fairly extensive, and I've yet to figure out what all the hits and misses are, but a fairly random survey turned up a couple of exceptional dishes, and a number that were less so.  The great:  the Sichuan lamb with onions and cumin was a stone-cold winner--the kind of dish that has you thinking about \"the next time\" even as you're eating it for the first time; there was also a mushroom casserole (Hunan, I believe) that was really squeaky (you'll see what I mean when you start chewing), but also really appetizing, and a welcome vegetable dish.  The good:  spicy chicken knuckles could have been more generous on the meat-side, but was near-hallucinatory on the spice side; twice-cooked pork was just good, as were the dry-fried green beans.  The forgettable:  Dongbei-style cabbage with glass noodles looked interesting, but was strangely bland; fried chicken strips was like a Chinese chicken schnitzel covered with chilis, which sounds pretty great, but, unfortunately, was characterless.  I could see my rating for Chez Chili going up once I've had the chance to explore the menu a little further (I'm sure there are more gems in there somewhere), but for now...  Worth checking out?  Absolutely."}
{"text":"It's honestly 4 stars when you take altogether the cleaniness, spot-on service and more than okay food on a strip where all you should expect is soft and gooey general tso. The decorum could be better, but hey... those bubbly eyed customers don't give a crap... and that's alright.  Oh! Et ils parlent tous PARFAITEMENT français!"}
{"text":"Despite the basement location, the interior is nice, as was the service. I had the Ma Po tofu lunch special and it was appropriately spicy and very tasty. I will definitely return."}
{"text":"Probably one of the best chinese places in Quebec, especially if you like spicy food. I can't say the flavours are 100% authentic, but the food sure taste brilliantly good. Downside is, there seems to be two chefs in the kitchen: a head chef and a cook. The cook is probably an apprentice who cooks only certain dishes. Either that, or his taste and mine don't align."}
{"text":"I was torn between a two star or one star.  After receiving the bill, it's decidedly one star.   Of the three dishes we ordered, one was good: the tea tree mushrooms. I've never seen this on a menu before, and the dish was deliciously flavored.  It did contain thinly sliced fatty pork, which was also good. The  fish in chili broth was passable, though for the price, I'm used to getting more (in the states).  The spicy szechuan chicken dish was nothing that I recognize. Normally, the chicken  is coated, deep fried and cooked with dried chili's. The dish served looked like some  americanized  (canadianized) stir fried Chinese dish in brown sauce. Chicken was mush. Don't know how that was managed.   The restaurant needs to hire at least one more person. There was one poor girl responsible for the waiting and bussing of all 6 tables.  My baby started crying as we were finishing up so I told my husband I'd wait outside. It ended up being a cold 15min before he came out.   The final straw was paying $4 for rice. You're a Chinese restaurant. Rice is cheap and should never be charged.  I would not recommend wasting a meal at this overpriced inauthentic restaurant."}
{"text":"Not bad, i have a decent general tao, the place is the basement, no windows so for me that was a very fast stop to eat quickly ;)"}
