{"text":"St. Henri is just percolating with new eateries that delight the taste buds and our latest little treasure is Chez Fred's on Notre Dame St, just a few blocks from Atwater Market.  
I popped in on their very first day at this new location and, even as they were still setting up decor, it was clear that this is going to be a neighborhood favorite.  The breads are beautiful and varied...the buckwheat, poppy seed baguette I took home for dinner had wonderful flavor and texture and was a hit with everyone.  I also ordered an almond croissant to eat there and it was pure buttery, flakey, almond yummy-ness. I went back a few days later to try one of their tarts and ordered the citron cream one...all I can say is, wow! Yum! I am now on a mission to try everything behind the glass counter!
We have great pastry in Montreal...but this little place reminds me of the little shops of long ago...a great little place in the neighborhood with fresh breads, croissants, pastries, desserts and tarts deliciously waiting to make regular days special and special days exquisite.  Thank you for bringing us such an adorable little shop!"}
{"text":"Petite boulangerie de quartier qui sent divinement bon lorsqu'on rentre à l'intérieur! Beau: les pâtisseries sont des petits joyaux Bon: fraîcheur, goûts intéressants, café riche Pas cher: meilleur rapport qualité/prix que la chaîne populaire du Marché Atwater  Personnel attentionné, souriant!"}
{"text":"My go to place for my cheat days! It's right next to work and their almond chocolatine's and croissants are to die for. Always greeted with a nice friendly smile, my co-workers from Centre Dentaire Atwater and I love this place!"}
{"text":"Incredibly good pastries, no joke. Good coffee and great prices too. Will be coming back anytime I'm within a half mile radius :D

I got an almond-chocolate croissant, Americano, and chocolate mousse cake something (\"Caracas\")."}
{"text":"Everything looks so good. I couldn't decide so I opted for my usual---almond croissant and a latte. It was crisp and delish.  The staff was so super nice and very welcoming. Extra bonus when cashier had zero qualms about me paying in coins. Lol....  Hey, money is money!  He empathized with me as he did something similar at a bar with a much higher bill. Everything is baked fresh every day.  This is the smaller location, not much of a vibe other than a bakery. I brought a book I needed to finish so was hoping for a better ambiance but the food and staff was good enough for me to stick around.  Definitely give them a try when you're in the neighborhood."}
{"text":"Homemade , Organic, Fresh. Breads, Pastries, Viennoiseries, Quiches . Produce every day with french love and french artisanal skills. 

Fait maison, Bio, Frais. Du pain , des gâteaux, des viennoiseries et des quiches. Produits chaque jour avec amour et savoir faire artisanal traditionnel."}
