{"text":"I visited a few weeks ago. They had a set menu, which was a great value & others seemed to be ordering. We started with warm olives but returned them due to the quality & we were comped. My husband said his steak was good, however my duck was mediocre. They did have amazing speciality coffees & our waiter was fantastic. 
I would return for the set menu"}
{"text":"I really wanted to love this place the menu options appeal to me and I'm a fan of the college street vibe.
However it was hard to be impressed with the uneven service and food. 
The great
The smoked Manhattan and half price wine Wednesday night (note this is only on a few selected bottles).
The good
The octopus risotto was very tasty and had ample octopus. 
The bone marrow was very tasty its only one bone but super tasty at 16 the flavour makes that a good.

The not so great
The tuna tartare was overwhelming wasabi and strangely large quantities of bread to tiny tuna was just a bit odd. 
We had ordered the single tartare and the bone marrow fpr apps waited a very longish time (they did apologies and they didn't seem busy) but they brought the wrong ones...the trio and a poutine. Despite having repeated the order back to us. 
They took them away and did bring the correct order but i think a drink a dessert a something fpr a long wait and double mistake would have been appropriate. 
The bad
The brownie dessert it was super cold to the point of hard brownie and the mouse had sheet gelatin still in it...not tasty at all.
The server tried multiple times to remove our plates while we were still eating...

Overall it still has potential but i was underwhelmed."}
{"text":"Chez's Restaurant is created by Mike Bradshaw that was inspired by his experience as a chef in Europe for a decade. He worked at two Michelin-starred restaurants and decided to bring a French bistro with European influence to Toronto.

I had the pleasure of trying two of the appetizers, which were the Scallops and Cauliflower Salad. My favourite out of the two was definitely the Scallops. The tarragon jus added a sweet and tangy flavour to the scallops. The Cauliflower Salad was okay, but it didn't stand out and I would not order it again. The Rum and Eggnog is a delightful drink for anyone who's feeling festive this winter. I found the 1 oz. rum portion to be a lot stronger in taste than I expected. However, it's perfect for anyone who is a fan of rum and eggnog!

Ingredients are always made fresh and kept no longer than two days. Mike tries to keep waste to a minimum by only buying required ingredients for the day and if he runs out, the menu item would not be available for order. On top of that, Chez's Restaurant gives back to local communities by donating to non-profit organizations, including Covenant House. Mike provides full meals for those in need or donate leftover ingredients.

Chez's Restaurant has a higher-end pricing but the menu is not permanent and changes out seasonally. There will be a Christmas menu released during the first week of December. You can either choose between an a la carte menu or a prix fixe menu for the upcoming holidays."}
