{"text":"Stopped in for a quick bite before we hit the road back into the states.  Very solid place.  Not the most amazing crepes in the world but still very good.  Would really like to give 3.5 stars but since I can't do that I'll give it 3 because rounding up to 4 would just be a little too much for this place."}
{"text":"Charming little creperie on Rue St-Paul.  Very good menu and wonderful pitchers of sangria.  Yes, touristy, but a great lunch spot.  Excellent wait staff."}
{"text":"I've been here many times and I would definitely return! Located right in the heart of old Montreal, I feel like I'm in Europe when I come here for crepes. Their cheese fondue was also delicious and worth ordering! I haven't had the best service because the restaurant seems a little slow, especially more so when the restaurant is busy. But their crepes and fondue keep making me come back."}
{"text":"These were by far the best crepes I've ever had. Even one of the better meals I've had. We got the apple, cheese, and maple syrup crepe and a strawberry, banana, and chocolate. The apple crepe was amazing.  As the case with most places we went to in Montreal.  The service was a bit lacking, but very polite.  The restaurant itself was also very charming and good for people watching."}
{"text":"Generous, delicious portions.  We got the crepe with shrimp and chicken ratatouille crepe.  We barely were able to finish them:  They only take Amex and MasterCard."}
{"text":"The food was amazing! Our server Oliver was excellent, helping our daughter find just what she wanted. The atmosphere was comfy and authentic. Altogether a wonderful experience!"}
{"text":"Oh my gggggawwwwwd. If i ever want to get really fat i'm just going to live here and go nuts eating crepes and quiche while drinking whipped cream covered cappuccinos. I came here with three other friends on a recent trip to Montreal and all of us had to roll out of the restaurant after. It's the kind of place you go to where the portions are huge but you still eat the whole thing because it's so damn good.

One of my friends and i got seafood crepes, which was delicious because- lets face it- everything is good when it's covered in baked cheese and is filled with rich, creamy bechamel sauce. Another friend got a bacon and avocado crepe, which he said was good, but after seeing the deliciousness of our seafood crepes he felt like he could have made a better selection. Another friend got the quiche, which looked amaziiiiing. The crust seemed really golden and flakey. My cappuccino was also delicous... And that would be because it arrived covered in whipped cream and chocolate powder. If they had asked i would have said no whipped cream to try make a tiny attempt at being healthy, but if it arrives that way i'm not gonna complain!

I'll definitely be back here next time I'm in Montreal! I try to eat healthy, but when i don't i love splurging on food like this- so damn good and totally worth the food coma!!"}
{"text":"I was worried that Chez Suzette would be touristy, given its location. Boy was I wrong! I had the La Laurentienne which was absolutely perfect. I had the La Sonia wrapped up to take home because I couldn't pass up dessert :)"}
{"text":"With all of the French choices on Rue St Paul this was a pleasant surprise. Very authentic and pleasing."}
{"text":"My boyfriend and I stopped here on a whim.  Thank goodness we stayed for a table, the food was amazing.  If you like crepes and seafood you must try La Neptune.  It's a bit pricey,  but oh so good.  La Quebecois is also very good.  Very filling as well."}
{"text":"Sehr gut besuchtes Restaurant mit einer guten Auswahl. Etwas laut war es dadurch."}
{"text":"I'm not sure about what was mentioned about being Asian. We were 11 Asian people and was turned away that they didn't have one table or even two tables to accommodate 11 people. Unfortunately, we didn't get to try their food. Surprisingly from what I read from the reviews, they are 3 floors but no tables to accommodate a group of 11 people. I want to give it 0 star but there's no option in Yelp to give 0 star. It wasn't even worth the 1 star."}
{"text":"this place was so cute! stopped by because my brother had wanted crepes and were pleasantly surprised to find this place! i had a savory crepe while my brother got a dessert crepe and both were excellent. staff was super friendly. pretty decent prices too! if i were to visit montreal again this place is a must visit!!"}
{"text":"We went to this restaurant for a french breakfast since we love crepes, but it was a disappointment. The crepes were not good and the coffee was TERRIBLE. We were taken to the third floor where there was some construction going on and this guy was using a very loud drill. The waitress was unfriendly and even when we complained about the coffee she did not apologize or not charge us for it. Bad food and bad service and ambience. I would never go back here."}
{"text":"The place truly deserves to be the ambassador of pancakes in Montreal. And Montreal being one of the most multicultural cities in North America, this reputation is extremely important. 

The do serve the tastiest pancakes in town and the natural selection of ingredients they use in their pancakes, make them melt in the mouth..."}
{"text":"Had read good reviews about this creperie so decided to stop in for a late night snack/dessert as I was walking through Old Montreal on a recent trip. Ordered the lobster bisque w/cognac which was amazing, and their La Laurentienne crepe (ham, Swiss cheese, asparagus, w/bechamel sauce). Absolutely delicious. 

Restaurant itself was nice and cozy with available upstairs seating. Very affordable. Highly recommended."}
{"text":"A great crepe place. Good drink options for day or night. The smores crepe was big and absolutely delicious. We had a great table by the window on the second floor, with a view of the entire street. The service was good and all of the staff was very welcoming. The savory crepes may have been a little low on salt, but still very well made."}
{"text":"I am a huge fan for crepes. But I have to say it is disappoint after dinning over there.
We have tried Shrimp crepe, chicken crepe, ham crepe, and dessert crepe. I like crispy crepe but the style of this restaurant is soft with heavy gravy sauce. None of us finished our crepe. Won't be back."}
{"text":"Hard to make a crepe tough and chewy, but that's what we ended up with at Chez Suzette. Staff was polite, location convenient, creperie is multi-floor so can accommodate very large groups, but the crepes not so much. I ordered a banana and Nutella crepe which I've had many times before, but even that delicious filling combo couldn't overcome the cardboard texture of the premade or just overcooked crepe. My husband had the onion soup and rated it a little above average."}
{"text":"Came for a dessert crepe on an evening and we tried 'La Jamaicaine' which had banana, ice cream, and Belgian chocolate sauce. The fixings were delicious but the crepe was a bit tough and chewy.  It seemed to have been made ahead of time and reheated.  A bit disappointed. First time there so not sure if it was an off night.  The service was very good and friendly."}
{"text":"Loved the 3 meal selection. Cheese fondue, beef fondue and chocolate fondue. Great time with a great person and great location."}
{"text":"Apple Brie crepe was delicious with warm maple syrup. Seafood crepes with cheese was terrific, though the small shrimp weren't as fresh as I would prefer. Service very attentive, just right. Definitely would go back."}
{"text":"We made a day trip to Montreal.  We ate here on a whim.  I was a little disappointed with the ambiance.  However, with two children, we weren't intimidated either.  We have taken our children to eat all over in Europe.  Unlike Europe, we felt our kids were welcome.  The food was decent;  we ordered the crepes for two and two kids plates.  I was full when I finished but not stuffed.  We don't eat crepes often but  I found these on par with what we had experienced in a similar restaurant in France (minus feeling the kids were not welcome).  Unlike some other posters here, I thought the crepes were pretty good.  Service was slow by North American standards but quicker that what I would expect in Europe.   Overall, we had an enjoyable dinner that was definitely better than a comparable restaurant in the US.  I thought our waiter was great.  He was very friendly although he did get a bit riled when he asked who I thought had the best hockey team.  I had to mention I was in Pittsburgh the day the Penguins brought the Stanley Cup to town :-)"}
{"text":"Long story short: disappointing. Went here just for a nutella/banana crêpe. Servers were friendly but service was average at best. I had to chase a waitress to place our order and to ask for water as no one ever came to our table initially. The crêpe itself was overpriced and nothing special. The worst part was that there were a ton of spiders in two corners of the restaurant, which was quite disturbing. At one point they started to come down over a couple that eventually moved. One of the waitresses got on top of the tables to swat  all the spiders away while customers were eating - just ridiculous. I say go to Chez Catherine just down the block or Juliette & Chocolat over in Downtown Montréal."}
{"text":"Another must when visiting Old Montreal. Service was good, and the food was delightful. From the light snack to the decadent desert, you can't go wrong here."}
{"text":"Went in not expecting much from this place, menu outside didn't seem particularly interesting, but it was open and we were hungry on Good Friday. I ordered the roast beef sandwich thinking I just wanted something basic and was disappointed they didn't have fries as an option. To my pleasant surprise the roast beef was delicious (I assumed I'd be getting some garbage grocery store cold cuts) and the garden salad was surprisingly satisfying. I generally dislike salads, but this one was so fresh, well-composed and with a nice understated dressing that I couldn't say enough good things about it. Wife and Boyd's had crepes which also went over well"}
{"text":"Cozy atmosphere with a European feel. Menu was diverse, and the waiter was helpful. 
On a cold day this is a great place to go for amazing French onion soup and a glass of wine."}
{"text":"Discovered this awesome place back on my first trip to Montreal in 2008, then went back again this past summer on my second trip up to the city. Both times I ordered the crêpe La Cabane à sucre (consisted of egg, ham, and Quebec maple syrup), and both times, I was not disappointed! I also had the pleasure of taking a few tastes of my brothers cheese fondue, which was also very good, albeit very hot. Definitely do recommend if you find yourself walking through Old City!"}
{"text":"I had my very first crêpe here a few years ago and I've addicted, ever since. 

This beautiful, romantic, little crêperie is well worth a visit. The atmosphere and food were amazing and made a lasting impression. I'll never forget this place and hope to return someday. Highly recommend!"}
{"text":"Nice crepes, service is capable and basic but ok. The ambience is almost like a  family owned and run cafe somewhere in Europe. Free wifi."}
{"text":"Was looking for a low-key kid friendly place while visiting Montreal.  This place was great and fit the bill perfectly.  We were in search of dinner, so didn't have the chance (or the room in my stomach) to try a dessert crepe, although they looked amazing as everyone else in our section appeared to be there solely for dessert.  Wife ordered the French onion soup and the Montreal crepe, which she enjoyed.  I ordered the shrimp crepe served with a nice lobster sauce.  A lot of shrimp included in TWO crepes.  Very yummy.  Kids just got spaghetti and milkshakes which got good reviews as well.  Probably a bit more expensive than I would normally spend for my family of four, but very good nevertheless.  It took awhile to get our food, but the waiter (Olivier) was super pleasant and professional very quick to get our drinks refilled.  Super service."}
{"text":"We waited outside for about 10 minutes on line for a table seating on a Saturday night. It was probably one of the shorter lines of all the restaurants in the area. I guess that's what a summer night in Old Port is like! I ordered the La Mediterraneene main course crepe with chicken, ratatouille and mozzarella cheese. It was a bit bland and the cheese was not melted as smoothly as expected. My friend had the Neptune crepe and it was a bit salty and too cheesy for her taste. The rose Sangria was tasty and refreshing. Service was not too attentive. Maybe next time we should have tried the fondue or crepes for dessert instead."}
{"text":"Les hôtesses a l accueil de la terrasse ne sont pas agréables ( pas de bonjour, pas de possibilite de choisir sa place malgré la dispo). Serveuse sympa a l intérieur. Cote cuisine, je ne suis pas difficile et ne critique pas souvent, mais la c est inadmissible, des crepes desséchées a peine garnies..."}
{"text":"Great ambiance.  Service was excellent and very informative.  Presentation was topnotch even for simpler dishes.  Soups are delicious.  Reasonable prices as well considering how expensive that area can be.

Servings might be small for overeating Americans but I liked it.  Some people are just used to seeing loaded up plates with extra food they don't even touch. 

The nutella crepes could've used more nutella so just ask for some on the side.

Hot cider and wine looked great but we didn't get a chance to try."}
{"text":"Services was impeccable and friendly to both the Anglaise et French. Super quaint main floor with additional seating upstairs. This old Montreal eatery feels like it's cut from the street of Paris. 

Great selection of all things classic French with an outstanding French onion soup. The French onion soup is accented with exceptionally thin slices onions, a savoury scratch broth hinting a sweet after taste from the onions. A perfectly sized 1/4 inch slice of sourdough baguette adorns the surface blanketed by a rich creamy Swiss cheese. My favourite note of this soup is that it is not overloaded by onions and bread. It's constructed with 3/4's brother with the other quarter made up of onions, bread and cheese.

C'est magnifique!!!"}
{"text":"I found the food light and flavorful. Very balanced. Service was terrific. Le Parisienne crepe was great as was Swiss fondue."}
{"text":"This quaint little French restaurant is in the middle of Old Montréal, so my family and I had lunch here. I ordered La Parisienne, which was delicious and came with 100% Quebec Maple Syrup. The restaurant was a bit small on the inside, but it did have enough room. We were seated by the window, which was pleasant and warm. Our waiter was attentive, and service was prompt. Overall, loved the experience and would recommend."}
{"text":"I was suspicious of a resto in this busy tourist place but it resulted great! It is a spacious place with three floors and a large menu as well. I had the chicken and mushrooms, i found it savory and with really chicken flavour delicious!  Our waitress Pedro was fantastic!! Muchas gracias."}
{"text":"This was an amazing late afternoon Crepe stop while we are in town. Great service and super quick. Really cute location. The server was so sweet and attentive. 

We got a Nutella and banana crepe and a le remy hot drink. The Crepe was huge perfect for two people. Super Lux and wonderful."}
{"text":"Over priced compared to other really good restaurants in the area with beautiful decor and the food here is very shitty with no flavor what so ever.

I stayed in Montreal for almost 2 weeks and this was the most disappointing brunch my family and I had here right before concluding 2017. 

There are soooo many other good restaurants to choose from in the area, so please skip this place. I can't believe it even has 3 1/2 stars. The only reason we went there was because most restaurants were closed on New Years Eve and didn't have an option for brunch and this was the only place open that was walking distance.

The decor and food does not live up to the over priced crepes and fondue."}
{"text":"Rubbery crepe, stick-like asparagus (even though it is asparagus season!!), and terrible, horrible service. Plus, there isn't really wifi, even though it says that there is. When we were there, the credit card machine was broken, and you would have thought that there was a major world crisis with the complete inability to deal shown by the staff. Blech. Give it a pass."}
{"text":"Seriously great French onion soup. Cheese baked on top and bread soaked inside. Perfect for q cold day. The crepes were coked perfectly, I highly recommend the banana and Nutella. Hostess quite rude but the waiter and manager were friendly."}
{"text":"Pre-Made disasters:

Unable to accommodate my anti-ice cream needs. As a strong advocate against ice cream culture i feel offended and unsafe in this disgusting restaurant. I requested my crepe to be ice cream free but was aggressively denied this basic human right."}
{"text":"I love this creperie in Old Montreal. I sat facing the window that opened up to the street so everything taste better you know? Had savoury crepe with melted brie cheese, sauteed onions and believe chicken? The half melted brie did it all... It was so good. The cafe au lait I ordered was only mediocre though, for $3.50 or sth I expect better cup of coffee! But it's ok the crepe was so good. I was pretty full to try any dessert crepe but for sure I'd love to come back."}
{"text":"Wonderful. Great food (we had fondue, cidre, crepes), amazing service, very decent prices. We loved it."}
{"text":"Chewy crepes, hard to digest. Overpriced for the quality. Touristy."}
{"text":"By reading some good reviews, my husband and i went the first time on december 29th, 2011. we were led to sit on the first floor at the right side of the entrance. during our meal, we were surprised that almost all other customers were led to the upper floors. it was at least -15 celsius degree outside. our table got all the cold air every time the entrance opened and closed. we rushed to finish our meal in half an hour as the temperature got unbearable.  i talked to the waitress about the problem and she said she could not do anything about it and asked me to talk to her boss. i asked her again when we checked out . this time she said she was sorry and she was the manager . she took our drinks out of our bill. overall, it was a disappointing meal. we felt that we had been used like a department store window display to attract more customers for them. we will not go there again."}
{"text":"Dined here while on vacation this past summer & LOVED it.  Let me preface by saying that our hotel (L'Hotel, formerly the 19th Century) was in Old Montreal...more than one person advised against the neighborhood (\"it's touristy, it's expensive, it's not near anything,\" yadda yadda)... But we thoroughly enjoyed Old Montreal - we were near the water (summer weekly fireworks!), within walking distance from Jazz Fest & were able to navigate public transpo to other areas of town (Plateau/Outremont/Mile End, etc.) rather easily.  SO that being said... I guess this restaurant (suggested by our hotel) falls into the \"touristy\" category because of its locale & its \"more mid-priced than dirt-cheap\" prices.  Whatever... what mattered to us was that the food was YUMMY & had we had more time, we would've eaten here again!  The menu offers a wide selection of crepes & non-crepe offerings.  But we were cravin' crepes so we split a \"Sugar Shack\" (ham, scrambled eggs & maple syrup) & a \"Sonia\" (strawberries, bananas, ice cream & chocolate sauce).  Both were absolutely scrumptious!  Great coffee too.  Located off historic & scenic St. Paul, this place looks tiny & quaint from the outside but it has multiple comfy & charming dining levels inside.  Our server was attentive & friendly.  We would definitely like to return some day to try their other crepes!"}
{"text":"Awesome food and service make this a wonderful place to grab breakfast, lunch or dinner. I got the Sugar Shack Special and was loving every bite. 

That said, it's Old Port so it is on what I would consider the pricey side. One crepe and a drink will run you about 30$. If you're okay with that, enjoy!"}
{"text":"Went into Creperie Chez Suzette as I needed an early dinner and surrounding restaurants were not open for dinner yet. I was surprised that it serves savory crepe, in addition to the dessert crepe. As the weather was cold, I elected to order a soup, and a ham-cheese-spinach crepe. Perhaps savory items are not their specialty, and the choice was rather limited. So I shall be on the reserved side and rate it low for the savory crepe. Perhaps the sweet crepes will be better. The service was reasonable."}
{"text":"We were in a pinch for food and came across this neat little crepe place on Rue St Paul.  Great central location in heart of Vieux Montreal.  Excellent spot for people watching.  Our server was excellent.  I did not try the crepes but I had the coquille aux fruits de mer, which was a magnifique dish!  Highly recommend this dish!  The shrimp and scallops mixed with the mushroom, white wine and lobster sauce topped with cheese was unbelieveable!  It was not big portions but it was enough to get me by in the early afternoon."}
{"text":"The food here is simply amazing, but the prices are steep for crêpes. I would give this place four stars if it were just a bit cheaper. If you're not too concerned about the extra few bucks, don't hesitate to stop in here. The location is excellent."}
{"text":"This was an unexpected treat. Food was fantastic and priced right. I read the review here on the fruiti du mar which was given a \"to die for\" comment so I decided to try it. While it may not be \"To die for\" it is very VERY good. I could tell the seafood was cooked fresh as the shrimp was done to that perfect slight crunch and not over cooked to a chewy consistency like some seafood pies. My wife had the Quiche Loraine which she said was as good as mine and the crust may be better. I tasted it and she was right. My son had the the Ham cheese and asparagus crepe and French onion soup he ranked as a 4 and 5 respectively. As for the ambiance, the pictures say it all. Oh and of course we had desert crepes with cappuccino as well. Mmmm."}
{"text":"On our first visit to Montreal, we visited Creperie Chez Suzette twice.  The first time was for dinner, and both consumed two dinner crepes.  They were wonderful, so we elected to have the fruit flan style dessert crepe between us.  It was also sensational.  The sauces really made all the crepes flavorful, and delicious.  We were on a Road Scholar tour, and had three days to explore old Montreal.  Again, for lunch today, we elected to visit again, and twelve other people came with us after we had shared our experience the previous night.  We ordered French Onion Soup, and it was also fabulous.  The others from our group also said their experience today was superb.  We had an outstanding male server on the second floor.  It made our day!"}
{"text":"Had their crepes Parisian that was excellent. Very good service from a friendly waiter who spoke three languages"}
{"text":"We had a friend visiting Montreal from the States for the first time, and figured crepes were a must! We happened upon Chez Suzette in the old port late Sunday morning, and were seated right away (there are 3 floors!). 

I had the French onion soup au gratin ($8) and escargots ($7). The escargots were delicious and garlic-buttery, served with little white dinner rolls. The onion soup was also very good - lots of cheese, flavourful broth, and soft onions. The bread in the soup was quite soggy, and would have been better if toasted first. Regardless, it was a nice bowl of comfort.

Our friend had the crepe with apples, brie and maple syrup ($14).  It was amazing! The crisp apples and gooey cheese were the perfect combination.

My boyfriend has the special delice ($14) - a breakfast crepe with eggs, meat, cheese and mushrooms - and loved it. 

The service was good and relatively fast. 

Will definately go back!"}
{"text":"We went here right before closing for dessert. The staff was very pleasant and took our order and served us promptly. We enjoyed the casual, small atmosphere. Nothing fancy inside but the huge crepe made up for it! The crepe was very large, could be shared by two people if you want...The crepes are not your usual very think kind, they are a little thicker and I needed a knife to cut mine. However, it was good, the fruit was fresh, the ice cream was good and the staff was smiley and good natured. I felt bad for people who tried to come in after they turned the sign to \"closed\". I would've thought that they would've stayed open later but closed at 9.
In the middle of Old Montreal. Also saw a couple having the hot fondue dinner - looked very yummy and they said it was good! they ended up having 2 plates of meat. This place is good for couples, families, singles."}
{"text":"GREAT find by accident. We were seated upstairs, at an adorable, sunny table for two overlooking the street below. Such a wonderfully quaint view. We ordered and shared the crepes la québécois and la delice  aux Framboise. Both very delicious! I plan to return before our visit to Montreal is over this weekend! You have to try it out!!!"}
{"text":"What's not to love about this place... yummy savory crepes and cafe au lait. We liked the crepes so much we came back twice during our trip. I love the egg, swiss cheese and avocado crepe. 

The restaurant looks small with limited seating until you walk upstairs to go to the washroom and discover an extensive upper dining room enough to seat 50."}
{"text":"Our second trip to Montreal in three years and we end up here again. The crepes were delicious, fondue is a great appetizer, our waiter was super friendly. Second floor dining gives a nice view"}
{"text":"Great service and Crepes we're incredible.  Highly recommend this place when in Montreal"}
{"text":"OMG

Love their crepes.  Had their la sonia crepe and a latte which ended up being $20.  But oh so delicious and filling.  Instead of having it as a dessert, that ended up being my dinner.  The crepe was thick enough to withstand the fillings.  It's not that thin where you can't even taste the crepe.  And they sure are generous with the fillings.  Delicious.  Latte wasn't strong enough though."}
{"text":"Fair value, quality and setting for Old Quarter.  Warm goat cheese salad and BLT panini were very good, and apple dessert crepes did not disappoint."}
{"text":"This was the very first restaurant I ate at in Montreal. I had extremely fast service and the food was to die for! If you in Old Montreal, you must stop by and check it out!"}
{"text":"Excellent menu, well-prepared tasty food, decent prices, very friendly service, perfect location in Old Montreal."}
{"text":"Love this place. One thing to mention is is you go with a group of friends is great to share if you are into that. Crepes are big and quite filling, so i always like to share so i can try a few other types :)"}
{"text":"This was the perfect place to stop for crepes for dessert after seeing a show. Their Crepe Suzette, while not served flambé, was delicious."}
{"text":"This was a delicious stop for lunch...in fact so good we came back for a late dinner after Cirque de Soleil ended.  Lunch was desert crepes and my granddaughter declared the Sonia the best thing she ever ate!!!!!  My son, who is violently allergic to eggs, really loved the fondu.  Go there!!!"}
{"text":"I had the lobster bisque which was just okay. It was a bit bland for my taste but was decent. I also had a dessert crepe...I don't remember the name but it was pretty good. It had bananas, almonds, and was served with ice cream. Service was also good. Our waitress was friendly and attentive. If you're walking around Old Montreal and want a quick bite, pop in and get a crepe! 

*tip: free wifi!"}
{"text":"We've been to Montreal 4 years in a row for vacation (an annual music festival keeps bringing us back) and we always eat at Chez Suzette twice. Once for yummy savory crepes and once for decadent fondue! The salads are nice too.

The first time we got the fondue, we went for 2 servings which was WAY too much for 2 people. Get 1 serving of cheese fondue and you'll have room to enjoy the salad and maybe a dessert. 

Personally I didn't LOVE the chocolate fondue b/c it was not sweet enough for my tastes. But everything else I've had here was really wonderful."}
{"text":"Maybe it's because I've probably only had one Crepe in my life before this point, but I was very impressed.  I stopped in for breakfast on a Sunday morning and could not have been happier.  I ordered a Crepe with scrambled eggs, ham, bacon, cheese, and pure maple syrup.  I'm not sure what it was that made this breakfast that was seemingly identical to every other breakfast I would get at a diner, but it was outstanding.  

After that I was told I had to try a dessert Crepe so I split one with my coworker.  We got one with chocolate sauce, bananas, strawberries, and vanilla ice cream.  My mind was blown.  I'm very happy that Chez Suzette opened my eyes to the world of Crepes.  I'll probably be back for more next weekend."}
{"text":"Crepes were ok but I thought they were expensive and not as nice as the ones you get in Paris or even from a street truck in Ireland. Waiter was extremely rude and when we tried to leave without leaving a tip he brought our attention to it which made him even more rude. For two people to have crepes and hot chocolate, it cost almost $50. We could of went and had dinner somewhere for that!"}
{"text":"Wonderful food and service.  We went for dinner after arriving In Montreal with our 3 kids.  Server was great and friendly.  We loved the cheese and chocolate fondue."}
{"text":"I love this place. The rougemont is done to completion! I come here every time I'm in Montreal ... And the espresso is has great body"}
{"text":"Excellent place, and a big variety on the menu.  Crepes, fondue, and quiches.  A massive drink menu, too!  Highly recommended."}
{"text":"old montreal just does food right. our waitress was a professional. we ate outside along the cobblestone road. the table was slightly small and wobbly. we ordered coffee, mocha and crepes. they also give you a small sample of canadian maple syrup w your plate that i dipped in my crepe. everything was delicious. the timing of food being delivered and the quality of food is something that we found to be consistant with all of old montreal's diners. an awesome place for food in general and this place is no different."}
{"text":"Food was okay. I went for lunch and I got the chicken club, and it wasn't anything special. The interior was very nice and clean, and the location was perfect. The prices were very fair, especially for the location. The sandwich and side salad cost me about $9 CAD. I also got a smoothie called the CocoLoco in addition to my sandwich, and that was probably one of the better smoothies I've had in recent memory. Would I come back? Probably not. The food wasn't bad by any means, it just didn't stand out to me as a place I must visit when touring the city. Nevertheless, it was a decent place to eat in Old Montreal without blowing the wallet."}
{"text":"A delicious find in Ville Marie!! Excellent for brunch, lunch, dinner, and dessert!! Food and service were top-notch in a relaxed setting. It feels as though you are eating in your Mémère's kitchen!!

I enjoyed their quiche lorraine- light and fluffy single-serving quiche (not cut from a larger pie- instead made just for one). I subbed in the onion soup instead of the greens--- TOTALLY worth the $4 suppl. charge. My friend got the brie sandwich with the caramelized inions ... YUMMM!!! Served warm on a toasty baguette-- perfect for a chilly winter's day.

We were pleasantly surprised when our FANTASTIC server brought us a FREE strawberry shortcake milkshake!! It looked amazing and tasted even better!!

Merci beaucoup, Chez Suzette!"}
{"text":"They don't open until 11:30 so don't plan on stopping here for breakfast. We risked a trip here despite the reviews since half are rave and the others not so much. Unfortunately we too experienced the hard crêpes and have definitely had better elsewhere. They do have many filling options and while they tasted fine, the crêpes themselves were extremely chewy and not a normal consistency that you would expect which lends an odd mouth feel to the dishes. Thankfully the midday special is half off any crêpe so we didn't have to pay full price for food that was only so so. I ordered the hot cider that was mentioned in the rave reviews and was not disappointed as it was tasty. The large lemon and orange they put in made it difficult to drink so I just removed them.  The special board when you walk in advertised cidre chaud et vin chaud. I ordered the cidre and my husband ordered the vin chaud. He repeated his order multiple times in both English et français but was served a regular glass of wine with his order. I would not eat here again, there are better crêperies and better service."}
{"text":"This is a typical Old Montreal tourist-centered dining experience. No repeat business expected. Omelets are chewy, filled with canned or overcooked vegetables and served with fake maple syrup. Real maple syrup costs extra. Drinks come from the fountain or an old coffee pot. Nothing interesting here. If this is the only crepe you've ever eaten, I pity you. Go elsewhere regardless."}
{"text":"Great dinner spot.  Staff was attentive and the food exceeded expectations."}
{"text":"Fantastic crèpes - highly recommend. Great service as well. Highly recommend! Big variety of things to chose from, and the coffee was good"}
{"text":"Excellent breakfast crepes. We all enjoyed this place. A little pricey for breakfast but what can you expect from Old Montreal.

No ambiance. Decent coffee. Worth going to if you are staying in Old Montreal."}
{"text":"I happened upon this Creperie while on a morning stroll down by the port. The servers were friendly and accommodating beyond my expectations, the pear and Brie crepe I ordered was delectable, and the freshly squeezed orange juice was refreshingly delicious."}
{"text":"Cozy ambiance and delicious food. Their soups and garlic bread are out the world. Crepes are hit n miss , depending on what you order. One of the reasonable priced place in very expensive area of old Montreal for food ...as its tourist driven. Just get a seat by window and enjoy food with cobble Street European feel."}
{"text":"This creperie is located in the entertainment/tourist hub of Old Montreal and is a good way to extend one's stay in this area. We had finished earlier on our dinner in the area and wanted to extend our stay before visiting a jazz bar nearby. My friends recommended this spot as they make it a point to visit this place whenever they are in Montreal.
The place in unassuming and actually spans 3 floors so there is plenty of seating even when it looks packed from outside. 
We just wanted to stick to desserts so after going through the extensive menu we all settled on crepes (what else) 
They do have a decent beer and cocktail selection so it is worth a look.
The crepes are big portion as the crepe suzette I ordered was 4 pieces. The stuffed crepes were also quite big. Crepe Suzette was decent though frozen berries were used in the crepes with berry filling. 
Prices are almost the same as a proper mid/high end restaurant in the area. 
3 Stars."}
{"text":"It could have been romantic place, almost. I went there when there during weekdays, when less tourist in the area. The food was good, and tasted better with the nice winter light coming from the big windows on the second floor."}
{"text":"Great little spot. This is the right place if you are people who enjoy tasty food AND you have little kids in-tow. We ended up coming her twice during our 5 day visit. Lunch and then dinner. Husband and I enjoyed wine with our cognac drenched lobster bisque, spinachy crepes and VERY good French onion soup. Kids had eggs and ham crepes with real maple syrup (seriously America, stop serving that fake stuff!). Kids were even willing to try escargot here and found out they like them! A very good, simple, caesar salad here, too. Waiters are friendly and attentive, were sweet to my kids and not fussy. A great spot to make everyone happy."}
{"text":"very good French onion soup.  lots of variety. great for a quick casual lunch. service was a bit slow though."}
{"text":"This place blew my mind ! Their seafood dish was the entree and I had the crepe Suzette for dessert . Best decision ever ! So sad I didn't try their fondues and if I ever have a chance this is where I'd be headed to in Montreal . Beautiful setting with outside seating and really good menu . Portion size is a bit on the smaller side for the entrees but that more than makes up for when you have dessert. Don't order the usual fruit filled crepes try the crepe Suzette instead , it was heaven on a plate ! 

Shout out to Martin ..xxx :)"}
{"text":"I have been looking for restaurants that serve dinner crepes ever since the Creperie in Ottawa closed down years ago.  What a pleasant surprise when we came across this restaurant by chance while in Old montreal. We very much enjoyed our evening.  We had the French onion soup, (delicious)  and 2 very good crepes (Laurentienne and the Campagnarde) and a great bottle of wine.  We sat on the patio, our server (Pedro) was excellent. We will be back next time we are in town to try the fondue!  Very reasonably priced.  Merci Pedro!"}
{"text":"Fun, casual, friendly service.  Portions are generous.  A single chocolate fondue (for 1) is enough for 2.  French onion soup is delicious, with lots of rich cheese."}
{"text":"Worst crepes I've had. Dessert crepes were cold and rubbery. Definitely not fresh. The ice cream had a bad taste. I would never eat here again."}
{"text":"Loved the crepes!  The service was nice and attentive.  Did not particularly care for vegetable soup.  Awesome place on a cold and windy Montreal day.  Hit the spot!"}
{"text":"This lovely little French restaurant is located in the heart of Old Montreal. It was 3 minute walk from Notre-Dame-de-Bon-Secours Chapel, the oldest Church in Old Montreal. Since I was craving for crepes, my husband and I decided to try this restaurant after we visited that church. 

The restaurant was not fancy and the furniture was old-fashioned. Since we were Asians, the servers did not put a lot of attentions to us (we had an impression that the servers didn't like Asians since they just spend time talking to either locals or Caucasians.) We ordered a Crepe Suzette (crepe served with a delicious orange sauce, Grand Marnier and Cognac), a French onion soup and a mocha. We were surprised the portion was very big in terms of the money we spent. That was probably the best crepe we have ever tried. I am always afraid of food with strong orange scent (since it reminds me of the smell of garbage chute for some reason), but here, the crepe was just perfect, you can taste the hint of orange flavor but it won't be too over. The crepes are very crispy, thin and chewy. The French Onion soup was full of cheese and hearty. The mocha works perfectly with the crepes. 

Aside from the service we had here, everything else was perfect! We will definitely come back to visit Chez Suzette! :)"}
{"text":"We went here twice. Once for dessert and once for dinner. The dessert crepe was better than the savory crepe. When we went there for dessert, we had the La Sonia crepe. It had strawberries, bananas, ice cream, whipped cream, and chocolate sauce. Nothing was left on the plate! For dinner, I had a salad with avocado, strawberries, mixed greens, etc. It was a nice, refreshing salad. If you don't love crepes, there are many other options on the menu which I did not have. I would definitely have dessert if I went back again."}
{"text":"Nice location, lovely place well furnished.
The staff is very fast and gentle.
The food is good and well cooked. The crepes are tasty and big, I took a bagel too and it comes with a side sale with a lovely dressing.
As dessert of course I took a sweet crepe. It was Huge, served with ice cream, Delicious!
The prices are slightly higher than the average but it's because the restaurant is located in the middle of the old town.
If you can grab a sit on the outside of the place you'll be able to enjoy the view of the main street in the old town."}
{"text":"Gorgeous crepes (made my husband and I feel slightly sick all day afterwards, so not sure what was up with that). My kids liked the pancakes and hot chocolate. Great location in the old port area, near all the touristy shops. But a fun neighborhood to walk around. The fondue was ok - not really worth the space in your belly."}
{"text":"Good clean place. Great ambience. Slow service. 
I wouldn't come here again for the main courses. Great deserts. Must visit only for deserts. Great fondue."}
{"text":"OMG I LOVE THEIR NUTELA CREPES TOPS WITH STRAWBERRIES AND WHIP CREAM!!!!!

I was visiting montreal and heard about this place! so I went to try it out and omg it was sooooo goood!!!! 

located in old montreal...we stayed in the intercontinental hotel so it was like a walking distant to this place."}
{"text":"I had a pretty great dining experience here. The service was nice; the only complaint I have about them is the fact that they decided to seat is downstairs next to the door when they had plenty of seating upstairs.

The food on the other hand was pretty good. I ordered the crepe, La Florentine, which was really simple but very tasty. It had spinach, Brie, and some creamy sauce that blew my mind. 

Their drinks, from which I chose some Kirs, were great.

Would recommend."}
{"text":"So good!
The sugar shack special is to die for! So tasty! Also the lady next to me got the shrimp crepe...which looked like heaven on a plate. 

English/French menu!

Wifi password is: suzette3"}
{"text":"Wir kamen hier zufällig vorbei. Es hat sich gelohnt: sehr leckere Crêpes und riesige Tassen mit gutem Capuccino, wirklich empfehlenswert!!"}
{"text":"Best French onion soup I've ever had. The plating was beautiful. We also loved the lobster bisque."}
{"text":"Very disappointing after reading good reviews.  Food is just OK and not something special you expect from this area.  Very over priced for what you get."}
{"text":"Terrific fondue. Excellent service. Nice atmosphere. Crêpes were delicious. Reasonable prices for Old Montreal and excellent variety."}
{"text":"Delightful meal and service. I got the smoked salmon crepe (healthy!) for dinner and the Jamaican crepe for dessert (decadent!). Oh, and the French Onion Soup was deliciously cheesy. Our waiter was fun and friendly."}
{"text":"Went for brunch

Smoked salmon was amazing. The side salad that came with it was so good. The dressing was delicious. 

The ham and cheese sandwich was awesome and the French onion soup was DELICOUS.


Would like to return to try crepes and some of the warm
Cocktails. The mulled wine especially caught my eye."}
{"text":"Chez Suzette is a gem in Old Montreal.

The service was warm and timely. Seeing that we were a sizeable group (5) and it was a hot day, our waitress gave us a pitcher of water for the table so we would not need to ask for refills. When we ran out of bread but still had fondue left, our waitress was more than happy to give us some more. It is small things like these that made the experience memorable. 

As for the food, it is excellent. The crepes and fondue were absolutely delicious. The portions were generous and the prices reasonable."}
{"text":"This is my favourite place to go in Montreal. I love their brie and caramelized onion sandwich, which comes with a light and perfectly dressed salad. Their crepes are also fantastic and their french onion soup is a must have. Great service, good price, yummy food. Can't wait to come back."}
{"text":"This restaurant is located in the prime real estate of Old Town Montreal, on Rue St. Paul, where dozens of restaurants are competing for the tourists' dollars.  When we were there on a weekend, the road was closed to traffic and it was completely jam packed.  If you happen to be in the Montreal area, I would recommend that you walk down this street at least once, if only just for the experience.

If you love crepes and you happen to be in Montreal, how can you not go to a crepe restaurant?  The crepes here are authentically French style, very thin but with its unique consistency, and not too sweet.  The crepe Suzette is absolutely one of the best.  It's served with an orange sauce made with fresh orange juice and Grande Marnier.  It has such a natural taste that is not syrupy or sugary.

This is DA CREPE!

If you are not a crepe person, their menu is actually quite extensive.  Other entrees available include soup, salad, sandwiches, pasta, among many other options.

On a beautiful day, you'll want to sit outside, even if you have to wait for a table.  This is truly the European style sidewalk café experience.  However, as the real estate here is very precious, expect the space to be crammed and your table is literally just several inches away from your neighbor.  If you expect privacy, this is not the right place for you.

Prices are expensive, but so is every other restaurant here in Old Town Montreal.  Service is good and friendly.  Everybody speaks English, although they always greet you in French first.  Bonjour!  Comment allez vous?

This is definitely a restaurant which I will revisit every time that I'm in the Montreal area. If you love crepes, you'll love it here!"}
{"text":"great savory and sweet crepes...

a nice cozy vieux montreal location...fancy names attached to the crepes as well :P....

Crepes were a little bit on the chewy side...mine was little less but when i tasted some of my friends plate...i felt sorry for my friend...

with all the hype of chez suzette...its failing to stand upto its expectations"}
{"text":"Well.. quite disappointed with the price for the quality... Decided to go there as several places had crazy wait times and this place didn't and was rated 4+ stars on Yelp. Fondues are really pricey for the quality of the meat, and vegetables plates don't necessarily go well with cheese fondue. Nice deserts and friendly service though. May have to try other items , but I would suggest to stay away from the fondues"}
{"text":"We came here for lunch while touring Old Montreal and it was pretty nice for a place clearly geared (and priced) toward tourists. 

The hot beverage selection was a nice treat after walking around in the cold winter weather. I was pretty excited about the option of sugarless iced tea.

We shared a cheese fondue with herb and sun-dried tomato. It came with a basket of bread, apples, and grapes. It was very tasty, the temperature was good, and the basket of dippables was unlimited. There were a few apple pieces and grapes that bruised, but otherwise tasty. 

Our server was mr. smiley--he was friendly, prompt, and it was easy to get his attention. The hostess seemed to have too much on her plate--running around and busing tables to get please seated faster. However, it was strange that we had to wait for a table while the patrons finished up and paid, and then two other parties were seated while we were waiting."}
{"text":"I stayed in Montreal for a weekend and stopped in at Chez Suzette for breakfast before heading back to Toronto.  It was cold and snowy outside so I had start with the French onion soup.  I also had an amazing breakfast crepe!

The onion soup was so good!  The thick layer of cheese on top looked and tasted great!  The soup was perfectly season and the onion wasn't overpowering like some onion soups are.

Even though the onion soup was good, the crepe was even better!  The picture I attached doesn't do it justice because the inside was packed full of cheese, egg, ham, and bacon!  Each bite was full of each of these ingredients and the maple syrup topped it all off.

This restaurant was amazing.  The food was to die for and the service was super friendly.  If I ever find myself in Montreal again I'm definitely going to be coming back for another delicious (and horribly filling) breakfast!"}
{"text":"Wonderful! Came back for a second time. As a tourist, the news were easily understood. Wait wasn't long and service was spectacular. Food was delicious and had great presentation. Located with a wonderful view and a great overall choice."}
{"text":"This was my first time trying savory crepes.  I didn't know what to expect, but the crêpe that I ordered was delicious.  I also ordered a side salad which had a maple vinaigrette salad dressing.  I wasn't expecting this weakness of the dressing, but it was an amazing surprise.  I scarfed down the salad before even thinking about eating the crepe.  When I decided to dig into the crepe, The flavors of the ham, cheese, spinach, and bechamel sauce mixed with the sweetness of the crepe danced on my taste buds.  This place is worth a visit.  My only regret is that I was too full to try the sweet crepe."}
{"text":"Mmm des crepes. 

I just had to get some crepes in montreal. And wny not get the classic crepe suzette (orange sauce, grande marnier and powered sugard) and a fruit salad on the side. cute little place great for breakfast."}
{"text":"Kind of a nothing place. Unexceptional. Somewhat shabby interior. It's in a very touristy area in Old Montreal. We wandered in, wanting a small snack. 

Ordered a small Nutella crepe. The waitress was all \"that's the kid's portion\". We fumbled, uncharacteristically, and said \"Oh, okay\" and ordered the \"adult\" size. MISTAKE. What we got was overwhelmingly sweet, with ice cream, and ugh, just TOO MUCH. 

I wouldn't go back here, it just wasn't that special."}
{"text":"La campagnarde était un très bonne crêpe. Parfait dosage de fromage et de jambon. Pas trop petite quantité.  

La coquille était digne de celle de ma mere.

En dessert, la crepe au nutella était en fait, 2 excellentes crépes au nutella, bonne surprise pour nous 2 qui comptions partager un dessert pour deux."}
{"text":"Such a lovely spot in the heart of Old Montreal!
After my first visit back in 2011, I was in love. And made effort to go back there a couple more times since. 

I've had a couple of the dessert crepes, and one savoury. I can't recall which ones, but everything was fresh and delicious. The service was always good, and the ambiance is just lovely. Especially when it's warm and the windows are open."}
{"text":"Our family ate dinner here in the heart of old Montreal.  The food is average. Good solid crepes and pleasant creamy cheese fondue and good salads and nice dark chocolate fruit fondue. Everything was good, workmanlike, and not special."}
{"text":"I think I was spoiled by the small crepe stand outside of the Notre Dame in Paris or something... yes, I am fully bragging right now. 

The crepe was okay, but too chewy and dense for my crepe liking. The Viennese chocolate was not very good. Where was the chocolate and cream? When I get anything Viennese, I want that cream like a mountain on the top. Like obnoxious amounts of whipped cream. 

Decent if you are starving, but I'd pass otherwise. Service was attentive, but a bit rushed."}
{"text":"came here on 8/7/2011 and had a wonderful crepe with avocado and chicken. The staff was friendly and helpful with my order. we would return the next time we visit Montreal. My husband ordered a crepe with asparagus and ham, he loved it."}
{"text":"My husband and I clearly ordered incorrectly here.  We had the cheese fondue, not particularly hot or very tasty.  The salad that came with it was mediocre.  However, service was personable and the crepes did LOOK wonderful!"}
{"text":"this is the best thing that has ever happened to me. this beautiful french onion soup. my god. i took one sip and its like my soul drifted away into heaven and I was partying with jesus and I swear it is the best exerience. 20 STARS. GOODBLESS THIS PLACE."}
{"text":"The best crepes I've ever had anywhere! You MUST order the cognac and orange zest crepe! It was so delectable, that one cannot help but eat is slow and savor each bite. It also helped that the venue is so cozy and perfect for a quiet date night or quick rest from walking around Old Town. 

Definitely try this place out for dinner or dessert!"}
{"text":"Yikes.  It just didn't hit the spot.  Maybe bechamel sauce isn't great with eggs but I just found the whole enchilada...I mean crepe...rather bland."}
{"text":"1 fondue with swizzle cheese: $19
1 supreme poulet: $15
1 la Sonia: $14
1 1/2 L of rouge wine: $13
Total: $70 with taxes included
....
Ok so I'll make this short for now so I remember I came here, and write more when I get home...
Umm omg how do you say omg in french? I duuno but this place is amazing. Always ask the locals and people around Montreal what their favorite restaurants are....I asked and the lady gave me a list of places, but her favorite was this. 
They arent extremely expensive but it is a bit more pricey that the other crepe place down the street by saint Jacques square.
Wine, crepes and fondue = happy"}
{"text":"A must for crepes! This was our first trip to old Montreal and we attended different locations for a crepe each night. We chose the \"la sonia\" crepe.  This was the best dessert we had whe compared to various other locations in the area.  We also came back for lunch at Chez Suzette. The quiche was melt in your mouth delicious. The menu had many options to choose from. Will definately go back!"}
{"text":"We stopped here for the name sake Crepe Suzette.  It's been 30 years since I've enjoyed this marvelous desert crepe, and I was brought to tears with this restaurant's rendition.  The perfect crepe light and airy with the most delectable butter orange sauce.  I felt like I melted away with each mouthful.

The wait staff was quite engaging and the atmosphere was just like a small cafe in Paris.  A wonderful experience four our last night in Montreal."}
{"text":"Having been to Paris it's not the best I ever had but I enjoyed the crepes (more out of hunger than flavor) and experience. Big portion but pretty expensive for what you get ($124 CAD for 4 with tip). Chocolate fondue was good for dessert. Attentive and friendly staff. No real ambience. Good for kids. They enjoyed it well enough."}
{"text":"Surprisingly one of the only cafes serving crêpes. At least from what a tourist can find. But we did look for awhile!

The location is located on a cute street that looks most like Europe compared to all the other streets of Old Montréal so be sure to check it out! There are  a lot of other shops and dining spots on this street as well. 

There were plenty of choices for crêpes, both of savory and sweet kind. We went for lunch so we wanted a savory crêpe. In the end, we decided to go with the Mediterranean crêpe with came with ratatouille filling (veggies with a tomatoe base sauce) and chicken. 

At first I was hesitant to split one because the crêpes back at home are pretty thin but once our food came to our table I felt much better! The crêpes here are very large. Plenty of food for 2 people to share unless you are starving or you want to eat a heavy meal. For us, it was the perfect amount of food for a light lunch.

We will definitely be back to try their sweet crêpes!"}
{"text":"Admittedly this is a very touristy area and we chose this at random.

It was a solidly 3-star experience. My wife had the crepes with Nutella and strawberries, I had the French onion soup. We shared a half pitcher of sangria - very watered down. The waiter was very friendly and quick.

If it's a nice day check it out and sit outside, just don't expect a lot from the food."}
{"text":"An okay crepe place in the middle of Old Montreal. Really cute place. I had thought they were a bit too cozy until I realized there were three whole levels to the restaurant.

The Quebec maple syrup fruit \"Suzette Crepe\" we ordered was good but nothing too special. The lobster bisque with cognac was fine but portion wise, for around $10, was way too small - also had maybe 3 small chunks of lobster.

Service was top notch though."}
{"text":"This is the BEST restaurant in the world !!!!  My husband and I spent a weekend in Montreal last month and had almost every meal here. My favorite is the Nutella and banana. Most of all, our server Kathleen was the best. What excellent service we received!!!  Can't wait to go back to Old Montreal for these crepes!!!  It's a must must must if you are traveling to the area!!"}
{"text":"We were wandering through Vieux Montreal and craving fondue. Thanks to Yelp, we found out we were just a half mile from Chez Suzette! The friendly staff escorted us up to the 3rd floor dining room where we had a great view of the street below. 

Thankfully, we walked all morning and didn't feel terribly about indulging in the lobster bisque and French onion soup. Three of us had the Swiss fondue while one in our party went with a ratatouille crepe. The food was deliciously rich and cheesy and paired well with reasonably priced wine. 

It was a very enjoyable leisurely lunch!"}
{"text":"I'd probably say 3.5, but I'm rounding down because I probably wouldn't go back. 

We stumbled into this place as we were wandering around Old Montreal, my boyfriend insisting he wanted to eat something authentic. To him that meant only french things or poutine, so here we were.

I honestly have no complaints about this place. The food I ordered was very good (assorted seafood baked in a lobster bisque sauce), the view overlooking Rue St. Paul and a bit of the bay was fantastic, and the service was prompt, polite and attentive. They also offer some of the cheapest bottles of wine I've ever seen in any restaurant ever. 

The problem is that somehow the experience was lacking. Maybe it's because the restaurant was kind of empty. Not in a cozy romantic way, but in a way where you feel a little awkward that you're the only people in the room.  Maybe because even though the service was good, it was also a little cold. Maybe its because even though everything was good, nothing wowed me (except those wine bottle prices!).

It's a perfectly good restaurant that I have no real interest in returning to. Make of that what you will."}
{"text":"Incredible food and great atmosphere at a good price!"}
{"text":"A walk along the cobblestone streets of old Montreal leads you to chez Suzette. Don't be fooled by the small first floor as there are two other seating areas upstairs. There are a variety of sweet and savory crepes to choose from, as well as  cappuccinos and gourmet espressos. As we were there for breakfast, hubby and I opted for savory crepes: ha, and cheese and bacon, eggs and cheese, both Ethan maple syrup. Would definitely return and try some of the sweet crepes for dessert."}
{"text":"Best crepe we have had in a long time. Old Montréal hidden gem. The fondue was amazing as well."}
{"text":"One of my fondest memories of touring the old quarter of Montreal is this crêperie!

I admit, this ignorant American has very limited French conversational ability, but our waiter, like most of the other Montreal locals, graciously switched to English for us. Apart from being linguistically accommodating, he was extremely friendly and eager to please.

The lobster cognac bisque was rich and heavenly (see photos). It was creamy and full of flavor. The cognac was subtle and not overpowering. I don't know if I could eat a whole bowl of it; fortunately, my friends and I shared much of our food.

I split a savory crêpe and a dessert crêpe with my friend. Our savory shrimp crêpe was divine. A rich sauce countered the sweet shrimp within. The sauce was even better with bits of lobster throughout. I would definitely get this again.

Our dessert crêpe (see photo) was disappointing, not because it was bad, but because everything thitherto had been so awesome, this one couldn't stack up. It was open-faced and loaded with fruits, mostly raspberries and peaches, maple syrup and an excessive amount of whipped cream. Good, but a little too much on the cream and sweet; I was hoping for a lightly sweet crêpe that would highlight the fruit rather than the sugar.

I live in Maryland, but I know that when I return to Montreal I will eagerly seek out the Crêperie Chez Suzette!"}
{"text":"Fell in for breakfast here after an early morning flght, workng on bascally no sleep. Good coffee, welcoming servers and very good crepes. Happy happy joy joy. And just in case I was too tired to remember I was in Montreal, my ham and brie crepe came with a little plastic cup of maple syrup on the side. Maple syrup...Montreal's all-natural GPS locator. Nice little boite for breakfast or lunch."}
{"text":"The savory crepes have no taste, completely bland and overpriced... Look elsewhere in Montreal for crepes..."}
{"text":"Delicious food and great price for a quick lunch on our first day in Montreal. I had the vegetable quiche and my friend had a breakfast crepe. Both were delicious. A lovely lunch place right in the heart of Old Montreal."}
{"text":"What more could you want?  Delicious, hearty crepes.  People watching from the third floor window.  They saved us when our blood sugar was low from too long of a walk through Montreal.  Merci, Chez Suzette!  Merci!"}
{"text":"So we were caught in the rain and museums were closed because of the strike. Wandering upon this spot in Vieux Montréal was a treat.

My wife got the crêpe s'more while I got the escargot au beurre d'ail (with cheese). Food was delicious. Would like to come back for the fondue, but everything looks amazing. Also got a few cocktails, they were delicious as well.

Service was prompt and server was very pleasant. I was able to practice a little of my French (much appreciated). I would recommend anyone visiting to pay a visit. This establishment has multiple levels, plenty of space, clean and fresh, and plenty of simple European charm without breaking the bank."}
{"text":"Awesome food. Awesome service! Crepes were soft but well cooked. The vegetables were al dente - just the way I like them. The sauce was amazing! All in all a great experience"}
{"text":"This place has the best breakfast I have ever had anywhere, and that's saying a lot because I've also been to France. I highly highly recommend this place. Even our Japanese guests were ecstatic with the food especially with the French Onion soup and smoked salmon crepes. In addition, we tried the Spinach quiche and the seafood croquille - everything was simply superb!

This place surprisingly has three floors and can accommodate a lot of customers, with the restroom in the third floor. It has a nice, bright, and very clean atmosphere that balances very well the relaxed French casual vibe.

We're definitely coming back for more, today in fact, our group simply couldn't resist for more!"}
{"text":"We ordered two crepes, both were tough and chewy, but not the end of the world. Great atmosphere, great location, very friendly staff."}
{"text":"Oh my goodness. Yummy! We got the vegetable soup (French onion style with baked cheese on the top) as our starter. It was good. For our main we got two crepes: The asparagus with bechamel sauce. Unreal, seriously. The other one was apple, brie and maple syrup. Again, we couldn't get enough. They were delicious! The service was good too. They layout of the restaurant is interesting and the sunlight floods in. Overall, it was a great experience!"}
{"text":"This happens to be my second visit and I left this place disappointed.My first visit was so delightful that I wanted to come dine here again but this time I wasn't blown with your food.

My food as you can see in the photos was a Nutella crepe, seafood crepe and seafood coquille.I don't want to go in the details of the food but just want to mention that my food was cold??We were so hungry that didn't bother to send it back but I wish I would have done that.The seafood crepe had become overly salty since it was served cold.I wasn't quite able to distinguish the flavors of the main dishes since there weren't hot.Everything just tasted meh except for the Nutella crepe of course.

Service here was great-our server was friendly and sweet.I did get a chance to use their bathroom and found them very clean.

Their location is absolutely brilliant right in the middle of all the action.We didn't have to wait here since we got to the restaurant after the lunch rush."}
{"text":"Cute creperie in old Montreal. I didn't know what to expect given that the restaurant was right in the most touristy part of town. However, the ham and cheese crepe I ordered was very good. Our table also ordered a quiche lorraine and the dish was also good. The serving was huge for the price and service was pretty fast. Definitely would recommend to anyone in the area."}
{"text":"Yum Yum Yum Yum for fondue!

We had the swiss cheese fondue to start, followed by the beef broth fondue with chicken and sliced beef. Both were delicious. The dipping sauces were amazing - especially the creamy garlic sauce. 

We finished with the chocolate fondue with fruit and marshmallows. The hubby had a bowl of french onion soup which was yummy. My girls had the pizza, which they seemed to like.

The service was great and the rest rooms were very clean."}
{"text":"My husband & I vacationed in Montreal over  Labor Day weekend and this was one place friends consistently recommended for crepes. We came here after spending a long morning sight-seeing in Old Montreal. We were seated upstairs by a corner window that had a picturesque, postcard view. The service was quick and friendly.  We had a savory crepe with ham, asparagus & bechamel, and a sweet one with Nutella & strawberries. Also, two glasses of Riesling. Delicious & great ambience!"}
{"text":"Excellent location. Superb service. Child friendly. Fresh crepes. Delicious apple cider. You really must go and try for yourself."}
{"text":"We came here around 4:00 on a Sunday afternoon for a light snack before dinner. Suzette's manages to be a very friendly and approachable restaurant for tourists without compromising on food quality. The service was excellent. We felt comfortable and welcome immediately. We enjoyed an asparagus crepe with bechamel, a ham and cheese crepe, and Swiss fondue. Overall we left totally stuffed and didn't end up eating dinner until around 9pm because we were so satisfied by the food at Suzette's. Highly recommend!!"}
{"text":"The service was very nice. The food was delicious. The portions were large. The salad dressing was really good. There are three levels and it has a certain charm. The fondue for one it big enough for 3 people. Yum!  The Bloody Mary was really just vodka in tomato juice. That was the only thing we didn't love. Good coffee."}
{"text":"More like 2.5 stars. I really wanted to like this place more than I did. The setting couldn't be better on Rue Saint-Paul in touristy but historic Old Port. Got to sit on the second floor with a great view of the surrounding area. Waitress and service were excellent. Food on the other hand was questionable. Had a crepe with eggs, swiss, ham, bacon, and sausage topped with maple syrup. I feel like everything was good except the eggs themselves. Tasted like they either used \"fake\" eggs or powdered eggs. Horrible. Very disappointed. Probably wouldn't come back again"}
{"text":"Suzette's was a pleasant place to stop for lunch. Small upon entering, we were shown upstairs to another room. The tables are situated very close together and I felt I was on top of the table of girls next to me. Kathleen was our server and was friendly and provided good service.  I ordered the warm goat cheese salad, which was mixed greens, lots of apple slices, carrots and candied pecans with four crostini with warm goat cheese on top.  Large in size, this salad was tasty. My husband had a thin crepe filled with asparagus, ham and cheese. The food was decent, but didn't wow me.  Service was good, and the staff we encountered friendly."}
{"text":"Very very nice staff. Some long  wait lines due to the restaurant being in the old city but I lucked out and got a table right away. I am giving this place 3 stars because food was okay. Nothing incredible per se. Also I could tell that some of the ingredients used were frozen and not fresh. For me it is a huge turn off given this place is not cheap. I am happy to say that they had vegetarian offerings and labeled them as such for ease of ordering. If you like cheese, this is the place. My soup and crepe were drowning in cheese lol. And that is after I asked for sprinkles of cheese as minimal as possible haha. I definitely recommend this place if you are in old city for a quick bite but don't expect excellent cuisine. Also a quick tip, if you made a reservation online, make sure to call and confirm!"}
{"text":"Their Neptune crepe blew my mind! Soooo delicious. (Be warned- it's very \"seafoody.\") We had their cheese fondue as an appetizer, and it was amazing. The server brought us extra bread for it (which we gobbled up, too.) The ambiance was cozy and comfortable, without feeling too \"nice\" if that makes sense. (Basically, I didn't feel too out of place with my two year old dining with us. ;))"}
{"text":"Lovely Lunch spot! Service was great. The waitress told me upfront that the kitchen was a bit backed up - so I told her to bring my milkshake out and the crepe could wait. She did just that.

The milkshake was great and the primavera crepe could have used some love on the eggplant in the ratatouille. But good place overall!"}
{"text":"My last visit to this place was over a decade ago, and it was a very pleasant surprise to see that the food is still wonderful, and service is still offered with a smile. 

This is a great place for all ages, and one of the few places in Vieux Montreal, where it's easy to feed your kids, since the selection is quite large. 

Will repeat, many times."}
{"text":"At first, I was looking at getting dessert crepes but I think the selection wasn't that good so I just decided to order a savory one. The crepe I got came with ham, swiss cheese and caramelized onions. I was actually looking to get something with gruyere cheese but most of what they offer only includes swiss cheese. I don't think the crepe itself was anything special. I was not impressed at all with my food. I also think it was too expensive for a crepe."}
{"text":"Well my first bad review. Still not feeling well after this place. I and my husband together are still recovering. Had lobster bisque ( way way way too salty), French onion soup was the only win, chicken caesar salad ( such bad chicken imitation), crepe was pretty bad too. Guys at fast food places do a better job. Very disappointed over all. Service was good"}
{"text":"Went here as was recommended by a friend for fondue. My teenagers had never had fondue so on our trip to Montreal this was the place. Loved the rustic charm of this location in the heart of Old Montreal with three floors of seating areas. Wait staff were attentive and helpful with describing the menu. Lots of both savoury and sweet crepes to choose from. Started with the escargots which the snails were a bit small but the garlic butter was awesome. Onto the Swiss fondue and one out of two teens tried and liked it. I loved it! It would have been nice to have different kinds of bread but there was also green apple pieces and grapes for a fresh punch with the gooey cheese. We tried a ham, brie, spinach crepe with bechamel sauce and it was yummy. We were so full we will go back for a sweet crepes before we leave Montreal. Will definitely recommend!"}
{"text":"After a cold hike around Old Montreal, we stopped in to the bustling Creperie Chez Suzette. We had just had lunch, so we got dessert here. We ordered what is called the symphony crepe. It was a giant crepe filled with blueberries, strawberries, bananas, orange slices and grapes. Soooooooooooooooooooooooooooooooo good! Check it out when you are in the Old Montreal area."}
{"text":"Excellent crepes!  Strong, good coffee.  Big portions.  Great for breakfast.  Very accomodating for kids.  

Strongly recommend for a simple affordably priced breakfast in old Montreal on a charming street.  Try the salmon, cream cheese and caper crepe!"}
{"text":"Great savory crêpes and pretty authentic place in Vieux Port. The portions were more than filling and the staff was really friendly. If you feel like having crêpes, this is where you go ;)"}
{"text":"This place is terrible not sure how the reviews are so good. 6 of us came and all got different dessert crepes and they were all bad.  Aside from the crepes being ice cold the ice cream was awful.  How the hell do you mess up ice cream.  It tasted terrible and the texture was way off. Worst crepe Suzette I've ever had in my life.  The crepes aside from being frozen we're probably 3x as thick as a crepe should be. The only redeeming quality of this place is that the staff was very friendly.  Tourist Trap, STAY AWAY!"}
{"text":"We got into Montreal late on a Friday night and were hungry so we wanted something quick and not too heavy. We stumbled on this place. Waitress was very sweet and helpful. We had soup, salad and \" breakfast\" crepe. Everything was really good and fresh. We went back the next night for dessert crepes! Yummy! Share one, they are big & sit on the top floor so you can look down into the street."}
{"text":"Solid dessert location for savory and sweet crepes.  Really enjoyed their chocolate fondue as well and the generous amount of fresh fruit and such they give to dip into the chocolate.  Gets really packed and then empty fairly quickly and because they have 3 floors of seating it's virtually no wait to get in and get out."}
{"text":"Terrible service if you are Asian. When we first walked in,  we were asked whether we had a reservation and we didn't.  We left and called and told there was plenty of space and so we went back. After looking forward to eat some fondue,  it came and had such a strong white wine flavor which meant it hadn't fully evaporated.  It was super disappointing because there was no mention of white wine in the description at all. We thought our waitress had removed it from the bill so when we asked her she said she forgot to add it. We then said that it should be because it was not advertised and we barely ate it. She was clearly unhappy and we just got attitude thereafter.  Little did she know we would have left a big fat tip if she didn't give us the unnecessary attitude when we were polite the entire time and clearly did not like the fondue! It was barely touched! French onion soup was okay,  lobster bisque was okay and the crepes were good. Don't expect great service if you're asian as was confirmed by a fellow local resident. Super disappointed."}
{"text":"So here's the thing - it's a bit overpriced, it is in a prime tourist location, the outside patio is lovely, if you sit inside the decor isn't that great but you still have nice views from the windows, and the crepe dough isn't that good.  However, it's very comfortable and accepting - meaning you will feel at home from the staff as a nice little stop in your day, a nice little spot to get away from it all for a moment.  The crepe fillings, as others have said, definitely make up for the flavor of the bland and a bit tough crepe batter they use, so choose your filings wisely knowing you'll want stronger flavors.  It does come with syrup if you get a savory crepe and the syrup isn't that super by Canadian standards, but it makes it nice and it's fun for you if you haven't tried this in Canada yet.  They have a range of special cocktails and wines and beers as well as of course the typical non-alcoholic beverages on offer.  So it's kind of worth it if you are in the area touring to just sit down and have a decent meal in a comfortable spot.  However, if you want real Montreal crepes, go to the Jean-Talon Market.  There is a stand there that is fantastic and the syrup is truly A+."}
{"text":"I'm guessing Chez Suzette is pretty much just for the tourists based on the area it's in but if I lived in Montreal I think I'd brave the tourists to frequent this place.  It has a warm and cozy atmosphere, vegetarian options and reasonable prices for the portions and taste. 

I opted for the L'Argenteuil crepe, asparagus, bechamel sauce, and pine nuts in a crepe, then there's cheese on top and it's baked. OH MY GOOD GOD it was heaven wrapped in cream sauce and baked with cheese.  I asked to add mushrooms to the crepe and they came on the side.  At first I thought, that's weird, but it was nice to have a mushroom with every bite.   

My husband opted for the Crepe aux Avocats, which boasted pesto, avocados, and tomatoes. He added swiss cheese, which was also baked on top.  It was a refreshing and yummy crepe but nothing compared to the fatty, rich, creamy crepe that I ordered.  He was jealous.  My reasoning for 4 of 5 stars instead of a full 5 is that the asparagus was just slightly tough.   

A senior tour sat next to us and cracked me up with their Seinfeld's parentsesque comments.  They also seemed pretty happy with their meals.  If old people like it it must be good right?"}
{"text":"Lovely friendly staff.  Stopped in for dessert and wine.  Had Jamaican Crepes and toffee Crepes.
House wine a true bargain at $12.95 for a 1/2 carafe.
Wish I had the chance to go back again. It is very casual, fine for families and the food is really nice."}
{"text":"perfect little stop just around from out hotel. Friendly staff and crepes were delicious"}
{"text":"My trip to Montreal fell on Canada day unexpectedly and we could not find many places that were open. We were checking out old Montreal and we were starving. Chez Suzette looked like the best option for crepes so we stopped by for brunch. They have 3 stories of seating. The hostess was not helpful at all when I told her we would like a table with a view. She sat us in the middle and we had to ask someone else to move to the table by the window. The view from our table was pretty nice. 

It took forever for our waiter to show up which was too bad because I was thirsty and just wanted water. The price of a simple crepe was off-putting so we got one to share. What stood out to us was the smores crepe. We asked the waiter if we could get it with bananas rather than marshmallows as we were allergic. He said no problem. Not once did he say that there would be a charge to substitute. 

Our smores crepe was tasty but very small for the high price they charged. When we got our bill we were outraged to see it cost over $20. Are you kidding me?! For a stingy crepe! What made me very mad was they charged us $2 for a few slices of bananas. We asked the waiter and he said there is nothing he can do about it. 

The crepe was good but no way worth the price. We wanted to try the fondue but it did not look like it would be worth the cost. Next time we will save our calories and go to the much superior cacao 70."}
{"text":"We orders crepes and cheese fondue with sundry tomato. We are so full after all. The crepes are nice. I don't like the taste of the cheese fondue (probably the taste of wine or sundry tomato). I like that they have so many choices on crepes."}
{"text":"Typical tourist trap. Service was lousy and crepes were the worst I had in Montreal. There are way too many other places in Montreal to go to."}
{"text":"THE  place to go for dessert crepes. Hands down. Delicious! Out door seating but wide open windows inside gives outside feel. Fresh tasty nice variety. Extremely friendly wait staff."}
{"text":"Housed in a small three story building in Old Town Montreal's touristy cobblestone district sits Creperie Chez Suzette (CCS) 

I sat myself inside CCS and found it quaint despite the bustling streets. I think that the French country decorations added to the quaintness to it. I sat at a table at the front of the restaurant near the open windows to people watch. It provided great entertainment while I waited for my order.

It serves crepes in hardy sizes, sizes that I've never seen before, even in Paris. I could barely finish the first one. Admittedly, I had a small salad before hand that may have damped my eating capacity.

CCS is moderately priced for a wide variety of crepes from vegetarian to the rich and dangerous sweet filled crepes sauced in chocolate, saddled with ice cream and filled with fruit - strawberries or bananas."}
{"text":"En ce 24 Août 2014, quelle déception de se voir servir dans deux assiettes différentes, la même viande, mais avec une couleur complètement différente et dont, surtout, l'une d'elle avait un goût de crevettes...
On te rit presque au nez quand tu le fais remarquer...
Nouvelle assiette, pareil, troisième, et bien, t'as tout simplement plus trop d'appétit...
Ce n'est pas la première fois que je viens dans ce restaurant, mais je me dis qu'étant dans une zone (très) touristique, ils ne cherchent pas à fidéliser...
Sauf que maintenant les sites d'avis sont nombreux et donc je vous le dis...
N'Y ALLEZ PAS, SAUF SI VOUS VOULEZ NÉGLIGER VOTRE SANTÉ !!!
Dommage, le concept de trio de fondues (avec poulet congelé), pouvait quand même être sympa...
Même pas un geste commercial, avec le café gratuit..."}
{"text":"Beeeees everywhere! They don't bother you too much but they will eat your food and drink your drink. You just have to take turns. 

Food tasty and location sociable and enjoyable ... just expect to be in the background of many pictures if you're seated outside since people like to pose at the entrance to this strip. Perfect photobombing opportunities.

As of 9/2/12 ... they were hiring."}
{"text":"Loved this quaint little spot right in the midst of the Old Port. We sat inside right next to a wide open window; it was lovely. I ordered La Parisienne crèpe, DELICIOUS! All the other meals ordered within my party were also deemed fantastic. We also ordered a desert crèpe, so so good. If you're visiting in summer, I recommend the frozen cappuccino. Overall, food was 10/10 with good prices, good environment as well. Our server was so friendly and efficient as well! Definitely try this place."}
{"text":"This place is much much larger than it seems.  Highly recommend making a reservation in advance!  The crepes were delicious!  I had Brie in mine and it was melted perfectly.  The portion size was large.  The crepe was also the perfect thickness and cooked just right.  It wasn't soggy and it wasn't burnt to a crisp.

Highly recommend if you're in old Montreal!"}
{"text":"I gave it three stars for the selection, the somewhat helpful wait staff and the great location.  Maybe my expectations were too high. The two crepes lacked flavour, breakfast and spinach & Brie. The breakfast crepe  was really tough. Cutting it was almost a disaster. 
I really enjoyed the escargot, the onion soup and the overpriced strawberry drink.  The onion soup tasted great but I was expecting it to be fancier, such as a homemade cracker baked on top."}
{"text":"Such excellent service and food at lunch that we came back for dinner since we were just too tired to make any other decisions.  We didn't regret the choice at all.  Don't miss the Crepe Suzette!"}
{"text":"I visited this place a few years ago when I had the craving for fondue. Returned and was happy to find that the place still existed. Yes, it's a total tourist trap - but one that doesn't gouge folks then delivers poor food. The cheese fondue selection was sparse but pretty solid and combined with a half liter of wine, meant a splendid albeit lingering lunch. Highly recommend eating on the third floor which had a nicer atmosphere to it. The cheese fondue filled us up, so sadly we didn't have enough space for the meat fondue, which I remembered from last time, was divine and had the superb bonus of drinking the 'soup' after you had finished cooking all your meat in it."}
{"text":"The dessert crepe here with bananas and almonds is one of the top three desserts I've had in my life.  My husband and I stumbled across it in 2010 and purposely sought it out on this trip, now with our 2-year-old.  It lived up to the memory we had of it, and even our toddler loved it.  We didn't try the meal crepes, but we can't say enough about the dessert crepes here.  We will go out of our way to eat here every time we come to Montreal."}
{"text":"Soup l'ognion de gratinée is a must! 
French onion soup was spot on!

Hubby enjoyed his Le campagnarde crêpe!"}
{"text":"We got the strawberries and nutella crepe.  The crepe was nice and chewy with a thin layer of nutella (not overwhelming to make the crepe too sweet or soggy) with a scoop of ice cream in the middle and sweet strawberries.  A very good crepe overall!"}
{"text":"Not great... Not bad.  Probably around average for the Old Port.   Fondue is just decent, wine prices are really good, crepes are ok."}
{"text":"Chez Suzette is conveniently located in the heart of Vieux Montreal. Its outdoor seating as well as the second floor tables offer scenic views of tourists walking along Rue Saint Paul. When I visited, the wifi was broken, which was a bummer as wifi is super useful for a tourist visiting another country. 

The crepe itself was good but nothing particularly special. It was surprisingly filling and left my stomach with little space for dessert. The fondue options looked quite good based on what I saw from the tables around me, but if you're in the mood for simple crepe with a nice view then this is your dinner place"}
{"text":"Beware: the coke is not offical post mix but a rip off no name brand cola.
The quiche is microwaved to the same temperature of the sun and only given a spoon to eat it with.
Complimentary bread came out after the mains not warmed with butter and still no other utensil but a spoon.
French onion soup was quite bland but the cheese on top was nice, maybe a 2/5.
Lobster bisque has more cognac than any other flavour, a 1/5.
Vegetable quiche 1/5, frozen, microwaved then smashed in the oven.
The McDonald's around the corner would provide more satisfaction."}
{"text":"Old Montreal...you are a delight to the visual sense.

-Delice Special: Scrambled eggs, bacon, ham, swiss cheese, mushrooms, and MAPLE SYRUP!!

As you can tell, I am ecstatic about the maple syrup. Whats even better is that the bacon is ham-like, lean, and very filling. 

Only regret it that I didn't get a chance to try a dessert crepe. Shame on me!"}
{"text":"When you're on vacation anything goes. An by anything I mean consuming a giant-sized dish of crepes, smothered in vanilla ice cream drizzled with Belgian chocolate, and piled high with strawberries and bananas--FOR BREAKFAST!

On a snowy Montreal morning, we sat on the street level of this charming little creperie, watching the passersby and wondering how on earth they survived this weather without proper bundling! I kid you not, some of these people were in track jackets or heavy sweatshirts! I was but only thankful to be inside this warm, delicious smelling restaurant!

With three floors and several pages of crepes to choose from (plus quiche and other fun foods) you'll find a place to plant your bum and some yum to fill your tum in no time!"}
{"text":"Cant miss. Nestled in the old Montreal district, this is a great stop out of the cold. Warm up with the Crepe Suzette, the best crepe on the menu.
Highly recommended"}
{"text":"Cute little restaurant and sidewalk café on one of the most beautiful streets anywhere. I had the roast beef sandwich on focaccia bread and it was delicious. Nice sized too. On the day that we were there, it took forever to get waited on, but to be fair, it was the lunchtime rush. Once we finally did get waited on, everything went without a hitch.

I'd like to go back and try breakfast here some time. With sidewalk dining in fair weather, this is a perfect place to relax and enjoy the sights. Fun for people watching too."}
{"text":"Chez Suzette was a highlight of our trip to Montreal; the vibe was cozy, the staff friendly, and the food was hearty French deliciousness. Their French onion soup was heavenly -- such a flavorful broth without feeling too heavy (a tough balance to strike!). And highly recommend the sundried tomato fondue as well. We split amongst four people and it was the perfect way to kick off the meal. Can't recommend this place enough!"}
{"text":"The staff was very friendly, and the ambiance was cute, but unfortunately, the food was a miss. I ordered the La Speciale Delice crepe but it was very bland and not worth $14.99. On the other hand, the Viennese coffee was pretty good."}
{"text":"Visited for breakfast on a quiet Sunday morning. The crêpes were ok, a bit chewy. Not sure I'd return."}
{"text":"Not impressed -- my husband came for desert -- ordered a crepe 
Besides the fact that the crepe was old and required force to tear it apart the waiter didn't ask us how anything was and we had to sit for 15 min after finishing up get our bill and pay for this terrible meal"}
{"text":"The smoothies were amazing!!!!!!!!!!!!!!!  My crepe of chicken and mushrooms was very good. The waiter, Pedro, was very kind and attentive! The service was very fast! You may think that crepes only work with sweet things, not true. The breakfast crepe, my brother says, is really good. I tried the maple syrup.  The music was superb! This is possibly one of the best places I've every eaten at, and definitely the best in Montreal! The dessert looked just as good as it tasted. It was amazing!!! I came here another day and there was a waiter named Martin. We asked him for directions to some places and he gave us everything we anted plus more! This place was so good that the four days I was in Montreal, I came here 2 times!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}
{"text":"We stopped in here for lunch today and what a wonderful decision! We loved our meals and desserts. The crepes are incredible, especially the dessert crepes. Highly recommended."}
{"text":"We stopped in here for a late afternoon lunch on a rainy Sunday and it was still really busy. It isn't really anything special, but the cocktails were really delicious. The food was pretty good but not great. No complaints about the service. The atmosphere needs some updating and a cleanup, and they really need to change the music playlist!"}
{"text":"My first meal in Montreal and it was a delicious one. I was walking around the Old Montreal craving a crepe and a bailey's hot chocolate. This cute little creperie appeared magically at the corner of the street and I knew it was a sign to go in and try it. We sat next to the window and it was really lovely. We split and ham and cheese crepe and a swiss fondue, while sipping delish boozed hot chocolates. Such a gre8 way to start a trip!"}
{"text":"What's better for breakfast on your last day in Montreal than crepes?  Glad you agree.  Just down the street from our hotel was Creperie Suzzette with a sidewalk café.  Perfect!

Two cups of coffee ($4.98), La Speciale Delice ($14.99) stuffed with scrambled eggs, ham, bacon, Swiss cheese, and mushrooms, and La Parisienne ($13.99) stuffed with Brie cheese and fresh apples.  What a nice sendoff this turned out to be.

Portions were very generous and each of our crepes came with real maple syrup.  Service was very good considering they got slammed as soon as they opened.  Fortunately for us, we arrived just as the kitchen was catching up with the initial rush.  The crepes may have been a bit tough, but the flavor and fillings made up for that."}
{"text":"We sat in the third floor. The Crepes and coffee were amazing.  I had la sonia the strawberries and bananas were just right."}
{"text":"Looks very good.  Big menu, lots of seating!  Hot upstairs though!  We ordered dessert crepes.  Found a way to open the window by our table and drank in the cool night breezes.  The crepes were huge, and wonderful just the right amount of sweetness."}
{"text":"Stopped by just in passing after lunch elsewhere for a dessert crepe. We were impressed by a varied menu that included not only a large selection of dessert crepes but also many meat and cheese crepes, varied fondues, and other items. We decided on a crepe with strawberries, bananas, dark chocolate sauce, and vanilla ice cream.....yum! The service was very good and the crepe was delivered quickly. It was a good find!"}
{"text":"Not the best crepes we had in Montreal but you can't beat the location or the view. When the weather is nice it's a great place to sit and people watch."}
{"text":"Stumbled upon while walking Old Town. Yummy crepes and soups. Returned for dinner since we enjoyed the experience so much & not disappointed. Love the colorful interior. Upstair window table is enjoyable"}
{"text":"Although a few dollars more than I would have liked to pay, my crepe with Brie, ham, and caramelized onions was quite good. It came with syrup so at the end I dipped the crepe bits in the extra syrup to get that nice salty sweet. Pretty cute, great location. We needed to get in and out quickly to catch a flight and they were very nice about it."}
{"text":"Man, I hated the ambiance. The outdoor seating looked nice, but indoors it's tacky and plain. Service and the food were both average. Would absolutely not recommend this place."}
{"text":"My wife and I shared sangria, savory crepe with chicken, spinach and Brie (slight up charge to substitute chicken for ham) and finished with chocolate fondue.   Great food, nice casual atmosphere and it was a bonus that our waiter, Jolain, on the third floor was terrific."}
{"text":"Convenient location. Friendly staff. Extensive selection. We had three spongey crepes: ham with asparagus and bechamel sauce; egg, bacon, mushroom and cheese; and a dessert crepe with bananas and Nutella. The crepes were not light and airy but rather spongey. The fillings were average-- processed ham, etc. A disappointment overall."}
{"text":"??????,???????????????????????????????????????????????????????~?????????????????????????????????????????????????"}
{"text":"Very good atmosphere.  The staff was very friendly.  Service was amazingly fast.  The took kids with no problem.  I would recommend for any tourist if you'd like a quick and easy taste."}
{"text":"Came here for a bite while strolling in Old Montreal. Ordered the French onion soup baked with crouton topped with cheese, and also got a ham, brie and spinach crepe topped with bechamel sauce. 

Didn't really like the soup, thought that there was way too much cheese, about a lb of it sitting on top of the soup which was kind of gross and the base wasn't very flavourful. Crepe itself was very delicious and smelled amazing. The fillings and the sauce worked together but it wasn't my favorite combination. 

The place itself was pretty big, 3 levels, friendly staff, decent prices. Decent choice for food if you are in the area."}
{"text":"We enjoyed a stop at Suzette for crepes and fondue.  We enjoyed the salad and French onion soup as well as the savory crepes and ended our meal with fondue.  Friendly and fast service."}
{"text":"I visited the Creperie on a trip home from Canada. We decided that while passing through Montreal we would stop and get something to eat there. After browsing a few review It was decided that the Creperie sounded the most appealing. 
We sat downstairs and ordered some drinking and soup and a crepe each. The hot cider I ordered was really good. I opted for the Non-alcoholic version since, this was about the time for brunch; even though I'm sure it was 5 o'clock somewhere. Then the soup came out which was out of this world. It cost about 9 dollars but was completely worth it. Finally I had my bacon and avocado crepe, which was all I had hoped it would be, although not being too surprised as how could you really go wrong with both bacon and avocado in something.  
The girl who waited on us was very pleasant the whole time. Overall I was very pleased with the choice of lunch."}
{"text":"My crawl through Old Montreal eateries continued in here when the family decided crepes and fondue were the ticket for dinner.  Located on the corner on Rue St. Paul, it's in a prime spot.  

The menu consists mostly of a variety of sweet and savory crepes, sandwiches, quiches, salads and fondues.  The cheese fondue was good and they gave plenty of bread to dip.  My only critique would be that they were a bit heavy with the white wine but that's a personal preference.  The smoked salmon salad was good with a nice amount of smoked salmon.  The crepes were also good but they were a bit heavy on the béchamel and cheese for my liking.  

All in all a good bite but kind of expensive (which is to be expected here).  Solid 3.5 stars."}
{"text":"friend and i went visiting from states.  it was frigid and we decided on crepes.  i almost ordered the quiche because it looked better.  wish i did.  it was meaty and thats about it.

friend had bitter cream sauce on hers

maybe we just ordered crap and the other stuff was better, but i cant rate on 'ifs and buts'"}
{"text":"Stopped in while visiting old Montreal.. it was perfect. I had a crepe with bananas, almonds, toffee cream, and ice cream. Delicious is an understatement. Warmed up with a half pitcher of sangria. Truly enjoyed this place and I will be back when I visit Montreal again."}
{"text":"This place looks like a small crêperie from the outside, but it's giant in the inside - 3 floors of dining rooms? 

It's more professional than I was expecting too, so obviously I got different results. Not that the crêpe is even close to bad, but you know, they just make the pastry, add some pre-cut fruits and cover it in chocolate sauce. This by any means can taste bad. But when the fruit is fresh cut it tastes better, when they make the crêpe with the fruit, everything tastes different (the fruits are a bit warm), etc. 

So, it's just a 3-star crêpe. I have had better ones. Service was standard, everything was three-star."}
{"text":"Hard to find French restaurant which is vegetarian friendly. But we did it somehow and it turned out to be really good. Location is the prime factor. Beautiful place to eat at. Be prepared to wait longer to be seated during summer weekends..."}
{"text":"Best crepes ever!!! After traveling through Quebec and Montreal and tasting crepes everywhere I am most definitely recommend Creperie Chez Suzette is the place to go try them, whether you've never had one before or had tons of them. We liked it so much we came two days in a row. The restaurant is located right by the busiest part of old Montreal.There is an outdoor and indoor seating, it was kind of fun seat outside and watch people go by. The crepe menu is full of choices, both for meat lovers and vegetarians. The first time there I had crepe Romanoff (strawberries, whipped cream and ice cream) and my friend had crepes with bananas, whipped cream, ice cream, topped with chocolate sauce. The second time I had a dinner crepe with chicken and mushroom sauce, which was not as delicious as dessert one, but still extermely good. Your visit to Montreal will not be complete without going to Chez Suzette."}
{"text":"I was a bit dissapointed with my first real crepe experience. The place has plenty of room with three floors but is still a very cramped environment .We walked in and sat and the waiters walked past us for about ten minutes before someone came over. For drinks, we got a bloody caesar and the cocoloco smoothie. They mistakenly made a bloody mary and informed us, which I was fine with. The drink though, was virtually all tomato juice and I couldn't taste any tabasco/pepper or vodka, and there was no celery or garnish. Probably the worst bloody mary I have ever had. The cocoloco was pretty good, but very artificial tasting. I got the crepe charlevoix, which was generous portion. Even though I was hungry, it wasn't that good. I do wish they had more meat options with their crepes. The dessert crepes looked very good but I wasn't in the mood for one. I tried the quiche which was decent. Overall, not worth the $50+ bill for a crepe, quiche, and two drinks."}
{"text":"Walking around the old town, we came across this restaurant. Although they were very busy we were able to get a table right away. They had a upstairs seating that was very nice. Our waiter was very nice and gladly agreed to replace bananas for marshmallows on my dish. But he failed to tell me there will be a charge for replacement. He claimed the cook had added the $2 banana fee. Now I know from eating out for over 40 years, when you ask for a replacement that's just what it is,a replacement. But he did want to offer me the $2 out of his own pocket which I thought was a nice gesture."}
{"text":"This place was great! This was just what you needed to get out of the cold Montreal air.  The French onion soup was absolutely delicious. We ordered the sun dried tomato cheese fondue and the waiter gave us extra bread. Loved the atmosphere, server and food - very cozy place and exceptional service. Great price too! I highly recommend :D"}
{"text":"We are not in the habit of complaining BUT this is quite simply a truly terrible crepe place. The reason is very simple: they pre-cook all their crepes in the morning and then they microwave them before serving, the result is a disaster. The crepe is not fresh of course, the texture is terrible, hot in some spots and cold in others. Becuase it is cooked hours before and microwaved the ingredients inside the crepe fight with each other.  We give them 5 stars for honesty: when asked they admitted that they pre-cook their crepes. We know crepes and this is absolutely NOT how a crepe is supposed to be enjoyed. 

Definitely a tourist trap because of its lovely location in the heart of Old Montreal."}
{"text":"[Montreal Food Tour Stop #6] Big crepes, savory and sweet, along with other breakfast food in a hopping part of Old Montreal.  There's an upstairs and downstairs dining room in this restaurant.  On a nice day, the windows will be open for fresh air.

Highlights: Large, tasty crepes.  I ordered Crepe La Sonia, which is a large dessert crepe that includes strawberries, bananas, and hot chocolate sauce.  As a bonus, there's vanilla ice cream served on the side.  The crepe looked great and was sprinkled with powdered sugar.  There was a lot of fruit on the inside and the crepe itself was fluffy.  Yummy and sweet, but not too sweet.

Critiques: The bananas in the crepe were a little overripe.  The crepe was big and very good, but it was a little expensive ($13-14 CAD) for a crepe of this quality.  I was probably paying a little more for the atmosphere.

Overall: Solid crepes in a popular touristy part of town.  The flavor was very good overall."}
{"text":"Decent ambience, cute in a way, on St. Paul, college/younger crowd, OK service, rather expensive for crepes...Crepes were good but not authentic French...They were the white flour kind, and not the \"saracen\" f darker flour crepes you should have when you eat your \"salty\" meal crepes...So I guess I'm still on the lookout for the perfect crepe place in Montreal..."}
{"text":"Not impressed. Waiter seemed to be in a bad mood and my party of 3 felt rushed to place our order. Soup and crepe were good but I couldn't rate my crepe due to the fact that it never came. I love old Montréal but I have to tell you that there are better places for one to spend their tourist dollar."}
{"text":"Ah Old Montreal.. the European charm, the cobble stone street, the tourist traps... Yeah, this place has decent food for higher than average prices, but it makes up for it with comfortable outdoor seating, or multiple levels inside with nice cool AC for those muggy Montreal summers. 

Ordered a bottle of San Pellegrino with lemon for the glasses and we enjoyed a lunch of savory crepes - specifically the spinach, ham and brie filled one and a brie with caramelized onion sandwich. The sandwich came with a nice little side salad. Everything was tasty. Service was friendly, but leisurely which is fine when you are vacation. 

I wouldn't recommend this place as a destination, but if you are in the area looking to people watch with your meal this place fits the bill nicely directly on Rue Saint-Paul Est."}
{"text":"We stumbled upon this little gem almost by chance, and we were so glad we did.

It's a cute little creperie (with all kinds of other food too) located in the Old Port. Very friendly waitresses, and a beautiful intimate feel. Also it didn't have the pomp or prices of the old port, just comfortable and intimate.

We ordered a variety of crepes, salads, and soup, and we loved everything. Really great spot and we'll likely come anytime we're in the old port. So happy to find it."}
{"text":"Had the Mediterranean crepe with chicken and ratatouille and it was absolutely delicious! The ground floor was super cozy right along Saint Paul. Le Remy was a delicious drink and so was the Cidre Chaud, however the Cidre Chaud seemed a little overpriced given how tiny the cup was. Nonetheless delicious food and drinks in Old Port!"}
{"text":"J étais un habitué. Quand on vient souper un trio de fondu 75$ pour deux, puis un mouton cadet à 23$, on a s'attend à autre chose que de la viande de buf servie noire, une fois puis deux fois après avoir demandé un changement d'assiette. De plus la viande avait un goût de poisson, pour la deuxième assiette. La troisième avait l air correcte, mais bon deux expérience négative ça coupe l'appétit. En plus, limite on te rit à la face .. 
C'est bon ça suffit. 
Tu prends un café pour terminer le souper, et la facture. 138 $ taxes et tip compris,Tu paies plein pot. Tu crois qu'ils auraient offert le café pour s'excuser ? Même pas ! Bonjour le sens du commerce ..."}
{"text":"I must admit, I didn't get the crepes here. Instead, I got a fulfilling meal of fondue, both swiss and chinoise. That was plentiful for 2 people, I can't imagine how full my tummy would be if I also got the chocolate fondue.

The cheese fondue was excellent -- creamy and savory, served with the usual bread cubes and fruits. The broth fondue was good too! It looked very plain when it was served -- with a plate of meats and a plate of typical vegetables (mushrooms, broccoli, etc), but the actual beef broth was mouthlickingly delicious! So unassuming, yet so yummy.

They also have a few affordable wines, which go well with the delicious meal. Service is a bit sparse (well, not quite saccharin like south of the border anyway), but it's sufficient, and in line with other places around here, if only a little bit slow."}
{"text":"This place was pretty good. The outside is deceiving though because it looks small up close but it is massive on the inside! So don't expect to get a quick lunch here on the weekend. The cheese fondue was nice. We got the herbs, spices, and dried tomato fondue which was ok. We enjoyed it more with the fruit and not so much with the bread. The bread had dried olives in it or something that gave it a bitter taste. We also ordered a BLT which was fresh, hot, and tasty. I just wish the wait hadn't been so long because we had a lot of sightseeing we wanted to do."}
{"text":"Do not come here for fondue. It's advertised as a fondue restaurant but it was not good.

Waitress was friendly but so slow considering half the resto was empty when we arrived.

They didn't even use fondue pots. They used a camping stove and an old pot.

The skewers were all melted.

The sauces were more like salad dressing than fondue sauce.

The chicken was hardly cut so the peices were too large to cook quickly and even then we werent sure if it was cooked well.

And more importantly it was $50 a person. The best fondue spots in Montreal don't charge this much."}
{"text":"The crepe with brie, apples, and maple syrup changed my life.

I'm not kidding."}
{"text":"In a street full of tourist-trap restaurants, this one stands out simply because they make some solid crepes and soups.

I was expecting the crepes to be decent and this place didn't disappoint.  The vegetable crepe was really well made and the portions were pretty sizeable.  

I also tried the montreal salmon bagel and it was a pretty good sandwich.  Very simple but the salmon was really tasty.  

What surprised me about this place was how good their French Onion soup was.  The cheese was perfectly baked and the soup was just right.  Not too salty and not too onion-ny.  I was very pleased with the meal as a whole.

The place gets pretty packed during peak hours and you may expect to wait a while, but they have a lot of seating upstairs as well."}
{"text":"The french onion soup and crepes but best of all the hot chocolate!  Chocolat au chaud!!  This restaurant is like a little cozy, several stories of goodness.  A lot of tourists but SO WHAT!  The waiter was cordial and told us what tourists usually order so we actually went against all of that.. since we wanted to be different! HAHAHA

Anyways, aside from the soup, we ordered the escargot.  Also ordered a few crepes to try.  It was all very good.  

I am so glad to have checked out this place!"}
{"text":"We just wanted a quick snack. Had the Nutella with Banana Crepe and the Cinnamon Apple Crepe. It was okay. Nothing spectacular. 

Waiter kept refilling the coffee without us having to ask. Very attentive. Checked on us regularly without being intrusive. 

We came in the afternoon and had a corner table on the first floor. Nice spot for people watching."}
{"text":"My children (12 and 14 year old boy and girl), really enjoyed ourselves and our meal.  We all ordered lunch crepes and they were delicious.  Afterwards the kids ordered chocolate fondue.  The service was great!  The food was excellent."}
{"text":"Small portion sizes, barely filling and average taste overall."}
{"text":"The crepes were just ok, actually the tea glace (iced) was the best we had but my asparagus crepe was too sweet for a savory filling and rubbery. We were hot and had 2 glasses of the iced tea so that made us happy."}
{"text":"It takes forever to get served.  It is a chain -- so the dishes aren't awesome.  Seems the sweet crepes are better (or at least look better) than the savory ones, we did not stick around to find out.  The savory crepes though... First of all, they don't taste so good.  The crepes are soggy, the chicken is a bit dry and the cream sauce put us in the bathroom for 2 days.  So, I would say never again"}
{"text":"My husband and I stopped by Crêperie Chez Suzette on our way back from a nice day at Montreal's Old Port this spring. Since he is Texan, I thought it would be a good occasion to have him try another sample of Québécois cuisine. Unfortunately, however, the food turned out to be quite bland; although it didn't taste bad, it lacked the je ne sais quoi which makes a meal memorable. I had the Crêpe Argenteuil and he had Quiche Provençale, both of which seriously lacked seasoning. Other than that, their coffee and drinks were fair and their staff was pleasant enough.

Conclusion: Since my cooking's better and tastier, next time I'll Isave my money to buy fresh ingredients and cook those dishes at home."}
{"text":"Fondue was good, I would totally skip the savory crepes. They were nothing to write much about"}
{"text":"Absolutely divine crepes, very indulgent and yet not so filling that you feel stuffed afterwards.

We were warmly greeted at the door by the hostess and immediately seated (a nice surprise at noon on a holiday Monday in the touristy part of town!) at a table in the middle of the room, then she promptly moved us to a table near the window as soon as she finished cleaning and resetting it, without us even asking.

The service was quick and polite, coffee was refilled without us needing to ask and the crepes... well, they were delicious.

I ordered Le Sonia, which was strawberries, bananas, vanilla ice cream and chocolate sauce. My husband had Le Jamaicaine, which was similar, but without strawberries. Both of us easily finished our crepes and one of the two scoops of ice cream, were satisfied and agreed that there was no way we could have had a savory crepe and then the sweet ones, so I think it's the type of place we'd return for a dessert or specifically for savory ones for a meal. The coffee was even very good (Cafe Brossard brand, I believe) and provided a nice balance to the dessert crepes."}
{"text":"Came here with the mind set of splitting a crepe. Nope. Each got a dessert crepe. No regrets. Crepe is a bit chewy but overall the quality was so good, fruit is fresh, ice cream is good. A little on the pricey side but that's what you would expect for the crepe. They have a nice patio outside and service is quick. Going into a sugar coma now."}
{"text":"We came for breakfast and sat on the beautiful patio and had wonderful service. All 5 of us loved our crêpes!! The Parisienne especially, with brie and green apples, yummmm. I would highly recommend, great food, service and ambiance for the price."}
{"text":"Another favorite of mine whenever I come and visit Montreal. I've been coming here since 2011 and a must get when coming here is their Toffee Crepe with Ice Cream plus their Escargot and French Onion Soup. If your ever in Old Montreal, drop on by. You won't regret it."}
{"text":"Located in the old port of Montreal, this three-stories restaurant has a warm and cozy feeling and a great selection of crepes, with meats or as desserts! I tried shrimp crepe, which was something very new to me and I absolutely loved it!"}
{"text":"I understand that lots of places like to seat people next to the window because it makes the restaurant look full. But when your windows don't have curtains and the sun is shining in right on the table, you probably shouldn't do that. That's what happened to us, and we probably should've moved, but I thought the sun would feel good. It did for the first 5 minutes, but I was sweating by the end. Why don't they have curtains? Strange.

Our food was decent, I had the club sandwich and upgraded to a Caesar salad for $1.50. The salad was great, the sandwich was OK, but the bacon wasn't crispy and I think the chicken was the canned type. The bread was toasted so much that it actually hurt my mouth when I bit into it. On the upside, the service was very good."}
{"text":"Stopped in for a quick bite to eat before doing more sight seeing in Old Montreal.

The menu is long with a large variety of salty and sweet choices.

We decided on crêpes!

1.  Parisienne: apple, brie cheese, with Quebec maple syrup 

2. Class Sucre Creme:  toffee cream

The Parisienne crêpe was tasty but the toffee cream was much more delicious!

Decor is trying for a quaint Parisian look and feel but falls a bit short with dated fixtures and furniture.  

The view from the second and third floor is nice with large talk windows and the atmosphere with the nice summer breeze and the church bells makes for a pleasant dining experience.

Wait staff is average and speak both French and English, which helps."}
{"text":"A delicious choice for this beautiful strech of shops and restaurants down in Old Montreal.  We ate here at about 11am and sat upstairs where we could look down on the cobblestone streets below.  I had the crepes with smoked salmon, capers, red onion, lemon, cucumber and cream cheese.  They forgot the cream cheese but gave me some on the side which was okay with me.  I constructed each bite the same and the cream cheese was helping the bits of red onion, capers and tomato stay on my perfect little bites.  My wife made fun of me for this.

My wife had apples, brie and maple syrup inside her crepes and let me tell you, that was outstanding... unbelievable flavor and it had sweet, savory and creamy in every bite.  This was real maple syrup as well which definitely has a distict flavor which wouldn't have worked as well if it were corn starch american pancake syrup.

Our only regret was that it was morning still or my wife would have had one of their specialty drinks which was a blackberry icecream shake, booze, cherry juice and fudge.  Yeah, sounds too good to be true."}
{"text":"Crepes are mediocre at best. Barely any nutella. Feels like they opened up a store bought crepe, spread as thin of a nutella layer as they could and microwaved it. If you're ok with mediocre crepes than go for it. But i suggest paying a few more dollars and going to Cacao 70 10mins away for a real crepe."}
{"text":"Stopped here for lunch, after taking a walking tour, and very glad we did. The food was very pleasant, we had the lunch special, which included soup, crepes, tea, and a dessert for the incredible bargain price of $9.99 CAD. All of the food was well-prepared, tasty, and served by a very friendly waiter, in timely fashion, and all in a lovely, welcoming, atmosphere, in a quirky old building in Old Montreal. If you find yourself in the Old Port, and want a pleasant meal, this place is worth a try."}
{"text":"As first-timers in Old Montreal and ones with young kids, we were thankful to have come upon this place.  After an exciting day at the Montreal Science  Center (which is very, very close from here), we were all starving!  We thought that this place was perfect for us that night because the ambience was charming, if not romantic, and yet, very accommodating to little ones.  

We were fortunate to have a server who was very sensitive to our family's needs.  She suggested that we share the crepes with our daughters (as opposed to ordering separate for us) because they were big enough servings. So, that worked out well.  In fact, in the end, we were all too full for desserts.  We had the La Quebecoise (with Swiss cheese, ham and Quebec maple syrup) and the Chicken Supreme (chicken pieces and ala King sauce).  And boy, I would never forget my husband's and 1 yr old's first taste of escargot!  We also had a fine bottle of Brouilly, which our server suggested.

Food was actually simple and really unimpressive.  But, like I said, it was perfect for us that evening!

And just to add a note to parents: There was no changing table inside the toilettes but you might want to try out what one mom did: she used the top of the deep freezers laying by the coat racks as her baby station.  I think it works well!"}
{"text":"My fiancé and I wandered into this restaurant while exploring the Old City, and luck was on our side! Beautiful place with tables overlooking Rue Saint Paul (would suggest getting a window table if possible).  I got the brie and leek quiche, which was recommended to me by our server, and it was fantastic.

Overall an excellent experience, and I don't think I would change a thing."}
{"text":"Me and my friend were in Montreal for a one day trip. We were walking on the street of Old port and saw this place that has cheese fondue! I have been wanting to try cheese fondue for a long time so we decided to have something small here. The atmosphere is cozy and quiet. The waitress is super friendly! We ordered French Onion soup and a Swiss fondue with white wine and kirsh. The soup is nice and has a sweet and rich flavour (what can go wrong with a French onion soup?) Personally, I like the fondue! My friend think the wine flavour is a bit strong and bitter, so maybe a little bit less wine flavour would be nicer? The waitress even asked us if we wants more bread! If we ever come back to Montreal, we would probably come back to try some other thing on the menu!"}
{"text":"This place was amazing. We searched all over old Montreal for a fondue place and this definitely hit the spot. Our server, Stephany was the sweetest person ever. We had the bruschetta and French onion soup to start as well as the trio of fondue. The cheese was incredible, and the beef broth for the second course was so succulent. We would definitely return!"}
{"text":"Great french onion soup, tasty lobster bisque soup, and the \"Sonia crepe\", sublime! Great fast service."}
{"text":"I really wouldn't have thought Brie, apples, and syrup would go so well in a crepe! The three-cheese crepe was also great. I'd love to have tried the dessert crepes."}
{"text":"The waitress's recommendation, Butter sugar crepe with strawberry, was really good, but I am pretty sure I can find the better one in somewhere. not that special, but it was good."}
{"text":"The quiche Lorraine was delicious - but it's the service that gets 5 stars! My dad forget his bag at the table and the waitress tracked us down almost three blocks away to give it back!! And it was cold out! MERCI BEAUCOUP MADEMOISELLE!!!!!! :)"}
{"text":"Honestly--just go here, MANY times, and eat MANY crepes. Decor is cute, we sat on the second floor in front of an open window that faced Rue St Paul which was gorgeous. Service, as with most places in Montreal, in English, French or my particular brand of English-French hybrid. 

My husband ordered an egg, bacon and cheese filled breakfast crepe with pure maple syrup, and I opted for ham, brie, and spinach with bechamel sauce. Large portions, even though I was starving and tried my hardest to finish I could not! Also amazing milkshakes, and iced cappuccino.

A must visit if you're in Old Montreal."}
{"text":"Great fondue and soups. Poor service. Waitstaff non responsive to requests unless you asked multiple times. Took 15 minutes from getting check to processing payment. Waited 10 minutes for waiter to come back to take order after he said he would right back.   In the meantime he cleared off two other tables"}
{"text":"I am very picky about crepes. This place was pretty great. Pretty awesome location on St. Paul in Old Montreal, you can't miss it. We ran in there because it was -28'C (aaaaaahhhhhh!!!!!!!) out and I didn't feel like poutine. We got there and the atmosphere was cozy and everything smelled good and the people were so nice and it was so warm. We sighed as we sat down by the window. Savory crepes are good, dessert crepes are better. Soups au gratin are really really good. Hot chocolate is excellent. Ham sandwich is eh. View outside is kinda romantic, which isn't difficult on that street. Price isn't really cheap, but worth it. Eat there."}
{"text":"I come back to this establishment every time I am in Montreal for both savory and sweet crepes. Staff is very friendly. My only negative comment would be for them to repaint/re-design the place so it is more inviting and pleasing. Right now it is bare bones and a bit used and abused."}
{"text":"Yeah Chez Suzette is a good crepe place. I got the Canadian Crepe which was nice. I location is very nice in the heart of Vieux-Montreal. The waitress we got was nice, and spoke pretty good english. The milkshakes here are also very good."}
{"text":"Hh"}
{"text":"Let's just say I was craving crêpes. 

I selected the Délicieuse, $14, which was loaded with bananas, topped with sliced almonds and a toffee cream sauce, with ice cream on the side. Good balance of flavours and crêpe-to-accompaniments ratio. The crêpe itself was the perfect thickness.

The Café Viennois (Viennese coffee) was satisfactory while the Chocolat Chaud was rich and above average. Both were $5.

The décor is outdated and I can understand the lukewarm reviews. Although I wouldn't specifically come here, this quaint little café is a nice option to pop into when walking around Old Montréal."}
{"text":"We ate here our  first night in Montréal.  We picked it at random and were not disappointed. The food was delish. We did cheese fondue, which was awesome!  They had lots of great dinner and dessert crepe choices. We came back for brunch and had excellent dessert crepes, and the French onion soup is a must! The staff was attentive and friendly, and the ambiance had a cute corner café feel. A gem in a bit of a touristy area."}
{"text":"Nice fun place to dine and people-watch, but don't expect cuisine. We got a table inside overlooking the procession on St. Paul St, a great view. But the cheese fondue - one of their specialties - was a huge disappointment. Instead of baguette chunks, we got cranberry bread, olive bread - soft, gummy breads. And the cheese lacked the punch you get from kirsch; our packaged fondue from Trader Joes tastes better. 
The Caesar salad - admittedly a side order - was devoid of Caesar flavor; just chopped lettuce and croutons. Likewise, their Suzette Sundae, a concoction of Grand Marnier,  cognac, and ice cream, was mostly melted ice cream, more to be slurped thru a straw than eaten with a spoon. Food was definitely phoned in. 
The resto is attractive, outside and in; service was fast and friendly and responsive. I just wish the food had been as likable. 3 stars max."}
{"text":"I heard about the famous onion soup from Suzette and I was also drawn by this French bistro because I visited France two years ago. I was disappointed by the quality and service since the food was quite plain and overpriced, same for the sangria that we ordered. We sat on the terrace and had a good time talking, but the food (salmon salad and onion soup) and the drink were below average. Yet, since the restaurant is located at the intersection of St-Laurent and St-Paul, many tourists are willing to pay ridiculous amount to eat at this place, but honestly there are much better options for the same price around the same area."}
{"text":"Delicious savory and dessert crepes. A great spot in Old Montreal to sit and look out over the old stone road while eating this French delight. I stop here every time I am in town. Probably my favorite crepe joint in North America. The services is great too; friendly and fast."}
{"text":"We wanted to stay with the Parisian theme, so stopped by this cute little place. We had different crepes and chocolate fondue to finish it up. Friendly service and quick turn around."}
{"text":"I ordered the crepes for dessert and they were cold and thick in texture. The ice cream served with it was gummy, horrible texture. The toffee cream and sliced almonds were good. The group I was with ordered the crepes Suzette and it tasted like orange cough syrup and again the crepes were cold."}
{"text":"Bland tourist food. Food came barely warm. Bland dry chicken in chicken/ratatouille crepe with bland barely-melted mozzarella. Lobster bisque ok but little hint of lobster or sherry."}
{"text":"Great location in Old Montreal and the old-world feel of the restaurant add to its charm. Service was not great, but aside from that the food was pretty good. There are some nice salad option which can be tough to find so if you're looking for some good greens this is a good location for you. Lots of sweet and savory crepes and fondue options.

I LOVED my Parisienne crepe which had apples, brie and of course some maple syrup. Many of the other crepes included cheese and some more cheese on top...I felt like my dinner option was sutto healthy.  Chocolate fondue is a must and one portion was very generous. Our dessert was accompanied by loads of fresh fruit, bits of crepe and marshmallow."}
{"text":"We went for Fondue, but ended up tasting it and giving it back. We than ordered a crepe with nutella and bananas and got a Crepe with Nutella and strawberries instead.... I also ordered a cup of hot tea but never got it... waitress wasn't great... the reason for 3 Stars is; she didn't charge us for the Fondue...
If you go, try the crepes, the fondue isn't great at all...
Will I be back? Possibly..."}
{"text":"We came here for a birthday dinner and the service, food, and atmosphere we received was fantastic. Our waiter was very friendly and helpful, and seated us on the second floor where we got a lovely view of the bustling streets of Old Montreal. I ordered La Méditerranéenne Crêpe, a baked crêpe filled with chicken and ratatouille, topped with generous amounts of mozzarella cheese. I also had the Bellini Fraise drink, which tasted a little strong in my opinion (but I'm quite a lightweight). For dessert, two friends and I shared the Fondue au Chocolat pour 2, and the dark chocolate was very smooth and rich. If you tell the waiter that it's someone's birthday, they will bring the dessert out  with a candle in it while singing happy birthday. Overall, I was very satisfied with my meal and will definitely go back there when I get the chance."}
{"text":"It is not easy to find a place for a Fondue on a Sunday, during lunch time. I've found this place on Yelp and decided to give shot.

The place is huge. Two or three floors I think! The service is friendly. I've found the full fondue meal (cheese & meet & chocolate) off MY budget, but not too bad. 

The cheese fondue was delicious. I loved the veggies that came with it. The meet one was ok. Nothing special. The chocolate... Well... It's chocolate. Of course it was amazing! 

One thing that bothered me was that the timing wasn't good. It took too long between the services and we spent almost the entire afternoon there. 

Overall, it was nice for the company we've had, but I'm not sure I'll be back."}
{"text":"Ate here first day in Montreal. Food was very fresh, service was good. Ordered a chef salad and bruschetta.  Both delicious.  The dressing on the salad was super tasty; mustard vinaigrette.  I would definitely eat here again.  This place is usually a busy..definitely a good sign."}
{"text":"Great place to grab a crepe in Old Montreal. The hot chocolate was amazing and I really enjoyed my crepe. Nothing like a strawberry, banana and chocolate crepe for breakfast (La Sonia Crepe). I think the best thing about the restaurant is the ability to sit outside at a bistro table and people watch."}
{"text":"We stayed right on Rue St Paul in the heart of Old Montreal and found this a very convenient spot to have a relaxing lunch on a cold snowy afternoon.

We decided to have one of the special combos for two for $59.95.

We each started with a caesar salad.

Next we had each had a choice of either french onion soup or escargots.  My wife chose the former and I chose the latter.  Both were well executed and perfect on such a cold afternoon.

Next came the cheese fondue.  It tasted like the fondue that my mother would have made for us back in the 1970s.  They served it with 3 types, or so, of bread and some cut up apples.

Lastly, we got to choose between crepe suzette or crepe viennoise.  My wife chose the former and I chose the latter.  I am not big fan of Grand Marnier so I didn't even taste hers.  However, she said it was excellent.  I enjoyed the chocolately goodness of mine.

It was a good stop and enjoyable meal!"}
{"text":"Amazing place! The best crepe I've ever had! And also the best sangria as well! Price is fair, service is very good!  Remember to make a reservation in advance! The place is in Old Montreal, which is very cute and pleasant to visit!"}
{"text":"I had the most horrible experience in that restaurant... we arrived to the restaurant before 7... we didnt get our entree until 9... we had to ask and remind that we hadn't ate... all we ordered were cheese fondues... we saw people who came after us left already... and the quality of the fondue wasn't even good... i had better in NYC... 

the service was terrible as well... we asked the waitress to lite the candles for the fondue(she only lite 1 candle which the cheese wasn't even hot) she told us all the excuses that she couldn't lite them while there are like 5 candles underneath...

At the end, i requested for the manager... her reason for havin us waited for the fondue was the restaurant was really busy... dun feel sorry at all..."}
{"text":"I'm not a picky eater and I normally don't write bad reviews but this place is a one star.  Terrible service, foods was really bad, the eggs weren't cooked properly and the crepe was very rubbery and dry. Do not recommend it"}
{"text":"Cute little diner in the heart of old Montreal. We made reservations and sat outside. It was a nice area of town and good people watching. We ordered cheese fondue- delicious - with bread fruits and veggies. We also ordered and ham and cheese crepe with bechamel sauce- YUM, and we ordered escargot covered sigh cheese and garlic. Legit!  It was like a trip to France! And we ordered a bottle of Chardonnay! Super delicious, intimate meal on one of the oldest streets in Montreal! Would highly suggest making reservations and sitting outside. We were happy with all of our food selections !"}
{"text":"I visited Montreal with my parents and took them to Chez Suzette. We got the 3 fondue combo that was a perfect meal that was very filling and totally worth the price. Whether you're looking for a quick bite to eat or there to enjoy a 3 hour long 3 course meal, Chez Suzette is a quaint place in Old Montreal that's worth a stop."}
{"text":"They had a very good menu with lots of choices. That whole vegetarian section which is just fine by me. They had a good selection of wines as well as apple cider. The place is big inside as well as you can sit outside. The crapes were delicious and the portions plenty. My friends also had crepes as well as a salad and soups and they were very satisfied and finished all their portions. The service was attentive and friendly. I would recommend this place and definitely return."}
{"text":"I'm about to drop some fondue knowledge on you AND give Chez Suzette their centennial review? Now that's what I'm talkin' about...

I was all about revisiting this place during my last visit to Old Town, Montreal. I have this on going joke going with my significant other that goes like this \"Have you been there before on a date?\"* The answer is sadly often yes, because we met in our late 20s/early 30s and are both people that eat out way too often. In whatever city we're in. Anyway, when it was time to play this round I finally got to say \"only with my mom and my best friend's little sister.\" This was bittersweet, as I felt like I won, but then he didn't try to outdo any other scenario. Wow. Talk about TMI. Moving on.

I know this is a creperie, but I disagree. Suzette's finest is her fondue. I've had the original emmental and this time the three cheese and pepper. Delicious. I know others say the prices are jacked up because of this touristy location, but I got a bottle of French merlot (No one is drinking merlot!!! -Sad Paul Giamatti) for under $20 and shared the gooey gooey goodness with my SO. The small is definitely enough to share, and they offer to bring you free bread when you run low. They respect bread to cheese ratios, thus I respect Suzette and her three floors of casual Quebecois dining in the heart of this cobble-stoned hood. 

*This game might sound really passive aggressive but it's actually not. It's more like, \"But did she have the bartender send you a flaming shot**? I think not! See I'm the best!\"

**No flaming shots were done at Chez Suzette. She's too classy for that stuff."}
{"text":"This was for sure my most memorable dining experience of the entire trip to Montreal. Their Crepes Suzette were such a delectable highlight. The soft velvety orange sauce over tender perfectly executed crepes - YUM! Service was quite attentive, helpful, and friendly. Now, our waiter did say, \"Large Breakfast?\" when I ordered the crepes. I'm used to much smaller portions at home - but we managed to get within licking distance on that plate and finished them no problem. Don't pass this place up for great crepes."}
{"text":"Service- excellent
Ambiance- good
Food - I've had better

I got the Swiss fondue and was not impressed... The ingredients did not seem fresh and overall it was bland"}
{"text":"A gorgeous view of old Montreal and a fun environment! I ordered a savoury and sweet crepe which complimented each other well! The waiter was very friendly and I enjoyed the food! The best part is the scenery though! A wonderful location!"}
{"text":"Enjoyed their crepes. Had the Mediterranean crepe ( chicken and vegetables in it with cheese on top) asked for mushroom sauce on the side. Yummy! Service was a bit slow. But it was busy. Located in old Montreal. Nice atmosphere. We were too full to have some dessert crepes. Until another for that then."}
{"text":"This place gets 2 stars only for the polite staff.  My boyfriend and I came here for the fondue they featured and it was cold and incredibly overpriced.  I'd steer clear, there are much better restaurants in Old Montreal."}
{"text":"This place serves the best crepe ever. I was recommended by a few locals and tourists to check out this place and so I did. 

Creperie Chez Suzette is a two-storey building with a patio located in the central tourist area in Old Montreal. It serves a large selection of crepes and fondue. 

At my visit, I had the French crepe with stuffed ham, Brie and caramelized onions served with 100% pure Quebec maple syrup. It was delicious! It was hands down the best crepe I have ever had.

I would highly recommend this place to all! If you're looking for a local authentic meal, this is it!"}
{"text":"Excellent location in Vieux-Montréal; very welcoming to tourists. Three levels and many available window tables. I ate alone and had a very nice server; wished I had been with friends to taste more!"}
