{"text":"I was skeptical about this place because \"Chicago Deep Dish\" is one of my favourites.  I travel to Chi-town a lot and frequent a few joints because they have won my heart.  I love this style.

Chi*Pie will become a frequent place for me now.  I ordered the Chicago Classic.  Pizza uses great ingredients, has an excellent crust and the sauce is spot on.  It is also baked for 40-45mins, so order in advance.  

Who would have though you could have a little slice of Chicago in Brampton.  Well done."}
{"text":"Love, Love, Love this place! 

Great service and the deep dish Chicago classic was amazing!  As good as I remember getting in Chicago. The sausage had a nice little bite and the sauce was perfect!  

We got a medium for 2 people and wound up with leftovers for both of us the next day.  I just wish they delivered."}
{"text":"This is not pizza.  We eat all kinds of pizza from the franchised chains to gourmet pizza restaurants.  We ordered a meat lover at Chi-Pie for the first time and sorry to say, will also be the last time.  It's a thick pie crusted concoction pilled with way too much sauce and meat stuffing. The crust is thick and lumpy. There are so much fillings that the inside of the pizza was not even warm.  We couldn't  even eat half of it.  If you are expecting to try a different style of pizza, you are going to be disappointed.  We also had to wait 45 mins.  It's definitely not worth it. And it's wait over priced."}
{"text":"Love their pizza. This is coming from someone who makes a yearly trip to Chicago just to eat deep dish pizza. Flavour are good. Only down side is the crusts of their deep dish pizza aren't caramelized. If they could somehow perfecr their crust"}
{"text":"I've never tried deep dish pizza before. When I had the opportunity to try this type of pizza here I pounced at the opportunity. I tried the Al's Alibi, Chicago Classic, and the Sting. All were really good and stuffed with wholesome ingredients. They use high quality cheese and not the cheap cheese that are made of soy oil. 

They also sell regular pizzas, wings, and potato wedges for a more wholesome meal. 

Thanks to Roy for an amazing experience"}
{"text":"I just visited Chicago for the first time this past summer and had real deep dish pizza for the first time. It was amazing. Since returning home I have tried other \"deep dish\" pizzas in the area and none have compared. That is until I had Chi Pie Pizza. It was amazing. Easily on par with deep dish pizza in Chicago. I had Chi Pie for the 1st time a week ago and returned for another pizza a few days later. It was that good. I will definitely be returning many more times. Easily my new favourite pizza place!"}
{"text":"The people here are SO FRIENDLY! They are so kind and very accommodating. I wasn't sure what to get and they told me all the different combinations over the phone. The pizza was also great! So cheesy and yummy. My only negative is that the crust was a little too thick for my liking!"}
{"text":"Thanks for this alternative to the everyday. Great price, nice interior, decent pie. I prefer having deep dish w sauce on it so the sauce-less version was a little different... but good different."}
{"text":"Ordered the monster meatball deep dish.
The crust was hard, the cheese was a thick layer of goo, and the tomato sauce was too much ,the meat was not cooked/ seasoned to my liking. Overall bland tasting . I'm not sure if they cook the meatballs before putting them into the deep dish but that would be a recommendation, making the meatballs smaller more flavourful and on the crispy side. Overall I did not like it. Forced myself to finish my slice. I also don't like that there's no custom style deep dish. Went in April and it was so hot in there, maybe invest in some blinds to give your customers the option to keep the hot sun from beating in on them while they dine"}
{"text":"New pizza place opened in Nov 2017.  Had the deep dish prohibition pie.  Was tasty, about 2\" deep and just like what we've had in Chicago in the past.  Sauce is really good and the toppings are authentic. 

Got a size large which could have been a bit bigger for a larger crowd and is smaller than a traditional large pizza but a slice is very filling.  Prices are decent.  

Good place to try if you are in the neighbourhood."}
{"text":"Great pizza. Had the sting. Was super fresh. I was worried it was going to be heavy but it wasn't at all. My wife and I were able to finish a medium without feeling too full nor hungry. Will go back for sure!"}
{"text":"I know Chicago Deep Dish and this is NOTHING close to it. The crust is horrible and it does not taste good. Don't waste your time and money here, not worth it. I'd do pizza hut, even pizza pizza over this place."}
{"text":"Usually I go to mickey's for my Deep dish pie, so when Iheard about this place, I had to check it out.   Called a head to place my order for a medium prohibition deep dish, was told 30 minute wait.  Not bad.

Got to the place early, it was quiet, but the staff was super friendly.  Big points on that.

Price wasnt bad, 18 bucks taxes in. Lots of toppings.
Size was good for 2-3 people.

Pizza was loaded with cheese and toppings.  Very filling.

Overall it was delicious...maybe a little bit less salt but other than that...would come back.   I do like Mickey's more, but they have gotten pricy, and quailty a bit down.   Chi pie would be more of a regular thing.  Next I will try the normal pizza's just to compare to your standard dominos."}
{"text":"If you have had Chicago deep dish pizza.. this is not it. The ingredients were fresh and tasty although the crust was not what it should have been.  It's good for the pictures."}
{"text":"Great tasting pizza! Wasn't an overload of everything so you can really taste every bite. Will definitely go back!"}
{"text":"Best deep dish pizza I've had since my vacation in Chicago! If you've been waiting to try this place now is the time. You will not be disappointed, Chi Pie rocks! I'm happy to have this pizza place in my neighbourhood and will be back again soon!"}
{"text":"This place is as close to \"real\" Chicago style pizza as you can get in the GTA. It's a bit tucked away, but was worth the trip for a reminder of why I love deep dish pizza. The crust is basically a biscuit, which was the only thing I wasn't a huge fan of - I prefer the Pequod's-style crust with caramelized cheese around the edges. Either way, give this place a try!"}
{"text":"Came here at 9:40 and this guy wouldn't let us in because he decided to close up early bc no sense of customer service. Bs. Never coming back. It's open every day until 10pm unless Friday and Saturday when it's open until 11pm."}
