{"text":"Lots of people!! Nice owner!! Wide varieties of pasta and good wine! Except the tables are too close to each other!!"}
{"text":"The food is quite inconsistent here. One visit the food will be pretty good, the next it's like what happened. Sometimes, their ingredients aren't that fresh either. It's usually not busy so getting a table is no problem. The waiters don't come by your table very often so when they do, make sure you grab everything you need. Portion sizes have started getting a bit smaller, but I understand that the economy isn't good so everyone is trying to save wherever they can. The only time really worth coming here is during their $8.99 pasta specials"}
{"text":"For sure the best Chiantis in the city! Great gluten free options including substituting pasta for spaghetti squash."}
{"text":"I never expect too much from a chain and like usual, this chain restaurant did not exceed my expectations! 

They give you complimentary bread with olive oil and vinegar and the bread was very soft and warm. I shared the caesar salad with 3 friends and it was a good size for sharing. The salad was OK, nothing special. For my entree I had the lasagna al forno, which was good. The portion sizes are comparable to most places that serve pasta and I left feeling pretty full! You can get any pasta here for $11-12, so it is really affordable and their pasta selection is huge. 

It was not busy at all when I came and the service was OK. Again, nothing special. I probably wouldn't come here again and I would only recommend it to someone who was looking for decent, cheap pasta."}
{"text":"Affordable and great tasting - that's a combination I look for in a restaurant, but you have to have good service.

I have been frequenting this location on and off for several years. The staff has always been really terrific but lately it has gone downhill. 

The food is, as always, terrific, but the service has been really poor lately. Perhaps it is because the summer and it's patio season...I don't know.

I'll be back, sure, but not as often."}
{"text":"Always have a great time here. The wait is never very long, the service is also really good, and the price is affordable."}
{"text":"If you're looking for fine Italian cuisine on the cheap, then look no further than Chianti on 17th. 
This dark and cozy Italian eatery offers up an extensive menu and wine list sure to please any gastronome. 
I'm particularly fond of the Pasta Frenzy, offered all day Sunday, Monday, and Tuesday, when $7,99 will buy any one of the 40 pasta choices they have available. As for the atmosphere, well let's just say that \"chaotic\" probably covers it. At least when the Frenzy is raging! 
But really, when you consider the paltry prices, a little chaos is likely inevitable. 
When the moon hits your eye like a big pizza pie, that's Chianti!"}
{"text":"At least the word cafe is in the name so when you walk in and see cafeteria chairs it should be no surprise. 
Went on a Sunday night (Sunday, Monday and Tuesday are all 7.99 pasta nights) with a party of 8. We had a reservation so we were able to get a table relatively quickly despite the line of people waiting out the door. 
The place is extremely crammed, so again similar to a cafeteria, there are going to be other people who are so close they might as well be sitting at the table with you. 
Service is fast and efficient. 
Food was only mediocre and seemed a bit rushed. 
Menu had good variety for everyones tastes. 
High chairs and booster seats available for those with kids. ( and baby change table in the rest room) 
Not a lot of ambiance as it was too loud and busy. 
Good for a cheap meal, but could make the same at home for sure."}
{"text":"The service is excellent, the staff friendly, and the food arrives quickly and is enjoyable. Which is why we keep going back. I have to add that it's a great place for dinner after work, especially when you don't particularly feel like cooking."}
{"text":"Mangiare! - Cheap pasta night! A Monday night institution & tradition. First discovered Chianti's quite a few years back. This Uptown 17 locale has always had a certain energy to it, although it's not as vibrant as it once was - there's just so much more competition out there since Chianti's first established itself as a more modern, consistent, affordable, Italian eatery. A plethora of pastas on the menu, all reduced on cheap pasta night(s). Try the carbonara. I prefer the wet version. But Princess B likes the dry. Both are molto benne. If you're looking for some inexpensive and decent carbs, try Chianti's."}
{"text":"I've only ever been to the Crowfoot location... but I suspect that they are all quite similar.
The service always creeps me out, period. The waiters are either greased up kids, or burned out middle-aged dudes.
The pasta and lunch specials are quite a good deal... nothing spectacular, but reasonable. Very casual, quick food. I would recommend the Alla Con Chipotle pasta dish."}
{"text":"Service was lovely, friendly,  very professional, quick and knowledgable. Food came out incredibly fast and was absolutely delicious. Perfect portion sizes left us feeling full but not too full like a lot of pasta dishes. Surprisingly low prices. Only negative comment I have would be that the interior does need some updating. Live on the other side of Calgary but will be coming back for sure!"}
{"text":"It is cheap and good, but if you don't wolf it down fast, it gets cold and hard. I suspect a little microwave action just before serving it. Great little warn rolls with real butter.  Kids menu makes the kid happy."}
{"text":"Terrific dinner. They are very accommodating with allergies. Took care of our group of seven. Jeff served us and he was fantastic . Seafood pasta special was delicious . Thank you . Definitely go."}
{"text":"Way better than some other Chianti locations I have been to.

All the food was delicious!! Everyone enjoyed their meal and my pasta was fresh fresh fresh! Artichoke dip was to die for with enough melted cheese to make you feel guilty for a week. Server was a bit distracted but it was busy and everything was still great. Bruschetta and calamari were also great!

Very relaxed environment and decorations a bit cheesy"}
{"text":"Chianti Cafe & Restaurant, located close to Peter Lougheed, Nando's and Boston Pizza on 32nd Ave NE, is probably one of my favourite Italian eatery. Why you may ask? It's because from Sunday to Tuesday their pastas are priced at $8.99 per dish (not including their specials that can be found on their chalkboard) and with over 25 pasta dish to choose from you cannot go wrong!
Did you know they also offer complimentary garlic bread paired with oil and vin, it's also unlimited. Garlic bread for days right? 

What else does Chianti offer? $9.99 lunch specials Monday to Saturday from 11am to 4pm,dinner features, and wine specials as well!

Parking at Chianti is very decent, there's always room to park so you won't be struggling looking for a spot. Their staff and service is amazing, they always follow up with you to see if you're \"doing alright\" in other words \"do you want to order more or anything else?\" Unlike some other restaurants where the server just ignores you and only come to you when you want the bill. 

I'd recommend Chianti to everyone. They are a +1 in my books and would love to swing by again when I do get the chance."}
{"text":"When you want 7.99 pasta on Sun-Tues, this place is perfectly good for that. Most of their regular prices are 9.99, which is fine for what you get.

This place isn't as good as Crowfoot, but better than 17th. The service is tolerable, the food is okay, and they have cold beer. Once again, cheesy decorations and below-par staff. Grumpy girls pouring olive oil and balsamic vinegar, and the rest of them look like they're mad you walked in at 8pm, being one of the last tables because they just signed up for another hour of work. My pasta was fresh, the calamari in it was WAY overcooked and rubbery. I suggest sticking to the basics.

Don't go if you're looking for some good Italian food, they don't even have a caprese salad? Treat it more like a pasta place. 

For a 7.99 pasta, it's okay in my books."}
{"text":"Normally I wouldn't write a review so long after I have eaten at the place, but this time it was quite memorable. I will note that the experience took place in the summer of 2010.

I've eaten here twice, and both times disappointed. The last time, it was a bit later than usual (about 8pm) and there were 3 other tables in there. About 2 servers, so expected normal service. 

Our food was simply okay, hit the carb load I was craving but in terms of flavour was bland. Service was poor, and no quality check. For me, it is really important to have a quality check, because about 30% of the time, there is something wrong/missing/etc. In this case, the server hadn't offered parmesan or fresh ground pepper... so I waited... and nothing, so I ate. After we were finished, we had to wait about 10 minutes and our server was talking on his cell phone at the bar. Staring, staring, nothing. How annoying! I guess he couldn't wait to finish his shift. Eventually we went up to the bar and another guy helped. I think this is the last time I would go back to this location. I do enjoy their South location near Southcentre, though. 

Oh, and their bruschetta is bland!"}
{"text":"I went to this Chianti for the first time with a large group for lunch on a Friday. Our table for ten was set up and ready when we arrived and we were glad we made a reservation; it was pretty busy! I have been to the other locations in Calgary many times but have feel that the quality of the food and service has lessened over the years. This Chianti reminds me of the great experience I was used to ten years ago from the other, closer locations. Our server was courteous and on the ball and the food was hot, fresh and tasty. I wouldn't classify it as fine Italian dining, but it has it's own charm and the service and price point more than make up for that.

I also liked that even though we are a large group, there wasn't an automatic gratuity built into the bill. I appreciate the decision of how much to tip being left to me. 

Definitely worth the drive!"}
{"text":"Nobody has better salads and soups than these guys.  Chianti Crowfoot is just that good.  To boot, the price is very reasonable.

For a quick healthy lunch, frankly, it's almost as fast and low in price as a meal at the #1 hamburger chain.  No kidding!  At lunchtime you can get in and out of there in 30* minutes flat for $8.00.  You cannot beat this deal and... someone serves you!!

* you must mention your time frame as you are being seated"}
{"text":"Great food, super fast and really reasonably priced!

And also, their house dressing is addicting, we usually pick up some on the way home to add to our salad!  Made in house as well, the North Chianti's dressing doesn't come close to the Macleod Trail location!"}
{"text":"Been coming here for years, amazing service owned by even more amazing people. I come here every chance I can to come in, business discussion, romantic dates, friends and family get togethers. Each time I'm greeted with urgency, and next to no wait for food to come soon after. The food itself is delicious, with a large variety from Italian pasta, sea food, burgers and steak. There is large list of appetizers as well."}
{"text":"This place is great, we always go outside of peak times to avoid line ups, foods is consistent, and good.  We love the Du Chef and the Romanoff.  Their bread is great compared to other locations in Calgary I have been to.  Quick service when they're not slammed."}
{"text":"Atmosphere and service were excellent. And it's certainly a step up from the Boston Pizza across the street. 
Started with the Bruschetta, but it was really terrible, the garlic overpowered the gentle flavors of tomato and basil that make a good Bruschetta. I had the Chicken Parmigiana, which was descent but the pasta was over cooked to the point of mush. Very glad I didn't order a pasta dish."}
{"text":"First off I usually love Chiantis. I frequent the one in the north east, and used to frequent willow park when I worked nearby. I went in for the first time in a while this evening and it was terrible! There must be new management because the place has gone completely downhill! They no longer grate your cheese at the table, now they have those shaker cheese things you used to get at Pizza Hut, we waited 15 mins for bread and were given a stingy little dollop of oil/vinegar. The food was also not as good as it normally is, I have a favorite dish and it was bland as all hell this time. The worst part was probably the service, we saw our waitress twice, once when she took our order and once when we were paying the bill, every time we would flag someone else down for help during our meal they gave us attitude like we were bothering them. A true disappointment of a girls night out I will never visit this location again."}
{"text":"Avoid if busy, had a great experience at Chianti's in Edmonton and thought we'd have a similar experience here - not so.We were a party of four and obviously showed up as the rush was slowly on it's way out - why do I say that because our waiter made us all feel as if we were a huge inconvenience \"because he'd just had a hell of a full dinner hour and was ready to go home\" - oh yeah that's what we want to hear as we just get seated ... the food was meh that night, few times they tired to clear our table before we'd finished our meals - I guess we were holding up our waiter from going home, of course he wouldn't want another waiter to take over our table and get his tip right? Our tip reflected our experience - the waiter should have gone home.

We all agreed, won't be going back to this location any time soon - if ever."}
{"text":"I use to frequent this restaurant before the renovations almost on a weekly basis.
I went back since the renovation once and have decided that it's not worth the horrible service! 
What happened here? 
The food was good, that hasn't changed, but our main waiter was very curt and rude with us, not to mention it took him a half hour to get to us. He was an older gentleman that acted like us simply ordering our food was a huge hassle to him.
Alright, so they hired someone who's a bit cranky. That didn't bother us so much, since we know that even in the best restaurants these things happen.  
A young waiter comes by to give us our waters (yes, after we've ordered.) and spills half of a glass on the table. Not saying anything he walks away. That's weird, but we have extra napkins, we wipe it off ourselves. 
We ordered some drinks, and my friend ordered coffee. The same young waiter brought her the coffee and again, spilled in on the table and this time on her lap. 
The kid said \"whoops!\" cracked his knuckles and walked away. 
We waited, thinking he was going to get some napkins but it became evident that my poor friend's burned lap wasn't going to get so much as a \"sorry\", never mind any napkins to clean it with.
When we mentioned it to our main waiter, he was equally unapologetic. 

This place use to be amazing. Sure it wasn't the fanciest restaurant, but it was cozy and the service was never this nightmarish!  I think it will be a long time before I return, if ever."}
{"text":"A fun place - Usually quite busy but the buzz of conversation just makes it feel like a party. Wait staff is always friendly and helpful. Good menu! Excellent knowledge of and availability of gluten-free pasta, bread and dessert. The Caesar Salad is sometimes overdressed but other sauces are served in the right ratio. The last time we were there was on a crowded Pasta Frenzy evening. We chose the patio despite the clouds and it began to rain just as our food arrived. There weren't enough umbrellas and we wondered what they could do for the two us since the restaurant seemed full but we were quickly seated and our food brought in with us. Thanks so much to the host for that efficiency."}
{"text":"This was my first time here. The service is excellent! Staff were very attentive and welcoming. The food we ordered, unfortunately, was not fresh. The pasta tasted like it had been pre-cooked before hand (it was also well past al dente), then mixed in with some sauce before serving. 

 We had a ravioli and fettuccine dish. They tasted a bit strange, as they both had curry in them. The amount of curry in the fettuccine was so strong that I could smell it across the table. The sausage in the ravioli, however, was decent.

For dessert, we ordered tiramisu, which was good, as well as creme brûlée. The custard was incredibly rich and creamy, more so than any I've ever had- I could not finish it.

Overall, a place with great service, but food that doesn't quite meet the basic expectations for an Italian restaurant (i.e. properly prepared pasta). Will give it another try sometime."}
{"text":"I've always had good food here. Employees are very friendly. Definitely one of my favourite places to eat :)"}
{"text":"I've been to this location more times than I can count. I always come back for the Mare e Monte - highly recommend!! It has been a little inconsistent with the sauce being different consistencies and I have sent it back a few times because it was too salty.. However, for $8.99 Sunday-Tuesday, it's a steal and a pretty nice spot for a date night.
I was surprised reading the reviews that there weren't more on the terrible service. The management is rude! The wait staff is always in a rush. I don't think I've ever gone here thinking the service was good.
The food is what keeps bringing me back."}
{"text":"\"I should have checked yelp before we left the house.\" I found myself saying this after the first bite of our bruschetta. Chiantis was a last minute decision within walking distance from our place-the first warning should have been that they only had a handful of other customers on a Friday evening! Our server was sweet but obviously very new, our wine was poured somewhere in the back and plunked down in front of us, and the final straw was the food. 

I have NEVER had to add salt to a dish at a restaurant. Ever. The food was so bland I could hardly get it down. We have eaten here before and really loved the food so I don't know what has happened in the last year. 

So disappointed and will not be back again."}
{"text":"THE WORST!!!  I browse the reviews on yelp on a fairly regular basis and have always fairly discounted the bad ones.  Working in the restaurant industry I am used to guests either having unrealistic expectations of an experience or being insulted/put off by seemingly small details.  I promise that this is not that situation.  This is by far the worst restaurant that I have ever been to for food of any kind.  There is not a single redeeming quality of anything I was served there.  Sorry, not true the wine was ok mainly because the second glass was half price.  We didn't go in with high expectations after reading some of the other reviews for the place but just wanted a simple italian meal.  We ordered first the fonduta which purported to have mozarella, crab and artichoke.  Fair enough, who screws up crab artichoke dip......OH THE HUMANITY!!!!   it was a weird small dish filled with imitation crab (hopefully pollock but god only knows)  smothered in an embarassing melange of what tasted like curdled mayonaise and really old canned artichoke.  It was then topped with what seemed to be a mozarella flavoured kraft single.  Now you are probably thinking that I was being snobbish and fair enough maybe I should have lowered my expectations.  but then after being informed by the server that I had better order quick because there was a party of 11 (which was the only other table in the entire restaurant in the restaurant, not exaggerating seriously the ONLY other table.) and if I wanted to get my food I better order ,we decided to try whatever she suggested because it had to be the least risky option.  I ordered sicilian spagetti expecting probably anything besides the CURRY laden weird tomato sauce with frozen sausage slices that couldn't be chewed and sliced white onion that I was delivered.  But again maybe it was expecting too much to be served something edible and not crazily overcooked pasta with disgusting sauce.  My girlfriend ordered spagetti carbonara and was offered creamy or dry ?  not sure what dry would have entailed but creamy was a horrifying thick puck of what had to have been either premade or powdered sauce clinging for dear life to the worst spagetti i have ever tried.  We didn't eat any of the pastas and the waitress who despite the pleas to order was actually quite nice took them off the bill.  We paid for the wine and \"appy\" and left never to return.  This is the first yelp review I have written and only hope that it deters you from ruining any evening you decide to warily enter into THE WORST RESTAURANT IN THE WORLD."}
{"text":"I went to Chianti in December 2010, after living in Italy for four years.  I would describe the atmosphere as McDonalds-meets-Olive Garden, in that it looks like it was decorated with the faux-Italian decorations leftover at a HomeSense clearance event.  We went on a snowy Sunday because we'd seen online that they had a pasta special; upon arrival we found ourselves to be pretty much the only people under the age of seventy-five.  

I'm not sure the name of the pasta dish that I ordered but it was a vegetarian one, with a creamy tomato sauce.  It came with huge chunks of almost-raw CELERY and CARROTS mixed into (Barilla?) pasta and okay sauce.  I think they just took some of the vegetables normally used in the minestrone and heated them in the sauce for a few minutes before tossing in the pasta.  The vegetables were both totally inauthentic and totally unappetizing.  On the side there was an okay salad (with more chunky vegetables from the same bowl, I would say).  It wasn't worth the $7 lunch special price and I'd hate to think anyone ever paid more than that.  I have NO plans to return to Chianti."}
{"text":"My boyfriend and I attempted to call to order some pasta for pick up tonight (Sunday evening). We phoned about 10 times in an hour span, it went straight to voicemail despite being open. We then ordered from their online option. On Sundays they offer 8.99 pasta, hence why we chose Chiantis instead of the 100 other restaurants on 17th avenue. 


The online service said we should hear from Chiantis within 20 minutes confirming our order and telling us when it would be ready. We waited 45, received no phone call or email, so we decided to walk over and see if they got our order. The place was full, but that is no excuse for what happened next. 

We stood at the front door for ten minutes while staff continued to stare at us and continue on whatever they were doing. We were then approached by a young boy who went to get our delivery order. The bill was full price. When we commented we were expecting to pay 8.99 he grabbed \"his boss\". 

She then told us she turned the phones off because the kitchen was too busy, which is why we couldn't get through to place our order. She said that the online service charges them a percentage of every order placed, and insisted we pay full price. Sounds like a personal problem lady, not something you should tell your customers. 

My boyfriend was very hungry and grudgingly paid full price. The woman knew we were angry as I expressed to her that its not our problem that they offer take out and then turn the phones off, and she opted to walk away instead of offering any sort of solution to the problem that she created. 

Overall terrible business, terrible customer service, rude \"boss\", and honestly pretty mediocre food. Not at all worth the full price. Its the first time I've ever seen the place full of customers and I've never had a smooth, positive experience from this location. 

We won't be returning."}
{"text":"The pasta here is nothing short of AMAZING!  Reasonable prices and it all tastes homemade.  What more could you ask for?"}
{"text":"This place makes Italian restaurants look bad. Stay at home and make your own, guarantee it will taste better and be more fun"}
{"text":"Went Sunday eve(April 21/13) Food was great ... even better for the Special Price. 

Place was packed and foyer really does not accommodate waiting patrons... but got by !!

Impressed with Mgr Todd and his personal touch & \"name-remembering\" 

We will be back"}
{"text":"This is my go-to place when I'm in Calgary for cheap, decent pasta (on Sunday, Monday or Tuesday when it's $7.99!). I've even found myself craving it on occasion since moving away. Yes, there are better places out there, but my tastes aren't fancy and I've found everything I've tasted to be delicious (personal favourite would be the Supremo - scallops and smoked salmon in creamy curry sauce, change the fettuccini for whole wheat fusilli and add spinach... mmm... delish).

If you're heading there for cheap pasta night, I would recommend going early as it does get quite busy. The servers have always been really nice and the service decent though it definitely slows down when busy. Oh! And the fresh buns pre-meal? Yep. Awesome."}
{"text":"I can't get over how inexpensive they are but the quality of the food is soooo good. With that being said..... I would only ever get pasta here. My brother once got veal and yeah... wasn't the greatest. Also the parm chicken was iiiiiight but the pasta is really what has my heart. mmmmmmmmmmmmmmmmmmmmmmm pesto gnocciiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii. This location has better bread than the macleod one. Always fresher I find."}
{"text":"Had the Pollo Arossto and it was surprisingly good. The meat was really tender that it fell of the bone! Didn't expect much except for a decent meal but was really impressed. The tiramisu was delicious and the cappuccino was awesome that it capped of a brilliant meal."}
{"text":"What a horrible, watery plated,  flavorless, crap serviced place this is. I always like to give places a couple of tries...So I did. Each time it got worse. I have a sneaking suspicion that this place freezes and then defrosts the pasta and sauces. Not even worth the money on the half priced days. This is the equivalent of McDonalds of the pasta world Just not as tasty as McDonalds."}
{"text":"Visited for dinner on a Monday night while in town for business.  The staff was extremely attentive and I left full, but that's really where the positives end.  I'm spoiled being from Chicago where food is full of flavor, so my opinion may be a bit slanted.  I had the calamari and then chicken parm for my entree.  Both dishes lacked flavor and the sauce didn't have a spice in it.  This may be standard fare for the area, and if so, I encourage a restaurant owner with a vintage Italian background to consider opening a place here.  There is money to be made!  

Overall, the food wasn't horrible, just lacked true Italian flavor."}
{"text":"Poor/Rude Service. No vegan options. Friends food did not look good. Next please."}
{"text":"Best Caesar salad dressing in town hands down.  We go about once a month when they have specials and are always pleased.  Our kids like it as well.  Much better than BP'S for kids and way better service"}
{"text":"I love the Pasta Frenzy nights; the fettuccine diablo is my favourite!  The complimentary focaccia bread with olive oil and balsamic vinegar is very tasty.  I have tried a couple of other Chianti locations, but the food was different and not as good as the one in Crowfoot.

The decor is just ok, and the restaurant is a bit noisy, but I can easily overlook that for a delicious, large portion of pasta for only $7.99.

I like when the owner/manager walks around singing in Italian.  I have been eating here for several years and still see familiar servers, etc. which must mean it's a good place to work since their staff isn't always turning over.

I would recommend making a reservation, especially on Pasta Frenzy nights (Sunday, Monday, and Tuesday), as people are often lined up out the door."}
{"text":"Delicious home made pasta and sauce!
I've only ordered a few dishes but I haven't had a bad meal yet!
Some of the servers could use some more training but the service is still never lacking
The wine list is has a good selection 

The renovations from a few years ago have made a huge difference! 
It feels much more open and clean

They're always busy for a good reason! 

Over all amazing food and service! 

I'd much rather go here than an over priced \"high end\" restaurant"}
{"text":"Chiantis is the place I go for cheap but delicious pasta.  They have $7.99 pasta on Sunday, Monday and Tuesday all day, as well as Saturday 11-4pm!  They do not skimp on the portions on these days, you get the same as if you were paying full price.  My favorite is the Tortellini Romanoff.

This location has a great Italian feel to it, the manager is always singing Italian tunes as he walks about the place.  They have a good assortment of wines, always checking to make sure you are enjoying your choice.  They have an extensive menu of salads, seafood, chicken, veal and pasta.  They have great lunch specials which consist of a salad and half pasta serving.  The service quality can drop on busy nights, like the cheap pasta days, they seem to spread the waiters a bit thin on those days.

This is a great location to both go with a larger party or as a couple!  A reservation is recommended if you are going with a larger party.   My Husband and I like to go here, then go to the movies, it makes a nice date night!"}
{"text":"Amazing staff, great management, & top notch food.

Had a to go order and the food was great. Super fast service and a nice place to sit and wait for take out. The prices are most reasonable!"}
{"text":"Over the years, I'd come to refer to Chianti's as the fast food of Italian dining. It was never stellar, but it was reliable and the staff were good. 

After the fiasco tonight I'd be very surprised if they were in business at the end of 2013. My first clue that things had declined should have been the fact it was nearly empty. At 7 pm on a Friday. 

Our waiter was apparently unaware of the custom of waiting for diners to put their menu down, and came by 3 times in 5 minutes to get our order. When we did put our menus down it took far too long for him to actually notice.

The meal... was honestly terrible. We would have had a better dining experience at Wendy's or McDonald's.  My cannelloni bordered on tasteless. There was virtually no cheese in it, and seemed to consist entirely of overly finely ground beef and oregano. That it was overcooked was the final insult to what is a simple Italian dish.

My girlfriends gnocchi was terrible. Poorly made, and under-cooked. You could actually taste flour in it. I have no idea what they used for a sauce, but it was bordering on burnt.

The final nails in the coffin for me was at the end of the meal however. I was in the midst of dipping a piece of bread into the oil and vinegar when the waiter cleared my plate. The one with the bread on it. That I was eating.  I have never in my life had a waiter take away food I was in the midst of eating.

There is absolutely no question we won't be back, and if you have any hope of either a decent meal or service, I'd steer well clear of this 'restaurant'."}
{"text":"Chiantis is an Italian restaurant that's been in Calgary for-ev-er... and nothing about it ever changes or stands out except the terrible service. This is how ordering take-out at the Crowfoot location works:

* You call Chiantis to place an order. No one picks up the phone.

* 10-minutes later you call again and someone picks up the phone. When you say, \"I would like to place an order for pickup,\" the person on the other end make a noise that sounds like you've just told them that you ran over their dog. They put you on hold for 10-minutes.

* 10-minutes later you place your order and repeat it 3-times to make sure they got it right. They tell you it will be ready in 20-30 minutes.

* When you show up to pick-up the order, you stand in the doorway with 10 other people waiting to speak to a hostess.

* When it's finally your turn to pick up your order they discover that there is something wrong (either they didn't put the order through, they cooked the wrong thing, one of the meals is missing). You wait for 20-minutes for them to correct their error.

* You finally get your order but the hostess seems to have lost the wireless payment machine. She finds it 2-minutes later and you are able to pay.

* When you get the meal home you discover that it is cold, dry, or missing something (in one instance I arrived home and discovered the meal was missing the pasta -- there was only sauce in the tray).

* You vow to NEVER EVER go back to Chiantis again.

Then enough time passes (like 6-months) that you \"forget\" how bad the experience is at Chiantis Crowfoot. Then you go through it all over again and remember. For us, the latest \"remembering\" was last week. Do yourselves a favour and go down the street to Aioli where the customer experience is fantastic and the food better.

I will say their Tortellini Alla Panna is really tasty... but no meal is worth the effort you need to make to get it (this defeats the whole point of ordering out)."}
{"text":"Uninspired and bland. You will get the usual Italian pasta dishes, veal, etc. This isn't Italian, this is the teenaged rebel son of the Mario from the East Side. This is good if you're in the block and want a carbo load. If you want a real meal, put a bit more effort in. Maybe the head chef should, too."}
{"text":"I ordered the seafood special with linguine. Everything was tasty as expected (Italian food, nom-nom) and the fresh mussels were cooked perfectly. The pasta was a bit chewy but it was not mushy which was alright for me. I ordered a latte after my meal and it was neither amazing nor drab. Service was good. We went here on a Sunday around noon and the place was fairly busy but not too noisy. I would describe this restaurant as average and if I had to eat Italian again I would choose someplace else with a little more personality to it. The decor was cliche Homesense type of \"wall pictures/statues\" and I did not see any handpainted murals or original paintings on the wall. If I wanted to experience a little piece of Italy this is not the place (nor should one expect it to be)."}
{"text":"I love pasta, I love it even more when it's on special. And at Chianti's, they do $8.99 pasta Sunday-Tuesday so it's a perfect love affair.

Looking for something quick on a Tuesday before heading to an appointment, my sister and I headed here. And even though it was one of their busier night, we weren't left in the lobby starving for 45 mins *cough* Olive Garden *cough*

There is a lot to read through on their menu, from salads to soups, to all of their different pasta dishes and then their specials board. I went with the penne campesino (sundried tomato, pineapple and chicken in a curry cream sauce), my sister ordered the smoked salmon and seafood linguine and we ordered a chorizo sausage & spinach fettuccine to go for our dad.

My pasta was great, the sweetness of the pineapple and the yellow curry gave the sauce a different take than a traditional cream sauce. I'm not a fan of smoked salmon so I didn't try my sister's dish but she said it was equally as delicious as mine so I'll take her word for it. Our take out came just as we finished settling the bill, which I really appreciated. I've had instances where your take out comes your dine-in meal comes out and you end up taking cold food to someone or they forget and now you're waiting another 20 mins for them to make it.

Chianti's focus is quality food, and I always get good service whenever I go there. I'd choose Chianti's over the other mainstream Italian places that seem pretentious, sometimes pricier doesn't always mean better."}
{"text":"Love this place! My favourite pasta place in Calgary! 
The owner of this restaurant works as a waiter and always has a smooth running waiting staff. The food is great and at a very good price. The free bread is always warm and delicious. I moved within the city of Calgary and incredibly sad I moved so far away from this location. I always forget which day is pasta day but you can get a huge plate of food for 8$! Pasta lovers you cannot go wrong here!"}
{"text":"Great quality and large amount for what you pay, especially on Pasta special nights (Sunday, Monday, Tuesday)! Highly recommend"}
{"text":"Very good pasta, ate here many many times, meals have always been hot and great tasting. Portions are large however if you are really hungry ask them to sports size it (more than I can eat). Fresh made bread with oil and vinaigrette very good too and no problem we you ask for extra. Make sure you leave room for dessert, I always have their cheese cake. Highly recommend this place if you're looking for Italian."}
{"text":"Okay. How often can 3 adults go out for lunch at the bill comes to under $30. Especially when you are all starving when you arrive and leave full?

I went here with 2 coworkers  and we all ordered a $7.99 lunch special with pasta. It was a perfect sized portion for lunch-we were full but not bloated full. I opted for the cheese ravioli and Caesar salad-delish. Everything was fresh and tasty.  My friends tried two different kinds of soup -the minestrone and the soup of the day and they both looked great.

The wait staff were experienced, professional and very personable. There is a man there who looks like he runs the show and he was great - so much energy.

The only thing that made it lose a star is the decor. Its pretty dated, tired and needs a revamp. Also there was a lot of clutter and boxes you pass while being lead to your table. That was a little weird. But for a tasty, inexpensive lunch in the NW, Chianti might be the place for you!"}
{"text":"Very stable delivery of good pasta. My favourite plate is Salute."}
{"text":"We haven't been to this Chianti's in a while, but we've always enjoyed the food. Recently we did take-out from them for the first time, and the portions were way too big. I guess that's a plus. The food just tastes better and fresher than other nearby italian themed restaurants. I noticed on their website that they now offer whole wheat and gluten-free (rice) pastas for most of their dishes, so I went with the dish I always get: fettucine primavera with tomato sauce. It's pretty much the only vegan or near-vegan pasta entree they offer, but it's always great. But, as takeout, on rice vermicelli noodles, it was merely okay. We loved the spinach salad, and it was nice that we got some of their seasoned bread, and the other entrees (Quattro Fromaggio Ravioli and Spaghetti Con Polpetti) were apparently quite sublime. They have a nice little patio in the back in the summer, even if it's just in between some buildings in a strip mall it has a nice patio feel. And the service has always been great."}
{"text":"The quality isn't the best however it's priced fine .there are no fancy things on the menu.the service is great I guess people love to go there I had been there a few time and I'm going to OK it."}
{"text":"You get what you pay for, that's the way I feel about this place. I went on a Monday night, the place was dead and the pasta was cheap. I think the atmosphere would be better when this resto is in full swing, as it was I didn't much care for it - in particular, I would hope that the too loud muzak would be drowned out by dining customers.

The meal starts out with foccacia bread accompanied by oil and balsamic vinegar - and this is probably the best part of the experience. The bread was warm and the balsamic was tangy. 

I decided on veggie penne pasta with tomato sauce. Basically it came out as a bed of penne with a sort of \"chili\" like veggies n' sauce pile on top. The veggies were inconsistently cooked, raw carrot and zuchini are the only textures that I recall when I think of the dish.

If cheap eats that will fill the void are what you are looking for, then look no further and head on down to Chianti's for their budget pasta nights."}
{"text":"Gluten free pasta and bread is so good ! 8.99 pasta Monday - Thursday. Great service too!"}
{"text":"Great service. Happened to be pasta frenzy so we waited about 10 mins. Not a big deal. 

Ordered the squash spaghetti salad. Was so good and the chicken has just the right amount of flavor. Also got the Chianti fettuccini which was soooo good also! The pasta seemed home made and the sauce was really tasty. 

Great service. Was sharing with a friend and they split the serving size for us for the salad and pasta without us asking. Will definitely come again!"}
{"text":"It's hard to really \"review\" a place when you only ever order one dish, haha. I always get the  linguini vongole- linguini (obviously) with baby clams in a garlic wine sauce. The clams are likely canned bit I only pay 7.99 on pasta nights and the sauce makes up for it. 

**Except  the last time we went, my  sauce was watery and full of chunks of garlic and was quite disappointing. But that's one time out of probably 20 that it's been so-so.**

My hubby always gets chicken pollo con funghi and loves it (his gravy was watery last time too though).

I sm so glad they redecorated because it feels so much more modern, though the tables are quite crowded and when it's busy it's not a cozy atmosphere. We get warm bread at the start too, always nice!"}
{"text":"Favorite place!! Can not wait until I can return again. Hopefully not too long. The Alfredo sauce is amazing"}
{"text":"Went here for my birthday and it was pretty good! I'm impressed with the supremo dish. Cheesecake was perfect."}
{"text":"I'm going to preface this review with a little context:  Chianti's was my very first job when I moved to Calgary five years ago!

I loved the food when I worked there and I love it even more now that I don't have to work for it.  Sure I miss the discount, but when their Pasta Special (Sunday, Monday, Tuesday) is so cheap, it doesn't really matter.

The restaurant seems small, but it fits a ton of people.  It kinda reminds me of a European dinner, especially when it feels like you are sharing your meal with the strangers who are practically sitting beside you!

There are probably better italian restaurants in the city, but who can afford them.  When the average price of a huge plate of pasta is only $10, you can't really go wrong.  And with fairly reasonable prices, this becomes a great place to go out with your friends or go on a first date!"}
{"text":"What a horrible, watery plated,  flavorless, crap serviced place this is. I always like to give places a couple of tries...So I did. Each time it got worse. I have a sneaking suspicion that this place freezes and then defrosts the pasta and sauces. Not even worth the money on the half priced days. This is the equivalent of McDonalds of the pasta world Just not as tasty as McDonalds."}
{"text":"Calamari was good and crispy, however the lasagna looked and tasted like it was a cheap generic grocery store frozen dinner. The cannelloni was dry and bland with no sauce. The linguini Alfredo was fairly tasteless and I found the pasta was a weird taste and texture. The veal was dry and again, not that good, part was crispy as it had no sauce, the rest was soggy, all of it was tough. Bread was fluffy and fast.



The staff was friend and the atmosphere good. The manager was apologetic when the food issues were brought up and comped our meals (which we barely touched), as a bonus he also comped our calamari and drinks which was a nice touch."}
{"text":"We came to Chianti on Tuesday August 2nd, arrived approx 6:00pm - expecting a long line up.  We got seated immediately - it was very busy as it is $8.99 pasta night.  Service is quick and friendly.

We ordered the bruschetta - and WOW ...  waaaayyyyy too much garlic.  I took 1 bite and couldn't eat it, unfortunately.  My friend ate it though - he got through it.  Wish the bruschetta was served with a baguette instead of focaccia, but that's just a personal preference.

I ordered cheese filled ravioli with bolagnese sauce (not on the menu but an easy request),  My friend ordered a veal filled tortellini with a cheese sauce (off the menu).

The raviolis were not cooked long enough - too hard - they went back.  Tortellini was delicious.  My second plate of ravioli came back and it was cooked perfectly.  It would be nice if there was a meat filled ravioli on the menu though, because that's what I was really in the mood for.

I will definitely come back - I won't order the cheese ravioli though - will try something else.

In closing...  I will say that it is nice to see such a BUSY restaurant!  The Calgary economy is in the dumps so seeing restaurants busy and succeeding is a very happy sight!  Good job Chiantis!"}
{"text":"A friend showed me this place!  Great food! Great portions and great price!  One of my favourite place to eat!"}
{"text":"Great food! There are so many dishes to choose from. You get fresh bread to start, and the service is quick and very friendly. 

Though I cannot remember the actual names of the dishes my group ordered, the Mediterranean ravioli, 3 cheese ravioli, and the pesto gnocchi were amazing, a must try. To finish the meal off, we ordered a cheesecake, and that was fantastic.Chianti's is also very accommodating, they have numerous vegetarian options, and I believe they have gluten-free pasta too. Not to mention, the portion sizes are HUGE and very filling.

Go on Sunday, Monday, and Tuesday for $9.99 pasta dishes! Overall, efficient and welcoming staff, awesome, affordable food, and nice ambiance. Will definitely come again, a great restaurant if you like Italian food!"}
{"text":"Loved it, great homemade soup, bread and gnocchi.  Glad we chose to stop in here!  Wish I could get this kind of Italian quality closer to home."}
{"text":"When you finally make the commitment to having a 'carb day', you know, a day to indulge, you don't want to regret your decision by going somewhere that has so-so service and so-so food. Unfortunately, this was my recent experience at Chianti's in the N.E.. 

It was one of those days, and I wanted to overindulge. So I headed over to Chianti's with an acquaintance. 

First of all, I'm not a big fan of dipping my bread in olive oil & balsamic vinegar. I know that's the custom, but it's just not my thing. So starting the meal off with that didn't help set the mood. Then I realized that I wasn't feeling any of their pasta selections, so I ordered their minestrone soup, which tasted like someone in the back had cracked a can of Campbells, heated it, and served it to me. WHY am I paying for this in a restaurant? 

And all along, our server had some type of chip on his shoulder. He was anti-social, a little abrasive and overall not the type of person that inspired me to keep eating. His demeanor put me off and I ended up rushing through the meal just so I could be freed of his presence. 

Overall, not a good experience. 

If you're looking to indulge in Italian fare, I wouldn't recommend heading to Chianti's."}
{"text":"Haven't been to Chianti in many years. Only to the 17th Ave location. This was our first time at the Crowfoot location. Sadly, we keep forgetting it's there.

We arrived and it was busy, but not crazy busy. We were seated within 5 minutes and didn't have reservations.

Ordered up a couple beverages (glass of wine & beer) from our bubbly and friendly waitress.

Decided to start with some appetizers.

Appetizers ordered: Calamari Alla Romana & Bruschetta. Both were very good especially the calamari. Will have it again.

We were ready for dinner and they have a great menu, a bit of everything. (pasta, salads, mains, fish etc. etc.) which made the decision a bit hard since I wanted a bit of everything.

Dinner ordered:  1 Cannelloni & 1 Combinazione Della Casa (Cannelloni, Fettuccine and veal parm in this combo) 

The cannelloni was baked and delicious. The Della Casa, which is a combo of three things was great as well. Loved the spinach fettuccine. Will order the combo again since it gave you just enough to sample all three and be full.

After the replenishment on our beverages, we ordered some coffee and dessert.

Dessert ordered: Tiramisu. It was really good and tasted fresh and authentic. Not sure if they make it in house but it was really great.

Service was great. Food wonderful and very economical for all the food we did enjoy. Will be back now that I have tried a few things and know the location of this Chianti's."}
{"text":"Really enjoyed Chianti. Even when we were there in a regular day, not on special pasta day, the prices were decent at $13.00 for a good quality plate of pasta which you can customize. The vibe is great and the service is excellent. If you are in Calgary with the mood for Italian I do recommend this place.

Here's my Vlog on my recent visit to Chianti.

https://youtu.be/t-IxiLOtRmk"}
{"text":"Firstly, if you're in the mood for a quick Italian food fix, this place has decent food. The food is fine. No complaints! 

Secondly, years ago I used to visit Chianti's on a regular basis (Crowfoot location). Cute little Italian Bistro type atmosphere, Italian music, food, environment. They served delicious fancy bread with oil & vinegar and it was lovely. 

Finally, I went there last night with my husband for a quick date night. As soon as we walked in the door my impression was that of disappointment. No hostess. So we stood around in their insanely crowded/small and poorly laid out entrance until someone finally noticed us. The entrance quickly filled up with people and there was no knowing if they were waiting to pay, sit, or pick up.

We were seated within a reasonable amount of time. We sat almost elbow to elbow with a couple already in the middle of their meal. This is not ideal seating for me. When the guy next to me slurps his spaghetti and he's so close that it splashes me in the face.....  The waitresses could barely make it between the tables they were SO incredibly packed to allow for maximum seating. 

They brought out plain little dinner rolls and no oil & vinegar. While not the end of the world it was one of their staples that I originally loved. 

They played top 40's music and while, again, not the end of the world, I was quite disappointed with the lack of Italian feel this place had. 

In the end, while the servers were pleasant and the food was decent, I found it really hard to sit down and relax and enjoy our meal because I was feeling so crowded and rushed to get out of there to let someone in the crowded entrance have a seat (on chairs as hard as cement, by the way). 

Sad to say, I probably won't go there again."}
{"text":"Well I have been here a few times and I have never written a review.

This place rocks, it is not true italine so get off that idea, but the food is yummy. The server is always very nice and so is that manager who is at the front to seat you and take your payment. They are very quick and refilling your order and very quick with your order, they space it outr so perfect that you have your appi and then sit for a few and your main course arrives. 

They do although lack on telling you what the specials are, and there attention to customer service is sorta out the window when they are crazy busy, but I do not give them a star less because of that.

MUST GO

it is a great family place for fake italine but extreamly yummy food."}
{"text":"Okay.  So Gluten Free is not always awesome, but this was beyond gross.
Alfredo on vermicelli - looked like someone had thrown up in a bowl and added 
parmesan to it.  Tasted about as good.  The waiter was good about it - but
c'mon, it's 2016 - gluten free pasta that can hold up to an alfredo sauce IS available. 
Vermicelli?  Not even remotely acceptable for a cream sauce....  The rest of the meal was okay - maybe it was just an off night, as we used to really enjoy this place."}
{"text":"Amazing! Great prices, perfect portions. Bread is delicious, 2 of us ordered 3 baskets. Make sure you save room for dessert. The gluten free chocolate torte is refreshingly delicious"}
{"text":"I have never eaten in at the restaurant(have orders take out from here several times) but they have really good Chicken Fettuccini Alfredo and if you heat up the bread in the oven it's quite good. Last week I ordered spaghetti and meat balls (con polpetti) and it was disappointing. The spaghetti was over cooked and he sauce was very sweet for some reason and was more like chunks of tomato than \"sauce\". I honestly would say that Classico is better :( The meatballs were tender but lacked a bold flavor. Keep in mind that I'm from a town of Italian nonna's so it would be hard to compete but if you go here stick to the Fettechini Alfredo!"}
{"text":"Good place, and I noticed better service with recent visits. Stick to visiting when they have pasta frenzy on. My wife appreciate their gluten free options which includes complimentary GF bread. My favorite is their cannelloni; and my favorite desert is the tiramisu."}
{"text":"Italian this is not! who uses bacon bits (processed) for spaghetti carbonara should of got the hint when I seen butter as first ingredient. Our food was out in less than 5 mins cold and obliviously NOT FRESH! Server was terrible rush rush can't make a Caesar. Never again BAD from start to finish!"}
{"text":"This location use to be our old stand by for consistent good food /dining and take out even though it is often rushed service to keep tables turning over. I think the servers are told to push the orders out so they can seat more in an evening.The service has gone down hill! We keep trying \"one more time\" over & over as I believe in supporting local area business. Tonight I phoned for our regular take out order and was put on hold for 6 minutes..... why did I wait so long you ask? It gave me time to search another menu and order from somewhere else! I then hung  up and called back, asking if they were really busy? The lady replied \"not too bad\" so I then answered well that's too bad because I had just been put on hold for 6 minutes with out my order being taken. When she asked what I would like, I said.... sorry I ordered elsewhere. NO MORE CHANCES! Food is good but bad service."}
{"text":"You can't have 40 pasta choices on a menu and say the pasta is fresh. This isn't authentic italian - it's more like fast food. Food is decent -  but you could make it at home with a jar of pasta sauce and a box of dried noodles. I think that's how they make it in the back at Chiantis, at least."}
{"text":"For cheap pasta Chianti is definitely a spot I can hit up when I'm thirsty for some Italian. Regardless of anyone elses opinions on whether or not they think this place is authentic really holds no regards to me as a normal eater of food to me; italian is italian. Inside the restaurant has an ample Chianti inspired interior boasted by intimate lighting and murals on the walls to reflect the awesomeness that is Italy.

The best test for any restaurant is when you have a rather large group coming in, how fast the service is, how attentive the server is and how well the food tastes as well. In our case we found our group and seated ourselves, already with menu in hand due to the fact that they conveniently place menus and glasses of water at each setting for every seat that is at the table.

Looking at the menu I usually order the Penne Giardiniera Con Pollo which is fantastic in my opinion, the regular sized plate has so much food on it I usually will only finish about half. Another great thing about Chianti's is that they offer free bread with a dipping sauce which is delicious and a great appetizer to your entree. However the day that we went i decided to try something new other than what I usually order so I went with the Lasagna Al Forno which basically is layers of pasta, meat sauce and sausages in between.

I ordered the regular size which may feel daunting but the actual piece of lasagna is a lot smaller, what fills up the metal canister that the lasagna comes in is the tomato meat sauce. Wow, the lasagna was satisfying but I could only finish a little over half of it before it was too much, the meat sauce itself became a bit overwhelming -- almost like they had too much of it there.

The service was great our server was attentive when re-filling drinks or asking if we need any new ones, checking to make sure that our meals were good to the taste and quickly taking away any dishes that were empty. I've read some less than great reviews for the other locations but for this location which I frequent I definietly think it's awesome for the price you pay."}
{"text":"We decided to stop by for dinner at Chianti before seeing a movie at Sunridge Cineplex Odeon.  It's been a while since I've had pasta, and having worked the whole 26 hr before that - I was definitely very hungry!

Atmosphere:  4/5  convenient location; I am used to the decor at the Old Strathcona Chianti location in Edmonton, and this has a more modern feel which I liked.  The restaurant was not very busy; overall nice relaxed and casual atmosphere to enjoy a meal with friends.

Food: 4/5  Since it was pasta special that night, I had the penne al pacifico with smoked salmon, onions, sundried tomatoes, peas, and olive oil.  Very tasty dish!  It was a bit more salty with more olive oil than I expected but still very good.  Great portion size and unlimited bread.

Service: 3.5/5 Good and efficient

Price: 4/5  Very good price on pasta Tuesday - $9.99 for all pastas with unlimited bread

Overall: 4/5  Overall I enjoyed my fill of pasta for dinner!  Perfect for pasta cravings and all of us were very full by the end... although there is always room for dessert =)"}
{"text":"In a word, NO.
When one goes to Chianti's they shouldn't expect a fine dining experience, for sure,  but tonight's experience will cause me to never return here again.

I've been to other locations throughout the city and the food and service have always been good. We visited this location tonight due to the close proximity to our home - we can walk there.

When we arrived, the restaurant was nearly empty. We were seated promptly and drink orders were taken right away. I didn't know what I wanted so I simply asked for water to start, intending to order wine.
We got our drinks, I hadn't decided on dinner yet. (the fact I was sitting there looking at the menu would have been a clue)
The waiter came back 2 more times to ask if we were ready to order. Again, still looking at the menu.
When I finally was ready to order, the waiter disappeared.  There was a table behind us that were evidently regulars based on their interaction with our waiter. We had to wait until he was finished serving/chatting with them before our dinner order was taken.
We ordered our food, I forgot to order my wine.  We spent the next while trying to catch the waiters attention, to no avail.  The next time he came to the table was to drop off our food.  At this point I gave up on the wine.

I had ordered veal tenderloin with gnocchi.  Quite possibly the worst meal I have ever been served in a restaurant.  The gnocchi was undercooked, chewy and the sauce was something unidentifiable. The veal was tough and the proscuitto it came with was even tougher. Another unidentifiable, bland sauce.  I couldn't finish the meal.
My boyfriend had cannelloni, from the looks of it he had a similar experience.  My son had a more \"mainstream\" dish - his was nothing special, but at least palatable.

We had to ask for more bread when we'd ordered our meals so I was nibbling on that when the waiter came to clear our plates.  He saw my unfinished meal and asked if I wanted it packed up to which I said no.  He then asked if it was ok.  I said not really.  He never said anything more after that.  No asking what was wrong, what could be done to fix things.

I might add, he also cleared the bread plate I was eating from.  While I was eating. ...

We won't be back to this location. Worst meal experience, ever."}
{"text":"I am surprised the average rating isn't higher for Chianti's. No matter how busy and packed the restaurant. I have never had a bad meal at the Chianti's. It is one of the only restaurants in Calgary that uses fresh ingredients daily. The pasta is made fresh in house. Cheap pasta nights are even better. Their Caesar salad dressing is also a personal favorite. Fresh warm buns also before your meal. Portion sizes are generous. I always have leftovers."}
{"text":"This is my favourite restaurant. Service is always excellent, the host is always so friendly and personable and always ready to get you a table. 
Food is delicious. Love the chicken parmagiana."}
{"text":"Sunday, Monday and Tuesday night are the Pasta Special nights that ring up at a low cost of $8.99. Even on holidays this deal is honored except Mothers Day. 
I know many are not keen on the food here but I have come to quite like the pasta dishes (FRESH - not many Italian places even offer this) . The portions are good and they come out piping hot which I love.
Service, well - it seems to be run by mostly kids. Most annoying recently, they had a long table set up in the middle of the dining space `tipping out`so 6 of them sat around this table chatting, counting the day`s earnings loudly, who tipped well, who did not, texting away on their phones, talking trash and swearing up a storm. They were right next to us so it was hard to tune them out. Solution - take it to the back room guys where there are way fewer customers, we do not want to hear all that jazz. Where management was tonight to oversee this I have no idea...
Back to the servers who were actually working, one hastily dropped off some waters, then one came and gave us some oil and vinegar but no bread for about 15 minutes. Then the water boy came and dumped a plate of bread onto the menu I was reading in front of me... as I mentioned, kids.
The food was really good and prepped to order. If you add a little something to your dish upon ordering, the server will not tell you but will add $1.20 to your bill. Sneaky. I just like to know these things upfront, I would have thought nothing of it.
But, the meal is still a good deal regardless, so we payed and over tipped for atmosphere that I hope I never have to sit through again.
Food - 4
Service - 3
Ambiance -1"}
{"text":"A group of 9 of us went to Chianti's on Macleod for New Years Eve dinner. I always read up on reviews before I go anywhere new to me and with only 61% of people liking this place I was not sure what to expect. Reservations were for 7:30pm and it was busy! Packed for the holiday! It was a bit noisy and a little cramped but the service throughout the night made up for it! I ordered a couple of vodka/tonics over dinner and they were fizzy and the lime was so fresh. There was a special menu for New Years and I ordered a seafood pasta dish that came with a caesar salad and dessert - all for $28! The salad was simple but the dressing perfectly coated the lettuce and it was so sinfully garlic-y! The waitress had her hands full but had time for each of us and with no problem at all subbed a couple of things for me on the pasta dish. It was delicious! The seafood was plentiful and the fettuccine pasta was fresh! Bonus! The sauce tied everything together perfectly and the portion size was huge! Everyone else loved their meals as well. They ran out of the apple caramel cheesecake for dessert and this was a disappointment for 6 out of 9 at our table. There were a couple of other options - I chose the apple caramel pie and was more than happy to eat the ice cream that came with it and brought the pie home. My fiance's fave dessert of all time is tiramisu and although he is not overly picky, he stated that it did not taste like the real thing and would not order this item again. 
I was very happy to bring half my pasta home as leftovers. SO happy with the evening overall. I am a huge fan of Italian food and I would for sure come back here! They seem to do it right and at a fair price!"}
{"text":"Me and my fiancé use to go to chianti on 17th ave for years but the pasta dish we always got changed, chalked it up to a off night. But it continued to be subpar and after multiple times it just wasn't good anymore. Recently we went to this chianti and wow great service and the food tastes just like we remember it. Very enjoyable experience recommended."}
{"text":"The food was great! When our group finally got it after waiting 30+ minutes for the entrees. 
They also forgot my husbands meal and so he was not prepared to wait another 30+ minutes after waiting 30 minutes for his dish. He's not one to complain and they didn't even offer to comp my dish, not even my drink!
I'm not impressed with their dealing with this situation to make it right."}
{"text":"A fun bustling atmosphere, and nice decor. We got the only parking spot left, because there's virtually no parking, and thank god we had a reservation, because there were people lined up out the door. The people I was with mostly enjoyed their meals, I had the fettuccine alfredo, and it was a bit bland, as well as lukewarm. While our waiter was friendly, the restaurant was obviously understaffed and we barely saw him, although he seemed to be running forty miles an hour."}
{"text":"Service was prompt, there was a tasteful and quiet atmosphere. We both thought hat our food was good, it was warm and had nice flavour."}
{"text":"My husband and I always go to the Chianti's on Macleod Trail but this time we found ourselves close to DT so we went to this location on 17th Ave. I always order the chicken cacciatore since it's tasty and a big portion.

When our food arrived, I thought the color of the food was a little off but didn't think much of it. When I started eating it,  the taste was also odd, I started digging through the pile of vegetables on top and noticed the big sticks of celery and carrots (wow, they didn't even bother chopping these), the long onions I pulled out were burnt to the crisp, this was making the rest of the meal taste way off. Then I began to inspect the chicken, turned it over and this was also burnt! The pasta on the plate was not even pasta, it was more like chinese noodles!!! My husband order the chicken parm
which also had chinese noodles, these had no taste at all!

Needles to say I sent the plate back with all my findings left on top, pointed then out to the waitress so she could show the chef what quality of food he was letting out of his kitchen, not too much pride in his work, that's for sure.  

We did receive plenty of apologies from the waitress and manager but we will definitely not be back nor will we encourage our friends to do so. 

Italian restaurant? Far from it!"}
{"text":"So, I went to Chianti's at Crowfoot tonight, and it was absolutely fantastic. First, they start you off with warm bread and olive oil and vinegar on a plate. Like, it's really good. Then, I got the chicken in mushroom sauce with potato wedges and veggies. Oh my God...what the heck was that? It was AWESOME. 

I had a shirley temple to drink...yeah, I know it's a kids drink, adults can have it too. :) Everything was really good. The flavour of the mushroom sauce was absolutely delicious, and they don't skimp on it either. There was plenty of it.

Anyway, the restaurant already had 5 stars with the bread...the main course was just awesome. But then, oh my God, I had the Blackout Torte for dessert. You've got to be kidding me ! I'm a chocoholic, and this was a big, really fresh and moist slice of chocolate cake combined with chocolate mousse, with whipped cream and chocolate sauce. Like, I tried NOT to inhale it,,,but that was pretty tough. It was SO delicious, ooooo, I'd go there just for the Blackout Torte by itself. If you love chocolate, and I mean really awesome chocolate, THIS IS THE PLACE to get it. 

The gentleman waiter was really nice and friendly. I had all this food for $26.67. I can't believe it. I would gladly pay that just for dessert alone. No, I'm not rich, but the quality of the food is something like you would have in a 5 star resort, if not better. 

The gentleman that sat me was singing a nice tune in a low voice. Like, that just added to the atmosphere. The menu is in Italian and English, so the experience feels authentic. I had a really good time there tonight. 

What I like about Chianti's is that it's a warm, friendly atmosphere. It I were to describe it, I wouldn't put it into a 'family restaurant' category or a 'romantic category', although it certainly is romantic. I would say that it's both...it's a warm, comfy, romantic restaurant where you can take kids and enjoy yourself. It a very classy place, but not in a snooty way...it's classy in a warm and friendly way. 

5 stars all the way Chianti. You guys rock."}
{"text":"Just went there tonight. Ok, I'm kinda sleepy right now, so I'm gonna get make this a quick review. 

I had a spinach salad. It was AWESOME. Like, isn't spinach supposed to taste bad? This tasted fantastic !!! Wow, what kind of spinach is that? Oh my God, just amazing. I usually don't say that about salad, but this was something special. It had bacon and mushrooms. Amazing, just amazing. 

Then I had the veal in mushroom sauce and potatoes and veggies. Absolutely FANTASTIC. You've got to be kidding me with this meal? Like everything was delicious, and I made sure not to stuff myself with bread so that I had enough room for the meal. Believe me, the warm bread with oil and vinear is REALLY nice, and if you have enough room then go for it ! I wanted to save room, so I just indulged in two big warm pieces. Oh well...

I had a chocolate torte for dessert, and it was AMAZING. Fresh, chocolately with whipped cream and chocolate sauce. Yum yum yummy !!! Wow, Chianti is just fantastic. This one and the one at Crowfoot are awesome...I haven't been to the other ones, I don't think, but they're probably awesome too. 

The staff is awesome too. Sorry to mention you guys at the end...I was just dazzled by the food...you guys made my meal awesome. 

You guys at Chianti ROCK. 5 stars all the way baby !!!"}
{"text":"I'm usually pretty picky about my Italian food, especially being a celiac. We came here for a friend's 10th anniversary dinner. There was about 20 of us, so it was great to find place that can accommodate that. 

I noticed when I looked online they offered gluten free pasta, now I'm even more picky about my gf pasta. I was so looking forward to pasta and was very disappointed. I'm pretty sure their gluten free pasta was rice vermicelli noodles, it was terrible. The sauce was great though. I went the Kitsilano. 

Everyone else's meals looked good, just not the gluten free pasta."}
{"text":"I love all the Chianti restaurants I've been to in the city! 

one. it's super cheap
two. they give you free bread
three. it's quick 
four. you get your pasta fill

it's great for a group event too.. I don't find it to be high end at all so it's great for casual get togethers or a quick lunch. 

my favourite dish is the tortellini romanoff. 

o.. they didnt have much of a dessert selection - none of them were very appealing

though they have good cheap wine (i know it sounds like an oxymoron but it's true) and their long island ice teas aren't too bad either."}
{"text":"I came here with my fiancé for their $9.99 pasta special, and the food was really good. Our server was very friendly and attentive. The reason why I'm giving this a 4 is because our glasses of wine tasted watered down. Other than that, it was a pleasant experience, and you can't go wrong with $9.99 pasta from Sun - Tues nights."}
{"text":"We decided to try Chianti Cafe, Willow Park on a Tuesday night at about 6:30 p.m. and it was busy, busy, busy... that has to be a good sign right? Eventually, after a small intercultural misunderstanding (Marie became Mary and three people that just arrived got seated first), we got seated on the patio to enjoy the sun in Calgary. We ordered. Our Bruschetta never arrived, but no biggie. Our main courses were delicious and don't let the portion sizes deceive you. Pasta can be very filling. We opted out of dessert. Our bill came to $43.00 for three people, unbeatable! We will defiantly give Chianti another go. 
There was a sign that made me chuckle which I thought I should share with you...

Heaven is...
Where the police are British,
the chefs Italian,
the mechanics German, 
the lovers French
and it's all organized by the Swiss 

Hell is...
Where the police are German,
the chefs British,
the mechanics French, 
the lovers Swiss
and it's all organized by the Italians!

Grazie!"}
{"text":"Good authentic Italian pasta! A lot of variation and it's delicious! The portions are good and they even offer half portions. Server was very energetic and the service was fast. Perfect for a family lunch or dinner get together."}
{"text":"Probably the best quick fix Italian joints in my area of the city. Once in a while I do get wowed by a dish, but most if the time the fair pricing is enough for me to not complain. It's been around for as long as I can remember and I can, with certainty, say it'll be around for much longer.

My usual dishes have been the combination platter, which consists of a cannelloni, veal, and alfredo pasta. I also get the dry egg carbonara and if I feel like a light meal, the spaghetti squash salad.

Price-wise it's great. A meal can still run you about $20 average, but it beats going to food court italian places.

 \"Ah yes sir, I would like more steam water to go with my pinkish lasagna please\""}
{"text":"The service staff is very friendly but not over-baring and they do a great job of topping up your beverages. 

I've eaten here about 10 times now and I have never had any problems with the time it takes to receive my order or with the actual food itself.

The portion sizes are fairly generous and always make me feel like I got my money's worth (especially if I come for the lunch specials). Oh and did I mention you get free bread to start?? 5 stars"}
{"text":"I keep coming back here! Sigh 

Pollo cacciatore, chicken dry, pasta cold, complained 2 x , 1st time nothing, second time got a stir fry, now pasta is goo, sent it back and got the full bill

Sigh

Post script- after complaining to 2 people finally got it removed from the bill"}
{"text":"I'm not sure why so many dislike this place. Chianti's serves inexpensive pasta fairly efficiently and consistently. I think it's similar to Hon's in Vancouver (when it was good - last six years it has steadily declined in quality). It's like Chinese noodle houses - basic, simple dishes but cheap and fast. The fettuccine noodles are the best of the bunch - homemade and cooked nicely enough. I didn't enjoy spaghetti or other pasta noodles as much. I wish there wasn't so much sauce (Du Chef, Supremo, curry version, pesto cream), but something I'm will to overlook given the price."}
{"text":"Love this place. Excellent menu and very person staff who are amazing. This place is ran very well by management and their staff"}
{"text":"Very nice,welcoming,great staff and excellent food! I have never been let down here! 
Prices are reasonable and all you can eat bread with dip! Yummy"}
{"text":"Friendly but that's all I can say about Chianti's on 32and NE.   We were brought our warm bread which was served with a saucer of olive oil and balsamic vinegar.... Way to much balsamic vinegar.  I almost chocked.   We ordered fried ravioli and calamari for appitizers.  They were fried in separate baskets but in the same oil.  I enquired and apparently this is standard.  The ravioli were nasty because they tasted like calamari.  I don't like calamari which is why 2 appies were ordered   They did take the ravioli off our bill.   But then they got my order wrong.  Food overall was bland and pasta was way over cooked.  To the point it was mushy.   Wasn't impressed.  Won't go back."}
{"text":"I went here for a friend's birthday. Service was great and the restaurant is very accommodating  when it comes to making changes to your order. For example, you want fettucine noodles instead of linguine? No problem? You can't decide between two pastas? You can get both and change the sauces. 

My favourite bites - crab dip, fettucine with garlic, and the veal was tasty. The reason for not giving more stars was the ravioli was hard and flavourless and I didn't like the watery sauce. The trio of stuffed pasta appetizer was also a pass. I found out that the spaghetti, linguine and fettucine are homemade, but the rest of the pastas are not. 

For the price, I can see why this is a popular spot. If you order the right thing, the food is very tasty. Best time to go is Sunday, Monday and Tuesday for $9 pasta."}
{"text":"Half off pasta...... Can't go wrong with that. Large selection of pasta to chose from but my favourite is the carciofi. Creamy spinach noodles with chicken and artichoke. Portion size is good and you get fresh bread to start. Ask for the balsamic vinegar and olive oil to dip the bread in. Make reservation the place was really busy which made service a bit slow too."}
{"text":"I've Eaten Here A Few Times And Always Order The Fettuccini Diablo. Now I'm In Love With There Calamari. So Good. Best Time To Go Is Cheap Pasta Nights Or Lunch Time."}
{"text":"Who doesn't like their well known Pasta Frenzy nights?  Their pasta isn't the greatest in the City but when it's $7.99, your expectation definitely isn't as high as places that serve pasta for twice the price.  Trust me, some of the places that serve high price pasta are no better than Chianti's pasta.  Service is not bad here either, despite the fact that it is almost always packed with people on Pasta Frenzy nights."}
{"text":"MUCH better than Olive Garden and cheaper too! My new favourite Italian restaurant in Calgary."}
{"text":"There are better pasta places in the city. For cheap pasta the special price really can't be beat. Maybe on non special days you get a better dish?"}
{"text":"I love this restaurant. It has been in the community for such a long time. 
Italian food is a must in everyone's pallet and I have never had a bad food experience here. 
We went yesterday for my Grandmas birthday and I was sad to see that the pasta special prices had gone up. For the longest time it has always been $8 pasta nights on Sunday, Mondays and Tuesdays. They have never changed. It was Leah's such a good deal because the pasta you got for that price was usually $13.50. When we went yesterday we saw that recently the special pasta prices had risen to $9.99 on pasta nights which is still a deal but not as good of a deal. That is why one star was lost. 
In addition to this we went for my Grandmas 68th birthday and usually restaurants will give a free dessert for the birthday but Chiantis doesn't which was also a little disappointing and why they lost another star. 
Usually they get a higher rating then this it was just to disappointing things when I went. 
Nevertheless, we will continue to go here :)"}
{"text":"As friendly as the owner and wait staff are, I can't really say I'm a fan of this restaurant. Walking in, you'll immediately be aware of the drab decor. \"Well, that's alright\" you might say, as long as the food is good. Unfortunately, it isn't. For lunch, I had ordered the Pollo al Oscar, an interesting dish containing chicken, crab, and prawns, in a cheese sauce accompanied by potatoes, carrots, and fried zucchini. The crab meat was dry, and tasted like it had come from a can. The chicken had an odd texture, and perhaps was boiled or steamed. The sauce was actually good, as were the prawns. Though they were small and consisted of only three. 
One high note was the side salad. I had asked for bleu cheese and it came with an Italian dressing, and a decent side of well tasting bleu cheese chunks. Not what I expected, but was actually quite good."}
{"text":"Interior is fine, service is quick and well.
But I haven't really enjoyed pasta. The expectations were for very good pasta, but it is not the case."}
{"text":"*DON'T MAKE A WISH OR BLOW OUT THE CANDLES*


The Following Events happened in October, and are based on actual events that toke place....

My first and only experience was HORRIBLE.  I toke my mother on a belated birthday dinner- she choose the place based on good reviews from co-workers and the lingering curiosity of driving by the place everyday for work.

The exterior could use some attention and fixing, but over all bright and colourful. We went on a Tuesday (which the place promotes pasta dishes for low prices). However theirs a hook, you MUST purchase a salad and dessert in order to receive the deal... can you say misleading and shady?!

The food is palatable no different then going to Boston Pizza; is bland, plates are poorly executed and the service needs fine tuning... I'll give you an example:
When I asked for a candle to be places on my mom's dessert (incognito) to surprise her the waiter nodded. When Dessert rolled around I was anxious and anticipating a happy surprised look on my mom's face... instead I was sorely disappointed, the dumb waiter FORGOT to put a candle on her cake!

I was furious, got up and pulled a manager aside, she then rolled her eyes and gave me a long history story about the  waiter being new.. blah, blah,blah! Also I might add the manager never stopped by our table during our main course as she did with every other table. To make matters they never corrected the problem and were VERY rude when we left. I WILL NEVER GO BACK, EVER ( I rather eat my own toe nails before stepping into this place)!!!"}
{"text":"We've been coming here with family and friends for more than seven years now; somehow I missed giving this restaurant my two thumbs-up.  Some of our servers have seen our son grow up.  Chianti's is family friendly with fast, pleasant, attentive service.  They also have $8.99 pasta specials (everything from spaghetti and meatballs to lasagna al forno) on Sundays,Mondays and Tuesdays.  My family's favourite dishes include their French onion soup(perfect every time and not too salty), spaghetti Napoletana, spaghetti con polpettone, lasagna al forno, cheese ravioli, and fettuccini Alfredo.   They also have $8.99 pasta and panini lunch specials (which include soup of the day or salad).  Free wifi and patio seating is available."}
{"text":"Don't waste your time. food was gross I had the carbonara and all I tasted was the flour in the pre made sauce. Real carbonara does not have flour in it. Service was good prices not bad Location is good. Place needs a good dose of TLC repair the booths and a good cleaning. Over all I did not like this place at all. I do not recomend this place to any one. Stay away from this place"}
{"text":"Delicious pasta. I had the ravioli and i absolutely loved it. The $8.99 deal on Sunday, Monday and Tuesday is a great bargain. The portions are big and filling, and for $8.99 for the flavour and quantity you are getting, can not be beat. I will certainly be returning."}
{"text":"This is a great place for great service good food. We drive from the south to come to this one is better then the one we have close to us in Willow Park . prices are cheaper. Take for instant the seafood pasta here is 23 dollars, Willow Park is 30 dollars big mark up. They still grate your cheese for you unlike Willow Park as they give you the pizza joint parm and peppers . Tables are spaced further apart so your not sitting on the next table. Worth the drive from the south ."}
{"text":"Loved this place! We stopped off on the way to the airport and were delighted.   Everything tasted great!"}
{"text":"Chianti is an odd chain. None of the restaurants look alike. And the menus also seem to differ. The pasta served is identical, but the preparations, and prices are different.

This location actually has a somewhat sleek, trendy appearance, with a chalkboard announcing the daily specials, dimmed lighting, and faux-wood floors.

And i enjoyed my ravioli, which was prepared with a curry cream sauce, coupled with crab meat and mango. 

Prices are very reasonable at this location, especially on a Monday, when all pastas are three dollars off. And a \"sports size\" pasta is good for two meals."}
{"text":"Again... another disappointment at Chiantis. Every year we go for my moms birthday because she loves it. We try something new every time in hope that we get something that we enjoy. We never complain or send anything back because my mom is enjoying herself. When we frequented Chiantis on 17th ave years ago, I remember the food being great. It seems now like we are served Italian fast food as the only things hot are the sauces. The veal was dry and cold, the cannoli was also, the Caesar salad was tasteless like something you would get from Ricky's. Bag salad at Safeway is better. The calamari was good. The service was just ok. We ran out of drinks a couple of times and after asking 2 x finally got some. 8 of us shared a small basket of bread that was burnt. I hate to pay for crap service and food. Was not worth $232.00 plus tip. If you are reading this Chiantis... it would be a good idea to ask how everything was. My husband ordered Sicilian pasta which tasted like mushy pasta in battery acid with rubber sausages. I tried it. Not good. I do not understand why people think you are a good restaurant. You are surviving off your once good reputation."}
{"text":"Very slow service.  There was a small group of us there for a birthday and the staff completely forgot to place some of our orders.  The only one of my friends satisfied with the food was my friend who ordered the curry chicken pasta which was good.  Will likely not go back as there's a lot better restaurants in the area for a grate value."}
{"text":"After a suitable absence following a couple experiences I did not like (meat finding it's way into my veggie dishes in 2 of 3 visits)  I've made a triumphant return.   I do feel a little bit on edge and feel I pick at my food looking for unexpected bits but they food was quite good and I hope I relax around the food a bit more with positive experiences. 

They seem busier than I remember even when get wondered in at a really odd time of day and they've jacked their special prices up a dollar - $8.99 pasta dishes on their off days (Mon - Thurs if it's still the same).   It's still worth that additional dollar. 

Right now I'm a big fan of their spinach pasta with tomato sauce.   I also appreciate they don't use a lot of oil in the sauce (which I hate) and the ratio of garlic is just right.   My latest meal arrive a bit on the salty side but only to the level I took a bit of notice  and not something to ruin the experience."}
{"text":"Great Italian food and they even have gluten free pasta!

Pasta will always hold a special place in my stomach as the Italians make it delicious. The variety in sauces and pastas will ensure that everyone can find something to fit their tastes. I'm glad that they now offer gluten free pasta (for $2 extra) and it tastes very good (it's rice pasta). They also offer other dishes other than pasta, but I would suggest getting pasta as it is delicious. Their veal is also good if you enjoy veal parmigiana. 

Some of the best Italian food Calgary has to offer."}
{"text":"A - List. One of the top restaurants in town. Incredible food, good service but can be hit and miss at times, seating is clunky but acceptable. Nice patio atmosphere. The Salmon Frutti Di Mare is a knockout. This place is a winner."}
{"text":"2.5 STARS. B - List Overall. The food is very good. The ambiance is pleasant. The service on this night was, and I am being generous, desperate. Just returned from a Friday night sitting, the house is perhaps 1/3rd full. We order. The waiter asks the wrong person if they would prefer a particular sauce. Strike 1. The dinner rolls come out hot and unsatisfying. You now pour your own oil and vinegar. I guess life is busy there. Strike 2. The glass vinegar bottle is leaking. The waiter says he will get another one. So nice of him. A new bottle never reveals itself. Strike 3. The food appears after 35 minutes. Strike 4. After dinner, the waiter offers to package the remainder and return. The bill arrives but not the food. Strike 5. We had a enough and could not muster the energy to tell him he needs an organizational and recall system to be truly successful in his profession. It will be a long while before stepping foot again. There is better elsewhere downtown. Hope for the best when you visit. PS... Best service of the night came from the guy with a nice smile and filled up the water."}
{"text":"We don't go out to eat often, but have gone to Chiantis twice in the last few months. I believe it is under new ownership as of the early spring...(?) And both times we have had a wonderful experience! 
Great food, the  staff have all been so friendly, polite and eager to please. The place has a nice relaxing, atmosphere while still feeling like a bit of a classier place. 
Even the owner is working hard and welcoming every table. 
This place knows what good food and customer service means. Definitely a great spot :)"}
{"text":"There are few restaurants that offer the value given by Chianti's. The food is well worth the price--my SO and I managed to eat dinner for under $30, so Chianti's is good for people wanting tasty fare for less.

The service we had last night was quite good. The pasta was perfectly cooked, and I really enjoyed with fettucine supremo. With the curry-parmesan sauce, this is certainly a comfort food for the ages. My only complaint would be the scallops. While I generally like seafood and appreciate the added flavour and texture to my food, in this case, the scallops added little and didn't really fit--they didn't take on the flavours of everything else either."}
{"text":"Enjoyable atmosphere and very attentive & courteous staff. Great food for great prices. My Wife & I always have a nice time when we choose this location. Also, though it may not matter to some - I always enjoy the music they have playing (Lots of Sinatra!)"}
{"text":"I have been going to this location for years and the food is consistently good.... Sometimes really good. It can be an awkward to sit and enjoy a meal there because the tables are so close together and it gets very loud so we usually get take out. 

Because it is both Mother's Day and my birthday, and because Hubby doesn't cook, we decided to take advantage of the Pasta Night deals. After deciding on what we wanted I called to place our order. This is where it started going awry. 

When I got an employee on the phone I asked about the price difference between the \"sport sized\" pastas on Pasta Night and was informed that there would be a $4 - $5 charge per dish. That was fine so I placed the order and Hubby went to pick it up. 

When he arrived he noticed a big sign saying that Pasta Night prices were not in effect because of Mothers Day..... Fair enough. However, when I was asking about the prices of particular things on PASTA NIGHT the employee should have told me that they were not doing Pasta Night today. Our bill was significantly higher than we expected and though it was still relatively reasonable, it felt like the employee was selectively telling the truth. 

I will go back and will likely enjoy it but tonight's dinner did not leave me a very satisfied customer. Hopefully next time I can increase my star rating to the 3 or 4 that most visits deserve."}
{"text":"Drab decor, hasn't been thoroughly cleaned in a while, as evidenced by the layers of dust in the dining room (which makes me nervous about the food), but service was fab, and food was pretty fresh. I would eat here again. Ambiance better for lunch than a romantic date night..."}
{"text":"This has been our go-to restaurant for both casual dining & special occasions since we moved to the NW over 10 years ago, and the food quality, atmosphere, service and affordability is as good as ever - and as good as the 17th Ave location. I'd like to recommend the entire menu, but pretty sure we haven't tried everything yet - can't resist our top dozen or so favourites. Highly recommended."}
{"text":"Unpretentious, middle-of-the-road Italian, especially if you like generous portions of pasta - the usual penne, fettuccine, linguini, etc. smothered in rich (fattening!) sauces. They start you off with warm, crisp focaccia wedges in a wicker basket, with balsamic vinegar and olive oil dipping sauce (butter is available on request), and afterwards there's a small but delicious selection of desserts (try the tiramisu). They welcome large groups (e.g. for birthdays) and are kid-friendly. Sunday through Tuesday, most full-size pasta dishes are $8.99. Don't expect Teatro or Mercato snob appeal, but at this price it's arguably better value than a mall food court."}
{"text":"Went for the pasta special.  Tons of food, very well made, and I was very impressed with the closing manager - Sherry.  Super attentive, great with the kids and just genuinely an excellent service provider.  I would visit just to get her service.

The ambiance is not as good as the 17th avenue or Crowfoot locations."}
{"text":"Ever since they changed owners, the restaurant has gone downhill. My family used to go every night for pasta night, and all the servers knew our order and our pasta. We knew the staff and they were amazing. Once there were new owners, the quality of the food slowly declined. The caesar salad is nowhere near the same, and it has no unique flavour to it. The servers all left, and the restaurant is no longer the same. I would hesitate to come back. I would much rather try somewhere else..."}
{"text":"I love Chianti, however I only enjoy their pasta entrees so I only go on Sundays- Tuesdays when they have their pasta frenzy and all pasta dishes are $10. Their freshly baked buns are also to die for, I swear I go just for the buns sometimes."}
{"text":"warmly family style Italy restaurant and many people has family dinner here. many kinds of pasta and rich of cheese. Monday and Tuesday has 10 dollar pasta."}
{"text":"Great food, excellent service. I'm surprised by the low rating on Yelp!  We ate on the patio, really enjoyed ourselves!"}
{"text":"Been coming here for over 15 years and I still love it.  Their fettuccine Du chef is my favourite dish.  The pesto cream sauce is so good that I usually use my bread to dip in the sauce.  Their parmesan cheese is always fresh which is very important to any pasta dish.  I love eating lunch here with my mom as the service is friendly and in the summer time they also have a small terrace.  It is definitely a must go to place when I am in Calgary."}
{"text":"Came here on a group dinner.  I ordered the spaghetti Alla Matrician.   Portion was a decent size and good flavour!  You can't go wrong with $11 pasta.  In my hometown they would go hog wild for quality cheap pasta as such as you can get here!   Good experience!  I'd definitely come back!"}
{"text":"Sunday, September 28th 2014: Waitress (older lady with glasses, Erin?) made our dining experience most unpleasant. She took our order rudely. She was never there, lucky the the the other waiters were helpful. She needs to work on her customer service skills. She only showed up when we were ready to pay again. As a restaurant owner, I felt she should not of gotten a tip but we tip because the kitchen deserved it."}
{"text":"Quality of food and service at Chianti Willow Park has severely declined to rock bottom!  This used to be a great family restaurant.  The restaurant wasn't busy yet we have to wait 20 minutes for drinks and weren't served bread until we had to ask for it.  The cream sauce was curdled and tasted horrible - this is a dish we've had hundreds of times.  We would have complained but the waiter never returned after taking our order (someone else finally delivered our cold meals).  Staff also grabbed our bill when we were paying and took it away before we had a chance to pick it up (suspicious) So disappointing but clear there is new ownership or management.  Just awful!"}
{"text":"I've been coming to this Chianti's location for nearly a decade now - but I haven't reviewed it. I visited this past weekend, and my excellent experience reminded me to share credit where it's due. 

This suburban Italian restaurant isn't a Michelin-starred culinary experience, but it's not supposed to be either. Chianti is a amazingly solid, neighbourhood pasta option with extremely good prices. The portions are large, the bread is freshly baked and all you can eat (remember to save room for the pasta), and the pasta options vary widely and are all delicious. GF/Veg options are of course available. 

Most recently, I had the Fulminante, which was pasta with shrimp, smoked salmon, olives, and green onion in a curry cream sauce - everything was absolutely on point, I got a very generous portion, the pasta was very well cooked and the flavor balance was right. Other favourites of mine include the Romanoff Veal tortellini with mushrooms and bacon, as well as anything alfredo sauce. 

Plus, for $9 (Sun-Tues), it's a steal - I can't even get away with $9 for a full meal at McDonalds. 

I don't get why this place gets anything less than stellar - It's not claiming to be Teatro, and I love it for what it is."}
{"text":"The last couple of times we've been here, the quality of the food has changed. I always get pasta. You can see by my previous review we've been coming here A  LONG time.

I always order either a half and half order that includes carbonara. It's been decent with no complaints. Last night true to form I ordered the carbonara. It came and all the spaghetti was broken and it was flavourless. Broken spaghetti!! All of it!! I didn't eat much, told the waitress, they took it off my bill and that was it. No apology, no concerns, no nothing. 

The prices have jumped up here and the quality of the food has gone way down. In my son's half|half order of pasta, he had alfredo sauce with rigatoni. We counted there were 12 pieces of rigatoni on his plate yet you pay $15 when you do a split order. That amount of rigatoni and sauce was worth no more than $2. We've noticed this the last couple of times, our kids plates of pasta very small for the price they pay. We've brought it up with management in the past as well to no avail and last night was really the last straw. There are way to many better restaurants out there and they will get our business going forward."}
{"text":"Only gonna comment only on the food cause the service was super fast & I was served by what appeared to be the polite Manager. He was considerate enough to ask if I wanted cutlery & 

The Beef Rigatoni was very good. The pasta was al-dente but that's to my taste. Flavour profile of the sauce was very good but not great. It was missing something but I don't know what. Cheesy...yes, creamy...yes, missing something...yes! 

The next time I'm in Calgary I just might go back."}
{"text":"I've stayed away from Chianti's the last couple of years because, quite frankly, I considered it and it's cheap pasta  menu the epitome of mediocre Italian food in town. I was prepares for a two star lunch today when a colleague suggested it as our lunch spot.

Well, colour me yelped to be admitting that it was actually a 3 star lunch... Maybe even 3.5! I avoided the pasta options and opted instead for a salmon dish listed as a lunch special. It cane with my choice of soup or one of three salads- spinach, Caesar or house greens. The salmon was as long as my hand (I have big hands) and had a creamy cucumber like dip on the side. It was good, I'd also give it a 3.5.

The service gets a 4. It may not have been busy, but our server was on the ball with drinks, food specials and being sure to check in on us throughout the meal.

All in all, not a regrettable lunch choice."}
{"text":"Had lunch here on Sunday and the pastas were $8.99, we didn't know so it was a pleasent suprise. Upon walking in it took a little bit before anyone greeted us. Strange since it wasn't busy at all, at most there were 4 small tables. The decor was was kind of bland, only thing that stood out was the big chalk board wall they had woth the specials. Chairs were uncomfortable and the table wobbled like a drunken hyena until you stamped your foot on the leg.

Bulldog - order this, its amazingly tastey here. Too bad theg don't give you a full sized bottle of Corona with it, just a small 250ml one. Most tastiest thing I've had here.

The pasta looked decent. Good ratio of seafood, pasta and sauce. First bite I took of my linguine pepperona it was bland but a few dashes of the table salt it was bare able.


Overall, for a cheap lunch it's just subpar."}
{"text":"Excellent service, good food and good ambience. The parking is limited. They have outdoor seating as well. Food was fresh and delicious. The place is kids friendly and they took good care of us as a big group. 
All their pasta have eggs so they gave us an option of rice noodles for those who could not have eggs. 
The food arrived quickly and the serving size was good. Most of us had to take leftovers in a box.
Would come here again!"}
{"text":"Certainly one of the best value Italian joints in the city. Chianti is a really a workin mans joint. This restaurant has stood the test of time.Tell me what restaurants along Macleod trail have been open since the early 90's?  Not many ! But chiantis has survived and is still going strong! they are obviously doing something right!

They make a lot from scratch at Chiantis. All the sauces, a lot of the pastas and a variety of the condiments like ceasar dressing or the sauce they serve with fried zucchini not many if any restaurants do that especially at the price point. They make their own meat balls ( which are really good!) they make fresh cannelloni ( one of my faves)  I could go on but you get the idea!

The bad? A few things have changed over the years one bad thing is that they don't bake their own bread anymore. About 4 years ago they stopped doing this and it always made me sad because the bread was actually really good, perhaps it was that whole low carb fad that took place a few years back. They also used to serve oil and balsamic but that stopped when the in house bread stopped. Only to be replaced with generic and tasteless rolls from some robot baker somewhere. I would have givin a 5 if the old bread was still here!

 All in all great italian/ American fare. It's one of my staple restaurants, and I would say it should be one of yours to. This place blows all the other Italian chain restaurants out of the water and to the moon. It's chianti! ,they have earned their place and my stomachs heart. Check it!"}
{"text":"Ladies, take note: All men like cheap pasta. If you're looking for a boyfriend, forget going to art openings, go for cheap pasta night at Chianti's. At $7.99 for any dish, you'll not only get dinner, you'll be surrounded by men sitting by themselves, or with their gym buddy. 

Why does Chianti's not market this? I'm not sure. What am I sure of? You know what you're going to get at Chianti's. A large variety of pasta (including whole wheat and gluten free) with a large variety of sauces. 

On my visit, I had the salad with salmon. The salmon was overcooked, but not bad. Their house dressing is deliciously garlicky and simple. 

The seating makes it feel slightly more like a fast food joint than I'd like to see. Other than that, while it's definitely not fancy, Chianti's is a solid place for a quick weeknight meal with the family, a great place for cheap pasta and probably the best place I can think of for girls to pick up doods looking for a lady who can cook (Pasta special is Sunday through Tuesday, I believe).

Finally, the service was great. Our waiter was extremely helpful - and the manager was right in there, circling all of the tables, ensuring everyone was getting what they needed and enjoying the experience."}
{"text":"I was in last night with a group of nine.  The server was friendly but not overly attentive.  Service was a bit slow.

I ordered a pasta combo which consisted of Cheese Ravioli Formaggio (delicious!) and Spinach Fettuccine Fiorentina (some undercooked pasta and overdone chicken).  One other in our party voluntarily mentioned that she didn't like her pasta but thought the seafood in it was good.  

The doors entering the women's restroom are well worn and the restroom itself looks like it belongs in a well-used and neglected neighborhood pub.  I couldn't believe it.  This seriously lowers the class of this restaurant as far as I'm concerned.  I don't remember it being this way a few years ago.  

There certainly are better places in Calgary that serve inexpensive pasta."}
{"text":"Great pasta and flawless service.  No wait and everything was provided as asked.   This visitor was happy!!!"}
{"text":"Good, reasonably priced Italian food can be had here. The service is good and the pasta fresh, although the atmosphere is right out of 1997."}
{"text":"Awesome pasta joint. When coworkers come in from Chicago they always want to go to Chianti's.  It reminds then of home.  Great for kids as they have coloring pages and good kids menu.  Always busy so hop early.  Tables are close together which gives its' active feel."}
{"text":"We were debating between Boston Pizza's pasta Tuesday...or Chianti's. We thought, why not try Chianti's since it's been a few years? It was instant regret. The service was great, however I felt like my entree was a microwave dinner. I don't fault them for trying...but I thought I remembered Chianti's being so much better. Will probably be steering clear of this place...at least for the next couple of years."}
{"text":"LOVE THIS PLACE! 

They have great gluten free options. even when it comes to the starters. they give you gluten free bread and vinegar with olive oil. The staff is so friendly. they know my father and I as soon as we walk in and now exactly what we want! Giving these guys a perfect score. 

How ever i would avoid the one in the south. Its worth the drive to come to the NE."}
{"text":"Man I was disappointed after visiting this chianti. I am. Big fan of the one of the one in the North East. The food was pretty good. But the service was not so great. Food took a long time. I had to wait along time to get a refill on the drink and the server was just never around. The northeast location had gluten free bread olive oil and vinegar. All this location had is regular bread and no olive oil."}
{"text":"The service is good. That is where the good part stops unfortunately. 

I had veal with Carbonara on the side, which is a $4.25 add on to your meal. There was not one thing I liked about the food. The pasta was so over cooked it was like baby food. The carbonara had zero flavour, except for the pepper on top. The veal was the worst I have ever had. Totally freezer burned and reheated. Yuck. 

The other person at our table had veal parm with the same unfortunate carbonara that I did. For some reason the Veal had a slice of pastrami on it under the cheese. Uh what? At least follow a recipe. 

Needless to say, I would not return. Just awful."}
{"text":"Out on Valentine's Day and time for a dinner date with the hubby. We weren't sure where to head, but knowing we were headed to a movie. We happened upon Chianti, figuring it would be as good of a choice as any.

We picked a good one. 

The food was fresh, flavourful and the portions were great. I had the Modigliari, a curried cream sauce over from scratch pasta and seafood. Hubby had the catciatorre, which he was equally satisfied. 

Prices were also really reasonable for what you got, which was also a pleasant surprise. 

Being Valentine's Day and a Saturday night, it was definitely busy, but not enough that we couldn't be seated right away. This is a good thing considering we are fly by the seat of our pants diners. 

Service didn't suffer either. The waitress was friendly and attentive. 

My only gripe was it didn't feel cozy, but what you get in quality of food, this is a minuscule concern. 

We'd definitely go again if we end up in that area of town. Great place. Great food."}
{"text":"Chianti is one of those places where if what you're looking for is a decent simple plate of pasta or reasonably good value, but not exactly elegance.  In fact, while they do claim to be a restaurant, I would say that the food reminds me a lot of what I found in tourist trap street cafes in Venice.  Inexpensive, simple, filling, but not a place I would ever consider for a special event.
If nice and simple, and reasonably fast is what you're looking for, then I would go to Chianti, but if you want something of elegance and better quality, there are quite a few better places all over town, including their sister restaurant, the Fiore on 17th Ave."}
{"text":"This is the worst Italian food ive ever had in my life. The pasta does not taste like pasta. A group of us had a variety of dishes (fettuccine Alfredo, quattro fromagio, Mediterranea). No one was pleased. The only decent tasting dish was the vegetable soup. I recommend not eating here."}
{"text":"This place is amazing! Best pasta I have ever had hands down. We didn't have a reservation but we got seated right away. I ordered the linguine fiorentina and it was absolutely delicious. The sauce was tomato and pesto and it was amazing. The portions were perfect too. Not too much and not too little. I would definitely come here again."}
{"text":"Food and prices are reasonable.  If you only have an hour for lunch it's not the best place though as it can take some time to order, receive your food, eat and wait for your bill as they get quite busy."}
{"text":"Very disappointing experience here. Although the prices were very good, as the saying goes you get what you pay for.  The food was horrible, undercooked, poor flavors and the fish tasted like an old shoe.  If you want fast food in a restaurant setting then this is a good affordable place for you."}
{"text":"Chianti is cozy, delicious, reasonable and familiar. I have my \"regular\" dish too. I always order the same thing. Yes I try to deviate, but I always go back to my tried-and-true. Monte Mari, it's a Parmesan cream sauce with scallops, peas and mushrooms. I let the waiter sweat it out for a bit while he's turning the Parmesan grater over my dish. If he stops I give him a disapproving look.

Plus they always bring me Tabasco here. If they didn't do that this place would be a dealbreaker because Tabasco for me is like salt for other people. Especially for pasta. 

The gnocchi looks awesome. The ravioli looks amazing. I've tried appetizers, desserts, drinks, seafood and salad here. Everything is good. I've gone for lunch and dinner. I've been coming to this restaurant for over 15 years. The staff is friendly, efficient and attentive.

It's good. It's heavy. So if you're trying to eat for abs or you are in some kind of fitness training understand these are serious carbs. Seriously good carbs. Fantastic carbs."}
{"text":"They are not a 5 star restaurant but for the restaurant they purport to be they are 5 star in my books. Have been going there 3 or 4 times a year for many years now, also a follower-on-a from 17th Ave SW many years ago. I read most of the previous reviews and agree with mostly all of the positive ones. I especially enjoy the older male waiters that have been there for years but all there staff are excellent. Nothing is perfect and to expect such is ridiculous, tonight the Lasagna wasn't like we would normally like it with a crusty top but it looked freshly made so was a stand out from that point of view. I mentioned that I like lots of extra garlic and I could smell it before they put my plate down, I prefer the vegetables to pasta, my meal was excellent. My girlfriend is english second language and I said to her \"you know the word ambience, correct\" she smiled and said \"like in here, very nice\". You can't make this up, nice light music, quite conversations, privacy of conversations etc. We are in our 60's, we had 2 beers and a Margarita, she had lasagna and I a large veal and vegetables, desert. $52 plus a $10 tip. It was 28 below outside and we spent an hour and a half inside having a nice meal and conversing on it being one of our nicest Christmases with family and friends. I am so grateful to have Chianti's in Crowfoot within 10 minutes of my home. P.S. Their beer garden in the back is the best kept secret in the summer."}
{"text":"Really the only good thing is the bread. Been here multiple times, pasta is ALWAYS bland and flavorless. Last experience will be my last, the older blond server that we had was incredibly rude and unprofessional. She left a worst taste in my mouth than the pasta."}
{"text":"I DON'T GET IT?!

This is not good Italian food. Why do people love this place so much? Sure it's fast, cheap, and easy but good is far from what I would call the food here. Yes the decor is alright and the staff are very nice but the terrible food just drags the star rating down here.

I'm sure if you looked in the kitchen you would find a line of pasta, sauces, meat, and filler all ready to go. You place your order and bam! They just scoop the slop onto your plate. 

This is probably a good place for when you're 16 and on a first date. It's cheap and will probably impress her. Pony up a little extra for desert young man and you might just get to second base."}
{"text":"Chianti's makes great pasta!  I can't say it enough.  This is one place I go if I'm really, really craving some delectable pasta and sauces!

They have so many different pasta creations to choose from.  You can order your basic fettuccine alfredo, or go for something a little more extreme like shrimp and other fish dishes.  It doesn't matter what you order, it's going to be delicious!

The style of this restaurant is a little more high class than some other ones.  I find it to be quite a classy place and choose it as a favourite for date night.  I suppose the prices are a bit high, but I think it's definitely worth it since the food is so yummy!

The service is always really nice, and makes the experience a lot of fun.  Last time I went I had a super funny waiter who only made jokes with us about absolutely everything.  He really made the experience unique and I totally loved it.

Chianti's is just delicious and definitely a place for couples to enjoy a lovely dinner.  Yum yum!"}
{"text":"They have Gluten Free dessert now! 

We had some chocolate almond torte thing it was great!

The offer gluten free bread with gluten free vinegar and oil. 

I think they told me (in the past) all their pasta sauces are g free,  I personally had the the Athena today. 

My husband had some entrée special but the owner was very quick to point out when he brought our meals to the table that I could not have anything on his plate so that was awesome that they took my dietary restrictions seriously and warned me. 

This will be a place I will for sure miss the Chiantis in Edmonton lack in service and menu."}
{"text":"Now just to say I have not been to any other of the Chianti Cafes. Also I must add I am a picky sort of person when it comes to eating out.
This one did not fail me on any scale. Took grandkids to a lunchtime session. Waiter, one of the best. Food, good Itilian style. Enjoyment value, fantastic. Go again?  Bet you!
The children's meals were generous and well balanced. The lunch specials, well they looked good, but we went for the a la cart. All of which we very good. I had one of the veal dishes with cheeses. Could have been more generous with the wedges, that would have been better. However, the plate that the meals were on were warm! Thank goodness some knows their business!!. The vegetables were cook just on the bite. Well done there. When we came to the sweets..........well no complaints there AT ALL.
Try it. I was more than satisfied and not expensive. As I intermated, I will go there again.
Oh just to add, the restaurant was NOT NOISEY, so one could actually have a conversation!"}
{"text":"First time being here for their pasta Monday deal. $8.99 for most of their pasta dishes. 
 Was extremely busy, but we were still seated quickly and served quickly. Service was amazing from the host at the front door to the serving folks at the tables. Fast, efficient, attentive and friendly. 
Great food for the price! Bread served before the meal is so tasty and the pasta was amazing! I found the sauce to taste homemade and \"real\" with good portions. Unlimited bread, pasta dish and cheesecake at the end only cost $15 per person! Even at regular prices this place is priced well and a good bet!"}
{"text":"Love the $7.99 pasta special!  Today is Monday - pasta cheap night!  There were 3 of us.  We started out with the Insalata Mista - love the salad dressing.  

I had  Alla Vongole (Clam with white wine sauce).  Instead of Linguini, I decided to opt for the whole wheat Fusilli.  I liked it.  I had 3 clams in their shells and it was done really well!  The white wine sauce also came with shredded clam meat and loads of parsley.  

Dad ordered the Spaghetti Con Polpetti - he liked it.  Meatballs were fairly big.  

Sis ordered Carciofi Diabloe - interesting flavours - Chicken, Artichokes & Red Peppers, Spinach in a Spicy Basil Cream Sauce - also opted for whole wheat fusilli instead of fettucini.

Service was quick.  I like that."}
{"text":"Chianti is amazing hands down. With a stunning venue, lovely service and even just a good vibe, I come back at least twice a month. The fettuccini alfredo is the perfect dish for kids or even the inner kids in all of us! Because it's light, delicious and simple. For a more sophisticated meal, I would definitely choose the Caribbean alfredo, the normal alfredo with added curry, shrimp and mango, or the Chicken Parmesan with a side of fettuccini alfredo rather than spaghetti. Anyways, this restaurant is amazing! My only criticism is the bathrooms are quite crusty :("}
{"text":"This is my favourite Chianti location as the wait time is generally low and the service has consistently been exceptional. They bring you freshly made bread to start, the portion sizes are large and the prices are a quite inexpensive. I have been extremely satisfied with everything I have ever ordered."}
{"text":"Yummy! First time here and was here for their $9 (?correct me if I'm wrong) special for their pastas! OMG it was so delishy. I got the Spinach Fettuccine Athena. AMAZING! And the waiter was so pleasant. Making sure we got what we wanted. Most def coming back!
Plus when we asked to pack up some of our stuff they packaged it so nice!"}
{"text":"I have noticed that Calgary does not often have many \"middle ground\" restaurants.
A place is often either super high-end, or dirt-cheap garbage.

Chianti is one of the few places in the city that seems to successfully provide that ever-elusive \"middle ground.\"

The food is very affordable (especially on $7.99 pasta nights) and fairly good quality. Obviously not your highest calibre Italian cuisine, but it is a very good deal considering the price.

The restaurant is often busy and an ideal location for a cheap but still romantic date.

I often order the Cannelloni ($7.99-$10.99), Lasagna ($7.99-$10.99) or Combinazione Della Casa (Veal Parmigiana, Cannelloni, and Linguine Alfredo - $15). Jessica almost ALWAYS gets the gnocchi with pesto cream sauce (also quite delicious!).

And if you got a big appetite, you can always increase the volume of your pasta dish by ordering it \"Sports size.\" No idea how they decided this was a good name for this option, but I'm happy they did. I always get a good giggle when I hear someone order it.

I have many memories of \"nights out\" with Jessica's family here. The service always good, the food is always satisfying, and you won't be walking home because you have no money left for gas or cab fare."}
{"text":"Sadly I'm dropping my rave review to a 2 star.

We have popped in every now and again over the past few years, the restaurant underwent a welcome reno, familiar faces along with new ones are almost always pleasant and cheap pasta frenzy still exists, albeit it went from $6.99 to $7.99 to currently $8.99 which really isn't a big savings when most of the pastas run about $11. 

We happened to be in the area and stopped in for a carb fix, the place was practically dead for 7:00.  Got seated right away and got the complimentary bread with vinegar and olive oil; it was still as delightful and fresh as I remembered it.  Waiters seemed to be in good spirits and busying themselves in the bar- 

Husband and kid 1 order their regular, a carciofi and spaghetti bolognese, I ventured to try something new the 'supremo'-well it was way too salty and rich and the scallops and salmon were way over cooked the entire dish ended up tasting like hotdogs! I barely finished a quarter of it and just ate the bread on the table.  My other kid ordered the ravioli and he's home sick from school right now after a few vomit induced trips to the washroom.

The waiter seemed complacent and never asked how my pasta was ...so we never made a fuss- hardly worth it for $8.99.

Sadly because of this last trip, Chianti will take a back seat to other restaurants in the area."}
{"text":"Not \"rude\" exactly, but \"abrupt\" wait staff. The carrot on the side of the salad was all white and wilted. The pasta whatever it was instead of tomato or other actual SAUCE it just was drowned in like 1/2 a cup of oil! Eeek pretty bad wont be going back. Also, they store cases of inventory wine right in the middle of the dining room.  Also there is a bussing station thats right out in the open with gross plates and garbage for your viewing pleasure while you eat. Oh yeah got an espresso in the tiny cup and saucer, and with it they gave me a huge dessert spoon that didnt even fit in the cup had to use the handle LOL, any italian would be ashamed for sure. Oh right, last, the owner or manager guy there is this creepy fat white guy with a beard who stands there giving dirty looks while opening boxes and letters with the cutlery."}
{"text":"Onion soup, seems easy only 3 things in it. Cook forgot the bread, not nice. it only took 30 minutes to cook, at lunch? Not acceptable. Curry cream sauce, sounds simple. Well not for the cooks at this location. They forgot to put the cream in the cream sauce. Overall, 60 minutes for lunch? Lots of empty tables and 15 minutes to just get a glass of water and my order taken. Not acceptable. I think I am going to drive to 32 avenue. I  have better service and the cooks know how to make Onion Soup!"}
{"text":"Cheapish Italianish lunch thing.

Slow and sloppy service - they sort of expect you to deal with that, considering such approach to be a part of the style. Mediocre food - only good enough for a lunch, but below average for a dinner.

Portion size is ok, but it was always taking me certain effort to finish my plate - just because I was unable to appreciate the taste as soon as the hungry feeling stepped back.

No drinks to remember. Tips were not appreciated, as waiters were not recognizing me (us) during the next visits.

I am not saying \"avoid\", I am just saying \"try to find something else, if possible\"..."}
{"text":"We took a delivery order from Chianti a few days ago and were very pleasantly surprised. It's hard to get good delivery Italian food for a variety of reasons. We loved Chianti's half-order entrees, and bought several to share like a tasting menu. Their appetizers were also delicious. We would highly recommend their Skip the Dishes delivery menu."}
{"text":"So far I only had lunches there so my experience is limited. It is a great place for lunch-a variety of options for adults and kids. The food is good, the prices are low, the service is quick and friendly. For starters they bring a platter with fresh baked bread and pour authentic oils and vinegar for dipping. Then we usually order soup and sandwich option for adults and chicken fingers for kids (plus free ice cream for kids in the end). 
Sandwiches are HUGE. If it is salmon sandwich it will be real pile of salmon and not a cheap substitute from a can. 
One time I felt like my sandwich lacked flavor or more spice but the soup was so good that I asked for more (like a refill) and they did not charge me for that. When I pointed out that the bill was smaller than it should be,  the owner just smiled and wished me a good day. 
I would easily recommend this place to anyone."}
{"text":"So as a Vegan couple we normally have great meals at Italian places....not here!!

We could not have any of the regular pasta as it is home made with eggs...ok..so what can we have? Rice Vermicelli pasta.....

I ordered the Primavera and my partner ordered pasta with tomato sauce.

Mine was horrible..the pasta was mush...mushy mushy mush!! And the sauce was just like from a jar...and the veg was raw...raw carrots, celery ( who puts celery in a pasta dish?) onions...the frozen peas were at least cooked!!

My partner's was mushy mush..with jarred sauce.

He was so angry he could not even talk about it. He is an amazing cook himself and knows how easy it is to make a decent pasta dish!!

The complimentary bread was good..and we ordered a salad ( how can you screw that up?)

Only redeeming thing about this experience was the server was awesome and he did not charge us for the pasta ( which we didn't eat )

would never return!!"}
