{"text":"I got the mild and it was a tad bit hot!  The breast is really almost the size of your head and full of tender, juicy chicken!  Just fabulous.  Great coleslaw and wonderful slightly sweet ranch sauce to go with it.  A slice of plain white bread comes with it also, but I'd pay extra for a real biscuit or corn muffin.  Some sort of green salad would be a plus on the menu.  Regardless, well done and good value for the money!"}
{"text":"It took us an hour to get to this little restaurant via ttc. We sweated buckets on a hot day as the resto only has portable ac. Worth it? Oh yes.  The chicken is absolutely tender and has just the right amount of spice at medium hot. The portion sizes are enormous. Quarter chicken is definitely enough for 2 meals. I was even ravenous before I started. Husband had the sandwich which was even better, I think.   Would go back even with the 2 hour commute round trip!"}
{"text":"Perhaps it's the lack of truth in advertising, so it's becomes easy to be a bit dismissive anytime a place claims their chicken is super spicy. I'll tell you now that you should take Chica's very seriously and very literally when they tell you that their chicken is \"medium\" and especially the \"hot AF\".  If anyone is familiar with Nashville-style chicken, it's already known to be spicy. So when you order \"medium\" here, you're not getting barely spiced chicken. This would easily pass for hot or even extra hot at other places. In hindsight, it's best to understand this as medium or average within the scope of Nashville-style chicken - which is known to be spicy.   The medium had two ratings for heat, and the \"Hot AF\" was given five. I can tell you that this is also not arbitrary, but that the Hot AF is comfortably two and a half times hotter than the medium - at least. We were later told that ghost pepper and Carolina Reaper peppers are used for the seasoning. This isn't a case like Popeye's which may dash the smallest amount of ghost pepper in order to legitimise their chicken off as \"ghost pepper\" hot by meeting some technicality; at Chica's they are certainly using bonafide scorching heat with their Hot AF.  Chica's isn't simply serious about spiciness however, they are serious about the quality of the chicken and the sides. Each piece of chicken is actually a 1/4 chicken which typically counts for 2 or more at other places, so don't that mislead you into thinking it's expensive. I was with a group of 4 and we ordered the family meal which was 4 pieces (4 quarters) of chicken, and three sides of: coleslaw, waffle fries, and bean salad. We all had a special craving ahead of time for waffle fries, so we asked to forgo the bean salad for more fries which they were happy to accommodate. They also throw in a sour-cream based dipping sauce, along with homemade pickles and a few slices of sliced bread. Altogether, it came out to $50, so with tax we each spent less than $15 each which is more than fair value.  The chicken is very meaty, but also flavourful. Aside from the spice, there's also a fair amount of seasoning in the chicken which gives it great taste, but without being too salty. Even the coleslaw has a bit of heat to it, only slightly. The waffle fries were almost certainly made in house and I've long held the view that it's the best cut you can have for fries.  They take what they do very seriously here: the chicken is faithful to Nashville, it's perfectly cooked and they also have a sincere regard for the customer as we were asked more than once how we liked everything. I'd whole-heartedly recommend this place, with the only caveat being that you need to understand the heat they're working with. Unless you're the very rare extreme heat seeker, you should probably avoid the hot AF. Other than that, probably order down one level of heat than what you're used to."}
{"text":"Chica's is located at the south east corner of Dundas St W and Keele in the Junction.    Along with much of the area around the Junction things have changed.  New businesses have replaced older businesses and the neighborhood seems to be a newer, younger, hipper type of feel to it.  The biggest addition to the immediate area is the addition of more residential to the area.  There used to be a Canadian Tire just up the block before the rail overpass and now there's high rise there instead.  The old silos on Junction are gone and the Old Weston bridge to Dupont is finally back.  To me these new places like Chica's add to the new Junction.    Chica's has a pretty small footprint but there's a good handful of tables with seating for about 25-30.  The menu is pretty short and sweet as the main option is just fried chicken and associated sides which are bean salad, waffle fries and cole slaw.  The chicken can be a sandwich, a single quarter (dark or white) or a group meal whether 3 or 4 pieces.  The 3 or 4 piece combos include sides of your choice and the pieces are essentially your choice of quarter (dark or white) and each piece can be spiced accordingly.    The choices for spice are mild (no spice?), medium, and hot.  The medium is cayenne type spice which is the closest to the original Nashville Hot / Prince fried chicken.  The hot however is insanely hot.  While medium is denoted by 3 icons of hot, the hot (named appropriately - AF) is denoted with 5.  Really it should be more.  The thing is I didn't ask what kind of peppers they used for the hot version because really here nobody and I mean nobody does real southern hot or extreme hot.  Basically there's almost nothing to be afraid of here when asking for hot.  Many places that serve what they call is hot is not really that hot.  So our group went with the 4 piece, 3 x medium dark and 1 x hot white meat.  I was surprised by the level of heat by just eating the pickle off the top of the hot serving.  After trying a piece of chicken it was evident that this was definitely HOT (AF) as they say it was.  I had asked what peppers they used for hot expecting them to say habanero or something like that but nope.  Our server said they used a mix of ghost and Carolina reaper.  I was like WHAT?  Those are two of the hottest peppers available.  Ghost would have been bad enough but the Carolina reaper is extreme.  I can't say I know of any place that serves that as a regular menu item spice.    The staff here are very friendly and helpful.  We were told upon ordering that it would be about 30 minutes.  I understand this because I've been to fried chicken places before where orders of chicken even though they're constantly making it is that there's a cycle.  Since the place is made to order, expect a wait and expect it to be nothing but fresh because of that.  The pieces are very large pieces.  These quarters are definitely not free range cute birds.  These are the kind of quarters that will make you full whether they are dark or white pieces.  Prices may seem high for what you'd think of as 4 pieces but these are unsplit pieces in that they're full quarters so a dark quarter is the thigh and drum and the white quarter is breast and wing attached.  The breading and cooking is proper.  Crunchy, bubbly looking skin yet juicy through and through and for big pieces, definitely fully cooked.  The spice level is the changer though.    Nashville Hot to me is something that is on a popularity trend right now but the style is new for the Toronto scene really.  This type of fried chicken has been around for a while in the US and I have to say that Chica's seems to do it right.  While their take on hot is sort of extreme it would probably be prudent to explain to customers what hot really is and medium on their menu (made with X peppers) because hot here is such a subjective metric.  Everybody has their own but they're not lying when they say HOT AF because it is absolutely that.  The bottom line is that Chica's makes some really good Nashville hot fried chicken.  Their HOT is to be respected.  If you're used to Buffalo hot or even habanero hot be prepared for the ghost/CReaper combo.  This level of hot is beyond those by a country mile.  Medium is more mainstream hot if I had to gauge it.  Besides the spice the chicken itself are very generous portions as well as well cooked as their recipe is very well done.  Chica's is now one of major players for fried chicken in Toronto I have no doubt about that.  I do wonder if they simply stick to just Nashville Hot or if they expand to something else, say like Korean fried chicken???  edit:  I want to point out that the sides we asked for were only cole slaw and waffle fries.  They gave us a container of cole slaw with one of the meals but all the fries were in fact given to us in a larger take out size box.  It was a lot of fries for what should have been 2 orders.  The fries on the photo with the Hot AF white piece were just extra."}
{"text":"Giant pieces of chicken with a great crispy crunch on the outside. The chicken was super moist inside.   This was the first time I went and played it safe by getting medium. The spice level was nice, good kick but not overwhelming. I didn't find that it was a gradual hot, unlike some spicy food. I'll try hot next time. The buttermilk ranch was delicious. It cuts the spice and just enhanced the flavour of the chicken. The coleslaw was also nice and refreshing to the palate as well.   It takes a bit of time for them to fry the chicken, but hey, you're getting it fresh! Love the chicken. The team was super nice and helpful in explaining things. They seem to really enjoy being there, so I would recommend supporting them!"}
{"text":"I've had a lot of fried chicken in my life and this is by far the best. Chicken was moist and crispy. Enough spice to make your mouth tingle for more (and not salty at all). The white bread and pickles are great compliments to the dish. Service was amazing. I recommend going early because I heard it can get pretty crazy.   Highly recommended. Regardless of how far you live this gem is a must try."}
{"text":"I've been here a couple times and this place has been fantastic each time. Great wings and if you like them spicy it's perfect. The chicken is extremely moist and the breading is crisy perfection. Everything is fried fresh and service has been spot on.   The portions for the cost are great and will leave you satisfied. This is easily some of the best fried chicken in the city and a great addition to the neighborhood. The staff is extremely engaged to make sure you enjoy your meal as well."}
{"text":"My wife and I stopped in for Friday night dinner and loved everything about the meal.  The people here are incredibly friendly - makes me happy to see all the other diners coming in to support them.  As for the food...the chicken...those waffle cut fries...that bean salad!! The guy at the counter who recommended the bean salad knows what he's talkin about. Fresh - Perfect for the hot summer weather.  The chicken was tender, juicy, and the skin was crispy. The medium was hot enough for me, but I'm excited to try the Hot AF next time.  Also the portions here are very generous. We split a half chicken with an extra side and it was indulgently enough for the two of us.   Excited to have this place ten minutes from my office."}
{"text":"I'll admit I was pretty skeptical walking into Chica's Nashville Hot Chicken. Every review on this site, as of this writing, is a glowing five-star affair, and I was suspicious as to their accuracy and veracity. How could I not be?  Such concerns were completely unwarranted, it turns out.  After a quick perusal of the refreshingly compact menu, I decided to try their Nashville Hot Chicken Sandwich with a side order of Coleslaw. I opted for the Hot AF option, of course.  The food was delivered to our table about 15 minutes later and it sure looked impressive. The almost intimidatingly large piece of fried chicken is meticulously placed between two slices of perfect white bread.  And although my first bite was just breading, my subsequent bites immediately told me I was eating something pretty special. The chicken is cooked flawlessly; I would go so far as to say this was one of the best pieces of fried chicken I've ever had, since it was moist and juicy and in no way overpowered by the breading.  The sandwich actually maintained its integrity throughout, too, which is no small feat. The Hot AF seasoning admittedly was a little too spicy for me, but my dining companion, who had already eaten at Chica's twice before, noted that it seemed spicier than usual.  It's worth noting, too, that the creamy coleslaw is much, much better than I expected. It's actually far more flavorful than your typical coleslaw of this type, and I can certainly imagine stopping by just to buy a bucket of the stuff.  Here's hoping Chica's is here to stay. (And here's hoping they eventually expand to a location a little closer to my place.)"}
{"text":"Just noticed this new spot while walking down Dundas and decided to pop in. The guy and gal running the joint were extremely friendly and welcoming. I ordered the Louisiana hot chicken sandwich. It was made fresh to order, so it was about a 10 minute wait but it was well worth it. It was extremely tasty. The chicken was super, super juicy, between two pieces of white bread with pickles, lettuce, buttermilk ranch and loaded with hot sauce. I love spicy food, but even I had a tough time handling the \"hot\" option, so be fairly warned. Absolutely loved this place and will be coming back soon."}
{"text":"After reading all the great reviews I had to try this place. I was hungry so I ordered the 3 person platter. Wow what a lot of food!! Got one of each side and 1 mild and 2 medium spiced chickens. The chicken pieces are huge we ended up taking most of it home. The chicken was ok, well cooked and spiced ok. Pickles were good and dipping sauce was tasty (wish we had more). The slaw is pretty bland and the bean salad was just ok. The waffle fries were good.  There was a wait (everything is made to order) and we got there before the rush (another customer told us the wait was 25min)  Overall the food was ok but nothing to write home about. I think I'll try the sandwich next time to see if maybe that's more to my taste."}
{"text":"Ordered 1/2 chicken; ordered with waffle fries. Came with2 loaves of bread/round pickles/buttermilk ranch dip. 2 drinks.  $30 with taxes.  Taste was ok. Portions were ok. Price is roughly $4-$5 per 1 piece of chicken. (1/4=2 pieces of chicken)  Hopefully their menu will include to sell buckets of chicken only option.  Customer service was very personal (from owners primarily)."}
{"text":"Dropped in on a quiet afternoon around 2 PM and ordered the fried quarter dark chicken with a hot AF seasoning. I was told the hot AF seasoning is made of a blend of ghost and Carolina reeper peppers. The staff were very attentive to my experience seeing it was just me and a table of 2 other guys in the restaurant and were generous enough to throw in another quarter chicken dark for free (not-a-big-deal). The chicken was tender and flavourful but not too overpowering to the point where I'd be scrambling for a carton of milk.  Overall great experience. I'll be back to give their wings a try."}
{"text":"This is such a great addition to the neighbourhood. Staff is pretty awesome and the chicken was perfect. I would honestly hit this place up a lot more frequently if my pants weren't getting too tight."}
{"text":"Chica's Nashville Hot Chicken serves up exactly what they advertise, which is hot southern-style chicken that is fried to perfection. There are few places in Toronto that specialize in one thing and do it really well... and this place is among the best on that list!  Everything on the menu is mouthwatering, and the size of the chicken is insane for the price. You will have to wait a good 10 or 15 minutes for your order, but every second is worth it. Don't make plans to come here until you're ready for an adventure. A sandwich took me a good hour to slowly chomp down, as I wanted to absorb the full 'Nashville' experience in one sitting.  Sides include bean salad, cole slaw, waffle fries, and all the other 'fixins' you'd expect them to have. They keep things really simple and straightforward here, and the staff is friendly. A cool variety of music plays in the background, and this establishment really brings charm and character to this classic Toronto neighbourhood. Believe the hype, these guys deserve five stars just on the food and service alone.  Pro tip: Kick it up a notch and try the medium or hot spicy chicken!"}
{"text":"Absolutely delicious chicken, huge portions, and everything is made to order. Great fried chicken takes time to make, and can't be kept under a heat lamp for hours. The chicken here is served fresh out of the fryer, and cooked perfectly with the right amount of heat. $14 may seem high for a 1/4 Chicken (white or dark) with 1 side, bread, and pickles, but in reality, it's worth every penny, especially since the piece of chicken is huge!!   Chicken (and sandwich) seems to take about 12-15 mins to make, but it's definitely try worth the wait. Nashville Hot Chicken is hard to find, especially in Toronto, glad we finally have a spot that specializes in it! The owner also seems like a really friendly and genuine guy interested in the quality of food. Will be back!"}
{"text":"Traveled about 55 minutes to try this chicken. Would I do it again? Yes!!  The chicken was moist and delicious! I would definitely come back again and even take some to go for Sunday lunch.  We had the mild sandwich and mild 1/4 piece. It came with bread, coleslaw and pickles.  The price point is high but to be honest two people could share the sandwich and even the 1/4 piece. They owner is very friendly!!  If you haven't tried it you really need to come and check it out!!"}
{"text":"Chicken is great, the people running the place are awesome, they make their sauces in house, a welcome addition to the junction"}
