{"text":"Came here on a weekday night, nice and clean inside. This place has changed over to a couple of different restaurants and it seems like they are not having much luck still. 

Restaurant is 90% empty everyday, have never seen it packed. The last time it was packed was when it was a burger joint with the original Greek owners called Kings Court. Since selling the business and building years ago, they moved back to Greece to retire. Unfortunately, that same year they moved back they were killed in a car accident. Now the place seems like it can't seem to resurrect to being the packed restaurant it once was. 

This place would be awesome if it was a California Sandwiches, would make a killing or an awesome burger joint. 

New, young staff to breathe excitement. 

Food was good, I had the cheese steak - too much jalapeño....over kill, good sandwich still. 

I'd come here to do a pick up next time."}
{"text":"Great addition to our community! Love the atmosphere, friendly service. Great food! Can't wait for the patio to open!"}
{"text":"All I can say is WOW. Well, I can say a bit more. My mother and I stopped by for a quick bite after driving past many times and thinking of trying the place out. It was delicious. I had the smoked chicken sandwich with avocado and bacon, my mother had the steak sandwich. They were spectacular sandwiches and so reasonably priced. The fries were fresh cut and reminicent of those yummy carnival chip trucks. I understand they have smoked chicken and rib entrees but it was too heavy for an early dinner option for us so we had the sandwiches. The owner was very kind and paid special attention to my son, which was very nice. This place is a gem and I'm very happy it's local."}
{"text":"If you want yummy burgers or smoked meat..this place is awesome. Keep room for their cheesecake, the best in the world! Very nice place ... Come on everyone, try local places not stupid chains ! This place is absolutely delicious."}
{"text":"No draft beer. 

But smoked meat and ribs in house. 

The shrimp appy is DELICIOUS. And all appys are 1/2 price before 4pm - along with domestic beers for $4 

All n all. Tasty stuff and cheap drinks. 

The patio could use some plants - but it's not a deal killer."}
{"text":"More than just perfectly cooked and great tasting steak, the friendly and generous owner and cooks are what make this place special. I discovered this place when my pregnant wife was craving steak. I ordered a to-go steak and joked with the owner over the phone about who the steak was really for. When I came to pick up my order, the owner shared some stories with me and the chef came from the back with a slice of complimentary cheesecake for my wife. How amazing! The next time I came, the owner threw in a free Boylans pop because I talked to him about how much I loved that drink! This is the type of restaurant that I hope thrives and survives. They are such genuine people and the food portions are worth every penny. I definitely found my go to steak place near the Danforth!"}
{"text":"My God!! Some of the best ribs I've had hands down! Wife had the dry rubbed smoked chicken breast and swears it is the best she's ever had. Fantastic food and the staff are incredible. Fun, friendly and warm. It felt like eating at a family member's place. Oh....did I mention the flambé for dessert?!?! Every bit as good as mom's. Must try restaurant!!!"}
{"text":"We live in the area and have wanted to try this newly renovated restaurant for a while. We went with a group of 8 people and we were all impressed. The food was delicious and the service was excellent!  I had the salmon, hubby had the bison burger.  We also really enjoyed the shrimp poppers as an appetizer.  We will return!"}
{"text":"Came here after passing it for sometime now.
Glad we decided to stop in and give it a go...... 
Service was wonderful as our waitress was very helpful by letting us know what was recommend as this was our first time there. 
To start we ordered the shrimp app which was very delicious, I would totally order it again.
I had the Salmon main that was served with dill sauce, salad and veggies, this dish was amazing! I was very pleased with it and would again return just to have that dish. 
My boyfriend ordered the half rack of ribs and sweet potato fries, in which he said the ribs were on the dry side but good. 
We both loved the patio as it was a lovely summer evening to enjoy, we were surprised it wasn't packed with people.
Overall we will return as we live around the corner and both enjoyed our experience as we found the both the food and service to be excellent."}
{"text":"Loved this place! The decor inside was great, and the restaurant facilities were incredibly clean. The menu was simple but offered enough variety. I had a chicken & avocado sandwich while a few of my friends tried the bison burger (all with fresh cut fries). The food was delicious, and we enjoyed ourselves on the large patio. The food took a little longer than expected to come out, and we were waiting a bit for our bill, but other than that I have no concerns!"}
{"text":"Fund this place in early December, dropping off a friend, in her hood. 
Our intention was to just pop in for a beer, but we decided to try the smoked rib sliders and shrimp poppers. SO glad we did. 
Some of the best ribs I have ever had in a restaurant. 

Went back there two weeks later to have the rib meal with a Delish side salad - the salad was fresh crisp spinach with cranberries, dressing could have had a bit more of a tang, but everything else was fantastic. 

It's clean, stylish, and the service is attentive and friendly, without being invasive. 

I plan on being a repeat customer! 

Next time I am bringing a group of friends to try their Vodka party shot service, and the bison burger."}
{"text":"The place is nice, but the food is very underwhelming. A little pricey as well. They don't have draft beer. This is bizarre given its a Chicago themed restaurant. I ordered the cheese steak sandwich and it was bizarre. Open faced sandwich LOADED with red peppers. No salt or pepper. We ordered ribs as well and they were extremely dry. The espresso was unbelievably expensive for the size. It wasn't even a mouth full of espresso."}
{"text":"I was really impressed! 

The quality of food is very good, a solid 8/10, maybe higher (we only tried one thing) and the portion size was larger than expected. The Smoked-Beer braised brisket sandwich had meat piled up, so much so that I used a fork first to get it down to a manageable eating by hand size.

The patio is great and even though it is on a busy road (pape), the stone faced walls with glass top cuts out most of the road noise. Having an easily heard conversation even when at the road-side table as we were isn't a problem at all.

There was talk of them potentially having some live music as well so I really hope that happens. I'd be a regular!"}
{"text":"Second time here.... first time had the pulled pork sandwich and it was dynamite. Also had the cheesecake - cardiac inducing spectacular. 

Beef brisket sandwich - hand sliced thick cuts of tender seasoned beef and sweet potato fries were in the true Chicago style. 

Have the cheesecake for sure also."}
