{"text":"I had high hopes for this restaurant however I was extremely disappointed. The portions were small but the prices were steep. I thought the quality of the lamb was alright (the sesame lamb ribs were decent) but we found a hair in one of the salads... The noodles in the Mongolian Chicken dish were extremely soggy and pretty much turned into a doughy mess in the sauce. Don't think I'll be coming back."}
{"text":"If you are looking for a mediocre food experience, then look no further than Chinese Halal Restaurant. The absent staff and the beaten up food menus were uninspiring at best. I ordered the beef noodles. The soup base tasted like salt water with a hint of beef. The noodles felt like I was eating undercooked dough."}
{"text":"Excellent food, fantastic value nice quick service and very friendly atmosphere. Since we first visited this place in 2014, my wife and I have become regular customers that whenever I am anywhere around Leslie and Finch we stop over. Definitely recommended!"}
{"text":"I was here Saturday night with my boyfriend and the place was packed but thankfully (and surprisingly) we were seated immediately.   We ordered Szechuan chicken, noodles with veggies, and chicken and corn soup. Our food came out within 10-15 minutes of ordering and everything was delicious!   The chicken was well seasoned and the veggies were fresh and crunchy.   The portion size for the noodles was a bit small but it was the perfect amount for just the two of us.   The soup was my favourite part. I grew up eating corn soup and this tasted just like my grandmother used to make.  Overall it was a very good experience; modern setup, friendly staff, and a lively atmosphere.  We will definitely be coming back here again."}
{"text":"This is not your run-of-the-mill Hakka place, this place serves Xinjiang style food, so don't think Hakka or typical Chinese food, the spices here are very different. I have been here several times with friends and we order the same thing because we love the taste.  Here's what I recommend:  The spicy lamb skewers sweet and sour soup spicy mini lamb chops   There are interesting dishes on the menu like Jellyfish and Oxtail so if you are feeling adventurous go for it. If you are aiming for sat evening be sure to reserve as it gets busy. Staff are nice but very busy so if you ask for something (more water, drinks etc) just keep reminding them (yes I know that's not good service is all about but they don't mind).. Note they don't take credit card and the strip mall they are in can get pretty busy but you can also park on the street.  Its good value for money. Hope you enjoy as much as I do.  Please note I went to the North York location (which I prefer)."}
{"text":"I have never tried halal before, or understood what it means, but who cares, this food rocks.  What can I say, but this food is really very good. As mentioned by someone else, the food was not greasy or too salty, which makes it a health meal. My mother never likes lamb due to the gamey taste, but at this place she liked it (only other place was me-va-mi). The dumplings was very tasty, the vegatables really stood out.  Loved the unique colorful selection from northern China.  Price was surprisingly low. Same or only slightly higher than food court.  Walking out, I felt completely satisfied with the experience."}
{"text":"worst restaurant ever!I ordered the lamb hand pilaf rice, they served me \"fried rice\" with soy sauce and eggs, and the lamb were same size as rice, could you believe that? I told the server about the food, she said this is the way they cook the hand pilaf rice. I will never come back again, terrible food terrible restaurant."}
{"text":"Absolutely love this place! First time at this location but have been to the other locations a few times and the food is always great. My famous is the lamb dumplings and lamb skewers - you can never go wrong with those!   The place was quite nice and service was really great. I was there on a Sunday night so it was fairly empty. The food came out pretty fast within 10 minutes of our order and the price is quite reasonable. Great place for some northern Chinese food !"}
{"text":"They have good menu . Food was ok. Fried rice was very good but was not happy with the lamb."}
{"text":"Context: I've been to mainland China several times over the last two decades so I have a pretty decent idea of the regional variation in their cuisine, but I am not from that part of the world nor am I ethnically Chinese. Toronto and the GTA does not lack restaurants that offer these types of varieties, including several that excel in Northern Chinese dishes; both chains and independents. I LOVE the food from this part the world and am always open to try new places that open up.  Ambience: Good. Modern and clean. Menus were clear with pictures for the uninitiated.They have obviously made an effort to set a certain standard and authenticity for their restaurant. Food: Mediocre at best in terms of quality. Basic dishes such as the cold cucumber salad was pretty sad. Asian Legend does a way better job. Cumin lamb skewers were good but you have to be pretty bad to mess up something that's served up by street hawkers. Price: We ordered way to much and came to approx $30 a head. I expect this standard of a restaurant to come to $15-$20 a head. We may have been overzealous with the ordering. Service: This is what's driving the poor review and the fact that I am bothering to write one (which is likely the reason most of the general public ever make one anyway). We were a group of 10 adults and 2 kids. We didn't have a reservation, which I get is an issue with such a large group but it was a Wednesday night post Xmas. There was plenty of space before and after our meal. However the person seating us to our table, taking our order and serving us was blatantly rude. I presume he was the manager who likely is the owner or is his son as he had this air of entitlement to him. He told us twice to make reservations next time we come to visit (which is unlikely). Once I get but I don't understand why he had to insist on it a second time. When we ordered a cold dish he reminded us several times that its cold and not warm. Besides the fact that we get starters come cold as a standard in Mainland China its also clearly written on their menu. The server asked us if we were sure if we wanted to order it several times. I'll give him the benefit of the doubt that some of his customers may be surprised that it came cold but I just didn't like his attitude. Which is a shame really as these types of restaurants (unique regional varieties that specialize in a certain type of cuisine) should flourish."}
{"text":"Went in there last week when I had a weekday off. My buddy wanted to eat lamb skewers. We yelped many restaurants and decided to go this one. The lamb skewers at this place were decent though I couldn't tell the difference with other places. I ordered a braised eggplant dish, which was my favourite while I was a kid. I was shocked how cook there made this dish and they were literally deep frying the chopped eggplant. You can only imagine how awful that taste could be. Service at this place was horrible too. When we asked the waitress to pack the leftovers for us, she simply brought us two food containers and that was it. When I specifically asked her to pack for us, she said you could do that yourself. Never eat in a place where customers have to pack the food themselves. Remember we were not in a self-serve restaurant and you got the tip for a reason."}
{"text":"Excellent service and very delicious and flavourful food. Will add this to my list of favorite restaurants :) I am so happy to have discovered this place !"}
{"text":"If your calling card is cumin lamb skewer, you better make it fresh.  Mine was reheated and the fat was stodgy inalstead of crispy and melty.  Not sure if they ever made cooked to order or  Lamb soup was tasty if a bit heavy on the msg."}
{"text":"Fantastic place to eat! Tried like half the menu so far, things I've never even heard of before and it was all delicious! Real Chinese, like from China Chinese food! Not to mention that its halal, which is always a bonus. Great food, decent prices, nice atmosphere, super friendly service. Will always come back. Looking forward to trying the other half of the menu."}
{"text":"I did not enjoy it first, but after a while I tasted some noodles. The noodles was great and we ordered dumplings and more noodles. Everything was good and the service was so-so, but a little slow. Would I come back? For sure."}
{"text":"Just went here for lunch with my partner, after hearing it recommended by a friend, and I'm really glad we checked it out. I'll definitely be coming back!   They have a lot of dishes that were not so familiar with me - I think with the Muslim connection, they're Western Chinese? But I always love trying new things, so that was a plus! And everything we had was really good.   The very best thing was the steamed lamb dumplings - SO GOOD! I don't even normally eat red meat, but they had so many lamb things on the menu, and all the scents of the food around us smelled so good, I decided this worth a compromise, and it totally was. They make magic with lamb here!  I had the spicy tofu lunch special, and while it wasn't actually all that spicy - somewhat, yes, but my standard for \"spicy\" tends to be many other people's standard for \"incendiary\" - it was really tasty, and came with a side dish of cold edamame, which was nice too.  My partner got chicken with chestnuts, which was also very nice - I'd never encountered chestnuts in Chinese food before, but they went really well in it. Their sweetness made a nice balance to the savoury sauce. Again, not too highly seasoned, but still very good.  Service was very quick, too, which is good when you're on lunch break from work as I was. All in all, quite a nice find, and I'll definitely be back."}
{"text":"In California, we have a large community of Chinese immigrants so we have many delicious traditional Chinese restaurants from different provinces. Many of friends mentioned that Toronto has many good restaurants. My first stop was Chinese Beef and Lamb House, I chose this place for the Halal food and beef / lamb specialties. Well, I gave this place 5 stars for its friendly waitresses, variety / quality of dishes. We were 8 people so we consumed many dishes:(sweet/ soar soup, garlic beef, lamb dumplings, lamb rack/ eggplants...etc) we enjoyed every single of them. Look forward to visit on my next visit to Toronto!"}
{"text":"Decor, space, and service were all amazing  BUT the food wasn't (mind you this is dependent if you fancy Mongolian cuisine)  I surprisingly found the curry fish to taste scrumptious but other items such as friend potato and noodles to be bland and in some cases very oily I would recommend this for someone craving traditional Chinese cuisine but if you are like me who enjoy Hakka style more I would avoid this place."}
{"text":"Food is plain, not very good. The good thing about restaurant though is they have dishes from all over China, of course nothing are quite live up to the authentic standard; another good thing about this place is nothing is very spicy so it's good for ppl who can't handle spicy food. I don't like the food there, can't say for the others."}
{"text":"1.tastes fine honestly, but just fine, average 2.IMPORTANT, each and every lamb skewers got some part?one third to half?that was extremely difficult to chew, let alone to swallow. If one or two of the skewers I ordered had this problem? fine?maybe badluck?however smelled some cons because you overdid it.  so change your tricks or not wouldn't be my problem. last time I went was last time ever. so long"}
{"text":"Came here for their lunch offerings, they have a good portion size for lunches! The lunch special soup noodles and wontons are a great dish!   This place I noticed was quite the quiet joint even with all the space they had. I honestly will need to make more trips to see how the rest of the menu is as the portions are way too large to order multiple dishes for sampling!"}
{"text":"I came here for dinner with a group of friends who had never eaten Xinjiang/Chinese Muslim food before. (Reactions from friends included, \"naw, you're making that up\" and \"isn't that an oxymoron? A Chinese Muslim?\" People got schooled that night!)   The restaurant itself is nice looking, with some Arabic/Chinese calligraphy on the walls and new-enough decor. The service was very quick and efficient, which was exactly what we wanted, as hungry as we were. We ordered a dozen lamb kebabs and a dozen beef kebabs. They were perfectly seasoned with just the right amount of spice. The lamb hand-cut noodles were delicious and had a nice slow burning spice. The chestnut chicken was just ok, a tad overcooked. The pancake stuffed with lamb was decent, but not nearly flavorful enough. The best dishes aside from the kebabs were easily the sweet and sour fried fish, which was tangy and crunchy, the lamb hand-cut noodles, and the vegetable dou miao. The marinated beef tongue cold cuts were also a good appetizer to the main meal. I will definitely be coming back, and zeroing in on the lamb and beef kebabs."}
{"text":"Restaurant: Chinese Halal Restaurant Cuisine: Chinese Location: Scarborough Address: 668 Silver Star Blvd Price Range: $10~15  1: Poor 2: OK 3: Good 4: Very Good 5: Excellent  Food: 5  Service: 4  Ambiance: 4 Overall: 4.5  Extra information:  * Halal (no pork served) * Debit & Cash only * Open 7 days a week for lunch and dinner * Lunch Special 11AM~5PM, Mon-Fri  It was couple years ago when I started hanging out this friend in particular, I started developing likings for lamb. A lot of people who don't like lamb, says that they can't get past the gamey taste in the meat but that's what I like about lamb! If cooked right, I find it to be better than beef or pork sometimes.  Anyways, now that I've explored enough of Chinese restaurants in Chinatown- I've been looking more up at North York. Yes, it is quite far from where I live- but for good Chinese food, I am willing to travel the distance.  Chinese Halal Restaurant is bright and spacious with high ceiling- location seems new or renovated (tables and chairs were shiny!) Waitress that was working there seemed to be doing everything by herself, which was fine cause the restaurant wasn't that busy. However, given that there were 4-5 tables, she was doing a pretty good job keeping up with our table.  Their menu is long and extensive varying from cold dishes, noodles, meat dishes as well as vegetable dishes. Every item has picture on top showing how they look so no surprise there when you want to try something new!  Ordered: Steamed Chicken with Chili Sauce (J11) 3/5  * Cold drumstick of chicken covered in chili sauce for $5.99 * My sister really likes this dish and wanted to order it * Am not really a fan of this dish initially, unless it's done right with lots of spices, peanuts and cilantro * I did not really enjoy this dish but my sister really liked it  Ordered: BBQ Lamb Skewer (A05) 5/5  * 1 skewer for $1.99 * Compared to some other places, $1.99 is one of the pricier ones but these are very much worth it * Lamb pieces are covered in cumin and cooked perfectly * With just the right amount of fat in each pieces, they were really juicy and tender * It was easy to get them off of the skewers (thank goodness) * One of the best lamb skewers I ever had!! * Must Order when you visit  Ordered: Black Garlic Beef Tablets (B13) 5/5  * Plate of beef pieces covered in sweet garlic sauce for $9.99 * I wasn't sure what to expect when ordering this but it just sounded interesting * Kind of reminded me of Ginger-Beef I had from food courts, but better * Beef pieces are deep fried and then covered with the sticky garlic sauce * Comes with pieces of garlic that is cooked thoroughly * Garlic was cooked perfectly, they almost reminded me of chestnuts (and you know garlic is good for you) * This was another solid dish I really enjoyed   Ordered: MaPo ToFu (G07) 4/5  * Sharing portion of MaPo tofu for $6.99 * For it's price, it's very big portion * I don't really like tofu, but this was done really well * It was just spicy enough and seasoned right * Went really well with the plain rice we ordered * Made with semi-soft tofu pieces and lots of sauce to be eaten with rice   Ordered: Hand-made Beef Noodle Soup (H02) 3/5  * Bowl of hand made beef noodle soup for $6.99 * Broth is more on the clear side which is rare for beef noodle soup (usually they are darker and thicker) * I actually enjoyed the soup cause it was light and helped me wash down all the spices from other dishes * Noodles are hand made and fresh, which makes them really long and chewy * 6~7 beef pieces and they are all very good quality * Good with some hot sauce (it lacks some flavor on it's own) * This is actually a very big bowl of noodle soup so you might want to share  Summary: Chinese Halal Restaurant is a must visit for everyone who loves lamb! Even if you don't like lamb, there are other dishes there I am sure you will enjoy. Chinese Halal Restaurant is clean, has good service and has amazing food. Make sure to drop by if you are in the area, cause I am going back for sure :)"}
{"text":"Worst place ive been to yet. General tao chicken was good but u gota watch out for all the fruit flys in the soya sauce and rice and possibly almost every dish."}
{"text":"I've been going here for the past 2 years and the lamb skewers are great! The only problem is they already add service fee to your bill, so what I have been doing in the post two years was inadvertently double tipping them, so beware."}
{"text":"All hail the mighty Szechuan peppercorn. Hand-pulled noodles, BBQ lamb skewers, cumin lamb/beef, lamb buns, lamb shank...so many tasty items to choose from (if you love lamb and/or spicy food). I honestly think you can't go wrong no matter which dish you order, but one that really surprised me was the ma po tofu. We usually don't order this in restaurants because it always comes out as the fake, non-authentic, super salty style, but here they add a twist by adding szechuan peppercorns to it so you get that tongue-numbing spiciness that gives ma po tofu a new meaning.  There are also a variety of non-spicy dishes that are also really tasty.  It's a good place for authentic northern chinese food."}
{"text":"I usually come here with my parents as the food is similar to our central Asian food. Xinjiang cuisine is famous for dumplings, skewers and lamb. Everything so far has been good. Service can be a bit slow during lunch but it's not a big deal to me."}
{"text":"Everything about the place suggests that this is nothing special. The space itself has been home to three prior restaurants that has all gone out of business, the height of the chairs make you wish you've brought a phone book to sit on so that you have the right chair-to-table elevation, and the decor makes as much sense as the leaders the Liberal Party picks to run their campaign.  Examining the art on the wall left me completely bored. The place is plastered with random Chinese calligraphy drawings that has nothing to do with the Xinjing Muslim theme, and adverts of the restaurant itself, just in case you forgot where you were. Christmas lights dangles by the window, and the centrepiece is a giant landscape painting that's probably commissioned by a grade six class during a field trip.  To make it worse, the two dividers to section off the floor were garnished with neon tinted strips of plastic.  It's as if the interior decorator was educated in the Art School of IKEA, went on a mushroom trip, and went all 'Chinese Austin Powers.' Tables of all shapes dwell here, parties are 2-12 can all be comfortably accommodated. There's even a semi-private dining area--which from the outside looks unfinished.   One can really marvel at the tackiness that is spread throughout, but all those failures are immediately forgotten when your food arrives. Because I'll tell you right now, it's damn good. My friend and I were hungry dogs when we arrived. We ordered: Braised OX Tail, Braised Eggplant, Fried Beef Pancakes, Melaeuca Lamb, Fried Lamb Dumplings, Fried Chicken Wings, Lamb Kabobs and two bowls of steam rice. The OX Tail was a bit chewy, and the chicken wings were a bit dry, but you can request them to be flavored. Everything else was bloody superb (especially the braised eggplant). These guys do lamb well. Usually at Chinese halal restaurants, there is a large selection of bread, this was not so at this particular establishment. No matter!  The service was alright, most of the wait staff appear to be part time students, but with that said, they perform above what you'd expect them to. They may forget your drink order sometimes, and things could get a bit awkward. The lady sitting next to us complained about her dish being too spicy, where she was met by the waitress with an unexpected heartfelt response of: \"Um, I'm SORRY...\""}
{"text":"Every dish taste so Fresh , not too much salt like other chinese places. Definately worth your money , i have been eating here for quite some years now , same quality as always."}
{"text":"To me lamb usually has that...lamb-y taste..that is much too overpowering and unappetizing. This place somehow managed to ease up on that factor, which I was super impressed with. Especially thankful considering how much we ordered...   - Cold noodle salad: amazingly al-dente wide rice noodles mixed with chili oil and tahini, cucumbers and gluten ball 'croutons'. Slightly flooded with the chili oil, but overall really good balance of chewy, creamy, spicy, sour.  - Lamb soup: light, cloudy broth had a faint lamb-y smell but thankfully none of the taste. Nice to warm up with on a chilly day.  - BBQ Lamb skewers: excellently seasoned; very tender; easy to get off the skewers! - it's always nice being able to maintain composure when you're trying to pry meat off a stick in public :)  - Naan: lukewarm; too chewy...(think reheated stale bread). It was for sure a disappointing $4.99 to dish out, but I want to believe this was some sort of freak incident...if only so that no one else has to fatigue their jaw eating this.  - Roasted leg of Lamb: the outer coat of seasoning was a bit too salty but the meat had almost reached that fall-off-the-bone state of heaven and was quite tender. Starting to get lamb-ed out by this point...  - Fried lamb (ribs?): not sure what cut this was but it was ridiculously fatty. The fact that there was a fried coating on it was overkill, and the salty/sour dipping sauce could barely help cut through the greasiness.  The first 3 items were pretty tasty, so I wouldn't mind coming back again. A couple beside us got some soup noodles that looked pretty good...& which might've helped break up our first meat feast of 2011."}
{"text":"The abundance of decent, run of the mill hakka chinese options is overwhelming to say the least. For someone looking for authentic halal chinese food, Chinese Halal restaurant is a saviour.  Happened to go there on a cold and dark December night for dinner. The very thought of the comfort of a steaming bowl of noodle soup on such a night was hard to resist. Ordered the bbq lamb skewers and bbq king oyster mushroom. The lamb was a little chewy but the spices on the bbq skewers was delicious. The mushroom on the skewer was tough.  The best order of the night was the lamb dumplings. Came steaming hot. Juicy and flavourful. The home made noodle soup with lamb was wholesome and satisfying.  The service was quick and friendly."}
{"text":"This restaurant specializes in lamb and is one of my go-to places for lamb.   STEAMED LAMB DUMPLINGS These dumplings were so fresh and soupy. It's highly addicting for lamb people!  HANDMADE NOODLE SOUP with LAMB The handmade noodles were so good - fresh and perfectly aldente. The soup was a little bland (though some would say healthy and no msg) but I would've thought the lamb would bring flavour to it. But see below on how to make it even tastier! :)  LAMB SKEWERS Really liked these skewers but found they put too much cumin that it sort of overpowers the lamb. But it's good if you like spicy which I do. What I ended up doing though is dunk pieces of skewer lamb into their handmade noodle soup so it made the soup a little spicier and the meat itself is now perfect . In terms of lamb skewers alone, I prefer the ones from Xin Jiang Restaurant still."}
{"text":"Baa, baa, black sheep, (Jen k and Wayne arrange for a lamb focused UYE) Have you any wool? (After a debate we set the date)  Yes, sir, yes, sir, (12 Yelpers agree to partake) Three bags full; (How we felt after the UYE)  This UYE was arranged to coincide with the Year of the Ram. As always amazing effort to arrange such an event.  We went all out with the menu. So here is the verdict on each dish. Fried Lamb Tongue a more exotic dish for some I guess though we we stayed away from the Vday special. Decent I would order this for the texture as it was done well.  Fresh Lamb Soup. Hmm couldn't make much of it a filler IMO. Sliced Lotus Roots. A good version of lotus root. Even though its pan fried I think its a good way to change the taste of the lamb. Spicy Cabbage. Again done quite well. For a place that's known for lamb they do veggies quite well.  BBQ Lamb Chop. Excellent the top item IMO for this outing. Cooked to perfection with crisp out and nicely rendered fat. The dry spice also elevated this dish.   Lamb Slice Skewer. Intense and looks like a big serving but it is laden with cumin. I would rather order the BBQ lamb skewers as they feel you more satiated.  BBQ Lamb Skewers. For a place that is known for lamb it would be terrible for them to get this item wrong. They do this quite well. I would say its a crowd pleaser Sesame Lamb Chop.  This version of the chops didn't quite sit right. Quite bland IMO. The dipping sauce didn't add much to the meat as it stayed bland. IMO lamb meat benefits from being spiced well so this one was downer. Big BBQ Lamb Leg: Big on presentation a huge hunk of was brought carved and drew ooh and aah from the table. Cooked just right so the meat was tender. The meat was spiced well so a good thing to order if you are a big crowd. There is an option bring it whole so one can carve it on the table.  Lamb Pancakes. Decent and fulfilling.  Beef dumplings. Average as just boiled and not spiced.  Lamb Dumplings: Average.  Rice. Had raisins in it which provided a nice surprise.  My recommendations are order the leg of lamb, BBQ lamb chop if you are a medium sized group and balance out the rest of the meal with other items. I would say a 3 star for moi and would bump it up another star if you are into lamb."}
{"text":"This place is great for lamb lovers like me. So many different types of lamb dishes, most of them delicious.   We ordered a few dishes, all containing lamb. The ones that I remember: -lamb soup: I didn't like this one actually. Seemed like they added some flavor to try to mask the gaminess, but I didn't really like that flavor. When I order a lamb product, I want the gaminess!  -lamb dumplings were excellent. Among the best that I've had -had a lamb noodle dish that was the special of the day. This was also really good. Probably our favorite dish of the night -stay away from the lamb chops! They were really salty, and also a LOT of fat pieces (in fact, there was more fat than meat) -cumin lamb on toothpicks was delicious as expected  Will definitely be back. Would have been 5 stars if not for the fatty lamb chops"}
{"text":"Ordered takeout, found them to be little expensive. considering its Chinese food."}
{"text":"Very good food and service here: the servers were All very attentive and helpful with recommending various choices on the menu. Prices are all very fair and a great bang for your buck. The lamb kabobs especially had amazing flavour,  and topped w spice that was mouth watering. They had those buttons on the side sign type of thing  which u can press for the server, water, and any questions. Nice outing overall- would definitely come back when in the area or access to a car."}
{"text":"I really want to give this restaurant no star. Huge disappointment on all the dishes. I was looking forward to try the House Hand Made Noodle Soup with Lamb but the soup was bland, no flavour at all! The handmade noodles were too thick. Also had the special lamb fried rice and it was super salty. Can't even take a second bite at it. We end up didn't finish any of the food and left. It was unfortunate because all those foods went to waste.   Don't recommend this restaurant to anyone !"}
{"text":"Chicken corn soup was really good and so was the hot and sour. The BBQ menu was excellent bbq lamb, chicken and beef. The spicy boneless chicken was delicious beyond words. The chicken fried rice was good. The noodles were good, however thick. I just did not enjoy the beef dumplings, something about the seasoning was not appealing to my palate. The price was affordable too. We were 8 including a 4 year old and it cost us $106. The service was fast and they were all really really nice. Loved the atmosphere, and it was clean. Will definitely be a regular here and recommend more to come."}
{"text":"Well, the food here is definitely different from my normal fare, and oh-so-good!  By default, most Chinese fare I consume lean towards southern cuisine that tend to be more mild and is more balanced away from the Chinese 'hot air' concept (check out this link for a description of what that is rather than have me half-ass the explanation and leave you still scratching your head http://www.batgung.com/chinese-medicine-doctor-hong-kong).  The food here is definitely not balanced, incredibly flavourful, and really quite delicious!  Not being used to having a lot of spices in my food everyday, I won't be coming here very often, but goodness, the food here is good.  I don't eat lamb, so I can't comment on half of what makes this restaurant so great.  My companions sampled the heavily cumin-spiced lamb skewers and the fried lamb dumplings and have assured me that they are very good.  We started off with the hot and sour soup that I highly recommend.  It set my tongue throbbing and I had to call for ice water.  It's excellent!  It's a large sharing bowl full of stuff - tofu, mushroom, etc and the right mix of spicy and sour.  A lot of hot and sour soups lean toward too much chili or too much artificial whatever to make it bright orange and sour.  Not this soup!  I also had a delicious chopped up garlic beef dish that is intensely flavoured but mild enough that people who don't like hot spices can have it with no issues.  The fried beef stuffed pancake is yummy and that also comes in a lamb version.  The bowl of beef noodle soup is very mild, with fresh hand made chewy noodles.    This location is smaller than the original which is now closed.  The décor is very modern, and it is very clean and bright.  I came here on a Sunday night and the place was packed.  We were lucky enough not to have to wait too long, but we did observe a lot of people coming and going and lining up throughout the entire evening.  The owner also likes to mingle with his customers which I think is quite cute and adds to the small business charm of this place.  The 10% opening discount as mentioned by Wayne is still ongoing as of mid-September '10 when I went."}
{"text":"Not bad, but nothing special either.   The only remarkable thing about the place is that they have a 6 foot christmas tree in the ladies room.  The food was fine, but on the greasy/fatty side. The service was friendly and there were helpful photos of every dish on the menu.   I probably won't be back unless my parents get a craving for lamb again."}
{"text":"This place is just okay. Most of the dishes we had were fine, and there was nothing that blew me away. A few items were just bland (cow tongue skewers).  My brother wouldn't stop saying how it used to be better before.  Service was very friendly, and the food came out VERY quickly, which was awesome.   My favourite items here were the pan fried lamb dumplings."}
{"text":"Extremely expensive with limited portion of food. Although food is delicious but expensive. Other halal Xinjiang restaurant serves same taste food with low price tag."}
{"text":"Went there this evening for dinner. Pretty full on a Sunday evening but still very fast service. Had bbq lamb ribs, bbq lamb skewers, steamed lamb dumplings, Black bean chicken, garlic beef templates and chicken fried noodles. Absolutely delicious each and every item. The food is is juicy and tender and grilled to perfection and the flavours are fantastic. Prices are slightly steep but reasonable for the quality."}
{"text":"Do's: Sesame lamb, lamb stuffed pan fried buns, beef lung or tripe, lamb soup Don't: come here expecting pork!  Chinese Halal. Um, what? Say that again? Chinese. Halal. I'll have to admit, this was a complete head scratcher for me. Who knew these was such cuisine? Located at the back of plaza at Leslie & Finch, I met a friend for lunch here and was pleasantly surprised at the twist on Chinese dishes here.   My friend said the food is actually classified as Islamic, so all the dishes are lamb or beef.   I've got to say, I've seen seen so many different preparations of lamb before.  Lamb ribs coated with sesame and pan fried, interesting... and delicious! The lamb was soft and tasty, though I would have loved it more if the skin were a bit crispier. ($13)  The lamb soup comes loaded with lamb meat, so make sure you scoop from the bottom! ($9)  The lamb leg is the only dish I'd pass on again. For $9 it's a small piece of lamb and a bit too salty for my liking.  The beef lung (yes, lung. This is Asian cuisine folks, not Fear Factor!) was spicy and had a texture similar to tripe, loved it! ($8)  And while I didn't try it, the lamb stuffed pan fried buns look awesome and ginormous, and apparently they are the speciality here (I wish my friend told me that BEFORE we ordered).  Will definitely be back to try those.  I wouldn't drive too far out of my way to come here, but if you're up for a twist on your regular har gow and siu mei, and like lamb, I'd recommend it."}
{"text":"I was veru upset when this place took over one of my favourite chinese restaurants- RICE PAPER. None the less, thought i would give it a shot. I wasnt disappointed at all. Apparantly the owner who was a head chef in a renowned restaurant in hong kong before he moved here, you can taste the authenticity in his flavour. I love the ambience in the restaurant. Some items hit or miss but if you know you items. GRRRREAAAAAT!!!!"}
{"text":"Super salty. Service is on the low side and meats are half way with fat. Or lot of breaded stuff. Never gonna come back. And definitely not hakka at all! Just a bit of spiced up chinese fast food.  They brought us water in plastic cups that could literally cut your lips with the non standard leap design."}
{"text":"Best Northern Chinese around. This place is all about the Lamb and beef dishes, hand pulled noodles and fresh naan (pancake).  Hands down my favorite Chinese restaurant."}
{"text":"My experience at Chinese Beef & Lamb House involved expanding my boundaries both gastronomically and geographically. The restaurant serves up Xinjiang/Chinese Muslim style food in a sad looking strip mall up in Scarberia. It's really far and involves using the oft-maligned purple ttc line and a bus ride but when a chowmeet was decided here I figured I was game for something different.  Decor: the words suburban communist china come to mind, well intentioned chinese kitsch  Our group ordered a host of dishes that could really be described as a lamb-a-palooza, lamb, lamb and more lamb with vegetables making a minor guest appearance. I didn't know there were so many ways to cook up lamb! Among the items we ordered:  -cumin stir fried lamb (tender lamb with lotsa cumin seeds, very good) -crisp pan fried lamb buns (hockey puck sized buns filled with tumeric/cumin spiced minced lamb-okay) -medicinal lamb soup (milkey and soothing the perfect thing to heal my cold) -bbq lamb skewers (juicy and charred but fell short in the spicing department) -boiled spicy lamb (one of my favourites of the night, shavings of lamb in a hot broth of chili peppers and sichuan peppercorns, if you got the right ladleful your tongue was treated to a fiery massage!) -spicy stir fried organs (delicious and not scary but not enough spice) -handmade noodles with lamb (loved the texture of the noodles, they were thick, rustic and chewy) -beef tablets with whole cloves of garlic (sweet brown sauce, loved the abundance of garlic) We finished off with perfectly deep fried banana's in honey. Yum.  Service was helpful and friendly but it was fleeting as we were seated in a private room at the back corner. Some language issues as well, so it's point and order system or bring a mandarin speaker for optimal results.   All in all, an interesting experience as I've been looking to sample some northern style chinese cuisine. However, I do feel that the flavours and spicing in the dishes were extremely muted perhaps our group was handed a raw deal when a few folks objected to ordering all spicy skewers. Prices were very reasonable-we each paid $20 including tax and tip and were stuffed to the seams at the end.  I would go back if a) someone drove me and b) if they amped up the flavour."}
{"text":"I live closeby so I come here a lot. You need to know what to order because it can be a hit or miss, but what I really like from this place are:  Handmade Lamb Noodles - much better than the beef imo and a lot more tender and flavourful.  Cabbage with Vinegar - Nice flavour and super yummy.  Skewers (most of the things on their BBQ menu) - Really flavourful and goes great with rice!  Lamb soup - Love the flavour!  Beef or Lamb pancakes - can be oily but the bun has a nice texture.  Overall I do like this place, their food is generally pretty good and if you like lamb, you should check it out. They have some good lunch specials as well!"}
{"text":"I'm in love with the food here.   I live in detroit right now and it is pretty much worth the 5 hrs drive to come eat here.    This isn't any ordinary Chinese food.  They uses cumin, and all sorts of amazing spice that's not typical of standard Chinese cuisine.  Also, it's halal so don't be expecting any pork here, but instead yummy yummy lamb.    The lamb skewers, lamb chops, cumin duck are some of my favorite.   The organ dishes are great too if you're into that kinda stuff (I've had the liver and lung here and mmmm...) Prices are very reasonable as well.  I've been all over the world eating Chinese food and this place is seriously one of a kind.  I don't know if this is some sort of regional Chinese thing or it really is it more of a fusion type Chinese food.  i don't know.  all i know is the food is damn good here.  You need to try this place and experience it for yourself."}
{"text":"Tldr, Awesome place!!! At first, they noticed that we weren't Chinese, so they made our table with forks. The first dish that arrived was the cold dish. But the waiter realized that we might not enjoy it, so he promptly took it back, free of charge!  Food tasted great. The manager was so kind and always kept an eye on our table to make sure we were doing fine. I never experienced customer service quite like this. P.S. The place has a spot to pray and make wudu too!"}
{"text":"Newly opened next to Cafestra and Starwalk, this BRANCH has a whole new look even from the outside logo and signs.  Due to being open recently, they have a 10% discount promotion going for a limited time.  The decor walking in is very ELEGANT and sets the mood that is a far cry from the original restaurant near Sheppard and Birchmount.  The menu items of North Chinese/Muslim Halal are the same as the original which is exactly what makes me HAPPY.  Xian Lamb Soup Pancake($6.99) is a dough cut into small dice cubes served with Lamb, Glass Noodles in a lamb soup stock.  BBQ Lamb Skewer(1/$1.99) is Cumin spiced not overwhelmingly like others but enough to have you tasting it through-out your meal.  Perfectly tender when eaten fresh.  Lamb Hand-made Noodles($6.99) not to be taken as Hand-pulled Noodles, it also comes with tender tasty Lamb chunks, Glass Noodles, Bean Curd Julienne, Seaweed Julienne in Lamb Stock.  A highlight of this meal I would say was the Sweet Sour Fish($8.99) which is definitely worth it's value and great presentation as this dish usually requires.  We could taste that the flour batter was salted and seasoned nicely as a savoury dish.  The most noticeable difference is probably the decor and OPERATIONS of this place in comparison to the original.  It caters to a different demographics due to its geography.  It is also because of this reason that I noticed the dishes are a bit less OILY and SALTY as the main restaurant."}
{"text":"Love this place.  Great authentic northern Chinese/Xinjiang food.  Price is great.  Their steamed lamb buns are so delish....we usually order some to take home to eat too.  They lamb skewer is also highly recommended. Lamb is their specialty here.    A place like this, you wouldn't be expecting top notch decor/ service.  The place is clean and spacious.  The waitress comes by to fill your tea regularly. So overall a good place to enjoy some authentic dumplins and buns!"}
{"text":"Food is okay. Service is horrible. Waitress knows nothing about the food she serves. Ordered 2 dishes. Watied 30 minutes for the first one, another 30 minutes for the second one."}
{"text":"The Food was very good, and the restaurant had an authentic feel.  The only complaint is that they did not convert American currency nor accept American debit cards, so if you are coming from the USA, be sure to exchange some currency before eating here."}
{"text":"Tried a couple of their specialty dishes on a weeknight.  Restaurant was half full.  Surprisingly lots of non-Chinese customers.  Food seems pretty authentic. Lamb soup was very warming and tasted great on a cold night.  Loved the lamb skewers and croaker fish skewers.  Lamb skewers were very tender and high quality.   The lamb rack was a pretty good portion for $14 and came with some delicious dry spice on the side.  We also had their signature chicken flat noodle dish.  Every table had ordered this dish.  Tasted ok but surprisingly lots of chicken and potatoes but very little noodle. The house fried rice was amazing.  A huge portion for $9.  Came with shrimp, lots of egg in the rice and some raisins(?). Overall, our first time at the restaurant but would definitely visit again.  Reasonable prices and good portions. Next time we will order some of the lamb burger, boiled dumplings and soup noodle. Service was efficient.  Would be nice if some of the wait staff spoke better English.  We had some issues asking for information on menu and .  dishes"}
{"text":"I thought I reviewed it long time ago.  This is our \"canteen\", especially in Fall and Winter. We've been there more than 50 times? Lamb and beef dishes are their specialties. Also the bbq skewers (lamb skewers so far are the best I ever had outside China and you can ask for less spices/chilly powder), fried stuffed pies, dumplings, noodle soup, sesame/bbq/fried lamb chops. Some cold appetizers are good too. Service is nice and prompt.   I'd stay away from chicken and seafood dishes."}
{"text":"I live really close so my family has eaten here quite a few times. The restaurant is decorated very nicely and has comfortable seating. If you're hungry for meat, especially lamb, you should definitely come here. I can only describe the food as a bit \"heavy\"; this is about as far away from salad as it gets.  Everything I've tried at this restaurant was fairly good; I've had lamb skewers, both the beef and lamb in a sliced bun, and lamb and beef ramen. Their dumplings were okay but not awesome."}
{"text":"Overall hot dishes tend to be very greasy/oily, but I absolutely love their hand made lamb and beef noodles!! The noodles are firm and chewy and the broth is spot on. Cold appetizers are alright... like the sliced potato and liang pi (cold noodles). 4 stars just for the noodles!"}
{"text":"Came here tonight for friend's pre birthday dinner... obviously lamb is the main ingredient here cuz almost everything is lamb.. duhh...   We ordered alot of food but it was so hard to taste what it actually tasted like. It was way too fully loaded with spices on all dishes. Signature dish i believe was pan fried lamb meat.. also loaded with spices...   The lamb skewers were quite spicy.. if spicy aint ur thing, i wouldnt suggest it...   Beef soup noodle was quite good, the noodles were quite delicious..   Dessert was deep fried banana /yams /apple i personally preferred the apple. All in all, this was a 2.5 star for me.   I wouldn't go out of my way to visit here again."}
{"text":"Great authentic Northern China Muslim Chinese food! I've come here ever since they were in business).   Decor: Nothing fancy. It's like a typical family-run restaurant. But they have added booth seating and brightened up the restaurant. I hope they keep making improvements, because they have plenty of space to work with.  Food: Once you get past the superficial stuff, you'll find an array of selection of lamb and beef dishes. One of my personal favourite dishes is the beef/lamb noodle soup. They make their own noodle! It's fresh! And their dishes don't use MSG (not that I can tell at least). They make a very good soup base. If you can handle spices, you'll like this place. Their lamb skewers are full of flavour. There is something for everyone.   Service: The staff is friendly and the owner is very down to earth.   This is a good place for large groups. They have lots of seating and round tables to accommodate larger groups.  I would definitely come back. I'd be here for lunch every day if I worked closer."}
{"text":"There was a cold draft everywhere in this restaurant that made the experience a little uncomfortable at first, but when the tea and the food came I didn't notice it as much.  This restaurant is traditional Chinese except they do not serve pork but do have a large selection of lamb dishes.  We ordered bean sprouts, hand made beef noodle soup, spicy beef lung, sizzling beef and veggies as well as lamb skewers.  Everything was at the right temperature and tasted great.  The service is fast and the prices are really reasonable for this type of restaurant.  *Tip... They only take cash and debit.   We will return when craving lamb.  ;-)"}
{"text":"Fair pricing and delicious food except their fish.  Their lamb soup is exceptionally good. Must try it.  The cantonese speaking manager is quite rude."}
{"text":"Food is good, but not worth the money paid. Been going here for years now - I've seen the consistency in quality, decrease in portion, and significant increase in price. I would say it's no longer worth the money for the food. :("}
{"text":"The lamb skewers were the only good part of the meal. The other lamb dishes were very fatty and the flavour was completely different than what the name suggests. Non lamb dishes are average. Remember to order dishes with the cumin spices, you can't go wrong with those."}
{"text":"This is one of the few Chinese places that cooks lamb, and it's delicious! Overall the rice, noodle, dumpling, and bread-like dishes are very much Chinese style, but it does differ a little from mainstream Chinese cooking just to have its own unique taste. The portion sizes (generous!) and prices (low!) are very much like other Chinese restaurants, which means $10 to $15 per person (after tax and tips) will buy you a very satisfying meal. Other than that, I'd briefly mention that their free Wi-Fi Internet didn't seem to work properly."}
{"text":"This place is very different than any Chinese place you have ever been to in Toronto.  They are northern Chinese food and basically not been seen anywhere in Canada.  Not everything in their menu is great but it depends on what you have tasted so far. Their spices are very different. Unique. You have to try their chicken with thousand year egg. They are sliced thin and boneless chicken with a thousand year egg inside. Their prices are so cheap. ~$5. Their noodles are freshly made and by hand. The beef noodle is with the thin noodle but the lamb noodle is with thick noodles like lasagna noodles.  I like the thin noodles.  Really good!  Also try their lamb shiu mai. It comes in a steamer.  But you have to really like lamb because it does have a lamb taste.  It's really amazing and less than $10 for 12 shiu mai. Very different food but definitely must try for a taste of China that you can only get here.    They had a small store up in Scarborough but their food is better here.  The food is good and cheap.  A must try for anyone that's has never been to that part of China before.  Service is hard for people who doesn't have English as their first language but I guess that's to be expected."}
{"text":"I used to come here often. I stopped going as frequently because they started raising their price and the portions downgraded a little. But the quality was still good even though their lamb skewer portions are incredibly small, so I would still come from time to time.   Went yesterday, and stood at the door for a minute with a near empty restaurant, no one was there to seat me (which is no big deal) so my girlfriend and I sat down ourselves. We waited for 5 minutes and I didn't see any wait staff at all. Since I came here often I recognized the owner's son, so I assumed he was the one that's supposed to serve during non-peak hours as he would from time to time before. Nope, kept looking down at his phone sitting on the other side of the restaurant. I don't even think he saw us come in at all. So we left (don't even think he noticed us leave) and went to Deer Garden Restaurant across the street (which I highly recommend since they have NO MSG soup selections). Won't be back again, what a shame."}
{"text":"Superb! We came here for the first time to try their lamb skewers after hearing/reading great reviews about this restaurant. We also ordered a side of fried rice and black pepper beef garlic. The lamb was very soft and marinated in delicious spices which wasn't overpowering at all. I usually don't eat lamb as much because I'm not a fan of the gamey taste, but the lamb skewers did not taste gamey at all which was great. The black pepper beef garlic was literally out of this world. Upon first bite we fell in love! The beef was tender with sweet and garlic flavours which gave the dish a nice balance. We especially loved the whole garlic cloves that were cooked with the beef.   I definitely give this restaurant a 5/5 for the amazing dishes we tried and I cannot wait to go back to try other popular items!"}
{"text":"Disclaimer: this was my first northern Chinese halal meal ever, so I could only review based on if I enjoyed the food and experience.  I came for a UYE organized by Jennifer K.  We ordered mostly lamb/goat dishes: grilled skews, curry, marinated, roasted, stir fried, spicy, not spicy.  We had had it all.  Lamb meat being lamb meat, all the entrees were moist and easy to chew.  Some were juicier (marinated lamb) than the others (skews).  Generally, all the dishes were boldly flavoured and the meat well-seasoned.  I particularly enjoyed the roasted lamb thigh, because it was so meaty.  On the other hand, I found the spicy skews best went with something cold and alcohol (you guess it: beer).  For lamb meat lovers, this restaurant is heaven on earth.  I only had lamb meat at this UYE, so I can't comment on the entrees of other type of meat.  Halal lamb meat didn't taste any different from non-Halal lamb meat.  I wouldn't pay a premium for it.  I liked the bold taste, yet I found I craved some mild flavoured vegetable mid-meal to give my taste buds a break.  I definitely recommend ordering a mix of bold and mild flavoured dishes if you dine here.  The services was slightly below average, because we had to walk over our empty teapots to servers for water refills.  This might be due to the fact that we sat inside a party room."}
{"text":"I wish I could give 0 star.. because I ordered 4 items and I didn't like a single dish. The foods were very average, typical Chinese taste. Loads of oil... no flavour. In the chicken noodle, there's no chicken at all. Probably I found 3/4piececs on the top that's all! I was served with regular menu. After ordering every thing, when I said I didn't like any of them; the waiter gave me the lunch special menu! Shouldn't they offer lunch special menu when people come? So weird and irritating."}
{"text":"The food is okay. It si sood for people who eat halal who want to try Chinese food. I don't like that they put raisins in their fried rice and I think that doesn't really match. This place is also way overpriced I can get better deal at federicks. They have dumpling but I think it is frozen and they reheat it. Luckily I didn't have to pay so no complaints but the food is below par"}
{"text":"Ah the distinct smell of cumin. Gets me in food mode right away.   Five stars are for \"anything on the menu is good\" restaurants. What's even better is that their new menus ave photos for each dish. Finally, a restaurant that gets it.   You'll find some flavourful dishes here. All the skewers are good. Their noodles are fresh made and hand pulled. Lots of good buns/pancakes. I try to order cumin items because it's rare to find them. Great flavour in their soups.   Like I said, you can order anything and it should be good. Also accessible to everyone because you can see the photos of the foods."}
{"text":"We always order the same 7-8 dishes. And it's always amazing. Try their beef tablets, sooooo gooooddd. I don't like most Chinese food, but I have tried some new stuff here and so far so good ;)."}
{"text":"The food here is prepared with care; but I have one gripe.  The food is just not hot (warm) enough when it comes to the table.  There is no question that this is refined cuisine at its best - I just wish it was hotter when it arrives at the table!  The lamb with Chinese yam is a good dish.  Hand made noodles with lamb so-so."}
{"text":"Halal rabbit here hard to find Lamb heaven.  Ordered Lamb soup with a hearty meal best cure for the flu!! Lamb skewers were never this fun"}
{"text":"Decided to give this place a try after a friend's recommendation. Tried the following items: BBQ lamb skewers, beef noodle soup, and lamb fried rice. Thoroughly displeased at the quality and taste each of these items.  Bland, no flavour, lamb overcooked and tasted like charcoal, rice incredibly chewy. Dreadful. Ghastly."}
{"text":"I like they make picture for each of their dishes so people can just point at the pictures to order. Also the photos make all the dishes so attractive.  The specialty is the lamb and beef dishes. I was craving for the soup made with lamb and pieces of organs. It was my home town flavour. I had it and it was to die for.  We also ordered a dry hot pot spicy lamb but it came in a plate not in a hot pot. I hate the dish was changed without a notice to the customer. Also the dry pot dishes are normally relatively pricey than other the plate dishes. That's a bit disappointing.  The third dish was stir fried spicy pieces of lamb organs. It was not spicy as indicated in the menu with 3 chilis. I don't know why they have the menu for. The two out of three dishes were totally different from the photos on the menu.  Overall the taste was good, despite of some unexpected twists of my order."}
{"text":"First time visiting this place. Not very good experience overall. We sit close to the kitchen and no one seems to serve us... I have to call many staff to get someone to help with us with menu and other stuff. Price is a bit high and the quantity is too less. For the BBQ it's a little too salty and spicy for us.. we asked them get us non spicy ones in the second round but those have no taste at all.. seems to me they only have a spicy plus salty sauce combined. The dish is not as tasty as the other restaurant I have been in the city. However I do like their menu.. every single dish has a very good looking photo on the menu so it's very easy to see what you are getting. The restaurant is very clean and organized.. nice modern renovation with bright sitting area. The overall environment is decent. I might not recommend this to my friends since the lack of service is bothering me and a bit pricy compare to other places."}
{"text":"I really like coming here when I'm craving delicious lamb :D  I really enjoy the lamb dumplings, lamb soup, hand pulled lamb noodle, fried lamb pancake, the lamb skewers and the lamb with green onion. The only thing that is stopping it from getting 5 stars is that I come here quite often  and there are times when the hand pulled noodle isn't always consistent (sometimes they cook it for a little too long and the noodles are a little soggy which makes me sad) but that's all! Everything else is pretty consistent. The avg price of dishes are 6.99-8.99.  The staff is always friendly and helpful."}
{"text":"Just really like all the food here so want to give it 5* although sometimes some of the dishes are inconsistent..sometimes you gotta tell the waiter or waitress to remake it sometimes(like the noodles are under/overcooked) but I hope one day they will learn and have it consistent and perfect all the time.  The lamb siu mai is sooooo good and the lamb pancakes are 10/10!  Lamb lamb lamb hehehe"}
{"text":"OK here's the deal -- 11 - 4pm lunch specials for $4.99!  that's unheard of! :) and it's FABULOUS! cheap eats, that's also DELISH?! :)  sweeetttt -- it seriously doesn't get better than this.  Chinese Muslim / Halel Food. Every Lamb and Beef dish on this picture friendly menu is AWESOME.  go in for a warm lamb stew or chef's special soup in the winter, or cool garlic cucumbers in the summer. their beef or lamb chinese style pancakes are YUM -- delightfully puffy and filled with perfectly seasoned meat.  their house special beef noodle soup is cravable! you can taste the time and love in the soup base. ughh so goooood.. and the hand pulled noodles are as real as they get outside of la chine. seriously? who cooks like this anymore outside of china? -- these are classic techniques!  the decor is kind of hilarious though, a lil step up from a hole in the wall, it's definitely clean, but it also feels like you're in the middle of nowhere china, really really first gen.  like you've escaped the city. and nothing matches.  the walls are cheerily painted like you're walking into the plateaus deep into china, starkly contrasting the leather booths and the crazy yellow seat covers that match the trilingual waitress's outfits (they mainly speak mandarin, some canto, and english).   the TVs are always playing old 50's chinese black & white talkies, and there are neon signs boasting great halel food!  the chef is usually out and about greeting the customers - he's won awards for his food, and i agree -- this place is seriously the best regional lamb and beef dishes that's hit the east side of this city since... johnny's burgers.   i highly recommend this place! because i'd be so sad to see it go under because no one knows about it. deserves my YUM YUM approval fo sheezie ;)"}
{"text":"Although I'm not a fans of lamb, but u really need to try the lamb at this place.  This new store is far better than the old one located at Birchmount/Sheppard (closed down already), it's clean!!  I recommend to try their lamb skewer, lamb pancake and  lamb wonton, even though I don't like the cumin flavour, but u will love them all when u try it.   The owner is a very sociable person, love chit chat with clients.  For sure this is a good way to keep your client coming back to your restaurant."}
{"text":"We wanted to try some different foods. My mom got the flyer & said this place looked interesting. So one weekend we got take out here and went to pick it up. Didn't like many of the dishes, it wasn't what we were expecting. Most of the dishes had the same spices used & many of them were the kind we didn't like. Portion sizes weren't great either. Also the restaurant itself has seen better days. It looks like it needs a reno badly. It wasn't busy at all on a Saturday afternoon. We weren't impressed. Won't be ordering from here again."}
{"text":"These guys know how to cook proper chinese! I'm amazed.. Food is fresh and very light and comes in a good quantity for the price. This is a hidden gem guys"}
{"text":"I am always in search of northern style cumin spiced lamb kabobs and hand made noodles. This restaurant looked promising to me but sadly fell short. It wasn't bad, but due to my high hopes and expectations it perhaps was not as good as I would have imagined.   We came for dinner at 8pm on a Saturday bit was more than half full. The menu is huge. For me this is usually a bad sign. I appreciate Chinese restaurants that focus on a particular region and it's specialties rather than having a bit of everything to ensure they have their bases covered. The problem with this is that instead of a small selection of the specialties of the region you end up having to go through and hunt for what you should be ordering.   We went with the hand cut noodles with lamb, the hand pulled noodles with lamb, lamb skewers, broccoli with mushrooms and an appetizer dish of tofu and thousand year old eggs.   Noodles were good. Chewy and definitely hand made. The fried hand cut noodles were way too salty though. The lamb was over salted and then the entire dish had too much soy on it.   The pulled noodles were seasoned more reasonably and quite enjoyable.   The lamb skewers were slightly spicy despite us asking and being told no (asked in Chinese so no lost in translation here.)  The cold tofu/preserved egg dish was cool and refreshing.   Broccoli and mushrooms. Too much sauce and salt. Needs to be eaten with a lot of rice.   Service was fast and friendly."}
{"text":"In an effort to expand my go-to restaurant repertoire, i ended up at Chinese Halal Restaurant with the wife after a long day's work. There were a few typical Chinese dishes on the menu (oh you know... sweet and sour pork, fried rice), but I was pleasantly surprised to find a lot of Northern style Chinese dishes as well.  Picking what to order took slightly longer than usual but we ended up choosing BBQ Lamb Skewers, Szechuan Style Cold Noodles, Cumin Chicken and Black Pepper Beef Tablets with Garlic.  First off, the Lamb Skewers. They were just alright - tender and pretty mild in taste but the two skewers we got were a bit on the overly fatty side. They're not far off from the skewers you get at the night market, just without the massive crowds.  Out of the four dishes, the Szechuan Style Cold Noodles was my favourite. They're not exactly noodles - moreso clear pieces of jello(?) doused in a hot chilli oil. That chilli oil is packed with flavour and is the perfect pair with the noodles. Sprinkled peanuts finish off the dish. Tasty, and decently priced.  The Cumin Chicken was crispy - almost had a curry-like flavour to them. Overall it tasted good. My only complaint with this dish was the ratio of chicken to onions and peppers. Felt like I ordered veggies with a side of chicken.  The beef in this last dish was alright. The sauce made the beef felt like there was a carmellized crust of sugar - really, and unusually sweet. And my oh my did I not expect the amount of garlic in this dish at all.... Makes me wonder how much garlic they go through each day... If the garlic was cooked down and turned crispy, I would be all over this. Instead, when I bit into it, it felt undercooked.  I'm really glad I got to try this place out. There were some good dishes, and some not-so-good, but I'd come back again to scour through the rest of their menu."}
{"text":"Not really sure why I haven't been here sooner. Perhaps I was frightened away by the overwhelming number of lamb dishes they offer here (I detest lamb!). I was pleasantly surprised by pretty much everything here though.  SERVICE:  Customer service was surprisingly good here for a Chinese restaurant. Don't mean to generalize, but friendliness and politeness is not typically a common thing for most Chinese restaurants, and that's kind of become my expectation. However, the staff here were quite attentive and friendly. The food also arrived very quickly.  ATMOSPHERE:  Very spacious, with more than enough room to dine comfortably with a large family or group of friends. Despite the number of people, it was still quite quiet. Pretty clean as well.  FOOD:  I forgot to take pictures, but we went with a lot of safe, or perhaps not so safe dishes, given the level of spiciness. The Spicy Tofu Minced Beef, Beef Garlic Cubes, General Tso's Chicken, Stir Fried Snow Pea Leaves in Garlic, and Pan Fried Beef pockets were all quite good. We made sure to stock up on bowls of rice given the aforementioned spiciness levels of a few of these dishes.   They have a very large selection of items on the menu, with many variations of chicken, beef, and especially lamb (yelch!) offered. Of course, plenty of rice and noodle dishes as well. We were too full to try the desserts, but those looked appetizing as well.  VERDICT:  Will definitely be back, and hoping the food and service was not a fluke."}
{"text":"Came here a few nights ago with my family. We had food once before at their old location on Sheppard and decided we'd try this store out since it's close to home.  I found the majority of their dishes to be too salty. I don't think this was a matter of personal taste, but I guess I should put out a disclaimer that I'm from HK and that Northern Chinese cuisine is not my day-to-day fare.  The service was pretty bad. The waitress that served us forgot to put in two of our orders - one of which she actually recommended to us herself... I am usually understanding of this when a restaurant gets hectic but there were only two tables of customers in the restaurant... also, there was no apology.  We ended the meal with an order of candied sweet potato. I was actually really excited about this because it was delicious at their old location. Was very, very disappointed. The sweet potato pieces were all stuck in one giant lump and the candy shell was so hard that it was virtually impossible to get through.   Definitely will not be back."}
{"text":"Great place for bbq skewers especially if you're a fan of lamb. Other than that, menu is slightly above mediocre. Restaurant is located in a busy plaza do expect some difficulty in finding parking."}
{"text":"Dropped by here for lunch on a Sunny afternoon.. The restaurant is empty...   I was given the regular menu and decided to order the Beef Hand Made Noodle ($6.99) and after I ordered the other waiter said they have lunch menu for the same noodle for $4.99..and he suggested the Beef/Lamb pancake with sweet and sour soup which is good value.. I decided to stick with the beef noodle soup.  The dishes served here are really less oily and salty. There is hardly any oil in my clear beefy tasting broth. It is just the perfect saltiness for me and the beef too is not fat, really tender and soft.  The noodles since it is hand made are of different fhickness... I do expect that, however some of them are double the width of the others?? What happen is some of the noodles are more cooked and some more al dente... This is the only thing I am not too happy about.  The deco is really nice and chic too... no sticky floors, no sticky tables.The lunch menu are so reasonably priced! I will definitely be back again to try out other dishes!!"}
{"text":"I have to admit that I never been to the Old location of Chinese Beef & Lam House...   This place used to be a AYCE Japanese/Thai restaurant. Gone was the old sushi bar and all the Japanese decoration but the lay out of the restaurant is really similar.  Lunch Specials from $5.99 till 4:30 pm on weekday is a sweet deal... Portion wise just perfect without leaving me wanting to have a second lunch!  Hand Made Beef Noodle Soup ($5.99) was quite savory, the noodle cooked al dente with a good bite.  Service was indifference and cold.... but I got my food fast, hot and delicious.........for all I care, that's most important!"}
{"text":"I haven't had legitimately good Chinese-style lamb since visiting to Inner Mongolia. This restaurant gave me serious throw-backs, in all the right ways.  It's sort of unfortunately located, but the food absolutely makes up for its location and questionable decor choices. Every lamb dish here is delicious, and why would you order anything else? I ordered the hand-made lamb noodle soup, and the lamb was just a perfect combination of fatty and meaty. The fried lamb was a bit too tough for my taste, but still, all in all, I haven't found lamb this good on this side of the Pacific.   As a side-note, the lamb tends to be quite odorous. I love it, but you may not be into that sort of thing. Your mileage may vary."}
{"text":"Ohhh mannnnnn so spice, so good. My mouth was a hot bed of tingle after leaving Chinese Halal Restaurant.  We came here on a thursday night. The restaurant was close to empty, which I always get nervous about. We stood at the front waiting for perhaps a hostess to invite us in or anyone. After waiting a while we kinda just invited ourselves to the middle of the restaurant and waved at the waitress working and she pointed at a table and we sat down. The ordering style is write-it-down-yourself-and-hand-it-back-to-them. We ordered lamb skewers, kidney skewers (don't hate, I love these), bbq buns (which we thought were bbq pork buns... they're not), xianjang noodles with chicken, and black bean chicken.  The skewers are smallish and kinda pricey but so good. Definitely hits the craving for skewers.  The kidney skewers are also smallish, but good. Well seasoned.  BBQ buns which we THOUGHT were bbq pork buns, were good despite lacking the meat we were expecting. They are season in cumin and chilli flakes and very addicting.   Xianjang noodles with chicken were good but very spicy and oily. Delicious hand made noodles were nice and chewy.  Black bean chicken was the crowd pleaser that day. Unbelievably tender and juicy, it came sizzling hot on a cast iron plate.  Service was poor, any time we need anything, menus, drinks, orders, etc it took a lifetime to wave the waitress down, considering the restaurant was so empty it should have been easy to get some attention but nope. A little frustrating and at times we wondered if she even understood us.  However even with the poor service, the food was very good and very well priced."}
{"text":"No thanks! Never again. So I go to this restaurant which is in CANADA and I'm excited to get some Kung Pao chicken, rice and an ice cold beer. Lady tells me this is muslim restaurant, therefore no alcohol served! WHAT?!!? It's not like I forced a Muslim to drink alcohol. Anyways... on to the food. Chicken dish was relatively cheap, $9.99, can of coke $1.50. I've had much better Chinese food for that price. I will not return."}
{"text":"If you are ever in the mood for lamb, this place has LOTS of options!!  However i didn't get any lamb dishes so i can't tell you how they are.  For the dishes that my friend and i ordered, i thought they were ok.  A bit on the oily side.  The boiled chicken was a bit lean with not much meat.  It was covered by a bit of  sauce to give it flavor. The beef tripe dish was spicy, but i prefer chinese dimsum beef tripe.   The egg plant with fish flavor is a bit of a strange one.  There's no fish in the entree, and no fish flavor either.... more like they used pork oil to cook because that's all i could taste. We also orfered cabbage on skewers.  It was ok. Service was ok.  The food came quickly.  But it was hard to communicate because the servers were not fluent in English. Would i go back.... i would probably try other places first."}
{"text":"Had their Crispy Halal Beef to see if it is any better than Chung King or Coconut Island (so far those two have the better crispy beefs).  Verdict?  Not crispy enough and TOO SALTY and spicy.  Had to order mango juice to buffer the spiciness.  Then had their beef and lamb pancake.  TOO SALTY for me still.  Not really too appetizing.  I probably won't go there again by choice, but I may go their if invited by friends to try out other dishes, but the dishes I ate didn't click for me.  No free wi-fi (though there is wi-fi that only the owner runs)"}
{"text":"Lamb that melts in your mouth.  Flavoirful hot pots.  Feed 4 for less than $85 tax and tips included."}
{"text":"Anything with lamb, go for it. Lamb dumplings, lamb on stick, lamb on metal skewer, sizzling lamb plate, lamb leg (expensive) are my favourite. Not a fan of cold freebies they give with lunch combos. Parking in front or back of the plaza is hard to find, especially during busy hours."}
