{"text":"This place was not bad. It was all right and for the price and food offered. Like the other buffets, there was sushi offered and it wasn't bad. There was the typical type of food they offer at other buffets. To me, this is a typical kind of buffet and it wasn't bad but it wasn't the best I've gone to."}
{"text":"Very good.  Lots to choose from.  Fri & Sat Dinner- Crab Leg Specials.  Just with what you can eat in shrimp and crab, is definitely worth the $$.  I believe it is just under $ 12.00 per person.  It has become a regular stop for my family."}
{"text":"Mediocre food . The area by the soda dispenser had a weird smell ."}
{"text":"Horrible service manager got lippy after having to ask repeatedly for more crab legs they bring out about 6 sets of crab legs every 20 to 30 minutes regardless if they empty out in 2seconds unbelievable how disrespectful manager was and said the buffet isn't just for crab legs I was unaware of stipulations on what I could eat at the buffet don't go here."}
{"text":"Pros: A decent number of selections to choose from Many familiar choices (if you've been to a Chinese buffet before. Hand-scooped icecream in multiple varieties is a nice touch. I'm soooo tired of soft-serve machines.  Cons: The pitfalls that plague most Chinese buffets... food sits in steam table trays for far too long and gets dry and unpleasant looking if you're not there at a peak-hour when food is being constantly replaced. Unfortunately, the one time I was there during what I'd consider to be \"peak dining\" (around 6:30-7:00pm) it was still a similar issue. Mostly, I'd say this was due to the lack of customers.  I was also not overly impressed with the cleanliness of the restaurant. It has a somewhat dingy look to it. Probably due to the age of the location  To sum up: As a Chinese restaurant, I would not make this my first choice. As a Chinese buffet, I've had both better and worse. Much worse. I would consider going back, but it wouldn't be my first choice."}
{"text":"My dad is really into Asian buffets and I found a 10% coupon in the Clipper magazine so we went and gave this place a shot. I will not be returning. First off, the place was dirty. The bathrooms were dark and erie feeling and there was a smashed roach outside the women's restroom. We sat by the window and all I could notice was the dirty floors, windows, peeling wallpaper, and the fish tanks that look unkept. The food was \"okay\", nothing special. The one thing that I can say is their egg rolls (the bigger ones) were the best I have had at any Asian buffet! Other than that, the  fried shrimp I had tasted freezer burnt, and the hot seafood salad was overpowered by the taste of mayonaise. There were kids running all over the place and as much as I wanted some ice cream, I wish parents would supervise their children around the self serve station because kids had their hands all in and their knuckles covered in ice cream from scooping it out...gross! I give this place 2 stars for the price and the service. Our server was very sweet and was on point when it came to refilling our drinks and asking if we needed anything."}
{"text":"As a Cantonese who lives in Los Angeles (one of the biggest China towns in the world) for over 10 years, I am pretty sure that I am qualified for rating a Chinese buffet restaurant in Phoenix area.  The only plus thing I have to give to them is they serve Cantonese style hot pot, which you put the raw meat and vegetable inside by yourself and you can choose whatever sauce you want to dip for your food. It causes extra 3 dollars (I forgot) for hot pot but you can also get the all you can eat buffet too."}
{"text":"Run, don't walk away from this place.  This is by far one of the worst Chinese Buffets I have ever been to.  It is absolutely the lowest common denominator of restaurants.  The building has seen better days, which isn't necessarily a reason not to eat some place, but the food quality is highly questionable.  The soups set out so long they had begun to congeal.  The orange chicken, the seaseme chicken, and sweet and sour chicken were no longer crispy; they were mushy.  I was afraid to go near any of the beef entrees let alone the sushi bar.  I wish Arizona required sanitation grades like other states, but they don't.  Because the buffet was in such poor condition, I can't imagine what the kitchen looks like.  You are taking serious risks to your health by eating here; plus, you will be highly disappointed.  Panda Express is a five-star restaurant compared to this place.  As I said before: Run, don't walk away from this place!"}
{"text":"Good for the price, they were accommodating and polite- food was hot and tastes good. I will be coming back."}
{"text":"The place is not the cleanest, but the price and food quality is very decent. Hot pot buffet on the weekend is also very good choice."}
{"text":"I have been hear lots of times and the price is good but , I stopped going a few months ago because it was 110* out and they didn't have the Air Cond on than I said something and They put it on but it was too hot in there and once again they DID NOT have crab legs out, even though on Sundays they advertise all day crab legs. So we swore we would not go back. Well today we decided to give them another chace and what a mistake that was!!!!! No crab legs again even though its SUNDAY and they advertise they serve them all day. We ate and a elderly man sitting behind us sat on the edge of his booth and the bench came apart and he fell on the floor ( he was in a walker ) my husband and a small waitress pull him up. She just told him to sit on the other side. I waited a 1/2 hr still no crab legs. Food was not very good and tables dirty. This will be are last trip to the Chinatown Buffet. I will find another place to eat. I would rather pay alittle bit more and get the crablegs and a clean table."}
{"text":"Restaurant very unclean.  Gum on floor,  for knows how long. Food not so great. .. Fatty chicken.  But most of all the management didn't seem to care. * oh , I forgot 93 degrees. .."}
{"text":"I have been here many times. Sadly, they would have a better review years ago. Although it may not have been the most outstanding place on the outside, they had good food inside and always a crowd. Now after many 'Under New Management' changes it appears as if the new management does not care about even former loyal customers. Our last visit saw a full parking lot. As we came nearer to CB there was hardly anyone inside. I could count six customers who looked at us with pity as we entered and approximately ten friends of the owner towards the back of the restaurant.  Service was slow even though there were only a few of us and the major complaint - hardly any food. THIS WAS NOT A SURPRISE. On two previous occasions, we came to CB only to find that they would not refill their hot trays with food. Some were even empty. If you asked the hostess about when an item would be coming out she would direct you to another to try - 'try this instead' ploy. If you pressured her she would eventually call to the kitchen to bring out what you wanted. Or she would ask what do you want and then have someone to bring it out. She compliments these tasks with plenty of loud attitude.  CB has plenty of coupons each month to draw you to the restaurant. But even a coupon, discount, or \"under a newer management\" ploy couldn't lead us back. Shockingly, I opened one of the fortune cookie, that the server gave me at the end of our visit, and it read \"Don't come back here!\" I just about fell out my seat.   No, that's not true - but that's certainly the way we feel. Goodbye Chinatown.   P.S. We were the last to leave on a Friday at 8:30pm. They normally close at 10pm. The hostess was trying to explain to a customer who was waiting for more food to come out why there was hardly anyone in there. She blamed it on the Final Four basketball game. From the above, I disagree, but from all indications CB knows how to serve a 'personal foul'."}
{"text":"My family and I were  on our way to Peter Piper pizza and realized it was way too full to eat there and actually enjoy our Sunday, so we went to china town buffet right next to it. Sadly, we will NOT be going there again. The food is good, but for me a person that has worked customer service for 5 years now, I expect employees to treat their visitors with Excellence, and this place was anything but excellent! We got there and were taken to our booth, asked what we wanted to drink and like always I asked for Dr. Pepper, what was brought to me was not Dr. Pepper. When the person providing us drink came back to our table I told her it tasted like diet, she said \"No it's Dr. Pepper.\" So I told her that I'd rather have a lemonde she said \"why this is Dr. Pepper\" I repeated to her that I'd rather have a lemonde. She came back with 2 powerades and told me they no longer has lemonde but that she brought me powerade. I knew immediately she was lying. At that same moment she asks one of the girls that went with us if she wanted a refill, she had a lemonde, and so she brought her lemonde. Unbelievable. This has been by far the worst place I have ever been, service wise. So disappointing."}
{"text":"My girlfriend and I almost got up and left despite having already paid; I wish we had.  The thought of eating at this filthy establishment reigned mental havoc on us as we drove home.    The staff are friendly but the booths were in disrepair and the dining room was DIRTY.  The condiments on the table were covered with food and sticky; a clear sign that they haven't been wiped down in a while.   The food was sub-par and cheap.  Many of the dishes were empty resulting in limited options.  Google reviews have this place as two stars, I think that's being generous.    I will not eat at this establishment again."}
{"text":"Yet another trip there today.  They were out of several items that I have come to love at that place.  I politely asked if they were going to replenish, which is when the lady at the front started - well I assume she asking the dude at the kitchen door when they were going to have more , I don't speak Chinese but she did say a few minutes and they would bring out more if you want to wait.  Yes, I want to wait. Especially for the Chicken Sticks.  They brought out a big bowl of them and yes, I took all of them.  They can always make more : ) Yet another cool trip to a great food place!"}
{"text":"As far as buffets go, the food at China Town was very good quality. The chicken was primarily white meat, and the sushi was freshly prepared in the dining room. It is always a gamble when trying out a new buffet, and this place definitely exceeded my expectations. My one complaint of the meal was that, as at most buffets, some of the food was a little cold.  Overall I was very impressed with this family restaurant, it was clean and quiet; and the staff were very friendly. It was a little pricey for a weekend buffet, but I appreciated the quality of the food and the way it was prepared.  I will be going back to China Town Buffet :)"}
{"text":"Was craving Chinese and Wongs is being remodeled so went just next door to this place. Upon opening g the front door I was hit with an odor only comparable to the odor in alley used by the homeless to urinate. Could not make it to the second door before I became nauseous and lost the craving as well as my appetite."}
{"text":"Let me start by saying I love a good buffet, this is not a good buffet.  My first impression was poor, dated and frayed carpeting, torn fabric on booths, but you pay as soon as you get in so I stayed.  Everything was overdone and had been out on the warming trays to long.  Service poor,  they brought the first drink to you and I guess you were on your own after that.  My idea of a buffet is to at least earn the tip and keep my glass semi filled.  Not going back, would rather spend the time and drive to Signal Butte Rd and have the best buffet in the valley."}
{"text":"DONT EAT HERE!!!!!! They serve food with roaches in it. This is so gross and disgusting!!!!!!!!!  To top it off they still try to give me a hard time when it came to refund my money!!! SERIOUSLY!!!!!! Know damn well I'll be calling the health  Department....."}
{"text":"Yay! Chinese food in Arizona that doesn't make you sick!  I'm a shrimp fanatic so if you are like me you have to go here. They have breaded shrimp, raw shrimp, crab cake shrimp, bacon wrapped shrimp, and all the things at every other normal chinese buffet on the planet (but not in phoenix) this place is really good.  I think the lunch buffet was only about 8-10 bucks and its definitely the best place i've found so far here."}
{"text":"Let me start out by saying that this place is one of the worst Chinese buffets I've ever been to.  You have to pay first thing when you come in, and I think it's because they don't want you to get a look at the buffet and then walk out.  The vinyl on the booth we sat at was torn and the tables didn't look very clean.  The food was greasy, all of the chicken dishes were dry and the sauces were gloopy and tasteless. One of the potstickers I had tasted like it was made with rotten meat. The hot and sour soup was awful. The fresh fruit and veggies were good, but it's hard to mess that up.  Not only was the food mediocre at best, but while we were eating there 2 of the staff members called some of the other ones over to the buffet line to talk about the food in another language and laugh at it.  Please save yourselves the trouble and eat somewhere else."}
{"text":"Used to be average, now it's not even close. NO CRAB?!?!?!? And the food they do have was just sad. Barely edible. And the people there eating are just as miserable it appears. I would have asked for my money back but I ate $11 worth of crab puffs and eggrolls and left.   Stay away!!!"}
{"text":"I could go on about how filthy and hot this place was or how nonexistent the service was, but I would just be repeating what most other reviewers are saying. I'll just agree with how another reviewer summed it up - it must be run by someone who absolutely does not give a shit."}
{"text":"Me, my dad, my sister and her boyfriend went here. Almost killed my sister because of them cooking with peanut oil and asking people they said they didn't, but they do! No refund either. F**k em."}
{"text":"It had been awhile since we ate here. The hot pot and buffet were decent before. We came in during Thanksgiving weekend and everything was bad. We don't know if the place has changed ownership. We do know for sure that we'll never eat here again and won't recommend it to anyone. Save yourself,  don't eat here!!!"}
{"text":"I love this place! Food is good and fresh. Lots of shrimp. Lots of sushi (mmm). Crab puff are so good. The desert area is scattered, but all of it is good.   I went with my daughter one time -=- and my son the next. I ordered a TRAY of sushi for Saturday's birthday party for my daughter and it was only 24 for the whole tray of 40 pieces. On top of that, they gave my daughter a butterfly necklace for her birthday.   I love the people there and the service is good. They replace the food as soon as it is out. Their banana pudding is the bomb!   Angela Lower"}
{"text":"I was buying my tea at Little India and decided to try the buffet Which is right next-door. It's a Sunday so the price was a little extra. $12. In my opinion it's an incredible deal. There was sushi that was to die for. Salmon as well at the sushi bar. And of course there was everything Else that goes with a Chinese buffet. excellent ribs and great shrimp dishes. It came with a drink. Who could ask for anything more. :-)"}
{"text":"If you're looking for extreme cleanliness, this isn't exactly the best place (particularly in the bathroom). If you're looking for politeness of staff, they have a few blind spots, but the servers do pretty well most of the time. But, if you're looking for a pretty great buffet selection, and ALL YOU CAN EAT SUSHI, all for super duper cheap (like, under $10), this is definitely the place to go. The buffet price is so cheap, you don't feel like you're draining your wallet when you toss a few bucks into the sushi maker guy's tip jar, which you should definitely do. He's great, and he makes a nice selection of sushi, which is always fresh. Anyway yeah, if you wanna gorge yourself like a tick for only a fistful of dollars, definitely check this place out."}
{"text":"This was our first and LAST visit to this restaurant. It just completely grossed me out and the very little food that was available was old. I'd rather spend my $30 at Lin's buffet on the other side of baseline and the 10."}
{"text":"Which I could give this place no stars because this is disgusting. I found some kind of bee looking bug cooked in with the orange chicken. I'd recommend anyone checking out this place should completely avoid at all costs unless you want to consume bugs cooked inside. Everyone in my family left the place with stomach aches.."}
{"text":"went there today with Rand H. for there lunch buffet. Well the place is a little worn down but the 100 or so trays of food were all in good shape.I started with hot and sour soup which was good .Then it was on to the main dishes , fried stuffed shrimp ,crispy chicken wings ,deep fried battered veggies , fried fish , spicy french frys all of which were above par. Then i was off to get some dessert and they had a lot for a Chinese buffet. I had fresh strawberries , canned sliced peaches , manderin oranges , yummy cakes , good chinese donuts not crunchy on the bottom. Eight types of hard ice cream. So yay I am a fan and will return , these other one star reviews must have eaten somewhere else because the food i had at China Town Buffet was all good."}
{"text":"Some of the waiters don't even know what they have here. Asked for a drink before I sat down at the table. And the waiter come back with a different drink then what I asked for. Then the waiter disappeared after giving me my drink. They have good food but the service isn't that good at all."}
{"text":"Don't bother spending your money here!  We were visiting from Cali and came to try this place cause it was affordable for a family of 5.  The food was stale and the fish looked old.  My husband ate a rainbow roll and the celery was mushy.  The steam table was dirty and they didn't refill any of the food.  My family only ate one plate with very little on each plate - cause there was barely anything left.  We told the manager and she was rude - she just walked away and didn't care about our concern.  She obviously doesn't care about customer service nor the quality of the food.  If you want Chinese try another place cause this is not worth the money or time!!!"}
{"text":"Horrible Chinese buffet place. Dirty. Food is terrible no taste. Don't waste your time or money at this place. Dirty plates everywhere service Waiters not doing anything but on their cell phones during lunch time I'm. If I could read it less than once too aren't I would"}
{"text":"Goid food with nice flavor. They had crab legs and i got my fill! I really liked all the selections but was a little bummed that they did not have sushi. All is all it was a nice meal and was full of flavor"}
{"text":"One of my most favorite chinese food, the prices are super cheap and all the food has good flavor, i have never had food posioning, they also have coupons in the mail for a $1.00 off. They have blue bell ice cream and its relatively clean."}
{"text":"The food was ok. The food was NOT hot but luke warm to cold. The server got one of our drinks wrong and barely any ice in my ice tea. The sushi was tasteless and so was the deserts. Wasn't sure what the breaded shrimp was. There was a shrimp tail but when I bit into it was tasted like chicken. This place needs redecorating since the wallpaper is peeling off the walls. Someone seriously need to clean those two aquariums. Can't even see the fish."}
{"text":"I've been coming here for several years and the owners are very friendly.  Overall the food is good and they have oysters, crab legs, mussels and over seafood every evening.  Prices aren't bad either.... around $7.99 for lunch and $9.99 for dinner..it's a pretty good deal.  They also have a bonus card that entitles you to a free meal after 10 visits.   My only negative is I wish they would clean a little quicker.  I know this is not their fault because I've seen some of the gross families that come and literally when they leave there is food on the chairs, wall, table and floor...personally I'd kick these pigs out but I'm sure they'd complain and call it discrimination.  I think the staff tries their best to keep up but it still shows.  Overall a good place to eat a budget friendly meal."}
{"text":"Place has no pride of ownership. Ripped seats, sticky floors, food has little to no flavor. I could barely see out the window since it didn't looked cleaned for years.   Do I want to sit in a ripped seat? Am I that desperate for your food? NO.  These guys have no clue. Doubt they will stay in business much longer. I would chose eating on a park picnic table than eat in this location ever again.  Nice job guys!"}
{"text":"Worst experience ever. Came here tonight with my wife (25.00 for both of us) pace was a disaster. The guy sat is at a dirty table that was sticky and still had food crumbs. Then he brings us 1 plastic spoon and 1 plastic fork... wtf? Lol. I don't even need to explain that one. Food was old, coconut shrimp was hard and stale. The Orange chicken was actually dry like it was reheated, my wife had some muscles with the mayo and cheese and she spit it out and said it taste rotten. Then she had the steamed clams and bit into some gritty rocks Every time. There was no crab legs at all but he did not forget to keep his kids stocked with crab legs. His kids were on top of the tables, knocking the trash off the tables onto the floor and standing on a chair with his hand in the fish tank... will never be back."}
{"text":"How can I be a regular at this joint but only give it 3 stars?  Let me tell you.  Their prices are CHEAP. Their Chinese food is on point with a huge selection. The workers are very sweet. They prescooped the ice cream and organized them so it's very easy to grab and go. Plus, they have a pay-per-pound takeout option, so if you have a small appetite and don't want buffet but still want Chinese food,  you can still pile up whatever you want! (But you pay a little extra if you get seafood items, so be smart about this.) Their dessert options are so-so.  However. The bathrooms are GROSS. The place isn't the nicest looking. Kinda grimy overall. Hence the three stars.  Don't get me wrong, I still frequent this place often. I'm not really deterred by how shabby the venue looks, as long as the food is good and cheap.  If you want a nicer looking and cleaner (but pricier) Chinese buffet, check out Hong Kong Gourmet. Of course, if you DGAF and only care about the food and cost, DEFINITELY GO HERE.  Haven't tried their hotpot all-you-can-eat yet though, but I plan to."}
{"text":"this place is disgusting. it smells and most importantly the food is an art of destruction. this place should be out of business and placed in a historical shitty food exhibition."}
{"text":"I don't even want to give one Star !!  My friends and I went there for hot pot last time,  we all had diarrhea after that! Services bad, restroom was so nasty!  I definitely won't be back even it's  free! ! Ps: they don't turn on the AC in this kind of weater!!"}
{"text":"First off let me say only a handful of Chinese Buffets have great food.  For the price, the value at China Town is very good.  More than anything on their menu I really enjoy the sushi.  The sushi is very good and all you can eat for 9 bucks with tip.  This is a great deal for sushi lovers and they have a good variety of sushi and they broke out a new tempura style today that was very yummy.  I would recommend this place for a business lunch with people you are not trying to impress but rather people you are very comfortable with as the decor is not the best.  The staff is very friendly and hospitable.  I would recommend this place any day."}
{"text":"We went to this place for the first time in a long time and I remember why we haven't. This was one of the dirtiest restaurants I've ever been to! The entire restaurant was gross and to top it what looked like the owners children were cutting green beans at one of the tables and picking their noses while doing it! We ate those beans! So disgusting. The owners did not seem to care and a few sat at a table and just talked the whole time and another one just stood over a booth that was dirty with plates the whole time we were there and never cleaned it up! Oh course, I feel sick now and am just praying I don't get food poisoning! Do not eat here!"}
{"text":"This place is decent for the price. I mean it's not a fantastic buffet because the restaurant was a little run down, but the sushi was decent , the food was delicious and hot. I know some of the reviews have been horrible, but I'm sure they were by food snobs who have never had to eat military food."}
{"text":"Omg pls dont eat here. Ever since i ate there ive had diarrhea all day long! Smh food wasnt all that. I barely finished my first plate."}
{"text":"Let's be honest when you go to a Chinese buffet you're not looking for stellar service or super ultra clean. You're looking for a great and wide selection of food and you get that here, the price is fair and the food is more than edible. The staff are friendly but I will say they need to get a window cleaner cause they're a little gross. But other than that it's great. They have sushi too:)"}
{"text":"Nasty!!! As soon as you open the door, you are hit w a filthy stench. Its dirty n humid inside. The orange chicken was gross, no flavor n very bland. They have something called lovers chicken, which I swear on my life that its something other than chicken. Honey chicken was just OK...don't waste ur $$ on this place, ur better off going to panda express..."}
{"text":"OMG!!  This is the dirtiest place I've been to outside a little kabob shack in Kabul, Afghanistan! They should rename this place Ptomaine Tavern!  Don't believe me?  Give this place a try and prepare yourself for a trip down the hershey highway!!"}
{"text":"I came in at 8 pm for dinner. They are open until 9:30 pm (or at least that's what their website and hours sign on the door says). There wasn't much selection of anything as everything was almost completely empty! The food was not re-stocked and I literally scraped bits from the bottom of all the food pans. Not only so, but even the ones that seemed to be \"fresher\" and more stocked were not fresh. Food here is not fresh and looks like microwaved leftovers. Quality and selection is two stars. Cleanliness of place could be better too. Too bad as it is literally a stone toss away from my house and I really wanted it to be at least ok for convenience sake. One and done!"}
{"text":"Had their buffet 2 years ago. Tables were greasy, floors were dirty. And I distinctly remember the discolored salmon that had the strangest texture.  I got food poisoning afterward, and haven't been back to see if things have improved. Unless their management has changed since then, I will not go back.  I would go to these other buffets over China Town Buffet anyday - Pacific Seafood Buffet in Chandler, Hong Kong Gourmet in Ahwatukee, and Crazy Buffet in Tempe."}
{"text":"Just seeing the dirty doors, made me wanna run...but I was hungry and late in the afternoon. hot, and lots of traffic, so went in, very cheap $. Sushi was at room temp, so thats a no below average food and dessert Dirty Drink spill marks by my table. the owner and friend or family member sat directly behind me, and spoke loudly in Oriental, for 10 mins, and for him to go over the blare of the nascar on the tv, you know he was loud... please do yourself a favor,... eat somewhere else"}
{"text":"Just went there today with some friends. I don't know if they changed managers/owners but I have a hard time understanding the bad reviews. It was quite busy for a saturday (don't know how food is during the week) but today at least the food was excellent and fresh. We tried a little of the buffet which seemed as good or better than most buffets I have seen in PHX. The Chinese hot pot was very good, felt like we were back in China. The place was well lit and service was a tad slow but we only saw one waitress so she was quite busy, overall she did a good job. The place isn't sparkling clean so I can see where some people might be a bit nervous but the food looked fresh and well done. I can't wait to go back and try the hot pot again."}
{"text":"I have been here on two different occasions, I was not impressed either time.  Almost didn't go back the second time, but thought I would give them a second chance.  Place was dirty both times, food was OK, no came to my table and didn't know that if I wanted a drink, it was serve yourself.  Maybe it wasn't serve yourself, but others did and there was no one around to stop them.  Will not be going back."}
{"text":"In college, China Town Buffet was my number one choice whenever I wanted to eat crab legs. I'm not going to drive all the way to a casino for their dinner buffet and I don't want to spend a fortune at a restaurant.  The food at the buffet is not that great, but it's cheap. Dinner is around $10 and it includes a drink. The buffet has crab legs, but it's served every 30 minutes. That's fine with me, I'm willing to wait.  The service here is very attentive. I came here with a friend once and we just ate and talked for two hours. Nobody kicked us out and our waiter never gave up on us! Another time, the buffet stopped serving mussels around 8 pm. So I asked the owner if she can ask the chefs to cook some for us. Fifteen minutes later, she brought us a plate of 8 mussels. The waiters even refill your drinks here. (The drinks are from a self serve dispenser).  Am I being too emotional? Eh, I don't care! This buffet and its staff will always have a special place in my heart."}
{"text":"I can't imagine the reviewer below me ate at the same restaurant as me. I went with a friend for lunch yesterdayarount 1pm - we'd been a while ago and it was pretty good. It appears the restaurant is under new management - there were a lot of changes such as fried potatoes, pizza and  and they've done away with the soft serve ice cream, which is too bad. We had a very bad experience. The food was lukewarm, including some salmon my friend tried, potstickers, egg rolls, and other dishes. We got scared tried to find something that was edible. I got a bowl of hot and sour soup; luckily I smelled it first, thinking it would smell like vinegar, which I love. It smelled like chemicals. Bad chemicals. My friend said she thought it was BLEACH! Thankfully, I didn't eat it. There was also \"beef\" with snow peas that was lighter than pork, almost chicken-white. WTF? How do you get WHITE BEEF? Other dishes, even the chicken, were chewy, greasy and fatty.   We agreed the onlt edible food items were the white rice and the banana pudding. Oh yeah, and we saw a cook come out to replenish the desserts -- with no hair net or gloves. He set the items out with his bare hands. Dear Lord.   Anyone who has a bad experience or got sick from eating there, like I did, can register a complaint with the AZ Dept of Health website. It takes a minute but I did it to save anyone else from getting ill from poorly handled, poor quality, incorrectly heated food. Maybe someone can do something to save their poor Koi fish, who have to live in a disgusting, green-algaed tank. SO SAD!"}
{"text":"This is by far the worst Chinese buffet/place that sells food that I have ever eaten in my whole life.  It does not even deserve the one star.   I went there one day hungry with a friend and wanted to try this place out. I don't know why they are still open there was like a few other people. The food was VERY greasy, they didn't regularily change the food on the buffet and some of the food had turned cold. The place was mess. I literally took 2 bites and paid and left.   I'll never go there again even if you paid me. Save yourself the money and go somewhere else."}
{"text":"Food was cold, it was bland and I would never go here again. The only thing that tasted good was the sprite I drank"}
{"text":"This has to be one of the worst places I've ever eaten a dinner at. Filthy and not worth the drivearound the block."}
{"text":"Mediocre food, you could do worse I suppose. Most of it is standard Chinese buffet stuff, nothing really stood out as more than generic Chinese gut filler"}
{"text":"This is a fair value- actually very fair. For $9.99 on a week night, adults can choose from about 30 hot items, and around15 cold, plus a selection of maybe 8-10 sushis.  I'm a seafood fan, so I love that on a Tuesday night they had steamed Snow Crab legs, chilled oysters, shrimp, and mussels, shrimp ceviche, and steamed clams. These items are normally reserved for the weekend-premium prices- I was pleasantly surprised.  I dined with a five year old, and he enjoyed it as well. Lots of fresh fruit, green beans, and of course, for the little ones, white rice and teriyaki chicken.  For dessert, I saw the standard sweet peanuts and elephant ear cookies, but what stood out to me was the ice cream. Most buffets now have ice cream that's usually in a slide top merchandizer with that questionable scooper. Not here! They have eight flavors to choose from, and when you slide open the little door, you see prepacked and sealed scoops of the various flavors. What a nice surprise. No scooper of doom here!  They proudly serve Coca Cola products and that is included in your bill.   Are some of the items a little less than flavorful? Sure. But for the price, convenience, and selection, I'd be hard pressed to find a better deal.  Will probably return again. Not a bad experience at all."}
{"text":"Buffet bad! Only go if you want hot pot. I got the buffet but the people that we went with had the hot pot. It looked like a lot of fun."}
{"text":"I wasn't quite sure what to make of this place...The food was fine, but it was the people...THE PEOPLE!  As a girl gamer who keeps her inner geek firmly behind closed doors (until now!), I didn't know what to make of the table full of guys were dining there prior to their WoW (World of Warcraft) raid.  \"Hurry up, man. We have to leave. Raid starts in forty five mins.\" \"Chill, dude. We're only around the corner from the house.\" \"My internet and wifi connection might have to be re-booted.\" \"My hunter needs blah blah blah...\"  I tuned out and decided to focus on my food and surroundings.   The restaurant itself is a bit rundown, but the tables and chairs were clean, even if the napkin dispenser on the table wasn't. I didn't feel itchy like I have in some places. So I was quite all right with the cleanliness. I did have issues with people not having \"buffet etiquette\" - using the same plate to go back to the buffet line, picking with their fingers to get at food when there are tongs there, using a spoon in the tray to not only get the food from that specific tray, but to reach and get the stuff next to it because you're too lazy to put the spoon down and use the properly allocated one? boo to you! I think it just came from living in Vegas and hitting the buffets with family and friends when they'd roll into town - Vegas was pretty strict and they had no qualms in telling you to get a fresh plate and to not cross contaminate the utensils. Anyway, I digres...  It's rare to eat at a Chinese buffet that isn't greasy...and this wasn't greasy. The selection was pretty big and the fruit was so good! I was really taken by surprise by this whole place - food was fresh and actually good! They didn't use MSG and they didn't douse everything with soy sauce and salt.  But...  I was enjoying my food until...a biiiiig girl in a tiiiiiiny denim miniskirt with the words \"Delicious\" embroidered on the back part of her butt bent over and...much to my horror and chagrin, showed me a cat I did not care to see. It looked so ANGRY!  My eyes welled up with tears and my friend thought I was choking until she followed my line of sight. \"OH DEAR GOD!!!!\" was all she could say. Even the gamers were rendered speechless. It was a total bonding moment between our two tables.  What has been seen cannot be unseen.  Oh dear God indeed.  Indeed."}
{"text":"Have no idea why my dad picked this place for his bday.  His bday, his choice.    There are many many things to choose from:  cold foods, hot foods, sushi, pizza, soups, ice cream, etc.  So everyone has something to eat.    Some of the items were sitting awhile, so it was dry (usual in a buffet).  They did replaced high moving items pretty quickly.  The tables and napkin holders were a little gross (sticky and clearly not have been cleaned in a long time).  We sat by the raw food selection (I guess they have another type of buffet - cook it yourself), and it was covered by huge sheets of white boards and the boards did not fit to cover all the foods.  I can see some of it was raw seafood, not too good.  The server was kind of rude or a language barrier.  She asked for our drinks but when we ask what kind of drinks they offer she didn't say, she asked again what do you want to drink."}
{"text":"I only gave it one star because I don't know how to put no stars, this place is perfect if you want food poisoning and possibly get a roach in your food there's not a lot to choose from and most of the food is greasy and tasteless you will get the runs badly after eating here so by all means stop by and ruin your stomach with tasteless greasy food. The waiter never picked up our food or gave us refills so you can guess how much his tip was. Never come here this place is like the white walkers attacking the wildling's village towards the end of season 5 of game of thrones the food is the white walkers the village is your asshole."}
{"text":"Where is Robert Irvine? Seriously! I should have looked at Yelp before coming through the door, 2 1/2 stars, and that's being kind. Lay me twll you about our experience...We walked to this unnecessary foyer and unsure which door to enter, follow the walkway to the cash wrap, only to be greeted by a super unfriendly woman, wouldn't kill you to smile when your customers are being nice (3 sets of customers, not a smile). Aside from grouchy greeter taking your money,  they also sell cheap plastic earrings at the counter...totally tacky! This place is absolutely filthy! The floors had old food, the tables needs bussed and when I was looking around the chandeliers were super dusty and dirty.. the ceiling was also dusty and darkened. There's broken neons. This was my impression before we even sat down to eat.  I got a bowl of egg flower soup, my favorite however the soup was Luke warm. Doesn't this need to a certain temperature to kill bacteria? So I gave up on that. I made myself a little salad, warm wilted sad salad...no thanks. I walked around and waned to be hopeful because I love Chinese food. I was a little weary of the sushi rolls sitting out, no idea how long they've been sitting there. I loaded my plate with rice, noodles, a spring roll, chicken and broccoli and ragoons. The spring rolls had no flavor,  rice was edible, noodles were super salty, but the chicken and broccoli was disgusting (never have I used this word in a review), the chicken was not throughly cooked, had a slimy texture, and room temperature from sitting out...yet theta heat lamps which aren't helping their cause. I had no choice to spit it into a napkin, I felt nauseated a few hours later.   The buffet if $9.99, save your cash and eat PBJ! If the owners actually gave a shit, this wouldn't be happening and clearly I'm not the only one."}
{"text":"Food: There are three main stations: Hotpot, Sushi, and the common buffet station. The hotpot is good, although I wish they would rinse and clean the frozen meats that came from boxes. There isn't a variety of sushi at the bar, but good amount to satisfy your cravings. The buffet station does not have much to choose from, but again, enough to satisfy your craving for Chinese foods.  Service: The waiter was very hard-working, although he didn't get us the drinks until we went to get it ourselves. He was the only good server we saw.   We specifically came here for the Hotpot."}
{"text":"Wow...  I cannot believe the number of times I drove by without noticing this restaurant in the strip mall.  Today, I noticed.  In reading the reviews for China Town Buffet after my visit, I must echo the sentiment that I took a risk and lost.  First strike came on my arrival at 3:30 PM.  The menu lists prices by age and time.  Though the restaurant does not close between 3:30 and 4 PM,  there is no price listed for this time.  The register person asked me for $11.49 when I stepped up.  I pointed out the menu and my watch, that the time was 3:30 PM and there was no consideration for 3:30-4 PM.  He advised that because the dinner menu was far superior to the lunch menu, and they had already started to change from lunch to dinner menu, my charge would reflect the dinner menu price.  I asked for a menu, to compare the difference between lunch and dinner; the register person replied that as it was a buffet, no menus were available.  Pursuing the topic, I asked how to know the dinner menu was superior to the lunch menu.  Register dude replied that everything on the buffet would be replaced fresh...that was one major benefit.  He could not name any item differences, only that the whole thing would be fresh again at 4 PM.  The restaurant is a bit worn down...tho no springs are showing through the upholstery.  I figured since I was at changeover time between lunch and dinner, and had been advised that the dinner menu was far superior to the lunch menu, I could wait until everything had been replaced (4 PM), so I enjoyed some water while I perused email and news and got caught up on all the electronic communication I could.   The table was wiped, though the salt and pepper shakers and napkin holder were a little sticky and apparently have not have been cleaned in a long time.   4 PM, when the dinner presentation should have been new, I went to the buffet, picked up a plate and made myself available to the offerings.  California roll looked OK, though old as the avocado had turned black.  Other offerings on the sushi tray were not quite so attractive; shrimp and fish starting to dry.  At the hot buffet, Lo Mein was new (I saw it loaded into the steam tray) and had a pool of grease in the bottom of the pan.  Some other items were full containers (not sure if new, but full), while others were obviously hangers on from the lunch setting, being half or more empty with dry contents.  Service guy would show up about every 5 minutes, stir stuff that was in less than full containers, pick up empty containers and put full containers into place.  I asked him when the dinner service would be ready.  He replied \"No English\".  I took my Lo Mein and California roll back to the table.    Heat for Lo Mein on arrival at the table was lukewarm.  Plenty of celery, plenty of soy (not fish) sauce, some cabbage and carrot, nothing noteworthy.  The California Roll...eeh...adequate view, poor preparation, strike two on the event.  There was mayonnaise in the rice, the carrot was shredded, not chopped, the avocado was black as it sat.  Wasabi was probably not fresh, certainly not hot.  On working through the California Roll and Lo Mein, I kept an eye on the hot bar, waiting for the 4 PM start (it's 4:15 PM at this point).  In my wait, I took the opportunity to go to the restroom.  While the dirt is not ground in, the bathroom should have been maintained sometime between opening and now, as the soap scum on and around the sink, the full trash container and the toilet paper on the floor do not inspire confidence in the running of the establishment.    Returning from the restroom, I saw that the General Tso chicken has been replaced, tho nothing else of interest.  Picking up a new plate, I went back through the line behind a husband, wife and 10-year old (my guess...he was over 4 ft tall).  Watching Mum and Dad work their way down the buffet was unremarkable.  Watching Junior using his fingers and fork to sample any item that looked interesting, including General Tso Chicken, so sorry...not gonna follow after for 'sampled' food.  I returned to the table...picked up my cellphone and promptly left the restaurant.  There was no way I could continue.  EWWWWWWWWWWWWWWWWWWWWW"}
{"text":"Ate here last night for the first time. Won't go back. Smelled fishy when we walked in and I assumed it was the seafood on the buffet...as we left I realized the smell was the fish tanks that looked far overdue for a cleaning. The walls on the booths were dirty with food and grease as were the siracha and soy sauce bottles on the tables. All desserts I tried were dried out as though they had been on the buffet all day. The rest of the food was average. I tried the sushi and regretted it immediately. I was thankful I didn't get sick. You would be better off going to Panda Express."}
{"text":"I've been looking for a good Chinese buffet and decided to try this place.  I was slightly disappointed.  Not a huge selection of food to choose from.  Just the standard buffet fare.  Food was just ok.  Our waiter was very loud screaming across the restaurant at the other employees who would yell back.  Then he would never refill our drinks or clear our plates.  We had to get up and get our own refils.  Not a huge deal since it is a buffet, but still...  If I am in the area and really wanted Chinese I may stop in again, but do not make a special trip for this place."}
{"text":"Decided to give it a try because me and my husband were in the mood for Chinese food. When we walked in the lady was rude at the front desk. After I paid I asked for a high chair for my 9 month old and she ignored me and didnt even seat us. I found the chairs then some guy came to help me and sat us at a sticky dirty table. No one refilled our drinks or cleared our table the whole time we were there. It was just dirty and felt bad for the fish in the dirty water tank!"}
{"text":"Can get iffy but I always go back. Be wary of food allergens and smelly sushi. Most sushi is good to go but I've have one when the meat was too old, or not held cold enough."}
{"text":"i was impressed the first time i stumbled into china town buffet. decent price good selection, sushi bar.       this is one of my favorite places to eat. i go all the time."}
{"text":"I'm going to start by saying this is a buffet, not 5 star dining. So its good food for being a buffet. I didn't run across anything badly seasoned or cooked badly, everything was pretty good. The service was alright, it took a while for the plates to be taken from our table. Interior is a little dated, but it's not turn off. I will be back"}
{"text":"WARNING! CHOKING HAZARD!!!  Staffing here is really nice! But but there are no food left any where when we got in here. We really was FORCE TO EAT LEFT OVER!!! Really bad food supper expensive to get in will not recommend for anyone want a nice meal after dinner my girlfriend and I spend $10.99 for LEFT OVER!!! I Was very pissed because we were left with a couple piece of meat and dessert.... some of the dessert are not pilled it a disappointment. I PERSONALLY DO NOT RECOMMEND THIS TO ANYONE!!! Don't believe me try it out for yourself and spend those money for nothing ..."}
{"text":"This place made me sick to my stomach. The place was so dirty. The food tasted old I had to actually spit it out. Such a wast of money. I wished I went to the Chinese food down the street but I saw that' they had crab legs so wanted to try it. I had to ask 3 times when they were going to bring them out. Finally brought a little plate of them out and for some reason a lot of the legs had no meat. Think it's bad to advertise they serve them but won't put them out unless you harass them about it. To top it all off before leaving there was a big black spider on our table. I hate spiders. I was sick to my stomach for hours after eating here and couldnt stop thinking about how I literally probably just consumed rotten food. I don't even want to think about the bugs. This place really should be shut down it's a health hazard."}
{"text":"I can only do 3 stars for China Town Buffet. While i enjoy many of there dishes, I've had too many experiences with them not keeping there dishes replaced as they get low or emptied. So if you don't fill up your plate on your initial trip through the food lines, you might not get refills on anything you like. That, is my number one complaint.  I agree with many of the other posts that they need to work on keeping their presentations more clean. The fish tank should go. It's not kept up often enough, and just looks bad.   Another thing, let me pick my own napkins. I don't know about you all, but I really don't like my napkins tossed in a stack on the table corner. They look like napkins the previous customer didn't use and they got left on the table. Yuck!   But like I said, I'll give em' 3 stars with very little work, they be at 4 stars. Long way to go to get to five."}
{"text":"DISGUSTING!!! I can't even believe there are actually people who have given this place more then one star. I would give it zero stars if I could.  My boyfriend and I decided to try it. Whenever we have chinese we always go to Hong Kong Gourmet Buffet in Ahwatukee because its very good! Arizona is a hard place to find decent chinese food but we decided to take a risk and we lost!  After paying, we were seated and the table was filthy. There was actually food splattered on the short wall that divded the booths. We went to find plates and there were none. We stood around for about 5 or 7 minutes until someone brought a few out. After walking around I could only find 3 or 4 things that looked decently edible. There really wasn't much to choose from and I was distracted by the dirty floors, walls, and food stations, that I couldn't really think about anything else. When we sat to eat I took one bite and nearly spit my food out. It was absolutely rancid! I washed my mouth out with my soda and watched my boyfriend make faces at his plate while pushing his food around with his fork.  I glanced down and there was a thick black hair laying across the table. I'd had enough! We got up and demanded our money back. They tried to say we ate everyhing on our plates and I had to explain that our plates were not full because we didn't fill our plates up to begin with! Then they tried to keep the money for the sodas. I pointed out that they were full glasses of soda sitting there and I want ALL my money back. After telling the lady I wasn't leaving without my money, I finally got my full amount back. We left and went to Chompies in Chandler for some delicious food in a clean atmosphere.  If you want some pretty good chinese that's buffet style, try Hong Kong Gourmet Buffet in Ahwatukee. It's off of Chandler Blvd just east of 48th Street.  Seriously this place has tons to choose from, its tasty, has great service, and very clean. This is where we always go and where we should have gone that night."}
{"text":"I wish I could rate this place higher, but I just cannot justify it. The food was ok. Nothing great or special. However, the condition of the place is my issue. There was food all over the floor, the common area was uncleaned, and the restrooms were dirty and dark. There were a few good dishes, but the distractions from the place being dirty ruined it for me. There were way too many kids running, literally, back and forth. The waitress only came by to check on us one time, ad that was only because I raised my hand signaling for her. It wasn't the worst I have seen, but I will not be going back anytime soon."}
{"text":"This is the worst Chinese food I've ever had.  I repeat, the WORST EVER.  Anyone who writes otherwise must be a shill.  I knew it was not going to be up to par when I spotted all the Mexicans in the joint. Now, this is not saying anything against them, more so about whoever runs the kitchen.  They probably figured they didn't need to be up to snuff because they could get away with it which is a damn shame.  I hope all these people eat elsewhere and experience some decent Chinese food because this place ain't representing.  The food was oily and flavorless and the selections were limited and mostly breaded.  I've never been to a buffet that didn't have my favorite which is roasted chicken or duck.  I usually eat that and only that by the plateful.  Instead, I was stuck with dry tilapia and flavorless salmon.  The terriyaki chicken was nothing but dark meat and the sweet and sour chicken was absolutely horrid!  How can anyone f up such a standard dish?  It tasted as if it had been sauteed in ketchup!  I could even taste a hint of flour which leads me to believe it was undercooked.  And the sushi?  Forget it.  Horrid, horrid.  As for the dessert section, the chocolate cake looked exactly like the one you buy at KFC.  I imagine it probably tasted full of chemicals, too.    Everyone at my table was disgusted and we all agreed that we should have driven the extra mile to go to a better rated buffet.  We also concurred that the aquarium by the door (which contained numerous blood parrot cichlids and turtles) was an exercise in cruelty.  Thrown together into an inappropriately sized tank, the cichlids were relentlessly butting heads with the turtles who tried in vain to escape but had nowhere to go.  I hope they weren't part of the buffet."}
{"text":"EDIT: I quite like their Crab won-tons and their baked crab with cheese. Their egg drop soup is 1000 times better than Panda's (way back in the day). Also, tried the egg rolls and they're pretty good. But seriously, the strawberry ice cream is the best strawberry ice cream. Ever. (that being said, you'd better leave me some)    Pretty good food and selection, kind staff, and nice atmosphere. Used to be busy in here on behalf of the Sunday crowd. Here are some of our favorites:   Green beans- awesome garlic seasoning  Potstickers- nice! The sauce does compliment Shrimp seafood delight mix  Teriyaki chicken   Overall, usually a good experience here. Have never gotten sick from anything, and they also sell cute trinkets at the register. They sometimes have green tea ice cream here as well- one of my faves."}
{"text":"I'm starting to get kind of burnt out on the Asian buffets around town, but if I'm going to go to one, this is my pick.  The facility is a bit worn down, but the selection is incredible and it's a great bang for your buck if you're hungry or watching your budget.  You know that restaurant that serves ONE plate of fried shrimp and french fries for $11.99?  Pay less than that here for lunch and get bottomless shrimp and fries plus anything else you want, as much as you want.  From Pizza slices to sushi, it's all here.   Yes, it's greasy, but you'll leave full.  Do it.  You know you want to. . ."}
{"text":"For the most part, this restaurant is good. Sushi is great and I love the shrimp. Food sometimes runs out but it gets replaced eventually. Would visit at least to try it."}
{"text":"Calling this greasy, gelatinous garbage Chinese food is an insult to China. Their soups are corn starch with no flavor. Their fried chichen dishes are 90% batter. Their noodles resemble cheap spaghetti and their fried rice is flavorless and dry. Avoid"}
{"text":"Right off this place isn't anything memorable but is your typical Chinese over priced buffet down the street.   As my uncle said \"this place reminds me of my childhood. But wasn't as overpriced.\"  There is no real caffeine free drinks, fake lobster and crab legs, and the sushi was A-ok.   Highlight of the night was being patronized by evangelists.   Wouldn't come back And the front desk lady lacked customer service.    Adults 11$ Kids 6.50$"}
{"text":"Found this restaurant on google yellow pages... when we got there, the front enterance was filled with loitering 'illegas'. Then we went to the cashier to prepay for the meal, and the cashier was RUDE, we said \"thank you\" and she said NOTHING. We went to get our drinks, and then here comes the server, who barely spoke english, saying \"No, not you, ME!\", meaning he was supposed to get our drinks for us, then seat us... well how were we supposed to know that when the RUDE cashier said nothing to us, so we assumed we sat ourselves and got our own drinks? So we get to the booth, he gets our drinks, and we realize the WHOLE place is filled with nothing but 'illegals'. We went to the buffet, got our plates, and the food was pretty good. Then on our 2nd trip to the buffet, here comes a guy taking his DIRTY, USED plate AND fork to the buffet with him to get more food! Disgusting! Then he proceeds to fill his plate and starts EATING WHATS ON HIS PLATE right in front of the buffet line, taking his sweet time tasting what he just put on his plate, and even PICKS AT THE FRENCH FRIES WITH HIS FINGERS! and eats them while in line also! SICK! We wanted to cpmplain but we knew no one spoke english who worked there, so it would be pointles... I am never going back there and recommend to anyone else: DO NOT EAT THERE!"}
{"text":"The food tasted quite delicious (surprisingly!). The main issue is that they don't keep the trays stocked with food. ... to the point where you feel guilty if you take the last pieces..."}
{"text":"A decent and affordable Chinese buffet.  Come on people, stop complaining!"}
{"text":"My experiance here was.... ok.  The only reason it is rated 3 stars was the outstanding service, and selection of food.  The food is good, and they have a great selection of seafood availalbe.  My only issue was that the food was luke-warm to say the least.  The price was great and included drink ($9.99 adult) with their online coupon it made it even better.  Food: 3 stars Service: 5 stars Overall: 4  If the food was at least hot, i would have rated higher.  overall, great experiance, loved the fact they were playing Monday Night Football! :)"}
{"text":"I gotta give these guys credit....the food is pretty decent and mostly fresh and you even get sushi options and a drink for $8.99 - the people are polite and family-run. The atmosphere is run-down and doesn't have great appeal, but I don't go places to critique decor, I just wan a quality product and fair pricing. If you just want casual and aren't trying to impress anyone and are starving for a buffet, give it a whirl! The chicken on a stick is delicious ;)"}
{"text":"This place was discusting. It was filthy dirty. The walls had finger prints all over them the floor had old food on it, the ceiling was falling down and even the fish tank had food finger prints all over it.. I told the lady I had a coupon and she yelled at me to pay later. She proceeded to watch my husband and I eat the hike time. Maybe instead of watching us eat grab a rag and start wiping down everything. So so so gross."}
{"text":"Absolutely awful! Do not go to this place. Buffet had absolutely nothing in it. Lady came around and asked what I wanted. Only to wait for 45 minutes and the only thing that comes out is orange chicken. Guess that's all I will have then. Over priced if the only thing your going to let me eat is orange chicken. Restaurant is absolutely filthy. Fish tank looks like the last time it had been cleaned was when bush was still in office. If you have $10 and are hungry don't go to this place."}
{"text":"We had a coupon and time to kill or we never would have found the place.    Pretty decent selection of stuff.  Nothing amazing, but nothing too bad.  They had some sushi, some dim sum items, your standard entrees in chicken and/or beef and of course the standard Salad/jello/pudding options that all buffets will have.   They had a decent desert selection, though some of the flavor combos were weird.  There were these maraschino cherry/dark chocolate brownies with sprinkles that tasted mighty funky.  But a great coffee and chocolate mouse cake that was kinda interesting.    On Friday and Saturday nights they also have crab legs so I'm sure I'll be there again with my crab loving girlfriend.  For $8.99 including drinks on a seafood night, it's not too bad I suppose.    Not a place worth driving across town for, but a decent neighborhood spot for sure."}
{"text":"I am Chinese and have eaten buffet here many times over the years.  I go with a MeetUp group and sit at one of the back tables with 12-18 people.    Food 3.5 stars Value for dollar paid 5 stars Service 2 stars (1 star is rude or non-existent service)  I am a picky and discriminating Foodie, so I can't believe I keep coming back to China Town buffet and have even hosted MeetUp dining here myself, cos I think this is the lowest rated place I keep coming back to, once or twice a year.    The main reason why I come back is because you tell me where you can get All-You-Can-Eat oysters on half shell, blue crabs (snow crabs too small, not worth eating), shrimp cooked 5 different ways, various kinds of fish, crawdads, clams, mussels, beef ribs, and many other items, for the price I pay, which is $10.71 including drink and tax, for senior price (10% off regular price), and that price is $1 more because it is the weekend price.  Weekday price is only $9.99 for adult dinner buffet. The lady at the cash register told me and the other organizer that they loose money when we eat there, because we eat all the expensive stuff and sit there too long.  They are real slow in replenishing the crab bins.  I gotta wait a long time.  30 min, maybe.  Then I missed out if I am not standing there, it is all gone again.  So that is one reason why I gotta stay there for 4.5 hours to eat !      For an additional $5 more, you can have all manner of squid, frog legs, conch, shaved beef and lamb for your hot pot, in addition to the regular buffet.  Some of us eat only the lamb, but I no longer pay the additional $5 for the hot pot, because I am more than satisfied with the food in the buffet.  I only eat about 5 items in all the buffet.  The fried blue crab half bodies, the Szechuan Fish (see photo of both, my 2 favorite things in the buffet), sauteed spinach for the veggie, clams which I soak in the Szechuan Fish liquid I put in a bowl, and their egg custard which is really good, I can eat bowls and bowls of the fish and egg custard.    The snow crab legs are so tiny, and they boiled the flavor all out, and leached out into the hot water.  Not worth eating.  You get more crab meat out of the fried blue crab half bodies.  Easier to eat, too.    The service is always very lacking, some days worse than others.  Sometimes, the waiters NEVER come to remove our dirty dishes and they piled up 1 foot high.   When we are buried in dirty dishes, we have to clear our tables ourselves, by putting the stack of dishes on other vacant tables just to get them out of the way.  I have to fill my drink cup myself, too.    Then one time the rubber backed carpet mat , next to the hot pot buffet, had a big mountain in it that people could trip on.  I told the waiters soooo many times someone could trip, but they didn't care, like \"what's wrong?\"  It was not corrected.  They didn't see to understand English or be able to \"see\" that things were not right with the carpet, and it needed to be pulled down.  They didn't \"get it\".  Every time I go there, I find food particles stuck on the \"clean\" bowls and plates, but the staff told me \"it is sterilized in the dishwasher\", and it is probably so, so I just brush the food particles off.    The restrooms are messy, and today when I went to ladies room, there was granular salt or sugar dumped in several places around the sinks (see photos), paper towels and toilet paper all over the floor in every stall.  One man in my party told me that there was no toilet paper in the men's room, and he had to use the paper towels as toilet paper, but he said it wasn't as bad as the photos I showed him in the ladies restroom.    You know how they say, if you wanna get a picture of how they keep the kitchen, look in the restrooms.    But I go back when someone posts \"we are going to China Town Buffet for hot pot\", and eat the buffet, cos I like the certain foods that I go there to load up on, and no place can beat the value, only $10.71 including drink.  And I don't know any place that has AYCE hot pot for $16 INCLUDING all the entire buffet and drink.  I can't understand the reviews that call this place \"super expensive\"."}
{"text":"At first sight not a place I would stop and eat at, but there are two sides of this restaurant.    The Hot Pot side and the Buffet.   The buffet side is okay to shady with the usual items and nothing to write home about.  The Hot Pot all you can eat is actually pretty good and enjoyed the mix of items available.  Would recommend the meat balls, egg noodles, shrimp, imitation crab, mushrooms in the non spicy soup broth.   Everyone has their favorite combinations so to each their own and be creative."}
{"text":"China Town Buffet may just be worth going out of your way for.  I've been there 5 times in the past year and if your a fan of shrimp-centric buffet items, this is your buffet hot spot.  Their Jalapeno Shrimp and Shrimp Delight dishes are two of my favorites, along with their Peppered Pork with Onions.  I have not had a bland or bad tasting Chinese dish their and that's what makes me return.  Now their sushi?  Skip it.  It's not their strong suit, so I don't hold it against them (Crazy Buffet down the street does sushi pretty well).  For desert, try their 6 flavors of Dreyer's Ice Cream.  It's well priced at around $9 on the weekends and includes a drink.  **Tip**  Pay attention to your junk mail.  I've received several mailers that include discounted coupons to China Town Buffet.  Why not save a buck or two?"}
