{"text":"When ever we feel like eating Chinese food, we enjoy eating at this location, we get great services, and the food is tasty."}
{"text":"I'm not too keen on Chinese food buffets even though I LOVE Chinese food. I gave three stars only because I ate two things... the lo mein and pot sickers. Those two items were decent enough... I had very low expectations so I was happy that these items were good. The bathroom was disgusting though."}
{"text":"Unfortunately, the food is less tasty than average Chinese food. Second, right as we were escorted to our table there was a long hair stuck to the table and the host said they forgot to clean the table! Third, my husband found a hair in his broccoli and the waitress said \" don't worry it's just a eyelash!\" WTF!!! Then she called the manager and they were arguing with us making a huge scene and all we tried to do was alert them so they are aware! The next time I decide to eat buffet, I will travel all the way to 75th Ave & Mcdowell.  Good luck whoever wants to be humiliated and not satisfied after they eat!"}
{"text":"We've eaten here on many occasions and have always had a good meal.  The variety is good and the food is fresh.  We eat primarily around lunch and there is always a good crowd and turnover of food in the buffet.  The wait staff is also very friendly and attentive.  We've eaten at many chinese buffets in the area and this is one of the nicer and consistent ones."}
{"text":"The food did not have much flavor, it was definitely left out for a few hours.....would not recommend at all....save your money folks"}
{"text":"I usually frequent this restaurant a lot.  It's usually good to alright but I just had a bad experience this time.  First, they cater to the old farts that come into town.  I mean, their food is catered to the Snowbirds which is crab legs, shrimp, not too much in other food choices.  I am usually ok with that but this time it was sub par.  They didn't have wontons in the Wonton Soup when we asked they took 10 minutes to put some out.  The peel and eat shrimp were black on the edges like they overcooked them.  My husband usually gets Sweet and Sour Chicken.  They didn't have that.  Oh yes!  He had butter shrimp and got sick!  When we complained to the waitress or whatever you are going to call her since it was a buffet, she started laughing at me.  I didn't want my meal for free, but I wanted to tell her to get the manager over, but she didn't get the hint.    Don't get me wrong, this might have been a bad night because I've been there several times and the food was excellent.  It was a crowded Friday night, but for the 2 of us, it cost $26.00 for crap!  I might never go there again!  See ya China City!  Stop Catering to the old farts that come into town for a couple of months and start catering to your real customers that come all year round!"}
{"text":"It was small enough inside the buffet was great! The had crab legs, seaweed salad AWSOME loved it! However they were a little on the pricey side but good was delish , the crab legs however were not coming out fast enough people were standing around the buffet food waiting to get the crab legs. One more thin love the egg drop soup just wish there were enough clean bowls thy ran out of bowls. I would go back just when it's not as crowded."}
{"text":"We went there last nite, 3/7/13, the time was approx 630 and there were lots of cars so thought we would try it.  We were seated promptly but that is where the service stopped. As we entered, there was a young lady talking on her phone while sweeping the floor. I thought this unusual.  We were instructed to help ourselves. I went a checked out the selection and all of the food appeared to be stale and old.  I asked the fry cook if he could make beef and pea pods with beef sauce and he didn't understand a word I said. So I followed the instruction and informed him teriaki sauce and when he was done it was just beef, pea pods and no sauce of any kind.  I tried the sweet and sour shrimp and the shrimp was tough and chewey. I then tried the fried rice and it was cold.  Meanwhile the girl was still on the phone and was just walking around. My friend had a variety of dishes and had the same experience.  Not once did a server come by and ask how it was or needing a refill on drinks. But the bill came and to my surprise it was astronomical for the quality of the food and service, the amount was $27.77.  I could have steak and potatoes for that price.  When I asked about the girl on the phone, which was approx 45 minutes after we entered, the hostess said it was the owners daughter . . makes sense."}
{"text":"First time here was a ok experience.  Tried the lunch buffet for $7.99 and kids are $3.99 drinks are extra.  Went straight to sushi bar and it was not special. We took all the spicy tuna and it took a long time before they made more.  There was no one at the sushi counter. A lot for snow birds type hardly any Asians other then workers. (You know what I mean)  They had the basic Chinese food stuff. What I like was the bacon wrap shrimp, orange chicken, sesame chicken and the spicy/ sour soup was actually good.  I will stick to my usual Asian buffet place.."}
{"text":"Smell terrible from the minute you walk in. Facilities are clean, but the food is terrible. Chicken, beef, and pork dishes are not hot. Plus the food has bland taste.  Egg rolls were cold and are lacking ingredients. I am not very picky when it comes to the restaurants I eat at; there is something I can generally find good to eat. But this was the worst food I have ever ate. I would save your money and eat at any other establishment in that area."}
{"text":"We haven't had too much luck with Chinese buffets in this area. Most offer the same bland dishes. Sooo happy to find this place! While it has familiar dishes like beef with broccoli and shui Mai pork, everything here has FLAVOR! My husband fell in love with the in shell crabcakes and I loved the sheer variety and the sushi bar. Everything is prepared in small batches and the staff is constantly restocking the food. If you are a seafood lover this place might be for you. Raw oysters, crab legs, even baby octopus salad. I'm not a huge shelfish fan so I can't tell you how it all was but alot of people seemed to enjoy it. $11.99 isnt too bad for such a big and tastey selection. Even cheaper duringthe week. We will deffinately be back the next time we are craving some fresh Chinese food!"}
{"text":"Food was excellent! The servers stayed up on keeping our drinks filled up! Only problem I have with this place is sometimes their food was mis labeled. It would say sesame chicken but it was Mongolian beef. So they could get better at this. Other then that, it's a must try Buffett!"}
{"text":"Stay away from this place.....We used to go here many times but the quality and selection has gone down.  The Sushi selection is a joke now.  For dinner you pay more and part of that if for the Sushi options.  Found out last night that they don't have Tuna any more even though most of the pictures show Tuna as part of the Sushi options.  They said they don't have tuna but are still charging more.....The fresh grilled options are not good anymore.  They keep the meat in the back so you cant see it anymore.  I got the steak and the shrimp and it tasted like it was not fresh and was dark grey.  We will never go here again and the quality and selection is not worth the price."}
{"text":"I went here on a Sunday with my SO. I first got up there and loaded up sushi, rice noodles, some chicken, mushrooms, and a bowl of hot and sour soup. The soup was very bland. I had been very excited about this prospect because someone in an earlier review said it was awesome. It was more watery than anything. The sushi was actually bad. I remembered picking it up and it was dripping with liquid (the sashimi).  They have a sign that says something to the effect that if you don't finish your plate you'll be charged 20% more. This isn't right since half their stuff is flavorless (the stuff we had).  $30 for two people on Sunday for lunch at this place was not worth it. We'll stick with Osaka, pay $20 more, for great food and service."}
{"text":"Went to China City Buffet for lunch. Some food was left over from day before. Tried sesame chicken and it was spoiled. Told waiter he took my plate brought to kitchen told someone their in their language and didnt take the bad chicken off floor just added more to it. I wont be coming here again."}
{"text":"We tried this place based on the reviews my husband read on Google. Boy, were we disappointed. Either those reviews are fake or those diners have really low expectations. The sushi was okay, but not exceptional. A few things on the hot bar were fairly tasty, but nothing to write home about. When we asked if they had any shrimp sauce, they pointed us to cocktail sauce. No shrimp sauce on a sushi bar? Unacceptable!  Then there's the cost....dinner was over $24 for my husband and myself, and we didn't even have drinks, just water. That's a little pricey for food that was average (I'm being kind) tasting and barely warm. We won't be back."}
{"text":"I ate at this place for the first time and OMG! I seriously cannot see how anyone can give this place a good review. I walked in and no one acknowledged our existence. 3 women were standing there and did not even look up or say hello. We ate there anyways after finally getting a seat. The buffet food was horrible! All of the meat dishes were gross regardless of what it was. It didn't even look like meat. The chicken, the BBQ, the roast beef (very rubbery), and even the fish was gross. After the first sample plate I decided to eat only the vegetables and that too did not have flavor.  The spring rolls were bad and the ice cream was even bad. How can you mess up on serving decent ice cream?  Ok... There is also a sign that they have up that says \" 20% fee for anyone that wastes food\". I don't waste food but I guess you have to do what you have to do.    All of the employees there seemed pissed off and no one smiled at all. It was just not a place that has any respect and I felt that could care less if we came back. So with that being said- I do not recommend anyone eating here.   I really hate writing bad reviews but I am only stating the facts here."}
{"text":"So first time here.. and the food was old and dry! Not even hot! Crab legs horrible just sitting in warm water no flavor! The sushi guy doesn't even wear hair net.. the cool guy has no cloves! Meat very dry! I had a sushi and it was so old mold flavor!!!! Never again I'm shocked this place isn't shut down yet!"}
{"text":"I had been here before when it was Great China so I headed there because I was hungry for Chinese.  I saw the new name and wondered if the food was the same - it was better!  Very clean and lots of choices that were hot and fresh.  Keep it up :)"}
{"text":"Love this place.... Food is fresh. Restaurant is clean and the wait staff (Mary) is great. Love love love the crab legs and the various dishes available.  Good bang for the buck."}
{"text":"(I'm a fish-eater only, so this review doesn't include chicken/meat, sorry)  Probably one of the better buffets in the Phoenix Area. There were lots of good eats on the buffet, including just standard Chinese dishes. . My favorite was definitely was the salmon and sushi.   The sushi has an eerily similar taste to the one you will find premade at Costco and Bashas, except with this one, you don't have to get the spicy tuna if you don't like it, since it's not in a pack of forty (oh, the joys of Costco, where you can by like... 34 watermelons and no one questions why...). The salmon was still a tad pink on the inside (just like I like it), which may not fit everyone's tastes, I realize, but it was delicious any way. Also, it's made right in front of you, so there is no guess as to what is in it...unlike Costco.  The crab and the cheese casserole...I waited 15 minutes for second helpings, and I could not have been more satisfied, since it is the most rich crab dish I think I've ever had, with so much cream and butter. I could only eat so much before I started to get full.   Lo mien and rice noodles were good, but I found that they had too much cabbage. And I know, it's a buffet, I can just pick out the noodles, but...just worth a mention. The egg rolls tasted like the Ling-Lings from Costco, too.  As did their dumplings.The thing is, I love Costco, so for me, they're doing something RIGHT!   There were some things however, that I didn't like that much.  Cream Cheese rangoons had TOO MUCH cream cheese in them, and honestly, I could only eat one, since I was so stuffed. They also had a salad bar, but who even touches those at a buffet? LOL. I didn manage to sneak the croutons and they were good, not stale at all. They changed the food constantly, even though there wasn't anything seemingly wrong with it, a good sign of cleanliness and freshness.   The waitress didn't even let me get 3 sips of my drink before she asked if I wanted a refill, still perfectly full. It's like, there's hospitable, and then there is whatever they are. They were really nice, though; always a smile on their faces.   This place is filled with senior citizens, and lucky me, I LOVE SENIOR CITIZENS!    Despite all the Costco references, this place is just an all around, good place to eat. Really good lunch and at 7.49(I think), who can complain? Will be going back again, real soon!"}
{"text":"This place isn't as good as your simple Panda Express, but some dishes are good.  I personally liked the salmon sushi and the hot and sour soup.  Kids have a variety of selections including fruit.  Worth 3 stars but I am still looking for the 5 star Chinese buffet here... Wish me luck!"}
{"text":"Went to check this place out on a Friday night around 830,sort of busy, got seated, started getting food and noticed half of these trays were empty, I asked 2 employees if they were going to put more food out since they didn't close until 1030 they both said yes, 20 min later,nothing.  I asked to speak to a manager and so she came and I asked if they were planning on putting more food out she stated that WE WOULD HAVE TO ASK HER SPECIFICALLY to put food out and I said I heard 2 other customers ask for more food, she smiled and said no one has asked me, so she then proceeds to asks what \"items\" i would like more of and I pointed out 3 trays, and 35 minutes later she only had 1 out, we then left, very dissatisfied and paid $60 for 2 adults and 3 children.  Never again. Save your money!!"}
{"text":"Got dragged in today by my friend cause she wanted to try it.  I can say it was still awful like it was the first time I was here, food was cold, dishes were dirty and food was salty and oily.  Wish I could say something nice but the only thing that was good was the service but I'm not here for the service. Maybe they need a new chef."}
{"text":"The service here was okay, until the waitress asked for a tip when she took the check.... we were leaving a cash tip. Then made a snotty, rude remark about how long we were there. Really? Do you time paying customers and make sure they leave? Absolutely the rudest waitress there was, and management heard about it too."}
{"text":"I will definitely NOT be coming back to China City. Why? 1. Food was at best mediocre, and mostly inedible.  2. Steak kabobs were not only tough as shoe leather, but cold. Not \"cold\" as in intentionally chilled beef...but cold as in \"our warmer is broken and this kabob was (over)cooked four hours ago and has been sitting out since then\". 3. Most food either wasn't labeled or was mis-labeled. 4. All meat dishes were fat fat fatty...even for cheap chinese food. 5. Decor and layout were very low-budget. They took a relatively new building that has housed a couple of fairly nicely decorated restaurants and made it look like an old buffet in an aging strip mall. 6. Food not well-stocked. Many main items were left with empty trays  (Orange chicken, bacon-wrapped shrimp).  What did they do right? Polish sausage was crisp on the outside, juicy on the inside and served at proper temperature; and the little fried dough, sugary dessert things...like little doughnuts..those were amazingly warm and light and not as greasy as some people make them.  Of course, I made the mistake of eating my fortune cookie after the yummy sugary fried dough thing. Blech. The fortune cookies tasted old and stale.  If you're in the area and in dire need of Chinese buffet, go to Lin's at 75th ave and McDowell...I've stopped going there since they haven't been taking care of the place (bathrooms all destroyed and graffiti'd...food quality is not as good as it once was)...but I would choose Lin's EVERY TIME over China City."}
{"text":"Don't waste your money this is garbage disguised as Chinese food, there is nothing super about their selections!"}
{"text":"The food was ok.. When they have it. I counted 8 empty pans. The ice cream was the consistency of milk. All this for $12.49?!!!!!! I got ripped off"}
{"text":"Went in and got lunch carry out for $9.06.  Stuffed the box full with sushi, orange chicken, general tso's chicken, bourbon chicken, and a shrimp mixture. And yes, all of that fit, I just had to pile it high, but they don't care, which is why I love it!  Sure, you could go get a lunch combo meal for $5 at any other Chinese place, but here you get variety and get as much as you want.  Staff is always friendly and they do a great job refilling anything that is even remotely low."}
{"text":"This is like most cookie cutter Chinese Buffets. Some are better than others. This one falls in the bottom half of those that I have been to. The sushi was tasty and seemed to be fresh. There was not a large selection and those that were available only had a few pieces of each. The rest of the food was generally forgettable Probably not on my try it again list."}
{"text":"This was our first visit to the China City Buffet in Surprise.  It was my birthday and we celebrated with family and friend.  The food was excellent, hot and tasty, I had everything from the sushi to the soups and was not disappointed in anything.  Had a dish from the Mongolian BBQ station and that was really good.  My daughter is a vegetarian and when she asked the waitress about vegetarian dishes she was told that if she wanted something that she didn't see, they would be happy to make something special just for her and no additional cost.  I can't say enough nice things about this restaurant, I was so pleased with food, service, cleanliness and the prices, 10% off for seniors too.  Love it"}
{"text":"Great deal for the $12 ! The only problem is with the crab legs, They will only refill the tray after 30 mins. Most times they are so waterlogged all the taste is gone. If you dont care about cran you will like it"}
{"text":"Great buffet with a great selection and prices. I have been to several buffets around the valley and this one holds it's water. It's  hit or miss with restaurant reviews solely because these whiny beaches think they are someone, and if they go into a place and have a bad experience they have to post it. Beaches."}
{"text":"Very standard as far as buffets go. With a good seafood selection, sushi and respectable dishes (keeping in mind that Mesa is not the culinary Center of United States) I think everyone can put this on their list of \"okay\" places to eat."}
{"text":"When this place opened it was very good. That is no longer my perception.  Nothing is worse than to get cold food on a buffet. When the stir fry is tasteless you know it is time for the eatery to go on the OTL. Off the list. Food quality is cheap. They don't even have duck sauce for spring or egg rolls. Additionally the sweet and sour sauce isn't thick. It is runny and taste like sugar water. I cannot stand places that draws  you in with good quality cooking and then take short cuts and distribute lower quality product months later. The food is sub par. How can you get can peaches to look like gray matter? The fruit wasn't even ripe. Watermelon was mealy. No pride in this establishment whatsoever.  Do not eat here folks."}
{"text":"Won't be a \"next time\"!  My son and I went today (Sunday).  They were just opening up.  We had time so the half an hour wait for the soup to even be set out wasn't too annoying.  Gradually (another 15 or 20 minutes) the rest of the food appeared.  Mediocre food at best.  We have eaten at MANY Chinese buffets and this one was NOT worth the $30.  This for just two buffets (we had water to drink).  Might as well just hit the food court at the mall."}
{"text":"Not a bad place all things considered, especially the price, they have beer specials often, the kalbi, and garlic bread are good."}
{"text":"Food was dry and tough and seemed to be left from lunch.  We have been going here for years without any problems, but not anymore."}
{"text":"This was our first visit to the buffet this past Friday night and we were very pleased. This is the best Chinese buffet we have found so far. Staff was friendly and our waitress was very attentive, she was filling our glasses when our drinks were only half gone. I really enjoyed the coconut shrimp (my favorite) it was very fresh. The orange chicken was also very good and tasty. Even the crab puff was really good. The sweet and sour chicken wasn't as good as I've had at other restaurants but overall this place has a huge variety of items and was well worth the price of $11.99. Would definitely recommend."}
{"text":"This was the worst meal we have had in a long time. The food was cold on the inside. Not sure why because you could see steam coming from the warmer but it was. No flavor and incredibly over priced. Two meals and 3 drinks ( had our 3 year old) and it was almost $30. When we questioned the food we were told \"she says it is fine\". Not sure who she is but we asked to speak to the manager. The server left and came back telling us that the \"boss lady\" is not here. We again asked to speak to the person in charge and her response was the same. She finally asked if we would talk to a guy working there.  He tried to say the food was so cold because of the a/c. We payed for the drinks and left. Will never even consider going back. Just hope we don't get sick."}
{"text":"Horrible restaurant. All of the food was cold/old. We told the staff and they told me the food was only 4 hours old and we wouldn't get sick. I tried refusing to pay but the wouldn't let us leave. Saying we had to pay because we put it on our plates. Had to report them to the BBB and health department."}
{"text":"Went on a Sun night for crab legs about 7:30 pm when there were any they were so waterlogged and flavorless it was not worth waiting for! For me most of the food was just BAD everything was lukewarm at best if not cold. Anything that was hot-ish was only from sitting on the bottom of the steam pan way to long getting so over cooked it could not be chewed. Now I should say that I'm in the food biz and own a vending & catering company so I might be a little more picky then others? Also my wife is from China and will eat most anything (like squid) \"yuck\" but wile eating the squid she actually spit it out on the table. Also said the the Sushi was near frozen. She called a waitress over and after BA,BA,BA, in Chinese she told me (in english) she was told that's how sushi is served there. The only thing worse then the food was the smell in the filthy bathroom!!!"}
{"text":"Went here for the first time and had a good experience. They were very busy on a Wednesday night, which is always a good sign. The restaurant was very clean and the servers were johnny-on-the-spot and friendly. Lots of good, basic oriental food, clearly labeled and very plentiful in gleaming steam tables. Fresh sushi, a mongolian BBQ-type area, salad bar and wide variety of desserts. I got hot green tea for my beverage and was very pleased that it was strong, authentic and organic (I'm kind of a tea aficionado so I can tell.) The only sort of negative thing I can say was that some of the hot food was very hot but some of it was not so much. However, it was turning over so fast that it wasn't sitting around for very long, so I wasn't too worried about it. They charge just $10.99 for adults at dinner and I probably ate $20 worth of sushi alone, so I'd say it was a pretty good value. I will be going back."}
{"text":"I give it 1star because the crab cakes were horrible and smelt nasty & tasted disgusting.the waitress said it was normal but how! please fix."}
{"text":"It has been awhile since I have been to a good buffet. The people were very friendly and very attentive to my plates and my drink. They had a very wide variety to choose from when it came to hot and cold foods. The food was tasty but most of all the restaurant was very clean. They had a very nice sushi bar to choose from and the price was not bad at all. You can't go wrong if you are in the mood for some Chinese food. I think you will enjoy your experience."}
{"text":"Unfortunately the lowest rating is one star.  I'd give it maybe a 1/4 star.  Barf and double barf.  The food was terrible and the service was even worse.  And selling stolen fruit?  wow can only imagine what they cook with."}
{"text":"First let me say, I've been to many many buffets in my life. For the price they charge I wasn't expecting too much, but I was very wrong. Had almost all my favorites, I didn't have to camp out by the crab area! At most places you have those certain people (you know who you are) that take ALL crab as soon as it comes out. This place kept it well stocked. I'm almost finished with my rant. Just come and try, I think you'll leave very pleased."}
{"text":"The food here is delicious and there is a wide variety of options to eat from. I suffer from Celiac disease so I need gluten-free food and there are those options for me. The waitresses are very courteous and friendly. My family are regulars at this fine establishment and they were also reviewed and considered one of the top 100 Chinese restaurants in the USA. I definitely recommend this restaurant to others"}
{"text":"Horrible wife wanted to leave immediately and they still charged me full price didn't even eat a whole plate.."}
{"text":"Went Saturday, and was disappointed, the food was old and dry, the stir fry food had no flavor at all, you couldn't add any seasonings and the guy didn't either apparently, I won't be coming back here..."}
{"text":"I agreed with Gary K. (his description is right on the money). This place is mediocre at best. Much better selection at Hibachi grill or Lin's Garden."}
{"text":"We went on a Saturday night and the place was pretty full. They had everything you would expect to see at a Chinese buffet. I only had the sushi, but it was really good. The crab legs were just ok; definitely not fresh, but not terrible. I did notice a couple of empty trays, but I also noticed that the servers were bringing out new trays all the time.  Service is quick and polite. Desserts were awesome. It was a little loud, but not obnoxious. I will be going back :)"}
{"text":"Went there right before Dinner was being rolled out. Typical Chinese buffet. Clean. The food was decent. not much to rave about but everything was good."}
{"text":"As far as buffets go, and especially chinese buffets this place is great!   Sushi, crab legs, all the usuals, Mongolian grill, and great beer prices.   Our go to chinese buffet in the east valley!"}
{"text":"Place is still awesome. I just got back here from Las Vegas and had perfectly cooked Chinese food this place is just as good with A whole lot more food!"}
{"text":"We went on a Sunday night 1-15-2012 for my wifes birthday and I will not likely go back.  I had been there twice for lunch and it wasn't bad, however my experience last night was horrible.  Most everything I tasted was bland and no egg foo young.  What chinese food buffet doesn't have that item as a staple food on their menu.  Won Ton soup, with only liquid in the pot, nothing else.  As I said before, the food was mostly pretty bland and even the hot and spicy dishes were not very spicy at all.  Too top it off, not looking at the prices before I sat down, two meals and one ice tea, $28.08 which was ridiculous for the quality of food we ate.  Taco Bell or Subway would have been a much better choice, or Lin's which has never been disappointing.  NEVER AGAIN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}
{"text":"Well, we were not disappointed. All u can eat crab legs and unlimited amount of food. My daughter loved the dumpling and she one to plz. My husband luv the roast mainly but no mash. My sister and I enjoy everything. The waitress was so nice and on top of our drinks and clearing off the table."}
{"text":"This was the worst buffet experience I've ever had in my life.  The food looked like it sat there all day when I asked for fresh servings they said it would take over hour to cook. Save your money do not stop here everything was disgusting."}
{"text":"I've been here a couple of times and the restaurant is clean and the food is pretty good.  I liked the salt and pepper shrimp and the roast beef (which was a surprise at a chinese buffet).  The desserts were fine - I do like the tapioca pudding - but not a lot that I was interested in.  All in all, I came away full and my two teenage boys were very happy (and ate a LOT!)."}
{"text":"Yuck! Food old and service was terrible! Dont try askin for sushi the wont make it for you with out a bad attitude. Will not return!"}
{"text":"Food here is okay, and they keep the selection fresh by rotating their offerings. Sunday is crab day! The wait staff are jackasses, but at least you don't need to deal with them too much. Prices on Sunday are ridiculously high, go if you're starving and can eat your money's worth."}
{"text":"Don't waste your money on this place.  Took my two daughters for lunch.  Most of the food that was supposed to be hot was warm or cold.  The sushi was more of a rice ball.  Our waitress was pleasant but the woman who we settled the bill with was one of the worst I've ever encountered.  They have signs happily suggesting they are a top 100 Chinese restaurant in the USA but I think I may be able to find 100 others in Phoenix that were better. I will not be going back to this place."}
{"text":"Honestly I love going to this buffet especially during lunch. They have this coconut cream shrimp that i love and jalapeno chicken. My go-to's! Service is usually good with exception of one lady who always seems to have a sour look on her face. Lol but other than that really like this place."}
{"text":"Your average Chinese buffet. Every meat on the buffet was high in sugar. But they had a very good vegetable selection for my vegan wife. Basically if your craving a Chinese buffet this one is about as good as any."}
{"text":"I gave this place 4 stars because they have a lot of choices AND a stir fry area where  you can choose your meats and veggies and they will do it up for you the way you want it. The waitress/server we had was really freindly, I asked for tea as my beverage and was suprised she brought me my own kettle! So I didnt have to keep asking for more. The food was well cooked and didnt have any problems with it.  The Restaurant itself was clean and smelled nice.Good selectionof food,  I have eaten at alot of Buffetts and this place had the largest selection of sushi. They must have had about 9 diffrent sushi's available. They also had Ginger on the side. For a cheap price and lots of choices, this place good."}
{"text":"For a buffet this can't be beat! Great sushi, good BBQ, busy nice place, cheap food. Nice people, great service, drinks are always full, old plates taken before your finished.  THANX"}
{"text":"We have been eating lunches here for several years and always found it to be a good experience with decent food and friendly smiling pleasant staff.  UNTIL TODAY. When paying the bill at the register, our \"waitress\" was handing me my change and said \"Where's mine?\"  I told her that her tip was on the table which is where we always leave it. She looked past me to the table and said \"No it's not.\" I replied that whoever cleared the table must have taken it.  She replied that no one took it and stuck her hand out and looked really angry. When I declined to give her any of my $3 change, she took off in the direction of the table which was cleaned off.  I wish I had stayed to see what happened next.   I have never seen her there before, and don't look forward to seeing her again.  She is a very unprofessional, rude and angry young lady and would not work in my business.  Based on todays visit we'll probably not be coming back here to eat."}
{"text":"This place was nice and quiet for a Sunday and they serve beer, otherwise I would give it only 2 stars. The broccoli beef, Mongolian beef and orange chicken were decent, but the Peking duck and chicken wings have definitely seen better days. If you're taking an ugly chick out to dinner and don't want to be seen and don't want to spend too much money on her, I highly recommend this place :)"}
{"text":"The food was old , hard , and tough. The Mens room was disgusting !!!!  Piss all over the floors , and smelled like shit !!!! The waitress who cashed us out was rude ! I told her the food was bad , and she yelled something at me for not tipping. All she did was bring out 2 glasses of water . I will never eat there again !!! That was the worst $26.26 I have ever spent in my life !!!!   ZERO STARS !!!!!"}
{"text":"Dined here with a party of 7 on 2/6/16.  I was served a soda with a raffle ticket floating in it.  The cup had obviously not been cleaned.  The waitress got me another cup, but acted like it wasn't a big deal.  Several of the food trays were empty and not filled fast enough for the very busy restaurant.  We asked them to divide our check into 3 groups.  One couple used a 15% off coupon.  The waitress was extremely rude and followed us up to the checkout to make sure no other discounts were applied, including denying the 2nd couple from even getting the advertised 10% senior discount.  Overall, dirty restaurant, mediocre food, and rude wait staff."}
{"text":"If i could give them a 0 i would there food is gross.There service is the worse.I wouldn't step in there if my life depended on it"}
{"text":"Was that food? Ranch dip taste too sour like rotten, fried dumpling meat taste like mixed meat, most dishes taste bland or doesn't seem like food.. nothing else to say just not worth it to spend money for"}
{"text":"I used to live this place but the more I come here and he kore I see the poor mess of customer service. When even I ask for something they look at me as they didn't want to do it. The cashier never gives me any sign of appreciation at all. When I asked for receipt she through a fit. How is that right?  So I'm not coming here anymore."}
{"text":"Save your money! Dirty... Food was gross. Nothing was fresh! First time here. The cook was sitting behind us on his phone playing games. They were out of the basics like white rice, lo mein noodles, spring rolls, beef and broccoli and a few other things. The orange chicken and sesame chicken tasted the same. Also... my son had their sweet and sour chicken and he said the red sauce had no taste. It was 7:30 when we got there so I expected the food would be reasonably good, they are open until 10 p.m. It was $45 for the three of us. I would not even consider giving this place a second try. I have read a few of the other reviews and it is hard to believe we are speaking of the same place."}
{"text":"I had terrible service and the food was only mediocre.  I won't go back"}
{"text":"i've been going to this place for 3+ yrs. at least once (maybe twice) a month. i will not go back.  warning to anyone going to the crab legs...DON'T GO!!! the meat is supposed to be white, not yellow. it shouldn't smell fishy, it should smell fresh.  i actually went on a friday - same thing GROSS and nasty. they were tasteless & the meat was a brownish color. i said something & told them how disappointing it was. a few days later it was my b-day. i wanted to go someplace else...for some weird reason, we thought it was a fluke a few days before, so we went back. BIG MISTAKE!!! management just nodded...walked over and got one...broke it up, but never apologized.  the mgr was at the door when i left - i told him we wouldn't be back & that i would post on social media & yelp.  i have to be honest...i LOVED this place up until friday and today it was the straw that broke the camels back."}
{"text":"The food was exactly what you'd expect from a buffet only worse! The service was almost nonexistent. Took nearly 15 minutes to get a drink. Then when we went  to pay they shamed us into leaving a tip for service we never got by Tapping the bill and saying \"no tip, no tip?\".Worst buffet experience ever! Never going back!!"}
{"text":"My gf and I found this place and fell in love with it.  They have a big selection of food and it was all quit good.  If you are in the mood for some Chinese food, then I would recommend this restaurant."}
{"text":"My sister and I have brought my son here with us a couple of times now. The place is smaller than most buffets, but that is really the only bad thing I have to say about it since I like feeling a little more spaced out personally.   The food is warm to hot, depending on the dish. The sushi bar they have set up has more options than I typically see in these sort of buffets, and my sister is always diving for it. The food tastes fresh and flavorful. The place is clean, which is another big plus.  I would recommend that others give it a shot."}
{"text":"One of the best buffet in east mesa. My kids love it. Reasonable price for everyone. I would recommend this place."}
{"text":"Lunch...  The place is after all a buffet but the selection was large and flavorful..  Try the cold mudbugs!!!!  Clean.. attentive help, hot food, good variety and good flavor...  works for me ..  gonna try dinner some nightf"}
{"text":"5 MAJOR health code violations..  Its a shame because I really liked this place and the food was pretty good, but I wont be eating there again.  http://www.kpho.com/story/19242726/dirty-dining-aug-9-cockroach-falls-on-health-inspector-at-china-city"}
{"text":"So far I started with the sushi....  I must admit that I am really impressed. Seriously! Fresh and was made with just the right balance of flavors. I'm paying $15 for tonight (going solo) and the sushi is enough to satiate any discriminatory palette. :-) Mongolian beef good, but cool not warm or hot. Bacon wrapped shrimp is a great idea... Poor execution though :-/ Shrimp cocktail looks good, but is just ok. Chicken teriyaki is well... just chicken on a stick. Bonus- it was warm.  Weird... At 47 I'm either the youngest person here or the 2nd youngest person! Tapioca came from a can :-( Lychees were very good.  Overall for the price it was worth it. If you want to feel full and not overspend on junk food this is a very good place to come to. The sushi chef is good. S/he just needs more variety because I can't get enough :-p"}
{"text":"If you're pregnant, stay away from this place.  Seriously, I'm just waiting for my husband and brother in law to start puking with food poisoning.  Even their lemonade is disgusting.  I got a plate with some 'fried rice' and a fried vegetable roll, and was so turned off by the wierd pale yellow color of the rice I couldnt even eat it."}
{"text":"The worst food in town their food was disgusting the ice cram tasted like cold paste with vanilla and they add a 20% charge if you waste food. At $13.50 per person I thought the food would at least be good and fresh. Never eating there again"}
{"text":"We enjoyed our meal. They had a huge selection of things to choose from, plus someone who will stir fry what you want. I  liked all the different types of seafood available, from clams,mussels, shrimp, fish and crab legs. The wait staff are fast and friendly."}
{"text":"In my honest opinion the best Chinese buffet I ever been to in Arizona.   Everything is decent and yummy.   The service is great and very clean.   It's worth a drive when craving Chinese buffet style food.    I tried a few and this is my place to go."}
{"text":"We have been coming here for years and we have never seen the food in such an inedible way as it was today.. I'm pretty tolerant when it comes to food but today everything was either sitting under the heat lamp too long or it was plainly terrible to eat or both... Sorry this was our last time here...  After some soul searching was wondering if I was fair with such a horrible review...   I was wrong, really wrong...   This place was undeniably disgusting and should shutdown for robbery... for stealing my hard earned money... I now will go take my anti nausea pill... Thank you..."}
{"text":"I have to tell you, the food and the service were good. Walking outback to get in my car I happened to notice the window of the restaurant was covered in mold.  Not sure if I'll return."}
{"text":"Great buffet, sushi,  crab, honey walnut shrimp etc. Variety to choose from. 5 stars if it had better desserts."}
{"text":"Wouldn't give this place another penny or go here even if the food was free. They ruined my brothers birthday. Horrible dinner service. I get that it was slow but we all pay full dinner price for old crusty food just because it's slow. We were paying customers and they would not put out new food. I had to ask for them to refill the lo mein. We were a party 8 and they literally put out enough noodles for 2 servings. It was such a huge disappointment."}
{"text":"We usually come as a fam for dinner & the main dishes are pretty tasty, soup was ok & place is clean. So we've been here a few times. I haven't tried the bbq yet. Not because it looks bad but there's no covers on the meats & no one standing there to bbq so I'm skeptical. I'm sure it's just fine it's just me. We ventured in for lunch & what we thought was good for dinner was better for lunch especially the soups. The lunch soups seemed thicker & tastier. Mmmm good. As you can tell I'm a soup kind of girl. I really like the hot & sour. I tried the sushi & for a buffet it was really good. We'll back for a lunch on my next Monday off."}
{"text":"Today was a disaster. We brought out of state family and had bragged this place up.  We arrived at 2:15 pm.  Food was luke warm and had.  it could even cut my orange chicken.  really, not even with a knife to cut.  It was very disappointing to say the least.    we told the cashier that spoke english about this.  She made some excuse that we should have come at lunch time.   Excuse me, but i thought that because this is an eating establishment that anytime we came it should be good, warm food, not just at lunch time.     Also they need labels that tell if its spicy or not.  I took a plate of food that was so spicy that i couldn't  touch it.  I also told them before about this severaL MONTHS AGO, BUT NOTHING HAS CHANGED."}
{"text":"1st thing I usually check in any restaurant is the bathroom sadly this one was horrid urinal was about to fall off the wall and looks like it hasn't been cleaned in years maybe. The food however was good the \"coconut shrimp\" was more like,fried shrimp with buttery coconut sauce on it pretty good.  About half of the items are American which annoys me at a Chinese buffet. Service was good drink was kept refilled (a huge plus)."}
{"text":"I will never eat here again. After we got our first plates my girlfriend noticed a cockroach on the floor by the food. We decided to leave and told them on the way out. When we mentioned the bugs they dismissed our complaint as no big deal, they didn't even care actually. A few hours later I got extremely sick and have been stuck in the bathroom all night. This isn't the first time I've had issues with them either. While this is the first time that I've seen any bugs or gotten sick, we have gone before and had horrible service. The ladies working will sit there and talk instead of seating you and will ignore you as long as possible, then act like you are unconvincing them by making them do their jobs."}
{"text":"Let me qualify my review by stating upfront that buffets sort of gross me out be their very nature-- yes I can be a bit if a germ-aphobe . Nevertheless, the food here is not good at all. Everything is luke warm at best and stone-cold at worst. I have been here twice and had similar experiences both times. The staff were all pleasant and efficient but the food all tasted the same and was mushy and cold."}
{"text":"This place has seriously gone downhill !!  We have been coming here for years and the quality had been good, then okay and has progressed to horrible! Tonight we arrived at 645 pm to a nearly empty buffet! To our disappointment it stayed that way throughout most of our meal, only a few items were replaced on the line. So in the end we paid over 50 bucks for nothing ! We will not return and might I suggest that you don't either !"}
{"text":"THIS PLACE WAS SO AMAZING! :) I'VE BEEN TO ABOUT 100 DIFFERENT CHINESE BUFFETS BUT THIS ONE IS SO GREAT.. THEY HAVE SO MANY DIFFERENT SELECTIONS I DIDNT EVNE MAKE MY WAY ALL AROUND :) THEY HAVE crab legs there and they are so good.. they had so much meat in them more than red lobster. & all the people were nice.. and my 1 year old ate everything i gave her from there and loved it. SUch a great place.. im deffinatly going back. :) -Paige.18 Mesa,az"}
{"text":"This place is fantastic for someone like me and my boyfriend. We are suuuuper hungry, not trying to spend a fortune on apps and entrees and dessert, and we wanna be in and out on our time. The staff is quick and friendly and the food is honestly outstanding for a Chinese buffet. We truly enjoy coming here, definitely a hole in the wall type feel since Power and Baseline isn't a very visually pleasing area, pretty dang boring. Lastly, they have great hours of operation!"}
{"text":"Absolutely terrible! First sign of trouble was weceaited in front almost 10 minutes and finally just seated ourselves.  Flagged down an employee and told them (4) for buffet and ordered drinks.  We normally look at buffets to see what they have, bit we had been running around fir hours and were hungry so \"figured\" it would be good...it was a Chinese buffet, we should be able to find decent food eh?  I mean, the China Buffet in Surprise is good spool...we took a risk, and lost, BIG TIME.   Food tasted lukewarm, sweet and sour chicken \"rubbery\"and sauce \"watery.\"  Took forever for drink refills, desserts tasted stale.  Nothing good to say about it!  Went with husband and our (2) teenage sons, they all barely ate.  After about 20 minutes of picking at our food ended up going to Jack in the Box after wasting about $40 here...(2) enthusiastic thumbs down!"}
{"text":"Well another really good Chinese buffet. This place had all your typical Chinese buffet fare plus a little more.The salt and pepper shrimp were real good and they had roast beef on a stick that tasted like char broiled steak that was a little spicy (real good). Actually everything I ate was pretty good the only thing that stops me from giving them five stars is the dessert selection was a little weak, But other than that everything is good (Yay I am a fan)."}
{"text":"Pretty standard Chinese buffet. It's much better than the one off Litchfield and Bell though!"}
{"text":"Well we have another good Chinese super buffet in the valley and it is pretty good. They offer a few taste treats you do not see at the other Chinese buffets like bacon wrapped shrimp,stuffed chicken,steak kabobs,Polish sausage grilled and bok choy all of which were real good.The service is quick and friendly and the place is clean. So Yay I am a fan. With all these new super buffets opening up they just keep getting better and better, one year ago I would have given them 5 stars but now there is to many good Chinese super buffets to give them all 5 stars,but this place is close the food is good and you will leave HAPPY."}
{"text":"Well this buffet is pretty good the selections were around 150 , that qualifies them for super buffet in my ratings. Almost everything I ate was good , not a lot of outstanding but a real good lunch. I look forward to a return visit here."}
{"text":"The food looked better than it tasted. I worried excessively about food poisoning while I tried to eat."}
{"text":"Now I should perhaps preface this review by saying I'm not really a fan of buffets. So take my thoughts with a grain of salt please!  This place was surprisingly busy for such a large place. Staff was clearly rushed, and had a 'get them in and get them out' sort of attitude. Food selection was massive, though a lot was deep fried and extremely greasy looking. Tried a dumpling and some beef broccoli that were both overcooked and greasy. Even simple garlic mushrooms were slimy and poorly cooked. Stir fry station offered a chance at some freshly cooked food, which was then promptly covered in oil on the grill. Sigh.   Everything felt a bit grimy, and the bathrooms were fairly dismal. Not for me I'm afraid!"}
{"text":"For 7.50 a great value. With the selection of  seafood and wide variety of different cuisines you couldn't go to store and purchase that for the amount charged. The flavor isn't high end but good enough. Only one complaint is the temperature. Could be a lot warmer."}
{"text":"This is the worst service and food I've ever had at a Chinese buffet. I'm not a picky eater but everything I had there was horrible. The food was cold. They started emptying the food 45 minutes before they closed. We asked for a discount because of the food being cold, closing early and poor service. They gave us $3 off of our bill. I will never eat here again. On top of all that we got sick off of the food."}
{"text":"My experience here is what drove me to create an account on Yelp and give this place but one star. My younger brother, age 17, and myself, age 21, decided to try this buffet for the first time at 7pm on a Wednesday night.   Immediately as we walked in we were greeted with judgemental stares as the staff spoke to each other in a different language then finally told us we had to pay first before we were sat. I didn't think much of this, since other buffets do this, until we watched as other families after us were kindly greeted and quickly taken to their tables. This kind of discrimination is what made us uncomfortable during our dining experience at China City Buffet.   The food was better than we expected, especially the sushi, but it would have been much better had the staff not treated us as if we were some kids, up to no good, who would run out of the restaurant without paying.   I would recommend this restaurant to anyone with a family or simply anyone who looks over the age of 21 since they will not provide good service if they think you'll run out on the bill, which is why they will make only you pay before you can even sit down."}
{"text":"The staff and the boss are very hard working, courteous and helpful .  They take the time to serve the customer well. Their enthusiasm played an important part in my decision to visit China a few years ago. We always enjoy the delicious food and visited the restaurant on an average of once a week for many years. Gerry Frey  Mesa, AZ"}
{"text":"We were craving chinese and sushi so we decided to go to here at 8:45pm. Bad idea. There was no sushi left. The cook and the manager were standing by the bar so I asked them if they had any left. They said something in chinese and pointed to what I believe was the server. I found out they close at 9:30pm. What was left was very little options and very picked by the other customers. There were little spoonfuls of food left and what was left was cold. They did bring me white rice when I found out they were out of it. The fried shrimp was greasy. Many food options were gone and the hot plates were already cleaned out. Before paying my $27.36 I told the cashier to please relay to the management I was dissappointed there was no sushi and that the food that was remaining was cold. She did not seem to care. I see that this lesson to not return cost me $27.36. Its a shame too because I live around the corner from here. I guess I will just make the drive to Krazy Buffet the next time. Don't waste your time here. This was a Chinese food place but there was nothing Super about this buffet.   I am net to Yelp and I never complain but this experience was bad enough that I had to voice my opinion. I see from the thread that other people had visited this same restaurant on Power Road in the evening and had a similiar bad ex[erience  with the food.  From now on, I am going to use YELP more!"}
{"text":"Lunch there was fantastic. Very clean, food good, service was wonderful. The beef and onion, and hot and spicy soup were my favorites.  Great price for a buffet. YUMMY!!!"}
{"text":"My wife is full, that's the nicest thing I can say. Food was cold although the selection was fine. The sushi bar looks so good but I'm afraid to try it because all the rest of the food was cold. I was afraid of salmonella. This place is definitely not a keeper."}
{"text":"I would have had no problems (other than the \"recycled\", poor-quality food) but the guy on his cell phone, coughing onto the sushi every 3-5 minutes did it for me. Of course I didn't notice this until I had grabbed a plate full of sushi... Anyways, when confronted about his disgusting, lack of food handling skills, he apologized. He then told the waitress/cashier, in a foreign language that I assume was some Chinese dialect, which caused her to start grinning from ear to ear as she walked away. When confronted by my wife, the woman made up all kinds of excuses; none of them even relevant to the situation. I don't care how many times he washes his hands - that doesn't prevent his germs from going onto the food every time he coughs onto it. We were repeatedly told that there was \"no manager\". We have eaten here before with no problems, other than sub-standard food, but we will NOT be going back after this."}
{"text":"One of the worse buffets I've ever eaten at.   I tried several of the meat items, and they were so tough that they were almost uneatable.  The crab legs were so overcooked as to be almost limp.  All of the remaining dishes I tried were so bland I can barely remember what they were supposed to be.  On top of that, as I was paying my bill and leaving the waitress took my bill and then started screaming at me.   The only word I understood was TIP.  Apparently it was insufficient for her. I will never eat here again.  Between the bad food and the rude staff, this place is just terrible."}
{"text":"Been here half a dozen times. The number of entrees is incredible. Never seen this much selection in any buffet, anywhere. The secondary room accommodates large groups quite easily. A bonus as we had a group of a dozen. The servers picked up the empty plates often.  I cant comment on the quality of all the entrees, as it would not be possible to try each one. However the ones I had were excellent by buffet standards.  I would have like some of the dishes to be physically hotter, but I like my food hot. All in all, my favourite buffet here in Az. Great value for the dollar."}
{"text":"I have been to lower priced good Asian Hibachi buffet restaurants. Talking about this place, Food is flavorless, overpriced for what is served. BBQ/Hibachi was not cooked properly. On top of that they have signs sticking around saying \"20% extra charge for wasted food\". Don't they know what Buffet means?? Would not go again and neither would I suggest to anyone."}
{"text":"Zero stars needs to be an optiion!  Terrible food!!  No other words for the quality of food except TERRIBLE!!"}
{"text":"It's a typical Chinese buffet. They have a large variety of options from sea food dishes, sushi and a Mongolian BBQ. The food is OK. The desert options are minimal, it's pretty similar to most other Chinese Buffet's. Expect to spend about $13 per person on a weeknight, w/ drink and more on weekends."}
{"text":"Horrible! Food tasteless, watery, just plain awful. Don't go!"}
{"text":"No, no and no . I had to pick at dishes to find something to eat. It was a Friday night and I would of expected fresher warmer food. Even the soup was tasteless. Welcome to the bland over priced disappointing restaurants of Surprise. I will not come back here."}
{"text":"very typical Asian buffet.  Standard selection and food taste is fine.  Nothing really to write home about but ok food."}
{"text":"Well... we've been here twice and both times have found the food less than appetizing. And I recently read a few health code department updatea and we will not be back for sure."}
{"text":"I have eaten a lot of Chinese food in many Chinese buffet but this is by far and away the best Chinese buffet I have ever eaten at. The flat grill has more choices than any buffet I have ever seen , about five different kinds of meat and all the normal vegetables. Many Chinese restaurants use mushrooms which are second grade this restaurant has some of the best first grade button mushrooms that I have ever ate. Everything here from the fruit to the vegetables are as fresh as can be. If you like Chinese food you must go to this buffet."}
{"text":"Keep driving! This place isn't worth the time it takes to park. Sadly this place makes panda express seem like fine Chinese cuisine. You will be disappointed. I took my wife, & mother in law there for lunch. We took a few bites, & noticed that everything tasted like it was fishy, even the fried rice. We were grossed out, & decided to leave right away. They were kind enough to take 15% off our bill. We ended up playing $27 for food that I would'nt feed to my dog. If you do decide to go, make sure you get plenty of napkins so you have something to spit the food into."}
{"text":"Good selection of food and convenient. I liked the rice and coconut shrimp, waiters were friendly and no wait to sit down"}
{"text":"This is an excellent buffet. They have a wide variety of food, including an extensive sushi selection. Everything was hot and fresh, and the price was right. We'll be back!"}
{"text":"Is a pretty standard buffet. Points for clean, Points for hot food on tables, Points for service. Young lady who waited on us was very nice and helpful. Removed plates as soon as we were done. Major points for later on I didn't feel like crap from eating there food. Which happens often at buffets. I liked there lobster bake with cheese was something new I had not seen before. The Sesame chicken was good not soggy from sitting. Over all a A ok place to eat.  The three is not a bad score it just says I have had better but this was good."}
{"text":"My go-to place for chinese in east mesa.  Could be that it's only 1/2 mile from my house.  But this is quality good at reasonable prices.  We've even hosted birthday parties here.  When the Misses or I are sick this is our go-to place for soup - the wonton, egg-drop and vegetable soups are the best for what ills you."}
{"text":"We loved this place. Traveling from Sedona to the Phoenix airport we ended up here based on yelp reviews. Large strip mall this building set alone with big parking lot outside the door. Quick to seat you. Big comfy booths. Clean bathrooms. The food selection and quality was excellent. The BBQ and sushi were great with so many other standard Chinese food offering. Everything was hot and fresh. Drinks quick to arrive. The desserts were awesome with eight different flavors of hand scoop ice cream flavors. Only $8 per person for lunch is the best value anywhere. I really liked the crab with cheese served on a seashell. Yummy!"}
{"text":"I take my mom and daughter for lunch here all the time. I drive from North Phoenix just to eat here. The food is delicious and they offer many many choices. I love this place and I love the food! So good!. The chinese buffet by my house is minutes away, but makes me throw up every time I eat there, and gave my daughter the runs. We will continue to drive over 20 miles and continue eating here only. The coconut shrimp is to die for."}
{"text":"I want my one star back so I can give zero stars.  Where the hell is the AZ Health Dept??????? Non cleanable/super porous surfaces in restrooms. Dead bugs under the edges of the food buffet area.  Seriously do not go here. If you want to risk your life or just like playing ''food borne illness roulette''....be my guest."}
{"text":"We have gone to eat here 3 times in the past month. The food is so good and always hot and fresh. The restaurant is very clean and the staff are very attentive and friendly. I have been looking for amazing Mongolian beef since we moved to surprise. This place definitely has the best in town."}
{"text":"A easily located Chinese buffet near the 101 and West McDowell. I actually frequent this restaurant, so reviewing comes off of real time visits. The facility is always very clean, I've been in before food was served and saw the facility being well cleaned. The food is always fresh and never appears or tastes as not. Along with the buffet items there is sushi and stir fry bar avail at 0 extra cost. The fruit and desert is always fresh and never \"funky\". The reason I will not give 5 stars is due to the attitude of a couple of attendants. They are often angry and make things a bit \"weird\". The second is that unless you take the time to actually print the 15% discount coupon, they are gonna flat refuse to accept it. In a digital age, seems a bit antiquated to have to physically print. Price for two with drinks for lunch is $22. Dinner for two adults and two children on Sat was under $50."}
{"text":"Yuck - this the first time I've ever left a review, and with the food and service combined I'm compelled to let others no, don't come here  Food review - Yuck.... How about no stars. My wife and both my kids, we all got plates, say down and ate, and after about to bites in nobody was eating. The waitress even asked us as she was taking away all our plates full of food why we didn't like it. Then she quickly walked away and came right back with our check. Didn't offer to discount it out not charge is or anything, just apologized as she handed us the check.  Service - the waitress all walk towards you as if you the customer should move out of their way. They did it to my children as well! Almost knocked my six year old daughter over because they didn't stop to let her by. I asked for lots of ice in my tea, I got a couple cubes."}
{"text":"Went for lunch yesterday. I was sick all day and night. I think it might have been the sushi."}
{"text":"I give this place two stars and on a busy weekend 3. My family and i come here every once in awhile when we want a chinese buffet, it is the closest to where we live. The food is okay but it isn't always the freshest especially when they are slow. A lot of lukewarm food and sometimes the meat sits and gets tough. Plus they rarely restock the crab legs and when they do it isn't much. The service is great though."}
{"text":"The food is cold, ir has been sitting there for awhile. The soda taste like plastic. Ugh the whole food no taste and simple nasty!! Will never go back or recommend."}
{"text":"first time going to eat there tonight. the ambiance is great. very, very casual. the sushi was super fresh, and it was very flavorful. i also had the steamed shrimp, fried rice, and chow mein. it was all delicious. my parents had some of the chicken dishes, and they loved them. my sister had one of the made-upon-request dishes and she loved it also. overall, such a delicious place. highly debating if i should go back tomorrow!"}
{"text":"Inexpensive Chinese buffets rarely merit a very high rating, but this one deserves it. Although not located in a choice area of Phoenix, this establishment is clean, has a very efficient staff, and serves really good food - definitely better than in many of the good buffet establishments I have tried. I joined Rand H. for lunch here at opening day and was impressed by the appealing interior decor and the wide array of tasty choices which includes Mongolian grill (they have killer mini-kebabs), sushi, clams in ginger-jalapeno broth, as well as many of the staples in Chinese buffets but very nicely seasoned here. I'm definitely returning so that I can have some of the dishes I wasn't able to try because I ran out of tummy room - even though I had only a small tasting portion of each dish I tried. That's the happy consequence of having such a wide variety of good food available. And all that for just $6.99 + tax, for lunch."}
{"text":"Good food. Nice service except for the older lady keeps screaming and yelling at sweet employee. She is rude. She's probably the owner. If she is not she should be fired or have a formal complaint with the labor commission. Other than that everything else is very good."}
{"text":"We eat here every couple of months. It's usually pretty good but it has gone way down hill. We went tonight (Friday). It took forever for food to be replaced. They have crab legs for dinner but only put out half a crabs worth every 20 min. I thought I was going to have a fight with three other people just to get scraps and then they were cold. The food was sub par and way over priced. I won't be back. I'll take my business to China Buffet. I'm sad to see this place get so bad."}
{"text":"This is one of my favorite places to eat. The only problem I have is when I come in with my individuals with special needs. The first thing they ask is if I'm leaving a tip. Sometimes they don't always have the funds to leave a tip. So the staff here complain about not leaving a tip."}
{"text":"The food is amazing. The coconut shrimp, sushi selection is awesome. My kids love it.   Only downer is the staff is rude as heck. They have eye rolling when you ask for anything to the expert level!"}
{"text":"Crab legs had no flavor .. could have better dessert too .. I recommend the Asian buffet on hunthighway"}
{"text":"Best Chinese buffet around they serve whole spareribs which others don't lots of seafood dishes too and good price and it's clean"}
{"text":"I visited this buffet for the first time this week and was so disappointed I posted a comment for the fist time ever. I wanted to make sure people knew the truth and didn't waste their time or money like I did.  My comments weren't even posted. I feel that all ratings and comments should be posted so people have a fair representation of what the restaurant is like. I was surprised to see how many five star reviews were listed for this buffet but, now that I know that not all of the comments are listed I realize that there are probably a lot more negative reviews that don't get posted.  Thank you for posting the bad reviews as well as the good."}
{"text":"If I could give this establishment no stars I would.  I got EXTREMELY  sick for THREE days and nearly lost my job because of it."}
{"text":"I don't normally review places but I downloaded the app just to report what a terrible experience my family had here. We came by for lunch and the food was horrible and tasted bad. The fruit was old, the hot food was cold. The flavors were very odd. Before we left 2 of my kids were doubled over with stomach aches. When I took my youngest to the restroom we walked by the kitchen which was a complete and total mess and had a god awful smell pouring out of it. 90% of what I tried tasted funny and we left after barely consuming anything. I went to the register with a coupon which was from the money mailer and they had taped something to the register stating they won't take them. When I tried to tell the person at the register about our experience, he just shrugged it off. I told him about the rotten fruit so that other kids wouldn't eat it and he didn't seem to care. I will never be coming back and I hope this review helps save someone else the same trouble. We aren't picky or ones to complain but this was too much not to say something."}
{"text":"Im really giving this place 5 stars. It was super clean. Fresh hot and never emptied food choices. Nice servers. The food is avg nothing fancy. They got good sushi. Mongolian grill below avg to be honest. I gotta say this place beats dirty stinky Lin's down on 75th."}
{"text":"This is the best Chinese buffet I've ever been to.  It is very clean, the food tastes fresh and delicious, and the staff is very friendly and helpful.  We'll definitely be regulars."}
{"text":"This Place is a disgrace Never come here again  look at what i found in the soup  a ROACH!!!!"}
{"text":"This had to be one of the worst buffets I have ever been to and I'm not much for Chinese buffets. But a friend of mine and I decided to take a risk and try it. Food was overcooked probably had been sitting on the hot bar for sometime. Food was tasteless for the most part and I didn't trust seafood. A lot of food had a hard crust on the outside from sitting too long. Needless to say my friend and I will never go back there again! Also one thing I did notice there were hardly any people in the restaurant and bathrooms were marginally clean."}
{"text":"I've really been in the mood for buffets lately, maybe it's hormones.  Anyway, this is a solid chinese/mongolian/sushi buffet that feels cleaner and somewhat fresher than many I've tried.  I actually avoid the regular chinese dishes which tend to be greasier and heavier that what I like.  For this place, I stick to the food that I can't get just anywhere including the oysters w/ jalepenos, peel and eat shrimp, cucumber salad, marinated calamari and a variety other interesting, not so common items like little dough balls filled with seaweed which are awesome, but I'm not sure what they're called.  Some of the standard appetizers are very good as well including the spring rolls and potstickers.  Actually, nothing I've tried here has not been good.  The hot and sour and egg drop soups are both very solid.    As far as the sushi selection, for an all you can eat buffet at $7.49 for lunch M-Sat, you cannot beat it.  There are at least 8-10 different types of rolls, nothing that will knock your socks off or compete with high end sushi joints, but very good for the money.  I've been getting a 15% off coupon in the mail every couple weeks, so with tax it's $6.89.  The service is always attentive and friendly."}
{"text":"Omg Bomb! Bomb! Bomb! The best chinese buffet ive had since i moved here. Their sushi too is fresh made and you cant say that at a lot of chinese buffets. Their salt baked shrimp is on point along with coconut shrimp and everything else on the menu. I think the only downside is the dessert. Typical buffet dessert but by the time i am done eating i normally am too full to eat dessert. Overall they have great food!"}
{"text":"Frankly, I was frightened to eat here...but my inlaws really wanted to try it and because I prefer to keep the peace in terms of family relationships, I sucked it up and kept my trap shut. Luckily, my husband reminded my FIL about the recent health department visit where the German cockroach fell on the head of the inspector but it wasn't until after my FIL mentioned how clean the place seemed compared to the other Chinese place....  Ok, so our visit was ok. The restaurant was clean, the line was clean, and the staff kept the tables well bussed. The food was EXACTLY THE SAME as the China Buffet over on Litchfield and Bell though. In fact, pretty sure they are the same business because the food was identical in presentation and flavor. The difference with this location is that they have Mongolian BBQ. Well, at least they have a Mongolian BBQ station. It's unmanned. I waited for someone to come...even asked for someone to come...was told it would be \"just a minute\" but no one ever came. Oh well. It's not like I'm coming back.   It would be great to have a Chinese restaurant that is outside the box here in Surprise, but I won't hold my breath."}
{"text":"Terrible, dried out food. Very little messy on the chicken, everything tastes the same, not even the egg rolls are any good. Only good thing is the price"}
{"text":"Rand H, Mike C, Robyn N and myself went out for lunch at the usual time just around 11 o'clock. Just a few short minutes after we arrived and were seated a senior group poured in about 40 of them. We quickly made our way to the serving area. Almost everything I tasted I liked. Their sushi bar was nothing like Pacific seafood buffet but the sushi that they did have was good. I had a little bit of the Mongolian BBQ hand-picked by myself and cooked by their chef and it was good. My only complaint other than the fact that the sushi selection was rather small, was one of their entres at the Key West chicken meatballs on a skewer, was kind of bland. But everything else was very good help is friendly but very busy and they had it together enough that I give them four stars. That's all!"}
{"text":"I do not know what happened to this place. All I can say is do not recommend this place at all. All of their foods are very old. I can taste it and know that they have been sitting quite a while. Their sushi is disgusting. Avocado turned to brown and everything is dried out. It was 8.99 per person (limited time) but it is not worth it."}
{"text":"This is just your average run of the mill all you can eat buffet. This place is a little more expensive than other places and the food is the same or a little bit better, depends on what you eat. I like the sushi selection that they have here, it is some of the best I have tasted as far as all you can eat. They did not charge for my daughter who was 5, I did not see age sign posted but since they charge $17 a person am glad they didn't charge for her. I would go back but at these prices they have to be once a month."}
{"text":"Great Food, & All you can EAT :) Inexpensive TOO Great servers. only 4 stars because it's a LONG Drive ... GREAT FOOD Tony Morello Mesa Az"}
{"text":"Great choice of food , love the sherbet's all around  good eats.."}
{"text":"Wow i came in today thinking it was going to be good paid 30 dollars for shitty food that had been sitting there for a while."}
{"text":"Went here on New Years day and the food was pretty good but I've also been here on a weekday when its not so crowded and wasn't pleased with the food. I'd recommend to only come here during busy hours because that is when the food tastes best! If you're a fan of crab legs, craw fish and sushi, they've got em!"}
{"text":"Been here before wasn't impressed but this time they had a great selection. Their crab legs were dry. But their Mongolian grill was great. The sushi looked great, but it was a no carb day. I don't know if this is the norm or holiday weekend made it better."}
{"text":"Need to have zero stars...rude people..horrible horrible horrible food yes it deserves 3x...they do not bring out fresh food and you have to ask if you want more of something...open until 930 and at 840 while we were eating...the whole restaurant including our waitress was stuffing their faces while customers were in there....questioned her about how they can sit there and eat while there were customers...she said \" it's my dinner time\"....YOUR time what about your customers that need drink refills and the food that needs to keep coming out HOT AND FRESH...not like it was sitting for days....she made sure her and her kids yes they were there...stuffed their faces and had drinks while we sat on empty...you want to spend alot of money on shitty food and walk out hungry....be my guest never again.."}
{"text":"One of the cleanest & largest Chinese buffets I've seen! Super large see food tables, even with starfish and octopus ! Restrooms super clean !!!!"}
{"text":"Showed up to try for the first time.  Yelp shows open til 10pm, their door says 9:30.  Got there @ 8:44 and they were closed up.  Very disappointed."}
{"text":"Barely walked in and the customer service was the worst lady at the front was so rude I had gastric bypass and need to eat off the kids menu she would not honor the card would even look at the card just put her hand in my face that she doesn't honor it very poor customer service I walked out with all of my children"}
{"text":"What is it with Chinese buffets? It seems like they all get supplies from the same vendors.  This placed is no different. The food is about pee warm and it all tastes them same. Every item was mush,  even the beef. The beef was rubbery and weird.  Then when we were leaving the bus- person,  because that's all she did,  told is to leave a tip.  She watched over our shoulder when we were signing the check.   So needless to say,  we won't be going back: horrible food,  rude staff."}
{"text":"Main reason for coming here is they have Mongolian BBQ.  The only place in west Phoenix that offers this specialty. And it's delicious. They also have a variety of shrimp, seafood, and meat dishes. My Favs are chow mein, bacon wrapped shrimp, walnut prawns, egg custard tarts,and BBQ pork.  Priced right! Overall if you are looking for a buffet this is pretty good."}
{"text":"Yup I drove all the way across town to have dinner with some friends tonight and yup it was worth it. You really do have tons of options to choose from. I mean they had crab legs, chinese bbq ribs, Mongolian bbq, steamed asparagus, green beans, orange chicken, crab won-tons, you name it. I am licking my lips as I type, remembering all the yummy food that I had.   The young lady that was taking care of us was really friendly and we all got 15% off of our meal due to the coupon that we had so double score. If you live in the area, try this place out. The food is plentiful, the staff are friendly, and the price is just right. Its a triple win situation."}
{"text":"The food was tasty and fully stocked. Restaurant was clean. The bathrooms were disgusting. The toilets and urinals weren't sealed to the floor and the two out of the three woman's rooms were clogged."}
{"text":"Good food, but they keep running out of everything. Not very busy so not sure what the problem is, expecaly on weekend prices. Front area is nice, but bathrooms could use a bottle of bleach. Hopefully the kitchen is clean."}
{"text":"I am frightened to endorse any Chinese Buffet since I know many are two stars better or MOST likely worse the next visit but this one was maybe close to four stars the day I was there for the kind of food it is and I most likely won't visit this one again since I  don't go to this area often.  But the day we were there they has little mini kabobs and they were decent....not like like awesome gourmet but like your neighbor made them for you,beef ,chicken meatballs and really good red snapper that was tasty and impressive moist and seasoned tasty. They had some dark meat chicken that was moist and flavorful it was rolled and roasted in it's skin with salt and pepper...I guess what really impressed me was that everything did taste different and wasn't a bottled sauce like the one major Buffet that I think might use bottled sauce. vegetable dishes I sampled were good lightly sauced not oily or overly sweet.  They had less sushi and the desserts than other places but.. they were OK and fresh and well kept.  Over all I have to say this place was better than the majority Chinese buffets I've been too.  Service was very good. But I am frightened to endorse since I know they change like the wind here. (or the Great Haboobs)"}
{"text":"This buffet is a couple blocks from my house.  My family and I decided to give it a try more for the location than for anything else.  We were all pleasantly surprised.    The food was good and hot.  Let's face it, in the end it's buffet food so it's never gonna be gourmet, right?  But if you hold China City Super Buffet up next to it's peers, it easily stands above the crowd.    The \"sushi\" (again, it's a buffet, so I didn't go with huge expectations) was good.  There is a BBQ station that was tasty.  The entree dishes were plentiful, varied and well prepared.  I read the review that mentions the servers speaking badly about the customers in Mandarin.  While I did notice that they were very hesitant to speak English with us, I did not get the sense that anyone was making derogatory remarks.  Who knows, maybe ignorance is bliss?  Bottom line, I will be back.  Probably often.  :)"}
{"text":"This buffet has a nice selection of food.  Many different options, but not many dishes really stand out to me.  I did enjoy the bacon wrapped shrimp which I had not seen at any other Chinese buffets.  I did think it was a little odd to have bacon bits and croutons right next to the desserts."}
{"text":"A recent Saturday afternoon visit resulted in many wonderful taste experiences due to the effective use of seasonings in their foods. Tge wait staff are pleasant, but the food is quality and varied."}
{"text":"hello there I went last week to this place we go there all the time your best bet to get yhere early so you can get the  food before it all gose fast just a tip"}
{"text":"So I think the time of closing posted on the front door was 10PM...we arrived at 8PM...that's a kinda normal dinner hour right? Well most of the food was gone, the only thing I saw them refill was the lo mein... Meats tasted burnt and/or overly smoked. Salmon was so dry, it was enough to almost cut the inside of my mouth.  The hot and sour soup was not only lacking in flavor but also smelt like a dirty foot just walking out of the gym. The only thing I really enjoyed was the kimchi. It was the best I've had in a LONG time. The sushi was OK...at least it was cold I guess. Probably around 8:30PM all the staff sat down in the dining room to eat, I mean EVERYONE...cooks, waiters, hosts and hostesses...leaving all the customers to pretty much fend for themselves. We sat for prolly around 10 minutes waiting for our check to be brought to us. For 2 dinners, one soda and one water, it was almost $30!!! Are you kidding me?? Especially when most of the food was gone and so old that it looked shriveled up and nasty???  The kimchi isn't worth coming back to this place...Nothing is worth coming here..."}
{"text":"I just left there--one word--gross! The fried rice, spring rolls, egg-foo young, etc are as bland as white toast and the staff is borderline hostile and fighting among themselves which made for some entertainment. I tried to find something palatable but honestly--I couldn't!"}
{"text":"This place was OK, but honestly not great.    The food was decent, but not astounding, and the service is alright.  Overpriced for the food quality, and the service was a little meh.    Worth three stars, but I probably won't be back /="}
{"text":"This was thr best Chinese buffet I have been to in years.  I was even  surprised to find the sushi was very good.   This was a great value and we will be returning."}
{"text":"I came here during my lunch break to check out the lunch buffet.  For $7.99 this place is a great deal.  It's very typical for what you expect from a chinese buffet, most everything I had was decent with nothing being particularly memorable.  A couple things I didn't like, but it's a buffet...you just leave it on the plate.  The food quality gets 3 stars.  The cheap price gives it another star.  If you're in the mood for a chinese buffet, you can't go wrong at this place."}
{"text":"I have been coming here for YEARS! I loved this place- until a few months ago. The prices have gone up, the service and food have gone down.  I had a coworker mention that she and her entire family got violently ill after eating here. I figured it must have been some weird thing they all ate that I normally don't. I had already almost quit going because of the rude snowbirds who frequent the place during the winter and the quality of food going downhill, but because my husband loves it we went back. Most expensive Chinese food I have ever had- cost me a $300 copay for an ER visit. I didn't even make it home before I was curled in the fetal position with severe stomach cramps. Three hours later I was in the emergency room dehydrated and sicker than I have ever been in my life. I thought it wasn't possible a toxin could act that fast but the ER doc assured me that the very toxins flowing through my bloodstream can act in a matter of minutes within consuming the food. I didn't eat anything raw (no sushi, no salad bar, not even the dessert area). I didn't eat anything out of the ordinary for me either. All I do know is that more than 72 hours later I am still sick and will never return again."}
{"text":"This was and is the worst experience that I have had eating out at a Chinese restaurant with my family I watch them scrape food into pans to put away with dates on it for tomorrow employees eating out of pans in the rear of the restaurant where we were seated had to basically beg for someone to do a stirfry on the grill because  they had all ready cleaned it up for the night items were not replaced with fresh things were hard and rubbery and this would not be a place that I will go back to ever again customer service was crappy worst experience ever what was supposed to been an enjoyable evening with two graduates turned into a crappy night plain and simple don't go there if you expect decent service because you won't get it"}
{"text":"The staff made my boyfriend and i feel EXTREMELY uncomfortable when we were CONSTANTLY being watched to the point that we couldn't look up from our plates  or serving our selfs because some lady would be standing there staring HARD  like we were gonna dine and ditch, first of all i cant run out on 5 inch heels.. And when we were told to not leave our table till we payed, \" No you, stay here\" is what were told when we got the receipt.  that's bullshit, i saw every other person go to the cash register. The restaurant ruined a perfect evening that could of been called a date. I have never felt like i was looked upon like as such a scumbag in my life. PLEASE get new staff or get them in checked, because we are definitely NOT EVER  GOING BACK!!!"}
{"text":"I'm not a fan of buffets, but my hubby loves them, so, I bit the bullet and came here with him.  We came here when they first opened about 7 yrs ago and we were not impressed. Hubby didnt remember coming here before and wanted to try it anyway.  We got there about 430p on a Tuesday. It was already getting busy.  The hostess wasn't very pleasant. She sat us quickly and tossed the prerolled silverware on the table to where they almost fell off the table. As she was walking away she quickly asked what we wanted to drink. I guess I didn't answer fast enough and she got huffy.   Lots of choices at the buffet.  I stayed away from the fish. I don't do fish at buffets. But they had a large choice of fish and sushi. The food tasted fresh and what I had was good except for the baked chicken. It tasted freezer burn. Soup was great. My hubby loved this place. I'm a bit more skeptical of buffets. I believe we arrived at a good time when all the food was fresh and hot.  I was put off by the signs they have hanging stating they will charge 20% to your bill if you waste food.  I didn't like the chicken, so I didn't eat it and was wondering if they would charge us 20% more, but they didnt. The bathroom was nasty, old, and smelled of mildew. The toilet paper roll only allowed me to get one square of toilet paper at a time. So that pitstop took forever. Plus, the toilet was crooked. Weird.  My husband heard the waitress tell a family of 5 that they can only go up to the buffet 3xs. What is up with that? It's a buffet! That's why you pay a flat rate at a buffet. That turned me off big time. So, all in all,  it was just ok.  I'm not sure I would eat here again though."}
{"text":"Food is a pretty standard Chinese buffet assortment. A little bland overall but a couple of selections I tried were surprisingly good. Very clean and the decor was nice and service was decent. I will visit again."}
{"text":"I would've given this place negative stars, since I can't they get one star.  First off, I noticed they had that \"hurry up and buy\" stank attitude as soon as we walked through the door. This place is called China City...my ass! They had no more than 30 selections of food to choose from. Everything lacked flavor, and the buffet area wreaked of that steamed rag smell they use to wipe around the heating pans.   So, my family and I were literally seated five minutes before the waitress started walking by our table staring at us every few minutes as if she was ready for us to leave. After about 30 minutes, this heffa starts clearing our plates without asking if we were finished. Shortly after this, she  put the tabs on the table. Really?! We hadn't even made an attempt to get dessert, so my patience was running really thin with her.  Needless to say the food sucked so badly, so did the lack of customer service. Myself or my family will never visit this overpriced dump again.  By the way, when it was time to pay at the front register, about 6 of the employees crowded around the register as if we were going to run out on a bill. I should've walked out, seeing that we spent $76 bucks for completely sh!tty food. Skip this crap hole and go to Lins if you're in the mood for an Asian buffet.  Spending your hard earned money in establishments where your presence appears to be more of a nuisance is asinine, that is the reason they can sit on an spicy egg roll because I'll never dine here again."}
{"text":"I was not impressed by this chinese buffet. The only things that were good were the sushi and the location. The servers only speak enough english to serve you. And their food offerings are of very low quality. Their prices are way too high for the lack of food quality. They had crab legs that were so tiny, I could barely get the meat out of them. Also, their fried rice tasted like dirt. Their chicken was dry (except for the chicken on a stick). I won't be going back here at all."}
{"text":"The place was hot inside the chicken tasted old like it's been freezer burned. The sweet and sour sauce has no taste at all. A lady was using her hands tasting stuff before she put it on her plate which was gross. We won't be going back.."}
{"text":"The sushi was surprisingly really good! The chef made it fresh when I was there around lunch. Some of the food was a little cold but still good. Nice place to eat and just relax."}
{"text":"This Buffet is not good start out with 2 rude waitresses !!!!  The food is not good at all and you have to nearly beg for  a refill on a glass of water if it's your first time to one of these places obviously people think it's great but trust me if you've been to many places like this type of buffet please drive past !!!!!!"}
{"text":"I spontaneously went to China City Super Buffet with the intention of trying something new.  Ironically, the experience that I received was far from what I was looking for...  After finding this location in the hood, I was promptly seated and went for my first tour of the buffet.  After discovering that the first plate was not clean, I grabbed another and loaded up on some sushi.  It wasn't great sushi, but it wasn't bad either... it just didn't taste that fresh.  On my second trip, I grabbed some mixed rice, orange chicken, beef, and some cooked shrimp (with the head on).  Everything was quite lukewarm.  Fortunately, I was still using the chopsticks that I used for my sushi as I sifted my way through the rice.  Then, I found the special surprise of the day in my rice: AN INSECT LEG!!!  Now, I'll gladly admit that I'm not an expert when it comes to bugs.  I've seen plenty in my day, from cockroaches to bees and even crickets.  So, I can't say for sure which kind of insect that this leg came from, but I am absolutely sure that it didn't belong in my food.  After discreetly taking pictures, I called for the manager and showed her the evidence.  She tried to act like the two-jointed leg was a black thread as she held it up to her black shirt.  Good try lady- I may look dumb, but I am not stupid.  Long story short, I will not return and only recommend this place if you are really open to wanting any kind of extra protein in your diet.  Two photos of the leg are attached for your viewing pleasure."}
{"text":"Pretty good for the average Chinese buffet. Steam tables and kitchen were clean. Staff very friendly. GREAT beer specials!  For people that complain about cold food....that's cuz when you walk around for 15 minutes deciding what ur ass wants to eat...the food on ur plate gets cold!  The steam coming out of every single table would let you know the foods hot.   Overall a pretty decent place!"}
{"text":"Noodles tasted like dishwater. It isn't the best food. Not including the overwhelming smell you get when you first walk in."}
{"text":"I had an enjoyable visit to the resturant because I was with great company.  This buffet has a large variety of food, some good, some not so good.    I would have kicked in another star but the odor from the restroom wafted into the dinning area."}
{"text":"Sigh.... I despise giving restaurants only 1 star.  Ai-yah!  Is what my mother would say.  I feel like it's starting to become a clich for Chinese cuisine.  Name of restaurants must have the following words -- Super, Best, Jumbo, Grand, etc...you get the point (watch South Park episode 128 - \"City Buffet\").  Food was okay but nothing I couldn't have bought in a package and just added water.  I guess most Gwy-lo's wouldn't know the difference since it was a packed house.  Our service I must admit was excellent -- drinks filled and plates removed (Shi Shi!)  Ambience was nothing to talk about -- matter of fact I don't want to talk about it at all - Enjoy!"}
{"text":"Hey, I don't like buffets in general.  I don't trust places that offer all you can eat buffets. But since there are generally few decent Chinese restaurants in E. Mesa, I will go here a few times a year.  I expect the quality of food to be less than stellar but Saturday it was pretty bad.  My mistake was eating a small portion of food but I did.  I paid for it later-especially the next day when my stomach was attacked.  I can't prove it was the restaurant but it was the only place I ate for two days outside of my own cooking, so you put 2 and 2 together.  Anyway, this place has been going downhill for some time or maybe it just the summer when they do less numbers and don't throw anything away or serve food that has sat on a steam table for hours and then reheat? All I can say is I'm not coming back after eating here for many years."}
{"text":"Went to this place for lunch and was impressed. A big selection of food to choose from, very clean and a friendly and attentive staff. Loved the lo mein and those little donut things with sugar. Yum"}
{"text":"The food and selection are reliably good if you go when they first open or when they are ramping up for dinner. Never at the end of lunch or dinner. It's all just leftovers by then. Mostly old n' cold..  We went to the Avondale location Sunday night with some out of town friends. We had our handy 15% coupon that they distribute liberally in the local mail. When we went to pay they had forgotten to give us the discount.. When we told the cashier that  they had forgotten she asked for the coupon. We told her that they had taken the coupon when we were seated, as they always do.   She flatly refused to give us the discount. When we asked for the manager she claimed to be the manager. We told her what poor management it was to hassle us at all over a 15% coupons you can get on the internet.. We asked for the number for the owner. We asked if she was the owner too and she said \"Yes.\" -- Really??!!?. She eventually even held her hand out in front of our friends face.  I haven't been treated this rudely in a long time. Especially at a restaurant I visit fairly frequently with my family and friends.. We had just told our friends how good they were and then this happened."}
{"text":"Mediocre.  I haven't been there in a few years.  Perhaps I'm just not a fan of Chinese food anymore because I dislike Panda Express too."}
{"text":"This place has been closed down permanently,  apparently by the Maricopa County Health Department according to the notice posted on the entrance. I'm not surprised though, it was not very good food. Also, I got really sick from one of the food items the last and only time I ate there."}
{"text":"Decided to go here again last night with the family (not my choice). Didn't try the sushi or anything risky but was still up all night with #2. So was my mother.   Havent been in over a year and a half and def will never return."}
{"text":"First time to this buffet and I loved it. Coconut shrimp was delicious and nice sushi bar! So far for me best buffet on the East side!"}
{"text":"For my money the best of the 3 or 4 Asian buffets in this stretch of Indian School.  Recently remodeled.  Plenty of choices.  Most of the trays were the proper temperature.  I've been twice now and it was busy during the opening weeks but not so much the second trip which led to a few trays aging before getting empty.  I hope it develops the following in the neighborhood it deserves."}
{"text":"It was my hubby's decision to try this buffet.  They remodeled the Big Fat Greek Restaurant, ok.  My hubby has been sick after eating here.  And 4 days and counting.  =(  The only thing he tried that I would not was the clams.  Seafood at a buffet place has always been a no no in my book.    The rest of the chicken, beef, pork, etc dishes were ok.  Nothing special.  Some steaming trays were left empty, they did not refill food.    The service was outstanding (that is why 2 stars).  Try at your own risk!  Steer clear of the clams."}
{"text":"Nice friendly staff...too bad the FOOD was the worst that I have had in a while.  The food was cold and the spicy shrimp still had the nasty vein still in EACH shrimp.  I cannot believe they served the shrimp with such obvious dark veined UNCLEAN shrimp...sorry, it needed to be repeated.  There was not one dish that I enjoyed, except maybe the watermelon.  It was such a disappointment, especially since we were charged $8.50 for lunch.  Not that that is an outrageous amount, but you would think they would serve some hot food and  food that was at least edible.  Even my crab puffs where cold and not at all appetizing.  I can imagine they had to raise the prices because they have lost customers due to the food and it's lack of edibility (LOL, I know, it's a new form of word usage).  I tried each chicken dish, the Orange Chicken, no good...the Spicy Shrimp, already said...the General  Tsao's Chicken, no good...Coconut Shrimp, cold, cold, cold...not very tasty either...the Fried Fish, not good...looked like mystery fish, the tarter was no good...Chicken  Wings, dry and cold.  I had at least a taste of over ten (10) dishes, they were all cold and I did not enjoy one of them  I might have had something nice to say about the green beans but they were too cold to judge.    I would advise you to not go here, I suggest Linn's on Baseline and 40th.  Much better and worth the cost."}
{"text":"It's your basic buffet, nothing special, but nothing particularly bad either. Exceedingly so-so."}
{"text":"Just finished eating here with my family. The food was absolutely awful! All the meat was dry everything was very greasy. The lo mein was orange and tasted like chemicals of some sort!! Definitely will not be going back EVER.  Also very expensive $70+ 4 adults and 2 kids"}
{"text":"This place has a very large selection of food to choose from. It was very tasty and flavorful, especially the Pot stickers and walnut shrimp. I went for lunch with my two sons and it cost us $30, so the price wasn't bad at all.I'm planning on going back again another day for dinner because that's when they put the crab legs out. Only thing that annoyed me was the waitresses coming by every five minutes asking if everything was alright. I don't mind them checking on us but it was a bit too much, I like to be able to eat in peace, other than that this place was nice....."}
{"text":"Good place for a wide verity of food and a nice family hang out spot."}
{"text":"Negative stars if possible, save your money and time, go to another place then here. Service was bad to start off with and food was horrible. Will not be returning."}
{"text":"Horrible food, no flavor, got stomach sick after don't go here this location is already known for people going to the ER after eating here not a good place To bring your kids or family, friends."}
{"text":"Today was my first time at this buffet.  I had been looking for a good Chinese buffet for awhile. Since I am not from the area I didnt know where to look.  A friend recommended China City and it was well worth the trip.  My visit was on a Friday about 1:00. The food was all fresh and they were constantly filling up  the pans.  There is a very large variety of food choices and it was all very well flavored. It even has a sushi bar although I am not a fan of sushi.  I would definately come back here again.  During the week the price was 8.95 and I noticed that weekends it goes up to 12.95, but with the large amount of choices it is not overpriced.  I was pleased with my eating experience here."}
{"text":"Ok, so I don't know if I made the wrong choices but I went here on tues and wed night I started getting sick and here it is sat night and I still have massive stomach. Bug from this place. I got all the fish choices and broccoli and two pieces of sushi, I'm on a diet so I skipped all the fried choices or noodles.  I had to leave work early on Thursday and go to a little clinic to get seen, they prescribed me zofran for bad nausea and vomiting. I will never return back to this place. This was the only thing out if the ordinary I did this week and no I don't have the flu cuz I was tested for that at the little clinic cuz I was in so much pain. I just think their food is not kept at correct temperatures or removed when out for too long."}
{"text":"Omg, their food is awful. Quality was not to be found anywhere. $13 for a dinner. Just awful."}
{"text":"This was my first visit to this restaurant. I enjoy chinese buffet places. There was plenty of sushi for those who enjoy it. I enjoyed the Orange chicken and the Bacon wrapped Shrimp  was excellent. I t was cooked fresh and fantastic."}
{"text":"In my opinion this is so far the best Chinese buffet. The food is always hot, and refilled frequently. They have a wide variety of food, sushi, and an hibachi stir fry grill. They have desserts and ice cream, and the service is good. Our drinks were never empty."}
{"text":"Couldn't decide between this place or Village Inn to have lunch with my 70 yr old mother. Kinda wish we went to Village Inn instead. Interior wasn't very comfortable.  Random dirty tables, cleanliness just wasn't up to par. Some food was ok but unfortunately this will be our last visit."}
{"text":"Well worth it around 12 bucks for dinner ,the food was tasty, descent variety crab legs are always a plus"}
{"text":"The food was pretty good overall but if you are going there to have oysters don't do it. My wife and I had the oysters last Friday night, and we were sicker than a dog on Saturday and Sunday."}
{"text":"My husband and I were around the area and couldn't decide where to eat .I was in the mood for some variety and also wanted some crab legs so we stopped in. The cost was $11.99 per person which was a bit higher than other buffets in the few mile radius. But I was hoping it was because they were gonna have a great selection. We arrived at 7:30 pm and the dining room was about a third full. All the food trays were not full (not even half full) and the food looked like they had been sitting there for a while. I was just still looking forward to my crab legs though. Well the crab tray was never full and when it was replenished, they only brought out about a pound at a time. Let me tell you I wasn't the only person eyeing the new trays brought out,but I was the farthest from the buffet table. So I didn't get as much as wanted..just a couple legs. The majority went to a table of 4 big young men who had the eyes of a hawk and speed as fast as lightening. Oh well..So I told my husband he could pick the next place for us to eat at, even if it is fast food ...which I despise. We won't be going back here but I still wasn't able to leave China City Super Buffet behind after I left. My stomache started hurting on the drive home..."}
{"text":"My family and I have gone to the restaurant for many years--Ever since it opened. The food has always been good, the service is always great, and it is always clean. However, this past week I went for lunch (around noon). I noticed most of my items, which contained orange chicken, sesame chicken, and coconut shrimp, we're all cold. I didn't say anything cause I figured that it was maybe just a few pieces...until my girlfriend asked me if my food was cold as well. I have never had this problem here at China City. My food is always warm and delicious. Maybe just a bad day, or bad timing in the day with not enough people?? Review would've been 5 stars as normal if the food wasn't so cold :/ Sushi was good as always though!"}
{"text":"Lots of options and reasonably priced. What time you come in does determine how much of the popular items are available but if you are patient they are always quick to get fresh stuff out. Love the music, if I'm in a Chinese restaurant it's nice to hear Chinese music! Love that they use real plates, and the clean plate ratio is much better than golden corral, if you frequent buffets you know what I mean."}
{"text":"This location is always consistent when it comes to the food the serve when it is busy. If you go during down time you may see dishes that had been sitting for an hour or more under the lamp but that's to be expected when it comes to buffets. During dinner you are able to eat all the crab legs you can provided you beat the other customers to the tray when it is first put out but again to be expected from a buffet since it's first come first serve."}
{"text":"This is a pretty good restaurant. It has a much larger buffet offering than you would expect at a run of the mill Chinese restaurant. Parking can be a bit scarce but a spot is usually available.  They even have a bar for alcoholic beverages. A private room is available for groups."}
{"text":"Pros: A nice variety of choices; food not only looks good, but is hot and tasty as well. They have snow crab legs and clams, which my wife likes as well as other seafood. Clean establishment!   Cons: Can be very crowded on certain days with rude and pushy senior citizens. Waitresses are a bit snippy, but that has been the case with most Chinese Restaurants that I've been to (is it a cultural thing?)  Overall: I would recommend it to my friends."}
{"text":"I am a fan of this place, but its not as good as it gets.  It is one of the better Chinese food buffets I have ever been to, but only because of selection.  There is something for everyone here, and the people in charge let us bring our kids in and destroy the place and they seem to love em too.  The food is good, but not the best I have ever had, but I will keep going back to this place because of the selection and how easy it is to bring the kids without feeling like you are annoying everyone!"}
{"text":"Went there for a lunch date with a friend, food was lacking is the flavor department and it was all cold. Then, while we were eating, the music started skipping like it was on a scratched CD... Wtf . The service was okay, nothing to write home about, probably won't be back."}
{"text":"Nice staff, clean restaurant and freshly made sushi. The food isn't great quality, but when you can catch it right when it comes out from the kitchen it is fairly good."}
{"text":"A good test of Chinese buffets are their quality towards the end of the day. This place took the golden crab leg!!! Their selection was a mile long, top quality taste, and attentive and quick drink refills. My only complaint was that their desert plates and ice cream bowls weren't replenished as promptly as I'd like, and ice cream toppings are limited to chocolate syrup and rainbow sprinkles. Overall though, you will enjoy this new member to the Surprise community!!!"}
{"text":"This place is going downhill. We got here at around 6pm expecting them to bring out fresh warm food but they're all leftover from lunch and the \"Peking duck\" is discolored the the crawfish in the cold section by the sushi are rotten.  Never again. We paid $10.99 each for dinner and it's not worth it. We would rather go to the Pacific Seafood Buffet for a little bit more and guaranteed with fresh food. We kept waiting for them to bring more food out but they're hesitant.  Don't ever come to this place."}
{"text":"Awesome! Great attentive staff and great food! Especially the teriyaki steak and the flan!"}
{"text":"This place is ok. Taste like typical Chinese buffet food. Nothing special, nothing stuck out as being really good. Wasn't offensive. I won't be back."}
{"text":"This is now my go to Chinese Buffet in the area I live of only 3 different places available. The rating on this is based somewhat on that fact, not of all I have tried. I have been during lunch and dinner many times. One thing I can certainly say is they have a fairly large variety of items. Sushi is always fresh and a decent selection. I usually see the person making it each time I go. In seafood/fresh water critters, the peel and eat chilled shrimp are perfectly cooked every time, the mussels in their sweet chili broth is perfect (I have found several here and there where the mussel wasn't debearded) the baby octopus is also perfectly cooked. Coconut shrimp yum, seafood medley has tons of variety and is decent. The crawfish are exactly what you find anywhere else, usually overcooked no spices. Not surprising, I have yet to find anyone/place outside of Louisiana which even comes close to decent. The breaded frog legs used to have heavy pepper and spices on them and were the best I have ever had. They changed the outside to not much spices or pepper. Still very moist and good though. The crab legs are Not pre-cut thank heavens. I hate it when restaurants do this because it water logs the meat. Learn to use a freaking shell cracker people... The breaded butterfly shrimp are very good. Salt and pepper shrimp usually cooked perfect sometimes over cooked and mushy inside the shell. Stuffed crab is OK.  The cocktail sauce is ohhh so good. It isn't bitter or sweet, but is on the spicy side due to the horseradish. If they bottled it I would buy it I  a heartbeat.   The beef roast they have is decent. The problem is the knife they put out to cut the roast is as dull as a butter knife. Recommendation: Put a sharper knife out or at least a carving fork to hold it in place.  They serve spring rolls, but no egg rolls. I absolutely love egg rolls. I wish they would carry both like another place I visit does.   The Mongolian grill is decent on what they offer, the sauces need to be more flavorful. I wish they would add as an option minced ginger, hot oil. It is often grilled on the too well side.  Most of the other entree dishes are average in flavor. Pepper chicken pretty good. Teriyaki chicken sticks very good, crab Rangoon decent, if they were sweeter they would be better. Chicken wings/drumstick good.   The vegetables lo mein and Mei Fun noodles are hit and miss on tasting good. The fried rice is pretty decent.   The hot and sour soup needs a little more spice to it. Egg drop soup is good.  The desert bar area is the usual. Coconut macaroons always on the dry side, the banana pudding and wafers could use banana pudding instead of vanilla it would drastically increase the quality. Tapioca pudding is on the very bland side, recommend to upgrade the quality of the mix for the yogurt machine. The honey coated wonton need much sweeter honey, more sesame on them. The flan is bleh. I have never received sub-par service on any of the many many occasions I have gone. I feel often people set extremely high expectations on many restaurant waiters. Don't be afraid to raise your freaking hand if you want water faster, or more napkins or a bee fork that may have fallen. People aren't mind readers... and it is a freaking buffet. I always ask for a pitcher of water every time so I don't need to wait. I do this anywhere I go.  Recommendation to owners: Things I wouldn't mind seeing added to the buffet, peanut chicken in peanut oil, for Mongolian grill - skewered shrimp with some crawfish spices on it. Skewered lamb kabobs, sesame-ginger beef, any type of curry dish, sesame dough balls, lemon chicken."}
{"text":"This is one of my favorite buffets! They have a big assortment of foods and every time I've been there everything was fresh and wonderful! I love their sushi and crab legs (after 4), the service is great and everything appears to be clean. The bathrooms are clean and the overall experience has been wonderful. I have been to China City several times ( over 5) and have enjoyed it each time!"}
{"text":"The food needs to be rotated out more often so it stays hot n fresh, but it is really good otherwise.  They do not use MSG and have more than enough choices that should please anyone. The take out is by the box, not weight, so that is a plus, cram that thing full...  Anyhow, the hot tea is not complimentary, which is odd, but the drink prices are low and refills are free for soda.  The music is WAY too loud most of the time and the waitress once they bring the check expect you to pay or sign your slip right away and can be a bit annoying by saying; you need to sign, you need to sign now and keep walking by, very rude!  Anyhow, if the place could get a couple of those things under control, it would be just about perfect.  The bathrooms are clean and they keep the food area clean. We will come to eat here again, but if the music is loud again, they will either need to turn it down or we will leave..."}
{"text":"Its a chinese buffet, the mongolian was not good imo but I have been to very good Mongolian restaurants. the sushi while not great its not that bad. and they do have some good entries in the buffet."}
{"text":"Half year ago, My husband and I went to try this place based the reviews and my friend's recommendation.After that we came here all the time.We really love and enjoy here.The environment is comfortable.The food is always fresh,tasty and healthy.I love sushi ,LoMein,orange chicken,coconut shrimp,sesame ball,bacon shrimp,crab legs... TOO MANY FAVORITE CHOICES!The Mongolian BBQ is the best one that I have ever eaten.The staff is very friendly,they will make some food for us that we like even though it is not on the buffet bar, and it will be NO extra charge. This is the best chinese restaurant in the valley.       I don't understand why someone slandered this restaurant,but I think it's too immaral.If we really don't like this restaurant,do we such need to attack it?True and false,good and bad will be shown after we experience in this restaurant."}
{"text":"Sushi was sub par wasn't the best didn't taste super fresh rice was very moist and didn't even move. The food on the other hand was great a lot of choices and interesting foods."}
{"text":"We came because we were told this place was good. However the experience was anything but. First of all the food is very limited. Second of all our waitress was the rudest person we could have ever encountered. They put is in the corner when there was plenty of table available. It starts off with drinks, she kept pressuring us to decide what to drink when we had just gotten there. When it was time to leave she drops the check and says pay. Excuse me? I just received the check, we wanted to split the check but she didn't give us a chance to do anything but pay. She then tell us to tip her in Spanish and points to the tray. I go and ask her why she's telling us to tip her when it's not required. She kept trying to tell us that she thought we didn't know it was separate and extra. She's rude from start to finish. I would save my money and go elsewhere."}
{"text":"Food is mediocore at best, the waitress who is supposed to bring refills took forever to bring us more. And then when she gave us the bill almost demanded a tip. Sorry but poor service will get you nothing."}
{"text":"Had the opportunity to visit China City on Saturday, 8/30, early evening (around 6:00 pm).  Now ... I have been here probably 20 or 30 times over the past several years.  It was great (in the beginning).  As time has gone by, the quality of the food, the presentation and the physical decor had diminished.  Last night, unfortunately, it was a new low.  One of the major reasons that I go here is that they serve crab legs on the buffet.  Last evening, being there for an hour, the crab leg pan was refilled ONE time - after 8 people were standing around it waiting.  I left about 40 minutes after that, and it hadn't been refilled.  In fact, MOST of the steamer pans were left to go almost empty.  Also, the heat of the steam tables didn't seem up to temp either - had a very luke-warm bowl of the Hot & Sour soup ... guess what ... it was from the bottom of the serving container.  Do I detect a theme here?  The sushi that I had, while it used to be rolled nice and tight, was all falling apart.  I will say, that the variety of rolls has gotten better since I first began visiting, though - I think there were more than 12 different rolls available last evening.  Teriyaki chicken, on a stick ... that chicken never even saw a bottle of the teriyaki sauce, much less had any on it.  Fried Shimp ... WAY undercooked and mushy coating (shimp inside was cooked though).  All in all, I may have to reconsider visiting here any more.  I have been to several buffets that are currently better than China City is now, but I won't name any names - not fair to China City."}
{"text":"Well, I'm not a fan of buffets in general and certainly not Chinese food buffets as they tend to be overly greasy and laden with MSG. Even though this place certainly wasn't fine dining, it was pretty good food as far as buffets go. They had a decent variety of entree items. Some did not look appetizing to me but the ones I tried fortunately were all a-ok. My personal favorite was the shumai (but aren't those always good?)"}
{"text":"Sub-par food.  My mom found a mosquito in her food.  That was enough for us.    On a bonus - the mommy in me - They have a baby changing station in the bathroom."}
{"text":"Lunch is priced very well around $8.49. I don't remember exactly. Drinks are about $1.69 more. Not too bad. It's your typical Chinese buffet like you'll find across the country. Food is good. Well worth the low price."}
{"text":"Really enjoyed the food. All was hot and table service was prompt. Would definitely come back."}
{"text":"The food was terrible. The soda tasted like it had been watered down. The sweet and sour sauce tasted watered down as well. The beef in the beef & broccoli didn't resemble nor taste like beef at all and the orange chicken had little to no meat on it and was mostly breading. I felt sick shortly after eating the beef and broccoli. Most of the food didn't look appetizing. On a positive note the spring rolls were actually okay. Definitely would recommend going to a standard Chinese restaurant as the quality of the food here is low. Though the variety of food is impressive the quality will greatly disappoint you."}
{"text":"Always looking for new buffet adventures and this one was rather excellent.   Sushi at a buffer is a plus and it was really good and a large selection.  They had quite a good variety and good quality overall.  With every place like this, there's always specialties and other dishes aren't as good.  Plus, everyone has their own personal taste, so I'll say this, fried rice was a little salty and duck was tasty.  I'd check it out again."}
{"text":"This place is EXPENSIVE. 13.99 a person we spent 35$ for 2 people to eat a sub par buffet. Its mostly seafood and its not really that great. Its good just not amazing. The server was really Nice she was fast to clean our table and get us drinks and refills. But i was just upset at the price. I feel like buffets should be like 10$ a person. The ice cream sucked the desserts sucked. I felt like there wasnt allot of good options. But allot of seafood options if thats what your looking for. It was ok just not good enough for the price."}
{"text":"The food is not quite four stars.. but it's a freakin' BUFFET! I've never been impressed with sushi at buffet places either, but this place does a decent job. The nigiri was yummy.   Basically, don't be afraid to try it."}
{"text":"yea it's ok...not bad, not good...ok.  $12.95 for dinner on Friday prob cuz they had crab legs, which looked  small we didn't try them, and they had shrimp and fish.  selection and service are fine.  weird crowd but we got in and out fast."}
{"text":"The food actually quite nice. But the service was not really nice. It was the first time for me in there and once I took the second plate, they took my glass (they though I am finish) and forgot to put it back. When I asked, \"excuse me, where is my glass?\" The waiter said, \"Oh, I will get a new one!\" without say sorry. It was a small problem, but quite unconfortable for me to go back there."}
{"text":"It's my first time in here, came on lunch time. It was busy and lots of customers. The interior looks similar as you enter Chinese buffet but more bright and fresh. The service was great. The waiters always seek the table that just finish and eager to clean it right away.  The sushi display was nice and the size of the sushi wasn't as a big roll like a Californian rolls elsewhere, it was a perfect size for sushi in my taste. The rice noodle, well, little bit blend. The wontons was OK. The vegetables was great, it wasn't too soft or overcooked.   The location very strategist because it's near Costco, Ross, and Marshall's...LOL..What else that you need, right?  I would like to go back to this place to try other menu on the weekend (I wondered if they have crab legs and pork belly).  PS: no cash back (incase you wonder;) )"}
{"text":"I had dinner there on a Saturday. Everything was great EXCEPT THE PRICE! WOW!! A WHOPPING $15.56!!! PLUS A TIP!!! TWENTY BUCKS!!! I will go to China Harvest  for $9.38 at Cactus and I 17. And no tip there. But great food and experience. After leaving \"China City Super Buffet\", even though the food and service were good, I will never return. I had a terrible case of buyers remorse!"}
{"text":"So very disappointed.  Terrible service.  We had to get our own drinks.  Workers were on thier cell phones.  One lady doing all the work by herself.  They cleared plates only once.  Food was sub-par.  Only positive was that there was a large selection of food.  Very sad and over priced."}
{"text":"I went for dinner last night and the food was old, cold, soggy and bland.  The hot and sour soup was OK, but everything else should have been tossed out."}
{"text":"Food is average and the waitresses are rude. They demand you tip them. If you don't leave your tip right away when they ask you to pay, they get angry and ask to be tipped.  Will not be going back."}
{"text":"The world is your buffet so put on your stretchy pants and enjoy!  The reason I come here is for the BBQ ribs, the mini steaks, and noodles. I also like the crawdads. Other than that, the food is pretty standard Chinese buffet faire. Don't cone expecting the world's best egg drop soup or pants-dropping fried rice. Be real and be reasonable, y'all.  The waitresses here are good looking and the place is pretty clean. 3-stars all around!"}
{"text":"I'm writing to save you so money.  My husband and I went to for dinner over an hour before closing time and were extremely disappointed.  Over half the items were empty and the ones that were there had a spoonful left.  Not one item we ate was warm/ hot.  I could forgive all that if they had the basics, but they didn't.  The food we were actually able to eat was not good at all.  I had a salad, something you would think is hard to screw up, not here.  The lettuce was completely drowned in water.  They did have a Mongolian BBQ station  for you however, it was already cleaned and this was not an option for us.  Maybe it would be better earlier but I can't imagine by much."}
{"text":"A plethera of food many many fresh hot plates too choose from .  not the typical chinesse restraunt you are greeted and taken care by a very very cheery staff that make you feel at home. The plates are bussed as soon as your done a bountyful array of tasty food awaites the decore is fresh. The booths are very comfortable."}
{"text":"Heavy on the seafood, not so heavy on the wallet. They have beer and sake! I'm already impressed. Vegetarians, prepare to hate me forever. I had:  Bacon-wrapped shrimp: I was skeptical at first, but this was good stuff! Tray after tray...piping hot...this seemed to be a real hit with customers.  Orange chicken: Good, and had so much of a kick to it I thought it was supposed to be General Tso's! Whatever it was, I'd eat more.  Honey chicken: Tasted great, but I have no clue why it was so oily. Watch out!  Mushrooms: They look better than they taste.  Coconut shrimp: Just regular shrimp in a delicious coconut sauce. Can't get enough!  If you raised your kids to be pussies who can't handle food that's different, you can grab them taquitos and pizza. There's something for everyone.  There's also a Mongolian grill, which you should try, and some pre-made sushi, which look good but should never be tried at any buffet. Just stuff your face with delicious chicken and fish, and wash it down with some Tsingtao and Sho Chiku Bai when you're thirsty. Buffet is only like $9, not including tip. WORTH IT. So while it's not by any means the best Chinese buffet I've checked out, you are for sure getting a good value. I'm a fan."}
{"text":"Came here for what I can best describe as a disappointing, boring lunch. There aren't many hot items to choose from, and like many other buffets, have several varieties of chicken/shrimp that all taste the same. It's pretty bland and unimaginative.   Well, except for the sushi, I suppose. They churn out California rolls very fast, so kudos.   I know that any AYCE place demands the diner lower their standards for quality of a meal, but this falls even below that...often, items are overcooked and dry.   The worst part was that I apparently came within an hour of dinnertime...which is like 3pm, I guess. About 15 minutes into my stay, many items disappeared, replaced with new food that said \"dinner only\". Some of these, like bacon-wrapped shrimp, were clearly premium items. Others seemed quite arbitrary. A new flavor of the exact same item, for example, could be restricted. Strange.   It was also a hassle getting refills. Staff constantly circles tables, but ignores empty drinks until you explicitly say, in a kind manner, \"WTF are you blind?\" They're really just there to police staff and charge extra if you grab a dinner item, not all of which were explicitly marked. I understand the model they're trying to pursue, but it's unwelcoming to basically have someone follow you around and watch you eat.   So the service blows, as does the food. The only part I enjoyed was the soft serve frozen yogurt at the end. I probably won't come back."}
{"text":"Went for dinner It was packed. We were seated quickly drink order was taken right away. About four buffet tables with table along the back room. Ok food looked like they been under a heat lamp for awhile overdone. The fried food was soft with no crunch. The sushi looks big but all mostly California rolls with different sauces and dry paste looking spicy tuna the chunks of fish look really good but it was frozen could not even eat it. After girlfriend felt sick and ruined my drinking night. Remember just my experience."}
{"text":"Out of the Rand approved buffets I have tried so far, this one is my favorite. Claire and I met Rand here for another leisurely lunch.  We were greated and drink orders taken and off we went to inspect the spread.  There is mongolian bbq, a sushi bar, and all the standard items you would find at a chinese buffet.  Everything was hot and fresh and delisious.  The ratio of meat to veggies in the broccoli beef was great!  The coconut shrimp was not too sweet.  The orange chicken was very good as well.  The Lo Mein was wonderful with the noodles being done just right.  The fried rice has a good amount of egg and veggies as well.  And the string beans had a lovely sauce on them and some nice garlic but not too much.  Nicely done!  Egg rolls were NOT greasy and the crab rangoon was very good too.  There was a large array of fruit as well as cookies and frozen yogurt for dessert.  Service was great, drinks filled and plates cleared fast.  The restaurant was clean and comfortable.  Even when it got busy it did not feel crowded at the buffet.  The prices was very resonable and for kids under 10 you can't beat $3.99! Claire enjoyed the fried chicken wings, shrimp, and won tons.  And went back for more!  Of course she had frozen yogurt for dessert too! Overall all I was very pleased."}
{"text":"This has become my go-to place for a buffet in the East Valley as the quality and variety is top of the line for the price ($13/person if I remember correctly)... They have crab legs, custom sushi bar, mongo. grill, etc..."}
{"text":"I have been there once. The reason I went was because we received a flyer from them claiming to be the best and cleanest restaurant/buffet in the valley. When we got there and were seated it was anything but. We sat right under an air vent that was caked in dust and was falling all over our food. Oh and then there is the food which is slightly worse that the dcor. The food was not at legal temperature for human consumption. Some dishes like the orange chicken were even cool to the touch."}
{"text":"This buffet was good! They had a huge selection of food and sauces. I think the cost is a little pricey, I understand it's because of the crab legs and seafood options but I wasn't interested in that.  Husband said the sushi was fresh and good.  The restaurant was clean and the food was hot and there were no empty trays.   The only reason it's 4 stars and not 5 was because of the signs plastered everywhere warning you of a 20% increase for wasted food. I only take what I think I can eat but when I was finished it had me worried that I was going to be charged for the 2 pieces of meat and leftover salad that I couldn't finish."}
{"text":"Awful food, nothing was even \"good\". Potato salad on the salad bar tasted rancid, sweet and sour sauce tasted like heated cherry koolaid. Chicken for sweet and sour chicken was dry and tough. Spring rolls had horrible flavor and were very greasy. Paid $58 for a family of 5 huge huge waste of money."}
{"text":"Please do not go and eat here! I have only been to this place once and I will never be back. My visit was short of how bad the experience was. 2 days later after visiting this place and I feel the need to write my experience. I visited this place with my family Saturday night, we hadn't seen each other all day and we were starving and didn't want to wait 20 minutes at another restaurant so we decided to try this place. First of all they didn't charge us at the entrance which I suspected it would be a bit pricey but i didn't really care because maybe the food was worth it and we were just very hungry. Anyways we were sat down on a dirty table that I began cleaning with napkins that were left behind by the previous people sitting there the waitress looked at me while taking in the order for our drinks. She never said anything, my husband sat down and jumped back up because he was on spilled drink. She pulled out napkins and placed them on the table, I began cleaning and didn't make much of a deal about it. We got up and began serving ourselves, their were many options of food but that was fine. As we sat back down our 2 year old began eating. He was eating his beef broccoli and became disgusted by it, I thought it was normal since sometimes he just doesn't like the taste of things, I didn't pay much attention to it and just gave him water to water it down. When I pulled my drink back I noticed my water was extremely fogged up and then began to notice their was a lot of hard rock soup outside my cup that I couldn't scrape off. So I left it aside and said to myself I'd tell them to take it back, then I noticed my husbands cup was cracked from the bottom and was leaving a mess. Their was nobody around so we waited on our drinks and left them aside. We began eating and my husband told me the broccoli was very sticky and tasted funky, I ate one piece and realized it was expired. It had such a foul smell to it. I pulled a piece out of my plate and began inspecting it, their was growing FUCKEN Mold on it. I pulled my toddlers plate away from him and inspected his bro oki too, it had growing Fucken mold!!!!! I was beyond upset!!!! I couldn't believe it. I began to complain about it a little out loud so someone would hear me. People kept staring at me but began to eat, no waitress came around I had to wave at one. I asked her for the check and she looked at me and said that's it? I said yes we are done here. She obviously knew their was something wrong. She took our money and I followed her, I didn't wait for her to come back to our table I was just ready to get out of there! She gave me my change I took it and left. I paid $40 dollars for 2 adults and a 2yr old that ate moldy broccoli. I will never go back to this place and I will never forget this horrible experience. What a scare! It's not fair that people are so inconsiderate and selfish about what they put out there! Yes it was a bit pricey considering we didn't eat much but it's not about the money. I am writing this because my 2 yr old was put in danger of getting sick because the people that run this business obviously don't care about what they are putting out there.. they are just their to take your money."}
{"text":"Pretty great! Buffets are never the best but this place was one of the better ones I've been to. Even was brave enough to try some sushi. not bad! If you're in the area give it a try. Also was impressed with the price. 21 bucks for me and my boyfriend and two drinks. Definitely a value!"}
{"text":"The servers are so unfriendly (seriously) here and the soda is always flat, tea is instant and cloudy. If you want sushi you have to find someone that will make it and they are not in a hurry. The owners wife hangs out talking with the waitresses and lets her kids run around. My son loved this place for some reason so I have been more times than I care. Now we have found a better place down the street off Signal Butte :)"}
{"text":"This place was horrible. Food looked like it had been sitting there from the day before. Cook and waitresses where sitting there playing on their phones. Had to ask for fried rice, in a Chinese buffet are you freaking kidding me. Will never go back to this place again.     Tried to continue with no stars but would not let me (zero stars)."}
{"text":"I've been to Chinese buffets around California and Arizona and this has got to be the best.  The sushi was wonderful and there was a wide range of American-Chinese food to Asian Chinese food.  The price was wonderful, the restaurant was clean, and the staff were attentive.  A+"}
{"text":"OK I checked this place out for lunch and.....  I missed some delicacies, but for the most part the typical fan fair of Chinese food on tap.   I was craving pork buns, the sticky rice in green leaves, the small buns with the sweet egg yoke in the middle... Besides those things I found everything else, orange chicken, Mandarin beef, chow mien, coconut shrimp, sushi, and the typical fruit deserts and small cakes.    I was surprised that they had traditional ice cream.  I found mint, cookie dough, chocolate, pineapple, vanilla, and a few more I can't remember. Most Chinese buffets have the yogurt machine with a cone so I was glad to have some real ice cream for a change.   Right next to the ice cream, cakes, and desert I was still trying to figure out why croutons and bacon bits sit right next to them???  Almost to the point I wanted to ask someone, but lost my thoughts as I gazed at the ice cream I should not be eating.     This all for 7.99, not a bad lunch with a glass of water, watch the drink charge at 1.65 for a soda...  Puts me over the top in cost so I stuck to the water.  If you are in the far west side in Surprise check it out."}
{"text":"I've learned my lesson. Do not come here when it's not busy! Like 8:30 on a Tuesday night. The food had obviously been sitting out for awhile and most things were cold and unappetizing. They didn't even have someone behind the counter doing the Mongolian BBQ... :( Very sad."}
{"text":"Love coming here for a chinese buffet. Food is good and place is clean! They kinda rush you on the check when your still eating but regardless i love it here."}
{"text":"Buffet used to be our favorite chinese spot on our side of town that was until we came on a Monday night.  The service is good and the options and selection is good.  This place has Mongolian BBQ, Sushi, and all the typical Chinese Buffett fair.  It is pretty clean for the most part.  They do not replace items as much as I think they should so I find that some of the food taste lets just say not so fresh.  If you go here go on the weekend and use a coupon.  They have pretty cheap beer so I suggest getting one of those too.  I would also suggest only going on the weekend or when they are busy because they do not replace the food at all on the weekdays when its not busy.  They let it sit there until it gets eaten."}
{"text":"Oh goodness where do I even start. The customer service was okay, but the food was really not that good. They had a lot of old items out at the buffet bar that looked like it had been sitting out for 3 to 4 hours. I've been to my fair share of Americanized Chinese buffets , but this one was really Americanized and when I mean Americanized I mean it tasted so bad there wasn't even a hint of authenticity was in there. Most likely I will not be back. You would probably have to drag me. The only reason why I did give it 1 stars was because they had a pretty wide selection unfortunately they failed to deliver on the taste. My wife and kids didn't really care for it either and besides you really can not take the kids word for it. Thank God for my wife's cooking though and by the way she is Asian and her food is awesome!"}
{"text":"Absolute worst place to eat. The food was very undercooked and cold. The staff seemed sweet but they weren't very customer service oriented. I will never eat here again."}
{"text":"This was quite bad. Do yourself a fbir ad drive an extra 5 miles to Signal Butte and the 60 if you must have crappy buffet food. At least that place is decent."}
{"text":"We went there last night because we heard of the all you can eat crab legs... The crab legs had no flavor at all. None of us liked any of the food there. We wrong be back.  On a side note they were very friendly."}
{"text":"Tried this buffet for the first time. Food tasted old even though they told me the sushi was fresh the avocado was clearly brown. Had to pay for refills for drinks...Not coming back...."}
{"text":"Easily my favorite Chinese restaurant in Mesa. Only complaint is the sushi chef is almost always very snide. Makes me feel guilty for wanting sushi  but the food is always fresh and amazing"}
{"text":"1st off, on the positive...we thought the food was good. We enjoyed the Mongolian Grill.  But that's where they lost us as customers. We went up to the Mongolian Grill and the man at the grill cooked our food. Great. Enjoyed it and came back for another dish. After it was cooked, I noticed the man who cooked our grilled food was staring/glaring at me and was mumbling something that I couldn't understand. He then physically picked up a tip bucket/shaked it in front of me and it became apparent to me he thought he deserved a tip than and there. Thinking this was extremely rude, I didn't leave any tip and he muttered something again/made a few noises.  Finding it hard to believe how rude that was to treat a customer, I mentioned it to the person who was supposed to be the \"manager\" and told her calmly about the incident. She basically said \"sorry\" and left our table and didn't offer anything beyond that.  We tip at the end of our meal and are decent tippers for good service which is 99% of the time. In any case, we will NOT be back at this restaurant based on how we were treated by this rude man working at the Mongolian grill. There are too many other dining choices in the valley to have to deal with rude employees."}
{"text":"What can I say, I love buffets where you can get a little bit of everything you like. And if you get a drink, prepare to have it refilled constantly. I had to stop the waitress after my fourth refill! Food-wise, I love their spring rolls, hot and sour soup, egg foo young, and bbq pork. Many other yummy items too!"}
{"text":"Visited the buffet restaurant today with 2 friends.  Food assortment hot and fresh for the most part.  Restaurant looks clean.  Service adequate UNTIL we paid.  When we were finished we asked for separate checks; laid our cash in the trays.  The server came to retrieve the bill and started counting the money from the first tray.  She noticed that my friend had given her $9.00 for her bill of $8.74.  The server got loud and started telling her that there was \"no tip\", \"no tip\", \"no tip only $.25 cents tip!!!!\"  She asked my other friend if she wanted change back from a $10 and she said yes.  Again exclaiming \"no tip!!!!\"  She did not talk to me; grabbed the monies and returned with the change.  We were going to leave her a tip on the table until she became so rude.  Can't believe her behavior.  I don't know about my friends, but I will not return.  Too many restaurants in the Valley."}
{"text":"One of the one times I'm glad I saved a coupon from my Valpak in the mail, got a 15% coupon off the dine in buffet! On the weekends dinner is $12.49 and with the coupon we only ended up paying$11.72 tax included! My hubby didn't eat cuz he doesn't like Chinese but I was happy! They had sushi, Mongolian and Chinese, also a small section of American food. The waitresses are very nice and was always checking on us!   You pay after you eat, which is new to me because most places make you pay first. Also just a warning make sure you eat all your food because they charge you 20% extra on your bill if you waste food! Overall was a good dinner experience, taking away a star for having to tell the buffet refreshers twice that they needed to bring out more crab legs lol."}
{"text":"This place is your typical chinese buffet. They have the typical entrees: general tso's chicken, sesame chicken, beef and broccoli, chow mein noodles, fried rice, crab rangoon, egg rolls, egg drop soup, blah blah. On the plus side, every trip I took to the buffet they always had a pile of hot snow crab legs, steamed clams, and shrimp cocktail. At most chinese buffets you are waiting for them to refill these seafood items, but here they are always full. If your in the mood for seafood, and not chinese, you can come here and be satisfied."}
{"text":"I'm struggling with the rating to give.  The restaurant was clean and open. Food selection was good. I was impressed with the snow crab legs. They weren't the skimpy ones you normally see at a Chinese buffet. But they soak them in the water too long. Causing the shells to be soft and hard to open. I prefer the shell still hard so it's a simple bend and snap to get to the treasure inside. I was excited I didn't have to fight for them either. Lol.  They had crawfish but it was in the cold dish area. But they tasted delicious.  As for everything else, fail. Everything my husband got was Cold. Everything I got was room temp. Their hot and sour soup was good. But the other stuff we are was cold and it was dinner time.  If I go back I'll stictly go for the crab legs, horns sour soup, and crawfish."}
{"text":"The food is usually great, half the plates are usually dirty, the service is usually awkward or unfriendly.. and I'd be scared to see the kitchen. But hey! The food is usually great ;)"}
{"text":"I have a saying:  Q:  How do you ruin a perfectly good buffet? A:  Put the word \"Chinese\" in front of it.  I've lived by that mantra for many years, and it is definitely the rule and not the exception.  But the reason I keep wandering into these places is because I harbor this burning ember of hope that someday, somewhere, I'll find a Chinese buffet that won't make me wish I had some of my ex-wife's cooking again.   Along comes China Buffet.  It's conveniently located just about a mile from my own bathroom, so I figure I'm pretty safe giving it a try.  I am immediately drawn to the Mongolian BBQ, as it is one of my very favorite things in the world, and no one else in my minor-league hamlet of Surprise, Arizona has one.   I load up and hand it over to the grillardin, who expertly transforms it from a giant uncooked mess into a delectable, thoroughly cooked and seasoned mess.  While I'm waiting for the makeover, I check out the not-very-old-looking sushi bar and the usual Chinese-buffet selections:  Beef and Broccoli, Sesame Chicken, Kung Pao Chicken, Sweet & Sour Chicken, Mongolian Beef, Fried Rice, etc.  Naturally, not knowing whether I'd return, I must try one of each.  It is an exercise I know will enrage my lower intestines, but my curiosity overwhelms me and I dig in.    To my surprise, I find most everything I try a solid \"above average.\"  Granted, given that the average is pretty freaking low, that's not saying much, but two things must be considered:  (1) I gave the place 4 stars, and (2) I have returned a few times since this initial expedition.  For better or for worse, China City Super Buffet is now my go-to place for quick and easy Americanized Chinese food.  It also has a decent drink special - buy one beer or glass of wine, get the 2nd for $1.  That's hard to beat.   Bottom line:  China City gets the job done at a reasonable price.  It ain't P.F. Changs, but you know that going in.  I'm hoping it sticks around for a few years, so I don't have to go out and search for another Chinese place."}
{"text":"Came back here yesterday about 2pm. Service was great... didn't have a long wait and my water was refilled frequently. Really can't say there was a bad dish..but the salmon and coconut shrimp were both perfect! They had a nice broccoli salad, a stir fry counter as well as fresh made sushi...no nigiri for lunch but I do believe they put some out for dinner. Either way the rolls They had were proper temperature and tasted great. For dessert I had a slice of flan which was great and their banana pudding and banana dessert. Likely will be back even if it is 2.5 hours on a bus."}
{"text":"The food was fresh. They never ran out of food and they have a nice selection, more than typical Chinese buffets. The staff is really nice and overall nice atmosphere."}
{"text":"Will not return. Our food was cold, didn't taste good & service was not friendly."}
{"text":"Horrible food. Went with a group of three, and the others couldn't even eat a plate. I tried to force myself to eat more then that but it's too bleh. Would not recommend. Have to find a new place for dinner tonight now.. Thanks"}
{"text":"Ok first I want to say how funny I think it is that some of the reviewers ate at this buffet and found that it wasent the Ritz.  It a buffet. what did you expect... With that said I have eaten here twice and brought some family once and everyone loved it, is the beef and broccoli the best in the world, of course not but its pretty darn good for a buffet.  Over all the food was above average buffet quality, the selection was great, the mongolian bbq was great and the service was really good."}
{"text":"It's an all you can eat place. It has decent food. That's enough for me to give a decent rating.  One dining thing I have to say is that some tables are too close to the food and the tables in general are too close. I don't want anyone near me and I don't want steam up in my grill while I eat. It was so hot and nasty where we were seated.  There's two dishes I do have to criticize though- the friend rice was crunchy. Unacceptable. The broccoli and beef was soggy and not good. Everything else was okay.  There are better Buffets than this so I am not sure if I will return."}
{"text":"I've been to this restaurant maybe 5 times as of yesterday and it was the worst experience I've had . My husband and I walk in let the lady know table for two she tries and set us over to the right in a corner where there's about 8 booths or so and I realized there was some Africans whom look like they were a whole party that came from Church,I'm mixed with African American , Mexican, and white and my husband is African American. I felt like I was getting categorize, because when I look over in the other area it's whites ,Mexicans, all kinds but my color.So when we walk to the booth we want to sit the lady doesn't set our silverware down she drops it down , I almost wanted to leave at that point but we were both hungry and didn't want to find somewhere else to eat.The staff here have never been to friendly."}
{"text":"The food is very good. They make the sushi right in front of you. The prices are reasonable. I like the stir fry grill. You pick out a plate of items from the buffet table and they stir fry them for you. It's like having your own personal stir fry. There is a large selection of food to choose from. This is my favorite Chinese restaurant"}
{"text":"Horrible, almost inedible food.  The sushi absolutely is not sushi and nothing tasted good.  I will never eat here again.  The one behind walmart is much better."}
{"text":"This place is disgusting the food is horrible do not waste your money. They don't have a variety and what they do have it's under cook poorly made"}
{"text":"I've been going to this buffet for years. The staff is genuinely polite and great to our kids (two energetic boys). The food is wonderful and fresh, I highly recommend the coconut shrimp. They have a sushi and Mongolian bar too. You won't be disappointed. Great location and atmosphere. Not overpriced-they fare with other buffets in the county. Definitely my top two Chinese buffets. You won't be disappointed."}
{"text":"I reviewed this Restaurant as great with a good selection of well-cooked Chinese and American dishes. That was true when I we dined there last June, but how things have changed.   My wife and I re-visited this Restaurant last Monday. Before going, we called to be sure that they offered all-you-can-eat crab legs during the week. We were told \"yes.\"  When we arrived most of the food on the buffet must have been placed there hours ago. Fried shrimp as cold, as were several other dishes I tried. We tried to get crab legs, after a 30-minute wait a small plate of them were placed in the steam table for the restaurant to share. By the time we go to them, they were gone.   We spoke to the manager with hopes that she would correct the issues...nothing happened.  After another 15-minute wait, we left, hungry, upset and down almost $30.  When paying our check the manager approached us and said \"sorry about that.\" So are we. We were optimistic for this restaurant, but they simply missed the mark."}
{"text":"Going to get my son his dessert and a cockroach runs past my shoe. I tell the manager and she tells me it's okay, they know and have someone coming to spray. Then she stomps on the cockroach, pats my shoulder and goes back to the front desk. I grabbed the kids and went to the register. No sorry, no discount...absolutely unbelievable. I'd give zero stars if I could."}
{"text":"Nothing spectacular about this place. Same ole, same ole,spring rolls. Mongolian beef ok cheese on the imitation crab good, same crab as anywhere else. glass of house wine is Gallo-forget it! Saki-good Sushi, limited, no real raw fish Octopus was good Really loved the deep fried sweet little shrimp Pork Shu Mai was good Won Ton soup looked good, but was full by then. Must be 60 or over to get the Seniors discount, not 55. Mayby I was not that hungry. I will try again."}
{"text":"Pretty good food. A good size of variety and option. I know my fountain drinks and it does have an after taste to their pepsi. The food is good though. It's no pf Chang but it not the worst I've had. I'll more than likely come back."}
{"text":"Horrible, HORRIBLE, HORRIBLE.  I seriously think they must use the same food until it's all gone.  It's probably been sitting out for days.  It is probably the worst restaurant I have ever been to."}
{"text":"This place started out well when it opened.. But they start doing what all other new buffett places do, by starting to \"cut back\" by not preparing fresh food as often, and restocking less often, especially for their \"costlier\" items.    Lin's down the street, on the other hand, do a great job of keep their standards up!  Hence the lines out the door whenever you drive by!"}
{"text":"Fabulous food, casual and great prices. I adore the ceiling! Sushi and banana pudding make a happy girl."}
