{"text":"Do not order from here....we are at Rainbow Babies with a post open heart surgery 4 month old and wanted something besides hospital food. Charged my card twice forgot my crab ragoons and the food was mediocre at best."}
{"text":"The only thing nice about take out from this restaurant was the delivery driver. . Most disappointed in chicken with black bean sauce. . Chicken was spoiled and had to be discarded. . Spring rolls burned,  greasy,  wontons needed knife to cut. . Order taker rude,  rushed me off line,  promised extra egg rolls for those not included in order with my next order. . Spent over $30 for this miserable excuse for dinner. I will not be ordering again.  I. advise: Save your money."}
{"text":"If I could give this place 0 stars I would. They are rude food is always over cooked and they are over priced. They try to rush you off the phone when you are trying to order and the place smells funny when you go in. AVOID this place at all cost.."}
{"text":"AVOID this restaurant!!!!

We ordered delivery service from this restaurant for first time. She said we have to wait for 25 minutes. We called again at minute of 60, she said our food is one the way. Then nothing still 1.20hr later, we called again, she said the driver just left. WTF, it means she lied in the previous call. At the end, we canceled our order. She was really rude on the phone."}
{"text":"Two hours twenty minutes to deliver order refused two days later got a charge on my credit card for the refused order had to call bank to dispute"}
{"text":"By far the Jankiest Chinese restaurant in town. Creepy ass driver always making comments about coming in my house. Further more the food is always cooked hard, the rice tastes like old grease and the kids answer the damn phone. They charged me twice and when I spoke to the manager about when I was going to be refunded she got really defensive and raised her voice. I asked why she was yelling at me and she said you yell at me first (never yelled never raised my voice). She hung up on me after yelling at me when all I wanted to know was when to expect my refund. I  had tcall her back and explain to her that people usually say 7-10 days 7-15 days etc, she contunued to say she didn't have to give me that informatino before she finally told me. WILL NEVER DO BUSINESS HERE AGAIN!!!"}
