{"text":"This is a new place the wings are really good prices are really good too everything I had was good the crab rangoon the spring rolls I even was able to get an 8 oz side of wing sauce sweet and spicy for just $2 and some change I had the sweet and spicy wings my mother had the Sesame wings with large fried rice I will be back they even allowed me to take some menus to take to work!"}
{"text":"Food was amazing! Did the shrimp fried rice! Portions are large and less than $10. I'll definitely be back to this place."}
{"text":"Came after bible study to pick up dinner. Food is always great here. I feel confident eating here because it's not filled with junk that normal American Chinese food spots can be. Called my order in of shrimp fried rice and sweet and spicy wings that other yelpies have raved over. All was good and enough to have lunch the next day"}
{"text":"Extra! Extra!! Read all about it!! Freedom Drive now has Chinese restaurant. Staff was friendly and my food was fresh and ready in  less than 10 minutes. They also have delivery options. So far, I've tried the veggie delight dish, chicken fried rice and chicken wings. Everything was fresh and not overly soy sauced. Plus.. the chicken looked like chicken. (Sounds funny, but... you know what I'm talking about)  I give this place a 10! No wait!  5 stars is the highest rate."}
{"text":"I'm very particular when it comes to Chinese food and this spot won me over on thr first visit. Very good. I will be back again. I got sweet and spicy wings with shrimp fried rice.  No complaints."}
{"text":"So we were on the hunt for a new Chinese restaurant since our usual has been constantly on the low list of health inspections and I couldn't chance it. I looked on yelp and discovered this place right down the street, and I'm glad we did.  This might seem minor....but when i called to place my order, they quickly and clearly repeated my order and gave me the total. You don't know how many times i place a Togo order anywhere and i have to hurry up and try to ask them the total before they hang up.  Now to the food, I'm sure I've found my new favorite Chinese spot! My husband ordered wings with their sweet and spicy sauce. I definitely wish i ordered them after trying a piece, the sauce was delicious! He also ordered shrimp fried rice which was a decent portion for a small. Now I've always been iffy about ordering shrimp from Chinese restaurants because sometimes they don't devein the shrimp. This one does, plus it was huge pieces, plus it tasted fresh!  I ordered the chicken and garlic sauce combination that comes with fried rice and an egg roll. I usually give up my egg roll because it's just a greasy mess. However, i tried theirs and it actually was delicious with lots of flavor! The chicken and garlic sauce was great with a good proportion of chicken and veggies.  Try this place out, you won't regret it!"}
{"text":"Best Chinese food in Charlotte. Large amount of food for a good price. Go there once a week. Takeout only"}
{"text":"let me know your thought about my place. we try our best to make everyone happy. new lunch menu available."}
{"text":"Top of the line quality Chinese food without going to a sit down establishment.  Great service also, definitely should check them out"}
{"text":"This is one of my top restaurant to go get some really awsome asian food.the best hands down.you will not be disappointed. And i have be ordering from this place for years.go try it out guys & girls.the prices are great.clean atmosphere."}
{"text":"I live in the area. Coming from a place that has a Chinese restaurant on just about every corner (Hey NYC) I was glad to find this place in the area.  The place is easy to find even though you might drive right past it if you aren't paying attention. There was a good amount of parking. I usually order shrimp and broccoli with white rice. This shrimp and broccoli did not disappoint. I would say they don't use as much sauce as they do back home but I was still satisfied. It wasn't really that cheap either lol. Then again who wants cheap Chinese anyway?! I'd say if you are in the mood for Chinese and in the area definitely give this place a try. I'm definitely going to try some of the entrees. I wish there was an outside place to sit but blah it's okay. Maybe that's in the near future?! Lol"}
{"text":"I don't understand all of the high ratings and positive reviews! First, what chinese restaurant does not have soup? This one! Do you want  Hot mustard with your order? No! They haven't got that either.   What about Chopsticks?? Strike 3! Seriously?!?!??! No chopsticks???? The sauce on the lo mein was eh. The fried rice is blah! Yes, the portions are large but.... who wants large portions of sub par food???"}
{"text":"First time eating here and it's great! Nice and clean, no you can't eat inside, only take out but it's awesome !  FYI.... I order the 6pcs sweet and spicy wing w/ spring fried rice, awesome!!!"}
