{"text":"Pretty Westernized Chinese food, low prices and big portions are the order of the day at China Ocean.  This very humble spot has the reputation for being the BEST Chinese in the neighborhood.  My empirical research shows this neighborhood to be contain of the lowest densities of Chinese restaurants in the city.  Hell, on a per capita basis it might be in North America!    Ambiance-wise, this place screams RUN-AWAY.  Seriously, it looks as though someone built a nice small Canadian-Chinese restaurant in 1976, power sprayed it with bleach and left it in the sun to dry for 35 years.  They do a brisk take out / delivery business and I am amazed whenever I actually see people occupying one or more of the 4 tables in the shop.   The food? Well that's just it...it ain't bad! For old-school terribly Westernized Chinese comfort food they make it the way we like it; fast, hot, and cheap.  Golden Oldies like General Tso's chicken, Chop Suey, and Moo Goo Gai Pan represent pretty well here.  The Shanghai Chicken noodles are surprisingly fresh tasting, and the Malaysian Chicken Fried rice sneaks a little sub-continental flava into the mix.  Why do I mention only chicken?  The beef here is overly tenderized for my taste, so I go for the chicken.  They offer quite a lot of seafood, but to be honest I haven't gone there.  There are some Thai dishes on the menu; Don't bother.  Most of the noodle based items hit the spot pretty well on an empty stomach in winter.  The lunch specials are generous and very well priced.  They're served from 11-3 at the lower price and rather than take them off the table, they just add a buck after hours.  Fairly done!     Trying to impress someone? Keep wallking. Need a quick, hot, cheap, tasty lunch or dinner for one? Munchies (I did say it was a throwback ; ) - You've found your spot in Bloordale."}
{"text":"My expectations were pretty low but this was still disappointing. The shanghai noodles were super bland, flavourless, with barely anything in them. The other dishes were equally disappointing - some of which we didn't even make a dent in...  Would not recommend."}
{"text":"Finding myself in need of chinese food this weekend, I found this place on Just-Eat.ca for a delivery fix.  We went with egg rolls, spring rolls, sweet & sour chicken balls, General Tao chicken, chicken chop suey, and steamed rice. General Tao chicken was the best of the bunch but it was all pretty generic and nothing really stood out for good or bad reasoning.   But for a big bag of food to come delivered to my door for $37 after tax before tip, my needs were met and who knows, maybe I'll even order from them again sometime upon my next craving of generic chinese food."}
{"text":"Been ordering from this place for years, but tonight I ordered SPICY PEANUT BEEF, which defies description. A gloppy curry sauce around a few onions and re peppers with a couple of dozen heavily breaded bits of mystery meat. Other than the curry there was no flavour of beef or peanuts. Whoever looks after flavour at this place was on vacation. The Szechuan noodles weren't. The bbq Egg Foo Yong was scrambled eggs and bean sprouts. Why can't I find a decent Chines Food Delivery place in this huge city that has a smattering of knowledge of Chinese Food and quality"}
{"text":"the food here is gross and the portions are preety small. thought i would pull the trigger on a new chinese food place take a chance... I made the biggest mistake coming here... The spring rolls are the worst i have ever had the sweet and sour sauce taste like ketchup mixed with plum sauce. me and the wife took a few bites and the rest of the food went straight in the garbage. never again if i could put 0 stars i would;"}
{"text":"After having heard through the grapevine that China Ocean was \"THE BEST!!!\", I understandably had to stop in and try it for myself. If you've ever walked by this dingy Chinese restaurant and have either not noticed it at all or immediately dismissed it, you'd be forgiven as I have done the same myself. The yellow and red awning is oddly both loud and dull at the same time. The storefront windows are filled with sun-faded handwritten menus and bad photographs of house special dishes. You know what I mean: Pretty much all of the usual signs of a typical grungy Chinese restaurant can be expected here.  It was on a quiet weekday during the late lunch hour that I finally visited China Ocean. Upon entering, a very friendly Chinese lady ducked her head out from behind a TV set over the counter to greet me. While the completely empty dining room was a bit of a concern at first, the non-stop ringing of the phone for take out and delivery orders as well as the eventual influx of hungry regulars was very reassuring.   Off of the $5.50-$6.50 lunch specials menu, I chose the black pepper beef on rice. The dish arrived piping hot surprisingly quickly. This fact also made me less doubtful of their promise to have most phoned-in orders ready in 10-15 minutes. As expected, the portion size was very large for me (although probably merely sufficient for a bigger eater). The flavour was surprisingly close to what I would deem authentic (v.s. Canadianized) although I found the beef a bit too tenderized.   This wouldn't stand out in Chinatown, but in a part of town where cheap eats are a dime a dozen and the options for ethnic cuisines are so plentiful, China Ocean represents!"}
