{"text":"Horrible service. They messed up on my food and refuse to fix it. In addition to that non of them speak English well enough to resolve issues instead they just want to argue with you. I told the lady who took my order 5 times to make sure my chicken is well done. The chicken was not well done and I checked it in front if the delivery boy. Who does not speak a word of English. I will never waste my lunch time on these idiots again."}
{"text":"Our usual place for take out and my \"lunch date\" days with my toddler. Free soda with the lunch special is always a plus. Staff is friendly, food is good, and it's close to home."}
{"text":"tiny little place, lunch took 25 minutes to come out, the rice was yellow, not brown, not fried rice, the chicken was awful, i would say DO NOT go here. We were very unhappy."}
{"text":"I am not one to eat Chinese food very often, but my Mom was in town recently and she said she wanted Chinese. So, I looked to Yelp for locations near by. Chinese gourmet came up and we took the chance.  The food was really good! It came out fresh and hot in very generous proportions. The lunch specials are definitely the way to go if you can make your mind up on only having one dish.  When you walk inside at first it is a little confusing if it's a sit-down and order, or go to the counter and order sort of place, but They will cater to both sit-down and take-out.  Furthermore, prices are more than reasonable especially for the amount of food given and the location is easily accessible. -B"}
{"text":"This place is amazing. The hot and sour soup was better than any others that I have tried.  The sweet and sour was the best I had in a long time. The rice was prepared perfectly. I even had an awesome fortune cookie. This place is me new favorite."}
{"text":"My boyfriend and I were headed to Cafe Rio and decided we were going to finally give this place a try instead. I'm so glad we did! The service was absolutely amazing. We received all of our food very fast and it was really good! Plus you can't beat the 5.95 lunch special! Soup, wontons, a really large meal with your entree and rice and chow mein! And our server gave us free spring rolls, we don't even know why! I will definitely be returning and bringing people!"}
{"text":"I've worked in some really good Chinese joints and this one is good. Nice quiet place for a date."}
{"text":"Great food, great prices, fast service, very friendly staff. This is a little hole in the wall restaurant. The portion sizes were so large we couldn't even finish half of the food, and this was from the lunch menu. There isn't a buffet so the food is very fresh."}
{"text":"Just had orange chicken and shrimp with Snow peas, both with chow mein noodle.  The portion was OK, flavor was OK, the price was cheap, chow mein was soft and over cook, very soggy, The worst I ever had.  I should have listen to my kids and went to Panda Express."}
{"text":"Great food always great service. Food always comes  out fast and is hot. Chai tea is great but a lol high priced compared to ocha there's is 3.00 and huge."}
{"text":"The delivery service is amazing and the portions of food are greatly satisfy. Personally love ordering chinese food from this place."}
{"text":"Quite tasty, with low prices. Menus mostly not in English, no air conditioning, but a good variety of umami deliciousness. I had the wonton noodle, husband had eggplant in pork sauce, portions were big enough to take another meal's worth home for $10."}
{"text":"Gross! It was just gross! The chicken, the fried cheese wanton disgusting! Gave one star because I had to!"}
{"text":"BEST CHINESE FOOD IN VEGAS! Lunch specials are under $6 and they are generous portions.   It is located on Sahara and Ft. Apache and they even deliver. I've gotten deliver to Tropicana & Hualapai and even Lake Mead & Rampart.   They always have coupons for free appetizers, $5 off and $10 off. Love this place!"}
{"text":"Made a last minute stop tonight on Christmas Eve. First timers and the food, service and prices were great!! Definitely recommend!"}
{"text":"Love getting this when I am craving some Chinese. They are so helpful and give generous portions."}
{"text":"Really enjoyed the servings.  On-line ordering was easy & arrived within 10 mins of inputted promised time. Was hot & ready to eat upon arrival"}
{"text":"Ordered cashew chicken n garlic chicken. Food was tasteless. Not like the tasty Chinese food I'm used to. Had  a weird taste and smell. Very disappointed. I also ordered The fried wings, it was the best."}
{"text":"I've been going to China gourmet since it opened on March,2011.and It is great. I have NEVER experienced either bad service or bad food either the delivery order or inside the restaurant. This is one of the better Chinese restaurants in the area. If you eat in, the service is great, food is ready quickly and is always fresh and tasty. Their pot stickers  are some of the best I've found in the area (and I eat Chinese food a lot), and the Orange Chicken & General Tso's Chicken are delicious. The Mongolian beef is another one of my favorites, and when you order this dish, you get enough food for at least 2  meals.If you like Chinese food and haven't been to China gourmet,, it's definitely worth checking out. You won't be disappointed."}
{"text":"Very disappointed in the food and staff . I order General Tso chicken and when I bit into the chicken , the color was almost black and it had a weird funky taste , completely inedible. When I showed the staff my issue with the food he told me that's how  some of their chicken looks and that it was just \"dark meat\" . I assure you that chicken was not right , I asked if I could replace it with a new dish of equal or lesser value (I mean I was completely disappointed in the food and I have been a customer a few times)  he kindly told me there was nothing he could do and that I just had to deal with the food or buy something else . I've worked in plenty of restaurants and there's a better way to handle unsatisfied customers (especially repetitive loyal customers) . Won't be returning . Besides that , very mediocre cheap Chinese food ."}
{"text":"Ok, 4 stars because of the food alone on this one. Scary looking on the outside, and kindof on the inside, but clean behind the counter. Very gracious and nice staff. Had the coconut chicken and it was fantastic. Way better than any other hole in the wall Chinese place in Mesa that I have had. If there are bad reviews it is due to the fact that they are pissed about the long wait times, and you know how pissy people get when one thing goes wrong (I mean I don't blame them, I think grandma is in the kitchen making all the food, which may be why it tastes so good) Call at least an hour ahead an place an order, I mean this, I happened to walk into this place and it took more than an hour because of all the orders they had to fulfill, but definitely well worth the wait! It loses two stars for me because of the wait time, and that it kindof looks run down, but again, taste of food brings redemption with me, so four stars!"}
{"text":"Mongolian Beef & Chow Mein Was So Good!! My Two Year Old Ate Everything So I Know The Food Was Good."}
{"text":"We usually order the dinner family b meal. Usually awesome food when ordering on the weekdays, when we order on the weekends delivery takes a little longer and you can tell that there is a different cook on staff. Food is always awesome with the weekday cook, the weekend cook seems to leave a little to much grease on the food. Over all, one of the better Chinese places around."}
{"text":"This is my favorite Chinese restaurant! I personally love chow mein style noodles & they're delicious here! They have a great lunch menu with such reasonable prices & amazingly large portions. Whether eating in or getting food to go their food is quick and always hot. Highly recommend!"}
{"text":"Love this place recommend it to anybody fresh food cooked in front of you no preservatives made the way you want it you get your food piping hot and fresh"}
{"text":"The food is so delicious. We love dumplings and noodle. The restraunt very clean and owner very nice. We have breakfast and dinner in one day. Couldn't wait next time visit. BTW, they open 8 am for breakfast."}
{"text":"The food is good but I'm disappointed at the stinginess .. They give plastic ware but I ask for 4 paper plates and was told I have to pay a dollar a piece? Really? Horrible business practice over something like plates!"}
{"text":"This is a hidden gem.  Best Chinese food I have had in years and the staff was very friendly and catered to what we wanted.  Was ready in about 10 minutes and it was so fresh.  I am inspressed!"}
{"text":"The food was no good, customer service was horrible. After I tried the orange chicken I did not like the lady gave me a hard time, I'm never going back. They couldn't even exchange my meal they said I'd have to buy a new one, and after I complained they were pointing at me and speaking in Chinese."}
{"text":"Really REALLY bad food! This is NOT a good chinese place. Not indicative of good chinese food at all. I ordered from here by accident and I would NEVER order from them again. The food was bland and flavorless. And at the end of the night, it didn't sit well with me.  And in addition, they said it would take 1 hour to deliver, it actually took 2 hours. Arrived, the food was cold and soggy. There is a MUCH MUCH MUCH better restaurant in Gilbert if you really want chinese food. It's on Gilbert and Baseline. Look it up - you won't be dissappointed! Sorry China Gourmet, I gave you a fair shot - spent $50 on a variety of food and none of it was good. And adding insult to injury, the fried chicken was black (as if it was spoiled).  REALLY???? UGH"}
{"text":"I thought China Tango was good. This places blows them away with awesome courteous staff, fresh great tasting food and the best value in town."}
{"text":"Food was amazing with amazing price to go with it. Orange chicken and noodles is what I had. The chicken was crispy very different from other place I've had."}
{"text":"Very good war wonton soup, although they use ground chicken instead of pork in the wontons.  The wontons are very light and the broth isn't overly salty.  We also enjoy the shrimp lunch specials (shrimp chop suey or shrimp with snow peas) and my son is a fan of the sweet and sour chicken.    The egg drop soup is boring.  I have ordered takeout from the restaurant quite a few times and the employees never seem to remember me or have a clue about my order.  Oh well... I'm looking to have a relationship with the food and not the people. In any event, one of the better Chinese food options in Las Vegas."}
{"text":"The food was okay for the money. I'm still looking for really good Chinese food delivery in the area."}
{"text":"They changed and were very friendly and accommodated my vegan needs. The cooks had gloves on and seemed more clean this time around."}
{"text":"So I was craving Mu Shu Pork today and my old go-to for it is out of business.  A quick search on Yelp offered up this place.  I called ahead to place my order and was told it would be ready in 5 minutes!  Wow... I was expecting 15-20 minutes!  When I got there, the place was clean and the staff was friendly and attentive.  Now I love Mu Shu Pork, and while not the absolute best I've had (at far more expensive places), this wasn't too far off!  For $8.25 the order came with a large carton of Mu Shu Pork, a large carton of steamed rice, four wraps, and the coveted Plum Sauce.  I ate two stuffed wraps with some rice on the side, stuffed the last two wraps for later, and still had slightly under 1/2 carton of Mu Shu and a ton of rice left.  For $8.92 with tax, you can easily feed 2-3 people delicious Mu Shu Pork - try doing that at Panda... Oh wait, that's slightly more than a single combo plate at Panda... plus, they don't even have Mu Shu!"}
{"text":"Glad I came by for a bite. 1 of the better Chinese food places around. Fatman gives it 2 chins up!!! Food was fast and fresh. Enough to conquer the appetite but not a ridiculous amount where you throw food away. Excellent lunch specials. Highly recommend."}
{"text":"Crab rangoons were A+, top notch. Hot and sour soup was okay but a bit bland. Definitely could have been spicier.  I called in for pick-up though and even with me being a bit late getting there it was still piping hot so appreciate that.  I would go again"}
{"text":"Very good. One of the best lunch specials in town. Whenever I'm in the area I try to stop in. Their Mongolian beef is the best on the Westside of town."}
{"text":"Good food, service ok. They usually have functional conversation no pleasantries. I keep returning because the food is all that."}
{"text":"I am a person who like the seafood, Salt &pepper calamarihoney walnut shrimp are my favorite. My husband sticks to the basics, General Tso's chicken, crab Rangoon, and house fried rice.:p Everything is always delicious.  But this is not why we love dining here. Every time we take our two-year old daughter to dine in the restaurant,The servers are polite and always bring the high chair in time,they always smiling at my baby.At the end of your meal, they always say thank u and carefully packed my left-over food for Togo.those details make me comfortable to stay there more than the food itself.And honestly the food is better than any other ones near this area(I've been to try once in china a go go and that was terrible:() Anyway,,We love, love, love it here. lovely food, lovely chef and lovely service. And the prices are unbeatable. Every time I see my check is less than 20 bucks, I feel like I've stolen from them, like, with prices this low, how can they still be in business? With the lunch specials, you also get soup. I believe the hot n' sour soup is the best cause even my little girl she wanna eat more."}
{"text":"Some of the best Chinese food we've found in Las Vegas so far. Everything cooked fresh to order. Service is fast and friendly. Definitely recommend! Love the house special chicken and sesame beef the best!"}
{"text":"I LOVE the cashew chicken and the walnut shrimp I can't get enough every time I get paid I go there and order both and use the coupon for free crab rangoons! They Are Excellent for a small strip mall Chinese food place!!!!!"}
{"text":"Best Chinese food in Gastonia. With great service and very clean!"}
{"text":"I went here today instead of my usual place because I just didn't feel like making the drive.  Well, as the saying goes, when you cut corners....  Bleyck! I spent like $20 on 2 items and they are both going in the trash.  I'm not calling to argue with them and i'm certainly not taking it back because then I've made 2 trips and I really don't want them to replace it with anything.  I won't eat here again.  I've never even written a review of a restaurant but it was so yuck I had to.   I ordered veggie chow mein and honey walnut shrimp.  The shrimp was absolutely swimming in sauce, like drowning in it, and it took me taking it out of the container and putting it on paper towels FOUR times to get the excess off.  Secondly, for those who don't know, honey walnut shrimp uses mayo in the sauce.  They had used so much that I could see white swirls in my (strangely lurid ORANGE colored) sauce and it tasted more like mayo than it did anything else.  After that it was partially edible but the taste is off (no it's not bad shrimp \"off\") and didn't taste honey or walnut at all.   The chow mein tasted greasy.  When I looked in the container afterward I could see at the bottom a good half inch of oil just sitting there.  The noodles were drenched.  Even my dogs who love to beg had no interest in trying a noodle and they've eaten stuff off the side of the road.   I have no idea how this place got 4 and 5 stars previously.  No idea at all.  I will NEVER go back."}
{"text":"So, after reading the reviews and finding most the negatives to be about having plastic cutlery and disposable plates, I decided to try this place. I did sit outside in my car debating whether or not to try this place and I am glad I did. The service was pretty well to my suprise and all the food was fresh and tasted delicious.  I had the general tso's chicken lunch special for about 6 dollars and was pleased(free drink included). Coating was still crispy, sauce was flavorful and not overly spicy, and to top it off the chow mein was thick and not too oily. Normally, I do not eat the americanized versions of chow mein but this one I scarfed down. This is on my to go list for good food that will leave your belly and wallet satisfied."}
{"text":"Chinese food for me is my comfort haven and I will spend a high dollar amount to have the best, if need be. But, either I've been looking in the wrong places or quality Chinese food just doesn't exist in Las Vegas. I'm originally from California and I never had this problem out there. I just have to have the best when it comes to something I love so much, especially if I'm spending my money on it because there's nothing like coming out of pocket for food that is sub par or below average.  So anyways, I've been searching for \"authentic\" good tasting Chinese food since my arrival to Vegas 10 years ago. I've been going to China Gourmet for about 2 years now, switching up and trying new Chinese restaurants in between. Never again. Nope. I'm always left disappointed when I branch out to the other places. None of the Chinese food places I've gone to comes even remotely close to China Gourmet. From my knowledge of what constitutes real Chinese food, China Gourmet is as close as you'll get.   I ordered Shrimp chow mein, Shrimp fried rice, General tso chicken, 4 egg rolls, Crab Rangoon, and because I used a coupon that I received in the mail, I was able to get a free appetizer. I chose the butterfly shrimp.  Normally I get my food delivered (they deliver) but decided to pick up this time since I was in the area. I was greeted when I walked in and the employees were nice enough. I was told the wait time would be between 10 and 20 minutes. I believe my order was ready within 15 minutes, so brownie points there.    When I got home, I didn't eat right away, but rather 3 or 4 hours later, and guess what? The food,(ALL OF IT) was still piping hot!!! I was super impressed.   The shrimp chow mein was very flavorful. Not too many veggies, the shrimp were plentiful and large, and most importantly, it tasted like traditional chow mein! The noodles are on the large side, which I do not like, but all in all, great dish. The shrimp fried rice is super good! Love it. As with the chow mein, there is no shortage of the shrimp they give you in the shrimp fried rice. Also, I need to add that the portions are enormous! Seriously, you get so much of everything. The general tso chicken is really good too. Not as spicy as I'd like, but still very good. The egg rolls are large, have crispy wrappers, and the veggie mixture inside is not mushy. I love to eat them with the red sweet and sour sauce they give you. Crab Rangoon was my favorite of the appetizers. They've got a kind of sweet taste to them, but not overpowering. A must try for sure. The butterfly shrimp, I didn't enjoy too much and probably wouldn't order again. They are decent in size but a little flavorless and not crispy. But, they were free so I ate them.   As I mentioned above, I've been ordering from China Gourmet for a while now, and I've also tried other dishes they offer, which include honey walnut shrimp, orange chicken, and sweet and sour chicken. All of these are amazing!! And don't forget you get large portions here!!!   China Gourmet is it if you want great tasting Chinese cuisine. Delivery times are reasonable, wait times for pick up is fast, and price wise, you can't go wrong...very affordable for the portions you get.  I should also add that this is a dine in restaurant too. It's located next to the Smith's and Starbuck's on Nellis and Sahara. It's small, but plenty of seating is available.   Check them out!!"}
{"text":"it sucks because I really want to give this place a five star.  They are clean and friendly and that is a major plus.  But the food has been OK I am writing this review after three deliveries.  1. Order Wontons:  Awesome! Cheese Ragoons:  Pretty good. Egg Rolls:  Not a fan and one more try. Cashew Chicken: Great! Sesame Chicken:  Not good when you took a bite you could really taste the flour and you could feel the flour texture in your mouth.  Wont get it again  Rice:  Great.  2.  Order Family Deal B: Egg Drop Soup:  Wife thought it was good... I am not much of a fan of any kind so I reserve judgement. Egg Rolls:  2 nd time no good Wontons:  Awesome Ragoons:  Great Cashew Chicken:  Great Sweet & Sour Chicken:  Awesome! I like the fact they keep the sauce off till after delivery. Rice:  Good but we were short an order.  3.  Three Entree Order Wontons:  Free and delicious  Chow Main:  Seemed a lot like lomein and never thought I would say this but they for sure do not use MSG and you can tell in this dish.  It was just missing a little bit of that butterness that you get with MSG.  But it was OK had worse had better probably wont order again. Sweet & Sour Chicken:  Awesome our number one dish Orange Chicken:  Same exact issue we had with the Sesame chicken.  Could really taste that flour and felt the flour texture.  We are OK with experimenting with more the prices are not bad and so it is OK at least one dish is always good to eat."}
{"text":"Love this place!! Best Chinese I have found in Vegas! Great prices and friendly staff! Frequent this place often. Service is very quick. Never have to wait more then 10mins even when we've gone in with a large party."}
{"text":"They honestly have the best beef chow mien ever. The food in general is freaking delicious. The prices are a little pricey though. Overall, delicious. Oh and the green apple boba is a MUST."}
{"text":"I just bought food from China gourmet and let me tell you IT was AWFUL, AWFUL....The service AWFUL and food was even more AWFUL!!!!! . I ordered the Singapore style Rice noodles and let me tell you it sucked and AWFUL!!! The Dish tasted like Indian food. Explain that??? How is it that an Chinese Dish taste like an Indian Dish?? The noodles where sooooooooo dry and it had lot's of Curry powder and toooooooo  many spice's. I just want to be clear that Indian food is very delicious, but when you go to a Chinese restaurant you expect to eat Chinese food. I could of gotten better food and service at Panda Express. NEVER, NEVER, NEVER, EVER going back to that AWFUL place.... . People trust me you are better off going to Panda Express or Teriyaki Madness."}
{"text":"I've order this place a few times always as take or delivery, never dined in. The few times I did pick up my order the place was well kept and on the smaller side, but nice. I had my lunch break coming up this past Monday plus the place is near so Chinese it was!   Every time I had delivery the food came faster than the quoted arrival time, huge plus! Not really something I would count on every time but you can be sure they will be on time or earlier. This time around I ordered their lunch special which runs from 11am to 4pm. It's your choice of entree with fried rice and chow mien on the side. For the entree I had sweet and sour pork. The entire meal was good. I like that the sweet and sour sauce is served in a styrofoam side container, rather than already being mix before serving. Most the time I don't order this because it could come with too much sauce. I only used a little sauce and it made me have some control of my meal, win. The pork came fried and was still crunchy and hot after delivery.   I'm going to order again, it's just a matter of time."}
{"text":"Chicken lettuce wraps were a hit with 2 very hungry men:  flavorful,  light yet fulfilling. Pad thai noodles firm and tasty not oily and mushy. Delivery was on time. Food was still hot and packaged nicely. Very pleased & satisfied."}
{"text":"We order beef noodle :) awesome !!! Best broth !!! With tomato. Dumplings ! Eggplants ! ???? like it :)"}
{"text":"Yum yum yum! The food was delicious and they give such large portions we'll be able to enjoy it again tomorrow! We ordered the egg corn flower soup, egg rolls, chicken chow mien and sweet and sour chick - it was all fabulous! Ordered over the phone for pick-up and it was ready in 5 minute!"}
{"text":"Great place for lunch.  I've only had the General Tso's chicken and it is consistently good.  Minor complaint....the music."}
{"text":"Great food and service. Lunch specials and even though its fast food, its a sit down restaurant where they come to you to take your order. Tried different fast food, chinese places in town and by far our favorite"}
{"text":"Wanted to try a new Chinese place so we ordered through Door Dash with an estimated 42-52 min. delivery window. Food arrived within 35 minutes, order was correct and food was hot. Pork fried rice, combination Chow Mein, Paper wrapped chicken and Sweet & Sour chicken were all very good. The portions are really big at a fair price and we'll be eating it for a couple more meals. Definitely keeping China Gourmet in our favorites. I love when a meal meets our expectations!"}
{"text":"Excellent food. Very fresh. I really liked the Sweet and Sour Pork. We have been looking for a really good Chinese take out. Prices good too."}
{"text":"Entering an empty restaurant fills me with trepidation, but as it turns out, this is a relatively new restaurant that I hope will stay in business. The waitress is super sweet, the flavors are on point, and the prices are inexpensive.   - the veggie dumplings were great. Getting them pan fried means they come out with an awesome golden, perfectly crispy, unbroken crust.   - the pork loin clay pot is actually more like a bim bim bop than the usually saucy stew common at Chinese restaurants. The pot comes out hot, with the rice crisping underneath the fried pork strips, carrot, cucumber, and black fungus. Loved the flavor of this one! I think the rice is cooked with meat stock and garlic flakes.   - the seaweed cold dish is massive - an entire dinner plate!   - the food comes with a millet porridge, which my parents loved. When my mother expressed how much she likes it and asked how it was made, the waitress launched into a long explanation  that they only use a certain kind of millet imported from China (after trying every other millet they could find), where to buy it, how much it cost, what the bag looks like, and how to cook it. Then she gave us a container to take home.   Easily my new favorite Chinese place in Vegas!"}
{"text":"My expectations of chinese delivery places in Gilbert or Mesa are pretty low, but this place is SOO much better than anything we've ordered in the area before.  I'm actually eating my kung pao chicken now and was moved by its yumminess to hop on Yelp and write a quick review.  The portions are very generous.  The food is actually pretty darn good and they deliver."}
{"text":"I have to admit I had my reservations entering the restaurant in the morning (before its posted opening hours on Yelp no less). It was quiet and the ambiance of the restaurant - a weird mix of a renovated cashier booth mixed with old-school Chinese take-out tables and cheap chairs - did give me pause. But goshdarnit, the breakfast food here is a bargain and this is THE place to be if you want authentic, traditional Chinese breakfast. Fried dough sticks, congee, noodles, soy milk, etc. all await you if you stop here for breakfast. $6.00 got me soy milk with fried dough sticks, a side of pickled shredded radish and a soy sauce-marinated hard boiled egg. For under $10, you can get a real hot breakfast that is the ultimate morning comfort food. I was so hungry I ate everything before realizing I forgot to take pictures. Not sure about lunch or dinner but this is definitely going to stay on my list of preferred Asian breakfast joints."}
{"text":"Family and I ordered takeout here the other night.  Great food. Got the Gen Tso chicken extra spicy although it wasn't near spicy enough for me it was still very good. Also ordered sweet and sour pork, egg rolls, pot stickers and chicken chow mein.  Nothing was greasy like you get at other places and it was all cooked fresh. Really enjoyed the food.  Thank you."}
{"text":"In the confounding flurry of Chinese fast food, dine-in and takeout that plagues most large cities, it's nice to find a few oases of fresh, great-tasting choices that don't come floating in their own custom sized pool of grease and whose visits don't require a commute worthy drive.  The number of good reviews attracted my eye to this tiny make-to-order restaurant almost hidden in a strip mall near our house in Summerlin.    I called in wor won ton soup, sesame chicken, string bean beef, moo goo gai pan and vegetable chow mein to a very friendly girl on the phone.  They had it ready to go in less than 10 minutes so it was waiting for me when I arrived.  The meats are tender without being chewy or fatty, the sauces are satisfying without over-the-top sodium and the chef's vegetable choices did not obsess on bell peppers nor large unwelcome chunks of yellow onion.    Every dish was great!  My taste favored the moo goo gai pan and the chow mein.  Wor won ton survived the challenge of serving piping hot broth that doesn't over cook the vegetables once poured in the to-go container but the broth was somehow lacking something.  Lots of left overs and enjoyment to be had by all."}
{"text":"In Vegas, Summerlin area, want Chinese food, this is the place.   Fastest restaurant delivery we ever received in our lifetime.  Food hot and fresh like we dined at the restaurant. We decided on a chicken night!  Ordered Chicken fried rice                  Chicken egg foo young                  lemon chicken  Would order items again, really enjoyed them!!  Also best to go order packaging to ensure everything was perfect, order was double or triple bagged things packed so nothing would spill, slide or move."}
{"text":"ate here a couple times enjoyed the combo rice each time the salt and pepper chicken wings go crazy i must say but i do not like how they cook they're sweet and sour chicken by the photo its cooked in the sauce but when u actually get it the sauce is on the side definitely not a big fan of this method . must say i will most likely be back being that theyre in my proximity"}
{"text":"My family loves going there when we want Chinese food! They more variety of food to choose from & the quality of the food is really good! There boba slushy is not bad also. I just like how they have some Thai food in their menu.... they usually get our order fast but the food are tasty!"}
{"text":"I could only give this place a 3 out of 5.  They used to be a 5, however lately the general tso chicken has been way over cooked and too crunchy.  It used to be lightly breaded and tender, but not in the last 2-3 times, sure hope they did not loose there awesome cook.   I order the kung pao chicken, which is always good, it just seems to be the fried things are not being breaded or done like they used to.  Sure hope that changes"}
{"text":"Overall food is good. Place appears to be clean. Could have done without the child running around picking his nose, sneezing and then handling customer utensils, Straws , cups etc.  also saw him handle food that was thrown in the fryer.  Kinda gross."}
{"text":"This is a good place to eat Chinese food. I have only try their lunch special for now. And they give you a lot of food for the price 5.95 to 6.55."}
{"text":"I love this place! The food is flavorful and the best part is that they make everything fresh! The bobas are really good too!"}
{"text":"Great service and tastes good.. But boyfriend and I got food poisoning after we got home...so not eating here again."}
{"text":"Possibly the worst chinese I've ever had. Very slow service.kung pow chicken was bland and the beef with string beans was better, but not much. I give it one star because it was close to my house."}
{"text":"Yummy! For local places that I have tried this one seems to be the best. They deliver within a 4 mile radius. The lunch special gives you a lot of food. I would definitely try it if you're from the east coast and searching for decent Chinese food."}
{"text":"Never Eating Here Again! 1) Their water was cut off one time and they were still open for business. 2) Their electricity had been cut off over night for 6hrs and they still open for business. That's Two Disgusting Reasons that are enough for me."}
{"text":"Love the food as well as the customer service. The owners are very friendly and are always willing to take my order even if I show up at 9:25 and they close at 9:30 ;)"}
{"text":"Ate egg fuu yung and it was perfectly made. I felt like I was back home in Hawaii. Big portions I had left over need broccoli for my kids. Ladies working there were so nice. Will for sure be back again!"}
{"text":"After an extensive search on Yelp for another Chinese place a few miles from home, I located this high-quality, low-key Chinese restaurant, China Gourmet. It is clean, has dark wood floors and a few booths for dining. The elegant young Chinese people who work there (they may own the place; I don't know...) are very friendly and courteous. They appreciate your patronage, and it shows.  We started with the fantastic honey-barbecued pork. It was a generous portion for an appetizer. The fried rice was perfect; as were General Tso's chicken (broccoli, peppers and pineapple made it the best I'd had lately) and the mu shu pork. Pop was Diet Pepsi (we despise Coke). This is casual, clean dining--the utensils are plastic and Styrofoam, but the knowledge that the stuff is new gives confidence--that's a little trade-off. And China Gourmet has red chili oil, which is a big factor in my enjoyment of Chinese food."}
{"text":"Great place to eat for Chinese gourmet.  My fiancé and I found this place on Yelp and read the great reviews. We were in the area so decided to give em a try.  The staff there is very nice. The location isn't in the best part of Vegas but its decent. It's a very small place to dine in at and the seating is limited.  I ordered the Mongolian Beef and my fiancé ordered Kung Pow Chicken. Both came with fried rice and chow mein. Delicious meals! Full of flavor and spice.  Very clean on the inside. Great place to take the family for affordable Chinese food."}
{"text":"This place is exactly why I rarely eat Chinese anymore instead favoring the lighter, fresher Vietnamese food. Staying at Best Western and had delivery. So was not expecting it to be excellent because delivery by its nature just can't be so.   Time for Delivery - Took 1.5 hours to arrive and when it did it was terrible.  Sesame chicken - He said it was OK but I think it had too much batter but at least it was sort of crispy still considering it was delivery.  Wonton soup - no flavor what so ever. Thick wontons partly cooked. Pan fired noodles - tough, under cooked. Horrible brown sauce but meat/shrimp quality was sort of OK  as far as I could tell under the brown sauce. Pork fried rice - What pork fried rice? What we got was 3 containers of brown rice The  Sesame Chicken  platter  was supposed to have pork fired rice which was not to be found in the bag.  But there were many containers of the gummy yet tough how does that happen brown rice.  Even I can cook brown rice better. Egg Rolls - Horrid! Enough said on those other than one was supposed to be a shrimp one and I never saw or tasted any shrimp.  I am from Denver and we have lots of good Asian food there. China Gourmet was no comparison to what it should have been even with the most mediocre Chinese food found in Denver."}
{"text":"this place is great for cheap, quality, great portioned meals.  i order from here at least twice a week.  so easy to call in your order and pick up within 10 minutes. staff is very friendly and  they have a great online menu as well.  please try it, you won't regret it!"}
{"text":"Seriously unbeatable chinese food. I go there a couple times a month and they always present the best tasting quality food.  It always leaves me to come back for more."}
{"text":"I can't recommend this place enough. Try the fried pork buns!  This is authentic Chinese food, so for western people the ambience and much of the menu may seem unusual. Anyone who can get past that is in for a treat! Everything on their menu is delicious, whether noodles, rice, appetizers or dumplings. Especially the dumplings. And the steamed/fried buns!"}
{"text":"This place is quick and has a good variety never had any issues and the staff is always very polite.  Once I got the walnut shrimp and there was practically no sauce on it otherwise always great"}
{"text":"This is the go-to place for my boyfriend and I. It's located just down the street from us, so it's very convenient to get to. The place is kind of small, but that makes it seem cozy. It's clean, we get our food fast, and the workers are attentive to our needs. We always order the family dinners. The portions are huge, so we always end up taking stuff home, but it's just as good the next day and the price is reasonable. Love that I can see the kitchen and that the food is always hot and fresh. Definitely the best Chinese place in town that I've been to and I recommend!"}
{"text":"Great food! We got the family meal w/orange chicken & a pork dish that the guy who took our order recommended, the one that comes w/little tortilla type things to wrap it in. They were great, as was the appetizer sampler. There was a ton of food. I ate the leftovers all week. I'll definitely order again when in the mood for Chinese."}
{"text":"This is by far the most disgusting food I have ever had. I FOUND MAGGOTS IN MY RICE AND I KEEP THROWING UP. I am going to look in to it and definitely complain."}
{"text":"Excellent service, great prices, and delicious food!!   Their lunch special is so adorable and gives generous portions. Whether dining in or picking up, I highly recommend this location.   **Their crab rangoons are my favorite item, so good!"}
{"text":"Dope spot. Very fast , clean and  excellent bomb food definitely coming back to try rest of menu, got chicken fried rice and orange chicken this time around"}
{"text":"China Gourmet has some pretty good Chinese food. I've tried different spots all over town, and so far I've found my favorite. They carry all the basic Chinese dishes do there's never a surprise about what your getting. The cream cheese Ragoons are very tasty! Shrimp dishes are packed with nice, plump shrimp, and a lot of them too. BBQ pork fried rice for the win! Not sure why some take out places dont offer the BBQ Pork variety in their Family Dinners. China Gourmet does and Its the best here!"}
{"text":"The shrimp fried rice, general tso's chicken, and honey shrimp were very good. The honey shrimp was a little sweeter than I like, but everyone else liked it. I didn't care for the war wonton soup. The wontons were way too thick and doughy and the broth was just ok.  Service was fast."}
{"text":"Dined in restaurant Saturday night around 7:30pm.  A few other tables had another ten people.    Crab Rangoon, egg rolls and fried pot stickers very good.  Won ton soup and shrimp fried rice fair.  Service quick and friendly.  I was wearing tight jeans to turn on my wife and to accentuate my beautiful bulges."}
{"text":"Really good food at a good price. Everything tastes fresh and doesn't have that bad after taste many Chinese restaurants do. Delivery was fast and staff was nice. Definitely gonna order from them again."}
{"text":"This is our go-to spot for good food. It's always fresh and delicious, with huge portions. Plus, they always remember who we are! I recommend the wonton soup, sesame balls, Singapore noodles, and a taro boba slush. (If you have a cold, get the mapo tofu. You'll feel better in no time.)"}
{"text":"Delivery time said 45-60 minutes. It's been nearly and hour and a half since I placed the order and 5 minutes past the confirmed delivery time. Food may be good but I wouldn't know."}
{"text":"Pretty average food. We ordered pick up and the prices are great. The lunch specials offer a lot of food and the main menu dishes are large as well. I had the Mongolian beef and the sesame chicken. Both were fine but I would be more likely to order the chicken again. We warned. The lunch special comes with rice and noodles and they are just that. Noodles. They were fine but really, nothing special."}
{"text":"The food is very fresh, made to order!!!! Delicious and great portions. By far the best Chinese food i have had in Las Vegas."}
{"text":"its a Friday at work,,,and no one can decide on lunch.  We received a flyer for china gourmet in the mail and decided to try it. we ordered hot garlic chicken, beef and broccoli, cashew chicken, veggie fried rice and vegie chow mein.  As we were all eating I asked how everything was and....silence....everyone was so busy eating and smiling:)  Needless to say we all enjoyed everything and this will be our new go to spot for ordering Chinese..and they deliver...winning!!!  its not 5 star dining but it is great Chinese takeout at a reasonable price."}
{"text":"Place is always good n fast on delivery and there food is very good as well.. It's My go to Chinese food for sure!! Black peppered chicken and chow fun noodles r both great!"}
{"text":"Had a late night dumpling craving and was glad they're open til 10pm (on the 7/4 holiday)! Called in, and although they can take an order in English it's much easier in Chinese.  I ordered the dishes below and would def come back for other quick and simple comfort food. The lady chef even offered me free congee to go since they were closing and had extra in the kitchen :) Menu is in English and Chinese, there are also pictures on the wall of some dishes. Inside of the restaurant is simple and clean, I'd be comfortable eating inside anytime.   -White cabbage (napa cabbage) and pork boiled dumplings $10 - there's also a fried/potsticker option. Small 2-bite dumplings that taste just like my China days :) good amount of pork with cabbage, and the skin was thick homestyle as well. Came with black vinegar and soy sauce to dip in.  - Beef Noodle Soup $6 which came with a surprisingly large portion of meat! (See pic) the to-go order was nicely separated for me so that noodles wouldn't get soggy. A small styrofoam box was filled with half noodles and half blanched lettuce while another round container had all the beef broth + meat + hard boiled tea egg. Very satisfying mainland China-style beef noodle soup :)"}
{"text":"I'm a frequent visitor to Las Vegas, usually once a month.  I like the Summerlin area and North Las Vegas because... well it's nothing like The Strip.  This Chinese restaurant is freakin' awesome.  Service is prompt, courteous, and they only came by THREE TIMES to ask if everything was ok.  Try and get that somewhere else... where you're ignored and lack for even water refills.  The hot tea was steaming.  The egg-flower soup was steaming. The steamed dumplings were ... um... steaming!  The beef&broc were fresh.  [Ok, they could have cut the humongous beef pieces into bite-sizes].  The fried rice and noodles were scrumptious.    I asked for chili paste... got offered that or Sriracha (how can you go wrong when you offer both?)  Also the chili paste in the egg-flower soup made it deliciously hot and hot[spicy].  Killer combination.  Next time I'll try the hot&sour soup and hold off on the chili.  Food was HOT and FRESH and DAMN DELICIOUS.  Would go back in a heartbeat.  Took a delivery-menu so I can repeat the process without going there.  [Eating there was fine... just delivery is sometimes easier.]  While I was there I did not see Chinese people eating... which is at times a bad sign... but not in this case.  I saw four other people having a great meal.    What could they improve: not much.  It's all good.  When you walk in it's very 'small town' when they ask you if you've pre-ordered... if it's takeout or dine here...  so on the one side they could \"polish\" that process up, but on the other side it's down-home-style.  GO EAT THERE.  Ehud Gavron Tucson AZ US"}
{"text":"If you want a greasy meal and a stomach ache to boot, China Gourmet is the place to go! I ordered the general chicken, kung pao beef, bbq fried rice, and 6 crab rangoons for my boyfriend and I for dinner on 1/5/16. It was $35 for everything.   The food was literally swimming in grease. The fried rice was soooo greasy. I have never had fried rice that wet before. Yuck. The general chicken was soggy, likely from all that grease, and came with onions, pineapples and bell peppers. It reminded me of sweet and sour chicken, and nothing like general chicken as there was hardly any spice. The kung pao beef had a good flavor, but was also very oily. The crab rangoons were the best. Decent sized, fried perfectly with a good amount of cream cheese in the middle. I was really disappointed with this meal. See my pics, it will likely make your stomach hurt just looking at them."}
{"text":"The second time I ordered here!! Today we got the pot stickers the egg roll sesame chicken chicken fried rice the mo gu gai pan with fried rice and wonton soup! All of this cost is 43$ the food is fresh and made really well they packaged everything up so nothing spills and everything is secure. And there is so much food enough for me and my husband to eat several meals."}
{"text":"I ordered food from there they charged me 1 for a Togo tray I was too up set and food was ok that's y they got 1 star never going there again and she charged that $1 to put in her own pocket"}
{"text":"The food is great! I couldn't decide what dish I liked best but the kung pow shrimp and the walnut shrimp are great! The service was good too! I'll be back."}
{"text":"For Chinese take out food, this is my place. Of course you could find better at a fine Chinese restaurant.  I'm reading some of the bad reviews, I really don't think they're fair. I travel to different cities around the country weekly. I get to try out different places all the time. While I am home, this is my go to for good Chinese food. The family that owns and operates it, is very friendly, I always feel welcomed.  They're doing something right, cause they're always busy."}
{"text":"I really enjoyed this place. The places close to us that are similar don't have the best reviews.  We got the vegetable chow mein ,fried rice and the  tofu and veggies .  I placed my order through the yelp delivery app and had a few customizations. They called me and confirmed how I wanted everything. That's great quality service.   The delivery was very fast and best of all , the food was warm, not cold .   The actual taste of the food was great. Tons of veggies. And as far as the tofu goes , very good flavoring on it.  Will definitely be ordered from here again."}
{"text":"I must say that this is my favorite chinese food place! Theyre fast fresh and authentic!  I started going back in 2013 and haven't tried any other place the service is wonderful and very fast! The food has so much flavor our usual order is war wonton soup, bbq pork fried rice, orange chicken, beef broccoli and shrimp chow mein! Def try it sooo delicious!  I recommend this place to you!"}
{"text":"Way cheap on the meat.  Combination Chowmein had 2 shrimps and 2 small pieces of beef.  No veggies, no pork, no chicken.  Just noodles.  Called back and the restaurant operators didn't care at all."}
{"text":"Still no Brown Rice here. Have called twice hoping they have added it to the menu. Got a tip from a helpful Yelper with good intentions, saying \"They have brown rice\" so we decided to give it a shot, only to find out that they don't have brown rice. Fried Rice could have been mistaken for brown rice, maybe?  Reasonably solid American Chinese (would be 5-stars in an overrated city like Nashville.) But, China One on Rainbow is still far and away my favorite. The similarities between the two restaurants are many, down to the styrofoam bowl of egg-drop soup (although China Gourmet's is way too thick). It is painfully obvious that they did a lot of homework before opening this place. Too bad being booksmart is only half the battle...  As we were leaving China Gourmet, I was walking by one of the other customer's plates of food, and I was surprised to see his General Tso's Chicken was an unnatural reddish-orange color. Food coloring in Chinese food is so 1980s! The last time I saw chicken that color was at a crappy neighborhood Chinese joint in Southwest Denver.  A good effort, but the overall effect is of a fake iPhone. This place so desperately wants to be China One, but it misses the mark by a mile! Suspect food coloring aside, Asian restaurants that care serve Brown Rice. (You can quote me on that.)"}
{"text":"The Best fried rice ever!!  Good food and good service they deserved more than 5 stars this needs to be recognized. They were closed already but when the lady saw my boyfriend pulled the door she still called him and made our order. Mind you it's now 10:27 and they close at 9:30  very nice people. Lol sorry baby if you see this."}
{"text":"As good as it gets FOR chinese delivery!   this is my new fav kung pao chicken- i ordered it extra spicey and suggest you do the same. the guy on the phone recommended the orange chicken but he's crazy, it's not very good.   i will def be a regular w that kung pao, yum yum yum!!!"}
{"text":"The food was great and the portions are huge! Service was on point. Found a new Chinese place when visiting Vegas."}
{"text":"We always order from here. The food is always hot and fresh. Only maybe once or twice they messed up my order and was really late delivering. Otherwise this is my go to for Chinese."}
{"text":"This is  a horrible place! I tried to place an order for delivery. The lady could not even speak English. I was hung up on. I called back and she asked if I was coming there, I said no and she hung up. Every time I called I was hung up on. They do not want to do deliveries and will hang up on you. Completely disrespectful. It's sad because the food is good, but the service is rotten."}
{"text":"Just ordered for the first time. Delivery was crazy fast and the food was excellent!!! Definitely will be ordering again!!"}
{"text":"The customer service is absolutely amazing from this place. The two ladies that wait here have the customer service equivalent to your 5 Star Hotel. Did I say the food is fantastic as well? Always fresh and cooked to order.   Everyt ime I eat in the restaurant, they always put my leftover food in the to-go boxes for me as a courtesy (since the portions are so large) after I'm done eating. I even remember the ladies ask an elderly person to carry their food out to their car. Just WOW. You don't get this treatment at some 5 star restaurants.  Def my favorite fast food Chinese in Las Vegas."}
{"text":"well after the jerks at cook on wok (on cheyenne) decided that i'm suddenly too far to deliver to even though i've ordered from there like five times AND always over $30 smh.  Their loss.  Anyways.  I give this place pretty high marks.  First they said it would take 45 minutes to get here which is a typical type of delivery window and it took the guy like 20 minutes.  So hooray for that cuz I'm sick and that was a welcome surprise.  Second everything was super fresh.  That's a big plus for me.  I will admit the Wor Wonton soup could have used a little salt but that was a small price to pay for the deliciously fresh ingredients.  Tender meats and generous portion.    The sample appetizer was also good.  Fresh and tasty.  The Shanghai noodles were very curry-isn and again, fresh crisp veggies and good meat.  A little salt again could be added but no biggie.  Even the crispy friend wonton strips were big and freshly fried and not greasy.  It's like they just care and go a little above and beyond.  All utensils and sauces were included.  I definitely recommend this place.    Oh, also the delivery gentleman was very pleasant and polite."}
{"text":"We ordered delivery from here at work a few days ago. We have ordered Chinese food from many places and never had any real good results so I kept my fingers crossed that this would be different. Wow what a pleasant surprise! Food arrived fast, hot, and yummy. I had chicken fried rice, co workers had Mongolian beef and chow main. Everyone said that the food was really tasty. We will be ordering from here again."}
{"text":"Worst Chinese food ever, chicken fried rice tasted like fish and the egg foo youngest greasy and lacked vegetables."}
{"text":"I recently moved to Sahara and Ft. Apache area so I decided to try this place out and I am happy I did. I had the chicken pad thai noodles and it had fresh spicy taste with plenty of food to have a little extra later. The pad thai was priced at $7.95 so definately worth it."}
{"text":"Very good for your money! Very fast! Got the lunch special kungpow combination. Good lunch spot. Only like $6 for lunch combination come with rice noodles and your choice of meat/ext. I got to go."}
{"text":"It took over a quarter of a century for me to find really good crab rangoon since I left Missouri for California and then three months ago Nevada.  Here it is now, where you can even get a good taste of crab and see crab in it.  5 stars for the crab rangoon."}
{"text":"We decided on Cafe Rio but pulled up and the pictures in the windows changed  our minds.  Prices are great. And the food was awesome.  We  ordered the lunch specials. Kung Pao , sweet and sour chicken and a chicken teriyaki bowl.  All were great.   Plus it's great to go into a place and see the cleanliness.   I high recommend this place. We will be back."}
{"text":"I've been on the search for good Chinese Food and finally after 10 months of living here and trying different places FINALLY I found my spot, I wish it was a better location or that they used real plates LOL you get served on to-go boxes but that wont stop me from making this my spot for  Chinese Food pickup  Thank you Thank you . Really Good Food!"}
{"text":"My favorite Chinese restaurant!!! Best deal is their lunch menu, a lot of food for a low price. My go to is the kong pow chicken. You can taste how fresh the veggies are"}
{"text":"A very good and well priced example of Chinese take out. We got sesame chicken and had enough to eat it for three meals. It's pretty standard take out. I wish there was a bit more extra sauce, but other than that it was very good. The meat was good quality and the rice was perfect. Nothing to complain about here. I will be back."}
{"text":"I ordered chicken chow mein and my coworker ordered beef chow fun. First of all our delivery took an hour! Second, my coworker watched the delivery driver drop our Thai tea, thus cracking the lids & spilling tea everywhere. Next, he didn't have change! How are you a delivery driver with no change? Now onto the food.... My coworker said hers was \"okay\", not anything special. My chicken chow mein was disgusting! The noodles were extremely over cooked, leaving them gooey, soggy, greasy messes of dough. The chicken, I'm not even certain if it was chicken, had so much fat, gristle and muscle it was not edible! And the grease..... So much grease! If you are craving good, quality Chinese food, this is definitely not the place!"}
{"text":"The food was excellent! They Really make higher quality Chinese food. My family never cared for orange chicken. These guys do something different with theirs. It is truly amazing. Everything tastes so clean & fresh; not bogged down with bad flavors."}
{"text":"Just ordered lunch for the work crew and we have found our new favorite for Chinese food!  Everything was super fresh and tasty.  Delivery was very fast and friendly, too.  They charged $3 extra for 10 paper plates, but no big deal.  Food was excellent."}
{"text":"This is one of the few places I will miss once I move off the east side. I'm so happy they opened right across the street from Panda Express too, show those orange chicken cooking Mexicans what's good!  Fresh must be my word of the day because that's what this place is! Lets just get to the point! THE PROS: Great food, cooked to order. A few random Chinese specialties that you don't see at all typical take out places.  No MSG.  Good prices including lunch and family specials. (Take that Panda!)  Sweet people (they called me princess Di, aww)   THE CONS:  The location And the sweet people, don't understand much English.  I drove all the way home, you know across the street, because I was $2 short. Only to find out once I returned it was simply a miss-communication and my bill was $27 not $37. Either way when the lady counted out $35, she should have not let me leave. They were very apologetic. The food indeed made up for it.   I recommend the Hot Garlic chicken. My boyfriends fav was the Mongolian beef."}
{"text":"Wow,  so i was craving chinese and checked yelp for recommendations, this place did not disappoint ! My husband and i got their lunch specials, Mongolian beef and sweet and sour chicken with 2 egg rolls. Everything was delicious and huge portions for 6$ lunch specials. They even put my sweet and sour sauce on the side so it wouldn't get soggy on the ride home. Overall, everything was really good and not greasy at all. The inside was nice and clean! Great prices, will definitely be back to try other entrées."}
{"text":"Okay, so you like Chinese but you're tired of going to the same ol' places. Well you're in luck, this little spot will have you going back for more! I work in Gastonia and have eaten at just about every Asian restaurant around town. I first tried this place with a friend. You'll find this place a few miles north of Franklin Blvd on New Hope Rd. It's in the shopping center with Food Lion. The service is excellent,  always greeted with a smile upon entering. Very clean and decorated well. There are the usual booths that could be a little more comfortable, but we all know what we're getting as far as that goes. I love to call ahead to pick up lunch on my busy schedule. The main reason for the five star rating is because of the quality of the food. Always freshly prepared and tasting great. I don't have any negative things to say about this joint. Enjoy!"}
{"text":"Not every place has great tasting bolba drinks, but this place has some very delicious drinks as well as delicious food at a good price. We buy food from them every now and then because of the tasty food and reasonable price. I just wish they had sushi, too. Nonetheless, nice little restaurant to dine in."}
{"text":"Found this bug cut in half in the sauce of the Hong Kong crispy noodles. Disappointed because I liked this place."}
{"text":"So this will DEFINITELY be my go to for delivery at work! Let me just say the delivery was so fast I thought they had some secret portal LOL our order was correct, hot and fresh !!!! HIGHLY RECOMMEND!!!!  We ordered shrimp fried rice, chicken fried rice, Singapore noodles, egg rolls, pot stickers, and the lunch special sweet and sour chicken !"}
{"text":"i love their tenderized new york style mongolian beef! & shrimp & snowpeas, eggplant & fried tofu !!!! wonton soup!!!! chicken fried rice!!!! ragoon!!! so onolicious!!!! yummmy!!!"}
{"text":"Great prices and really great fresh food. Not that many really good Chinese carryout in the area. The food is really fresh and delish. Just ordered the Kung pao shrimp, sautéed veggies and egg rolls. The Kung pao shrimp was really good. I really would've liked a little more shrimp and less chopped zucchini (not a fan) but all in all it was really good. The sautéed veggies were delicious too. The egg rolls (really spring rolls) were absolutely wonderful. Perfect! You get 2 for $1.95 or something like that. They're amazing and completely vegetarian which is great because I don't eat meat. I opted to pickup instead of delivery. I'm only a 10 min drive and the delivery guy was going to take almost an hour. They deliver all the way to 89144 for only $3 so that's amazing. Everyone was really friendly when I came to picked up my order. They speak really good English which helps when asking about ingredients. Will definitely be back!!"}
{"text":"Probably, the best Chinese food in town. Not even close to exaggerating. Always fresh, on time and their portions are ridiculous. Love their Sesame Chicken, Beef and Broccoli and thier version of Beijing Beef. Panda Express employees and cooks, please visit this place and take notes. THIS IS HOW YOU COOK CHINESE FOOD!! love this place!!"}
{"text":"Omg they food is so delicious and cheap and the place is so clean and the ppl are so polite I will be going back"}
{"text":"Yummy lil Chinese spot ..not only is this place quick but tasty cheap plus this place hooks u up with an insane amount of food me likey likey lol good bang for your buck"}
{"text":"We recently tried this place thinking it's a nice sit in restaurant.  It was more of fast food type like Panda Express but with authentic Chinese food.  They had my husband's favorite Egg Foo Young.  Overall it was ok.  I will come back and try other items on the menu.  Saves us from driving all the way to Chinatown."}
{"text":"The food is average, the service is okie. They have lunch special which is good average about $ 5-7 dollars . I like the Kung pao chicken. Will come to try their other food."}
{"text":"This place is really great. I wish it was in my neighborhood. I found it on yelp on my way out of las Vegas.  Thanks Yelp for once again helping me to find a great place to eat anywhere.  This place is not fancy but it is  clean and you can bring the family. Take out is the best.  The style here is Hong Kong food. Everything was rich and flavorful.  I can tell that it is a family run place. The kids do the front and wait service. The older folks do the cooking in back.  The place is open so you can see the entire process.  I promise you will not be sorry."}
{"text":"Always hot, fresh, great tasting food and good customer service! So convenient to where I work, it is my go-to place for lunch when I want Chinese food. You can't beat their lunch special prices... so much food for $6.75!"}
{"text":"Just tried to place an order for delivery.  Didn't finish the order as it seemed the lady on the phone wasn't interested in giving me her full attention.  I'm sorry, but if you are going to take my address it is best to let me finish speaking before you start speaking to your co workers.  Asking one to hold is a common courtesy if something in the restaurant needs your attention.  No thanks."}
{"text":"We ordered delivery and the wait time wasn't bad at all! Food had lots of flavor and the price was worth it! We ordered the eggs rolls, crab rangoons, orange chicken, fried rice and honey walnut shrimp for about $36. The honey walnut shrimp was my favorite. Sauce was great, and everything had so much flavor and everything tasted so fresh. Will be ordering again!"}
{"text":"I wanted to use their coupon for a 'free entree' with orders over $40' so I asked to add a free honey walnut shrimp. When my order was $2 shy according to the lady on the phone taking my order, I added the fried wonton appetizer for an additional $4.95 bringing the total to $44.xx + $5 tip = an even $50. The delivery came at 9:17pm, but the honey walnut shrimp was not included. They close at 9:30pm. I tried calling, but of course no one answered. Time to find a new Chinese delivery restaurant."}
{"text":"Orange chicken is fabulous.  Some Chinese places give you all the fat pieces-- so gross.  Not China Gourmet-- every piece is lean chicken and tastes great.  The veggie dishes are fresh and everything on the menu is delicious.  It's our go to for Chinese!"}
{"text":"We've tried a few different Chinese delivery places. I'll admit I'm not a huge fan of Chinese food. But this place had some good food. I like the shrimp lo mein and kung pow shrimp. The shrimp was juicy, unlike some other places we tried. It is also a good price with huge portions!  Don't order the poo poo platter though, none of the items in it were good."}
{"text":"Generous portions and quick service.  The lunch specials are the best but if you're there during the evening they have a secret special. It's basically the lunch special for $3 more which is still a better deal than ordering a la carte."}
{"text":"do nott order from this place!! unbelievably rude as hell!!!!!! had delivery many times!same person always takes the order. cannot speak english! messed up our orders a million x, would call & never got reimbursed! my ex would have me order when he came2visit. i called diff  chick answers. she continues to have me repeat myself a million xx and i cannot understand a flipping thing she is saying -then she passed ph to 1 normally answers i said \" what is going on\"? she said \" because every time you call your drunk\"!! ( her excuse for not understanding me-speaking english evidently the excuse 4 messing up our orders). i said \"whattttt??!!! i was lividdd!! i dont even drink!! i quit drinking 20 plus yrs ago!! absolutely appalled! bc they dnt understand english-blame it on me&accuse me!????!!! meeeee of all ppl2be drunk?! ????!!! r u effin kidding meeee??!! rude as hell no gratitude for the$$we spent there!they need2turn n their green card&dnt come bk till they learn english! also, why is it that  all corps r required2hire foreigners or get a fine-yet the only ppl working at this joint ( & take notice of all the rest of asian joints or any other culture they only have employed there their nationality) dnt see any usa born teenagers working there! or any  true blue american they only hire their nationality!!!well then that should b  only ppl they get biz from iffff they should get any!!need 2go bk2wherever they came from! gov needs2go n& see if they r even legal!! lived n vegas 36 years! i know what's required of the casinos&gov pays1/2 their wages if they hire them!the korean change ladies told me! so yes!they get the jobs b4 true americans!! obviously never get my biz again& i hope any true american wont ever give them biz! i dropped the ph in mid convo got n my car & was there n 2 min flat!!i was /&im still steaming over that wenches remark!! how dare she??only reason got as much biz as they did was closet asian joint2where i live that does delivery! so not only always forgetting something,&never getting reimbursed-this is the gratitude we get after $$ spent -calling me a damn drunk bc theyyyyy dont understand english & can barelyyyyyyyy speak it themselves!! go bk to ur country and dont come bk until u know how to speak english! like other countries! wont allow u 2 become a citizen unless u can speak& understand the damn language!! red-white&blue!!!usa!!!"}
{"text":"This was a random find on Eat24 and ordered for lunch at work. I was pleasantly surprised. This Chinese food tastes like superior quality in comparison to so many Chinese food restaurants available in the summerlin area even their  plain chow mein tastes great! Would definitely recommend the potstickers from here !"}
{"text":"Bought food for the fam, had a coupon for a free entree with order over $40. They argued with me about the coupon, then didn't honor it, but instead gave me $5 off.   Ridiculous! Oh, and they kept my coupon."}
{"text":"Sometime you don't want a 50 dollar buffet or a 75 dollar steak dinner.  We tend to try those things, but also like to find off the maps places for cheap.  They typical hole in the wall mom and pop places.  Craving Chinese food we wandered looking for a steam table place, but after Yelping we came across China Gourmet.  I was glad I did, the prices were extremely low, the quantity was a lot and the quality was very good.  I will definitely return when I come back to Las Vegas."}
{"text":"Delicious food, great portion and decent price! A must try restaurant if you want authentic Chinese food. Their pan fried bums are the best thing I have ever had!!"}
{"text":"It's ok here not much of a great fan but cheap I guess when your hungry I doesn't matter lol"}
{"text":"I eat here like 2-3 times a week because the food is good.  BUT  Whoever was working in the kitchen nd behind the counter on 4/7/18 don't know what they are doing.   The food was missing veggies in the chow mein. They got lazy with the fried rice.  Then I got carded to use my DEBIT card. I KNOW that they run my card as credit EVERY time. I said the word \"credit\" and the lady went off on me. Saying they never run it as credit.   It's not enough to stop going but I will stop if those employees are there to stay."}
{"text":"This is one of the best places in Vegas!  This was our first time ordering from them. We were very impressed with our order.  The food came hot and freshly made. It was great!! The veggies were fresh and the meat was very tender and juicy.   I recommend this restaurant to anyone who wants low cholesterol, no MSG food!! The food is really delicious and you will not be disappointed!!!"}
{"text":"Garlic chicken is way too sweet for my taste. Hong Kong style noodles was slot better than the chicken. Price is right.  Went back a two weeks later for lunch specials and was not disappointed. Lunch specials are awesome. NOthing more than $6.  I had the General Tso's chicken. Right amount of spice with red chili peppers and slices of jalapeno.  Lots of chicken and noodles on the side were really tasty.  My wife had the shrimp with snow peas,  Lots of snow peas and the shrimp were plentiful and succulent.  Fried rice was non-descript."}
{"text":"If you order Lo Mein to go be prepared to eat. They pack a to go box full of the stuff. Their prices are reasonable, especially for the amount that you get. If you order for delivery you'll have to call, they are not on the GrubHub app, but fret not antisocial people, everyone is extremely polite and the delivery drivers are good people.   Tell them Rod sent you. It won't mean anything, but why not."}
{"text":"I always get delivery from here, and it's always super fast and very accurate. The food is always soooo good. This was probably my 10th time or so ordering today and I'm so pleased with the food I felt like I had to write a review. Phenomenal"}
{"text":"Always fast,  & clean,huge orders,  there should be a12 step program for their honey walnut shrimp! I love that you can watch your food being prepared, definately one of the best chinese food in town."}
{"text":"Feels almost like a Panda Express setting rather than a true sit-down restaurant.  You can see just about everything going on in the kitchen.  But, the food is pretty good...just don't expect much...especially if you are going with the family.  Even for dine-in, the food comes out on Styrofoam plates and just feels like you are eating \"to go\", and just changed your mind to dine in."}
{"text":"Convenient and quick. I'm not the biggest fan of Chinese fast food but China Gourmet was pretty decent. Their shrimp fried rice has so much scrimp in it! Yummm... the egg flower soup was good but the crabcheese wontons were very soggy."}
{"text":"I've been here several times now for lunch special and dinner take out.  Service is great, prices are incredibly low, food is tasty, and portion sizes are gigantic!!  I just ordered the kung pao chicken lunch special and there was so much meat in there.  Most Chinese restaurants fill their portions with veggies, so you need to dig around for the actual meat.  Not here.   There was so much meat that I had enough for leftovers.  Actually their lunch special would feed two easily."}
{"text":"The lady with the fake eyebrows is soo rude! Horrible customer service! Food was okay!! Atmosphere sucked because of that lady!"}
{"text":"Best Wor wonton soup ever and Seafood Hot and Sour soup as well!!  Best Food ever they give you generous  amounts. Yes they they have a non seafood version .I use to live in California so I know good Chinese food  please don't stop using doordash it's the only way I can get your food"}
{"text":"So far 1 of the best Won Ton Soups ive have on take out. still hot, noodle still noodles, egg rolls pretty food, Mongolian Beef good and fried rice well done..Delivery guy was fat and poliite, and everything was nicely wrapped and easy to open. Will Do Again For Sure."}
{"text":"The food here is soo good!! I love the salt and pepper shrimp, and the boba is awesomee, the delivery is pretty fast and the prices are good too!"}
{"text":"The food here is good. I usually get the singapore noodles, house chow mein, or any chicken dish. The portions are large, prices low, and quick service."}
{"text":"I like the place. The food is fresh, sumptuous & plentiful. I was hungry and anxious to eat. It took 20 minutes to get my order, but I doubt I could make an Eggo waffle any faster, so I thank God I have ppl around who can make good food for me. $30 and I had food for a week. Nice!"}
{"text":"Tried seafood twice.  The shrimp is huge and when had the lunch was a good deal though the Kung Pao shrimp wasn't like normal kung pao, had zucchini in it and the sauce is very dark and strong for a seafood.  Very few peanuts in it.  What made me decide to never order there again was the ordering one of their gourmet dishes (shrimp and scallops with ginger scallions).  Scallops were very small with a few large shrimp, but the sauce again was very, very dark and too strong for a seafood dish.  I think they use the same sauce on everything and just add a little sugar or pepper flakes.  Ordered a shrimp eggroll which was good, but had one large whole shrimp in it rather than being diced and distributed throughout.  The crab rangoon I think is just cream cheese.   The regular eggrolls taste odd.  For lunch it is reasonable and fair, for dinner it is way too expensive for the quality."}
{"text":"This place only gets one star because the system will not let me post the comment without any stars.  I would never eat here again. We ordered delivery, as I am moving and packing. This place about a mile from my home. When speaking with the woman who answered the phone, she couldn't understand what I was asking for and I couldn't understand her broken English. I was promised our order within 45 minutes. I called back after an hour and was told it would be here in 5 minutes. 15 minutes later our food arrived, an hour an 15 min after I had ordered. We ordered Tso's chicken, chicken lo mien, vegetable fried rice, and fried wontons.  The Tso's Chicken was over cooked and dry. Also, had a gamey after-taste. Is chicken ever supposed to have a gamey taste? BARF! I had one bite and we threw it out and questioned if it were actually chicken or not.  The fried rice and lo mien were ok. Nothing to write home about and nothing I would ever order again. They were edible.  The pork in the wontons was that milled or ground pork. I do not prefer this type of pork and wasnt in love with the dish either.  Due to the long delivery time and the gamey taste of our chicken, not to mention nothing was still hot when it got here.. I would never eat here again. I do not recommend anyone eat here! BARF!!"}
{"text":"Ingredients are fresh--- ALWAYS. Place is clean, friendly and always happy when their customers leave satisfied.  I've been coming here for more than a few years now.  I've been to a couple other spots for Chinese but none has come to how fresh and tasty this place is.  Still on top of my list and I refuse to go anywhere else anymore.  Whether it's to dine in or take out or even delivery ... it's always delicious, always fresh.  Few of my favorite dishes :   Sesame chicken w/ xtra garlic  (If you love garlic -- order xtra you won't regret it)   Spicy fried chicken wings  (Mouth watering delicious )   Mongolian beef   Chow fun noodles  (Chkn, bf, or shmp)   Kung Pao combo   Orange chicken   And if you like boba , that's also good here.   You won't regret coming here  Oh !!! I almost forgot their Wor Wonton Soup is my second favorite here.  Honestly the freshest soup.  I literally come here for this soup when I'm craving and when I'm sick with a cold."}
{"text":"I've been a customer for about 4 yrs now. The food quality has gone down. I went here last weekend and their service was horrible. The lady was so rude. I will never go back. I'll stick with panda."}
{"text":"This place is great they serve more than enough food it taste great especially for its cheap lunch specials can't go wrong definitely beats china a go go"}
{"text":"I love these guys they're super friendly the food is omg absolutely great deal than panda and I love the orange chicken it's super bomb thankS guys"}
{"text":"Solid place for northern Chinese brunch/ breakfast.  Food is good, service is friendly.  Also, this is one of a few that is opened early in the morning."}
{"text":"Amazing food every time I order. Have not been disappointed at all. I order delivery all the time and the food always comes hot and ready. I love this place very much."}
{"text":"Wow!!!! If you judge this place by the bad reviews your missing out!!! They accommodate every type of diet need!!! Vegan no problem!!! They where happy to make my order all veggie! The moment I walked in the door they where happy to see me! They know their regulars by name and order!!! This place is a hidden hem in a world of bad customer service!!!!"}
{"text":"Came across this little spot today. I'm really picky when it comes to Chinese food but this place is really good!!!! The portions are huge and the prices are great. Their service is also really good everyone in there is friendly and making sure you have what you need. Will definitely be coming back.   Loved the noodles!!!"}
{"text":"My husband and I were driving thru Gastonia and stopped for a bite to eat Chinese is our favorite we came across \"China Gourmet\" and dined in and ate. As the many customers were coming in \"Hunter\" the owner would address each one by name!  I have never witnessed service on this level before especially in fast food he asked about their family members and he treated his customers like they themselves were family! The food was hot and fresh but to be honest his level of service to his customers had both my husband and I distracted from the food it was good don't get me wrong but the service was phenomenal!!! I would recommend this place to any and everyone. In a world that appears to be corrupt right now having a simple meal in a nice clean environment with someone like Hunter and his level of service to his guest showed me that there are still GREAT people in the world who actually enjoy making others happy #Veryhappy out of town customer  thank you for your service Hunter!"}
{"text":"Didn't know this place was so really good. I tried their pepper squid, seafood chow mien, shrimp with Capri, Mongolian beef. It was bomb. Will come back if I visit LV again."}
{"text":"Our family loves this restaurant! We always do takeout, but are never disappointed. We haven't tried something here that we didn't love! We probably order takeout or delivery at least once or twice a month. Their delivery service through yelp is amazingly fast. Usually about 20 minutes from ordering to showing up at our door, and with hungry kids, that's a huge plus! Our favorite dishes are the potsickers, fried chicken wings, spring rolls, house special chicken, chicken and broccoli, and chow mein noodles. Our kids love the orange chicken. The lunch special is a fantastic deal as well, so much food for such a Great price! Great Chinese takeout, and speedy service. This isnt a fancy chinese place, so don't expect PF Changs or a similar sit down restaursnt like that. This is the kind of comfort chinese food that you order to binge on at home, and its fantastic. No complaints here!"}
{"text":"WOW! Terrific, FRESH food! The Pepper Steak was amazing. The dining area is kinda small, so go during a slower time if you want to sit down. The service was excellent, and the portions were huge. Reasonable prices! A rare gem in East Vegas."}
{"text":"Good food at a good price....fresh and pretty fast so you ain't waiting on it too long....definitely a good for pick up when you don't wanna cook one night !!"}
{"text":"I would so LOVE to give these guys more stars, but the last time I ordered out, I was left with the most awful taste in my mouth. THEY DO NOT HONOR THEIR OWN COUPONS!!! I had a coupon for a free appetizer after you spend a certain amount. Nevermind the fact that the DAY BEFORE I received the coupons in the mail, I went here to dine-in and spent almost $50. But the day I want to use a coupon for a measly free $6 appetizer, I was told no because you cannot have chicken wings for free. There was a restriction on the coupon and chicken wings was not restricted. I think we ended up getting rangoon instead, but they really should have honored their coupon. I'm probably never going to eat here again.  Bah humbug."}
{"text":"Pretty A=ok takeout Chinese.  Its better than some in the area, they do their basic dishes well, my wife liked their egg drop soup. Egg rolls are good. Overall, good, but again, nothing but generic Chinese, don't expect anything else. Fried rice was better than some, with actual veggies in it (peas & carrots). You can tell they don't put a lot of love in their food, with basic care of ingredients, chicken being way over cooked, and some mushy vegetables. Not disappointing one bit though, did not expect much out of s strip mall Chinese with neon signs, and did not get much. Other than a hot, filling meal, while being convenient to Harris Teeter.  Otherwise I would have gone to the opposite side of the plaza to PoppySeeds, but I needed to get away from their bacon, egg & cheese, I am addicted."}
{"text":"This is a great place, awesome lunch specials and consistently good food!"}
{"text":"When the Chinese take out shop is closed next door, China Gourmet is almost exclusively my next choice. They do a great job and I usually go for my favorites:  Chicken wings -- super flavorful and packed with roasted garlic bits, jalapeño slices, green onion and red chili peppers.   I do not eat rice, I always get noodles and lately I have been ordering the beef lo mein -- I chose Well, the meat is super tender and juicy.   Mongolian beef, sesame chicken, Kung Pao etc. it's all good, just eat it.   I normally never get seafood at Chinese restaurants or anywhere where I am not familiar with their sourcing because I do NOT want to eat farmed seafood (gross) so I can't comment on the quality of the fishes-dishes.   China Gourmet is definitely a great provider of delicious, greasy carbs for your hangover days and lately I have been relying on them for my post-break-up-face-stuffing-on-the-weekend."}
{"text":"We have ordered deliver via Yelp from this location twice so far. The potstickers, hot and sour soup, Hot garlic chicken and fried rice are all good. They deliver fast and the food is always hot when it arrives. A lot of people from NY complain about not finding a decent Chinese takeout restaurant here in Vegas well here I am a transplant from NYC and I think Chinese Gourmet comes the closest to NY Chinese food. Give it a try you won't be disappointed."}
{"text":"The food was under par. Plus the service was under decent. Not a good experience and will never go back."}
{"text":"China Gourmet has quickly become my go-to fast food Chinese eatery.  It's conveniently located down the street from my house and next to Food 4 Less so I can go and grab a few groceries on the way home as well.  I came here on a whim one day because I saw one of their fliers in between all the other junk mail and ads.  I was pleasantly surprised by the quality of the food and the quick service!  Granted, the first time I visited was the same week that they opened so it wasn't too busy and they managed to hook about one or two other people to try their food while I was there but I tend to believe it's still somewhat of a secret.  The first time here I opted for the Black Bean Shrimp plate and it was actually pretty killer (better than most of the Chinese eats in my area but I dare not mention any names haha).  The second time around I ordered the Salt and Pepper Shrimp and was appeased again.  Both times my food came with Egg Drop Soup, Wonton Crackers, and a couple of Egg Rolls.  Plus, they give you a whole plate (yes a whole regular sized plate) of just rice!  So awesome!  I left both times happy and full.  The price was actually pretty good as well and they also offer lunch specials for the run-and-go cheap eats peeps out there.  I will definitely come back to visit again and I hope the quality of the food doesn't diminish in the future and end up another one of those \"fast food\" joints that fade into the background.  Yum!  See ya soon, China Gourmet!"}
{"text":"Ordered delivery (the Dinner Special Dinner A), it arrived fast and piping hot. Not the best Chinese food but definitely worth the money. Really nice service as well."}
{"text":"Best Chinese food I've found out of Chinatown. Crab Rangoon and the garlic chicken are the best I've had in Vegas!"}
{"text":"There are few, and by few I mean.. Just this Chinese restaurant that I would eat at as a non-buffet. I don't know why I just don't like them usually. Hunter however has a wonderful restaurant and is one of the sweetest guys. My boyfriend would go here over any other restaurant around Gastonia. Hunter knows his order even. The food is abundant and deliciously cooked. I certainly love coming here and having a nice meal. I tried the shrimp toast the other day and it was stunningly delicious!"}
{"text":"I've eaten at this place almost once a week since it has opened.   Everything I've eaten has been of good quality, cooked properly, decent portions, reasonable prices and the service has been very accomodating.  I have been given free extras at times, ordered extra sauce when I've carried out at a fair price.  Delivery to my home has always been fast and the food always has arrived hot.  The place has 4 booths and 4 tables and at times are crowded but I've always found a seat.  The food is excellent  and is better than any resturant I've eaten at.  I love the Garlic Chicken and the sauce they serve with it.  It is a sweet and spicy sauce but I always get 2 extra containers of Chili Sauce as I like it even hotter.  If you want excellent food at very reasonable prices,  give this place a try, you won't regret it."}
{"text":"DELICIOUS Won Ton soup! Bursting with flavor without being overly salty. And my to go order took 2 minutes tops! Yum!"}
{"text":"I have ordered dinner and lunches for home delivery over 15X since 2016. Every time the orders come with soup and coupons offering egg rolls, etc. Yesterday I ordered four lunch entrees and requested a simple dub of combo fried rice 8nstead of steamed rice and paid extra ($7) for that alone.  No soups, no egg rolls, nothing. I called to discuss. My lunch bill was $35. I was told too bad. I got nothing.  I told the hostess that I would go back to another local delivery and was told to go ahead, they don't  need my business.  FYI, I have owned three restaurants and a nightclub. My degree from Tulane is in the industry. Really shocking. I have never been spoken to that way by an employee. Or an owner or manager. Eyes wide open, friends."}
{"text":"If you all are in a franchise, I just buried your Sahara restaurant for the worst customer service ever.  I'll make sure everyone knows. Never again will I spend a penny with your horrible restaurant and staff."}
{"text":"This place is so awesome. Their mongolian beef is the best. My wife and I eat there at lease twice a month and even though its a little pricey its so worth it. And its even great when we order for delivery they greet us by name and already know what we like as we usually order the same thing and its delivered fast."}
{"text":"I had moved away from Las Vegas for 2 yrs. Always ordered from China Gourmet before I left. So happy to say service was faster than before I left!! Order in at 6:03pm; delivery at 6:30pm!!! That's fast. Food is just as good as before. So GLAD they are still in business!! I'm back to my FAV Chinese delivery!! BTW, order frequently and they will have your address and your favs in their database!!"}
{"text":"We love stopping in for dinner here. They are reasonably priced and give you huge portions. We always just order 2 and share. Very fresh and clean tasting. People are very friendly and helpful!"}
{"text":"huge tasteful portions. reasonable prices. i had to try this place out because China-A-Go Go is ridiculously over priced. will definitely go back when my family is craving for chinese food."}
{"text":"It's been awhile since I've gotten Chinese take out.  After a long day of hiking and exploring in Death Valley, this was my option to relieve me of any cooking duties that night.  I did not phone ahead but walked in cold.  I ordered the hot garlic chicken with no spice level for my wife who doesn't do spicy.  For myself, I got an order of Singapore noodles.  I had a seat at one of the tables and in less than 5 minutes, one of the employees was there with my order.  The rice and garlic chicken were packed in standard take out containers now made without wire handles.  My noodles were in a styrofoam box.  The bag had napkins, soy sauce, and plastic spoons.    Both meals were good.  There was a good amount of chicken, beef, and shrimp with my noodles.  The sauce with the garlic chicken was OK.   My wife liked it and I took a taste.  I'll return to China Gourmet.  It's not a far drive and it's another option for a quick dinner."}
{"text":"Now this is the kinda spot you would need to find. Truly a decent, clean, great Chinese food spot right in Summerlin.  We ventured here on strong recommendation from friends and my daughter loves this spot.  The location is more designed for take away, with few cabins for lunch n dinner. The food is what they get you with. Being a take-away design, food is served in ToGO plates with plastic spoon/knife. They make sure you understand that before you order, which is kind of nice to lay out expectation ahead of time.  We were three of us and each one ordered a different dishs - Kung Pao Chicken, Salt n Pepper Greens and Egg fried rice. Oh boy each items was super delicious, on the mark - its was a treat. End of it all it costs less then $35 total bill - what a bargain for that quality n taste of food. I will most certainly return  If you are in Summerlin, do find this spot - its truly a great Chinese restaurant."}
{"text":"Food is very good here! They are fast and super friendly too! They have great lunch specials. So much food for cheap!"}
{"text":"Located in the Food 4 Less parking lot on the southwest corner of Sahara and Nellis along the same business line as the Starbucks, Gamestop, and nail place.   My only visit here I ordered the combination fried rice, just to compare it to China-A-Go-Go that's located on Charleston/Sloan.  My order came up quick and so I also ordered a lettuce wrap chicken dish which was offf the hooooook.    The food was goooood.  I took a photo and posted the front of their paper menu brochure.  They deliver, open somewhat late, and I definitely would prefer this place over Panda Express which isn't too far.  Needs better advertising though!"}
{"text":"This tiny spot is quality, clean and easily tops the nellis avenue China a go go(which has the worst quality of any go go i've ever been to).   I tried the orange chicken and loved it. I also sampled a friend's pepper steak-awesome. My orange chicken was the best I'd had in over a year(as chinese food in vegas is so often horrible) besides true $$$ gourmet chinese @ the encore.  Best of all: this location has 7-11--style icees. I think I also recall seeing boba tea. I'll be back..."}
{"text":"The server was ok. Food was good. But they use disposable utensil and plate. It was really uncomfortable and there was only us. When we leaving they watching us say something i feel not good. Price is low, and food quality is exactly that price."}
{"text":"I'm very picky when it comes to Chinese food and I can say that the appetizer sampler was really good except I don't eat shrimp. I gave it a 3 star only because there was this creepy guy in there taking all kinds of pictures and before we got our food he had to take pictures of it. Ummm my food shouldn't be someone else's picture opportunity. He didn't even order his own food, no he wanted pictures of everyone else's. They should have told him no."}
{"text":"My new favorite place! Best Chinese food in town. I first ordered food here out of convenience but am now hooked!  I love their lunch specials. Great price for great food. I love their fast service. I called in a lunch special and was told it would be ready in 10mins. I arrived early expecting to wait and my food was being out into a bag as I walked in. And they have excellent customer service.  Unfortunately after I wrote this review I had a change of heart. I waited over 20 mins for 1 orange chicken special. I wouldn't be bother by the wait except when others are out before me. After I ordered my food, about 7 mins later two people came in and ordered the exact same thing I had. 5 mins later they walk out with their food. Soon a few more people walk in and place their orders and they got their food within mins. Finally I was handed my 1 simple order of orange chicken. Don't think I'll be coming here as often as I planned."}
{"text":"China Gourmet opened recently at this location and serves the Summerlin and Lakes area of Las Vegas. The food is made fresh and the lunch special with a free drink is quite a good deal. I enjoyed the curry chicken, singapore noodles and lemon chicken. Will definitely come back and eat here again. The restaurant is located next to Cafe Rio at the former Yogoyum location. The staff are all quite friendly and helpful too."}
{"text":"Excellent.   My husband surprised me at work last week with their lunch specials. The food was so good, that we had to go back for more today.   I love sweet and sour chicken, and my husband enjoys spicy Mongolian Beef. He asked for his 'extra spicy', and they did not disappoint. One of the few places that actually made it as spicy as he wanted.   They offer the lunch special every day of the week, and we got ours with the fried rice and chow mein noodles. The to-go boxes are jam-packed. It is literally as much as will fit in the box. Who does that?! Awesome. The kitchen here is open, and you can see everything they are doing. Nice touch.   The people here seem proud of the food that they make, and are very friendly. This place is a hidden gem. We got two lunch specials, out the door for $12.84."}
{"text":"In Texas Mexican men cook at Chinese restaurants and Chinese men cook at Tex Mex restaurants.   It's gives you a very unique flavors to say the least.  This place reminds me of that fantastic Texas flavor.  The woks are seasoned perfectly given you a amazing smokey flavor in your chicken fried rice!!  I will so be back.  Maybe tomorrow..  Love it!"}
{"text":"I tried this place when it opened a couple of months ago and have to say that it's the worst Chinese restaurant I've ever tried. I got chicken fried rice and they even messed that up - dry yellow (?) rice, raw onion, and slimy chicken. They have those awful, discolored pictures of their food on their menus, and the food really looks like that. Stay away!"}
{"text":"This place is worth traveling to, no matter where you're at in Vegas. Good authentic CHINESE food, is hard to find in any city. The customer service is always good! And I mean always."}
{"text":"WOW!  Clean. fresh, hot when delivered.  Fantastic Chinese delivery.  Not a single compliant -  may be our new go to for delivery.  Website needs design help / not the easiest site to figure out what to order, but totally worth the effort."}
{"text":"Food is great! Big portions too! Only thing that could make it better is if they turned on the A/C and turned down the music...."}
{"text":"I hate that this is my first bad review but, its a must! I have never seen such horrible customer service and food. We ordered here because we live down the street and always wondered about it when we would stop at Cafe Rio.  They delivered in an hour but, our order was completely wrong and they forgot dishes. So I called to tell them everything that was wrong, she never apologized just asked to call me back. We have already opened and looked thru the food at this point. She then calls back and tells us the food was packed with different orders and not to open or eat the wrong food given because it need to be delivered to another place!? I'm sorry but that doesn't sound sanitary to me at all!! She then said that our correct order will be on its way. She calls back again and asks \"did you eat a box of meat in a white box\" which I ordered beef broccoli and assumed that's what it was since it was beef and had pieces of broccoli in it. (Not the usual beef broccoli but this was my first time ordering from here). Anyways she says oh no that was for another order, your beef broccoli is coming now. Wow! So you also forgot my beef broccoli and now telling me I'm wrong for eating the wrong order. This place is all messed up and so unprofessional. The driver came and delivered all of our stuff they forgot, and took back the food we opened up. At this point I'm disgusted that they are taking back an order they gave to us to give to someone else. It made me think, \"who got our order first\" the food that came was not good, not fresh at all. We just ended up tossing everything in disgust. I will NEVER order from here again. It is not sanitary!"}
{"text":"Just ordered delivery from this place and it's absolutely delicious! My wife was craving Chinese so I looked on Yelp and saw that I bookmarked this place to try. The ordering was simple. Price was reasonable. Delivery guy was friendly too. We ordered: orange chicken, beef and broccoli, friend rice, and chow mein. Everything is delicious. I would definitely order again and recommend!   Yummy!"}
{"text":"Came here because it's my neighborhood Chinese place. Ordered for take out and I was about 20 minutes late picking it up and it was still nice and hot. I ordered the crab rangoons - SO GOOD! Best I've ever had actually. Vegetable chow mein, and the fish in black bean sauce. LOVE that they even have fish in black bean sauce. It's one of my favorite Asian dishes so big plus for me. I only did 4 stars because I prefer a thinner chow mein noodle. These were very large and weird for me to eat. But the flavor was still good. Also 4 stars because I'd like to try the other noodles they have but they don't have an option for them without meat. Bummer. The entrees come with a ton of rice and portions are really big. Great food for the price. Will be returning."}
{"text":"Food is good but the wait time to get food on the go takes forever they need to either hire more staff member to the place. Because the wait time is truly ridiculous"}
{"text":"Happily surprised by this Chinese food place! I haven't had Chinese since I moved here, and most of the time Chinese food places are just greasy, heavy, yummy food.   This place was actually a step above a standard Chinese place! We got the pot stickers... And they were... *gasp* crispy and lightly fried! The sweet and sour chicken was also nicely fried, and my beef chow mein was delicious!  What's more, the prices are great, they offer delivery (didn't do it this time but probably will in the future) and the staff inside were really really nice. I would even sit down there for a meal. It's not the nicest place inside, but good enough for a casual meal.   I'll update this after eating a few more times, to see if it's consistently good!"}
{"text":"THIS IS ONE OF THE BEST CHINESE RESTAURANT! The service was great, the food was excelent! the restaurant is small but so nice and clean. And they do DELIVERY!  I Had the walnut shrimp and wonton, it was delicious. the shrimp are fresh and the wonton was crispy outside but juicy inside.  I come here a lot and I DEFINETLY come again and again!!"}
{"text":"Got their Kung pao combination lunch special with a passion fruit boba. The boba was yummy. Place is affordable and the food is delicious. There was chicken, beef, and shrimp in the kung pao combination. I think they put too much celery in it. That was my only critique. Otherwise taste and flavor was good. They have other menu items that looked good as well. Service was fast here so when I ordered to go didn't have to wait long."}
{"text":"One star lost automatically from cashier who gave me that look when I asked for plates, sweet and sour sauce and extra soy sauce. I spent 40 bucks, didn't need the attitude.  Food wss good. Not happy with beef and broccoli.  Beef didn't taste very good. Chow main and orange chicken were delicious"}
{"text":"I am not much of a review writer. However, I can not pass up this opportunity to express my for China Gourmet. This is by far the best Chinese food I can ever recall eating. The portions are generous. Their prices are totally reasonable. They were quick with delivery. The food came hot fresh and so delicious. I usually  order from Chow Mein house, but decided to order from China Gourmet because I got their menu in the mail. We ordered Singapore Rice Noodles. They were delicious with a hint of curry. We also ordered Mongolian Beef, chicken and green beans, sweet and sour chicken and won ton soup. My far the Singapore Rice Noodles and Mongolian Beef were my favorite. Plus they give you incentive when ordering.. We got a free order of fried rice because we spent at least $25. Or could have picked any apatizer. That's with any order above $25. So stop scrolling. If you are looking for outstanding Chinese food to be delivered. Look no further."}
{"text":"Price per serving is unbelievable!!!! If you are on this side of town you should definitely stop in for lunch or pick up."}
{"text":"This place is really small (5 tables total) and it's your typical little chinese restaurant with your typical food choices. I stopped in for lunch and got the orange chicken combo for around $5. I was actually impressed. It was good flavor and I'm completely full. The chicken was descent quality and cooked well. (Some little chinese place over cook the day lights out their food) You won't find many drink choices either. (6 total pepsi products)"}
{"text":"I usually go to Chinatown for more authentic Chinese, but wanted to find some place on the east side of town.  There is 2 places closer to me that do pretty good fast Chinese food, but nothing to write home about.    Did a search on Yelp for Chinese food The was well rated - China Gourmet popped up.  It was a bit of a trek, but worth the drive.  In fact, I plan to go again.    I only got chow fun noodles, combo fried rice and veggie dish - some very basic dishes.  It's my usual standard - how I judge whether a place is good or not.  The week before I went to Panda Express (don't judge me - just wanted a quick bite ) most of them have the same food all bad.    China Gourmet definitely satisfied my appetite even with this basic dish - fresh, tasty and the portions are generous.   I will have to go back and explore their specialty dishes - they also have boba which is my fav - I didn't buy it though.   Happy to have a Good Chinese restaurant on the east side - it will be my go to if I can't get to Chinatown ."}
{"text":"The food is great.  Service wonderful.  But we elected to eat there and the food was served in styrofoam plates and cups.  We ordered a soup which came in a to-go plastic container and we were provided styrofoam cup to serve and eat with our plastic forks.   If this is only a to-go or delivery place, that's okay.  But if you are going to provide tables, take the time to get cheap plates instead of styrofoam."}
{"text":"The food was excellent and the delivery was early. I especially recommend the honey walnut shrimp."}
{"text":"Well...it's good I guess. Perhaps I am thrilled because it took much longer than it should have for such average tasting food. There's a much better spot that is cheaper and faster down the street, but I thought I should try this place to see what it was like. Ordered beef with broccoli and pepper steak...they might as well be the same dish with different vegetables. Will I go back? If the other spot is closed and I have no other options."}
{"text":"I came here on a Friday evening for a cheap Chinese fix! I ordered the Happy Family ($9.95). It had beef, chicken, shrimp, crisp veggies stir fried in brown sauce. I liked that the veggies were crispy and fresh. The meats were tender but the sauce was a little bland.  I ended up eating more of what my brother ordered Kung Pao Beef ($9.95). I loved this dish! The beef was tender and had just the right amount of spice!   The portions are big enough to share and you will still have leftovers for days! The won ton soup is also very good here! The service is very attentive and our drinks were always kept full!"}
{"text":"I've ordered from this place twice and have not been disappointed.  The food is good, the amount of food served and amazing and the quality is very good.  They have an extensive menu and their lunch specials go until 4pm.  I cannot comment on the facility itself as both times the food was delivered but like I said, they were amazing.  The food comes fast and the taste is gourmet.  This is a place I highly recommend if you are in the area as you should not be disappointed.  I have a few friends who order from them all the time and they have never had any complaints about the food, the staff or the amount of time it takes from order to delivery.  I will be ordering from this place again."}
{"text":"My boss bought us all lunch before the Christmas weekend. I was so disgusted by this place. My meal had a Bug in it and my co worker had a hair in her food. We all threw all of our dishes in the trash because all of us were so disgusted. Will NEVER EVER come here again."}
{"text":"I was really excited to try this place! I was grabbing myself some Cafe Rio after a long day and decided to pickup some food for my parents at China Gourmet.  I suppose the issue started when I was ordering the food. I told the girl taking my order that the first few dishes were vegetarian, no meat, fish or eggs and to please substitute tofu. I asked to make sure that they did not use fish sauce and she said 'no we don't use that.' So I proceeded with my order and after each vegetarian dish I stated, no meat, subsitute tofu please. The last dish I ordered was a chicken dish for my father (as he does eat meat).  I did not wait long for my food and the girl was nice enough to bring it out to my table.   My mom dished out the food and I checked to make sure she did not open the chicken dish (as she too is a vegetarian). I opened the tofu dish and it looked really strange so I took a bite of the food and of course it was meat, I was disgusted. I had bitten into a piece of pork, I had to wash my mouth out. The 'ma po tofu' dish was listed under pork and I specifically told the girl taking my order that I did not want meat.   I decided I would call to fix the issue, I knew it was a mistake and that there was obviously some sort of miscommunication. I call and speak to a girl (I was not sure if this was the same girl that took my order). I told her what happened and she told me that she took my order and that I never told her that I was a vegetarian. I then stated that I have been a vegetarian for over 10 years and I am fully aware of how to order vegetarian food. I tried to deescalate the situation because it seemed as though the girl was getting defensive and it was a simple mistake. I told her all that I wanted was a refund for the one dish and she said they would only give me credit.  I asked to speak with a manager (because I did not want credit, I wanted a refund for the dish that they did not execute properly. The manager stated that she overhead me order and that I did not state that I did not eat meat and I ordered a meat dish so they would not give me a refund and they would only give me store credit. At that point I became very frustrated. I have worked in customer service industry for over 9 years and I have been in food service for 5 years. If there is one thing I know, it is customer service and she was not treating me like a valued customer. I then told the 'manager' that I did in fact order a meat dish for my father and that I ordered 3 vegetarian dishes for my mother and I as eating meat is aganist our religion. I also told her that after every dish that was vegetarian that I would say 'no meat, substitue tofu.' She proceeded to tell me that it was my fault and we went back and forth. Then she hung up on me.  Maybe I should have checked the food before leaving the establishment. Regardless, I will never frequent this establishment again in the future. Possibly the WORST customer service experience I have had and a complete lack of respect for dietary/religious restrictions."}
{"text":"Pretty average Chinese food. Small inside menu is most of decor. Don't know if I'll be back but very nice friendly staff."}
{"text":"Decent food. Good lunch price. Turned off by the \"meh\" decor and as we dined in, it was all disposable containers. Really low frills. Don't think I'll return."}
{"text":"This is a very clean and inviting restaurant. The service is great and phone ordering is simple.  The food is delicious and not bland like so many other Chinese restaurants in this area. I have ordered tasty chow fun, delicious Kung Pao chicken, the chicken pot stickers are my favorite and Eggplant with tofu.  A gem in our neighborhood."}
{"text":"This is your average Chinese restaurant. Cheap but average food. They have a really cheap lunch menu, for only $5.95 you get an entree and a drink. Their customer service is very good. They checked on us on a regular basis and refilled our drinks in a timely matter.  The food is just ok, but again you get what you pay for. I found it kind of strange that they do not believe in plates.  The food is delivered on styrofoam and no serving spoon, which makes the food look even less appealing.  Overall, the restaurant is just ok if you are looking for a cheap and quick meal."}
{"text":"The food is very good.  Convenient location.  The immediate parking area is always full.  Won ton soup is wonderful.  Try the kung pow shrimp. The service is great, they are very friendly.  And yes they do deliver!  You can't beat the lunch specials!"}
{"text":"My favorite Chinese spot. Friendly staff, great food. Five stars."}
{"text":"The only place for Chinese Food, delicious ! Love their beef / chicken and broccoli in garlic sauce. They are always busy. Best to call in order. If you can't, the wait is very reasonable because it's not cooked until ordered. The portions are enough for two if you have a reasonable appetite. Love Hunter he's the best."}
{"text":"After a haircut at Fantastic Sam's, it was time to cut my hunger at China Gourmet. By the time I finished my meal, my opinion is that China Gourmet  shines at lunch specials but is outshined by New York Chinese Restaurant 1.3 miles south on Fort Apache Road.    China Gourmet stands near Carl Jr ( more $ than China Gourmet during lunch ) in an abandoned Smith's shopping center in the northeast corner of Fort Apache and Sahara. With that in mind there are acres of available parking spaces. When you get close to the restaurant, you will see a sign advertising that a beverage is included with the lunch special (a Yelp tip also advertised this). This might draw you closer to the restaurant. What I appreciate is that outside the restaurant the menu is posted. I could be indecisive to the degree that I don't want to be rushed making a choice. On this menu are the lunch specials ranging from $5.95 to $6.55. Just like the lion's share of Chinese restaurant specials the $6.55 items are shrimp-based.     If you decide you want to dine in China Gourmet, you will step inside a dining area that lacks fanciness. It is a similar interior to places including China Go Go and China One. In all honesty, some of the renovated Panda Expresses are fancier. A short distance past the tables, a friendly employee will direct you to sit at a table if your dining in. At the end of the meal you pay and on your judgment tip.    I ordered the peppersteak. The special included soup of the day-which is no surprise egg drop soup served in a Styrofoam bowl and crunchy noodles before the entree. I am tired of egg drop soup. I feel that Chinese restaurants should follow the example of N.Y. Chinese Restaurant by offering won ton soup with the meal. Fast forward a few minutes later, and I set eyes on peppersteak, chow mien noodles, and fried rice. Just like Bobby. Y addressed brown rice is nonexistent here. The peppersteak was good stuff. However, half the plate was taken up by the soft chow mien noodles. My tastebuds consider them a filler and a waste of calories. When I left, the employee filled up my Styrofoam cup of Pepsi and thanked me for my business.     China Gourmet is a good Chinese restaurant that outbeats several fast food places with a less expensive price than Panda Express during lunch. However, New York Chinese Restaurant 1.3 miles south on Fort Apache at Spring Mountain Road is a star-and-a-half better."}
{"text":"Food is average & location is convenient, but was disappointed in what I saw on last visit.  Three cooks were all eating lunch together, and I had to wait for them to finish before my order was prepared.  You would think they would stagger their breaks, so they could continue to serve customers.  Also, after eating, the cook did not wash his hands before preparing my lunch.  Not good."}
{"text":"Well this is a mixed review I enjoy the quality of their food....their service has bit me for the second time. I have tried to take into consideration the cultural aspect of our interactions and it must be the management or employees I come in contact with. I work in retail and if I treated my company's clients the way I have been treated here I would not have a job. I will miss the food, the poor service and what I felt was rude and in your face verbal interaction will assure they have lost me, my family, friends, and all who ask me for suggestions for this type of dining.....please learn how to be more customer focused"}
{"text":"Lunch prices before 4pm are around $6. House special chicken was decent. I liked that the chicken was clean white meat. My kids enjoyed the Tai Tea Boba here compared to other places. I've had worse items off the menu."}
{"text":"There's another Chinese restaurant on yelp that people say has the best Chinese food in Las Vegas. I went there after going here and I was very much disappointed. This place is good! Really good! Their shrimp fried rice, beef and broccoli, orange chicken, and egg rolls are delicious. I think I'm going to have this again tomorrow cause I really want to try their chow mien. The delivery was super fast and everything was fresh. The customer service is okay but the food is so good I can overlook some things. Their portions are a good size and the prices are great for what you get. The shrimp in the fried rice is huge! The honey walnut shrimp is to die for and the cream cheese wontons are addicting. Everything I've had so far has been delicious. If your in the area and you're in the mood for Chinese this is the place to go. Enjoy!"}
{"text":"Good ! Best chinese spot on the east side!!  Excellent portion for the prices they have. (Two people can eat for the price of one)  And awesome service!"}
{"text":"So being from California, it is odd to me that so many Vegas, Chinese places do not have the pre-made food for you to come in a choose from.  Sometimes, I like to see the food first before I order it, even though I am sometimes a creature of habit.   Wanted Chinese, it was last almost 9p.m., too late to go to the one spot I found I liked.  Looked on Yelp, and based upon where I was driving found this place.  Put in my order online here on Yelp, and bam food ordered, ready in 15 minutes.   Not many Chinese places make the crispy chicken for the sweet n sour sauce.  It is very rare to find the two not already mixed. I personally, love it when it is not already mixed.  This location, makes it just that way.    Since it was late and last minute we only had 3 items.  Sweet n sour chicken, white rice and orange chicken.  Everything was good!  Above good, excellent.  This will be one of 2 of my favorite Chinese spots in Vegas so far.  I particularly, like the sweet n sour sauce recipe they use. It is not watered down and a more vibrant red than most.   Too bad it is already 9:30 as I type this and they are closed, or I might go right now.   Top notch, non greasy, great customer service, good quality food."}
{"text":"My Daughter and I moved here about 6 mos ago from Texas and we are working on finding our favorite food spots.  We decided to visit China Gourmet last week for dinner based on others reviews and were not disappointed! This place looks very clean and comfortable.  The staff were all smiles when we walked in and once our order was placed we quickly received our dishes and each was delicious and impressive in taste.  The Tso Chicken was actually somewhat spicy! So many places I have visited in the past that had spicy dishes that didn't deliver the heat.  We both agree that we have found our new spot for great Chinese food! Thank you again!"}
{"text":"This place has been a staple for my husband and i. We come here atleast once a week. And we have never had a bad experience. Way to go China gourmet. We always get the fried rice and try something new every time. Nothing has been nasty!"}
{"text":"My first time going here today. They took great care of my family and I. Service was excellent and good timing, I'm new to the area lived over here about 10 years ago and found my new food fix. Close to shopping and in a good neighborhood."}
{"text":"Best combination rice ever!! I always order it when I eat here and that's what keeps me coming back"}
{"text":"Friendly staff,  clean,  pleasant dining area.   Steady traffic of customers usually picking up orders.  Sauces for the the entrees we tried were very good.   Be sure to request mild,  as the entrees we received were slightly spicy; peppers present!   Food came out steaming hot from the woks!  Generous portions for the price.   We'll be back."}
{"text":"I absolutely LOVE CHINA GOURMET! I work in fine dining coming up on 20 years! I have never been disappointed! The veggies are always bright in color and quality, cooked perfect al dente' ! I have tried many dishes and love everyone! I HAVE SEVERE ALLERGIES ANAPHYLAXIC SHOCK TO SHELLFISH. AND MUSHROOMS! I love Chinese and Thai food but I won't risk it! I know that cross contamination happens all of the time in kitchens but After ordering from them more than 10 times I've never had a single problem! Every time I order I get a phone call checking my allergies and my very very picky order! I am a nightmare customer! I have food allergies, I am picky and very hard to please, I hate mini corn, I sub this for that ask for extra garlic in all dishes, XTRA soy sauce, boba tea with no boba! They always deliver perfect on time fresh food! My favorite when I'm sick I order the egg flower soup and they take out the baby corn, add tons of garlic and onions and hot peppers! Their Chow Mein is incredible never mushy, always fresh! Their fried rice is amazing! I love their pork fried rice, their BBQ pork is amazing, always fresh and the pork is tender, not over cooked or fatty. I usually hate chicken dishes from Chinese places. I have ordered Moo goo guy pan, spicy garlic chicken, sweet and sour chicken and their appetizer ground chicken and onion pan fried dumplings. Everything I have ordered was perfect flavor, and all white meat chicken once again the veggies fresh colorful aldente'. My husband loves the broccoli with Beef. You can even tell they hand roll the egg rolls! I can't say enough good things about them!!!"}
{"text":"The food was great, but the wait was long. Granted, it was a Friday night around 6 when I went in, but it was quite a while before my food was ready, and I had one entree and fried rice. There also wasn't any nearby parking available, so I had to park a little farther away. It's right next to Cafe Rio, so between that and being in the dinner time rush, there wasn't any close parking. I'm not opposed to walking, it's just hard to manage two small kids and a bag of Chinese food across the busy parking lot. But the food is excellent. There's also usually an ad in the weekly flyer with some coupons- there's one for 2 free crab Rangoon or wontons with the purchase of an entree."}
{"text":"This is good quality, pleasing tasting Chinese-American food. Good portions, their lunch special is a bargain and they are always pleasant. What more could you ask of a neighborhood place. Fast delivery too. Price fair, clean."}
{"text":"Used to be a regular here and food was good and reasonable, no more, went on today and got my usual Shrimp Chop Suey but where's the shrimp and mushrooms? No longer good and they also charge to use your credit or debit card so singles, stay away from this place unless you spend over $10. I will no longer come here, no reason to anymore plus now they're also rude."}
{"text":"Glad that we finally tried this spot. Ordered for pickup via Eat24, and was pleased with the speed with which our food was ready.  We tried the egg rolls, Hong Kong style crispy noodles, shrimp egg foo young, and chicken fried rice. (Yes, it was a cold, Chinese comfort food sort of night.) All the dishes were good--well executed and, seemingly, for inexpensive Chinese takeout, healthfully prepared; the food didn't seem insanely salty (again, from a relative standpoint), and it wasn't prepared using MSG (always nice not to have that telltale post-meal reaction).  The prices were reasonable, and the portions good-sized. The chicken fried rice seemed like a particularly good deal ($6.25 for a large container).  I agree with the previous reviewer that, for New York City expats like myself, this Chinese takeout spot is a decent choice. On the Chinese takeout spectrum that exists outside of New York--from Middle-America-mall-food-court food to somewhat-reminiscent-of-what-you-can-order-anywhere-in-the-city--China Gourmet's food falls toward the latter end. It won't change your life, but it will satisfy your hunger on nights when you don't feel like cooking."}
{"text":"I absolutely love this place. They are fast and the food tastes great. I love potstickers and the sauce they include is great. The lettuce wraps are delicioua. Everything is really fresh."}
{"text":"The quality of the food really is notably bad. Even for a cheap Chinese takeout place."}
{"text":"We ordered here twice already in the last week! Definitely our go to Chinese place now :)"}
{"text":"Thank you China Gourmet! I was hoping to find a good Chinese spot that is both delicious and affordable and this hits them both on the head. Reminds me of the Chinese spots I grew up on back east and is my new go to spot. We've been 3 times already in past few weeks and I don't see that stopping anytime soon as I love me some fried rice!  At this price point you often get flavorless Chinese food or Panda like quality but this is one of those rare spots that just does it right. Love the fried rice and the sesame chicken was delicious!  See you in a few days China Gourmet...."}
{"text":"We ordered egg corn soup, combo fried rice, pad Thai, Mushu chicken (cabbage and chicken wrapped in a crape), honey walnut shrimp. All are tasty, everyone left satisfied. Good service, although most of their business seem to be delivery or takeout. Free refills were offered by the waitress constantly. Watched the chef work the wok over the intense fire, he's got mad skills !"}
{"text":"I recently moved out and was looking for good Chinese food and they really hit the spot...food was good and solid..... They give good portion.....and have tons of options..... The fried rice is exceptionally and do are the noodles.....all in all I have yet to not like any of there food"}
{"text":"Always has  warm food and  they always have good customer service . The bathrooms are clean .  I've never had a problem with any of its employees . They always tell me about discounts ;)"}
{"text":"we always order from here when nobody cooks we are a huge family of 10 so we always order big . our food is always delivered on time and is always warm . the kids love the beef and rice we love the chow mein. everything is always delicious and i could not be happier with the service they provide"}
{"text":"This is basically a dumplings and noodle restaurant , all items under $10 except one or two. The place is very clean and the waitress/owner? very nice. This is the only place open at 8am in China Town,  may be that is why not many people know the early hours. The place kind of empty in the morning.The noodle and dumpling are very tasty and generous portion. Definitely will come back again."}
{"text":"Not sure what happened, this used to be my go to chinese place but this time, it was so salty i couldnt not even finish 1/2 of it.  Guess this is it for me.  Good bye china gourmet"}
{"text":"China Gourmet is a solid option for some fast service Chinese! The highlights were friendly service and the fact that the lunch specials currently come with a free beverage (not sure if that will last forever). We stopped in for lunch, and I ordered chicken and broccoli in a hot garlic sauce. All of the lunch specials are served with fried rice (no extra charge) and lo mein. Alas, they do not have brown rice. The dish itself was generous, and I appreciated that they don't overload the sauce with corn starch, so it wasn't gloopy. However, it was a bit too sweet for my personal taste. Even so, I ate it all, and washed it all down with freshly brewed iced tea. The spot is fresh and clean, and the service was all smiles. A solid option for some Chinese on the run."}
{"text":"Great prices and great food all in one spot.  I've lived in the area for nearly 20 years and have seen many restaurants come and go.  We have ordered delivery from this place countless times and have yet to be let down.  The food is quality and always tastes fresh.  It is always delivered HOT and there is plenty of it.  We enjoy the shrimp and snow peas and the chicken and broccoli.  All the vegis are fresh and crisp, not over cooked.  The combonation fried rice has whole shrimp, chicken, beef and bbq pork.  The War Wonton soup is full of vegis and tons of wantons.  We order the family dinner B and it comes with egg rolls, fried shrimp and crab rangoons.  All for $30.  Not bad considering it easily feeds 4 people.  I have picked food up here as well.  I think the open kitchen concept so you can see your food being cooked in front of you.  The offer amazing lunch specials for under $7 that include a drink.  We quit ordering from the other Chinese restaurants in the area and have yet to be disappointed by China Gourmet."}
{"text":"I ordered a simple entree of orange chicken with spring rolls under the impression it would arrive in 30-45 minutes. I was disappointed to find that as soon as the order processed, the estimated delivery time changed to a full hour. I made myself wait, however, telling myself it would taste better if I was hungrier, but that hour slowly stretched to an hour and twenty-five minutes. I eventually called the restaurant to ask what happened and then was told that someone was on the way. They arrived about 10-15 minutes after the phone call. The delivery man pressured me for a tip before handing me my food, which was extremely disrespectful and uncomfortable.  The food was lukewarm. It had obviously been sitting out and none of it tasted fresh. The orange chicken was dry and so was the steamed rice.  :( I'm really disappointed as I expected much better from the reviews. Maybe it's just best to take-out or go in to eat, but I definitely won't order delivery from them again. Must be a hit or miss place. I saw some really good reviews and some other bad ones. I've had better service elsewhere though so I probably won't come again."}
{"text":"This Chinese food was dried up and must've been a few days old. The noodles wear red because the sauce soaked into them for days and the chicken was like dog treats that were dried up. I would never go to this place and get food again. Supposed to be gourmet Chinese food and it was worse than any takeout Chinese I've ever had"}
{"text":"This place was very good. The honey walnut shrimp was very good. Everything was cooked to perfection. The boba was amazing. I think I found a new fav."}
{"text":"We ordered dinner to be delivered about 1 week ago. The food was fresh, hot a yummy! So glad to finally find a good Chinese restaurant that offers delivery. Will definitely order again."}
{"text":"Wow this place was great! We ordered delivery and looked at the menu on the website. For my boyfriend and myself, we ordered \"Dinner B\" which came with soup (we got wonton), 2 tempura shrimp, 2 egg rolls, 2 cream cheese wontons, steamed or fried rice (order the fried because they'll also give you a carton of steamed so you can have both!) & 2 entrees. We got chicken broccoli and sweet and sour chicken.  Also ordered honey walnut shrimp as an extra dish.  It was SO MUCH FOOD and so good. Definitely would be enough for a family of 4. We ate so much and it looked like we barely touched our meal at all.  I especially liked the sweet and sour chicken, soup, and fried rice. The honey walnut shrimp had a slightly unusual taste to it although idk what it was.  $2 delivery charge. We live a little less than 10 mins away, and the woman on the phone quoted us a wait of 45 minutes after we ordered but it only took 20! The delivery guy was very friendly. We will definitely be ordering from them again."}
{"text":"This hole in the wall is more than meets the eye.  I''ve tried my luck at nearly every chinese takeout spot in the East Valley, and I can definitively say the food at China Gourmet impressed me the most.  PROS: Made from scratch.  Heaping portions at very reasonable prices.  Quality far exceeds expectations.  Single-handedly raises the bar for local take-out.  CONS:  Made from scratch.  So the wait time is fairly substantial (20-25 minutes in my case). Doesn't look like much from the outside.  Very small, only three tables and no restroom. Definitely intended to be a take-out only kind of place.  Recommendation:  The teriyaki beef was incredible, and not at all what I was expecting.  Instead of chopped beef in the thick teriyaki glaze I'm accustomed to, theirs was a thinner marinade that soaked completely through the meat.  Every piece was consistently tender and loaded with flavor.  I'd never had teriyaki of this caliber, and definitely didn't expect it from a little hole in the wall like this. Paid 8.95 for an order that could easily feed two with leftover.  The best, by far, was the hot and sour soup.  It put anything I'd tried previously to shame.  It was 2.50 for a quart, and short of Thai Chili's Tom Yum, it's the best hot and sour you'll find in the valley.    If you happen to be in the area, it's definitely worth a shot.  Make time, so you can afford the wait, and you won't be disappointed."}
{"text":"Waiting to find a Chinese restaurant that makes chicken chow mein as good as theirs.  I don't know what it is about it but it is my fave!  All of their fried rices are tasty as well.  I am going to keep trying items on the menu and will update when I do.  I am sure they will be tasty!"}
{"text":"The food here is great and the prices are extremely reasonable.  We eat here often and the meals have always been very good and the service is great.  The only downside is that if you choose to eat-in (and there are plenty of tables) they serve you a on very flimsy paper plates and plastic silverware that bends and breaks .   We have taken to bringing our own flatware from home before coming but hey really need to step up and get better disposables"}
{"text":"Good place to eat, only problem they only give one soy sauce pkg., not enough then wanted to charge extra for two more pkg on take out orders. No way, cheaper to buy a bottle at the store. I just wished they had a bigger place to seat more customers, because the food is worthy to set in and not be rushed. Love their lunch menu."}
{"text":"Very nice brunch. Authentic Chinese style. I tried fried duns and beef noodles and they were both fantastic. Great service as well. Will definitely drop by next time in LV. ?????????????????"}
{"text":"Great neighborhood chinese restaurant,  and they deliver. Chicken wings & House special chicken are my favorites."}
{"text":"O my god .... If you like vegetarian dishes packed full of flavor and not made out of weird artificial meat... come here . I stopped eating meat 2 weeks ago and I've yet to have more than a few really GOOD meals . This was one of the best . Fantastic , light yet flavorful dishes . 5 stars"}
{"text":"I love this place. The guys really nice. The food very very good.My family very like .the prices cheap .."}
{"text":"This is the worst Chinese food I've had in Las vegas. I ordered pot stickers, some kind of shrimp stuff,Mongolian  beef,egg rolls,mango boba,I paid 30 dollars for, I had to brush my seat off to wait for my food. The benches were dirty floor had crumbs rable weren't wiped down I saw no bleach bucket near the sink. The guy walked in set his drink down went to computer screen. I looked up he's got a bag in his hand near the counter. He brings it to me, I asked if he washed his hands, he said yes, but I can not recall, she had to remake the mango drink to honey dew one, wich is a little better. I took my stuff home, it was half hot and cold the shrimp had left legs and skin on it. Some kind of chicken thing she fave me is burnt. All the vegetables were hard."}
{"text":"The food was delicious and fresh! It reminds me of the Chinese food in LA... loved it."}
{"text":"China Gourmet is one of my favorite Chinese restaurants... My go to, for sure!! I love their chicken wings, BBQ pork chow fun, and more.  Their dishes are tasty and service is quick.  China Gourmet reminds me of the Chinese food back home in Hawaii"}
{"text":"Food was decent and the staff was mediocre. Could definitely tell who the regular customers were as they got more attention but hey I received my food hot and with little wait. Might stop in if I'm in the area but won't go out of my way for them."}
{"text":"Their meat quality has seriously deteriorated over the months and now is gritty and overly chewy most times. They are having quality control issues as of late, you order one thing and they bring you something else, while special orders throws them for a loop. Some days this place is great, some days it good, some days its not. Buyer beware I guess, its the luck of the draw. 2.75 stars. Got to maintain their quality."}
{"text":"Passed by this place several times before going in. It was quiet and there was only another table occupied. I was seriously doubting the quality of food here, but they surprised me with home style cooking and taste of my hometown in China.  Items we ordered, the breakfast combo with beef noodle soup and the combo with steamed buns. They were fantastic!! Highly recommend this place if you want something simple and as close to home cooked (Northern Chinese) as you can get in Vegas."}
{"text":"My first time here last night, and honestly the food is AMAZING. Quick service, great food, and reasonable prices. I will def recommend this to everyone in town. If you're looking for authentic Chinese food, a great selection, and great portions, then you gotta come here!!!!!!"}
{"text":"Good Chinese food and restaurant. Quick and easy to come in and order. My food was cooked fresh. Food was was hot and good when I got home."}
{"text":"We ordered from here for the first time tonight. We got delivery and they said it would be forty five minutes. We were pleasantly surprised when we got a knock at the door in under a half hour (we live pretty close,  but were not expecting it that quickly!)   The delivery guy was very friendly and talked to us about our dogs. He also was very patient as I could not find my wallet!   We ordered the family dinner: cashew chicken,  general tso (they let me substitute this as it was not listed under the options) , soup,  shrimp, egg rolls, and crab Rangoons. We also got rice and ordered extra chicken lo mein.  It was all delicious and we will definitely order again!"}
{"text":"I order all the time. Awesome food and fast delivery. Everything I have ordered has been so tasty. I highly recomment this restaurant. You won't be disappointed"}
{"text":"Had them for lunch and it was 5.95 for a lunch specials very good price. I ordered the house special which is General Tso's with rice and noodles. The food was very good and it was on time and very hot. Definitely go back there again for some more tasty food"}
{"text":"China Gourmet is a quick chinese food fix.  The food is fresh, tasty, and there is a decent variety.  Try the family meals or the dinners for two combos for great value. We had the appetizer platter with shrimp, egg roll, foil wrapped chicken, etc.  Everything was tasty.  We also had the happy family and a spicy shrimp dish.  Everything was well prepared.  The service is friendly, the place is immaculately clean and there is an open kitchen if you want to watch them prepare your food.  For those of you from back east or who are sticklers about authentic chinese, this place is not there.  Rather it is somewhat better than the heat lamped panda express and an east coast chinese restaurant.  Still, Fast fresh chinese food is hard to find in LV and China Gourmet won't disappoint."}
{"text":"Very good for a plastic fork, paper plate Chinese place. Not sure where General Tso learned to cook chicken, but he learned well! Get the extra spicy sauce if you can handle it. Tell Hunter hello, I think he owns the place. Makes the experience interesting."}
{"text":"I decided to try this Chinese restaurant because i always pass by it while going to cafe rio, and its close by the house. This place is really clean and really good customer service they offer to their customers. You can either dine in or buy takeout. I ordered the Mongolian beef, shrimp fried rice, salt and pepper calamari, wonton soup, and stir fry vegetables with shrimp. The food was excellent and very large portions for the price. We had plenty of leftovers. The food had so much flavors and my favorite is their fried rice. They do well for delivery either you're working on the job and need food quick, they\"ll take care of you. Super friendly and fast service, they never give attitudes like other Chinese restaurants do."}
{"text":"Speedy delivery! They always have my order correct and I have never had any issues with them especially ordering about 3-5x monthly for a year and a half now. Food ALWAYS tastes great. I'm actually ordering from them right now as we speak  chicken broccoli , Mongolian beef, shrimp chow mein, sesame chicken, egg rolls, boba tea and orange chicken are my constant orders. Great taste, Great price, one of the tops in Vegas."}
{"text":"Great noodle house, delicious, inexpensive but unfortunately, we were the only patron around 6pm on a Sunday evening. It's location does not help as well. House Special Fried Bun, Spare rib noodle, Pork chop noodle all excellent including the tea. Will come back again. Hope they will remain open. If your looking for cheap delicious eats, good Chinese food, look no further!"}
{"text":"Ehhhhhh. So-So. Very nice and accurate meals. But food tasted a bit artificial and thrown together mechanically."}
{"text":"It's so nice to go to a favorite local restaurant where the staff is not revolving and better yet, after a polite greeting we're asked if we want our regular order...  Still the best for food and experience!"}
{"text":"I only order from this place. They're quick, always friendly, they remember my delivery info and sometimes even the order. The food is delicious, they give very generous portions, and my daughter loves their food! If they can get my picky two year old to eat, I'm happy. We love this restaurant."}
{"text":"Very satisfied with this place.. Most Chinese restaurant I've gone to, when I order the Mongolian Beef they put a lot of onions and veggies, not so much meat.. When I ordered it at this place got a lot of meat, decent amount of veggies and it was very good.. DEF will b coming back.."}
{"text":"We pick up take out from here almost every week. The dishes are always fresh and hot. The honey-walnut shrimp is a big favorite.  The sauce is perfect, the shrimp are crispy and the candied walnuts are absolutely perfect. We've tried almost everything on the menu. It never disappoints!"}
{"text":"I ordered orange chicken and a crunchy roll. The sauce on the orange chicken  was discolored,  extremely thick, and disgusting. The \"crunchy\" roll was more soggy and sad than anything so I didn't even bother eating it."}
{"text":"Very disappointed in the food. We ordered lemon chicken which had a strange flavor and when we were asked hoiw everything was, we told her the lemon chicken tasted overwhelmingly sweet and didn't like it, I guess they really don't want the truth because the lady told us \"thats how it is\". The garlic chicken that was ok, chicken chow mein was flavorless and mushu chicken was the one good dish. Oh, and right after the food was served, the restaurant had a strong chemical smell that I related to a nail salon.  After we mentioned the lemon chicken to a second server, they did offer to substitute it for another item, we got beef broccoli which we brought home and did not try yet. Everything was served on styrofoam plates and for the prices, I'd rather go to Panda Express, the atmosphere and food is much better at Panda."}
{"text":"I've ordered delivery a couple times and it's fast and the food is hot. There's nothing special about the food but it's solid and has never disappointed.   The Kung Pow combination with no shrimp is probably the best thing I've had. Good combination of meat and veggies.   They take credit cards (no Amex, boo) too. That's a bonus. This will probably be my regular Chinese delivery."}
{"text":"I've been trying to find a place like my \"go-to\" Chinese place back home and this place is the first Chinese place I've eaten at it in North Carolina that's even close! Their portions are large and such good flavor! Always friendly bit they're also always busy which tells you how good their food is!"}
{"text":"Ordered $60 worth of food last night and usually this place is pretty good. For some reason this time i got horrible food AND horrible service. The fried rice was undercooked and the orange chicken was over cooked and very dry. When i called and asked for a manager and maybe an apology for the food being off. I got cussed out on the phone by a Woman that said she was the manager. Its a shame because i really liked this place and i will never go here again. Hopefully neither will anyone else after hearing anout this and reading all the other comments similar to mine."}
{"text":"Best take out I've had in vegas so far after trying probably 15 different places. Szechuan chicken is my favorite and the prices are dirt cheap here. Hope it stays open cuz all the yuppies flock next door to cafe Rio without even a look to this place."}
{"text":"Best Chinese Singapore noodles I've had in a long time, fresh veggies and the exact spice level I asked for.  I placed my order for delivery over the phone, very simple and fast unlike take out elsewhere!   Only took 20 minuets to get to me and was exactly what I wanted! Definitely ordering from here again in the near future :)"}
{"text":"Best Chinese lunch spot hands down! Fast, fresh and super friendly spot to eat in Summerlin. $6 lunch special comes with egg drop soup, wontons, drink, entree, rice and noodles! So bomb!"}
{"text":"Being Chinese food lovers, my wife and I go to a lot of Chinese restaurants. There are so many Chinese/Asian restaurants in Las Vegas, it's usually just a matter of going to the closest one to where we are at at the time. Generally speaking, menu items, taste and preparation is very similar with Chinese food, so it really comes down to the freshness of the food and the service for us.  The owners own 4 restaurants and this is their third China Gourmet that they have opened up. It's pretty apparent they know what they're doing. The establishment is clean, spacious and in a great location on the westside right at the corner of Sahara Ave and Fort Apache.   We wanted to try a few items, so we ordered the Happy Family (a delicious mix of shrimp, chicken, beef and assortment of vegetables in a brown sauce), Combination Chow Mein (chicken, beef and shrimp with soft noodles), Mongolian Beef, egg drop soup (on the house) and delicious cream cheese filled rangoons.  The food was super fresh, piping hot, delicious and very reasonably priced, but what impressed us most was the service. From the sweet, warm greeting we received as we walked into the restaurant, to the smiling, friendly server, to how accommodating they were in trying to please us, for example, the Mongolian Beef usually comes with green peppers and is spicy, which my wife doesn't like. She prefers onions and green onions and mild on the heat. They were more than happy to prepare the dish this way for her and gave her some of their delicious home-made hot sauce on the side. This hot sauce is awesome!! I personally love hot food, so their home-made hot sauce was a great addition to all the dishes for me.  The owners Mike and Vicky came over to our table and introduced themselves. Lovely warm, friendly people who have a passion for their business, truly appreciate their customers and want to please them, and definitely know how to run a good restaurant with their experience as owners of several restaurants.   They were so sweet to us last night, I just wanted to reciprocate in some way by giving them a good \"plug\" on Yelp. We wish them tons of luck of success with their newest venture and ask that as many of you as possible try China Gourmet on 9002 W. Sahara Ave, Las Vegas. You won't be disappointed!"}
{"text":"Best Chinese food around here. Love their chicken and broccoli, lomein and fried rice. Even the small plates feed me for 3 days haha The guy that owns it is super cool too."}
{"text":"My husband and I usually eat here on the weekends. The fried rice is very tasty as is the chicken with broccoli.  I ordered the moo goo pai one time. It was very watery and tasteless.  The service and staff is very nice."}
{"text":"***Bad service***    Giving bad review is not my cup of tea (pun intended ;)) but after the experience with this place, my goodness!  Went in for a couple boba drinks: coconut and Thai tea. -- while the rest of my family was next door at Cafe Rio. Lady makes Thai tea with freaking Coffee Mate. Yeah. If you're familiar with what goes in a Thai tea, Coffee Mate isn't it. It's a dash of coconut milk. Easy. Wanted my money back after walking out and changing my mind. My kid had taken a sip and the older lady was yelling at me refusing my refund. Anyway. Got my $3,50 back.   After this, I don't even want to know what's in their food."}
{"text":"Excellent food and service! Huge fan of war won ton soup. Super fresh ingredients and great atmosphere. If you're looking for good Chinese, look no further"}
{"text":"My friend randomly text me a picture of the noodles he ordered the other day, which turned out to be from China Gourmet.  It is just a few doors down from QQ Tea Plus (which I am sadden to learn has shuttered its door recently), and is across the street from the Old SF Market and Milk Teaze. The noodles looked pretty good.  But since moving to the SW, I no longer drive down Spring Mountain Rd as frequently as I once did.  Fast forward a week or two, we decided to grab a late lunch at China Gourmet.  It was around 3pm when I arrived after stopping by the ATM, and the place was completely empty.  Not the best feeling or first impression, but I went in any way and was greeted by a Chinese waitress asking if I wanted ice water or tea while I waited for my friend to arrive.  We initially were planning to order one of their noodles, but after looking over their menus and talking to the waitress, we ended up ordering their Beef Roll (large enough to share or have as a meal, instead of an appetizer) and also an order of their Seafood Dumpling (it has shrimp and pork, in case you are wondering).  The orders came out fairly quickly, and was surprisingly good. I would definitely be back to try more of their \"Breakfast\" menu, which I think is actually served all day, and to try more from their Dumpling menu.  The food is not high end or gourmet, the presentation right out of the kitchen is fairly pedestrian and trying to glam it up for social media will definitely require some skills, but if you are down for wholesome Chinese food at a reasonable price, this China Gourmet is your place."}
{"text":"Really good Chinese food. Love it.  And they have coconut slush which is my favorite! I can never find it anywhere.  They are always polite and look hard  at  work.  I've never gotten something I didn't like from here."}
{"text":"I don't know, why all these good reviews? Got me? Perhaps, I was living in Hong Kong too long and had experienced true Chinese cuisine? Ordered Egg Foo Yung, in return I received something so awful, the brown sauce was thick and starchy with out a taste nor flavor, the egg foo had so many culinary disasters. I would never be able to forgive them on such a simple dish. Try San Francisco China town for some real delights!"}
{"text":"Delcious! I absolutely love their cashew chicken and chow mein. My boyfriend is a big fan of the lemon chicken. The first time we ate there for takeout we came back the next day. The staff is very friendly too."}
{"text":"I had the House Special chicken for $5,95 and the portion is huge! The taste of the rice is good and my favorite are the noodles, they are delicious. The chicken is very well made! Coming back here soon! This place is good if you are on a break from work and you need some good hot food fast."}
{"text":"All the dishes we've ordered are inexpensive and very tasty. The waitress is very nice and made sure to offer suggestions that we should try.   As appetizer I'd recommend Steamed Eggplant with Garlic and Chili Sauce + Spicey Shredded Potato  We'll definitely come back again and try other menu choices."}
{"text":"Wonderful quality with great flavor. The portions are huge and you definitely get your money's worth. The staff are hard-working and friendly and eager to satisfy your requests. What you lack in Ambiance, the restaurant more than makes up for Quality and flavor"}
{"text":"Will never come back here.. Food is tasty but they are overpriced. Just bought salt pepper pork and lemon chicken with free rice and they gave me lots of lettuce and small serving of what i ordered."}
{"text":"Eggrolls are good not great, shrimp f/r is good, I think it was the hot oil beef that was really good, LM was good, Won Ton soup was good, friend chicken to spicy for me, fried chicken okay, the food here is good, some things are really good, it's a hit of miss, the sesame chicken was just okay, I mean it was good, but not the best I have had. They have good customer service and seem like good people. They didn't tell me about the coupons my 1st order tho. They have coupons that are like buy over 25$ get a free appetizer etc. I didn't try the dumplings, cause I like the home made kind, n the ones here look store bought. I like the beef dishes here mostly & veggie. The Walnut shrimp was awesome."}
{"text":"Soooooooooooooo, I've moved to North Las Vegas for about a month now, and it's semi-tough finding potential regulars because the majority of the food here seems to be on the unhealthy side and non-Asian.  I mean...ethnicity charts do indicate this zip code to have under 5% of Asians...so that's expected I suppose.  Hence my somewhat generous rating for China Gourmet.  It's the most Asian Chinese restaurant I've found in North Las Vegas...so far.   Upon opening the doors, I see employees and customers who are all Asian--a rare sight around this area.  Looking at the menu, I see a large variety of options--both authentic and Americanized options.  This place is pretty good considering the gigantic portions!  I came here during the weekday for lunch and got one of the lunch special items: kung pao combination ($6.75).  It came with shrimp, beef, and chicken.  It had plenty of veggies and protein with plenty of flavor (maybe too much?).  The rice was okay.  The chow mein was a bit better.  The meal came with an egg drop soup that had corn in it.  It was pretty good with nice consistency.  As for the drinks, I wouldn't recommend the honeydew fruit slush with boba ($3.50) though--it tastes very artificial, but the tapioca balls themselves were chewy and tasty.  I might try a safer option like a non-fruit drink next time.    Overall, I'll come back.  Until then, I will slave away in my residency program until I get to see sunlight again."}
