{"text":"There are so many options when it comes to Chinese food but finding this place has eliminated that worry for me. Every dish I've tried is great. I especially like the chicken dishes here. The service is fast when you order delivery and when you eat in.

I initially gave the restaurant 4 stars and then realized that I have been saving that 5th star for a great place like this one."}
{"text":"Let's start off by saying that I have never written a review before. China Tango is the first restaurant that I felt deserving. My husband and I have consistently ordered from China Tango for the past few months... Honestly sad to say but average 2 to 3 times a week and they have not disappointed us. We have only used the delivery service so we are only able to review that service and the food. 

Order: 
We usually order through yelp but a couple of times we ordered over the phone. Both options are pretty speedy with no complications.

Delivery: 
The best delivery service ever! They are soooo speedy. From the time we order to the food arriving at our house about 20-30 mins top. 

Service:
Exceptional! They are very speedy and thorough. China tango has NOT made a mistake on any of our orders. And that's a lot to say since it has probably been more then 25 orders. Each and every requests we have made have been carried out. This last time we asked if they could make orange shrimp (not on their menu) since I do not eat meat and without hesitation, the guy over the phone says of course. And it was AMAZING. 

FOOD THE BEST PART: 
OMG China Tango is the best chinese food that I have eaten and I've eaten Chinese food everywhere! Everything is delicious! My husband loves their general tsao chicken and orange chicken. My favorite is their salt and pepper calamari and shrimp, kung pao shrimp, and sweet and sour soup! They have the BEST sweet and sour soup and the best thing is that you can choose your spice level.

Overall, 
If you are on the fence of trying china tango, Do It!!! Exceptional service and food. What else can you ask for?"}
{"text":"I had the war wonton soup without carrots and snowpeas. I'm allergic to it. Best soup ever.  Even crab Ragoons are delicious.  I will be back again tonight.."}
{"text":"Whoa, this is some amazing good quality Chinese. Also, I have never had food home delivered that fast before!"}
{"text":"Love the chow mein noodles! Best I have ever had! Lunch specials are $6-8 and large portions. Servers are sweet. Its a cozy, clean, and open environment. only downside is if it is lunch time and you dont get the specials...food takes about 20 minutes and tastes old. Family business. Lunch time is quiet with only one or two couples rotating in and out. Dinner time has more couples and small families, always a table ready quickly though."}
{"text":"Typically I just get take out here and have always been satitisfied. The food has always been very good. Tonight,  I decided to dine in and it was a not a good dine in experience at all. I preface this all by saying the food was still good.  Had sesame shrimp and was very tasty.  BUT the service was awful. I came in and sat down and there was a table beside me that patrons had left with the table still dirty and for about 10 mins, no one came over to clean it. Left sitting there at that table was the bus tray right beside where I was sitting with a pile of dirty dishes. Finally someone came up to me asking if I had a to go order. I said no and would like a menu for dine in and she handed it to me and asked my drink order. Told her I wanted a beer but not sure which type yet. She said to take my time as I decided and I quickly learned the menu didn't even show the beers they offered. Knew it was not going to be a good experience when people in the corner were hollering multiple times for someone to come back to their table. I also noticed multilple employees who were clearly capable of tending to dine in patrons horsing around near the counter. There wasn't any sort of urgency or foucus on the customers. Finally the table beside me was cleaned and my order was taken but only after a lengthy wait. The resturant wasn't close to full and the whole experience took well over an hour. Again,  I will eat food from here again but only take out. This place clearly isn't equipped to handle dine in. Eat here but would recommend just take out."}
{"text":"Very greasy. I will continue to go to Yummy Grill on Silverado"}
{"text":"Definitely room for improvement I think.
I tried.
I don't like.
I shared a picture of the pot stickers. Let the viewers decide.
The fry udon earned a consolation two stars for originality.
So I give this one star for their food."}
{"text":"this place is disgusting!!! bad food bad customer service, expect to find hair in your food and drinks!!!YUCK!"}
{"text":"I recommend paying cash only!!! I ordered delivery, gave my credit card number over the phone. Ironically fraudulent charges started appearing on my account soon after. Not sure if this is where my number was compromised but would rather be cautious than not. Food is great otherwise."}
{"text":"This is my new favorite Chinese place in Henderson. I moved to Las Vegas from the east coast 4 years ago, and I haven't been able to find Chinese food that I like here, and I've been to probably 5 places including ones on spring mountain. This food was really good! I had to wait an extra 15 minutes once I got there, but they gave me a free desert for my time. Overall I really like this place and will go back, it's not the cheapest, but it's worth it."}
{"text":"Hubby and I tried this place for the first time a couple weeks ago. I was in search of Bubble Tea and discovered they had it. The food was amazing and the Thai Tea (with boba...hubby got a smoothie with boba) was what put this place up and over the top for us. We went back again this afternoon for lunch and was pleasantly surprised with 2 free egg rolls. We have found our new favorite Chinese restaurant!!!"}
{"text":"I have never written a review but I felt it necessary to write a review for the actions of this establishment that is in my community.  I placed an order for Singapore noodles and asked for them to be delivered to my home which is less than a mile from my home.  After I placed the order I was called back and told that I needed to tip the driver and that they also charge me a delivery charge.  I felt that to be unnecessary, he didn't need to tell me to tip him. After I spoke with them I told them to cancel my order and the gentlemen hung up in my face. I called back and asked him to make sure he cancels the order and he hung up in my face again. Anthem I hope that we would not allow this type of disrespect in our community when it come to patronizes businesses.  It was very rude and disrespectful as if he knew that you are just one customer, so what if I  loose your business. I will update Yelp letting you know if he canceled my order and returned my monies back to my account. I hope someone finds this helpful.  If I could not rate them at all I wouldn't. I prefer to travel to a location that will treat me with decency and honors me patronizing them."}
{"text":"For the money, this the is the best, most consistently enjoyable Chinese restaurant that I've ever experienced. It's not high-end by any means, but is a great value. I've eaten here on average once per month for the past year and have never been disappointed. I always do take-out and the food is fresh and hot whenever I pick it up."}
{"text":"We've tried so many Chinese restaurants and this is hands down one of the best!  The way these dishes are prepared feel light and not so heavy with grease like so many locations.  The pot stickers are a favorite of ours because they are wrapped in a thicker more delicious dough with an amazing filling.  There are so many healthy choice meals with tofu and sea food and vegetarian options for those eating healthy but still wanting an amazing meal.  We have 4 kids and it is so rare that we find a restaurant we all love--and THIS is one of them.  They are a touch expensive so we dont go very often but it is totally worth the splurge.  My middle daughter regularly requests this restaurant for her birthday and special occasions.  The staff is courteous and very attentive, which isnt easy when 4 kids are dining at the table and they seem to need something every few minutes."}
{"text":"We ordered two items last night.  Shrimp chow fun and crispy beef.  Not good.  Crispy beef is greasy and I've had much better chow fun.  Will not be a repeat customer."}
{"text":"We order consistently from this place. Being from NY it is the closest to great Chinese food. Delivery is super fast and the food is great. Prices are very reasonable for the amount of food."}
{"text":"I've been coming to this restaurant for a about a year and decided it was time for a review! I absolutely love this place because it's the best bang for your buck. Ordering 2 combos gives several servings for my family of 3, plus anything you order is ready in MINUTES! I've never waited longer than 7 minutes for my food and it's always extremely fresh! We love the veggies in the Kung Pao chicken and their Hot and Sour soup!"}
{"text":"Excellent.....really fresh food. The service was amazing, not to be outdone by the food. Egg rolls and fried wonton - to die for!"}
{"text":"For the quality, the price and the service, they don't disappoint. I come here at least twice a month, I would eat here more often but it's a bit far from where I live.

The portions are big, the food is made to order, and very quick. I love their vegetable chaw mein and tereyaki chicken. If you haven't given this place a shot, you must. Oh and by the way, the food is made by real Chinese!"}
{"text":"The only Chinese restaurant on this side of Anthem. Not bad when you want your Chinese food fix. Service is good and the prices aren't bad. The restaurant environment is pretty nice. I've been to a lot of Chinese restaurants in the Vegas area and unfortunately there's not much to this place that makes it stand out in comparison to other Chinese cuisines out here. The food quality and portions are very similar to China-A-GoGo."}
{"text":"Excellent Chinese food and fast delivery and service!  I have had the sweet and sour chicken, kung pao chicken, hot spicy garlic chicken, and mongolian beef.  All were done very well and the cuts of meat are very lien.  I have special ordered my food without onions without any issue.  The crab rangoons are a must!"}
{"text":"Good flavor, fast delivery, everything is HOT when it gets here!  Order all the time and have never had a bad experience.  My favorite is the Wonton Soup and House Chow Fun, but don't forget the Crab Rangoon!"}
{"text":"I heard about this place through my coworker. So, I gave it a shot. I am very pleased. I place my order for delivery through Yelp, which was 2 lunch  teriyaki bowls. One was chicken the other beef w/ a side of Chownein. Price was reasonable for the amount of food we received. After I confirmed my order it stated it take from 45-60 mins. Delivery guy appeared within 23 mins. Receiving my food before expecting time is really good. ((Well for me )) my food was hot, fresh, and the vegetables weren't under or over cooked. Just the way I love them. I will most definitely be going back"}
{"text":"Cheap little hole in the wall spot! The quality of food is good for the price, but very shitty service. They don't speak English either so make sure you repeat your order otherwise they'll f*ck it up like they did with mine."}
{"text":"This is my go-to chinese take-out. So good! Orange tofu and Kung pao chicken are my favorites. Crab Rangoon side is a must. Always super fresh! Great lunch time specials and big portions. Friendly staff and cozy sitting area."}
{"text":"China Tango is definitely my go to spot for my Chinese food fix. The food is hot and fresh and I practically never have to wait if I order ahead of time. Their spicy level is just right for me. Just enough heat, but not too much where you can't taste the rest of your food. I order the crab Rangoon, General Tso chicken ( in spicy), eggplant tofu stir fry, salt and pepper chicken ( in spicy ). It comes with a side of white rice, so there is plenty of food for 2 and for seconds as well! Highly recommend."}
{"text":"First timers sampling the delicacies here...decided to do the take out dinner so we ordered mongolian beef, orange chicken, honey walnut shrimp, house fried rice and wonton soup online. Initially I had opted for delivery but since we lived beyond their 5 mile radius, I had to pick the order up. The food was ready when I arrived. I quickly surveyed the small restaurant and it did look very clean. We all thought that what we ordered tasted ok...not over the top. I'm a big fan of honey walnut shrimp but the way they prepared their version was different than what I'm used to. Most places I've been to have used a mayo glaze but at China Tango they use a mustard like glaze? The wonton soup was tasty.  Should I return, I'll dine at the restaurant and I'd like to give their chow fun or chow mein a try."}
{"text":"Worth the drive if you're in that part of Henderson rather than the other Chinese places.  Good atmosphere, very friendly staff, delivery, food isn't greasy and has a lot of flavor, and the prices are cheap for a big plate.  Lunch takeout is especially good."}
{"text":"Beef in Hunan Sauce and Mushu Chicken were our choices this evening, and as usual,  the food at this China Tango was delicious. Service was prompt and friendly.  Staff members checked back often to see if we were satisfied and if we needed anything. This is becoming our go-to restaurant locally, and we're always pleased.  As usual,  we had plenty to box up for another meal.
We give this restaurant high recommendation. It isn't fancy. Its reliability can be attested to by the large number of take-out orders that were sold while we were there."}
{"text":"We've been searching for good Chinese food takeout for a while and glad we decided to try this place. I'm not sure how they make their lo mein (chow mein?) so garlicky, YUM! The chow fun was also great. Speedy delivery for those days you don't want to leave your house and would like something other than pizza. They are just as fast when you are picking up your own food, but never dined in though. Give it a try."}
{"text":"Kung pap chicken was pretty good. Love the fresh garlic but it could definitely use more spice! It's low sodium so it explains the light seasoning but it's still not bland. The seating area is surprisingly nice as well. I'll definitely try this place again!"}
{"text":"What I love about China Tango is how fast, fresh & delicious the food is. 

We've had delivery on small or large orders & we always receive it right away. So basically your turn around time for delivery is not a long wait at all. 

Dining inside was actually pretty nice for a take out place. It's clean, they're just as friendly in person as they are on the phone & they always come by to make sure you have all you need including refilling your drinks.. I know of several restaurants that are bigger & your server disappears. 

Food is made to order, flavorful & nice portions! I recommend this place if you want to go out for a low key evening or if you need a night off of cooking, order family size items. Prices aren't bad at all either."}
{"text":"GROSSSSSSSS!!!!!!! I got the orange chicken. It was a ball of way to sweet bread fluff with a tiny piece of chicken in the middle. Kind of expensive for how bad the food was too. It is fast food so at least be cheap and bad geez!! never again."}
{"text":"If you ever want to actually get your food Do NOT ORDER from this restaurant EVER!!!  our order was promised in 50 minutes.  after an hour and ten minutes we called and got a bunch of excuses as to how busy they were but the driver was right around the corner. We only live 10 minutes ROM the restaurant. At an hour and a half we called back and were told the driver left 30 minutes ago with our order. 15 minutes later I got a call asking if we still wanted our food. I told them to cancel the order because not be liken have been ice cold. I was told that we lived too far and to never call them again. We had been ordering food and patronizing this restaurant since the day it opened. With service like this they do not deserve any business from anyone. The food is only passable and has changed for the worse. So stop ordering from them and find an alternative. Maybe they all o somewhere else to be horrendously rude to people who supported them.  For me I am done with these rude and overpriced garbage vendors."}
{"text":"Notice this is a chain.  And the same food is served in Summerlin too. So why does the Summerlin location have 3 stars and Henderson has 4?  Maybe because the reviews here in Henderson were all by 12 year olds?  The food is lousy at best.  The sauces are Soooo full of food color that it matches the Yelp menu above!  For example the Combo Platter (egg rolls, butterfly shrimp, crab ran goons, paper wrapped chicken & BBQ pork.) The BBQ pork was Seriously hard as jerky and also red as the yelp banner.  The crab ran goons we all tried to find the crab in - nothing but breading.  As was the Sweet and Sour Chicken - it was AS IF we ordered it with breading, 'But PLEASE add extra breading.' The Hot & Sour Soup was so obviously from a can none of the four of us could do more than a few bites.  Our recommendation: Unless you're 12 years old, DON'T"}
{"text":"food was good, the best i have tasted so far in Las Vegas so far, noodle portion size was a bit small for the price though, but would eat there again."}
{"text":"So good.....every time we order delivery from here the food comes in less time than quoted. Driver always has a smile at our door. Doesn't matter what we order, it's always right. Hot fresh and perfect. This is not the best chinese food ever but it's the best weve  found in henderson so far.. No problems here, just solid food and service...."}
{"text":"Ordered takeout for a large group of people. We got way too much food because they give you tons of food with your order! We had to figure out what everything was because they didn't label any boxes. The orange chicken, lemon chicken and sweet in sour all look the same. I'd suggest asking for the sauce to come on the sides. We ordered an extra fried rice with everything not realizing everything came with white rice (Rice over load!!) we also got teriyaki chicken, very good, veggie low mien, everything tasted pretty good. The food came fast, however I was up all night that night throwing up and had diarrhea. Coincidence? Could be, don't know."}
{"text":"This joint was jumping....Saturday nite 6:30. Almost all the seats full. We opted for to go and our food came up in less than 10 minutes! The staff is fabulous- moving in sync and pleasant even tho they were slammed. Food  was very tasty and is all gone! All they need is online ordering and I would give a 5 star rating!"}
{"text":"Success by default ...location. 

Not much around this area. But your better off saving 40 $ and eating toast at home. 

We ordered two soups chicken chow main with noodles and Salt and pepper squid. 
The food came FAST! So that is great. 
But I could not take two bites of each thing before feeling sick! 
It's horrible tasting food. Everything tasted old! 
I even tied covering it with soy sauce. 
Didn't help I felt physically ill all night. 

PLEASE DONT EAT HERE. 
This place needs to close down and something better quality reopen."}
{"text":"Decided to get food to go from here.
Placed an order on the phone and was told the food would be ready in 5-10 minutes. Reached there 10 minutes later and the order was ready. Wanted to use a coupon for free egg rolls with an order over $10 and told the guy me he would include them. They gave me 3 free egg rolls instead of 2:) Good for me, bad for my weight!!
I tried the kung pao shrimp and requested them to make it medium spicy. 
The servings of the shrimp as well  as the rice it comes with are super generous, and there was enough for 2 - 3 people.
The shrimp itself tasted great. Was the perfect blend of spice and flavor.

The restaurant had just one family dining in when I went to pick up my order at around 6 in the evening, but their phone was ringing continuously, and there were several take out orders lying ready to be picked up.

I will try this place again sometime."}
{"text":"Their lunch and dinner meals are the way to go otherwise your take out dinner ends up being $$$. Their sweet and sour soup is yummy and they have a spicy mustard upon request that will certainly get your nose running. My husband and I always order to go but they do have a great dining area and they serve alcohol.

The dinner and lunch meals come with an entree, egg roll,cream cheese wonton, soup and a drink. The meals are pretty big and could almost be split. These meals run from $10-$12 for dinner!"}
{"text":"Very fast service!! Food is acceptable, but I really love the speed they offer. Five minutes your food is done everytime!"}
{"text":"This is our go to Chinese place. We went here all the time when we lived closer. Now we're a little ways away but we still make the trip out there when we get a craving for Chinese food. I just wish they were closer. Their Kung Pao chicken is the best."}
{"text":"I literally just ordered this, and it got here in only 15 minutes. ARE YOU KIDDING? It takes me 20 minutes to decide what to watch on YouTube! And the food is hot and yes, very delicious.

China Tango, I have a fifth star, and it's for you."}
{"text":"We just moved to this area and eating take out until we can get settled and go shopping. I ordered Sweet and Sour Chicken and Kung Pao Shrimp. The service was very friendly and helpful. Got home and everything was packed very well. The Sweet and Sour was in a separate container so the chicken wouldn't get soggy. The chicken was cooked just right and the coating was smooth like tempura and really good. The Kung Pao was great. Just the right amount of heat, a good mix of veggies and the shrimp had a good snap. We got fried rice with both and it was very good. The bill came to $14.50, not bad, Pei Wei was twice as much and my wife said she liked this better.  I'm happy to know that we are within their delivery radius and I'll pass right by on my commute home, so I will be having China Tango often."}
{"text":"Nice owners and cute place, but honestly the food is terrible. Came with my 3 other friends and we ordered orange chicken, walnut chicken, and chicken with hot ginger sauce. All tasted bland and chicken tastes rubbery. Egg drop soup was thicker (mucus consistency) than usual. If you're looking for fast \"Chinese\" food in the same price range, just stick to Panda Express. I feel bad writing this because the people that work there are very sweet, but the food just really is not great."}
{"text":"I love this place! My boyfriend and I have been going here since they first opened and we have never been let down by China Tango. The flavors are great and portions are copious. I almost always have food to take home! The prices aren't bad considering how much you get and how delicious the food is! The chow mein and the tofu with eggplant entrees are the most greasy dishes in my opinion but worth eating. ;D I recently found out they have a website up (finally!) so you can place the orders online on view their menu items which made my last experience even more convenient. They're precise with any special requests we have had on our orders and overall pretty friendly. My favorite dishes are the honey walnut shrimp and Ma Po Tofu with pork. :)"}
{"text":"I'm not a super huge fan of Chinese food, usually because of textural issues, but I come here a lot because 1) it's right across the street from where I work and 2) my husband loves it.

He swears their wonton soup has magical healing properties and that's why I get it for him every time he's sick. Their Orange Chicken and Mongolian Beef are also tasty.

The staff is super friendly every time we go and I appreciate that. The only real downside is that the parking in this little shopping center sucks. Other than that, I love this place."}
{"text":"It's right off 215 on Green Valley. 
Good chinese food and not poorly priced. The rice was really good and so was the portion size. 
I ordered mongolian beef. The flavor was nice but i had way too many green peppers and veggies with almost no meat."}
{"text":"In a nutshell China Tango is Tango Nasty!!!

We live in the area and quite frankly were to lazy to drive to our normal stop, NY Chinese down the hill. This place is right down the street, so we gave it a try.
We ordered several different items from the To Go menu and sat down expecting to be there at least 20-30 min, as there were people ahead of us and a few seated that had not been served.
I kid you not, within 10 min this guy comes out with our order ready to go. I'm thinking he gave us somebody else's order, but he was gone before I could check.
No way they could have technically cooked the food that fast period, so I was seriously leery!
Got home, made a sample plate for me and my wife and started eating!! Nasty Nasty Nasty! No idea when they made the egg rolls, probably sometime last week! Have no idea what was in the Paper Wrapped Chicken, Kung Pow Combo had more salt then anything else (tongue is swollen as I write this)! I could go on, but not worth it!"}
{"text":"I was in the Green Valley area for a doctors appointment & since it took forevers & a day @ the doctors office, I was starving by the time I got out. I drove around the plaza looking for someplace to eat. Chinese food... Always drags me in & also my fav! Decided to eat here w/ my lil one & I was definitely NOT disappointed. We ate in so we were served. I had a lunch special so it was served in a plate lunch box (which I was fine w/ as usually I don't eat all my food in restaurants anyway. It would already be set to pack up & take hm if I didn't finish). Anyhow, I ordered fried rice, chow mein, sweet sour pork (which I'm so picky w/ because it's one of my fav Chinese dishes, & it also came w/ a soup. I believe it was miso soup but don't quote me on that. They also give a tray of what looked like wonton chips appetizers which you dip in sweet sour sauce. A bit too greasy but my little one loved it! =) All this for about $12 or so. I did buy a fountain drink of course. Not too bad for the amount of food we were served. Back to the sweet sour pork, absolutely delish! Not too hard & not too greasy. & most of all... Not super drenched in sweet sour sauce. I hate it when the crispy batter around the meat is soggy before I even get to eat it. This was perfect! Way better than what pandas serve anyway. Chow mein & fried rice was great as well. Tasteful. The guys working were super nice. The place was clean. No funky smells. Haha! Definitely gonna eat here again. Hopefully soon when i get the chance. This ones a keeper for me!"}
{"text":"Everything I've had so far has been absolutely great. All takeout orders are ready within 15 minutes which is great since that's the commute there."}
{"text":"Quick service and probably the best cashew chicken I've ever had! Also ordered the General Chicken; mild was more like medium for spicy but still delicious!"}
{"text":"It's ok or maybe it was the dishes I ordered. I have kept trying this place to see if maybe they were having an off day. The food is quite flat and not exciting.

It is busy and seems popular with the community but I do travel to the other Chinese restaurant and pass China a Tango to get there. In other words, I will drive further for Chinese food. 

I'm not giving a one star because the staff is fast and the environment is clean and up to date."}
{"text":"Love this place!  Customer service is great. Food is ready so quickly that I can come here during a 30 minute lunch from work and still make it back with time to spare. When they say 20-30 minutes for delivery, it always comes in 10!  It's amazing how delicious and fresh the food is compared to how quickly the food is made after you order. Their lunch special portions are enough for two people... Or one person with left overs!  Oh!  Did I mention the wonton chips and egg flour soup?  I could go there just for that!  It's served with the lunch special but it's dine-in only. The wontons are served with a delicious pineapple sweet and sour sauce. YUM!"}
{"text":"Went here a few weeks back and got some food for me and my boyfriend while we moved apartments. 
Not gonna lie this is by far the best Chinese takeout I've had since I moved to Vegas. The meat was hood the rice was perfect. Everything was ready when they said it would be. 

I would highly recommend"}
{"text":"Food: good, not great. Fresh. Basic.
Online ordering: A+. 
Delivery: also A+. Items were packed neatly. Nicely sealed, no leaks. 
Family Meal B: good value."}
{"text":"We just moved to the area, and decided to try out this place... We were so disappointed because this place is like one of 5 restaurants nearby. The restaurant was not very clean- I'm surprised it passed health inspections. We sat down and ordered a few appetizers and entrees. When the apps came out, one of them was so gross- so we sent it back. The server took it, and put it back in the kitchen where they prepare the food. A few minutes later, another server brought back the unwanted appetizer. When we told her we didn't like it, and we sent it back-she asked if we wanted it to go..... No thank you.  Once again, they took it back and just set it in the kitchen. When our entrees came out, we hardly ate them (after taking a good look at the restaurant and its cleanliness, or lack there of- it pretty much ruined our appetite. We asked for the check, and when it came out, the appetizer that we had sent back, was still on the check. That's a big no no in my opinion! Oh well, we paid the bill and decided we will not be going back. Huge disappointment!"}
{"text":"Can't argue with the huge portions, always delicious food, fast and friendly service, decent prices, nice atmosphere, and close proximity to where we live because many times i will just call and put a phone order in for pickup. My wife & I love this place!!"}
{"text":"I have been searching for good Chinese food ever since I moved in the area 6 years ago. Not sure how I missed this little gem! Everything I have tried I have loved!! 
I'm a huge fan of hot and sour soup. They add seafood to there's and now I can't have plain hot and sour ever again! : )
Love this place"}
{"text":"They are really nice In here. Delivery time is reasonable and the food is yummy. We eat here about once a month and have never received bad food or service. Even though its simple, I love their egg drop soup!"}
{"text":"First time trying this place, and it was great. Potstickers were delicious. Chicken and broccoli had a very light sauce--not too sweet or salty."}
{"text":"Just ordered food for 4 tonight. Excellent. The last time we ordered, the white rice was not up to our expectations. Tonight it was the way we like it. We had hesitated ordering from them again. We will definitely do this again. The Generals Chicken, Sweet and Sour Pork, Beef and Broccoli,  Cashew Chicken and Chicken Chow Mien were great."}
{"text":"We have ordered from here a few times now.  The food has been consistently good and the delivery service very fast.  The sweet & sour pork was really tasty.  My spouse loved the Pad Thai Spicy Noodle.  They paid attention to the notes I added to my order and were happy to change the Pad Thai to be vegetarian, no problem.  Always a great experience with China Tango, our new go-to Chinese food restaurant!"}
{"text":"The food is freshly cooked, the service is quick, especially when you call in your order. 
The staff are always friendly. The restaurant is always clean
Love this place"}
{"text":"Love this spot. They are quick, cheap, and delicious. Perfect spot for lunch because you can sit down and be out before your 30 minute lunch is up. When you sit they bring you delicious won ton strips with a sweet glaze type dip. Service is always great and I've loved everything I've ordered."}
{"text":"I had a full course meal wontons, soup, orange chicken, and a sofa all for $14.38 with delivery included. Delivery took about 15 minutes very quick and the food was good."}
{"text":"Quick service, both for eat in, take out, and delivery (we've done all 3). Food is really good, & good portions! My favorite is the general's chicken."}
{"text":"OK, i really want to like this place because it's close to work but so far, no bueno. everything is SO SWEET. so far i've tried the following:
-mongolian beef
-wonton soup
-hot and sour soup
-shrimp with snow peas
-some tofu and eggplant dish i don't recall the name of 

EVERYTHING was sweet. i understand mongolian beef being sweeter than normal. but wonton soup? are you even supposed to put sugar in that? shrimp with snow peas? the tofu/eggplant dish was so sweet i felt like corn syrup was oozing out every time i bit into the tofu. i'm probably going to return because it's so close to work. but i would really like to find something that's not so sweet."}
{"text":"There aren't many good Chinese restaurants in the area, especially for delivery. I noticed China Tango had four stars on here, so I gave it a try. I placed an online order and my food arrived 25 minutes later. It was so fast that when my doorbell rang, I was shocked and even asked \"who is it?\" because I didn't think it could be my dinner lol. The delivery guy was very nice and prepared with a pen and receipt. 

I ordered the dinner for one so I could get a little variety to try. It comes with an entree, rice or noodles, soup, and a small appetizer. I chose general tso's chicken, fried rice, and crab rangoon. (I'm not a big soup fan) the Rangoon didn't come with the usual red sauce, which was a let down. Everything else was pretty good for the price. Keep in mind, this is fast food Chinese! The fact that they delivery, aren't expensive, and food was pretty good, they get three stars. I would give it 3.5 if I could."}
{"text":"If the won ton soup is any indication this place is outstanding. It was a take out order so we will have to try it again when we have time to dine in. But it was truly great."}
{"text":"Good Chinese food, super fast delivery, friendly service. I haven't found alot of places I've been pleased with since I moved to Henderson, but I am pretty happy I found this place on Yelp. I order, almost weekly, and haven't been disappointed yet. It got a 4 really because I've had better in my travels, but order a few of their classics and you'll be pretty satisfied."}
{"text":"It was okay. Order was correct, delivery was on time -but the food was lacking flavor a little. I did appreciate the quality of ingredients and the freshness of the veggies though!"}
{"text":"This is some of the best Chinese food I've ever eaten. They have the best chow mein. I tried the spicy generals chicken today it was fantastic. Quick service for lunch and good prices. Will recommend."}
{"text":"It was excellent! I got my food delivered to me and I live decently far from the location. The time I had to wait was about 15-20 minutes, it was perfect! I will order from here whenever I am craving Chinese food, which is like all the time :)"}
{"text":"Good Service, friendly, clean, and affordable. The lunch special was perfect. We had to get a to go box. Very large portions!

Also, there are some healthy options for those looking for a lighter meal.

How did we not find this place sooner?"}
{"text":"The devil is in the details. One of the dirtiest restaurant I've ever been in. Everything from the floor, menus, windows and the restroom. If thats what the front of the house looks like, I can image what the back of the house looks like. The food was good, but I just couldn't get past the filth."}
{"text":"We go here at least once a week.  Good food service and lots of choices.  If you are gluten-free ask for no noodle chips, no breading and brown or white rice."}
{"text":"Some things very good to excellent...others notsomuch...
Had to explain to them that \"brown rice\" was not simply white rice w/ a bit of soy sauce poured over it..."}
{"text":"Good food but not great.  The shrimp Lo Mein is decent for takeout.  The sweet and sour chicken is chewy and very greasy.  The egg drop soup and egg rolls are what you would expect.  I've never actually eaten inside the restaurant but it looks very nice inside."}
{"text":"I have NEVER been disappointed with food from this restaurant. I live nearby and we don't have a lot of options for takeout, so this has become one of my favorites. They're lightning fast for delivery, and they're so polite and clean and enjoyable when I dine in. Give this place a chance and, like me, they will become one of your favorite places!"}
{"text":"Good consistent casual Chinese food at a great value. 

Located close to home, China Tango is on the corner of N Green Valley Pkwy & Pebble Rd. I've been meaning to write them a review for some time, so here it is. Whether I've dined in, gotten delivery or carry-out (I've done all three numerous times!) I haven't been disappointed with their food, service, and overall experience. It's been my go-to spot for fast, affordable Chinese food.

What I love:

- No MSG. Enough said.
- They offer brown rice. Healthy!
- Generous portions. Cause we're hungry people! Or we just love leftovers.
- Lunch specials are till 4pm. Who can always fit lunch before 2pm?
- Lots of vegetables. Crispy veggies too, not the gross wilted ones you get at other places.

They have all the traditional orders, from chow mein, sweet & sour pork, orange chicken, honey walnut shrimp, fried rice, hot & sour soup, it goes on and on. Prices range from $7.25-$9.95. Lunch is from $5.95-$6.50, which includes fried or steamed rice & chow mein & egg drop soup (dine-in only). Complete family dinners start from $24.95 & they serve Thai tea or fruit smoothies with boba.

Most importantly, they've always been timely. Food is served fast, carry-out is ready, and delivery is always punctual. 

Tasty, affordable, reliable. It's not gourmet, but it's fresh, clean Chinese for a great price! I'll be back soon :)"}
{"text":"They are very pleasant and efficient.  Ordered the wonton soup and crab ragoon.  Main course was lemon chicken.....truly disappointing.  Chicken was chicken breasts, the frozen kind with breading....cut into strips.....horrible to say the least. I considered I would give them one star....but they were efficient and speedy.....not sure if I will go again....and they are in the neighborhood."}
{"text":"I came here for lunch and got the orange chicken.  They served wonton chips with the meal, which is always appreciated.  The battered chicken pieces were tender, the sauce was not too overpowering, the portions were good and the price was right.  What else can I say?  It's good Americanized Chinese food."}
{"text":"I love Tango for the freshness of the veggies and the tenderness of the meat (due I'm sure to velveting, which most restaurants don't bother with). I even know someone who had serious trouble swallowing due to illness, and he was able to eat there. I haven't tried everything, but I  especially depend on the dishes with green beans or other veggies, including broccoli. I enjoy the mushu pork, which you roll up in pancakes. Having once or twice made those pancakes myself, I don't think these are commercially provided. My hot and sour soup was inedible, but the wonton is fine. You're better off getting roast pork from someplace on Spring Mountain. I've tried a few fried things, but now avoid anything labeled \"crispy.\" The fried rice is tasty, not greasy. I don't think cream cheese should ever be included in Chinese food. You'll soon learn what to order and what not. It's all affordable, too. A lunch special may last you for dinner that night as well, or lunch the next day."}
{"text":"My favorite take out Chinese in the neighborhood. Their food is good and they have some healthy option with low sodium and oil. Also, they can make some really spicy mongolian beef. Trust me, if you want some good spicy food to sober up. This is where you should go."}
{"text":"I love this place. 
I do the lunch specials all the time.
The food is ready in 5 minutes whether I call or order online.
Can't go wrong with the sweet and sour chicken or the general chicken.
Love how quick, cheap and delicious they are consistently!"}
{"text":"This is a great local Chinese restaurant. It satisfies our cravings for asian food without having to drive all the way to china town. We usually get the family dinner specials which is enough for my family of 5. They cook their food fast and it's usually ready within 5-10min hot and freshly cooked. They have a small place for dining in, but we usually take it to-go since we love so close."}
{"text":"I have been comming here for 2 years. Food has always been great, service friendly and fair pricing. 
They offer both pickup and delivery which is great, especially with the lack of eating options in the area."}
{"text":"For a good price, you're going to get really fantastic Chinese food at China Tango. Quick delivery, consistent taste every time, and the chicken curry (my personal favorite) is nothing short of delicious. Skip the Panda and do Asian food right this time. I love it, and I bet you will, too."}
{"text":"Went there for lunch, was very impressed. The place was clean the service was good.

I ordered the Mongolian beef lunch special which was 5.75. It came with soup, I had the hot and sour which was good. The Mongolian beef was really good, there was a decent amount of meat and it had good flavor. It paired well with the Chow mein it came with. I will be back to try different dishes."}
{"text":"I hate that I order from here sometimes because it's one of the very few restaurants that deliver to us in our area. The food is BLAH! I've tried so many different things and haven't found anything I liked. Their chow mein is bland, their sweet and sour chicken sucks, hot and sour soup is OK at best. I would make the drive down Eastern if I had time"}
{"text":"Let's keep it simple up front: I'm really not happy with the Chinese food at China Tango Bistro--it's pretty bland all around-- but the people who run it are really nice.  So, two stars. 

Now for more details:
I really wanted China Tango Bistro to be great since it's on my way home, but it's not great.  (sigh)  I can't even say it's serving good food or comfort food or tasty food.  It's just bland and I find myself pouring soy sauce or sweet and sour sauce on their dishes just to get some flavor.

Here's how much I wanted this place to be good: I went there for the Grand Opening and everything I ordered was bland.  Oh well, I thought, maybe they'll improve.  So I went back a second time and ordered off the specialty menu.  My stomach hurt that night from something that just wasn't properly prepared (even through it was still bland).  But I thought it might have just been a bad day for them, so I went back two more times.  Still little to no flavor in the variety of dishes that I tried.  

I have a tried a few items off the specialty menu but wasn't wowed.  And their classic Chinese food fare is . . . well, lacking flavor.  The pot stickers (pan-fried dumplings) taste like frozen dinner fare.  The fried wontons tasted good, but mostly because they are deep fried (everything deep fried tastes good) and dipped in a lot of sweet and sour sauce.  The General Tso's chicken was sweet and fried, but there was nothing to it beyond the sweetness and they were advertising it as a spicy dish.  And the Mongolian Beef was just blah.  

Bottom line: everything needs more seasoning, more spices, more heat, more ginger, more scallions . . . More.  More.  More.

All that said, I do want the place to stay and improve.  The folks that I've met there have always been very nice.  And when my order took a long time, they went out of their way to apologize and offered additional dishes to compensate for the delay.  I like the people, just not the food.  And I like them so much that I will proceed with blind hope and will probably stop by from time to time just to see if there's been improvement."}
{"text":"Delivery time is fast and the food is top notch. During my phone call order, I responded what soup I wanted and moved on to ordering the rest of my meal when the receptionist responded with \"oh my gosh what soup do you want.\"  This was extremely rude and will be the last time I order from here."}
{"text":"This it's the first time I've ordered from here.  I moved a few months ago and was out of the delivery range where I used to order from. I ordered my usual entree and it was very good and the portions were big.  Couldn't finish it in one sitting. I like that you can choose between an egg roll or Crab Rangoon.  I will definitely order from here again when I get a craving for Chinese food!"}
{"text":"Really good food and cheap delivery fee..perfect for those days you can't get off the couch and need your cliche chinese take out!"}
{"text":"For what I paid for was not worth it! You know I rarely eat Chinese food you never get your money's worth. The next time pour out the food completely, you will see. 

So I won't be ordering from this place ever again. This place sucks"}
{"text":"So far, this has been the best American Chinese food eatery in all of Las Vegas for our family!  They get their dishes exactly right every time - the Kung Pao chicken, the potstickers, the shrimp fried rice, the veggie chow mein and everything else we order always comes exactly as expected and packed to the brim of every container.  Their portions are extremely generous and we usually get a few meals out of every order.  The dining room is pleasant if you choose to dine in and atmosphere is eclectic and bright.  Beverage selections are basic but who cares?  The food is really solid - totally a place to go when you're jonesing for some delicious Chinese take-out in Vegas/Henderson."}
{"text":"Excellent dining experience. ordered the asparagus chicken and the lemon chicken. they use all white meat (exceptfor kung pao). meals come with fried rice and hot and sour soup (or egg drop) and crunchy noodle. the food was wonderful. so flavorful. perfect spot for lunch or dinner!! (or takeout)."}
{"text":"I order from here once a week.
I recommend the Egg Drop Soup and Chicken Wontons.
They are friendly and fast every time."}
{"text":"As far as fast American-Chinese food goes, this place is doing a very good job. We ordered the Hong Kong Style Chow Mein and General Chicken. Both very tasty. So, reasonably priced and tastes good. Plus, you can order online at their web site apparently.

Most order for pick-up, but it's an okay place to eat at."}
{"text":"Best food from any of the China Tango locations thus far! I have placed orders before to other Chinese restaurants before, but this this time was surprisingly and happily much different   
Ordered from yelp Eat24 and service was was good and on time  
Called the restaurant to confirm order as I often do and was greeted by a very nice person on the other end who truly seemed to appreciate my order which was a welcome change from other call in orders for delivery  
I had asked as I often do for extra hot oil and other sauces and was so pleased to receive for the first time a nice selection and quantity of sauces including my favorite, hot oil. Also the sweet and sour sauce was one of the best I've ever had thus far. Quality and also taste of food was a fantastic! 
Please give this Restaurant a try. Even though I live quite far away and much closer to other restaurants I will definitely be willing to travel a longee distance to this restaurant in hopes of indulging my occasional craving for a quick, tasty and satisfying meal."}
{"text":"Excellent food. Three of us ordered different dinners and we all enjoyed it. It is one of the best Chinese restaurants that I have been to. Service was great and food was fresh. Highly recommend!"}
{"text":"This is our go to Chinese restaurant - the good is SO good, the ppl are always so friendly - delivery is very fast, the restaurant itself is very clean."}
{"text":"Great tasting food, good prices, and staff is always very friendly. I've never had a bad experience with this establishment."}
{"text":"I got the shrimp lunch special with a Boba tea. The food was very good and they fill it up. Service was awesome very nice and they care. Other restaurants can learn a lot from this place. Nice lunch spot good price."}
{"text":"Don't do it is all I can say, the high ratings are from people who have no clue about good Chinese food. Someone said Panda is better and they are right. My husband got curry chicken that was mushy and I got the pork with string beans and black beans and it was very salty. Service is good but the food is not good. Will not go back."}
{"text":"Food was excellent. Delivery was on time. Food was not greasy at all. Flavor was good except pad Thai was not spicy as we expected. Black pepper chicken was the best. I only gave it a four star because it was hard to communicate with the lady taking our order. So make sure you are clear of what you want to avoid confusion. Overall excellent food. Highly recommend it and will be ordering again."}
{"text":"I ordered Mongolia beef for to go and when I open the box I noticed that they used molded beef and you can see the mold on the beef were very clear!!! OMG~ that's disgusting!!!!"}
{"text":"I'm giving two stars because my wife seems to like their fried rice. I had the teriyaki chicken. I have never seen teriyaki chicken prepared this way. I got home and realized that it is nothing more than boiled chicken with sauce on the side. The chicken never touched a pan. The sauce itself was pretty tasteless. Almost like the bottled stuff you get at the grocery store. Not going back."}
{"text":"After discovering China Tango on Yelp! last month, this is my go-to Chinese food spot (thanks for the suggestions!).

Everything tastes super fresh and they don't use MSG, which is immediately obvious because you don't feel like crap while/after eating. They give you HUGE servings, so I recommend sharing an entree if you're not looking to take anything home. 

My first visit, I ordered crab rangoon, pot stickers, wonton soup, sesame chicken, and house chow main. All of the meat is juicy and tender! We had leftovers for days and only paid about 40 bucks for all of that! Everything was delicious. 

My second visit, I placed a takeout order and it was ready on time! I ordered pot stickers, hot & sour soup, house chow fun, salt & pepper shrimp, sweet & sour chicken,  and taro boba. Nothing was soggy and everything tasted great! 

My only complaint would be that they don't use larger shrimp for the salt & pepper shrimp- they use the salad size and it's $11."}
{"text":"China Tango is one of the better Chinese joints I've been to in recent years.  You'll probably have to go to China Town for better Chinese fare.

FOOD:  4/5.  

-The sweet and sour pork was delicious.  The only thing bad about it was the excessive amount of breading.  
-If I had one last meal, their crab rangoon would be my appetizer.  It's basically a deep fried wonton with imitation crab and cream cheese inside.  It was delicious.  
-Perhaps the best thing about China Tango IMO is their sweet and sour sauce.  It's mildly sweet and mildly sour, and was balanced out perfectly.  At other Chinese restaurants I tend to ask for an extra side of hot mustard to balance out their sweet and sour sauce.

SERVICE:  4/5.

-I asked the dude that worked at the counter how long it would take.  He estimated 6-7 minutes.  I think it took around 10 minutes.  Overall they were friendly.

AMBIENCE: 3/5.

-Imagine clean fast food joint.  That's pretty much it.  There is outdoor seating, not for any one particular restaurant.


Whenever I'm in the mood for Chinese food, I'll be coming back."}
{"text":"This place has become one of our family favorites! With excellent food and fast service this is definitely a go-to for that last minute healthy meal!"}
{"text":"I am pleased to leave this review, as I place what is likely my last order here before I move in a few weeks :( 
This place has been my go-to local Chinese spot for the two and a half years I've lived here in Henderson. I usually only give a spot a couple of chances to \"mess up\" before they go on my blacklist, haha, so the fact that I have been eating here for two and a half years says a lot. Good food, great staff (especially the woman who is usually working the register), and $0 minimum purchase for delivery! What more can you ask for?"}
{"text":"I have ordered from this location multiple times the lunch and dinner meals. I really like their combo chow fun.  This time I ordered the house phad thai.  The phad thai is good but I've had better. When I have ordered the shrimp phad thai in the past I have noticed that  they give you very few shrimp so I don't even order it anymore.  They offer pick up or delivery. The restaurant itself is clean and has a nice comfortable sitting down area if you choose to  eat there."}
{"text":"First time here was a great experience! The girl at the cash register was sweet and patient. I ordered crab rangoons and BBQ pork fried rice to go. I love how large their menu is!! My order was ready right away. The fried rice was seriously delicious!! Great flavor and quality! The crab rangoons were some of the best I've ever had! The flavor and texture was so delicious!!! They were spot on, the crab was super delicious and I loved how the top edges were crispy and then the bottom was soft and decadent. I was very impressed with the appetizer!
They had plenty of seating in the restaurant and it looked cleaner than most Chinese restaurants I've been to.
I'll definitely be back to try more of their items! So glad I found a new Chinese spot!!"}
{"text":"My main criteria for Chinese take out are:   Good variety of dishes, freshness, and a robustness of flavor.  The dishes I have had are quite good, with a nice balance of heat to top it off.  Recommend the curry beef, hot and sour soup, and sesame chicken."}
{"text":"Ever since I moved out here I've been craving Thai food so bad! Of course no one could be like Thai BBQ but my mom and I needed our fix so bad! Last week we took out all the takeout menus and sat down and decided who we would order from and we picked China Tango!

I loved my whole meal except one dish! Really those are good odds LOL!
We ordered delivery and food came so fast and was still piping hot! Hot as in we didn't even need to microwave it at ALL! 

-Pad Thai
I was very disappointed by this dish, first off, the noodles were much thicker and they were bright orange! No peanuts or bean sprouts :/ The taste was just OK it wasn't that true pad thai I've had before :/

-Crab Rangoons
DELICIOUS! I've never had such a good amount of filling in my rangoons! Most places really skimp on the filing! They tasted so fresh and didn't feel like they were frozen!

-Potsticker
Not as good as the rangoons but still tasty!

-Steamed Vegetables
This was the winner! I really enjoyed the vegetables, they were tasty! Everything I ate didn't taste frozen or if it was sitting out! My mom and I could have ordered 2 of those!

-Chicken Fried Rice
This was just as good, just needed a bit of soy sauce!

Total: $39.00 (including delivery fee) Our food was solid, didn't taste like your typical greasy Chinese food! LOL

This is definitely going to be in our rotation of take out and would try other items!

^___^"}
{"text":"Sit down or on the fly China Tango quickly became my go-to Chinese restaurant in the Green Valley area. 

Absolutely love their chow mein and sweet & sour chicken. Pro tip regarding sweet & sour chicken....most places give you the sauce on the side and refuse to mix it in the wok. I hate that. China Tango is more than happy to mix it in the wok so you're not left dipping when you get home. 

They give you so much food it's ridiculous. A 2 item combo is enough for two people plus left overs. Most Chinese restaurants (other than Panda) have a lunch menu then cut off all the combos for dinner time. Not China Tango. Their meal-deal is available all the time. Entree, side item (fried/white rice or chow mein), cup of soup, egg roll and crab rangoon. 

Another cool thing, when you order to go they give you your food in a box if it's a large order. Keeps it from sloshing all over the place on the drive home and is a really nice touch to keep things steady. Appreciate the extra effort that they give. 

Far and away my favorite Chinese restaurant in the area."}
{"text":"Ordered again and as usual the food was excellent delivered hot and we had enough for another day."}
{"text":"When you are faced with a sea of chain restaurants (Subway, Pizza Hut, et. ugly.), sometimes you will just try the first thing that looks like it is a bit different.  And so we ate at China Tango, a new restaurant that ensconced itself in a brand new shopping center.  The decor is very modern.  Unlike most local Chinese takeout restaurants, this one has real leather chairs, real china plates, and good glassware.  The menu was rather ordinary, but the lunches were reasonable ($5.95) and came with soup.  I started with the Pot Stickers; crispy and hot, but obviously machine made.  My husband had the Shrimp Chop Suey, plenty of vegetables and plenty of shrimp; a nice sauce.  I had the House Special Chicken (marked hot) without the bell peppers.  They had no problem accommodating my request.  I am so used to that little red pepper symbol to be a suggestion, but this dish was HOT.  Not exactly too hot to eat, but definitively hot.  I'm glad I had a lot of steamed rice with it and that they were so quick to refill my glass of Coke.

This is exactly the kind of restaurant that makes me want YELP to have half stars.  It's better than most standard Chinese restaurants in their attention to detail, but there is nothing on the menu new or different enough to make this a regular restaurant in our repertory.  If you are in the neighborhood, you could do a lot worse."}
{"text":"Great prices for lunch and the food is delicious!
For my wife and I to eat it's under 20 bucks.
I get the sweet bad sour chicken and it's great.
Wife gets Szechuan Vegetables and she loves it."}
{"text":"The food is good, and the price is even better! When you order delivery they are quick, and my order is always accurate."}
{"text":"Nothing stood out as spectacular. It was convinient, filling, and pretty ok for chinese takeout. If we are in the area and need a fix we would go back, but not go out of our wat for it."}
{"text":"Disclaimer: I'm vegan so I did not try any dishes with meat.
So far, I like this place. Some vegetable teriyaki bowls as well as eggplant and tofu. Surprisingly good. I wasn't really a fan of the eggrolls however."}
{"text":"Food was good. Portions nice size. Super fast delivery. So fast in fact I ordered on-line specifying 6:30, that was 35 minutes and the right time for my commute+, the driver called me at 6:15 wanting me to open my door!! 20 min! Crazy! Ha!"}
{"text":"I am not a huge fan of chinese food, however, when I am craving Chinese, this is the place I like to go. Very good food, service could use a bit of help."}
{"text":"My wife and i order from here constantly. Great food and great customer service."}
{"text":"Since I've moved to Vegas I've been looking for a cheap but delicious semi-American Chinese restaurant. After four years I'm happy to say this is the joint to go to. My only advice is to A) ensure you call the right location if you're doing a pick up order *I've mixed up locations before* and B) ensure you look/read the menu. There are some noodle dishes that are for example crunchy with a gravy veggie/meat topping that you would miss if you weren't reading the description (I did that but was still super happy with my mistake. It's a dim sum dish that I order at my dim sum joint anyways ;) ). Anywhoodles, delicious food for a wicked cheap price."}
{"text":"Terrible. No flavor. All veggies almost no meat. I'd rather go to Walmart and cook my own"}
{"text":"I always eat here with my boyfriend because the service is great, the food is so yummy, and the lunch special is well priced. 

If you're used to eating Panda Express, this place is not for you, because it's Chinese food made my actual Chinese people. The chow mein noodles are so good compared to the nasty dry chow mein at other restaurants. I also love the sweet and sour pork! Order the sauce on the side though, because it might be a bit too much haha. 

All in all, a great place (:"}
{"text":"We always have great service whether we dine in or order pick up. The ladies up front are always so sweet. I recommend the honey walnut shrimp with fried rice, super yummy!"}
{"text":"Our go to place for freshly made,flavorful Chinese food in Anthem.Fast friendly service and great choices too.Lots of leftovers  that are great the next day too.Love the Hunan beef and the hot garlic chicken.They also do takeout."}
{"text":"This place was pretty good!! Very clean, friendly and fast. The prices are good too for what you get. My only complaint is the fact that they gave us Styrofoam cups, but its no biggy. the food was pretty good, not greasy and flavorful."}
{"text":"Location is easy to find from the GPS. Parking is free and clean. Restaurant was welcoming and nice and clean. Good for friends and family. To stay or order to go. Home made drinks. Prices was really good and food portions was very nice and hot. 
 The food was good alot of flavor and not over doing it with sauce."}
{"text":"Wow ! Loved it ! I had chicken lettuce wraps. Very tasty. Great neighborhood restaurant. The service was excellent & food was hot. They brought out almond cookies with orange wedges after they cleared the plates. Will definitely return."}
{"text":"Pretty Good, food delivery was fast. Not the most amazing food I've ever had but it satisfies what you're looking for. The eggplant with to-fu was good."}
{"text":"Yummy Pad Thai with shrimp! I enjoyed the hot and sour soup too. I will come back. :)"}
{"text":"Very delicious !!! 

Tried the Mongolian beef with fried rice and it was absolutely amazing. Swapped green onions instead of the bell peppers and it tasted very very good. Probably my favorite Chinese dish to order. The meat here is very yummy and has a good consistency, their fried rice was amazing. We also tried their veggie egg rolls and when you sit and eat they give you their wonton chips which are quite yummy. Portions are huge, we often share a plate when we come. The food comes out very fast btw, 5-10 mins max usually. 

Service is very friendly. I Highly recommend this place, especially over like Panda Express. Much more authentic and delicious. Food always tends to taste a lot better when it's freshly made."}
{"text":"I know this sounds crazy, but I've only been eating Chinese food for a few months and I absolutely love it now. With that said I absolutely love this place, portions are big, service is very fast and professional, the only bad thing I will say it is it seems a little pricey, but not out of control. Love the broccoli chicken!"}
{"text":"The orange chicken is 5 Star, the rest of the dishes are 3. The service and delivery are always solid, when I want easy delivery it's always a solid option, it won't change lives but the orange chicken is the standout dish here"}
{"text":"When I think of Chinese take out, this is what I'm looking for. Very fresh and not greasy at all. I ordered the BBQ beef appetizer, wonton soup, and kung pow chicken. The vegetables were much fresher then most places I've visited. Excellent all around. The only thing I would suggest is if you like spicy  , order hotter then the mild on the Kung pow chicken."}
{"text":"I've salsa'd, flapped the funky chicken, but never done the China Tango.

This is a typical fast food Chinese place, over salted meals and quick service, but  sometimes you just gotta succumb to the call of MSG. I actually thought this place was pretty good, although not something I would eat everyday. 

I sat and was immediately greeted with water and fried wonton shells and a sweetened dipping sauce. These were a nice little touch for a dine-in fast food place, especially since I was starving! I ordered the Crab Rangoon, which is a fried wonton with cream cheese and crab meat inside. These pretty much tasted like fried cream cheese and there was barely any crab meat inside. The little crab meat I did find I'm pretty sure was from a can. Not my favorite.

After I snacked on Crab Rangoon the main course arrived. Ma Po Tofu with Pork and I swapped out the rice for Chow Mein noodles. This dish was huge!  It had mounds of noodles and a full plate of spicy tofu and pork. This was a lot better than I thought it might be especially after the \"Crab Rangooning\" that happened moments earlier. The tofu was cooked prefect and melted in my mouth, pork was very flavorful, but I wish it was cut into bigger chunks instead of minced pieces. Still very good and very spicy! 

The Chow Mein substitute was a good call. These were a perfect compliment to the spicy tofu/pork plate. They were soft and seasoned perfectly, I could have eaten a plate of these noodles by themselves.  China Tango is great spot for a quick bite, but I wouldn't frequent it unless I wanted to go into a sodium induced coma."}
{"text":"This place consistently puts out good quality, great tasting Chinese fast food.  It's always fresh, hot and in big portions.  I've been a fan for quite a while and haven't had a bad experience yet.  Highly recommended."}
{"text":"Food was pretty good, but even though I ate at the restaurant, everything is served in Styrofoam to go boxes."}
{"text":"Great, consistent Chinese take-out in Green Valley. Quick delivery, I have never had a delivery problem. Food is tasty. Food is reasonable in price."}
{"text":"Tonight we ordered take out from here, 1st time too. Just moved to this neighborhood so I kept passing by it everyday. Our food arrived in less than 20 minutes and it was delicious!  My very picky step son approved of the Orange Chicken, so that's always a plus! Also the portions were pretty big. I ordered the House Fried Rice, and I loved it! We will definitely order from here again!"}
{"text":"Today was my first time ordering from this restaurant. Quick delivery means QUICK delivery! Placed my order at 3:00 pm and the delivery person was at my front door at 3:14 pm with my piping hot order. I ordered lemon chicken w/rice and 2 vegetable spring rolls. The food was very good & enough for two people, although this order was just for myself. Recommend highly."}
{"text":"I only order from here. 
Delivery- A+
Speed- A+
Service- A+
Food- A
Price- A+++

I cannot speak for items other than the orange chicken, all the sides/appetizers, and the soups. So if you're a person that likes honey walnut shrimp, I can't say I would ever have it and if it's good or not.

I'm super picky on my Chinese because I often get super sick when I have it, I never have that problem here.

This is an EXTREMELY good lunch spot or typical chinese food takeout. If you're looking for a fancy place that you can instagram this isn't it, I think the $15 bill for 2 people is a good indicator that this isn't that type of place."}
{"text":"Wow! My first time delivery order was fantastic. Flavorful, warm and very nicely seasoned. 
I will most certainly order again and again
Prompt and courteous sevice.
Thank you!"}
{"text":"Delivery time is always less than what they say, food is always very fresh, and they're very friendly! Price is great for quality of food!"}
{"text":"I went ahead and tried them once again. This time I ordered sweet and sour chicken with fried rice. It was really good! Not too greasy, and it was crispy. The eggs in the fried rice were actually \"tastable\" if that's a word. Lol! I'd order it again for sure. Only thing I'd change is the attitude of the delivery employees. They don't seem to happy or friendly. Kind of standoffish actually. Nonetheless, the foods pretty good and came at a good time."}
{"text":"I had recently moved here and was told to come here and try their pad Thai... so I did and it was so good! So I had kept coming at least once a week and I noticed that every time I went, it just got worse. They started messing up my order, I specifically asked them not to include bean sprouts and onions and yet i kept getting both in it. Then I started ordering the shrimp pad Thai, it was delicious at first then I started noticing the shrimp was half cooked and the rest was completely raw & clear.  That night I had felt very sick to my stomach and I didn't think anything of it at first but I did notice that every night after I had gotten the shrimp pad Thai I really did not feel well. I just suggest being careful around their seafood and meat, their noodles were great and I love the little spice the noodle sauce has."}
{"text":"My favorite Chinese restaurant! The delivery is always super fast and the serving sizes are so big, they allow for lunch and sometimes dinner the next day."}
{"text":"This place was great! There was a 1.5 hour wait at PF Changs and we were craving Chinese food. They were very accomodating and the food was very fresh."}
{"text":"We were a little leary because of some of the reviews but we were pleasantly surprised and happy with our to-go order. It was prepared quickly even though they were a little busy. Generous portions, all very tasty. We will be back!"}
{"text":"My go to Chinese food spot!! They have an awesome inexpensive lunch and dinner individual menu that comes with soup, fried rice, and your choice of egg roll or crab ragoons. Very friendly staff and you will definitely get your money's worth because they really pack up your order with big portions!! You will not be disappointed!!!"}
{"text":"It was okay, i was craving some Chinese food bit probably the only thing i liked was the chow mein bit the orange chicken taste so fatty i was not satisfied. I definitely would not go back but the lady was really nice."}
{"text":"The wonton soup here is pretty good and has both chicken and pork in it with a distinct flavor of what I believe was  ginger but it's not overbearing. And by the way the pork in the soup was excellent and I look forward to trying some of their pork entrees. But today I had beef with broccoli and it was excellent. My husband had New York style chicken chow mein and he said it was delicious. Good fried rice. Very very fast take out order. Will be returning to try more on the menu."}
{"text":"Ordered delivery the shrimp in black bean sauce  was more onions and green pepper and the shrimp in lobster sauce was more lobster soup I will never order from them again"}
{"text":"It's really tasty!!! The food came super fast! My kids liked all the dishes. We had mandarin chix salad, chow mein, curry, walnut shrimp, snow peas and chix, and beef broccoli. The employees are nice. For people that have left neg reviews.... If you go to eat Chinese, don't order teriyaki chix. Seriously!! We ordered Chinese food and it was all good. The food had a lot flavor so unless you're a smoker it should be tasty!!!"}
{"text":"This place was great as far as fast Chinese food goes, it was inexpensive, tasted good, great portion,  and fast the little china man literally ran from his car to my office which shaved like 3 more seconds off the delivery time. The order was all correct and the food was hot. The only thing I did not like was the hot mustard was watery, not sure if thats standard for them or if  they were near the bottom of the last bucket and delivery day was a couple days away. Overall I am satisfied and I will order from here rather than China A Go Go."}
{"text":"Worst chinese food I ever had .
The food is so greasy or dry ! 
Mongolian beef was swimming on oil like sause with drenched vermiceli  on the bottom. 
Chicken friend rice was so hard and dry that we didn't even eat  it while very hungry. 
How can you crew up friend rice ??? Unless it was made 3 days ago! 
Hot and sour soup  was so sour ,no joke ! And I ordered it in so many other places but this one is just not edible ! 
Do your stomach a favor don't make it suffer !"}
{"text":"I order delivery from this place all the time. They never take more than 30 to 45 minutes. I haven't tried too many things but the orange chicken, mongolian beef, and general chicken are great."}
{"text":"This place is less than a mile from my house, the portions are big, and the delivery guy liked my cat. How don't they deserve 5 stars..?"}
{"text":"A really good meal for the price. We are staying at GVR and opted to not do another buffet. It was set up as a to go place, so dinner was in styrofoam but it could have not bee filled fuller and it was flavorly delicious! They started with egg drop soup, piping hot, and the crunchy noodles, they offered seconds and we accepted. Super great service. I am a big water drinker, so I asked for 4 cups. They kept watch and came to refill the cups 4 times, better than most high end places. We totally enjoyed the Mongolian Beef and Spicy Garlic Pork. Delicious!"}
{"text":"Based on the other reviews, I wanted to give this place a try. 
I tried the Kung Pao Combo with brown rice. It was really good. 
I'll definitely be back."}
{"text":"Quality over quantity is the important thing when it comes to food.  This place has both!    I ordered a plate of sesame chicken to share and it was big enough for 3 people! A real authentic chinese restaurant is hard to come by these days.  I usually try to look for hole in the wall places but this place is just that but in a great location."}
{"text":"I've been wanting to try this place for awhile now and finally got around to it today. The service here is very fast. I went around 2PM so the lunch special was still going on. I ordered the Orange Chicken and i choose both sides of chow mien and fried rice. It also came with egg drop soup. Nothing really special about any of the food. I probably won't eat there again."}
{"text":"Poor service. Multiple times they have gotten our take out delivery wrong and then give us an attitude like we messed it up. Every time it happend not once did we get a sorry, can we bring it to you or can we offer you some eggrolls for your inconvenience."}
{"text":"Everything was good, just a little salty. Not sure if they use msg, forgot to ask. We got chow mein & rice."}
{"text":"Hong Kong Pan Fried Noodles FTW! Everything has seemed to be mediocre when I've ordered. But I consistently get the HKPFN! 

Update: 

After the last review I had one bad meal. Maybe not bad but as stated,
Very mediocre. I've never eaten there but have picked up or gotten delivery a dozen times. Every time I do a pick up they tell me 5 min! And it's always ready when I get there. Delivery is always very prompt also. Makes it even easier doing it through yelps eat24 app since they have all the menu items on it, plus you can use Apple Pay."}
{"text":"For Anthem Highlands, this place is a nice keeper! They've got your traditional Chinese fare and plenty of other healthy options!

Good for families and friends!"}
{"text":"China Tango will substitute BROWN RICE with any order if you ask for it for $1 more. The food here is always tasty and fresh. The service is very fast, and the people who work here are extremely polite. There are 18 lunch specials for under seven dollars each, lunch ends at 4:00. They really load you up at lunch. No kidding; there is usually enough for two meals with every entree ordered. A great appetizer is the vegetable spring rolls (egg rolls). And yes they do serve beer at this location. This is a great dine in, take-out or delivery place located in a nice, quiet neighborhood far from the bustle of Las Vegas."}
{"text":"Fantastic local Chinese food.  You get your meal extremely fast and the dishes are always tasty and flavorful.  I've never had a bad dish or experience at China Tango.  I personally love the sweet and sour chicken & the honey walnut shrimp.  The fried wontons are literally one of the most delicious Chinese appetizers that I've had, especially when dipped in sweet and sour.  The staff is friendly and their delivery service is lightning fast.  Go to China Tango!"}
{"text":"I love the food here. The best fried rice in Vegas. The combo fried rice is to die for."}
{"text":"I place delivery orders, they are always fast and the food is hot and delicious. I'm not big on chow main. But, I always order it because its so good and the wings are the best. They have great coupon deals- 2 free egg rolls with orders over $15.00 and others aswell. My boyfriend is from Chicago and brags about how good Chi-town Chinese food is and he's never impressed my Chinese food in Las Vegas/Henderson but it loves this place. That's a good sign to me and I've never had food from Chicago."}
{"text":"Have to say was very impressed on how fast the order arrived to the house.  by the food arriving? really quick also meant that we ate a hot meal. have to say the standard of the food was a lot better than I expected also has it was the first time we ever ordered from them. we had the family meal, we had beef broccoli and Pad Thai chicken, with the meal we got two egg rolls and crab rangoon and of course egg drop soup and last but not least pork fried rice. Me and my wife really enjoyed the meal and my son had something to said \"it was really good\". so I have to recommend this place"}
{"text":"I tried China Tango Bistro tonight for take out. I ordered online and I was happily shocked that within 15 mins it was at my door and it was extremely hot! I ordered chicken chop suey and orange chicken. I thought both were very good. I LOVED the chicken chop suey, and the orange chicken was very good too but I didn't think it was any better than Panda Express but this place delivers and that scores major brownie points, for fast food Chinese. Over all, I will order again. I would say it's good step up from Panda Express. 

China Tango is not to be rated against a nice sit down authentic Chinese restaurant. 

PS: my order came with two containers of white rice free, I normally order brown rice if offered but I didn't see the option to choose, and honestly I didn't know I'd even be getting rice so no biggie. :) 

PSS: This place is FAR FAR FAR better than the Chinese delivery (I won't name names) in the Sprouts/Target center at Green Valley & Horizon Ridge."}
{"text":"The yelp/online ordering process was error-free. Every dish we ordered was outstanding."}
{"text":"The food is good and they are fast. 
The shrimp fried rice is on point. 
Will continue to go there and pick up dinner!"}
{"text":"Their fried rice is really good. I like the lunch specials. The moo goo chicken and the vegetable lunch are my favorites."}
{"text":"Fantastic Food. Fresh and you get to see it prepared in front of you! Quick and friendly. Just moved to Henderson from Orlando Fl and we have found our Chinese food connection!"}
{"text":"Came to this place at 850pm and sign says it closes at 9:30pm. When trying to be seated we were told that they do not accept dine in anymore and only take out. Felt really uncomfortable being told that we're not able to dine in. This should not be the case since they still have 40 mins until they close. Is there any rights to customers anymore?  Or just simply can turn away loyal clients?  Will think about coming here next time."}
{"text":"This place is right down the street from my apartment and I'm always on the lookout for quick Chinese restaurants. This place has become a favorite spot for my husband and I for an affordable lunch.  They give you HUGE portions and the service is always fast (both dine-in and take-out)."}
{"text":"It was my first time visiting here and it was really great.  I had the orange chicken and it definitely hit the spot.  I'm already looking to make another visit, but I'm a sucker for Chinese food.  We dined in, the service was prompt, the food was delicious, and I felt like the prices were very reasonable (especially considering how much food you get).  Overall - Very Satisfied, I will be eating here again!"}
{"text":"The food we chose was not good.  Very greasy and the meat was very fatty.  It was on-par with or just below Panda.  Had Low-mein, fried rice and beef and broccoli.  Won't order again."}
{"text":"I was pleasantly surprised by how delicious our food was from China Tango. Every order was hot and exactly as ordered. We called the order in and the wait time was very short, only about 10 minutes - the food was ready for me by the time I got there. I will definitely come back when in the area again. A very good value for the amount of food that you get! Delicious Chinese food!!"}
{"text":"Dinner on 2/20/17.  After our order the food came within minutes.  Had sweet and sour chicken and it was cold.  Appears the chicken was frozen and all the do is heat it in the sauce. We also had Mongolian beef.  It was all smothered with onions and bell peppers.  The dish may have had 10 very thinly sliced beef. In it.  Will not be back.

They charged $1.95 for a tea bag.  First time I have ever been charged for hot tea at any Chinese restaurant."}
{"text":"6/29/2017  Stopped in for lunch.  I ordered a small cup of Hot & Sour Soup ($3.00) and the Lunch Special Kung Pao ($6.95).  The soup was really good and I was surprised at the large portion of Kung Pao, which was good as well.  I had a fountain diet Coke ($1.50) which was refilled 3 times and my bill was $12.20.  The place was clean, I was waited on immediately and was impressed with the food and saw many orders to go that impressed me with the large portions they served.  I highly recommend this place and would have given it 5 stars if the people serving me had smiles on their faces.  The service was good but the lack of \"enthusiasm\" and smiles gave me the sense that people were not happy.  This place should do well if people give them a try."}
{"text":"Mediocre Chinese food. Ok quality meat but no taste with sauces. The fish was good but they just use salt and pepper for seasoning. The soup was really hot which was nice.... I would come here again for the soup only or if there was nothing else...kinda why I came here in the first place."}
{"text":"This is my new favorite Chinese place. We ordered delivery from the Yelp app. And it was super fast and easy. Took less than 15 minutes to get my food delivered. We were very impressed. Food was hot, fresh , and it was very tasty. We will be ordering again soon. Thanks for an awesome experience China Tango!!!"}
{"text":"My go to Chinese restaurant here in the Anthem/Inspirada area. Love the fast and friendly service and delicious food. Lunch specials that include soup (hot and sour or egg drop). Clean dining room and restrooms."}
{"text":"It is rare that I find a restaurant that truly impresses me. From the time that I walked in the door and had my food at the table was maybe 5 mins. The lunch specials are really great for a quick meal. I would not call this \"authentic\" Chinese, but then again I don't think most people could handle authentic food from many nations. Service was very good, food tasted great and spicy. I would have given this place 4 stars, however the fact that they had Thai iced tea won me over immediately. I plan on returning very soon."}
{"text":"Food was delicious and surprisingly delivered fast!!!  Placed our order through yelp and you get an email and a timer estimated time of arrival. If stated 45-60 minutes. We got the food in 20 minutes. The prices were average with everyone else and this joint used to be pick up stix... our order came with free stuffed wonton cheese that were awesome and free. My new go to chinese quick fix when I'm this part of town"}
{"text":"There aren't too many options for food if you live in Inspirada. This place is close and quick. Called in an order ahead of time and was told 10-15 minutes before it's ready for pick up. Food was ready on time and cashier was friendly. Food was tasty. Would definitely return."}
{"text":"Excellent meal! The Kung Pao Shrimp and Sesame Chicken were delicious. The only negative was the that the Chicken Satay sauce was too thin."}
{"text":"I'll quote another reviewer: \"cheap, mediocre but takes care of a chinese food craving\"

and actually, not that cheap after tax, delivery and tip but it was decent
the veggies were fresh, tofu was fried right, noodles were tasty
will likely order from here again but will keep looking for something better (first world problem)"}
{"text":"This used to be a Pick Up Stix, which I dearly loved, but this place works. The parking situation sorta sucks. There are fast food store fronts all sharing a small parking area and you need to keep your head on a swivel. It's like parking lot paranoia. 
The people are friendly the food is good the servings are ample and I have never had a bad item. Open kitchen so you can see them wok your food and they are prompt."}
{"text":"My daughter and I liked it. Ordered string beans and chow fun. They were both good. Nothing bad to say. Came on a Saturday at noon. Not busy. Parking was good. Price was ok. I had leftovers."}
{"text":"My favorite Chinese food restaurant in town by far! Food always comes out fast and we've never been disappointed my anything we've ordered. I have now settled in and typically order the Mongolian Beef lunch special or Family Dinner A or B. It always comes out super hot and fresh. Never tastes like it's been sitting around, definitely made to order...and FAST! They come by for drink refills once or twice while you are there too. 

I'm from the east coast. so I'm pretty picky with my Chinese food. Pricing is good. No complaints here, we are regulars!"}
{"text":"I decided to give this place another try after not ordering from there in a while, and I am so disappointed. They completely changed the recipe for the potstickers to the generic kind like every other Chinese food place (they used to be thicker and had delicious homemade sauce, now they seem like something that was just frozen and the sauce tastes like plain soy sauce). The sesame chicken was totally dry and over cooked. This restaurant used to be amazing! Go back to your old recipes, that's what set you apart."}
{"text":"Fine, unless you are a vegetarian. We keep giving this place the benefit of the doubt, but I am finally done. They have very few tofu dishes on the menu, and most Chinese restaurants have no problem substituting tofu for chicken or beef in most of their regular dishes. Here, if you order sweet and sour \"tofu\" it is a \"special order\" and takes twice as long as other meals. That would be ok if it actually WAS a special order, made special in some way, but what you are given is a plate of dry, fried tofu and a side of sauce. Not sure how this constitutes \"special\" but ok.

Our last time here was on a particularly busy night, and (not smart of us) we didn't check the order until we got home and realized they left out a $7 order of fried rice. We had to drive back to the restaurant to pick up the rice, while the rest of our food got cold at home, and we were offered nothing as consolation for our troubles, other than the rice they forgot and a half-hearted apology. Free meal next time? Free appetizer for our trouble? No, nothing.

We won't be back."}
{"text":"I love this place. I love their chicken fried rice, been coming to pick up for years now. Almost on Sandra Bullock in Two Weeks Notice status. No vegetable, only chicken and egg. Trying to cut back on grains and carbs, but my God does their fried rice craving hit me all the time. Their Walnut Shrimp is also okay but maybe too much tempura. Their Fried Wontons put everyone else to shame, though. Crab Rangoon also delicious, sometimes a little overdone but as far as affordable chinese food goes, I gladly drive the hike up Green Valley to their location by the 215 just for them even though Amlee is across the street (btw, Amlee- NEVER AGAIN). Love China Tango! :)"}
{"text":"disappointed..good but.. Love the Summerlin location. 

This was our first visit here. an intense craving for some Chinese Food. as we walked in we were immediately greeted and he was friendly. It was quite busy with guests waiting for take out and dine-in . 
It was well kept & Clean.  We waited approximately 15 minutes for our two dishes to be prepared. 
1st dish was the shrimp, honey walnut (could be better) 
2nd tofu and veggies  (better)"}
{"text":"This place was pretty good. We got two dinners take out and the food was cooked well and completely. It was not too salty. The egg rolls were just meh but the Cashew Chicken was really good and the veggies were not mushy! The egg drop soup was pretty tasty and the portion was very large so we had leftovers for lunch the next day."}
{"text":"I've been looking for a good chinese restaurant since I moved to Henderson a year ago, and China Tango is it!
We've been a couple of times for takeout and they have added free egg rolls each time to our order. They are delicious!
The food has been great every time, and I haven't had anything that I didn't love.
I would highly recommend China Tango for a great inexpensive lunch. They have a lunch special for around $6.00. The portions are extremely generous."}
{"text":"Fast delivery, orders are always correct. Staff is so friendly, even the delivery driver's are so sweet to my kids when they answer the door. This is the only place we get Chinese takeout from. A family fave for sure!!"}
{"text":"Very fast and simple take out.  The online ordering is incredibly easy and simple.  Can't say enough about how simple they make it to order online!  Love the Pad Thai and honey walnut shrimp!!  Staff is very friendly!

I would recommend anytime."}
{"text":"This is our go-to restaurant for a quick Chinese meal. The staff are way friendlier than a lot of the other Chinese restaurants in town. They're always really fast at getting your order ready. The parking can be tricky during busy hours such as lunch and dinner since it's surrounded by other frequently visited businesses. The food isn't anything to write home about but not bad either. The menu is pretty generic. Again, I recommend this place for a quick Chinese meal if you're not into Panda Express."}
{"text":"Great food good price and wonderful service.  If they tell you 45 minutes for delivery count on 20 mins it seems there delivery time is always half the time they say. And like I said the people are wonderful . They consistently go out of there way to make you happy."}
{"text":"Nah. Nice interior design, but food does not hit the mark. If ur here for even marginally quality orange chicken or Thai style yellow curry, it's worth it to cruise on down the hill for a different restaurant. I finished my meal without satisfaction.

Orange chicken had to have been frozen, it tasted like recycled Panda Express... 

pork fried rice was just ok, not that it's easy to mess that up.

The yellow curry was not Thai style, no coconut milk or shoots to speak of. Tasted like overly spiced beef broth w/ chicken onions and bell peppers.

Crab rangoons were fine.

I finished my meal feeling like I payed for the interior design which is beautiful. Except, I ordered for takeout and so did not even enjoy the aesthetic :(


Thinking that if you choose a different restaurant they'll shut down and leave the market for a quality Asian genre to eventually replace them."}
{"text":"My parents and I are frequent visitors to this place, always excellent service and good food! The people are so sweet and very helpful. My favorite meal is definitely sesame chicken!! I can guarantee we will be back on our next family outing :)"}
{"text":"Decent portion size. Right price for the neighborhood. Super fast cook time. Literally called, left office, got in car, arrived and picked up food. Less then 5 minutes. I'll return."}
{"text":"This place is the bomb A+++ I just had them for the first time today. Where I just moved from we had no good Chinese food. So I was excited to see what they had here. I had the crab ragoon and Mongolian beef. Wow! Delicious and the staff is super nice. I will be going back there again :)"}
{"text":"A couple of years ago we used to drive to a location of theirs all the up in Anthem. It wasn't close to home but we thought the food was yummy so a little out of the way we drove....
So I was happily surprised when driving in Green Valley one day looking for somewhere to eat - I spotted China Tango.

We each tried a lunch special which consisted of free fried wontons,egg drop soup, eggrolls,fried rice, fried noodles (chow mein) and General Tsou's Chicken & sweet N sour chicken.

Fried wontons & egg flower soup - BLEH....
Veggie Eggrolls were filled with cabbage only and the cabbage was not even soft/cooked inside so it was a weird texture.

I asked if we could have white meat chicken instead of dark meat and the server said sure. I was happy about that.... Not for long - the pieces of the chicken looked big but the actual chicken pieces were so tiny that most of the chicken pieces were just crispy breading. Disappointing!!!!

The fried rice was OK but the fried noodles were bland and yucky. I don't enjoy fried noodles when it looks like spaghetti not chow mein noodles.
The server even walked by us and said \"Guess you didn't like the fried noodles...\" He suggested to us that the next time we come we should just order double fried rice. I'm not too sure if they'll be a next time....

The guy behind the counter was nice and they were accommodating in reguards to the request of white chicken and if my daughter can eat her slice of pizza inside but the food just wasn't what we remembered enjoying like at the Anthem location and my fortune inside my fortune cookie was freaky- it just said \"Learn Chinese\"..... The BF thinks my fortune was just prepairing me for the future."}
{"text":"They used to have the best Chinese food in the area! That is no longer the case."}
{"text":"Ordered lunch for my family today for the First time it was awesome!! So yummy we ordered orange chicken and rice and broccoli beef!! We loved it!!"}
{"text":"Just recently ordered food. Listen, I'm not looking for sympathy but I have crutches and could barely walk. I ordered delivery for that very reason. It's disappointing that the delivery driver made me come to him and was extremely rude because it took me awhile to get downstairs to get to him. I prepaid and tipped him more than 20%; now, I totally regret that decision.

Anyway, I ordered general chicken. The food is mediocre."}
{"text":"Great service! Food is really terrific, the restaurant has a terrific Vibe, and the prices are just right. The pad thai is a little bit unusual, and you'll love it. The sweet and sour pork is also terrific. They work very hard to accommodate customer wishes, and I find this very uncommon in a Chinese restaurant. Can't wait to return!"}
{"text":"I used to study at the Starbucks just right next door, and I would come to eat here pretty often. I always usually order orange chicken, broccoli beef, or chow fun. I come because the food is decent and the service is quick. The portions are also very generous. I usually have enough food for 1-2 meals the next day. They have all the food ready usually in 5 minutes. The flavor is alright, but when you're craving Chinese food and are on a budget, this place is for you."}
{"text":"The food is made fresh.  The egg drop soup is delicious.  They are not stingy with food. You get your money's worth."}
{"text":"Food is really good here, I go here probably once a week! I'd give it 4-5 stars for that. The service, on the other hand, is one star at best. I'm sure they will not read this review, but I hope it helps others out. I believe it's the owner's son who serves me every time, he is just a disaster. He never knows what to say or do, and if I ask for something to be taken out or substituted, the answer is always no, and they never listen to anything I ask for in terms of my food. I'll say, \"no thank you, I do not want any soup today, its too hot outside...\" He brings the soup anyway. I'll ask \"can I have one egg roll on the side instead of soup?\" He responds no. I'll ask if I can get half and half two different entrees in my to-go order, he responds no. Just not the type of kid you should have running a restaurant, its sad!"}
{"text":"Thought I would try this place it's a little farther than my normal Chinese restaurant but I'm very glad I did. All I can say is the food was so much more tasty than the restaurant I normally order from. Very very flavorful. The people also very accommodating and nice. I think I found a new Chinese restaurant."}
{"text":"Everything was hot and made on the spot! We ordered orange chicken, beef chow fun, fried rice, egg foo young and string beans with black bean sauce. Everything was very good! The portion size was huge! The string beans were absolutely delish! Will be coming back soon to try more."}
{"text":"Super speedy online ordering and they come to your house so quick! Can't beat that. Hey it's Chinese food, not rocket science. It gets the job done for those awesome cravings. I am not a frequent diner at Chinese food restaurants, but all I know is that this tastes great and is delivered fast for my lazy days. Can't beat that."}
{"text":"Great place for cheap chinese lunch! I love their spicy garlic chicken! They have a really good flavor. Additionally, it's finally nice to find a restaurant that has consistency. Every time I had their spicy garlic chicken, it always tasted the same (:

Also the staff is friendly and their food in general is pretty good. 

I would definitely recommend this place for lunch dine-in specials (they gave you egg drop soup and some wonton chips)."}
{"text":"Love their food, amazing customer service, and fast delivery. Love their egg drop soup, orange chicken, beef n broccoli, sesame beef, white/fried combination rice, combination noodles, egg rolls and fried cream cheese ragoons. They are always happy when they talk to you and all smiles when they deliver. Thank you all for your amazing food and customer service."}
{"text":"Horrible. We order (now in the past tense \"ordered\") from here only because they're one of the few places that deliver. The food is mediocre at best, heavily msg'd and oily with the only redeeming quality it's portions. They say no msg but we tested through the msg kit and its full of msg. They're lying. So we ordered a delivery and were missing rice and half our order was wrong. First they said they didn't have our order in the system and after threatening to drive down and dump our order in front of eating customers they \"found it\". After promising to have it in 15 minutes they neglected us again for an hour and a half. When we called again the guy answering stuttered his excuse before saying its on the way. Save it..there's better places around (and they charge an outrageous $5 delivery charge for the privilege of not giving a crap about your delivery). Worst place in Anthem/Henderson"}
{"text":"Food was delicious and service was great! Great little place in Henderson. We will definitely return next time we go through there."}
{"text":"My nephews and I order from China Tango at least once a month. First of all I have found they deliver a lot faster than the 45-60 minutes suggested on the app. We always order about $100 worth of food. There are 3 of us and it lasts a week for leftovers so that's part of the fun. The level of spicy flavor in foods like the pad Thai is fantastic. I love high spice levels and they do a great job. We have tried a huge variety of the menu and it all was delicious. The textures are all excellent and if the food should be crunchy, it's crunchy and if it's supposed to be tender, it is! The amount of food for the price is also excellent and if you order sweet and sour sauce laden items they give you a good sized tub which we like to drizzle over our rice as well. The delivery guy also brings our large order in a cardboard box so nothing spills. We also often get extra fortune cookies. When I moved to Nevada from California we were afraid we would not find a happy Chinese restaurant to order from, but we are highly satisfied. I can hardly wait for the next time we order!"}
{"text":"This place was pretty good. Clean and quick. Ordered two different soups as I wasn't feeling well and both were very good. The wor wonton was the best I've had in a long time and the egg drop soup was amazing. Just like when I was a kid. I actually look forward to going back and trying some of their other menu items. Glad I found this gem. Finally a decent Chinese restaurant!"}
{"text":"It started out with last night being so beautiful that Eric R. and I decided to go for a walk.  He asked what places to eat were over in the Smith's shopping center, and we meandered across the freeway.  We noticed China Tango was new, but I saw Jennifer C.'s review and knew at least a big plate of rice included with a dish would make Eric happy.

It looks like we should order at the counter, but the cashier handed us a menu and told us to sit at a booth since we were dine-in.  He gave us a styrofoam bowl of fried wonton strips and a plastic sauce cup of sweet n sour.

We got small styrofoam cups of water, styrofoam plates, and mini plastic forks.  We decided on egg drop soup (I was skeptical because soup was pricey like $5.25) and ginger and onion beef.  The soup came out immediately in a big plastic tub with a plastic spoon (not a ladle).  It had corn in it and was hot, just hard to serve in these small styrofoam bowls we had and little plastic spoons to eat it with.  

The ginger and onion beef had lots of green onions (good), bamboo shoots, red onions, and ginger.  Without a doubt, we received a huge plate of white rice.  The beef though - it looked good, but the texture was horrible.  You could call it \"cheap meat\" but I could not chew it.  I tried a few times and ended up spitting it out each time.  I ate the green onions with my rice instead.  At least the sauce was okay.

For the inedible dish and expensive soup, it was over $18.  Imagine if each person got a dish, yikes!  There is no value for your money.  Just lots and lots of styrofoam...! Will not return!"}
{"text":"Food was amazing for the price and quality and the Thai tea boba OMG all I can say is I'm glad its local :)"}
{"text":"Disappointed with the delivery. Ordered Honey Walnut Shrimp and it was placed in a to go container with a side salad with ranch dressing. By the time it got to my house the lettuce was hot and wilted and the ranch dressing had mixed all over the shrimp. It was pretty gross. Will not order from again."}
{"text":"Tried this place since I was in the parking lot getting Hubby Roberto's, and I'm not disappointed at all. I would usually go to ChinaAGoGo for my Chinese Eggplant with Tofu, but China Tango did not let me down. Just spicy enough, great portion size, crispy edged firm tofu, and very savory sauce. Eggplant wasn't too soggy either. I'll definitely try this place again for other things when I don't want to drive another 5 minutes to AGoGo."}
{"text":"China Tango is currently the southernmost Chinese Restaurant in the Las Vegas Valley. It is located in the southernmost shopping center of the Las Vegas Valley in the beautiful Anthem Master Planned Community at the Albertson's-anchored shopping center at Sun City Anthem Drive at Bicentennial Parkway. If Las Vegans in the northwest Valley in jest refer to the M as California, they would in jest refer to China Tango as being in Oregon. With this in mind, it was not surprising that I was in this area hiking on the Nevada Power Trail where the Las Vegas Valley recedes into the open spaces of the Sloan Canyon National Conservation Area. After hiking, it was time for a post-game delight. Inside the nearby Starbuck's, I turned to Yelp and it instigated my decision to try China Tango instead of my comfort Chinese food: New York Chinese Restaurant  

   When I walked in, I walked into a room that was as much a takeout as a Chinese Restaurant. The young man who would become my waiter was behind the cash register. This allowed me to take a perfunctory glance at the menu before taking a seat in this relatively empty restaurant.  

  Right off the bat, I was decided on the personal dinner. This is worth a drive to Oregon or Anthem. As a Yelper who strives to share things, the family dinner is a good value. For a $11.95 non-seafood entree or $12.95 seafood entree, China Tango gives you a lot of tastational food. This is what it includes: A soup of the day that is a choice between egg drop soup and hit and soup. An egg roll with duck sauce and crab rangoon. A fountain beverage. A choice of rice or chow mein. And any half entree from the menu. If that is a half entree, I would probably have a meal for the next few days eating off their full entree. 

  I ordered the personal dinner with hot and sour soup,  fried rice, and New York style shrimp chow mein minus celery. The hot and sour soup was just spicy enough in a good way to have my eyes tearing. This might take the prize for the best hot and sour soup that I ever tasted. I appreciate tasting New York style chow mein in Las Vegas. This is one of the reasons that I am a regular at New York Chinese Restaurant  Getting to the point it is one of my favorite foods since taking my first steps as a toddler. China Tango did a commendable job interspersing the mouth watering shrimp with cabbage and Brussel sprouts. This was some after hike delight. 

  I was satisfied with the service. The waiter did not hurry me. Then again, I was the sole Diner in China Tango. 

  If this wasn't in California, or the extreme South of the Las Vegas Valley in the Anthem Master Planned Community, I would most likely be a regular here. I was optimistic that this China Tango was affiliated with the Green Valley Parkway China Tango. It turns out they are different owners. It also turns out that I am a fan of China Tango. If I happen to be in the southernmost point of the Las Vegas Valley, possibly for a Sloan Canyon National Conservation Area hike, I just might return to China Tango for another post hike  delight."}
{"text":"China Tango is one of the Chinese restaurants that I dine in before the 4 pm lunch special ends. It has been open approximately a year (used to dine here when it was Pick Up Stix).
  The atmosphere is more restaurant than take out. There is more of a wait person presence.
   Before you order your food, they bring you egg drop soup. I hope it is included with all dine in meals. Not too much later, they bring crunchy noodles with duck sauce. If you order soda, they will fill it at the fountain for you. Last but not least, they will deliver your entree with the included fried rice and chow mein noodles.
  The lunch special tops off at $6.50. Soda is not included. The bill for the lunch special with a soda totals up to close to $10 before the tip (a tip jar).
   I rate China Tango four stars. The quality, starting from the crunchy noodles to the fortune cookie is high.
  A word of advice: Look at the menu outside. Once your inside, they'll sit you down, and before you know it they'll be serving you egg drop soup. This could make some people, myself included, feel awkward if there is nothing here that suits your taste."}
{"text":"This is probably the last place I would've expected to hear the explicit versions of Nicki Minaj - Only and O.T. Genasis - CoCo playing over the speakers. As much as I enjoy hip hop music, I don't think others would welcome N-bombs with their chow mein. I'm not sure if this was the usual playlist, nor am I going to deduct stars, but it was definitely a surprise for my first visit.

In any event, this is a casual Chinese restaurant in the mold of China A Go Go. I ordered the Hong Kong style chow mein, which is my usual order when eating at a new Chinese restaurant. Food came out quickly and piping hot. They didn't skimp on the chicken, beef, or shrimp, which made it a good value. I don't live on this side of town, but it is close to the church I attend, so if I'm craving Chinese food on a Sunday afternoon after mass, I know where to go."}
{"text":"So gross.... My family ordered delivery from this place one night. Ordered Mongolian beef, moo goo gai pan, calamari and crab Rangoon... The beef was steamed and almost gelatinous like. It had no flavor. Same thing with the chicken. Steamed no flavor. The rangoons had no crab. This place was just awful. No flavor or love put into the dishes whatsoever. It tasted as if they steam everything, set it under a warmer and add whichever sauce to it at the last minute. I'd be surprised if there were a single wok being used in this restaurant. Boo :("}
{"text":"I just didn't like it much. Was ok I guess. I'd rather put good food in my body than ok. I found it a bit greasier than it should be and expensive for what I received. I haven't gone back. I should give it another try just in case it was, just one cook that didn't care. We'll see ..."}
{"text":"Pretty good Chinese food to go. I get the salt and pepper chicken wings spicy because it's really not that spicy. Their service is very fast and reliable. I have tried their General Tso's chicken, eggplant tofu stir fry, chow mein, and sweet and sour chicken. All are pretty good. It's way better than Panda Express and not greasy."}
{"text":"Went here with my mother tonight and we loved the Mongolian beef that we ordered. The meat was tender and flavorful. I'll definitely be going back."}
{"text":"I like their orange and sesame chicken so far. Im really picky with food so i think they're doing a great job. The workers always keep the place clean and they are never too busy to refill your water cup. My cup was only halfway through and they go ahead and fill it up again. I really like that because i hate it when my glass is empty and i have to wait 10 minutes for someone to come by so i can ask for some water and they end up taking several more minutes before giving it to me. So thumbs up for the customer service! They are very nice and friendly so i am never uncomfortable ordering my food. i forgot to mention that their house special fried rice is pretty good too! Cheap price for good food. I give you 5 stars  keep up the good work!"}
{"text":"Ordering by phone was a breeze, surprisingly this was the first time trying this place eventhough I have lived around the area for years. The Hong Kong chow mein was very good, so was the orange chicken and the potstickers. We will be ordering again!"}
{"text":"I remember when this place first opened and I tried their food it was so delicious. 

First off, the place is always clean. The guy handling the money doesn't handle the food and vice versa. I never have to worry about looking for the table with the least amount if food left on it from previous guests, because the staff keep them clean.  

The staff there are very kind and are patient as i always want to try something different so I may take a few minutes to figure out what I want or if I actually want it. The same people are always there and the guy at the front knows what my co worker is going to order when we get there. If you dine in you get bottomless fried wonton noodles which are so good! They are also very quick; when you order, the food is out in less than ten minutes. 

Rice is a big thing with me as I feel it can make a meal taste great or make you want to throw it in the garbage, but can't cause that's a waste. The rice, both fried and steamed is very tasty and not dry which is one thing I hate about rice at other restaurants. Also the rice isn't mushy. I usually get sauted vegetables and I don't want my meal to end. The vegetables are so fresh and crunchy and the sauce they use is so magnificent I love it! Their chow mien also tastes great and I'm not too much of a chow mien person.   

Lunch specials are very inexpensive and are reasonably portioned. I almost always have left overs. The time for the linch specials goes till 4p, so if you go close to that time, you can have dinner too!

Overall, I choose this place over any other Chinese place in the area and I've been to almost all of them. Can't beat the cleanliness, service, prices and of course the food!"}
{"text":"After a play date at the playground, my friend & I wanted to get something to eat with the kids so I looked on yelp and found this spot. They were very helpful in seating us (2 adults plus 4 kids) and then they gave us some free egg flower soup and free appetizers (wonton chips & egg rolls) which kept the kids busy. We bought 4 plates shared to share and we even had some to take home to our hubbies!! 

another FAST, FRIENDLY, FLAVORFUL place!!!"}
{"text":"I really like this place. Come here on my lunch break at least once a week. Great selection and friendly staff, they even deliver. I love their Egg Foo Young and vegetable fried rice."}
{"text":"This place does a great job for what they are trying to provide which is fast Chinese. Service is very quick on delivery. Would like to see a few more healthy options but I guess that comes with the territory with Chinese food. That being said, the food always has great flavor for being so fast and typical."}
{"text":"I absolutely love this place.  This is definitely the best bang for your buck.  

The lunch special is huge and includes soup too. The staff are wonderful and very fast!  The one lunch special can serve two people or become two meals.  Not one was I able to eat it all."}
{"text":"What a terrible place. We ordered the honey walnut shrimp and it came with shredded lettuce not broccoli and it wasn't even in any sauce. It was basically just bland soggy fried shrimp with some walnuts that weren't really even candied. They scrimped on all ingredients. Okay next we ordered the wor wonton soup and the dumplings were of poor quality, there were no noodles, I mean this place seriously tries to cut costs at every corner. I will NEVER order from
Here again. There are other Chinese restaurants that are actually great quality."}
{"text":"Love this place! Fast delivery. Friendly service. Perfect place when your craving good Chinese food!"}
{"text":"Had the cravings while in Henderson so naturally I searched Yelp for some nearby local goodies. This place is quite interesting, as in the fact that they try to pose as if they are a Americanized Chinese food joint but in reality they are more and better! (You can tell from the tastiness of their food) I thoroughly enjoyed my meal, especially the amazing portion of the lunch specials! The boss gave us the option to get half fried rice and half noodles with our entry... both are delicious and i definitely could not decide if I had to pick one. 

Long story short, come here to fix your Chinese food cravings, this will do it! They are great with take-outs as well!"}
{"text":"I usually order from Table Thai but am running low on cash today so decided to try China Tango since they have NO DELIVERY MINIMUM!!! I ordered the eggplant with tofu, and the eggplant is good but the tofu has a slight sour taste that indicates it is slightly old. Still safe to eat just not ideal.  Delivery was fast via eat24 and food arrived piping hot.  Def not as good quality as Table Thai but it is also much cheaper!!! They forgot my hot mustard and sweet and sour sauce but honored all other requests (tofu on side etc) its average chinese takeout, not bad not great."}
{"text":"I was in the area and decided to grab a quick lunch!  Let me tell you, the food is yummy!  It's tasty like a nicer Chinese place with the price of a fast food joint.  I got crispy noodles with dipping sauce, egg drop soup, fried rice, lo mein, and sauteed veggies (all included in the lunch special) for just under 6 bucks!  Highly recommended for a nice bite in the Green Valley area."}
{"text":"fast and friendly service. came in on a saturday night around 6p and the place wasnt terribly busy...

we were looking for a some quick food before hitting the theatres at green valley ranch..

ordered the egg drop soup, eggplant and tofu, and ginger beef with green onion.  egg drop soup was unspectacular, not good and not bad... fortunately, the other 2 dishes were quite good, the eggplant was fresh and combined with the flavorful tofu, the dish was amazing.  next up was the ginger beef dish, i would have eaten it all had the portions been smaller, but that was definitely a plus.  big portions, simply said!!!

i will be returning to sample their other dishes... 4 stars simply because i think their AC wasnt working very well and it was quite warm inside the restaurant.

-link"}
{"text":"This is my go to place for Chinese in Henderson. It's super fast and the prices are amazing"}
{"text":"Amazing orange chicken. However,  it doubles as a sleeping aid. If you cannot sleep this is guaranteed to put you to sleep within an hour. I don't know why,  but it has happened several times now."}
{"text":"This place is a little gem located in Anthem. Our family loves this place. Food is always fresh and portions are generous. We decided to take our extended family here for Christmas Eve dinner and they have been raving about it ever since. Everyone from the kids to the adults found something they loved. The sweet and sour chicken is always a family favorite, chicken is white meat, light and not greasy. The wonton soup is delicious filled with meat and veggies. Crab ragoons are my favorite appetizer, they are light and flavorful."}
{"text":"Just moved over to this side of town and China Tango is very close to our new place. We ordered delivery and the service was super fast! The food very tasty and I didn't feel like it was riddled with sodium. We will definitely be ordering from here again!"}
{"text":"Good food, clean, and nice staff. We ordered orange chicken and chicken fun noodles. They were both very good. We had drinks, 2 lunch specials, order of chicken fun noodles and the  bill was less than 30.00. We walked out with full bellies and tons of leftovers. I would recommend it because of taste and value."}
{"text":"We absolutely love this place! Their food is comparable to Chinese food in Brooklyn, NY! It's delicious, fairly priced, and they deliver very quickly. I would recommend this to anyone in Henderson looking for a delicious meal."}
{"text":"My husband and I ordered delivery and we have been sick ever since we ate.... 50.00 down the drain. .."}
{"text":"The food is very good and the delivery service is fast. If you're not looking for a gourmet affair, this restaurant consistently is right on point."}
{"text":"Decent enough for \"fast food Chinese\" but still looking for a quality Chinese restaurant nearby..."}
{"text":"It's good - not great. Their food is never consistent. But they actually understand and prepare gluten-free sauce ... They don't just say yes and send Glutened. It's cheap and you get a lot for your money. Two meals were like four for my son and me. It's Meh with a gamble of sometimes great. Extra Star is for the AMAZING customer service and fast, friendly delivery."}
{"text":"My family and I order takeout here probably once every two weeks at least. The food is always very fresh and cooked to order. My favorite dishes are the pad thai and seafood delight (but I swap out all the seafood for chicken only because I love the combo of the veggies in this one.) My kids love the combo fried rice. The staff is always polite and friendly. When we order delivery, the wait is always minimal and they sometimes get it to me within 20 minutes, which is always appreciated with 3 hungry kiddos to feed. My husband loves the pot stickers and my mom raves about the won ton soup. Sometimes they forget to add in that bag of crispy fried wonton strips, so I always make sure to ask for those. They're a great compliment to anything you order. Love this place!!!"}
{"text":"A hidden gem in Las Vegas! 

My wife and I have come here multiple times and never have we been disappointed. 

The food is always hot and in large portions. We have always gone for the lunch specials.  You get egg drop soup with crunchy noodles. Plus your entree with rice and noodles. That all is for in room dinning.  Also, Average prices boba. 

The service is great too! The majority of workers have simple English, however they are fast to serve you. They are super friendly and smile. They do their best to serve you. 

Great spot for anyone in the south part of Las Vegas or Henderson."}
{"text":"Delivering was fairly quick. I ordered the Orange chicken and Hong Kong Style Chow Mien. Both dishes was delicious. It was more than enough for two hungry people. Will definitely order from here again when we're craving Chinese food."}
{"text":"This place is a great place to get Chinese food. They are really nice and you are quickly greeted when you walk in. I would have had pictures to go with this but me and my family didn't hesitate to dig in."}
{"text":"I have ordered food for pick-up from here several times without any hiccups. I live less than 5 minutes away and usually order take-out. By the time I hang up my phone, head out the door, and drive over, the food is always ready by the time I get there. I am impressed that they prepare the food so quickly!

My meals are always fresh and taste great!!"}
{"text":"Fave dish: eggplant with tofu (spicy)

Trying the curry chicken tonight. I'll let you guys know!"}
{"text":"Generic Chinese food. Maybe I am spoiled from living in Asheville but it was just very mediocre. The fried rice had shrimp in it which was impressive but the peas were hard so it wasn't very good. The other entrees were not great. I had garlic beef and the beef was mushy. We also got orange chicken and it was okay but soggy. 

If you are in a pinch, then it isn't the worst. I wouldn't go back."}
{"text":"Having spent 2 years in Taiwan this definitely brings back the memories of purple sweet Taro shakes and sticky white rice :) I just love it all especially the steaming hot cream cheese Rangoon that blends the crispy crust with the sweet cheese so beautifully it'll make your eyes tear with joy :) great to order out or dine in give it a try! I only wish prices didn't run so hi at 9.45 average a dish for dinner. Although it'll leave you with plenty for leftovers it's more economical to stick with the lunch menu"}
{"text":"The food is always really good and it's very reasonably priced and the location is really convenient to our home. We get take out from here every other week, and they deliver as well."}
{"text":"The best kung pao shrimp I've ever had!! Nice atmosphere and great prices for the portion size. I will definitely be back on my visits to the area."}
{"text":"It's been awhile since I've gone here.  But tonight I got the oxtail soup, again. I use to love it but unfortunately I was let down.  the meat was tough, could not chew it, so I spit it out.
this was never the issue before, it was always tender just sometimes I was short changed.
So, I reduced my rating. Probably won't ever order it again after tonight.  After all, it's full of fat and calories, but on a cold winter night, that's exactly what you might need."}
{"text":"Excellent food with a good variety of items.  Szechuan shrimp in a spicy tomato sauce is hard to find in southern Nevada but not only is it on their menu, it tastes great!  Highly recommended."}
{"text":"Pot stickers very good. Sizziling rice soup good too. Low prices"}
{"text":"Just ordered delivery. Got here fast.  Took a small taste of it as I am not fully hungry yet lol.  Everything is Delish!!  Definitely will order again!

Update: ordered tonight no Bueno! Soup was spilled everywhere in the bag. Food was meh."}
{"text":"They are afraid to spice their food up when asked. Other than that , good place to eat. Service has been prompt. Food is tasty. Prices are in line with other restaurants in this category. Enjoyable experiences on 3 visits thus far. Not NY style but, not all Chinese restaurants are NY style anyway. This is a restaurant that would work very well in a town or small city."}
{"text":"On vacation in Henderson, at Green Valley, this was our third day eating here at China Tango. We tried the Cashew Chicken today, yesterday was the General Chicken, the day before I had Spicy Garlic Chicken and my husband had Mongolian Beef. The food was delicious. The portions were more than generous. The service was fast and on top of drink refills. They were eveything we like in a quick lunch."}
{"text":"We love this place. We come for lunch or dinner at least a couple times a week, and they never disappoint. Fast and always friendly. They remembered us after the first time we visited. 
I usually get the lunch special with my husband if we stop in early enough. Our bill is usually $16 and we are full! We are in and out in 30 mins. 
Dinner is usually ordered to go. We have never had a mistake on our orders, the food is always fresh, and we always have more than enough for leftovers (which I always look forward to) My teenage son even orders delivery when we have to work late, and he never shares his leftovers 
My go to is the MooGooGaiPan (sp?) with brown rice, and my husband gives their (although a Thai dish) chicken pad Thai 2 thumbs up!"}
{"text":"I order from this place regularly! They deliver quickly & have exceptional customer service. The food tastes amazing. I usually get chicken chop suey & BBQ pork fried rice."}
{"text":"We recently located from LA so perhaps out expectations for \"decent\" Chinese food are high regardless, the food did not meet our expectations. The shrimp were all batter and greasy. The sweet and sour soup had a thick unfamiliar taste to it. The only thing that was ok was the white rice. My order was over $70 USD so we certainly had a representative sample of the menu. The order was take out do perhaps that was the problem? 
Anyway, we continue our search for Chinese food in Henderson NV."}
{"text":"What I failed to mention in addition to being ripped off, the chicken teriyaki tasted horrible ! Disgusting flavor, like almost a burned taste. Awful! Do not eat here !"}
{"text":"We order from here a few times a month. The food is absolutely great and they always accommodate our request to alter the item, such as requesting no salt, no veggies, extra green onion, etc. They deliver super fast and Jimmy John's delivery speed has nothing on them. China Tango is definitely our favorite Chinese Restaurant."}
{"text":"First review but I had to. This is now going to be my new to go to Chinese food restaurant for delivery. My fiance's teriyaki bowl was good. The food arrived hot and was packed well. I had the combination appetizer and orange chicken with rice. The deliver was as expected during the dinner rush. I loved the food and would recommend to anyone living in Henderson."}
{"text":"Overall, this place is a pretty satisfying Chinese restaurant when you're in the mood for some mandarin cuisine. The prices are very good compared to the amount of food they give you on each plate. The lunch specials never disappoint. The place is pretty clean and tidy. You could see the kitchen and how spotless it is. And service is always amazing."}
{"text":"Awesome food and very traditional food available! My husband worked in Shanghai and was impressed with selection and that those dishes that aren't normally available here could be found here. You have to include House Fried Rice, YUMMY!!!!!"}
{"text":"I have given this restaurant six tries including dining there and take out. I love Chinese food and this food tastes bland. Almost all the dishes tastes similar. It must be their sauces. Their chicken tastes rubbery and looks bleached, not a normal white color. The dishes don't come with enough veggies and if you ask them for some more, they charge you. Will not be dining with them in or take out."}
{"text":"I am really picky about take-out Chinese food. Since my favorite local place was sold I have been on the hunt for a new favorite. After trying every nearby place I have decided China Tango is the clear winner. 

This place serves fresh food that isnt greasy or overly salty. The vegetables are still green and crunchy, not soggy and wilted. Meat is good quality. You know those weird, gooey, unidentifiable chicken pieces you sometimes get in Chinese food? None of that here. The flavors are spot on. My favorites include the moo goo chicken, singapore noodles, and shrimp with broccoli. Large portions that arent drowning in salty sauces. Yay!"}
{"text":"China Tango is our go-to place when we do not want to cook at home.  We only live 5 minutes away, but our food is always hot and ready by the time we get there.  Try the General Tso's Chicken and Moo Goo Gai Pan."}
{"text":"This super fast Chinese restaurant is my local favorite. My husband and I order takeout from here a few times per month. The food is always tasty, the vegetables are always crisp and we have yet to have a bad item here. They offer brown rice which is awesome, the soups are fresh, and the entrees are very tasty and nothing has ever been overly salty. This is a great place with quick service and inexpensive prices."}
{"text":"Pleasantly surprised at how good the food was. I ordered delivery through yelp and it came very quick too. 25 minutes from placing the order to the man knocking on my door! The food was fresh and hot. I will definitely be ordering again. The best part is my super picky 7 year old actually ate all the chicken and broccoli and white rice that I put on her plate. I ordered General Chicken for myself and that was good too but that chicken and broccoli has a really good sauce with it."}
{"text":"We have dependable quick Chinese cuisine close to the house, yay! 

As a half Chinese girl, I'm pretty picky. I thought this place was a NYC style eatery which I'm not into. There's not a fan of \"yellow rice-fried rice\" so shame on me for not checking it out! 

We've tried and loved the salt and pepper tofu, bok Choi and Chinese broccoli veggie dishes, fried rice with chicken or shrimp, shrimp chow fun noodles, beef and broccoli, and steamed rice. 

My little one gets to nosh while we get a chance to eat out too! The service is friendly and gets to know you the more you go. Takeout and dine in work just fine!"}
{"text":"Nearest Chinese place I could find, so, that got a star. Clean establishment, which makes number two, and nice people... BAM ! Star three!!!

The food was nothing ground breaking but tasty. I feel there is room for improvement,  but when you are out this far and want a bowl of rice you take what you can get. The pricing was a bit more than I like to spend on that type of food but again not unreasonable."}
{"text":"Food is good but the delivery man is ridiculously RUDE. He was unsure if we had paid him when it clearly stated on the receipt that we had paid online."}
{"text":"There is such a lack of restaurants in this neck of the woods. This one is alright. I wouldn't get the Lemon Chicken unless you enjoy the taste of lemon dishsoap, but the beef broccoli and crab rangoons were tasty."}
{"text":"I do consider myself to be lucky... I've been in the Valley for a while now and just a little over a year ago I FINALLY found a Chinese food restaurant that was actually really GOOD and reminiscent of one you would find anywhere along the NE coast. I loved this place, but ended up moving to Henderson. A visit to my fav place would make me invest in a 45 min round trip to Summerlin. 
We tried a few new places around GV, Eastern and so on...to see if there was anything close,  until we experienced China Tango. It is just as good as my spot in Summerlin and that's not an easy feat! 
It's a small restaurant, but it looks clean and the atmosphere is pleasant. I like that you can see the kitchen, and if so inclined- you can watch them cook your food. My absolute favorite thing is that I can order for delivery from the YELP app. 
Even better, every interaction I've had with either a delivery person, cashier or wait staff, has been nothing short of pleasant. Even last night, I ordered dinner and when I opened my front door, the delivery man was smiling and said \"Here's your dinner!\" I love these guys and it's small gestures like that, that totally win me over. 
Great job China Tango!!
Sincerely, one of your new local regulars :)"}
{"text":"For good Chinese food fast China Tango is really the way to go. It's definitely not gourmet Chinese food by any means, it's a good place to fill you up on a budget. In addition, they have a good family meal option for a fair price, which is nice if you have kids (and you have several options for the dinner, and they are not stingy on the choices).

The chicken and broccoli, salt and pepper shrimp, the war wonton soup, and the orange chicken are very good. I especially like the crab rangoons, and the fried dumplings. If you are looking for a fast and friendly place for Chinese food, on a budget, look no further!"}
{"text":"My daughter and I ordered from China Tango with their WONDERFUL online ordering system. We even made substitutions and everything arrived perfect and our last request was that it arrive hot, not cold. 

WOW! The food was fresh, excellent, hot upon arrival and we are now BIG FANS! We ordered Vegetable fried rice (perfect - no mushy vegetables). Egg rolls that were not greasy or soggy. Crisp and light. Pork Chow Mein and it could not have been better! Kung Pao Chicken with a substitution for snow peas. OMG -- we had enough left overs for another full meal+.  And so close to home. What a treasure to find China Tango!"}
{"text":"China Tang-NO.  
.
Went on Sunday 2-7-16 at 6PM.  $33.24 got us a thai tea, a coke, a combo platter appetizer, an individual dinner, and a chicken in hot garlic sauce entree.  The restaurant is located in the Smith's shopping center on Green Valley between Pebble & the 215.  
.
The restaurant is in fair condition and poor cleanliness. The table was sticky and the soap dispenser in the men's room was duct-taped to the wall.  Our server was prompt and friendly.  
. 
$7.95 Combo platter- An assortment of (2) egg roll, (2) butterfly shrimp, (2) crab rangoons and (2) paper wrapped chicken & BBQ pork.  The eggs rolls were filled with what I can only assume was a mixture of coleslaw and black pepper.  I've never had an eggroll like this and did not enjoy it although it was nicely fried.  The crab rangoons were my favorite part of the whole meal.  They have a good amount of filling and although devoid of crab they were very tasty.  The shrimp were not butterflied as their menu describes and were not de-veined.  They were fried nicely but I'm not a big fan of eating poo.  The \"paper wrapped chicken\" was really just like a chicken sausage wrapped in tiny triangles of tinfoil.  They were actually pretty tasty.  The barbecue pork was disgusting...tiny slivers of dried up pork sauteed in the same gooey pink sauce that is traditionally served with crab rangoons.  I was praying before I went to sleep that I didn't get food poisoning from anything I just mentioned. 
. 
$9.55 Individual dinner- I chose chow mein, crab rangoons, wonton soup, and orange chicken.  The chow mein was the super-cheap spaghetti kind with bean sprouts, green onions, and maybe a tiny sliver of carrot here or there.  Noodles were hot and had sub-par flavor but were fairly mushy.  The orange chicken was probably the worst I've ever had...very freezer burned and I was done after 4 bites.  The wonton soup was served boiling hot but the broth was terrible...it tasted like my breath when I wake up in the morning.  The wontons were complete mush and were so gross that I spit it out into my napkin.  
. 
$9.25 Chicken in hot garlic sauce- Sliced white meat chicken w/ carrots, mushrooms, diced bell pepper and onion stir fried in spicy Szechuan sauce.  My hubs told me the chicken was rubbery and the veggies were cheap and not cooked well.  It was an enormous amount of food for the price, however.  
. 
This place is not serving high quality or tasty food.  I am disappointed that I wasted over thirty bucks here.  I felt bad for our server who boxed up the leftovers knowing full well that they were going in the dumpster.  This is the kind of place where you wait til the waitress walks away and joke about the neighborhood cats going missing and I am shocked that it has 4 stars."}
{"text":"Great & fast service. The food is really good!  Love the Mongolia beef...it's my new addiction!  We will definitely be back!"}
{"text":"Tiny hole in the wall restaurant which usually means it's going to spectacular and this place didn't prove me wrong. The service was very friendly and attentive and the food came out extremely fast and fresh. We started with the free wonton straps  which were very tasty but my kids and husband weren't so fond of. Then we had the fried wontons  (not pictured :( ) those were amazing and we actually fought over them we should have ordered a double order next time I know. Then we had the hot and sour soup which was super super yummy full of flavor and quality ingredients. Then we had our main course which we ordered the shrimp fried rice the kung Pau combination and the general chicken and as a bonus we got the Hong Kong chow mein (we didn't order it but the girl thought we did so she gave it to us for free). The general chicken was absolutely phenomenal I wish we had ordered two of them instead of the kung Pou combination. The flavors of the general chicken is a mix of sweet and spicy deliciousness. Such an amazing dish the kung Pou though left alot to be desired it lacked flavor that makes you want to take another bite it was also filled with more veggies then meat which is always a negative when your paying for a meat and seafood dish. The shrimp fried rice was gobbled up by my kids like they were eating for the apocalypse. The Hong Kong chow mein was okay there seemed to be a few bites of really good flavor then blandness which is not alot of fun to eat. All in all I would definitely be back the service was excellent and the dishes we loved were phenomenal and good enough to make us want to come back for more!"}
{"text":"Got sick from food. 1hour after I ate I spent about 2 hours in the restroom . Never going back."}
{"text":"Dear China Tango,

I cannot resist coming back for more of your delicious, fresh tasting & clean looking food!

Often I am either ordering take-out, dine in or delivery.

I'm very picky when it comes to Chinese restaurants & the fact that I can physically see inside your kitchen & observe the cleanliness is a huge contributing factor as to why I keep coming back.

(Not to mention that almost every dish I've tried tastes phenomenally delicious)!

Now if only you guys over there can come up with a better strategy for those of us who call in orders for pick up & don't have time to wait in your long line of patrons ordering off your menu!

The other night I was on my way into my nightshift & called my order in so by the time I arrived to pick it up I did not anticipate the long line that cut down the middle row of your patrons dining in as I stood uncomfortably between side by side tables while families were eating!

I'm sure they were just as uncomfortable as I was standing right next to a diner close enough to be within his personal space!

There must be another way you can line us all up when you have more than 3's a crowd at your register!

Finally, I need to point out to you that the whole point of me calling in my order ahead of time for take out is all about having my food ready for me to be in and out of your restaurant within a quick reasonable amount of time.... I got caught up with your established line of guests & knowing my order was waiting for me as I was on my way into work, I ended up taking the initiative to excuse myself to walk right up to your second register & request that I pick up & pay for my take out immediately!

Please consider posting a sign that says \"pick-up here\" or make it known that customers who call in orders ahead of time can just walk up to your second register w/o the long wait in line times......"}
{"text":"Sorry to disappoint! I was honestly surprised to see the solid 4 star reviews when I yelped this place AFTER (yes, after) I had lunch here. I was quickly seated upon my arrival (yes, you get wait service when you aren't doing takeout) and asked for my drink order. Upon receiving my drink order I was given egg drop soup and fried wonton strips. I wish I could have been given a choice because I didn't touch either one and am still feeling guilt for wasting food! He took my order and before I could blink my food was at my table! 

So, A+ and bravo for the really great service and large and generous food portions.. But the taste was a no go for me. I am far from a picky eater, but I ended up just eating the fried rice from my meal. I got Kung Pao chicken, and it just wasn't right. The sauce just tasted like a... molten salt lick. No sweetness, a hint of tangy, a ton of salt. And when placing my order, the server warned me it would be spicy, maybe the salt killed the spice? And the texture of the chicken wasn't appealing for my mouth either. One of the reviewers commented on how they deep fry everything which can answer to the texture of the chicken.

I'm glad this is well liked by the community, and I understand why due to the speediness, heaping portions, and small cost, but next time I'll stick with what I know I like."}
{"text":"shrimp chow is what we are having today for a late lunch. It is tasty  as always. normally we come for dinner time, but it is just a good."}
{"text":"Have been ordering from China Tango for the last year. They always get the order correct (I usually have special requests). Food is tasty and the delivery is super fast!"}
{"text":"I ordered the chicken yellow curry dish, and it was just white meat chicken and some peppers. It was bland and tasteless, the worst meal I have ever had in a Chinese restaurant and possibly the worst meal I have ever had -- and I have eaten in some very dodgy places around the world, including China. My wife had the lemon peel chicken, and it was just chicken cutlet with breading and fried with no lemon taste at all. Avoid this place."}
{"text":"Great take out. If you live in or near inspirada, give it a try! A bit pricey for the quality, but i still went back for seconds"}
{"text":"Advantage Anthem!
Reservations accepted at this location. Not gonna find that at the other locations, I do believe. 
I've been to other Tangos and this was my first time here. I had the crab fried rice and it was to go. I should have asked if they used crab meat because they do not, as I later found out. Huge disappointment! 
If you're gonna use imitation crab meat, let's give a heads up! I'm going back to voice my displeasure and ask for a do over. The fried rice with the imitation crab meat was OK, but lacked distinct flavor. I think their prices are a little higher than the other locations as well. 
The dining room is upscalish and they sell alcohol, which you also won't find at other Tangos."}
{"text":"Location, location...we've all been there, frequenting the closest Chinese takeout to our abode.
That being said, I'm still not placing Tango in the top spot for neighborhood Chinese takeout joints. You'll have to see my other reviews for that. However, it is closing in on the competitors. Today's featured dish is the Garlic Shrimp, which gets an 8 out of 10. 
I've had this a few times and it never disappoints! I love mushrooms, and the funky alien looking shrooms in this dish are cool. And tasty.
Lots of veggies in this one too, and it's spicy (don't chomp on the small red peppers)
which I love.
Oh, and they have your order ready so fast you'll think they saw you coming and could read your mind...."}
{"text":"This place is inexpensive compare to other Chinese restaurants in the area, great large portions and great customer service! I continue to refer clients, friends and family to this great restaurant."}
{"text":"Great Chinese place! My food was ready in less than ten minutes, the staff was friendly, and it was an awesome price! $10 for two takeout containers, one filled with rice and the other jam packed with \"General Chicken\" aka #54 on their menu. It's typical General Tso's chicken and really yummy! Be warned though, if you're not a fan of spicy, maybe order something else. I personally didn't find it spicy, but there were a couple of thinly slices pieces of jalapeo so watch out if you're not into spicy. But the steamed rice was yummy too, perfectly soft and the I loved how the chicken dish had some onions, bell peppers, and even a couple florets of broccoli in it too. Definitely worth the price!"}
{"text":"Always searching for a new lunch spot I gave China Tango a try. I ordered the orange chicken lunch special that came with fried rice and chow mein. The orange chicken was just ok, nothing great. The fried rice was very bland and even with soy sauce lacked flavor. The chow mein had a lot of garlic flavor (which is a good thing) but just really dry. Obviously I didn't really care for this place. 

I will give it 2 starts for fast service and being reasonably priced. The food however is a different story."}
{"text":"I have been ordering food from them for the past five years. They are kind and polite and the food is great. Refreshing to have a place to eat like this."}
{"text":"Cheap, mediocre but it takes care of a Chinese food craving. Lunch specials are a great deal and they last until 4pm.

I ordered take-out shrimp chop suey, which came with chow mein and fried rice. The total was about $7 bucks-ish. Remember, they don't give you condiments unless you ask, so don't forget! 

The shrimp chop suey was decent and flavorful. There were plenty of vegetables, which was delicious. The shrimp was bit tough, which was my only complaint for this dish. The chow mein noodles and fried rice were very bland. I wasn't too crazy about it.

When I walked in to grab the food, the service wasn't all that great. Not personable.  Overall, if you're looking for a quick bite that is cheap and fast, then don't hesitate to give this place a shot!"}
{"text":"The food is very tasty. I enjoy the egg drop soup on a cold night. Their orange chicken is delicious. The best part? They deliver.  I've ordered from here twice and I have yet to be disappointed."}
{"text":"Just good food and service.  I get take out often.  I love that they have healthy selections.
The brown sauce that they add to the dish is wonderful and not salty."}
{"text":"I had the individual dinner with sweet and sour chicken with chow mein and the hot and sour soup is delicious as well."}
