{"text":"For the area this is a great Chinese choice. The general tao was delicious. The peanut chicken was just average. Portions are large and the food is fresh. Iys a great choice for fast convenient delivery."}
{"text":"As an American living in Canada, I struggle to find Chinese delivery that's as good as the American style Chinese food I'm used to back home. I do have a refined enough palate to also appreciate authentic Chinese food (and have eaten in hole-in-the-wall restaurants in Northeast China to prove it!) but I just find comfort in a good old box of sweet and sour chicken with white rice and an egg roll. The Canadian stuff suffices, but I'm used to disappointment. That being said, my food from China Gourmet was just awful.   Last night I decided to order some delivery from China Gourmet, not having had their food before. The food arrived later than the estimated delivery time, and when I answered the door the delivery guy just said the name of the restaurant, handed me the bag, and walked away (I get that it's possible that the delivery person didn't speak much English, but as a server myself I expect at least a \"hello\"). I knew right away that the food was going to be bad, because I couldn't feel the usual warmth of freshly cooked Chinese takeaway through the bag.  My suspicions were confirmed when I opened the bag. The food was cold. Grudgingly, I spooned some onto a tray to heat up in my toaster oven, as my partner and I do not have a microwave (by choice). Even before I heated it up, the sweet and sour chicken balls were overcooked, and the egg roll looked like it had been run over by a steam roller.   I ate about half of my meal and had to give up. It was greasy, overcooked, and the egg roll was just a smooshed greasy pouch with only cabbage and sprouts inside.  I will never order from here again!"}
{"text":"I've experienced much better chinese takeaway, absolutely rubbish food. Have they changed management? The reviews have been pretty awesome from I can see. I couldn't finish both of my dish, a lo mein and sweet and sour pork. Big portions but the pork is full of fat, they pick up whatever left they chop up and fried them, the lo mei is uncooked, meat is bland, feels like they boil roasted meat. Utterly crap, the extra star I gave is for the overall impression, cleanliness and quickness. Price is amazing, location is spot on. Everything is good about this place except the food, very unfortunate."}
{"text":"I've been ordering from them for years now. Great food, I like it a lot. Decent portions and good prices. I've heard many times that its not authentic Chinese food, but that doesn't bother me.The staff however... not so nice, rude actually. When calling to place an order it sounds like I'm bothering them, absolutely no patience(the woman anyway). I usually order the vegetable chow mein. Lots of food and the vegetables are always well done. Very garlicy but I like that. Tofu and rice dishes are also pretty good. very good value."}
{"text":"Amazing Delivery for two.  I've been ordering the dinner for two for over 3 years now, and I haven't found a better place yet.  I usually sub the chop suey for lo mein - it's a couple bucks more but totally worth it.  The portion sizes are great, they usually can't even close the box for the chicken balls and wings!   If you're a fan of fresh canadian chinese food and you're looking for a solid place to order in, look no further."}
{"text":"Having received one of their flyers and having read some reasonably good reviews, we decided to try out China Gourmet and put in a delivery order.   After waiting for 1 hour 15 minutes, we called to see where our food was; they assured us that their delivery person had left and would arrive shortly. After 15 more minutes, we called again, and were told that our food hadn't even been cooked yet; no explanation was given as to why we'd been told it was nearly here.  We won't be ordering from China Gourmet again."}
{"text":"dropped by for a $30 worth of food, left not much more than five minutes later, hot, FAST! Typical Chinese-Canadianized food does not disappoint, yum."}
{"text":"This is definitely my go-to spot for some delicious Chinese food!  Their menu has an array of choices (from their classic chicken balls to their noodle dishes) and every meal has been delicious so far!  I'm definitely a repeat customer (and have been since 2013), and even the owners know me by name!  They're super friendly and can remember my favourite orders!  I'd say the service is great, the price is VERY reasonable (for the amount of food they give you - the containers barely shut!) and the food is delicious!  I cannot go a week without ordering from them.  The delivery to my house is very efficient as well!  Will be ordering right now!"}
{"text":"I have been a regular customer of China gourmet for several years. Better say used to be. They were known for their quality but also portion sizes. I just placed an order of BBQ pork fried rice and it's basically for one person. In my past order, just a few weeks ago, they were huge, basically for 4-5 people. I personally complained to the cook and attendant tonight and they will NEVER see me again. Last time I ordered there."}
{"text":"terrible food, way too salty, and low quality products used. don't buy from here you will not eat what you order and it will be a waste of money!!!!!"}
{"text":"I've been ordering Takeout here for a few years.  The food is good and the quality good too.  Delivery times are reasonable.  However, my biggest complaint from this place is that some of their dishes are not consistent in terms of how they are prepared.  For example, depending on the chef/cook the Shanghai noodles might be spicy, or it might not be.  Order Beef and Broccoli and it might be Beef and Broccoli or it might be Beef and Broccoli with various sweet peppers, celery, carrots, and other veggies.  Beef Ho Fan (Rice Noodle, beef, green peppers, onions and black bean sauce) might be just that or with broccoli, carrots, celery and other veggies (do you see a pattern?).  Of course, if you order something simple dishes like Lemon Chicken or Cantonese Chow Mein, they get it right.  Therefore, I think it is reasonable to dock a couple of stars until the different chefs drop their \"I will cook how I want to cook\" and start preparing their dishes consistently.  When customers order their food, they expect it to be the same every time, and not some surprise variation every time they order."}
{"text":"This my #1 choice to order Chinese food great tasting food and fair prices..   I totally am in love with this place    very quick delivery too!"}
{"text":"I used to be a loyal and regular customer from this place. Cheap food and fast delivery service. Tonight's order will be my last one from this restaurant. It took them 80-85 minutes when they promised 45 minutes. The delivery guy didn't even apologized. They increased their prices but not the service. And I also found a hair in my noodles. With other food delivery companies out there, there's more option out there and we are going to start looking for a better Asian restaurant that can deliver fast food and proper service."}
{"text":"Waited nearly 2 hours for my food for delivery. The driver didn't apologize or anything. I already prepaid the order and included tip in the payment, I shouldn't have done that."}
{"text":"I drove by this restaurant and admit I thought it was going to be sketchy, but I read the positive reviews on Yelp and decided to go here because I didn't feel like going to the expensive buffet down the street.  I ordered the General Tsao's chicken, an egg roll and some steamed rice (not included). The General Tsao's Chicken was very delicious. The chicken is battered and fried in a light and crispy batter that held up to the sauce very well. The sauce was very flavorful with just the right amount of spice. I was an instant fan of this dish. The eggroll (not the spring roll) was filled with mostly bean sprouts. The wrapper was crispy, the inside was hot and savory. It wasn't quite what I was expecting at all. It wasn't bad, I think I just had my heart set on a spring roll.  It is a very small shop, but they do have about 6 or so tables you can sit at. It wasn't very speedy, and it definitely wasn't very fancy, but the food was good and in the end that's all I care about. I would return for sure next time I'm in the area."}
{"text":"I stopped for a late lunch here yesterday, and as always, left with a full stomach, and the knowledge I'd be back again soon.  This is touted as a takeout restaurant, and people definitely do seem to order quite a bit of takeout here, but there is seating for 24, and I've always eaten in. It's never so busy that you can't find a seat, but always busy enough that you know they're doing their job well. And no matter what, they always seem to be furiously preparing food, and I've never had to wait very long for my meal.  I had one of their combo meals. Chicken balls, chow mein, and fried rice, with an egg roll. All packed into overflowing into a styrofoam container (the egg roll was in a separate bag). Whether you eat in or take out, it's all packed the same. You just get a bag if you've ordered it to go.  So I sat at my table, and ate my lunch contentedly. Everything was piping hot. The chicken balls had a good amount of white meat chicken in them, their sweet and sour sauce is delicious, and most everything else was well cooked. The only thing I wasn't crazy about was the egg roll. Nothing particularly bad about it; it was just kind of bland and underwhelming.  All together though, this is a great place to get a well priced, large, fast, and great tasting meal, and I'm already looking forward to my next visit."}
{"text":"Been getting takeout from here since 1996. Love it. Yes, not \"really\" Chinese food, but oh so delicious. Yes, it's a little hit and miss - but after 20 years, what wouldn't be? Still a fantastic place to eat - recommend getting take out, not delivery - takes too long."}
{"text":"I work in the area and felt like Chinese food for lunch and this one was the closest. I called to place an order for pick up and it was ready 10 minutes later. I like to judge a Chinese food restaurant on a few main staple items. This includes General Tso's Chicken, Chicken Balls, Ginger Beef, Chili Chicken, and Lemon Chicken. For my first order I went with the first three and I was not disappointed. I also got an order of the Plain Lo Mein to go with all the meat. I won't be getting the ginger beef again, but I would order everything else. I will definitely be ordering from them again and trying some of their other dishes.  As I said I would order from them again and try some other things on their menu so I did and this time I went with Spicy Peanut Chicken, Special Spring Roll, Kimchi, and Wor Tip. I have to say the special spring rolls filled with pork were amazing. The Wor Tip dumplings were really big in size, but I found them to be more doughy than meaty. If you love peanut butter, the spicy peanut chicken is for you. There are lots of bits of peanuts and the sauce is very creamy.   What I have to start doing is asking for the dishes that are supposed to be hot & spicy to  actually be hot & spicy. So far none of the three dishes that are supposed to be came even remotely spicy."}
{"text":"China Gourmet have mostly westernized chinese food mixed with some authenic.  I order here when I have some craving for some deep fried food.  They have the Special combination plates.  You can pick from 4 choices - All are $5.95.  All comes with Egg roll, Chicken Chop Suey and Fried Rice - the 4 main you can choose from are Chicken Teriyaki Sticks, Sweet and sour Chicken Balls (my fave), Deep Fried chicken Wings and Diced beed and veggie.  Other notable is the Sinapore noodle, Chicken fried rice, Orange chicken, general Tsao's chicken and Young chow fried rice.  This place is fast and on the menu states there is no MSG but I am not too sure about that.  Overall if you want cheap, fast and westernized chinese food this place is for you."}
{"text":"The stir fried vegetables and the chow mien can stand up to the best kitchens in town."}
{"text":"Good price I only had the general Tso's chicken little more spicy than I was used to but really good taste I will go back to this place"}
{"text":"Cures my cravings for Chinese food.  Although sometimes inconsistent, it's still delicious. Hot and sour soup is always good.  Half of the time, their General Tso's chicken is the best I've ever had, the other half it's still abt 3 stars. I also enjoy the Szechuan chicken. As far as the specials go, I enjoyed combo #5 and a friend really liked the sweet and sour chicken balls. I just don't swing that way. But don't worry, I don't judge."}
{"text":"Just ordered here for the first time. Ordered King Pao chicken. Came to about $10 after tax. At first glance it looks like there isn't much chicken, but there actually is once you get chowin'. I personally don't like the onions or celery they put in it, so the first thing I did was pick it out. This left the chicken, rice, peppers, peanuts, and other veggies like broccoli and cauliflower. The sauce is tasty but not as flavourful as I was expecting.   The person working never tried to up-sell me anything extra such as spring rolls or a side of chicken balls, but I'm almost wishing she did just so I could pig out more and blame her.   If this were a school project, I would give them a solid 75%. Would have been an 80% if there weren't any onions or celery. I'll probably be back but might try something more flavourful."}
{"text":"Worst Ma-po tofu ever.  The sauce was the same sauce they used for Hunanan Beef...ugh. They just threw in some preserved soya beans and didn't even bother cutting up the tofu."}
{"text":"EDIT:  DO NOT EAT HERE!!!!!!! THIS IS THE LAST TIME. Went again for takeout this evening. MY CHICKEN WASN'T COOKED. I've posted photos of it. Got it home and I said, \"Gee, this chicken looks a little moist...\" I cut it open and sure enough, it wasn't cooked through; still pink on the inside. I just don't have it in me to give this place another try after everything I've been through. I was holding on for the cooks, but now they've let me down in a big way. I'm already trying to dodge H1N1 in this city; I don't need to be worrying about salmonella and E. coli as well........  ORIGINAL: The food quality is good, but the Asian lady at the cash register is SHADY. It's a shame that someone like that can ruin the reputation of a business when the cooks are working so hard. She often overcharges on the listed menu price of dishes ($7.50 instead of $6.75, etc) and adds other random charges to your bill. She seems like she must be an owner because she's at the register 90% of the time. Prices NEVER come out the same from one visit to another. Have stopped tipping for this reason. Today, she added an extra $1 to the bill. Got were fed up and requested a receipt. She wasn't happy about this, ripped it off the machine in anger, and handed it to me face-down, hoping I wouldn't see the extra charges. She is sooooooooo dirty. Just make sure you always check the total and call her out on her thievery!! Other than that crazy woman's shameful habit of stealing, the food usually tastes great."}
{"text":"This place is effing dumb & so are the people. 4 of us come, she took 10 minutes to look up and take the order from 3 of us.. BROUGHT THEIR FOOD.. And then decided to take the 4rth persona order. Um... The lady pays no attention whatsoever to whos paying and who shes giving the receipt to..   Flies flying around.   & here i am still waiting for my food..   Ok so the food has come and it is quite tasty and good portion.   The stars are just for the food. Rest is bull"}
{"text":"If you're craving some greasy Chinese takeout, it doesn't get any better than China Gourmet. They've got a massive menu, but I pretty much always order the Cantonese Chow Mein or Fresh Vegetable Lo Mein with Sweet and Sour Chicken Balls and spring rolls. For $20 and free delivery, you really can't beat the amount of food, more than enough for 2 people with leftovers. Everything is super yummy; veggies are fresh, the chicken actually looks and tastes like chicken, and you get a massive bowl of vibrant red sweet and sour sauce with your chicken balls. Sure, it may not be 'authentic' Chinese and it will probably kill you if you eat it too often, but it's a delicious treat. My favourite Chinese takeout in the city!"}
{"text":"DO NOT ORDER DELIVERY!  The food is ok (6/10) if you dine in. Pretty much the standard quality chinese food you would regularly get for that price. However, delivery is a nightmare. We waited 1.5 hours for our dinner to arrive. We called after an hour wait at which point we were told the driver had left and it would arrive \"any minute\". Twenty minutes later, our food had still not arrived and we called to cancel as it had been over an hour and if the driver had left when we called 20 min ago, our food was likely no longer hot. The person on the phone was a bit rude and then sent the driver to our place anyway. He showed up 10 minutes later (which made the total delivery time 1.5 hours). I was expecting that perhaps they would offer us the food for free or even discounted due to the long wait but nada. Terrible delivery service."}
{"text":"This is my go to place for Chinese fast food. There's nothing quite like it in the area. They are a little slow with delivery. So I always opt for takeout. I normally just call in 15 minutes ahead and it's usually right at the desk.   All the staff have been working there for a while. The business has been around for more than 20 years. Despite some of the chefs having an off day, they're usually very efficient.   I like that they always give out fortune cookies. I heard a man won the lottery with fortune cookie numbers  While I love authentic home cooked Chinese dishes, I indulge in Chinese fast food too. Sometimes it's cheaper to buy takeout than cook at home. China Gourmet will always have my business. #potatocouch #longwintermonths"}
{"text":"As I prepare to leave the Cabbagetown area, I want to upgrade my rating. This place has over time become more and more of a regular occurrence for me to the point where sometimes I get cravings for their food.   Standard staples of 4 star quality include: -General Tso Chicken -Singapore Noodles -Cashew Chicken -Chicken Soo Guy -Egg Rolls -Wor Tip  I'll miss you, China Gourmet.  Tonight, I will visit 1 last time to say my goodbyes. *single tear*"}
{"text":"Decent Chinese takeout. Not the best Chinese food I've had, but for the price that I'm paying and the amount of food that I'm getting I am more than pleased to order from them again. Delivery was super prompt and I have enough food to last me for the next three days.  I've tried their fried rice and white rice and I am not a fan of the rice, the rest of the food is okay, but the rice is not for me."}
{"text":"I like certain dishes when I go out for Chinese food (or order in), and those dishes are what I use to compare the different restaurants. While I can't speak for everyone's tastes, when I think of Chinese food I am thinking more meat and rice than the vegetable side of things. My partner and I were buying some cat food across the street and when we saw China Gourmet we were instantly in the mood for Chinese food.  On first entering we were actually surprised. We don't know how long the restaurant was in that location, but it was extremely clean and shiny unlike most Chinese restaurants visited. The windows, floors, counters, everything was just spotless which was rather inviting.  I ordered the standard General Tao's Chicken, Sweet & Sour Pork with Pineapple, beef fried rice, and some vegetable dish for my partner. As with most ethnic food restaurants it took a few minutes for the girl taking my order to get it right, but nothing more than usual. What was noticed was that there was not a smile from the girl, just a straight \"doing business as usual\" look on her face. The food was decent, but nothing spectacular. Even though cooked to order it still had the taste of a fast food chain like Manchu Wok instead of like a quality Chinese restaurant. Don't get me wrong, the food was good and at a good price, but I was expecting a little more in the way of spices and flavour to the food that fell short.  For good food on the go, I would say that they should not be passed by. But that being said, they would not be my first choice (or probably even in my top 10) Chinese food restaurants to order from when delivery is preferred."}
{"text":"Food is always great and prepared fast. Most of the time I just call and order to pickup and the food is always ready and waiting for me when I get there."}
{"text":"Hot and sour soup is among the best I've had, if a little too vinegary.  I've only ordered delivery, but have been blown away by the size of the portion. A $6 rice dish came in a standard 10-inch Styrofoam container, but packed to the roof!  Had to be careful when opening it, because there was so much, it poured out.  Very tasty dish with shrimp and pork.  The chili chicken was fantastic.  This is not top of the line Chinese food, but as far as I could tell, it was a great take on the old-fashioned, North American-style Chinese takeout.  I'd recommend this for anyone looking for some good, FAST (within 30mins) home delivery."}
{"text":"Had the chicken balls with rice and spring rolls. Not bad in terms of taste. Chicken wings were terrible. Nothing too special overall price is maybe a bit too high. Would eat here again but not for a long time."}
{"text":"I've eaten there twice over the past two months.  Their prices are very fair and portions are large.  Their service is also quick.  They do offer delivery but I've never tried them."}
{"text":"Great Chinese food. Everything is made to order, large portions and tasty. Gets busy at lunch and dinner, so expect a wait.  Had the Szechuan Meat Noodles. A bit spicy and comes with lots of perfectly cooked veggies.   The wonton soup is amazing. Always served piping hot. Lots of vegetables and wontons. Includes slices of pork and the broth is amazing.  Overall, you can't go wrong here."}
{"text":"YES, I want me some take out chinese.  I was actually walking to another restaurant that was closed on Tuesdays so I was already bummed and was starving.  Once you walk in you can see large pictures of their menu.  (I think all places should have real pictures of their food.)  This is comfort food that has the right amount of grease (which did not seem old) and not too salty.  Had the Beef Chow Fun and once I ordered it the cashier barked out the order in cantonese to old school short order cooks in their greased up whites, I knew this place could be for real.  Especially since I am from Texas and everything there is made by our amigos...  My order took less than 5 minutes - as it should with a hotass wok.    I will be back."}
{"text":"Cantonese Chow Mein had so much salt/MSG I could only eat a few bites.    The $6 Crispy Fried Pork WonTons were a joke, as they had no pork in them."}
{"text":"I read somewhere else on here that Western, or (trick the western) Chinese food is great if that's what you're after AND it's done right. China Gourmet does it right.  We ordered 6 dishes and were told 50 - 60 minutes delivery.  It arrived in less then 30.  All the dishes were very hot and completely as advertised.  Of particular note, Stir Fried mixed Veg & Cashews. The Cashews were still crunchy as were the Veggies. All but the two Chop Suey dishes arrived in aluminium containers large enough that the entire 6 dish order allowed the two of us to not have to cook for 3 nights. We also had the Cantonese Chow Mein.  A bed of soft noodles loaded up on top with Shrimps, Chicken, Beef, BBQ Pork and fresh Veggies. Perhaps the best of our 6 dishes. extremely fresh and tasty. Two Chop Suey dishes were still crisp and fresh, one with tender beef and the other with tasty Chicken breast slices. Chop Suey dishes can steam in the container during travel time making the Sprouts wilt. This was not the case here. Veggies are crisp and fresh, BBQ Pork is not hard or dry but tender and juicy. None of the food seemed greasy either. They try hard to please a variety of tastes that include Mandarin, Szechuan, even Thai and a small Japanese list as well as the ubiquitous \"Combo Dinners\". A Chinese waiter once told us that every Chinese restaurant has a \"Special\" Fried Rice, and China Gourmet is no different. Their \"Special\" Fried Rice arrives in a Styrofoam container, (that was squished the last time), but still full to busting with what appeared to be pieces of everything imaginable from the kitchen mixed with the rice.  Container not withstanding, a mouth watering delight. In general, I'd say great Western Chinese, (although I found mini Boc Choi, Chinese Mushroom, Baby corn and Water Chestnuts among the Veggies). If Western Chinese is what you're jonezing for, I highly recommend China Gourmet. No MSG, large portions and it arrives fresh from the Wok.  Our order cost a measly $51.58 + tip, (for 3 meals each). Order by number as they are take out only and the kitchen noise is loud.  They are open till 2AM on Fridays & Saturdays, (bonus), 12AM Monday -Thursday, 11:30 Sundays. So when it's late and you are craving something quick, hot and tasty, give China Gourmet a try!"}
{"text":"Wow, I'm impressed. Just ordered from here for the first time and the food is AMAZING. I got delivery and they arrived in about 30 minutes which was nice. I ordered the spring rolls, cashew chicken, beef and broccoli and fried rice (don't judge me, I like having leftovers). The cashew chicken is most likely the best I've ever had and the rest is also phenomenal.  All that came out to around $35 including delivery fee and tipping the driver, so I thought that was pretty good. On top of that the portions are massive, I will never go hungry again.  Awesome place, will definitely order from here again!"}
{"text":"This was a surprising find for a non-resident of the city.  It is located in an unremarkable strip mall with other ethnic restaurants so all I was expecting was a quick Chinese meal to satisfy my hunger.  After that first bite, I was hooked! I went at least two more times during my short 3-day business trip to the area.  The main business (as the name implies) is take out and delivery. There is a small dining area should you decide to eat there.  The food is made fresh each time you order so it is not just sitting in a heated container or buffet for hours.  The meat and vegetables used are high quality so the final product is excellent.  The prices are excellent as well.  I would gladly pay more even if they increase their prices.  I highly recommend the Orange Chicken and Singapore Rice Noodles.  I recommend this place without any reservations.  You can't beat freshly made food!"}
{"text":"Mostly good to very good Chinese. Pay cash and you get 10% off. Good szchewan beef and Cantonese chow mein. Good value for the $$s."}
{"text":"Not one to complain, but I received horrible customer service. My fiancé and I ordered delivery they brought over steamed veg instead of veg fried rice, which we double verified. We called to tell them and After waiting another 45-60 mins we got the order of rice except this time is was beef and chicken rice. I'm vegetarian. Don't know how this happened again. When I called to let them know (not because I wanted the veg rice delivered but just to make them aware of the second mistake) she said \"well I'm not changing it\". Not a sorry, nothing. Horrible customer service and rude. Considering I didn't get a simple sorry or they didn't offer a credit since now I have to throw out this rice and make myself food. The only option is to put my experience here."}
