{"text":"I've lived in Scarborough for 11 years now and I've rarely ventured around the area. More recently I've been wanting to try places that are fairly close to my place, and Choice Fish & Chips is just a 15 minute walk up the street. From the outside of the store, this seems like a sketchy hole-in-the-wall restaurant. The small strip plaza it's located in has lots of random stores and restaurants of many different ethnicities. As you step into the restaurant, it doesn't seem any better. The interior decorations are close to none and the tables make it seem as if it was just random furniture found on the street.   As we've all heard, you should never judge a book by its cover.   The staff at Choice Fish & Chips is quite friendly, they greet you with a smile as you walk in. The menu is simple and the prices are fair. I've tried a few things at Choice. I've had their halibut fish & chips, haddock fish & chips as well as their poutine. I've also had some sides they offer, such as the onion rings and their Greek salad.  The halibut it fantastic, the batter is very light and not heavily greasy. I really enjoy the batter they use for the fish, they also use the same batter for their onion rings which they give you when you order the fish, which is a nice touch. The fish itself is flaky and doesn't have a fishy smell. They cooked the fish perfectly and it was a great pleasure to have.   The haddock on the other hand, wasn't as pleasant of an experience. I had the haddock on a different occasion than the halibut (so it might just be an off day) but the fish seemed to be heavily battered and it left a greasy film in my mouth. However, I did get a Greek salad this day and I think that really saved the meal. The salad was nothing special but it did balance the grease from the haddock.  The gravy they use on their poutine is light gravy which has a good flavour with it yet not overly overpowering. The cheese they use for their poutine is just shredded mozzarella, a huge disappointment. The real star for their poutine is their fries. However, I found that even the fries are a bit lackluster.   Going to this joint for lunch on a weekday is a mistake, it gets riddled with high school students. However, I think the food here is worth it. For a cheap greasy deep-fried halibut craving, it really hits the spot."}
{"text":"Greatest poutine I have ever taste. This restaurant  is existing since I was born."}
{"text":"Food is good as always... the only problem is the place... not that neat or what you can also say, not that nicely decorated restaurant... Lunch hour would b so busy because of the jean vanier students"}
{"text":"I've noticed that their portion sizes have gotten a lot smaller than what it used to be! The boxes are still the same but I've gotten less fries each and every time I go. Like I'm not fat or obese, why take some away from me? Lol.  But other than that... They still serve the best poutine for the best price in Scarborough. I've been going here since high school, so 6 years. The taste and service is still the same."}
{"text":"Location is closed and is turning into Panda Restaurant.  Chinese, Filipino, India Style"}
